{
  "id": "f63dSmYBTlTomsSBTqzD",
  "document": {
    "title": "Tabieros v. Clark Equipment Co.",
    "full_title": "SOSIMO B. TABIEROS AND MITSUKO H. WILSON /CROSS-APPELLANTS, v. CLARK EQUIPMENT COMPANY /CROSS-APPELLEE, AND MATSON NAVIGATION CO., INC.; JOHN DOES 1-10; JANE DOES 1-10; DOE CORPORATIONS 1-10; AND DOE ENTITIES 1-10",
    "jurisdiction": "Hawaii Supreme Court",
    "date": "1997-09-15T00:00:00.000Z",
    "docket": "NO. 17339",
    "body": "OPINION OF THE COURT BY LEVINSON, J.\n\nThis is an appeal and cross-appeal from the special verdict of the jury and the judgment of the circuit court by the defendant-appellant/cross-appellee, Clark Equipment Company (hereinafter, Clark) and the plaintiffs-appellees/cross-appellants, Sosimo B. Tabieros and Mitsuko Wilson (hereinafter, Tabieros and Wilson individually and \"the plaintiffs\" collectively). These appeals arise out of a lawsuit alleging, inter alia, strict product liability and negligent design following injuries sustained by Tabieros when he was struck by a large piece of mobile equipment, a straddle carrier\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e manufactured by Clark, while he worked at the Sand Island dockyard in the City and County of Honolulu. The jury found Clark liable for Tabieros's injuries under theories of strict product liability and negligent design. The circuit court granted Clark's motion for a directed verdict as to Wilson's\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e claims for infliction of emotional distress prior to the jury's deliberations. The jury found Clark not liable for any damages to Wilson on her remaining claims.\n\nClark raises seventeen points of error on appeal, each of which falls into one of four general categories. In particular, Clark contends that the trial court erred: (1) with respect to the substance of four of its jury instructions; (2) by allowing, restricting, or excluding the use of certain evidentiary exhibits; (3) by allowing, restricting, or excluding expert testimony; and (4) by failing to give Clark sufficient credit for Matson Navigation, Inc.'s (hereinafter, \"Navigation\") prejudgment settlement with the plaintiffs.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe plaintiffs indicate that they are generally satisfied with the judgment from which Clark is taking its appeal, but allege on cross-appeal that the circuit court erroneously (1) failed to award them prejudgment interest, (2) denied certain costs, which they claim were properly taxable, and (3) denied their motion for additur regarding punitive damages, or, in the alternative, for a new trial on punitive damages.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The plaintiffs raise several other points of error, which we address in the event of a retrial on remand. In particular, the plaintiffs argue that the circuit court erred in directing verdicts regarding their claims that Clark negligently (4) failed to retrofit the straddle carrier and (5) inflicted emotional distress on Wilson. They also contend that (6) certain evidence, which Clark argues was improperly admitted in the first place, was actually unduly restricted in its use.\n\nFor the reasons discussed below, we hold that a manufacturer has no duty to \"retrofit\" its products with \"after-manufacture\" safety equipment, although it may be found negligent or strictly liable for failing to install such equipment -- or not otherwise making its product safer -- existing at the time of manufacture. We further hold that the circuit court's jury instructions were inadequate or misleading with respect to (1) a manufacturer's duty to warn against \"open and obvious defects and dangers\" and (2) the legal significance of a potential jury finding that the plaintiffs failed reasonably to mitigate damages. Accordingly, although we affirm the portion of the judgment entered in Clark's favor and against Wilson, we vacate the remainder of the judgment and remand the matter for a new trial of Tabieros's claims against Clark.\n\nI. BACKGROUND\n\nOn April 27, 1988, while working on the loading docks at Pier 52 in the City and County of Honolulu, Tabieros, an employee of Matson Terminals, Inc. (Terminals),\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e was sitting in a jitney parked on the dockside apron of the Sand Island container yard. He was seriously injured when a Series 510 straddle carrier struck his vehicle, crushing both of his legs.\n\nClark manufactured the straddle carrier and sold it to Navigation in 1963. The Series 510 straddle carrier was specifically manufactured for, and in part designed by, Navigation, although Clark continued to produce this model for other customers, in addition to Navigation, until 1968. Thereafter, Clark discontinued the manufacture of the Series 510, but replaced it with larger and differently configured straddle carriers that it produced for specialized customers. In approximately 1975, fourteen years before Tabieros's accident, Clark sold its straddle carrier manufacturing business.\n\nNavigation owned and maintained the straddle carrier involved in Tabieros's accident until it was transferred to Terminals in 1973, approximately ten years after it was manufactured and fifteen years before the accident. On the day of the accident, the straddle carrier was driven by Howard Dias, who was on loan to Terminals from his employer, MaCabe, Hamilton \u0026 Renney Co. (MH\u0026R).\n\nIn September 1988, the plaintiffs filed a negligence action against Dias, MH\u0026R, and Navigation for injuries sustained in the April 27, 1988 accident. The plaintiffs later amended their complaint to add Clark as a defendant. The circuit court entered summary judgment in favor of Dias and Navigation and later dismissed the plaintiffs' claims against MH\u0026R. In June 1990, a jury returned a verdict in favor of Clark, which was the only remaining defendant. The plaintiffs appealed, and, in a memorandum opinion, this court: (1) vacated the judgments that had been entered in favor of Navigation and Clark; and (2) affirmed the favorable judgments as to Dias and MH\u0026R. Tabieros v. Diaz, Nos. 14798 \u0026 15014 (Haw. Mar. 27, 1992) (mem.) [hereinafter, Tabieros I ].\n\nIn March 1993, a second jury trial commenced between the plaintiffs and the defendants Clark and Navigation. During the trial, the circuit court granted directed verdicts in favor of Clark on the plaintiffs' claims of breach of implied warranties of merchantability and/or fitness for a particular purpose, negligent manufacture, and negligent failure to retrofit. It also dismissed Wilson's claim of negligent infliction of emotional distress.\n\nThe jury ultimately returned a special verdict in favor of Tabieros, awarding him $698,000.00 in general damages, $501,000.00 in special damages, and $152,000.00 in punitive damages (with respect to the latter, $52,000.00 against Clark and $100,000.00 against Navigation). As among the parties, the jury apportioned fifty-five percent of the fault to Navigation, thirty-four percent to Clark, and eleven percent to Tabieros. The jury awarded no damages to Wilson.\n\nAfter the verdict was returned, but before entry of judgment, the plaintiffs settled with Navigation by way of a joint tortfeasor release agreement pursuant to the Uniform Contribution Among Tortfeasors Act (UCATA), Hawai'i Revised Statutes (HRS) §§ 663-11 through 663-17 (1993). Thereafter, the plaintiffs filed a dismissal of all of their claims against Navigation. Judgment against Clark was entered on July 9, 1993 for its pro rata share of the jury's award. The circuit court denied Clark's motion for a reduction of the judgment in the amount paid by Navigation to the plaintiffs pursuant to the joint tortfeasor release agreement.\n\nClark timely appealed to this court, followed shortly thereafter by the plaintiffs' timely cross-appeal.\n\nII. STANDARDS OF REVIEW\n\nA. Trial Court's Application Of The Law\n\n\"Pursuant to the right/wrong standard, a Conclusion of law is not binding upon the appellate court and is freely reviewable for its correctness.\" State v. Soto, 84 Haw. 229, 236, 933 P.2d 66, 73 (1997) (citations omitted). See also In re Jane Doe, Born on May 22, 1976, 84 Haw. 41, 46, 928 P.2d 883, 888 (1996); Hirono v. Peabody, 81 Haw. 230, 232, 915 P.2d 704, 706 (1996); Zemis v. SCI Contractors, Inc./E.E. Black, Inc., 80 Haw. 442, 445, 911 P.2d 77, 80 (1996).\n\nB. Directed Verdict\n\nWhen we review the granting of a directed verdict, we apply the same standard as the trial court. Lussier v. Mau-Van Dev., Inc., 4 Haw. App. 359, 372, 667 P.2d 804, 815 (1983).\n\n[A] directed verdict may be granted only when after disregarding conflicting evidence, giving to the [non-moving party's] evidence all the value to which it is legally entitled, and indulging every legitimate inference which may be drawn from the evidence in [the non-moving party's] favor, it can be said that there is no evidence to support a jury verdict in his [or her] favor.\n\nWakabayashi v. Hertz Rental Corp., 66 Haw. 265, 271, 660 P.2d 1309, 1313 (1983) (quoting Stewart v. Budget Rent-A-Car Corp., 52 Haw. 71, 77, 470 P.2d 240, 244 (1970) (citations omitted)).\n\nWeinberg v. Mauch, 78 Haw. 40, 49-50, 890 P.2d 277, 286-87, reconsideration denied, 78 Haw. 421, 895 P.2d 172 (1995) (brackets in original). See also Takayama v. Kaiser Found. Hosp., 82 Haw. 486, 495, 923 P.2d 903, 912 (1996); Carr v. Strode, 79 Haw. 475, 486, 904 P.2d 489, 500 (1995).\n\nC. Jury Instructions\n\nWhen jury instructions or the omission thereof are at issue on appeal, the standard of review is whether, when read and considered as a whole, the instructions given are prejudicially insufficient, erroneous, inconsistent, or misleading.\n\nErroneous instructions are presumptively harmful and are a ground for reversal unless it affirmatively appears from the record as a whole that the error was not prejudicial.\n\nState v. Arceo, 84 Haw. 1, 11, 928 P.2d 843, 853 (1996) (citations, internal quotation marks, and brackets omitted). See also Craft v. Peebles, 78 Haw. 287, 302, 893 P.2d 138, 153 (1995); Montalvo v. Lapez, 77 Haw. 282, 286, 884 P.2d 345, 349 (\"'Jury instructions . . . must be considered as a whole. Moreover, a refusal to give an instruction that correctly states the law is not error if another expressing a substantially similar principle is given.'\" (Quoting State v. Pioneer Mill Co., Ltd., 64 Haw. 168, 180, 637 P.2d 1131, 1140 (1981))), reconsideration denied, 77 Haw. 489, 889 P.2d 66 (1994) (ellipsis points in original).\n\nD. Evidentiary Rulings\n\nDifferent standards of review must be applied to trial court decisions regarding the admissibility of evidence, depending on the requirements of the particular rule of evidence at issue. When application of a particular evidentiary rule can yield only one correct result, the proper standard for appellate review is the right/wrong standard.\n\nKealoha v. County of Hawaii, 74 Haw. 308, 319, 844 P.2d 670, 676, reconsideration denied, 74 Haw. 650, 847 P.2d 263 (1993). Where the evidentiary ruling at issue concerns admissibility based upon relevance, under [ Hawai'i Rules of Evidence (HRE)] Rules 401 and 402, the proper standard of appellate review is the right/wrong standard. See State v. Toro, 77 Haw. 340, 347, 884 P.2d 403, 410 (Haw. Ct. App.), cert. denied, 77 Haw. 489, 889 P.2d 66 (1994).\n\nState v. Kupihea, 80 Haw. 307, 314, 909 P.2d 1122, 1129, (1996) (some brackets in original and some added). \"Evidentiary decisions based on HRE Rule 403, which require a 'judgment call' on the part of the trial court, are reviewed for an abuse of discretion.\" Walsh v. Chan, 80 Haw. 212, 215, 908 P.2d 1198, 1201, (1995) (citing Sato v. Tawata, 79 Haw. 14, 19, 897 P.2d 941, 946 (1995)). . . . \"'The trial court abuses its discretion when it clearly exceeds the bounds of reason or disregards rules or principles of law or practice to the substantial detriment of a party litigant.'\" State v. Ganal, 81 Haw. 358, 373, 917 P.2d 370, 385 (1996) (quoting State v. Furutani, 76 Haw. 172, 179, 873 P.2d 51, 58 (1994)).\n\nArceo, 84 Haw. at 11, 928 P.2d at 853.\n\nE. Qualifications And Testimony Of Expert Witnesses\n\nQuoting Larsen v. State Sav. \u0026 Loan Ass'n, 64 Haw. 302, 304, 640 P.2d 286, 288 (1982), we noted in State v. Toyomura 80 Haw. 8, 26 n.19, 904 P.2d 893, 911 n.19 (1995), that\n\nit is not necessary that the expert witness have the highest possible qualifications to testify about a particular matter,... but the expert witness must have such skill, knowledge, or experience in the field in question as to make it appear that his opinion or inference-drawing would probably aid the trier of fact in arriving at the truth. . . . Once the basic requisite qualifications are established, the extent of an expert's knowledge of the subject matter goes to the weight rather than the admissibility of the testimony.\n\nState v. Wallace, 80 Haw. 382, 419 n.37, 910 P.2d 695, 732 n.37 (1996) (brackets and ellipsis points in original) (emphases omitted). \"'Whether expert testimony should be admitted at trial rests within the sound discretion of the trial court and will not be overturned unless there is a clear abuse of discretion.'\" Id. at 406, 910 P.2d at 719 (quoting State v. Maelega, 80 Haw. 172, 180, 907 P.2d 758, 766 (1995)); State v. Samonte, 83 Haw. 507, 532-34, 928 P.2d 1, 26-28 (1996). \"Nevertheless, to be admissible, 'expert testimony must be both relevant and reliable.'\" Wallace, 80 Haw. at 407, 910 P.2d at 720 (quoting Maelega, 80 Haw. at 181, 907 P.2d at 767); see also Samonte, 83 Haw. at 533, 928 P.2d at 27.\n\nIII. Discussion\n\nA. Duty To Retrofit\n\nWe begin our analysis with the plaintiffs' contention that Clark was subject to a duty to retrofit the Series 510 straddle carrier with equipment that would have rendered it safer. In this connection, the plaintiffs contend that the circuit court erred in granting Clark's motion for a directed verdict on their claim of negligent failure to retrofit. On the other hand, Clark maintains that the circuit court did not do enough to purge the issue of a supposed duty to retrofit from the trial. Clark alleges that the circuit court erred when it allowed the plaintiffs' expert witnesses -- Howard Josephs and Roger W. Sackett -- to testify that Clark owed a duty to retrofit and had breached that duty.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The plaintiffs respond that the expert testimony (1) was necessary to establish that a duty to retrofit should be recognized under Hawai'i law and (2) was otherwise relevant, and therefore admissible, to prove (a) notice of defect, (b) entitlement to punitive damages, and (c) \"whether Clark could have, and should have, solved the problem at the outset rather than waiting to solve it by a retrofit campaign.\" The plaintiffs also suggest that, insofar as the circuit court (having already directed a verdict in Clark's favor with respect to that particular claim for relief) did not instruct the jury regarding Clark's alleged negligent failure to retrofit,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Josephs and Sackett's testimony could not have prejudiced Clark.\n\nOn appeal, the plaintiffs advance three theories under which Clark allegedly owed a duty to retrofit the straddle carrier for the purpose of making it safer. First, they argue that Tabieros I, being the \"law of this case,\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e \"implied\" a duty to retrofit. Second, they claim that general negligence principles support the existence of the duty. And third, they contend that, even if Clark did not owe a duty to retrofit the Series 510 straddle carrier in the first instance, it nevertheless assumed the duty by virtue of its own conduct. We now address each theory seriatim.\n\n1. Law of the case\n\nThe plaintiffs' first contention that Tabieros I, as a matter of the law of the case, \"implied\" a duty on Clark's part to retrofit the straddle carrier is palpably mistaken. Their argument relies exclusively on three paragraphs of Tabieros I, taken out of context, which described the evidence adduced at the first trial foundationally to this court's holding that the trial court erred in directing a verdict in Clark's favor with respect to the plaintiffs' claim for punitive damages.\n\nOn the basis of the evidence described therein, we determined that \"the jury could have inferred that Clark, at the time of manufacturing the Series 510 straddle carrier, had reservations about the design and safety of the straddle carrier but sold the carrier regardless of the danger created by the blind zone.\" Tabieros I at 22 (emphasis added). Accordingly, we held in Tabieros I that the plaintiffs had \"clearly . . . produced the requisite level of evidence needed to overcome Clark's motion for a directed verdict on the issue of punitive damages.\" Id. In other words, we held in substance that, giving to the plaintiffs' evidence all the value to which it was legitimately entitled and indulging every legitimate inference that could be drawn in their favor, it could not be said that there was no evidence to support a punitive damages verdict. See Weinberg, 78 Haw. at 49-50, 890 P.2d at 286-87. Specifically, with respect to Clark's state of mind as it related to potential liability for punitive damages, we held that the evidence -- including, inter alia, that pertaining to Clark's failure to retrofit the straddle carrier -- could have led the jury to conclude that there was a \"positive element of conscious wrongdoing\" on Clark's part, or that Clark had \"acted wantonly or oppressively or with such malice as implies a spirit of mischief or criminal indifference to civil obligations, or that there . . . [was] some willful misconduct or such an entire want of care [as] would raise the presumption of a conscious indifference to the consequences.\" Tabieros I at 22-23 (quoting Masaki v. General Motors Corp., 71 Haw. 1, 16-17, 780 P.2d 566, 575, reconsideration denied, 71 Haw. 664, 833 P.2d 899 (1989)).\n\nNevertheless, the mere fact, in and of itself, that evidence of Clark's conduct by commission and omission -- over time -- could have supported a verdict awarding punitive damages in the first trial did not \"imply\" that Clark was subject to a duty to retrofit the Series 510 straddle carrier. In this respect, the plaintiffs simply misapprehend the relevant holding of Tabieros I.\n\n2. Legal duty to retrofit\n\nThe plaintiffs' second contention is that \"well-settled and basic principles of negligence\" should lead this court ineluctably to impose upon the manufacturer of a hazardous product a continuing and open-ended duty -- heretofore unrecognized in this jurisdiction -- to retrofit its product with such safety devices as it might develop after the product has been manufactured and sold.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e For the reasons discussed below, we are not so led.\n\nThis court has long adhered to\n\nthe basic principle that a negligence action lies only where there is a duty owed by the defendant to the plaintiff. Bidar v. Amfac, Inc., 66 Haw. 547, 551, 669 P.2d 154, 158 (1983) (citations omitted). See also Johnston v. KFC Nat'l Management Co., 71 Haw. 229, 232, 788 P.2d 159, 161 (1990) (\"A necessary element in a negligence action is a duty, or obligation, recognized by the law, requiring the actor to conform to a certain standard of conduct for the protection of others against unreasonable risks.\") (quoting Ono v. Applegate, 62 Haw. 131, 137, 612 P.2d 533, 538 (1980) (internal quotation marks and brackets omitted)). The existence of a duty, that is, whether such a relation exists between the parties that the community will impose a legal obligation upon one for the benefit of the other -- or, more simply, whether the interest of a plaintiff who has suffered invasion is entitled to legal protection at the expense of a defendant -- is entirely a question of law. Bidar, 66 Haw. at 552, 669 P.2d at 158 (citing W. Prosser, Handbook of the Law of Torts § 37, at 206 (4th ed. 1971)).\n\nBirmingham v. Fodor's Travel Publications, Inc., 73 Haw. 359, 366, 833 P.2d 70, 74-75 (1992). See also Hao v. Campbell Estate, 76 Haw. 77, 80, 869 P.2d 216, 219 (1994); Doe v. Grosvenor Properties (Hawaii) Ltd., 73 Haw. 158, 162, 829 P.2d 512, 514-15 (1992). Thus, In Johnston, 71 Haw. at 232-33, 788 P.2d at 161, we noted that:\n\n\"'as our ideas of human relations change[,] the law as to duties changes with them. . . . Changing social conditions lead constantly to the recognition of new duties.' W.P. Keeton, Prosser \u0026 Keeton on The Law of Torts § 53, at 359 (5th ed. 1984). This court, however, is reluctant to impose a new duty upon members of our society without any logical, sound, and compelling reasons taking into consideration the social and human relationships of our society.\"\n\nLee v. Corregedore, 83 Haw. 154, 178, 925 P.2d 324, 348 (1996) (Levinson, J., Dissenting) (ellipsis points in original) (some brackets in original and some deleted) (emphasis added).\n\nThis court has stated in the past that the construct of \"duty,\" within the context of negligence principles, is \"only an expression of the sum total of those considerations of policy which lead the law to say that the particular plaintiff is entitled to protection.\" Cootey v. Sun Inv., Inc., 68 Haw. 480, 484, 718 P.2d 1086, 1090 (1986). The determination as to \"whether a duty exists,\" for purposes of such negligence analysis, therefore entails \"a question of fairness that involves a weighing of the nature of the risk [to which the novel duty relates], the magnitude of the burden of guarding against the risk, and the public interest in the proposed solution.\" Hao, 76 Haw. at 80, 869 P.2d at 219 (citations and internal quotation marks omitted) (emphasis added).\n\nAccordingly, the \"risk/burden\" calculus described above obliges us to assess, among other things, whether there are any logical, sound, and compelling reasons for -- as well as any public interests in -- the plaintiffs' proposed duty to retrofit. This assessment necessarily includes a consideration of the extent and sufficiency of the duties to which manufacturers of potentially hazardous or otherwise dangerous products are already \"burdened\" with possible liability for the purpose of according a \"solution\" to the risks attendant to their use.\n\nIn this connection, we note that the proposition that the Series 510 straddle carrier was \"defective\" in some respect lies at the heart of all of the plaintiffs' claims for relief against Clark. \"A product may be defective under any one of three general theories: defective manufacture[;] defective design[;] or insufficient warning.\" Wagatsuma v. Patch, 10 Haw. App. 547, 564, 879 P.2d 572, 583, cert. denied, 77 Haw. 373, 884 P.2d 1149 (1994) (citation and internal quotation marks omitted).\n\nUnder Hawai'i law, \"plaintiffs in design defect cases may proceed on both a theory of negligence for negligent design and a theory of strict liability in tort for defective design.\" Ontai v. Straub Clinic and Hosp., Inc., 66 Haw. 237, 247, 659 P.2d 734, 742 (1983) (citing Brown v. Clark Equip. Co., 62 Haw. 530, 618 P.2d 267, 62 Haw. 689 (affirming wrongful death and personal injury judgment against manufacturer of shovel loader that lacked outboard rear view mirror, thereby creating \"blind spot\"), reconsideration denied, 62 Haw. 689, 618 P.2d 267 (1980)) (emphases added); see also Wagatsuma, 10 Haw. App. at 563, 879 P.2d at 582 (\"A party who asserts that his or her injuries were caused by a defective product may proceed against the alleged tortfeasor under principles of negligence and/or strict liability.\" (Citations omitted.)).\n\n\"The plaintiff's burden in a negligent design claim is to prove that the manufacturer was negligent in not taking reasonable measures in designing its product to protect against a foreseeable risk of injury and the manufacturer's negligence was a [legal] cause of the plaintiff's injury.\" Wagatsuma, 10 Haw. App. at 565, 879 P.2d at 583 (citing, inter alia, Ono, supra).\n\nWith respect to a claim of strict product liability, \"the plaintiff's burden . . . is to prove (1) a defect in the product which rendered it unreasonably dangerous for its intended or reasonably foreseeable use; and (2) a causal connection between the defect and [the] plaintiff's injuries.\" Id. at 566, 879 P.2d at 583-84 (citing Ontai, 66 Haw. at 243, 659 P.2d at 740).\n\nPursuant to either theory, it is \"the legal duty of manufacturers . . . to exercise reasonable care in the design and incorporation of safety features to protect against foreseeable dangers[.]\" Ontai, 66 Haw. at 247, 659 P.2d at 742 (citations omitted). Accordingly, \"the failure of [a] manufacturer to equip its product with a safety device may constitute a design defect.\" Id. at 243, 659 P.2d at 740; see also Wagatsuma, 10 Haw. App. at 564, 879 P.2d at 583 (citing Ontai). For purposes of establishing negligence liability, \"a manufacturer must give appropriate warning\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e of any known dangers\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e which the user of its product would not ordinarily discover.\" Ontai, 66 Haw. at 248, 659 P.2d at 743 (citation omitted). However,\n\n\" The obviousness of the danger, unless it justifies the Conclusion that the condition is not unreasonably dangerous, has been held not to preclude liability on the part of a manufacturer who negligently designs a machine. . . . The creation of any unreasonable danger is enough to establish negligence, even though the danger is obvious. And it is ordinarily a question for the jury as to whether or not a failure to install a safety device creates an unreasonable risk.\n\nWagatsuma, 10 Haw. App. at 570, 879 P.2d at 585 (quoting Brown, 62 Haw. at 539-40, 618 P.2d at 273 (citations omitted)) (emphasis in original).\n\nGiven the foregoing menu of legally recognized duties or obligations -- \"requiring the actor to conform to a certain standard of conduct for the protection of others against unreasonable risks,\" see Birmingham, 73 Haw. at 366, 833 P.2d at 74 (citation omitted) -- to which manufacturers are already subject, we do not believe that there are sufficiently \"logical, sound, and compelling reasons,\" see Johnston, 71 Haw. at 232, 788 P.2d at 161, to justify a \"public interest,\" see Hao, 76 Hawai'i at 80, 869 P.2d at 219, in the plaintiffs' proposed duty to retrofit. In other words, we perceive no reason to impose a duty upon manufacturers, independent of those enumerated above, to retrofit products because established legal duties already afford adequate protection and redress to potentially injured plaintiffs.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIt appears that virtually every court that has confronted the issue head-on has reached the same Conclusion. For example, in Gregory v. Cincinnati Inc., 450 Mich. 1, 538 N.W.2d 325 (Mich. 1995), an injured worker brought a product liability action against the manufacturer and supplier of an allegedly defective brake press that crushed his thumb when he accidentally depressed the operating pedal. The circuit court entered judgment for the plaintiff worker, and the defendant manufacturer and supplier appealed. The court of appeals reversed, and the plaintiff took a further appeal to the Michigan Supreme Court. Affirming the decision of the court of appeals that the matter should be remanded to the circuit court for a new trial, the Michigan high court ruled as follows:\n\nAt issue in this case is the propriety of a continuing duty to repair or recall theory of products liability in a negligent design case. The inquiry is whether Michigan law recognizes a continuing duty to repair or recall . . . . We hold that there is no continuing duty to repair or recall . . . a product.\n\nIn Michigan, there are two theories that will support a finding of negligent design. The first theory is based on a failure to warn. This theory renders the product defective even if the design chosen does not render the product defective. This warning includes the duty to warn about dangers regarding the intended uses of the product, as well as foreseeable misuses. If, however, the manufacturer is not aware of the defect until after manufacture or sale, it has a duty to warn upon learning of the defect; if there exists a point-of-manufacture duty to warn, a post manufacture duty to warn necessarily continues upon learning of the defect.\n\nThe other, more traditional means of proving negligent design questions whether the design chosen renders the product defective, i.e., whether a risk-utility analysis favored an available safer alternative. In such a complaint, the focus of any duty begins with whether the product was defective when it left the manufacturer's control.\n\nBecause a prima facie case is established once the risk-utility test is proven, we are persuaded that it is unnecessary and unwise to impose or introduce an additional duty to retrofit or recall a product. Focusing on postmanufacture conduct in a negligent design case improperly shifts the focus from point-of-manufacture conduct and considers postmanufacture conduct and technology that accordingly has the potential to taint a jury's verdict regarding a defect.\n\nId. 538 N.W.2d at 326, 328-29, 333-34 (citations and footnotes omitted) (emphasis added).\n\nSimilarly, in Habecker v. Copperloy Corp., 893 F.2d 49 (3d Cir. 1990), the widow and child of a forklift operator, who was crushed to death when the forklift he was backing off a ramp overturned and fell on top of him, brought a product liability action -- based, inter alia, on theories of strict liability and negligence -- against, inter alia, Clark Equipment Company, the manufacturer of the forklift. The forklift had not been designed with (and did not contain) any operator restraints, such as seat belts. Accordingly, the plaintiffs \"alleged that the forklift was defective because . . . it had no operator restraints (seat belts).\" Id. at 50. At trial, the jury returned a defense verdict in Clark's favor on the seat belt issue.\n\nOn appeal, the Habecker court reversed the verdict and remanded for a new trial on the operator restraints issue on the basis that the district court had erred in refusing to allow the plaintiffs to adduce the testimony of an expert witness regarding \"the causal relation between the lack of operator restraints and operator injury.\" Id. at 51. The following analysis is especially pertinent to the issue before us:\n\nThe plaintiffs . . . contend that the district court erred . . . by eliminating the issue of retrofitting the forklift with a seat belt.\n\nId. 893 F.2d at 53-54 (footnote omitted).\n\nSee also Burke v. Deere \u0026 Co., 6 F.3d 497, 503, 509-10 (8th Cir. 1993) (\"In a case alleging negligent failure to warn, . . . there may be a continuing duty to warn of dangers which become known after the product has entered the stream of commerce. . . . [However,] we find nothing to indicate that an independent cause of action exists in Iowa under a duty to redesign and/or retrofit. . . . Moreover, . . . a duty to recall is not generally incorporated in a duty to warn.\" (Citations and footnotes omitted.)); Wallace v. Dorsey Trailers Southeast, Inc., 849 F.2d 341, 344 (8th Cir. 1988) (\"Appellants . . . argue that [the defendant] was negligent by failing to retrofit the allegedly defective [equipment]. . . . Appellants concede that at present, Missouri law does not impose a duty to retrofit; they argue, however, that the Missouri courts, if given the opportunity, would recognize failure to retrofit as a submissible legal theory of negligence. . . . The district court concluded that in the absence of any Missouri law imposing a duty on a manufacturer . . . to retrofit a product absent a state or federal law mandating a recall of the product, [the defendant] was not negligent, as a matter of law, in failing to retrofit the allegedly defective [equipment].\" (Citation omitted.)); Romero v. International Harvester Co., 979 F.2d 1444, 1452 (10th Cir. 1992) (\"The only post-sale duty to warn we can discern under Colorado law is [the manufacturer's] duty [under Downing v. Overhead Door Corp., 707 P.2d 1027 (Colo. Ct. App. 1985), see supra note 11,] to warn of later discovered defects in a product. It does not impose a duty to retrofit.\"); Patton v. Hutchinson Wil-Rich Mfg. Co., 253 Kan. 741, 861 P.2d 1299, 1310-11, 1313, 1315-16 (Kan. 1993) (\"A negligence analysis is more appropriate than an application of strict liability in the post-sale [duty to warn] context. In the case at bar, [the plaintiff] has asserted both negligence and strict liability claims. . . . We recognize a manufacturer's post-sale duty to warn ultimate consumers who purchased the product who can be readily identified or traced when a defect, which originated at the time the product was manufactured and was unforeseeable at the point of sale, is discovered to present a life threatening hazard. . . . [However, the plaintiff] has provided no statute or case law to support the claim that [the manufacturer] is subject to a duty to retrofit or recall the [product]. We reason that product recalls are properly the business of administrative agencies as suggested by the federal statutes that expressly delegate recall authority. . . . The decision to expand a manufacturer's post-sale duty beyond implementing reasonable efforts to warn . . . should be left to administrative agencies and the legislature.\" (Citations omitted.)); Bragg v. Hi-Ranger, Inc., 319 S.C. 531, 462 S.E.2d 321, 331 (S.C. Ct. App. 1995) (approving, as \"an accurate recitation of law adopted by a majority of jurisdictions concerning a manufacturer's duty to recall or retrofit its products,\" a jury instruction advising that \"[a] manufacturer . . . has no duty . . . to retrofit [its products with later-developed safety devices] if the products were nondefective under standards existing at the time of the manufacture or sale\"); Dion v. Ford Motor Co., 804 S.W.2d 302, 310 (Tex. Ct. App. 1991) (\"Before holding a manufacturer negligent for breach of a post-sale duty, it must be established that the manufacturer assumed a duty and then did not use reasonable means to discharge the duty. . . . Ford did not assume a post-sale or post-manufacture duty to Dion in this case. . . . Ford sold rollover protection systems to retrofit unequipped tractors and encouraged dealers to encourage owners to install rollover protection systems. However, Ford did not assume a duty to improve upon the safety of its tractor by replacing an existing rollover protection system with an improved rollover protection system. Consequently, Ford did not institute a replacement program. . . . Therefore, . . . Ford did not assume a post-sale duty which would require it to use reasonable means to retrofit all . . . tractors with rollover protection systems.\").\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nBecause \"we are persuaded that it is unnecessary and unwise to impose or introduce an additional duty to retrofit or recall a product\" separate and apart from those duties to which manufacturers are already subject, see Gregory, 538 N.W.2d at 333-34, we hold that manufacturers are not subject in Hawai'i to an independent, continuing duty to retrofit its products, subsequent to their manufacture and sale, with post-manufacture safety devices that were unavailable at the time of manufacture.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\n3. Assumption of duty to retrofit\n\nThe plaintiffs' third contention is that Clark voluntarily assumed a duty to retrofit its Series 510 straddle carriers by embarking upon a formal retrofit campaign ten years after its sale of the particular unit at issue in this case but, likewise, ten years before Tabieros was injured. In their brief, the plaintiffs cite Littleton v. State, 66 Haw. 55, 656 P.2d 1336 (1982), for the proposition that \"a party will be liable in tort where the party voluntarily undertakes a course of affirmative conduct.\" The plaintiffs also highlight certain evidence adduced at trial, which they claim demonstrates that Clark, in fact, voluntarily undertook the retrofit program. Because the record in this case does not support the plaintiffs' claim that, under Hawai'i law, Clark assumed a duty to retrofit its Series 510 straddle carriers, we cannot accept the plaintiffs' position.\n\nHawai'i case law relating to the voluntary assumption of a duty or undertaking has generally followed the Restatement (Second) of Torts [hereinafter, the Restatement]. See, e.g., id. at 68, 656 P.2d at 1345; Fink v. Kasler Corp., 3 Haw. App. 270, 272, 649 P.2d 1173, 1175 (1982). The Restatement endorses the following principle:\n\nOne who undertakes gratuitously or for consideration, to render services to another which he should recognize as necessary for the protection of a third person or his things, is subject liability to the third person for physical harm resulting from his failure to exercise reasonable care to protect his undetaking, if\n\n(a) his failure to exercise reasonable care increases the risk of such harm, or\n\n(b) he has undertaken to perform a duty owed by the other to the third person, or\n\n(c) the harm is suffered because of reliance of the other or the third person upon the undertaking.\n\nRestatement (Second) of Torts § 324A (1965).\n\nThus, pursuant to section 324A of the Restatement, Clark would not be liable to Tabieros for injuries caused by the straddle carrier, in the absence of an otherwise preexisting duty to retrofit, unless (1) Clark actually undertook to retrofit its Series 510 straddle carriers for the protection of third persons from physical injury, and (2) Clark's negligent failure to complete its undertaking (a) increased Tabieros's risk of physical injury, or (b) was incompatible with the discharge of a duty owed by Terminals -- Tabieros's employer -- to Tabieros, or (c) caused Tabieros to suffer physical injury because either Terminals or Tabieros relied upon Clark to follow through with the retrofit. Cf. Dion, 804 S.W.2d at 310.\n\nOn the record before us and in consonance with section 324A of the Restatement, we hold that the plaintiffs have failed to establish that Clark assumed a duty to retrofit the straddle carrier that injured Tabieros. As a threshold matter, the evidence on the basis of which the plaintiffs maintain that Clark in fact undertook a retrofit campaign regarding the Series 510 straddle carriers does not support their claim. Most notably, the plaintiffs rely on (1) the minutes of a 1974 meeting of Clark's safety committee (the 1974 minutes) and (2) the trial testimony of two of Clark's employees regarding certain work performed in order to assist a New Jersey customer in retrofitting a non-Series 510 straddle carrier with several safety features.\n\nThe 1974 minutes state in relevant part:\n\nAfter considerable Discussion [a member of the safety committee] stated [that] he believed we should proceed as follows:\n\n3. A retro-fit program for older model carriers[,] both van carrier and standard carrier[,] to be offered to customers via a letter campaign[,] which would encourage them [i.e., the customers] to begin the retro-fit program.\n\n4. If [the] customers resist installation and payment for wheel guards[,] then Clark would offer and install them at no cost to the customer. [Another committee member] suggested that consideration be given to no charge on the visibility improvement package[,] which would also include lights and horns. Engineering and Marketing to formalize the material required[,] including cost [and] marketing to conduct the letter campaign.\n\n(Emphases added.)\n\nIt is apparent that the 1974 minutes merely reflect that one or more members of Clark's safety committee were proposing that Clark consider a letter campaign that would encourage the owners of certain of Clark's \"older model carriers\" to retrofit. The minutes do not reveal whether (1) the safety committee, as a whole, approved the proposal, (2) the proposal was referred to Clark's management, (3) Clark actually implemented the proposal, or (4) the contingency that Clark undertake the retrofitting for hesitant customers free of charge ever proved necessary. In sum, the 1974 minutes indicate at most that some members of Clark's safety committee, at some time subsequent to the manufacture of non-Series 510 straddle carriers, considered a retrofit campaign.\n\nThe trial testimony highlighted by the plaintiffs is even more unhelpful to their position. The relevant testimony of one of Clark's employees, Clark Simpson, was as follows:\n\nQ. You went to New Jersey, correct?\n\nA. Yes\n\nQ. You did the process of staying out there to put these parts on?\n\nA. Yes.\n\nQ. Those were [Series] 512 carriers?\n\nA. Yes.\n\nQ. You are saying you were sort of nursing ITO [i.e., assisting a New Jersey customer] years after they bought the first carrier?\n\nA. Yes.\n\nThe second of Clark's employees, Glen Burgess, had designed the Series 510 straddle carrier. Burgess testified that, in response to some particularly acute problems involving traffic congestion at a busy port on the east coast (ITO), Clark had undertaken to install strobe lights on some of the straddle carriers that it had sold to one of its customers.\n\nAs we have noted, none of the cited evidence, nor any other in the record, established that Clark, in fact, ever undertook a general program of retrofitting its Series 510 straddle carriers with upgraded safety equipment for the protection of third persons. See Restatement, § 324A. But even if Clark had commenced some form of embryonic program, the plaintiffs have cited nothing in the record (and we likewise have found nothing) that would satisfy the remaining elements of section 324A of the Restatement, thereby justifying the imposition of liability based upon an \"assumed duty.\" Accordingly, we hold as a matter of law that no negligent failure on Clark's part to complete any voluntary undertaking regarding safety equipment, in and of itself, either increased Tabieros's risk of physical injury, see section 324A(a) of the Restatement, or was initiated on behalf of Terminals (or any other party owing a duty to protect Tabieros from physical injury), see section 324A(b) of the Restatement, or caused either Terminals or Tabieros to rely upon any such alleged undertaking, see section 324A(c) of the Restatement.\n\n4. Directed verdict regarding duty to retrofit\n\nHaving held that an independent, continuing duty on Clark's part to retrofit its products, subsequent to its manufacture and sale, with upgraded safety equipment (1) was not \"implied\" in Tabieros I, see supra section III.A.1, (2) is not established by general negligence principles, see supra section III.A.2, and (3) was not \"assumed\" by virtue of Clark's own conduct, see supra section III.A.3, we now hold -- after disregarding conflicting evidence, giving the plaintiffs' evidence all the value to which it is legally entitled, and indulging every legitimate inference in the plaintiffs' favor -- that the evidence adduced at the trial of this matter could not have supported a verdict on the plaintiffs' claim of negligent failure to retrofit. That being the case, the circuit court did not err in granting Clark's motion for a directed verdict in that regard. See Weinberg, 78 Haw. at 49-50, 890 P.2d at 286-87.\n\nB. Wilson's Claim Of Negligent Infliction Of Emotional Distress\n\nBy written order filed on May 17, 1993, the circuit court, without explanation within its four corners, also granted Clark's motion for a directed verdict against the plaintiffs with respect to Wilson's claim of negligent infliction of emotional distress (NIED). In its prior oral ruling, however, the circuit court had suggested -- somewhat ambiguously -- that Wilson's NIED claim, not being \"parasitic\" or \"derivative\" of any physical injury that she had suffered, was not foreseeable as a matter of law and was therefore unavailable to her. The circuit court further observed that Wilson had not sought medical, psychiatric, or psychological attention in connection with any mental suffering, had exhibited no observable symptoms of mental suffering, and had not expressly testified that she had suffered any serious emotional distress.\n\nOn appeal, the plaintiffs urge that Wilson's testimony, at the very least, \"presented a jury question as to her emotional distress\" claim that was sufficient to overcome Clark's motion for a directed verdict. Clark responds that, \"even if the [circuit] court erred in dismissing . . . Wilson's claims for emotional distress, such error was harmless in that it did not affect the outcome\" of the trial, the jury having awarded Wilson no damages in its verdict.\n\nWere the trial under review in this appeal otherwise free of error, the issue might well be moot, as Clark suggests. But because we must vacate the portion of the circuit court's judgment entered in Tabieros's favor and remand the matter for a new trial, see infra at section III.C.4, it is necessary for us to address the plaintiffs' point of error on the merits.\n\nOver twenty-five years ago,\n\nin Rodrigues v. State, 52 Haw. 156, 173-74, 472 P.2d 509, 520 (1970), we recognized the independent tort of negligent infliction of mental distress and enunciated the rule that \"serious mental distress may be found where a reasonable man, normally constituted, would be unable to adequately cope with the mental stress engendered by the circumstances of the case.\" We rejected the requirement that the plaintiff must exhibit physical symptoms of mental distress in order to recover. See also Leong v. Takasaki, 55 Haw. 398, 403, 520 P.2d 758 (1974). Nor have we found it necessary that the plaintiff actually witness the tortious event in order to recover for emotional distress. See Rodrigues, supra; Campbell v. Animal Quarantine Station, 63 Haw. 557, 632 P.2d 1066 (1981).\n\nMasaki, 71 Haw. at 17, 780 P.2d at 575 (emphasis added) (some brackets in original and some added).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e \"Medical proof can be offered to assist in proving the 'seriousness' of the [NIED] claim and the extent of recovery, but should not be a requirement allowing or barring the cause of action.\" Campbell, 63 Haw. at 564, 632 P.2d at 1071. Accordingly, \"medical testimony [is] not necessary to substantiate plaintiffs' claims of serious emotional distress.\" Id. Of course, the plaintiff must be representative of a class of persons \"foreseeably endangered by the [defendant's] conduct.\" Rodrigues, 52 Haw. at 174, 472 P.2d at 521. And, ordinarily, \"whether the degree of stress engendered by the circumstances of [the] case was beyond that with which a reasonable [person could] be expected to cope [i.e., is 'serious'] is a question for the jury.\" Masaki, 71 Haw. at 18, 780 P.2d at 576 (citing Leong, 55 Haw. at 410, 520 P.2d at 766).\n\n\"Recovery for negligent infliction of emotional distress by one not physically injured,\" however, \"is generally permitted only when there is 'some physical injury to . . . a person' resulting from the defendant's conduct.\" Ross v. Stouffer Hotel Co. (Hawai'i) Ltd., 76 Haw. 454, 465-66, 879 P.2d 1037, 1048-49 (1994) (quoting Chedester v. Stecker, 64 Haw. 464, 468, 643 P.2d 532, 535 (1982)); see also Dunlea v. Dappen, 83 Haw. 28, 37-38 n.11, 924 P.2d 196, 205-06 n.11 (1996); Calleon v. Miyagi, 76 Haw. 310, 320, 876 P.2d 1278, 1288 (1994). In that sense, \"under Hawai'i law, a spouse's claim of emotional distress, based on an injury to her husband, is a 'derivative' claim sounding in tort.\" Brown v. KFC Nat'l Management Co., 82 Haw. 226, 240-41, 921 P.2d 146, 160-61, reconsideration denied, 82 Haw. 360, 922 P.2d 973 (1996) (citation omitted). However, such claims\n\nare only derivative in the sense that they do not arise unless one's spouse has sustained a personal injury. The . . . claim is a claim for damages independent and separate from the spouse's claim for damages. Thus, while these types of derivative claims are barred when the victim's initial claim of injury cannot be maintained, and are subject to defenses premised on the injured spouse's contributory or comparative negligence, it does not inevitably follow . . . that they are not otherwise separable.\n\nId. at 241, 243, 921 P.2d at 161, 163 (citations omitted) (some quotation marks added and some in original) (some brackets added and some omitted).\n\nInasmuch as Tabierous was physically injured in the accident involving the straddle carrier, the fact that Wilson was not cannot, in itself, defeat her NIED claim. There remains, however, the question of the plaintiffs' alleged failure to adduce any evidence from which the jury could have reasonably inferred that Wilson suffered the requisite degree of emotional distress. And while we have stated in the past that physical injury to the claimant, overt symptoms or manifestations of emotional distress, the actual witnessing of the tortious event, and/or supporting expert or medical testimony are not prerequisites to an NIED claim, the presence or absence of these factors may nevertheless be relevant to establishing the existence of \"serious\" emotional distress as a response to a tortious event. Moreover, the circuit court noted that no testimony had been elicited that would have tended to establish circumstantially that Wilson had suffered serious mental distress. Thus, the circuit court did not err in taking stock of the absence of such evidence in considering whether any reasonable jury could have found that Wilson had suffered emotional distress with which a reasonable person, normally constituted, would be unable to cope.\n\nAccordingly, giving the evidence in the record \"all the value to which it is legally entitled, and indulging every legitimate inference which may be drawn from the evidence in [Wilson's] favor,\" we consider whether \"it can be said that there [was] no evidence to support a jury verdict in [her] favor\" on the NIED claim. Weinberg, 78 Haw. at 50, 890 P.2d at 287; see also Takayama, 82 Haw. at 495, 923 P.2d at 912; Carr, 79 Haw. at 486, 904 P.2d at 500; Wakabayashi, 66 Haw. at 271, 660 P.2d at 1313.\n\nAn independent review of the entire trial record, including Wilson's testimony, fails to reveal any evidence that would support Wilson's claim of \"serious\" emotional distress. Wilson's most poignant articulation of her feelings and mental state, in reaction to Tabieros's injuries, consisted of her acknowledgement, often in response to leading questions, that she was \"worried,\" \"upset,\" or \"concerned\" about her companion's injury. Such emotions do not rise to the level of \"serious\" emotional distress, i.e., stress with which a reasonable, normally constituted person would be unable to cope. The plaintiffs adduced no other evidence regarding emotional distress on Wilson's part.\n\nLacking such evidence supporting Wilson's NIED claim, the plaintiffs argue, in effect, that the testimony and other evidence regarding the events surrounding Tabieros's injury, hospitalization, surgery, treatment, recovery, and subsequent changes in his life provided a sufficient basis for the jury to infer that, given the circumstances, a reasonable person in Wilson's position ought to have experienced serious emotional distress.\n\nThe plaintiffs' argument, however, misconstrues the standard set out in Rodrigues and its progeny, which limits the right of recovery for NIED \"only to those [persons] who are,\" in fact, \"foreseeably endangered by the [defendant's] conduct.\" Rodrigues, 52 Haw. at 174, 472 P.2d at 521 (emphasis added). Thus, the question is \"whether, under the facts of [the] case,\" the plaintiff's \"serious mental distress . . . was a reasonably foreseeable consequence of the defendant's act.\" Id. In other words, the question is not whether serious emotional distress might have resulted from a reasonable person's inability adequately to cope with the environmental stimuli attending a potentially stressful tortious event; rather, the question is whether serious emotional distress actually resulted therefrom.\n\nThe reasons for conditioning a claim for NIED on the plaintiff's actual and serious emotional distress are grounded in considerations of public policy. In Rodrigues, we found \"little virtue\" in \"the traditional rule . . . that there is no recovery for the negligent infliction of mental distress alone,\" pursuant to which \"the courts have been reluctant to award damages for mental distress unless it is accompanied by physical injury or the immediate threat of physical injury to the plaintiff\" resulting from the defendant's tortious act. Id. at 169-71, 472 P.2d at 518-19. However, we also recognized that \"it is universally agreed that there are compelling reasons for limiting the recovery of the plaintiff to claims of serious mental distress\" in order to narrow a defendant's otherwise potentially unlimited liability for every type of mental disturbance, not all of which justify the penalization of the defendant as the \"prime mover.\" Id. at 172, 472 P.2d at 520 (emphasis omitted). We therefore established a basis of recovery for genuine and serious mental distress rooted in general principles sounding in tort. But a person who has not actually suffered serious emotional distress, no matter how horrific the attendant circumstances, cannot claim compensation for that which is merely potential or hypothetical.\n\nIn the face of a defendant's motion for a directed verdict, the trial court must, as we have noted, indulge every legitimate inference that may be drawn from the evidence in favor of the plaintiff's claim of actual and serious emotional distress. Nevertheless, neither the trial court nor the members of the jury may, without more, legitimately find in favor of a plaintiff merely because they imagine that they -- or a hypothetical reasonable person -- might experience serious emotional distress under the circumstances presented.\n\nIn the case before us, just as the circuit court was not free to speculate regarding whether Wilson actually experienced pleasant relief that her companion had not died in the industrial accident, neither was it licensed to guess that Wilson had suffered serious and disabling mental anguish by virtue of her intimate companion's tragic injury. Reviewing the evidence produced at trial regarding the degree of Wilson's actual emotional distress, we agree with the circuit court that the plaintiffs failed to furnish any evidence of greater mental stress than transient \"concern,\" \"worry,\" and \"upset.\" We therefore hold that no reasonable jury, considering this evidence, could have found that Wilson suffered \"serious emotional distress,\" as that term has been construed in our case law. That being the case, we must affirm the circuit court's order granting Clark's motion for a directed verdict with respect to Wilson's claim of NIED.\n\nC. Jury Instructions\n\nWe now consider Clark's contention that the circuit court committed several prejudicial errors with respect to its jury instructions. Specifically, Clark faults the sufficiency or accuracy of the instructions regarding (1) \"superseding, intervening causes,\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e (2) the criteria for determining the recoverability and amount of punitive damages in connection with a product liability claim,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e (3) a manufacturer's duty to warn of open and obvious dangers inherent in the use of its product, and (4) a plaintiff's duty to mitigate damages.\n\n1. Open and obvious dangers\n\na. general principles\n\nAt the outset, we deem it useful to address in general terms the parameters of a manufacturer's liability with respect to allegedly defective products, as a function of the extent to which their use necessarily entails open and obvious dangers.\n\nGeneral principles of tort law, summarizing the results of many cases, suggest that a 'failure to warn' amounts to 'negligence' only where the supplier of a dangerous good \"has no reason to believe that those for whose use the chattel is supplied will realize its dangerous condition.\" Restatement of Torts (2d) § 388 (1965). Where a danger involved in using a product is obvious and apparent, discernible by casual inspection, a supplier is not negligent in failing to warn of that danger. Id., comment k. If this were not true, a manufacturer could not design and sell a pocket knife, axe, planer or gun. Indeed, if the law required suppliers to warn of all obvious dangers inherent in a product, the list of foolish practices warned against would be so long, it would fill a volume.\n\nPlante v. Hobart Corp., 771 F.2d 617, 620 (1st Cir. 1985) (per Breyer, J.) (brackets and some citations and internal quotation marks omitted). Although \"the failure to warn of [the] inherent non-obvious limitations\" of a product can \"create an unreasonable risk of harm in that [persons] may be lulled into an unjustified sense of safety and fail to be forewarned,\" thereby generating a jury question as to \"whether such a failure to warn was negligent,\" Laaperi v. Sears, Roebuck \u0026 Co., 787 F.2d 726, 730 (1st Cir. 1986) (citation and internal quotation marks omitted),\n\nwhere the risks of the product are discernible by casual inspection, such as the danger that a knife can cut, or a stove burn, the consumer is in just as good a position as the manufacturer to gauge the dangers associated with the product, and nothing is gained by shifting to the manufacturer the duty to warn.\n\nId. at 730-31. See also Maneely v. General Motors Corp., 108 F.3d 1176, 1179 (9th Cir. 1997) (\"A manufacturer need not provide a warning when the danger, or potentiality of danger[,] is generally known and recognized.\" (Citations and internal quotation marks omitted.)).\n\nThus, \"there is no bright line rule delineating products that present an open and obvious danger and those which are unreasonably dangerous.\" Toney v. Kawasaki Heavy Indus., Ltd., 975 F.2d 162, 166 n.2 (5th Cir. 1992).\n\nWhether a product presents an open and obvious danger barring recovery is, in the first instance, a question of law for the court. If, as a matter of law, the danger is open and obvious, it follows that the product is not \"unreasonably dangerous\" . . . . Conversely, if the danger is not open and obvious as a matter of law, whether the product is \"unreasonably dangerous\" is for the jury.\n\nId. at 166-67 n.2 (citations omitted). See also Maneely, 108 F.3d at 1179 (\"Although the question of whether a duty exists is one of law, the question of whether a risk is obvious or generally known is one of fact and thus should be decided by the trier of fact when reasonable minds may differ.\" (Citations omitted.) (Emphasis added.)). In other words, when the danger posed by the product is patent, the unreasonableness of the danger is a question of law for the court to resolve. See Lamb v. Sears, Roebuck \u0026 Co., 1 F.3d 1184, 1190 (11th Cir. 1993) (\"While in many cases, the obvious and common nature of a peril will be a question for the jury, it may be determined as a matter of law in plain and palpable cases.\"). \"For a risk to be deemed obvious [as a matter of law] for purposes of a failure to warn claim, however, there must be general consensus within the relevant community.\" Metzgar v. Playskool Inc., 30 F.3d 459, 465 (3d Cir. 1994).\n\nAccordingly, in Wagatsuma, the Intermediate Court of Appeals (ICA) took \"judicial notice\" of the \"fact\" that \"it is obvious to all that swimming pools are dangerous to young children[.]\" 10 Haw. App. at 570, 879 P.2d at 585. The Lamb court effectively reached the same result:\n\nSince the danger of drowning in a pool is an open and obvious danger, it is axiomatic that to alleviate or reduce the danger a person must erect a fence or some similar means of preventing access to the pool. . . . The danger of drowning presented by the pool, as well as the absence of a fence, was apparent to anyone viewing the pool and would not have been more apparent had [the seller] provided warnings.\n\n1 F.3d at 1190 (footnote omitted). See also Hylton v. John Deere Co., 802 F.2d 1011, 1015 (8th Cir. 1986) (holding that trial court's review of design of combine to determine whether it was dangerous to extent beyond that which would be contemplated by ordinary consumer and whether danger of climbing into bin was open and obvious was proper interpretation of Missouri law in design defect case); Maneely, 108 F.3d at 1180 (affirming summary judgment in pickup truck manufacturer's favor on basis that \"if the public recognizes that travelling in the passenger compartment of an automobile without a seatbelt is dangerous, it only follows as night the day that the public also recognizes that riding in the cargo bed of a pickup, where seatbelts and other occupant packaging are conspicuously absent, presents even greater risks. Anyone getting into the cargo area of a pickup could not fail to recognize that it is neither designed nor equipped to transport passengers\"); Elliott v. Brunswick Corp., 903 F.2d 1505, 1507, 1510 (11th Cir. 1990) (holding that manufacturer of motor installed in boat not liable under Alabama law for failure to design propeller guards because \"dangers inherent in\" motor's propellers \"should have been apparent to\" plaintiff who was injured after jumping at night from pier into water, \"the ordinary consumer clearly understanding that a revolving propeller involves danger\"); Farnham v. Bombardier, Inc., 161 Vt. 619, 640 A.2d 47, 49 (Vt. 1994) (affirming summary judgment in snowmobile manufacturer's favor on basis that \"the dangers of racing snowmobiles five abreast on a narrow strip of land at high speeds are manifestly within the common knowledge of the ordinary consumer\"); Menard v. Newhall, 135 Vt. 53, 373 A.2d 505, 507 (Vt. 1977) (affirming summary judgment in BB gun manufacturer's favor because (1) manufacturer \"was not required to warn of patent dangers or those dangers which are generally known and recognized,\" and opining \"that a BB gun, if fired at a person, could injure an eye, is nothing that even a seven-year-old child does not already know\").\n\nb. application of general principles to present case\n\nIn the present case, the plaintiffs allege that the Series 510 straddle carrier was defective with respect to the configuration of its cab and engine housing, which created a \"blind zone\" vis-a-vis adjacent areas. The resulting visual impairment did not arise under particular circumstances only, but was constant and discernible to anyone seated in the driver's position. Thus, the straddle carrier's potential, during operation, for striking an object or person located in the blind zone would be obvious and manifestly within the common knowledge of any ordinary person who had driven any large vehicle.\n\nBut we are not dealing here with ordinary members of the driving public. It is uncontroverted that the only operators of the enormous straddle carriers utilized at the loading dock of Pier 52 were trained drivers who navigated within specially designated areas that were circumscribed precisely because of the dangers, including limited visibility, posed by those very straddle carriers. That the dangers presented were obvious, apparent, and discernible by casual inspection is underscored by the fact that all witnesses, including Tabieros, who had ever occupied the straddle carrier's cab, testified that they were aware of the blind zone and its attendant risk of harm to anyone in the vicinity. Indeed, the photographic exhibits introduced into evidence -- both by Clark and the plaintiffs -- make plain and palpable the visual restrictions to which anyone atop the straddle carrier would be subject, as well as the dangerousness of piloting such a vehicle through an occupied or minimally congested area.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nGiven the occupations of the \"ordinary\" consumers of the Series 510 straddle carrier and the by standers foreseeably in its vicinity -- trained straddle carrier operators and dock workers --, the self-evident characteristics of the vehicle, and the patent nature of the danger posed by the blind zone, we hold, as a matter of law: (1) that the \"danger involved in using [the straddle carrier was] obvious and apparent, discernible by casual inspection,\" Plante, 771 F.2d at 620, and \"generally known and recognized,\" Maneely, 108 F.3d at 1179; and, therefore, (2) that Clark was \"not negligent in failing to warn of that danger,\" Plante, 771 F.2d at 620.\n\nWe emphasize, however, that although our holding impacts a manufacturer's strict product liability, see infra at section III.C.2.a, and duty to warn, see infra at section III.C.2.b, it neither completely shields a manufacturer under Hawai'i law from strict product liability, see Wagatsuma, 10 Haw. App. at 566, 879 P.2d at 583-84, nor from negligence liability, see id. at 565, 879 P.2d at 583. With respect to the former,\n\nthe following [risk-utility] factors [are] relevant to determine whether a product is defective:\n\n(1) The usefulness and desirability of the product -- its utility to the user and to the public as a whole[;]\n\n(2) The safety aspects of the product -- the likelihood that it will cause injury, and the probable seriousness of the injury[;]\n\n(3) The availability of a substitute product which would meet the same need and not be as unsafe[;]\n\n(4) The manufacturer's ability to eliminate the unsafe character of the product without impairing its usefulness or making it too expensive to maintain its utility[;]\n\n(5) The user's ability to avoid danger by the exercise of care in the use of the product[;]\n\n(6) The user's anticipated awareness of the dangers inherent in the product and their avoidability, because of general public knowledge of the obvious condition of the product, or of the exercise of suitable warnings or instructions[; and]\n\n(7) The feasibility, on the part of the manufacturer, of spreading the loss by setting the price of the product or carrying liability insurance.\n\nLarsen v. Pacesetter Systems, Inc., 74 Haw. 1, 23-24 n.6, 837 P.2d 1273, 1285 n.6 (citing J. Wade, On the Nature of Strict Tort Liability for Products, 44 Miss. L.J. 825, 837-38 (1973)), reconsideration granted in part and denied in part, 74 Haw. 650, 843 P.2d 144 (1992). And with respect to the latter, we reaffirm the proposition that \"the creation of any unreasonable danger is enough to establish negligence, even though the danger is obvious.\" Brown, 62 Haw. at 539, 618 P.2d at 273 (citation omitted). Accordingly, liability may be established by way of a theory of negligent design. See generally Ontai, Brown, and Wagatsuma, supra. We therefore analyze the circuit court's jury instructions regarding a manufacturer's duty to warn with these principles in mind.\n\n2. Manufacturer's liability for a defective product, the use of which involves an open and obvious danger\n\nThe circuit court gave the following jury instruction regarding the applicable legal tests for determining that a product is defective for purposes of either strict product or negligence liability:\n\nA product is defective in its design if you find that the product is defective under any one of the following three tests. You do not need to find the product defective under more than one of the tests.\n\nThe first test [i.e., the \"consumer expectation\" test] is that the product is defective in design if plaintiffs establish that it failed to perform as safely as an ordinary user of the product would expect when used in an intended or reasonably foreseeable manner, including reasonably foreseeable misuses.\n\nThe second test [i.e., the \"risk-utility\" test] is that the product is defective in design if plaintiffs prove that the product's design was a legal cause of the injuries and Clark fails to prove that the benefits of the design outweigh the risk of danger inherent in the design. In determining whether or not the benefits outweigh such risks, you may consider, among other things, the gravity of the danger posed by the design, the likelihood that such danger would cause injuries, the mechanical feasibility of a safer alternative design at the time that the product was manufactured, the financial cost of an improved design, and the adverse consequences, if any, to the product and the consumer that would result from an alternative design.\n\nThe third test [i.e., the \"latent danger\" test] is that the product is defective in design, even if faultlessly made, if the use of the product in a manner [that] is intended or reasonably foreseeable, including reasonably foreseeable misuses, involves a substantial danger that would not be readily recognized by the ordinary user of the product and the manufacturer fails to give adequate warnings of the danger.\n\n(Emphases added.) The foregoing language was taken verbatim from the jury instruction relating to \"products defect liability\" that this court approved in Masaki, 71 Haw. at 22-23 n.10, 780 P.2d at 578 n.10. Clark objected to the instruction and proposed an alternative that included only the second of the three tests -- i.e., the \"risk-utility\" test -- for identifying a defective product.\n\nOn appeal, Clark argues that the open and obvious nature of the straddle carrier's blind spot precluded any possible liability based either on the \"consumer expectation\" test (i.e., the \"first test\") or on any alleged failure to give an adequate warning regarding the \"latent danger\" (i.e., the \"third test\").\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e On the record before us, we agree.\n\na. \"consumer expectation\" test\n\nIn Stewart v. Budget Rent-A-Car Corp., 52 Haw. 71, 74-75, 470 P.2d 240, 243 (1970), having \"never had [a prior] occasion to rule on [the] matter,\" this court first embraced \"strict liability in tort [as] a sound legal basis for recovery in products liability cases.\" (Footnote omitted.) In doing so, we \"essentially\" followed the rule formulated in section 402A of the Restatement,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e eliminating only the requirement that the defective product must have been \"unreasonably\" dangerous to the consumer or user. Id. at 75, 470 P.2d at 243; see also Ontai, 66 Haw. at 240-41, 659 P.2d at 739.\n\nThe rule, as thus adopted for this jurisdiction, provided that where a seller or lessor, who is engaged in the business of selling or leasing a product, sells or leases a defective product which is dangerous to the user or consumer, and injury results from its use or consumption, the seller or lessor will be held strictly liable in tort for the injury.\n\nOntai, 66 Haw. at 241, 659 P.2d at 739 (citations omitted); see also Stewart, 52 Haw. at 75, 470 P.2d at 243.\n\nCorrelatively, in Ontai, we expressly approved and adopted the holding of the California Supreme Court in Barker v. Lull Engineering Co., 20 Cal. 3d 413, 143 Cal. Rptr. 225, 573 P.2d 443, 455-56, (Cal. 1978), that\n\n[a] product may be found defective in design, so as to subject a manufacturer to strict liability for resulting injuries, under either of two alternative tests. First, a product may be found defective in design if the plaintiff establishes that the product failed to perform as safely as an ordinary consumer would expect when used in an intended or reasonably foreseeable manner [i.e., the \"consumer expectation\" test]. Second, a product may alternatively be found defective in design if the plaintiff demonstrates that the product's design proximately caused his injury and the defendant fails to establish, in light of the relevant factors, that, on balance, the benefits of the challenged design outweigh the risk of danger inherent in such design [i.e., the \"risk-utility\" test].\n\nOntai, 66 Haw. at 242, 659 P.2d at 739-40 (emphasis added). Thus, with respect to the consumer expectation test \"under our formulation of the rule of strict products liability, . . . it is enough that the plaintiff demonstrates that because of its manufacture or design, the product does not meet the reasonable expectations of the ordinary consumer or user as to its safety.\" Id. at 241, 659 P.2d at 739 (citing Barker, supra, and Cronin v. J.B.E. Olson Corp., 8 Cal. 3d 121, 501 P.2d 1153, 104 Cal. Rptr. 433 (Cal. 1972)). See also Masaki, 71 Haw. at 24, 780 P.2d at 579; Johnson v. Raybestos-Manhattan, Inc., 69 Haw. 287, 288, 740 P.2d 548, 549 (1987).\n\nNone of the foregoing cases, however, involved the application of the consumer expectation test to a product that was allegedly \"defective\" by virtue of an \"open and obvious\" characteristic for purposes of strict product liability. As noted supra in section III.A.2, however, in the context of a claim of negligent design, we have observed that\n\nthe obviousness of the dange, unless it justifies the Conclusion that the condition is not unreasonably dangerous, has been held not to preclude liability on the part of a manufacturer who negligently designs a machine. The obviousness of peril is relevant to the manufacturer's defenses (e.g. [,] contributory negligence), and not to the issue of duty. The creation of any unreasonable danger is enough to establish negligence, even though the danger is obvious. And it is ordinarily a question for the jury as to whether or not a failure to install a safety device creates an unreasonable risk.\n\nBrown, 62 Haw. at 539-540, 618 P.2d at 273 (citations omitted) (emphasis added).\n\nThus, Brown implies, at least in dictum, that the \"obviousness of the danger\" inherent in the use of a product may foreclose the possibility of the manufacturer's liability for the product's negligent design if the \"obviousness\" establishes as a matter of law that the product's condition is not \"unreasonable.\" It is in the spirit of the Brown dictum that Clark urges on appeal that \"the jury should not have been instructed about the consumer expectation test . . . due to the open and obvious nature of the hazard [i.e., the blind zone] and [Navigation's] status as a sophisticated user.\" Clark's point of error apparently poses a question of first impression in Hawai'i.\n\nThe logic of the proposition that an open and obvious danger inherent in the use of a given product precludes the imposition of liability pursuant to the consumer expectation test is self-evident. If the danger involved in using a product is \"obvious and apparent, discernible by casual inspection,\" see Plante, 771 F.2d at 620, and \"generally known and recognized,\" see Maneely, 108 F.3d at 1179, then the danger must necessarily be within the ordinary user's expectation. Therefore, the product, including the obvious and apparent danger involved in its use, cannot possibly fail \"to perform as safely as an ordinary user would expect when used in an intended or reasonably foreseeable manner.\" See Ontai, 66 Haw. at 242, 659 P.2d at 740.\n\nNumerous federal courts, applying the law of various states that have adopted the consumer expectation test as a basis for establishing a product's defectiveness, have held that the obviousness of the danger posed by a feature of the product may preclude the imposition of liability on the manufacturer. See, e.g., Satcher v. Honda Motor Co., 984 F.2d 135, 136 (5th Cir. 1993) (holding that \"under the applicable Mississippi law, the consumer expectations test applies in product liability cases, and because the alleged defect as well as the danger was open and obvious to the ordinary consumer, the motorcycle was not 'unreasonably dangerous'\"), vacated and remanded on other grounds, 993 F.2d 56 (5th Cir. 1993) [hereinafter, Satcher I ]; Batts v. Tow-Motor Forklift Co., 978 F.2d 1386, 1389-90, 1392 (5th Cir. 1992) (holding, under Mississippi law, that forklift that backed into plaintiff was not a defective product pursuant to consumer expectation test because \"an open and obvious danger to an ordinary user precludes recovery against the product manufacturer under negligence and strict liability in tort\" and that, accordingly, \"an open and obvious defect precluded [the plaintiff's] recovery against . . . []the manufacturer[], regardless of whether he knew, or should have known, of that danger\") (footnote omitted)); Toney, 975 F.2d at 165-66 (\"Mississippi has adopted the objective 'consumer expectations' test to determine whether a product is unreasonably dangerous and therefore defective. . . . Thus it is clear that Mississippi law dictates that a manufacturer cannot be held liable for injuries caused by dangers arising from either a defective design or a sound but unavoidably dangerous design so long as the hazard is open and obvious 'to a casual observer.'. . . Similarly, . . . it has also been long established that if the hazard of an allegedly defective design is 'apparent and obvious to a casual observer,' then the injured plaintiff may not recover on a negligence theory.\" (Emphases in original.) (Citations omitted.)); Todd v. Societe Bic, S.A., 21 F.3d 1402, 1406-07 (7th Cir. 1994) (holding under Illinois law that because, pursuant to consumer contemplation test, \"a product is only considered defective or unreasonably dangerous if it fails to perform in a manner the ordinary consumer would expect,\" disposable cigarette lighter that produced small flame was not unreasonably dangerous for purposes of strict products liability, notwithstanding that small flame was used to ignite papers, causing deadly fire, where ability to start fire was one of lighter's inherent and obvious properties); Delvaux v. Ford Motor Co., 764 F.2d 469, 474 (7th Cir. 1985) (Under the \"open and obvious\" rule reintroduced by the the consumer contemplation approach, \"the convertible design of the Mustang is unreasonably dangerous only if it presents dangers not apparent to the ordinary consumer or user. . . . Since the most obvious feature of a convertible is its lack of a roof, dangers which the ordinary consumer would associate with that feature will not support a strict product liability cause of action in Wisconsin. Among those dangers is the danger that, should the car be in a rollover accident, injuries . . . will occur. We hold that, as a matter of law, a convertible automobile is not unreasonably dangerous because of its convertible design.\"); Saratoga Fishing Co. v. Marco Seattle Inc., 69 F.3d 1432, 1439-40 (9th Cir. 1995) (\"The consumer expectations test . . . allows a manufacturer or seller to escape liability when the unreasonable danger is open and obvious.\" (Citations omitted.)); Wilson v. Bicycle South, Inc., 915 F.2d 1503, 1507 (11th Cir. 1990) (holding, under Georgia law, that, inasmuch as \"the open and obvious rule states that a product is not defective if the peril from which injury could result is patent or obvious to user,\" bicycle helmet, which did not cover entire head, was not defective product).\n\nThe consumer expectation test for determining the defectiveness of products the use of which involve open and obvious dangers \"can result in finding products to be not defective that could easily have been designed safer without great expense or effect on the benefits or functions to be served by the product.\" W. Page Keeton et al., Prosser and Keeton on the Law of Torts § 99, at 698 (5th ed. 1984). It is for this reason that Hawai'i and most other jurisdictions have forsaken consumer expectations as the sole basis for denominating a product as defective, opting at the very least to extend the analysis to include the risk-utility test. See, e.g., Ontai, 66 Haw. at 242-43, 659 P.2d at 739-40; Satcher v. Honda Motor Co., 52 F.3d 1311, 1314 (5th Cir. 1995) [hereinafter, Satcher II ]; Saratoga Fishing Co., 69 F.3d at 1439-41; Barker, 573 P.2d at 455-56; see generally John F. Vargo, The Emperor's New Clothes: The American Law Institute Adorns a \"New Cloth\" for Section 402A Products Liability Design Defects -- a Survey of the States Reveals a Different Weave, 26 U. Mem. L. Rev. 493 (1996). Thus, a manufacturer may still be strictly liable under a product liability theory for injuries caused by a product, the use of which involves an open and obvious danger, in accordance with the risk-utility test. See, e.g., Satcher II, supra; Saratoga, supra. Moreover, in connection with a claim of negligent design, \"the obviousness of [the] peril is [merely] relevant to the manufacturer's defenses (e.g. [,] contributory negligence), and not to the issue of duty,\" and, therefore, does not, in itself, immunize the manufacturer from potential liability. Brown, 62 Haw. at 539, 618 P.2d at 273 (citations omitted).\n\nHowever, consistent with the authority cited above, we agree with Clark that an open and obvious danger posed by a product's use cannot provide the basis for finding it defective under the consumer expectation test. Moreover, we have already held in this case, as a matter of law, that the danger involved in using the Series 510 straddle carrier was obvious and apparent, discernible by casual inspection, and generally known and recognized. See supra at section III.C.1.b. Accordingly, we hold that the circuit court erred in instructing the jurors that they could find the straddle carrier defective if it \"failed to perform as safely as an ordinary user of the product would expect when used in an intended or reasonably foreseeable manner, including reasonably foreseeable misuses.\"\n\nb. \"latent danger\" test -- failure adequately to warn\n\nAs noted above, Clark also contends that the open and obvious nature of the straddle carrier's blind spot precluded any possible liability based on the \"latent danger\" test and that the circuit court therefore erred in instructing the jury that the straddle carrier could be found to be defective solely by virtue of a failure \"to give adequate warnings of the danger\" involved in its use. For the reasons discussed below, we agree.\n\nA duty to warn of latent defects in a product arises under both negligence and strict liability theories. See Wagtsuma, 10 Haw. App. at 570, 879 P.2d at 585. However, the appellate courts in this jurisdiction have repeatedly recognized that a \"manufacturer's duty to warn only extends to known dangers which the user of the manufacturer's product would not ordinarily discover.\" Id. (citation omitted). See also Masaki, 71 Haw. at 25, 780 P.2d at 579 (\"'[A] manufacturer must give appropriate warning of any known dangers which the user of its product would not ordinarily discover[.]'\" (Quoting Ontai, 66 Haw. at 248, 659 P.2d at 743.)). Consequently, a product cannot be defective merely because the manufacturer failed to provide an accompanying warning regarding an open and obvious danger. Having held as a matter of law that the danger involved in using the Series 510 straddle carrier was open and obvious, see supra at section III.C.1.b, it therefore follows, and we so hold, that the circuit court erred in instructing the jurors that they could find the straddle carrier defective solely on the basis of a failure on Clark's part to give \"adequate warnings\" regarding that danger.\n\nHowever, in this case, the circuit court's \"latent danger\" instruction was erroneous for yet another reason. As the Intermediate Court of Appeals (ICA) held in Wagatsuma that, \"generally, a products liability claim based on either negligence or strict liability has three elements: (1) a duty to anticipate and design against reasonably foreseeable hazards; (2) breach of that duty; and (3) injury proximately [i.e., legally] caused by the breach.\" 10 Haw. App. at 564, 879 P.2d at 583 (citation omitted) (emphasis added). Thus, in order for a manufacturer to be liable for failing to provide an appropriate warning, it must not only be subject to a legal duty to warn, but the breach of that duty (i.e., the failure to give an adequate warning) must have been the legal cause of the plaintiff's injuries. See Aga v. Hundahl, 78 Haw. 230, 236, 891 P.2d 1022, 1028 (1995) (reaffirming proposition that \"the best definition and the most workable test of proximate or legal cause so far suggested seems to be this: The actor's . . . conduct is a legal cause of harm to another if . . . his conduct is a substantial factor in bringing about the harm\" (citations and internal quotation marks omitted) (some ellipsis points in original and some added)); Dunbar v. Thompson, 79 Haw. 306, 314, 901 P.2d 1285, 1293 (App. 1995) (\"In Hawai'i, an actor's negligence can be a legal cause of harm to another only if such negligence is causative, i.e., a 'substantial factor in bringing about the harm.'\" (Quoting Knodle v. Waikiki Gateway Hotel, Inc., 69 Haw. 376, 390, 742 P.2d 377, 386 (1987).)).\n\nIn the present case, it is undisputed that both Terminals and Dias were aware of the blind spot caused by the design of the Series 510 straddle carrier and that all relevant persons, including Tabieros, were familiar with the dangers that the straddle carriers posed to employees in their vicinity. Indeed, the entire layout of and work procedures pertaining to the loading dock areas were organized around the movement of the straddle carriers precisely because of the dangers that they posed to those employees.\n\nThus, even if the open and obvious character of the danger posed by the straddle carrier's blind spot were deemed somehow not to have relieved Clark of its duty to warn, nevertheless, Clark could not be liable to the plaintiffs in this case by virtue of having failed to warn Tabieros of a danger of which he was already aware because such a breach could not have been a legal cause of Tabieros's accident. Accordingly, we hold that the circuit court erred in giving the \"latent danger\" instruction -- which could have led the jury to conclude that liability might legitimately be founded on Clark's failure to warn -- for this reason as well.\n\n3. Plaintiff's duty to mitigate damages\n\nClark next contends that the circuit court erred by refusing to give its proposed Jury Instruction Nos. 29 and 30 regarding Tabieros's duty to mitigate his damages, inasmuch as \"the instructions given by the court failed to explain the consequences of [such] a failure to mitigate[.]\" We agree, on the record before us, that Clark's proffered jury instructions -- or, at least, the non-cumulative substance of them -- should have been given as a supplement to the instructions actually given by the circuit court.\n\nThis court has, on several occasions, noted that \"'it is prejudicial error for the court to refuse to give an instruction relevant under the evidence which correctly states the law unless the point is adequately and fully covered by other instructions given by the court.'\" State ex rel. Bronster v. United States Steel Corp., 82 Haw. 32, 52, 919 P.2d 294, 314 (1996) (quoting Agee v. Kahului Trucking \u0026 Storage, Inc., 67 Haw. 365, 369, 688 P.2d 256, 259 (1984)); see also Carson v. Saito, 53 Haw. 178, 180, 489 P.2d 636, 637 (1971) (\"It is error to refuse to give instructions requested which correctly state the law on issues presented, unless the points are adequately covered by the instructions given.\" (Citing Gibo v. City and County of Honolulu, 51 Haw. 299, 304, 459 P.2d 198, 201 (1969).).\n\nCorrelatively, \"'jury instructions . . . must be considered as a whole. Moreover, a refusal to give an instruction that correctly states the law is not error if another expressing a substantially similar principle is given.'\" Montalvo, 77 Haw. at 286, 884 P.2d at 349 (quoting Pioneer Mill, 64 Haw. at 180, 637 P.2d at 1140) (ellipsis points in original)); see also Richardson v. Sport Shinko (Waikiki Corp.), 76 Haw. 494, 504, 880 P.2d 169, 179 (1994) (\"The trial court does not abuse its discretion by refusing a requested instruction that is substantially covered by other instructions, even when the refused instruction is a correct statement of the law.\").\n\nThus, the line demarcating sufficient from cumulative instructions is a fine one:\n\nThe function served by jury instructions is to inform the jury of the law applicable to the current case. The boundaries of the trial Judge's discretion in performing this function are defined by the obligation to give sufficient instructions and the opposing imperative against cumulative instructions. However, if any policy is to be preferred, it is that of allowing adequate and thorough instructions to be given, if they can be given without undue prejudice or confusion. The trial Judge does not exceed the limits of his discretion by reason of his refusal of a requested instruction which is substantially covered by other instructions, even when the refused instruction is a correct statement of the law.\n\nTittle v. Hurlbutt, 53 Haw. 526, 530-31, 497 P.2d 1354, 1357 (1972) (citations, brackets, and internal quotation marks omitted).\n\nFinally, we have held that it is not an abuse of discretion for a trial court to refuse to give requested jury instructions that \"single out and unduly emphasize certain facts,\" in order to avoid the \"inJustice\" of \"misleading the jury into thinking that because the court has specifically referred to these facts, the court believes them to be true.\" Id. at 532, 497 P.2d at 1358 (citations omitted); see also Gelber v. Sheraton-Hawaii Corp., 49 Haw. 327, 331, 417 P.2d 638, 640 (1966) (\"This court has pointed out that an instruction which singles out and unduly emphasizes certain facts, tends to mislead the jury into thinking that because the court has specifically referred to these facts, the court believes them to be true.\" (Citations omitted.)).\n\nWith these general principles in mind, we turn to Clark's contention that the circuit court improperly refused its proposed jury instructions addressing mitigation of damages. Clark's proposed Instruction No. 29 read:\n\nThe Defendants in this action contend that had Plaintiff Tabieros sought psychotherapy, the damage he sustained would have been greatly reduced.\n\nIf you decide that the Defendants, or either of them, are liable, and if there is any evidence tending to show that such a contention is warranted, it is for you as jurors to determine whether an ordinarily prudent person in the situation of Plaintiff Tabieros would have acted otherwise than he did act in this case. You should consider, in determining by this test whether his conduct was unreasonable, all of the factors which may affect such a determination. To name but a few examples, you should consider his age and his mental state at the time; the gravity of the condition; the extent of his knowledge of the condition; the likelihood of psychiatric treatment resulting in an alleviation of the condition and the inconvenience, if any, of undergoing psychiatric treatment.\n\nIf you should determine that Defendants' contention is correct, then it becomes your duty to determine, as best you can, the extent to which any damages otherwise awardable to the Plaintiff should be reduced as being attributable to the injured person's unreasonable conduct in this regard.\n\n(Emphasis added.) Clark's proposed Jury Instruction No. 30 read:\n\nDefendant Clark also contends that Plaintiff Tabieros has failed to mitigate his damages by trying to seek alternative employment. A party who has been injured and claims that his earning capacity has been damaged as a result has a duty to seek alternate employment to mitigate his damages. If you find that Plaintiff Tabieros did not make the effort which a reasonably prudent man in his postiion [sic] would have made to find alternate employment then it becomes your duty to determine, as best you can, the extent to which any damages otherwise awardable to Plaintiff Tabieros for lost earnings should be reduced as being attributable to his own unreasonable conduct in this regard.\n\n(Emphasis added.)\n\nThe circuit court refused to give Clark's proposed Instruction Nos. 29 and 30. Instead, it instructed the jury as follows:\n\nIt is the duty of any person, who has been in an injury, to use reasonable diligence and reasonable means, under the circumstances, to prevent the aggravation of such injuries and to effect a recovery from such injuries.\n\nAny person who claims damages as a result of an alleged wrongful act of another has a duty, under the law, to use reasonable diligence under the circumstances to mitigate or minimize those damages. However, defendants have the burden of proofing [sic] that plaintiffs breached their duty to mitigate damages. In other words, defendants must prove by a preponderance of the evidence that plaintiff Tabieros did not take advantage of reasonable opportunities he may have [had] to prevent the aggravation of his injuries so as to reduce or minimize the loss or damages.\n\nNone of the circuit court's other jury instructions touched on the issue of mitigation of damages.\n\nClark's proposed Jury Instruction Nos. 29 and 30, as far as they go, are substantially correct statements of the law. This court has held that,\n\nin contract or in tort, the plaintiff has a duty to make every reasonable effort to mitigate his [or her] damages. The burden, however, is upon the defendant to prove that mitigation is possible, and that the injured party has failed to take reasonable steps to mitigate his [or her] damages.\n\nMalani v. Clapp, 56 Haw. 507, 517, 542 P.2d 1265, 1271 (1975) (citations omitted). With respect to medical treatment,\n\n\"It is . . . incumbent upon the injured person to submit to reasonable treatment and to follow the advice of a competent physician. No damages will be allowed which might have been prevented by submitting to treatment to which a reasonably prudent [person] would have submitted to improve his [or her] condition. As a rule, if the injury is aggravated by the plaintiff's neglect to follow the directions of his [or her] physician, he is to that extent debarred from recovering.\"\n\nFranco v. Fujimoto, 47 Haw. 408, 427, 390 P.2d 740, 751 (1964) (quoting 15 Am. Jur. Damages § 37, at 436), partially overruled on other grounds by Barretto v. Akau, 51 Haw. 383, 393, 463 P.2d 917, 923 (1969). On the other hand,\n\nthe mere fact that the [treatment] might have been [efficacious] is not sufficient to hold that [the] plaintiff acted unreasonably in not resorting to such treatment. Other factors, such as the cost of the [treatment], the inconvenience resulting from it, and whether or not it had been recommended by a medical expert, [are] pertinent to the issue.\n\nFranco, 47 Haw. at 429, 390 P.2d at 752 (citations omitted). And, as indicated, \"the defendant has the burden of proving the facts which would operate to bring the mitigation into effect.\" Id. at 429-30, 390 P.2d at 752 (citation omitted).\n\nIn our view, Clark's proposed Instruction Nos. 29 and 30 neither highlighted nor unduly emphasized any facts in such a manner as would have tended to mislead the jury into thinking that, because the circuit court had specifically referred to those facts, the court believed them to be true. Moreover, a considerable portion of the trial testimony dealt with (1) whether Tabieros had sought appropriate treatment for his psychological problems, (2) whether other work, at comparable salary, was available for Tabieros, and (3) whether he had sought such employment. Thus, sufficient evidence had been elicited regarding these issues to warrant jury instructions addressing them.\n\nThe jury instruction given by the circuit court correctly apprised the jury of Tabieros's duty to mitigate or minimize his damages and Clark's burden of proving, by a preponderance of the evidence, that Tabieros breached the duty. Clark's proposed instructions, however, focused on two points not adequately and fully covered by the circuit court's instruction. See United States Steel Corp., 82 Haw. at 52, 919 P.2d at 314; Carson, 53 Haw. at 180, 489 P.2d at 637. First, the instructions framed the general principles of mitigation within the context of the specific case at hand. Such instructions are preferable, so long as they \"can be given without undue prejudice or confusion.\" See Tittle, 53 Haw. at 531, 497 P.2d at 1357.\n\nBut, second, and more importantly, Clark's instructions apprised the jury of the potential consequences, with respect to a jury award, of any failure on Tabieros's part \"to use reasonable diligence under the circumstances to mitigate or minimize [his] damages.\" The court's instruction provided no guidance whatsoever to the jury on this issue. It was precisely this type of deficiency that was outcome-dispositive in Gibo. Although there was \"no question\" in Gibo \"that the issue of [the] plaintiff's duty to use reasonable care to effect a cure and to avoid aggravation of injuries [was] adequately covered by the instructions given,\" we ruled that \"the instructions did not adequately apprise the jury as to the consequences of [the] plaintiff's failure to use reasonable care in that regard.\" 51 Haw. at 305, 459 P.2d at 202 (emphasis added). Accordingly, because the defendant's proposed instruction \"correctly stated the law applicable to the facts of [the] case and the trial Judge's refusal to give the instruction was prejudicial error,\" we reversed the judgment, entered in the plaintiff's favor, on the issue of damages and remanded for a new trial on that issue. Id. at 306, 459 P.2d at 202.\n\nIn the present case, as in Gibo, the circuit court failed to instruct the jury regarding the consequences of a possible jury finding that Tabieros had not used reasonable diligence under the circumstances to mitigate his damages by seeking appropriate employment or treatment. Moreover, the circuit court refused Clark's proposed jury instructions, which expressly addressed the subject. We therefore hold, in the event that the issue of Tabieros's failure to mitigate his damages is fairly placed before the jury on retrial, that Clark is entitled to an instruction regarding the consequences of such alleged failure to mitigate.\n\n4. The circuit court's erroneous jury instructions necessitate a remand for a new trial.\n\nAs noted supra in section II.C, \"erroneous instructions are presumptively harmful and are a ground for reversal unless it affirmatively appears from the record as a whole that the error was not prejudicial.\" Arceo, 84 Haw. at 11, 928 P.2d at 853 (citations and internal quotation marks omitted); see also Turner v. Willis, 59 Haw. 319, 326, 582 P.2d 710, 715 (1978). Inasmuch as we have held that (1) the danger involved in using the Series 510 straddle carrier was obvious and apparent, discernible by casual inspection, and generally known and recognized, see supra at section III.C.1.b, and (2) the circuit court erred in instructing the jurors that they could find the straddle carrier defective (a) if it \"failed to perform as safely as an ordinary user of the product would expect when used in an intended or reasonably foreseeable manner, including reasonably foreseeable misuses,\" see supra at section III.C.2.a, or (b) solely on the basis of a failure on Clark's part to give \"adequate warnings\" regarding the danger involved in the straddle carrier's use, see supra at section III.C.2.b, we cannot say that the jury's finding of liability was not premised on either the \"consumer expectation\" or \"latent danger\" tests. Accordingly, it does not affirmatively appear from the record that the jury instructions were not fatally prejudicial on the issue of Clark's liability.\n\nMoreover, we have held that, although the circuit court properly instructed the jury regarding Tabieros's duty to mitigate or minimize his damages and Clark's burden of proving, by a preponderance of the evidence, that Tabieros breached that duty, the circuit court erroneously failed to apprise the jury as to the potential consequences -- with respect to a jury award -- of any failure on Tabieros's part to use reasonable diligence under the circumstances to mitigate or minimize his damages. See supra at section III.C.3. Accordingly, it does not affirmatively appear from the record that Clark was not prejudiced with respect to the issue of damages as well.\n\nWe therefore have no choice but to vacate the portion of the judgment entered in Tabieros's favor and against Clark and remand the matter for a new trial. While the necessity of a third trial in this case is lamentable, hopefully the present decision and the plaintiffs' settlement with Navigation will simplify the issues and heighten the parties' focus. In this connection, and with an eye toward facilitating retrial and minimizing the possibility of error, we now address the issues on appeal that will likely arise should retrial occur.\n\nD. Evidentiary Rulings -- Exhibits\n\nIn connection with the plaintiffs' claims against Clark that were submitted to the jury -- negligent design and strict product liability --, both the plaintiffs and Clark urge on appeal that the circuit court either erroneously admitted or excluded various exhibits. Clark, moreover, argues that the circuit court, to Clark's substantial prejudice, erroneously allowed the plaintiffs to place the contents of a report before the jury through the testimony of an expert witness, notwithstanding that the circuit court had already refused to receive the report itself into evidence as an exhibit.\n\n1. Videotape of Tabieros's bowling activity\n\nTabieros testified at trial that the residual effects of his injuries impaired his ability to engage in the sport of bowling, which was his most avid interest, by generating significant pain when he played the game so that he drank constantly to control the pain. Clark obtained two videotapes, produced by local television stations, which purported to depict Tabieros bowling and winning a tournament. Clark then sought to introduce the videotapes into evidence as exhibits in order to rebut Tabieros's claims regarding the residual and lasting effects of his injuries on his bowling proficiency, including his alcohol consumption. Alternatively, Clark sought to introduce the tapes in conjunction with the testimony of its medical expert, who had viewed them as part of his independent medical examination and evaluation of Tabieros. Pursuant to HRE 403 (1993),\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e the circuit court refused to admit the tapes, as well as certain photographs derived from them, into evidence as exhibits, but allowed the photographs to be published to the jury for illustrative purposes during the testimony of the medical expert, who was relying, inter alia, on having viewed the tapes in their entirety in rendering his opinions.\n\nFrom the standpoint of both Clark and the plaintiffs, the subject matter of the videotapes was obviously relevant to the issue of compensatory damages in general and to the scope, degree, and value of Tabieros's residual injuries in particular. See HRE 401 (1993).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Thus, under HRE 402 (1993),\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e the evidence was admissible unless it was otherwise excludable for constitutional reasons or pursuant to statute, some other provision of the HRE, or the rules of this court.\n\nAlthough the circuit court indicated that it was refusing to admit the videotapes into evidence because of HRE 403, it gave no explanation as to why. In any event, the record reflects that the circuit court did not view the tapes before ruling on their admissibility.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In failing to do so, the circuit court's actions contravened this court's explicit prior instructions.\n\nWhere the admissibility of the contents of a visual recording is at issue in a judicial proceeding, we direct that Hawaii trial courts in the future undertake their best efforts in attempting to view the subject visual recording prior to ruling on its admissibility. Cf. Brandt v. French, 638 F.2d 209 (10th Cir. 1981) (the trial Judge should review the film in question outside of the jury's presence before deciding whether to admit the film into evidence).\n\nLoevsky v. Carter, 70 Haw. 419, 423-24 n.6, 773 P.2d 1120, 1123 n.6 (1989). In the absence of some indication in the record that the circuit court viewed the otherwise relevant videotape before definitively ruling on its admissibility, we hold that its exclusion constituted an abuse of discretion. See Lau v. Allied Wholesale, Inc., 82 Haw. 428, 437, 922 P.2d 1041, 1050 (App. 1996) (\"The . . . question is whether the trial court abused its discretion by ruling on the admissibility of the videotape without first viewing the tape's contents. We hold that the trial court abused its discretion in this regard.\").\n\n2. Videotapes of straddle carrier's operation\n\nClark also sought to introduce two videotapes of a Series 510 straddle carrier -- the first (Clark's tape) produced by Clark and the second (the plaintiff's tape) by the plaintiffs' design expert -- into evidence as exhibits. Clark's tape depicted the straddle carrier moving, turning, and stopping. Clark did not claim that the tape constituted an attempt to reconstruct Tabieros's accident or to demonstrate the straddle carrier's operation under conditions similar or identical to those extant at the time of the accident. Rather, Clark sought to introduce the videotapes to allow the jury to\n\nsee[] the machine go back and forth, start and stop, move around. Just to show the jury what the machine is like so they have an appreciation for what this machine is.\n\nBecause this machine is so unique. It's not something that any juror has seen before. Perhaps some of them have, but it's not likely because it's kept locked away in this special area that Matson has where nobody else is allowed except workers.\n\nThey will not have an understanding of what the machine does and what it looks like, especially when we get into the area of design. There's probably going to be a lot of talk here about design and how it could have been designed in a different way and about different carriers, how other carriers are designed. There's going to be testimony and pictures about what other carriers look like, how other carriers operate. In order for the jury to understand what this carrier is and what it did and what it looks like, what it sounds like when it's operating, they're going to have to see a videotape of it because the carrier just doesn't exist anymore.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nWithout ever viewing the proffered exhibit, the circuit court granted the plaintiffs' motion in limine to exclude Clark's tape, ruling:\n\nI'll grant the motion. And the reason I'm granting it is that it's not a recreation, it's irrelevant. And, second, even if relevant, it would allow the jury to speculate as to what transpired on the date of the alleged incident. And, therefore, I'll preclude the evidence under 403 of the Hawai'i Rules of Evidence.\n\nClark later renewed its offer of the tape as an exhibit, emphasizing that it would enable the jury to get a sense of what the straddle carrier sounded like while in normal operation. Clark's efforts, however, were to no avail; the circuit court confirmed its earlier ruling excluding Clark's tape.\n\nClark was equally unsuccessful in moving the plaintiff's tape into evidence; the circuit court disallowed it -- sight unseen and without explanation. Later, the court confirmed its ruling, clarifying that it was relying on HRE 403, despite Clark's offer that the plaintiffs' tape was necessary to impeach the testimony of the plaintiffs' expert regarding the functioning of the straddle carrier's warning horn and the accuracy of the data that he had collected. Clark's counsel suggested that, were the circuit court \"to take a look at\" the plaintiffs' tape, the court could then \"decide whether or not it's, in fact, prejudicial,\" but the court demurred, noting that Clark could \"have my law clerk look at it and renew your motion for admission at another time.\"\n\nVery much at issue at the trial under review in this appeal was Tabieros's alleged contributory negligence in failing to avoid the large, noisy, and obtrusive straddle carrier. Accordingly, evidence that would tend to show that Tabieros could and should have avoided the straddle carrier and/or that certain salient features of the machine, such as its sound and size, would give adequate warning of its presence, was obviously relevant. See HRE 401, supra at note 23.\n\nThe fact that the videotapes were not produced or offered as reconstructions of Tabieros's accident renders them no less potentially relevant to the issue of contributory negligence. In this connection, we have previously recognized that\n\n\" films or videotapes of experiments by an . . . engineer[] or other witness qualified as an expert on the cause of accidents, offered merely to illustrate the principles used in forming an opinion, do not require strict adherence to the facts and are admissible in evidence, provided such films or tapes are not misleading in and of themselves and provided it is made clear that they are offered only as illustrations of the principles involved.\"\n\nLoevsky, 70 Haw. at 428, 773 P.2d at 1126 (quoting 3 C. Scott, Photographic Evidence § 1317 (2d ed. Supp. 1987)) (emphasis in original).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Cf. Yap v. Controlled Parasailing of Honolulu, Inc., 76 Haw. 248, 255, 873 P.2d 1321, 1328 (1994) (quoting Loevsky, 70 Haw. at 426-27, 773 P.2d at 1125, for propositions that \"when a test or experiment is an attempt to reenact the original happening, the essential elements of the experiment must be substantially similar to those existing at the time of the accident. And although the decision whether to admit evidence of experiments rests largely in the sound discretion of the trial Judge, it is well settled that reconstruction experiments are incompetent unless the essential elements of the experiment are shown to be substantially similar to those existing at the time of the accident\" (citations, brackets, and internal quotation marks omitted)).\n\nThus, to the extent that the circuit court relied on HRE 401 and 402, see supra notes 23 and 24, in disallowing the receipt of the two videotapes into evidence on relevancy grounds, we hold that it erred.\n\nAs we have noted, the circuit court also relied on HRE 403, see supra note 22, in excluding the videotapes of the straddle carrier. It is unclear to us in what way the probative value of the tapes -- admitted subject to the appropriate cautionary instruction, see supra note 27 -- might have been substantially outweighed by the danger of unfair prejudice, confusion of the issues, misleading the jury, undue delay, or waste of time. Certainly, the tapes were not cumulative of any other evidence in the record. In any event, because the circuit court excluded both Clark's and the plaintiffs' tapes without first (or, to our knowledge, ever) viewing their contents, we hold that the circuit court committed an abuse of discretion. See Lau, 82 Hawai'i at 437, 922 P.2d at 1050; Loevsky, 70 Haw. at 423-24 n.6, 773 P.2d at 1123 n.6.\n\n3. Prior accidents involving straddle carriers\n\nThe plaintiffs sought to introduce numerous exhibits into evidence relating to accidents that had occurred prior to Tabieros's accident and that had involved the use of straddle carriers in Tabieros's operations. Most of the proffered exhibits were disallowed by the circuit court, which ruled that the plaintiffs had failed to lay a sufficient foundation regarding substantial similarity to Tabieros's accident. The circuit court, however, allowed the introduction, over Clark's objection, of Plaintiffs' Exhibits 27C and 179, which were accident reports prepared by Terminals's personnel; the reports related to two prior accidents involving Terminals's straddle carriers that had taken place in Terminals's shipping yards.\n\nOn appeal, Clark contends that the circuit court erroneously admitted the exhibits \"as substantially similar accidents, not for the purpose of [proving] notice [of a dangerous condition], but as evidence of defectiveness and/or negligent design.\" On the other hand, the plaintiffs insist that the \"two prior accidents\" reflected in the exhibits were offered and properly allowed \"to show both notice [of a dangerous condition] and the [existence of a design] defect.\"\n\nThe record clearly establishes -- as Clark suggests -- that the accident reports were, and could only have been, introduced for the sole purpose of showing a design defect in the Series 510 straddle carrier.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Inasmuch as the accidents reflected in them occurred in August 1987 (Exhibit 27C) and February 1988 (Exhibit 179), they could not possibly have placed either Clark or Navigation on notice of a design defect in any material way. By 1987, Clark was no longer designing, manufacturing, or selling straddle carriers; it is undisputed that Clark had ceased the manufacture of the Series 510 straddle carrier in or about 1968 and had sold its entire straddle manufacturing business in the mid-1970s. Navigation, for its part, had transferred its ownership of and maintenance responsibilities for the straddle carriers to Terminals in 1973. Thus, as of 1987 or 1988, \"notice\" of a dangerous condition could have had no relevance to the plaintiffs' claims of strict product liability or negligent design.\n\nThis court adheres to the propositions that\n\nevidence of other accidents may be \"highly probative on material issues of a negligence [or strict product liability] action.\" Simon v. Town of Kennebunkport, 417 A.2d 982, 985 (Maine 1980). \"Evidence of other similar accidents or occurrences may be relevant circumstantially to show a defective or dangerous condition, notice thereof or causation on the occasion in question.\" Id. at 984-85. But \"the introduction of other-accident evidence may carry with it the problems associated with inquiry into collateral matters. . . .\" Id. at 985. To minimize these problems we have cautioned our trial courts that:\n\nbefore evidence of previous . . . [accidents] may be admitted on the issue of whether or not the condition as it existed was in fact a dangerous one, it must first be shown [by the proponent of the evidence] that the conditions under which the alleged previous accidents occurred were the same or substantially similar to the one in question.\n\nWarshaw v. Rockresorts, Inc., 57 Haw. [645,] 652, 562 P.2d [428,] 434 [(1977)] (quoting Laird v. T.W. Mather, Inc., 51 Cal. 2d 210, 220, 331 P.2d 617, 623 (1958) (modifications in original)).\n\nKaeo v. Davis, 68 Haw. 447, 455-56, 719 P.2d 387, 393 (1986) (some brackets in original and some added) (ellipsis points in original). See also American Broadcasting Companies v. Kenai Air of Hawaii, Inc., 67 Haw. 219, 225, 228, 686 P.2d 1, 5, 7 (1984); Page v. Domino's Pizza, Inc., 80 Haw. 204, 206, 908 P.2d 552, 554 (App. 1995).\n\nThus, evidence of previous accidents, which is introduced to establish a defective condition in the product allegedly causing the accident on the present occasion, but which lacks sufficient similarity of circumstances, is irrelevant and, therefore, inadmissible under HRE 401 and 402. Such determinations of admissibility are reviewed under the right/wrong standard. See Arceo, 84 Haw. at 11, 928 P.2d at 853; Kupihea, 80 Haw. at 314, 909 P.2d at 1129.\n\nYet even when sufficient similarity is shown, the admission of evidence of prior similar accidents is still within the discretion of a trial court. The evidence, of course, may be excluded if the danger of unfair surprise, prejudice, confusion of the issues or the consideration of undue consumption of time is disproportionate to its value.\n\nKaeo, 68 Haw. at 456, 719 P.2d at 393 (citations, brackets, and internal quotation marks omitted). Such determinations of admissibility are governed by HRE 403 and are reviewed for abuse of discretion. Id.; see also Arceo, 84 Haw. at 11, 928 P.2d at 853; Walsh, 80 Haw. at 215, 908 P.2d at 1201; Sato, 79 Haw. at 19, 897 P.2d at 946.\n\nPlaintiffs' Exhibit 27C is a \"Report of Incident\" prepared by an employee of Terminals in August 1987. The \"Details of Incident\" section contains the following typed description:\n\nThe straddle 50020 ran into old C.Y. [i.e., container yard] pickup truck # 426. The [pick up] truck[,] moving slowly towards \"Waikiki\" . . . on the apron side[,] noticed through his rear view mirror that the strad was coming towards him (cab first) [,] so he pulled into [a container lane] which was open and stopped[,] hoping to give the strad the right of way, but the strad turned into him and crushed the left door and rear bumper. Apparently the strad did not see the pick-up[,] being on the away side of the strad's cab.\n\n(Emphases added.) Clark contends that the plaintiffs failed to meet their burden of showing substantial similarity. Plaintiffs' Exhibit 27C was inadmissible, Clark contends, because the incident report did not quantify the distance between the two vehicles at any particular time, did not indicate whether the straddle carrier was turning left or right, and shed no light on the role, if any, that a blind spot -- the alleged defect in the present case, which is caused by the relative positions of the straddle carrier's engine and cab -- played in causing the accident.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Accordingly, Clark argues that the circuit court erred in admitting the exhibit.\n\nAs the ICA has said previously, the precise mechanism of \"causation between the prior incidents and [the plaintiff's] accident need not be identical. The critical issue is whether the failure [of the defective product in the prior incidents] and the one [in question on the present occasion] posed [the same] risk of injury[.]\" Page, 80 Haw. at 208, 908 P.2d at 556. Thus, \"the critical issue\" in the present case is whether the blind spot, inherent in the design of the straddle carriers, posed the same \"risk of injury\" in causing the accidents described in Plaintiffs' Exhibits 27C and 179 as it allegedly did in causing Tabieros's accident.\n\nThe prior incident described in Plaintiffs' Exhibit 27C documents an accident in which a straddle carrier -- similar to the Series 510 model and also manufactured by Clark -- collided with an occupied vehicle while executing a turn in Terminals's container yard because the operator of the straddle carrier was apparently unable to observe the vehicle from his position in the carrier's cab. We can neither say that the circuit court was wrong in concluding that such a prior incident was \"substantially similar\" to Tabieros's accident or that it abused its discretion in not excluding the exhibit under HRE 403. Accordingly, we hold that the circuit court did not err in admitting Plaintiffs' Exhibit 27C into evidence.\n\nPlaintiffs' Exhibit 179, however, is more problematic. The \"details of incident\" section of the report, dated February 2, 1988, but apparently prepared by a Terminals's employee on February 4, 1988, sets forth the following description:\n\n[The] operator of straddler # 26 [] was attempting to drive away . . . (after putting a container at one of the door[s]) when he struck the tire of a 24[-foot] chassis which was parked along the roadway. The impact caused the ladder located under the cab side of the straddler to bend into the tire. [The operator] stated that he did not see the chassis in time to avoid hitting it.\n\nUnlike Plaintiffs' Exhibit 27C, this \"report of incident,\" as Clark observes, did not indicate whether the straddle carrier was moving in a cab-forward or cab-aft direction -- a critical factor in assessing the causal relation, if any, between the collision and the straddle carrier's blind spot, see Page, 80 Haw. at 208, 908 P.2d at 556 -- or whether it was executing a turning maneuver, as in Tabieros's accident. In addition, the statement that the straddle carrier operator \"did not see the chassis in time\" is ambiguous; it could easily imply that the operator's view of the chassis was not impeded, but that, for whatever reason, he did not notice it in a timely fashion.\n\nThus, the proffered exhibit did not, on its face, describe an incident that was \"substantially similar\" to Tabieros's accident because it failed to reflect that the straddle carrier's blind zone was even implicated. Moreover, the handwritten notation, \"No facts,\" appears prominently in the \"details of incident\" section. The plaintiffs evidently did not depose any of the persons involved in the incident and offered no additional evidence of facts that would tend to establish the \"similarity\" of the prior accident. Accordingly, we hold that the circuit court abused its discretion in admitting Plaintiffs' Exhibit 179 into evidence.\n\n4. Report of the National Ports Council\n\nA documentary report entitled \"Equipment Evaluation: The Operation of Clark Van Carriers\" (hereinafter, \"the NPCR\") was published in February 1973 by an organization -- based in London, England -- denominated the \"National Ports Council.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The NPCR purported to be a study, conducted in the ports of Great Britain, of various operational, engineering, structural, and ergonomic characteristics (including driver visibility) of Clark's Series 512, 520, and 521 straddle carriers, the production of which postdated the Series 510 version at issue in this case and which were larger, taller, and otherwise differently configured than the Series 510. The plaintiffs attempted to introduce the NPCR as substantive evidence at trial on the basis that it was relevant to whether the Series 510 had been defectively designed and Clark had been placed on notice thereof. Clark sought to exclude any and all use of the NPCR at trial, contending that the report constituted inadmissible hearsay, did not involve the Series 510 straddle carrier, was not relevant to the issue of notice, and was \"untrustworthy\" on its face. The circuit court, in limine, disallowed the NPCR as substantive evidence pursuant to HRE 403, but ruled that, \"to the extent that a proper foundation is laid by the proponent, experts may refer to the report in their testimony.\"\n\nOn appeal, the plaintiffs urge that\n\nthe [circuit] court's refusal to admit the NPCR [substantively] was a clear abuse of discretion. The report went to the basic issues of liability and also to the issue of punitive damages, and the low punitive damage award against Clark shows how extremely prejudiced the plaintiffs were by those decisions.\n\nThe NPCR was relevant to issues of both notice and punitive damages.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e . . .\n\nTherefore, if either the abuse of discretion or the right/wrong standard is applied, the [circuit] court abused its discretion and made a wrong decision in refusing to admit this evidence.\n\n(Emphases omitted.) By contrast, Clark argues that\n\nthe [circuit] court erred by permitting [the plaintiffs] to utilize the [NPCR] for \"demonstrative\" purposes. The court permitted [the plaintiffs'] expert witness, Harold [sic] Josephs, to utilize the report without proper foundation and permitted him to read extensively to the jury from the [NPCR,] which contained hearsay expert opinions for which he served as a conduit under the guise that they supported his opinion.\n\nWe disagree with the plaintiffs and agree with Clark.\n\na. inadmissibility of the NPCR as substantive evidence\n\nWe hold, for two reasons, that the circuit court did not err in excluding the NPCR as independent, substantive evidence that the Series 510 straddle carrier was defectively designed. First, the contents of the NPCR constituted inadmissible hearsay, notwithstanding the plaintiffs' attempt at trial to characterize the NPCR as being excepted from the hearsay rule under HRE 803(b)(8)(C) (1993) (the \"public records\" exception), 803(b)(18) (1993) (the \"learned treatise\" exception), and 803(b)(24) (1993) (the \"catchall\" exception).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e By its express terms, the \"public records\" exception set forth in HRE 803(b)(8)(C), see supra note 32, applies only to an investigative record or report conducted by a public agency \"pursuant to authority granted by law [.]\" (Emphasis added.)\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The most superficial examination reveals that the NPCR was not the product of any \"investigation.\" Its avowed purpose was to conduct a \"survey\" to assist in the evaluation of mechanical equipment used for container transportation. Accordingly, with regard to accidents involving various types of straddle carriers, the NPCR relied exclusively on preexisting reports (themselves constituting hearsay) of varying quality and reliability. In addition, the plaintiffs failed to make an adequate showing that the National Ports Council was a \"public agency.\" See supra note 30. Moreover, although the plaintiffs proffered the affidavit of David G. Curtis, Senior Executive Officer, Department of Transport, United Kingdom -- in which Curtis swore that the NPCR had produced by the National Ports Council and was currently in the custody of the Department of Transport --, the Curtis affidavit failed to attest that the NPCR was prepared \"pursuant to authority granted by law\" (i.e., pursuant to any legal mandate), that the NPCR was being maintained by the Department of Transport as a public record, that the affiant had any personal knowledge concerning the NPCR's preparation, or that the NPCR was otherwise trustworthy.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Finally, the \"public records\" exception presupposes that \"the sources of information or other circumstances\" do not \"indicate lack of trustworthiness\"; in this connection, the NPCR expressly cautions that some of its data may, indeed, be untrustworthy. For this reason, and because it does not hold itself out as a \"learned treatise,\" the NPCR was not admissible pursuant to the \"learned treatise\" or \"catchall\" exceptions to the rule against hearsay either. See HRE 803(b)(18), 803(b)(24), and the commentary thereto, supra note 32.\n\nSecond, the findings, Conclusions, and recommendations contained in the NPCR were not based on a study of the Series 510 straddle carrier, such as that involved in the present accident; rather, as noted above, the subjects of the NPCR were larger, newer, and structurally different straddle carriers. Thus, the circuit court could rightly have refused to admit the NPCR substantively into evidence on relevance grounds, any references to prior accidents contained therein lacking \"substantial similarity.\" See supra section III.D.3. In any event, for the foregoing reasons, including the multiplicity of straddle carrier types subsumed within the survey (none of which included the Series 510), the acknowledged unreliability of some of the data cited, and the paucity of facts regarding the reported accidents, we hold that the circuit court did not abuse its discretion in refusing, pursuant to HRE 403, to admit the NPCR into evidence. See Arceo, 84 Haw. at 11, 928 P.2d at 853; Walsh, 80 Haw. at 215, 908 P.2d at 1201; Sato, 79 Haw. at 19, 897 P.2d at 946.\n\nb. improper reference to NPCR in expert testimony\n\nOver Clark's repeated objections,\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e the circuit court did, however, allow reference to the contents of the NPCR by the plaintiffs' expert witness, Howard Josephs. HRE 703 (1993), entitled \"bases of opinion testimony by experts,\" permits an expert to base \"an opinion or inference\" upon \"facts or data\" that \"need not be admissible in evidence,\" provided they are \"of a type reasonably relied upon by experts in the particular field in forming opinions or inferences upon the subject\" and do not otherwise \"indicate [a] lack of trustworthiness.\" See also commentary on HRE 703 (\"Rule 703 allows opinions based on data not admissible in evidence so long as 'of a type reasonably relied upon by experts in the particular field.'\"). \"The trial court's decision whether to disallow expert testimony under HRE 703 involves a judgment call and is therefore reviewed for abuse of discretion.\" Aga, 78 Haw. at 238, 891 P.2d at 1030 (citations omitted). See also Samonte, 83 Haw. at 532-34, 928 P.2d at 26-28; Wallace, 80 Haw. at 406, 910 P.2d at 719; Maelega, 80 Haw. at 180, 907 P.2d at 766; Craft, 78 Haw. at 306-07, 893 P.2d at 157-58.\n\nHRE Rule 705 (1993), entitled \"disclosure of facts or data underlying expert opinion,\" allows an expert witness to \"testify in terms of opinion or inference and [to] give the expert's reasons therefor without disclosing the underlying facts or data if the underlying facts or data have been disclosed in discovery proceedings,\" subject to the proviso that \"the expert may . . . be required to disclose the underlying facts or data on cross-examination.\" See State v. Samuel, 74 Haw. 141, 158, 838 P.2d 1374, 1382-83 (1992). The intent of HRE 705 and its federal counterpart, Federal Rules of Evidence (FRE) Rule 705,\n\nis to eliminate the burdensome and outmoded necessity of formulating a hypothetical question in every instance in which an expert bases his opinion upon other than firsthand knowledge, and to render prior disclosure of underlying data discretionary with the court except in those relatively rare instances where discovery proceedings have not yielded the underlying material.\n\nCommentary on HRE 705.\n\nHRE 705, however, is silent on its face regarding the question -- which the appellate courts of this state have apparently never addressed -- whether otherwise inadmissible evidence, on which an expert is relying in the formulation of an opinion, may be disclosed in the first instance on direct examination. On the other hand, federal authority establishes that the intent of FRE 705 was to permit an expert to allude to the \"underlying facts or data\" upon which he or she is relying prefatorily to rendering an opinion:\n\nWhile [FRE 705] allows counsel to make disclosure of the underlying facts or data as a preliminary to the giving of an expert opinion, if he chooses, the instances in which he is required to do so are reduced. This is true whether the expert bases his opinion on data furnished him at second hand or observed by him at firsthand.\n\nFederal Advisory Committee's note to FRE 705.\n\nThus, it is not surprising that the case law of other jurisdictions is in general agreement that an expert may discuss the underlying facts and data upon which he or she is relying on direct examination, even though hearsay may be involved -- at least for the limited purpose of disclosing the basis of his or her opinion. See, e.g., Brown v. United States, 126 U.S. App. D.C. 134, 375 F.2d 310, 318 (D.C. Cir. 1966) (\"In forming an expert opinion it may be necessary to rely upon information -- hearsay though it be .... If information . . . is not so liable to be untrustworthy as to require the court to rule that his opinion is unworthy of consideration by the jury[,] . . . it was not error to permit [the expert] to state what it was.\"), cert. denied, 388 U.S. 915, 18 L. Ed. 2d 1359, 87 S. Ct. 2133 (1967); Lewis v. Rego Co., 757 F.2d 66, 74 (3d Cir. 1985) (\"Although it is not required that the bases for experts' opinions be disclosed before an opinion is given, the bases of an opinion may be testified to on direct examination[.]\"); State v. Lundstrom, 161 Ariz. 141, 776 P.2d 1067, 1071-72 (Ariz. 1989) (\"An expert witness on direct examination may disclose facts or data that have not been admitted in evidence -- and that may not be admissible -- if they form a basis for his opinion and if of a type reasonably relied on by experts in the field. Once disclosed, the facts or data are not admitted as substantive evidence, but only for purposes of showing the basis of the expert's opinion.\" (Citations omitted.)); People v. Anderson, 113 Ill. 2d 1, 495 N.E.2d 485, 488, 99 Ill. Dec. 104 (Ill. 1986) (\"Rule 705 . . . does not clearly answer whether [the] facts [upon which an expert opinion is based] may be brought out on direct examination .... However, in our judgment[,] the logic underlying Rule 703 . . . compels the Conclusion that an expert should be allowed to reveal the contents of materials upon which he reasonably relies in order to explain the basis of his opinion.\"); Brunner v. Brown, 480 N.W.2d 33, 34 (Iowa 1992) (\"The [appellants'] sole complaint on appeal is that the [trial] court erred in refusing to allow their expert witness, during direct examination, to relate hearsay evidence that he had considered in forming his opinion .... We conclude that, while such evidence is admissible under Iowa Rules of Evidence 703 and 705, the [trial] court did not abuse its discretion in rejecting it under the facts of this case.\").\n\nIn our view, the reasoning of the foregoing authority is cogent and persuasive. Accordingly, we hold that HRE 703 and 705 do not foreclose an expert witness from revealing, in the course of direct examination, the contents of the materials upon which he or she has reasonably relied -- hearsay though they may be -- in order to explain the basis of his or her opinion, provided, of course, that (1) the expert has actually relied on the material as a basis of the opinion, (2) the materials are \"of a type reasonably relied upon by experts in the particular field in forming opinions or inferences upon the subject,\" and (3) the materials do not otherwise \"indicate lack of trustworthiness.\"\n\nIn the present case, however, we do not believe that Josephs's testimony satisfied the foregoing preconditions to disclosure of the contents of the NPCR within the context of explaining, on direct examination, the bases of his expert opinions. First, the record indicates that, in all likelihood, Josephs did not actually rely on the NPCR as a factual basis of his opinions. Prior to being offered as an expert in safety engineering, human factors, the design of the Series 510 straddle carrier, remedial measures, and related matters, the plaintiffs' counsel elicited an enumeration from Josephs of the factual bases of his opinions regarding \"what the cause of the accident was\" and whether remedial steps could have been taken to avoid it. Although he listed, among other things, (1) an examination of the straddle carrier involved in Tabieros's accident, (2) the deposition testimony of the eyewitnesses to the accident, (3) the deposition testimony of Clark's designer of the Series 510 straddle carrier, (4) the deposition testimony of the representative of Navigation, who promulgated the design specifications for the vehicle, (5) \"classification records\" relating to the history of the Series 510, (6) Matson's records regarding the particular straddle carrier at issue, (7) documents relating to \"other straddle carriers,\" and (8) applicable safety standards, Josephs made no allusion to the NPCR. On cross-examination by Clark's counsel, Josephs first testified that he could not presently recall where he had first obtained the NPCR; once his recollection was refreshed, however, he acknowledged that he had first received the report from Tabieros's counsel.\n\nLater in his testimony, when Tabieros's counsel inquired whether the NPCR was one of the bases of his expert opinion, Josephs answered in the affirmative. Nevertheless, he testified immediately thereafter only that the NPCR was \"relevant\" to his opinions, that it would be \"valuable\" and \"of interest\" to an engineer or manufacturer designing a straddle carrier, and that it \"supported\" his opinions. In the latter respect, Josephs read repeatedly from the NPCR and explicated its data and Conclusions without ever indicating in what manner the reports' contents formed a basis of his opinions or in what way he otherwise relied on it.\n\nSecond, even if Josephs actually relied in some way on the NPCR as a factual basis of his opinions, it was still necessary that the NPCR contain \"facts or data . . . of a type reasonably relied upon by experts in the [engineering] field in forming opinions or inferences upon the subject\" of the Series 510 straddle carrier in order to satisfy the criteria prescribed in HRE 703.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e In our view, the record is grossly deficient in this regard.\n\nOn cross-examination by Clark's counsel, Josephs acknowledged that he had never studied or inspected the Series 512, 520, or 521 straddle carriers, which were the sole subjects of the NPCR. He did not know the relative heights of the various models as compared to the straddle carrier involved in Tabieros's accident. He was unaware of the means by which the data appearing in the NPCR was collected, the credentials or qualifications of whoever was doing the collecting, or the number or identity of the NPCR's authors. In fact, Josephs indicated that he had essentially accepted on blind faith that data collected by a \"quasi-governmental agency\" would be reliable. Such uncritical reliance is hardly a hallmark of the scientific method.\n\nIt is patently obvious from a review of the trial transcript that Josephs's testimony regarding the NPCR served primarily as a conduit to publish its findings and Conclusions, which had already been ruled inadmissible as substantive evidence pursuant to HRE 403, to the jury and to bolster the credibility of Josephs's opinions.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Many of the questions posed to Josephs regarding the NPCR by the plaintiffs' counsel, as well as his responses to them, had little or nothing to do with Josephs's area of expertise. For example, Josephs was questioned about (1) the cost of obtaining a copy of the NPCR and its availability to others, in an attempt to establish that Clark had, in fact, received notice of its existence and contents, (2) the NPCR's length and governmental authorship, (3) Clark's \"role in providing resources for the report,\"\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e and (4) Josephs's beliefs as to whether Clark had destroyed documents.\n\nMoreover, the plaintiffs' counsel prominently displayed the NPCR's principal findings and salient contents to the jury through blow-up exhibits mounted on eight story boards. In this connection, the plaintiffs' counsel expressed his belief that the portions of the NPCR that Josephs read to the jury could be used for any purpose. That the circuit court shared his view is reflected by the following exchange:\n\n[Clark's counsel]: I object to publication of the report.\n\nTHE COURT: Any response?\n\n[Plaintiffs' counsel]: The response is that the publication of other material which the experts have relied on, but is not in evidence, has been allowed and these are --\n\nTHE COURT: I will overrule and permit the demonstrative proof.\n\n[Clark's counsel]: This is improper use of a treatis [sic] in that Mr. Josephs is actually testifying to what the material contains. This goes far beyond what an expert is able to do with respect to references.\n\nTHE COURT: Under 70 --\n\n[Plaintiffs' counsel]: 703, a report replied [sic: actually \"relied\"] upon by an expert can be used in any fashion.\n\nTHE COURT: I will overrule the objection and confirm my ruling.\n\n(Emphases added.)\n\nIn light of our holding regarding the parameters of HRE 703 and 705, it is apparent that the circuit court's broad view of the permissible uses to which inadmissible evidence may be put by an expert witness was erroneous. While it is perfectly proper for experts to discuss the data upon which they have actually and reasonably relied in forming their opinions, a trial court does not have the unfettered discretion to allow testimony designed fully to disclose the contents of all inadmissible material. As we have indicated, the reason, pursuant to HRE 703 and 705, for allowing an expert witness to reveal the contents of otherwise inadmissible evidence during direct examination is not to admit the evidence for its substantive, probative value, but rather to permit the trier of fact to understand the basis of the expert's opinion in order to assess the weight and effect to be accorded that opinion. See Lundstrom, 776 P.2d at 1071-72; Anderson, 495 N.E.2d at 488. The admissibility of such testimony, however, is limited by the mandate of HRE 703 that the \"underlying facts or data\" do not otherwise \"indicate lack of trustworthiness.\" Thus, expert testimony revealing inadmissible material for the purpose of either (1) injecting untrustworthy evidence into the trial in order to lend greater authority to the testifying expert's opinion or (2) indirectly placing before the jury the purportedly authoritative Conclusions of others on the same subject -- not otherwise admissible on some independent ground -- is improper.\n\nThe need for oversight by the trial court of expert testimony revealing otherwise inadmissible material is particularly acute when the \"underlying facts or data indicate lack of trustworthiness,\" HRE 703, or where the probative value of the testimony \"is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury,\" HRE 403. In this case, the NPCR was based on multiple hearsay, was of undetermined authorship, addressed hundreds of accidents that were substantially dissimilar to Tabieros's, and contained warnings within its four corners that flagged the questionable reliability of much of its data. Moreover, prior to Josephs's testimony, the circuit court had already disallowed the NPCR as substantive evidence, not only pursuant to Clark's motion in limine,\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e but also in accordance with HRE 403.\n\nAccordingly, because (1) it appears that Josephs did not, in fact, rely on the NPCR in forming his opinions, (2) even if Josephs did so rely, the record establishes that such reliance would have been scientifically unreasonable, and (3) the circuit court had already ruled as a matter of law that the NPCR was less probative than prejudicial, we hold that the circuit court abused its discretion when it permitted Josephs's testimony regarding the NPCR. Moreover, even had Josephs reasonably relied on it, we hold that the circuit court was obligated to exercise appropriate restrictive supervision over his testimony, so as to allow only that necessary to explain to the jury the manner in which the NPCR formed a part of the basis of his expert opinion.\n\nE. Admissibility Of Expert Testimony\n\nClark raises six additional points of error regarding the circuit court's allowance, restriction, or exclusion of expert testimony. In light of our analysis supra, we need address only four in order to provide sufficient guidance to the parties on retrial.\n\n1. Dr. Smith's testimony regarding Tabieros's \"impairment ratings\"\n\nOver Clark's objections, the plaintiffs' medical expert, Robert L. Smith, M.D., testified during the trial regarding \"impairment ratings\" that he had assigned Tabieros based upon the injuries that Tabieros had sustained as a result of the accident involving the straddle carrier.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Dr. Smith's calculation of Tabieros's degree of impairment was initially performed in connection with a workers' compensation evaluation designed to quantify the extent of Tabieros's compensable work-related disability. See supra note 40.\n\nOn appeal, Clark urges, pursuant to HRE 403, see supra note 22, that Dr. Smith's testimony regarding Tabieros's impairment ratings should have been excluded as needless and confusing. In substance, Clark contends that \"disability,\" as a legal term of art, is generally intended to measure a person's loss of earning capacity\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e and that Dr. Smith's testimony was therefore \"extremely prejudicial\" because it \"utilized the terms disability and impairment as though they were interchangeable\" and thus \"conveyed the impression [to the jury] that disability existed where there was none.\" For the reasons discussed below, we disagree.\n\nUnquestionably, the terms \"disability\" and \"impairment\" often overlap. \"Disability\" is defined medically as \"any restriction or lack of ability to perform an activity in the manner and within the range considered normal for a human being.\" Taber's Cyclopedic Medical Dictionary 512 (16th ed. 1989). In turn, \"impairment\" means \"any loss or abnormality of psychological, physiological, or anatomical structure or function.\" Id. at 897. In their legal senses, however, the distinction between the terms blurs.\n\nAs used in connection with workers' compensation acts, disability is a composite of (1) actual incapacity to perform the tasks usually encountered in one's employment and the wage loss resulting therefrom (i.e., impairment of earning capacity), and (2) physical impairment of the body that may or may not be incapacitating.\n\nBlack's Law Dictionary 461 (6th ed. 1990) (emphases added).\n\nThus, it is not surprising that, during the trial, the circuit court at times referred to Tabieros's impairment ratings as \"disability ratings.\" Moreover, the record suggests that both Dr. Smith and the plaintiffs' counsel employed the terms \"disability\" and \"impairment\" fungibly, as exemplified by the following exchange:\n\n[Plaintiffs' counsel:] Did you come to an opinion as to what the percentage of disability was for [Tabieros's] lower extremities based on standards and guidelines which you testified to a few minutes ago?\n\n[Dr. Smith:] Yes, I did.\n\nQ. And what is your opinion as to his disability in his lower extremities based on those guidelines?\n\nA. Combining both the right and the left, I came to the Conclusion that he had 30 percent impairment of the lower extremities.\n\nQ. Does that translate to some impairment of the whole body?\n\nA. Yeah, it's twelve percent whole body or whole person. We use that term whole person.\n\n(Emphases added.) As we will demonstrate -- given Tabieros's \"permanent partial disability\" rating --, the usage by Dr. Smith, the plaintiffs, and the circuit court of the terms \"disability\" and \"impairment\" was neither unfairly prejudicial nor confusing.\n\nUnder the Hawai'i Workers' Compensation Law, HRS ch. 386 (1993 \u0026 Supp. 1996), \"'disability' means loss of impairment of a physical or mental function,\" HRS § 386-1 (1993) (emphases added), thereby suggesting substantial synonymy between the terms. On the one hand, pursuant to HRS § 386-1, \"'total disability' means disability of such an extent that the disabled employee has no reasonable prospect of finding regular employment of any kind in the normal labor market.\" Thus, workers' compensation benefits for \"total disability\" -- whether temporary or permanent -- presuppose an \"impairment of a physical or mental function\" that results in a loss of earning capacity. Cuarisma v. Urban Painters, Ltd., 59 Haw. 409, 420-21, 583 P.2d 321, 326-27 (1978) (\"Temporary total disability benefits [are] compensation to replace current loss of wages .... The award for permanent total disability is [also] regarded as compensation for loss of earning capacity[.]\" (Citation and internal quotation marks omitted.)); HRS §§ 386-31(a) and (b) (1993).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Moreover, \"employees who may have or have suffered permanent disability as a result of work injuries,\" and who are likely candidates therefor, are eligible for \"such physical and vocational rehabilitation services as are feasible.\" HRS § 386-25(b) (1993).\n\nThe purposes of vocational rehabilitation are to restore an injured workers's earning capacity as nearly as possible to that level which the worker was earning at the time of injury and to return the injured worker to suitable work in the active labor force as quickly as possible in a cost-effective manner.\n\nHRS § 386-25(a) (1993) (emphasis added).\n\nOn the other hand, \"partial disability\" is not expressly defined by the Hawai'i Workers' Compensation Law. However, as we recognized in Cuarisma, the relevant legislative history establishes that, consistent with the recodification of the Hawai'i worker's compensation statute recommended by Professor Stefan A. Riesenfeld, \"'compensation for permanent partial disability compensates the worker for loss of bodily integrity rather than for loss of earnings'\"; accordingly, \"'permanent partial disability compensation is an indemnity payment for the loss or impairment of a physical function and . . . is not compensation to replace current loss of wages.'\" Cuarisma, 59 Haw. at 419-20, 583 P.2d at 326-27 (quoting 1963 L.R.B. Rep. No. 1, at 106, and Hse. Stand. Comm. Rep. No. 193, in 1969 House Journal, at 702) (emphasis added). Therefore, within the context of a permanent partial \"disability,\" the degree of \"impairment\" is important in determining workers' compensation for an injury even if it is unrelated to future working capacity.\n\nHRS § 386-32(a) (1993 \u0026 Supp. 1996), governing workers' compensation for \"permanent partial disability,\" is illustrative of the foregoing principles; the statute provides in relevant part:\n\nIn ... cases of permanent partial disability resulting from the loss or loss of use of a part of the body or from the impairment of any physical function, weekly benefits shall be paid at the rate and subject to the limitations specified in this subsection .... In cases in which the permanent partial disability must be rated as a percentage of the total loss or impairment of a physical or mental function of the whole person, the maximum compensation shall be computed on the basis of the corresponding percentage of the product of three hundred twelve times the effective maximum weekly benefit rate prescribed in section 386-31.\n\n(Emphases added.) In Cuarisma, we characterized HRS § 386-32(a) as \"incorporating a schedule of benefits for a specific list of injuries, which benefits consist of weekly sums computed as a percentage of the worker's average weekly wages and are to be paid for designated numbers of weeks regardless of earnings subsequent to the injury.\" 59 Haw. at 412, 583 P.2d at 323 (emphasis added). Thus, quoting with approval the Report of the National Commission on State Workmen's Compensation Laws (1972), we noted that, with respect to workers' compensation for permanent partial disability,\n\n\"there is no exact relationship between degree of impairment and the extent of wage loss. Some workers with only minor permanent impairments have substantial wage losses. The concert pianist who loses part of one finger is the classic example. Other workers may suffer serious impairments and experience only limited disability. A lawyer might, for example, lose an arm without permanent loss of earning capacity.\"\n\nId.\n\nIn tort, once liability is established, an injured plaintiff, such as Tabieros, is entitled to damages in compensation for his or her loss. \"The general rule in measuring damages is to give a sum of money to the person wronged which as nearly as possible, will restore him [or her] to the position he [or she] would be in if the wrong had not been committed.\" Nobriga v. Raybestos-Manhattan, Inc, 67 Haw. 157, 162, 683 P.2d 389, 393, reconsideration denied, 67 Haw. 683, 744 P.2d 779 (1984) (quoting Rodrigues, 52 Haw. at 167, 472 P.2d at 517) (internal quotation marks omitted). Such compensatory damages include \"general damages, embracing items not subject to precise mathematical calculations, such as permanent injuries [and] pain and suffering.\" Franco, 47 Haw. at 424, 390 P.2d at 750 (citation and internal quotation marks omitted) (emphasis added). Correlatively, tort law recognizes that an injured plaintiff is entitled to compensatory damages \"where an injury is objective in nature and it is plainly apparent from the injury itself that the harm is permanent or that the injured person will necessarily undergo pain and suffering[.]\" Larsen, 74 Haw. at 44, 837 P.2d at 1295 (emphasis added).\n\nThe extent to which Tabieros was permanently disabled or impaired by the accident was obviously relevant to his compensatory damage claim. In this connection, Clark does not contend on appeal, nor did it at trial, that Dr. Smith lacked the expert qualifications to render an opinion regarding the extent, if any, to which Tabieros suffered a permanent disability or impairment as a result of the accident involving the straddle carrier.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Moreover, the circuit court expressly ruled that Dr. Smith was qualified to render such an opinion and allowed all parties to explore the reliability of the impairment ratings that he assigned to Tabieros by questioning him regarding the foundation and methodology on the basis of which he arrived at his Conclusions. In fact, Clark cross-examined Dr. Smith extensively regarding the bases for and method of calculating the impairment ratings. Our review of the record convinces us that the jury could not have been confused or Clark unfairly prejudiced concerning the significance, with respect to Tabieros's \"pain and suffering,\" of the impairment ratings following that cross-examination. We are likewise convinced that Dr. Smith's expert testimony was of the sort that \"would probably aid the trier of fact in arriving at the truth.\" Wallace, 80 Haw. at 419 n.37, 910 P.2d at 732 n.37 (citation and internal quotation marks omitted). Consequently, we hold that the circuit court did not abuse its discretion in permitting the testimony in question. See Samonte, 83 Haw. at 532-34, 928 P.2d at 26-28; Wallace, 80 Hawai'i at 406, 910 P.2d at 719; Maelega, 80 Hawai'i at 180, 907 P.2d at 766.\n\n2. Testimony of Dr. Suyderhoud regarding Tabieros's future earnings\n\nClark further argues on appeal that the circuit court abused its discretion by allowing the plaintiffs' expert economist, Jack P. Suyderhoud, Ph.D., to express opinions regarding the extent of Tabieros's post-accident earning capacity and likely future income. Specifically, Clark contends that Dr. Suyderhoud based his opinion testimony on assumptions that were speculative and unsupported by the record. We agree.\n\nDr. Suyderhoud testified that he had calculated Tabieros's loss of future income attributable to the straddle carrier accident via a two-step process: first, he added the value of Tabieros's estimated future income, in the absence of the accident-related injury, over the course of Tabieros's expected work life to the value of Tabieros's expected post-work pension income; second, from the figure derived from the foregoing calculation, he then subtracted both the value of Tabieros's estimated future income, in light of the accident-related injury, and the value of Tabieros's disability pension.\n\nDr. Suyderhoud acknowledged that, in performing the calculation described above, he had reviewed none of Tabieros's medical records (with the exception of some past billings) and had based his analysis on the assumption, which the plaintiffs' counsel had instructed him to make, that the entirety of Tabieros's future income would derive from his part-time job at a bowling \"pro shop,\" where he presently worked, and from his disability pension.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e On the basis that the record failed to support such an assumption, Clark moved in limine to bar Dr. Suyderhoud's testimony. The circuit court denied Clark's motion.\n\nAt trial, the plaintiffs adduced evidence, which, when construed in a light most favorable to Tabieros's disability claim, tended to show that Tabieros (1) had sustained an injury resulting in some permanent pain and nerve damage, (2) had exhibited limited knee and ankle flexion for a period of time following the accident, and (3) had experienced subsequent physical and psychological problems that limited his ability to work around straddle carriers or in any job requiring that he climb tall ladders.\n\nHowever, none of the plaintiffs' medical or rehabilitative experts testified that Tabieros would suffer a permanent partial disability from future employment. To the contrary, each expert testified that the physical injuries and psychological problems that had limited his ability to work for a period of time following the accident were treatable and that he was, in fact, able to return to work. In addition, Kenneth Nakano, M.D., a neurologist who testified on the plaintiffs' behalf, stated that, when he was tested in 1990, Tabieros was recovering from the neurological damage that he had sustained. Harvey Nakamoto, Tabieros's licensed physical therapist, testified that, as of the time his therapy terminated, Tabieros had progressed to normal knee flexion and substantially normal ankle flexion. Leigh Sakamaki, M.D., Tabieros's treating psychiatrist, testified that Tabieros had suffered from post-traumatic stress disorder and depression as a result of the accident, but had responded favorably to treatment until unilaterally discontinuing his prescribed medication. William Tsushima, Ph.D., a clinical psychologist to whom Tabieros had been referred for evaluation, testified that Tabieros had exhibited symptoms of post traumatic stress disorder, depression, and chronic pain syndrome, but that Tabieros would be expected to recover from his disabling psychological problems with the appropriate treatment.\n\nAs noted supra in section II.E., \"whether expert testimony should be admitted at trial rests within the sound discretion of the trial court and will not be overturned unless there is a clear abuse of discretion.\" Wallace, 80 Hawai'i at 406, 910 P.2d at 719 (citation and internal quotation marks omitted). \"Nevertheless, to be admissible, 'expert testimony must be both relevant and reliable.'\" Id. at 407, 910 P.2d at 720 (quoting Maelega, 80 Hawai'i at 181, 907 P.2d at 767; see also Samonte, 83 Hawai'i at 533, 928 P.2d at 27. Subject to HRE 703 and 705, however, see supra at section III.D.4.b., \"opinions of expert witnesses must be based upon facts in evidence[.]\" Loevsky, 70 Haw. at 431, 773 P.2d at 1127 (brackets in original) (citation and internal quotation marks omitted). Accordingly, \"assumptions . . . based on mere speculation\" that are foundational to an expert's opinion testimony render the latter \"inadmissible as untrustworthy,\" i.e., as unreliable. Id. at 431, 773 P.2d at 1128.\n\nIn light of the expert medical, psychological, and rehabilitative testimony described above, it is apparent that Dr. Suyderhoud lacked any factual basis for assuming that Tabieros would, by virtue of his accident-related injuries and for the rest of his life, be limited to part-time work or precluded from finding gainful employment in his former field. Rather, it is apparent that Dr. Suyderhoud's opinions were based on assumptions -- skewed toward maximizing the plaintiffs' claimed damages -- the sole source of which was the plaintiffs' counsel. Dr. Suyderhoud expressly acknowledged that these assumptions, if factually unsupported or otherwise invalid, would unduly inflate his calculations regarding Tabieros's loss of future income. He also conceded that he had no idea whether his assumptions \"reflected reality.\"\n\nThe plaintiffs' suggestion that HRE 701 through 705, relating to \"opinions and expert testimony,\" allow an expert to testify based on hypothetical questions is inapposite. The record reveals that neither the plaintiffs nor Clark posed any hypothetical questions of Dr. Suyderhoud with respect to the testimony at issue. More significantly, however, is the fact that foundational evidence was never adduced that would have supported such hypothetical questions. While experts may render opinions pursuant to hypotheticals that assume facts not yet in evidence, the ultimate admissibility of such testimony is subject to later introduction of those foundational facts. See Barretto, 51 Haw. at 388-90, 463 P.2d at 920-22; Lai v. St. Peter, 10 Haw. App. 298, 309-10, 869 P.2d 1352, 1359 (1994). Ultimate failure to establish the necessary foundational facts renders the expert's opinion testimony subject to a motion to strike in order \"to cure the defect.\" Barretto, 51 Haw. at 388, 463 P.2d at 921.\n\nIn short, Dr. Suyderhoud's expert testimony regarding the diminution of Tabieros's post-accident earning capacity and likely future income lacked any factual basis established either before or after he gave his testimony. Clark's pretrial motion in limine was designed to exclude his testimony precisely for that reason. Accordingly, we hold that the court committed an abuse of discretion when it ultimately allowed the testimony that Clark's motion in limine sought to bar.\n\n3. Exclusion of testimony of Robert Zimmerman regarding Tabieros's post-accident employability and the possibility of mitigating damages\n\nIn contrast to allowing Dr. Suyderhoud to testify regarding Tabieros's future earning capacity based upon unsupported assumptions, the circuit court disallowed in its entirety the proffered testimony of Clark's expert vocational rehabilitation counselor, Robert K. Zimmerman, Jr., regarding Tabieros's future employability within the Hawai'i job market. Clark offered Zimmerman's testimony for the dual purposes of rebutting the testimony of Dr. Suyderhoud and meeting its burden of proving that it was possible for Tabieros to mitigate his damages. Specifically, Clark tendered the following offer of proof:\n\n[Clark's counsel]: Mr Zimmerman would testify that basically ... the injuries at Matson have no significant impact upon [Tabieros's] wage earning capability. [Zimmerman] would indicate that[,] since August of 1989[,] Mr. Tabieros has been physically and psychologically able to work in his usual and customary occupation as a maintenance welder and maintenance mechanic. And testify that work in that field is generally available and wages are similar to Mr. Tabieros'[s] wages at Matson. He will say, therefore, [that] there is no significant loss of wage earning capability with regard to that injury.\n\nHe will testify that[,] based upon his review [,] Mr. Tabieros is not able to return to work at Matson in any capacity. That is based upon Dr. Eliashof and Dr. Kappenberg's report. He will testify [that] Mr. Tabieros is able to return to work without any physical or psychological restrictions with an employer other than Matson. That is based upon his review of Dr. Eliashof, Dr. Kappenberg, Dr. Douglas and the [rehabilitative] records. He will testify that the most appropriate occupation for Mr. Tabieros from a vocational rehabilitation perspective would be a maintenance welder and the related field[,] which is maintenance mechanic. With regard to Mr. Tabieros'[s] position as usual and customary, he was a first class maintenance welder. Or a maintenance mechanic depending upon which record you are looking at. Looking at the definition from Career Kokua [of] welder [or] maintenance mechanic[,] employment as [a] welder or maintenance mechanic is generally available in the Hawaii labor market.\n\nWith regard to maintenance mechanic[,] he will say that Career Kokua indicated there are approximately 2 thousand people employed in that area in the State of Hawaii. And that through job bank collecting, job bank of May 3, 1990[,] there were 46 current listings within that area of maintenance mechanic. With regard to welder[,] Career Kokua determined there were approximately 8 hundred 50 people employed in that area within the State of Hawaii[,] with many in the maintenance and service area. He will indicate that the wages provided for this employment have a wide range. That Mr. Tabieros would expect to receive at least 15 dollars an hour[,] if not the same wage he was earning at Matson. He checked with Hawaii Stevedores in May of 1990. They had hired two maintenance welders in a short time before that at the wage of 19 dollars come [sic] 42 cents an hours. He checked with other agencies where he determined that a maintenance mechanic earned between five dollars an hour and 18 dollars and 60 cents an hour. Maintenance welders earn between 9 zero six and 19 dollars 85 cents an hour. That combination welders earn between 6 fifty an hour and 20 dollars and 76 cents an hour. And general welders earn 15 dollars 28 cents and 17 dollars and 28 cents an hour. He checked Young Brothers and determined they employed maintenance welders in the area of 19 fifty to 19 dollars and 83 cents an hour. He would testify that Mr. Tabieros has the capability to work since he has both the physical and psychological capability to work in the position[,] and he will testify [that,] in his opinion[,] basically Mr. Tabieros has not suffered a wage loss[,] or [that] any impact of the injury on his wage earning capability is negligible. That's [Clark's] offer.\n\nAccordingly, Clark \"offered Mr. Zimmerman as an expert in the field of vocational rehabilitation . . . to offer an opinion as to whether or not the injury at Matson has had any significant impact upon Mr. Tabieros'[s] wage earning capability.\"\n\nThe plaintiffs objected to Zimmerman's proffered trial testimony on the grounds that (1) he was not a qualified expert, and (2) his testimony was (a) dependant upon the hearsay declarations of others, (b) out-of-date, and (c) misleading because it did not take into account Tabieros's age, physical injury, and psychological problems. The circuit court sustained the plaintiffs' objection and excluded Zimmerman's testimony, but not for any of the foregoing reasons. Indeed, the court expressly found Zimmerman to be qualified as an expert in the field of vocational rehabilitation. Nevertheless, relying upon HRE 403, see supra note 22, the circuit court precluded Zimmerman from testifying pursuant to the following thought process:\n\nI am going to overrule plaintiff[s'] objection as to qualification. That goes to weight and effect. I believe he is qualified as an expert in the field of vocational rehab. However, I am going to sustain plaintiff[s'] objection under [HRE] 403[.] He's in no position whatsoever in his expertise to merely reiterate the opinions of others. That's one of the central issues in this case. The ability to, the capability of [Tabieros] not only to work but to find a job. On the offer of proof[,] he's indicating that he should be able to. That's not the standard. He probably will be able to find a job in Honolulu in that field. So based on that offer[,] he can't render that opinion. I will sustain plaintiff's objection under [HRE] 403 and exclude the witness from testifying.\n\n(Emphases added.) Thus, it would appear that the circuit court excluded Zimmerman's proffered testimony under HRE 403 on the basis that, insofar as it had any relevance, the testimony would merely be cumulative of, or a mere conduit for, the opinions of others.\n\nAs discussed supra in section III.C.3, plaintiffs are subject to a duty to mitigate damages in either contract or tort. \"The burden, however, is upon the defendant to prove that mitigation is possible, and that the injured party has failed to take reasonable steps to mitigate his [or her] damages.\" Malani, 56 Haw. at 517, 542 P.2d at 1271 (emphasis added). It was Clark's burden, therefore, to show that it was possible, given the state of his recovery and the jobs available to someone with his skills and experience, for Tabieros to obtain gainful employment subsequent to his injury and that he had failed to take reasonable steps to mitigate damages by obtaining such employment. Clark had adduced testimony, through medical, psychological, and rehabilitative experts, that Tabieros had substantially recovered from his physical injuries and could, within a reasonably short period, recover from his psychological problems arising out of the accident-related injury. See supra section III.E.2.\n\nIt was in this context that Clark offered Zimmerman's testimony regarding the effect of Tabieros's recovery on his future earning capacity. Zimmerman's testimony was relevant, see supra note 23, to Clark's case for at least two reasons. First, as noted, Clark bore the burden of proof on the question whether mitigation of income loss was possible. Second, and correlatively, the circuit court had permitted the plaintiffs, over Clark's objection, to adduce Dr. Suyderhoud's expert opinion -- based on an assumption that the only pre-retirement work available to Tabieros would be a part-time job in a bowling pro shop -- that Tabieros would in fact experience future wage losses. See supra section III.E.2.\n\nGiven Clark's burden, Zimmerman's proffered testimony was highly probative of the possibility of mitigation. The fact that it did not also address Tabieros's actual efforts to find work rendered it no less relevant.\n\nEvidence is relevant if it tends to prove a fact in controversy or renders a matter in issue more or less probable .... The contention that evidence which, standing alone, is insufficient to establish a controverted fact, should be inadmissible is totally without basis in the law. It is often said that a brick is not a wall.\n\nWallace, 80 Hawai'i at 409, 910 P.2d at 722 (quoting commentary on HRE 401) (citations, brackets, and internal quotation marks omitted). Nor would Zimmerman's testimony have been cumulative of the medical, psychological, and rehabilitative testimony discussed above, which tended to show that Tabieros was capable of gainful employment, but neither established that appropriate work was actually available nor quantified its mitigative value to Tabieros.\n\nWith respect to the circuit court's apparent concern that Zimmerman would rely on the opinions of other experts in giving his testimony, we have already noted in section III.D.4.b, supra, that HRE 703 permits an expert to base an opinion or inference upon \"facts or data\" that are \"of a type reasonably relied upon by experts in the particular field in forming opinions or inferences upon the subject\" and do not otherwise \"indicate lack of trustworthiness.\" It is difficult to imagine how an expert in vocational rehabilitation could reasonably determine the types of post-injury work available to a given client without relying on the opinions of the client's health care professionals regarding the client's degree of recovery. Such reasonable reliance is clearly permitted under HRE 703. A trial court may, of course, exercise supervision over the expert's testimony, pursuant to HRE 611 (1993) and 403, to ensure that the testimony is not unnecessarily duplicative or prejudicial. As distinguished from the testimony of Josephs, see supra at section III.D.4.b, and Dr. Suyderhoud, see supra at section III.E.2, however, the expert opinions upon which Zimmerman would have relied were already in evidence and had not been excluded as unreliable or prejudicial in any way.\n\nIn our view, based on the record before us, the circuit court either misapprehended Clark's offer of proof regarding Zimmerman's testimony or wrongly excluded relevant evidence in a manner prejudicial to Clark's ability to seek to meet its burden of proving the possibility that Tabieros could mitigate his future wage losses. Accordingly, we hold that the circuit court abused the discretion accorded by HRE 403 in rejecting Clark's offer of proof and foreclosing Zimmerman from testifying consistently therewith.\n\n4. Exclusion of testimony of Walter Girardi regarding extent of visibility from cab of Series 510 straddle carrier\n\nClark called Walter Girardi, a consulting material handling\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e engineer who had formerly been a long-time Clark employee, \"as an expert mechanical engineer qualified to testify in the areas of material handling, visibility, plant layout, and product safety.\" (Emphasis added.) Girardi testified that he conducted product and traffic flow analyses for private commercial enterprises designed to assure productivity and safety, including the adequacy of visibility in connection with material handling equipment. He had previously conducted \"a formal visibility study\" regarding the Series 510 straddle carrier.\n\nWithout objection, the circuit court found Girardi \"qualified as an expert for the purposes offered.\" Thereafter, in the course of Girardi's direct examination, the following exchange transpired:\n\n[Clark's counsel:] Mr. Girardi, after you had completed your inspection of the vehicles and conducted your visibility test and inspection of the scene[,] as well as reviewed the depositions and other information that you talked about in this case, did you come to any opinions to a degree of engineering probability with respect to this case?\n\nA. Yes, I did.\n\nQ. And what are those opinions?\n\nA. Well --\n\n[Plaintiffs' counsel:] Excuse me, I'm going to object at this point, your Honor ....\n\nDuring an ensuing bench conference, Clark's counsel made an offer of proof that Girardi would\n\nsay what Dias could have seen given the configuration of the machine and the position of the operator as he normally would be operating the -- the equipment.\n\nI believe he's qualified to do that. And he would have to be allowed to testify in that area since the allegation is that Dias could not have seen the people on the ground. His testimony will be to the effect that Dias could have seen the people on the ground if he had availed himself of the proper means of operating the machine.\n\nThis goes to the area of product misuse, whether the product was defective, because if we can show that Dias[,] operating the machine properly[,] could have avoided the accident, then the machine was not defective.\n\n....\n\n... [Girardi] is going to testify that[,] given the height of Mr. Dias and his location in the cab, with the visibility study he conducted,... Mr. Tabieros... would have been visible as Dias pulled up to pick up the container... and before he started moving in [Tabieros's] direction.\n\nHe will also testify that the proper use of the machine is such that when you make a turn, the area of limited visibility opens up, allowing for greater visibility, and that[,] in fact[,] when... Mr. Dias comes very close to Mr. Tabieros, he can see him directly in front of the equipment.\n\nIn addition to that, he will testify that[,] if the mirrors had been adjusted properly, . . . Mr. Dias could have seen Tabieros... in the mirrors just by glancing in that direction. He will also testify that Mr. Tabieros was in a dangerous position given the flow of traffic, that he should have been elsewhere.\n\n... Mr. Girardi will also testify that the piece of equipment is so large and so loud that Mr. Tabieros... could not help but see it. And the addition of strobe lights would not have changed the... recognizability... of the machine itself.\n\nThis all goes to the area[,] not only of whether the machine is defective[,] but also whether or not there was contributory negligence on the part of Mr. Tabieros.\n\nNotwithstanding Clark's offer of proof, and despite being qualified as an expert in visibility analysis, Girardi was not allowed to testify regarding what, in his opinion based on his study of the machine, the operator (i.e., Dias) of the Series 510 straddle carrier could have seen from the cab at the time of Tabieros's accident. Clark's counsel pointed out to the circuit court that Josephs had been permitted to testify on the plaintiffs' behalf regarding the limits of visibility from the straddle carrier's cab. The circuit court nonetheless founded the exclusion of Girardi's testimony, under HRE 403, on the distinction between a \"human factors expert,\"\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e on the one hand, and a visibility/product safety expert, on the other:\n\nTHE COURT: Under Rule 403, I'm going to exclude all of his opinions except that opinion which relates to the mirrors.\n\n[Plaintiffs' counsel]: Except the mirrors?\n\n[Clark's counsel]: Your Honor, he's qualified to testify as to what a man could see while sitting in that machine with the machine still. He's done these studies before and testified as an expert in court before.\n\n....\n\n[Navigation's counsel]: This is really just the other half of what Mr. Joseph[s] testified. He said they couldn't --\n\nTHE COURT: You're talking about different things. Mr. Joseph[s] was a human factors expert.\n\n(Emphasis added.)\n\nOn appeal, Clark complains that the circuit court \"erred by unduly restricting [Girardi's] opinions[.] Mr. Girardi was qualified to give the opinions, and the court's reasons for excluding [them] went to weight rather than admissibility.\" We agree.\n\nThe circuit court's ruling is puzzling, insofar as none of the HRE 403 factors -- i.e., \"the danger of unfair prejudice, confusion of the issues, or misleading the jury, or . . . considerations of undue delay, waste of time, or needless presentation of cumulative evidence\" -- appear to be the basis of its ruling. To the extent that the circuit court was intending to express doubts concerning the extent of Girardi's knowledge, we have previously held that \"it is not necessary that the expert witness have the highest possible qualifications to testify about a particular matter .... Once the basic requisite qualifications are established, the extent of an expert's knowledge of the subject matter goes to the weight rather than the admissibility of the testimony.\" Wallace, 80 Hawai'i at 419 n.37, 910 P.2d at 732 n.37; Toyomura, 80 Hawai'i at 26 n.19, 904 P.2d at 911 n.19; Larsen, 64 Haw. at 304, 640 P.2d at 288. Because the circuit court had expressly qualified Girardi as an expert in the area of \"visibility\" analysis, we hold that its exclusion of his proffered testimony, which was directly relevant to a Series 510 straddle carrier operator's range of visibility at the location of Tabieros's accident, constituted an abuse of discretion.\n\nF. Effect Of The Joint Tortfeasor Release Of The Plaintiffs' Claims Against Navigation Upon Clark's Liability To Tabieros\n\nAs its final point of error on appeal, Clark contends that \"the [circuit] court erred by failing to give [it] credit for sums paid by Navigation in excess of its share of the verdict as determined by the jury,\" notwithstanding that, by virtue of the plaintiffs' \"Settlement and Mutual Release Agreement\" with Navigation (the Agreement), see supra section I, it \"was entitled to such a credit pursuant to [HRS] § 663-14.\"\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e In particular, Clark argues that\n\nthe jury's verdict awarded a total of $759,440 against Navigation, including general, special[,] and punitive damages.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The verdict awarded a total of $459,660 against... Clark[,] including general, special[,] and punitive damages.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Prior to the entry of judgment herein[,] [the plaintiffs] and Navigation entered into a settlement and executed a joint tortfeasors'\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e release [pursuant to UCATA]. The amount paid by Navigation was more than $759,440. The circuit court refused to give... Clark credit for the excess. The joint tortfeasor release signed by [the plaintiffs] and Navigation has language which indicates that it is a joint tortfeasor release pursuant to [HRS § ] 663-14[.]\n\n....\n\nIt is submitted that once the settling parties have subjected themselves to the benefits and restrictions of [HRS § ] 663-14,... the [trial] court should not seek to look behind the document to analyze the parties' motives or the equity of the effect of the statute upon a particular situation ....\n\nWe agree with Clark.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nThe Agreement between the plaintiffs, as the releasors, and Navigation, as the releasee, provides in relevant part:\n\nFor and in consideration of the promises and covenants set forth herein..., upon execution of this Agreement and receipt of the Settlement Sum as defined hereinbelow, the Plaintiffs... hereby fully, completely, finally[,] and irrevocably release and forever discharge... Navigation from any and all claims... in any manner resulting from,... connected with, or traceable... to the Accident referred to in the Lawsuit ....\n\n....\n\nPlaintiffs further covenant and agree that, for the consideration mentioned above, this Agreement shall be and operate pursuant to the provisions of [UCATA, HRS] §§ 663-11 through 663-17, ... as amended, and shall operate to release the Releasee[] from any and all liability to make contribution to any person or entity found to be a joint tortfeasor with Releasee[] by reducing the Plaintiffs' damages recoverable against all the other (non-released) tortfeasors to the extent of the pro rata share of the released Releasee['s] liability or by the amount of the consideration stated in this Agreement, whichever is greater.\n\n(Emphases added.) (Parenthetical in original.)\n\nThus, the plaintiffs' suggestion that \"the Agreement between [Navigation] and [the] plaintiffs did not provide for any reduction of the amount for which Clark was liable\" (emphasis in original) is simply wrong. We hold that, by its express terms, the Agreement extinguished all of the plaintiffs' claims against Navigation and reduced their claims against Clark by the greater of the amount of the consideration paid to them by Navigation or Navigation's pro rata share of the total liability for the damages resulting from Tabieros's accident.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nIV. Conclusion\n\nBased on the foregoing analysis, we affirm the circuit court's judgment in Clark's favor and against Wilson, vacate the judgment in Tabieros's favor and against Clark, and remand for a new trial -- consistent with this opinion -- of Tabieros's claims against Clark.\n\nRonald T.Y. Moon, Steven H. Levinson, Paula A. Nakayama, Mario R. Ramil, Kevin S.C. Chang\n\n\u003cspan class=\"fn\"\u003e1. A straddle carrier is a large vehicle weighing approximately 36,000 pounds unloaded. The straddle carrier involved in this case was designed to lift, move, and stack containers of up to thirty-six feet in length.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The plaintiffs' complaint characterizes Wilson as Tabieros's \"common law wife.\" This court \"declared, over seventy years ago, that 'common law' marriages -- i.e., 'marital' unions existing in the absence of a state-issued license and not performed by a person or society possessing governmental authority to solemnize marriages -- would no longer be recognized in the Territory of Hawaii.\" Baehr v. Lewin, 74 Haw. 530, 559, 852 P.2d 44, 58 (citing Parke v. Parke, 25 Haw. 397, 404-405 (1920)), clarification granted in part, 74 Haw. 650, 875 P.2d 225 (1993). See also State v. Clyde, 47 Haw. 345, 350, 388 P.2d 846, 849 (1964). Thus, Wilson's claims are actually based on her friendship, companionship, and cohabitation with Tabieros over the course of approximately ten years preceding the accident. The plaintiffs have, throughout these proceedings, assumed Wilson's standing to claim damages as a result of Tabieros's accident and consequent injuries. Similarly, Clark has apparently never challenged Wilson's standing as a plaintiff. Accordingly, we do not reach the issue. See infra section III.B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Because we vacate the portion of the judgment that is favorable to the plaintiffs in this case and remand for a new trial, we need not address two of Clark's points of error, i.e., that the circuit court improperly denied its motions for a mistrial premised upon claims that the plaintiffs' counsel (1) made an inappropriate reference to an inadmissible affidavit and (2) posed an allegedly improper question during his direct examination of Tabieros regarding costs incurred in the course of the present litigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In light of our Disposition of this appeal, we need not address any of these points of error.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Terminals is a corporate subsidiary of Navigation. Terminals employed Tabieros and was not a party to the present lawsuit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The circuit court, over Clark's objection, permitted Josephs's controverted testimony on March 30 and 31, 1993, and that of Sackett on April 13, 1993. On April 21, 1993, the circuit court granted Clark's motion, tendered six days earlier, for a directed verdict on the plaintiffs' claim that Clark had breached its alleged duty to retrofit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The circuit court instructed the jury that the plaintiffs were seeking to establish liability under two distinct theories: (1) strict product liability based on defective design; and (2) negligent design or failure to warn. Three written sets of the court's instructions were provided to the jury at the commencement of their deliberations. The instructions did not allude in any way to retrofitting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The doctrine of the law of the case states that a determination of a question of law made by an appellate court in the course of an action becomes the law of the case and may not be disputed by a reopening of the question at a later stage of the litigation. This doctrine applies to issues that have been decided either expressly or by necessary implication. Weinberg, 78 Haw. at 47, 890 P.2d at 284 (citations and internal quotation marks omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Throughout their appellate briefing, the plaintiffs blur the distinction between a manufacturer's post-manufacture duty to warn of dangers or hazards attendant to a product's use, on the one hand, and a manufacturer's post-manufacture duty to retrofit the product with subsequently developed safety devices, on the other.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Of course, if a manufacturer, in lieu of a mere warning, were adequately to retrofit its product with safety features to protect against a foreseeable risk of injury stemming from an originally defective design, the manufacturer would -- from the time of the retrofitting and in the absence of new or changed circumstances -- have discharged its duty to exercise reasonable care regarding the particular foreseeable risk of injury associated with the need for the retrofit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. On the other hand, in a strict products liability action, the issue of whether the seller knew or reasonably should have known of the dangers inherent in his or her product is irrelevant to the issue of liability. Although highly relevant to a negligence action, it has absolutely no bearing on the elements of a strict products liability claim. Johnson v. Raybestos-Manhattan, Inc., 69 Haw. 287, 288-89, 740 P.2d 548, 549 (1987) (citations omitted) (emphasis in original). But cf. Maneely v. General Motors Corp., 108 F.3d 1176, 1179 (9th Cir. 1997) (summarizing California law as follows: \"To establish a failure to warn claim, a plaintiff must prove that the manufacturer had a duty to warn of the dangers arising from a foreseeable use of the product and that the breach of that duty was the proximate cause of the plaintiff's injuries. When a manufacturer is or should have been aware that a product is unreasonably dangerous absent a warning and such warning is feasible, the manufacturer will be held strictly liable if it fails to give an appropriate and conspicuous warning.\" (Citations omitted.)). In the context of negligence actions, we agree with the following analysis of the Colorado Court of Appeals: The duty to warn exists where a danger concerning the product becomes known to the manufacturer subsequent to the sale and delivery of the product, even though it was not known at the time of the sale. After a product involving human safety has been sold and dangerous defects in design have come to the manufacturer's attention, the manufacturer has a duty either to remedy such defects, or, if a complete remedy is not feasible, to give users adequate warnings and instructions concerning methods for minimizing danger. Downing v. Overhead Door Corp., 707 P.2d 1027, 1033 (Colo. Ct. App. 1985) (citations omitted). The United States Court of Appeals for the Tenth Circuit \"read the Downing court's language as addressing defects in design, existing but unknown or unappreciated at the time of the original sale, which are subsequently discovered by the manufacturer,\" but perceived \"nothing in Downing extending to manufacturers a duty to retrofit a product which was non-defective under standards existing at the time of manufacture, yet which could subsequently be made safer by a later-developed safety device or design improvement.\" Romero v. International Harvester Co., 979 F.2d 1444, 1450 (10th Cir. 1992) (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Hodder v. Goodyear Tire \u0026 Rubber Co., 426 N.W.2d 826 (Minn. 1988), the sole authority cited by the plaintiffs in support of recognition in this jurisdiction of the duty to retrofit, is not only not \"directly on point,\" as the plaintiffs maintain, but is patently inapposite. Hodder dealt exclusively with the manufacturer's duty and failure to warn of a dangerous condition, latent in its product (i.e., a tire rim that could explode during repair), of which the manufacturer had become aware when it sold and marketed the product. Id. at 835. Thus, the Hodder court agreed with the plaintiff that the question before it was \"not whether there [was] a cause of action at common law for failure to recall, but simply whether the failure to give consumer notification as a remedial measure [was] evidence of a failure to warn and of conduct giving rise to punitive damages.\" Id. at 836 (internal quotation marks omitted). That being the case, Hodder is similar to Tabieros I. See supra section III.A.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In Lynch, the plaintiff was injured on an escalator when it abruptly stopped, causing her to fall. The plaintiff sued the escalator's owner, manufacturer, and maintenance firm on a negligence theory. The trial court entered judgment in the defendants' favor. Affirming the judgment on appeal, the Lynch court ruled, inter alia, as follows: Given the posture of this case, . . . the precise question presented for decision is this -- in a negligence product liability case, where the defendant manufacturer exercises reasonable care in producing a product which functions properly until the time of the accident in question and does not retain any post-sale responsibility for or control over its product, but where it is proven that at the time of the accident the manufacturer knew or should have known of an alternative design, which may be safer, is the manufacturer negligent if it does not retrofit its already sold products, or at least notify the owners of the product of the new design? . . . We [do not] think that the imposition of such a duty would be appropriate under established principles of negligence liability. . . . The clear effect of imposing such a duty would be to inhibit manufacturers from developing improved designs that in any way affect the safety of their products, since the manufacturer would then be subject to the onerous, and often times impossible, duty of notifying each owner of the previously sold product that the new design is available for installation, despite the fact that the already sold product are, to the manufacturer's knowledge, safe and functioning properly. Moreover, in a case such as this, where at the time of the accident and for nine years prior thereto, the product in question was under the control of the [owner] and its service company, . . . it is clearly more appropriate to impose a duty to insure that the product is functioning properly or to update the design of the product in the light of new technology on those parties, rather than on the manufacturer who relinquished control years ago. 548 A.2d at 1281.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Our research has unearthed only three reported decisions that imply a post-manufacture duty to retrofit products that may not have been unreasonably dangerous or otherwise defective at the time of sale: Readenour v. Marion Power Shovel, 149 Ariz. 442, 719 P.2d 1058 (Ariz. 1986); Hernandez v. Badger Constr. Equip. Co., 28 Cal. App. 4th 1791, 34 Cal. Rptr. 2d 732 (Cal. Ct. App. 1994); and Lunghi v. Clark Equip. Co., 153 Cal. App. 3d 485, 200 Cal. Rptr. 387 (Cal. Ct. App. 1984). Both California decisions vacated orders granting summary judgment in the manufacturer's favor. Without citing any authority for the proposition, the Lunghi court expressed the ipse dixit opinion that, on the uncontroverted record before it, a jury \"could still have found that Clark's knowledge . . . imposed a duty to warn of the danger, and/or a duty to conduct an adequate retrofit campaign.\" 200 Cal. Rptr. at 392 (emphases omitted). The Hernandez court simply cited generally to Lunghi in declaring that \"failure to conduct an adequate retrofit campaign may constitute negligence apart from the issue of defective design.\" 34 Cal. Rptr. 2d at 754. The Readenour court similarly opined, without explication, that certain evidence was admissible for the purpose of showing that the manufacturer might have breached a duty by failing to retrofit its product with subsequently developed safety designs. 719 P.2d at 1063-64. Thus, none of these decisions articulate any discernable reasoning explaining their implicit adoption a duty to retrofit. In our view, such precedents constitute too flimsy a peg upon which to hang a new and potentially far-reaching legal theory of liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Of course, as noted supra, manufacturers of hazardous or unreasonably dangerous products may still be liable for failing to incorporate such safety features as were available and feasible at the time of manufacture or sale. We further emphasize that we do not decide in this appeal whether, or under what circumstances, a manufacturer who regains effective post-manufacture or post-sale control of its product would be subject to a duty to upgrade or retrofit its dangerous product with subsequently developed safety features. See Bell Helicopter Co. v. Bradshaw, 594 S.W.2d 519 (Tex. Ct. App. 1979). The fact remains that it is undisputed in the present case that Clark had no control over the Series 510 straddle carrier for twenty-five years prior to the accident that injured Tabieros.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. \"In 1986, the legislature enacted HRS § 663-8.9[,] which prohibits recovery for negligent infliction of emotional distress arising from damage to property or material objects, unless the distress results in physical injury to or mental illness of the person experiencing the distress.\" Masaki, 71 Haw. at 17 n.6, 780 P.2d at 575-76 n.6. See also Ross v. Stouffer Hotel Co. (Hawai'i) Ltd., 76 Haw. 454, 466 n.13, 879 P.2d 1037, 1049 n.13 (1994); Calleon v. Miyagi, 76 Haw. 310, 320 n.6, 876 P.2d 1278, 1288 n.6 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Clark argues that the circuit court erroneously failed to instruct the jury regarding the role of the following as possible \"superseding, intervening causes\": (a) the passage of time; (b) Navigation's status as a sophisticated user; and (c) a third party and/or plaintiff's negligence. Although Clark's arguments are by no means frivolous, we cannot say that the instructions given on the subject of superseding, intervening cause, when read and considered as a whole, were \"prejudicially insufficient, erroneous, inconsistent, or misleading.\" See Arceo, 84 Haw. at 11, 928 P.2d at 853; Craft, 78 Haw. at 302, 893 P.2d at 153. Because the instructions given on the issue correctly stated the general principles involved, it was not error for the circuit court to consign to Clark's closing argument an enumeration of the potential superseding, intervening causes that were arguably supported by the evidence and the application of legal principles, which the circuit court correctly enunciated in its instructions, to the specific facts of the case. See Montalvo, 77 Haw. at 286, 884 P.2d at 349.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Clark complains that the circuit court's jury instruction addressing the recoverability of punitive damages, \"although a correct partial statement of the Masaki standard, did not properly instruct the jury with regard to issues relating to punitive damages which were raised by this case.\" Accordingly, Clark urges that its proposed Instruction Nos. 60, 61, and 62, each of which was \"a correct statement of the law[,] . . . should have been given by the court.\" We disagree. The circuit court's jury instruction was a case-appropriate adaptation of the relevant principles expressly enunciated in Masaki, 71 Haw. at 15-17, 780 P.2d at 574-75, and Kang v. Harrington, 59 Haw. 652, 663, 587 P.2d 285, 293 (1978). See also Best Place, Inc. v. Penn Am. Ins. Co., 82 Haw. 120, 133-34, 920 P.2d 334, 347-48 (1996); Amfac, Inc. v. Waikiki Beachcomber Inv. Co., 74 Haw. 85, 138, 839 P.2d 10, 37, reconsideration denied, 74 Haw. 650, 843 P.2d 144 (1992). Given the state of the record, we hold that the instruction was not \"prejudicially insufficient, erroneous, inconsistent, or misleading.\" See Arceo, 84 Haw. at 11, 928 P.2d at 853; Craft, 78 Haw. at 302, 893 P.2d at 153. Clark's proposed Instruction Nos. 60 and 61, while correct statements of law as set forth in Masaki, 71 Haw. at 7, 780 P.2d at 570-71, were substantially and adequately covered by the circuit court's instruction. See State ex rel. Bronster v. United States Steel Corp., 82 Haw. 32, 52, 919 P.2d 294, 314 (1996); Montalvo, 77 Haw. at 286, 884 P.2d at 349; Richardson v. Sport Shinko (Waikiki Corp.), 76 Haw. 494, 504, 880 P.2d 169, 179 (1994). Moreover, the circuit court gave Clark's proposed Instruction No. 62, which paraphrased the language of Kang, 59 Haw. at 663, 587 P.2d at 293, in modified form, over Clark's objection. It is apparent to us that, without the modification, proposed Instruction No. 62 would have been misleading to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The plaintiffs' argument on appeal that Clark failed to warn about the precise extent of the blind zone is beside the point. A \"casual observer\" could clearly observe the blind zone that posed the danger of collisions without actually mapping or otherwise calculating its exact dimensions. We believe that Clark's expert, Simpson, hit the nail on the head during the following colloquy with the plaintiffs' counsel: [Plaintiffs' counsel:] No driver would have the same ability as on the Clark [straddle carrier] to know the exact extent of that blind spot, would they? [Simpson:] The driver probably [has] got the best way to know. He's sitting there driving and has his particular own blind spot. Q. You expect drivers to go out and tape measure and map out something like that [chart] . . . and know exactly how far the blind spot reaches in each direction? Is that something you expect the drivers on [that] equipment to do? . . . . A. You got it backwards. The chart is an attempt to reflect what the operator can see. What he sees is the blind spot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Clark raised the identical issue at trial in its motions for a directed verdict, which sought to limit the jury to the \"risk-utility\" test (i.e., the \"second test\") for purposes of determining the defectiveness of the straddle carrier's design. The circuit court denied Clark's motions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Section 402A of the Restatement provides in relevant part that \"one who sells any product in a defective condition unreasonably dangerous to the user or consumer or to his property is subject to liability for physical harm thereby caused to the ultimate user or consumer, or to his property . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. HRE Rule 403 provides: Exclusion of relevant evidence on grounds of prejudice, confusion, or waste of time. Although relevant, evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury, or by considerations of undue delay, waste of time, or needless presentation of cumulative evidence. This court has explained that \"unfair prejudice 'means an undue tendency to suggest [a] decision on an improper basis, commonly, though not necessarily, an emotional one.'\" Kaeo v. Davis, 68 Haw. 447, 454, 719 P.2d 387, 392 (1986) (quoting Advisory Committee's Note to Federal Rules of Evidence 403).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. HRE 401, entitled \"definition of 'relevant evidence,'\" provides that \"'relevant evidence' means evidence having any tendency to make the existence of any fact that is of consequence to the determination of the action more probable or less probable than it would be without the evidence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. HRE 402 provides: Relevant evidence generally admissible; irrelevant evidence inadmissible. All relevant evidence is admissible, except as otherwise provided by the Constitutions of the United States and the State of Hawaii, by statute, by these rules, or by other rules adopted by the supreme court. Evidence which is not relevant is not admissible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In this regard, the following exchange took place between the circuit court and Clark's counsel: THE COURT: I'll exclude the tapes. . . . . . . . [CLARK'S COUNSEL]: Your Honor, with regard to the videotape, before the Court rules we would ask the Court to view the videotape. I think only in looking at it could the Court make a determination as to whether -- since I assume the Court has based its ruling on [HRE] 403, it seems to me that only in viewing the videotape can the Court make a decision as to whether any confusion or prejudice is outweighed by the probative value. THE COURT: I'll look at it later but not today. I just don't have time today. You can ask for a reconsideration after I look at it but --.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Apparently, at the time of the second trial, the Series 510 straddle carrier was no longer in existence. The videotapes were produced several years earlier, prior to the first trial, in conjunction with studies conducted by the parties' experts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The foregoing proposition was subject only to the caveat that \"'it is essential that the jury be carefully instructed as to the extent to which they can use and consider the films or videotapes.'\" Loevsky, 70 Haw. at 428, 773 P.2d at 1126 (citing 3 C. Scott, Photographic Evidence § 1317 (2d. ed. Supp. 1987)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Plaintiffs' Exhibits 27C and 179 were introduced during the testimony of their expert, Howard Josephs, regarding design defects. The questions propounded by the plaintiff's counsel regarding the exhibits dealt exclusively with the straddle carrier's blind spot as a design defect and possible remedial steps that could have been taken to eliminate the defect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Clark also argues on appeal that Plaintiffs' Exhibit 27C should have been excluded as inadmissible hearsay, noting that the incident report was apparently prepared by someone other than the driver of either the straddle carrier or the pick-up truck and was unclear as to whether the reporter had actually spoken with the operator of the straddle carrier. However, Clark did not object at trial to the admissibility of either Plaintiffs' Exhibits 27C or 179 on hearsay grounds. In this connection, HRE 103 (1993) provides in relevant part: Rulings on evidence. (a) Effect of erroneous ruling. Error may not be predicated upon a ruling which admits or excludes evidence unless a substantial right of the party is affected, and: (1) Objection. In case the ruling is one admitting evidence, a timely objection or motion to strike appears of record, stating the specific ground of objection, if the specific ground was not apparent from the context[.] (Emphasis added.) Professor Bowman has observed that rule 103(a) should be read as if it were written as follows: \"Error may not be predicated [on appeal] upon a [trial] ruling which admits or excludes evidence unless. . . .\" The thrust of this rule is to establish record requirements and to furnish harmless error and plain error standards. Rule 103(a) places the burden of creating an adequate record squarely upon the parties and, more particularly, upon the party who loses the evidence point at trial. This follows from rule 103(a)(1) which requires timely and specific objections where evidence is admitted . . . . Where the opponent has failed to object specifically, . . . whichever party loses the point at trial should also lose on appeal because the flaw in the trial court's ruling was not articulated by the party with the natural incentive and opportunity to do so. . . . . . . . Rule 103(a) (1), which covers the situation where evidence is admitted at trial, requires a \"specific\" objection or motion to strike if the ground is \"not apparent from the context.\" The opponent can run afoul of rule 103(a) (1) in [various] ways. A complete failure to object will waive the point. Waiver will also occur when the trial objection, properly overruled, differs from that pressed on appeal. A. Bowman, Hawaii Rules of Evidence Manual 7-9 (1990) (citations omitted) (some brackets and ellipsis points in original and some added) (emphasis added). See also Wallace, 80 Haw. at 410, 910 P.2d at 723 (point of error waived where appellate challenge to testimony establishing weight of cocaine was premised on questioned accuracy of police scale, but trial objection had raised only relevance); State v. Matias, 57 Haw. 96, 101, 550 P.2d 900, 904 (1976) (\"There can be no doubt that the making of an objection upon a specific ground is a waiver of all other objections.\") (Citation and internal quotation marks omitted.)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The NPCR nowhere documents the credentials and official authority, if any, of the National Ports Council, and no evidence was adduced at trial in this regard. One of the plaintiffs' attorneys, however, submitted an affidavit in which he averred that he had been advised by one David Whitehead, who was apparently a representative of the United Kingdom's Department of Transportation, that the National Ports Council was, at one time, a \"quasi-governmental agency,\" which had been defunct since about 1980 and had possessed \"statutory powers.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In this respect, the plaintiffs are simply mistaken, inasmuch as no admissible evidence was adduced at trial that any of Clark's agents or employees had ever received the NPCR. On appeal, the plaintiffs rely heavily on an affidavit signed by Kenneth Dally -- allegedly one of the authors of the NPCR --, who claimed that copies of the NPCR had, at one time, been furnished to Navigation and one of Clark's wholly-owned subsidiaries. However, the Dally affidavit was never received as evidence at trial, having been excluded by the circuit court as inadmissible hearsay, a ruling that the plaintiffs have not challenged on appeal. There having been no other showing that either Clark or Navigation actually knew or should have known of the NPCR, the report was properly ruled irrelevant to the issue of notice. For the same reason, the plaintiffs' argument that the NPCR was relevant to the determination of punitive damages is equally without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. HRE 803 provides in relevant part: Hearsay exceptions; availability of declarant immaterial. The following are not excluded by the hearsay rule, even though the declarant is available as a witness: . . . . (b) Other exceptions. . . . . (8) Public records and reports. Records, reports, statements, or data compilations, in any form, of public offices or agencies, setting forth . . . (C) in civil proceedings . . ., factual findings resulting from an investigation made pursuant to authority granted by law, unless the sources of information or other circumstances indicate lack of trustworthiness. . . . . (18) Learned treatises. To the extent called to the attention of an expert witness upon cross-examination or relied upon by the witness in direct examination, statements contained in published treatises, periodicals, or pamphlets on a subject of history, medicine, or other science or art, established as a reliable authority by the testimony or admission of the witness or by other expert testimony or by judicial notice. If admitted, the statements may be read into evidence but may not be received as exhibits. . . . . (24) Other exceptions. A statement not specifically covered by any of the exceptions in this paragraph (b) but having equivalent circumstantial guarantees of trustworthiness, if the court determines that (A) the statement is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts, and (B) the general purposes of these rules and the interests of Justice will best be served by admission of the statement into evidence. . . . The commentary on HRE 803 is instructive. With respect to the public records exception, the commentary approves the view of the Advisory Committee's Note to Fed. R. Evid. 803(8) (C), which suggested that \"factors which may be of assistance in passing upon the admissibility of evaluative reports include: (1) the timeliness of the investigation. . . . (2) the special skill or experience of the official. . . . (3) whether a hearing was held and the level at which conducted. . . . (4) possible motivation problems suggested by Palmer v. Hoffman, 318 U.S. 109, 87 L. Ed. 645, 63 S. Ct. 477 (1943). Others no doubt could be added.\" (Ellipsis points in original commentary.) Regarding the learned treatise exception, the commentary states the following: Despite the circumstantial guarantee of the trustworthiness of such evidence provided by the high standards of accuracy customarily required in the learned professions, an unqualified rule of admissibility poses certain dangers. In the absence of expert interpretation, explanation, or qualification, a lay jury might misinterpret, misapply, or give excessive weight to evidence of this nature. Consistent with the position adopted in the federal rules, this exception safeguards against these hazards by limiting substantive use of treatises to situations in which an expert is on the stand. The Hawaii courts have closely adhered to the strict common law limitation on the use of treatises and technical materials, holding them inadmissible in the absence of an expert witness subject to cross-examination, Sherry v. Asing, 56 Haw. 135, 157-58, 531 P.2d 648, 663 (1975), and admitting them only for the purpose of testing the qualifications of expert witnesses, Tittle v. Hurlbutt, 53 Haw. 526, 497 P.2d 1354 (1972), or for impeaching them on cross-examination, Fraga v. Hoffschlaeger, 26 Haw. 557 (1922). This rule thus modifies prior case law, see Fraga v. Hoffschlaeger, supra, which precluded any substantive use of learned texts or treatises . . . . (Emphasis added.) Lastly, the commentary explains that the catchall exception provides for a measure of controlled flexibility in the judicial determination of what evidence should be admissible under this class of hearsay exceptions. The exception is not designed to open the door widely for otherwise inadmissible evidence; and to safeguard against abuse the requirements of trustworthiness and a high degree of relevance circumscribe the exercise of judicial discretion. Finally, the requirement for prior notification to the adverse party provides a protection against both excessive liberalization and unfair surprise. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Professor Bowman has written that investigative reports under subsection 803(b)(8)(C) . . . embody the results of some kind of government investigation . . . . . . . . . . . The proponent's burden under rule 803(b)(8)(C) . . . is . . . to show initially that her report results \"from an investigation made pursuant to authority granted by law\" and that it is based upon a factual investigation, and then be prepared to follow up by addressing the trustworthiness factors contained in the commentary. Hawai'i Rules of Evidence Manual at 348, 350 (citation and some internal quotation marks omitted) (brackets deleted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The plaintiffs offered no witnesses at trial who could otherwise authenticate the NPCR within meaning of HRE 901 (1993). See supra note 30. HRE 901 provides in relevant part: Requirement of authentication or identification. (a) General provision. The requirement of authentication or identification as a condition precedent to admissibility is satisfied by evidence sufficient to support a finding that the matter in question is what its proponent claims. (b) Illustrations. By way of illustration only, and not by way of limitation, the following are examples of authentication or identification conforming with the requirements of this rule: . . . . (7) Public records or reports. Evidence that a writing authorized by law to be recorded or filed and in fact recorded or filed in a public office, or a purported public record, report, statement, or data compilation, in any form, is from the public office where items of this nature are kept.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. In particular, the circuit court overruled Clark's objections to Josephs's testimonial references to the NPCR on the grounds that they (1) lacked proper foundation, (2) injected inadmissible and unreliable hearsay into the proceedings, and (3) published the hearsay extensively to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. It is noteworthy that, although Josephs responded, \"Yes,\" when asked if the NPCR constituted one of the bases of his opinion, he never testified that the NPCR contained the type of material upon which engineers would reasonably rely.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Clark cites State v. Davis, 53 Haw. 582, 589-90, 499 P.2d 663, 669 (1972) (\"An expert witness may not . . . serve as a mere conduit for the hearsay opinion, the factual basis of which is not established through evidence, of another expert who does not testify when the expert who does testify lacks the requisite qualifications to render the opinion in his own right. \" (Citations omitted.) (Emphasis added.)), and In re Tax Appeal of City and County of Honolulu, 73 Haw. 449, 466, 834 P.2d 1302, 1312 (1992) (Id., quoting Davis), for the general proposition that an expert may not serve as a mere conduit for hearsay opinions of others. These cases, however, are not dispositive of Clark's general proposition. In the present case, Josephs's qualifications to render opinions regarding the design and safety characteristics of the Series 510 straddle carrier were clearly established; as indicated, Josephs was quoting from the NPCR to support his expert opinion. We have recognized this distinction as significant. See Chung v. Kaonohi Center Co., 62 Haw. 594, 610 n.12, 618 P.2d 283, 293 n.12 (1980) (\"This case is distinguishable from State v. Davis.... In this instance, [the expert witness'] opinion was based on his own . . . knowledge .... In any event, we note that there is . . . substantial authority for the receipt of expert opinion testimony notwithstanding the fact that the expert's sources of information are not admissible. It is within the discretion of the trial court to disallow expert testimony where it feels the underlying facts or data indicate lack of trustworthiness. \" (Citations omitted.) (Emphasis added.)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Clark was acknowledged in the NPCR as having permitted the reproduction of certain photographs of its straddle carriers' cabs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Clark's motion in limine sought the exclusion of the NPCR, inter alia, on the ground of unreliability. We are aware that the circuit court did not expressly articulate its reasons for granting Clark's motion in limine in part. Thus, it is possible that the circuit court disallowed substantive use of the NPCR solely on the basis that it constituted inadmissible hearsay and not because it was deemed to be inherently unreliable. Nevertheless, the rationale underlying the rule against hearsay itself is that the prohibited material is inherently of dubious trustworthiness, especially inasmuch as the declarant is unavailable for cross-examination. See 2 J. Strong, McCormick on Evidence § 245 at 93-96 (4th ed. 1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Impairment ratings are standardized percentages of impairment of a bodily organ, a part of the body, or the whole body, based on formulaic guidelines published by the American Medical Association. In his testimony, Dr. Smith agreed that \"impairment,\" within the meaning of the guidelines, described \"an alteration of an individual's health status that is assessed by medical means.\" Dr. Smith also agreed that, by contrast, the term \"disability,\" as contemplated by the guidelines, signified \"an alteration in an individual's capacity to meet personal, social or occupational demands or to meet statutory or regulatory requirements\" and \"is assessed by non medical means.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. But see Cuarisma v. Urban Painters, Ltd., 59 Haw. 409, 418, 583 P.2d 321, 326 (1978) (citing with approval the statement -- appearing in Sen. Stand. Comm. Rep. No. 334, in 1963 Senate Journal, at 789, relating to Act 116, which amended the Workers' Compensation Law, presently codified as Hawai'i Revised Statutes (HRS) ch. 386 (1993 \u0026 Supp. 1996), inter alia, to insert the current definition of \"disability\" -- that \"[a] definition of disability has been added so as to make clear that disability means bodily impairment and not impairment of earning power\" (emphasis in original)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. By the same token, \"where a work injury causes partial disability, not determined to be permanent, which diminishes the employee's capacity for work,\" the injured employee is entitled to \"temporary partial disability\" benefits. HRS § 386-32(b) (1993 \u0026 Supp. 1996) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Clark did object to Dr. Smith rendering an opinion on this subject, but on foundational grounds, which the circuit court overruled. Clark has not appealed that particular evidentiary ruling.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Dr. Suyderhoud acknowledged that he had not been told that Tabieros had been offered full-time work in the bowling pro shop. He also conceded that he had unquestioningly utilized assumptions, which had been supplied by the plaintiffs' counsel and for which he had no empirical bases, in (1) positing Tabieros's retirement age, (2) calculating the value of Wilson's attendant care, (3) estimating the cost to Tabieros of a mortgage on property that he had previously held jointly with Wilson, but which came due after he had deeded the property entirely to her, (4) calculating Wilson's alleged loss on the subsequent sale of that property, and (5) assessing the cost of Tabieros's medical care without considering the medical benefits that he was receiving through his disability retirement plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Girardi described \"material handling\" as basically . . . a process, if you will, of moving material from one point to another. Primarily I deal with material handling equipment, lift trucks, towing tractors, things of that nature[,] whether it be used in industry or food processing businesses, pharmaceutical, that type of thing. You name the industry, [and] basically everybody deals with some type of material handling equipment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Josephs had been qualified as a \"human factors expert.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. HRS § 663-14 (1993) provides: Release; effect on injured person's claim. A release by the injured person of joint tortfeasors or one joint tortfeasor, whether before or after judgment, shall not discharge the other tortfeasors unless the releases or release so provide; but reduces the claim against the other tortfeasors in the amount of the consideration paid for the releases or release, or in any amount or proportion by which the releases or release provide that the total claim shall be reduced, if greater than the consideration paid. Accordingly, HRS § 663-14 . . . expressly permits a release to \"provide\" for the release of any enumerated joint tortfeasor .... Thus, in instances where plaintiffs, for any number of possible reasons, are \"willing\" to do so, they may contract selectively for the release of their claims against some joint tortfeasors and the retention of their claims against others. Saranillio v. Silva, 78 Haw. 1, 17, 889 P.2d 685, 701, reconsideration denied, 78 Haw. 421, 895 P.2d 172 (1995) (Levinson, J., Concurring) (emphases in original). Moreover, where a joint tortfeasor release \"makes no special provision concerning the amount or proportion by which the total claim is to be reduced, 'the claim against the other tortfeasors [is reduced] in the amount of the consideration paid for the . . . release[.]\" Id. at 14 n.6, 889 P.2d at 698 n.6 (brackets and ellipsis points in original). On the other hand, if, by agreement of the parties, a release reduces the plaintiff's claim against all unreleased joint tortfeasors by the greater of the amount of the consideration paid by the released tortfeasor or the released tortfeasor's proportionate responsibility for the plaintiff's total claim, then, by definition, there is no possibility that an unreleased tortfeasor could have a claim for indemnification against the settling released tortfeasor. This is the case because, by virtue of the contractual and proportionate reduction of the plaintiff's claim, an unreleased tortfeasor can never be liable to the plaintiff for any damages apportionable to the released tortfeasor. Obviously, a potentially settling tortfeasor always has the option of insisting on the full protections of HRS § 663-14. Whether a defendant-tortfeasor will choose to negotiate for these protections is a matter of his or her own cost-benefit analysis, although it is probably the rare defendant-tortfeasor who will not. Id. at 18, 889 P.2d at 702 (Levinson, J., Concurring) (emphases in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The sum of $759,440.00 represents Navigation's fifty-five percent share of Tabieros's general and special damages, as apportioned by the jury, plus the full amount of the punitive damages assessed against Navigation. See supra section I.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The sum of $459,660.00 represents Clark's thirty-four percent share of Tabieros's general and special damages, as apportioned by the jury, plus the full amount of the punitive damages assessed against Clark. See supra section I.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. For purposes of UCATA, HRS § 663-11 (1993) defines the term \"joint tortfeasors\" to mean \"two or more persons jointly or severally liable in tort for the same injury to person or property, whether or not judgment has been recovered against all or some of them.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Because we vacate, on other grounds, the portion of the circuit court's judgment favorable to the plaintiffs in its entirety and remand this matter for a new trial, we need not address the parties' arguments on appeal regarding the timeliness of Clark's post-judgment motions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. We note, however, that the Agreement expressly allocated the settlement proceeds -- to be paid by Navigation -- between Tabieros and Wilson. Inasmuch as we have affirmed the circuit court's directed verdict against Wilson with respect to her NIED claim, and because the jury awarded Wilson no damages on her remaining claims, she will not be a plaintiff on retrial of this case. Accordingly, the sum allocated in the Agreement to Wilson cannot affect any future award of damages to Tabieros. In other words, the amount by which any future judgment in Tabieros's favor and against Clark must be reduced is the amount paid by Navigation as consideration for its joint tortfeasor release, net of the sum allocated to settle Wilson's claims. As a final matter, the plaintiffs are mistaken that a reduction of Clark's liability to them in an amount exceeding Clark's pro rata share of the judgment would entitle Navigation \"to contribution from Clark for [the] amount\" of the excess. HRS § 663-12 (1993) provides in relevant part that \"[a] joint tortfeasor [such as Navigation] who enters into a settlement with the injured person is not entitled to recover contribution from another joint tortfeasor [such as Clark] whose liability to the injured person is not extinguished by the settlement.\" Inasmuch as the Agreement expressly preserved the plaintiffs' claims against Clark, it did not \"extinguish\" Clark's potential liability to the plaintiffs, and Navigation can have no future right of contribution against Clark in any amount.\u003c/span\u003e\n\n",
    "body_length": 222874,
    "citedas": [
      "944 P.2d 1279",
      "85 Haw. 336"
    ],
    "attorneys": "On the briefs: Lee T. Nakamura and Francis T. O'Brien for defendant-appellants/cross-appellee Clark Equipment Company. Jerry M. Hiatt and Paul M. Saito (of Bays, Deaver, Hiatt, Kawachika \u0026 Lezak) for plaintiffs-appellees/cross-appellants Sosimo B. Tabieros and Mitsuko H. Wilson.",
    "category": [
      "8",
      "188",
      "209"
    ],
    "judges": "Moon, C.J., Levinson, Nakayama, And Ramil, JJ., And Circuit Court Judge Chang, IN Place OF Klein, J., Recused",
    "citation_count": 20
  }
}
