{
  "id": "pIH4PWYBTlTomsSB5YRf",
  "document": {
    "title": "ACM Partnership v. C.I.R.",
    "full_title": "ACM PARTNERSHIP, SOUTHAMPTON-HAMILTON COMPANY, TAX MATTERS PARTNER IN NO. 97-7484 v. COMMISSIONER OF INTERNAL REVENUE ACM PARTNERSHIP, SOUTHAMPTON-HAMILTON COMPANY, TAX MATTERS PARTNER, v. COMMISSIONER OF INTERNAL REVENUE IN NO. 97-7527",
    "jurisdiction": "Third Circuit",
    "date": "1998-10-13T00:00:00.000Z",
    "docket": "Nos. 97-7484 and 97-7527",
    "body": "Argued June 23, 1998\n\nOPINION OF THE COURT\n\nI. INTRODUCTION\n\nAppellant ACM Partnership (\"ACM\"), through its tax matters partner Southampton-Hamilton Company (\"Southampton\"), appeals from a decision of the United States Tax Court dated June 12, 1997. The Tax Court's jurisdiction rested on I.R.C. §§ 7442, 6213 and 6226 based on appellant's timely filing of a petition seeking redetermination of a deficiency and review of a Final Partnership Administrative Adjustment. Appellate jurisdiction rests on I.R.C. § 7482(a)(1). Venue is proper pursuant to I.R.C. § 7482(b)(1)(A) as Southampton maintained its principal place of business within this circuit at the time it filed its petition. For the reasons that follow, we will affirm in part, reverse in part, dismiss the Commissioner of Internal Revenue's cross appeal, and remand for further proceedings.\n\nII. FACTUAL AND PROCEDURAL HISTORY\n\nThis appeal concerns the tax consequences of a series of transactions executed between November 1989 and December 1991 by appellant ACM, a partnership formed on October 27, 1989, with its principal place of business in Curacao, Netherlands Antilles. Each of ACM's three partners was created as a subsidiary of a larger entity several days before ACM's formation. Southampton was incorporated under Delaware law on October 24, 1989, as a wholly-owned subsidiary of Colgate-Palmolive Company (\"Colgate\"), an international consumer products company. Kannex Corporation N.V. (\"Kannex\") was incorporated under Netherlands Antilles law on October 25, 1989, as an entity controlled by Algemene Bank Nederland N.V. (\"ABN\"), a major Dutch bank. ACM's third partner, Merrill Lynch MLCS, Inc. (\"MLCS\"), was incorporated under Delaware law on October 27, 1989, as a wholly owned subsidiary of Merrill Lynch Capital Services, an affiliate of the financial services holding company Merrill Lynch \u0026 Co., Inc. (\"Merrill Lynch\"). See ACM Partnership v. Commissioner, 73 T.C.M. (CCH) 2189, 2190, 2197 (1997); app. at 81-84, 89-91.\n\nA. The Proposed Partnership\n\nThe concept behind the ACM partnership originated in a proposal which Merrill Lynch presented to Colgate in May 1989. During the previous year, Colgate had reported $104,743,250 in long-term capital gains which were attributable in significant part to the sale of its wholly owned subsidiary The Kendall Company (\"Kendall\"). See app. at 74-75. Colgate had considered and rejected several proposals to reduce the tax liability arising from those 1988 capital gains, see app. at 664, when Merrill Lynch representative Macauley Taylor approached Colgate's Assistant Treasurer Hans Pohlschroeder in May 1989 and proposed an investment partnership that would generate capital losses which Colgate could use to offset some of its 1988 capital gains. App. at 674-76, 784, 965.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nPohlschroeder related the plan to Colgate's Vice President of Taxation Steven Belasco, who expressed reservations because the plan entailed substantial costs, might not be recognized for tax purposes, and did not seem to serve Colgate's non-tax business purposes, and thus might not be well-received by Colgate's legal, financial, and accounting departments who would be required to participate in the plan. See 73 T.C.M. at 2191; app. at 1234-36. Colgate consulted a law firm for advice on the proposed transaction, which the law firm summarized as follows:\n\nA (a foreign entity), B, and C form the ABC Partnership (ABC) on June 30, 1989 with respective cash contributions of $75, $24 and $1. Immediately thereafter, ABC invests $100 in short-term securities which it sells on December 30, 1989, to an unrelated party. The fair market value and face amount of the short-term securities at the time of the sale is still $100. In consideration for the sale, ABC receives $70 cash and an installment note that provides for six semiannual payments . . . Each payment equals the sum of a notional principal amount multiplied by the London Interbank Offering Rate (LIBOR) at the start of the semiannual period.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e ABC uses the $70 cash and the first payment on the installment note to liquidate A's interest in ABC and uses the subsequent interest payments to purchase long-term securities.\n\n73 T.C.M. at 2191.\n\nThe law firm advised that the sale of the short-term securities would be reported as a contingent installment sale under the installment method which governs \"Dispositions[s] of property where at least 1 payment is to be received after the close of the taxable year in which the Disposition occurs,\" I.R.C. § 453, and the ratable basis recovery rule which provides that,\n\n[w]hen a stated maximum selling price cannot be determined as of the close of the taxable year in which the sale or other Disposition occurs, but the maximum period over which payments may be received under the contingent sale price agreement is fixed, the taxpayer's basis (inclusive of selling expenses) shall be allocated to the taxable years in which payment may be received under the agreement in equal annual increments.\n\nTemp. Treas. Reg. § 15a.453-1(c)(3)(i).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Thus, the law firm advised, ABC would recover $25 of its basis in each of the \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e taxable years from 1989 through 1992, and ABC would recognize gain to the extent that the payments received in any year exceeded the $25 or loss to the extent that the payments fell below the $25, but only if the loss were carried over to a year with sufficient reported gains against which to offset that loss. See 73 T.C.M. at 2191.\n\nOn July 18, Pohlschroeder and Taylor, who had presented Merrill Lynch's proposal to Pohlschroeder's colleagues in Colgate's treasury department, discussed Colgate's concerns about the proposed partnership transaction, including its costs and its potential to serve Colgate's business purposes. Pohlschroeder's handwritten notes of the conversation read as follows:\n\nBased on bus. purpose Economic profit Is this partnership profitable? Every single step to be substantiated invest in your own debt Consolidation of effective control but not majority ownership.\n\nApp. at 634, 791.\n\nColgate was interested in the concept of using the proposed partnership to invest in its own debt because of recent developments which had weighted Colgate's debt portfolio toward fixed-rate long-term debt, leaving Colgate vulnerable to a decline in interest rates.4 Moreover, persistent rumors that Colgate was a likely target for a hostile takeover or leveraged buyout had decreased the value of Colgate's debt issues due to the risk that Colgate's credit rating would be downgraded if Colgate became more highly leveraged. Because of these factors, Colgate perceived an opportunity to rebalance its debt profile, thus decreasing its exposure to falling interest rates, by acquiring its long-term debt issues at their presently discounted prices. See app. at 666-68, 880-82, 2762-63, 2765, 2769-70; 73 T.C.M. at 2192.\n\nColgate and Merrill Lynch discussed the possibility of using the proposed partnership to achieve these objectives. The acquisition of its own debt issues would decrease Colgate's exposure to falling interest rates because by acquiring those debt issues as an asset, Colgate effectively would reap the benefits of receiving the above-market interest payments due on those issues, thus hedging against the burdens associated with owing those payments. See 73 T.C.M. at 2193. Acquiring the debt through the partnership instead of directly would keep the acquisitions off Colgate's books, thus permitting Colgate to carry out its debt acquisition strategy without alerting potential acquirors to the internal accumulation of debt issues which, by increasing the capacity for internal leverage, would increase Colgate's vulnerability to a hostile takeover bid. See 73 T.C.M. at 2192-93; app. at 101, 3249-50, 1921-26, 2793-99, 2810, 2819-20, 3255-61. Thus, the acquisition of Colgate debt through the partnership would allow Colgate to use partnership capital to acquire its debt issues immediately at advantageous prices, then to retire and reissue the debt when market conditions were more favorable. In the interim, the debt effectively would be retired because Colgate would not owe the obligations thereon to third parties, yet the debt would remain outstanding for accounting purposes, reducing Colgate's vulnerability to potential acquirors. See app. at 673; 73 T.C.M. at 2193.\n\nOn July 28, 1989, Merrill Lynch presented a proposed partnership transaction summary which incorporated Colgate's debt acquisition objectives into the tax reduction proposal involving the contingent installment sale which Merrill Lynch had presented to Colgate in May 1989. See app. at 678-79. Merrill Lynch revised its proposals throughout the summer and approached ABN about participating in the partnership with Colgate and Merrill Lynch. Merrill Lynch explained to ABN that the partnership would invest in Colgate long-term debt to serve Colgate's debt management objectives, would engage in a contingent installment sale, and would require ABN's participation for no more than 2-3 years. ABN agreed to meet with Colgate representatives in the middle of October 1989. See 73 T.C.M. at 2193-94.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn a document dated August 17, 1989, Merrill Lynch set forth revisions to the planned partnership transactions which it had presented to Colgate on July 28, 1989. See app. at 275-77. This document, entitled \"Revised Partnership Transaction Summary,\" see app. at 263-67, set forth the following proposal incorporating both the contingent installment sales transaction which Merrill Lynch initially had proposed in May 1989 and the debt acquisitions which Merrill Lynch had incorporated in its July 28 proposal:\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n1) A Colgate subsidiary contributes $30 million, A BN contributes $169.3 million and Merrill Lynch contributes $.7 million.\n\n2) The partnership invests its entire $200 million capitalization in short-term, floating rate private placement securities as \"Interim Investments prior to the acquisition of [Colgate] debt\" which are to \"earn a return greater than comparably rated commercial paper or bank deposits.\"\n\n3) The partnership sells the short-term notes for a combination of cash and LIBOR-based notes and uses the cash to acquire Colgate debt. \"The purpose of the LIBOR notes will be to partly hedge the interest rate sensitivity of long-term [Colgate] debt acquired by the Partnership.\"\n\n4) The partnership exchanges a portion of the long - term Colgate debt for newly issued medium-term Colgate debt, pursuant to a provision which affords Colgate the option of making such exchanges through the partnership.\n\n5) The partnership adjusts its LIBOR note holdings. If the partnership retains a substantial amount of long-term debt, the Partnership \"would likely . . . acquire additional LIBOR-based assets or . . . other hedges to reduce interest rate sensitivity of Partnership assets. Alternatively, if a substantial amount of long-term [Colgate] debt is exchanged, the Partnership would likely reduce its holding of LIBOR notes. Such a reduction would be necessary because the Medium-Term Debt, received in exchange for long-term [Colgate] debt, is less interest rate sensitive than the long-term [Colgate] debt. LIBOR Notes may either be sold directly or distributed to one or more Partners in a non-liquidating distribution.\"\n\n6) If the partnership has not invested all of its capital in Colgate debt and LIBOR instruments, the partnership \"may liquidate some or all of the remaining Short-Term Notes and distribute the proceeds to one or more of the partners.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n7) \"Possible redemption of [ABN's] Partne rship interest. Commencing one year after formation of the Partnership, [ABN] has the right to have its Partnership interest redeemed by the Partnership . . . . The Partnership may redeem [ABN] in kind with Partnership property of its choosing or in cash. For example, assuming no change in asset values, the Partnership could borrow $169.3 million collateralized by its assets and use the proceeds to redeem [ABN].\"\n\n8) \"If [ABN] is redeemed, the Partnership must be consolidated with [Colgate] for financial reporting purposes. Accordingly, all assets, including [Colgate] debt . . . will appear on the [Colgate] consolidated balance sheet. The [Colgate] debt will be effectively retired at that time. . . . [I]f the [Colgate] debt were acquired at a premium or a discount, [Colgate] would recognize a loss or gain, respectively, for income statement purposes. It would be most reasonable for the Partnership to sell the LIBOR Note . . . if[ABN] is redeemed. Since the principal asset of the Partnership, other than LIBOR Notes . . . is likely to be [Colgate] debt and [Colgate] would be a 98% partner, the hedge protection provided by the LIBOR Notes . . . is no longer necessary.\" 9) \"After a period of years it might be advanta geous for [Colgate] affiliates to purchase [Merrill Lynch's] Partnership interest. Alternatively, the Partnership might be liquidated with [Colgate] receiving[Colgate] debt as proceeds of the liquidation.\"\n\nApp. at 275-77. The final page of that document addressed the tax considerations of the arrangement and stated,\n\nthe liquidation of $200 million of Short-Term Notes in exchange for approximately $140 million of cash and $60 million market value of LIBOR notes should result in approximately $106 million of gain to the Partnership. 15% of such gain, $16 million, will be allocable to [Colgate]. If . . . LIBOR notes are distributed to [Colgate], each $10 million market value of the LIBOR notes distributed should have a tax basis of approximately $28 million. In a succeeding tax year, the Partnership will recognize a loss on sale or at maturity of the remaining LIBOR Notes. 98% of such loss will be allocable to [Colgate] because[Colgate] will be a 98% partner at such time. Combined, losses on sale of LIBOR Notes distributed to [Colgate] and losses on sale of LIBOR Notes by the Partnership should exceed $106 million. Accordingly, [Colgate] should recognize a net loss of approximately $90 million. After discounting and transactions costs . . . the transaction produces over $20 million present value benefits to [Colgate].\n\nApp. at 279.\n\nA representative of ABN's legal department testified that the partnership, as he understood it, was to:\n\nenter into transactions that would create a capital gain and in a later stage a capital loss, and that . . . depending on the percentage of your participation, you would either take part in the gain or the loss. So by having us being the majority partner at the start, we would take the majority of the gain, while in a later stage one of the other partners would take the loss.\n\nApp. at 1298.\n\nIn a memorandum dated October 3, 1989, Pohlschroeder recommended the partnership to Colgate Treasurer Brian Heidtke. See App. at 310-21. Pohlschroeder outlined the advantages of repurchasing outstanding Colgate debt through a partnership, and stated that \"[t]he partnership would temporarily invest the funds in some short-term instruments and, at the same time, start the repurchasing program.\" App. at 312. The memorandum identified three sets of Colgate debt issues targeted for repurchase: 1) a set of 9.625% 30-year notes due in 2017 (\"Long Bonds\"); 2) a set of Eurodollar debentures due in 1996 (\"Euro notes\"); and 3) a set of 8.4% private placement notes held by Metropolitan Life Insurance Company (\"Metropolitan\") and due in 1998 (\"Met Notes\"). The memorandum stated that \"pursuant to an inquiry to Metropolitan, we feel confident that the partnership can purchase sufficient Colgate debt\" to carry out the proposed plan. App. at 313-14.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe memorandum's \"Interest Rate Outlook\" predicted that although the Federal Reserve Bank was not expected to \"quickly lower interest rates in the near future,\" it was expected to \"reduce the . . . rate\" by late 1989 or early 1990 to a level that would allow Colgate to \"lock in attractive medium term interest rates.\" App. at 311. The memorandum then analyzed the impact of a one to two percent interest rate increase or decrease on the LIBOR notes and the Colgate debt issues that the partnership expected to acquire. According to the analysis, a given decrease in interest rates would increase the value of the long-term Colgate debt and decrease the value of the LIBOR notes in roughly equal and offsetting amounts because the value of the LIBOR notes was directly dependent on interest rates whereas the value of the fixed-rate debt issues was inversely proportional to interest rates. See app. at 951-52, 313. Thus, the memorandum concluded, \"the LIBOR note is an effective hedge of fixed rate assets for the partnership.\" App. at 313. The memorandum stated that it would be necessary to establish a \"Desired Hedge Ratio\" of LIBOR holdings to long-term debt holdings, so that the partnership's assets would be \"fully hedged\" against changes in value due to interest rate fluctuations. App. at 314.\n\nThe memorandum recommended that Colgate proceed with the partnership as a means \"to actively manage its liability structure,\" and stated that the \"Next Steps\" after executing a partnership agreement, establishing the partnership in a \"Foreign Jurisdiction\" and funding the partnership were the following:\n\n-Short-term investment securities acquired.\n\n- . . . . Disposition of short-term investment securities to fund acquisition of Colgate debt.\n\nApp. at 321.\n\nIn a document marked \"REVISED 9/1/89,\" Merrill Lynch provided Colgate a \"Cost Component Analysis,\" which estimated after-tax costs associated with the proposed acquisition and Disposition of short-term notes and acquisition of LIBOR notes. Merrill Lynch estimated that the short-term notes would entail an \"origination\" cost of $1.32 million, while the \"remarketing\" of the LIBOR notes would cost $1.29 million in addition to $.17 million in legal expenses and $1.32 million in Merrill Lynch advisory fees. See app. at 294.\n\nA September 20, 1989 document delineated the details of the proposed partnership transactions and their anticipated tax consequences under I.R.C. § 453 and the ratable basis recovery rule, Temp. Treas. Reg. § 15a.453. See app. at 296-308. The document contemplated using the partnership's $200 million in cash investments to acquire short-term notes, see app. at 303, disposing of the short-term notes in exchange for $140 million in cash and LIBOR instruments which would generate contingent payments with a present value of $60 million, and using the $140 million in cash to purchase Colgate debt. App. at 300-01, 304-05. Because the partnership was to receive payments on the exchange over the course of six years, the $200 million basis in the short-term notes was to be recovered ratably over six tax years in equal increments of $33.3 million per year pursuant to § 15a.453. Thus, according to this document, the transaction would result in significant capital gains in the first year, consisting of the $106.7 million difference between the $140 million cash received that year and the $33.3 million basis recovered that year, and would result in capital losses in each of the ensuing years because the contingent payments received in each of those years considering imputed interest would fall short of the $33.3 million basis to be recovered in each of those years. See app. at 301. The aggregate projected capital losses in the ensuing years equaled precisely the amount of capital gains reported in the first year, and the document stated that the recognition of those losses \"may be accelerated in any year subsequent to 1989 by sale of the remaining LIBOR notes.\" App. at 301.\n\nThe document also contemplates Colgate's increasing its share in the partnership from 15% to 97% after the partnership recognized the $106.7 million capital gain in year 1 but before it recognized the capital losses in the ensuing years. See app. at 305-08. According to the document, the LIBOR notes eventually would be sold for a capital loss of $80 million, 97% of which would be allocated to Colgate based on its 97% partnership interest by the time the loss was incurred. See app. at 304, 308-09.\n\nAt an October 12, 1989 meeting of Colgate's Board of Directors, the Directors considered the proposal and stated that it:\n\nhad originally been presented . . . with a view toward minimizing the capital gains tax arising out of the Disposition of the Kendall business. However, major changes were made . . . so that the program would provide the important business advantages of accumulating [Colgate] debt in friendly hands and permitting [Colgate] to obtain flexibility in managing the ratio balance between short and long term debt and the resulting interest exposure. Without these treasury advantages, management would not have recommended this transaction.\n\nApp. at 337. According to Steven Belasco, Colgate's Vice President of Taxation, the incorporation of Colgate's debt acquisition objectives into Merrill Lynch's initial proposal afforded sufficient business advantages to overcome Colgate's hesitations about Merrill Lynch's initial proposal which served only the tax objectives of generating a capital loss to offset 1988 capital gains. See app. at 1235-36.\n\nB. The Partnership\n\nIn late September and early October 1989, as Colgate was contemplating final approval of its participation in the proposed partnership, Merrill Lynch was finalizing arrangements for ABN's participation in the partnership. An ABN document dated October 11, 1989, stated that it would agree to enter the partnership on the conditions that: 1) \"[t]he timing of the purchases and sales of the various securities be adhered to as proposed;\" 2) \"Colgate's obligation to purchase Kannex's interest in the partnership . . . is unconditional;\" and 3) Merrill Lynch agrees to repurchase the securities \"at par on November 29, 1989.\" 73 T.C.M. at 2197; app. at 1061, 1064-65.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nBetween October 24 and October 27, 1989, ABN established Kannex, Colgate established Southampton, and Merrill Lynch established MLCS to participate in the ACM partnership. See 73 T.C.M. at 2197; app. at 81-84, 89-91. The October 27, 1989 partnership agreement among these newly created entities provided that Kannex was to receive a preferred return of the first $1.24 million in any partnership profits otherwise allocable to Southampton. See app. at 101; 73 T.C.M. at 2198-99.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e On October 27, 1989, after executing the partnership agreement, the partners met and authorized Merrill Lynch to find willing sellers of Colgate debt issues, including the Euro Notes, Met Notes, and Long Bonds which had been identified in Pohlschroeder's October 3 memorandum. See app. at 313, 386. The partners resolved that \"in order to maximize the investment return on its assets pending the acquisition\" of these debt issues, Merrill Lynch was authorized \"to arrange the purchase (in a private placement) of $205 million of . . . unsecured debt.\" App. at 386-87.\n\nThe minutes of the partnership meeting reported that Colgate's treasury department had contacted Metropolitan with a proposal to purchase $100,000,000 of the Met notes, and that Metropolitan \"if interested, would come to Bermuda on November 17, 1989 in order to negotiate and make final such transaction.\" App. at 387. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Earlier in the fall of 1989, Pohlschroeder had initiated Discussions with Metropolitan about selling the notes after Metropolitan contacted him to express concern about certain terms in the notes. See app. 690-91, 742. Before the November 17 meeting, a Metropolitan representative left Pohlschroeder a message indicating the price at which Metropolitan was prepared to sell the Met notes. Pohlschroeder did not respond to the call. See 73 T.C.M. at 2200; app. at 883. Pohlschroeder previously had conferred with Merrill Lynch's Henry Yordan about acquiring the Met Notes, Euro Notes, and Long Bonds. See app. at 117-18; 73 T.C.M. at 2200. Pohlschroeder's handwritten memorandum of the conversations regarding the Met notes concludes with a notation of the date November 17, while his notations regarding the acquisition of the Long Bonds and Euro Notes state that Kannex would instruct Merrill Lynch after purchase of Citicorp notes which, as discussed below, were to serve as the initial short-term investment contemplated in the partnership proposals. 73 T.C.M. at 2200; app. at 880; 889-90.\n\nC. The Transactions\n\nOn November 2, 1989, Kannex contributed $169.4 million, Southampton contributed $35 million, and MLCS contributed $0.6 million to the newly created ACM partnership for a total partnership capitalization of $205 million. See app. at 98. Based on these contributions, Kannex held an 82.6% share of the partnership, Southampton held a 17.1% share, and MLCS held a 0.3% share. 73 T.C.M. at 2197; app. at 98. ACM deposited the $205 million in an account at ABN's New York branch paying interest at an annual rate of 8.75%. ACM withdrew the funds the following day and purchased ten private placement Citicorp notes in an aggregate amount of $205 million. The Citicorp notes paid interest monthly at a floating rate that was to be reset monthly. The initial rate was 8.78%, three basis points above the rate the funds were earning in the ABN account.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e On November 15, 1989, Citicorp made an interest payment and reset the interest rate to 8.65%. 73 T.C.M. at 2200.\n\nIn late October 1989, before ACM's November 3 acquisition of the Citicorp notes, Merrill Lynch had approached Bank of Tokyo (\"BOT\") and Banque Francaise du Commerce Exterieure (\"BFCE\") to negotiate selling them those notes.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e During the first week of November, Merrill Lynch forwarded BOT and BFCE specific terms of the proposed sale in which those two banks would purchase an aggregate of $175 million of the notes for $140 million in cash plus LIBOR notes providing for a five-year stream of quarterly payments with a net present value of approximately $35 million. See 73 T.C.M. at 2200; app. at 107-08.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e On November 9, 1989, BOT representatives requested approval from their head office, attaching documents which set forth \"all details of the transaction.\" On November 10, 1989, Merrill Lynch confirmed that it would sell $125 million in Citicorp notes to BOT and $50 million to BFCE. See app. at 111-14; 73 T.C.M. at 2200.\n\nOn November 17, 1989, ACM convened its second partnership meeting in Bermuda. A Metropolitan representative attended pursuant to Pohlschroeder's invitation to attend if interested in selling the Met Notes. After brief negotiations, ACM and Metropolitan agreed that ACM would purchase $100 million principal amount of Met Notes effective December 4, 1989. App. at 118-19, 390; 73 T.C.M. at 2201. Pohlschroeder stated that ACM would need to raise cash by the time of the December 4 purchase and that the acquisition of long-term fixed-rate debt\"would create a risk to the partnership in the event that interest rates increased.\" Accordingly, he recommended that ACM \"hedge its risk by purchasing notional principal contracts with a floating rate of interest.\" App. at 391. ACM thus resolved \"to arrange the sale of $175 million principal amount of Citicorp Notes\" to BOT and BFCE \"for cash and other LIBOR-based consideration, upon substantially the terms of a draft Installment Purchase Agreement presented to the meeting . . . in order to pay Metropolitan the amounts to be due . . . and to hedge . . . exposure to interest rate changes.\" App. at 391.\n\nACM completed the sale of the Citicorp notes on November 27, 1989, in accordance with the terms which Merrill Lynch had negotiated by November 10 and which ACM had approved on November 17, selling $125 million of the notes to BOT and $50 million of them to BFCE for a total of $140 million in cash and eight LIBOR notes issued by BOT and BFCE. The LIBOR notes provided for a stream of 20 quarterly contingent payments commencing on March 1, 1990, whose amount was derived from the three-month LIBOR multiplied by a notional principal amount of $97.76 million.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e In exchange for the $175,000,000 Citicorp notes, ACM received consideration totaling $174,410,814, which represented the $175,000,000 value of the Citicorp notes, reduced by the $1,093,750 in transaction costs for arranging the sale of these illiquid private placement instruments, but increased by the $504,564 in interest that had accrued on the Citicorp notes during the 12 days since their last interest payment on November 15. Accordingly, the LIBOR notes effectively cost ACM $35,504,564, the difference between the $175,504,564 in value which ACM relinquished and the $140,000,000 in cash which ACM received in return, but had a present value of $34,410,814 to reflect the $1,093,750 in transaction costs. See 73 T.C.M. 2201 02, 2206-10; app. at 751. The LIBOR notes issued by BOT accounted for $25,360,403 of the aggregate cost and $24,579,153 of the aggregate present value, while those issued by BFCE accounted for $10,144,161 of the aggregate cost and $9,831,661 of the aggregate present value of the LIBOR notes acquired in the exchange. See 73 T.C.M. at 2201.\n\nUpon selling the Citicorp notes on November 27, ACM invested the $140 million in cash proceeds in time deposits and certificates of deposit due seven days later on December 4, 1989, and bearing interest at 8.15% to 8.20%. In several transactions between December 4 and 8, ACM purchased Colgate debt including $100 million of the Met Notes pursuant to the November 17 agreement, $5 million of the Euro Notes, and $31 million of the Long Bonds. See app. at 118-20. ACM purchased an additional $18.75 million in Colgate long-term debt issues between June and October 1990. See 73 T.C.M. at 2205; app. at 119-20, 122-23.\n\nDuring the weeks preceding ACM's November 27 acquisition of the LIBOR notes, Merrill Lynch began arranging to sell a portion of them. In a November 13, 1989 memorandum entitled \"Analysis of Partnership Hedging Activity,\" Merrill Lynch stated that certain events would warrant a reduction in the desired amount of LIBOR holdings. Specifically, Merrill Lynch explained that if Southampton elected to increase its share of the partnership's interest rate risk, as it was entitled to do under a provision of the partnership agreement, see app. at 101; 73 T.C.M. at 2198-99, or if ACM exchanged the Long Bonds for a new issue of five-year Colgate debt, ACM should reduce its LIBOR note holdings in light of its diminished need for their hedging function. See 73 T.C.M. at 2202. Merrill Lynch approached a major Danish bank, Sparekassen SDS (\"Sparekassen\"), offering it the BFCE LIBOR notes which totaled approximately $10 million, along with collateral swaps which provided Sparekassen risk protection and a return on its investment. On December 5, 1989, Sparekassen set aside a $10 million credit line in preparation for the transaction. See 73 T.C.M. at 2202.\n\nAt ACM's third partnership meeting on December 12, 1989, Southampton elected to increase its share of ACM's interest rate exposure and ACM exchanged a portion of the Long Bonds for shorter-term debt issues pursuant to\"the terms of a Note Purchase Agreement presented to the meeting.\" See app. at 101, 396-97; 73 T.C.M. at 2205. Merrill Lynch advised that ACM decrease its LIBOR note holdings in light of these factors reducing its interest rate exposure. App. at 397. ACM resolved to distribute the BFCE LIBOR notes to Southampton as a return of contributed capital, and executed Assignment Agreements conveying those notes to Southampton. See app. at 124, 398.\n\nOn December 22, 1989, Southampton sold the BFCE notes to Sparekassen for aggregate consideration of $9,406,180, an amount $425,481 below the $9,831,661 present value of the notes when ACM acquired them on November 27. See app. at 125-26; 73 T.C.M. at 2201, 2202-03 \u0026 n.10. Of this discrepancy, $390,000 resulted from the transaction costs and bid-ask spread necessary to market the LIBOR notes, while the remaining shortfall resulted from the decreased value of the notes due to the decline in interest rates since November 27 and from a quarterly payment on the notes which reduced their remaining value. See 73 T.C.M. at 2202; app. at 1560-61, 1628.\n\nOn June 25, 1991, Colgate acquired a 38.31% share in ACM from Kannex for $85,897,203.60 and Southampton acquired an additional 6.69% share from Kannex for $15,000,000, giving Colgate-Southampton a majority interest in ACM. App. at 131-32, 414. Because it had acquired a majority interest in ACM, Colgate consolidated ACM's holdings with its own on its books, revealing its control of the debt issues which theretofore had remained outstanding on its books. See app. at 3249-50. ACM retained $30 million in Citicorp notes until October 16, 1991, when it put them to Citicorp at par pursuant to an option provision. ACM earned $4,329,191 of interest on the portion of the Citicorp notes which it held until 1991. See app. at 507-67, 570-98.\n\nOn November 27, 1991, ACM redeemed Kannex's remaining partnership interest for $100,775,915, leaving Colgate and Southampton with a combined 99.7% interest in ACM. App. at 137-38. At a December 5, 1991 partnership meeting, Merrill Lynch stated that because Colgate owned virtually the entire partnership, its\"net economic exposure to the risk of interest rate fluctuations in the value of the Colgate debt was effectively minimal, and the Partnership need not maintain its position in the [LIBOR notes] to hedge against such exposure.\" App. at 408. Thus, Merrill Lynch explained, without the need for hedging, it was \"unwise for the Partnership to hold\" this \"highly volatile investment\" given the market's declining interest rates. ACM resolved to sell its remaining LIBOR notes, which were those issued by BOT, the BFCE LIBOR notes having been distributed to Southampton and subsequently sold to Sparekassen. App. at 409. On December 17, 1991, ACM sold the BOT LIBOR notes to BFCE for $10,961,581, a price that reflected a significant loss in value due to declining interest rates which had reduced the three-month LIBOR from 8.5% to 5.7% and transaction costs of $440,000 arising from the bid-ask spread needed to remarket the notes. See 73 T.C.M. at 2206; app. at 138.\n\nD. Tax and Financial Accounting of the Transactions\n\nOn its partnership return for the tax year ended November 30, 1989, ACM treated the November 27, 1989 exchange of the Citicorp notes as an installment sale under I.R.C. § 453, as ACM was to receive part of the consideration for that exchange \"after the close of the taxable year in which the Disposition occurs\" pursuant to § 453(b)(1). App. at 109. Because the quarterly LIBOR note payments would vary based on fluctuations in the LIBOR, there was no \"stated maximum selling price\" that could be identified \"as of the close of the taxable year in which the . . . . Disposition occurs.\" Thus, the transaction came within the terms of Temp. Treas. Reg. § 15a.453-1(c), whose ratable basis recovery rule provides that the taxpayer's basis \"shall be allocated to the taxable years in which payment may be received under the agreement in equal annual increments.\"\n\nAccordingly, ACM divided its $175,504,564 basis in the Citicorp notes, consisting of their $175 million purchase price and $504,564 of accrued payable interest, equally among the six years over which payments were to be received in exchange for those notes, and thus recovered one sixth of that basis, or $29,250,761, during 1989.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Subtracting this basis from the $140 million in cash consideration for the Citicorp notes, ACM reported a 1989 capital gain of $110,749,239.42 which it allocated among its partners according to their partnership shares, resulting in an allocation of $91,516,689 of the gain to Kannex, $18,908,407 to Southampton, and $324,144 to MLCS. See app. at 109, 144-66; 73 T.C.M. at 2203. Southampton and MLCS were subject to United States income tax on their respective shares of the gain, but Kannex as a foreign corporation was not. App. at 226-35.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nUnder the ratable basis recovery rule the tax basis remaining to be recovered over the following five years became $146,253,803, representing the difference between the $175,504,564 value of the Citicorp notes which ACM relinquished to acquire those notes and the $29,250,761 in basis recovered during the first year of the transaction. See app. at 110. Of the $146,253,803 reported as the remaining unrecovered tax basis after 1989, $41,786,801 was attributable to the BFCE LIBOR notes, whose actual cost was $10,144,161, while $104,467,002 was attributable to the BOT LIBOR notes, whose actual cost was $25,360,403. See 73 T.C.M. at 2201, 2203 \u0026 n.11.\n\nOn its 1989 tax return, Southampton reported its $18,908,407 share of the capital gain from the $140,000,000 cash received in exchange for the Citicorp notes, and reported a $32,429,839 capital loss from its December 22, 1989 sale to Sparekassen of the BFCE LIBOR notes which it had received in the December 12, 1989 distribution from ACM.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Because these capital losses completely offset the capital gains, Southampton reported a net 1989 capital loss of $13,521,432 and did not report any net tax liability on its share of ACM's gain from the Disposition of the Citicorp notes. See 73 T.C.M. at 2203.\n\nACM retained the Curacao office of Arthur Andersen \u0026 Co. as its accountants. In reviewing ACM's financial and tax accounting for 1989, the Arthur Andersen auditors noted that ACM's records were inconsistent in their treatment of the $1,093,750 spread between the amount of consideration ACM had paid for the LIBOR notes and their market value at the time of acquisition. Specifically, the auditors noted, ACM had not accounted for this transaction cost in its income statement, but had included it in the book value of the LIBOR notes contrary to a provision in the partnership agreement requiring that assets be recorded at fair market value. Due to this discrepancy, ACM's records effectively overstated the market value of the LIBOR notes and understated the transaction costs involved in acquiring them through the contingent installment sale. See 73 T.C.M. at 2204. The audit manager wrote the following memorandum in February 1990 to his colleagues regarding the discrepancy:\n\nColgate does not want the cost to sell [the Citicorp notes] of US $1,093,750 . . . in the . . . income statement of ACM. The reasons are mainly tax driven, as inclusion might set the IRS on top of the reasons why the partnership was constructed in the first place and thus the planned tax losses might be denied by the IRS. We . . . were requested to think with Colgate in order to keep the cost to sell out of the balance sheet.\n\nId.; see also app. at 141. Arthur Andersen proposed that to avoid accounting for the costs associated with the LIBOR notes, ACM could continue to record the transaction costs as part of the value of the LIBOR notes and could resolve the conflict with the market valuation provision of the partnership agreement by issuing \"a side letter to the partnership agreement stating that the LIBOR notes are the one exception to the valuation rules which now state valuation at market and would . . . then state valuation at market increased by the cost to sell the original Citicorp notes.\" Id.\n\nAt its February 28, 1990 partnership meeting, ACM adopted this approach and enacted special valuation rules which provided that the LIBOR notes, unlike other partnership assets, would be valued on ACM's books \"at cost\" rather than at market value and would be adjusted upon distribution of the note to a partner, redemption of the partnership interest of any partner, or liquidation of the partnership. See app. at 402, 407.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e This provision effectively transferred the transaction costs associated with exchanging the Citicorp notes for LIBOR notes to the partner that eventually received the notes in a distribution, as the market value would be less than the reported value of the distribution. See 73 T.C.M. at 2204. Thus, ACM's December 12, 1989 distribution of the BFCE LIBOR notes effectively passed those transaction costs to Southampton in accordance with the partners' understanding that Colgate and Southampton would bear the transaction costs associated with trading private placement notes. See app. at 1622-25.\n\nFor its tax year ended December 31, 1991, ACM reported a capital loss of $84,997,111 from its December 17, 1991 sale of the BOT LIBOR notes.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e This loss consisted of the difference between the $10,961,581 that ACM received for those notes and the remaining $95,958,692 basis in those notes. App. at 202-25. Of this amount of loss, $5.8 million resulted from a decline in the value of the LIBOR notes due to declining interest rates while $79,106,599 resulted from the application of the ratable basis recovery rule which effectively added to the tax basis of the LIBOR notes 5/6 of the $140 million value of the Citicorp notes which had been exchanged for cash. See 73 T.C.M. at 2206. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Because Colgate, together with its subsidiary Southampton, by that time owned 99.7% of the partnership, Colgate claimed 99.7% of the $84,997,111 capital loss on its 1991 return for a total capital loss of $84,537,479. App. at 247-51. Colgate then filed an amended 1988 return reporting this loss as a carryback pursuant to I.R.C. § 1212 to offset a portion of its 1988 capital gains. See app. at 252-62.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nE. The Tax Court Decision\n\nOn March 12, 1993, the Commissioner of Internal Revenue (\"Commissioner\") issued ACM a Notice of Final Partnership Administrative Adjustment (\"FPAA\") eliminating ACM's $110,749,239.42 installment gain from the sale of the Citicorp notes in November 1989, redetermining ACM's tax basis in the BFCE LIBOR notes distributed in December 1989, and disallowing the $84,997,111 capital loss deduction which ACM reported in 1991. See app. at 28-42. In writing this opinion we primarily focus on the capital loss aspects of the case, though it should be understood that the gain and loss are part of a single integrated plan. The Commissioner asserted in the FPAA that the transactions involving the purchase and sale of the Citicorp notes in exchange for cash and LIBOR notes, \"were shams in that they were prearranged and predetermined. . .. [S]aid transactions were devoid of economic substance necessary for recognition for federal income tax purposes and were totally lacking in economic reality. The transactions were created solely for tax motivated purposes without any realistic expectation of profit.\" App. at 39. On May 24, 1993, Southampton, in its capacity as ACM's tax matters partner, filed a petition in the Tax Court contesting the Commissioner's adjustments.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e ACM argued that its transactions were bona fide arm's length transactions at fair market value and had economic substance. . . . The purchase of the Citicorp notes on November 3, 1989, and the sale of a portion of the Citicorp notes on November 27, 1989, were not prearranged or predetermined, and both had economic substance. . . . . The sale of the Citicorp notes by ACM in exchange for fixed payments and contingent payments under the LIBOR Notes qualified for installment sale treatment under Treas. Reg. § 15a.453-1(c)(3).\n\nApp. at 25.\n\nThe Tax Court tried the case over a month-long period in 1996 and on March 5, 1997, issued a memorandum opinion upholding the Commissioner's adjustments on the grounds that \"[a] taxpayer is not entitled to recognize a phantom loss from a transaction that lacks economic substance.\" 73 T.C.M. at 2215. In reaching the Conclusion that ACM was not entitled to deduct its claimed capital losses, the court examined the stated purposes and anticipated economic consequences of the transaction, and found that the claimed losses were \"not economically inherent in\" the transactions but rather were\"created artificially\" by machinations whose only purpose and effect was to give rise to the desired tax consequences. Id. On April 4, 1997, ACM moved for reconsideration of the court's opinion, arguing that the transactions had sufficient economic substance to be respected for tax purposes. See app. at 3311-47. The court denied the motion on June 9, 1997. See app. at 3439-41.\n\nThe parties filed memoranda, pursuant to Tax Court Rule of Practice and Procedure 155, regarding the computation of tax liability in accordance with the Tax Court's memorandum opinion. See app. at 3385-444. ACM proposed a computation which disallowed deductions for the losses resulting from its application of the ratable basis recovery rule but which allowed the deduction of approximately $6,000,000 in actual economic losses resulting from the loss in value of the LIBOR notes. See app. at 3348-51, 3385-98. In a decision entered June 12, 1997, the Tax Court rejected ACM's computations and eliminated the entire $84,997,111 capital loss reported in 1991 as well as the 1989 capital gains reported in the first year of the Citicorp note transaction. See app. at 3444. ACM filed a timely notice of appeal on September 8, 1997. See app. at 39-40. The Commissioner filed a protective cross appeal seeking to preserve the right to proceed on alternate theories for sustaining the adjustments in the event that the Tax Court's application of the economic substance doctrine were reversed. See app. at 3447.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIII. DISCUSSION\n\nA. Economic Substance and the Sham Transaction Doctrine\n\nWe must decide whether the Tax Court erred in disallowing ACM's claimed $110,749,239.42 capital gain in 1989 and its $84,997,111 capital loss which the court characterized as a \"phantom loss from a transaction that lacks economic substance.\" 73 T.C.M. at 2215. While we conduct plenary review of the Tax Court's legal Conclusions, we review its factual findings, including its ultimate finding as to the economic substance of a transaction, for clear error. See Fredericks v. Commissioner, 126 F.3d 433, 436 (3d Cir. 1997); Harbor Bancorp v. Commissioner, 115 F.3d 722, 727 (9th Cir. 1997), cert. denied, 118 S. Ct. 1035 (1998); Northern Indiana Pub. Serv. Co. v. Commissioner, 115 F.3d 506, 510 (7th Cir. 1997); Ferguson v. Commissioner, 29 F.3d 98, 101 (2d Cir. 1994); Lukens v. Commissioner, 945 F.2d 92, 97 (5th Cir. 1991); Karr v. Commissioner, 924 F.2d 1018, 1022 (11th Cir. 1991); Rice's Toyota World, Inc. v. Commissioner, 752 F.2d 89, 92 (4th Cir. 1985).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nACM contends that, because its transactions on their face satisfied each requirement of the contingent installment sale provisions and regulations thereunder, it properly deducted the losses arising from its \"straightforward application\" of these provisions, which required it to recover only one sixth of the basis in the Citicorp notes during the first of the six years over which it was to receive payments. See Temp. Treas. Reg. § 15a.453-1(c).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Thus, ACM contends, it properly subtracted the basis in the LIBOR notes to include the remaining five sixths of the basis in the Citicorp notes used to acquire them.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Consequently, ACM argues it properly subtracted the approximately $96 million remaining unrecovered basis in the BOT LIBOR notes from the approximately $11 million consideration it received upon Disposition of those notes, see br. at 32; app. at 202-03, and correctly recognized and reported the gains and losses arising from its sale or exchange of property in accordance with I.R.C. § 1001.\n\nWhile ACM's transactions, at least in form, satisfied each requirement of the contingent installment sale provisions and ratable basis recovery rule,\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e ACM acknowledges that even where the \"form of the taxpayer's activities indisputably satisfie[s] the literal requirements\" of the relevant statutory language, the courts must examine \"whether the substance of those transactions was consistent with their form,\" br. at 21, because a transaction that is \"devoid of economic substance . . . simply is not recognized for federal taxation purposes.\" Lerman v. Commissioner, 939 F.2d 44, 45 (3d Cir. 1991).\n\nWe begin our economic substance analysis with Gregory v. Helvering, 293 U.S. 465, 55 S.Ct. 266 (1935), the Supreme Court's foundational exposition of economic substance principles under the Internal Revenue Code. In Gregory, as in this case, the transactions on their face satisfied \"every element required by\" the relevant statutory language. Gregory, 293 U.S. at 468, 55 S.Ct. at 267.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The taxpayer, instead of transferring stock from her wholly-owned corporation directly to herself which would have generated taxable dividends, created a new corporation, transferred the stock to the new corporation, then liquidated the new corporation, transferred the stock to herself, and asserted that she had not recognized any taxable gain because she had received the stock\"in pursuance of a plan of reorganization\" within the meaning of I.R.C. § 112(g). Although the transactions satisfied each element of the statute, which defined \"reorganization\" as a transfer of assets between corporations under common control, the Court found that \"[t]he whole undertaking, though conducted according to the [statutory] terms . . . was in fact an elaborate and devious form of conveyance masquerading as a corporate reorganization.\" Id. at 469, 55 S.Ct. at 268.\n\nThe Court stated that \"if a reorganization in reality was effected\" any \"ulterior [tax avoidance] purpose . . . will be disregarded\" and the transaction will be respected for tax purposes. Id., 55 S.Ct. at 267. The Court emphasized, however, that where the transactions merely \"put on the form of a corporate reorganization as a disguise for concealing its real character\" which was a \"preconceived plan . . . not to reorganize a business,\" but rather \"to transfer . . . . shares to the [taxpayer],\" the transaction was not, in reality, \"the thing which the statute intended.\" Viewed according to their substance rather than their form, the Court found, the transactions fell \"outside the plain intent of the statute\" and therefore could not be treated in accordance with their form without \"exalt[ing] artifice above reality.\" Id. at 469-70, 55 S.Ct. at 267-68. Thus, pursuant to Gregory, we must \"look beyond the form of [the] transaction\" to determine whether it has the\"economic substance that [its] form represents,\" Kirchman v. Commissioner, 862 F.2d 1486, 1490 (11th Cir. 1989), because regardless of its form, a transaction that is \"devoid of economic substance\" must be disregarded for tax purposes and \"cannot be the basis for a deductible loss.\" Lerman, 939 F.2d at 45; accord United States v. Wexler, 31 F.3d 117, 122 (3d Cir. 1994).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nIn applying these principles, we must view the transactions \"as a whole, and each step, from the commencement . . . to the consummation . . . is relevant.\" Weller v. Commissioner, 270 F.2d 294, 297 (3d Cir. 1959); accord Commissioner v. Court Holding Co., 324 U.S. 331, 334, 65 S.Ct. 707, 708 (1945). The inquiry into whether the taxpayer's transactions had sufficient economic substance to be respected for tax purposes turns on both the \"objective economic substance of the transactions\" and the \"subjective business motivation\" behind them. Casebeer v. Commissioner, 909 F.2d 1360, 1363 (9th Cir. 1990); accord Lerman, 939 F.2d at 53-54 (noting that sham transaction has been defined as a transaction that \"has no business purpose or economic effect other than the creation of tax deductions\" and holding that taxpayer was not entitled \"to claim `losses' when none in fact were sustained\"). However, these distinct aspects of the economic sham inquiry do not constitute discrete prongs of a \"rigid two-step analysis,\" but rather represent related factors both of which inform the analysis of whether the transaction had sufficient substance, apart from its tax consequences, to be respected for tax purposes. Casebeer, 909 F.2d at 1363; accord James v. Commissioner, 899 F.2d 905, 908-09 (10th Cir. 1990); Rose v. Commissioner, 868 F.2d 851, 854 (6th Cir. 1989). For the reasons that follow, we find that both the objective analysis of the actual economic consequences of ACM's transactions and the subjective analysis of their intended purposes support the Tax Court's Conclusion that ACM's transactions did not have sufficient economic substance to be respected for tax purposes.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\n1. Objective Aspects of the Economic Sham Analysis\n\nIn assessing the economic substance of a taxpayer's transactions, the courts have examined \"whether the transaction has any practical economic effects other than the creation of income tax losses,\" Jacobson v. Commissioner, 915 F.2d 832, 837 (2d Cir. 1990) (citations and internal quotations omitted), and have refused to recognize the tax consequences of transactions that were devoid of \"nontax substance\" because they\"did not appreciably affect [the taxpayer's] beneficial interest except to reduce his tax.\" Knetsch v. United States, 364 U.S. 361, 366, 81 S.Ct. 130, 135 (1960). In Knetsch, the taxpayer had purchased annuity savings bonds from an insurance company, borrowed virtually their entire value against them, made payments back to the insurance company, and characterized those payments as deductible interest. Because the borrowing against the bonds had reduced their value to a mere \"pittance,\" leaving the taxpayer with nothing of value apart from tax deductions, the Court concluded that the net effect of the transfers between the taxpayer and the insurance company amounted only to payment of a \"fee for providing the facade of `loans' whereby the [taxpayers] sought to reduce their . . . taxes\" and therefore could not be characterized as payment of interest on a debt. Id. at 366, 81 S.Ct. at 135 (citation and internal quotation omitted).\n\nIn Weller, 270 F.2d 294, we examined a similar series of transactions in which the taxpayer purchased annuity policies, pledged them as collateral to borrow funds, used the borrowed funds to prepay future annual premiums on the policies, prepaid `interest' on an anticipated additional loans against the policies, then used the proceeds of the additional loans to repay the earlier loans, and sought to deduct the prepayments as interest. See id. at 295-96. Applying Gregory, we disallowed the deduction on the grounds that \"transactions which do not vary control or change the flow of economic benefits are to be dismissed from consideration\" if they \"do not appreciably change the taxpayer's financial position.\" Id. at 297 (citations and internal quotations omitted). We therefore disregarded the transactions for tax purposes even though the taxpayer had made actual payments which satisfied the statutory definition of an \"amount paid . . . on indebtedness incurred . . . to purchase a single premium life insurance contract,\" much as the Supreme Court had disregarded the transaction in Gregory despite the fact that the taxpayer had created \"a real, valid, corporate entity\" and carried out a transaction that was \"within the terms of the statute.\" Id. at 296-98.\n\nIn the context of property Dispositions, the courts have applied the economic substance doctrine in a similar manner to disregard transactions which, although involving actual transactions disposing of property at a loss, had no net economic effect on the taxpayer's economic position, either because the taxpayer retained the opportunity to reacquire the property at the same price, or because the taxpayer offset the economic effect of the Disposition by acquiring assets virtually identical to those relinquished. See, e.g., Lerman, 939 F.2d at 48; Merryman v. Commissioner, 873 F.2d 879 (5th Cir. 1989); Kirchman, 862 F.2d at 1488, 1492-93; Yosha v. Commissioner, 861 F.2d 494, 501 (7th Cir. 1988). Although the taxpayers in these cases actually and objectively disposed of their property, the courts examined the Dispositions in their broader economic context and refused to recognize them for tax purposes where other aspects of the taxpayers' transactions offset the consequences of the Disposition, resulting in no net change in the taxpayer's economic position. In light of these cases, we must determine whether the Tax Court erred in concluding that ACM's exchange of the Citicorp notes for contingent-payment LIBOR notes which gave rise to the tax consequences at issue generated only \"a phantom loss\" that was not \"economically inherent in the object of the sale\" and did not have \"economic substance separate and distinct from economic benefit achieved solely by tax reduction.\" 73 T.C.M. at 2215. For the following reasons, we conclude that it did not.\n\n2. Objective Economic Consequences of ACM's Transactions\n\nWhile the Tax Court's analysis focused on the lack of non-tax purposes behind ACM's transactions rather than on their objective economic consequences, the court made numerous findings that were indicative of the lack of objective economic consequences arising from ACM's short-swing acquisition and Disposition of the Citicorp notes between November 3 and November 27, 1989. The court noted that ACM sold the Citicorp notes \"for consideration equal to [their] purchase price\" and thus did not realize any gain or loss in the notes' principal value. 73 T.C.M. at 2215 n.19.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Moreover, as the court observed, the lack of change in principal value was not merely coincidental, but was inherent in the terms of the notes and of the transactions in which they were traded. See id. at 2219-20. Likewise, the court found that the interest income generated by the notes could not have a material effect on ACM's financial position because the Citicorp notes paid interest at a rate that varied only nominally from the rate that ACM's cash contributions \"were already earning . . . in . . . deposit accounts before the notes were acquired,\" resulting in only a $3,500 difference in yield over the 24-day holding period, a difference which was obliterated by the transaction costs associated with marketing private placement notes to third parties. Id. at 2218, 2220-21.\n\nThese findings, which are amply supported by the record, demonstrate a lack of objective economic consequences arising from ACM's offsetting acquisition and virtually immediate Disposition of the Citicorp notes.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e On November 3, 1989, ACM invested $175 million of its cash in private placement Citicorp notes paying just three basis points more than the cash was earning on deposit, then sold the same notes 24 days later for consideration equal to their purchase price, in a transaction whose terms had been finalized by November 10, 1989, one week after ACM acquired the notes.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e These transactions, which generated the disputed capital losses by triggering the application of the ratable basis recovery rule, offset one another with no net effect on ACM's financial position. Examining the sequence of ACM's transactions as a whole as we must in assessing their economic substance, see Court Holding Co., 324 U.S. at 334, 65 S.Ct. at 708; Weller, 270 F.2d at 297, we find that these transactions had only nominal, incidental effects on ACM's net economic position.\n\nViewed according to their objective economic effects rather than their form, ACM's transactions involved only a fleeting and economically inconsequential investment in and offsetting divestment from the Citicorp notes. In the course of this brief interim investment, ACM passed $175 million of its available cash through the Citicorp notes before converting 80% of them, or $140 million, back into cash while using the remaining 20%, or $35 million, to acquire an amount of LIBOR notes that was identical, apart from transaction costs, to the amount of such notes that ACM could have acquired by investing its $35 million in cash directly into such assets. Thus, the transactions with respect to the Citicorp notes left ACM in the same position it had occupied before engaging in the offsetting acquisition and Disposition of those notes.\n\nJust as the taxpayer in Gregory engaged in offsetting transactions by creating a new corporation, transferring stock to the corporation, transferring the stock back out of the corporation and then liquidating the corporation, just as the taxpayers in Knetsch and Weller engaged in offsetting transactions by acquiring annuity policies and borrowing back virtually their entire value, and just as the taxpayers in Lerman and the other property Disposition cases engaged in inconsequential transactions by disposing of property while retaining the opportunity to reacquire the same or virtually identical property at the same price, so ACM engaged in mutually offsetting transactions by acquiring the Citicorp notes only to relinquish them a short time later under circumstances which assured that their principal value would remain unchanged and their interest yield would be virtually identical to the interest yield on the cash deposits which ACM used to acquire the Citicorp notes.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nGregory requires us to determine the tax consequences of a series of transactions based on what \"actually occurred.\" 293 U.S. at 469, 55 S.Ct. at 267. Just as the Gregory Court found that the intervening creation and dissolution of a corporation and transfer of stock thereto and therefrom was a \"mere device which put on the form of a corporate reorganization as a disguise for concealing its real character\" which amounts to a mere \"transfer .. . of corporate shares to the [taxpayer],\" so we find that ACM's intervening acquisition and Disposition of the Citicorp notes was a mere device to create the appearance of a contingent installment sale despite the transaction's actual character as an investment of $35 million in cash into a roughly equivalent amount of LIBOR notes.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Thus, the acquisition and Disposition of the qualifying private placement Citicorp notes, based upon which ACM characterized its transactions as a contingent installment sale subject to the ratable basis recovery rule, had no effect on ACM's net economic position or non-tax business interests and thus, as the Tax Court properly found, did not constitute an economically substantive transaction that may be respected for tax purposes. See Gregory, 293 U.S. at 469-70, 55 S.Ct. at 267-68; Knetsch, 364 U.S. at 366; Lerman, 939 F.2d 44; Weller, 270 F.3d at 297.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nACM contends that the Tax Court was bound to respect the tax consequences of ACM's exchange of Citicorp notes for LIBOR notes because, under Cottage Sav. Ass'n v. Commissioner, 499 U.S. 554, 111 S.Ct. 1503 (1991), an exchange of property for \"materially different\" assets is a substantive Disposition whose tax effects must be recognized. We find Cottage Savings inapposite. The taxpayer in that case, a savings and loan association, owned fixed-rate mortgages whose value had declined as interest rates had risen during the preceding decade. The taxpayer simultaneously sold those mortgages and purchased other mortgages which were approximately equal in fair market value, but far lower in face value, than the mortgages which the taxpayer relinquished. The Court found that the exchange for different mortgages of equivalent value afforded the taxpayer \"legally distinct entitlements,\" and thus was a substantive Disposition which entitled the taxpayer to deduct its losses resulting from the decline in value of the mortgages during the time that the taxpayer held them. Id. at 566, 111 S.Ct. at 1511.\n\nThe distinctions between the exchange at issue in this case and the exchange before the Court in Cottage Savings predominate over any superficial similarities between the two transactions. The taxpayer in Cottage Savings had an economically substantive investment in assets which it had acquired a number of years earlier in the course of its ordinary business operations and which had declined in actual economic value by over $2 million from approximately $6.9 million to approximately $4.5 million from the time of acquisition to the time of Disposition. See Cottage Sav., 499 U.S. at 557-58, 111 S.Ct. at 1506. The taxpayer's relinquishment of assets so altered in actual economic value over the course of a long-term investment stands in stark contrast to ACM's relinquishment of assets that it had acquired 24 days earlier under circumstances which assured that their principal value would remain constant and that their interest payments would not vary materially from those generated by ACM's cash deposits.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nWhile the Dispositions in Cottage Savings and in this case appear similar in that the taxpayer exchanged the assets for other assets with the same net present value, beneath this similarity lies the more fundamental distinction that the Disposition in Cottage Savings precipitated the realization of actual economic losses arising from a long-term, economically significant investment, while the Disposition in this case was without economic effect as it merely terminated a fleeting and economically inconsequential investment, effectively returning ACM to the same economic position it had occupied before the notes' acquisition 24 days earlier.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nAs the Supreme Court emphasized in Cottage Savings, deductions are allowable only where the taxpayer has sustained a \" `bona fide' \" loss as determined by its \" `[s]ubstance and not mere form.' \" 499 U.S. at 567-68, 111 S.Ct. at 1511 (quoting Treas. Reg. § 1.165-1(b)). According to ACM's own synopsis of the transactions, the contingent installment exchange would not generate actual economic losses. Rather, ACM would sell the Citicorp notes for the same price at which they were acquired, see app. at 275-77, 321, 300, generating only tax losses which offset precisely the tax gains reported earlier in the transaction with no net loss or gain from the Disposition. See app. at 301.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Tax losses such as these, which are purely an artifact of tax accounting methods and which do not correspond to any actual economic losses, do not constitute the type of \"bona fide\" losses that are deductible under the Internal Revenue Code and regulations.\n\nWhile ACM contends that \"it would be absurd to conclude that the application of the Commissioner's own [ratable basis recovery] regulations results in gains or losses that the Commissioner can then deem to be other than `bona fide,' \" reply br. at 14, its argument confounds a tax accounting regulation which merely prescribes a method for reporting otherwise existing deductible losses that are realized over several years with a substantive deductibility provision authorizing the deduction of certain losses. In order to be deductible, a loss must reflect actual economic consequences sustained in an economically substantive transaction and cannot result solely from the application of a tax accounting rule to bifurcate a loss component of a transaction from its offsetting gain component to generate an artificial loss which, as the Tax Court found, is \"not economically inherent in\" the transaction. 73 T.C.M. at 2215.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Based on our review of the record regarding the objective economic consequences of ACM's short-swing, offsetting investment in and divestment from the Citicorp notes, we find ample support for the Tax Court's determination that ACM's transactions generated only \"phantom losses\" which cannot form the basis of a capital loss deduction under the Internal Revenue Code.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\n3. Subjective Aspects of the Economic Sham Analysis\n\nIn making its determination that it did \"not find any economic substance\" in ACM's transactions, the Tax Court relied extensively on evidence that the transactions were not intended to serve any \"useful non-tax purpose\" and were not reasonably expected to generate a pre-tax profit. See 73 T.C.M. at 2215, 2229. ACM contends, br. at 34, that the Tax Court improperly conducted a \"generic tax-independent\" inquiry into the non-tax purposes and potential pre-tax profitability of the transaction based on a misapplication of Gregory, 293 U.S. at 469, 55 S.Ct. at 267. According to ACM, the Tax Court mistook Gregory's scrutiny of the \"business or corporate purpose\" behind the transaction for a universally applicable aspect of the economic substance analysis when in reality, ACM contends, Gregory undertook this inquiry only because the specific Internal Revenue Code provision there at issue required that the transaction be effected \"pursuant to a plan of reorganization.\" See br. at 20-23 (citing Gregory, 293 U.S. at 469, 55 S.Ct. at 267). Thus, ACM argues, the Tax Court erred in considering the intended purpose and expected profitability of the transactions in this case where the relevant provisions providing for the gain or loss on sales or exchanges of property, I.R.C. § 1001, and for the treatment of installment sales, I.R.C. § 453, do not require a particular business purpose or profit motive. See id.\n\nWe disagree, and find that the Tax Court's analysis properly rested on economic substance cases applying provisions which, like those relevant in this case, do not by their terms require a business purpose or profit motive. In Goldstein v. Commissioner, 364 F.2d 734, 736 (2d Cir. 1966), the court analyzed the economic substance of a transaction under I.R.C. § 163(a), which provides, in purely objective terms without reference to a business purpose or profit motive, that \"[t]here shall be allowed as a deduction all interest paid or accrued within a taxable year on indebtedness.\" The Goldstein court acknowledged that this broad language did not require \"that the deductible interest serve a business purpose, that it be ordinary and necessary, or even that it be reasonable,\" but found that the language did not permit deductions arising from a transaction that had \"no substance or purpose aside from the taxpayer's desire to obtain the tax benefit of an interest deduction.\" Id. at 741-42. Thus, the court found, the taxpayer was not entitled to deduct her substantial interest charges, although they had accrued in an arms'-length transaction, because she had incurred the underlying debt for the sole purpose of generating a tax deduction to offset other income.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nLikewise, in Wexler, 31 F.3d 117, we considered and rejected the taxpayer's argument that a transaction need not further any non-tax objectives or hold any profit potential where the governing statutory provisions do not \"require that the deductions they provide for arise from transactions having a business purpose or profit motive.\" Id. at 122. Despite the broad statutory language allowing the deduction of \"all interest paid or accrued . . . on indebtedness,\" I.R.C. § 163(a), we concluded that interest charges were not deductible if they arose from a transaction \"entered into without expectation of economic profit and [with] no purpose beyond creating tax deductions.\" Id. at 123-24 (citations omitted). We emphasized that interest payments \"are not deductible where the underlying transaction has no purpose other than tax avoidance\" even if the governing statutory language \"had no express business-purpose requirement.\" Id. at 124 (citations omitted).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Thus, we find no merit in ACM's argument that the Tax Court erred as a matter of law by scrutinizing the asserted business purposes and profit motives behind ACM's transactions, and we turn to the question of whether the court erred in finding that the transactions were not intended to serve ACM's professed non-tax purposes and were not reasonably expected to generate a pre-tax profit.\n\n4. Intended Purposes and Anticipated Profitability of ACM's Transactions\n\nBefore the Tax Court, ACM conceded that there were tax objectives behind its transactions but contended that \"tax-independent considerations informed and justified each step of the strategy.\" 73 T.C.M. at 2217. ACM asserted that its transactions, in addition to presenting \"a realistic prospect that ACM would have made a profit\" on a pre-tax basis, also served the tax-independent purposes of providing an interim investment until ACM needed its cash to acquire Colgate debt and a hedge against interest rate risk within the partnership. The Tax Court, however, found that the record did not support ACM's assertions that the transactions were designed either to serve these non-tax objectives or to generate a pre-tax profit, see 73 T.C.M. at 2217-29, and for the following reasons, we agree.\n\na. Interim Investment\n\nACM contends that it invested in the Citicorp notes not only because they qualified for treatment under the contingent installment sale provisions and the ratable basis recovery rule, but also because they served as an appropriate interim investment until ACM could invest in the Colgate debt whose acquisition, according to ACM, was a central objective of the partnership. The Tax Court, however, rejected this contention on the grounds that ACM did not acquire the Citicorp notes as an interim investment \"to accommodate the timing of the acquisition of Colgate debt; rather, it was the reverse: The acquisition of the Colgate debt was timed so as to accommodate the requirements of the section 453 investment strategy\" which required ACM to acquire and dispose of private placement notes. 73 T.C.M. at 2227. This Conclusion finds abundant support in the record.\n\nIn May 1989, Merrill Lynch presented Colgate with an initial proposal of partnership transactions intended to generate capital losses which Colgate could use to offset 1988 capital gains. Although Merrill Lynch had not yet incorporated the concept of using the partnership to acquire Colgate debt issues as it did in its subsequent July 28 and August 17 proposals, its May proposal nonetheless contemplated the acquisition and imminent Disposition of short-term securities, with no intervening change in their economic value, in exchange for contingent installment notes. See 73 T.C.M. at 2191; app. at 678-79, 275-77. The fact that the acquisition and Disposition of short-term notes were central parts of the proposed partnership transactions even before the formulation of non-tax partnership objectives belies ACM's contention that its contingent installment exchange of Citicorp notes was designed to accommodate the timing of its debt acquisition strategy.\n\nMoreover, as early as October 3, 1989, one month before ACM was formed, Pohlschroeder reported that he had identified the Met notes as targets for acquisition and that, \"pursuant to an inquiry to Metropolitan, we feel confident that the partnership can purchase sufficient Colgate debt\" to serve the partnership's objectives. App. at 314. Yet, despite this confidence that the debt was available for purchase well in advance of ACM's formation, Pohlschroeder did not recommend that the partnership invest its funds directly in the identified debt issues or finalize the terms of the anticipated debt purpose, but rather identified as the \"Next Steps\" after formation of the partnership \"Short-term investment securities acquired. . . . Disposition of short term investment securities to fund acquisition of Colgate debt.\" App. at 321. In accordance with this plan, ACM did not take any measures to pursue the prompt purchase of these debt issues upon its receipt of $205 million in cash contributions on November 2, 1989, but rather, acting through Colgate, instructed Metropolitan to attend a November 17 meeting to discuss the terms of the sale. See 73 T.C.M. at 2227.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Thus, we agree with the Tax Court's finding that any delay preceding the opportunity to acquire Colgate debt was of ACM's own deliberate making and was intended so that ACM could engage in the tax-motivated acquisition and Disposition of qualifying short-term notes in the contingent installment sale that had been contemplated since before Merrill Lynch and Colgate devised the concept of incorporating debt acquisition objectives into Merrill Lynch's initial tax reduction proposal.\n\nEven if ACM had faced a delay before it could purchase Colgate debt and thus needed to locate a suitable interim investment, the Citicorp notes ill served the professed purpose of holding cash assets in anticipation of an impending purchase. The notes, which in order to qualify for treatment in a contingent installment sale could not be traded on an established market, see I.R.C. § 453(k)(2)(A), were highly illiquid and thus could not be converted back into the cash needed to purchase Colgate debt without significant transaction costs in the form of the bid-ask spread which Merrill Lynch deemed necessary to market the notes to third parties. These transaction costs rendered the illiquid Citicorp notes paying 8.78% significantly less advantageous as an interim investment than the fully liquid cash deposit account paying 8.75%. Accordingly, wefind no error in the Tax Court's Conclusion that ACM's brief investment in the Citicorp notes was motivated by the pursuit of the tax advantages of a contingent installment sale rather than by a need for an interim investment pending its acquisition of Colgate debt. See 73 T.C.M. at 2227-29.\n\nb. Hedge Against Interest Rate Risk\n\nThe Tax Court also rejected ACM's contention that it invested in LIBOR notes not only because they generated the contingent payments necessary to trigger the application of the ratable basis recovery rule, but also because they were an appropriate hedge against the interest rate exposure brought about by ACM's investment in Colgate debt issues. As the court explained, ACM's asserted rationale of hedging against other assets within the partnership would \"defeat [the] very purpose\" which Colgate had advanced for pursuing a debt acquisition partnership in the first instance. 73 T.C.M. at 2222. The court accurately noted that Colgate had entered into the partnership based on a prediction of falling interest rates and had justified its plan to acquire fixed-rate Colgate debt issues on the grounds that as interest rates declined, these issues would appreciate in value to ACM as the obligee, thus offsetting, through Colgate's share in ACM, the increased burdens that Colgate effectively would sustain as the obligor on those instruments if market interest rates fell further below the fixed rate established on these obligations. See 73 T.C.M. at 2192-93, 2221-25; app. at 311, 666-68, 880-82, 2762-63, 2765, 2769-70.\n\nWhile the acquisition of Colgate debt furthered this professed goal of decreasing the exposure associated with Colgate's fixed rate long term debt structure outside of the partnership, the acquisition of the LIBOR notes, whose value would decline as interest rates declined, conversely increased ACM's exposure to falling interest rates, offsetting the desired effect of the debt acquisition program which purportedly was a fundamental partnership objective. See T.C.M. at 2221; app. at 311. Accordingly, the LIBOR notes, by hedging against the Colgate debt issues acquired within the partnership, negated the potential benefit of ACM's acquisition of these issues as a hedge against Colgate's interest rate exposure outside the partnership.\n\nThe fact that the interest rate exposure resulting from the LIBOR notes undermined rather than furthered the partnership's purported debt management objectives is also evident from the fact that Colgate reserved the option under the partnership agreement to elect to increase its share in changes in the value of the Colgate debt issues attributable to fluctuations in market interest rates, and exercised this option on several occasions. See app. at 101. Because the value of the fixed-rate Colgate debt issues increased in inverse proportion to interest rates, Colgate's exercise of this option reflects a prediction of falling interest rates which would result in risk to Colgate through its liabilities outside the partnership but would benefit Colgate through its interest in the assets held within the partnership. The acquisition of LIBOR notes, whose value depended in direct proportion on interest rates, effectively would dilute the benefits which the partnership was intended to yield and which Colgate sought to maximize by exercising its options under the partnership agreement. Thus, we find considerable support in the record for the Tax Court's Conclusion that the acquisition of the LIBOR notes operated to \"defeat [the] very purpose\" which ACM had advanced as a tax-independent justification for its sequence of investments.\n\nAlthough ACM meticulously set forth, in contemporaneously recorded documents, tax-independent rationales for each of its transactions with respect to the Citicorp notes and LIBOR notes,\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e these stated rationales cannot withstand scrutiny in light of the stated purposes behind the partnership itself, because the investment in the Citicorp notes impeded rather than advanced ACM's professed goal of making its cash available to acquire Colgate debt issues, just as the investment in the LIBOR notes impeded rather than advanced the professed goal of acquiring partnership assets that would hedge against Colgate's exposure to declining interest rates outside the partnership.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Accordingly, wefind no error in the Tax Court's determination that the transactions \"served no useful non-tax purpose,\" 73 T.C.M. at 2229, and thus constituted the type of scheme with \"no purpose other than tax avoidance\" that lacks the economic substance necessary to give rise to a deductible loss. Wexler, 31 F.3d at 124.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nc. Anticipated Profitability\n\nIn addition to rejecting ACM's asserted non-tax justifications for its sequence of investments and Dispositions, the Tax Court also rejected ACM's contention that its transactions were reasonably expected to yield a pre-tax profit because the court found ACM had planned and executed its transactions without regard to their pre-tax economic consequences. See 73 T.C.M. at 2217-21. The evidence in the record overwhelmingly supports this Conclusion.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e The documents outlining the proposed transactions, while quite detailed in their explication of expected tax consequences, are devoid of such detailed projections as to the expected rate of return on the private placement notes and contingent payment notes that were essential components of each proposal. See 73 T.C.M. at 2191; app. at 678-79, 263-79, 296-308.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nMoreover, ACM's partners were aware before they entered the partnership that the planned sequence of investments would entail over $3 million in transaction costs. See app. at 294. Yet Colgate, which effectively bore virtually all of these costs pursuant to the terms of the partnership agreement, did not attempt to assess whether the transactions would be profitable after accounting for these significant transaction costs. See 73 T.C.M. at 2217-18, 2204. Furthermore, while ACM planned to dispose of the Citicorp notes after a brief holding period for an amount equal to their purchase price, see app. at 275-77, 300, 321, its proposed transactions contemplated holding for two years the LIBOR notes whose principal value would decline in the event of the falling interest rates which ACM's partners predicted. See app. at 311, 753-55.\n\nThus, while the Citicorp note investment which was essential to structuring the transaction as a contingent installment sale was economically inconsequential, the LIBOR note investment which was equally essential to achieving the desired tax structure was economically disadvantageous under the market conditions which Colgate predicted and which actually transpired. ACM's lack of regard for the relative costs and benefits of the contemplated transaction and its failure to conduct a contemporaneous profitability analysis support the Tax Court's Conclusion that ACM's transactions were not designed or reasonably anticipated to yield a pre-tax profit, particularly in view of the significant transactions costs involved in exchanging illiquid private placement instruments. See Hines v. United States, 912 F.2d 736, 739 (4th Cir. 1990).\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nIn light of the Tax Court's well-founded Conclusion that Colgate and ACM expected interest rates to decline, rendering the proposed transactions unprofitable, we find it immaterial whether, as ACM contends, the court overstated the degree to which interest rates would have had to rise in order for ACM to recover its transaction costs. See br. at 42-43. Even accepting ACM's assertion that it could have recovered its costs upon a significantly smaller rise in interest rates than that calculated by the Tax Court, this assertion is immaterial in the event of falling interest rates and at best demonstrates a prospect of a nominal, incidental pre-tax profit which would not support a finding that the transaction was designed to serve a non-tax profit motive. See Sheldon v. Commissioner, 94 T.C. 738, 768 (1990).\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nFurthermore, we find no merit in ACM's assertion that the Tax Court improperly based its determination that the transactions were unprofitable for Colgate on the erroneous assumption that Colgate, directly and through Southampton, \"would continue to own only 17 percent of ACM's assets,\" causing it to understate the profits Colgate would receive toward the end of the transactions when it would own 99.7% of the partnership. See br. at 39.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e As discussed above, however, neither ACM nor any of its partners reasonably anticipated any profits resulting from the relevant transactions, which entailed an economically inconsequential investment in Citicorp notes and a decidedly unprofitable investment in LIBOR notes whose value would be expected to decline under contemporaneously predicted market conditions. Because the contingent installment exchange transaction, as contemplated and as actually executed, yielded no partnership profits in any amount, Colgate's percentage share of those non-existent profits is immaterial.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nEven assuming, however, that ACM and its partners expected to earn some measure of profits upon Disposition of the BOT LIBOR notes, any additional portion of these profits that would redound to Colgate's benefit due to its increased share in the partnership cannot be characterized as an additional return on Colgate's investment in partnership assets because Colgate, directly and through Southampton, paid well over $100 million to acquire its increased partnership interest. See app. at 137, 769-70.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e These additional contributions far exceeded Colgate's initial partnership investment of $35 million, undermining ACM's assertion that any additional returns attributable to Colgate's increased stake in the partnership properly may be characterized as further returns on Colgate's interest in the partnership's investments. Thus, we are unpersuaded by ACM's contention that the Tax Court distorted its profitability analysis by failing to account for Colgate's increased partnership interest.\n\nACM also argues that the Tax Court's profitability analysis was flawed because the court adjusted the income expected to be generated by the LIBOR notes to its net present value. See br. at 43. In support of its assertion that this net present value adjustment constitutes reversible error, ACM cites Estate of Thomas v. Commissioner, 84 T.C. 412 (1985), which noted that the issue of present value adjustments was \"not raised or briefed by the parties\" and held that absent some statutory guidance, it would not discount the residual value of obsolete partnership assets at the time of obsolescence to their equivalent present values at the time the partnership was formed. The court reasoned that discounting to present value effectively would require that the taxpayer's investment yield a rate of return exceeding the discount rate which, the court found, would contravene the admonition in Treas. Reg. § 1.183-2(b)(9) that \"the availability of other investments which would yield a higher return, or which would be more likely to be profitable, is not evidence that an activity is not engaged in for profit\" within the meaning of I.R.C. § 183. See 84 T.C. at 440 n.52.\n\nWe reject ACM's contention that Estate of Thomas, which construed Treasury Regulations under I.R.C. § 183, precludes present value adjustments in the prospect-for-profit analysis under the judicially created economic substance doctrine.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e In transactions that are designed to yield deferred rather than immediate returns, present value adjustments are, as the courts have recognized, an appropriate means of assessing the transaction's actual and anticipated economic effects. See, e.g., Hilton v. Commissioner, 671 F.2d 316, 317 (9th Cir. 1982) (affirming economic substance determination based on present value analysis of taxpayer's investments); Citizens \u0026 Southern Corp. v. Commissioner, 91 T.C. 463, 498 (1988) (noting that value of an acquired asset may be determined based on future income likely to be generated that by that asset discounted to present value), aff'd, 919 F.2d 1992 (11th Cir. 1990); Gianaris v. Commissioner, 64 T.C.M. (CCH) 1229, 1234 (1992) (\"we have consistently discounted . . . income streams produced by [an investment] in determining whether the taxpayer had a profit objective\") (citations omitted).\n\nWe find no basis in the law for precluding a tax court's reliance on a present value adjustment where such an adjustment, under the surrounding circumstances, will serve as an accurate gauge of the reasonably expected economic consequences of the transaction. In this case where ACM's transactions essentially converted readily available cash, with only a brief interim investment in the Citicorp notes, into a stream of deferred payments, we find that the present value adjustment played an appropriate role in the Tax Court's analysis of the potential profitability of the transactions. We accordingly find no error in this aspect of the court's analysis.\n\nACM also avers that the Tax Court erred in excluding from its profitability analysis \"the pre-tax income resulting from the investment of $140 million of cash received as part of the consideration for the Citicorp Notes.\" Br. at 44. We disagree. The Tax Court properly analyzed the profitability of the transactions whose economic substance is at issue, namely the contingent installment exchange of Citicorp notes for LIBOR notes which gave rise to the disputed tax consequences. Any profits arising from ACM's investment of $140 million in cash into Colgate debt issues did not result from the contingent installment exchange whose economic substance is in issue. Because this sum of cash in fact represents the portion of the proceeds from the Citicorp notes which ACM did not invest in the contingent installment exchange of the other $35 million in Citicorp notes for contingent-payment LIBOR notes, any profits derived from these funds cannot be characterized as profits arising from the contingent installment exchange. Thus, the Tax Court properly excluded these profits from its analysis of the profitability of the contingent installment sale which gave rise to the disputed capital losses.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e We find ample support in the record for the Tax Court's Conclusion that ACM and its partners did not reasonably anticipate that its contingent installment sale would generate a pre-tax profit. Because ACM's acquisition and Disposition of the Citicorp notes in a contingent installment exchange was without objective effect on ACM's net economic position or non-tax objectives, and because its investments in the Citicorp notes and LIBOR notes did not rationally serve ACM's professed non-tax objectives or afford ACM or its partners a reasonable prospect for pre-tax profit, we will affirm the Tax Court's determination that the contingent installment exchange transactions lacked economic substance and its resulting decision providing that the capital gain and loss at issue will not be recognized and thus disallowing deductions arising from the application of the contingent installment sale provisions and the ratable basis recovery rule.\n\nB. Actual Economic Losses\n\nFollowing the entry of the Tax Court's opinion holding that ACM's contingent installment sale did not have sufficient economic substance to be recognized for tax purposes, the parties submitted memoranda pursuant to Tax Court Rule 155 regarding the proper computation of tax liabilities to be allocated by ACM pursuant to that opinion. ACM argued that even if it was not entitled to deduct the entire $84,997,111 in tax losses it had reported, it was entitled to deduct the approximately $6 million \"portion of its loss that is not attributable to the installment sale accounting and that reflects the actual economics of the transactions in issue.\" App. at 3386; see also app. at 3348-51, 3385-98. The court rejected ACM's argument and entered a final decision disallowing all deductions arising from ACM's transactions as well as the 1989 capital gain. See app. at 3444. ACM contends that the Tax Court erroneously failed to recognize that ACM's ownership of the LIBOR notes had economic substance even if the contingent installment sale did not, and thus improperly disallowed deductions arising from its ownership of those notes, resulting in inconsistent tax treatment in light of ACM's reporting of the income generated by those notes.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e We agree.\n\nIn Lerman, 939 F.2d at 45, we held that a transaction that lacks economic substance \"simply is not recognized for federal taxation purposes, for better or for worse,\" and we are not aware of any cases applying the economic substance doctrine selectively to recognize the consequences of a taxpayer's actions for some tax purposes but not others. Rather, the courts have applied economic substance principles to \"give effect either to both the cost and the income functions [of a transaction], or to neither.\" Seykota v. Commissioner, 62 T.C.M. (CCH) 1116, 1118 (1991); accord Sheldon, 94 T.C. at 762 (denying interest deduction and accordingly holding that income items should not be recognized); Arrowhead Mountain Getaway, Ltd. v. Commissioner, 69 T.C.M. (CCH) 1805, 1822 (1995) (holding that because transactions were economic shams that could not give rise to deductions, amounts received in the course of those transactions could not be characterized as taxable income), aff'd, 119 F.3d 80 (9th Cir. 1997) (table). Thus, we must set aside the Tax Court's decision to the extent that it disallowed the deduction of all losses, including actual economic losses, associated with the LIBOR notes without adjusting for the taxes paid on the approximately $2.3 million of interest income generated by the same notes. See app. at 3444, 3390.\n\nWhile it is clear that the income and loss aspects of the LIBOR notes must be treated consistently with one another, this proposition does not resolve whether the consistency should be achieved by disregarding the tax consequences of the income generated by the notes or by permitting the deduction of actual economic losses associated with the notes. ACM urges us to adopt the latter position and in support thereof invokes Wexler, 31 F.3d at 127, in which we held that \"in some circumstances, a sham transaction may have separable, economically substantive, elements that give rise to deductible interest obligations.\" According to ACM, br. at 48, its ownership of the BOT LIBOR notes and its 1991 Disposition thereof for an actual economic loss gave rise to a separable, economically substantive loss that is properly deductible under Wexler because it is distinct from the losses resulting from the ratable basis recovery rule. The Commissioner, on the other hand, contends that Wexler does not permit the deduction of ACM's economic losses on the LIBOR notes because, according to the Commissioner's interpretation of Wexler, a separable item of loss is not deductible unless the underlying transaction had a potential non-tax benefit. See br. at 48-49.\n\nFor the following reasons, we find ACM's contentions to be more persuasive. In Wexler, the taxpayer invoked Rice's Toyota, 752 F.2d at 95-96, which disallowed depreciation and interest deductions arising from a transaction that was a sham in that the taxpayer \"subjectively lacked a business purpose and the transaction objectively lacked economic substance.\" The court found, however, that one discrete portion of the transaction, which entailed the exchange of a recourse note for \"something of economic value,\" had sufficient economic substance to give rise to an interest deduction. Id. at 95-96. Distinguishing Rice's Toyota, we found that the claimed deductions in Wexler did not constitute such a \"separable, economically substantive\" item that was distinct from the sham aspects of the transaction, but rather constituted \"the principal tax benefits of the transaction.\" Wexler, 31 F.3d at 125. Thus, we found, allowance of the deduction would have permitted the taxpayer \"to reap the entire benefit of its sham transaction\" by allowing him the deduction \"that was the centerpiece of the whole scheme.\" Id. at 127.\n\nSuch is not the case here. The actual economic losses associated with ACM's ownership of the LIBOR notes are both economically substantive and separable from the sham aspects of the underlying transaction. Far from being the \"centerpiece\" or \"principal tax benefit\" of the underlying transaction, the approximately $6 million in economic losses which ACM seeks to deduct were separate and distinct from the $87 million tax loss that did not correspond to any actual economic loss but rather was an artifact of the ratable basis recovery rule which inflated the tax basis of the LIBOR notes well above their actual cost basis. In contrast to its economically inconsequential acquisition and Disposition of the Citicorp notes, ACM's ownership of the BOT LIBOR notes, which extended over two years under circumstances that posed an actual risk to the principal value of that investment, had an economically substantive impact on ACM's net financial position. In these circumstances, recognition of both the income and the loss aspects of ACM's investment in those notes will result in consistent tax treatment which accurately reflects the economic reality of ACM's transactions and will allow deduction only of a \"separable, economically substantive\" item that is not the \"centerpiece\" of the transactions, consistently with our holding in Wexler.\n\nWhile the Commissioner, br. at 48, urges us to read Wexler more broadly to preclude any deductions associated with an underlying transaction found to be a sham, we decline to do so. We recognize that Wexler not only distinguished Rice's Toyota on its facts, but also criticized its reasoning. In doing so, however, Wexler did not criticize Rice's Toyota's essential holding that \"in some circumstances, a sham transaction may have separable, economically substantive elements that give rise to deductible\" liabilities, see 31 F.3d at 127, but rather disagreed with the Rice's Toyota court'sfinding that the recourse note portion of the transaction, which the court had described as \"a `fee' for purchase of expected tax benefits,\" had economic substance. As we explained in Wexler, by the Rice's Toyota court's own description, that transaction had no non-tax consequences and served no non-tax purposes and thus could not be considered economically substantive even if it was separable from the central aspects of the underlying sham. See Wexler, 31 F.3d at 125 (quoting Rice's Toyota, 752 F.2d at 94).\n\nACM's possession of the LIBOR notes, although not intended to serve non-tax purposes, had significant non-tax economic effects, consisting of several million dollars in actual economic losses. As we acknowledged in Wexler, even where a transaction is not intended to serve business purposes, it may give rise to a deduction to the extent that it has objective economic consequences apart from tax benefits. See 31 F.3d at 126 (citing Jacobson, 915 F.2d at 849); see also Gregory, 293 U.S. at 469, 55 S.Ct. at 267 (holding that if the transaction \"in reality was effected\" in substance as well as in form, \"the ulterior [tax avoidance] purposes . . . will be disregarded); Northern Indiana Pub. Serv. Co., 115 F.3d at 512 (holding that Gregory and its progency \"do not allow the Commissioner to disregard economic transactions . . . which result in actual, non-tax-related changes in economic position\" regardless of \"tax-avoidance motive\"). Thus, we are unpersuaded by the Commissioner's assertion that Wexler requires us to disregard actual, objective economic losses merely because they are incidental to a broader series of transactions that are found to constitute an economic sham whose principal tax benefits must be denied. See br. at 48-49. Because ACM's possession and Disposition of the LIBOR notes was distinct from the contingent installment exchange which constituted the underlying sham transaction and because this distinct portion of the transaction had sufficient non-tax economic effect to be recognized as economically substantive, we find that this aspect of ACM's transactions gave rise to the type of \"separable, economically substantive\" loss that is deductible even when incurred in the context of a broader transaction that constitutes an economic sham. Wexler, 31 F.3d at 127. Accordingly, we will reverse the Tax Court's decision to the extent that it disallowed the deductions arising from the actual economic losses which ACM sustained upon its Disposition of the LIBOR notes.\n\nIV. CONCLUSION\n\nFor the foregoing reasons, we will affirm the Tax Court's application of the economic substance doctrine and its resulting decision eliminating the capital gains and losses attributable to ACM's application of the contingent installment sale provisions and the ratable basis recovery rule. The Commissioner's cross appeal is moot and thus will be dismissed. We will, however, reverse the Tax Court's decision insofar as it disallowed the deductions arising from the actual economic losses associated with ACM's ownership of the LIBOR notes, and will remand to the Tax Court for entry of a decision consistent with this opinion. The parties will bear their own costs on this appeal.\n\nMcKEE, Circuit Judge, Dissenting.\n\nBy finding that ACM's sales of the Citicorp notes for cash and LIBOR Notes \"satisfied each requirement of the contingent installment sales provisions and the ratable basis recovery rule,\" Maj. Op. at 28, yet, simultaneously subjecting these transactions to an economic substance and sham transaction analysis, the majority has ignored the plain language of IRC § 1001, and controlling Supreme Court precedent. We have injected the \"economic substance\" analysis into an inquiry where it does not belong. Therefore, I respectfully Dissent.\n\nACM, like all taxpayers, has the absolute right to decrease or to avoid the payment of taxes so long as that goal is achieved legally. Gregory v. Helvering, 293 U.S. 465, 468 (1935). Id. In Gregory, the taxpayer wanted to transfer stock from her wholly-owned corporation to herself, but realized that a direct distribution of those shares would be a taxable event. Therefore, in an attempt to avoid a taxable event, the taxpayer created a new corporation, transferred the stock to that new corporation, and then caused the new corporation to distribute the stock to her in liquidation. The taxpayer owned all of the stock of United Mortgage Corporation, and that corporation owned 1000 shares of the Monitor Securities Corporation that the taxpayer wanted to obtain. In order to do so without paying the taxes that would clearly be due on a direct transfer, she engineered a purported reorganization of United Mortgage Corporation. The Supreme Court described her scheme as follows:\n\nTo that end, she caused the Averill Corporation to be organized under the laws of Delaware on September 18, 1928. Three days later, the United Mortgage Corporation transferred to the Averill Corporation the 1,000 shares of Monitor stock, for which all the shares of the Averill Corporation were issued to the petitioner. On September 24, the Averill Corporation was dissolved, and liquidated by distributing all its assets, namely, the Monitor shares, to the petitioner. No other business was ever transacted, or intended to be transacted, by that company. The petitioner immediately sold the Monitor shares. . . .\n\nGregory, 293 U.S. at 467 (emphasis added). At the time, 26 USCA § 112 (g) exempted the gain realized from a corporate reorganization \"[i]f there is distributed, in pursuance of a plan of reorganization, to a shareholder, . . . stock . . . in such corporation.\" Id. at 468. Most significantly for our purposes, the Court stated the issue as follows: \"[b]ut the question for determination is whether what was done, apart from the tax motive, was the thing which the statute intended.\" Id. at 469. The Court concluded that what was done was not what the statute intended because the liquidation was not a plan of reorganization at all, but \"a transfer of assets by one corporation to another in pursuance of a plan having no relation to the business of either. . . .\" Id. Accordingly, the Court disregarded the transaction, even though the form of the transaction satisfied the literal requirements of the IRC's reorganization provisions, because it found that the entire transaction was nothing but \"an elaborate and devious form of conveyance masquerading as a corporate reorganization, and nothing else.\" Id. at 470. In other words, the transaction was one which \"upon its face lies outside the plain intent of the statute.\" Id. Consequently, \"the rule which excludes from consideration the motive of tax avoidance\" did not apply. Id.\n\nAccordingly, I am not as persuaded as my colleagues that Gregory should guide our inquiry into these transactions. Here, the sales of the Citicorp Notes for cash and LIBOR Notes were clearly \"legitimate\" sales in the nontax sense. Under IRC § 1001, the tax consequences of a gain or loss in the value of property are deferred until the taxpayer realizes the gain or loss. Cottage Savings Assoc. v. Commissioner, 499 U.S. 554, 559 (1991). The concept of \"realization\" is implicit in IRC § 1001(a), Id., and the realized gain is recognized when the property is sold or exchanged. IRC § 1001(c).\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e In Cottage Savings, the Court held that a sale or exchange of property is a realization event \"so long as the exchanged properties are `materially different' -- that is, so long as they embody legally distinct entitlements.' Id. at 566.\n\nCottage Savings sold 90% participation in 252 mortgages to four S\u0026L's. It simultaneously purchased 90% participation interests in 305 mortgages held by these S\u0026L's. All of the loans involved in the transaction were secured by single-family homes. . . .\n\nOn its 1980 federal income tax return, Cottage Savings claimed a deduction . . . which represented the adjusted difference between the face value of the participation interests that it traded and the fair market value of the participation interests it received. . . .\n\nCottage Savings, 499 U.S. at 557. It was not disputed that \"[t]he . . . acknowledged purpose [of the transfers] was to facilitate transactions that would generate tax losses but that would not substantially affect the economic position of the transacting S\u0026L's\". Id. at 556. In allowing the taxpayer to deduct the resulting loss the Court reasoned that § 1001 did not recognize exchanges \"commonly known as `like kind', and that Congress therefore intended to afford tax recognition of gains and losses resulting from exchanges of property that was materially different.\" Id., at 564. The Court held \"[u]nder our interpretation of § 1001(a), an exchange of property gives rise to a realization event so long as the exchanged properties are `materially different' -- that is, so long as they embody legally distinct entitlements.\" Id. That is what happened here, and I believe that, under Cottage Savings, the tax loss here should have been allowed.\n\nACM's sales of the Citicorp Notes for cash and LIBOR Notes resulted in the exchange of materially different property with \"legally distinct entitlements.\". Consequently, the sales were substantive Dispositions, and the tax effects of those transactions should be recognized. Cottage Savings, as well as the plain language of IRC § 1001, demands that result.\n\nThus, I do not think that the many cases decided before Cottage Savings that the majority relies upon are helpful. e.g., Maj. Op. at 26-34. Similarly, I do not believe our inquiry is furthered by discussing United States v. Wexler, 31 F.3d 117 (3rd Cir. 1994). See Maj. Op. at 45. There, we were not addressing the issue of sham transactions in the context presented here, nor did we cite Cottage Savings. We did cite Lerman v. Commissioner, 939 F.2d 44, 45 (3d Cir. 1991), and we noted that, in Lerman, we said \" `economic substance is a prerequisite to any Code provision allowing deductions.' \" 31 F.3d at 127 (quoting Lerman, 939 F.2d at 48 \u0026 n. 6, 52). However, it is the definition of \"economic substance\" that is the sticking point. Here, the \"economic substance\" inquiry must be governed by the \"material difference requirement\" of Cottage Savings, not by the tax avoidance intent of the taxpayers.\n\nIn this regard, I believe the majority mischaracterizes the appellant's argument. The majority states: \"ACM acknowledges that even where the `form of the taxpayer's activities indisputably satisfie[s] the literal requirements' of the statutory language, the courts must examine `whether the substance of those transactions was consistent with their form' \". Maj. Op. at 29 (quoting Appellant's Br. at 21). However, ACM is referring to the issue as posed by Gregory v. Helvering. In referring to the facts of that case, ACM argues:\n\nThe form of the taxpayer's activities indisputably satisfied the literal requirements of the Code's reorganization provisions, but the question was whether the substance of those transactions was consistent with their form. As he does here, the Commissioner argued in Gregory that the taxpayer's ulterior purpose should be disregarded. . . .\n\nIn other words, the focus should be on the substance of what was done, and not on why it was done. The Supreme Court then analyzed the specific statutory language concerning reorganizations and concluded that the taxpayer's actions lay outside the plain intent of the statute.\n\nAppellant's Br. at 21.\n\nAs recited earlier, ACM's sales of the Citicorp Notes for cash and LIBOR Notes resulted in the exchange of materially different property. I believe our inquiry should proceed no further, and reverse the holding of the Tax Court eliminating the capital gains and losses attributable to ACM's application of the contingent installment sale provisions and the ratable basis recovery rule to its Disposition of the Citicorp Notes.\n\nI can't help but suspect that the majority's Conclusion to the contrary is, in its essence, something akin to a\"smell test.\" If the scheme in question smells bad, the intent to avoid taxes defines the result as we do not want the taxpayer to \"put one over.\" However, the issue clearly is not whether ACM put one over on the Commissioner, or used LIBOR notes to \"pull the wool over his eyes.\" The issue is whether what ACM did qualifies for the tax treatment it seeks under § 1001. The fact that ACM may have\"put one over\" in crafting these transactions ought not to influence our inquiry. Our inquiry is cerebral, not visceral. To the extent that the Commissioner is offended by these transactions he should address Congress and/or the rulemaking process, and not the courts.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\nAccordingly I must Dissent from what I admit is a very finely crafted opinion by my colleague, Judge Greenberg.\n\nA True Copy: Teste:\n\nClerk of the United States Court of Appeals for the Third Circuit\n\n\u003cspan class=\"fn\"\u003e1.. The proposal was premised on I.R.C. § 1212(a), which permits a taxpayer to carry back a capital loss to offset capital gains recognized within the preceding three years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2.. The LIBOR [London Interbank Offering Rate] is the primary fixed income index reference rate used in [Europeanfinancial] markets. (Footnote is by Tax Court.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3.. All citations to the Internal Revenue Code and Treasury regulations with respect to both this case and the cases we cite are to the versions in effect at the time of the relevant transactions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4.. The elevated proportion of long-term debt in Colgate's debt structure arose in part from Colgate's use of the proceeds from the Kendall sale to retire significant amounts of short-term debt and its issuance of long-term debt to finance an employee retirement plan. See 73 T.C.M. at 2192; app. at 77-78, 669-70, 2761, 2764-70. This high proportion of long-term fixed-rate debt exposed Colgate to risk in the event of declining interest rates, as Colgate would receive diminished returns from its cash balances and short-term deposits, but would continue to owe interest on its debts at the higher fixed rate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5.. ABN was familiar with its role in the proposed transaction, as Merrill Lynch had approached ABN in early 1989 while it was developing the proposal and had sought ABN's participation in a similar partnership arranged on behalf of another Merrill Lynch client. See 73 T.C.M. at 2194; app. at 1670-75, 1103.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6.. The August 17 transaction summary referred to Colgate as \"XYZ corporation,\" ABN as \"Partner A,\" and Merrill Lynch as \"Partner B.\" However, the identity of the parties is clear from the role that each of them played in the ensuing transactions and from Pohlschroeder's testimony. See app. at 685. Except where there are direct quotations we have paraphrased the summary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7.. This item was designated \"Step 7.\" \"Step 6\" addressed a possible investment in Colgate receivables as an alternative to the LIBOR notes. Because ACM did not invest in Colgate receivables, this aspect of the proposal is immaterial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8.. Pohlschroder testified that as of August 1989, he had received calls from traders indicating that the Long Bonds also were potentially available for purchase. See app. at 688.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9.. The document referred to the securities as \"MTNs\" or medium-term notes. However, it is apparent from the November 29, 1989 date by which those notes were to be resold that these were the same securities which the partnership was to purchase initially and dispose of shortly thereafter in exchange for cash which would be used to purchase Colgate debt and for LIBOR notes. See app. at 321, 300-05.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10.. This \"preferred return\" provision was a component of the proposed partnership from its inception. In a document dated September 1, 1989, Merrill Lynch advised Colgate that this aspect of the partnership would cost Colgate $740,000. See app. at 294.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11.. Pohlschroeder had contacted Metropolitan shortly after the first partnership meeting in October 1989 and had instructed Metropolitan to send a representative to the November 17 meeting if Metropolitan was interested in selling the Met notes. See app. at 743.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12.. A basis point, a common unit of measure for interest rates, equals one one-hundredth of a percent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13.. Pohlschroeder testified that ACM expected to sell the Citicorp notes for cash and LIBOR notes within several weeks to make the cash available to purchase Colgate debt. App. at 739-40. Pohlschroeder also stated that the Citicorp exchange was designed \"to accomplish a tax aspect of the transaction.\" App. at 740.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14.. In negotiating the transactions with BOT and BFCE, Merrill Lynch also agreed to arrange a series of swaps which would hedge the banks' interest rate risks and provide them additional return on their purchase of the Citicorp notes. See 73 T.C.M. at 2206-10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15.. The notional principal amount did not represent an amount owed, but rather was designated as a multiplier to determine the amount of the LIBOR-based contingent payments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16.. ACM divided the basis across six years instead of five, although the LIBOR payments were to be received over 20 quarters commencing in 1990, because it received the cash portion of the consideration three days before the end of the 1989 tax year, making 1989 a year \"in which payment may be received\" under § 15a.453.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17.. According to the Tax Court the share allocated to Kannex was not taxed in any jurisdiction but we, of course, are focusing only on the United States tax aspects of the transaction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18.. This $32,429,839 loss was computed based upon the $9,406,180 cash proceeds from the sale, minus the $41,786,601 tax basis in the notes, minus $48,693 in accrued interest payable on the notes. See 73 T.C.M. at 2203.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19.. The rules described the LIBOR notes as the \"[c]ontingent payment notes with no stated principal value, with payments resulting from the product of a notional amount and a floating rate of interest.\" App. at 407.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20.. This appeal concerns adjustments to ACM's 1989 and 1991 tax returns. Although the Commissioner's Final Partnership Administrative Adjustment and the Tax Court's decision made adjustments to ACM's 1990 tax return, these adjustments affected only the basis in certain assets with no effect on net tax liability for 1990. See app. at 3444. Thus, we do not discuss the 1990 return further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21.. Had it not applied the ratable basis recovery rule, ACM would have subtracted from the consideration it received upon Disposition of the BOT LIBOR notes only the remaining portion of the LIBOR notes' aggregate $35,504,564 actual cost basis rather than the remaining portion of their aggregate $175,504,564 tax basis which ACM derived by aggregating the $140 million cash portion of the Citicorp note transaction with the $35 million LIBOR note portion of the transaction and adjusting the aggregate basis for accrued interest, yielding $95,958,692 in unrecovered basis at the time of the Disposition of the BOT LIBOR notes. ACM also treated a portion of the proceeds from the notes as interest income rather than capital gains. See 73 T.C.M. at 2206; app. at 3388.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22.. This capital loss of $84,537,479, combined with Colgate's reported 1989 net capital loss of $13,521,432, gave rise to total reported capital losses of $98,058,911 over the course of Colgate's participation in ACM's transactions. See 73 T.C.M. at 2206.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23.. A designated tax matters partner represents the partnership in proceedings before the Tax Court. See I.R.C. §§ 6231(a)(7), 6226(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24.. Inasmuch as we agree with the Tax Court's decision sustaining the adjustments based on the lack of economic substance behind the transactions, we, like the Tax Court, need not consider the Commissioner's alternate theories. See 73 T.C.M. at 2190. In view of the elimination of the 1989 gain the parties apparently were spared from applying the complex mitigation provisions in the Internal Revenue Code. See Koss v. United States, 69 F.3d 705 (3d Cir. 1995), cert. denied, 117 S.Ct. 54 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25.. We review findings of ultimate fact, like other findings of fact, only for clear error, contrary to our former practice of reviewing such findings de novo. See Geftman v. Commissioner, ___ F.3d ___, 1998 WL 460172, No. 97-7313, slip op. at 11 n.9 (3d Cir. Aug. 10, 1998); Pleasant Summit Land Corp. v. Commissioner, 863 F.2d 263, 268 (3d Cir. 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26.. Although the LIBOR notes generated 20 quarterly payments spanning five years rather than six, ACM reported the \"maximum period over which payments may be received under the contingent sale price agreement\" as six years by including the year of the Disposition in which it received the $140 million cash payment, although no quarterly payments were to be received before the tax year ended on November 30, 1989, three days after the Disposition. See 73 T.C.M. at 2200.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27.. The basis in the LIBOR notes was derived from the basis in the Citicorp notes which ACM exchanged for the LIBOR notes. See I.R.C. § 1031(d). Because ACM recovered one sixth of the basis of the Citicorp notes, or $29,250,761, during the first year of the transaction, the basis in the LIBOR notes after that year was $146,253,283. See app. at 110. While the actual cost basis of the LIBOR notes amounted to the $35,504,564 difference between the value of the Citicorp notes that ACM relinquished and the $140 million in cash that ACM received in return, under the ratable basis recovery rule, the cash portion of the transaction was aggregated with the contingent exchange portion of the transaction, effectively adding the $140 million in cash to the tax basis of the LIBOR notes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28.. ACM exchanged the Citicorp notes, which as private placement securities were eligible for treatment under the contingent installment sale provisions, see I.R.C. § 453(k)(2)(A), for the LIBOR notes' stream of quarterly payments over 20 quarters so that \"at least 1 payment\" was to be \"received after the close of the taxable year in which the Disposition occurs.\" § 453(b). Because the amount of each quarterly payment would depend on the variable three-month LIBOR, the \"maximum selling price\" could \"not be determined as of the close of the taxable year in which the . . . Disposition occurr[ed].\" Temp. Treas. Reg. § 15a.453-1(c). Accordingly, ACM's transactions satisfied the literal terms of each requirement necessary to trigger the application of the ratable basis recovery rule providing for recovery of the basis of the relinquished assets \"in equal annual increments\" over each of the \"taxable years in which payment may be received.\" § 15a.453-1(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29.. We analyze the economic substance of ACM's transactions according to principles that were well established when the transactions occurred, but note that partnership transactions carried out on or after May 12, 1994, also would be subject to Treasury Regulations which provide that partnership transactions \"must be entered into for a substantial business purpose,\" that the \"[t]he form of each partnership transaction must be respected under substance over form principles,\" and that \"the tax consequences . . . to each partner of partnership operations . . . must accurately reflect the partners' income agreement.\" Treas. Reg. § 1.701-2(a). These regulations further provide that \"if a partnership is formed or availed of in connection with a transaction a principal purpose of which is to reduce substantially the present value of the partners' aggregate federal tax liability . . . the Commissioner can recast the transaction for federal tax purposes\" by determining that \"[t]he partnership's items of income, gain, loss, deduction or credit should be reallocated . . . or [t]he claimed tax treatment should otherwise be adjusted or modified.\" Treas. Reg. § 1.701-2(b). The regulations set forth, as an example of a transaction whose tax consequences would be altered or disregarded thereunder, a transaction in which a foreign corporation, a domestic corporation, and a promoter form a partnership \"[p]ursuant to a plan a principal purpose of which is to generate artificial losses and thereby shelter from federal taxation a substantial amount of income,\" and engage in a series of offsetting purchases and sales in which \"any purported business purpose for the transaction is insignificant in comparison to the tax benefits that would result if the transaction were respected for federal tax purposes.\" Treas. Reg. § 1.701-2(d), Example 7. Because these regulations do not apply to ACM's transactions, which were completed well before the 1994 effective date of the regulations, we have no occasion to consider whether the economic substance analysis required under these regulations would differ from the analysis required under the judicially defined economic substance doctrines that we apply.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30.. The courts have distinguished between \"shams in fact\" where the reported transactions never occurred and \"shams in substance\" which \"actually occurred but that lack the substance their form represents.\" Kirchman, 862 F.2d at 1492; accord Lerman, 939 F.2d at 49 n.6. Because it is undisputed that ACM's transactions actually occurred, we confine our inquiry to the question of whether their economic substance corresponds to their form.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31.. While it is clear that a transaction such as ACM's that has neither objective non-tax economic effects nor subjective non-tax purposes constitutes an economic sham whose tax consequences must be disregarded, and equally clear that a transaction that has both objective non-tax economic significance and subjective non-tax purposes constitutes an economically substantive transaction whose tax consequences must be respected, it is also well established that where a transaction objectively affects the taxpayer's net economic position, legal relations, or non-tax business interests, it will not be disregarded merely because it was motivated by tax considerations. See, e.g., Gregory, 293 U.S. at 468-69, 55 S.Ct. at 267 (\"if a reorganization in reality was effected . . . the ulterior purpose will be disregarded\"), Northern Indiana Pub. Serv. Co., 115 F.3d at 512 (emphasizing that Gregory and its progeny \"do not allow the Commissioner to disregard economic transactions . . . which result in actual, non-tax-related changes in economic position\" regardless of \"tax-avoidance motive\" and refusing to disregard role of taxpayer's foreign subsidiary which performed a \"recognizable business activity\" of securing loans and processing payments for parent in foreign markets in exchange for legitimate profit); Kraft Foods Co. v. Commissioner, 232 F.2d 118, 127-28 \u0026 n.19 (2d Cir. 1956) (refusing to disregard tax effects of debenture issue which \"affected . . . legal relations\" between taxpayer and its corporate parent by financing subsidiary's acquisition of venture used to further its non-tax business interests). In analyzing both the objective and subjective aspects of ACM's transaction in this case where the objective attributes of an economically substantive transaction were lacking, we do not intend to suggest that a transaction which has actual, objective effects on a taxpayer's non-tax affairs must be disregarded merely because it was motivated by tax considerations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32.. As contemplated in transaction proposals drafted before ACM was formed, the Citicorp notes were sold for an amount equal to their purchase price. See app. at 275-77, 321, 300.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33.. Because we find that the lack of objective economic consequences of ACM's transactions, which is evident from the Tax Court's well-supported factual findings, is essential to assessing whether the transaction's tax consequences may be disregarded and lends significant support to the court's ultimate finding that ACM's transactions did not have sufficient substance to be recognized for tax purposes, we proceed to conduct this portion of the economic substance analysis although the Tax Court did not do so explicitly. See Northern Indiana Pub. Serv. Co., 115 F.3d at 510 (holding that court of appeals may affirm Tax Court decisions on any grounds found in the record regardless of Tax Court's rationale).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34.. The consideration consisted of $140 million in cash and LIBOR notes whose present value was $34,410,814, or $35,000,000, reduced by the transaction costs established by Merrill Lynch.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35.. The variable rate on the Citicorp notes presented a theoretical possibility that the consequences of owning those notes would vary from the consequences of leaving ACM's funds on deposit at a rate of interest virtually identical to the initial rate on the Citicorp notes. However, ACM's exposure to any fluctuation in the rate of return on its Citicorp note investment was illusory, as the interest rates were scheduled to be reset only once per month and ACM had arranged to hold the notes for only 24 days, encompassing only one interest rate adjustment on November 15 that would affect the notes for only 12 days before their Disposition. See 73 T.C.M. at 2200.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36.. ACM emphasizes that the total consideration it was to receive in exchange for the Citicorp notes genuinely was contingent, in substance as well as in form, because the amount depended on afluctuating market variable \"precisely [as] the statute and the regulations anticipated.\" Br. at 31-32. However, the receipt of genuinely contingent payments is necessary but not sufficient to trigger the application of the ratable basis recovery rule which applies only in the context of a contingent installment sale. Absent an economically substantive Disposition of qualifying property, the transactions do not constitute a bona fide contingent installment sale within the meaning of the provisions which ACM seeks to invoke. See I.R.C. §§ 453(b), 453(k); Temp. Treas. Reg. § 15a.453-1(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37.. As discussed above, each of these cases involved objective acts which satisfied the technical requirements of the Internal Revenue Code provisions that the taxpayer sought to invoke, but which the courts disregarded for tax purposes because they lacked any net effect on the taxpayer's economic position or non-tax business interests. Accordingly, we are unpersuaded by ACM's argument that its transactions must be regarded as economically substantive because it actually and objectively engaged in them. See br. at 21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38.. In Lerman, 939 F.2d at 55-56 \u0026 n.14, we observed that Cottage Savings involved the relinquishment of assets whose value had declined by over $2 million. Because the transaction in Cottage Savings brought about the realization of a $2 million economic loss resulting from the Disposition of depreciated assets in which the taxpayer had an economically substantive investment, we reject ACM's contention, see reply br. at 15, that the case recognized as an economically substantive loss any tax loss arising from a transaction in which the taxpayer disposes of property in an arms'-length transaction. The Cottage Savings Court had no occasion to address a transaction like that before us in which the taxpayer relinquished property after a minimal holding period with no intervening change in economic value.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39.. ACM contends that its Disposition of the Citicorp notes was substantive because it \"relinquished the benefits and burdens of owning the Citicorp notes for the distinct benefits and burdens of owning $140 million of cash and the LIBOR notes.\" Br. at 28. This argument, however, erroneously assumes that ACM had acquired the benefits and burdens associated with the Citicorp notes in an economically substantive sense, when in reality ACM's brief investment in and offsetting divestment from these assets exposed ACM only to de minimis risk of changes in principal value or interest rates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40.. The participation of a foreign partner that was impervious to tax considerations and that claimed most of the reported gains while allocating to Colgate virtually all of the losses allowed Colgate as ACM's major U.S. partner to reap the benefits of the tax losses without sustaining the burdens of the offsetting tax gains.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41.. Because the ratable basis recovery rule simply provides a method for reporting otherwise existing economically substantive losses, we find it irrelevant that the rule recognizes that its application could \"inappropriately defer or accelerate recovery of the taxpayer's basis,\" resulting in \" `substantial distortion' \" of the tax consequences realized in any particular year of a transaction. See ACM br. at 32-34 (quoting Temp. Treas. Reg. §§ 15a.453-1(c)(3), (c)(7)). While the rule contemplates some distortion as to the timing of when actual gains or losses are reported over the span of a contingent installment sale, it does not contemplate the reporting of losses which are not the bona fide result of an economically substantive transaction. Thus, contrary to ACM's argument, the tax losses it reported are not \"precisely what the [regulations] intended.\" See br. at 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42.. Having found ample support for the Tax Court's Conclusion that ACM's transactions lacked economic substance and thus cannot give rise to taxable gains or deductible losses regardless of how those gains and losses are allocated, we need not address the Commissioner's alternative argument that the tax consequences of the transaction must be disregarded because ACM's partnership structure artificially \"bifurcat[ed] the tax consequences of the transaction\" by allocating taxable gains to a foreign partner and offsetting tax losses to the taxpayer in a manner which the relevant statute and regulations did not intend. See br. at 32-34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43.. ACM seeks to distinguish Goldstein on the grounds that it involved a transaction which lacked objective economic effect because \"economically, [the taxpayer's] activities netted zero.\" However, contrary to ACM's contention that it \"bore all of the benefits and burdens of the ownership of . . . the Citicorp Notes and then the cash and LIBOR Notes, and stood to recognize true economic gain or loss from holding those assets,\" reply br. at 5-6, we find that the critical parts of ACM's transactions also \"netted zero\" because its acquisition and offsetting Disposition of the Citicorp notes had no net effect on its economic position. Thus, we reject ACM's attempt to distinguish Goldstein which, like the Tax Court opinion in this case, analyzed the taxpayer's intended purposes as well as the transaction's economic effects.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44.. Because the intended purposes behind a transaction are relevant in assessing its economic substance even where the statute is drafted in broad terms that do not require a particular intent or purpose, we are unpersuaded by ACM's argument that its transactions must be respected as economically substantive because I.R.C.§ 1001, which provides for the recognition of gain or loss \"on the sale or exchange of property\" was intended to encompass \"all exchanges.\" See br. at 23-25 (citing H.R. Rep. No. 179, 68th Cong., 1st Sess., at 13 (1924)). ACM emphasizes, br. at 25-27, that the Supreme Court in Cottage Savings, 499 U.S. 554, 111 S.Ct. at 1503, recognized the tax effects of a Disposition that was motivated solely by tax considerations and was not expected to generate a pre-tax profit. As discussed above, however, the transaction in Cottage Savings had objective economic substance because it resulted in the realization of actual economic losses arising from a $2 million decline in market value of the property exchanged. Where such objective economic effects are lacking, scrutiny of the subjective intent behind the transactions becomes an important means of determining whether the transactions constitute a scheme with \"no purpose other than tax avoidance\" that may not give rise to deductible losses even where the statute contains no express requirement that the transaction serve a non-tax business purpose. Wexler, 31 F.3d at 124.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45.. Pohlschroeder's handwritten memorandum of October 19 indicating that the Met Note acquisition would proceed on November 17 and that the Long Bond and Euro Note acquisitions would proceed after acquisition of the Citicorp notes further supports the Tax Court's determination that ACM delayed the acquisition of the debt issues to accommodate its tax-driven strategy of acquiring and disposing of private placement notes in a contingent installment sale. See 73 T.C.M. at 2200.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46.. See app. at 386-87 (authorizing investment in \"private placement\" notes as an investment \"pending the acquisition\" of Colgate debt issues); app. at 391 (recommending sale of Citicorp notes to generate cash needed to acquire Colgate debt and acquisition of LIBOR notes to hedge risks associated with Colgate debt); app. at 397 (advising reduction of LIBOR note holdings in light of reduced need for hedging within partnership); app. at 408-09 (recommending Disposition of remaining \"highly volatile\" LIBOR notes in light of Colgate's increased partnership interest which eliminated need for hedge within partnership).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47.. The rationales set forth in ACM's contemporaneous records are particularly implausible in light of the documents prepared between May and October 1989, before ACM's formation, which propose an identical sequence of transactions far in advance of the events which, according to memoranda and minutes recorded during the operation of the partnership, prompted each ensuing step in the series of transactions. See 71 T.C.M. at 2191; app. at 678-79, 275-79, 310-21, 296-308.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48.. While ACM purported to combine the tax avoidance objectives of Merrill Lynch's initial May 1989 proposal with the non-tax debt acquisition objectives incorporated into subsequent proposals, ACM's pursuit of these two distinct objectives within the same partnership cannot obscure the fact that the contingent installment exchange, which was solely responsible for the tax consequences at issue, was executed independently of, did not further, and in fact impeded ACM's pursuit of its non-tax debt acquisition objectives, because the Citicorp notes placed the cash needed to acquire Colgate debt into illiquid instruments whose Disposition cost ACM several million dollars in transaction costs while the purchase of the LIBOR notes increased exposure to falling interest rates, diminishing the desired effects of the debt acquisition strategy. Thus, the non-tax motivations behind ACM's debt purchase do not alter the fact that the contingent installment sale was motivated only by tax avoidance purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49.. ACM, citing Sacks v. Commissioner, 69 F.3d 982, 991 (9th Cir. 1995), argues that a transaction need not be profitable in order to be respected for tax purposes. See br. at 24 \u0026 n.30. Sacks, however, held that, \"[w]here a transaction has economic substance, it does not become a sham merely because it is likely to be unprofitable on a pre-tax basis,\" and found that the transaction had economic substance because it involved a sale and leaseback of equipment used for legitimate business purposes and it resulted in concrete changes in the parties' economic positions. See 69 F.3d at 990-92. Thus, Sacks is inapposite in this case where the contingent installment exchange served no non-tax business purposes and did not materially alter ACM's economic position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50.. According to these documents, the capital gains realized in the first year of the transaction would equal the aggregate capital losses realized in the ensuing years, reflecting no net economic change. See app. at 279, 300-301, 305-08.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51.. ACM, citing its expert's opinion that ACM could have earned a profit at market interest rates of 8%, see br. at 38 \u0026 n.47, contends that the Tax Court erred in concluding that ACM could not have expected to earn a profit from its transactions \"under any reasonable forecast of future interest rates.\" 73 T.C.M. at 2219. However, in assessing the anticipated profitability of a transaction, tax courts properly may disregard computations, such as those presented by ACM's expert, that were prepared in the context of the litigation and which \"had not entered into [the taxpayer's] calculations at the outset\" of the transaction. Goldstein, 364 F.2d at 740. Because nothing in the record resembles a profitability calculation conducted at the inception of the transaction, we find no error in the Tax Court's determination that ACM's transactions were not designed to generate a profit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52.. Similarly, the evidence that neither Colgate nor ACM reasonably expected to gain any pretax profit from the transaction or even attempted to formulate a profitability projection compels us to reject ACM's contention that the Tax Court's profitability analysis improperly rested on a finding that ACM could have made greater profits with less risk by pursuing alternative investments. See br. at 46. While Lemmen v. Commissioner, 77 T.C. 1326, 1346 n.29 (1981), on which ACM relies, emphasized that a business venture may constitute an activity engaged in for profit within the meaning of I.R.C. § 183 even when other types of ventures may have been more profitable, this proposition does not preclude the Tax Court from considering, in its analysis of whether there was a profit motive behind ACM's transactions, that the decision to exchange Citicorp notes for LIBOR notes involved substantial transaction costs, entailed significant risks given the anticipated falling interest rates, and compared unfavorably to the higher profitability and lower risk of the 8.75% cash deposit accounts which ACM affirmatively relinquished to pursue this strategy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53.. ACM contends that the Tax Court erred by examining the transactions' anticipated profitability from Colgate's perspective, contrary to the principle that the expected profitability of partnership transactions must be determined \"at the partnership level, rather than at the level of the partners.\" Br. at 36. However, as we explained in Simon v. Commissioner, 830 F.2d 499, 507 (3d Cir. 1987), [a]lthough the existence of a profit objective of a partnership is determined at the partnership level, . . . a partnership is merely a formal entity, and a determination of profit objective can only be made with reference to the actions of those . . . who manage the partnership affairs. . . . . [Therefore] the Tax Court did not misapply the profit objective test at the partnership level by looking to the motives and actions of those individuals that organized, structured and conducted [partnership] operations. In this case where ACM and its transactions were structured around Colgate's objectives and where Colgate was to hold a 99.7% stake in any eventual partnership profits, see 73 T.C.M. at 2190-97, 2217-19, 2221, we find no error in the Tax Court's examination of Colgate's prospects for profit as a means of analyzing ACM's prospects for profit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54.. ACM argues, br. at 9, that each of ACM's partners realized a positive pre-tax return on its investment in ACM. However, we reject ACM's attempt to equate net partnership profits with profits resulting from the contingent installment exchange which gave rise to the tax consequences at issue and which the Tax Court properly found, based on ample evidence in the record, was not reasonably anticipated to generate a profit. See 73 T.C.M. at 2218-19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55.. On June 25, 1991, Colgate paid Kannex $85,897,203 and Southampton paid Kannex $15 million to purchase a portion of Kannex's share in the partnership. On November 27, 1991, ACM redeemed Kannex's remaining partnership interest at a cost of $100,775,915 which Colgate borrowed against the partnership assets it was to acquire. See app. at 137, 769-70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56.. ACM also cites City of New York v. Commissioner, 103 T.C. 481, 487 (1994), aff 'd, 70 F.3d 142 (D.C. Cir. 1995), which analyzed whether I.R.C. § 141, in setting forth statutory distinctions based on the amount of bond proceeds forwarded to private parties, referred to these amounts in absolute terms or as adjusted to present value. The court concluded that \"time value of money concepts can be applied only in the presence of a legislative directive to do so\" and found no indication that Congress intended to refer to adjusted amounts. Id. (citation omitted). Because the issue of whether to imply a net present value adjustment in an amount specified in the Internal Revenue Code is distinct from the issue of whether to consider net present value as a variable in a profitability analysis under the economic substance doctrine, wefind City of New York inapposite.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57.. For similar reasons, we reject ACM's contention, see br. at 45, that the Tax Court erroneously excluded from its profitability analysis the gains derived from the portion of the Citicorp notes which ACM held until October 1991 instead of exchanging them for LIBOR notes. These notes, like the $140 million cash proceeds of the Citicorp note Disposition, were not involved in the exchange for contingent-payment notes. Thus, any profits generated thereby may not be considered to be profits arising from the contingent installment sale. In fact, the profitability of holding the Citicorp notes until 1991 when they could be tendered to the issuer at par, ensuring recovery of their principal value, only highlights the lack of reasonably anticipated profitability in exchanging these notes for the LIBOR notes whose principal value was at risk in the projected declining interest rate market. We also are unpersuaded by ACM's contention, see id., that the Tax Court, having excluded from its profitability analysis the gains from the Citicorp notes held until 1991, erred by failing to exclude from its calculations a portion of the transaction costs arising from the partnership transactions as a whole. See id. Even if we were to subtract the 15% pro rata portion of the transaction costs that ACM suggests were attributable to the 15% of ACM's $205 million in Citicorp notes which were not exchanged in the contingent sale, the resulting increase in the net yield from ACM's transactions, totaling under $0.5 million, would not support the Conclusion that these transactions portended a reasonable prospect for profit, particularly in light of the evidence that ACM and its partners made no attempt to assess the transactions' profitability after transaction costs. In any event, the Tax Court properly declined to allocate a pro rata portion of the overall transaction costs to the portion of the Citicorp notes which were put to Citicorp at par in 1991, because the most significant portion of the transaction costs arose in the course of negotiating the structured transaction and bid-ask spread required to market the illiquid private placement notes to third parties in the contingent installment exchange and to remarket the LIBOR notes, and thus was not properly attributable to the notes which ACM retained and put to Citicorp in 1991.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58.. Contrary to the Commissioner's suggestion, br. at 49, ACM adequately raised before the Tax Court its contention that, as gain from the LIBOR notes was recognized, it was entitled to deduct the corresponding economic losses on those notes. See app. at 3386 (\"[d]isallowing the loss from the sale of the LIBOR Notes would be inconsistent with recognizing the income from the payments under the Notes\"); id. at 3390 (arguing that Commissioner \"should not be permitted to . . . cause the recognition of . . . income and then disregard the same transactions in order to deny a loss\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59.. IRC § 1001(c) provides: \"(c) Recognition of Gain or Loss. -- Except as otherwise provided in this subtitle, the entire amount of the gain or loss, determined under this section, on the sale or exchange of property, shall be recognized.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60.. As the majority notes, the Commissioner apparently realized the possible \"loophole\" in the regulations and enacted Treas. Reg. § 1.701-2(a) in an apparent effort to curb such tax driven transactions as the ones here. See Maj. Op. at 29-30, n. 29.\u003c/span\u003e\n\n",
    "body_length": 149415,
    "citedas": [
      "157 F.3d 231"
    ],
    "attorneys": "Albert H. Turkus (argued) Fred T. Goldberg, Jr. Pamela F. Olson Skadden, Arps, Slate Meagher \u0026 Flom, Llp 1440 New York Avenue, N.w. Washington, D.c. 20005 William L. Goldman Christopher Kliefoth McDermott, Will \u0026 Emery 600 Thirteenth Street, N.w. Washington, D.c. 20005 Attorneys for Appellant and Cross Appellee Acm Partnership, Southampton-Hamilton Company, Tax Matters Partner Loretta C. Argrett Assistant Attorney General Richard Farber Edward T. Perelmuter (argued) Tax Division Department of Justice Post Office Box 502 Washington, D.c. 20044 Attorneys for Appellee and Cross Appellant Commissioner of Internal Revenue",
    "category": [
      "230"
    ],
    "judges": "Before: Greenberg, Alito, and McKEE, Circuit Judges",
    "citation_count": 54
  }
}
