{
  "id": "rIC1PWYBTlTomsSBrprO",
  "document": {
    "title": "In re Air Disaster at Lockerbie Scotland on December 21",
    "full_title": "IN RE: AIR DISASTER AT LOCKERBIE SCOTLAND ON DECEMBER 21, 1988. JUDITH A. PAGNUCCO, INDIVIDUALLY AND AS EXECUTRIX OF THE ESTATE OF ROBERT I. PAGNUCCO, DECEASED; MOLENA A. PORTER, INDIVIDUALLY AND AS ADMINISTRATRIX OF THE ESTATE OF WALTER L. PORTER, DECEASED AND DONA BARDELLI BAINBRIDGE, INDIVIDUALLY AND AS ADMINISTRATRIX OF THE ESTATE OF HARRY M. BAINBRIDGE v. PAN AMERICAN WORLD AIRWAYS, INC., AND ALERT MANAGEMENT SYSTEMS, INC. .",
    "jurisdiction": "Second Circuit",
    "date": "1994-09-12T00:00:00.000Z",
    "docket": "Docket Nos. 92-9251, 92-9253, 92-9255",
    "body": "CARDAMONE, Circuit Judge :\n\nPan American World Airways, Inc. (Pan Am) and Alert Management Systems, Inc. (Alert) (collectively Pan Am, defendants or appellants) appeal from final judgments entered on September 9, 1992 in the United States District Court for the Eastern District of New York (Platt, C.J.) in three cases arising out of the Pan Am Flight 103 terrorist bombing that occurred over Lockerbie, Scotland in December 1988. The trial was bifurcated into a liability phase, binding on all plaintiffs whose cases were consolidated in this multidistrict litigation, and a damages phase governing the cases of the three plaintiffs before us. The damages phase will also set the standards for damage awards in future cases resulting from this tragic disaster.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nFew Americans have forgotten the bombing of Flight 103 over Lockerbie, Scotland a few days before Christmas in 1988. There were 259 Americans aboard Pan Am's plane from all walks of life. Among the passengers were business executives, entrepreneurs, airline employees, and college students -- including 38 Syracuse University students returning home from study abroad. Although four years have passed since this tragedy occurred, it remains vivid in our national consciousness, standing as a reminder of our collective vulnerability to wanton terrorist acts.\n\nThe 13-week liability trial controlled all the consolidated cases that had been filed against Pan Am throughout the United States by the passengers' and the crews' survivors and representatives. Trial began April 27, 1992. The jurors heard lengthy testimony from 58 witnesses, much of which was introduced by the over 180 depositions obtained during massive discovery taken worldwide. At its close, the jury rendered a special verdict finding defendants guilty of wilful misconduct that caused the explosion and the crash.\n\nAt the Conclusion of the damages phase $9,225,000 was awarded to the Pagnucco family, $9,000,000 to the Bainbridge family, and $1,735,000 to the Porter family. Decedents Pagnucco and Bainbridge had been Pepsico attorneys, decedent Porter an electrician and part-time musician. The damage awards included damages for loss of society and damages for loss of parental care to adult children. No award for survival damages -- sought by plaintiffs -- was made because the jury found the passengers had suffered no conscious pain and suffering before their deaths. Pan Am and Alert appeal challenging the finding of liability and the damage awards.\n\nBACKGROUND\n\nOn December 21, 1988 a bomb exploded on Pan Am Flight 103 causing it to crash over Lockerbie, Scotland. The 243 passengers and 16 crew members aboard the flight traveling from London to New York all perished. Numerous plaintiffs, including those in the cases before us, brought wrongful death actions against Pan Am and Alert, a Pan Am affiliate that provided security services in London and in Frankfurt, where Flight 103 originated. All those actions were consolidated for trial in the Eastern District of New York.\n\nA single jury trial was conducted before Chief Judge Platt to try the liability issues common to the passenger cases. The parties agreed that the case was governed by the Warsaw Convention, formally named the Convention for the Unification of Certain Rules Relating to International Transportation by Air, done at Warsaw, Oct. 12, 1929, 49 Stat. 3000, T.S. No. 876, 137 L.N.T.S. 11, reprinted at 49 U.S.C. app. § 1502 note (1988) [hereinafter Warsaw Convention]. Although the Warsaw Convention generally limits a carrier's liability for damages to $75,000 per passenger, Article 25 permits recovery of unlimited compensatory damages provided the carrier's \"wilful misconduct\" caused the damages. An earlier decision of this Circuit established that punitive damages may not be collected under the Warsaw Convention. In Re Air Disaster at Lockerbie, Scotland on December 21, 1988 (\"Lockerbie I\"), 928 F.2d 1267 (2d Cir.), cert. denied, 112 S. Ct. 331 (1991).\n\nOn July 10, 1992 the jury found that the defendants engaged in wilful misconduct that led to this fatal crash. The trial's liability phase centered on Pan Am's alleged noncompliance with Federal Aviation Administration (FAA) directives concerning baggage inspection, particularly with regard to unaccompanied baggage that might contain explosives. Additional proof was introduced regarding other alleged misconduct on the air carrier's part. Plaintiffs contended that the bomb entered the flight on an unaccompanied bag that Pan Am, through its wilful misconduct, failed to inspect and detect. Under plaintiffs' theory -- detailed by several expert witnesses -- the bomb was hidden inside a radio-cassette player packed in a bronze Samsonite suitcase. The suitcase supposedly traveled from Malta to Frankfurt on Air Malta Flight 180. There, the experts posited, it was transferred to the first leg of Flight 103 from Frankfurt to London, where it was then placed on Flight 103 bound for New York.\n\nAlthough bags transferred from other flights to Flight 103 in Frankfurt were x-rayed, plaintiffs asserted the airline's x-ray procedure violated security requirements contained in an FAA regulation at issue in this case, Air Carrier Standard Security Program or ACSSP XV.C.1.(a), which ensured that bags matched passengers and that any unaccompanied bags be physically inspected. Pan Am unsuccessfully argued to the jury that its actions did not amount to wilful misconduct, and that it was impossible to determine how the bomb was planted on Flight 103. To meet plaintiffs' claims of wilful misconduct, Pan Am and Alert emphasized that the transferred bags had been examined using x-ray equipment, but that no bomb was discovered. They challenged plaintiffs' theory of causation and suggested that even if there were any misconduct on their part, it did not lead to the crash.\n\nIn finding defendants liable the jury rendered a special verdict. On the special verdict form, it indicated that it had specifically found 1) that \"Pan Am (including Alert) engaged in wilful misconduct,\" and 2) that the wilful misconduct was \"a substantial factor in causing the disaster.\" Following the liability phase, the jury then awarded compensatory damages in the three plaintiffs' cases. There are 207 other passenger cases pending, all awaiting the outcome of this appeal.\n\nDiscussion\n\nOn appeal Pan Am rolls out a panoply of arguments, most involving evidence the district court excluded, and which, therefore, was not heard or considered by the jury. These contentions concern four broad areas: I) the exclusion of evidence related to Pan Am and Alert's alleged noncompliance with ACSSP regulations concerning unaccompanied baggage; II) the admission of evidence showing other alleged misconduct on appellants' part coupled with the disallowance of defense testimony concerning alternate theories of causation; III) various other evidentiary rulings; and IV) the legal bases for the damage awards. In the Discussion that follows, we examine each of these four areas in order.\n\nI EXCLUDED EVIDENCE PAN AM AND ALERT ARGUE WOULD HAVE NEGATED ANY WILFUL MISCONDUCT ARISING FROM THEIR NONCOMPLIANCE WITH CERTAIN ACSSP REGULATIONS\n\nAppellants insist the trial court committed reversible error in excluding several pieces of evidence that might have negated a finding of wilful misconduct based on appellants' alleged failure to comply with FAA regulations concerning unaccompanied baggage. This first challenge centers on rulings excluding three lines of evidence that appellants believe were relevant to Pan Am and Alert's state of mind, that is, their wilfulness. The main line of barred evidence purportedly demonstrated an oral waiver by the FAA, excusing Pan Am's compliance with relevant security regulations. The breach of those regulations was central to plaintiffs' case and, as a response, Pan Am and Alert sought to demonstrate that they thought they were complying with the FAA requirements.\n\nThe second piece of barred evidence was British regulations that did not require the observance of the same safety standards as did those of the FAA. Appellants sought to negate any inference of wilfulness on their part by showing that x-raying baggage transferred from other airlines -- the procedure Pan Am followed -- complied with the British regulations. The third piece of evidence not entertained was proof that some experts believe the highest threat to airline safety is not posed by unaccompanied baggage. Each of these three lines of evidence, appellants urge, might have negated plaintiffs' showing of wilful misconduct.\n\nThe standard of liability under the Warsaw Convention, as already noted, requires that a carrier have engaged in \"wilful misconduct\" causing the claimed losses in order for plaintiffs to hold a carrier liable in an amount exceeding the Convention's $75,000 damage limit. See Warsaw Convention, art. 25. Wilful misconduct under the Convention means that a carrier must have acted either 1) with knowledge that its actions would probably result in injury or death, or 2) in conscious or reckless disregard of the fact that death or injury would be the probable consequence of its actions. See Ospina v. Trans World Airlines, Inc., 975 F.2d 35, 37 (2d Cir. 1992), cert. denied, 123 L. Ed. 2d 650, 113 S. Ct. 1944 (1993); In re Korean Air Lines Disaster of September 1, 1983, 932 F.2d 1475, 1479 (D.C. Cir.), cert. denied, 112 S. Ct. 616 (1991). The district court charged the jury under that standard and also charged it that the standard applied whether wilful misconduct resulted from an act or failure to act by the carrier. Appellants do not challenge the district court's jury instruction as to wilful misconduct. Instead, they focus on the just recited three different lines of proof they were not allowed to present to guide the jury's application of that standard, that is, the oral waiver, the British regulations, and expert testimony regarding the threat posed by unaccompanied baggage.\n\nA. The Alleged Oral Waiver\n\nWe begin Discussion by reference to the standard of review on appeal from an exclusion of evidence at trial. That standard establishes that the relevance and admissibility of proffered evidence rests in the sound discretion of the trial court. See, e.g., United States v. Caming, 968 F.2d 232, 238 (2d Cir.), cert. denied, 121 L. Ed. 2d 339, 113 S. Ct. 416 (1992); United States v. Ebner, 782 F.2d 1120, 1126 (2d Cir. 1986). Defendants maintain that an FAA official granted them an oral waiver excusing strict compliance with certain FAA regulations, and that Chief Judge Platt abused his discretion when he disallowed their evidence purporting to demonstrate their belief in this waiver. Although Pan Am is imprecise as to the date of the purported waiver, it asserts it was given verbally to a Pan Am official. Virtually no written documentation supports it. Defendants' argument essentially is that this evidence would have shown that their x-ray inspection of interline bags complied with FAA requirements or that, regardless of FAA requirements, they did not act with conscious or reckless disregard of the probable consequences of their x-ray procedures since they thought the safety precautions they were following were permissible.\n\n1. The Unambiguous Nature of ACSSP Regulation XV C.1.(a)\n\nIn support of this point, Pan Am points out that a regulation may be interpreted orally, and that the regulation at issue is ambiguous and therefore susceptible to such an interpretation. We are unable to accept appellants' premise that the supposed oral waiver was in fact an interpretation of an ambiguous regulation. As a matter of law the FAA regulation at issue here -- ACSSP XV C.1.(a) -- is not ambiguous, as the following Discussion demonstrates.\n\nIn April 1986 the FAA established specific ACSSP regulations and mandated that they be followed at heightened security airports designated \"extraordinary security\" airports. Both Frankfurt and London's Heathrow airports were classified as \"extraordinary security\" airports. The central regulation at issue in this case, ACSSP regulation XV C.1.(a), concerns the detection of unaccompanied bags. It directs an air carrier operating out of an extraordinary security airport to\n\nconduct a positive passenger/checked baggage match resulting in physical inspection or noncarriage of all unaccompanied bags. The carrier may use either physical match or administrative match, but, in either case, it should be done in a way that passengers are aware of the use of the procedures.\n\nAir carriers like Pan Am, thus were required under the regulations first to do a physical or an administrative match to detect unaccompanied bags, and then to physically inspect any unaccompanied bags before they could be loaded. ACSSP XV C clearly ordered that an air carrier operating out of an extraordinary security airport \"shall adopt and carry out the . . . special procedures except where local conditions preclude and alternative measures have been approved by the FAA.\"\n\nUnder ACSSP XV C.1.(a) the positive match is designed to ensure that any unaccompanied bags definitely will be identified as such. The regulation permits the positive match to be done either as a \"physical match,\" in which passengers identify their bags on the tarmac, or an \"administrative match,\" in which the number of passengers boarding the aircraft and the number of bags checked are compared with the number of bags to be loaded.\n\nPan Am claimed that it conducted an administrative match. Plaintiffs averred that this administrative match did not comply with the regulations because it was incomplete and failed to identify all unaccompanied bags. Particularly, plaintiffs point out Pan Am's procedures did not identify the bags of interline passengers, i.e., those passengers who had transferred to a Pan Am flight from another airline and whose bags had been checked with the other airline at the passengers' point of origin.\n\nIf a match conducted under the regulations revealed unaccompanied bags, the regulations expressly directed the airline to conduct the second step of the process, \"physical inspection,\" before it could carry the bags. ACSSP XV C.1.(a). Plaintiffs demonstrated that Pan Am and Alert x-rayed all bags transferred from other carriers -- so-called \"interline\" bags -- but conducted no other inspection of such bags. Pan Am and Alert assert that physical inspection could be interpreted to mean an x-ray inspection. For several reasons, we think this a strained reading of the unambiguous regulation.\n\nFirst, the FAA promulgated \"Physical Inspection Guidelines\" in the ACSSP which specified that physical inspection involves opening and inspecting all compartments of baggage. The guidelines do not mention x-ray as an acceptable means of inspection. Second, the jury heard testimony from Pan Am's own General Manager at Heathrow, and other witnesses as well, that physical inspection under the regulations involved opening up bags and that x-raying them did not satisfy the regulation. Third, ACSSP regulations applicable at other, lower security airports explicitly permitted x-ray or physical inspections. Thus, it is plain that the regulations applicable at Frankfurt and London's Heathrow were unambiguous: they did not permit x-ray inspections as a substitute for a physical inspection. Appellants' reliance on United States v. Eastern Air Lines, Inc., 792 F.2d 1560, 1563 (11th Cir. 1986), is inapposite because that case involved a more broadly worded regulation, one susceptible to different interpretations.\n\nWe hold, therefore, that the district court did not err in refusing to allow witnesses -- like the co-chair of the Pan Am Security Task Force, Richard Cozzi -- to testify that they thought the regulations were ambiguous. As a matter of law, ACSSP XV C.1.(a) is not ambiguous in requiring a positive match and physical inspection of unaccompanied bags before they may be carried on board a departing plane. Introducing testimony to the contrary would have invaded the court's function of determining the law and instructing the jury as to that law. See FAA v. Landy, 705 F.2d 624, 632 (2d Cir.), cert. denied, 464 U.S. 895 (1983).\n\n2. Proof of the Alleged Oral Waiver\n\nGiven that the FAA regulation in question is not ambiguous, Pan Am next asserts it obtained an oral waiver of the regulation from the FAA and that the district court erred in disallowing evidence of that waiver. Evidence showed that as of April 1986 Pan Am established procedures to ensure that unaccompanied interline bags were not carried on its airlines. However, the process for identifying unaccompanied interline bags proved too \"cumbersome\" and expensive. Pan Am therefore stopped performing a match for interline bags in London in February 1987 and in Frankfurt in July 1988. It also eliminated physical searches of unaccompanied interline bags. Thereafter bags were simply x-rayed and put on board, rather than matched against particular tickets. This was a violation of ACSSP XIV, which requires Pan Am to advise the FAA in writing if interline bag match has been discontinued.\n\nIt is apparent therefore from the record that Pan Am made no distinction on Flight 103 between interline accompanied versus interline unaccompanied bags. Most significantly, the Flight 103 pilot was not informed about the presence of unaccompanied interline bags, in violation of ACSSP XIII E. Pan Am managers allegedly instructed gate employees in London not to advise pilots of unaccompanied bags because it made crews \"jittery.\" What remains central to appellants' defense is their reliance on x-ray alone to inspect interline bags transferred to Flight 103. They sought to introduce evidence that at 1986 and 1987 meetings, mostly with unidentified FAA officials, oral permission was purportedly given to Pan Am to allow it to deviate from the ACSSP regulations. Because of that waiver, they contend, they were in compliance with FAA requirements. They thus sought to show that their noncompliance from the letter of the regulations was excused by an exemption.\n\nYet, the relevant regulations expressly require a written application for a waiver and written FAA approval based on certain findings. See 14 C.F.R. §§ 11.25, 11.27(e), 108.7(a)(2), 108.25(b)-(c) (1993); see also 49 U.S.C. §§ 1357(a)(2)(B), 1421(a)(6) \u0026 (c). The Director of the Office of Civil Aviation Security at the FAA at the time of the Pan Am bombing, Raymond Salazar, testified that in order to obtain an exemption from an ACSSP regulation an air carrier would have to file a written request and follow a specific procedure that was then in place. Salazar further denied ever granting an oral waiver to any Pan Am official or for that matter to any other air carrier. His predecessor at the FAA, Billie Vincent, testified to the same effect that written authorization and approval were required for exemption from ACSSP requirements.\n\nSalazar was asked by plaintiffs to testify whether he had ever granted an oral waiver to a Pan Am official. The purpose of the question was to get an explanation of a statement contained in a Pan Am electronic mail (e-mail) memorandum. Plaintiffs produced the e-mail message that Pan Am security officer Daniel Sonesen had sent to the regional Pan Am security representatives at Heathrow and Frankfurt. The e-mail message, dated March 28, 1988, stated in part, \"the Dir. FAA R Salizar has granted x ray as and [sic] alternative to searching pass. baggage.\" Salazar testified that that representation was inaccurate and a misrepresentation, and when pressed by counsel, characterized it as \"a falsehood.\"\n\nDespite requirements that exemptions be in writing, Pan Am offered no proof that it had ever applied for a written exemption from the provisions of ACSSP XV C.1.(a) at Heathrow or Frankfurt. There was evidence that Pan Am had made written applications on other occasions for exemptions from ACSSP XV C.1, 2, and 3, indicating that Pan Am was aware of the proper procedure for requesting a waiver. Further, Pan Am's Chairman, Thomas Plaskett, admitted the airline knew waivers had to be in writing.\n\nAlthough the FAA regulations occupied a key role in the trial of this case, it must be kept in mind that Pan Am and Alert's compliance with them is not dispositive of the outcome. As appellants acknowledge in their brief, and as the court instructed the jury, proof of full compliance with the ACSSP would not necessarily provide appellants with a complete defense against a claim of wilful misconduct. FAA regulations only establish minimum requirements for air carriers. A jury could conceivably find certain circumstances under which an air carrier had committed wilful misconduct even though it followed FAA regulations to the letter. Similarly, noncompliance with ACSSP procedures will not necessarily lead to a per se finding of wilful misconduct. A carrier might not have acted with wilful misconduct, even were it to have failed to comply with an FAA regulation. The issue we are called upon to decide, thus, is whether evidence of Pan Am's alleged oral waiver should have been admitted by the trial court.\n\n(a) Proposed Testimony\n\nThe excluded evidence concerning the oral waiver primarily involved the testimony of three witnesses. We are told that the first witness, Daniel Sonesen, would have testified that he approached the FAA in 1986 and received a verbal authorization for the x-ray-only inspection of interline bags, though he could not recall who gave this authorization. He would have testified further, so defendants state, that at an October 1987 meeting with Salazar and others he was advised that x-ray inspection would comply with ACSSP requirements. Sonesen's pretrial deposition testimony was before the district court, but we are unable to find in the record an express offer of proof of what his testimony would have been. Moreover, our faith in the defendants' versions of Sonesen's testimony is not enhanced by the fact that Sonesen's 1990 deposition testimony is substantially inconsistent with the representations made by the defendants before us. Simply put, the defendants refused to put Sonesen on the stand for their own reasons, and yet want us to accept at face value representations not made under oath, not subject to cross-examination, and in fact inconsistent with prior testimony made under oath. See, e.g., Fortunato v. Ford Motor Co., 464 F.2d 962, 967 (2d Cir.), cert. denied, 409 U.S. 1038, 34 L. Ed. 2d 487, 93 S. Ct. 517 (1972) (stating that appellate court will not \"permit a party to allege on appeal what it failed to claim to the trial court,\" since that \"would allow a party to obtain a new trial simply on its claim that it would have proven a certain fact or facts had it been given a chance\"); Moss v. Hornig, 314 F.2d 89, 93 (2d Cir. 1963) (holding that an appellate court cannot be expected to reverse where there was no offer of proof, and \"where the significance of the evidence sought to be introduced is not obvious\"); Marrone v. United States, 355 F.2d 238, 241 (2d Cir. 1966) (holding that the failure to make an offer of proof to demonstrate the significance of excluded testimony \"must be held to be fatal,\" even where persuasive authority indicated that the district court should have allowed the testimony).\n\nThe second witness proffered by the defense was the former co-chair of the Pan Am Security Task Force, Richard Cozzi. Although Cozzi testified at trial, he was not permitted to testify as to Pan Am's purported verbal authorization from the FAA. Since his proposed testimony was preserved, we can see he would have testified that the Task Force in late 1986 wanted to find out if x-ray of interline bags would comply with the ACSSP, even though some members were doubtful it could comply; the Task Force instructed Sonesen to check with the FAA as to whether inspection by x-ray satisfied the ACSSP; and Sonesen reported back that he had done so and that the FAA said that x-ray inspection of interline bags would comply with the requirements. Even had Cozzi been permitted to testify on this issue, his statement respecting what Sonesen reported would have been inadmissible hearsay because it was offered for the truth of the matter asserted, to wit, that Salazar granted Pan Am a waiver of compliance with ACSSP XV C.1.(a). That Pan Am offered Cozzi's testimony for this purpose is clear from the record:\n\nMR. SHAUGHNESSY: You talked about what Mr. Sonesen told you about his Discussions with the FAA. Do you have an opinion as to whether Mr. Sonesen was telling the truth?\n\nMR. COZZI: Yes. I certainly believed Mr. Sonesen was telling the truth. There was no reason for him not to.\n\nThe third witness was Pan Am's Chairman, Thomas Plaskett. Pan Am offered his testimony in an offer of proof, in which Plaskett stated that he did not recall having any conversations or information concerning whether the FAA had authorized Pan Am to use x-ray machines to examine luggage.\n\nAdditional evidence appellants sought, but were not allowed to introduce to show the supposed appropriateness of their procedures included testimony concerning a September 1988 FAA inspection at Heathrow at which Pan Am was not cited for violating ACSSP XV C.1.(a).\n\n(b) Trial Court's Rulings\n\nIn a series of oral rulings repeated throughout the record, the trial Judge stated that any testimony by defense witnesses as to the purported verbal authorization would be excluded. It treated the proffered evidence as an attempt to mount a so-called government authorization defense, the bounds of which will be discussed shortly. Chief Judge Platt believed that a government authorization defense may only be predicated on authorization from a government official with power to grant such authorization. He held the defense unavailable because anyone who might have given a verbal exemption at the FAA would have had no authority to do so. The trial court also observed that any evidence as to a verbal authorization would be irrelevant since Pan Am was charged with knowing the regulations, including those that stated amendments and exemptions to the regulations must be in writing.\n\nBefore analyzing the government authorization defense, we briefly discuss one of defendants' arguments for permitting the introduction of the verbal authorization defense: to rebut Salazar's statements concerning Sonesen's e-mail message, which plaintiffs had introduced into evidence. A trial court may in the interests of fairness allow otherwise inadmissible evidence on an issue when necessary to rebut a false impression left by inadmissible evidence introduced by an opposing party. See, e.g., United States v. Rea, 958 F.2d 1206, 1225 (2d Cir. 1992). But whether to entertain such sort of proof is left squarely in the trial Judge's discretion since the presider at trial is in a better position to assess how to conduct it fairly than is an appellate court reading the record.\n\nHere the district court did not abuse its discretion in declining to admit the evidence for this purpose. It directly offered Pan Am and Alert a curative instruction, stating, \"on the so-called verbal authorization, . . . if they want me to give the jury an instruction to disregard the testimony that came in at the outset of the case before I understood what the issue was, I will be glad to give that instruction.\" Since appellants refused to ask for that instruction, they waived any complaint as to harm they may have suffered due to Salazar's characterization of Sonesen's e-mail as inaccurate. See United States v. Grubczak, 793 F.2d 458, 461-62 (2d Cir. 1986).\n\nNor is there merit in Pan Am's contention that it was an abuse of discretion to exclude testimony regarding a September 1988 FAA inspection at which Pan Am was not cited for violations relating to its x-ray procedure. Other evidence that was before the jury showed FAA inspections of Pan Am operations at Heathrow and Frankfurt had not resulted in any FAA citations.\n\nNow turning to the substantive question of whether the district court erred in refusing to allow any evidence regarding the oral waiver, the plaintiffs' argue initially that Pan Am failed to make a proper offer of proof with respect to the evidence they sought to introduce. Assuming without deciding that defendants sufficiently preserved their objection does not change the result, as we demonstrate below.\n\nWe note that the parties and the district court frame the legal issue they faced in different ways. Chief Judge Platt thought the offer of proof was an attempt by defendants to mount a government authorization defense. We believe the proffered proof also can be viewed as an attempt by defendants to invoke what is often referred to as a \"mistake of law\" defense. Defendants assert it was proof probative of defendants' states of mind.\n\n(i) Government Authorization\n\nChief Judge Platt correctly ruled that a government authorization defense was not available to Pan Am and Alert. Such defense requires a demonstration of \"legitimate reliance on an official interpretation of law.\" See United States v. Durrani, 835 F.2d 410, 422-23 (2d Cir. 1987). Under our case law, the official on whose interpretation the defendant allegedly relied must have actual authority. See United States v. Duggan, 743 F.2d 59, 83-84 (2d Cir. 1984) (mistaken belief that individual had apparent government authority did not warrant submission of defense to jury); see also United States v. Schwartz, 924 F.2d 410, 422 (2d Cir. 1991).\n\nHere all the evidence demonstrated that amendments to or exemptions from ACSSP XV C.1.(a) had to be made in writing by the FAA following written application. Both Salazar and Vincent testified that as Directors of the FAA Office of Civil Aviation Security they did not have the authority to alter the ACSSP orally. The regulations support this view, as did testimony of Pan Am's own witnesses. Pan Am's attempted government authorization defense was therefore properly precluded by the district court because the FAA officials allegedly contacted simply did not have the actual authority to grant any verbal authorization for Pan Am's x-ray-only inspection of interline bags.\n\n(ii) Mistake of Law\n\nViewed as a mistake of law defense, defendants offered the oral waiver evidence to show they thought what they were doing was in accordance with the law and, even if they were mistaken, under such a circumstance they should not be held liable for wilful misconduct. Yet, contrary to appellant's view, even were a mistake of law defense one that could be successfully interposed, it would not necessarily absolve Pan Am of liability in this Warsaw Convention case. The same standards governing the availability of mistake of law govern even when it might not supply a complete defense to liability -- in this case, for example, the jury might have found that complying with the FAA minimum requirements was still inadequate under the circumstances on the ultimate issue of wilful misconduct. The usual standards defining the permissibility of a mistake of law defense are as effective where the mistaken law is a regulation. See United States v. International Minerals \u0026 Chem. Corp., 402 U.S. 558, 563, 29 L. Ed. 2d 178, 91 S. Ct. 1697 (1971) (noting \"principle that ignorance of the law is no defense applies whether the law be a statute or a duly promulgated and published regulation\").\n\nIn any event, the oral waiver evidence was inadmissible for purposes of showing that Pan Am's violation of the FAA regulation was the result of a mistake of law. It has long been a maxim that \"ignorance of the law is no excuse.\" The reason for this ancient rule is not because everyone knows the law, but because ignorance of it is a ready excuse easily raised and difficult to refute. We and the Supreme Court regularly acknowledge that a mistaken view of the law usually will not serve as an acceptable defense. Durrani, 835 F.2d at 422; Cheek v. United States, 498 U.S. 192, 199, 112 L. Ed. 2d 617, 111 S. Ct. 604 (1991). While cases where the rule is cited typically involve criminal offenses, see, e.g., Cheek, 498 U.S. at 199, it applies equally in civil cases. See Barlow v. United States, 32 U.S. (7 Pet.) 404, 411, 8 L. Ed. 728 (1833) (Story, J.) (\"It is a common maxim, familiar to all minds, that ignorance of the law will not excuse any person, either civilly or criminally . . . .\"); Ruley v. Nelson, 106 F.R.D. 514, 518 (D. Nev. 1985) (noting ignorance of law is no excuse in civil or criminal law).\n\nIn Cheek v. United States, 498 U.S. 192, 112 L. Ed. 2d 617, 111 S. Ct. 604 (1991), now a seminal case in the area, the Supreme Court declared that the term \"wilfully\" in federal criminal tax statutes carved out an exception to the general maxim that ignorance of the law is no excuse. Id. at 199-200. The Court said that the wilfulness requirement in the tax laws required the defendant to be allowed to introduce evidence as to any belief -- no matter how objectively unreasonable that belief might be -- tending to show an unawareness of a legal duty on defendant's part. Id. at 203.\n\nIn doing so, the Supreme Court carefully limited its decision to the tax field. It emphasized \"the complexity of the tax laws,\" 498 U.S. at 200, the difficulty of the \"average citizen\" in comprehending duties imposed by the tax laws, id. at 199, and constructions of the term \"wilfulness\" in the tax context, id. at 201. Our subsequent decisions and those of other courts acknowledge Cheek 's limited application. See, e.g., United States v. Caming, 968 F.2d 232, 240 (2d Cir.) (collecting other circuits' cases refusing to extend Cheek to non-tax criminal statutes), cert. denied, 121 L. Ed. 2d 339, 113 S. Ct. 416 (1992); cf. Ratzlaf v. United States, 126 L. Ed. 2d 615, 114 S. Ct. 655, 663 (1994) (not intending to \"dishonor the venerable principle that ignorance of the law generally is no defense to a criminal charge\" while allowing mistake of law defense in the specific context of criminal prosecutions for violations of the antistructuring provision of the money laundering statutes).\n\nWe see no reason that would prompt us to view heavily regulated air carriers -- certified by the FAA and charged with knowledge of the relevant statutes and regulations under which they operate -- the same as average citizens who face the daunting task of unraveling the complexities of the Internal Revenue Code. There is cause to be wary because of the ease with which air carriers could fabricate sham defenses and ignore with impunity safety regulations. See United States v. Squires, 440 F.2d 859, 864 (2d Cir. 1971) (stating \"whenever a defense of ignorance of the law . . . is claimed, it is recognized that one may not deliberately close his eyes to what otherwise would have been obvious to him\"). Accordingly, when a law, rule or regulation that pertains to passenger and crew safety is clear, we hold that an air carrier -- one of the handful of corporations in the business of transporting the public by air -- may not claim ignorance of the law as an excuse.\n\nOur holding is narrow. We reiterate it to emphasize its limitations: in a case brought under the Warsaw Convention involving violations of FAA regulations that pertain to the safety of those aboard an aircraft, against a defendant air carrier charged with knowing and following those regulations, that air carrier may not mount a mistake of law defense. In the instant case, therefore, the evidence offered by Pan Am regarding its mistaken view of what was required by the ACSSP was inadmissible for the purposes of mounting a mistake of law defense.\n\n(iii) State of Mind\n\nNotwithstanding the foregoing, appellants insist the oral waiver evidence was admissible on the question of their wilful misconduct, which is of course the ultimate issue in this Warsaw Convention case, see Ospina, 975 F.2d at 37. In Vinieris v. Byzantine Maritime Corp., 731 F.2d 1061 (2d Cir. 1984), we addressed the question of admissibility of evidence going to a defendant's state of mind in the context of a statute that required \"conscious misconduct\" be proven for a seaman to recover under the penalty provision in a wage-withholding statute. We held that \"no evidence which bore even remotely on [state of mind] should have been kept from the jury, unless it interjected tangential and confusing elements which clearly outweighed its relevancy.\" Id. at 1064. This formulation is in some sense a restatement of the well-known balancing test contained in Rule 403 of the Federal Rules of Evidence.\n\nWhether the problems to be anticipated by admission of the oral waiver evidence in the present case clearly outweighed the evidence's relevancy is a close question. Analysis of this issue cannot exist in a vacuum. Because the oral waiver evidence was so intertwined with the government authorization and mistake of law defenses, which as a matter of law were not available to defendants, we believe that admission of such evidence might well have been unnecessarily confusing and perhaps prejudicial so as to justify the trial court's refusal to allow its admission.\n\nNonetheless, even were it an abuse of discretion to deny admission of the oral waiver evidence on the foregoing grounds, we hold that such an error was harmless. An evidentiary ruling is harmless when we are fairly assured that it had no substantial effect on the jury's verdict. See Rea, 958 F.2d at 1220. In the instant case, the record is replete with evidence that wholly undermines Pan Am's claim of good faith. The overwhelming evidence presented during the course of the three and one-half month trial established that Pan Am officials ignored repeated warnings and signals that its security measures were insufficient.\n\nThe scope and nature of this evidence needs to be set forth in some detail. We begin in 1983 when a Pan Am flight leaving Rome, Italy for New York was the target of a bomb planted in an unaccompanied interline suitcase. Disaster was averted only when Turkish authorities conducted a passenger/bag match that uncovered the suitcase. Pan Am thus knew of this type of sabotage and that physical matches of suitcases were successful in averting such a terrorist act.\n\nIn 1985 a bomb hidden inside a radio and packed in an unaccompanied interline bag exploded on an Air India 747 over the North Atlantic, killing all aboard. The dangers of a bomb hidden inside radios packed in interline bags were well known to Pan Am and the airline industry. These two incidents not only led to the adoption of ACSSP XV.C.1(a), but they conveyed clear warnings that what actually happened at Lockerbie was a distinct possibility.\n\nIn September 1986 Pan Am received a report from a group of Israeli security experts commissioned to review Pan Am security at various airports, including Heathrow and Frankfurt. The security experts concluded that \"under the present security system, Pan Am is highly vulnerable to most forms of terrorist attack. The fact that no major disaster has occurred to date is merely providential.\" The report specifically cautioned Pan Am on the use of x-ray machines as substitutes for physical searches, and the dangers of interline unaccompanied bags.\n\nIn October 1988 Alert Manager for Germany Ulrich Weber wrote a memo to New York headquarters citing the need for more personnel to remedy Frankfurt's security shortcomings. Only minimum efforts were made to remedy them.\n\nIn July 1988 the FAA issued a Security Bulletin warning of the high threat of a terrorist retaliatory attack because of the downing of an Iranian Jetliner. In November 1988 Pan Am received an FAA Security Bulletin warning that a raid on a terrorist group had uncovered a bomb built into a Toshiba radio cassette player. (Toshiba Warning). The bulletin warned that the bomb was difficult to detect by the use of normal x-ray.\n\nThe most wilful disregard of passenger safety, bordering on the outrageous, was in December 1988 when Pan Am received an FAA Security Bulletin advising that the United States Embassy in Helsinki had received a telephone warning that a Pan Am flight from Frankfurt to London and on to New York would be bombed. (Helsinki Warning). The Helsinki warning came just 14 days before the instant tragedy and specifically referred to the Toshiba Warning. Despite these warnings, Pan Am failed to conduct searches of unaccompanied interline luggage, and instead inspected such bags only by x-ray. Pan Am did not even alert x-ray technicians to watch for Toshiba radios. It violated FAA regulations by failing to match the bags with particular tickets without advising the FAA in writing that interline bag match had been discontinued. And it violated other FAA regulations by failing to warn pilots about the unaccompanied bags on board for fear that the crews might become \"jittery.\" Additionally, Pan Am did not replace several members of its security team who were woefully undertrained given their responsibility for thwarting terrorist attacks.\n\nMoreover, the Helsinki Warning was deliberately placed under a pile of papers on the desk of the security officer who received the bulletin and was first discovered in the morning following the downing of Flight 103. There was also evidence that Weber, the security officer in charge, ordered the Pan Am employee who discovered the bulletin after the explosion to backdate the warning to give government investigators the impression that the warning was timely disseminated when received. The district court found that the backdating was evidence of consciousness of guilt on the part of Pan Am for its part in the wrongful causation of the crash.\n\nThis and other evidence overwhelmingly supported the jury's Conclusion that but for Pan Am's wholly inadequate terrorist prevention techniques and its deliberate indifference and overt acts of wilfulness, the bombing and the senseless loss of life would not have occurred. Even had Pan Am been permitted to present Sonesen's deposition testimony to the jury, the above recited proof, plus the additional fact that any waiver of FAA regulations had to be in writing, make it plain to us that it would not have affected the jury's finding that Pan Am was guilty of wilful misconduct. Its exclusion was therefore harmless error.\n\nConsequently, for all of the above reasons, the district court's refusal to permit the admission of Pan Am's oral waiver evidence -- on government authorization, mistake of law, and state of mind grounds -- does not constitute a sufficient basis for the granting of a new trial.\n\nB. British Regulations\n\nAppellants' second contention regarding wrongful exclusion of evidence concerning wilful misconduct relates to British air safety regulations. Appellants sought to introduce British Department of Transportation documents and deposition testimony from James Jack, the Principal Aviation Security Advisor for the British Department of Transportation, in which he explained that Pan Am's reliance on x-raying interline bags would have complied with British security directives.\n\nWith respect to the exclusion of the documentary evidence there was no abuse of discretion. That evidence was proffered in the form of British Department of Transport documents and notably included circulars not having the force of law. In addition many of the documents were no longer in effect at the time of the accident. This proof was properly ruled inadmissible as irrelevant, vague, and remote.\n\nThe refusal to admit Jack's deposition is more problematic. The district court stated that it would not admit Jack's testimony about British regulations unless Pan Am and Alert stipulated that they had violated the ACSSP. Pan Am and Alert understandably refused to make such a potentially prejudicial stipulation. The trial court then suggested that Pan Am and Alert had to choose between claiming they followed the ACSSP or claiming that they violated it, but their wilful misconduct should be Judged by local security regulations.\n\nWe agree with Pan Am that it was error to force them to choose between alternate defenses. Alternate and inconsistent defenses are permitted in civil trials. See Fed. R. Civ. P. 8(e)(2); Mathews v. United States, 485 U.S. 58, 64, 99 L. Ed. 2d 54, 108 S. Ct. 883 (1988); Kibby v. United States, 372 F.2d 598, 601 (8th Cir.), cert. denied, 387 U.S. 931, 18 L. Ed. 2d 993, 87 S. Ct. 2055 (1967). The district court had no authority to exclude evidence on the ground that it supported a defense not consistent with Pan Am and Alert's alternate theory.\n\nNevertheless, though it was error to refuse to permit the few pages of Jack's deposition testimony to be read to the jury, it was harmless error. As we noted above, a ruling is harmless when we are fairly assured that admitting or refusing to admit certain proof had no substantial effect on the jury's verdict. See Rea, 958 F.2d at 1220. Here the district court did permit Pan Am to adduce some testimony that its conduct comported with British regulations. The jury had that point before it. Further, plaintiffs' case rested principally on Pan Am and Alert's ACSSP violations, not on whether appellants violated British government's security regulations. The bulk of the evidence regarding the x-ray procedures concerned the issue of ACSSP violations, the importance of conducting a passenger/bag match, and appellants' purported knowing or reckless behavior in failing to follow FAA regulations.\n\nMoreover, Pan Am and Alert presented a strong defense to the jury that even if they violated the ACSSP, their actions did not amount to wilful misconduct. They insisted that a bomb contained in a suitcase would have been visible on x-ray. In fact, the parties stipulated to that fact. Appellants' counsel emphasized in closing argument and elsewhere the safety and expense of the x-ray technology purchased and employed by Pan Am, the fact that even an untrained person could spot a radio on one of their x-ray machines, and made the point that FAA inspections had shown Pan Am x-ray equipment to be in compliance with regulations. Dr. Grodzins, an MIT professor, testified regarding the effectiveness of x-ray examination of baggage. It simply cannot be supposed on the entirety of the voluminous record that Jack's several pages of deposition testimony would have substantially influenced the verdict, given the fact that the closely related defense that Pan Am presented failed to persuade the jury.\n\nC. \"Highest Threat\" Evidence\n\nThe last of the three wrongfully excluded wilful-misconduct- evidence assertions raised by Pan Am is the court's refusal to allow evidence that bombs in unaccompanied baggage did not pose the \"highest threat\" to airline safety. Appellants sought to introduce this evidence to refute the view of one of plaintiffs' experts that unaccompanied bags pose the greatest risk to airline security.\n\nPan Am and Alert sought to elicit testimony from their terrorism expert that unaccompanied bags do not pose the highest threat to airline safety; instead, unsuspecting couriers pose that threat. Plaintiffs' expert, Billie Vincent, had very briefly testified that the unaccompanied bag poses the \"highest threat\" to airline safety. The defense sought to rebut this position through their expert, Dr. Ariel Merari. They contend Vincent's testimony left a false impression as to Pan Am's degree of awareness of the probable consequences posed by unaccompanied baggage.\n\nAlthough the district court did not admit the defense expert's testimony, it agreed to give an instruction that there was no evidence to show that unaccompanied bags posed the greatest security threat and that the jury should disregard any such opinion. Since such a curative instruction was given, any risk that Vincent's brief, qualitative testimony was improperly considered by the jury was removed. See, e.g., United States v. Tutino, 883 F.2d 1125, 1137 (2d Cir. 1989), cert. denied, 493 U.S. 1081, 107 L. Ed. 2d 1044, 110 S. Ct. 1139 (1990). Thus, no abuse of discretion resulted from the exclusion of further testimony on this peripheral subject.\n\nII ADMISSION OF OTHER MISCONDUCT EVIDENCE BY PAN AM AND ALERT AND EXCLUSION OF PAN AM AND ALERT'S ALTERNATIVE SUGGESTIONS OF CAUSATION\n\nPan Am and Alert's second major line of argument concerns what it thinks was an error in the trial court's admitting other evidence of misconduct on their part, while at the same time excluding the testimony of several of their witnesses who, they assert, would have presented alternative theories of causation. We examine each of these challenged rulings separately.\n\nA. Evidence of Appellants' Alleged Other Misconduct\n\nAppellants complain of evidence received to show other acts of alleged misconduct by the airline. This evidence of Pan Am's and Alert's other misconduct is divided into two categories -- SECURITY VIOLATIONS ON FLIGHT 103 and THE \"ALERT\" SECURITY PROGRAM. With respect to the former alleged misconduct, the proof was as follows: (1) Ulrich Weber, the head of Alert in Frankfurt had been convicted in the U.S. of passing bad checks eight years before he was hired by Alert and had been fired after the disaster at Lockerbie for using a company credit card in a brothel; 2) the ramp around Flight 103 had been left unguarded in violation of ACSSP when the Alert employee assigned to guard it felt ill and went inside; 3) Alert employees were inadequately trained, particularly employee Sabine Fuchs who could not explain what a \"selectee\" was even though her job was to pick \"selectees\" out from passengers for further screening; one security agent for Flight 103 was an \"alternate\" who had only two to three hours of training and did not know what the ACSSP required. She thought someone else was monitoring the baggage. 4) Critical to this case is the fact that the x-ray technician for the flight, the only defense against the bomb, had been employed for only seven weeks, had no formal training, and had not been tested. He had never heard about the Toshiba warning.\n\nThe proof regarding THE \"ALERT\" SECURITY PROGRAM revealed first, that it was neither related to security, nor was it a program. Instituted by Pan Am in May 1986 during a period of sharp decline in international travel due to terrorist attacks, the program was a misleading public relations ploy designed to make would-be travelers feel more secure. An advertisement signed by Pan Am's chairman of the board and CEO was placed in the New York Times and other publications:\n\nDear Air Traveler:\n\nOn June 12, 1986, Pan Am will initiate one of the most far-reaching security programs in our industry, a program that will screen passengers, employees, airport facilities, baggage, and aircraft with unrelenting thoroughness.\n\nThe campaign also featured TV ads. As part of the program, Pan Am imposed a security surcharge on international passengers to pay for the promised additional security measures. The surcharge generated $18 million in annual revenue. The security surcharge was $5 each way on overseas tickets -- many Flight 103 passengers paid the surcharge -- but proceeds from the surcharge were not earmarked for security and instead were commingled with Pan Am's general funds. Alert's first president, Fred Ford, wrote a memo to Pan Am senior executives stating that the promised security program was not being put into effect and that passengers would complain \"What do I get for my surcharge?\"\n\nThe evidence revealed, second, that Alert added more guards during FAA inspections to make it appear that more guards were on duty than generally was the case; this included on one occasion having a guard from the front end of an airplane sent to the back when FAA inspectors come on board so that the inspectors would think that there was a guard at both places. Third, in 1986 Pan Am declined to adopt security recommendations made to it by the Israeli security consulting firm, KPI, which criticized Pan Am's reliance on x-ray and emphasized Pan Am's vulnerability to terrorist attack. Fourth, untrained sniffing dogs had been paraded in front of ticket counters at Kennedy airport to create an appearance of security which did not otherwise exist.\n\nAppellants' motion to exclude proof not tied to the Air Malta theory of causation (that the bomb bag came from an interline transfer) was denied by the trial court. It observed that since appellants planned to contest the Air Malta theory, plaintiffs were entitled to present evidence of alleged other misconduct on defendants' parts. The trial Judge reasoned that even if the Air Malta theory did not explain the bomb's presence on Flight 103, other pervasive and extensive wilful misconduct by defendants must have accounted for the bomb's presence. Following this general ruling, no specific objections were made to the individual pieces of evidence listed above on any other grounds. Other objections that might have been raised were waived. Accordingly, we review this as a general ruling permitting the introduction of evidence showing prior misconduct, unrelated to the Air Malta theory.\n\nThis proof that Pan Am acted with wilful misconduct through recklessly disregarding passenger safety in general, with knowledge of the probable consequences of that disregard, was properly received. Although Fed. R. Evid. 404(b) provides for the exclusion of prior misconduct evidence in order to show \"character\" or action \"in conformity therewith\", we follow the inclusionary approach to prior misconduct evidence that allows the admission of prior misconduct for any other relevant purpose. Ismail v. Cohen, 899 F.2d 183, 188 (2d Cir. 1990).\n\nPlaintiffs asserted that a contempt for security pervaded Pan Am from the highest to the lowest levels of the corporation, and that the totality of security failures would permit the jury to infer wilful misconduct. We have approved consideration of the totality of a defendant's wrongdoing in determining whether wilful misconduct existed. See Tug Ocean Prince, Inc. v. United States, 584 F.2d 1151, 1164 (2d Cir. 1978), cert. denied, 440 U.S. 959, 59 L. Ed. 2d 772, 99 S. Ct. 1499 (1979); see also United States v. Daly, 842 F.2d 1380, 1388 (2d Cir.) (background evidence may be introduced to \"furnish an explanation of the understanding or intent with which certain acts [are] performed\"), cert. denied, 488 U.S. 821 (1988).\n\nPan Am insists that causation was not established and that therefore the objected to wilful misconduct evidence was speculative and unrelated as a cause of the crash. We think the question of whether it had a causative effect was, without objection or exception, properly submitted to the jury. In other areas of the law, causation may be established when an increasing number of defendant's faults creates an inference that the totality must have caused the harm. See In Re Marine Sulphur Queen, 460 F.2d 89, 99-100 (2d Cir.), cert. denied, 409 U.S. 982, 34 L. Ed. 2d 246, 93 S. Ct. 318, 93 S. Ct. 326 (1972); see also Cappellini v. McCabe Powers Body Co., 713 F.2d 1, 5 (2d Cir. 1983) (\"decisive consideration in assessing the sufficiency of . . . evidence of causation is the 'relative probability' of 'possible explanations' for the accident, and the 'legal inferences that can most reasonably be drawn from the most probable ones'\"). In libel cases, for example, recklessness causing harm may be demonstrated by cumulative inferences. See Goldwater v. Ginzburg, 414 F.2d 324, 342 (2d Cir. 1969), cert. denied, 396 U.S. 1049, 24 L. Ed. 2d 695, 90 S. Ct. 701 (1970).\n\nWe do not hold that as a matter of law the evidence in this case required the jury to agree with the plausibility of a theory that Pan Am and Alert's misconduct was so reckless it must have caused the bomb to go undetected. We say only that under the Warsaw Convention wilful misconduct causing an accident may be established by inference from the totality of the circumstances. Accord In re Korean Air Lines Disaster of September 1, 1983, 932 F.2d 1475, 1481 (D.C. Cir.) (sufficient evidence existed \"from which to decipher a pattern of conduct giving rise to liability\"), cert. denied, 112 S. Ct. 616 (1991).\n\nThis Conclusion does not mean that any of the burden of proving causation was lifted from plaintiffs. It remained plaintiffs' duty to prove causation under whatever theory they pursued. In this connection, the district court carefully and in an extensive and well balanced charge instructed the jury that it must find not only wilful misconduct, but also a causal connection between that misconduct and the passengers' deaths. Chief Judge Platt added that defendants' conduct would not be proximate cause of the accident if the accident would have occurred anyway, absent defendants' acts or omissions. Since the evidence introduced by the plaintiffs related to such a showing of causation, there was no error in its receipt.\n\nB. Evidence Challenging Plaintiffs' Causation Theory\n\nVarious attempts by appellants to suggest other specific causation theories were then rebuffed by the trial court. Pan Am and Alert challenge the exclusion of the testimony of four defense witnesses: two offered as experts on terrorism, Noel Koch and Dr. Ariel Merari, and two offered as experts on terrorist bombings, Peter Gurney and John Horne of Scotland Yard. Pan Am also contends it was error to restrict its cross-examination of plaintiffs' experts, Billie Vincent and Rodney Wallis (the former Director of Security for the International Air Transport Association), with respect to other methods of bombing. The trial Judge based his rulings largely on the fact that he found appellants had offered nothing to show there was any other specific bombing theory.\n\nThe admission or exclusion of expert testimony rests soundly in the broad discretion of the trial court. Fed. R. Evid. 702; Hamling v. United States, 418 U.S. 87, 108, 41 L. Ed. 2d 590, 94 S. Ct. 2887 (1974); United States v. Gigante, 729 F.2d 78, 83 n.2 (2d Cir.), cert. denied, 467 U.S. 1206, 81 L. Ed. 2d 348, 104 S. Ct. 2390 (1984). That court may, in its discretion, refuse to entertain expert testimony it thinks unhelpful, cumulative, confusing to the jury, or more prejudicial than probative. See 3 Jack B. Weinstein \u0026 Margaret A. Berger, Weinstein's Evidence P 702[02], at 702-18 to -20 (1993). Expert testimony as to causation may be excluded, particularly where it is speculative and conjectural. See Washington v. Armstrong World Indus., Inc., 839 F.2d 1121, 1123-24 (5th Cir. 1988) (court within discretion excluding expert's testimony where expert never examined plaintiff but relied on other expert's examinations and such testimony as to cause of death was \"pure speculation\"); Hull v. Merck \u0026 Co., Inc., 758 F.2d 1474, 1477-78 (11th Cir. 1985) (trial court did not abuse discretion in excluding medical expert's deposition as to cause of plaintiff's disease because assumptions made seemingly firm opinion speculative and irrelevant); Atlantic Mut. Ins. Co. v. Lavino Shipping Co., 441 F.2d 473, 475 (3d Cir. 1971); cf. Novak v. United States, 865 F.2d 718, 722 (6th Cir. 1989) (error to rely on expert's speculation to find causation); Jones v. Goodlove, 334 F.2d 90, 94 (8th Cir. 1964) (\"[A] trial court may abuse its discretion by allowing a seemingly qualified expert to exceed the permissible bounds of opinion testimony and enter into the realm of utter speculation and conjecture.\").\n\nThe trial court did not abuse its discretion in excluding the testimony of defense experts Koch and Merari because their Conclusions as to more likely explanations for the bombing were speculative. Any testimony as to some other particular method of bombing -- without any foundation that such method might explain the Flight 103 bombing -- was clearly conjectural.\n\nFurther, appellants admit in their brief that they \"did not undertake to prove what method the terrorists used to bomb the aircraft . . . [but] contended that the method of bombing has not yet been established.\" Because there was no evidence presented with respect to other possible methods of causation that might explain how this tragic event occurred, and because appellants never sought to show that any other specific method of bombing could have caused it, any testimony relating to such other causes would necessarily be speculative. Although Dr. Merari and Noel Koch would also have provided general background information on terrorism, the determination whether or not this testimony would have been helpful to the jury rested squarely within the trial court's discretion. See Fed. R. Evid. 702.\n\nDiscretion was also properly exercised in limiting appellants' cross-examination of plaintiffs' experts to scenarios that had evidentiary support in the record. Cross-examination of plaintiffs' experts as to other causation theories -- absent a good-faith basis to believe those theories had evidentiary support -- was properly excluded. Trial courts possess wide discretion in limiting cross-examination, see N.V. Maatschappij Voor Industriele Waarden v. A.O. Smith Corp., 590 F.2d 415, 421 (2d Cir. 1978), and here the precluded questions could have drawn the jury into misleading conjecture. Pan Am and Alert were permitted lengthy cross-examination of plaintiffs' experts, and were only barred from suggesting, without basis, that other scenarios caused the bombing.\n\nIt was also not error to decline to receive the testimony of terrorist bombings experts Peter Gurney and John Horne. Their testimony as to the importance of x-rays would have been cumulative since similar testimony was adduced from other witnesses. Additionally, these witnesses' expertise as to x-rays was questionable. Both witnesses were explosives officers with Scotland Yard who specialized in street bombings. Neither had experience in aviation bombings or security. Moreover, neither had any background or knowledge concerning the Flight 103 bombing itself; the trial court found this rendered their proposed testimony unhelpful and largely irrelevant. This ruling was well within the trial court's Fed. R. Evid. 702 discretion.\n\nContrary to appellants' suggestions throughout their briefs, Pan Am and Alert were not thereby prevented from presenting a defense on causation. Pan Am and Alert's summation focused at length and in detail on criticizing plaintiffs' causation theory; this remained Pan Am and Alert's main theme throughout cross-examination and their defense case as well. They vigorously attacked major and minor pieces of evidence alike. They were permitted to argue the possibility that a \"rush-tag\" bag, one by definition sent by the airline apart from its owner, was the unexplained, unaccompanied 13th interline bag x-rayed by operator Kurt Maier in Frankfurt. Importantly, appellants did not offer any fact witness to testify as to another method of bombing that might have caused Flight 103's crash.\n\nAppellants admit that at trial they sought to argue that the method of bombing was not established and concede they were unable to suggest a specific alternate theory. They vigorously argued that the method of bombing was unclear, and accomplished this through extensive cross-examination of plaintiffs' experts. Pan Am and Alert also were not deterred from attacking plaintiffs' weaker theory that widespread misconduct on defendants part more likely than not caused the bomb to be loaded on Flight 103. In sum, Pan Am and Alert exercised the ample opportunities given them to undermine plaintiffs' causation theory. Thus, the rulings limiting cross-examination and expert testimony were unremarkable and without error.\n\nIII OTHER EVIDENTIARY RULINGS\n\nWhile appellants raise an array of objections to other evidentiary rulings -- some of which patently involved judgment calls by the trial Judge -- none of them amount to reversible error.\n\nA. Plaintiffs' Experts' Testimony\n\nAppellants' first objection is to the testimony of plaintiffs' expert witnesses, Rodney Wallis and Billie Vincent. Wallis and Vincent gave their opinions relying on evidence adduced at trial, at times displaying for purposes of reference trial transcripts on a projection screen. Based on this testimony, for example, Wallis opined that Pan Am was operating under a commercial rather than security priority and that training requirements had been violated. Vincent stated -- again based on other record testimony -- that Pan Am had committed acts that violated ACSSP XV C.1.(a).\n\nPan Am insists the Wallis and Vincent testimony involved improper summaries of evidence. But the cases relied on for support are inapposite because they do not address experts' summarizing record evidence, but rather they address summaries of evidence of the sort covered under Fed. R. Evid. 1006. See, e.g., Fagiola v. National Gypsum Co. AC \u0026 S., Inc., 906 F.2d 53, 56-57 (2d Cir. 1990); United States v. Conlin, 551 F.2d 534, 538-39 (2d Cir.), cert. denied, 434 U.S. 831, 54 L. Ed. 2d 91, 98 S. Ct. 114 (1977). Rule 1006 provides in part, \"The contents of voluminous writings, recordings, or photographs which cannot conveniently be examined in court may be presented in the form of a chart, summary, or calculation.\" It is of some significance that neither Wallis nor Vincent was giving the type of summary testimony that appears on a chart or graph.\n\nThe trial Judge, therefore, properly ruled on the summary testimony under the federal rules governing expert testimony rather than under Rule 1006. Under those rules, expert testimony may be based on other testimony or evidence obtained at trial. See Fed. R. Evid. 703 (\"The facts or data in the particular case upon which an expert bases an opinion or inference may be those perceived by or made known to the expert at or before the hearing.\"). No error occurred from the format of testimony summarizing the trial record or from the use of transparencies to highlight portions of the trial transcripts to which the witnesses referred when they were on the witness stand.\n\nWallis' and Vincent's summaries of testimony in the record did not, as appellants assert, improperly impinge on the jury's functions. Pan Am avers that in assessing other witnesses' testimony, Wallis and Vincent made credibility judgments that are properly reserved to the jury. They rely for this contention on United States v. Scop, 846 F.2d 135, 142, modified, 856 F.2d 5 (2d Cir. 1988). There, it was said in dicta that one witness may not offer an opinion based on his or her assessment of the accuracy of another witness, where that other witness' credibility is to be determined by the trier of fact. Id. Even were Scop 's Discussion of this point binding on us -- and it is not -- Scop does not in any event, control the outcome of the present case.\n\nWallis' and Vincent's testimonies were not improper simply because they were based on the testimony of others. Precedent has long acknowledged the acceptability of expert testimony based on the trial record. See, e.g., United States v. Johnson, 319 U.S. 503, 519-20, 87 L. Ed. 1546, 63 S. Ct. 1233 (1943). No doubt remains under the federal rules that an expert may testify based on facts elicited at trial. See Fed. R. Evid. 703. The rules also provide, \"testimony in the form of an opinion or inference otherwise admissible is not objectionable because it embraces an ultimate issue to be decided by the trier of fact.\" Fed. R. Evid. 704(a). The credibility of a witness represents just such an ultimate issue normally decided by the jury.\n\nNor are we troubled by Vincent's testimony that he thought appellants engaged in \"fraud\" and \"deceit,\" because it was clear from the content of his direct and cross-examination that he used those terms in a non-legal sense. Neither do questions arise as to the propriety of testimony given by Wallis, because appellants highlight no specific statement by him containing a legal Conclusion as to a specific ACSSP violation. Additionally, because Wallis had an extensive background in aviation security it was not an abuse of the trial court's discretion to permit him to testify regarding causation.\n\nPan Am's next contention has greater merit. It declares that plaintiffs' witnesses improperly offered legal opinions as to ACSSP violations. We agree that Vincent's statement as to his belief that Pan Am violated the ACSSP is dubious. While an expert witness may testify as to an ultimate fact issue the jury will decide, see Fed. R. Evid. 704, the general rule is that an expert may not testify as to what the law is, because such testimony would impinge on the trial court's function. See FAA v. Landy, 705 F.2d 624, 632 (2d Cir.), cert. denied, 464 U.S. 895 (1983). Permitting an expert to give a legal Conclusion may implicitly provide a legal standard to the jury. See generally Hygh v. Jacobs, 961 F.2d 359, 363-64 (2d Cir. 1992); 3 Jack B. Weinstein \u0026 Margaret A. Berger, Weinstein's Evidence P 704[02], at 704-11 to 13 (1993). Thus, expert testimony expressing a legal Conclusion should ordinarily be excluded because such testimony is not the way in which a legal standard should be communicated to the jury. Vincent's testimony that he had been lead to the Conclusion \"that Pan Am did indeed violate the ACSSP\" embodied a legal Conclusion that crossed the fine line between a permissible Conclusion as to an ultimate issue of fact and an impermissible legal Conclusion.\n\nHaving said this much, we hasten to add that the introduction of Vincent's statement was not in our view a reversible error. First, defendants took no specific objection to this statement. By failing to object when the statement was made, the objection was waived. See Fed. R. Evid. 103(a)(1). Second, even had an objection been timely made, the error was harmless. Cf. Hygh, 961 F.2d at 364 (testimony on ultimate legal Conclusion found harmless). Vincent's testimony directly conveyed to the jury that he was stating his own Conclusion, it represented but a small portion of extensive testimony providing the basis for his opinion, and the trial Judge instructed the jury that it was the ultimate Judge of credibility and liability. Under the circumstances, this error -- even had there been a proper objection raised -- was harmless.\n\nB. Detective Constable Henderson's Testimony\n\nScottish Detective Constable Derek Henderson provided deposition testimony as to his work in the Flight 103 investigation. He was assigned responsibility for matching certain bags -- the ones that might have been placed in the flight container that was determined to have held the bag with the bomb -- with passengers on the aircraft. Henderson prepared his report largely through compiling computerized records of bags. These computerized records had been set up to amass reports from passengers' and crew members' friends and relatives, and from evidence obtained at the scene of the crash.\n\nAppellants object to the admission of the detective's testimony and his report. Based on his analysis of passenger records and information obtained from passengers' and crew members' friends and relatives, Henderson determined that the Samsonite bag containing the bomb was an unaccompanied bag from the Frankfurt flight. Defendants moved to exclude his reports as based on multiple layers of hearsay; Henderson had compiled his reports based upon other officers' reports of interviews they had conducted in this necessarily lengthy and involved investigation.\n\nWe believe the evidence was properly received under Fed. R. Evid. 803(8)(C), which provides an exception to the hearsay rule for reports of public agencies containing \"factual findings resulting from an investigation made pursuant to authority granted by law, unless the sources of information or other circumstances indicate lack of trustworthiness.\" See also Beech Aircraft Corp. v. Rainey, 488 U.S. 153, 167, 102 L. Ed. 2d 445, 109 S. Ct. 439 (1988) (upholding broad admissibility of facts in government reports, unless circumstances demonstrate lack of trustworthiness). The determination as to any lack of trustworthiness remains one properly left to the district court, id., and its decision to admit a report under Fed. R. Evid. 803(8)(C) is one that we will uphold absent a manifest error. See Gentile v. County of Suffolk, 926 F.2d 142, 151 (2d Cir. 1991).\n\nHere there was no explicit finding of trustworthiness, but no such finding is required before an official report under Rule 803(8)(C) may be received. The plain language of the rule establishes general admissibility, unless a report is deemed to be untrustworthy. See Fed. R. Evid. 803(8) advisory committee's note; Kehm v. Procter \u0026 Gamble Mfg. Co., 724 F.2d 613, 618 (8th Cir. 1983). The district court carefully examined the report and did not make a finding of a lack of trustworthiness. Although the trial court did provide a detailed consideration of reliability concerns, it had no duty to state it found the report trustworthy.\n\nIn any event, adequate evidence demonstrates trustworthiness in the case at hand. The Advisory Committee's Note on Rule 803(8) suggests several factors to consider in determining trustworthiness: 1) timeliness of the investigation, 2) the investigator's skill or experience, 3) whether a hearing was held, and 4) possible bias or motivation problems in the report. See Fed. R. Evid. 803(8) advisory committee's note. The investigation was timely, Henderson was an experienced and skilled investigator, and no bias may be presumed in the Scottish investigation. We cannot say the trial court abused its discretion in entertaining the report, particularly given its cautionary instructions to the jury concerning the report.\n\nC. X-Ray Demonstration of Radio-Cassette Player\n\nPan Am and Alert also sought to include an x-ray demonstration as part of their defense to show how clearly a radio-cassette player would appear on the screen. Such a demonstration was ultimately ruled irrelevant, given plaintiffs' offer to stipulate that a radio-cassette player would be visible on an x-ray screen. Pan Am and Alert nevertheless declare the demonstration would have generally supported Pan Am x-ray operator Kurt Maier's testimony that he x-rayed all the interline bags transferred to Flight 103 in Frankfurt.\n\nThe x-ray demonstration would not have either shaken or bolstered Maier's testimony since he said he could not remember whether any radios or cassette players appeared in any of the bags on Flight 103. More important, because plaintiffs stipulated that a radio cassette player would be clearly recognizable in an x-ray image the proffered demonstration would have been cumulative, and therefore inadmissible in the district court's discretion under Fed. R. Evid. 403. When a fact is undisputed and conceded, evidence attempted to be introduced to prove such fact may be excluded. See United States v. Edwards, 631 F.2d 1049, 1051, aff'd, 633 F.2d 207 (2d Cir. 1980). Although some cases have upheld the admission of proof respecting a conceded fact, the decision whether or not to do so is a matter that rests within the discretion of the trial court. See, e.g., United States v. Gantzer, 810 F.2d 349, 351 (2d Cir. 1987).\n\nIV DAMAGES FOR LOSS OF SOCIETY AND COMPANIONSHIP\n\nPan Am and Alert's last claims of error concern the damage awards. In each of the three cases whose damages phases were tried the jury was permitted to award compensatory damages to the decedent's spouse and children based on the loss of financial contributions, loss of services, loss of society and companionship, and loss of parental care. Appellants do not dispute the awards for the first two elements. But they contend that loss of society and companionship damages are not available under the Warsaw Convention, and that damages for the loss of parental care should not be available to adult children of crash victims.\n\nAs we noted in Lockerbie I, damages in a Warsaw Convention case are governed by federal common law principles consistent with the Convention's terms. Lockerbie I, 928 F.2d at 1278-79; see also Harris v. Polskie Linie Lotnicze, 820 F.2d 1000, 1002 (9th Cir. 1989) (\"damages are to be measured according to the internal law of a party to the [Warsaw] Convention\"). Article 17 of the convention provides for recovery of compensatory damages. See Warsaw Convention, art. 17; Lockerbie I, 928 F.2d at 1280-81. The first damages question to be analyzed is whether compensatory damages under the Convention include damages for loss of society and companionship. This question is answered by an examination of maritime law, which is probably the oldest body of federal common law. See In re Mexico City Aircrash, 708 F.2d 400, 414-15 (9th Cir. 1983) (looking to general federal maritime law in holding that the Warsaw Convention creates a cause of action for wrongful death).\n\nAppellants agree that maritime law is an appropriate source of law for resolving this issue. But they would have us look only to maritime cases brought under the Death on the High Seas Act, 46 U.S.C. §§ 761-68 (DOHSA), and the Jones Act, 46 U.S.C. App. § 688, which preclude recovery for loss of society damages. See, e.g., Miles v. Apex Marine Corp., 498 U.S. 19, 31-33, 112 L. Ed. 2d 275, 111 S. Ct. 317 (1990). General maritime law cases that are not bound by a statutory restriction, in contrast, allow recovery for loss of society. See, e.g., American Export Lines, Inc. v. Alvez, 446 U.S. 274, 280-83, 64 L. Ed. 2d 284, 100 S. Ct. 1673 (1980); Sea-Land Servs., Inc. v. Gaudet, 414 U.S. 573, 585-88, 39 L. Ed. 2d 9, 94 S. Ct. 806 (1974).\n\nThe distinguishing feature in these cases is that the statutes, under which cases precluding loss of society damages have been brought, either expressly limit (DOHSA) or have been interpreted to limit (Jones Act) damages to pecuniary loss. See Mobil Oil Corp. v. Higginbotham, 436 U.S. 618, 620-25, 56 L. Ed. 2d 581, 98 S. Ct. 2010 (1978) (loss of society damages are not recoverable under DOHSA because Congress explicitly limited survivors' recovery to their \"pecuniary losses\"); Miles, 498 U.S. at 31-32 (loss of society damages are not recoverable under Jones Act because in incorporating the Federal Employer's Liability Act \"Congress must have intended to incorporate the pecuniary limitation on damages as well\").\n\nBecause we cannot resolve this issue by reference to the common law alone, in light of the conflict between the statutory cases that deny loss of society and the general maritime cases that, along with the majority of states, permit recovery of damages for loss of society, we must look to the Convention itself to determine which of the maritime rules -- statutory or general -- is most consistent with the language used and the intent of the parties to the treaty. Analyzing Article 17 of the Convention, we look first to its text. The Warsaw Convention has to be evaluated by examining the governing text as drafted in French. See Eastern Airlines, Inc. v. Floyd, 499 U.S. 530, 111 S. Ct. 1489, 1493, 113 L. Ed. 2d 569 (1991); Air France v. Saks, 470 U.S. 392, 399, 84 L. Ed. 2d 289, 105 S. Ct. 1338 (1985). The English language translation of Article 17 simply provides, in relevant part, \"The carrier shall be liable for damage sustained in the event of the death or wounding of a passenger . . . .\" The original text of Article 17 provides for compensation for \"dommage survenu;\" the accepted English language translation of this phrase is \"damage sustained.\" See Warsaw Convention, art. 17; 49 U.S.C. § 1502 app. note (1988). No limit to pecuniary loss appears in the text. The aim of the Convention's drafters and signatories appears from the simple language of the text to provide full compensatory damages for any injuries or death covered by the Convention. See In Re Korean Air Lines Disaster, 932 F.2d at 1486-7; Lockerbie I, 928 F.2d at 1281.\n\nWhile our sources from which to determine the signatories' intent is limited, scholarly treatises on the subject agree that the French civil law recognized all sorts of damages, pecuniary and nonpecuniary. See In re Korean Air Lines Disaster, 932 F.2d at 1487 (citing G. Miller, Liability in International Air Transport 112 (1977) and R. Mankiewicz, The Liability Regime of the International Air Carrier 157 (1981)). We encountered no understanding in French law that might support limiting \"dommage survenu\" to exclude loss of society awards.\n\nIn light of the broad language in the Warsaw Convention covering \"damage sustained\" and the lack of authority suggesting that the drafters wanted to limit compensatory damages to pecuniary loss, we are informed by general maritime law principles set forth in Gaudet and its progeny and hold the Warsaw Convention permits damage awards for loss of society and companionship. Accord In re Korean Air Lines Disaster, 814 F. Supp. 592, 597-98 (E.D. Mich. 1993); In re Korean Air Lines Disaster, 807 F. Supp. 1073, 1086-88 (S.D.N.Y. 1992). Such holding does not completely dispose of the loss of society damages issue, because the district court did not in any way limit who was entitled to loss of society damages.\n\nGaudet and Alvez allowed spouses to recover for loss of society. See 414 U.S. at 574, 587-88; 446 U.S. at 276. In doing so, the Alvez court noted that this was consistent with the majority of states' permitting recovery to a wife for loss of consortium, which incorporates loss of society, from personal injury to her husband. See 446 U.S. at 284 \u0026 n.11. Lower federal courts have read these cases to permit dependents to recover as well as spouses for loss of society damages. See Miles v. Melrose, 882 F.2d 976, 989 (5th Cir. 1989), aff'd 498 U.S. 19 (1990); Sistrunk v. Circle Bar Drilling Co., 770 F.2d 455, 458-59 (5th Cir. 1985), cert. denied, 475 U.S. 1019, 89 L. Ed. 2d 318, 106 S. Ct. 1205 (1986); Anderson v. Whittaker Corp., 692 F. Supp. 734, 770-71 (W.D. Mich. 1987), aff'd in part, rev'd in part, 894 F.2d 804 (6th Cir. 1990); Truehart v. Blandon, 672 F. Supp. 929, 932-33 (E.D. La. 1987), rev'd on other grounds, 884 F.2d 223 (5th Cir. 1989). But see De Loach v. Companhia De Navegacao Lloyd Brasileiro, 782 F.2d 438, 441-43 (3d Cir. 1986) (declining to permit dependent child to recover loss of society damages).\n\nWe find no maritime case extending loss of society damages to plaintiffs other than spouses and dependents. We therefore affirm the loss of society awards to the Bainbridge and Porter families, since these families consisted of only spouses and dependant children. But the loss of society award to the Pagnucco family must be vacated since some of the family members were adult children and may or may not have been dependents. We remand this limited issue as it applies to the Pagnuccos to the district court for further proceedings consistent with this opinion.\n\nOn the issue of damages for lost parental care, we also must vacate and remand all three plaintiffs' cases to the district court because the district court erroneously instructed the jury on this issue. Damages for lost parental care are considered a pecuniary loss and are therefore recoverable. See Gaudet, 414 U.S. at 585. Appellants correctly contend the district court erred in declining to instruct the jury that damages for loss of fatherly care and guidance must be limited to the period of a child's minority, absent a showing of specific circumstances that the father's \"guidance had a pecuniary value beyond the irreplaceable values of companionship and affection.\" First Nat'l Bank in Greenwich v. National Airlines, Inc., 288 F.2d 621, 624 (2d Cir. 1961). Since no such limitation was charged to the jury on this damages issue, the jury awards for loss of parental care may not stand.\n\nOn remand, the district court should instruct the jury that it may take into consideration the care, attention, instruction, training, advice, and guidance the evidence shows the father might reasonably have been expected to give his children and to include the pecuniary value thereof in the damages it assesses. The damages for such loss must be limited to the period of a child's minority, absent a showing of specific circumstances that the father's guidance had a pecuniary value beyond that period.\n\nConclusion\n\nThe record of this trial is not a paradigm of a perfect trial. The critical question though is whether the trial was fair. Here we are satisfied upon an examination of the entire record that defendants received a fair trial. Accordingly, the jury verdicts as to liability are affirmed. However, the award for loss of society damages to the Pagnucco family is vacated as are the awards for loss of parental care in all three plaintiffs' cases. These cases are remanded to the district court for further proceedings on the outlined damage issues consistent with this opinion.\n\nDisposition\n\nAffirmed, except as to a portion of the damage awards, which are vacated, in part, and remanded.\n\nVAN GRAAFEILAND, Circuit Judge, Dissenting:\n\nAs I said when writing my Dissent to the original majority opinion, writing a Dissenting opinion in the instant case is not a pleasant task. My name will be anathema to the hundreds of people who are seeking recoveries probably in excess of $1 billion, and my long-time friendship with Judge Platt may suffer some stress. However, because I am convinced that Pan Am\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e did not receive a fair trial, I would be shirking my duties as a Judge if I did not say so. Before undertaking the unpleasant task of discussing where I believe the district court erred, I find it necessary to undertake the even more unpleasant task of commenting briefly upon my colleagues' amended opinion, a substantial portion of which is devoted to a rebuttal of arguments that Pan Am never made.\n\nUnder the heading \"The Alleged Oral Waiver\" my colleagues state:\n\nDefendants maintain that an FAA official granted them an oral waiver excusing strict compliance with certain FAA regulations, and that Chief Judge Platt abused his discretion when he disallowed their evidence purporting to demonstrate their belief in this waiver.\n\nThe fact of the matter is that Pan Am made absolutely no claim of waiver. It argued, and offered testimony to prove, that what it sought and obtained from FAA officials was not a waiver, but an \"interpretation\" of what it deemed an ambiguous regulation. One of the tasks of Raymond Salazar, Director of Civil Aviation Security, and his staff was to promulgate regulations and thereafter to interpret them:\n\nIn that capacity we would -- we, me, my staff would promulgate regulations, would provide interpretations, . . .\n\nTr. 1254 (Salazar testimony). Interpretations of regulations were not required to be in writing. See United States v. Eastern Air Lines, Inc., 792 F.2d 1560, 1564 (11th Cir. 1986). Richard Cozzi, Pan Am's Director of Airport Security, described the practice as follows:\n\nQ Is it your understanding, sir, that before a change can be made to the ACSSP there has to be an application in writing to the FAA?\n\nA Yes.\n\nQ And that only when there is a written process of an application and an approval by the FAA, that the terms of the ACSSP can be changed?\n\nA That's true if an airline is requesting a waiver or something of that nature, yes. Not for an interpretation.\n\nTr. 5624-25.\n\nAs will be discussed below, the district court clearly erred in rejecting all evidence offered by Pan Am in support of its contention that it received and relied upon an oral interpretation from Salazar. Although my colleagues devote seventeen pages of their amended opinion to a Discussion of the \"oral waiver,\" \"government authorization,\" and \"mistake of law\" defenses, none of these defenses was asserted by Pan Am or is relevant to the pertinent issue herein.\n\nThe following excerpt from the index of Pan Am's brief is an accurate statement of the contentions that Pan Am actually made:\n\nIntroduction and Summary\n\nI. THE DISTRICT COURT ERRONEOUSLY EXCLUDED EVIDENCE\n\nSHOWING THAT PAN AM LACKED THE STATE OF MIND\n\nNECESSARY FOR A FINDING OF WILFUL MISCONDUCT\n\nA. The Court Erroneously Excluded Evidence That Pan Am Believed That It Had Obtained An FAA Interpretation That X-Ray Inspection Complied With The ACSSP\n\n1. The Evidence of the Oral Interpretations Was Admissible to Show that Pan Am Did Not Have the State of Mind Necessary for a Finding of Wilful Misconduct\n\n2. The Evidence of Oral Interpretations Was Admissible to Show Pan Am's Compliance with the ACSSP\n\na. The District Court Relied on Inapposite Decisions\n\nb. No Written Application Was Required to Obtain an FAA Interpretation\n\nFinally, on page 25 of their amended opinion, my colleagues come to the question of the defendant's \"State of Mind,\" which they acknowledge to be \"the ultimate issue in this Warsaw Convention case.\" The following excerpt from Mr. Cozzi's excluded testimony will demonstrate exactly how the \"ultimate issue\" was reached and resolved and why the district court erred in not permitting the jury to hear the testimony:\n\nQ When did the Discussions of the Security Task Force take place?\n\nA Discussions concerning the possibility of using x-ray to satisfy the ACSSP on interline baggage took place at the very first or at least second Security Task Force meeting.\n\nThe Security Task Force team was charged with writing sealed procedures, our developing manuals, and one of the very first things that Security Task Force needed to know is that did x-ray of interline baggage satisfy the ACSSP.\n\nQ And what was done in that respect?\n\nA That question was presented to Mr. Dan Sonesen, and I must say that his first reaction was doubtful.\n\nHowever, we requested that he contact our PSI [FAA Principal Security Inspector] or whatever level was required within the FAA, and to report back to the task force as to whether x-ray met that intent.\n\nAt a subsequent meeting, Mr. Sonesen --\n\nMR. POUNIAN: Your Honor, I just want to note our objection on the record for hearsay from Mr. Sonesen.\n\nTHE COURT: Yes. It's not admissible.\n\nMR. SHAUGHNESSY: May I continue?\n\nTHE COURT: Yes.\n\nQ Go ahead.\n\nA Mr. Sonesen reported back at the subsequent task force meeting that he had had conversation with the FAA and requested interpretation of intent and he came back and told us that, yes, x-ray did in fact satisfy that section of the ACSSP.\n\nQ Why did the task force seek this clarification?\n\nMR. POUNIAN: Objection to the question, as clarification, your Honor. I think that it's improper.\n\nTHE COURT: That's the way they regard it, as a clarification of a statement that positive matching was required. That's their interpretation.\n\nMR. POUNIAN: I just think that it's leading, your Honor, in the context.\n\nTHE COURT: Sure, it is.\n\nQ Why did you seek this clarification, Mr. Cozzi?\n\nA We needed this clarification because the task force was charged with writing manuals and developing procedures, and we needed to know what direction those manuals and procedures were to take.\n\nQ And were you anxious to have x-ray approved under Section XV.C.1.A?\n\nA We were not anxious to have x-ray approved. We just needed to know what direction we were going in; if it had come back that it was not approved, then we would have developed procedures without utilizing x-ray.\n\nAs it turned out, we were told that it was approved, and we wrote the procedures accordingly.\n\nMR. POUNIAN: Your Honor, I'm going to have to move to strike that answer, based upon hearsay from Mr. Sonesen.\n\nTHE COURT: None of this is, in my opinion, admissible either for hearsay reasons or for reasons you've indicated.\n\nMR. POUNIAN: I'm just saying for the purpose of presenting a record --\n\nTHE COURT: That's his problem.\n\nMR. POUNIAN: I understand that, but I think Mr. Sonesen has to present the record, not Mr. Cozzi.\n\nTHE COURT: Even if they called Mr. Sonesen, it would still be hearsay.\n\nMR. SHAUGHNESSY: Your Honor, the state of mind is the issue here.\n\nTHE COURT: It would still be hearsay.\n\nMR. SHAUGHNESSY: Respectfully disagree, your Honor.\n\nTHE COURT: You can't develop a unilateral state of mind.\n\nMR. SHAUGHNESSY: It is not a unilateral state of mind. That's the point.\n\nTr. 5617-19. The district court's rulings on \"hearsay\" and \"unilateral state of mind\" will be commented upon below.\n\nBecause, as in my Dissent to the original majority opinion, I deem it necessary in the interest of uncontrovertible accuracy to quote at length from the record, I will not prolong this opinion by an extended counterstatement of the facts. Indeed, what is perhaps the most crucial fact has been established by stipulation:\n\n[Pan Am] insisted that a bomb contained in a suitcase would have been visible on x-ray. In fact, the parties stipulated to that fact.\n\nMajority opinion at 31.\n\nIt is worth noting, however, how this stipulation came into being. After Pan Am was satisfied that it could use x-ray examination of luggage, it purchased for the Frankfurt airport the most expensive up-to-date x-ray machine on the market, the Astrophysics Linescan X-ray Screening System.\n\nQ Does your company make a larger machine than this?\n\nA This is the largest machine we make.\n\nQ Does your company make a more expensive machine that this?\n\nA No, sir.\n\nQ At the time it was sold, was there a newer or more advanced state of the art machine than this?\n\nA No, sir.\n\nTr. 5689 (testimony of Derek Kemp, an Astrophysics Company official).\n\nPan Am wanted the jury to see the machine and how it operated, and for this purpose it had the machine transported to the courthouse. For obvious reasons, plaintiffs' counsel did not want the jury to have the benefit of this first-hand observation, and he stipulated what an examination of the machine would have shown. Although Pan Am should not have been required to accept this stipulation in lieu of actual observation, see United States v. Gantzer, 810 F.2d 349, 351 (2d Cir. 1987), the district court gave it no choice. At the district court's direction, the machine sat in the basement of the courthouse, alone and unobserved. The fact that plaintiffs' counsel objected to a jury inspection is evidence in and of itself that the district court erred in not permitting it.\n\nSolely to demonstrate the danger of unquestioned reliance upon my colleagues' often-pejorative statement of facts, I address two excerpts from the majority opinion. Starting on line 24 of page 27, my colleagues say:\n\nThe most wilful disregard of passenger safety, bordering on the outrageous, was in December 1988 when Pan Am received an FAA Security Bulletin advising that the United States Embassy in Helsinki had received a telephone warning that a Pan Am flight from Frankfurt to London and on to New York would be bombed. (Helsinki Warning).\n\nIn pertinent part, the Helsinki warning, with letters substituted for names, read as follows:\n\nOn December 5, 1988 an unidentified individual telephoned a U.S. diplomatic facility in Europe and stated that sometime within the next two weeks there would be a bombing attempt against a Pan American aircraft flying from Frankfurt,FRG to the U.S. An individual identified as \"X\", who allegedly is in Finland and a second individual identified only as \"Y\" and is in Frankfurt, are involved. According to the caller, \"Y\" will provide the device to \"X\" who will in turn provide it to an unidentified Finnish woman in Helsinki. The woman, would unwittingly take the device to Frankfurt and eventually onto the U.S. bound flight.\n\nPlaintiffs' Exhibit 33.\n\nMy colleagues' Discussion of the Helsinki warning is in the nature of a half-truth that calls for exposition. Pan Am's response to this warning, as described in the testimony of Wolfgang Schwab, a Pan Am supervisor at Frankfurt, was quite different than what my colleagues would have us believe:\n\nQUESTION: Prior to the Lockerbie disaster, had it been brought to your attention that there was a warning received by the United States Embassy in Helsinki to the effect that a Pan Am flight to the United States would be bombed?\n\nANSWER: Yes.\n\nQUESTION: Tell us, please, when and how that was brought to your attention?\n\nANSWER: I am not able to give you the exact point in time but it was certainly before Lockerbie, when we were told that a female Finnish passenger would try to smuggle a bomb aboard.\n\nQUESTION: Where were you when this came to your attention?\n\nANSWER: At the airport.\n\nQUESTION: Where in the airport?\n\nANSWER: On the job.\n\nQUESTION: Were you warned to pay particular attention to all female passengers or only Finnish female passengers?\n\nANSWER: Particularly to a female Finnish passenger.\n\nQUESTION: Did you ever issue any instructions to look out for Finnish women or to pay particular attention to Finnish women?\n\nANSWER: Yes, I did.\n\nQUESTION: When was that?\n\nANSWER: Before Lockerbie.\n\nQUESTION: What instructions or suggestions did you issue?\n\nANSWER: Now, I told the screeners and the staff that they were to pay particular attention to female Finnish passengers or woman coming from that region up there and I told them that one person would try to smuggle a bomb aboard a plane.\n\nQUESTION: Do you remember if you did it personally or if you asked someone else to do it?\n\nANSWER: I did it personally.\n\nTr. 1525-27.\n\nPerhaps even more troubling to me is my colleagues' statement at page 28, line 17 of their opinion that the Helsinki warning was \"deliberately\" placed under a pile of papers on the desk of a Pan Am security officer. Needless to say, no page citation to the record accompanied the word \"deliberately.\"\n\nBecause no changes made in a majority opinion can alter the immutable record of the trial court, I now direct my attention once again to what occurred below.\n\nAt one point near the end of the trial, Pan Am's counsel said to the court:\n\nNow, Judge, I would tell you, on a scale of 1 to 10, doing what I want in this courtroom, I have been about a minus 2, or maybe imaginary numbers would be a better way to describe as the level to which I have gone.\n\nTr. 5104.\n\nI have read the record dispassionately, and I completely agree with this observation. Plaintiffs' attorneys were permitted to range far and wide with prejudicial, irrelevant testimony, while Pan Am's counsel was precluded time and again from presenting relative and probative proof. Because I recognize that evidentiary rulings are largely discretionary, I will limit my Discussion to what I deem the major reversible errors.\n\nCONFLICT OF OPINION\n\nAt the outset, I want to state one clear and uncontrovertible fact: NO ONE KNOWS WHEN, WHERE OR HOW THE BOMB GOT ON THE PAN AM PLANE EXCEPT THE PERSON WHO PUT IT THERE.\n\nThe jury had to content itself with the expounding by plaintiffs' \"experts\" of what my colleagues correctly term \"Plaintiffs' Causation Theory\" (Majority opinion at 38). The accuracy of the supposition that a suitcase carrying the bomb was sent unaccompanied from Malta to Frankfurt, was transferred there to a Pan Am plane in which it was flown to London, where it was transferred to the plane in which it subsequently exploded, was a crucial issue in the case, because \"Plaintiffs' Causation Theory\" was based upon Pan Am's allegedly deficient baggage checks during the two transfers. If there were no transfers, there could not have been any wilfully deficient screenings. The district court permitted plaintiffs' experts to testify in support of the supposition but precluded any testimony by defendant's experts in opposition thereto. Having reviewed this proposed testimony of Pan Am's experts that the district court kept from the jury, I am convinced that had the jury been permitted to hear this evidence, there is a strong likelihood it would have rejected plaintiffs' contention that the bomb which exploded began its deadly journey in Malta.\n\nThe jurors who undoubtedly had suffered through the same experiences that many of us have, with missed planes and lost luggage during connecting airline flights, probably wondered how presumably clever and experienced terrorists reasonably could have expected an unaccompanied bag containing a bomb to travel from Malta to Frankfurt to London, through at least two sets of baggage checks, to be smuggled finally aboard Pan Am Flight 103 and explode only after the plane had left London. The jurors' willingness to accept the plaintiffs' theory undoubtedly would have been influenced in large measure by what Pan Am's witnesses said.\n\nRefutation of plaintiffs' supposition was permitted from Wilfred Borg, the general manager of ground operations for Air Malta, one of the few witnesses produced by defendant whose testimony was admitted:\n\nQ Let me show you what we have marked as Exhibits HF-1 through HF-15 in evidence. (Handing.)\n\nA Thank you.\n\nQ Looking at those exhibits, Mr. Borg, have you ever seen them before?\n\nA Yes, I did.\n\nQ Would you tell the ladies and gentlemen what those documents are, the whole package?\n\nA That is the flight file or the ship's papers for Flight KM-180, destined to Frankfurt in Germany on the 21st of December 1988.\n\nQ When did you first see this particular flight file?\n\nA I saw this flight file, the first time, in February '89.\n\nQ What were the circumstances under which you saw the flight file at that time?\n\nA Our office in Germany had received a request from the German police requesting us whether we had any passengers or baggage connecting to Pan American flights out of Frankfurt.\n\nThey said they were investigating this, they wanted this information in view of the Lockerbie incident in December, '88.\n\nQ And what did you do with respect to their request?\n\nA The request was passed along to me by our office in Germany.\n\nI requested the manager responsible to keep these records, to give me this relevant flight file. I went through it and gave the relevant replies to the German police.\n\nQ What were those replies?\n\nA We had no passengers connecting on the flights out of Frankfurt.\n\nWe had no baggage destined to go in flights out of Frankfurt.\n\nAnd, we had no unaccompanied luggage on that flight.\n\nTr. 5991-92.\n\nQ. Now, sir, based upon everything that you've read and all the investigation that you did, are you able to tell this jury whether or not there was an unaccompanied bag on Flight 180?\n\nA. No, there was no such bag.\n\nQ. Were there any bags destined for Pan Am, any Pan Am flights?\n\nA. No, there are no bags.\n\nQ. Any passengers destined for any Pan Am flights?\n\nMR. BAUMEISTER: Objection, leading.\n\nTHE COURT: Sustained. [???]\n\nTr. 6041.\n\nThe following testimony of Dr. Ariel Merari of Tel Aviv University, an expert on terrorism and bombing, also would have shed unfavorable light on the Malta-origin \"theory.\" However, this testimony was kept from the jury.\n\nQ. Do you think, sir, that it is conjectural how the bomb got on board?\n\nA. Could you please rephrase the question.\n\nQ. Do you know how the bomb got on board?\n\nA. No, I don't.\n\nQ. Do you think any, based upon the readings you have done in this record, a fair-minded, honest, so-called expert, with a reasonable degree of professional certainty, could opine how the bomb got on board?\n\nA. Well, of what I have read, including the trial transcripts, I cannot see how anybody can say with any degree of certainty how the bomb got on board.\n\nQ. Do you have any level of familiarity with what our government has been saying with respect to the indictments of two Libyans?\n\nA. Yes, I do.\n\nQ. And have you had, to the extent you can discuss this in this forum, a conversation with any representatives of security or secret services of any governments on that subject?\n\nA. Yes.\n\nQ. Has whatever knowledge that has come to you through those Discussions in any way changed your view that an honest and reasonable chap cannot say to a reasonable degree of professional certainty how this bomb got on board?\n\nA. No. I still feel that I don't know how the bomb got on board and I don't think that at this particular stage, before more intelligence information comes in, which may be a long time after the incident, in some cases, I still feel that I don't know how the bomb got on board and I don't think anybody knows for sure or even in any degree of reasonable certainty how the bomb got on board at this time, except for the terrorists, of course.\n\nTr. 6259-60.\n\nQ. Is it possible that a bomb was smuggled on board Pan Am 103 by an unwitting courier?\n\nA. I think it is.\n\nQ. Has that possibility been widely discussed secretly in the intelligence community?\n\nA. Yes, it has.\n\nTr. 6258.\n\nEven stronger refutation of the Malta theory was given by Peter Gurney, a Scotland Yard bomb expert, whose testimony also was kept from the jury:\n\nQ. Let me ask you this: Do you have an opinion based upon your review of the data made available to you of the existence of the fire system that existed in that Neus Toshiba bomb B 453 radio cassette?\n\nA. I do have an opinion.\n\nQ. What is it?\n\nA. I cannot see how such a device could have been used on a multi leg journey with one of the earlier legs being of longer duration than the flight on which the explosion took place.\n\nTr. 4582.\n\nQ. If you were a bomb designer wanting to blow up Pan Am 103 over the Atlantic Ocean on [sic] off the coast of the United Kingdom would you use the Air Malta routing suggested in this case?\n\nA. I'm not a bomb designer. We often have to think like terrorist [sic] in order to combat them. I would think that that was very unlikely because air travel -- there are many delays in air travel. Normally on the ground. So to work up the exact timing to get the thing to go off when you want it and not have it go off on the ground could be extremely difficult. This is used in a straightforward timer, sir.\n\nTr. 4588.\n\nFinally, the defense made an unsuccessful offer of proof of testimony by Noel Koch, a security consultant for the United States Department of Defense. If Koch had been permitted to testify on the subject, he would have said that the Air Malta theory is \"widely at variance with modus operandi of Middle Eastern Terrorist attacks and specifically attacks on U.S. airlines,\" and that the \"Air-Malta theory involves far too many variables to jibe with usual modus operandi.\" He also would have testified that the Pentagon relies on x-rays to scan baggage.\n\nAdmittedly, a district Judge has wide discretion in determining whether to admit evidence. However, this discretion \"may not be utilized to exclude the otherwise admissible opinion of a party's expert on a critical issue, while allowing the opinion of his adversary's expert on the same issue.\" United States v. Sellers, 566 F.2d 884, 886 (4th Cir. 1977). See also Breidor v. Sears, Roebuck \u0026 Co., 722 F.2d 1134, 1141 (3d Cir. 1983). \"Rule 403 requires even-handedness.\" Goldberg v. National Life Ins. Co., 774 F.2d 559, 565 (2d Cir. 1985) (citing Sellers and Breidor, supra); see also United States v. Onumonu, 967 F.2d 782, 788-89 (2d Cir. 1992). The district Judge's lack of even-handedness cannot be justified by his reliance on the indictment of two unapprehended, unquestioned and unapproachable Middle Eastern terrorists:\n\nTHE COURT: And I must view the evidence that we're talking about in that light, not in the light of a criminal case, because we're not in a criminal case.\n\nMR. CODDINGTON: Exactly. And my submission to you is that you may not give any evidentiary weight to the fact of that indictment.\n\nTHE COURT: No. But I may give evidentiary weight, probable cause weight to the fact that a grand jury has returned the indictment. Not in a criminal case, but in the civil case, for purposes of, I may not so instruct the jury, but as a qualifier from my standpoint, I may give it that weight. In fact I must.\n\nTr. 6187.\n\nNeither can the lack of even-handedness be justified by the district court's treatment as \"facts\" of evidence that my colleagues correctly characterize as theory and supposition.\n\nTHE COURT: The narrow question for this jury is given the facts in this case -- and we know it's a Toshiba radio and as to which there has been a specific warning and in which the bomb was, and there was a specific warning about the bomb being placed on a flight and so forth. Those specific warnings and not as to some other possible bomb, but as to that, how you handled it and how you handled it in Frankfurt and how you handled it in London Heathrow, the general lax procedures which they have described, if they find all of that to be wilful misconduct which was the proximate cause of the crash, that's the issue for them to determine.\n\nTr. 5297-98. Needless to say, the \"facts in this case\" were to be determined by the jury, not the Judge.\n\nBecause the house of cards to the effect that the bomb entered the stream of commerce in Malta was constructed entirely of opinion testimony introduced by plaintiffs, simple Justice required that defendant's experts be given an opportunity to demolish it. Obviously any testimony concerning how the bomb got on the plane had to be conjectural. However, the burden of proof on this issue was on the plaintiffs, not the defendant. Pan Am nevertheless offered expert testimony to challenge plaintiffs' contentions, which the district court refused to receive.\n\nThere can be no question but that conflicting expert testimony is admissible and that the jury, not the Judge, decides how much weight to accord each expert's testimony. United States v. Luschen, 614 F.2d 1164, 1170 (8th Cir.), cert. denied, 446 U.S. 939 (1980). As one court put it, \"court records are full of the conflicting opinions of doctors, engineers and accountants, to name just a few of the legions of expert witnesses.\" United States v. Stifel, 433 F.2d 431, 438 (6th Cir. 1970), cert. denied, 401 U.S. 994, 28 L. Ed. 2d 531, 91 S. Ct. 1232 (1971); see also In re \"Agent Orange\" Product Liability Litigation, 818 F.2d 145, 172 (2d Cir. 1987), cert. denied, 484 U.S. 1004 (1988). \"The mere fact that there may be conflicting testimony by experts is not a sufficient basis to exclude such evidence.\" United States v. McBride, 786 F.2d 45, 51 (2d Cir. 1986). Pan Am's proposed experts did not attack the credibility of plaintiffs' experts; they disagreed with the probative sufficiency of those experts' testimony. The weight to be accorded the testimony of each expert was a matter for the jury to decide. United States v. Vitale, 549 F.2d 71, 74 (8th Cir.), cert. denied, 431 U.S. 907, 52 L. Ed. 2d 393, 97 S. Ct. 1704 (1977).\n\nIf Pan Am's experts were correct in opining that no expert could testify with any degree of reasonable certainty how the bomb got on the plane, the district court's refusal to permit Pan Am's experts to so testify meant that the district court deprived Pan Am of all means of contesting the testimony of plaintiffs' experts on this important issue. The constitutional implications of such a result are obvious. \"The admission of a report containing 'Conclusions' is subject to the ultimate safeguard -- the opponent's right to present evidence tending to contradict or diminish the weight of those Conclusions.\" Beech Aircraft Corp. v. Rainey, 488 U.S. 153, 168, 102 L. Ed. 2d 445, 109 S. Ct. 439 (1988). Denial of this \"ultimate safeguard\" in the instant case was prejudicial reversible error.\n\nWILFUL MISCONDUCT\n\nA carrier covered by the Warsaw Convention cannot limit its liability to $75,000 if a plaintiff's damages were caused by the carrier's \"wilful misconduct.\" Wilfulness as thus used involves the issue of intent, not an intent to violate an FAA regulation, but the intent to perform an act with knowledge that it probably will result in injury and with disregard of that probable consequence. See Grey v. American Airlines, Inc., 227 F.2d 282, 285 (2d Cir. 1955), cert. denied, 350 U.S. 989, 100 L. Ed. 855, 76 S. Ct. 476 (1956); see also Ospina v. Trans World Airlines, Inc., 975 F.2d 35 (2d Cir. 1992), cert. denied, 123 L. Ed. 2d 650, 113 S. Ct. 1944 (1993). The violation vel non of an FAA regulation, even if intentional, is not determinative of the issue of wilful misconduct under the Convention. Berner v. British Commonwealth Pacific Airlines, Ltd., 346 F.2d 532, 537 (2d Cir. 1965), cert. denied, 382 U.S. 983, 15 L. Ed. 2d 472, 86 S. Ct. 559 (1966). The issue of wilfulness or wrongful intent is an issue of fact to be resolved by the jury. Floyd v. Eastern Airlines, 872 F.2d 1462, 1489 (11th Cir. 1989), rev'd on other grounds, 499 U.S. 530, 113 L. Ed. 2d 569, 111 S. Ct. 1489 (1991); Pekelis v. Transcontinental \u0026 Western Air, Inc., 187 F.2d 122, 124 (2d Cir.), cert. denied, 341 U.S. 951, 95 L. Ed. 1374, 71 S. Ct. 1020 (1951); Hill v. United Airlines, 550 F. Supp. 1048, 1056 (D. Kan. 1982); In re Pago Pago Aircrash of January 30, 1974, 419 F. Supp. 1158, 1160 (C.D. Cal. 1976). Because the issue of intent, or state of mind, is crucial in any determination of wilful misconduct, the following generalizations concerning proof of intent will be helpful in the Discussion that follows.\n\nIt is well established that a person's state of mind is a fact question to be proved the same as any other fact. Chicago \u0026 N.W. Ry. Co. v. McKenna, 74 F.2d 155, 158 (8th Cir. 1934). The state of a person's mind is as much a fact as the state of the person's digestion. Rogers v. Virginia-Carolina Chemical Co., 149 F. 1 (3d Cir. 1906) (citing Edgington v. Fitzmaurice, 29 L.R. Ch. Div. 459). Accordingly, a defendant generally is permitted to testify concerning his motive, belief and intent. McKenna, supra, 74 F.2d at 158. \"Where a defendant's intent is in issue he should be permitted to testify as to his motive and actual intent or state of mind.\" United States v. Hayes, 477 F.2d 868, 873 (10th Cir. 1973). Such evidence cannot be excluded on the ground that it is self-serving. United States v. Matot, 146 F.2d 197, 198 (2d Cir. 1944).\n\nIn Crawford v. United States, 212 U.S. 183, 204-05, 53 L. Ed. 465, 29 S. Ct. 260 (1909), which involved an alleged conspiracy to defraud the United States, the charge was made that the defendant took some correspondence from a corporate file for the purpose of destroying evidence against him. Defendant's attempt to explain that he took the letter for a lawful purpose was rejected. The Supreme Court held that \"no material and proper evidence upon that issue should have been excluded, and the error committed was not, in our opinion, clearly shown to have been harmless.\" In United States v. Harris, 942 F.2d 1125 (7th Cir. 1991), which involved the question whether money paid to the defendant was intended as a gift, the court held that the trial court erred in rejecting letters that accompanied the payment on the ground they were hearsay. Id. at 1131. The court said that \"[the defendant's] belief about [the letter writer's] intent decides the issue of willfulness, which is an element of the offense.\" Id. See also United States v. Detrich, 865 F.2d 17, 21 (2d Cir. 1988); United States v. Kohan, 806 F.2d 18, 21-22 (2d Cir. 1986); United States v. Kyle, 257 F.2d 559, 563 (2d Cir. 1958), cert. denied, 358 U.S. 927 (1959); Fed. R. Evid. 803(3). In United States v. Rubin, 591 F.2d 278 (5th Cir.), cert. denied, 444 U.S. 864, 62 L. Ed. 2d 87, 100 S. Ct. 133 (1979), the defendant was convicted of embezzling union funds by taking unauthorized salary increases. One of his defenses was lack of criminal intent. Because the facts of that case are strikingly similar to the facts of the instant case, I quote in full that portion of the Fifth Circuit's opinion which found the rejection of the proffered evidence to be reversible error:\n\nOne of Rubin's defenses in this case was lack of criminal intent. He claimed that because he interpreted the unions' constitutions as allowing the salary increases, he was unaware that the increases were actually unauthorized. The constitutions, however, appear clearly to mandate a different procedure for obtaining salary increases from the procedure followed by Rubin. To explain why he nonetheless believed the salary increases were authorized, Rubin testified that his understanding was that the constitutions were not to be interpreted literally. Rubin wanted to explain further that both present and past presidents of the unions, those individuals given the duty of interpreting the constitutions, had told him that the constitutions were flexible, living documents that could be interpreted to fit the needs of a particular local. The trial Judge excluded this testimony as hearsay.\n\nThe Federal Rules of Evidence define hearsay as \"a statement, other than one made by the declarant while testifying at the trial or hearing, offered in evidence to prove the truth of the matter asserted.\" Fed. R. Evid. 801 (emphasis added). As Rubin explained at trial, he did not offer the statements to prove the truth of the matter asserted, but instead to prove that he had heard them and to establish their effect on his mind. See Dutton v. Evans, 400 U.S. 74, 88, 91 S. Ct. 210, 27 L. Ed. 2d 213 (1970). Thus, Rubin's proffered testimony was not hearsay, and because it was relevant to his state of mind, it should have been admitted. See Fed. R. Evid. 401 \u0026 402.\n\nId. at 283.\n\nA court has no right to reject testimony dealing with a person's state of mind because it deems the testimony incredible or lacking in persuasive force. See Western Industries, Inc. v. Newcor Canada Ltd., 739 F.2d 1198, 1202 (7th Cir. 1984); Ballou v. Henri Studios, Inc., 656 F.2d 1147, 1154 (5th Cir. 1981). Credibility and believability are for the jury, not the Judge. United States v. Thompson, 615 F.2d 329, 332 (5th Cir. 1980); see also Bowden v. McKenna, 600 F.2d 282, 284-85 (1st Cir.), cert. denied, 444 U.S. 899, 62 L. Ed. 2d 135, 100 S. Ct. 208 (1979). \"In the first place, credibility is a question for the jury; to permit the Judge to exclude evidence on the ground that he thinks it incredible would be a remarkable innovation and may even be a violation of the right of trial by jury.\" Wright \u0026 Graham, Federal Practice and Procedure: Evidence § 5214 at 265-66.\n\nThe concern expressed in the above authorities was reiterated by the Supreme Court in the case of Cheek v. United States, 498 U.S. 192, 112 L. Ed. 2d 617, 111 S. Ct. 604 (1991), where it said at 203:\n\nKnowledge and belief are characteristically questions for the factfinder, in this case the jury. Characterizing a particular belief as not objectively reasonable transforms the inquiry into a legal one and would prevent the jury from considering it. It would of course be proper to exclude evidence having no relevance or probative value with respect to willfulness; but it is not contrary to common sense, let alone impossible, for a defendant to be ignorant of his duty based on an irrational belief that he has no duty, and forbidding the jury to consider evidence that might negate willfulness would raise a serious question under the Sixth Amendment's jury trial provision.\n\nThe pertinence of the above legal generalizations in the instant case is readily apparent. It cannot be gainsaid, for example, that resolution of the issue of wilfulness involves consideration by the jury of the mental processes of Pan Am officials. As stated above, the state of mind of these officials was a fact question to be proved the same as any other fact, and the district Judge had no right to reject testimony dealing with this fact because he deemed it incredible or unpersuasive. As the Supreme Court said in Crawford v. United States, supra, no material and proper evidence upon the issue of the defendant's intent should have been excluded, and the error committed by such exclusion was not harmless. 212 U.S. at 205. We echoed this language in Vinieris v. Byzantine Maritime Corp., 731 F.2d 1061 (2d Cir. 1984), where we held that, because the issue of wilfulness was a crucial issue in the case, the trial court should have followed a liberal policy in admitting evidence directed toward that issue and that \"no evidence which bore even remotely on this issue should have been kept from the jury unless it interjected tangential and confusing elements which clearly outweighed its relevancy.\" Id. at 1064. In United States v. Brandt, 196 F.2d 653 (2d Cir. 1952), we reversed a mail fraud conviction, in language almost identical to that used in Vinieris, because the trial court rejected evidence aimed at establishing the defendant's intentions. Id. at 657. Cf. Mutual Life Ins. Co. v. Hillmon, 145 U.S. 285, 294-98, 36 L. Ed. 706, 12 S. Ct. 909 (1892). See also 29 Am. Jur.2d Evidence § 361, where the applicable rule is stated in language almost identical with that used in Vinieris :\n\nAny evidence which has a material bearing upon the intent with which a person acted and which fairly tends to a disclosure thereof, or which is explanatory of the intent or purpose with which an act was done, or is to be done, is admissible.\n\nThe record is clear that both the district court and plaintiffs' counsel had ample notice of Pan Am's intention to offer evidence of Sonesen's conversation with Salazar concerning the propriety of using x-ray screening. This intent was stated unambiguously in paragraphs 63-65 of the pretrial order:\n\n63. In late 1986 or early 1987, Daniel Sonesen, System Director - Corporate Security and co-chairman of the Security Task Force, at the request of the other Security Task Force members, conferred with the FAA concerning the use of X-ray security screening of interline baggage at Pan Am European stations and whether the X-ray security screening of such baggage met the requirements of Section XV.C.1.(a) of the ACSSP.\n\n64. At that time, the FAA permitted X-ray security screening of many items, and the FAA advised Mr. Sonesen that X-ray security screening of interline baggage met the requirements of Section XV.C.1.(a) of the ACSSP.\n\n65. Mr. Sonesen reported back to the Security Task Force that the FAA had said that X-ray screening of interline baggage met the requirements of Section XV.C.1.(a) of the ACSSP.\n\nMoreover, both the court and plaintiffs' counsel had copies of Sonesen's pretrial depositions in which he testified about his conversation with Salazar. Plaintiffs' counsel also had in his possession a copy of an E-mail message from Sonesen to Pan Am security officers that read as follows:\n\nPER MESSAGE OF 10 MAR-88 ANSWER: THE DIR. FAA R SALIZAR HAS GRANTED X RAY AS AND [sic] ALTERNATE TO SEARCHING PASS. BAGGAGE.\n\nKnowing what Sonesen's testimony would be, plaintiffs' counsel decided to meet the evidence head on by placing the E-mail message in evidence as part of his affirmative case. He then offered the following testimony from Salazar:\n\nQuestion: This document is something more than that, doesn't it, sir? It says that you granted x-ray as an alternative, doesn't it?\n\nAnswer: Yes, that is what the document says.\n\nQuestion: You just said to me you never granted that to Mr. Sonesen?\n\nAnswer: That's correct, I did not.\n\nQuestion: You had never even spoken to Mr. Sonesen, did you?\n\nAnswer: About this issue, I have no specific recollection of speaking to Mr. Sonesen about this issue.\n\nQuestion: Therefore, sir, if you didn't grant permission to Mr. Sonesen, and he said in this document you did, isn't that a lie?\n\nAnswer: It is an improper interpretation.\n\nQuestion: It is an improper interpretation. I am not talking interpretation now of the procedures, I am talking about the statement: R. Salazar granted.\n\nIs that statement accurate?\n\nAnswer: No, it is false.\n\nQuestion: So that statement, as it goes, R. Salazar has granted, is a lie.\n\nA VOICE: Objection.\n\nAnswer: Again, it is only what -- I can say it is here. It is a misrepresentation. It is not an accurate depiction of the requirements for air carriers operating out of those stations.\n\nQuestion: Can we agree that when Mr. Sonesen said that you had granted, in this phrase, that that was a falsehood?\n\nAnswer: That was a falsehood.\n\nTr. 1279-80.\n\nOn the basis of Salazar's testimony, the district Judge made a colossal blunder by a sua sponte ruling that was so contrary to established legal precedent and simple Justice that it smacked of a due process and Seventh Amendment violation -- he declared that he would receive no testimony from Sonesen or any other Pan Am employee in support of Sonesen's assertion of what Salazar had told him. Sonesen, whose proposed testimony was an important part of Pan Am's defense, was branded a liar, and the district Judge precluded Pan Am from attempting to prove that he was not. So far as the jury knew, a substantial part of Pan Am's defense was built upon a lie, or as plaintiffs' counsel described it in summation, \"a concocted piece of baloney.\" Tr. at 6395.\n\nThe district court correctly charged the jury that \"the violation of FAA regulations and safety standards . . . would not necessarily constitute willful misconduct.\" Tr. 6557. However, because of the district court's erroneous exclusions of evidence, this portion of its charge became meaningless. The district Judge treated this case as if Pan Am were being prosecuted for criminally violating a federal statute and, relying on his erroneous interpretation of criminal law, precluded every attempt by Pan Am to demonstrate that it did not know or believe that the probable result of its conduct would be injury to the plaintiffs.\n\nTHE COURT: This whole thing starts at page 65 and it goes right on through to page 78 and it leads up to the very question we have been discussing now for days, namely, the FAA, the alleged FAA verbal authorization.\n\nI don't see what this has got to do with the price of beans, what his understanding of the ACSSP procedures are. He's not in court here. The regulations speak for themselves.\n\nI don't see what basis this comes in under anyplace.\n\nMR. SHAUGHNESSY: Your Honor, this is a willful misconduct case.\n\nTHE COURT: I know it's a willful misconduct case, but willful misconduct is not excused by Sonesen's version of an oral permission which is not admissible in the FAA. It is not admissible. And that's all this is.\n\nTr. 3958-59.\n\nTHE COURT: Whether it be offered for the purpose of authority or willfulness or anything else, it is out.\n\nTr. 3351.\n\nTHE COURT: It just doesn't make any sense to me that anybody in his right mind would rely -- would, in fact did rely on any such permission. It just didn't exist.\n\nTr. 4789.\n\nMR. SHAUGHNESSY: So I take it that all of the conversations among these people are out?\n\nTHE COURT: Obviously they're not objecting to it, but I'm going to sustain those three questions that he's objected to and I'm going to -- you might as well know now that I'm going to sustain the questions and answer on page 78.\n\nMR. SHAUGHNESSY: I understand, your Honor.\n\nTHE COURT: And anything else that they object to in between I'm going to sustain because I think it's irrelevant.\n\nTr. 3962.\n\nThe district Judge even precluded Pan Am from showing that FAA officials inspected Pan Am's operations both before and after the bombing and made no complaints of irregularities. The district Judge's ruling on this issue is illustrative of his mind-set.\n\nTHE COURT: I'm satisfied, Mr. Shaughnessy, this is another back-door method of getting Mr. Sonesen's unilateral interpretation of his authority to bury the FAA regulations before this jury. I don't like you doing it.\n\nI think the next time you attempt to do it you should alert the Court that this is what you're attempting to do. I have ruled upon it.\n\nHad you gotten this before the jury before alerting me and one had been asleep, I probably would have had to declare a mistrial. We're six weeks into this trial.\n\nThe law has been stated by me to be that based upon two Second Circuit decisions, both of which went to the Supreme Court and certiorari was denied, you have promised me that you were going to show me the law was otherwise. You haven't.\n\nYou may not do this.\n\nI don't know how I can make myself clearer.\n\nMR. SHAUGHNESSY: All I wanted was to ask the witness --\n\nTHE COURT: You attempted to get this FAA report in before this jury with, knowing that this man was operating under this assumption, that what they were doing was correct and was in direct violation of the FAA regulations, and he was doing it on the basis of this verbal authorization of Mr. Sonesen who said he had reached him.\n\nAccording to FAA officials, testified he didn't have, and the regulations themselves say he couldn't have, and you can't do it.\n\nYou do it again and I'm going to have to take appropriate action.\n\nTr. 4365-66.\n\nFAA's policy in looking for violations of its regulations is well known:\n\n... When we feel there is a serious violation or serious numbers of violations that requires significant deterrent effect, we have been forced to go out and scrape up every possible violation of the Regulations that is appropriate in order to compute these large penalties.\n\nTestimony of Clark Onstad, Chief Counsel, FAA before the Subcommittee on Aviation of the Committee on Public Works and Transportation, House of Representatives, 96th Cong., 2d Sess. July 1, 1980, Record of Hearing on H.R. 7488 at 38.\n\nFAA v. Landy, 705 F.2d 624, 638 (2d Cir.), cert. denied, 464 U.S. 895 (1983) (Van Graafeiland, J., Concurring in part and Dissenting in part).\n\nA threat of contempt for attempting to introduce evidence that FAA officials who, after personally inspecting Pan Am's operations found no fault with them, is pretty strong medicine. However, it illustrates once again that the district Judge was fully aware of what Sonesen's testimony would have been. For further evidence of this knowledge, see the following excerpts from the record:\n\nTHE COURT:\n\nAs I understood, your position is somebody in the FAA, I don't know who, told Sonesen or somebody in Pan Am verbally once they had the x-ray machine they didn't have to physically search a couple of bags.\n\nMR. SHAUGHNESSY: That's correct.\n\nTHE COURT: That is your position.\n\nMR. SHAUGHNESSY: I understand.\n\nTr. 1138-39.\n\nTHE COURT:\n\nMr. Sonesen's testimony was, as I recall it, and it's right here before us, Sonesen's testimony was that I got this verbal permission from Salazar, we discussed it up and down the hierarchy which would include these Discussions here right up to what's his name.\n\nTr. 3960.\n\nTHE COURT: Salazar had the authority, but there has been nothing produced in writing and Sonesen said he got it orally and he acted on it orally and he told all of these people that he had the authority from the FAA and it's irrelevant what he told people in the Pan American organization on this subject, because he didn't have the authority.\n\nTr. 3961.\n\nI regret that my colleagues, in their zeal to support the outcome of an obviously unfair trial, advance the fallacious argument that a formal proffer of Sonesen's testimony was essential. See Massachusetts Mutual Life Ins. Co. v. Brei, 311 F.2d 463, 465 n.1 (2d Cir. 1962); Charter v. Chleborad, 551 F.2d 246, 248-49 (8th Cir.), cert. denied, 434 U.S. 856, 54 L. Ed. 2d 128, 98 S. Ct. 176 (1977).\n\nMy colleagues go equally astray in arguing that Pan Am waived its objection to the district Judge's erroneous exclusion of evidence by refusing to accept the following offer of the district court made after two months of trial:\n\nOn the so-called verbal authorization, I didn't think they would be able to come up with any cases. Of course, they haven't come up with any cases, which changes the law in this circuit.\n\nIf they want me to give the jury an instruction to disregard the testimony that came in at the outset of the case before I understood what the issue was, I will be glad to give that instruction.\n\nBut I rather suspect they don't want me to highlight it at this point. But if they want me to, I will be glad to tell them that they are to disregard any such conversations between Salizar [sic] and they are to draw no inference one way or the other from it because it is irrelevant to this case, and Sorenson [sic]. But it is not admissible.\n\nTr. 4787-88.\n\nThis offer was an obvious, but inevitably unsuccessful, attempt by the district court to mitigate its earlier blunder. The district court knew that plaintiffs' expert witness, Rodney Wallis, had the pertinent portions of Salazar's testimony recorded on acetate, which Wallis displayed to the jury during what Pan Am's counsel accurately described as Wallis's pre-summation summation. In the course of this lengthy summation, a questionable practice at best, Wallis made the following comments concerning Salazar's testimony:\n\nAnd the reason I selected these was because I talked of violation, and this was showing me what the violation was.\n\nTr. 2945.\n\nAnd I picked that out because, as I say, to me, it pointed me in a direction. It indicated what was the requirement.\n\nTr. 2947.\n\nSo. This was saying to me what the rules were, what the requirement was.\n\nTr. 2948.\n\nSo, that was the message that I was getting from the Salazar testimony, . . .\n\nTr. 2949.\n\nThe above-quoted testimony, which constituted a \"positive assessment of the trustworthiness and accuracy\" of Salazar's testimony, clearly should not have been admitted. United States v. Scop, 846 F.2d 135, 142 (2d Cir. 1988), and see modified opinion in Scop, 856 F.2d 5 (2d Cir. 1988), emphasizing inadmissibility. However, it was admitted, and neither the district court nor plaintiffs' counsel suggested that the jury might be instructed to disregard it. This was understandable, of course, because of the important role that Salazar's testimony played in Wallis's opinion.\n\nMoreover, the suggested instruction that the jury disregard \"any such conversations between Salazar and they are to draw no inference one way or the other from it because it is irrelevant to this case,\" followed by the statement that Sonesen's testimony remains inadmissible, simply demonstrates the district court's misunderstanding of the law. An instruction to the jury that the conversation between Sonesen and Salazar was irrelevant and should be disregarded would deprive Pan Am of one of its major defenses, i.e., its lack of wilfulness based on that very conversation. The undeniable fact is that the subjective proof of Sonesen's understanding was highly relevant, and Pan Am's counsel would have been foolish to stipulate otherwise. Pan Am's counsel's refusal to leap at the court's suggestion demonstrates that he had a better understanding of the applicable law than the district court or my colleagues have demonstrated.\n\nTime and again, Pan Am's counsel explained his position to the district court, all to no avail:\n\nThe meetings that are referred to there, testimony of Mr. Sonesen, I don't know whether Mr. Baumeister is going to read any of his deposition, was that there was a Discussion at that meeting and that at that meeting Mr. Salazar said specifically that in connection with ICAO 514 and London Heathrow Airport in particular, that x-ray was a suitable alternative to the bag match.\n\nNow this is a willful misconduct case, your Honor, in which Mr. Sonesen, the plaintiffs are claiming they willfully disregarded this provision, 15C1(a). If the jury believes Mr. Salazar that in fact the Discussion was limited to ICAO 514, they still could believe that Mr. Sonesen, based on the meeting and what was discussed, could have believed, legitimately believed, that x-ray was a suitable alternative and that Mr. Salazar had said that.\n\nThis is a willful case, your Honor.\n\nTr. 1294-95.\n\nThe district Judge never budged from his misunderstanding of the law:\n\nTHE COURT:\n\nThe proposition before us is that Sonesen says Sonesen not being Pan Am corporation, about whom we are talking, but only an employee of Pan Am. Sonesen says he got verbal permission from Salazar. The cases are quite clear, that that is inadmissible under the issue of lawfulness or otherwise, and I have never seen anything at the moment, recently, that casts any doubt on it.\n\nTr. 3376.\n\nTHE COURT: Ever heard the expression, an individual may not bind the government?\n\nMR. CODDINGTON: Ever heard the expression that an individual may not bind the government? Yes, I have.\n\nTHE COURT: The government enacted a regulation or promulgated a regulation, I may not take off my robe, I may not work until executive capacity authorizes to make that. United States against Sorenson [sic] regulates, while on this subject, said: Whoever had the authorization from the DIA and C.I.A. to smuggle guns to Russia, and so forth and so on, and the 2d. Circuit upheld, may not do that verbally. That's the law.\n\nThis theory of yours, if you have verbal authorization from somebody to violate a regulation, I will have to charge the jury that an individual may not do that.\n\nMR. CODDINGTON: Well, certainly I'm happy to brief that.\n\nTHE COURT: Brief it all you want, because I sweated blood over this issue, because this was really quite serious. This was the business of taking armaments from this country and swapping it over from Russia, all on the okay of D.I.A. and C.I.A., And I wouldn't let them put that defense before the jury, and the 2d. Circuit said I was right. I went through a tremendous amount of research and wrote an opinion on this, and it was published, United States -vs- Schwartz. You may not as an individual authorize somebody to do something against the regulation, whether you are high-ranking. I don't think the President may do it. I didn't have to decide.\n\nTr. 3219-20.\n\nTHE COURT: In any event, nobody approved this in writing.\n\nSo the whole defense is a non-entity.\n\nI know you don't want to get rid of it from your mind, but there it is. If you want to stop the trial and mandamus me to the Second Circuit and have your ears pinned back, fine.\n\nBut that's it, that's the ruling, you've got to live with it. You've got to stop trying to sneak it in through the back door or I'm going to have to take appropriate action.\n\nTr. 3965.\n\nTHE COURT:\n\nYou might have some validity to it if -- if there was any kind of an acknowledgment from Salazar that he -- that he had any such conversation, but he emphatically denies it.\n\nEverybody says it is not within anybody's power to give it or -- and the regulation itself says you've got to have any modification in writing.\n\nIt just doesn't make any sense to me that anybody in his right mind would rely -- would, in fact did rely on any such permission. It just didn't exist.\n\nTr. 4789.\n\nThe cases of United States v. Duggan, 743 F.2d 59 (2d Cir. 1984), United States v. Schwartz, 924 F.2d 410 (2d Cir. 1991) and United States v. Berg, 658 F. Supp. 253 (E.D.N.Y. 1987) (affirmed in part by Schwartz, supra), so heavily relied upon by the district court and my colleagues, do not support their interpretation of the applicable law. Those cases involved alleged violations of criminal statutes, not the tort issue of whether the defendant wilfully placed the decedents in a position of danger. Moreover, as we stated in Duggan, 743 F.2d at 83, \"there is an exception [to the mistake of law rule] for legitimate reliance on an official interpretation of law.\" See, e.g., United States v. Laub, 385 U.S. 475, 487, 17 L. Ed. 2d 526, 87 S. Ct. 574 (1967) (\"Ordinarily, citizens may not be punished for actions undertaken in good faith reliance upon authoritative assurance that punishment will not attach.\"); see also United States v. Pennsylvania Indus. Chem. Corp., 411 U.S. 655, 675, 36 L. Ed. 2d 567, 93 S. Ct. 1804 (1973). Finding in Duggan that the defendants had not received an \"official interpretation of the law\" we held that the defense of mistake of law was not available to them. See 743 F.2d at 83-84. We returned to that theme in United States v. Schwartz, supra, where we said:\n\nSince Schwartz had no authority to authorize the crimes charged against them, Berg and Lisbona may not claim reliance on whatever account he might have given them.\n\nId. at 422. The authority of Raymond Salazar, Director of FAA Office of Civil Aviation Security, to interpret regulations which he and his staff had promulgated cannot be disputed.\n\nMy colleagues, I suggest, also err in their interpretation of Cheek, supra, to the effect that the holding therein applies only to tax cases. Cheek stands for the general proposition that \"the standard for the statutory willfulness requirement is the 'voluntary, intentional violation of a known legal duty.'\" 498 U.S. at 201 (citations omitted). It also holds that a good-faith belief that one is not violating the law, if it is to negate wilfulness, need not be objectively reasonable.\n\nKnowledge and belief are characteristically questions for the factfinder, in this case the jury. Characterizing a particular belief as not objectively reasonable transforms the inquiry into a legal one and would prevent the jury from considering it.\n\nId. at 203.\n\nWilfulness, in short, is a question of fact for the jury. See Floyd v. Eastern Airlines, Inc., supra, 872 F.2d at 1489; Pekelis v. Transcontinental \u0026 Western Air, Inc., supra, 187 F.2d at 124; see also United States v. Ingredient Technology Corp., 698 F.2d 88, 97 (2d Cir.), cert. denied, 462 U.S. 1131, 77 L. Ed. 2d 1366, 103 S. Ct. 3111 (1983). A trial Judge cannot take the question from the jury and answer it himself by applying his own objective standard of wilfulness. This is the clear holding of Cheek. See also Ratzlaf v. United States, 126 L. Ed. 2d 615, 114 S. Ct. 655 (1994), where the Supreme Court interpreted the language of 31 U.S.C. § 5322, which forbids a person from wilfully violating the antistructuring provisions of sections 5322(a) and 5324. Justice Ginsburg, writing for a five-Judge majority, said: \"To establish that a defendant 'willfully violated' the antistructuring law, the Government must prove that the defendant acted with knowledge that his conduct was unlawful.\" Id. at 657; see also id. at 663 n.19.\n\nWe would be blinking reality if we did not hold that the district Judge's erroneous rulings were prejudicial. Indeed, as disclosed by the following excerpt from the argument on appeal, plaintiffs' counsel admitted as much:\n\nJUDGE VAN GRAAFEILAND: Let me ask you this, Mr. Kreindler: If I read the record, I listen to your argument and I read the record, and I decide that Judge Platt said I'm not going to hear from Mr. Sonesen no matter what, would you concede that that is very prejudicial error in this case?\n\nMR. KREINDLER: Under those circumstances, yes. But that's not what happened. That's --\n\nJUDGE VAN GRAAFEILAND: I'm not asking you that. I'm asking you if I read this record and I decide that that is what happened -- leave this offer of proof business out -- if I decide that Judge Platt just simply said, I'm not going to hear Mr. Sonesen, that would be prejudicial error; wouldn't it, in this case?\n\nMR. KREINDLER: Your Honor, even --\n\nJUDGE VAN GRAAFEILAND: Counsel, wouldn't it be prejudicial error?\n\nMR. KREINDLER: Of course, if the Judge were hearing --\n\nJUDGE VAN GRAAFEILAND: Of course, it would. Then we have got the issue: did he refuse to hear him, or didn't he?\n\nMR. KREINDLER: No.\n\nJUDGE VAN GRAAFEILAND: All right, that's the issue. I'll read the record very carefully, Mr. Kreindler.\n\nMoreover, the district Judge himself recognized the crucial importance of Sonesen's testimony when he said, \"You're in trouble if this is your defense.\" Tr. at 3355-56.\n\nNo one, I suggest, can dispute the proposition that even-handedness is the sine qua non of a fair trial. A trial is not a \"game of blindman's buff.\" United States v. Procter \u0026 Gamble Co., 356 U.S. 677, 682, 2 L. Ed. 2d 1077, 78 S. Ct. 983 (1958). It is a \"search for the truth.\" 8 Wright and Miller, Federal Practice and Procedure § 2001 at 14. That search will succeed only if the trial court recognizes the right of each party to present its evidence and to rebut that of its opponent, a right that \"is a fundamental element of due process of law.\" See Washington v. Texas, 388 U.S. 14, 19, 18 L. Ed. 2d 1019, 87 S. Ct. 1920 (1967). It is a rule as old as the proverbial hills that when a party opens a subject in its case in chief, its opponent is entitled to offer evidence on the same subject, i.e., to explain, repel, counteract or disprove the evidence that the party introduced. See, e.g., United States v. Touloumis, 771 F.2d 235, 241 (7th Cir. 1985); United States v. Finis P. Ernest, Inc., 509 F.2d 1256, 1263 (7th Cir.), cert. denied, 423 U.S. 893, 46 L. Ed. 2d 124, 96 S. Ct. 191 (1975); United States v. Mallis, 467 F.2d 567, 569 (3d Cir. 1972); Luttrell v. United States, 320 F.2d 462, 464 (5th Cir. 1963); 1 Wigmore on Evidence § 15 at 740.\n\nIn view of the definitive holding of the Supreme Court in Cheek, supra, that a good-faith misunderstanding of the law or a good-faith belief that one is not violating the law need not be objectively reasonable in order to negate wilfulness, the district court's ruling for the \"425th time\" that Salazar's verbal permission was \"not in this case,\" Tr. 3959, was clearly and prejudicially erroneous.\n\nEven my colleagues concede that the district court erred in excluding evidence of British Airway regulations which, in the face of bombings by Irish terrorist organizations, permitted Pan Am and other carriers to x-ray unaccompanied baggage at Heathrow Airport. I regret that in my colleagues' apparent eagerness to affirm, they hold this error to be harmless. It was not harmless. It went squarely to a crucial issue in the case, i.e., whether Pan Am knew that its use of x-ray screening probably would result in injury.\n\nEvidence that, shortly after the Lockerbie accident the FAA amended its regulations so as to clarify the permissible use of x-ray screening, also went squarely to the issue of whether Pan Am should have anticipated danger in its pre-amendment use of x-rays. The district court's refusal to permit the jury to receive this evidence exacerbated all of the court's similar rulings that pervaded the trial. In short, it was another indication that the district court misunderstood the law. The issue was not whether Pan Am violated the regulation; it was whether Pan Am used x-ray screening with knowledge that its use would probably result in injury or in reckless disregard of the probable consequences.\n\nDAMAGES\n\nIn my Dissent to the original majority opinion, I expressed concern over my colleagues' handling of the question of damages. However, since my colleagues now agree that the cases must be returned to the district court for retrial on the issue of damages for loss of society and parental care, I will not repeat what I have already said.\n\nConclusion\n\nWhenever, as here, an appellate court affirms a judgment based on opinion and conjecture, it faces the nagging possibility that someday the truth will out and prove the conjecture wrong. If the erroneous judgment was the culmination of a fair trial, the appellate court, although unhappy with its role in the error, need have no feeling of guilt or remorse. This would not be true if the errors below either were ignored or termed \"harmless.\" Needless to say, I do not want someday to find myself in the latter unhappy situation.\n\nIf all of the irrelevant and prejudicial evidence dealing with such matters as television commercials and the private lives of Pan Am employees, together with the colloquies of court and counsel arising out of the district court's \"425\" erroneous rulings, were eliminated from this case, it could be retried in several weeks. My colleagues now agree that the case must be retried in part on the issue of damages. Particularly in view of the fact that the outcome in over two hundred claims hinges upon the judgment in the instant case, Justice demands that the matter be remanded in its entirety so that it can be tried fairly.\n\nExcept for the remand to the district court on the damages issue, I Dissent.\n\n\u003cspan class=\"fn\"\u003e1. This opinion has been circulated to the active Judges of the Court prior to filing. A petition for rehearing of the panel decision filed on January 31, 1994 was submitted on April 6, 1994. After considering the petition, the majority opinion filed January 31, 1994 and the Dissenting opinion filed February 18, 1994 were withdrawn and the instant revised majority and Dissenting opinions are filed in place thereof. Except to the extent indicated in the revised majority opinion, the petition for rehearing is denied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The Dissent will hereinafter refer to defendants Pan American World Airways, Inc. and Alert Management Systems, Inc. as Pan Am or defendant.\u003c/span\u003e\n\n",
    "body_length": 148252,
    "citedas": [
      "37 F.3d 804"
    ],
    "attorneys": "RICHARD M. SHARP, Washington, D.C. (Frederick C. Schafrick, Eric C. Jeffrey, Lisa A. Landsman, Shea \u0026 Gardner, Washington, D.C.; Clinton H. Coddington, Coddington, Hicks \u0026 Danforth, Redwood City, California; James M. Shaughnessy, Windels, Marx, Davies \u0026 Ives, New York, New York; of counsel), for Appellants. LEE S. KREINDLER, New York, New York (Steven R. Pounian, James P. Kreindler, Daniel M. Kolko, David L. Fiol, Kreindler \u0026 Kreindler, New York, New York; Frank H. Granito, Jr., Frank H. Granito, III, Speiser, Krause \u0026 Madole, New York, New York; Michel F. Baumeister, Baumeister \u0026 Samuels, New York, New York; of counsel), for Appellees.",
    "category": [],
    "judges": "Before: Van Graafeiland, Cardamone and Altimari Circuit Judges. Judge Van Graafeiland Dissents in a separate opinion.",
    "citation_count": 53
  }
}
