{
  "id": "xJRXQ2YBTlTomsSBJzr9",
  "document": {
    "title": "IN RE SOUTHERN LAND TITLE CORP.",
    "full_title": "In the Matter of SOUTHERN LAND TITLE CORPORATION, Debtor, in Proceedings for the Reorganization of a Corporation",
    "jurisdiction": "E.D. Louisiana.",
    "date": "1968-11-25T00:00:00.000Z",
    "docket": "67-135",
    "body": "HEEBE, District Judge:\n\nThis matter came on for hearing on August 4, 5 and 8, 1967, pursuant to section 144 of the Bankruptcy Act, 11 U.S.C. § 544. On October 16, 1967, we issued an order sustaining the involuntary petition for reorganization under § 144 and indicated that we would issue written reasons at a later date. We now issue the following opinion to serve as findings of fact and conclusions of law in this matter.\n\nIn order to properly understand the various issues involved, a rather detailed statement of the factual situation is necessary. Southern Land Title Corporation (Southern Land) is a Louisiana corporation domiciled in New Orleans, Louisiana, engaging in the business of developing real property, land, hotels, apartments, etc. It has engaged in such business directly and through corporate subsidiaries. These subsidiaries, all Louisiana corporations domiciled in New Orleans, are Puritan Oil \u0026 Gas of New England, Inc. (Puritan), Place Vendome, Inc. (Place Vendome), Sotan, Inc. (Sotan), Bourbon Kings Hotel Corporation (Bourbon Kings), Lakeview Properties, Inc. (Lakeview), and the Five Flags Building, Inc. (Five Flags). Southern Land and its subsidiaries own a large number of properties, most of which are located in and around the City of New Orleans. The dominant force behind Southern Land and its subsidiaries, as well as several other related corporations, is Sam Recile, a dynamic and aggressive real estate promoter. These corporate holdings have been referred to by divers sources as \"Recile's Empire.\" Recile's top assistant in the acquisition and operation of real estate is Frank Spalitta, and their legal advice is chiefly rendered by the law firm of Henican, James \u0026 Cleveland, particularly C. Ellis Henican who, along with Recile, Spalitta and others, holds stock and various offices in the corporations.\n\nEncountering difficulties with its creditors and being confronted with a number of foreclosure and other suits by some of its creditors, Southern Land filed a voluntary petition for its own corporate reorganization pursuant to Chapter X of the Bankruptcy Act on December 7, 1966, in this district. That petition, entitled \"In the Matter of Southern Land Title Corporation, Debtor Corporation\" and numbered Bankruptcy No. 66-1015, was allotted to Section F, Honorable Lansing L. Mitchell. Judge Mitchell never approved the petition but entered various stay orders, pursuant to his powers under § 113 of the Bankruptcy Act, 11 U.S.C. § 513, and appointed a temporary trustee for the debtor's property. A hearing on the approval of the petition was set for January 12, 1967. Prior to the hearing, counsel for the debtor corporation and the major secured and unsecured creditors entered into a stipulation which was dictated into the record and which generally provided for a twenty-day period in which the status quo of the debtor would be maintained with the understanding that if, during the twenty-day period, the debtor was unable to produce a commitment for financing, the proceeding would be dismissed with prejudice. In accordance with the stipulation, the hearing before Judge Mitchell was continued until February 3, 1967. No commitment for financing was obtained, and at the hearing on February 3, 1967, counsel for the debtor corporation and counsel for the creditors who filed the present petition for reorganization attempted to repudiate the stipulation. Considerable discussion ensued at the hearing concerning the validity of the stipulation. Without ruling on the validity of the stipulation, Judge Mitchell dismissed the voluntary petition for lack of good faith at the conclusion of the hearing on February 3, 1967.\n\nApproximately an hour later, a group of ten creditors of Southern Land and its subsidiaries filed an involuntary petition for the reorganization of Southern Land and its six subsidiaries. That petition was allotted to us and was the initiation of the instant proceeding. Subsequent to the filing of that petition, on Sunday, February 5, 1967, counsel for Southern Land applied to the United States Court of Appeals for the Fifth Circuit for a Writ of Mandamus directed to Judge Mitchell, and the Honorable David W. Dyer of that court directed that Judge Mitchell vacate the order dismissing the proceedings and maintain in full force and effect all prior orders, including stay orders. The next day, in compliance with Judge Dyer's order, Judge Mitchell stayed the minute entry of dismissal, and ordered that all his previous orders remain in full force and effect.\n\nUpon the filing of the instant petition, we contacted all counsel and arranged for an informal conference on Monday, February 6, 1967, intending to discuss the steps to be taken by this Court. At that conference, however, the chief topic of conversation was, of course, Judge Dyer's order, and it was generally agreed that, pending the outcome of Judge Mitchell's proceeding, this Court should take no action. However, on that same day, counsel for the petitioning creditors herein filed a Notice of Voluntary Dismissal Without Prejudice pursuant to F.R.Civ.P. 41(a)(1)(i) on the ground that Judge Dyer's order reinstated the proceedings in Judge Mitchell's court. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\"\n\nThe instant proceeding remained in limbo while the Fifth Circuit conducted the mandamus proceeding. On February 20, 1967, Judge Mitchell filed his findings of fact and conclusions of law. The Fifth Circuit heard oral argument on the petition for a mandamus on April 3, 1967, and on April 6, 1967, denied the application for the Writ of Mandamus and vacated and set aside Judge Dyer's order. Thereupon, Judge Mitchell proceeded to wind up the proceedings before him, and on April 26, 1967, entered a judgment of dismissal of the voluntary petition of Southern Land and dissolved all restraining orders and injunctions rendered in that proceeding.\n\nImmediately upon the denial of the mandamus on April 6, 1967, counsel for the petitioning creditors in the instant proceeding moved to withdraw his Notice of Voluntary Dismissal Without Prejudice and his alternative Motion for Entry of Order of Voluntary Dismissal Without Prejudice on the ground that neither the Clerk of Court nor the Court had acted on either of the above motions and that there was no longer any impediment to the involuntary petition and the persistence of the present proceeding. We met with all counsel and decided to take no action as Judge Mitchell's stay orders were still in effect and thus no immediate action was necessary. Later, when Judge Mitchell entered judgment in his proceeding on April 26, 1967, and dissolved all stay orders, we met with all interested counsel that same evening to discuss the issues and problems raised in our proceeding. On that day Southern Land and its six subsidiaries filed an answer to the creditors' petition, admitting each allegation in the petition, except the exact amount of the creditors' claims, although admitting that they aggregated over $5,000, and joined in the prayer for reorganization. Early the next morning we entered an order permitting the withdrawal of the Notice of Voluntary Dismissal Without Prejudice and the Alternative Motion for Entry of Order of Voluntary Dismissal Without Prejudice. We then entered a so-called preliminary approval of the petition under § 141 of the Bankruptcy Act, 11 U.S.C. § 541, appointed a trustee for the debtor, and stayed all suits against the debtor and any of its six subsidiaries.\n\nA deluge of motions was then filed by some fifteen creditors opposing reorganization. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" In essence, the various motions seeking dismissal of the entire proceeding urged that the petition herein was improperly filed under § 126 of the Bankruptcy Act for the reason that at the time it was filed the petition before Judge Mitchell was still pending and that principles of res judicata and estoppel should bar the petitioning creditors herein from relitigating the matters which were decided by Judge Mitchell. A few of the same fifteen opposing creditors also filed a motion to dismiss this proceeding insofar as it purports to relate to the subsidiaries of Southern Land. Counsel for Southern Land filed a motion to strike the various motions to dismiss. All of these various motions were heard on May 17, 1967, at which time we denied Southern Land's motion to strike, as well as the creditors' motions to dismiss based on § 126. We took under advisement the motions to dismiss insofar as they were based on res judicata and estoppel, as well as the motion to dismiss the proceedings as to the subsidiaries. By minute entry of June 16, 1967, we granted the motion to dismiss as to the subsidiaries and denied the motions to dismiss based on res judicata and estoppel and indicated that we would later assign written reasons for denial of the motions to dismiss both on the \"pending petition\" and the res judicata arguments.\n\nOn June 19, 1967, each of Southern Land's six subsidiaries filed a voluntary petition for reorganization under this docket number pursuant to a minute entry of this Court on that date authorizing those voluntary petitions to be filed in this proceeding. Although the proceedings were not consolidated, expediency deemed it advisable to have these reorganization proceedings administered together due to the close relationship among these proceedings.\n\nThe first answers to the creditors' petition, other than the debtor's answer, were filed on May 24, 1967, by Wilson P. Abraham and Estate, Inc., who are creditors, both of which controverted material allegations of the petition. On June 5, 1967, we set the hearing under § 161, 11 U.S.C. § 561, for July 10, 1967, and set the hearing under § 144, 11 U.S.C. § 544, for July 21, 1967, on the issues raised by answers filed on or before July 10, 1967, pursuant to § 137, 11 U.S.C. § 537. Answers were filed on behalf of fourteen additional creditors on or before July 10, 1967. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" The § 161 hearing was held on July 10, 1967, but on July 21, 1967, the § 144 hearing was continued over to September 18, 1967. However, on July 31, 1967, the § 144 hearing was reset for August 4, 1967, at which time it did commence as scheduled.\n\nThe answers to the creditors' petition raise a number of issues for our determination which can generally be placed into four categories: (1) whether the proceedings before Judge Mitchell bar the petition filed herein under § 126; (2) whether the matters litigated before Judge Mitchell bar by res judicata or estoppel the present petition; (3) whether the creditors who instituted the present proceedings were \"creditors\" within the meaning of § 126; and (4) whether the petition was filed in good faith and otherwise satisfies the requirements of Chapter X.\n\nIn ruling on the various motions to dismiss we have already decided the first and second issues presented at the § 144 hearing adversely to the creditors opposing reorganization. Nothing new by way of argument or evidence on these issues was adduced at the § 144 hearing and our rulings on those matters stand. See Selected Investments Corp. v. Duncan, 260 F.2d 918, 924 (10th Cir. 1958), cert. den. 359 U.S. 914, 79 S. Ct. 584, 3 L. Ed. 2d 576 (1959). However, we are taking this opportunity to issue written reasons for our rulings.\n\n(1) Pending Petition\n\nGenerally, we are here concerned with a problem of successive petitions. Section 126 of the Bankruptcy Act provides in pertinent part:\n\n\"A corporation, or three or more creditors * * * may, if no other petition by or against such corporation is pending under this chapter, file a petition under this chapter.\"\n\nAt the outset, we note that at the time the creditors' petition was filed initiating the instant proceedings, there was no \"petition\" pending before Judge Mitchell. Judge Mitchell had dismissed the petition, and he retained partial jurisdiction only for the purposes of allowing the temporary trustee to render an accounting and the payment of allowances and expenses. Merely because Judge Mitchell did not dismiss the entire proceeding does not mean that the petition was not dismissed and was still pending. For it is clear that the petition may be dismissed yet the judge may, as Judge Mitchell did, retain jurisdiction and keep the proceeding open for the payment of costs and allowances. 6 Collier on Bankruptcy P6.02 (14th ed.). Smith v. Central Trust Co., 139 F.2d 733 (4th Cir. 1944), is ample illustration that the petition may be dismissed by order of the judge, which order dismissing the petition is an appealable order, e.g., Dubladenhill, Inc. v. Sharretts, 375 F.2d 558 (4th Cir. 1967), while at the same time the proceeding remains open for the payment of costs and allowances. The petition having been dismissed by Judge Mitchell, it is clear that no \"petition\" was pending at the time the present petition was filed. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Abstractly then, the question is whether the language \"no other petition * * * is pending\" is intended to prohibit the filing of a petition during the pendency of a \"petition\" or during the pendency of a \"proceeding.\" More concretely, the issue is whether a second petition can be filed immediately upon the dismissal of a prior petition from the bench or by written order or opinion, or whether the filing of the second petition must await the rendering of a judgment which finally terminates the entire proceeding or even whether it must await the running of the time to appeal from that judgment.\n\nSection 126 uses the word \"petition.\" Section 1(24) of the Act, made applicable to Chapter X by § 102 since § 1(24) is not inconsistent with § 106(9) which uses the word \"petition\" in defining a reorganization petition, defines \"petition\" as \"a document filed in a court of bankruptcy or with a clerk thereof initiating a proceeding under this Act.\" This carefully worded statute, cf. Grubbs v. Pettit, 282 F.2d 557, 561 (2d Cir. 1960), uses the word \"proceeding\" or the phase \"proceeding under this Chapter\" many times in Chapter X, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" and the use in § 126 of the word \"petition,\" the definition of which distinguishes it from the proceeding as a whole, strongly indicates to us that Congress intended to mean \"petition\" rather than \"proceeding\" and thus to indicate that a second petition could be filed immediately upon the dismissal of the first petition and need not await the conclusion of the entire proceeding. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nIn the face of the language of the statute, the creditors opposing reorganization argued that the word \"petition\" in § 126 should be read \"proceeding\" in order to effect the changes in the law intended to be brought about by the enactment of § 126. Under the former § 77B proceedings, a debtor could file any number of petitions either in different districts or in the same court. As pointed out by Collier, this led to a multiplicity of pending petitions which § 126 was designed to correct:\n\n\"Multiplicity of petitions, with its resulting difficulties, is prevented by a provision that petition for reorganization may be filed only if no other petition by or against the corporation is pending under Chapter X.\" 6 Collier on Bankruptcy, P4.02[1], p. 759 (14th ed.)\n\nThe difficulties adverted to, and corrected by § 126, are further discussed:\n\n\"This frequently led to an undesirable multiplicity of pending petitions for the reorganization of a corporation, and often created problems concerning which of two or more courts had the right to proceed or to order a transfer and consolidation of the various proceedings. Moreover, the situation was conducive to unwholesome 'shopping around' of the various petitioners for what was regarded as a jurisdiction favorable to their particular interests.\n\n\"These objectionable features were eliminated by Chapter X. Section 126 provides that a petition for reorganization of a corporation, whether voluntary or involuntary, may be filed only 'if no other petition by or against such corporation is pending under this chapter.' Hence only one petition for reorganization is permitted to be pending at any time concerning a particular debtor corporation. If there is any contest between various groups of petitioners, it is clear from the foregoing that the first properly filed petitioner prevails. In the event a petition is dismissed, however, a new petition may then be filed involving the same debtor.\" 6 Collier on Bankruptcy, P4.04, pp. 766-67 (14th ed.)\n\nRemington has similar comments to make about the purpose of § 126:\n\n\"Congress did not intend to permit multiplicity of petitions. Only one petition is allowed to be pending at any one time by or against the corporation. Chapter X removes troublesome questions in respect of the priority of a debtor's petition over one filed by creditors such as arose under former § 77B. The pendency of a prior petition is apparently a bar irrespective of the place where it is filed, provided it is filed in a court with jurisdiction.\" 11 Remington on Bankruptcy, § 4446, p. 130 (Rev. ed. 1961).\n\nThus, the creditors seeking dismissal of this petition urge that dismissal is necessary in order to effectuate the purposes of § 126. They argue that the second petition should not be filed immediately after the order of dismissal of the first petition; rather, the filing of the second petition must await not only the entry of a final judgment in the first proceeding, after the judge has done all that is necessary to wind up the proceeding, but must further await the running of any time for appeal. They argue that unless this is done, the Court of Appeals might reverse the district judge's dismissal, reinstate the first proceeding, and then if a second petition had been filed, there will be two pending petitions, precisely the result which Congress wished to prevent. We do not believe that Congress intended to go so far, nor that it is necessary for sound administration of the Act to say that Congress must have intended to go so far. Congress was directing its attention to the particular forum-shopping problem where several active petitions were pending at the same time. In meeting that problem it was not necessary for Congress to insure that there could never be any problem of dual petitions. If Congress barred the filing of a subsequent petition until the time for appeal had run, then it would be possible that during that interim the secured creditors, in freely exercising their rights to levy on their security, would be destroying the rights of the unsecured creditors and stockholders to exercise their rights to seek reorganization, the very purpose of Chapter X. We cannot believe that Congress, in meeting the problem of multiplicity of petitions, intended to obliterate the effect of Chapter X; rather, we feel it sought to meet the major abuses found where multiplicity of petitions was permitted, without infringing on the major purpose of Chapter X.\n\nIn reality, the creditors seeking dismissal herein raise two slightly different practical problems concerning possible conflicts of jurisdiction, depending on when the second petition is filed. First, if a second petition is filed after the dismissal of the first petition, but while the first judge has retained jurisdiction to wind up the proceeding, then a theoretical conflict of jurisdiction could result under § 111 which gives the reorganization court exclusive jurisdiction of the debtor's property, wherever located, upon the filing of the petition. We are convinced, however, that this practical problem has a practical solution which prevents any unseemly conflict between different courts or different judges of the same court. The judge entertaining the second petition would merely refrain from exercising his jurisdiction over the property, as we did, until the restraining orders in the first proceeding were relaxed.\n\nThe crucial point is not the exercise of jurisdiction over the property, for, by a simple practical approach, that problem is easily resolved; rather, the real problem is seeking an interpretation of § 126 which will effectuate the language of that section as well as its purpose to thwart the concurrent prosecution of multiple petitions, and, if possible, also effectuate the purpose of Chapter X as a whole by eliminating in all cases any periods of hiatus in which the secured creditors might exercise their rights to levy on their security, but the unsecured creditors and stockholders would be unable to exercise their rights to seek reorganization, which rights Congress has deemed to be paramount. If we interpreted § 126 as not permitting the filing of the second petition until judgment has been entered in the first proceeding, and if the first judge did relax his stay orders prior to the signing of a judgment, the creditors and stockholders would be powerless. Our interpretation of § 126 is, we feel, consistent with the language of the statute and the primary abuse with which Congress was concerned in enacting § 126, and in addition leaves no hiatal period under any circumstances. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nThe second practical problem arises from the extreme contention that the second petition should not be filed until the time for appeal has expired. This position has even less merit. It is not at all arguable under the language of the statute because during the time for the running of the appeal, not only is there no petition pending, but usually no actual proceeding is pending. Section 126 petitions where the prior petition was alive and active, and the purpose of § 126 is well served by merely not allowing the filing of a second petition until the first petition is dismissed. This interpretation of the statute will eliminate the problems against which Congress directed its action. Tortured construction of the statute to reach the result of not permitting the filing of a second petition until the time for appeal from the judgment in the first proceeding has run adds nothing necessary to the resolution of the problem Congress faced, and indeed adds additional problems concerning the period of hiatus within which the rehabilitative purposes of Chapter X would be completely subverted.\n\nThe practical problem arises if the Court of Appeals reinstates the first petition. Again, conflict of jurisdiction may ensue between the courts or the two judges of the same court. The problem would be particularly acute when the second judge had taken substantial steps in his proceeding prior to reinstatement of the first proceeding. While it would seem that this situation would occur very infrequently, we cannot believe that, if it did occur, a practical solution similar to the one above could not easily be reached.\n\nIn conclusion, we believe that Congress meant what it said when it used the word \"petition\" in § 126, and we believe our interpretation of that section is consonant with the purposes for which it was enacted. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nIn the event we are wrong in our interpretation of § 126, and the petition should not have been filed until Judge Mitchell entered a judgment in his proceeding, we feel that sensible administration of the statute would require that we permit the petition to be deemed filed at such later time as might be proper. The broad general purpose of Chapter X is to effect corporate reorganizations, or failing that, to dismiss the petition or to adjudicate the debtor into ordinary bankruptcy. It is a remedial statute and it would be unseemly for us to become overtechnical and make the petitioners walk a tight rope in order to present a properly filed petition when they have made a good faith effort to abide by the requirements of § 126 and their effort is arguably in conformity with § 126. Such an approach - to deem the petition filed at the proper time - is not novel to the Bankruptcy Act as evidenced by § 147, 11 U.S.C. § 547, and would be consistent with the broad powers possessed by a reorganization court. If we were to hold here that this petition was improperly filed, the petitioners would simply file another one. It is certainly not sound administration of Chapter X to require that those seeking reorganization file petition after petition attempting to timely file one. Successive petitions and trusteeships over the debtor's property only detract from the purposes of Chapter X and add to the expense, as well as the delay, which is the primary concern of the secured creditors. When the proponents of reorganization are serious, as these petitioners are, a dismissal on technical grounds is of no benefit to anyone for the proponents are delayed in their request for relief; the objecting creditors will have their ends served only if the proceeding is finally dismissed on the merits, and the possibility of that dismissal is only delayed when successive petitions are dismissed before the merits are reached.\n\n(2) Res Judicata and Estoppel\n\nThe arguments of the opposing creditors that principles of res judicata and estoppel bar this petition are of little merit. The opposing creditors argued that because § 206 of the Bankruptcy Act, 11 U.S.C. § 606, gives all creditors the right to be heard \"on all matters arising in a proceeding under this chapter\" without securing a formal order of intervention, the petitioning creditors herein were actual parties to the former proceeding before Judge Mitchell and are bound by all matters decided in that proceeding and cannot now relitigate the same issues. We are in basic agreement with the principle of law urged by the opposing creditors that whoever was party to that litigation is bound by all matters decided in that litigation; however, we do not agree that it is applicable to the case at bar. Simply stated, the issues involved here are not the same as the issues presented to, and decided by, Judge Mitchell. Judge Mitchell was faced with the question of whether the petition filed by the debtor corporation was filed in good faith. We are faced with the question of whether the petition filed by the petitioning creditors was filed in good faith. Judge Mitchell's conclusion that the petition filed by the debtor corporation was not filed in good faith is not, and cannot be, res judicata on the issue of whether the creditors' petition was filed in good faith. This becomes clearer upon a brief examination of the concept of \"good faith\" and the matters decided by Judge Mitchell.\n\n\"Good faith\" is not affirmatively defined in the statute. Section 146 states four specific instances when a petition has not been filed in good faith. As we have stated elsewhere, however:\n\n\"[The] mere passage by a petition of the four negative tests in § 146, 11 U.S.C.A. § 546, does not assure that the petition will be found to have been filed in good faith, because that term contains unspecified general elements.\" In the Matter of Plaza Towers, Inc., 294 F. Supp. 714, 722, n. 8. (E.D.La.1967)\n\nAs evidenced by Judge Mitchell's findings of fact and conclusions of law, when the petition is filed for the purpose of delay and to enable the debtor to restrain and hinder its creditors, one of the \"unspecified general elements\" of good faith is lacking, and the petition must be dismissed. See 6 Collier on Bankruptcy P6.07[2] (14th ed.). We turn then to an examination of the matters decided by Judge Mitchell.\n\nJudge Mitchell did not find or conclude that any of the four negative tests of § 146 existed with respect to the petition allotted to him. Regarding these tests, it is important that we emphasize that he did not find or conclude that it is unreasonable to expect that a plan of reorganization can be effected for the debtor corporation. This is an important question facing us and one which was not resolved in the proceedings before Judge Mitchell. The crucial facts found to exist by Judge Mitchell were:\n\n\"XIX. The real purposes of this reorganization proceeding are: (1) to hold the debtor in its present status; (2) for delay; and (3) for the purpose of staying proceedings against subsidiary corporations. It is, therefore, not filed in good faith.\"\n\nAnd the crucial conclusion of law reached in that decision was:\n\n\"VIII. The petition of Southern Land Title Corporation was not filed in good faith under Section 141 of the Bankruptcy Act. The question of good faith is one to be determined by the Judge. The real purpose of these proceedings was to hold the debtor in its present status for the purpose of restraining, delaying and hindering its creditors and to escape from proceedings in other courts, and therefore, the petition was not filed in good faith.\"\n\nThus, it is abundantly clear that Judge Mitchell did not determine the issues which are presented in our case as he only decided that the petition of the debtor corporation was filed solely for the purposes of delay and therefore was not filed in good faith. It is hornbook law that res judicata is not applicable when the issues are not the same. Further, the fact that evidence was presented in our case to sustain the petition and none was presented in Judge Mitchell's case would justify our reaching a result contrary to Judge Mitchell even if the issues were the same, which they are not. In Re Peer Manor Bldg. Corp., 143 F.2d 769 (7th Cir. 1944), cert. den., 323 U.S. 757, 65 S. Ct. 90, 89 L. Ed. 606. In that case the debtor corporation filed a petition for reorganization under § 77B and a plan of reorganization was consummated. However, the debtor defaulted on its obligations once again, and another petition for reorganization was filed but this petition was filed by certain creditors and the indenture trustee. It was held by the Court of Appeals for the Seventh Circuit that the petition could not be maintained because the debtor was not a corporation since it had been dissolved by a state court decree and, therefore, it was not amenable to Chapter X which contemplates only the reorganization of corporations. In Re Peer Manor Bldg. Corp., 134 F.2d 839 (7th Cir. 1943). Subsequently, a new petition for reorganization of the same \"corporation\" was filed. The district court, feeling bound by the decision of the Seventh Circuit in 1943, dismissed the petition on the ground that no corporate entity existed. On appeal, however, the Seventh Circuit reversed the district court stating:\n\n\"[We] are satisfied that our decision on the previous appeal is not res judicata, nor are we bound by it as the 'law of the case.' The parties were not the same; the evidence was not the same; nor was the issue the same.\" 143 F.2d at 770.\n\nA close examination of the opinion, however, does not reflect that the issues were any different. Further, as far as we are able to determine from examining the opinions, the parties were the same. The only difference appearing from the opinions is in the evidence presented. In the second proceeding, the court was presented with evidence that although the corporation had been dissolved by a state court decree, it did continue to act in some capacity. This was held to justify a different result from the former proceeding which had presented only the naked legal issue. Thus, the case is strikingly similar to the case at bar. The fact that evidence was presented at the hearing in the case at bar to justify the good faith of the petition, whereas none was presented in Judge Mitchell's case, would alone preclude the res judicata effect of Judge Mitchell's decision, apart from the fact that res judicata is inapplicable because the issues are different.\n\nThe question might be asked, however, as we have asked ourselves: \"Since Judge Mitchell held that the petition in his case was filed solely for the purposes of delay and therefore was not filed in good faith, why shouldn't this Court hold the same even though res judicata is inapplicable?\" The answer and the reasons are readily apparent from the facts. While Judge Mitchell made his finding and reached his conclusion based upon all the facts of his case, his findings of fact and conclusions of law indicate that the main factors leading to his decision were the facts: (1) that the petition failed to include full and adequate financial reports regarding the debtor corporation; (2) that the petition claimed Southern Land owned \"equities\" in its six subsidiaries, which claim was unsupported by the annexed documents; (3) that the petition was filed the day before certain property was to be sold at a sheriff's sale; (4) that the debtor corporation and its subsidiaries were unable to meet their current operating expenses, taxes and insurance; (5) that all secured creditors at the hearing on February 3, 1967, opposed the petition; (6) that the debtor was unprepared to go forward with the hearing on January 12, 1967, on the question of whether the judge should approve the petition under § 141 of the Bankruptcy Act, 11 U.S.C. § 541; (7) that the debtor corporation later attempted to repudiate the stipulation entered into on January 12, 1967; and (8) that the debtor corporation offered no oral testimony at the hearing on February 3, 1967, to support its petition. The facts of Judge Mitchell's case are simply not the facts of our case.\n\nWe first note that the petition in our case was filed by creditors of Southern Land and its subsidiaries whereas Judge Mitchell's petition was filed by Southern Land. We think it only logical to require a stronger basis for concluding that an involuntary petition for reorganization is filed solely for purposes of delay than was shown in Judge Mitchell's case because it is more natural to suspect that a debtor's petition was filed for the purposes of delay than a creditor's petition. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nIn any event, all of the facts relied upon by Judge Mitchell do not exist in our case. Unlike Judge Mitchell's case, the petitioners in our case were prepared to go forward with the hearing on the \"good faith\" of the petition, and, unlike Judge Mitchell's case, both oral testimony and documentary evidence were offered in support of the petition. In fact, the hearing in this case lasted three days as compared to the hearings on good faith before Judge Mitchell which were very brief affairs. On one day the hearing before Judge Mitchell was simply continued due to the stipulation entered into by the petitioner in that case after the stipulation was dictated into the record. The only other hearing on good faith before Judge Mitchell consisted solely of oral argument, and much of that was concerned with whether certain counsel were entitled to address the court in light of their failure to file the statement required by § 210 of the Bankruptcy Act, 11 U.S.C. § 610. No evidence was introduced at the hearings before Judge Mitchell. Moreover, in our case, unlike Judge Mitchell's case, the petitioners never entered a stipulation that the proceeding would be dismissed if a financial commitment were not obtained within a specified period of time, and, needless to say, there was no attempt by the petitioners to repudiate such a stipulation as there had been in Judge Mitchell's case. Further, unlike Judge Mitchell's case, there was not unanimous opposition to the petition as only sixteen creditors, albeit clamorously, filed answers controverting the petition. Other creditors, both secured and unsecured, who have filed proofs of claim in the record have not voiced objection to the petition. At first blush, this seems strange but the explanation readily appears. Only the secured creditors present or represented at the hearing before Judge Mitchell on February 3, 1967, expressed unanimous objection. These creditors, for the most part, appear to be the same clamorous creditors who opposed the present petition. As just indicated, however, a far larger number of creditors, both secured and unsecured, have expressed no opposition to the petition. These differences in the facts and the absence of any other facts in our case which would indicate that the present petition was also filed for the purpose of delay are simply insufficient to support the conclusion that the present petition was filed solely for the purpose of delay and therefore was not filed in good faith.\n\nThe estoppel argument urged by the opposing creditors is also meritless. In part, it is premised upon the same argument urged in support of the res judicata argument - that because of § 206 of the Bankruptcy Act, 11 U.S.C. § 606, all of the petitioning creditors were parties to Judge Mitchell's proceeding and are therefore estopped from instituting the present proceeding - and largely falls with the res judicata argument. Additionally, the estoppel argument falls for at least two simple reasons. First, to hold that the petitioners were estopped to institute the present proceeding would completely frustrate the filing of successive petitions for corporate reorganization. This would create the intolerable situation, as illustrated by this very case, of foreclosing the right to creditors to seek reorganization when the corporation has first sought reorganization but was inept in presenting its petition. To argue that such creditors have the right to support the petition with their own evidence is to ignore practical realities for such creditors may well have placed confidence in the ability of the debtor corporation to support its own petition, and thus come unprepared to meet the issues. To preclude such creditors the opportunity to present their own petition merely because of their misplaced trust in the debtor corporation would seriously undermine the very purposes of Chapter X. Such a holding would likewise preclude the debtor corporation from filing its own petition for reorganization following an abortive petition of creditors. Additionally, such a holding would run contrary to the authorities cited above in which successive petitions were allowed.\n\nThe second reason is perhaps more direct. Section 59(h) of the Bankruptcy Act, 11 U.S.C. § 95(h), provides in pertinent part:\n\n\"A creditor shall not be estopped to act as a petitioning creditor because he participated in any prior matter or judicial proceeding, having for its purpose the adjustment or settlement of the affairs of the debtor or the liquidation of his property * * *.\"\n\nThe quoted portion of § 59(h) not being inconsistent with the provisions of Chapter X is applicable to reorganization proceedings by virtue of § 102 of the Bankruptcy Act, 11 U.S.C. § 502. 6 Collier on Bankruptcy P4.07[2], p. 797 n. 36 (14th ed.). A prior reorganization proceeding clearly falls within the broad language of § 59(h). Under § 59(h) the petitioning creditors are not estopped from filing the present petition merely because they participated in the prior reorganization proceeding.\n\nThe estoppel argument was also premised on the stipulation entered into in Judge Mitchell's proceeding. Apart from the issue of whether the stipulation was valid vel non, which has never been decided, and apart from the issue presented by the fact that some of the petitioning creditors herein were not present and were not represented by anyone when that stipulation was made, this aspect of the argument is also totally without merit for it completely distorts the doctrine of estoppel. Essentially, the stipulation entered into in Judge Mitchell's case was an agreement by the debtor corporation that it would agree to a dismissal of that proceeding and would not renew its petition if it failed to obtain a financial commitment within twenty days. The creditors, in turn, agreed in a general fashion to go along with that proceeding for the twenty days. The creditors in no way agreed to refrain from instituting further reorganization proceedings, and we are simply unable to see how any creditors would be estopped from seeking reorganization merely because the debtor agreed not to. Agreements in derogation of the right to seek reorganization are most strictly construed if, in fact, they are not void as contrary to public policy. The objecting bondholders in In Re Los Angeles Lumber Products Co., 24 F. Supp. 501 (S.D.Cal.1938) aff'd, 100 F.2d 963 (9th Cir. 1939), rev'd on other grds. 308 U.S. 106, 60 S. Ct. 1, 84 L. Ed. 110 (1939), argued that the debtor corporation was precluded from seeking reorganization by virtue of the terms of the trust indenture securing the payment of the bonds whereby the debtor corporation agreed to refrain from such action. Without deciding whether the language of the trust indenture constituted such an agreement, the court held that any attempted restriction on the right of the debtor to seek reorganization is void as against public policy. Further, and more pertinent to our decision, the court stated that the agreement made by the debtor would in no event prevent any of the bondholders from seeking reorganization of the debtor. Two other cases in which the language of an agreement was strictly construed in the face of the contention that the agreement precluded the creditors from instituting the reorganization proceedings were In Re Sponsor Realty Corp., 48 F. Supp. 735 (S.D.N.Y.1943) and In Re Hudson Coal Co., 22 F. Supp. 768 (M.D.Pa.1938). The certificate holders in the Sponsor Realty case agreed that all rights and powers respecting the debtor's property would be vested in the certificate trustee, and in the Hudson Coal case the bondholders agreed not to institute \"any suit\" except upon certain conditions which were not met. In the Sponsor Realty case the certificate holders were allowed to file a petition for reorganization in spite of the contention that they had surrendered that right, and in Hudson Coal the bondholders were permitted to file a petition for reorganization in the face of a similar contention. In both cases stronger grounds for estoppel existed than in the present case. It is clear that the stipulation entered into in Judge Mitchell's case in no way estops the petitioning creditors herein from seeking reorganization.\n\n(3) Petitioning Creditors\n\nThe standing of the petitioning creditors to maintain the petition in the instant case was also presented as an issue for our determination at the good faith hearing. The petition was filed by ten alleged creditors of Southern Land, namely, Emile G. Coci, Davis-Southern, Inc., Frederick M. Guice, H \u0026 H Construction Corporation, J. J. Krebs \u0026 Sons, Inc., Kalman, Rogers \u0026 Smith, Inc., The Archer Agency, Inc., Herman P. Stone, Jr., Henry L. Muller, and Leonard R. Spangenberg, Jr. Three of these petitioners withdrew as petitioning creditors prior to the good faith hearing, namely, Kalman, Rogers \u0026 Smith, Inc. and The Archer Agency, Inc., both of whom withdrew by motion and order of June 5, 1967, and Frederick M. Guice who withdrew by motion and order of July 21, 1967. A fourth petitioner, Henry L. Muller, withdrew by oral motion which was granted at the good faith hearing on August 8, 1967. In accordance with the Court's request in granting his oral motion, a written motion to withdraw was filed by Muller on August 9, 1967, and the written order allowing him to withdraw was signed on August 16, 1967. Consequently, for purposes of determining the issues with which we are now concerned, we must ignore the four petitioners who withdrew. We pause to note, however, that the withdrawal of these four petitioners does not in any way give rise to any inference supporting the opposing creditors' position, discussed at length below, that the petitioning creditors were merely parties interposed by the debtor corporation and, therefore, did not file the petition in good faith. These withdrawals were not tantamount to a dismissal of the petition and thus were quite proper. Under § 59(g) of the Bankruptcy Act, 11 U.S.C. § 95(g), \"withdrawal by one of several [petitioning creditors] will be permitted * * * where the interests of the co-petitioners and the other creditors will not be affected thereby.\" 3 Collier P59.35, p. 633 (14th ed.). This rule is equally applicable to Chapter X cases. 6 Collier PP4.09, 6.02[1]-6.05 (14th ed.). Inasmuch as six petitioning creditors who were able to sustain their claims remained, neither the co-petitioners nor any other interested parties were prejudiced by the withdrawal of these petitioners. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" While the motives underlying the withdrawals were known only to the withdrawing petitioners, several possible legitimate reasons motivating the withdrawals do come to mind which negate any inference of bad faith. In view of this fact, viz., that the withdrawals are not inconsistent with good faith, and in view of the propriety of the withdrawals under the law, in spite of the fact that our approval thereof may have been premature, these withdrawals do not in any way lend support to the position that the petition was not filed in good faith. Our conclusion in this respect can only be strengthened by the fact that each of the parties who withdrew as a petitioning creditor did file a proof of claim in the record. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\"\n\nThe issue as to whether the petitioners were actually creditors of Southern Land involves § 126 of the Bankruptcy Act, 11 U.S.C. § 526, which provides in pertinent part:\n\n\"[Three] or more creditors who have claims against a corporation or its property amounting in the aggregate to $5000 or over, liquidated as to amount and not contingent as to liability * * * may * * * file a petition under this chapter.\"\n\n\"Creditor\" is defined in § 106(4) of the Bankruptcy Act, 11 U.S.C. § 506(4), as \"the holder of any claim.\" And, as defined in § 106(1) of the Bankruptcy Act, 11 U.S.C. § 506(1), \"claims\"\n\n\"* * * shall include all claims of whatever character against a debtor or its property, except stock, whether or not such claims are provable under section 63 of this Act and whether secured or unsecured, liquidated or unliquidated, fixed or contingent.\"\n\nFor purposes of § 126, the definitions in §§ 106(1) and (4) are governing rather than the definitions in ordinary bankruptcy. Price v. Gurney, 324 U.S. 100, 65 S. Ct. 513, 89 L. Ed. 776 (1945); In Re Sponsor Realty Corp., 48 F. Supp. 735 (S.D.N.Y.1943); In Re Pittsburgh Terminal Coal Corp., 30 F. Supp. 106 (W.D.Pa.1939), aff'd, 109 F.2d 1020 (3rd Cir. 1940); In Re R.A. Security Holdings, Inc., 46 F. Supp. 254 (E.D.N.Y.1942), aff'd sub nom., 134 F.2d 164 (2d Cir. 1943). The definition of \"claim\" is of greater importance for our purposes because a creditor is defined as the holder of a claim, and it was not seriously disputed that the petitioners were the holders of their respectively alleged claims. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" As Collier has stated: \"The word 'claims' as defined in § 106(1) is sweeping in scope.\" 6 Collier on Bankruptcy P2.05, p. 311 (14th ed.). Indeed, Judge Brown, now Chief Judge of the Fifth Circuit, has stated: \"Unlike ordinary bankruptcy in which claims are confined to those specified in § 63, 11 U.S.C. § 103, a reorganization covers creditors claims of every conceivable kind.\" Avery v. Fischer, 360 F.2d 719, 724 (5th Cir. 1966). However, a contingent claim, although within the definition of § 106(1), does not fall within the ambit of § 126. With these basic principles in mind, we turn now to an examination of the claims held by the petitioning creditors.\n\n(1) Emile G. Coci. His testimony revealed that he has several claims against Southern Land for money which he loaned to the corporation. In 1961 he loaned $35,500 to Southern Land which is evidenced by a note for that sum which was executed by Sam Recile for Southern Land and which is dated December 8, 1961. It is a bearer note, and Coci is the bearer and owner, and he has owned it since it was executed. The note is payable in twelve monthly installments with the final installment due thirteen months after December 8, 1961. Nothing has been paid on that note, and the amount is due and owing.\n\nHe also loaned $21,000 to Southern Land which is evidenced by a note for that sum which was executed by Sam Recile as president for Southern Land and which is dated March 1, 1966. It is a bearer note payable on demand, and Coci is the bearer and owner, and he has owned it since it was executed. Nothing has been paid on that note either.\n\nIn addition, Coci testified that he borrowed $25,000 from the National American Bank, for which he signed a note, and loaned the funds to Southern Land. This was evidenced by a deposit slip which the bank issued on March 9, 1966, which reflects that the $25,000 deposit to the account of G. Brian Corporation \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" were the proceeds of a check drawn by Coci. The bank possesses the original deposit slip, and failed to produce it when called upon to do so by counsel for the petitioning creditors. Hence, we admitted a photostatic copy of the deposit slip into evidence and relegated the \"best evidence\" objection to the weight of the evidence rather than to the admissibility of the deposit slip. We are satisfied from Coci's testimony and from the \"second best evidence\" that he did make the $25,000 loan to Southern Land. We are also satisfied that Southern Land still owes him this amount even though he testified that he had a note evidencing the indebtedness, yet failed to produce the note. Normally, we would not view with favor the testimony of a witness who testified as to a debt which he claimed was owing to him and which was evidenced by a note if the note was not produced. The surrounding circumstances in this situation, however, convince us that he does have a claim against Southern Land for that amount. Coci originally testified on Friday, August 4, 1967. He testified that he had claims in excess of $50,000 against Southern Land for money loaned to that corporation and that he had notes evidencing that indebtedness. He did not have any documentary evidence of his claims with him at the hearing on Friday. He was requested to obtain such evidence overnight and produce it in Court on Saturday morning when the hearing resumed. The evidence which he did produce substantiated the testimony which he gave on the day before and thus proved his testimony to be reliable and credible. His testimony was proved correct in other respects also, as for example, his testimony that Southern Land had no bank at that time, which fact was corroborated by the stipulation regarding the testimony of Judlin Girot, the trustee's accountant, and which the Court independently verified with the trustee. These factors lend credence to his other testimony. In view of his testimony, which we credit, his failure to produce all of the documentary evidence on but one night's notice cannot be deemed fatal. Also, we must not lose sight of the fact that the issue facing us at this point is whether he has a claim against Southern Land. The proof of this issue is not strapped with the same stringencies as the proof required to merit a judgment on a note. Two other factors in addition to Coci's testimony support our finding that the $25,000 loan which Coci made to Southern Land is still outstanding. One is the fact that Southern Land has made no payments on the two earlier notes for $35,500 and $21,000 which it had given to Coci. It is logical to reason that if Southern Land had not paid these earlier obligations, it had not paid an obligation which it later incurred. The other factor is that the bank has sued Coci on the $25,000 note which he executed in order to make the loan to Southern Land. Again, it is logical to reason that if Southern Land had made any payments on that obligation to Coci that he would have applied them to the note rather than default on it.\n\nFinally, Coci testified that he and Louis Davis borrowed $26,000 on a note from the National American Bank and loaned it to Southern Land. This was evidenced by a credit advice which the bank issued on June 1, 1966, reflecting that the proceeds of the loan of Coci and Davis were credited to the account of G. Brian Corporation. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" Because the bank had possession of the original of the credit advice and failed to produce it upon demand by counsel for the petitioning creditors, a photostatic copy of the credit advice was admitted into evidence over the \"best evidence\" objection which was again relegated to the weight of the evidence. We are not satisfied, however, from the evidence presented that Coci has a claim on this loan against Southern Land. His testimony with respect to this loan was simply not as direct and clear as his testimony regarding the other loans. The loan was made to Southern Land from the proceeds of the note taken out by Coci and Davis, yet it may well be that Coci was only an endorser on the note which was not produced and thus, even though both he and Davis have been sued on the note, his liability on the note would be contingent as would his claim which would then not be within the purview of § 126 which excludes contingent claims. 6 Collier P4.07[4], n. 61 (14th ed.). The documentary evidence does not quiet our doubt in this respect. In fact, it only compounds our doubt because item 83 on the memorandum prepared by C. Ellis Henican, President of Southern Land at the time the voluntary petition was filed, which memorandum was attached to the schedules filed with the voluntary petition in Judge Mitchell's case and which was introduced into evidence in this proceeding, indicates that the $26,000 was loaned to Southern Land by Louis Davis. With respect to this item, we feel that Coci has failed to sustain his burden of proof.\n\nBased on the above specific findings, the ultimate finding and conclusion that Coci is a creditor within the purview of § 126, and thus entitled to file the petition, is inescapable. Our ultimate finding regarding Coci's status as a creditor is further substantiated by other evidence not alluded to above. The parties entered into a stipulation regarding the testimony of Judlin Girot, the trustee's accountant. It was stipulated that although the debtor corporation's books were not up to date, they did reflect that Coci was owed $35,500 on a note dated December 8, 1961, and that he was owed $25,921.92 on open accounts for amounts due from Southern Land's predecessor known as Ole Square Corporation. This, of course, accords with our specific finding as to the $35,500 note. With regard to the $25,921.92, we were reluctant to make a specific finding as to that amount in view of Coci's failure to testify thereto. It may well be that since he only testified as to those sums involving notes, he overlooked this item which was on open account. But in any event, we did not deem it necessary to make a specific finding with regard to that sum in view of our other specific findings. Other evidence supporting our ultimate finding is found in the schedules annexed to the voluntary petition in Judge Mitchell's case (hereafter referred to as the \"schedules\"). These schedules were admitted into evidence subject to the objections that they are self-serving, unsworn statements, and that Henican, who prepared the memorandum attached to and made part of the schedules, was not available for cross examination. We now overrule the objections. The self-serving declaration objection is not applicable. McCormick on Evidence § 275 (1954). We know of no rule which requires documentary evidence to be sworn to prior to its admission. If such were the case, we would seldom receive documentary evidence. Further, Henican was available for cross examination and, in fact, was called on cross examination under F.R.Civ.P. 43(b) by lead counsel for the opposing creditors. Finally, the schedules form part of the record in the case before Judge Mitchell, and even if the schedules had not been introduced into evidence, we could take judicial notice of the contents of that record for evidentiary purposes, United States v. Marcello, 280 F. Supp. 510, 521, n. 4 (E.D.La.1968), although this is not to imply that we take judicial notice that the amounts reflected therein are the true amounts. No debts due to Coci were listed on the schedules themselves. However, the memorandum prepared by Henican was attached to and formed part of the schedules listing the assets, liabilities and financial condition of the debtor. We must thus consider the schedules and Henican's memorandum as one and not as separate items. Item 83 of Henican's memorandum indicates that Southern Land was indebted to Coci for $30,000 which he borrowed from the National American Bank for the use and account of Southern Land. Due to the disarray and inadequacy of the books and records kept by Southern Land, the fact that the amount indicated in Henican's memorandum as owed to Coci does not coincide exactly with any amount testified to by Coci is insignificant. In connection with Henican's memorandum, we must also remember that his investigation of the financial condition of Southern Land encompassed only the three months from September to December of 1966 when he was president. Obviously, he could not reconstruct the books and records of Southern Land in so short a period of time and become intimately familiar with all of Southern Land's debts. The fact that he had been counsel to the corporation prior to that time would not have afforded him the opportunity to acquire more detailed knowledge. The significance of Henican's memorandum is that it does indicate that Coci is a creditor of Southern Land. Henican's testimony bolstered his memorandum in this respect as he testified that he satisfied himself, as president of Southern Land, that Coci was a creditor of Southern Land and that the amount could have been greater than $30,000. All of this evidence corroborates Coci's testimony that he is a creditor of Southern Land and substantiates our ultimate finding in that respect.\n\n(2) Davis-Southern, Inc. The testimony of Louis C. Davis, President of Davis-Southern, Inc., which is an insurance company, and the documentary evidence introduced in connection with his testimony establish that Davis-Southern, Inc. has a claim against Southern Land. Davis-Southern, Inc. has a claim on a loan of $8,000 which it made to Southern Land on April 19, 1966. This is evidenced by an $8,000 note, dated April 19, 1966, payable on or before thirty days to Davis-Southern, Inc. The note was executed by Sam Recile as president of Southern Land. No payments have been made on the note in whole or in part, and it is due and owing.\n\nDavis also testified as to an alleged claim for $14,797.20 on unpaid insurance premiums. While Davis originally testified that he thought the unpaid premiums were about $5,000 or $6,000, the ledger cards of Davis-Southern, which were introduced into evidence, reflect that Southern Land owes Davis-Southern $14,797.20 on unpaid insurance premiums. We make no specific finding, however, with respect to the amount owed on unpaid premiums for reasons discussed below.\n\nAgain, the stipulation as to Girot's testimony, the schedules and Henican's memorandum and the testimony of Henican substantiate our finding as to the $8,000 claim and support Davis' testimony as to the unpaid insurance premiums. The stipulation regarding Girot's testimony shows that the records of Southern Land, insofar as they had been reconstructed, acknowledge the $8,000 note of April 19, 1966, and the existence of unpaid insurance premiums in the sum of $31,011.13. Likewise, the schedules reflect that Southern Land owes Davis-Southern the $8,000 note as well as $5,446.95 on accounts payable. Henican's memorandum, (paragraph 31), reflects that Southern Land owed Davis-Southern $46,566.98 on unpaid premiums as of September 13, 1966. Henican testified that Southern Land owed money to Davis-Southern. While it is obvious that Southern Land owes Davis-Southern the $8,000 note, we make no specific finding with respect to the amount owed on the unpaid insurance premiums. The figure which Davis testified was due and owing was as of June in 1967. The relevant date, however, is February 3, 1967. The ledger cards indicate that the balance declined from approximately $31,000 to $14,797.20 through payments by mortgagees and cancellations from February to June. The fluctuating balance well accounts for the discrepancies appearing in the evidence as to the amount of this alleged claim. While this does not disturb us, we do seriously question whether Davis-Southern is a creditor of Southern Land with respect to these unpaid premiums. Normally, insurance premiums are prepaid in whole or in part. If the premium is prepaid in whole, the insurer is not a creditor of the insured when the premium is again due, unless, of course, the insurer carries the insurance for a time without the payment of the premium. The policy is simply cancelled and the insured owes the insurer nothing even though the premium is said to be \"due\" on the policy. If, however, the parties enter a contract whereby the insurer will insure the insured for a specified period of time in return for periodic payments, three situations may develop. The insurer may cancel the policy at the outset for non-payment of premium and this may terminate or repudiate the contract in which event the insurer would not be a creditor of the insured even though the premium was \"due.\" If, however, the insurer cancels the policy for non-payment of premium and this does not terminate or repudiate the contract, he would have a claim against the insured on the contract and thus be a creditor. Likewise, if the insurer were to keep the policy in force in spite of the non-payment of premium, he would have a claim against the insured and thus be a creditor. Davis testified, and the ledger cards reflect, that the policies were cancelled upon the non-payment of premiums. We do not know, however, whether Davis-Southern had a contract of insurance with Southern Land or whether, if it had such a contract, the cancellations terminated or repudiated the policy or left Davis-Southern with a claim on the contract nor do we know whether Davis-Southern carried the insurance for a time after the premiums were not paid. Thus, even though Southern Land's insurance premiums were \"due,\" we are unable to say whether Davis-Southern is a creditor of Southern Land for purposes of § 126 insofar as the unpaid premiums are concerned. This, however, does not alter the fact that Davis-Southern, Inc. is a creditor of Southern Land insofar as the $8,000 note is concerned and is thus entitled to maintain the petition under § 126.\n\n(3) Leonard R. Spangenberg, Jr. Spangenberg, an architect, testified that Southern Land owes him approximately $125,000 for architectural services which he performed for Southern Land primarily during 1963-66. While he had no written contract or note evidencing his claim, a $27,000 lien which he recorded against certain property for services performed on that property when it was owned by Southern Land pursuant to his agreement with Southern Land was introduced into evidence. The $27,000 lien, which claim has not been paid, represents only a portion of Spangenberg's claim as he performed services on other property of Southern Land for which he has not been paid. The stipulation with respect to Girot's testimony shows that Southern Land's records indicate that Southern Land owes Spangenberg $92,974.47 for architectural services performed. Similarly, the schedules reflect that Southern Land owes Spangenberg $112,625. Likewise, Henican testified that Southern Land owes Spangenberg for architectural services which he performed.\n\nIt is clear that Spangenberg performed architectural services for Southern Land for which he was not paid and for which Southern Land owes him. While we are unable to make a finding with regard to the specific amount owed Spangenberg, it is clear that it is a substantial amount. He is clearly a creditor of Southern Land and entitled to maintain the petition under § 126.\n\n(4) J. J. Krebs \u0026 Sons, Inc. John M. Krebs, President of J. J. Krebs \u0026 Sons, Inc., is a registered land surveyor. His testimony and statement of account which was introduced into evidence establish that his firm performed surveying services for Southern Land primarily during 1963-66, for which Southern Land owed J. J. Krebs \u0026 Sons, Inc. the sum of $8,795.60 as of March 1, 1966. None of that amount has been paid. He also testified that his firm performed surveying services for Sotan, Inc., a wholly-owned subsidiary of Southern Land, on which Sotan owes his firm the sum of $13,998. He contends that Southern Land is liable to his firm for that amount by virtue of the fact that Sotan, Inc. is a wholly-owned subsidiary of Southern Land. While we accept as true his testimony with respect to the services performed for Sotan, Inc., we need not determine whether that constitutes a claim against Southern Land in view of the fact that J. J. Krebs \u0026 Sons, Inc. is clearly a creditor of Southern Land in the amount of at least $8,795.60 by virtue of the services performed for, and unpaid by, Southern Land and is thus entitled to maintain the petition under § 126. Krebs' testimony and statement of account are corroborated, and our ultimate finding in this respect is substantiated, by the stipulation with regard to Girot's testimony which shows that the records of Southern Land reflect that Southern Land owes Krebs' firm the sum of $8,795.60, and its subsidiaries owe Krebs' firm the sum of $13,998. Henican also testified that Southern Land owes money to J. J. Krebs \u0026 Sons, Inc.\n\nAt this juncture we should note that by motion and order of December 5, 1967, J. J. Krebs \u0026 Sons, Inc. withdrew as a petitioning creditor. As with the previous withdrawals of the other petitioners, this was quite proper, even more so for we had already conducted the good faith hearing, and it was clear that a sufficient number of petitioners had established their claims as creditors in order to maintain the petition under § 126. As with the other withdrawals, we are unable to draw even the slightest inference of bad faith on the part of the petitioning creditors from this withdrawal.\n\n(5) H \u0026 H Construction Corporation. Julian Hotard, President of H \u0026 H Construction Corporation, testified that Southern Land owes H \u0026 H Construction $536,826.97 for various construction work performed by H \u0026 H Construction for Southern Land primarily in 1965 and 1966 and for which H \u0026 H Construction has not received payment. However, a portion of the $536,826.97, as reflected by the schedules annexed to H \u0026 H Construction's own petition for reorganization, is owed to H \u0026 H Construction by Southern Land's subsidiaries. Hotard's testimony that H \u0026 H Construction has a claim against Southern Land for unpaid construction work was supported by the other evidence. The schedules reflect that Southern Land owes H \u0026 H Construction $413,101.45. Henican testified that Southern Land owes H \u0026 H Construction a substantial sum - at least a couple hundred thousand dollars on one construction job alone. In addition, the stipulation regarding Girot's testimony shows that the books and records of Southern Land reflect that Southern Land owes H \u0026 H Construction approximately $364,884.25. Further, as alluded to above, H \u0026 H has filed a petition for reorganization, which proceeding is Bankruptcy No. 67-678 and which is pending before Judge Mitchell, and the schedules filed with that petition indicate that Southern Land owes H \u0026 H Construction several hundred thousand dollars for construction work which it performed for Southern Land pursuant to its contracts with Southern Land. From all of this evidence, it is clear that H \u0026 H Construction is a creditor of Southern Land and that the amount of its claim is very substantial even though we are unable to make a specific finding as to the exact amount.\n\nA peculiar problem exists, however, with respect to the claim of H \u0026 H Construction. Subsequent to the initiation of the present proceedings, H \u0026 H Construction filed its own voluntary petition for reorganization on June 7, 1967, which proceeding, as indicated above, is presently pending before Judge Mitchell. Because a reorganization trustee had been appointed for H \u0026 H Construction, the opposing creditors moved to strike the testimony of Hotard, contending that only the trustee can assert a claim of a corporation in reorganization. We deny the motion to strike because Hotard, as president of H \u0026 H Construction, is certainly competent to testify as to the facts establishing the claim against Southern Land. However, we are still faced with the legal question of whether a petitioning creditor which has a reorganization trustee appointed in its own reorganization proceedings initiated subsequent to the time it filed the involuntary petition may be considered a creditor within the meaning of § 126 in the absence of an amendment to the petition substituting the trustee for the petitioning creditor. We see no reason to preclude § 126 creditor status in such a situation. H \u0026 H Construction joined in the present petition on the claim it holds against Southern Land prior to the institution of its own reorganization proceedings. The initial joinder of H \u0026 H Construction on the present petition was proper and valid. It cannot be retroactively destroyed by the fact that H \u0026 H Construction subsequently entered proceedings for its own reorganization. The only question is whether the petition must now be amended by substituting the trustee in H \u0026 H Construction's reorganization proceedings for H \u0026 H Construction. We think not. Under § 187 of the Bankruptcy Act, 11 U.S.C. § 587, the reorganization trustee has the same rights and powers as a trustee appointed in ordinary bankruptcy under § 44 of the Bankruptcy Act, 11 U.S.C. § 72. Under § 11(c) of the Bankruptcy Act, 11 U.S.C. § 29(c), a reorganization trustee \" may \" be permitted to prosecute any suit commenced by the debtor prior to the approval of the petition. It is not, however, required that the trustee prosecute a suit formerly instituted by the debtor. It is quite proper for the trustee to permit the debtor to continue the prosecution of the suit. Meyer v. Fleming, 327 U.S. 161, 66 S. Ct. 382, 90 L. Ed. 595 (1946); 1 Collier on Bankruptcy, P11.10 (14th ed.). The Meyer case was strikingly similar to our case in that in Meyer a stockholder of a corporation filed a claim on behalf of the corporation against another corporation which was in bankruptcy proceedings. Subsequently, the stockholder's corporation filed a petition for its own reorganization and the corporation in bankruptcy proceedings objected to the claim filed by the stockholder on the same ground urged here that the trustee was the only proper party to assert the claim. The Supreme Court held that the claim could be prosecuted even if the trustee did not join the prosecution of the claim. It is clear, then, that the petition need not be amended to show that the trustee is prosecuting the claim on behalf of H \u0026 H Construction for it is quite proper for H \u0026 H Construction to prosecute this claim itself. We note, further, that the trustee for H \u0026 H Construction has not sought to withdraw the claim and has indicated to the Court that he does intend to prosecute the claim.\n\n(6) Herman P. Stone, Jr. Herman Stone, an accountant, testified that Southern Land owed him $16,666.64 on a contract he entered with Southern Land. The contract, which was in the form of a letter agreement, dated July 31, 1964, shows that Southern Land placed Stone on an annual retainer of $25,000. Stone was to render accounting services to Southern Land. As part of its consideration, in addition to the $25,000 annual retainer, Southern Land furnished Stone with a rent-free apartment, a rent-free office, and a new 1965 Lincoln Continental automobile. Although Stone failed to produce his office records, apart from the letter agreement, to support his claim, his failure to do so was adequately explained by the fact that his records were missing and presumably stolen. His testimony was bolstered by the stipulation regarding Girot's testimony which shows that the books and records of Southern Land reflect unpaid billings by Stone to Southern Land under the contract in the sum of $16,666.64. The schedules also indicate that this amount is owed to Stone. We are satisfied from the evidence that Stone is a creditor of Southern Land, but we do not believe that it is for the sum of $16,666.64. Stone ceased to render accounting services to Southern Land about the end of August 1966. He testified, however, that he continued to live in the rent-free apartment and continued to occupy the rent-free office. The rental value of the apartment is about $150 per month, and the rental value of the office would also be at least that much. These amounts for the number of months which he received the rent-free facilities subsequent to August of 1966 must be credited against his claim for the unpaid portion of the contract.\n\nIn finding that Southern Land has failed to pay Stone a portion of its consideration under the contract for which Stone rendered accounting services, we have not overlooked Henican's testimony that, as president of Southern Land, he disputed Stone's claim in toto. Henican's bald and unexplained testimony that he \"disputed\" Stone's claim does not rebut the direct and clear testimony of Stone that he performed accounting services for Southern Land under the contract for which he was not compensated. We find Stone's testimony to be reliable and credible. He readily admitted that although he had long ceased to render accounting services for Southern Land, he did continue to live in the apartment provided by Southern Land and occupy the office provided by Southern Land without paying any rent. A witness attempting to mislead the Court would not so readily testify on such matters. He further testified that his duties were of a supervisory nature over the eight or ten people in Southern Land's accounting department, and that both Peat, Marwick \u0026 Mitchell and Ernst \u0026 Ernst examined Southern Land's books and records from time to time. We have independently verified these facts through the trustee. In addition to these indicators establishing the credibility of Stone's testimony, his testimony was corroborated by the other evidence alluded to above. We think it is clear that Stone rendered accounting services under the contract for Southern Land for which he was not paid. We are unable to cast aside these established facts upon the vague statement by Henican that he disputed the legal validity of Stone's claim, assuming for the moment only that a legally invalid claim would be defective for § 126 purposes. Without some elaboration by Henican, we do not think it incumbent upon Stone to have established any additional facts because the facts which he did establish clearly show that he is a creditor entitled to maintain the petition under § 126 and no other facts were adduced in rebuttal.\n\nThe above findings from the evidence produced by and on behalf of the petitioning creditors clearly and definitely establish the requisite \"three or more creditors\" having claims against Southern Land aggregating \"$5,000 or over\" to maintain the petition under § 126. We pause at this point to comment on other aspects of the evidence relating to the petitioners' claims which we refrained from discussing above so that we could there present our most crucial findings with respect to the petitioners' claims in a concise fashion, free of the several collateral issues which cropped up and which we now discuss.\n\nThe evidence adduced at the hearing upon which our findings are based with respect to the petitioners' claims did not coincide exactly in most instances with the allegations of the petition as to the amount of the claims, and in some instances did not coincide exactly as to the nature of the claims. This, however, has no significance whatsoever. The significant fact is that the petitioning creditors were able to prove at the good faith hearing that they are, in fact, creditors of Southern Land. This is the very purpose of the good faith hearing. The slight discrepancies which do exist between the pleadings and the proof have no bearing whatsoever on the issue as to the petitioners' status as creditors within the meaning of § 126. Further, although the allegations and the evidence did not precisely and entirely coincide, no such great variation existed which would lead us to infer that the petitioners were jockeying with technicalities or otherwise playing fast and loose with the Court, and accordingly we are unable to draw any inference of bad faith from the variations between the petition and the hearing. It does not even impress us as being particularly strange that the variations in this case do exist because, generally speaking, the petitioners proved the existence of more claims than they pleaded. In pleading that they were creditors there was no necessity that they plead every claim they had against Southern Land, but when their status as creditors was attacked, prudence would suggest the proof of as much as possible.\n\nActually, the existence and validity of the petitioners' claims is not subject to serious dispute in view of the evidence presented. Several additional aspects of the evidence \"merit\" comment. At the hearing counsel for the opposing creditors injected the issue of whether the $35,500 note claimed by Emile Coci and the claims of Leonard Spangenberg in their entirety were barred by prescription. If he had been successful in showing that those claims were barred by prescription, it would have presented for our determination, at least insofar as Spangenberg is concerned the intriguing and apparently novel question of whether a claim which is barred by the statute of limitations falls within the definition of § 106(1) of the Bankruptcy Act and within the meaning of § 126 of that Act. We have found only two cases dealing with this problem in a reorganization context, but both were decided under Chapter X's predecessor, § 77B. In Re 69th \u0026 Crandon Bldg. Corp., 97 F.2d 392 (7th Cir. 1938), cert. den., 305 U.S. 629, 59 S. Ct. 93, 83 L. Ed. 403 (1938), indicated that the statute of limitations would have to be pled as a defense in the controverting answer. We could not adhere to that view in light of the purpose of the good faith hearing and the prevailing view liberally allowing amendments to the pleadings in bankruptcy which is discussed in another context below. Mount Forest Fur Farms of America, Inc. v. Farnsworth, 92 F.2d 342 (6th Cir. 1937), held that petitioning creditors whose claims were barred by the statute of limitations could not maintain an involuntary petition for reorganization under § 77B because such claims are not provable. At that time, however, § 77B required that petitioning creditors have provable claims whereas this is no longer a requirement under § 106(1). 6 Collier on Bankruptcy, P4.07[3] (14th ed.). The question, while new to Chapter X, has arisen in ordinary bankruptcy proceedings, and Collier points out that the authorities are in conflict. 3A Collier on Bankruptcy P63.07 (14th ed.). He suggests that the view that such claims are not provable is the better rule. Accepting his view it may seem to indicate - reasoning with beguiling simplicity - that such claims would be within § 106(1) inasmuch as that section includes claims whether or not they are provable. We do not, however, express a view one way or the other on this question inasmuch as we have not thoroughly analyzed the problem and inasmuch as we are not faced with that question because neither Coci's $35,500 note nor Spangenberg's claims are barred by the statute of limitations.\n\nWith regard to the $35,500 note held by Coci, the entire note, by its terms, became due and payable without notice upon the default on the first installment on January 8, 1962. Thus, under Article 3540 of the Louisiana Civil Code, the note prescribed five years from January 8, 1962, assuming that it was unsecured and assuming that prescription was not interrupted under Louisiana law. The note would then prescribe on January 8, 1967. However, under § 261 of the Bankruptcy Act, 11 U.S.C. § 661, prescription was suspended upon the filing of the voluntary petition for reorganization of Southern Land and its subsidiaries on December 7, 1966. Inasmuch as that section suspends prescription during the pendency of a \" proceeding \" in Chapter X \"until it is finally dismissed,\" prescription never commenced running on the note again because by the time Judge Mitchell finally dismissed that proceeding on April 26, 1967, this proceeding was pending. (We emphasize \"proceeding\" to avoid needless discussion on the obvious distinction between this situation and that with which we were initially concerned in this opinion.) Moreover, even if this note had prescribed, it would not affect Coci's standing as a creditor inasmuch as he had other viable claims against Southern Land. Thus, the motion made at the hearing to strike Coci's testimony in its entirety, insofar as it was based on the assertion that the $35,500 note was prescribed, is totally and completely without foundation and must be denied on that basis even apart from the fact that the motion was never renewed after being deemed premature.\n\nSpangenberg testified that the unpaid services which he performed for Southern Land occurred mainly in 1963 through 1966 and that a portion of the debt was over three years old. He also testified that he had no notes for the debt nor any written contract. Based on this, counsel for the opposing creditors endeavored to characterize the debt as one on an open account and therefore prescribed by three years under Article 3538 of the Louisiana Civil Code. However, Spangenberg also performed substantial architectural services, for which he was not paid, for Southern Land within three years prior to the filing of this petition and the voluntary petition before Judge Mitchell. Thus, even if we assume that the claims of Spangenberg could be characterized as an open account as contended, and we in no way intimate that they may be so characterized, and thus subjected to the three-year prescriptive period as contended, and further assume that prescription had not otherwise been interrupted under Louisiana law, Spangenberg would not be barred from § 126 creditor status, if indeed § 126 does bar from creditor status those whose claims have prescribed, because of the debts accruing within three years of filing the petition. E.g., Maggio v. Papa, 206 La. 38, 18 So.2d 645 (1944); Ritchie Grocer Co. v. Dean, 182 La. 518, 162 So. 62 (1935).\n\nCounsel for the opposing creditors did not inject the question of prescription into any other claims of the petitioning creditors. Therefore we need not consider whether any of those claims are barred by prescription. We feel that in accordance with F.R.Civ.P. 8(c), which is applicable to this proceeding by virtue of General Order in Bankruptcy 37 and in accordance with Article 927 of the Louisiana Code of Civil Procedure, it is incumbent upon the parties opposing the reorganization petition to inject prescription as an issue by pleadings or by evidence and that the petitioning creditors are not required to prove that their claims are not barred by prescription unless it is presented to us as an issue. This is not to say of course, that if the evidence established that a claim was barred by prescription, we would ignore it merely because the opposing parties failed to urge it upon us. The evidence in this case, though, offers no suspicion of prescription. Further, had any such possibility existed, we feel confident that it would have been urged upon us by counsel for the opposing creditors who vociferously opposed practically everything at the hearing and constantly strained at gnats in contesting the status of the petitioning creditors. Nor, in our opinion, would counsel's spirit of advocacy be dimmed by our initial rulings against him as easily evidenced by his repeated offers of proof at the hearing on identical issues on which he had already received adverse rulings.\n\nAnother collateral aspect of the evidence involves the question of whether Emile Coci did, in fact, loan money to Southern Land or whether he loaned money to G. Brian Corporation, and whether Davis-Southern loaned money to Southern Land or to G. Brian Corporation. More specifically with reference to Coci, the question involves the $21,000 and the $25,000 loans he made to Southern Land. On the $21,000 loan to Southern Land, Coci wrote a check for that amount payable to G. Brian Corporation. Counsel for the opposing creditors objected to the introduction of that check into evidence even though it would support his position that the funds were loaned to G. Brian Corporation and not to Southern Land. G. Brian Corporation, although not a subsidiary of Southern Land, was Southern Land's rental agency and was dominated and controlled by the principals of Southern Land. Coci emphatically testified that the loan was made to Southern Land, not G. Brian Corporation, and that the check was written to G. Brian Corporation upon the request of Frank Spalitta only because Southern Land did not have an active checking account. From the evidence presented at the hearing, which we verified through the trustee and his accountant, we know that Southern Land did not have an active checking account and that its funds were handled through G. Brian Corporation's account. In fact, from the knowledge which we have gleaned during the course of these proceedings as to Southern Land's cavalier methods of financing, this fact does not puzzle us in the least nor cause any consternation whatsoever. In view of this and in view of Coci's most emphatic testimony - and we found him to be a credible witness - and in view of the fact that the $21,000 loan is evidenced by Southern Land's note in that amount which is prima facie evidence, we do not have the slightest hesitancy in finding that the loan was made to Southern Land. We make the same finding with respect to the $25,000 loan to Southern Land which was deposited in G. Brian Corporation's account. Consequently, we now deny the motion made at the hearing to strike Coci's testimony insofar as it was based on this issue and even apart from the fact that the motion was never renewed after being deemed premature. Although we also believe that the $26,000 loan claimed by Coci was made to Southern Land, we have not found that alleged loan to be a claim of Coci for a quite different reason. In finding that the loans were made to Southern Land, and not to G. Brian Corporation, we need not determine, as urged at the hearing, whether Recile, as president of Southern Land, was authorized to obligate that corporation for loans made to G. Brian Corporation.\n\nWith reference to the $8,000 loan made by Davis-Southern, Inc. to Southern Land, a certified check of Davis-Southern, Inc., which was endorsed to Philip James, counsel for Southern Land, was introduced. Again, counsel for the opposing creditors objected to the evidence favorable to them. Again, however, the witness testified that it was understood that the loan was to Southern Land. Again, Southern Land's note was given in exchange for the funds. Again, we unhesitatingly find that the loan was made to Southern Land. We might note at this point that nothing has led us to suspect that these funds were misappropriated, and we need not consider the issues which such a question would raise.\n\nFinally, in considering collateral issues, the overtures on behalf of the opposing creditors at the hearing regarding the possibility that Krebs' surveying services, or Stone's accounting services, or Spangenberg's architectural services were performed for Southern Land's subsidiaries or related corporations, and thus were not claims against Southern Land, withered completely in the wake of the evidence.\n\nFrom our findings with respect to the evidence produced at the hearing, we unhesitatingly conclude that this petition satisfies the requirements of § 126. We turn now to the crucial issue in this case of whether the petition was filed in good faith.\n\n(4) Good Faith\n\nThe most crucial issue raised for our determination by the answers filed herein is whether the petition was filed in good faith. As indicated above, good faith is not affirmatively defined in the statute, but § 146, 11 U.S.C. § 546, states four specific instances indicating when a petition has not been filed in good faith. The creditors opposing reorganization placed in issue each of the four negative tests in § 146. We must, therefore, examine the petition and the evidence supporting the petition in light of each of those negative tests. By the very terms of § 146, the petition must be deemed not to be filed in good faith if it fails to meet any one of the four tests established in that section. And the burden of sustaining good faith is on the proponents of the petition. Marine Harbor Properties, Inc. v. Manufacturers Trust Co., 317 U.S. 78, 83, 63 S. Ct. 93, 87 L. Ed. 64 (1942). We turn then to each of the four negative tests of the statute.\n\n(a) Section 146(1). Section 146(1) provides that a petition shall be deemed not to be filed in good faith if \"the petitioning creditors have acquired their claims for the purpose of filing the petition.\" The creditors opposing reorganization did not seriously contend that the creditors acquired their claims for the purpose of filing the petition. However, inasmuch as they strenuously labored to characterize the petitioning creditors as merely allies of the debtor corporation who were acting solely on the behalf of the corporation and not independently on their own behalf, and inasmuch as they expended considerable effort in fostering such insinuations through numerous innuendoes, we feel that § 146(1) has been placed in issue, tangentially, if not directly. The issue is quickly resolved, however. Each of the individual claimants testified that his claim was not acquired for the purpose of filing the petition. Representatives for each of the corporate claimants testified that the corporation's claim was not acquired for the purpose of filing the petition. This is obvious from the fact that the claims involved had arisen, in large part, in the ordinary course of business long prior to the date the petition was filed. The opposing creditors offered no evidence in contradiction other than many broadside innuendoes unsupported by any evidence. We easily find that the claims of the petitioning creditors were not acquired for the purpose of filing the petition and conclude that the petition satisfies the good faith requirement of § 146(1).\n\n(b) Section 146(3). Chapter X is a remedial statute designed to preserve as going concerns those corporations which are financially embarrassed and which are unable to satisfy their obligations. Chapter X affords a means whereby the harsh consequences of liquidation may be avoided through the restructuring of the corporate debt. The preservation of the corporate entity as an active concern is deemed beneficial to those financially interested in the corporation as well as the public and the economy as a whole and should, therefore, be effected whenever possible. Not all corporations, however, should be, or can be, preserved. Section 146(3) sets forth a practical guide whereby a court may determine at the outset when confronted with a petition seeking Chapter X relief whether a particular corporation may fall within the legislative policy of preservation and thus should be given the chance to show that, cleansed of its past financial sins, it will emerge as a productive entity or whether the court should bar Chapter X relief to a corporation and thus strangle its last chance for rehabilitation. Section 146(3) provides that a petition shall be deemed not to be filed in good faith if \"it is unreasonable to expect that a plan of reorganization can be effected.\" All that is required in order to afford the opportunities of Chapter X to a corporation is that it not be unreasonable to expect that the corporation may be reorganized.\n\nHerein lies the crux of this case. This was the issue argued most vigorously by the opposing creditors and the issue which presents the most serious question for our determination. Specifically, the creditors opposing reorganization contended that there was no \"equity\" in the debtor's property for either the unsecured creditors or the stockholders because the value of the debtor's property is less than its secured liabilities, that the earning power of the debtor was insufficient to meet its obligations as they mature, and that no plan could be proposed which would provide adequate protection for all of the creditors and stockholders of Southern Land. Based on these assertions, the creditors opposing reorganization argued that it is unreasonable to expect that a plan of reorganization can be effected, and therefore the petition was filed in bad faith and should be dismissed. Even if each of these three factual contentions were true, and we do not find that all three are true, it would not compel the legal conclusion that the petition was not filed in good faith within the meaning of § 146(3). These contentions overlook the restructuring process of reorganization and the capabilities of Chapter X.\n\nAs we stated in In the Matter of Plaza Towers, Inc., 294 F. Supp. 714 (E.D.La. 1967):\n\n\"For purposes of good faith it is not necessary to show that an equity may exist for the stockholders, or even for all classes of creditors.\" At 719.\n\nNot only is this clearly borne out under case law, e.g., Case v. Los Angeles Lumber Products Co., 308 U.S. 106, 60 S. Ct. 1, 84 L. Ed. 110 (1939); Oglesby \u0026 Simpson Supply Co. v. Duggan, 174 F.2d 904 (8th Cir. 1949); In Re Diversey Hotel Corp., 165 F.2d 655 (7th Cir. 1948), cert. den., 333 U.S. 861, 68 S. Ct. 739, 92 L. Ed. 1140 (1948); In Re Julius Roehrs Co., 115 F.2d 723 (3rd Cir. 1940); In Re Equity Co. of America, 115 F.2d 570 (7th Cir. 1940); In Re Castle Beach Apts., 113 F.2d 762 (2d Cir. 1940); In Re A.C. Hotel Co., 93 F.2d 841 (7th Cir. 1937); In Re Mortgage Securities Corp., 75 F.2d 261 (2d Cir. 1935); In Re Doyle Mfg. Co., 77 F. Supp. 116 (N.D.N.Y.1948); In Re St. Charles Hotel Co., 60 F. Supp. 322, 330 (D.N.J.1945), aff'd, 149 F.2d 645 (3rd Cir. 1945), cert. den., 326 U.S. 738, 66 S. Ct. 48, 90 L. Ed. 440 (dicta, as this case turned on § 146(4)); In Re 325 East 72nd Street, 53 F. Supp. 997 (S.D.N.Y.1944); but the very provisions of Chapter X, e.g., §§ 130, 179, and 216, 11 U.S.C. §§ 530, 579, and 616, contemplate its utilization by insolvent debtors. The opposing creditors forget that a plan of reorganization may adjust the rights of all the classes of creditors and stockholders and under proper circumstances junior creditor interests and stockholders may be excluded from any participation in the plan of reorganization. See e.g., Case v. Los Angeles Lumber Products Co., 308 U.S. 106, 60 S. Ct. 1, 84 L. Ed. 110 (1939); Consolidated Rock Products Co. v. Du Bois, 312 U.S. 510, 61 S. Ct. 675, 85 L. Ed. 982 (1941); In Re 620 Church Street Corp., 299 U.S. 24, 57 S. Ct. 88, 81 L. Ed. 16 (1936). It was in recognition of this fact that Judge Augustus N. Hand wrote for the court in In Re Central Funding Corp., 75 F.2d 256 (2d Cir. 1935), in holding that reorganization may be effected even though no equity remains in the corporation:\n\n\"A 'reorganization' does not necessarily presuppose the survival of the rights of stockholders or even of junior creditors, when they have become worthless, but may be a readjustment of the rights of lienors under a new corporate structure.\" At 259.\n\n\"The most frequent occasion for a reorganization is where only creditors' rights are to be adjusted * * *. To restrict the act to reorganization where the debtor has an equity, would be to deprive the section of much, if not most, of its usefulness.\" At 261.\n\nThus, as we appreciate the law, the petitioners, whether it be the debtor corporation or its creditors, are not required to establish that they have equity in the corporation or even that the debtor's assets exceed its first mortgage indebtedness in order to establish good faith under § 146(3), \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" the reason being simply, as indicated, that a plan of reorganization may well exclude those who do not have any equity in the debtor corporation and adjust the rights of those who do have some equity.\n\nAll that is required is that it be shown that the value of the corporation is such that it might be reorganized. Only if such value is lacking does § 146(3) demand dismissal of the petition. Such value is only lacking when the future earning power of the debtor is so bleak in comparison with its financial requirements that there is no possible chance of reorganizing the debtor as a viable corporation. In Re Rice-Varick Hotel Co., 184 F. Supp. 864 (D.N.H.1959), aff'd, sub nom., Goodman v. Michael, 280 F.2d 106 (1st Cir. 1960); \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" Breeding Motor Freight Lines v. Reconstruction Finance Corp., 172 F.2d 416 (10th Cir. 1949), cert. den. 338 U.S. 814, 70 S. Ct. 54, 94 L. Ed. 493 (1949); \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" Seaboard Terminals Corp. v. Western Maryland Ry. Co., 108 F.2d 911 (4th Cir. 1940); \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Provident Mutual Life Ins. Co. v. University Evangelical Lutheran Church, 90 F.2d 992 (9th Cir. 1937); \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" In re Southwest Enterprises, Inc., 261 F. Supp. 721 (W.D.Ark.1966); \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" In Re Liberty Mortgage Corp., 245 F. Supp. 858 (N.D.Ohio 1965); \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" In Re Ware Metal Products, 42 F. Supp. 538 (D.Mass.1941). \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" In determining whether the requisite value or equity exists, the emphasis must be on the future and the ability of the corporation to carry on in the future. The present financial straits of the debtor is irrelevant to the extent that it may be modified by reorganization for the very purpose of Chapter X is to modify and adjust the present stranglehold on the debtor in order that it may continue to operate. The present is relevant, however, as is the past, as an indication of what caused the debtor's floundering condition and what may be expected for the future. Unless the court is satisfied that the prospects for the future are so bleak that no chance for reorganization exists, it should not preclude those who petition from the opportunity to attempt reorganization. The petition is not to be dismissed for lack of good faith merely because the petitioners have no equity, as established by the above authorities; the petition is not to be dismissed for lack of good faith merely because the debtor is unable to meet its present obligations as they mature for this is exactly the cause of the need for corporate reorganization; the petition is not to be dismissed for lack of good faith merely because no plan of reorganization can be devised in which all of the creditors and stockholders may participate, as established by the above authorities. In urging their extreme arguments, the opposing creditors have simply chosen to overlook the very nature of corporate reorganization. At this stage, we must only be satisfied that a chance to reorganize the debtor corporation as a viable concern for the future does exist. Before turning to the facts of this case, we pause to consider one of the many sub-issues injected by the opposing creditors.\n\nWith respect to the financial data of the debtor, the petitioning creditors purported to incorporate and adopt by reference in their petition the schedules filed with the voluntary petition which was allotted to Judge Mitchell. The opposing creditors contend that this financial information does not satisfy the requirements of § 130(4) of the Bankruptcy Act, 11 U.S.C. § 530(4), which provides that every petition shall state \"the assets, liabilities, capital stock, and financial condition of the corporation,\" and that the issue is res judicata by virtue of Judge Mitchell's decision regarding the voluntary petition. In his case Judge Mitchell found:\n\n\"XV. The petition of the debtor corporation was not filed in compliance with Section 130 of the Bankruptcy Act, as neither it nor the exhibits attached thereto contained:\n\n(a) A Balance Sheet;\n\n(b) An Operating Statement or other evidence of the income of the corporation; and\n\n(c) Adequate information as to the financial worth and income potential of the subsidiary corporations, stock-ownership of which was alleged by debtor corporation to constitute a substantial asset.\n\n\"XVI. The petition of the debtor in disclosing assets relied upon 'equities' in stock ownership of six (6) subsidiaries. The so-called 'equities' were not supported by any of the documents annexed which, to the contrary, indicated that the major assets of the subsidiaries had been transferred or were subject to foreclosure.\"\n\nAnd Judge Mitchell concluded:\n\n\"VII. The petition of Southern Land Title Corporation, debtor corporation, does not comply with the requirements of Section 130(4) of the Bankruptcy Act. In Re Suburban Properties, Inc., 110 F.2d 438 (7th Cir. 1940); In Re Sheridan View Bldg., Corp., 149 F.2d 532 (C.A.7th 1945); Manati Sugar Co. v. Mock, 75 F.2d 284 (C.A.2nd 1935); In Re 325 E.72nd St., 53 F. Supp. 997 (D.C.N.Y.1944); Dudley v. Mealey, 147 F.2d 268, cert. den. 325 U.S. 873, 65 S. Ct. 1415 [89 L. Ed. 1991] (C.A.2nd 1945).\"\n\nWe cannot agree that Judge Mitchell's decision is res judicata for several reasons. The petition in his case was filed by the debtor corporation which is obviously better able to supply the court with such information than creditors such as those petitioning in our case. It is simply illogical to demand as much from creditors as from the debtor for that reason and for the further reason that the debtor's petition is naturally more suspect of improper motives than the creditors'. Collier indicates, however, that the standard should be the same for both debtors' and creditors' petitions. 6 Collier on Bankruptcy PP4.14[1], [5] (14th ed.). Normally, we would have to agree. But based on his premise, which was the basis of the reasoning of Congress, we must disagree in this case because the premise underlying the identical standard requirement is not present. The requisite data was not readily available to the creditors because not only is Southern Land not a large publicly-owned corporation but its books and records were inadequate and not nearly up to date nor are the petitioners harassing the debtor with an ill-founded petition without adequate basis, as evidenced by the fact that the debtor joined in the prayer for reorganization and by the fact that we are satisfied that an adequate basis for the petition does exist.\n\nFurther, and more importantly, there is no requirement for any specific item of financial data under § 130(4) or under the cases. The purpose of § 130(4), which we note is not jurisdictional, 11 Remington on Bankruptcy §§ 4432, 4434 (Rev. ed. 1961), is twofold: (1) to enable the judge to determine whether a need for relief under Chapter X does exist, and (2) to enable the judge to determine whether the petition is filed in good faith within the meaning of § 146(3). 6 Collier on Bankruptcy P4.14[5] (14th ed.). The petition must comport with the provisions of § 130(4), not for the esoteric sake of that section, but only to the extent that such information is necessary to fulfill the dual purposes of that section. The crucial question is whether the judge is satisfied that it is not unreasonable to expect that a plan of reorganization may be effected and not whether the petition itself conforms to any rigid formula. The petition should set forth such information as will satisfy the judge in making the crucial determination, but the petition may be amended, and leave to do so will freely be granted. Foust Investment Co. v. Crest Investment Trust, Inc., 382 F.2d 540 (4th Cir. 1967); Tucker v. Texas American Syndicate, 170 F.2d 939 (5th Cir. 1948); Kroell v. New York Ambassador, 108 F.2d 294 (2d Cir. 1939). The need for leave to amend is particularly acute, and leave must be even more readily granted, in this situation because the present petition was filed prior to the date on which Judge Mitchell rendered his findings of fact and conclusions of law, and the petitioners had no reason to believe that he would reach such a conclusion with regard to the financial information of the petition. The crucial determination rests, not solely on the petition, but on the evidence as well when, as here, a good faith hearing has been held. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" In re Equity Co. of America, 115 F.2d 570 (7th Cir. 1940); In re Peterson's Motor Exp., 84 F. Supp. 230 (D.N.H.1949). The cases relied upon by Judge Mitchell are not contrary but are all impliedly in agreement with this principle. Further, the petition is deemed amended in conformity with the evidence adduced in support thereof. In re St. Charles Hotel Co., 60 F. Supp. 322 (D.N.J.1945), aff'd, 149 F.2d 645 (3rd Cir. 1945), cert. den., 326 U.S. 738, 66 S. Ct. 48, 90 L. Ed. 440. The decision in St. Charles Hotel Co. that the petition is amended in conformity with the evidence is clearly demanded by F.R.Civ.P. 15(b) which is applicable to Chapter X proceedings by virtue of General Order in Bankruptcy 37. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" Finally, we must recall that Judge Mitchell never decided that it was unreasonable to expect that a plan of reorganization could be effected. In essence, then, Judge Mitchell's decision is not res judicata as to the crucial issue under § 146(3) which is only subserved by § 130(4) and the resolution of which must depend on the evidence as well as the petition. And inasmuch as the petition is deemed amended to conform to the evidence, the petition in our case is not the same as the petition in Judge Mitchell's case in which no evidence was introduced, and his decision is therefore not res judicata.\n\nWe proceed now to the facts. Inasmuch as we had become somewhat familiar with the debtor's operations during the several months the petition was pending prior to the good faith hearing through the proceedings in Plaza Towers, which is also one of Recile's corporations so to speak, and through continuous discussions with the trustee who was investigating the debtor's affairs throughout that period and through the many matters which were presented to the Court in these proceedings during that period, we deem it advisable to briefly relate the general background which does not appear of record. Sam Recile is a shrewd real estate promoter and a financial wizard who, reputedly, was a self-made millionaire in his early twenties. Through his many corporate enterprises, he has acquired numerous pieces of valuable property. Perhaps his strongest virtue is his ability to envision when others cannot. He has envisioned things for New Orleans which most had thought impossible but which are no longer considered so. Had all - or even a substantial portion - of his dreams materialized, New Orleans would have prospered with Sam Recile, for most of his ventures, if successful would benefit the city. The Plaza Towers, at forty-five stories the tallest building in Louisiana, which is also pending before us in reorganization, appears headed for success and is substantial proof of that statement. While it is located a few blocks from the central business district of New Orleans, Plaza Towers' completion will inevitably attract additional businesses and should eventually serve as a principal business hub. Recile's strongest vice, however, appears to be impatience. While his ventures would no doubt prove successful if carried through, he seldom gave them a chance before overmortgaging them for funds to embark on a new adventure. Therein proved the collapse of the \"empire\" and the necessity for reorganization. The assets, while largely revenue-producing rental properties for which New Orleans exudes considerable demand, staggered under the large debt service, and default was inevitable. While it does not appear certain, even at this time, whether or not Recile would personally and directly benefit by successful reorganization, it has been conceded that the City of New Orleans would be considerably benefited.\n\nThe original petition itemizes forty-one separate properties owned by Southern Land valued collectively at $8,869,315. It also reflects equities in the six wholly-owned subsidiaries of Southern Land in the total amount of $18,302,000. Thus, total assets listed in the petition are allegedly valued at $27,171,315. Alleged liabilities include $6,383,296.18 unpaid mortgages, $2,118,394.15 collateral mortgages and notes payable, $637,185.29 accounts payable, $129,226.64 unpaid taxes, and $63,000 unpaid interest, for total liabilities of $9,331,102.26, which ostensibly leaves a net equity in Southern Land of $17,840,212.74. The petitioners offered numerous appraisal reports in support of the valuations contained in the petition. The creditors opposing reorganization objected to the introduction of the appraisal reports on the ground that the appraisers were not available for cross-examination. We permitted the introduction of the appraisal reports subject to the objection, and we now overrule the objection. We are sitting as a court of equity endeavoring to determine whether the doors of Chapter X should be opened for the debtor corporation. This determination, by its very nature, is somewhat discretionary, and the Court must be guided by all the means available to it. As indicated below, we are by no means strictly restricted to a consideration of that which is formally introduced into evidence, although the evidence, of course, is certainly the most important consideration by far. This being true, to preclude the petitioners from introducing these appraisals merely because the appraisers were not available for cross-examination would, in our opinion, be excessively restrictive. We feel that it is our duty to consider all that is relevant to the issue at stake, and these appraisals are certainly relevant. We are not trying to determine, and the petitioners do not have to establish, the precise valuation of the debtor's property. Indeed, we believe that would be impossible. We are only trying to determine whether a chance of reorganizing the debtor does exist, and in resolving that question we must consider everything bearing on the debtor's financial status. We are, however, by no means ignoring the fact that the appraisers were not available for cross-examination, and that fact weighs heavily with us as to the probative value of their appraisal reports. We are merely holding that the appraisals are admissible for purposes of the good faith hearing.\n\nAdmittedly, we do not have financial evidence supporting each and every one of the debtor's properties. Indeed, had such evidence been produced, the hearing would undoubtedly have dragged on for weeks in view of the tenacious and enduring struggles in Court which did occur on relatively simple matters. We have, however, been furnished with sufficient evidence with respect to certain properties to enable us to conclude that the petitioners sustained their burden of proof. Considerable evidence exists with respect to the apartments known as the Butterfly Terrace No. 1 and the Crescent Arms No. 1, and we think it significant to examine that evidence in some detail.\n\nThe petition claims a value for the Butterfly Terrace No. 1 of $516,000 and a value of $415,058 for the Crescent Arms No. 1. The Butterfly Terrace is an apartment complex containing thirty-two apartments. A lengthy, comprehensive and detailed appraisal was rendered by an M.A.I. appraiser and another appraiser on January 20, 1964, as to the value of the project then to be constructed. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" The appraisal was rendered for the American Mortgage Corporation. Using the three M.A.I. accepted approaches - market data, cost or summation, and income or economic - it was appraised at $1,200,000. Based on this appraisal, the National Bank of North America (formerly Meadow Brook National Bank) loaned $600,000 on a first mortgage for the construction of the apartment complex. It is significant at this point to note that before accepting the offering of American Mortgage Corporation to purchase the mortgage, the National Bank of North America demanded an appraisal by a qualified M.A.I. appraiser \"satisfactory to the Bank.\" In addition to this requirement, the Bank demanded that its loan be not more than 66 2/3% of the value of the property with improvements. The Bank was apparently satisfied with the reliability of the appraisers and that the property was worth at least $900,000, and we doubt seriously that a sophisticated investor of the stature of the National Bank of North America, a New York bank, would invest in illusory hope. The Butterfly Terrace No. 1, however, fell upon difficult times once constructed. It was subject not only to vandalism but to the ravages of fire as well. Hence it was that the debtor did not attribute to it nearly as much value as its original potential indicated. In fact, it came on for disclaimer on the petition of the National Bank of North America on July 21, 1967, and August 4, 1967. The Bank introduced the appraisal of a qualified appraiser indicating that the Butterfly Terrace No. 1 was then worth $200,000. Of the total thirty-two apartments, eight had been rendered completely uninhabitable due to vandalism and fire. Photographs of the complex indicate that it was in a general state of disrepair - so much so that only six of the apartments were rented at that time. The appraisal reflects that the appraiser actually felt that it was worth about $280,000 but he was subtracting from that amount the estimated $80,000 required to remedy the fire and vandalism damage and the general state of disrepair. A question existed at the time as to whether the damage would be covered by insurance repairs, and if it were, then the Butterfly Terrace No. 1 would have been worth $280,000 according to the Bank's appraiser. We pause here to note that we do not accept this appraisal as the accurate value of the Butterfly Terrace No. 1. C. Ellis Henican competently testified at the good faith hearing that local appraisers in general do not make an objective appraisal based on the facts, but rather on what they think their clients are looking for. Counsel for the Bank had requested this appraiser to make this appraisal only a few days before the hearing on the disclaimer. Consequently, just as we do not accept as absolutely accurate the appraisals offered by the petitioners, neither can we accept this appraisal. In fact, we have our own independent suspicion of this appraisal inasmuch as a sale of three lots adjacent to the sixteen lots on which the Butterfly Terrace No. 1 is situated, shortly prior to the time the Bank's appraisal was made, shows the value of the land alone to be about $200,000. Parenthetically, we note that the original appraisal on which the loan was based indicated the value of the land alone to be $200,000. The appraisal proffered by the Bank was countered with a qualified appraisal reflecting the value of the Butterfly Terrace No. 1 to be $516,194. The trustee's testimony indicated that the value of the Butterfly Terrace No. 1 was closer to the value attributed by the debtor although somewhat less since he testified that the unpaid principal balance on the Bank's mortgage, which was approximately $572,000, exceeded the value of the apartment complex by an excess of $80,000. We have found the trustee to be most reliable in these matters which is attributable to his keen business ken and his unbiased attitude. Inasmuch as the mortgage exceeded the value of the property, the Butterfly Terrace No. 1 was disclaimed on August 8, 1967.\n\nIt is, of course, quite proper for us to many matters such as this which transpired in this proceeding prior to the good faith hearing even though they might not formally be introduced into evidence at the good faith hearing. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" This is because at all stages of a reorganization proceeding the court is primarily concerned with the possibilities which exist for reorganization in light of its knowledge of the situation. In any event, the significance of the Butterfly Terrace No. 1 is clear. The debtor's valuation of its property, while inflated, is not \"grossly exaggerated\" as contended by the creditors opposing reorganization. In fact, the debtor's values appear to be more realistic than the values claimed by the opposing creditors.\n\nThe Crescent Arms No. 1 has a story similar to the Butterfly Terrace No. 1. The original appraisal by the same appraisers of the Butterfly Terrace No. 1, with the same approaches for the same purposes, attributes a value of $848,000 for the proposed project. The National Bank of North America advanced the sum of $420,000 for construction under the same strict conditions. The Crescent Arms No. 1, located in a low-income neighborhood, encountered unusual problems of general upkeep and was valued by the debtor at less than its expected worth. It, too, came on for disclaimer with the Butterfly Terrace No. 1, and the same appraiser for the National Bank of North America, who valued the Butterfly Terrace No. 1 at $200,000 valued the Crescent Arms No. 1 at $85,000 for the Bank. Again, the Bank's appraisal was countered with a qualified appraisal showing the value to be $415,058. In this instance, the trustee's reliable, knowledgeable, and unbiased valuation placed the value of the Crescent Arms No. 1 in the middle of the two extremes. As its indebtedness exceeded its value, the Crescent Arms No. 1 was disclaimed with the Butterfly Terrace No. 1.\n\nOther appraisals offered by the petitioners were uncontroverted by evidence from the opposing creditors. The Butterfly Terrace No. 3, which had not been confronted with the peculiar difficulties which plagued the Butterfly Terrace No. 1 and the Crescent Arms No. 1, was appraised in December of 1965 after it had already been constructed and had been in operation for some time. Its lowest appraised value, through the three accepted approaches, was $1,350,000 which is somewhat less than the $1,595,750 valuation placed on it by the debtor. Bearing in mind that the appraiser was not available for cross-examination, the documentary evidence, which was admitted the Sun Life Assurance Company of Canada was satisfied, after a rather extensive investigation, that the property was adequate security for a $1,000,000 loan which it advanced to Southern Land in the Spring of 1966. We simply cannot ignore the valuation evidenced by a sophisticated institutional lender after a thorough investigation. The evidence supporting the valuation of the apartment complex known as the Crescent Arms No. 4 at $253,422 is even stronger. The project was appraised at $478,400 prior to its construction by a qualified M.A.I. appraiser. Another institutional investor, the National American Life Insurance Company, was satisfied that the property was adequate security for the loan of $243,000 which it made to Southern Land. The National American Life Insurance Company required an appraisal by an M.A.I. appraiser satisfactory to the insurance company and also required that the loan be no more than two-thirds of the value of the property, just as the National Bank of North America required for its loans. This evidence supports the debtor's valuation of the Crescent Arms No. 4 which has not encountered the problems of the Crescent Arms No. 1 or the Butterfly Terrace No. 1. It reflects that the debtor's valuation of its property is far from \"grossly exaggerated.\"\n\nMoreover, the petitioners adduced evidence supporting the valuation of Southern Land's equity in its subsidiaries. The petition reflected a net equity in the six wholly-owned subsidiaries of $18,302,000. The evidence indicated that a greater equity may exist in the subsidiaries. The pro forma balance sheets of each of the six subsidiaries, which were attached to their own petitions for reorganization filed herein on June 19, 1967, were introduced into evidence subject to the same objections by the opposing creditors which were made with respect to the memorandum prepared by Henican, discussed supra, and the further objection that the balance sheets purport to be as of December 15, 1966, and the relevant date is February 3, 1967. We now overrule the objections. Just as the opposing creditors' objections regarding Henican's memorandum were invalid, so they are invalid with respect to these balance sheets for the same reasons. Further, although Henican did not prepare his memorandum under oath, the subsidiaries' petitions were filed under oath by Recile who swore that the facts contained therein were correct, and he could have been called for examination by the opposing creditors had they desired to do so. The additional objection that the balance sheets are inadmissible because of their dates is totally without merit for there is no requirement that a balance sheet must be prepared as of the date the petition is filed, and it would be patently absurd to so hold.\n\nThe subsidiaries' balance sheets reflect a total net equity \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" exceeding $36,000,000. The most substantial value of the subsidiaries is obviously the right of Sotan and Five Flags, two of the subsidiaries, to reclaim extremely valuable property, which they formerly owned, from the present owners. The petitions of Sotan and Five Flags readily reveal that this property has been conveyed, and the balance sheets of Sotan and Five Flags are based on the assumed fact that they would be reclaimed. Evidence was produced which readily demonstrates the value of the property which might be reclaimed. Sotan formerly owned approximately 13,000 acres of unimproved property across the Mississippi River from Baton Rouge, Louisiana. A landplanning expert testified as to the industrial growth and expansion of the Baton Rouge area and as to the extremely desirable features of the \"Sotan Properties.\" The property is rendered attractive by virtue of the fact that it is serviced by all modes of transportation. It is bisected by seven miles of the Intracoastal Canal, which gives it fourteen lineage miles of frontage on the Canal, and thus has the same water facilities as afforded by the Mississippi River but without the disadvantages of the River. This, of course, is ideal for industrial purposes. Additionally, railroad transportation is available to the property. Finally, it has direct access to the Interstate system of highways and with the opening of the new bridge across the River in Baton Rouge, it is now easily accessible to that city. This, of course, makes the property attractive for residential purposes, as well as commercial purposes. The opening of the new bridge in Baton Rouge will provide the opportunity for the development of that area similar to the tremendous development which occurred on the West Bank of New Orleans some years ago when the Greater New Orleans Bridge was opened. And it was pointed out how Baton Rouge was geographically ready to expand to that area. It is readily evident that the mere location of the property gives it great value in spite of the fact that it is not yet developed. While we are not prepared to place a value on the Sotan Properties, the testimony reflected that a figure of $1,000 an acre would be low and that a figure of $3,000 an acre might be more realistic as the present valuation of the property. This would place the value of the Sotan Properties within a range of $13,000,000 to $39,000,000. Henican's testimony corroborated the testimony of the land-planning expert. Moreover, there is a reasonable possibility, as far as oil exploration goes, that valuable oil deposits are located beneath the property as reflected by the testimony of a geologist. If the land does prove to contain oil, its value would be fantastic. Apart from this possibility, however, it certainly appears that the property has substantial present worth and, if reclaimed, it would afford considerable equity to Southern Land which owns all of the stock of Sotan, even if it did not approximate the $24,660,507.12 equity reflected in Sotan's balance sheet.\n\nFive Flags formerly owned the building at 225 Baronne Street and claims to have a right to reclaim that building. The building is a modern, high-rise, office building located in the center of the business district of New Orleans. It is valued at $17,500,000 by the debtor, which is not controverted by the opposing creditors, and that appears to us from the evidence to be not an unrealistic valuation and one which would afford Southern Land an equity of $3,654,475.73 in Five Flags according to its balance sheet. The only question regarding it is whether it can be reclaimed.\n\nIn Plaza Towers we had occasion to discuss a similar situation in some detail, and no need exists for a further general reiteration of our views in this respect. Suffice it to say that to brush aside these possibilities of reclamation at the very outset as being too \"iffy\" without an opportunity for their investigation and reflective consideration would, in our opinion, possibly result in a great injustice when, as here, the property would afford considerable equity for the junior creditors and stockholders. In the Matter of Magnolia Park, Inc., Bankruptcy Docket No. 9010, E.D.La., discussed in Plaza Towers, and which involved strikingly similar circumstances, is ample illustration that caution in such a matter is advisable. In fact, the subsequent facts in this proceeding have demonstrated the wisdom of our decision in this respect. Suits have been filed, subsequent to the good faith hearing, to reclaim the Sotan Properties, and the 225 Baronne Street Building is also the subject of a reclamation suit which was initiated subsequent to the good faith hearing although on a basis different from that which was originally asserted. In fact, the evidence which has been adduced in the suit to reclaim 225 Baronne, which is being tried before us, shows that a good chance of success exists for the reclamation of the building. Further, and similar to Magnolia Park, the parties are earnestly negotiating at present for the compromise of the suit. This demonstrates precisely the point we are making - that such possibilities cannot merely be totally ignored for purposes of § 146(3) especially when it is clear that the properties do enhance the debtor's financial situation.\n\nWith respect to the other subsidiaries of Southern Land, no evidence other than the verified balance sheets of those subsidiaries was produced by the petitioners and no evidence whatsoever was produced by the creditors opposing reorganization except with respect to the Bourbon Kings Hotel Corporation. The major asset of Bourbon Kings is the Bourbon Orleans Hotel which is located in the heart of the French Quarter in New Orleans. The debtor attributed a value of $12,500,000 to the hotel and a net equity for Southern Land in the corporation of $6,805,099.40. This appears to be the only claimed equity which is \"grossly exaggerated\" inasmuch as the testimony of Henican indicates that the Bourbon Orleans is worth about $7,000,000. Yet even if the hotel were worth only $6,000,000, it would still afford an equity for Southern Land in Bourbon Kings.\n\nIn addition to the forty-one separate properties listed on the voluntary petition of Southern Land, which was made part of the petition in the instant proceeding, Southern Land and Bourbon Kings have acquired through the trustee, subsequent to the filing of the present petition, twenty-four additional properties from Gulf South Realty Corporation. This property is commonly referred to as the \"Gulf South Properties.\" Southern Land and Bourbon Kings had conveyed this property to Gulf South Realty Corporation shortly prior to the institution of the reorganization proceedings. In view of the circumstances and the time of the transfer, the corporations had an alleged right to reclaim the properties just as they have with the Sotan Properties and 225 Baronne Street which were also transferred shortly prior to the institution of the reorganization proceedings. Parenthetically, and in general terms, we might note that the reason for these various transfers was to stave off demanding creditors inasmuch as the property in its overmortgaged condition was unable to generate sufficient income to satisfy all the obligations. In any event, in recognition of its vulnerable position and to avoid litigation, Gulf South agreed to reconvey the properties to the trustee, reserving only the right to claim the value of its improvements in the property and the right to proceed against the National Bank of North America for $225,000 which were the entire cash proceeds of the sale and which were distributed to the National Bank of North America at the time of the sale, and we entered an order effecting the reconveyance to Southern Land and Bourbon Kings on August 5, 1967. We pause to note that at the time the present petition was filed, all the debtor had with respect to this property was the possible right to reclaim it. In fact, this right was not even listed as an asset by the debtor corporation in its petition or by the creditors in their petition. Yet, events subsequent to the filing of the petition proved the realization of what had only been a possibility. This further highlights the necessity for weighing the reclamation possibilities of Sotan and Five Flags in our determination of the § 146(3) issue.\n\nWith regard to the value of the Gulf South Properties, the trustee, after personally examining all of the Gulf South Properties and conferring with others as to their value, testified at the reclamation hearing that the reclamation of the Gulf South Properties would offer substantial equity to the debtor inasmuch as the aggregate value of the properties exceeded their total mortgages of $6,563,454.35. He indicated that some of the property offered no equity to the debtor but that such property could be disclaimed and the bulk of the property would then be advantageous in effecting a plan of reorganization and could be retained for such purposes or could be sold for more than its indebtedness in order to furnish working capital for the debtor. The trustee's testimony thus corroborated the appraised value of this property. Appraisals for one-third of the Gulf South properties indicate a value of $3,230,400 for that portion of the Gulf South properties. Not only does the trustee's testimony reflect that the valuation afforded by the appraisals was not \"grossly exaggerated\" but the loans by the National Bank of North America of $1,609,650 on these eight properties to Southern Land based on the same strict requirements that an appraisal by an appraiser satisfactory to the Bank be conducted and that the loans be for not more than two-thirds of the value of the property also indicate that the valuations are not grossly excessive.\n\nIn addition to the foregoing matters, the petitioners offered into evidence the Recile filed under Chapter XII of the Bankruptcy Act, which petition bears Bankruptcy No. 67-702 and was allotted to us. Paragraph 9 of the petition therein alleges a complete disclaimer of Recile's personal estate to and for the benefit of the creditors of Southern Land and Plaza Towers after payment from his assets of his own personal creditors. The exhibits to that petition show that, excluding Recile's contingent obligations in a large aggregate amount based upon his accommodation endorsements of corporate obligations of Southern Land and Plaza Towers, he has $811,121.10 in personal debts against $6,607,500 in value of claimed personal assets. While we must also consider the possibility of this benefit to Southern Land, in truth we have not accorded much weight to this possibility.\n\nWith respect to the liabilities of Southern Land, Henican testified that, in general, he thought that the liabilities of Southern Land and its subsidiaries were around $35,000,000. The balance sheets for the subsidiaries indicate that the liabilities of the subsidiaries alone approach $34,000,000, which amount includes liabilities of about $23,000,000 which would be added in if the Sotan Properties and the 225 Baronne Street Building were reclaimed, and the evidence with respect to the liabilities of Southern Land indicate that it has debts slightly in excess of $9,000,000. Thus, the debtor admits total liabilities of approximately $43,000,000, and we find this to be extremely realistic.\n\nAs indicated above, the petitioners bear the burden of proof. We think they have sustained that burden. As reflected in the foregoing discussion of the evidence, the creditors opposing reorganization did little more than object constantly and profusely to the petitioners' evidence. The opposing creditors produced little, if any, evidence to support their contention with respect to the debtor's financial condition. As indicated above, the determination under § 146(3) is to be made based upon the petition and the evidence. \"The court may be satisfied that the petition is filed in good faith in the absence of offer of proof to the contrary.\" Manati Sugar Co. v. Mock, 75 F.2d 284, 285 (2d Cir. 1935). We are satisfied from the petition, from the evidence in support thereof, and from the lack of evidence to the contrary that it is not unreasonable to expect that a plan of reorganization can be effected.\n\nThe appraisals offered to support the petition, while somewhat inflated, reflect that the value attributed to the debtor's property is not \"grossly exaggerated.\" The fact that sophisticated investors such as the National Bank of North America and others made substantial loans based on two-thirds of the value of the debtor's property is also evidence of the value of the debtor's property. In addition, the testimony of the trustee on numerous occasions reflected that the valuations were far from \"grossly exaggerated.\" From this evidence, produced as to certain of the debtor's property, we can draw the reasonable inference in the absence of contrary evidence that the same would be true with respect to the other property listed in the petition. Cf. In Re Bush Terminal Co., 10 F. Supp. 315 (E.D.N.Y.1935). And we must not forget that the Gulf South Properties, discussed above, were not even listed in the petition as assets of the debtor. They were reclaimed, however, at the time of the good faith hearing and promised to contain considerable equity for the junior creditors and stockholders. The fact that subsequent events have proven that not as much equity existed with respect to the Gulf South Properties as originally anticipated has no bearing on the issue at point since subsequent events cannot affect the original determination under § 146(3). In Re Riddlesburg Mining Co., 224 F.2d 834 (3rd Cir. 1955); In Re Chapman Coal Co., 196 F.2d 779 (7th Cir. 1952); In Re Technical Marine Maintenance Co., 169 F.2d 548 (3rd Cir. 1948). \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" With respect to the subsidiaries, the stock of which is an asset of Southern Land, the great value of the 225 Baronne Street Building is obvious and uncontradicted, and the evidence was clear and uncontradicted as to the qualities of the Sotan Properties which gives that property great value.\n\nJust as we were unable to place a precise valuation on the debtor's assets in Plaza Towers, supra, we are unable to place a precise valuation on the assets of Southern Land. It is not necessary, however, that we do so. It is clear that the value of the assets is not illusory, nor is the value grossly exaggerated. Even apart from the possible reclamation of 225 Baronne Street and the Sotan Properties there may well be equity in the assets of Southern Land for its stockholders and junior creditors. At this stage we are unable to say that it is unreasonable to expect that a plan of reorganization can be effected \"until the creditors, stockholders and the public have had an opportunity of knowing with certainty the financial status of the debtor.\" In Re Doyle Mfg. Corp., 77 F. Supp. 116, 119 (N.D.N.Y.1948). A somewhat similar situation arose in In Re Riddlesburg Mining Co, 224 F.2d 834 (3rd Cir. 1955), wherein it was stated:\n\n\"Opinion as to the value of the assets, which had been considered very valuable a few years prior to the filing of the petition, were contradictory and varied greatly. From this difference of opinion as to the debtor's assets and the extent of its liabilities the district court concluded that a reasonable chance of reorganization existed.\" At 836.\n\nThe Third Circuit Court of Appeals upheld the lower court's decision. In the Riddlesburg Mining case, unlike here, substantial evidence in contradiction was produced. Moreover, even if it turns out that the junior creditors and the stockholders of Southern Land have no equity in the debtor's assets, that would not necessarily demand our holding that it is unreasonable to expect that a plan of reorganization can be effected as we pointed out above. The petitioners concentrated on establishing the value of the debtor's property and thus that equity does exist for the junior creditors and stockholders. Thus, they did not address themselves to the income-producing aspect of Southern Land which would be important if no equity existed. However, inasmuch as the bulk of Southern Land's property is rental property, and much of it is primely located in the French Quarter, we have no doubt that it is quite capable of producing an operating income in view of the demands existing in New Orleans for rental property and thus that restructuring of its onerous debt service demands through reorganization would permit Southern Land to emerge as a viable, beneficial and productive corporation.\n\nIn reaching our conclusion we have also considered, as indicated above, the possibility of reclaiming the Sotan Properties and the building at 225 Baronne Street. If these possibilities materialize, and although unknown and unconsidered at the time it now appears that the reclamation of 225 Baronne Street will materialize, considerable equity should exist for the junior creditors and stockholders of Southern Land.\n\nIn addition to the evidence which was produced relating to the debtor's financial status, other factors indicate that it is not unreasonable to expect that a plan of reorganization can be effected. One such factor is the small number of creditors opposing the petition. At least 165 alleged creditors of Southern Land have filed proofs of claim in the record or with the trustee. Their claims total in excess of $34,000,000. Yet only sixteen, or less than ten per cent, of the creditors oppose reorganization. Their claims, as reflected by the proofs of claims, total in excess of $12,000,000, or about one-third of the total alleged indebtedness of Southern Land. Further, it appears that not all sixteen opposing creditors are actually creditors of Southern Land but rather are creditors of various of its subsidiaries. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" This substantially decreases the percentage of the indebtedness of Southern Land which is opposed to reorganization. Moreover, many of the creditors who do not oppose reorganization are secured creditors. In fact, the voluntary petition of Southern Land in the proceedings before Judge Mitchell reveals at least twelve creditors holding first mortgages who do not oppose the present petition. It is, of course, quite proper that we take this into account in determining whether the petition was filed in good faith. E.g., In Re Riddlesburg Mining Co., 224 F.2d 834 (3rd Cir. 1955); In Re Diversey Hotel Corp., 165 F.2d 655 (7th Cir. 1948), cert. den. 333 U.S. 861, 92 L. Ed. 1140, 68 S. Ct. 739 (1948); In Re Loeb Apartments, Inc., 89 F.2d 461 (7th Cir. 1937); In Re Doyle Mfg. Co., 77 F. Supp. 116 (N.D.N.Y.1948).\n\nMoreover, we have a high regard for the sincerity of counsel for the petitioning creditors, Mr. Cicero Sessions, who is an esteemed member of the local bar. We have always found him to be exceptionally conscientious and candid in his representations to the Court in other matters. His sincere representations to the Court that Southern Land may be reorganized is a factor we should consider under § 146(3). In Re Diversey Hotel Corp., 165 F.2d 655 (7th Cir. 1948), cert. den. 333 U.S. 861, 68 S. Ct. 739, 92 L. Ed. 1140 (1948), demonstrates that it is quite proper to consider the representations of those in whom the court places confidence through its prior experience with such individuals. In the same vein, we must also consider the opinion of the trustee in this matter, Albert J. Ward, Jr. We appointed Mr. Ward trustee in this matter because he is a highly successful businessman with substantial experience in real estate in this area, being the owner and operator of a sizeable lumber yard and a sash and door company, as well as owning and renting about fifty apartments and an office building and having successfully subdivided numerous tracts of land resulting in the development of approximately 800 to 1,000 lots of real estate, and because the Court is personally aware of his absolute integrity. Further, the trustee has consistently displayed to the Court an unbiased position throughout these proceedings. For these reasons we greatly respect the opinion of the trustee. The trustee had over three months after our approval of the petition prior to the good faith hearing to investigate the property owned by Southern Land and its subsidiaries. He immersed himself totally and completely in his duties as trustee, frequently sacrificing the demands and wellbeing of his own enterprises to fulfill his tremendous responsibility as trustee in this matter. He repeatedly expressed his enthusiastic and sincere belief to the Court at the time of and prior to the good faith hearing that a real and genuine possibility of successfully reorganizing Southern Land did exist. To ignore his opinion in this matter would be to evince a callous disregard of the provisions of Chapter X which holds in high esteem the office and functions of a disinterested trustee and would be to forsake the invaluable service performed by Mr. Ward who has fulfilled his office with exceptional skill.\n\nThe trustee's well-qualified opinion and Mr. Sessions' sincere representations that it was not unreasonable to expect that a plan of reorganization could be effected were fortified by the fact that at the time of the good faith hearing responsible parties had already expressed an interest in reorganizing the debtor corporation. It is also quite proper to consider this fact in determining the issue presented by § 146(3). E.g., In re Omega Aircraft Corp., 209 F. Supp. 649, 651 (D.Mass.1962). This interest subsequently manifested itself in the form of a $25,000,000 commitment from Hughes Aircraft Company, an enterprise of the fabulously wealthy Mr. Howard Hughes, and the presentation of a plan of reorganization originally submitted by the Hanover Corporation on September 11, 1967. As indicated above, the fact that this plan later fizzled in December of 1967 has no bearing on our initial determination. We simply cannot substitute hindsight for the matters which were known at the time of the good faith hearing.\n\nMoreover, we have already indicated the importance of this matter to the community of New Orleans. We believe this should also be taken into consideration. That the public importance of the matter should be considered was fairly implied in In re Doyle Mfg. Corp., 77 F. Supp. 116 (N.D.N.Y.1948). In this case it has been conceded that a successful reorganization of Southern Land would benefit New Orleans substantially and that a failure would be considerably detrimental to the economy of the City. Further, we are not unmindful of the close connexity between this case and the Plaza Towers, wherein we sustained the petition even though the Plaza Towers had not yet been completed, and the original discussions indicating that an \"englobo\" plan of reorganization could be devised for the reorganization of Plaza Towers, Southern Land and its subsidiaries. This factor, while not of great weight, should nevertheless be given some consideration.\n\nAdditionally, similar to Plaza Towers, there has been no showing that the value of the security for the senior secured creditors would be impaired by the delay inherent in Chapter X proceedings. One creditor opposing reorganization, the National Bank of North America, claimed in its answer to the petition that its rights would be affected because the property securing its claim was deteriorating. Even assuming this to be true, it offers no impediment to our decision. It would be most unreasonable to deny the benefits of Chapter X to a corporation merely because a very small portion of its property is deteriorating when it appears, as it does here, that the bulk of the debtor's property may be reorganized. The remedy in such a situation is to sustain the petition and permit the deteriorating property which is nonessential to a plan of reorganization to be disclaimed upon a petition brought by the secured creditor or the trustee or any other interested party. In this fashion the rights of no one are damaged. We are not implying by any means in this holding that it is proper to sustain a petition which contemplates liquidation at the outset. Fidelity Assurance Ass'n v. Sims, 318 U.S. 608, 63 S. Ct. 807, 87 L. Ed. 1032 (1943). But when a petition is filed and it appears that overall the corporation is capable of reorganization we must take into cognizance the reorganization process and that property which is onerous and burdensome to the estate, as deteriorating property would be when the infusion of rejuvenating capital is unlikely, may be abandoned and disclaimed. The right to reorganize should not be foresaken merely because a small portion of the debtor's property should be abandoned. And when, as here, the bulk of the security is not deteriorating the delay inherent in reorganization is no impediment. In the matter of Plaza Towers, Inc., 294 F. Supp. 714 (E.D.La.1967); Detroit Trust Co. v. Campbell River Timber Co., 98 F.2d 389 (9th Cir. 1938); White v. Penelas Mining Co., 105 F.2d 726 (9th Cir. 1939); In Re East Boston Coal Co., 30 F. Supp. 811 (M.D.Pa. 1940). If it were a barrier to reorganization, there would hardly ever be a reorganization. In fact, as indicated in the Detroit Trust Co. case, even if all of the secured property may decline in value, it erects no absolute bar to reorganization.\n\nIn reference to this position taken by the National Bank of North America, which has been by far the most vehement in opposing this reorganization, we wish to further note that by the conclusion of the good faith hearing two of the properties which secured its loans had already been disclaimed to it. Further, the additional disclaimers which have been made to it were upon petitions brought by the trustee and not by the Bank although it could have brought such a petition at any time. Finally in this connection, we note that the Bourbon Orleans Hotel which is an asset of Bourbon Kings and not Southern Land and which secures the bulk of the indebtedness to the Bank certainly does not appear to be declining in value.\n\nBearing all of these factors in mind, we believe that \"the status of the debtor corporation [has been shown] to be such that it cannot be said that the prospects for reorganization are so remote that it is not worth a few additional months' delay to give the trustee time to propose a plan of reorganization.\" In the Matter of Plaza Towers, Inc., 294 F. Supp. 714, 720 (E.D.La.1967). \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" Moreover, as we also stated in Plaza Towers at 720: \"[If] at * * * any [later] stage of this proceeding it becomes apparent that no plan can be effected, the requested relief will be quickly denied.\" \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" Having determined that it is not unreasonable to expect that a plan of reorganization can be effected, we now consider §§ 146(2) and (4).\n\n(c) Sections 146(2) and (4). Section 146(2) of the Bankruptcy Act, 11 U.S.C. § 546(2), provides that a petition is not filed in good faith if \"adequate relief would be obtainable by a debtor's petition under the provisions of Chapter XI of this Act.\" Section 146(4) of the Bankruptcy Act, 11 U.S.C. § 546(4), provides that a petition is not filed in good faith if \"a prior proceeding is pending in any court and it appears that the interests of creditors and stockholders would be best subserved in such prior proceeding.\" The creditors opposed to reorganization registered only a perfunctory challenge to the petition on the basis of these two provisions and did not seriously urge that the petition should be deemed not to be filed in good faith under these provisions, and the petitioning creditors did not produce evidence specifically addressed to these formal issues. Neither issue, however, presents a substantial question for our determination as both are easily resolved under the general facts of this proceeding.\n\nA reading of the three leading Supreme Court decisions, SEC v. American Trailer Rentals, 379 U.S. 594, 85 S. Ct. 513, 13 L. Ed. 2d 510 (1965); General Stores Corp. v. Shlensky, 350 U.S. 462, 76 S. Ct. 516, 100 L. Ed. 550 (1956); and SEC v. U.S. Realty Co., 310 U.S. 434, 60 S. Ct. 1044, 84 L. Ed. 1293 (1940), clearly shows that adequate relief would not be obtainable under Chapter XI. While the stock of Southern Land is not publicly owned, its huge indebtedness, both secured and unsecured, is owned by investors scattered throughout the country, although relatively few in number. Few of these investors are intimate with Southern Land or its principals. It is clear that the petition seeks to adjust the secured debt of Southern Land, and it may be necessary to eliminate certain stock interests in the debtor corporation in order to effect its rehabilitation. While Chapter X affords the opportunity for the wholesale rearrangement of a debtor corporation's capital structure, an arrangement under Chapter XI does not afford the opportunity to disturb secured claims or stock interests. Yet it was readily obvious at the time of the good faith hearing that adjustments to the secured debt of Southern Land were necessary in order to alleviate the debtor from its plight inasmuch as the bulk of its indebtedness is secured and it has been unable to meet the demands of its secured indebtedness. Further, this is clearly a case requiring strict judicial control and the use of a disinterested trustee who is unavailable in Chapter XI proceedings except in the limited instance when a trustee has formerly been appointed for the debtor in bankruptcy. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" Section 332 of the Bankruptcy Act, 11 U.S.C. § 732. A thorough investigation of the debtor's affairs by a disinterested trustee is obviously necessary due to the inadequate books and records maintained by Southern Land and by the financial muddle in which it finds itself which is mainly attributable to present management's imposition of intolerable debt burdens on otherwise productive property for the pursuit of other operations. It appears necessary to supplant present management with more responsible management fiscally although perhaps not gifted with as much financial wizardry nor endowed with as many visionary ideas. It was apparent from the outset that a disinterested trustee was necessary to investigate the corporate ills and to take over the operation of the debtor estate before the corporation was mortgaged to death. Events subsequent to the good faith hearing confirmed the suspicion which existed at that time with respect to an even further need for judicial control and a disinterested trustee. The plans of reorganization which have thus far been proposed, largely due to the instigation of present controlling interests in Southern Land, have evinced a decidedly dominant theme to bail out the present owners of Southern Land at the expense of its distant creditors. If left to its own methods, even apart from the fact that adjustments to secured indebtedness are necessary, the Court is firmly convinced that any arrangement which Southern Land might devise would not be to the \"best interests of the creditors.\" For these reasons it is clear that adequate relief could not be obtained under Chapter XI of the Bankruptcy Act.\n\nThe issue is equally clear with respect to § 146(4). In fact in our opinion this issue was largely met by the petitioners' showing that it is not unreasonable to expect that a plan of reorganization can be effected. This being so, it could hardly be asserted that \"the interests of creditors and stockholders would be best subserved\" in the prior state court foreclosure proceedings particularly where, as here, there may well be equity for the stockholders of Southern Land. E.g., In Re Royal Circle of Friends Bldg. Corp., 159 F.2d 539 (7th Cir. 1947); In Re 325 East 72nd Street, 53 F. Supp. 997 (S.D.N.Y.1944); In Re 263 West 38th Street Corp., 37 F. Supp. 667 (S.D.N.Y.1941). If the property of the debtor were to be liquidated through forced sales, reorganization would be impossible and both junior creditors and stockholders would suffer the loss of their equity. As indicated above, it was precisely to avoid such consequences that Chapter X was enacted.\n\nThe leading case on this subject appears to be Marine Harbor Properties, Inc. v. Manufacturers Trust Co., 317 U.S. 78, 63 S. Ct. 93, 87 L. Ed. 64 (1942). The Court there stated:\n\n\"[The] bankruptcy court is not warranted in assuming, without more, that a state foreclosure proceeding, instituted for and on behalf of the first mortgage creditors exclusively, is inadequate, measured by Chapter X standards, to protect their interests.\" At 88, 63 S. Ct. at 98.\n\nIn this case we are not assuming without more that the pending state foreclosure proceedings are inadequate. In making the \"informed judgment\" required by the Marine Harbor case, we cannot shut our eyes to Louisiana law governing the pending foreclosures for this obviously need not be introduced as evidence. Under Article 2336 of the Louisiana Code of Civil Procedure property which is foreclosed by the first mortgagee may be sold at a judicial sale at two-thirds of its appraised value on the first bid if it has been appraised and may be sold for whatever it may bring if the first offering does not produce a sufficiently high bid, provided, of course, that the bid satisfies the costs of the sale under Article 2337. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" This clearly endangers the interests of junior creditors and stockholders when, as here, there has been a showing that equity probably does exist for them. Indeed, this principle, which we also set forth in the preceding paragraph, was explicitly recognized by Marine Harbor:\n\n\"If there were a showing, for example, that the property was worth more than the amount of first mortgage indebtedness and it appeared that that excess value would be lost to the junior interests in the state proceedings, or that the state proceedings were less adequate by reorganization standards than the bankruptcy court to protect such interests, approval of the petition clearly would be justified whether filed by the debtor or by creditors.\" At 86, 63 S. Ct. at 97.\n\nIn the Marine Harbor case, unlike the present case, it was conceded that the value of the property was worth less than the amount of the first mortgage debt. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" Further, inasmuch as reorganization is permitted even when the value of the debtor's property is less than its first mortgage indebtedness if the corporation may emerge as a viable and productive concern through readjustment of the demands of its obligations, we cannot see how the prior foreclosure proceedings would best subserve the interests of the creditors when such a reorganization would afford greater benefits to them.\n\nMoreover, in this case we note that, in spite of the allegations of the petition by the petitioning creditors who obviously had no means of knowing, only a portion of the debtor's property was involved in prior pending proceedings. This fact alone distinguishes this case from Marine Harbor and other cases where all or practically all of the debtor's property was involved in some prior proceeding. In Re Colorado Trust Deed Funds, Inc., 311 F.2d 288 (10th Cir. 1962); In Re Sheridan View Bldg. Corp., 149 F.2d 532 (7th Cir. 1945), cert. den. 326 U.S. 737, 66 S. Ct. 47, 90 L. Ed. 440 (1945); In Re St. Charles Hotel Co., 60 F. Supp. 322, aff'd 149 F.2d 645 (3rd Cir. 1945), cert. den. 326 U.S. 738, 66 S. Ct. 48, 90 L. Ed. 440 (1945); In Re Biltmore Grande Apt. Bldg. Trust, 146 F.2d 81 (7th Cir. 1944); In Re Paloma Estates, 126 F.2d 72 (2d Cir. 1942), cert. den. 317 U.S. 684, 63 S. Ct. 255, 87 L. Ed. 548 (1942); In Re Blinrig Realty Corp., 114 F.2d 100 (2d Cir. 1940); In Re Champ Brewing Co., 72 F. Supp. 764 (M.D.Pa.1947); In Re Unity Life Ins. Co., 47 F. Supp. 355 (E.D.S.C.1942), aff'd sub nom. Hoile v. Unity Life Ins. Co., 136 F.2d 133, 148 A.L.R. 710 (4th Cir. 1943); In Re Reliable Estates, Inc., 33 F. Supp. 588 (E.D.N.Y.1940). Thus, with respect to the bulk of the debtor's property, no prior proceeding at all was pending and thus § 146(4) could obviously be no bar. Further, most of the property in this case which was under a foreclosure suit was mortgaged to the National Bank of North America. As we have already noted, the National Bank of North America claimed that the property mortgaged to it was deteriorating and losing value. And we pointed out that the remedy in such a situation would be to sustain the petition and to permit the abandonment and disclaimer of such property. This likewise offers the solution in this instance when only a portion of the debtor's property is under a prior foreclosure suit and the property offers no equity to the junior interests in the debtor corporation and is not desirable for any plan of reorganization. When initially confronted with such a petition in which only a relatively small portion of the debtor's property is involved in any pending proceeding, the court should approve the petition, assuming that it is otherwise satisfied that the petition merits Chapter X relief, which automatically stays all former proceedings which are pending, § 148, 11 U.S.C. § 548, and then as the trustee has had time to investigate the debtor's property, lift the stay order and permit the prior proceeding to continue if it is ascertained that no equity exists in such property for junior interests and that the property is not otherwise desirable for any plan of reorganization. For these reasons it is clear that § 146(4) is no bar to the present petition.\n\nHaving determined that the petition satisfies all four of the negative statutory tests of good faith, we are faced only with the question of whether the general unspecified elements of good faith are lacking. Basically, the general elements of good faith, undefined in the statute, mean that the petition must be filed with the honest intent and genuine desire to utilize the provisions of Chapter X for its intended purpose - to effectuate a corporate reorganization - and not merely as a device to serve some sinister and unworthy purpose of the petitioner such as, for example, merely to serve as a delaying tactic. The Court cannot and will not tolerate such misuse of the reorganization process. This principle was established by cases prior to the enactment of Chapter X. E.g., Snyder v. Fenner, 101 F.2d 736 (3rd Cir. 1939); Provident Mut. Life Ins. Co. v. University Evangelical Lutheran Church, 90 F.2d 992 (9th Cir. 1937); In Re Loeb Apartments, Inc., 89 F.2d 461 (7th Cir. 1937); In Re South Coast Co., 8 F. Supp. 43 (D.Del.1934). These decisions are equally applicable to Chapter X, 6 Collier on Bankruptcy P6.07, p. 1022, n. 17 (14th ed.), and decisions under Chapter X have firmly embodied that principle. E.g., Mongiello Bros. Coal Corp. v. Houghtaling Properties, Inc., 309 F.2d 925 (5th Cir. 1962); In Re Diversey Hotel Corp., 165 F.2d 655 (7th Cir. 1948), cert. den. 333 U.S. 861, 68 S. Ct. 739, 92 L. Ed. 1140 (1948); In Re Julius Roehrs Co., 115 F.2d 723 (3rd Cir. 1940); In Re Ware Metal Products, 42 F. Supp. 538 (D.Mass. 1941).\n\nThe creditors opposing reorganization contend that the petition in the present case was filed merely for the purposes of delay because, as they contend, the petitioning creditors were merely interposed by, and on behalf of, the debtor corporation. Therefore, they argue, we must deem the petition to have been filed solely for delay as Judge Mitchell deemed the petition filed in his case to be filed solely for purposes of delay. The short answer to this, as we have already pointed out, is that all the facts which existed in Judge Mitchell's case, on which his finding was based, do not exist in our case. However, inasmuch as counsel for the creditors opposed to reorganization spent a substantial amount of time attempting to establish this contention, we now set forth what the evidence established.\n\nEmile G. Coci was on the board of directors of Southern Land when he made the loans to Southern Land, but was not a member of the board when the petition for reorganization was filed nor when he testified. Prior to 1965 he was employed by G. Brian Corporation and handled the rentals for that corporation. He received a rent-free apartment from Southern Land in the Butterfly Terrace No. 3 in return for services which he performed at that apartment complex.\n\nLouis C. Davis, President of Davis-Southern, Inc., is not, and has never been, a stockholder of Southern Land or any of its subsidiaries and is not, and has never been, on the board of directors of any of those corporations. Neither Sam Recile, nor Frank Spalitta, nor any of the other principals in Southern Land own any stock in Davis-Southern, Inc., nor have they ever owned any such stock. When Davis-Southern, Inc. was incorporated, Southern Land did have an option to buy 50% of the stock in Davis-Southern, Inc., but that option has expired and Southern Land does not own any stock in the insurance company. Southern Land and its subsidiaries were substantial insurance clients of Davis-Southern, Inc., accounting for approximately 50% of Davis-Southern's business, and Davis-Southern wrote most of Southern Land's insurance. The offices of Davis-Southern, Inc. were temporarily located at 510 O'Keefe Avenue, which is owned by Southern Land in which Southern Land's offices are located, while Davis-Southern awaited the completion of its new offices on St. Charles Avenue, which were expected to be completed coincidental with the expiration of Davis-Southern's lease in the building at 225 Baronne Street. Davis, on numerous occasions, issued letters or other documents indicating that the insurance on certain properties had been paid when, in fact, the insurance had not been paid. This fact is totally irrelevant to the issues in this case as to whether Davis-Southern, Inc. has a claim against Southern Land on the $8,000 note and as to whether Davis-Southern, Inc. filed the petition in good faith. Nor does this fact adversely affect the reliability of his testimony inasmuch as he readily admitted these facts, and his testimony was proved reliable in all other respects.\n\nLeonard Spangenberg is not on the board of directors of Southern Land or any of its subsidiaries. He has never been on the board of any of Southern Land's subsidiaries. At one time he was a director of Southern Land but he never attended any directors' meetings, and he resigned in August or September of 1966. He spent approximately 45% of his time working for Southern Land. His offices were located at 510 O'Keefe Avenue. He has no other connection with Southern Land.\n\nJulian Hotard is President of H \u0026 H Construction Corporation and owns 55% of the stock of that corporation. The other 45% of the stock of H \u0026 H Construction Corporation is owned by three individuals who are not dominant principals of Southern Land or its subsidiaries. While Hotard is not a member of the board of directors of Southern Land, the three minority stockholders of H \u0026 H Construction Corporation are numbered among the directors of Southern Land.\n\nHerman Stone was not shown to have any connection with Southern Land or its subsidiaries other than the contract previously discussed.\n\nThese facts in no way assault the status of the petitioners as genuine creditors of Southern Land nor do they undermine the right of the petitioners to file the petition for it is clear that stockholders, directors, officers, and employees are not precluded by such status from petitioning as § 126 creditors for the involuntary reorganization of a corporation. 6 Collier on Bankruptcy P4.07[2] (14th ed.); 3 Collier on Bankruptcy PP59.07-08 (14th ed.). Nor do these facts establish interposition by Southern Land and bad faith by the petitioners. To justify that conclusion, we would have to infer from these facts that Southern Land possessed such dominance or influence over the petitioners that they filed the petition only at Southern Land's insistence and that Southern Land was in bad faith in seeking reorganization. We are unable to draw even the first inference. We note, and it is clear, that the petitioners were not dominant or controlling or influential in the affairs of Southern Land. The opposing creditors' contention would be on a sounder basis if the petitioners had been. The most significant element in analyzing the facts is that Southern Land owed money to each of the petitioners and had owed them for some time. Inasmuch as the petitioners were receiving no payments on these debts and had not received payment for some time, it could hardly be said that they were dependent upon Southern Land or that Southern Land controlled or influenced them. Quite the contrary, for the tail does not wag the dog. Under the circumstances we must conclude that the petitioners were acting in their own selfish interests in filing the petition and were therefore not merely interposed by Southern Land.\n\nIt is obvious that Southern Land desired reorganization and probably discussed it with the petitioners. But the fact that Southern Land's interest coincided with the interests of the petitioners does not alter our conclusion that the petitioners were acting in their own selfish interests in attempting to realize something on their claims which were unsecured and ranked very low in priority. A situation somewhat similar to this arose in Humphrey v. Bankers Mort. Co. of Topeka, Kan., 79 F.2d 345 (10th Cir. 1935). The petitioning creditors in that case were asked to sign the petition, not by the debtor corporation, but by an outsider who desired to acquire the corporation after reorganization. The petitioning creditors in that case did not even have their own attorney, and their pleadings were prepared by the attorney representing the outsider who was not a party to the proceeding. Yet, the court felt that the petitioners consented to signing their names to the petition because they did favor a reorganization in hopes of realizing more on their investment. Indeed, this is the situation in the case at bar. Counsel for the opposing creditors attempted to show, through offers of proof, that Southern Land requested the petitioners, and prevailed upon them, to sign the petition. Even if this attempt had been successful In Re Rice-Varick Hotel Co., 184 F. Supp. 864 (D.N.H.1959), aff'd sub nom., Goodman v. Michael, 280 F.2d 106 (1st Cir. 1960), clearly shows that such a fact does not in itself establish bad faith. The attempt, however, failed and, instead, it was shown that the petitioners filed the petition because reorganization was their only hope of recovering any of the money which Southern Land owed them. Moreover, we note that it was not established that Henican prepared the present petition, and it appears unlikely that he did so in view of his testimony that he did not even prepare the voluntary petition for reorganization filed by Southern Land and did not even see that petition until after it was filed. We are simply unable, through the dubious process of inferential reasoning, to draw the conclusion from the many mysterious innuendoes inserted at the hearing by counsel for the opposing creditors or from the facts showing that the petitioning creditors were not complete strangers to Southern Land that the petitioning creditors had no mind of their own and were acting only on behalf of Southern Land. Rather, it clearly appears to us that the petitioners were acting in their own interests by seeking to reorganize Southern Land which is the only hope they have of receiving payment, in whole or in part, on their claims and, apart from the possibility of interposition, no basis whatsoever exists on which to find that the petitioning creditors were themselves merely seeking delay in filing the petition. Indeed, our conclusions in these respects are further borne out by the fact that H \u0026 H Construction Corporation was compelled to file its own petition for reorganization due to its inability to obtain payment on the debts which it was owed by Southern Land. We are completely unimpressed by the fact that the petitioning creditors themselves did not see the schedules of assets and liabilities of Southern Land because the schedules were not attached to the petition but were incorporated by reference from those filed with the voluntary petition in Judge Mitchell's case, and the petition was later amended at the hearing by the introduction of those schedules. Further, such matters are within the province and function of the creditors' attorney, as suggested by Humphrey, supra, rather than the creditors themselves who are only interested in recouping monies owed and who retain attorneys to implement that desire. Inasmuch as there is no question in our mind that the petitioning creditors are not merely puppets of Southern Land, which in no event would need ten such puppets to achieve the purpose asserted by those opposing reorganization, we need not even discuss the second inferential requirement of the opposing creditors' argument, namely, whether Southern Land was merely interested in securing a delay. Suffice it to repeat that the facts upon which Judge Mitchell based his decision do not exist in our case, and the facts in our case show that it is not unreasonable to expect that a plan of reorganization may be effected and this, additionally, seriously militates against such a holding.\n\nFor all of the foregoing reasons, we sustained the creditors' petition.\n\n\u003cspan class=\"fn\"\u003e1. Counsel for the petitioning creditors also filed on the same day an Alternative Motion for Entry of Order of Voluntary Dismissal Without Prejudice. This Court never acted upon that motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. They were Estate, Inc., National Cash Register Company, National Bank of North America (formerly Meadow Brook National Bank), National American Bank of New Orleans, Bankers Union Life Insurance Company of Denver, Colorado, Exchange National Bank of Chicago, Finger Contract Supply Company of Houston, Albert A. List, American Acceptance Corporation, National American Life Insurance Company, Dr. Francis E. LeJeune, State Savings and Loan Association, H-Tide Realty Company, Bowl-Opp, Inc., and American Machine \u0026 Foundry Company.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The sixteen creditors who filed answers included all of the fifteen creditors who joined in the motions to dismiss with the sole exception of the National American Bank of New Orleans. The only creditors who opposed the petition by way of answer but did not join in the motions to dismiss were Wilson P. Abraham and Sun Life Assurance Company of Canada.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In support of their contention that § 126 bars the present proceeding, the creditors opposing reorganization argued that the Notice of Voluntary Dismissal Without Prejudice and the Alternative Motion for Entry of Order of Voluntary Dismissal Without Prejudice filed by counsel for petitioning creditors herein constituted a judicial admission that another \"reorganization involving the debtor corporation was pending.\" It is impossible for us to give the effect to the Notice and Motion which the opposing creditors desire. The Notice and Motion in no way alter the situation at the time the present petition was filed, which is the pertinent date under § 126, and they in no way constitute a capitulation or judicial admission of the legal issue presented on that date. They only recite the facts which transpired and do that quite correctly. The Notice and Motion were filed after Judge Dyer's order reinstating the petition before Judge Mitchell and at that time another petition was pending. We view the Notice and Motion as merely an attempt by counsel for petitioning creditors to reach a practical solution to the practical problem posed by the reinstatement of the first petition since, as discussed below, two judges obviously cannot attempt to entertain different petitions for the reorganization of the same debtor at the same time. The fact that both the Notice and the Motion were specifically stated to be \"without prejudice\" clearly indicates that this was all counsel for the petitioning creditors did. While on this topic, although no formal motion was directed against the propriety of our permitting the withdrawal of the Notice of Voluntary Dismissal Without Prejudice and the Alternative Motion for Entry of Order of Voluntary Dismissal Without Prejudice, we feel it is appropriate to discuss our action therein insofar as it relates to the interpretation of § 126. As to the Notice of Voluntary Dismissal Without Prejudice, we do not rest the legality of our permitting its withdrawal on the argument that § 59(g) of the Bankruptcy Act, 11 U.S.C. § 95(g), made the dismissal impermissible, for even if the dismissal were effective to dismiss this proceeding, we would have allowed reinstatement of this proceeding within any reasonable period of time inasmuch as the dismissal was without prejudice and was predicated on Judge Dyer's order. With regard to the Alternative Motion for Entry of Order of Voluntary Dismissal Without Prejudice, we never acted on that motion and either would not have acted on it pending the outcome of the mandamus proceeding, or would have dismissed the second petition without prejudice to its being reinstated at some later time. Similarly, had there been no attempt to voluntarily withdraw the petition, but rather the objecting creditors had moved that it be dismissed after the entry of Judge Dyer's order, we would have either taken no action on that motion, pending the outcome of the mandamus proceeding, or would have dismissed the second petition without prejudice to its being reinstated at some later time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. E.g., §§ 101, 102, 106, 112-114, 117, 127, 128, 130-132, 146, 145, 157, 166, 199, 200, 202, 206, 208, 209, 211-213, 221, 236-238, 241, 242, 244-250, 256, 258, 259, 261, 262, 265, 266, 268, 270, and 276, 11 U.S.C. §§ 501, 502, 506, 512-514, 517, 527, 528, 530-532, 546, 545, 548, 557, 566, 599, 600, 602, 606, 608, 609, 611-613, 621, 636-638, 641, 642, 644-650, 656, 658, 659, 661, 662, 665, 666, 668, 670 and 676. Similarly, the word \"petition\" is used many times throughout Chapter X, e.g., §§ 102, 106, 111-116, 126-133, 136, 137, 141-149, 156, 158, 161, 163, 164, 166, 196, 200-202, 208, 210, 211, 236-238, 244, 245, 256, 262, 265, 266, 271 and 276, 11 U.S.C. §§ 502, 506, 511-516, 526-533, 536, 537, 541-549, 556, 558, 561, 563, 564, 566, 596, 600-602, 608, 610, 611, 636-638, 644, 645, 656, 662, 665, 666, 671 and 676, and this indicates that \"petition\" is to be distinguished from \"proceeding.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In relying on the language of § 126 and distinguishing \"petition\" from \"proceeding,\" we quote the following excerpt from Collier as an example of the validity of our distinction in addition to the provisions referred to in footnote 5, supra : \"In any event, the dismissal of the petition does not in itself necessarily terminate the reorganization proceeding * * *. Following dismissal of the petition in any case, the judge has the power to make allowances for costs, expenses and compensation accruing during the life of the reorganization proceeding. The order of dismissal may expressly retain jurisdiction to make such orders as are permitted under Chapter X in winding up the proceeding.\" 6 Collier on Bankruptcy P6.02[2], pp. 1006-1007 (14th ed.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In striving to resolve the issue presented here regarding § 126, we have not concerned ourselves with the possibility that a successive petition may be barred by res judicata. We have considered § 126 in a broader perspective and have concerned ourselves with the rights of unsecured creditors and stockholders to also seek reorganization. (Stockholders, of course, under § 126 can normally seek corporate reorganization only through a petition filed by the corporation. Price v. Gurney, 324 U.S. 100, 65 S. Ct. 513, 89 L. Ed. 776 (1945).) The fact that res judicata may bar a subsequent petition by either unsecured creditors or stockholders does not affect the scope of our consideration of the § 126 issue apart from the res judicata issue because res judicata is a separate issue to be separately determined.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. We have found only two cases decided under Chapter X involving the point at issue here but both cases are factually distinguishable. Bankers Securities Corp. v. Ritz Carlton R. \u0026 H. Co., 99 F.2d 51 (3rd Cir. 1938), involved a second petition filed by the debtor corporation after its first petition had been dismissed. The court refused to allow the petition to proceed until the debtor had paid the costs of the former reorganization proceeding. This, obviously, is not our situation. In In re Plankinton Bldg. Co., 148 F.2d 119 (7th Cir. 1945), cert. den. 326 U.S. 729, 66 S. Ct. 36, 90 L. Ed. 433 (1945), the court allowed a petition for reorganization to be filed under Chapter X even though no final decree had ever been entered in a prior reorganization proceeding. We hesitate to rely on this decision for it was based on the peculiar circumstances which existed in that case. Further, the opinion states that a final entry of discharge in the first proceeding was due before the second petition could be filed. This statement may appear to make our decision contrary to that opinion although consistent with the decision therein. Again, however, we are reluctant to point to this opinion for a contrary view in light of the holding therein and particularly since the opinion does not even mention § 126 and does not cite any authority for the seemingly contrary statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The opposing creditors contended that the petitioners in the case at bar were merely interposed by, and on behalf of, Southern Land, and that, therefore, there is no difference between the petition filed by Southern Land and the present petition. As discussed more fully below, the evidence refuted this contention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Upon reflection, however, it appears that in light of the contested status of the petitioners as bona fide creditors, it would have been more prudent for us to decline the approval of the withdrawals until after the other petitioners had sustained their burden of proof as to their status as creditors. We shall exercise this prudence if the situation should ever again confront us for otherwise one or more of the co-petitioners or other interested parties could be seriously prejudiced in the event that an insufficient number of petitioners are able to sustain their burden of proof as to their right to maintain the petition. In this case, however, as appears more fully below, the remaining petitioners were able to sustain their burden of proof and no harm resulted from the premature withdrawals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Frederick M. Guice filed a claim for $87,574.10 on October 3, 1967, Henry L. Muller filed a claim with the trustee for $142,000 on October 4, 1967, Kalman, Rogers \u0026 Smith, Inc. filed a claim for $17,629.40 with leave on November 6, 1967, The Archer Agency, Inc. filed a claim for $85,692.12 on November 6, 1967, and J. J. Krebs \u0026 Sons, Inc., which withdrew as a petitioner after the good faith hearing, filed a claim with the trustee for $8,795.00.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. A closely related problem with respect to the claim of H \u0026 H Construction Corporation did arise and is discussed below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. G. Brian Corporation is closely related to Southern Land and is the rental agency for Southern Land. It is also pending in its own reorganization proceeding. As discussed more fully below, the loan was made to Southern Land even though the funds were deposited in G. Brian Corporation's account. Southern Land did not have an active checking account, and its funds were handled through the account of G. Brian Corporation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See footnote 13, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We have researched the cases extensively, and we are not unaware of the statement in In Re Western Tool \u0026 Mfg. Co., 142 F.2d 404 (6th Cir. 1944), that: \"There is no good faith in a petition filed by stockholders in the name of a debtor unless it is shown that under some reasonable plan of reorganization such stockholders would retain an interest because persons without a pecuniary interest have no judicial standing in any court.\" At 411. That statement, however, must be taken in context. The case was unusual in that it involved a petition by a stockholder of the debtor corporation for reorganization. For the most part, the court was concerned with whether the stockholder could maintain such a petition. The court concluded that he could under circumstances required for normal stockholder derivative suits. No authorities were cited in support of its statement. In fact, the case was reversed by the Supreme Court on appeal sub nom. Price v. Gurney, 324 U.S. 100, 65 S. Ct. 513, 89 L. Ed. 776 (1945). Thus, we seriously question the validity of the statement. Further, even if the statement can be taken as grafting an additional requirement to a petition for reorganization filed by a stockholder, it does not alter our conclusion in this case under the above cited authorities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In that case the only assets of the corporation were the proceeds of the sheriff's sale of the hotel for $140,000 which were the subject of litigation plus the right of redeeming the hotel subject to an $80,000 first mortgage and tax liens. Liabilities totaled about $700,000. If the hotel were redeemed, the optimum profit the corporation could expect would be less than $20,000 a year before interest. It appeared unlikely under the circumstances that the necessary rejuvenating capital would be forthcoming.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. For various reasons the debtor corporations in this case had suffered huge operating losses in the past, and the prospects for the future were no brighter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In this case the debtor was engaged in the purchase and resale of petroleum products. It owned a tract of improved land on which its operations were conducted. Its source of supply was cut off, and the debtor was forced to mortgage its property. As a result of demands on the mortgages, the debtor entered into an agreement transferring title to the property in return for the necessary capital and a lease back and an option to buy. The transferee subsequently bought the mortgages and extended them once again. Finally, foreclosure proceedings were instituted. Thus, not only had the debtor evidenced a losing financial struggle for ten years but it had lost title to its property.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The debtor's sole source of income - voluntary contributions from members of the congregation - was negligible in comparison to its liabilities. It was thus hardly possible for the secured creditors to ever realize anything on their investment through reorganization whereas they could through foreclosure.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The liabilities of the debtor corporations were over twice as large as their assets, and they had suffered tremendous losses for each of the prior three years. The total amount of the losses equalled the total value of their assets. The situation was clearly hopeless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In this case the very nature of the debtor was self-liquidating, and there was absolutely no hope of generating sufficient revenues to put it on a paying basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The debtor had no assets, was not engaged in doing business, and had large liabilities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. As witnessed by the discussion, supra, the fact that evidence was introduced to support this petition whereas none was introduced in support of Judge Mitchell's petition alone bars the application of res judicata.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Compare Glint Factors, Inc. v. Schnapp, 126 F.2d 207 (2d Cir. 1942), which held that F.R.Civ.P. 15(c) is applicable to ordinary bankruptcy proceedings, which decision is equally applicable to reorganization proceedings. 6 Collier on Bankruptcy P4.18 (14th ed.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. At that time the proposed complex was known as the West Jefferson Professional Medical Plaza. Its name was changed to the Butterfly Terrace No. 1 after West Jefferson Professional Medical Plaza, Inc. merged with Southern Land in August of 1964.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The appraisals on Butterfly Terrace No. 1 were introduced into evidence at the good faith hearing, and we could hardly ignore prior events in this proceeding in assessing their probative weight.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In this portion of the opinion we are using the term \"equity\" to mean net worth of the subsidiary which is to be considered as an asset of Southern Land inasmuch as it owns all of the stock in its subsidiaries. Our use of the term \"equity\" in this sense is to be distinguished from our use of that term above when we were referring to equity in Southern Land for its own stockholders or junior creditors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. This principle is not inconsistent with other portions of this opinion wherein we point to events subsequent to the good faith hearing. In those instances we certainly do not rely on the subsequent events but merely point to them as illustrating the importance of not overlooking possible future events in determining the § 146(3) issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In fact, two of the \"opposing creditors\" have not even bothered to file proofs of claim against Southern Land. An explanatory comment is necessary with reference to certain comments in the opinion on pages 420 and the above 422 which, on their face, appear inconsistent. On page 420 we stated that the evidence reflected that Southern Land's indebtedness was slightly in excess of $9,000,000. Here we have stated that 165 alleged creditors of Southern Land have filed proofs of claims against Southern Land totaling in excess of $34,000,000 and that of these 165, the 16 creditors opposing reorganization filed proofs of claims totaling in excess of $12,000,000. Thus, assuming that all of the creditors had provable claims, it would appear from the face of these statements that the indebtedness of Southern Land was greatly in excess of that reflected by the evidence. However, the reason for this superficial inconsistency is that those alleged creditors of Southern Land who have filed proofs of claims against Southern Land, including those creditors opposing reorganization, have included in their proofs claims on which one or more of the subsidiaries are primarily liable and Southern Land, the parent corporation, is only contingently liable. Thus, no real inconsistency exists between the evidence which reflects a total indebtedness of Southern Land and its subsidiaries in excess of $43,000,000 and the proofs of claim against Southern Land in excess of $34,000,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In addition to the authorities cited and discussed in Plaza Towers for this test of § 146(3), see In Re Unity Life Ins. Co., 47 F. Supp. 355 (E.D.S.C.1942), aff'd sub nom. Hoile v. Unity Life Ins. Co., 136 F.2d 133, 148 A.L.R. 710 (4th Cir. 1943), wherein it was stated: \"If the court comes to the conclusion that there is no chance of a reorganization and that liquidation is the only expedient the petition should be refused.\" 47 F. Supp. at 360. See also In Re Liberty Mortgage Corp., 245 F. Supp. 858 (N.D.Ohio 1965), wherein it was stated: \"The statutory language states that the guiding criteria is a reasonable expectation of reorganization. The fact that the disinterested trustee is charged with investigating the affairs of the debtor, 11 U.S.C. § 567, and either filing a plan of reorganization or reporting his reasons why a plan cannot be effected, 11 U.S.C. § 569, does not obviate the Court's duty to make an initial determination whether there is any possibility of a reorganization under Chapter X.\" At 864. See also the decisions in In Re Riddlesburg Mining Co., 224 F.2d 834 (3rd Cir. 1955); In Re Diversey Hotel Corp., 165 F.2d 655 (7th Cir. 1948), cert. den. 333 U.S. 861, 68 S. Ct. 739, 92 L. Ed. 1140 (1948); and In Re Doyle Mfg. Corp., 77 F. Supp. 116 (N.D.N.Y.1948).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In the Spring of this year it appeared at one time that little possibility existed for the reorganization of Southern Land, and we were on the verge of terminating the reorganization proceeding. However, several rapidly occurring events altered the posture of this proceeding and the trustee was granted until January 31, 1969 within which to file a plan or give a report of his reasons why a plan cannot be effected. These events are more fully described in a memorandum opinion and order of this Court dated November 6, 1968.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Nor are the powers and duties of a receiver who may be appointed in a Chapter XI proceeding under § 332 \"if necessary\" as comprehensive under §§ 341-344, 11 U.S.C. §§ 741-744, as the powers and duties of the trustee in reorganization.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In this respect we also note that the foreclosure proceedings here pending in state court are not in any respects similar to the liquidation proceedings in the nature of receivership in which the state courts were able to maintain some control over the matters in order to insure that no possible equities were unduly sacrificed. Many cases exist in which such prior proceedings were deemed adequate to protect the interests of all concerned. In Re Colo. Trust Deed Funds, Inc., 311 F.2d 288 (10th Cir. 1962); In Re Sheridan View Bldg. Corp., 149 F.2d 532 (7th Cir. 1945), cert. den. 326 U.S. 737, 66 S. Ct. 47, 90 L. Ed. 440 (1945); In Re Unity Life Ins. Co., 47 F. Supp. 355 (E.D.S.C.1942), aff'd sub nom. Hoile v. Unity Life Ins. Co., 136 F.2d 133, 148 A.L.R. 710 (4th Cir. 1943); In Re Paloma Estates, 126 F.2d 72 (2d Cir. 1942), cert. den. 317 U.S. 684, 63 S. Ct. 255, 87 L. Ed. 548 (1942); In Re Champ Brewing Co., 72 F. Supp. 764 (M.D.Pa.1947); In Re Reliable Estates, Inc., 33 F. Supp. 588 (E.D.N.Y.1940).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In In Re St. Charles Hotel Co., 60 F. Supp. 322, aff'd 149 F.2d 645 (3rd Cir. 1945), cert. den. 326 U.S. 738, 66 S. Ct. 48, 90 L. Ed. 440 (1945), which is an extensively considered opinion following the decision of Marine Harbor, it was also clear that the first mortgaged indebtedness far exceeded the value of the debtor's assets and it had little going-concern value.\u003c/span\u003e\n\n",
    "body_length": 192485,
    "citedas": [
      "301 F. Supp. 379"
    ],
    "attorneys": "Cicero C. Sessions, Sessions, Fishman, Rosenson, Snellings \u0026 Boisfontaine, J. B. Kiefer, Graham \u0026 Graham, New Orleans, Louisiana, for Leonard R. Spangenberg, Jr., and other petitioning creditors. , James J. Morrison, New Orleans, Louisiana, for bankrupt debtor corp. , Jerry A. Brown, Monroe \u0026 Lemann, New Orleans, Louisiana, for National Bank of North America (formerly Meadow Brook National Bank). , Donald Zuber, Seale, Smith, Baine \u0026 Phelps, Baton Rouge, Louisiana, for National American Life Insurance Co. , Tom H. Matheny, Pittman \u0026 Matheny, Hammond, Louisiana, for Bowl-Opp, Inc. and American Machine \u0026 Foundry Co. , W. Ford Reese, Adams \u0026 Reese, Harold J. Zeringer, Jr., Zeringer \u0026 Zeringer, New Orleans, Louisiana, for Gulf South Realty Corporation and Leon Poirier. , Harry T. Howard, III, Chaffe, McCall, Phillips, Burke, Toler \u0026 Hopkins, New Orleans, Louisiana, for Dr. Francis E. LeJeune. , Clem H. Sehrt, Peter J. Butler, Sehrt, Boyle \u0026 Wheeler, New Orleans, Louisiana, for National American Bank of New Orleans and Bankers Union Life Insurance Company of Denver, Colorado. , Meyer L. Dresner, Dresner \u0026 Dresner, New Orleans, Louisiana, for H-Tide Realty Corp. , Moise S. Steeg, Jr., Rader Jackson, Steeg \u0026 Shushan, New Orleans, Louisiana, for Douglas L. Black and Estate, Inc. , Leo S. Roos, Roos \u0026 Roos, New Orleans, Louisiana, for Exchange National Bank of Chicago and Finger Contract Supply. , Joseph E. Friend, Dodge \u0026 Friend, New Orleans, Louisiana, for American Acceptance Corp. , J. Barnwell Phelps, Phelps, Dunbar, Marks, Claverie \u0026 Sims, New Orleans, Louisiana, for Albert A. List and Hibernia National Bank. , Frank L. Micholet, Bernard, Micholet \u0026 Cassisa, New Orleans, Louisiana, for Sun Life Assurance Company of Canada and Mrs. Virginia Raspanti Ajubita. , Clifton S. Carl, Garrett \u0026 Carl, New Orleans, Louisiana, for National Cash Register Co. Heebe, District Judge.",
    "category": [
      "243",
      "21"
    ],
    "judges": "HEEBE, District Judge:",
    "citation_count": 0
  }
}
