{
  "id": "ioHnPWYBTlTomsSB8Epv",
  "document": {
    "title": "Miller v. Fenton",
    "full_title": "FRANK M. MILLER, JR. v. PETER J. FENTON, SUPERINTENDENT, RAHWAY STATE PRISON, IRVWIN I. KIMMELMAN, ATTORNEY GENERAL, STATE OF NEW JERSEY",
    "jurisdiction": "Third Circuit",
    "date": "1986-01-16T00:00:00.000Z",
    "docket": "No. 83-5530",
    "body": "Before: SEITZ, GIBBONS and BECKER, Circuit Judges\n\nOpinion OF THE COURT\n\nBECKER, Circuit Judge.\n\nThis state habeas corpus appeal requires us to determine whether a confession to murder, alleged by the petitioner to have been secured by psychological coercion, was voluntary and hence admissible. After reviewing the circumstances of the confession under a plenary standard, see Miller v. Fenton, 474 U.S. 104, 106 S. Ct. 445, 88 L. Ed. 2d 405 (1985), rev'd Miller v. Fenton, 741 F.2d 1456 (3d Cir. 1984), we find that the confession was voluntary. We therefore affirm.\n\nI. THE FACTUAL BACKGROUND\n\nOn August 13, 1973, seventeen-year-old Deborah Margolin was brutally murdered. According to her brothers, she was sitting on the porch of her home in rural East Amwell Township when a stranger approached in an automobile and informed her that a heifer was loose at the bottom of the driveway. Ms. Margolin drove alone in her brother's car to retrieve the heifer. She never returned. Later that day, her father found her mutilated body lying face down in a creek.\n\nWhen the New Jersey State Police arrived at the scene, the victim's brothers gave them a description of the stranger who had driven up to the house and of the car he had driven, an old white car with the trunk tied shut and two dents in the side. One of the officers recalled that the petitioner, Miller, who lived nearby, drove a car that matched that description. Detective Boyce of the State Police confirmed the description of the car and also concluded that the description of the stranger fit Miller, who had been convicted in 1969 of carnal abuse and arrested in 1973 for statutory rape.\n\nAt about 10:50 p.m. that day, the state police questioned Miller at his place of employment, P.F.D. Plastics in Trenton. After a brief discussion, he agreed to accompany the officers to the police barracks for further questioning. At the barracks, Miller spent about seventy-five minutes waiting with Trooper Scott, during which time he was not questioned. He was then taken into an interrogation room by Detective Boyce and read his Miranda rights. Miller signed a Miranda card, thus waiving his Miranda rights,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and Boyce's interrogation ensued. One hour into the interrogation, Miller confessed to the murder of Deborah Margolin, then passed out.\n\nII. PROCEDURAL HISTORY\n\nMiller was indicted for first-degree murder. Before his trial, he moved to suppress the confession as involuntary, but the state trial court denied the motion. After a trial at which the confession was received as evidence, Miller was convicted. On appeal of the conviction, a three-judge panel of the Appellate Division of the New Jersey Superior Court unanimously reversed, finding that Detective Boyce's technique in eliciting the confession\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e had denied Miller due process of law. Characterizing Boyce's method of interrogation as \"psychological pressure,\" the panel held that as a result of that pressure, Miller's confession had not been voluntary.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In a 4-3 decision, the New Jersey Supreme Court reversed the Appellate Division and reinstated the conviction. State v. Miller, 76 N.J. 392, 388 A.2d 218 (1978). Looking at the totality of the circumstances, the court held that Boyce's interrogation tactics had not overborne Miller's will, and that the confession had indeed been voluntary and thus properly admissible into evidence.\n\nMiller petitioned for a writ of habeas corpus in the United States District Court for the District of New Jersey. The petition was referred to a magistrate, who recommended that the writ be denied. The district court agreed, rejecting Miller's contention that Boyce's questioning created psychological pressure that rendered the confession involuntary. Miller thereupon appealed to this Court.\n\nIn Miller v. Fenton, 741 F.2d 1456 (1984), rev'd and remanded 474 U.S. 104, 106 S. Ct. 445, 88 L. Ed. 2d 405 (1985), we held that under 28 U.S.C. ยง 2254(d), federal review of the state court's finding of voluntariness was deferential, limited to determining whether the state court had applied the proper legal test and whether the conclusion reached by the state court was supported by the record as a whole.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Applying that standard, we upheld the determination that Miller's confession was voluntary. Although we noted in passing that even if our review on the question of voluntariness had been plenary, we would have reached the same result, id. at 1467 n.21, we did not engage in any detailed analysis of the question of voluntariness under a plenary standard.\n\nThe United States Supreme Court granted certiorari and reversed. Miller v. Fenton, 474 U.S. 104, 106 S. Ct. 445, 88 L. Ed. 2d 405 (1985). Stating that the issue of voluntariness is a legal, rather than a factual, question, the Court held that whether the challenged confession was voluntary is a matter for independent federal appellate determination. It remanded the case so that we might conduct a fuller analysis under the correct standard. We not engage in such an inquiry and conclude that Miller's confession was elicited in a manner compatible with the requirements of the Constitution.\n\nIII. THE INTERROGATION\n\nAt the outset of our analysis, it is essential that we review the salient features of the interrogation.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Because the state police taped the interrogation, we have had an opportunity actually to hear Detective Boyce's questions and Miller's responses. A significant portion of the questioning was in the typical police interrogation mode, developing chronologically Miller's whereabouts on the day in question, confronting him with the identification of his car, asking him point-blank whether he committed the crime, challenging his answers, and attempting to discover the details of the crime. This element of the interrogation is unexceptionable and unchallenged. We shall therefore focus primarily on the features of the interrogation that are at issue.\n\nIt is clear that Boyce made no threats and engaged in no physical coercion of Miller. To the contrary, throughout the interview, Detective Boyce assumed a friendly, understanding manner and spoke in a soft tone of voice. He repeatedly assured Miller that he was sympathetic to him and wanted to help him unburden his mind. As the following excerpts demonstrate, the Detective's statements of sympathy at times approached the maudlin:\n\nBoyce: Now listen to me, Frank. This hurts me more than it hurts you, because I love people.\n\nBoyce: Let it come out, Frank. I'm here, I'm here with you now. I'm on your side, I'm on your side, Frank. I'm your brother, you and I are brothers, Frank. We are brothers, and I want to help my brother.\n\nBoyce: We have, we have a relationship, don't we? Have I been sincere with you, Frank?\n\nBoyce also gave Miller certain factual information, some of which was untrue. At the beginning of the interrogation, for example, Boyce informed Miller that the victim was still alive; this was false. During the interview, Boyce told Miller that Ms. Margolin had just died, although in fact she had been found dead several hours earlier.\n\nDetective Boyce's major theme throughout the interrogation was that whoever had committed such a heinous crime had mental problems and was desperately in need of psychological treatment. From early in the interview, Detective Boyce led Miller to understand that he believed that Miller had committed the crime and that Miller now needed a friend to whom he could unburden himself. The Detective stated several times that Miller was not a criminal who should be punished, but a sick individual who should receive help. He assured Miller that he (Detective Boyce) was sincerely understanding and that he wished to help him with his problem. The following excerpts from the transcript of the interrogation provide examples of the statements about Miller's having psychological problems, as well as of the assurances of help:\n\nBoyce: Let's forget this incident, let's talk about your problem. This is what, this is what I'm concerned with, Frank, your problem.\n\nMiller: Right.\n\nBoyce: If I had a problem like your problem, I would want you to help me with my problem.\n\nMiller: Uh, huh.\n\nBoyce: Now, you know what I'm talking about.\n\nMiller: Yeah.\n\nBoyce: And I know, and I think that, uh, a lot of other people know. You know what I'm talking about. I don't think you're a criminal, Frank.\n\nMiller: No, but you're trying to make me one.\n\nBoyce: No I'm not, no I'm not, but I want you to talk to me so we can get this think worked out.\n\nBoyce: I want you to talk to me. I want you to tell me what you think. I want you to tell me how you think about this, what you think about this.\n\nMiller: What I think about it?\n\nBoyce: Yeah.\n\nMiller: I think whoever did it really needs help.\n\nBoyce: And that's what I think and that's what I know. They don't, they don't need punishment, right? Like you said, they need help.\n\nMiller: Right.\n\nBoyce: They don't need punishment. They need help, good medical help.\n\nMiller: That's right.\n\nBoyce: To rectify their problem. Putting them in, in a prison isn't going to solve it, is it?\n\nMiller: No, sir. I know, I was in there for three and a half years.\n\nBoyce: You can see it Frank, you can feel it, you can feel it but you are not responsible. This is what I'm trying to tell you, but you've got to come forward and tell me. Don't, don't, don't let it eat you up, don't, don't fight it. You've got to rectify it, Frank. We've got to get together on this thing, or I, I mean really, you need help, you need proper help, and you know it, my God, you know, in God's name, you, you, you know it. You are not a criminal, you are not a criminal.\n\nBoyce also appealed to Miller's conscience and described the importance of Miller's purging himself of the memories that must be haunting him. This aspect of the interrogation is exemplified in the proceeding passage -- \"Don't, don't, don't let it eat you up, don't don't fight it. You've got to rectify it, Frank.\" The following excerpts are representative of Boyce's arguments along this line:\n\nBoyce: Frank, listen to me, honest to God, I'm, I'm telling you, Frank, (inaudible). I know, it's going to bother you, Frank, it's going to bother you. It's there, it's not going to go away, it's there. It's right in front of you, Frank. Am I right or wrong?\n\nMiller: Yeah.\n\nBoyce: Honest, Frank. It's got to come out. You can't leave it in. It's hard for you, I realize that, how hard it is, how difficult it is, I realize that, but you've go to help yourself before anybody else can help you.\n\nTBoyce: First thing we have to do is let it all come out. Don't fight it because it's worse, Frank, it's worse. It's hurting me because I feel it. I feel it wanting to come out, but it's hurting me, Frank.\n\nBoyce: No, listen to me, Frank, please listen to me. The issue now is what happened. The issue now is truth. Truth is the issue now. You've got to believe this, and the truth prevails in the end, Frank. You have to believe that and I'm sincere when I'm saying it to you. You've got to be truthful with yourself.\n\nBoyce: That's the most important thing, not, not what has happened, Frank. The fact that you were truthful, you came forward and you said, look I have a problem. I didn't mean to do what I did. I have a problem, this is what's important, Frank. This is very important, I got, I, I got to get closer to you, Frank, I got to make you believe this and I'm, and I'm sincere when I tell you this. You got to tell me exactly what happened, Frank. That's very important. I know how you feel inside, Frank, it's eating you up, and I right? It's eating you up, Frank. You've got to come forward. You've got to do it for yourself, for your family, for your father, this is what's important, the truth, Frank.\n\nWhen Miller at last confessed, he collapsed in a state of shock. He slid off his chair and onto the floor with a blank stare on his face. The police officer sent for a first aid squad that took him to the hospital.\n\nIV. THE VOLUNTARINESS OF THE CONFESSION\n\nThe sole question before this Court is whether Miller's confession was voluntary. Miller contends that Detective Boyce's method of interrogation constituted psychological manipulation of such magnitude that it rendered his confession involuntary. The government counters that Miller's confession was voluntary and hence properly admissible.\n\nA. The Legal Test of Voluntariness\n\nIt is well established that an involuntary confession may result from psychological, as well as physical, coercion. See, e.g., Blackburn v. Alabama, 361 U.S. 199, 206, 4 L. Ed. 2d 242, 80 S. Ct. 274 (1960) (\"A number of cases have demonstrated, if demonstration were needed, that the efficiency of the rack and the thumbscrew can be matched, given the proper subject, by more sophisticated modes of 'persuasion'.\"); Spano v. New York, 360 U.S. 315, 3 L. Ed. 2d 1265, 79 S. Ct. 1202 (1959); Fikes v. Alabama, 352 U.S. 191, 1 L. Ed. 2d 246, 77 S. Ct. 281 (1957); Leyra v. Denno, 347 U.S. 556, 98 L. Ed. 948, 74 S. Ct. 716 (1954); Watts v. Indiana, 338 U.S. 49, 93 L. Ed. 1801, 69 S. Ct. 1347 (1949); Turner v. Pennsylvania, 338 U.S. 62, 93 L. Ed. 1810, 69 S. Ct. 1352 (1949); Harris v. South Carolina, 338 U.S. 68, 93 L. Ed. 1815, 69 S. Ct. 1354 (1949); Ashcraft v. Tennessee, 322 U.S. 143, 88 L. Ed. 1192, 64 S. Ct. 921 (1944); Chambers v. Florida, 309 U.S. 227, 84 L. Ed. 716, 60 S. Ct. 472 (1940). However, while a per se involuntariness rule applies when an interrogation is accompanied by physical violence, see Stein v. New York, 346 U.S. 156, 182, 97 L. Ed. 1522, 73 S. Ct. 1077 (1953), no such role applies when the alleged coercion is psychological. Id. at 184. As the Supreme Court has noted, \"the line between proper and permissible police conduct and techniques and methods offensive to due process is, at best, a difficult one to draw, particularly in cases such as this where it is necessary to make fine judgment as to the effect of psychologically coercive pressures and inducements on the mind and will of an accused.\" Haynes v. Washington, 373 U.S. 503, 515, 10 L. Ed. 2d 513, 83 S. Ct. 1336 (1963).\n\nTo determine the voluntariness of a confession, the court must consider the effect that the totality of the circumstances had upon the will of the defendant. See, e.g., Schneckloth v. Bustamonte, 412 U.S. 218, 226-27, 36 L. Ed. 2d 854, 93 S. Ct. 2041 (1973); Procunier v. Atchley, 400 U.S. 446, 453, 27 L. Ed. 2d 524, 91 S. Ct. 485 (1971); Frazier v. Cupp, 394 U.S. 731, 739, 22 L. Ed. 2d 684, 89 S. Ct. 1420 (1969); Boulden v. Holman, 394 U.S. 478, 480, 22 L. Ed. 2d 433, 89 S. Ct. 1138 (1969); Blackburn v. Alabama, supra, 361 U.S. at 206; Fikes v. Alabama, supra, 352 U.S. at 197. The question in each case is whether the defendant's will was overborne when he confessed. See, e.g., Schneckloth v. Bustamonte, supra, 412 U.S. at 225-26; Procunier v. Atchley, supra, 400 U.S. at 453; Haynes v. Washington, supra, 373 U.S. at 513 (1963); Lynumn v. Illinois, 372 U.S. 528, 534, 9 L. Ed. 2d 922, 83 S. Ct. 917 (196 ); Culombe v. Connecticut, 367 U.S. at 568, 602 (1961); Leyra v. Denno, supra, 347 U.S. at 558 (1954); Watts v. Indiana, supra, 338 U.S. at 53. Factors to be considered include:\n\nthe youth of the accused; his lack of education or his low intelligence; the lack of any advice to the accused of his constitutional rights; the length of detention; the repeated and prolonged nature of questioning; and the use of physical punishment such as the deprivation of food or sleep.\n\nSchneckloth v. Bustamonte, supra, 412 U.S. at 226 (1973) (citations omitted). As the Eighth Circuit has explained, \"using the flexible totality of the circumstances approach requires the reviewing court to consider the specific tactics utilized by the police in eliciting the admissions, the details of the interrogation, and the characteristics of the accused . . . .\" Rachlin v. United States, 723 F.2d 1373, 1377 (8th Cir. 1983) (citation omitted). although at the trial level the burden is on the government to establish, by a preponderance of the evidence, that a challenged confession was voluntary, see Lego v. Twomey, 404 U.S. 477, 489, 30 L. Ed. 2d 618, 92 S. Ct. 619 (1972), on collateral review, the habeas corpus petitioner must prove involuntariness by a preponderance of the evidence. See Martin v. Wainwright, 770 F.2d 918, 925 (11th Cir. 1985); Jurek v. Estelle, 623 F.2d 929, 937 (5th Cir. 1980); Bruce v. Estelle, 536 F.2d 1051, 1059 (5th Cir. 1976).\n\nWe emphasize that the test for voluntariness is not a but-for test: we do not ask whether the confession would have been made in the absence of the interrogation. Few criminals feel impelled to confess to the police purely of their own accord, without any questioning at all. See Stein v. New York, supra, 346 U.S. at 186 (\"Of course, these confessions were not voluntary in the sense that petitioners wanted to make them or that they were completely spontaneous, like a confession to a priest, a lawyer, or a psychiatrist. But in this sense no criminal confession is voluntary.\"); United States v. Wertz, 625 F.2d 1128, 1134 (4th Cir. 1980). Thus, it can almost always be said that the interrogation caused the confession.\n\nMoreover, it is generally recognized that the police may use some psychological tactics in eliciting a statement from a suspect.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See Haynes v. Washington, supra, 373 U.S. at 514-15. For example, the interrogator may play on the suspect's sympathies or explain that honesty might be the best policy for a criminal who hopes for leniency from the state, see Rachlin v. United States, supra, 723 F.2d at 1378 (agents may have told suspect that it was in his best interest to cooperate, but resulting confession was voluntary); United States v. Vera, 701 F.2d 1349, 1363-64 (11th Cir. 1983) (agent told suspect that he could help himself by cooperating, but resulting confession was voluntary). These ploys may play a part in the suspect's decision to confess, but so long as that decision is a product of the suspect's own balancing of competing considerations, the confession is voluntary. The question we must answer, then, is not whether Detective Boyce's statements were the cause of Miller's confession -- indeed, we assume that to be the case -- but whether those statements were so manipulative or coercive that they deprived Miller of his ability to make an unconstrained, autonomous decision to confess. To that inquiry we now turn.\n\nB. The Circumstances of Miller Interrogation\n\nA \"totality of the circumstances\" inquiry defies strictly analytic treatment. We cannot reach a conclusion simply by scrutinizing each circumstance separately, for the concept underlying the phrase \"totality of the circumstances\" is that the whole is somehow distinct from the sum of the parts. See United States v. Wertz, supra, 625 F.2d at 1134. Nevertheless, we can understand the totality only after reviewing the constituent elements of the situation. We shall therefore discuss each relevant circumstance of the interrogation before addressing the question whether all of the circumstances, taken together, indicate that Miller's confession was voluntary.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n1. Miller's Background\n\nMiller is a mature adult, thirty-two years of age. He is of normal intelligence and has some high school education. Such a person is more resistant to interrogation than a person who is very young, uneducated or weak-minded. Cf. Davis v. North Carolina, 384 U.S. 737, 16 L. Ed. 2d 895, 86 S. Ct. 1761 (1966) (detainee had third- or fourth-grade education and very low IQ); Fikes v. Alabama, supra (detainee was uneducated person of low intelligence, possibly with mental illness); Reck v. Pate, 367 U.S. 433, 6 L. Ed. 2d 948, 81 S. Ct. 1541 (1961) (detainee was mentally retarded). Miller was suffering from no painful physical ailment that would have impelled him to confess simply to put an end to the detention. Cf. Reck v. Pate, supra (detainee physically ill, at one point vomiting blood on the floor of the interrogation room); Leyra v. Denno, supra (detainee suffering from acutely painful sinus condition); Ziang Sung Wan v. United States, 266 U.S. 1, 69 L. Ed. 131, 45 S. Ct. 1 (1924) (detainee suffering from spastic colitis).\n\nMoreover, Miller had had previous experience with the criminal system; indeed, he had served a jail sentence. Thus, he was aware of the consequences of confessing. In addition to this experience, he received Miranda warnings. The Seventh Circuit has recently stressed the importance of a detainee's prior experience, as well as age and education, in determining whether a confession was voluntary. In United States v. Oglesby, 764 F.2d 1273, 1278 (7th Cir. 1985), the court noted that the accused had three prior felony convictions, had earned a substantial number of college credit hours and was fifty-four years old at the time of his confession. The court stated that \"the record reveals that the defendant was not disadvantaged by youthful ignorance or the naivete born of inexperience\" and concluded that he \"was able to resist whatever pressure was brought to bear on him by the FBI agent's promise to make his cooperation known to the United States Attorney . . . .\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n2. The Length of the Interrogation\n\nDetective Boyce's interrogation of Miller lasted less than an hour. It was not \"a process of interrogation . . . so prolonged and unremitting, especially when accompanied by deprivation of refreshment, rest or relief, as to accomplish extortion of an involuntary confession.\" Stein v. New York, supra, 346 U.S. at 184. It is thus distinguishable from the lengthy interrogations during incommunicado detention that have been held to result in involuntary confessions. See, e.g., Davis v. North Carolina, supra (sixteen days); Reck v. Pate, supra (four days); Payne v. Arkansas, 356 U.S. 560, 2 L. Ed. 2d 975, 78 S. Ct. 844 (1958) (forty-nine hours); Fikes v. Alabama, supra (two weeks); Ashcraft v. Tennessee, supra (thirty six hours); Ziang Sung Wan v. United States, supra (seven days). It is significant that cases in which psychological coercion has been found typically involved longer periods of interrogation than that to which Miller was submitted. See, e.g., Blackburn v. Alabama, supra (eight to nine hours); Spano v. New York, supra (two weeks); Leyra v. Denno, supra (four days); Watts v. Indiana, supra (five days). Moreover, Miller did not request the presence of either a lawyer or any other person to provide him with advice or moral support. Cf. Haynes v. Washington, supra (detainee not allowed to call his wife until he gave a written confession); Ziang Sun Wan v. United States, supra (detainee asked in vain to see his brother).\n\n3. Boyce's Friendly Approach\n\nBoyce's supportive, encouraging manner was an interrogation tactic aimed at winning Miller's trust and making him feel comfortable about confessing. Excessive friendliness on the part of an interrogator can be deceptive. In some instances, in combination with other tactics, it might create an atmosphere in which a suspect forgets that his questioner is in an adversarial role, and thereby prompt admissions that the suspect would ordinarily make only to a friend, not to the police. See Spano v. New York, supra, 360 U.S. at 323 (police officer, who was suspect's childhood friend, told suspect that his job would be in jeopardy if suspect did not confess and that the loss of his job would be disastrous for his three children, his wife and his unborn child); Leyra v. Denno, supra 347 U.S. at 559 (police psychiatrist, after telling suspect that he was a doctor who would give him help with his sinus headache, told suspect how much he wanted to help him with his legal predicament and described how good suspect would feel if he unburdened his conscience).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See also White, Police Trickery in Inducing Confessions, 127 U. Pa. L. Rev. 581, 614-17 (1979) (advocating per se rule against device of seeking to elicit incriminating information through assumption of a non-adversarial role); F. Royal \u0026 S. Schutt, The Gentle Art of Interviewing and Interrogation, 61-61 (1976), quoted in White, supra (\"Resistance to the disclosure of [incriminating] information is considerably increased . . . if something is not done to establish a friendly and trusting attitude on the part of the subject.\"). As John Gay has written:\n\nAn open foe may prove a curse, But a pretended friend is worse . . .\n\nQuoted in Spano v. New York, supra, 360 U.S. at 323.\n\nNevertheless, the \"good guy\" approach is recognized as a permissible interrogation tactic. See Royal \u0026 Schutt, supra, at 61-62. Moreover, the Supreme Court has indicated that a sympathetic attitude on the part of the interrogator is not in itself enough to render a confession involuntary. See, e.g., Beckwith v. United States, 425 U.S. 341, 343, 348, 48 L. Ed. 2d 1, 96 S. Ct. 1612 (1976) (interrogator adopted sympathetic attitude, but resulting confession was voluntary); Frazier v. Cupp, supra, 394 U.S. at 737-39 (same). Only if other aspects of the interrogation strengthened the illusion that it was non-adversarial in character could Miller's confession have been involuntary because of psychological coercion.\n\n4. Boyce's Lie\n\nWhile a lie told to the detainee about an important aspect of the case may affect the voluntariness of the confession, the effect of the lie must be analyzed in the context of all the circumstances of the interrogation. See e.g., Frazier v. Cupp, supra, 394 U.S. at 737, 739 (false statement by police officer that detainee's cousin had confessed, while relevant to issue of voluntariness, was insufficient to make otherwise voluntary confession inadmissible). We do not believe that the lie about the time of Ms. Margolin's death, by itself, constituted sufficient trickery to overcome Miller's will. Because Boyce never suggested that the time of Ms. Margolin's death might be relevant in linking Miller to the crime, the only possible effect of Boyce's initial statement that she was alive, followed by his report that she had just died, would be an emotional response in Miller. The drama of the announcement of the victim's death might have prompted particularly acute feeling in Miller, which could have helped to induce his confession. However, the record suggests that this emotional reaction did not occur, for it appears that Miller was not affected at all by the news of the death. Indeed, he remained quite impassive. We therefore conclude that any pathos or remorse he might have felt was not particularly strong.\n\n5. Boyce's Promises\n\nDetective Boyce's statements that Miller was not a criminal, but rather a mentally ill individual not responsible for his actions, and Boyce's promises to help Miller raise a more serious question about the voluntariness of Miller's confession. By telling Miller that he was not responsible for anything he might have done, Boyce may have been understood to be making an implied promise to Miller that Miller would not be prosecuted, or that if he were prosecuted Boyce would aid him in presenting the insanity defense. Similarly, the promises of psychiatric help might have suggested to Miller that he would be treated, rather than prosecuted. If these promises, implicit and explicit, tricked Miller into confessing, his confession may have been involuntary. To determine whether Boyce's promises affected the voluntariness of Miller's confession, we must consider how manipulative these tactics in fact were.\n\na. The Rule Respecting Promises Made During Interrogation\n\nIn Bram v. United States, 168 U.S. 532, 42 L. Ed. 568, 18 S. Ct. 183 (1897), the Supreme Court endorsed the view that to be voluntary, a confession must not have been \"'extracted by any sort of threats or violence, nor obtained by any direct or implied promises, however slight.'\" Id. at 542-43, quoting 3 Russell on Crimes (6th ed.) 478 (emphasis added). Although the Bram test has been reaffirmed in Hutto v. Ross, 429 U.S. 28, 30, 50 L. Ed. 2d 194, 97 S. Ct. 202 (1976) (per curiam), and in dictum in Brady v. United States, 397 U.S. 742, 753-54, 25 L. Ed. 2d 747, 90 S. Ct. 1463 (1970), it has not been interpreted as a per se proscription against promises made during interrogation. Nor does the Supreme Court even use a but-for test when promises have been made during an interrogation, despite the seemingly plain meaning of the Bram rule. Rather, the Court had indicated that it does not matter that the accused confessed because of the promise, so long as the promise did not overbear his will. See Hutto v. Ross, supra, 429 U.S. at 30. Apparently, the words \"obtained by . . . promises\" in the Bram test have been read to mean \"obtained because the suspect's will was overborne by . . . promises.\" In other words, promises do not trigger an analysis different from the totality of the circumstances test. See supra at 10-14.\n\nThus, courts have treated promises as part of the totality of the circumstances in assessing the voluntariness of confessions. See, e.g., Leyra v. Denno, supra, 347 U.S. at 559 (1954); United States v. Ferrara, 377 F.2d 16 (2d Cir.), cert. denied, 389 U.S. 908, 88 S. Ct. 225, 19 L. Ed. 2d 225 (1967); Rachlin v. United States, supra, 723 F.2d at 1377 (quoting Bram in a discussion of the totality of the circumstances test). As the Second Circuit stated in Ferrara, the Bram rule has never been applied with \"wooden literalness.\" 377 F.2d at 17. The Fourth Circuit has described the proper analysis of promises thus:\n\nDespite the broad language [in Bram ], the cases indicate that government agents may validly make some representation to a defendant or may discuss cooperation without rendering the resulting confession involuntary. Government agents may initiate conversations on cooperation, they may promise to make a defendant's cooperation known to the prosecutor, and they may even be able to make and breach certain promises without rendering a resulting confession involuntary. Nevertheless, there are certain promises whose attraction renders a resulting confession involuntary if the promises are not kept, and the defendant's perception of what government agents have promised is an important factor in determining voluntariness.\n\nUnited States v. Shears, 762 F.2d 397, 401-02 (4th Cir. 1985) (footnotes omitted). In short, there is no support in the case law for the dissent's statement that \"when promises, however slight, are made in the interrogation room rather than in the presence of counsel, those promises render the resulting confession inadmissible.\" Dissenting opinion, typescript at 42.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nb. The Promises Made to Miller\n\nDetective Boyce's tone of voice and his frequent repetition of assurances may have lent credibility to his implied promise that Miller would not be prosecuted. However, Miller had been given Miranda warnings, which included the admonition that anything that Miller said could be used against him. Thus, when the interrogation began, Miller knew that if he confessed to the Margolin murder he could be prosecuted. See Frazier v. Cupp, supra, 394 U.S. at 739 (\"Before petitioner made any incriminating statements, he received partial warnings of his constitutional rights; this is, of course, a circumstance quite relevant to a finding of voluntariness.\"). Cf. Robinson v. Smith, 451 F. Supp. 1278, 1282 (W.D.N.Y. 1978) (accused who was promised \"the benefits of any leniency that may come to him in the courts\" did not receive Miranda warnings and was not otherwise advised that he might involve himself in a murder charge by making a statement to the police). Detective Boyce's words of comfort would have had to overcome Miller's initial belief that the state intended to prosecute him and to sentence him to jail if convicted in order to render Miller's confession involuntary.\n\nAt no time did Detective Boyce state that Miller would not be prosecuted or that he could successfully avail himself of the insanity defense. Cf. United States v. Powe, 192 U.S. App. D.C. 224, 591 F.2d 833, 845 n.36 (D.C. Cir. 1978) (defendant testified that the detective who interrogated him \"made propositions to me as far as turning over drug dealers up in that area over to him, to drop my case and Mr. Harris' case\"). While innuendo might rise to the level of trickery, it is not so likely to break down resistance as is a promise that is spelled out. Indeed, Detective Boyce's statements that Miller was \"not a criminal\" need not be understood as assurances of leniency at all. Since the Detective's interrogation strategy was to present himself as a friend to whom Miller could unburden himself, he of course attempted throughout the interview to persuade Miller to trust him and confide in him. The statements at issue can be viewed as a means of convincing Miller that Boyce was sympathetic, no matter what the state's reaction might be. \"You are not responsible\" and \"You are not a criminal\" thus would mean \"In my eyes, you are not responsible or a criminal and therefore you should relieve your conscience by talking to me, who understands you.\"\n\nWhile such a statement might have made Miller feel more comfortable about speaking to Boyce, it would not render his confession the product of a mistaken belief that the state would grant him leniency. Detective Boyce never stated that anyone but he thought that Miller was \"not a criminal,\" nor did he state that he had any authority to affect the charges brought against Miller. See United States v. Sebetich, 776 F.2d 412, 422 (3d Cir. 1985) (police chief lacked authority to plea bargain); Rachlin v. United States, supra, 723 F.2d at 1376-77 (8th Cir. 1983) (Secret Service Agents lacked authority to plea bargain). Miller's confession may have been made in the hope of leniency, but that does not mean that it was made in response to a promise of leniency. See Rachlin v. United States, supra, 723 F.2d at 1378.\n\nWith regard to the psychiatric help, on the other hand, Boyce did make some outright promises. For example, he said, \"We're going to see to it that you get the proper help. This is our job, Frank.\" Such a promise could be quite compelling in itself and could also strengthen the implications that Miller might not be prosecuted at all.\n\nA distinction can be drawn, however, between promises of leniency in the imminent criminal proceedings against the defendant and promises of help with some collateral problem. In Bram, supra, there was an implied promise that the defendant would not be prosecuted if he confessed.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e In distinguishing Bram the Court in Brady, supra, noted that under the circumstances of the Bram case \"even a mild promise of leniency was deemed sufficient to bar the confession . . . .\" 397 U.S. at 754 (emphasis added). While promises of help with collateral problems have been found, in combination with other coercive factors, to render confessions involuntary, see, e.g., Leyra, supra, in general, such promises are less coercive to the accused than promises directly related to the criminal proceedings at hand.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe promises of help to Miller fall somewhere between promises relating to purely collateral issues and promises of leniency in the immediate criminal proceedings against Miller, for help with the \"problem\" might be interpreted to mean commitment to a psychiatric hospital in lieu of imprisonment. Indeed, in combination with the statements that Miller was \"not responsible,\" it could be interpreted to mean that there would be no prosecution of Miller. However, taking all these statements together, there is at most an implication that Miller will be treated leniently in the impending criminal proceedings. Boyce made no direct promise of such leniency; the only outright promise he made was to get Miller help with his psychological problem. As we have stated above, indirect promises do not have the potency of direct promises.\n\nIn a case quite similar to this one, the First Circuit recently found a confession to be voluntary. Bryant v. Vose, 85-1671 (1st Cir. March 6, 1986). During an interrogation of a murder suspect, the police chief told the detainee that, to the best of his knowledge, the general practice for persons who are \"crazy\" and commit serious crimes is for them \"to be sent for observation to Bridgewater [Hospital] . . . for observation, then they're determined whether or not they're capable of standing trial.\" Id., slip op. at 7-8. The court rejected the argument that the confession was the product of a promise of leniency. According to the court, \"The reference to Bridgewater did not directly suggest leniency, let alone promise it. Any indirect promise to be inferred from the Bridgewater remark is so slight as to be insignificant in these circumstances.\" Id., slip op. at 9 (emphasis added).\n\nLeyra v. Denno, 347 U.S. 556, 98 L. Ed. 948, 74 S. Ct. 716 (1954), in which a confession was held involuntary, is noteworthy because it illustrates the kinds of psychological pressures that can overbear a detainee's will. Although the detainee in Leyra was promised help with a collateral medical problem and was assured that \"he had done no moral wrong and would be let off easily,\" id. at 560, the situation in Leyra is quite different from the circumstances of Miller's confession. Leyra was questioned almost continually over the course of four days. He had had very little sleep and frequently \"complained about how tired and how sleepy he was and how he could not think;\" the Court noted that his answers to questions \"indicate[d] a mind dazed and bewildered.\" Id. Adding to the detainee's distress was an \"acutely painful attack of sinus,\" id. at 559, for which a police officer promised to get him medical help. Instead of a general practitioner or an eye, ear and nose specialist, a police psychiatrist with considerable knowledge of hypnosis, \"Dr. Helfand,\" arrived in the interrogation room. Dr. Helfand did not disclose the fact that he was a psychiatrist. His clever questioning technique induced Leyra's confession. The psychiatrist told Leyra \"how much he wanted to and could help him, how bad it would be for [Leyra] if he did not confess, and how much better he would feel, and how much lighter and easier it would be on him if he would just unbosom himself to the doctor.\" Id. at 559-60.\n\nWhile these statements bear a resemblance to the statements made by Detective Boyce, the obvious differences between the two situations render the interrogation of Miller much less coercive. Leyra was explicitly told that he would be let off easily. Moreover, he was interviewed for several days and was suffering from a painful sinus condition, as well as from extreme fatigue. In contrast, Miller was questioned less than an hour and was not suffering from lack of sleep or any other physical ailment. The promise of help with his supposed mental problem thus did not have the urgent appeal that a promise of help with acute physical pain would have. Any promise of prosecutorial leniency was made only by implication.\n\n6. Effect of the Totality of the Circumstances\n\nIn determining whether the circumstances described above indicate that Miller's confession was involuntary, we must consider whether Boyce's tactics were sufficiently manipulative to overbear the will of a person with Miller's characteristics. We thus recognize that \"the limits [of permissible questioning tactics] in any case depend upon a weighing of the circumstance of pressure against the power of resistance of the person confessing. What would be overpowering to the weak of will or mind might be utterly ineffective against an experienced criminal.\" Stein v. New York, supra, 346 U.S. at 185 (1953). See also Schneckloth, supra, 412 U.S. at 225-26.\n\nAs we have noted above, a significant portion of the questioning was in the typical police interrogation mode, developing chronologically Miller's whereabouts on the day in question, confronting him with the identification of his car, asking him point-blank as to whether he committed the crime, challenging his answers, and attempting to discover the details of the crime. This portion of the interrogation would not have an effect upon Miller's will. Moreover, the interrogation did not last very long, and Miller was not suffering from any painful ailment or physical deprivation that would impel him to confess in order to be released from the questioning room. Nor did Miller seek the presence of any other person or, indeed, make any request that was denied by Boyce.\n\nWhile Boyce's promises of psychiatric help and statements that Miller was \"not a criminal,\" in combination with his friendly manner, may have been a form of psychological trickery, we do not believe that these elements of the interrogation affected the voluntariness of the confession. Miller's personal characteristics, see supra at 14-15, support a conclusion that the confession was voluntary, for Miller does not seem to be the type of person whose will would be easily overborne by Boyce's remarks. Miller's age, intelligence and experience rendered him resistant to the level of persuasiveness that Boyce employed.\n\nMoreover, throughout the interview, Miller made remarks that indicate that he knew that this was an ordinary police interrogation, rather than an encounter with a compassionate friend, and that he was aware that a confession would result in criminal prosecution and possibly in conviction and sentence. Throughout the session, he appears to have retained a suspicious, guarded attitude. At one point, when Detective Boyce asked him if he wanted help, Miller replied, \"Yes, uh, huh, yes, but yet I'm, I'm not going to admit something that, that I wasn't involved in.\" In reply to the statement, \"I don't think you're a criminal, Frank,\" Miller said, \"No, but you're trying to make me one.\" The following exchange illustrates even more clearly Miller's distrustful attitude toward the Detective:\n\nBoyce: . . . It's hard for you, I realize that, how hard it is, how difficult it is, I realize that, but you've got to help yourself, before anybody else can help you. And we're going to see to it that you get the proper help. This is our job, Frank. This is our job. This is what I want to do.\n\nMiller: By sending me back down there.\n\nIt also is apparent that Miller's prior experience with the law made him wary of policemen.\n\nBoyce: . . . You have this problem like we talked about before, right?\n\nMiller: Yeah, you, you say this now, but this thing goes to court and everything and you . . .\n\nBoyce: No, listen to me, Frank, please listen to me. The issue now is what happened. The issue now is truth. Truth is the issue now. You've got to believe this, and the truth prevails in the end, Frank. You have to believe that and I'm sincere, when I'm saying it to you. You've got to be truthful with yourself.\n\nMiller: Yeah, truth, you say in the end, right? That's why I done three and a half years for . . .\n\nBoyce: Wait, whoa . . whoa\n\nMiller: . . . for a crime that I never committed because of one stinkin' detective framing me . . .\n\nBoyce: Frank, Frank.\n\nMiller: . . . by the name of Rocco.\n\nGiven these statements, it is difficult for us to believe that Miller was tricked into confessing. Rather, it seems that Miller made an uncoerced decision to unburden his inner tensions and to acknowledge his guilt.\n\nIndeed, from the tape of the interrogation, it clearly appears that the precipitating cause of Miller's confession was a desire to make a clean breast of it, rather than a reliance on any promises of leniency or psychiatric help. He expressed the reservation that \"this is going to kill my father.\" Thereupon, Detective Boyce made a speech about the importance of truthfulness both for himself and his family. Miller capitulated immediately thereafter. Apparently, he took Boyce's words to heart and decided that it would be better for all concerned if he told the truth.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nWe have little doubt that Detective Boyce's encouraging words, perhaps in combination with the sad announcement that the victim had just died, helped Miller to reach his decision to unburden himself. However, the test for voluntariness is not a but-for test, but a question of whether the confession was a product of free choice. As the Eleventh Circuit has pointed out, \"mere emotionalism and confusion do not necessarily invalidate\" confessions. Corn v. Zant, 708 F.2d 549, 567 (11th Cir. 1983), vacated in part on other grounds, 772 F.2d 681 (11th Cir. 1985). Many criminals experience an urge during interrogation to own up to their crimes, see O. Rogge , Why Men Confess 209-30 (1959), quoted in Grano, Voluntariness, Free Will, and the Law of Confessions, 65 Va. L. Rev. 859, 887 n.131 (1979); Driver, Confessions and the Social Psychology of Coercion, 82 Harv. L. Rev. 42, 57 (1968). Boyce's manner and his statements may have stirred this urge in Miller, but, in our view, they did not produce psychological pressure strong enough to overbear the will of a mature, experienced man, who was suffering from no mental or physical illness and was interrogated for less than an hour at a police station close to his home.\n\nDetective Boyce's method of interrogation might have overborne the will of another detainee, for example, a young, inexperienced person of lower intelligence than Miller, or a person suffering from a painful physical ailment. it might have overcome the will of Miller himself if the interrogation had been longer or if Miller had been refused food, sleep, or contact with a person he wished to see. Moreover, if Miller had made remarks that indicated that he truly believed that the state would treat him leniently because he was \"not responsible\" for what he had done or that he believed that he would receive psychiatric help rather than punishment, we might not find the confession voluntary. We hold simply that, under the totality of the circumstances of this case, the confession was voluntarily given.\n\nV. Conclusion\n\nExercising a plenary standard of review, we have concluded that under the totality of the circumstances, Miller's confession was voluntary and therefore admissible.\n\nThe judgment of the district court will be affirmed.\n\nGIBBONS, Circuit Judge, dissenting:\n\nWhen this unfortunate case was last before this court, the panel majority, disregarding a long and consistent line of Supreme Court precedent, held that the question of voluntariness of a confession was a question of fact upon which a federal court exercising habeas corpus jurisdiction must defer to the findings of state courts.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e That ruling placed this court at odds with eight federal circuits that had considered the issue. Not surprisingly, the Supreme Court reversed and remanded to this court for reconsideration in light of its reiteration of the settled law that federal tribunals should make a plenary determination of the question \"whether, under the totality of the circumstances, the confession was obtained in a manner consistent with the Constitution. . . .\" Miller v. Fenton, 474 U.S. 104, 106 S. Ct. 445, 453, 88 L. Ed. 2d 405 (1985). Undaunted, the author of this court's prior opinion reaches the same result, by holding that as a matter of law oral admissions by Frank M. Miller, Jr. were obtained in a manner consistent with the Constitution. In supporting that conclusion, however, the majority opinion carefully selects among the totality of the circumstances to which it chooses to refer, takes statements out of context, ignores the sole purpose of the interrogating officer, and attaches no significance to strong evidence that Miller's will was overborne. Moreover, by endorsing a thoroughly bad piece of police work, the majority sends a signal to the police community in this circuit that is likely to have the harmful consequence of encouraging coercion of defendants in place of acceptable methods of investigation.\n\nI.\n\nMiller is serving a life sentence for the murder of Deborah Margolin. On the afternoon of August 13, 1983 Ms. Margolin was sunbathing on the patio of her parents' farmhouse when a white car approached. As the car neared, Ms. Margolin's brothers observed that the trunk had been tied shut and that two dents marred its right-hand side. Trial Transcript, Dec. 4, 1973 at 167, 180, State v. Miller. At least one of the brothers observed the driver sufficiently to note that he was a male wearing loose-fitting clothes. Id. at 169. With her brother listening from the house, the driver told Ms. Margolin that a heifer was loose at the base of the driveway. She got in the family car and drove down the driveway. When she failed to return later that afternoon, a search party combed the area near her home. Her body was found lying face down in a stream, her throat slashed.\n\nThe description of the car fit a car driven by Frank Miller. Miller was known to the New Jersey State Police because he was then on parole from a 1969 conviction for carnal abuse. At 10:50 P.M. on the evening that Ms. Margolin's body was found, two police officers located the car and Miller at a plastic factory where Miller worked. An inspection of the car revealed two dents on the right-hand side and a spring holding down the trunk. At the plastics factory the two police officers interrogated Miller for forty to fifty minutes, tape-recording a part of the interrogation. Miller made no incriminating statement, but agreed to accompany them to the state police barracks. They arrived at the barracks at midnight. Miller was placed in the kitchen of the barracks under guard of another officer for over an hour. At 1:47 A.M. on August 14, Officer Charles Boyce began a second tape-recording interrogation of Miller. The interrogation lasted fifty-three minutes. For the first forty-two minutes Miller made no incriminating admissions. During the last eleven minutes of the interrogation, however, Miller orally admitted killing Deborah Margolin. He then collapsed and was removed to a hospital.\n\nThe issue in this appeal is whether Miller's admission, under the totality of the circumstances, was obtained in a manner consistent with the Constitution. The totality of the circumstances relevant to that inquiry includes the purpose of Officer Boyce's interrogation, the methods used in that interrogation, and the effects of those methods upon Miller.\n\nII.\n\nThe majority commences its analysis with the observation:\n\nA significant portion of the questioning was in the typical police interrogation mode, developing chronologically Miller's whereabouts on the day in question, confronting him with the identification of his car, asking him point-blank whether he committed the crime, challenging his answers and attempting to discover the details of the crime. This element of the interrogation is unexceptional and unchallenged.\n\nTypescript at 6. The majority is correct when it says this element of the interrogation is unchallenged. Miller has no reason to challenge it because that part of the interrogation does not tend to incriminate him. The assertion that it is unexceptional, however, illustrates the fundamental difference between the majority and the dissent with respect to the values that animate the procedural safeguards against self-incrimination. Many years ago, Justice Frankfurter articulated those values clearly when he observed that\n\nours is the accusatorial as opposed to the inquisitorial system. Such has been the characteristic of Anglo-American criminal justice system since it freed itself from practices borrowed by the Star Chamber . . . . Under our system society carries the burden of proving its charges against the accused not out of his own mouth. It must establish its case, not by interrogation of the accused even under judicial safeguards, but by evidence independently secured through skillful investigation.\n\nWatts v. Indiana, 338 U.S. 49, 54, 93 L. Ed. 1801, 69 S. Ct. 1347 (1949) (plurality opinion). That is the ideal to which the Constitution demands that we aspire and is the standard by which we should consider whether the interrogation conducted by Officer Boyce was unexceptional. Unfortunately, while the courts pay lip service to the ideal by imposing restraints on prosecuting attorneys in court, this legal posturing takes place after the police have completed their investigation. Unless this court is willing to find the interrogation that took place in this case to be unconstitutional, it will be placed, as the court which tried Miller was, in the position of merely ratifying the plea of guilty that the police had already obtained in its Star Chamber proceeding.\n\nI do not mean to suggest that an interrogation is never a legitimate tool of investigation. However, I do suggest, contrary to the majority, that an interrogation that has no investigative purpose and is used only as a means of obtaining a confession, is anything but unexceptional. In this case the interrogation of Miller had no purpose other than obtaining admissions that could be used to charge Miller with felony murder. Such an interrogation requires the closest scrutiny.\n\nWhen Boyce commenced the second interrogation, the state police had in their possession his unique automobile, which had been sufficiently described by Ms. Margolin's brothers that it promptly led them to Miller. They had already determined the hours of Miller's factory shift and thus knew that he was not at work during the critical time period. They had already interrogated him about his whereabouts during the critical time period and learned about a claimed alibi at the Ringoes, New Jersey Post Office, which could easily be checked upon in the morning. They knew from his past record that he was a sexually-disturbed person. They knew that one of Ms. Margolin's brothers had seen someone generally fitting Miller's description shortly before the homicide and could in all likelihood identify him. They could reasonably anticipate that an examination of Miller's automobile would produce evidence linking him to Ms. Margolin's death because the car contained fresh blood stains. They had no other suspects.\n\nThus the police did not need to conduct an interrogation directed at investigating the murder; it was already solved so far as they were concerned. The police could have, but did not, place Miller in a lineup so he could be identified as the person who spoke to Ms. Margolin. They could have, but did not, attempt to locate other witnesses who might have placed Miller near the scene of the crime. They could have, but did not, attempt to find witnesses who would undercut Miller's story about being at the Ringoes Post Office. Instead, the police conducted an interrogation directed at obtaining a confession from the sole suspect, and that interrogation was designed to assure Miller's prosecution for felony murder rather than a lesser offense.\n\nFor me, although obviously not for the majority, the most significant circumstance in this case supporting the conclusion that Miller's admission was obtained in a manner inconsistent with the Constitution is the complete absence of any legitimate investigative purpose for the interrogation. The circumstances of this case provide a classic illustration of the once common practice of obtaining guilty pleas in the back rooms of police stations rather than in open court. Moreover, the evidence of the method of interrogation must be examined in light of Officer Boyce's sole purpose -- the obtaining of admissions of guilt, not the solution of a crime which Boyce believed to be solved already.\n\nKeeping in mind that obtaining a confession, not investigating a crime, was Officer Boyce's sole purpose in conducting the interrogation, I turn to the methods he employed. The majority notes that Boyce \"made no threats and engaged in no physical coercion of Miller.\" Typescript at 6. That statement is true only in the sense that Boyce did not physically beat Miller. It is intended, however, to divert attention from the fact that the setting was inherently coercive. Miller was apprehended at his place of work late at night, interrogated there for nearly an hour, and then taken to a police barracks. He was kept in isolation under guard until Boyce's interrogation began. Boyce could have postponed the interrogation until Miller, who had just finished a factory shift, obtained a night's sleep. Instead he commenced the interrogation at 1:47 A.M. for the obvious purpose of maximizing the impact of the inherently coercive environment in which Miller found himself.\n\nThe majority stresses that Boyce \"repeatedly assured Miller that he was sympathetic to him and wanted to help him unburden his mind.\" Id. Admittedly, Boyce did feign sympathy for Miller, but clearly unburdening Miller's mind was not Boyce's purpose. The repeated assurances, the friendly, understanding manner, and the soft tone of voice to which the majority makes reference were all directed to a single purpose -- making an unwilling defendant admit his guilt. Referring to the detective's statement as sympathy as \"maudlin\" is deceptive. Every word, every nuance of expression, every change in tone of voice, was calculated toward one end, and one end only -- obtaining an admission of guilt. From the tone of the majority opinion one might believe that its author actually credits these deceptive expressions of sympathy. But as the majority well knows the state police are not in the business of acting as religious or psychiatric counselors. Boyce was not sympathetic. He was no more interested in helping Miller \"unburden his inner tensions,\" Typescript at 33, than he was in any other aspect of Miller's health. Instead Boyce was determined and ultimately successful in obtaining from an unwilling defendant the one thing that was his purpose -- a confession.\n\nAnnexed to this opinion as an appendix is a transcript of Boyce's interrogation. Keeping Boyce's singular purpose in mind, that transcription conveys an entirely different effect than the majority attributes to the interrogation in its abridged account. The impression conveyed by the tape recording is even more compelling. The admissions, which came during the last eleven minutes, were the product of Boyce's factual misstatements about the investigation, misrepresentations about his intentions, and false promises. The majority concedes that Boyce lied to Miller in one material respect. In fact there were far more lies than the one that the majority so cavalierly discounts.\n\nAfter obtaining a signature on a Miranda warning card, Boyce commenced the interrogation by going back over statements made by Miller in the interrogation at the plastics factory. Although the majority suggests otherwise, the transcript discloses throughout that the second interrogation was a continuation of the first interrogation. The line of inquiry about prior statements produced a slight discrepancy with respect to time, which Boyce described as raising \"a big question mark in my mind right now.\" He then pointed out that fresh blood had been found on the left front interior portion of Miller's vehicle. This statement was true. It was, however, just about the last true statement Boyce made. Immediately thereafter he exaggerated:\n\nBOYCE: We have a witness, Frank, now this is point 4. We have a witness who identified your car, who, no, I'm, I'm sorry, let me, I shouldn't say your car, who identified a vehicle that fits the description of your car, at this girl's home, speaking with her, telling her something about a cow being loose. Someone who was there who wanted to help her, they didn't want to hurt this girl, they didn't want to hurt this girl, Frank, they wanted to help her. You see, I know this, I know that, . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . because I can appreciate that, because I would have done the same thing. If there was something to be rectified, or if somebody had a problem, I would have done the same thing. I would have wanted to help her. The vehicle that came onto the property.\n\nMILLER: Right.\n\nBOYCE: . . . fits the description of your vehicle.\n\nMILLER: It does.\n\nBOYCE: Yes. Now, that's the fourth point. And when I say fits the description, what I mean, Frank, is it fits the description to a 't,' and as we talked about before, how many other vehicles are there like yours in the country right now?\n\nMILLER: There shouldn't be too many, if any. . .\n\nBOYCE: If any . . .\n\nMILLER: Because of the damage on the right-hand side.\n\nBOYCE: Now, what would your conclusion be under those circumstances, if someone told you that.\n\nMILLER: I'd probably, uh, have the same conclusion you got.\n\nBOYCE: Which is what?\n\nMILLER: That I'm the guy that did this.\n\nBOYCE: That did what?\n\nMILLER: Committed this crime.\n\nThe reference to a witness identifying the car, while exaggerated, since the car had not been shown to the witness, was at least generally consistent with the facts. But the reference to what was the strongest evidence against Miller was clearly intertwined with the suggestion that the person who came on the Margolin's property came there for a beneficent purpose. When Boyce said, \"If there was something to be rectified, or if somebody had a problem, I would have done the same thing,\" his obvious purpose of coupling the reference to the state's strongest evidence with the reference to a good Samaritan's interest in the loose heifer was to break down Miller's will. Up to that point in the interrogation Miller, acting consistently with what was his own best interest, had refused to incriminate himself.\n\nThe good Samaritan reference was the first of a series of similar devious psychological ploys. Immediately following the noted exchange, Boyce again exaggerated:\n\nBOYCE: I think the guy driving this car . . . wait, let me, I forgot something . . . We have a physical description . . .\n\nMILLER: Uh huh.\n\nBOYCE: . . . of this individual from another witness. The physical description Frank, . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . Fits you and the clothes you were wearing.\n\nIn fact the police had only a general description, and as noted above, never bothered with a lineup. As a result no identification of Miller was introduced at trial. Immediately after confronting Miller with this supposedly conclusive identification, Boyce adopted the psychological ploy of offering Miller help with his problem:\n\nBOYCE: Frank, I don't think you're a criminal. I don't think you're a criminal. I don't think you have a criminal mind. As a matter of fact, I know you don't have a criminal mind, because we've been talking now for a few hours together, haven't we?\n\nMILLER: Right.\n\nBOYCE: Right?\n\nMILLER: Yeah.\n\nBOYCE: You don't have a criminal mind.\n\nMILLER: No.\n\nBOYCE: I know you don't. But, like I noted before, we all have problems.\n\nMILLER: Right.\n\nBOYCE: Am I right?\n\nBOYCE: And you agree with me?\n\nMILLER: Yes, sir.\n\nBOYCE: I have problems and you have.\n\nMILLER: Right.\n\nBOYCE: Now, how do you solve a problem?\n\nMILLER: That depends on the problem.\n\nBOYCE: Your problem how do we solve it? How are we going to solve it?\n\nMILLER: This I don't know.\n\nBOYCE: Do you want me to help you solve it?\n\nMILLER: Yeah.\n\nBOYCE: You want me to extend all the help I can possibly give you, don't you?\n\nMILLER: Right.\n\nBOYCE: Are you willing to do the same for me?\n\nMILLER: Yeah.\n\nBOYCE: Now, I feel . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . who is ever, whoever is responsible for this act . . .\n\nMILLER: Yeah.\n\nBOYCE: He's not a criminal. Does not have a criminal mind. I thing they have aproblem [sic].\n\nMILLER: Uh, huh.\n\nBOYCE: Do you agree with me?\n\nMILLER: Yeah.\n\nBOYCE: They have a problem.\n\nMILLER: Right.\n\nBOYCE: A problem, and a good thing about that Frank, is a problem can be rectified.\n\nMILLER: Yeah.\n\nBOYCE: I want to help you. I mean I really want to help you, but you know what they say, God helps those who help themselves, Frank.\n\nMILLER: Right.\n\nBOYCE: We've got to get together on this. You know what I'm talking about, don't you?\n\nthat, you know, that like you say, I'm identified and my car's identified, and uh, we got to get together on this.\n\nBOYCE: Yes we do. Now, that's only a few of the items . . .\n\nMILLER: Uh, huh.\n\nBOYCE: . . . that we have now. Your problem, I'm not, let's forget this incident, okay . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . let's forget this incident, let's talk about your problem. This is what, this is what I'm concerned with, Frank, your problem.\n\nMILLER: Right.\n\nBOYCE: ly If I had a problem like your problem, I would want you to help me with my problem.\n\nMILLER: Uh, huh.\n\nBOYCE: Now, you know what I'm talking about.\n\nMILLER: Yeah.\n\nBOYCE: And I know, and I think that, uh, a lot of other people know. You know what I'm talking about, I don't think you're a criminal, Frank.\n\nMILLER: No, but you're trying to make me one.\n\nBOYCE: No I'm not, no I'm not, but I want you to talk to me so we can get this thing worked out. This is what I want, this is what I want, Frank. I mean it's all there, it's all there, I'm not saying . . .\n\n(Emphasis supplied). [At this point the phone rings and Boyce answers it].\n\nThe colloquy establishes that the interrogation is a continuation of the interrogation that occurred several hours earlier at Miller's place of employment. It also establishes that the suggestion that Boyce would help Miller with his \"problem\" was made in the earlier interrogation as well. Although the majority opinion selectively quotes from this colloquy, it conveniently omits Boyce's unequivocal denial of Miller's accusation that he was trying to make him a criminal rather than help him.\n\nImmediately following the interruption by the telephone call, which occurred about twenty minutes into the interrogation, Miller asked and Boyce responded: MILLER: Let me ask you a question.\n\nBOYCE: Sure.\n\nMILLER: Now you say this girl's dead, right?\n\nBOYCE: She died just a few minutes ago. I just got . . . that's what the call was about.\n\nMILLER: Cause Officer Scott said she was in the hospital and I said well then let's go, you know, go right over there.\n\nBOYCE: She was in the hospital . . .\n\nMILLER: And, uh . . .\n\nBOYCE: . . . the call that Detective Doyle got, that's, that's what that call was.\n\nMILLER: Cause, I told him . . .\n\nThe majority, acknowledging that the police had previously lied to Miller that Ms. Margolin had survived and that Boyce repeated the lie about the time of her death, attempts to put the deliberate trickery in a positive light, observing,\n\nWe do not believe that the lie about the time of Ms. Margolin's death, by itself, constituted sufficient trickery to overcome Miller's will. Because Boyce never suggested that the time of Ms. Margolin's death might be relevant in linking Miller to the crime, the only possible effect of Boyce's initial statement that she was alive, followed by his report that she had just died, would be an emotional response in Miller.\n\nTypescript at 20-21. There are several glaring deficiencies in this attempted justification. First, it ignores the plain fact that, by initially suggesting to Miller that Ms. Margolin survived, the police intended to leave him with the impression that she would eventually identify him. When that ploy proved to be unsuccessful in breaking down his will, Boyce shifted to a different tactic, by announcing, falsely, that she had just died. Boyce hoped, as the majority concedes, to evoke an emotional response in Miller. Admitting that this was an attempt at psychological coercion, the majority explains it away with the preposterous statement, \"However, the record suggests that this emotional reaction did not occur, for it appears that Miller was not affected at all by the news of the death.\" Typescript at 21. What the record actually discloses is that the interrogation continued as follows:\n\nBOYCE: Are you, do you feel what I feel right now?\n\nMILLER: I feel pretty bad.\n\nBOYCE: Do you want to talk to me about it?\n\nMILLER: There's nothing I can tell . . .\n\nBOYCE: About how you feel?\n\nMILLER: . . . there's nothing I can talk, I mean I feel sorry for this girl, I mean, uh, this is something that, you know\n\nBOYCE: That what?\n\nMILLER: Well, it's a shame, uh . . .\n\nBOYCE: What did she say to you?\n\nMILLER: Beg your pardon?\n\nBOYCE: What did she say to you?\n\nMILLER: Who?\n\nBOYCE: This girl?\n\nMILLER: I never talked to this girl. If she was to walk in here now, I wouldn't know, know that she was the girl that, uh, you're talking about.\n\nBOYCE: But you were identified as being there talking to her minutes before she was ly. . . probably this thing had happened to her. How can you explain that?\n\nMILLER: I can't.\n\nBOYCE: Why?\n\nMILLER: I don't know why, but I, I, ylu know, how can I explain something that I don't know anything about.\n\nBOYCE: Frank, look, you want, you want help, don't you Frank?\n\nMILLER: Yes, uh huh, yes, but yet I'm I'm not going to admit to something that, that I wasn't involved in.\n\nBOYCE: We don't want you to, all I want you to do is talk to me, that's all. I'm not talking about admitting to anything. Frank, I want you to talk to me. I want you to tell me what you think. I want you to tell me how you think about this, what you think about this?\n\nMILLER: What I think about it?\n\nBOYCE: Yeah.\n\nMILLER: I think whoever did it really needs help.\n\nBOYCE: And that's what I think and that's what I know. They don't, they don't need punishment, right? Like you said, they need help.\n\nMILLER: Right.\n\nBOYCE: They don't need punishment. They need help, good medical help.\n\nMILLER: That's right.\n\nBOYCE: . . . to rectify their problem. Putting them in, in a prison isn't going to solve it, is it?\n\nBOYCE: That's right. That's the, that's not going to solve your problem is it?\n\nonly thing you learn is how to, you know . . .\n\nBOYCE: Well, let's say this Frank, suppose you lywere the person who needed help. What would you want somebody to do for you?\n\nMILLER: Help me.\n\nBOYCE: In what way?\n\nBOYCE: What, what do you think compels somebody to do something like this. What do you think it is, Frank?\n\nBOYCE: Give me an example.\n\nuh, you know, a lot, and just, you know, don't know what they, what they did once they been drinking. It could be somebody with narcotics that, that don't know what they're, you know, what they're doing once they shot up or took some pills or whatever they do, I don't know, I'm not a drug addict and never intend to be.\n\nBOYCE: What else Frank? What other type of person would do something like this?\n\nMILLER: Somebody with a mental problem.\n\nBOYCE: Right. Somebody with a . . .\n\nMILLER: Mental problem . . .\n\nBOYCE: . . . serious mental problem, and you know what I'm interested in, I'm not, I'm interested in, in preventing this in the future.\n\nMILLER: Right.\n\nBOYCE: Now, don't you think it's better if someone knows that he or she has a mental problem to come forward with it and say, look, I've, I've, I've done these acts, I'm responsible for this, but I want to be helped, I couldn't help myself, I had no control of myself and if I'm examined properly you'll find out that's the case. Is that right or wrong?\n\nand, uh, you know, maybe a doctor could find out what's wrong with em.\n\nBOYCE: Have you ever been examined?\n\nMILLER: Yes.\n\nBOYCE: And did you have a problem?\n\nuh, September, the uh stipulation was, uh, that I see a psychiatrist.\n\nBOYCE: Alright . . .\n\nCenter, I seen him two, maybe three times and last time I was there he gave me a test . . .\n\nBOYCE: Uh, huh.\n\nplain English. If the big wheel turns one way, what way does the little wheel turn? So I took that test. He says, alright, he says, I say when do I come back, because this is part of my parole.\n\nBOYCE: I see.\n\nknow, he says I want to get this, work this test out first. He up to this date, the man has never called me, uh . . .\n\nBOYCE: How do you feel about this?\n\nMILLER: Well, I think it's wrong.\n\nBOYCE: Would you, do you, did you feel that after not finding out the results of that test that you might do something that you might not be responsible for?\n\nMILLER: No.\n\nBOYCE: Did you feel that you were capable, maybe, of doing something because you didn't get the results of this . . . because they didn't like, help you, did they?\n\nMILLER: No.\n\nBOYCE: Well, then did you still feel this way that something might happen it would be their fault because, as far as I'm concerned if something did happen, it's not your fault, it's their fault . . .\n\nMILLER: Right.\n\nBOYCE: . . . because that was a part of your parole . . .\n\nMILLER: Right.\n\nBOYCE: . . . and they didn't live up to it.\n\nMILLER: Right.\n\nBOYCE: You agree with me?\n\nMILLER: Yeah, that . . .\n\nBOYCE: So, therefore, if you did commit an act, actually they're the ones that are to blame, in my eyes . . .\n\nMILLER: Right.\n\nBOYCE: . . . not you as an individual. You were there seeking help. You went there, they didn't right, you went there voluntarily, right?\n\nBOYCE: It was all set up.\n\nparole officer, I believe set it up. At that time it was, uh, Gene, uh, DiGennie, I believe his name was.\n\nBOYCE: DiGianni.\n\nMILLER: DiGianni.\n\nBOYCE: Frank, you're very, very nervous. Now, I, I don't, you know, you, you're, you understand what I'm saying?\n\nMILLER: Yeah, I know what you're saying.\n\nBOYCE: Now, there's a reason for that, isn't there?\n\nMILLER: Yes.\n\nBOYCE: Do you want to tell me about it?\n\nBOYCE: Is what, does it, does it, does it visibly shake you physically?\n\nScott can tell you, it ain't been not even a month ago I sat right in the same room . . .\n\nBOYCE: Uh, huh.\n\nbecause she was a minor her father forced her into making statements, which, she didn't lie on the statements. I tried to cover up with Officer Scott until I heard from her and she said yes, she says, I did tell him, she says, I had to tell him. So, then when I talked to my lawyer, you know, I admitted to him, I admitted to my parole officer, I said I'm not making a liar out of the girl, cause I love her too much and so I admitted, you know, he asked me if we were having sex . . .\n\nBOYCE: Alright. What . . .\n\n(Emphasis supplied). At this point, twenty-seven minutes into the second interrogation, it was briefly interrupted while the recording cassette was turned over. Boyce had by then spent seven minutes attempting to capitalize on the emotional response he attempted to elicit by his staged phone call about Ms. Margolin's recent death. I leave it to the reader to judge whether this colloquy establishes that, in the words of the majority opinion, Miller \"remained quite impassive.\" Typescript at 21. Having listened to the tape recording on several occasions, I represent that Miller sounds, at this point of the interrogation, increasingly tense and emotional. So emotional, indeed, that the interrogator, Boyce, stated, \"Frank, you're very, very nervous.\"\n\nThe colloquy above, occurring immediately following Boyce's lie about the time of death, is not mentioned by the majority in connection with the police lies because the majority, bent on a result, has chosen to judge the police conduct not in light of the totality of the circumstances, but by subdividing each instance of police misconduct and discussing it in isolation. Thus it chooses to treat the colloquy that immediately followed Boyce's lies under the heading of Boyce's promises. These are dismissed with the observation, \"While such statement might have made Miller feel more comfortable about speaking to Boyce, it would not render his confession the product of a mistaken belief that the state would grant him leniency.\" Typescript at 26. The total unfairness of that cavalier dismissal of the intended effect upon Miller's will may best be judged in light of the colloquy that continued as soon as the tape recorder was turned on:\n\nBOYCE: Now listen to me Frank. This hurts me more than it hurts you, because I love people.\n\nMILLER: It can't hurt you anymore than it hurts me.\n\nBOYCE: Okay, listen Frank, I want you . . .\n\nMILLER: I mean even being involved in something like this.\n\nBOYCE: Okay, listen Frank, If I promise to, you know, do all I can with the psychiatrist and everything, and we get the proper help for you, and get the proper help for you, will you talk to me about it ?\n\nMILLER: I can't talk to you about something I'm not . . .\n\nBOYCE: Alright, listen Frank, alright, honest. I know, I know what's going on inside you, Frank. I want to help you, you know, between us right now. I know what [sic] going on inside you. Frank, you've got to come forward and tell me that you want to help yourself. You've got to talk to me about it. This is the only way we'll be able to work it out. I mean, you know, listen, I want to help you, because you are in my mind, you are not responsible. You are not responsible, Frank. Frank, what's the matter ?\n\nMILLER: I feel bad.\n\nBOYCE: Frank, listen to me, honest to God, I'm, I'm telling you, Frank (inaudible). I know, it's going to bother you, Frank, it's going to bother you. It's there, it's not going to go away, it's there. It's right in front of you, Frank. Am I right or wrong?\n\nMILLER: Yeah.\n\nBOYCE: You can see it Frank, you can feel it, you can feel it, but you are not responsible. This is what I'm trying to tell you, but you've got to come forward and tell me. Don't, don't, don't let it eat you up, don't, don't fight it. You've got to rectify it, Frank. We've got to get together on this thing, or I, I mean really, you need help, you need proper help and you know it, my God, you know, in God's name you, you, you know it. You are not a criminal, you are not a criminal.\n\nMILLER: Alright. Yes, I was over there and I talked to her about the cow and left. I left in my car and I stopped up on the road where, you know, where the cow had been and she followed me in her car . . .\n\n(Emphasis supplied). Thus, approximately thirty minutes into the second interrogation, Miller made his first incriminating statement. By far the largest part of that thirty minutes is comprised of lies and promises by Boyce. The majority's suggestion that these lies and promises had no effect upon Miller's will is utter speculation. The lies and promises were directed to the sole purpose of obtaining a confession. There is nothing in the record from which it can be inferred that Miller's abandonment of his self-interested denials of involvement in the homicide was the product of any other influence. The majority opinion describes Boyce's conduct as if he were a confessor, offering solace under the seal of the confessional, or a psychiatrist offering relief from anxiety under the shelter of a physician-patient privilege, rather than what he was -- a wily interrogator determined to break down Miller's resistance by lies and false promises. The majority's treatment of the police tactics leading to Miller's collapse is about as fair as those tactics. Confession may be good for the soul, but it was Miller's freedom, not his soul, that was at stake, and it was his freedom, not his soul, that interested Boyce.\n\nOnce Miller made the blunder of placing himself in the victim's company, Boyce quickly pressed his advantage. Miller at first attempted to concoct a childishly implausible story about witnessing an attack by a stranger. Boyce continued with the psychological ploy of promising assistance, saying, \"Let it come out, Frank. I'm here, I'm here with you now. I'm on your side, I'm on your side, Frank. I'm your brother, you and I are brothers Frank. We are brothers, and I want to help my brother.\" When Miller persisted in the tale about the stranger, Boyce asked: \"Listen Frank, this guy, do you know him? Do you know where he lives?\" and Miller responded, \"No, I don't know where he lives.\" At that point the tape recording becomes inaudible, indicating that Miller is temporarily unable to talk. Then, for the first time Boyce asked Miller directly, \"You killed the girl didn't you?\" Miller's denial prompted a resort to further promises of help:\n\nBOYCE: Honest, Frank? It's got to come out. You can't leave it in. It's hard for you, I realize that, how hard it is, how difficult it is, I realize that, but you've got to help yourself before anybody else can help you. And we're going to see to it that you get the proper help. This is our job, Frank. This is our job. This is what I want to do.\n\nMILLER: By sending me back down there.\n\nBOYCE: Wait a second now, don't talk about going back down there. First thing we have to do is let it all come out. Don't fight it because it's worse, Frank, it's worse. It's hurting me because I feel it. I feel it wanting to come out, but it's hurting me, Frank. You're my brother, I mean we're brothers. All men on this, all men on the face of this earth are brothers, Frank, but you got to be completely honest with me.\n\nMILLER: I'm trying to be, but you don't want to believe me.\n\nBOYCE: I want to believe you, Frank, but I want you to tell me the truth, Frank, and you know what I'm talking about and I know what you're talking about. You've got to tell me the truth. I can't help you without the truth.\n\nMILLER: I'm telling you the truth. Sure, that's her blood in the car because when I seen the way she was cut I wanted to help her, and then when she fell over I got scared to even be involved in something like this, being on parole and . . .\n\n(Emphasis supplied).\n\nThe majority dismisses Boyce's statements with the comment that Boyce never \"state[d] that he had any authority to affect the charges against Miller.\" Typescript at 27. It is quite impossible to gather any other meaning from the words \"and we're going to see that you get the proper help. This is our job, Frank. This is our job. This is what I want to do.\"\n\nBy the thirty-fifth minute of the interrogation Boyce had an admission from Miller that Ms. Margolin's body had been in his car, but Miller still persisted in his denial that he had killed her. At that point Boyce shifted to a new tactic, suggesting for the first time that the homicide may have been an accident, and thereby suggesting to Miller another way in which Boyce could help him. The interrogation continued:\n\nBOYCE: I realize this, Frank, it may have been an accident. Isn't that possible, Frank? Isn't that possible?\n\nMILLER: Sure, it's possible.\n\nBOYCE: Well, this is what I'm trying to bring out, Frank. It may be something that, that you did that you can't be held accountable for. This is, I can help you, I can help you once you tell me the truth. You know what I'm talking about. I want to help you, Frank. I like you. You've been honest with me. You've been sincere and I've been the same way with you. Now this is the kind of relationship we have, but I can't help you unless you tell me the complete truth. I'll listen to you. I understand, Frank. You have to believe that, I understand. I understand how you feel. I understand how much it must hurt you inside. I know how you feel because I feel it too. Because some day I may be in the same situation Frank, but you've got to help yourself. Tell me exactly what happened, tell me the truth, Frank, please.\n\nMILLER: I'm trying to tell you the truth.\n\nBOYCE: Let me help you. It could have been an accident. You, you've got to tell me the truth, Frank. You know what I'm talking about. I can't help you without the truth. Now you know and I know that's, that's, that's all that counts, Frank. You know and I know that's what counts, that's what it's all about. We can't hide it from each other because we both know, but you've got to be willing to help yourself. You know, I don't think you're a criminal. You have this problem like we talked about before, right?\n\nMILLER: Yeah, you, you say this now, but this thing goes to court and everything and you . . .\n\n(Emphasis supplied).L\n\nFaced with Miller's reference at this point to the possible use of his admissions against him in court and his attempt to discuss a prior experience with the law, Boyce was prompted to interrupt:\n\nBOYCE: Wait, whoa, whoa\n\nBOYCE: Frank, Frank\n\nBOYCE: Frank, you, you're talking to me now. We have, we have a relationship, don't we? Have I been sincere with you, Frank?\n\nMILLER: Yea, yes.\n\nBOYCE: . . . have I been honest?\n\nMILLER: Yes.\n\nBOYCE: Have I defined your problem, Frank? Have I been willing to help you? Have I stated I was willing to help you all I can?\n\nMILLER: Yes.\n\nBOYCE: Do I mean it?\n\nMILLER: YES.\n\nThus as soon as Miller's mind turned to the dangerous area of possible self-incrimination Boyce took immediate steps to negate whatever residual effects the Miranda warnings, given forty minutes before, might have had. He immediately reiterated that he was only interested in helping Miller, not in obtaining admissions to be used against him. Boyce immediately thereafter reassured Miller:\n\nBOYCE: Whenever I talk to anybody I talk the same way, because you have, a very, very serious problem, and we want to prevent anything in the future. This is what's important, Frank, not what happened in the past. It's right now, we're living now, Frank, we want to help you now. You've got a lot more, a lot more years to live.\n\nMILLER: No, I don't.\n\nBOYCE: Yes, you do.\n\nMILLER: No, I don't.\n\nBOYCE: Don't say you don't. Now you've go to tell me.\n\nMILLER: Not after all this, because this is going to kill my father.\n\nMiller's totally out-of-place reference to his father at this point suggests a highly emotional and confused state of mind. Boyce immediately capitalized on his emotional state by suggesting:\n\nBOYCE: . . . You've got to do it for yourself, for your family, for your father, this is what's important the truth, Frank. Just tell me. You didn't mean to kill her did you?\n\nBOYCE: What made you do this, please tell me. Please tell me now. What made you do this?\n\nMILLER: I don't know.\n\nMiller's response, \"I don't know,\" forty-two minutes into the interrogation, was the first statement that could be construed as an admission that he had slashed Ms. Margolin's throat. At that point the tone of the interrogation immediately changed. Although Boyce twice more repeated that \"you've got to get the proper help, Frank,\" and \"I just want you to come out and tell me, so I can help you, that's all,\" the interrogation became quite crisp and specific. Once Miller was broken, Boyce's interrogation was carefully designed to elicit evidence that would support a charge that the homicide took place during an attempted rape; a charge that in New Jersey amounts to felony murder. The last eleven minutes of the interrogation is strikingly different from what went before. Miller, who until the critical admission thirty minutes into the interrogation had successfully resisted admitting being with Ms. Margolin, and who for the next twelve minutes continued to maintain he did not kill her, was led like an automaton through a series of admissions that totally incriminated him. The difference in the tone of the interrogation, during the last eleven minutes, of which the majority takes no notice, indicates that Miller's will to resist self-incrimination had been was overborne.\n\nThe tape-recorded session ended at 2:45 A.M. The last questions of significance were these:\n\nBOYCE: Would you be willing to sit down with us while we take a statement from you?\n\nMILLER: Yes.\n\nBOYCE: So it can be incorporated, you follow me?\n\nMILLER: Yeah.\n\nBOYCE: In order to help you.\n\nMILLER: Uh, huh.\n\nThus even at the end of the tape recorded session Boyce continued to represent that the written statement, which he could conveniently substitute for the tape recording, was \"In order to help [Miller].\" We may be reasonably certain that the written statement, had it been signed, would have contained only the questions and answers in the last eleven minutes of the tape recording, for only these were useful in establishing that Miller committed a felony murder.\n\nThe reason why the state had to preserve and make use of the tape-recorded interrogation appears in Boyce's testimony at the suppression hearing:\n\nQ. I gather that [a] statement was never taken, is that right?\n\nA. It was not.\n\nQ. Why was that, Officer?\n\nA. Momentarily after terminating this particular interview Mr. Miller went into as I can best define it a state of shock.\n\nQ. What do you mean by that, sir?\n\nA. He was sitting on a chair - . . . Mr. Miller had been sitting on a chair, had slid off the chair on the floor maintaining a blank stare on his face, staring straight ahead and we were unable to get any type of verbal response from him.\n\nQ. As I understand it he was then removed to the Hunterdon Medical Center, is that right?\n\nA. Yes, the first aid squad was contacted immediately.\n\nTrial Transcript, Dec. 4, 1973, at 84-85, State v. Miller.\n\nIncredibly, the only reference in the majority's opinion to Miller's collapse is the cryptic sentence at the end of Part I: \"One hour into the interrogation, Miller confessed to the murder of Deborah Margolin, then passed out.\" Typescript at 3. The majority does not even recognize Miller's collapse into a catatonic state and his transportation to a hospital as relevant circumstances in its totality of the circumstances analysis! This most telling of all indications as to the effect on Miller of Boyce's tactics is simply ignored. Instead the majority opinion perversely reasons that Boyce's manner and statements may have stirred in Miller the urge to confess, \"but, in our view, they did not produce psychological pressure strong enough to overbear the will of a mature, experienced man, who was suffering from no mental or physical illness . . . .\" Typescript at 35. The reasoning is perverse because it ignores the fact that at the end of the interrogation Miller collapsed and was taken to a hospital. How can it be honestly represented that he was suffering from no mental or physical illness? And, unless the majority identifies some other reason for Miller's abrupt abandonment of his self-interested denials of guilt than the psychological coercion exercised by Boyce, what other cause is left?\n\nThe tape recording reveals that while at first Miller was lucid by the second half of the interrogation he was far from fully oriented. It reveals erratic behavior and moments of lucidity interlaced with sudden withdrawal. At one point, in response to the question whether being involved in something like this visibly shook him, Miller fell into an incongruous reverie about a former lover, also a minor. For example, Miller stated,\n\nYes, it does, because, well, Officer Scott can tell you, it ain't been not even a month ago I sat in the same room . . . behind the girl that I really loved, because she was a minor her father forced her into making statements, which, she didn't lie on the statements. I tried to cover up with Officer Scott until I heard from her and she said yes, she says, I did tell him, she says. I had to tell him. So, then when I talked to my lawyer, you know, I admitted to him, I admitted to my parole officer, I said I'm not making a liar out of the girl, cause I love her too much and so I admitted, you know, he asked me if we were having sex . . . and, uh, I had no intentions of making a liar out of her.\n\nWhatever this pathetic mixture of heroism, self-pity, self-deception, and depression may have meant, it surely is not indicative of a mature man in control of his will to resist. Nor does the sobbing on the tape that begins immediately after this nonsensical passage reveal a man in full control of his faculties. Nor does his palpably immature reference to the loss of his father's esteem, of which Boyce promptly took advantage, suggest mature psychological development. The only record evidence supporting the majority's description of Miller as a \"mature, experienced man\" is Miller's age. No mature experienced man in full control of his faculties would have responded to Boyce's psychological ploys so inappropriately. Indeed the implausible prevarications to which he resorted in an effort to explain away the slip he made in admitting that Ms. Margolin's body had been in his car -- the tale of the man who came from nowhere, cut her throat, and cut his hand -- is roughly at the response level of a pre-adolescent child. Miller, a man with a history of mental illness and a ninth-grade education, sounds on the tape recording, and reads in the transcription, both unstable and childlike. Boyce, on the other hand, sounds like a strong-willed person fully knowledgeable about Miller's psychological weaknesses and prepared to exploit them in order to overcome Miller's will to avoid self-incrimination.\n\nIII.\n\nJust as it selectively ignores critical segments of the interrogation, the majority selectively ignores established precedent in its effort to concoct a legal justification for holding Miller's confession voluntary. The majority concedes, without enthusiasm, that a confession obtained in an interrogation accompanied by physical violence is deemed per se involuntary. Typescript at 12. The majority also admits that psychological coercion can often be equally effective in overcoming the constitutional right to remain silent. Id. at 11. Finally, the majority recognizes that the court must consider the totality of the circumstances. Id. at 12. But instead of treating the issue as one of law, in which the reviewing court weight the circumstances to determine whether a confession obtained in such a totality of circumstances violates appropriate norms of police conduct, the majority makes the unwarranted assumption that no matter how outrageously the police behave, short of physical violence, a confession may be used if a majority of a reviewing court arrives at the subjective belief that the defendant's will was not overborne. As I point out in Part II, the facts indicate that Miller's will was overcome. But a factual determination of the affects of the interrogation on Miller's will is not required. As a matter of law some police conduct in the interrogation process simply cannot be tolerated.\n\nIt has long been established that confessions obtained by virtue of even implied promises of leniency are deemed to be inadmissible. See Bram v. United States, 168 U.S. 532, 542-43, 42 L. Ed. 568, 18 S. Ct. 183 (1897). The majority attempts to undercut the authority of the Bram rule by suggesting that it is no longer interpreted as a per se proscription against promises made during interrogations. The two Supreme Court cases cited in support of that proposition do not sustain it. Both cases state that promises made to a defendant in the presence of the defendant's attorney do not suffer from the same vice as promises made in the secrecy of police interrogation rooms. See Hutto v. Ross, 429 U.S. 28, 29, 50 L. Ed. 2d 194, 97 S. Ct. 202 (1976) (per curiam); Brady v. United States, 397 U.S. 742, 754, 25 L. Ed. 2d 747, 90 S. Ct. 1463 (1970). The Brady court made this distinction explicitly, explaining that\n\nBram dealt with a confession given by a defendant in custody, alone and unrepresented by counsel. In such circumstances, even a mild promise of leniency was deemed sufficient to bar a confession, not because the promise was an illegal act as such, but because defendants at such times are too sensitive to inducement and the possible impact on them too great to ignore and to difficult to assess.\n\n397 U.S. at 754. The Hutto Court cited and reiterated the Bram test, stating, \"The test is whether the confession was 'extracted by any sort of threats or violence, [or] obtained by any direct or implied promises, however slight, [or] by the exertion of any improper influence.\" 429 U.S. at 30. The Supreme Court has never retreated from the Bram holding.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Indeed, other federal circuit courts of appeals have consistently cited the Bram test as the standard by which voluntariness will be evaluated. See, e.g., United States v. Costello, 750 F.2d 553, 555 (7th Cir. 1984); United States v. Gonzalez, 736 F.2d 981, 982 (4th Cir. 1984); Jarrell v. Balkcom, 735 F.2d 1242, 1250, (11th Cir. 1984), cert. denied, 471 U.S. 1103, 105 S. Ct. 2331, 85 L. Ed. 2d 848 (1985); Rachlin v. United States, 723 F.2d 1373, 1377 (8th Cir. 1983). Therefore, when promises, however slight, are made in the interrogation room rather than in the presence of counsel, those promises render the resulting confession inadmissible.\n\nBoyce's second interrogation cannot be read in pieces. Its effect was cumulative, as it was intended to be. From the moment he began it, Boyce put relentless psychological pressure on Miller.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Boyce repeatedly assured Miller that he only wanted to help Miller, that Miller was not a criminal, that Miller was not responsible for his actions, and that Miller would not be punished. In addition to those express promises, Boyce confused Miller by lying to him about the time of Ms. Margolin's death and the strength of the evidence against Miller.\n\nThe majority emphasizes that the key issue is whether, in the totality of the circumstances, Miller's will was overborne. While I agree with the majority's general focus, I disagree with the majority's method of analysis. In ascertaining the effects of Boyce's interrogation tactics on Miller, the majority attempts to place itself in Miller's position and thereby evaluate the impact of Boyce's promises and lies. Unfortunately, we cannot know what affects those promises and lies had on Miller's will. Instead what we can know is that when, as in this case, the record reveals a series of repeated promises of psychological help and assurances that the suspect will not be punished, Bram requires as a matter of law that we hold the resulting confession to be coerced. Any other rule leads to the kind of subjective speculation that the majority engages in. Thus applying the Bram rule within the totality of the circumstances\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e of Miller's interrogation, the confession used to commit Miller must be declared inadmissible as a violation of Miller's fifth amendment right to remain silent.\n\nConclusion\n\nThe judges in the majority, determined at any cost to reach the end that no relief will be given to a person they feel to be the perpetrator of a heinous offense, have distorted the record and misstated the law with respect to permissible police methods of interrogation. I share their obvious abhorrence of Mr. Miller's offense. It is well, however, to recall Justice Frankfurter's admonition that \"law triumphs when the natural impulses aroused by a shocking crime yield to safeguards which our civilization has evolved for an administration of criminal justice at once rational and effective.\" Watts v. Indiana, 338 U.S. 49, 55, 93 L. Ed. 1801, 69 S. Ct. 1347 (1949). The majority has yielded to the natural impulses rather than to the safeguards that the law has imposed to restrain abusive methods of interrogation. I dissent.\n\nAPPENDIX*fn*\n\nBOYCE: Testing 1 2 3. Testing 1 2 3. (Cough) Testing 1 2 3. Testing.\n\nBOYCE: Tuesday (cough), Tuesday, August 14, 1973, 1:47 A.M., Flemington State Police Barracks, Detectives' room, this is the start of an interrogation between Detective William Doyle, 1884, New Jersey State Police, Detective Boyce, 2097, also from the New Jersey State Police, and one Frank Melvin Miller, and this interrogation is in reference to the investigation now being conducted which involves the death of Miss Deborah Selma Margolin, white female, age 17, Brown Station Road, R.D. Ringoes, New Jersey. That's a correction, that's Browne Station Road. This death occurring sometime approximately between 11:15 A.M., 8/13/73, and 5:45 P.M., 8/13/73.\n\nBOYCE: Now, Mr. Miller, uh Frank, I talked to you earlier.\n\nMILLER: Yeah, at PFD.\n\nBOYCE: At PFD where you're employed. I was accompanied by Trooper Robert Scott at that time.\n\nMILLER: Yes, sir.\n\nBOYCE: We identified ourselves and we spoke to you on a voluntary basis in which you extended your cooperation to us, uh, in regards to this investigation of the death of the girl that I have just mentioned.\n\nMILLER: Yes, sir.\n\nBOYCE: You agreed at that time, voluntarily, to speak with us in regards to this matter . . .\n\nMILLER: Yes, sir.\n\nBOYCE: . . . also gave us permission while we were there to look at your vehicle . . .\n\nMILLER: Yes, sir.\n\nBOYCE: . . . to take clothing from your locker . . .\n\nMILLER: Yes, sir.\n\nBOYCE: . . . which is located inside the PFD plant, all of this being done, of course, with the cooperation that was extended to us from you on a voluntary basis.\n\nMILLER: Right.\n\nBOYCE: Now, Frank, you've been here since approximately 11, 11:49 P.M. which would actually be yesterday, 8/13/73. What I'm going to do at this time and, of course, let me just reiterate here, you, you, you came down, you accompanied Trooper Scott and myself here on a voluntary basis . . . that correct?\n\nMILLER: Right.\n\nBOYCE: Okay, and of your own free will?\n\nMILLER: Yes, sir.\n\nBOYCE: Without duress?\n\nMILLER: Yes, sir.\n\nBOYCE: Or having been threatened to do so.\n\nMILLER: Right.\n\nBOYCE: Okay, and while you were here you've been conversing again on a voluntary basis, with Trooper Scott, is that not right?\n\nMILLER: Yes, sir.\n\nBOYCE: Okay (cough). What I'm going to do at this time, as I've indicated already, you've been here for awhile, it is now almost 2:00 A.M. on the 14th, which puts you here approximately 2 hours. I'm going to advise you at this time of your constitutional rights, which you are entitled to, and start off by saying: Number 1, you have the right to remain silent and not to answer any questions, Number 2, if you decide to waive your right to remain silent, anything you say will be used against you if it is incriminating in nature. You have the right to be represented by an attorney before and during any questioning. If you want an attorney and cannot afford one, an attorney will be provided for you free by the State of New Jersey. Do you understand these rights, Frank?\n\nMILLER: Yes, sir.\n\nBOYCE: Are you willing to talk to us without having an attorney? In reference . . .\n\nMILLER: Yes.\n\nBOYCE: . . . to the, what we have talked about?\n\nMILLER: Yes.\n\nBOYCE: Okay, fine.\n\nMILLER: But, at any time though, I can, uh, say no, right? I mean, you know . . .\n\nBOYCE: Yes, Frank, let me go over that again.\n\nMILLER: Yeah, I understand that, that . . .\n\nBOYCE: You understand your rights, Frank?\n\nMILLER: Yeah.\n\nBOYCE: Okay. (cough). You may stop at anytime during this interrogation . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . and request to remain silent and we will honor your request.\n\nMILLER: Yes.\n\nBOYCE: Okay?\n\nMILLER: Yeah.\n\nBOYCE: Now, we're talking about the death of a young girl, Frank, right?\n\nMILLER: Yes, sir.\n\nBOYCE: . . . very attractive, a very attractive young girl, who apparently at the time of her death was wearing nothing but a bathing suit, two piece bathing suit. We feel that there's a sexual aspect at this time is a good indication that there is some type of sexual assault that's associated with this crime. . . Before we continue, Frank, what I would like to ask you to do is, I'm going to ask you to sign the back of this card, okay, with your rights on it, indicating that you in fact have been . . .\n\nMILLER: Yeah, yeah . . .\n\nBOYCE: . . . advised of your rights.\n\nMILLER: I got a pen right here.\n\nBOYCE: Just sign the back of that and date it. (Clanging noises.) Today's the 14th.\n\nMILLER: You want it signed the 14th?\n\nBOYCE: Yes, please.\n\nMILLER: Alright.\n\nBOYCE: Okay.\n\nMILLER: Alright?\n\nBOYCE: Thank you. Now, getting back to the, uh, the death of Miss Margolin, which we were discussing, you already related to me and Trooper Scott at the time in which you did it that as to where you were and what your activities were yesterday.\n\nMILLER: Right, right.\n\nBOYCE: You indicated you came back into the Ringoes area about 11:00 A.M., is that correct?\n\nMILLER: It was somewheres in there, yeah, give or take a little bit of time.\n\nBOYCE: Let's try and narrow that down, Frank. Can you think of anything that would give you any indication as to why you say now you came back into the area sometime around 11 o'clock.\n\nMILLER: Well, this is what I told you at the barracks, or I mean at PFD. I figured it was between 11, uh, around 11 o'clock, because I figured I got home around 11:30, quarter to 12, back to my parents' house and I had stopped at the Post Office in Ringoes to mail a letter which I forgot to mail this morning, or yesterday morning.\n\nBOYCE: Alright, but, in other words what I'm saying Frank is how can you substantiate in your mind, in your mind . . .\n\nMILLER: Uh, huh.\n\nBOYCE: . . . as to wh . . . how, why you feel a this time that you arrived in Ringoes, went to the Post Office around 11 o'clock, can you tell me how you came to this conclusion, or what was, what activity you were involved in prior to getting, getting into Ringoes that would come to your mind as, you know, making you think that you arrived in Ringoes at 11 o'clock?\n\nMILLER: Well, because I was home around 11:30, quarter to 12, because, uh, so I figured, uh, it had to be somewheres around 11 o'clock that I was in Ringoes, that's about the only thing I can think of.\n\nBOYCE: Alright, now, before, when I confronted you with the time element, you said that you were in Ringoes at 11, you got home around 12 o'clock, now, you say 11:30 or quarter to 12. Now, I'm going to ask you a question, how long does it take you to drive your vehicle from the Ringoes Post Office to your father's house?\n\nMILLER: That depends on how fast you go.\n\nBOYCE: Okay, let's say if you drive at a normal rate of speed.\n\nMILLER: I'd say maybe 20 minutes.\n\nBOYCE: 20 minutes. How far would you say it is, Frank?\n\nMILLER: Oh, 6, 7 miles, maybe.\n\nBOYCE: 6, 7 miles. Now, you've indicated once prior to this interrogation that you got home around 12. Now you've indicated 11:30, quarter to 12. Now, what time did you get home, Frank?\n\nMILLER: I'm not exactly sure.\n\nBOYCE: Now that, now you're not sure.\n\nMILLER: Well, I, I say, uh, I figure anywheres from 11:30 to 12 o'clock, quarter to 12, somewheres around there . . .\n\nBOYCE: Alright . . .\n\nMILLER: . . . because I didn't look at the clock.\n\nBOYCE: Okay. Why do you think it was somewhere around there?\n\nMILLER: Because I got myself something to eat and, uh, got my stuff together to get ready to go to work, and I wanted to stop up the hospital to see how this fella was . . .\n\nBOYCE: What time did you leave, how long were you, what time did you arrive at the Post Office? Approximately?\n\nMILLER: I'd say around 11 o'clock.\n\nBOYCE: Okay, how long were you in the Post Office, Frank?\n\nMILLER: A few minutes is all.\n\nBOYCE: A few minutes. What did you do when you walked outside, Frank?\n\nMILLER: Got in my car.\n\nBOYCE: And went where?\n\nMILLER: Home.\n\nBOYCE: Okay, Frank. You indicated it takes approximately 20 minutes to drive home.\n\nMILLER: Approximately, yeah.\n\nBOYCE: Therefore, you would have arrived home in the area of 11:15, 11:20 A.M., but you indicated to me on 4, 5, maybe 6, 7, 8, 9 occasions already that you arrived home between quarter to 12, 12 o'clock. Now, I'm . . . am I right?\n\nMILLER: Yeah.\n\nBOYCE: Okay, now, this is a problem.\n\nMILLER: I realize this . . .\n\nBOYCE: This creates a very serious problem.\n\nLYLYMILLER: Times, I uh, you know, I uh . . .\n\nBOYCE: Oh, well, you know, it's not so much times, knowing what time it is, but you do know how long it takes you to get from point A to point B, you've already indicated . . .\n\nMILLER: Yeah, approximately.\n\nBOYCE: Approximately 20 minutes.\n\nMILLER: Right.\n\nBOYCE: So that's 11:15, 11:20\n\nMILLER: Right\n\nBOYCE: 12 o'clock comes to your mind and I see a 40 minute, anywhere from a half hour to a 40 minute period . . . where are we, where are you, is what I should say?\n\nMILLER: Yeah.\n\nBOYCE: And I, I just, you know, this, this, I have a big question mark in my mind right now.\n\nMILLER: Right.\n\nBOYCE: Do you see my point, Frank?\n\nMILLER: Yes, sir.\n\nBOYCE: That's point one. Your car, right now . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . is dented on the right side?\n\nMILLER: Right.\n\nBOYCE: Your trunk is, I should, may be I should use the words sprang down, because this is some type of a metal spring . . .\n\nMILLER: Right, yeah.\n\nBOYCE: . . . securing the trunk of your vehicle. There is red dust on the vehicle, red dust that is visible to the naked eye . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . when someone looks at it. It's got red clay or dirt in and around the wheel covers . . .\n\nMILLER: Uh, huh.\n\nBOYCE: . . . tires. I'll bet you right now, Frank, there is not another vehicle in Hunterdon County that fits the physical description that we, that Trooper Scott and I saw your vehicle in when we saw it up there tonight. I'll bet you, that I, I can call up a thousand people right now and there will not be another vehicle that fits the description of your vehicle. Am I right?\n\nMILLER: There shouldn't be, no, not with the right side of it dented in like that.\n\nBOYCE: That's the second point. You're with me now, right?\n\nMILLER: Yeah.\n\nBOYCE: Okay. Your vehicle was involved in an accident, was involved in two accidents.\n\nMILLER: Two accidents.\n\nBOYCE: There was blood found on the left front interior portion of your vehicle, tonight, fresh blood.\n\nMILLER: Fresh blood?\n\nBOYCE: Yes, sir. This is very, very serious.\n\nMILLER: I realize this.\n\nBOYCE: That's point 3. Now, you live a few miles from the scent where this young, innocent girl was found.\n\nMILLER: Uh, huh.\n\nBOYCE: You indicate that between 11 and 12 yesterday morning, between 11 and 12, one hour, 60 minutes, you went from, according to your statement . . .\n\nMILLER: Right.\n\nBOYCE: . . . the Ringoes Post Office to your house, a trip admitted to me by yourself that takes maybe 20 minutes.\n\nMILLER: About 20 minutes, right.\n\nBOYCE: You wear, and you have a lot of, dark blue trousers.\n\nMILLER: Right.\n\nBOYCE: You have a lot of light blue shirts.\n\nMILLER: Right.\n\nBOYCE: I know. I have a lot of them in my custody now. We went to your house last night and found blood stains on the front stoop.\n\nMILLER: On the front stoop?\n\nBOYCE: Yes, sir.\n\nMILLER: Well, how did it get there?\n\nBOYCE: I don't know Frank. Let me ask you, how did it get there?\n\nMILLER: I have no idea.\n\nBOYCE: We obtained a sample of the blood.\n\nMILLER: Right.\n\nBOYCE: Obtained a sample from the vehicle.\n\nMILLER: Uh, huh.\n\nBOYCE: We have a witness, Frank, now this is point 4. We have a witness who identified your car, who, no, I'm, I'm sorry, let me, I shouldn't say your car, who identified a vehicle that fits the description of your car, at this girl's home, speaking with her, telling her something about a cow being loose. Someone who was there who wanted to help her, they didn't want to hurt this girl, they didn't want to hurt this girl, Frank, they wanted to help her. You see, I know this, I know that, . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . because I can appreciate that, because I would have done the same thing. If there was something to be rectified, or if somebody had a problem, I would have done the same thing. I would have wanted to help her. The vehicle that came onto her property.\n\nMILLER: Right.\n\nBOYCE: . . . fits the description of your vehicle.\n\nMILLER: It does.\n\nBOYCE: Yes. Now, that's the fourth point. And when I say fits the description, what I mean, Frank, is it fits the description to a 't,' and as we talked about before, how many other vehicles are there like yours in the County right now?\n\nMILLER: There shouldn't be too many, if any . . .\n\nBOYCE: If any . .\n\nMILLER: Because of the damage on the right-hand side.\n\nBOYCE: Now, what would your conclusion be under those circumstances, if someone told you that?\n\nMILLER: I'd probably, uh, have the same conclusion you got.\n\nBOYCE: Which is what?\n\nMILLER: That I'm the guy that did this.\n\nBOYCE: That did what?\n\nMILLER: Committed this crime.\n\nBOYCE: What crime?\n\nMILLER: Well, you said before the girl was dead, killed, killed this girl.\n\nBOYCE: Who killed this girl?\n\nMILLER: The guy driving this car.\n\nBOYCE: I think the guy driving this car . . . wait, let me, I forgot something . . . We have a physical description . . .\n\nMILLER: Un huh.\n\nBOYCE: . . . of this individual from another witness. The physical description Frank, . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . Fits you and the clothes you were wearing. Frank, I don't think you're a criminal. I don't think you're a criminal. I don't think you have a criminal mind. As a matter of fact, I know you don't have a criminal mind, because we've been talking now for a few hours together, haven't we?\n\nMILLER: Right.\n\nBOYCE: Right?\n\nMILLER: Yeah.\n\nBOYCE: You don't have a criminal mind.\n\nMILLER: No.\n\nBOYCE: I know you don't. But, like I noted before, we all have problems.\n\nMILLER: Right.\n\nBOYCE: Am I right?\n\nMILLER: Yeah, you said this over there at the plant.\n\nBOYCE: And you agree with me?\n\nMILLER: Yes, sir.\n\nBOYCE: I have problems and you have.\n\nMILLER: Right.\n\nBOYCE: Now, how do you solve a problem?\n\nMILLER: That depends on the problem.\n\nBOYCE: Your problem how do we solve it? How are we going to solve it?\n\nMILLER: This I don't know.\n\nBOYCE: Do you want me to help you solve it?\n\nMILLER: Yeah.\n\nBOYCE: You want me to extend all the help I can possibly give you, don't you?\n\nMILLER: Right.\n\nBOYCE: Are you willing to do the same to me?\n\nMILLER: Yeah.\n\nBOYCE: Now, I feel . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . who is ever, whoever is responsible for this act . . .\n\nMILLER: Yeah.\n\nBOYCE: He's not a criminal. Does not have a criminal mind. I think they have aproblem.\n\nMILLER: Uh, huh.\n\nBOYCE: Do you agree with me?\n\nMILLER: Yeah.\n\nBOYCE: They have a problem?\n\nMILLER: Right.\n\nBOYCE: A problem, and a good thing about that Frank, is a problem can be rectified.\n\nMILLER: Yeah.\n\nBOYCE: I want to help you. I mean I really want to help you, but you know what they say, God helps those who help themselves, Frank.\n\nMILLER: Right.\n\nBOYCE: We've got to get together on this. You know what I'm talking about, don't you?\n\nMILLER: Yeah, especially if they're trying to say that, you know, that like you say, I'm identified and my car's identified, and uh, we got to get together on this.\n\nBOYCE: Yes we do. Now, that's only a few of the items . . .\n\nMILLER: Uh, huh.\n\nBOYCE: . . . that we have now. Your problem, I'm not, let's forget this incident, okay . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . let's forget this incident, let's talk about your problem. This is what, this is what I'm concerned with, Frank, your problem.\n\nMILLER: Right.\n\nBOYCE: If I had a problem like your problem, I would want you to help me with my problem.\n\nMILLER: Uh, huh.\n\nBOYCE: Now, you know what I'm talking about.\n\nMILLER: Yeah.\n\nBOYCE: And I know, and I think that, uh, a lot of other people know. You know what I'm talking about. I don't think you're a criminal, Frank.\n\nMILLER: No, but you're trying to make me one.\n\nBOYCE: No I'm not, no I'm not, but I want you to talk to me so we can get this thing worked out. This is what I want, this is what I want, Frank. I mean it's all there, it's all there. I'm not saying . . .\n\nMILLER: Let me ask you a question.\n\nBOYCE: Sure.\n\nMILLER: Now you say this girl's dead, right?\n\nBOYCE: She died just a few minutes ago. I just got . . . that's what the call was about.\n\nMILLER: Cause Officer Scott said she was in the hospital and I said well then let's go, you know, go right over there.\n\nBOYCE: She was in the hospital . . .\n\nMILLER: And, uh . .\n\nBOYCE: . . . the call that Detective Doyle got, that's, that's what that call was.\n\nMILLER: Cause, I told him . . .\n\nBOYCE: Are you, do you feel what I feel right now?\n\nMILLER: I feel pretty bad.\n\nBOYCE: Do you want to talk to me about it?\n\nMILLER: There's nothing I can tell . . .\n\nBOYCE: About how you feel?\n\nMILLER: . . . there's nothing I can talk, I mean I feel sorry for this girl, I mean, uh, this is something that, you know . . .\n\nBOYCE: That what?\n\nMILLER: Well, it's a shame, uh . . .\n\nBOYCE: What did she say to you?\n\nMILLER: Beg your pardon?\n\nBOYCE: What did she say to you?\n\nMILLER: Who?\n\nBOYCE: This girl?\n\nMILLER: I never talked to this girl. If she was to walk in here now, I wouldn't know, know that she was the girl that, uh, you're talking about.\n\nBOYCE: But you were identified as being there talking to her minutes before she was . . . probably this thing that happened to her. How can you explain that?\n\nMILLER: I can't\n\nBOYCE: Why?\n\nMILLER: I don't know why, but I, I, you know, how can I explain something that I don't know anything about.\n\nBOYCE: Frank, look, you want, you want help, don't you Frank?\n\nMILLER: Yes, uh huh, yes, but yet I'm, I'm not going to admit to something that, that I wasn't involved in.\n\nBOYCE: We don't want you to, all I want you to do is talk to me, that's all. I'm not talking about admitting to anything, Frank, I want you to talk to me. I want you to tell me what you think. I want you to tell me how you think about this, what you think about this?\n\nMILLER: What I think about it?\n\nBOYCE: Yeah.\n\nMILLER: I think whoever did it really needs help.\n\nBOYCE: And that's what I think and that's what I know. They don't, they don't need punishment, right? Like you said, they need help.\n\nMILLER: Right.\n\nBOYCE: They don't need punishment. They need help, good medical help.\n\nMILLER: That's right.\n\nBOYCE: . . . to rectify their problem. Putting them in, in a prison isn't going to solve it, is it?\n\nMILLER: No, sir. I know, I was in there for three and a half years.\n\nBOYCE: That's right. That's the, that's not going to solve your problem is it?\n\nMILLER: No, you get no help down there. The only thing you learn is how to, you know . . .\n\nBOYCE: Well, let's say this Frank, suppose you were the person who needed help. What would you want somebody to do for you?\n\nMILLER: Help me.\n\nBOYCE: In what way?\n\nMILLER: In any way that they, they see, you know, fit, that it would help me.\n\nBOYCE: What, what do you think compels somebody to do something like this. What do you think it is, Frank?\n\nMILLER: Well, it could be a number of things.\n\nBOYCE: Give me an example.\n\nMILLER: It could be a person that, that drinks, uh, you know, a lot, and just, you know, don't know what they, what they did once they been drinking. It could be somebody with narcotics that, that don't know what they're, you know, what they're doing once they shot up or took some pills or whatever they do, I don't know, I'm not a drug addict and never intend to be.\n\nBOYCE: What else Frank? What other type of person would do something like this?\n\nMILLER: Somebody with a mental problem.\n\nBOYCE: Right. Somebody with a . . .\n\nMILLER: Mental problem . . .\n\nBOYCE: . . . serious medical problems, and you know what I'm interested in, I'm not, I'm interested in, in preventing this in the future.\n\nMILLER: Right.\n\nBOYCE: Now, don't you think it's better if someone knows that he or she has a mental problem to come forward with it and say, look, I've, I've, I've done these acts. I'm responsible for this, but I want to be helped, I couldn't help myself, I had no control of myself and if I'm examined properly you'll find out that's the case. Is that right or wrong?\n\nMILLER: Yeah, that, they should be examined and, uh, you know, maybe a doctor could find out what's wrong with em.\n\nBOYCE: Have you ever been examined?\n\nMILLER: Yes.\n\nBOYCE: And did you have a problem?\n\nMILLER: Well, when I come, uh, made parole in, uh, September, the uh stipulation was, uh, that I see a psychiatrist.\n\nBOYCE: Alright . . .\n\nMILLER: Dr. Taylor over here at the Medical Center, I seen him, two, maybe three times and last time I was there he gave me a test . . .\n\nBOYCE: Uh, huh.\n\nMILLER: . . . uh, it was a bunch of bull shit, in plain English. If the big wheel turns one way, what way does the little wheel turn? So I took that test. He says, alright, he says, I say when do I come back, because this is part of my parole.\n\nBOYCE: I see.\n\nMILLER: And he says, uh, I'll call you and let you know, he says I want to get this, work this test out first. He up to this date, the man has never called me, uh . . .\n\nBOYCE: How do you feel about this?\n\nMILLER: Well, I think it's wrong.\n\nBOYCE: Would you, do you, did you feel that after not finding out the results of that test that you might do something that you might not be responsible for?\n\nMILLER: No.\n\nBOYCE: Did you feel that you were capable, maybe, of doing something because you didn't get the results of this. . because they didn't like, help you, did they?\n\nMILLER: No.\n\nBOYCE: Well, then did you still feel this way that something might happen it would be their fault because, as far as I'm concerned if something did happen, it's not your fault, it's their fault . . .\n\nMILLER: Right.\n\nBOYCE: . . . because that was part of your parole . . .\n\nMILLER: Right.\n\nBOYCE: . . . and they didn't live up to it.\n\nMILLER: Right.\n\nBOYCE: You agree with me?\n\nMILLER: Yeah, that . . .\n\nBOYCE: So, therefore, if you did commit an act, actually they're the ones that are to blame, in my eyes . . .\n\nMILLER: Right.\n\nBOYCE: . . . not you as an individual. You were there seeking help. You went there, they didn't right, you went there voluntarily, right?\n\nMILLER: Right. It was, uh, it was all set up through . . .\n\nBOYCE: It was all set up.\n\nMILLER: . . . the parole board, or well, my parole officer, I believe set it up. At that time it was, uh, Gene, uh, DiGennie, I believe his name was.\n\nBOYCE: DiGianni.\n\nMILLER: DiGianni.\n\nBOYCE: Frank, you're very, very nervous. Now, I, I don't, you know, you, you're, you understand what I'm saying?\n\nMILLER: Yeah. I know what you're saying.\n\nBOYCE: Now, there's a reason for that, isn't there?\n\nMILLER: Yes.\n\nBOYCE: Do you want to tell me about it?\n\nMILLER: Being involved in something like this is . . .\n\nBOYCE: Is what, does it, does it, does it visibly shake you physically?\n\nMILLER: Yes, it does, because, well, Officer Scott can tell you, it ain't been not even a month ago I sat right in the same room . . .\n\nBOYCE: Uh, huh.\n\nMILLER: . . . behind the girl that I really loved, because she was a minor her father forced here into making statements, which, she didn't lie on the statements. I tried to cover up with Officer Scott until I heard from her and she said yes, she says, I did tell him, she says, I had to tell him. So, then when I talked to my lawyer, you know, I admitted to him, I admitted to my parole officer, I said I'm not making a liar out of the girl, cause I love her too much and so I admitted, you know, he asked me if we were having sex . . .\n\nBOYCE: Alright. What . . .\n\nMILLER: . . . and, uh, I had no intentions of making a liar out of her. SIDE TWO\n\nBOYCE: Testing 1 2 3. Testing.\n\nBOYCE: Now listen to me Frank. This hurts me more than it hurts you, because I love people.\n\nMILLER: It can't hurt you anymore than it hurts me.\n\nBOYCE: Okay, listen Frank, I want you . . .\n\nMILLER: I mean even being involved in something like this.\n\nBOYCE: Okay, listen Frank, if I promise to, you know, do all I can with the psychiatrist and everything, and we get the proper help for you, and get the proper help for you, will you talk to me about it?\n\nMILLER: I can't talk to you about something I'm not . . .\n\nBOYCE: Alright, listen Frank, alright, honest. I know, I know what's going on inside you, Frank. I want to help you, you know, between us right now. I know what going on inside you. Frank, you've got to come forward and tell me that you want to help yourself. You've got to talk to me about it. This is the only way we'll be able to work it out. I mean, you know, listen, I want to help you, because you are in my mind, you are not responsible. You are not responsible, Frank. Frank, what's the matter?\n\nMILLER: I feel bad.\n\nBOYCE: Frank, listen to me, honest to God, I'm, I'm telling you, Frank (inaudible). I know, it's going to bother you, Frank, it's going to bother you. It's there, it's not going to go away, it's there. It's right in front of you, Frank. Am I right or wrong?\n\nMILLER: Yeah.\n\nBOYCE: You can see it Frank, you can feel it, you can feel it but you are not responsible. This is what I'm trying to tell you, but you've got to come forward and tell me. Don't, don't, don't let it eat you up, don't, don't fight it. You've got to rectify it, Frank. We've got to get together on this thing, or I, I mean really, you need help, you need proper help and you know it, my God, you know, in God's name, you, you know it. You are not a criminal, you are not a criminal.\n\nMILLER: Alright. Yes, I was over there and I talked to her about the cow and left. I left in my car and I stopped up on the road where, you know, where the cow had been and she followed me in her car . . .\n\nBOYCE: Right.\n\nMILLER: . . . and the cow wasn't down there and we started walking through the fields and stuff, and you could see where the cow was.\n\nLYBOYCE: Uh, huh.\n\nMILLER: Now, I don't know . . .\n\nBOYCE: Now, Frank please . . .\n\nMILLER: Wait, wait a minute.\n\nBOYCE: I'm sorry, I'm sorry.\n\nMILLER: Okay, okay.\n\nBOYCE: Go ahead, I'm sorry.\n\nMILLER: I don't know where this guy come from . . .\n\nBOYCE: Tell me about him, I'm sorry, go ahead.\n\nMILLER: But . . .\n\nBOYCE: Tell me about him Frank . . .\n\nMILLER: Alright, he, alright, he grabbed her . . .\n\nBOYCE: Right.\n\nMILLER: . . . that's how I got the cut on my hand, I didn't get cut in the car.\n\nBOYCE: Alright, tell me what happened. Tell me what happened. Let it come out, Frank, let it come out. This is what you need, Frank. I'm, it's you and me, now listen.\n\nMILLER: Alright now, he, you know I, tried to get ahold of him and he cut me in the hand with the knife, and he'd already cut her, and then he ran.\n\nBOYCE: Alright.\n\nMILLER: So first thing I thought, you know, try and help her. I got her in the car and she just, you know, she just fell over and I got scared because, you know, I thought she was dead.\n\nBOYCE: Alright.\n\nMILLER: So, I got down by the bridge, I just, you know, laid her off there and got the hell out of there because I was scared, because, you know . . .\n\nBOYCE: Let it come out, Frank. I'm here, I'm here with you now. I'm on your side, I'm on your side, Frank. I'm your brother, you and I are brothers Frank. We are brothers and I want to help my brother.\n\nMILLER: If I hadn't went down on that road I wouldn't even have been involved in it.\n\nBOYCE: Frank, listen . . .\n\nMILLER: It was a shorter way home from, from the Post Office. I'm not lying about that Post Officer or nothing. I came out past that cemetery and up that, up that dirt road . . .\n\nBOYCE: Alright, let's . . .\n\nMILLER: . . . because I could have, you know, swung off at the Whitehall area, I could have swung off and went through the back way to the house.\n\nBOYCE: Let's, Frank, listen. Let's go back to the Post Office, okay? Did you go to the Post Office?\n\nMILLER: Yes.\n\nBOYCE: Okay . . .\n\nMILLER: There was one . . .\n\nBOYCE: Tell me . . .\n\nMILLER: . . . one woman there, I don't, I don't, I couldn't even begin to describe.\n\nBOYCE: Now tell me where you went. Tell me again about this incident, okay?\n\nMILLER: Right.\n\nBOYCE: Alright Frank, tell me what happened.\n\nMILLER: I left the Post Office, you want to go from the Post Office, right?\n\nBOYCE: Uh, huh.\n\nMILLER: Alright. Alright, then I struck the letter in the mailbox, the out of town mail, and I left there and I could, went up, was gonna go up the back way because it was a shorter way home. Then I seen this cow along the road and there was a farm there so I figured, you know, it must be their cow. So, I went in there, and I started to get out of the car and the dogs barked so I blew the horn . . .\n\nBOYCE: Right.\n\nMILLER: . . . because I wasn't about, I didn't know whether this dog would bit or not. And, I blew the horn two or three times and then this girl come out.\n\nBOYCE: Do you remember what the girl looked like? What she was wearing?\n\nMILLER: She was wearing a two piece bathing suit, like you said.\n\nBOYCE: Go ahead.\n\nMILLER: I told her there was a cow out there and she said, yeah it's probably one that's always getting out. And I said well do you need a help, you got anybody here to help you get it in and she says, uh, I don't need no help, she says I can get it back myself. So, I went out, went up the road there, out the driveway, she was following me in her car. I think a Corvair, or. So, I stop up the road there where I, where I had seen the cow and, uh, the cow wasn't there. She pulled up behind me, she got out of the car and I said the cow was here. Well, you can see the marks where the cow had been and we started walking through the, through the field there, uh, it's be on your lefthand side. And, like I say, I don't know where this guy come from.\n\nBOYCE: Tell me what happened.\n\nMILLER: Well, I heard her scream. She, I was walking more or less along the hedgerow there, or trees, whatever you want to call it. I heard her scream and I turned around and I seen a guy there, I'd say he was maybe my height, maybe a little taller, a little smaller, and I don't know, when, when I ran up there he whipped on me, that's how I got this, and . . .\n\nBOYCE: Listen Frank, this guy, do you know him? Do you know where he lives?\n\nMILLER: No, I don't know where he lives. (Inaudible 171 - 173)\n\nBOYCE: You killed this girl didn't you?\n\nMILLER: No, I didn't.\n\nBOYCE: Honest, Frank? It's got to come out. You can't leave it in. It's hard for you, I realize that, how hard it is, how difficult it is, I realize that, but you've got to help yourself before anybody else can help you. And we're going to see to it that you get the proper help. This is our job, Frank. This is our job. This is what I want to do.\n\nMILLER: By sending me back down there.\n\nBOYCE: Wait a second now, don't talk about going back down there. First thing we have to do is let it all come out. Don't fight it because it's worse, Frank, it's worse. It's hurting me because I feel it. I feel it wanting to come out, but it's hurting me, Frank. You're my brother, I mean we're brothers. All men on this, all men on the face of this earth are brothers, Frank, but you got to be completely honest with me.\n\nMILLER: I'm trying to be, but you don't want to believe me.\n\nBOYCE: I want to believe you, Frank, but I want you to tell me the truth, Frank, and you know what I'm talking about and I know what you're talking about. You've got to tell me the truth. I can't help you without the truth.\n\nMILLER: I'm telling you the truth. Sure, that's her blood in the car because when I seen the way she was cut I wanted to help her, and then when she fell over I got scared to even be involved in something like this, being on parole and . . .\n\nBOYCE: I realize this, Frank, it may have been an accident. Isn't that possible, Frank? Isn't that possible?\n\nMILLER: Sure, it's possible.\n\nBOYCE: Well, this is what I'm trying to bring out, Frank. It may be something that, that you did that you can't be held accountable for. This, I can help you, I can help you once you tell me that truth. You know what I'm talking about. I want to help you, Frank. I like you. You've been honest with me. You've been sincere and I've been the same way with you. Now this is the kind of relationship we have, but I can't help you unless you tell me the complete truth. I'll listen to you. I understand, Frank. You have to believe that, I understand. I understand how you feel. I understand how much it must hurt you inside. I know how you feel because I feel it too. Because some day I may be in the same situation Frank, but you've got to help yourself. Tell me exactly what happened, tell me the truth, Frank, please.\n\nMILLER: I'm trying to tell you the truth.\n\nBOYCE: Let me help you. I could have been an accident. You, you've got to tell me the truth, Frank. You know what I'm talking about. I can't help you without the truth. Now you know and I know that's, that's, that's all that counts, Frank. You know and I know that's what counts, that's what it's all about. We can't hide it from each other because we both know, but you've got to be willing to help yourself. You know, I don't think you're a criminal. You have this problem like we talked about before, right?\n\nMILLER: Yeah, you, you say this now, but this thing goes to court and everything and you . . .\n\nBOYCE: No, listen to me, Frank, please listen to me. The issue now is what happened. The issue now is truth. Truth is the issue now. You've got to believe this, and the truth prevails in the end, Frank. You have to believe that and I'm sincere when I'm saying it to you. You've got to be truthful with yourself.\n\nMILLER: Yeah, truth, you say in the end, right? That's why I done three and a half years for . . .\n\nBOYCE: Wait, whoa . . .\n\nMILLER: . . . for a crime that I never committed because of one stinkin detective framing me . . .\n\nBOYCE: Frank, Frank.\n\nMILLER: . . . by the name of Rocco.\n\nBOYCE: Frank, you're talking to me now. We have, we have a relationship, don't we? Have I been sincere with you, Frank?\n\nMILLER: Yeah, you . . .\n\nBOYCE: . . . Have I been honest?\n\nMILLER: . . . Yes.\n\nBOYCE: Have I defined your problem, Frank? Have I been willing to help you? Have I stated I'm willing to help you all I can?\n\nMILLER: Yes.\n\nBOYCE: Do I mean it?\n\nMILLER: Yes.\n\nBOYCE: Whenever I talk to anybody I talk the same way, because you have a very, very serious problem, and we want to prevent anything in the future. This is what's important, Frank, not what happened in the past. It's right now, we're living now, Frank, we want to help you now. You've got a lot more, a lot more years to live.\n\nMILLER: No, I don't.\n\nBOYCE: Yes, you do.\n\nMILLER: No, I don't.\n\nBOYCE: Don't say you don't. Now you've got to tell me.\n\nMILLER: Not after all this, because this is going to kill my father.\n\nBOYCE: Listen, Frank. There is where you, the truth comes out. Your father will understand. This is what you have to understand, Frank. If the truth is out he will understand. That's the most important thing, not, not what has happened, Frank. The fact that you were truthful, you came forward and you said, look I have a problem. I didn't mean to do what I did. I have a problem, this is what's important, Frank. This is very important, I got, I, I got to get closer to you, Frank, I got to make you believe this and I'm and I'm sincere when I tell you this. You got to tell me exactly what happened, Frank. That's very important. I know how you feel inside, Frank, it's eating you up, am I right? It's eating you up, Frank. You've got to come forward. You've got to do it for yourself, for your family, for your father, this is what's important Frank. Just tell me. You didn't mean to kill her did you?\n\nMILLER: I thought she was dead or I'd have never dropped her off like that.\n\nBOYCE: Why, Frank? Frank, look at me, okay? I'm looking at your problem now. Just picture this, okay? I'm lookin at your problem, okay? You follow me?\n\nMILLER: Uhm.\n\nBOYCE: What made you do this, please tell me. Please tell me now. What made you do this?\n\nMILLER: I don't know.\n\nBOYCE: Alright, explain to me, how, exactly how it happened and then we'll see, maybe we can find out why it happened, alright? Is that fair? Just tell me how it happened and then we'll talk about why it could have happened. This is what's important to me.\n\nMILLER: I don't even know.\n\nBOYCE: Well, just tell me what happened, tell me the truth this time. Please, I can't help you without the truth.\n\nMILLER: Like I said I went, I went there because the cow was out . . .\n\nBOYCE: I know that and . . .\n\nMILLER: Wait, wait, alright, wait a minute. She followed me out the driveway. We stopped up there on the road. The cow wasn't around and we were talkin. She got in my car. We figured the cow might be down on the other road, or down further.\n\nBOYCE: You want it to happen.\n\nMILLER: Yes.\n\nBOYCE: Okay. When you got down there, Frank, when you went down there, something happened inside you. This is what I'm interested in, now please tell me, you've got to, you've got to get the proper help, Frank, we want to help you. Please tell me, Frank.\n\nMILLER: I don't know what happened, I really don't.\n\nBOYCE: Alright, but tell me, tell me how it happened, the truth this time, Frank.\n\nMILLER: I can't even tell ya that.\n\nBOYCE: Well, tell me, tell me Frank, (inaudible) . . . have to be completely truthful with me the way I am with you. It's so important, Frank, honest to God, because people believe truth. I mean, Frank, this is hurting me, God listen. I just want you to come out and tell me, so I can help you, that's all. Listen, it's the right way.\n\nMILLER: I, I swear to God, I don't know what happened down there.\n\nBOYCE: Why? Why did you do it?\n\nMILLER: I don't even know that.\n\nBOYCE: What did you, what did you cut the girl with? What did you use, Frank?\n\nMILLER: A penknife\n\nBOYCE: Your penknife?\n\nMILLER: Yes, sir.\n\nBOYCE: Which penknife?\n\nMILLER: The one you have.\n\nBOYCE: The one I have?\n\nMILLER: Yes.\n\nBOYCE: Where did you cut her, Frank?\n\nMILLER: In the throat.\n\nBOYCE: In the throat?\n\nMILLER: Uh, huh.\n\nBOYCE: Now, right before you cut her in the throat, what, why did you cut, did, was she fighting you off?\n\nMILLER: No.\n\nBOYCE: She wasn't fighting you?\n\nMILLER: No.\n\nBOYCE: Why do you think, where were you when you cut her in the throat? Where were you, where were you at, at that moment?\n\nMILLER: Down by the bridge.\n\nBOYCE: Down by the bridge?\n\nMILLER: Yes.\n\nBOYCE: Were you in the vehicle or were you outside the vehicle?\n\nMILLER: In the car.\n\nBOYCE: You were in the car?\n\nMILLER: Yes.\n\nBOYCE: Okay, now, you were in the car, right?\n\nMILLER: Uh, huh.\n\nBOYCE: Did she get in the car voluntarily?\n\nMILLER: Yes.\n\nBOYCE: She did?\n\nMILLER: Yes.\n\nBOYCE: Did you ask her to get into the car?\n\nMILLER: Yes.\n\nBOYCE: What did you say to her, Frank?\n\nMILLER: I said, why don't we go on down the road and see if the cow's down there.\n\nBOYCE: And she got in the car with you?\n\nMILLER: Yes.\n\nBOYCE: Where did she get in the car with you?\n\nMILLER: Upon on the main road.\n\nBOYCE: Where she parked her car?\n\nMILLER: Yes.\n\nBOYCE: Alright. Then you drove down by the bridge.\n\nMILLER: Right.\n\nBOYCE: Okay, now. What happened in the car? Where did you have your knife?\n\nMILLER: In my pocket.\n\nBOYCE: In your pocket?\n\nMILLER: Yes.\n\nBOYCE: And, when did you take it out?\n\nMILLER: From there everything's a blank.\n\nBOYCE: Well . . .\n\nMILLER: I didn't, as far as what, you know, what really . . .\n\nBOYCE: Alright, well where did you cut her with the knife?\n\nMILLER: In the car.\n\nBOYCE: Did she fight you in anyway.\n\nMILLER: No.\n\nBOYCE: Did you cut any other part of her body, Frank?\n\nMILLER: No, not that I, no, not that I know of.\n\nBOYCE: Did you bit her in anyway, Frank?\n\nMILLER: No, not that I know of.\n\nBOYCE: Not that you know of?\n\nMILLER: No.\n\nBOYCE: Did she bleed a lot in the car, Frank?\n\nMILLER: Some, yes.\n\nBOYCE: What happened to the blood that was in the car, Frank? Did you clean the car, Frank? Did you clean the car out after the blood was in the vehicle?\n\nMILLER: There wasn't really, no, I, I just, you know, wiped what little bit was on the seat.\n\nBOYCE: Alright. After you cut her throat, now, what did you do then? After that, after that happened, what did you do then, Frank?\n\nMILLER: I don't know, I, everything just, everything's a blank, really.\n\nBOYCE: Well, try and remember now. What, did you get out of the vehicle?\n\nMILLER: I guess. Yeah, I, I got, I got out of the car and I took her out of the car . . .\n\nBOYCE: Alright, then what did you do?\n\nMILLER: Carried her over the bridge.\n\nBOYCE: Threw her over the bridge?\n\nMILLER: Yes.\n\nBOYCE: Did, then, after you threw her over the bridge, then what did you do, Frank?\n\nMILLER: I didn't do, I don't know.\n\nBOYCE: Did you drag, did you drag her any further after you threw her over the bridge?\n\nMILLER: I don't think so, no.\n\nBOYCE: Try and remember now, it's very important. I'm sure you can understand that, right?\n\nMILLER: Yeah.\n\nBOYCE: Try and remember now. You threw her over the bridge . . .\n\nMILLER: Yeah.\n\nBOYCE: . . . Now, did you go down and look at her again?\n\nMILLER: I don't really know.\n\nBOYCE: Okay. Did you, did you have sexual relations with her, Frank?\n\nMILLER: Not that I know of.\n\nBOYCE: Are you sure now? Think hard. Think hard now, while you were in the car?\n\nMILLER: I don't think so.\n\nBOYCE: Alright. After she, after you threw her out over the bridge?\n\nMILLER: Yeah.\n\nBOYCE: Is that where you had the sexual relations with her?\n\nMILLER: I don't think I did.\n\nBOYCE: Did you remove any of her clothing, Frank?\n\nMILLER: I don't believe so, no. I don't really know.\n\nBOYCE: Alright. Now think about, did you try and drag her body anywhere?\n\nMILLER: I don't think so.\n\nBOYCE: Did you drag the body up toward the water anywhere?\n\nMILLER: I don't think so, no. I say I, I don't know, I . . .\n\nBOYCE: Where, once again now, you're in the car with her right?\n\nMILLER: Uh, huh.\n\nBOYCE: Now, did you pull the knife out right away? What did you say to her, Frank, before you pulled the knife out? Did you ask her anything?\n\nMILLER: I don't know if I did or not.\n\nBOYCE: And you said the pocket knife, what pocketknife were you referring to now, that you used.\n\nMILLER: The one you have.\n\nBOYCE: The one that you gave me at PFD Plastics?\n\nMILLER: Yeah.\n\nBOYCE: And whereabouts did you cut her?\n\nMILLER: In the throat.\n\nBOYCE: In the throat? Is there any reason why you cut her in the throat, Frank?\n\nMILLER: No, not that I know of.\n\nBOYCE: Did you, did you caress her breasts in anyway?\n\nMILLER: No.\n\nBOYCE: Was she an attractive girl?\n\nMILLER: Um, I'd say so, yes.\n\nBOYCE: About what time was that, Frank?\n\nMILLER: I'm not sure.\n\nBOYCE: About what time?\n\nMILLER: Well, I was at the Post Office around, I figure 11 o'clock, so it had to be after that.\n\nBOYCE: It happened sometime after that, about, about how long?\n\nMILLER: I'd say maybe five after, ten after, something like this. That's about all the time it would take to go from the Post Office to there.\n\nBOYCE: And what road were you on when this, when you cut her throat in the vehicle, what road were you on?\n\nMILLER: I don't know the road exactly.\n\nBOYCE: Was it a dirt road, Frank?\n\nMILLER: Yes.\n\nBOYCE: It was a dirt road?\n\nMILLER: Yes.\n\nBOYCE: Did you see anybody at the house when you were there?\n\nMILLER: Just her.\n\nBOYCE: Did you see any of her brothers?\n\nMILLER: No.\n\nBOYCE: Did you see anyone else?\n\nMILLER: No. No one came out but her.\n\nBOYCE: Did you cut any other portion of her body, Frank? Just, just think hard, now, take your time, ah. You know, I realize that, you know, that, just take your time and think, did you cut any portion of her body? Did you cut her breasts?\n\nMILLER: No.\n\nBOYCE: Are you sure, Frank?\n\nMILLER: Positive.\n\nBOYCE: Did you bite her in anyway?\n\nMILLER: I don't think . . .\n\nBOYCE: Tell me the truth, Frank. Honest? You've been so honest with me so far, you've been truthful, you've been honest, you've been sincere. Now, after you threw, how did you, which car, which car did you, uh, side of the car did you draft her out of?\n\nMILLER: The driver's side.\n\nBOYCE: Driver's side?\n\nMILLER: Yeah.\n\nBOYCE: I see. Did you clean you car in anyway?\n\nMILLER: Yeah.\n\nBOYCE: Where, where did you clean your car, Frank?\n\nMILLER: I used the hose at home.\n\nBOYCE: At home?\n\nMILLER: Yeah, in the driveway.\n\nBOYCE: And did you enter your house through the front door, Frank?\n\nMILLER: Through the breezeway.\n\nBOYCE: Through the breezeway?\n\nMILLER: Yeah.\n\nBOYCE: Where are the rags? What did you use to clean the car out with?\n\nMILLER: I just used the hose.\n\nBOYCE: The hose?\n\nMILLER: Yeah.\n\nBOYCE: You washed it out?\n\nMILLER: Yes.\n\nBOYCE: Where was the vehicle when you washed it out, Frank?\n\nMILLER: In the driveway.\n\nBOYCE: In the driveway? Did you use any type of rag on the inside of the car?\n\nMILLER: Just a . . . no.\n\nBOYCE: Are you sure, Frank?\n\nMILLER: There was a . . I had a paper bag, a brown paper bag and the . . . I just wiped some of the water off of the seat and stuff.\n\nBOYCE: Where is the brown paper bag now, Frank? What did you do with it?\n\nMILLER: I threw it away.\n\nBOYCE: Where did you throw it, Frank?\n\nMILLER: Driving along the road on my way up to Flemington.\n\nBOYCE: Where, do you remember on which road you were, or how far you were away from the house when you threw it out the window?\n\nMILLER: No, I don't.\n\nBOYCE: You don't have any idea, Frank?\n\nMILLER: No.\n\nBOYCE: Now, did you actually throw her over the, uh, the fence then the rail?\n\nMILLER: Yes.\n\nBOYCE: You did?\n\nMILLER: Yes.\n\nBOYCE: Did you go, after you threw her over the fence, did you go and look at her again to see if she was dead?\n\nMILLER: I don't believe I did, no.\n\nBOYCE: Was there anyone with you, Frank, when this occurred, or were you alone? You indicated before that you were alone, were you alone with her when this happened?\n\nMILLER: Yeah.\n\nBOYCE: I see. Were you driving your car, Frank?\n\nMILLER: Yeah.\n\nBOYCE: What kind of a car do you drive?\n\nMILLER: a white Mercury.\n\nBOYCE: What year is that Mercury?\n\nMILLER: '69.\n\nBOYCE: '69? Is there any damage, is there any damage to your vehicle?\n\nMILLER: Yes.\n\nBOYCE: Where is the damage?\n\nMILLER: Righthand side.\n\nBOYCE: Is your trunk tied down?\n\nMILLER: Yes.\n\nBOYCE: Alright. I've indicted before that you would be willing to sit down with me and the Assistant Prosecutor and indicate to him, like you said, that you have a problem.\n\nMILLER: uh, huh.\n\nBOYCE: Would you be willing to sit down with us while we take a statement from you?\n\nMILLER: Yes.\n\nBOYCE: So it can be incorporated, you follow me?\n\nMILLER: Yeah.\n\nBOYCE: In order to help you.\n\nMILLER: Un, huh.\n\nBOYCE: Would you be willing to do that?\n\nMILLER: Uh, huh.\n\nBOYCE: Now, is there anything I can get you now? You want coffee?\n\nMILLER: No.\n\nBOYCE: You want to just sit here for awhile?\n\nMILLER: Yes.\n\nThe time now is 2:45 A.M. Statement concluded at this time. Statement and interrogation concluded at this time.\n\n\u003cspan class=\"fn\"\u003e1. Neither the adequacy of the Miranda warnings nor the validity of the waiver is at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We discuss this technique in detail infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The quote is taken from the unpublished opinion of the appellate division, State v. Miller, No. A-1275-73 (N.J. App. October 27, 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 2254(d) provides that a state court factual finding is entitled to a \"presumption of correctness\" in a federal habeas corpus proceeding unless one of eight enumerated exceptions applies. Conceding that the \"concept of voluntariness is not one that lends itself to easy description,\" 741 F.2d at 1463, we concluded that recent decisions of the Supreme Court indicated that the inference as to a defendant's state of mind should no longer be considered a \"legal\" or \"hybrid\" question, but rather a question of \"ultimate fact.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We reject the dissent's contention that we have selectively picked and chosen from the transcript in attempting to demonstrate the voluntariness of the confession, and we welcome the dissent's decision to attach the entire transcript, which will demonstrate that our reading was fair.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This is simply another way of saying what we stated earlier -- that there is no per se rule against the use of psychological tactics in interrogation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Judge Gibbons argues in dissent that \"the interrogation of Miller has no purpose other than obtaining admissions that could be used to charge Miller with felony murder,\" and that, apparently as a matter of law, \"such an interrogation requires the closest scrutiny.\" Dissenting opinion, typescript at 6. The factual premise of this argument is stated at page 7: Thus the police did not need to conduct an interrogation directed at investigating the murder -- it was already solved so far as they were concerned. Hence, the dissent concludes, there was a \"complete absence of any legitimate investigative purpose for the interrogation.\" Dissenting opinion, typescript at 7. This line of argument, never advanced by Miller's able counsel, is flawed. First, the evidence that the police already had -- principally the description given by Ms. Margolin's brothers of an automobile just like Miller's and of a person generally fitting Miller's characteristics whom one of the brothers had seen shortly before the homicide -- was not enough to solve the crime. Indeed, Judge Gibbons himself stresses the inconclusiveness of this evidence at a later point in the opinion. See dissenting opinion, typescript at 13. Neither a lineup nor the development of evidence undermining Miller's alibi would necessarily have filled the gap. Second, the dissent implies that the interrogation would have been inappropriate as a matter of law even if it had been conducted according to Hoyle. We disagree. It is well settled that interrogation is a legitimate police investigative tool which the police have a right to pursue no matter how strong the other evidence of a suspect's guilt may be. It is obviously desirable for the police to get as much exact information as they can in any criminal case, and especially in a first-degree murder case, so as to reduce to an absolute minimum the possibility that an innocent person will be convicted. Indeed we have found no support for the dissent's novel suggestion that even if the police have conclusive evidence of the identity of an offender, it is improper to interrogate him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See also Stein v. New York, supra, 346 U.S. at 185-86 (holding confessions voluntary and noting that \"these men were not young, soft, ignorant or timid. They were not inexperienced in the ways of crime or its detection, nor were they dumb as to their rights.\"); Martin v. Wainwright, 770 F.2d 918, 926 (11th Cir. 1985) (in holding confession voluntary court noted that detainee previously had pled guilty to three counts of second-degree murder and one count of arson, for which he had been sentenced to 18 to 30 years in prison, and was on parole at the time of the events relevant to the interrogation). Cf. Reck v. Pate, supra, 367 U.S. at 441 (detainee had no prior criminal record or experience with the police).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Distinguishing factors in Leyra are described infra at 29-31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. White it is true, as the dissent points out, that other federal circuit courts have cited the Bram test, these courts have not applied it as a per se proscription of promises made in the interrogation room. Rather, as we explained above, these courts have inquired into whether the promise induced the confession by overbearing the will of the accused. The discussion of promises in Jarrell v. Balkcom, 735 F.2d 1242 (11th Cir. 1984), exemplifies this approach, although the dissent cites it to prove that Bram has been interpreted as rendering all promises during interrogations invalid. In Jarrell, 735 F.2d at 1250, the Eleventh Circuit cited Bram to support the proposition that \"confessions induced by promised benefits are inadmissible.\" Although this statement seems to be a flat prohibition against the making, of promises during an interrogation, the court's analysis follows a totality of the circumstances test. The court noted that the detainee had initiated the subjects of psychiatric help and police protection against the vengeance of the victim's husband. Id. at 1250, 1251, it also pointed out that the detainee was in control of his faculties while confessing . Id. at 1250. The court concluded that the alleged promise of police protection did not render the confession inadmissible because \"the officer's statement [about police protection] was neither likely to nor intended to induce confession.\" Id. at 1251. As for the statements about psychiatric help, it found \"no promised benefit inferable\" therefrom. While the court conforms to a strict reading of Bram by finding that there were no promises, the analysis it uses is not a per se test, but an inquiry into whether the challenged statement overbore the will of the detainee. The inquiry is really whether, under the totality of the circumstances, the statement induced the confession, not whether it was, on its face, a promise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The detective informed the accused that another person had seen him commit the murder, 168 U.S. at 562, and that he should tell the detective if he had an accomplice in order to avoid having \"the blame of this horrible crime on your own shoulders.\" Id. at 564. The Court interpreted the second statement as an offer of a benefit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. But see White, Police Trickery in Inducing Confessions, 127 U. Pa. L. Rev. 581, 623 (1979), in which the author argues that all promises of tangible benefits made by police during interrogation in order to elicit a confession should be proscribed under a per se rule. According to Professor White, \"the difficulty of assessing the effect on the suspect subjected to the interrogation suggests that with respect to this issue the totality of the circumstances test does not provide effective protection for the suspect's constitutional rights.\" Id. We are not convinced, however, that the application of the totality of the circumstances test to this issue is significantly more difficult than its application to other factors affecting voluntariness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The dissent states that we do not make much of Miller's collapse. However, we recognize the possibility that the human psyche, upon being released from the terrible burden of concealing such a heinous crime, might well react just as Miller's did after a confession.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. In this instance the New Jersey judges, all of whom recognized they were deciding a legal issue, were badly divided. Six of eleven New Jersey judges who considered the issue of voluntariness found the confession in issue to be involuntary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The majority misreads Brady and Hutto, stating, \"Apparently, the words 'obtained by . . . promises' in the Bram test have been read to mean 'obtained because the suspect's will was overcome by . . . promises.' Typescript at 22. This is an unfair and misleading treatment of those cases, tantamount to the unfair and misleading treatment of the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The mode of interrogation revealed in this record is similar to that relentless psychological pressure condemned in Leyra v. Denno, 347 U.S. 556, 558-60, 98 L. Ed. 948, 74 S. Ct. 716 (1954). The deception practiced upon Miller is no different in kind from that practiced in Turner v. Pennsylvania, 338 U.S. 62, 63-65, 93 L. Ed. 1810, 69 S. Ct. 1352 (1949).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The majority refers to, and applies, the totality of the circumstances test as if that test meant that no legal rules applied. The test, however, does not stand for such an absurd proposition. Instead, the totality of the circumstances test requires that the court review the entire record and not focus on single components. Legal rules still apply if, under all the circumstances, the suspect's constitutional rights have been violated. In Miller's case, there are no mitigating factors to offset the affects of Boyce's repeated promises.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* This Appendix is a reprint of a copy of the transcript of the tape-recorded interrogation. The transcript was offered into evidence at Miller's trial as Exhibit 4. The transcript is reprinted verbatim, typos included.\u003c/span\u003e\n\n",
    "body_length": 155504,
    "citedas": [
      "796 F.2d 598"
    ],
    "attorneys": "JOSEPH H. RODRIGUEZ Public Defender, PAUL M. KLEIN (Argued), CLAUDIA VAN WYK Assistant Deputy Public Defenders 20 Evergreen Place East Orange, New Jersey 07018 for Appellant. IRWIN I. KIMMELMAN Attorney General, ANNE C. PASKOW (Argued) Deputy Attorney General Division of Criminal Justice Appellate Section Post Office Box CNO86 Trenton, New Jersey 08625 for Appellees.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Before: SEITZ, GIBBONS and BECKER, Circuit Judges",
    "citation_count": 198
  }
}
