{
  "id": "fX97PWYBTlTomsSBy9A0",
  "document": {
    "title": "Redgrave v. Boston Symphony Orchestra Inc.",
    "full_title": "VANESSA REDGRAVE AND VANESSA REDGRAVE ENTERPRISES, LTD. v. BOSTON SYMPHONY ORCHESTRA, INC. . VANESSA REDGRAVE AND VANESSA REDGRAVE ENTERPRISES, LTD. V. BOSTON SYMPHONY ORCHESTRA, INC.",
    "jurisdiction": "First Circuit",
    "date": "1988-08-31T00:00:00.000Z",
    "docket": "Nos. 85-1305, 85-1341",
    "body": "Opinion EN BANC\n\nCOFFIN, Circuit Judge.\n\nThis complex litigation has involved this court at three stages. On first hearing the appeal from the district court we certified two questions to the Supreme Judicial Court of Massachusetts. After considering its responses, together with its suggestions on an issue not expressly raised by either question, a panel of this court agreed on the disposition of issues relating to plaintiffs' contract claim but divided as to the disposition of a claim under the Massachusetts Civil Rights Act (MCRA), Mass. Gen. L. ch. 12, §§ 11H -- I (1986). Subsequently, the panel opinion and dissent were withdrawn in order to reconsider the MCRA claim in an en banc proceeding. We now proceed with our en banc opinion, which includes and reaffirms the panel's position on the contract claim, but differs from the panel majority by concluding that, as a matter of Massachusetts law, defendant is not subject to MCRA liability.\n\nThe plaintiffs, actress Vanessa Redgrave and Vanessa Redgrave Enterprises, Ltd. (hereinafter Redgrave), brought suit against the Boston Symphony Orchestra (hereinafter the BSO) for cancelling a contract for Redgrave's appearance as narrator in a performance of Stravinsky's \"Oedipus Rex.\" The cancellation occurred in the wake of protests over Redgrave's participation because of her support of the Palestine Liberation Organization. She sought recovery both for breach of contract and for violation of her civil rights under the MCRA.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nA jury awarded Redgrave $100,000 in consequential damages caused by the BSO's breach of contract; sitting in an advisory capacity on Redgrave's MCRA claim, the jury found for the BSO. On the BSO's motion for judgment notwithstanding the verdict on the consequential damages issue, the district court held that the evidence of consequential damages was sufficient but that Redgrave could not recover these damages because of First Amendment limitations. The court also held that the MCRA does not impose liability on a party for acquiescence to third party pressure. Redgrave appealed from these rulings, and the BSO cross-appealed, arguing that the evidence of consequential damages was insufficient.\n\nWe conclude, in Part II, that the district court erred in reversing the jury's award of consequential damages, but that Redgrave has presented sufficient evidence to prove only $12,000 in consequential damages, minus certain expenses. In Part III, we report and accept the response of the Massachusetts Supreme Judicial Court to our certified questions that acquiescence to third party pressure is not a defense to an action under the MCRA. In Part IV, we discuss the conclusions of the Justices of the Supreme Judicial Court that, for different but consistent reasons of Massachusetts law, the BSO is not subject to MCRA liability in these circumstances. We therefore affirm the judgment for the BSO on the MCRA claim and remand for entry of a reduced judgment for consequential damages on the contract claim.\n\nI. PROCEDURAL HISTORY\n\nIn March 1982, the Boston Symphony Orchestra (BSO) engaged Vanessa Redgrave to narrate Stravinsky's \"Oedipus Rex\" in a series of concerts in Boston and New York. Following announcement of the engagement, the BSO received calls from its subscribers and from community members protesting the engagement because of Redgrave's political support for the Palestine Liberation Organization and because of her views regarding the state of Israel. On or about April 1, 1982, the BSO cancelled its contract with Redgrave and its performances of \"Oedipus Rex.\"\n\nRedgrave sued the BSO for breach of contract and for violation of the MCRA. The BSO argued at trial that the contract rightfully was cancelled because the cancellation was the result of \"a cause or causes beyond the reasonable control\" of the BSO. In response to the civil rights claim, BSO agents testified that they had not cancelled the performances in order to punish Redgrave for her past speech or repress her future speech, but because it was felt that potential disruptions, given the community reaction, would implicate the physical safety of the audience and players and would detract from the artistic qualities of the production.\n\nFollowing a sixteen-day trial, the jury found that the BSO wrongfully had breached its contract with Redgrave. On that basis, the district court awarded Redgrave her stipulated performance fee of $27,500. The jury also found that the BSO's cancellation had damaged Redgrave's career by causing loss of future professional opportunities, and awarded Redgrave $100,000 in consequential damages. The district court found that the question whether there was sufficient evidence to support a finding of $100,000 in consequential damages was a \"close and debatable\" one, but concluded that there was sufficient evidence to support the award. Nevertheless, the district court overturned the grant of consequential damages,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e finding that a First Amendment right of freedom of speech was implicated by the theory of consequential damages advanced by Redgrave and that Redgrave had not met the strict standards required by the First Amendment for recovery of damages. Redgrave v. Boston Symphony Orchestra, Inc., 602 F. Supp. 1189, 1193-1203 (D. Mass. 1985).\n\nRedgrave's MCRA claim was premised on the allegation that the BSO had interfered, \"by threats, intimidation, or coercion,\" with Redgrave's exercise of free speech rights. Mass. Gen. L. ch. 12, §§ 11H -- I. The district court utilized the jury in an advisory capacity on this claim. In response to special interrogatories, the jury found that the BSO did not cancel the contract because of the disagreements of BSO agents with Redgrave's political views. The district court stated that this finding eliminated an \"essential factual premise\" of Redgrave's primary claim based on the MCRA. 602 F. Supp. at 1192.\n\nBut Redgrave also argued that, even if BSO agents had not themselves disagreed with Redgrave's political views and did not cancel the contract because they wished to punish her for past speech or to repress her future speech, the BSO did cancel the contract in response to pressure from third parties who disagreed with and wished to repress Redgrave's speech. Redgrave contended that such acquiescence to third parties on the part of the BSO made it liable under the MCRA. The district court concluded that acquiescence unaccompanied by express personal disagreement with Redgrave's views could not amount to the \"threats, intimidation, or coercion\" needed to establish a claim under the MCRA. 602 F. Supp. at 1192. The district court, therefore, rejected Redgrave's acquiescence theory and entered judgment for the BSO on Redgrave's MCRA claim.\n\nRedgrave appealed from the district court's entry of judgment notwithstanding the verdict on the consequential damages claim and from the judgment against her on the MCRA claim. The BSO cross-appealed, arguing that even if the First Amendment should be found inapplicable to the consequential damages claim, the evidence of those damages was insufficient to support the verdict.\n\nII. THE CONSEQUENTIAL DAMAGES CLAIM\n\nA. Consequential Damages for Loss of Professional Opportunities\n\nIn response to special interrogatories, the jury found that the BSO's cancellation of the \"Oedipus Rex\" concerts caused consequential harm to Redgrave's professional career and that this harm was a foreseeable consequence within the contemplation of the parties at the time they entered the contract. 602 F. Supp. at 1204. A threshold question is whether Massachusetts contract law allows the award of such consequential damages for harm to a claimant's professional career.\n\nRedgrave's consequential damages claim is based on the proposition that a significant number of movie and theater offers that she would ordinarily have received in the years 1982 and following were in fact not offered to her as a result of the BSO's cancellation in April 1982. The BSO characterizes this claim as one for damage to Redgrave's reputation,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and argues that the recent Massachusetts state court decisions in McCone v. New England Telephone \u0026 Telegraph Co., 393 Mass. 231, 471 N.E.2d 47 (1984), and Daley v. Town of West Brookfield, 19 Mass. App. Ct. 1019, 476 N.E.2d 980 (1985), establish that Massachusetts law does not permit plaintiffs in breach of contract actions to recover consequential damages for harm to reputation.\n\nIn McCone v. New England Telephone \u0026 Telegraph Co., plaintiffs alleged that their employer's breach of an implied covenant of good faith had caused them loss of salary increases, loss of pension benefits, and \"damage to their professional reputations, disruption of their personal lives, and great pain of body and mind.\" 393 Mass. at 234 n. 8. The Massachusetts Supreme Judicial Court held that the claims for damages to reputation and other emotional injury could not be sustained in the suit because \"these additional damages are not contract damages.\" Id. In Daley v. Town of West Brookfield, a Massachusetts appellate court observed that \"damages for injury to reputation are usually not available in contract actions,\" noting that the rationale most often given is that \"such damages are remote and not within the contemplation of the parties.\" 19 Mass. App. Ct. at 1019 n. 1, 476 N.E.2d at 980 n. 1.\n\nThe BSO notes that Massachusetts is in agreement with virtually all other jurisdictions in holding that damages for reputation are not available in contract actions. See, e.g., Volkswagen Interamericana, S.A. v. Rohlsen, 360 F.2d 437, 446 (1st Cir. 1966) (applying federal law); Stancil v. Mergenthaler Linotype Co., 589 F. Supp. 78, 84-85 (D. Haw. 1984); O'Leary v. Sterling Extruder Corp., 533 F. Supp. 1205, 1209 (E.D. Wis. 1982); Skagway City School Board v. Davis, 543 P.2d 218, 225-27 (Ala. 1975); Tousley v. Atlantic City Ambassador Hotel Corp., 25 N.J. Misc. 88, 50 A.2d 472, 474-75 (N.J. Sup. Ct. 1947). This impressive line of cases, however, becomes less impressive for our purposes when the reasoning in these cases is analyzed with reference to the particular claim put forth by Redgrave.\n\nIn cases that have analyzed the reasons for disallowing a contract claim for reputation damages, courts have identified two determinative factors. First, courts have observed that attempting to calculate damages for injury to reputation is \"unduly speculative.\" Skagway City School Board, 543 P.2d at 225. See O'Leary, 533 F. Supp. at 1209; Tousley, 50 A.2d at 474-75. In many cases, the courts have viewed the claims for damages to reputation as analogous to claims for physical or emotional distress and have noted the difficulty in ascertaining such damages for contract purposes. See, e.g., Westwater v. Rector, Warden and Vestry of Grace Church, 140 Cal. 339, 342, 73 P. 1055 (1903) (\"Damages to health, reputation, or feelings are not clearly ascertainable either in their nature or origin.\"). As the court in Skagway noted, an estimate of injury to reputation \"must rest upon a number of imprecise variables,\" including the causal connection between the breach of contract and the injury to reputation and the amount by which any future earnings would be decreased by causes other than the breach. Skagway City School Board, 543 P.2d at 225.\n\nThe second factor that courts identify is that damages for injury to reputation \"cannot reasonably be presumed to have been within the contemplation of the parties when they entered into the contract.\" Skagway City School Board, 543 P.2d at 225. These courts state that the basic rule of Hadley v. Baxendale, 9 Ex. 341, 156 Eng. Rep. 145 (1854), which requires that contract damages be of the kind that arise naturally from the breach of a contract or be of a kind that reasonably may have been in the contemplation of the parties when they entered the contract, cannot possibly be met in a claim for general damages to reputation occurring as the result of a breach of contract. See Skagway City School Board, 543 P.2d at 225; O'Leary, 533 F. Supp. at 1209-10; Tousley, 50 A.2d at 474-75; Mastoras v. Chicago, M. \u0026 St. P. R.R., 217 F. 153, 154 (W.D. Wash. 1914). The Massachusetts Supreme Judicial Court seems to have accepted this rationale as a legitimate one for disallowing claims for injury to reputation as a contract damage. See Daley v. Town of West Brookfield, 476 N.E.2d at 980 n. 1 (\"The rationale often given [for disallowing damages for injury to reputation in contract actions] is that such damages are remote and not within the contemplation of the parties.\"). See also 5 Corbin on Contracts, § 1007-11 at 70-87 (1964); 11 Williston, Contracts, § 1344 at 226-29 (1968) (discussing Hadley v. Baxendale general rule of consequential damages).\n\nThe claim advanced by Redgrave is significantly different, however, from a general claim of damage to reputation. Redgrave is not claiming that her general reputation as a professional actress has been tarnished by the BSO's cancellation. Rather, she claims that a number of specific movie and theater performances that would have been offered to her in the usual course of events were not offered to her as a result of the BSO's cancellation. This is the type of specific claim that, with appropriate evidence, can meet the Hadley v. Baxendale rule, as adopted by the Massachusetts Supreme Judicial Court in John Hetherington \u0026 Sons, Ltd. v. William Firth Co., 210 Mass. 8, 21; 95 N.E. 961, 964 (1911) (in breach of contract ation, injured party receives compensation for any loss that follows as a natural consequence from the breach, was within the contemplation of reasonable parties as a probable result of breach, and may be computed by \"rational methods upon a firm basis of facts\"). As the district court correctly noted in a preliminary memorandum:\n\nIf plaintiffs proved other employers refused to hire Redgrave after termination of the BSO contract because of that termination (that loss of the other employment \"followed as a natural consequence\" from the termination of the contract), that this loss of other employment would reasonably have been foreseen by the parties at the time of contracting and at the time of termination, and that damages are rationally calculable, then plaintiffs may be entitled to damages that include monies for loss of the other employment. Although plaintiffs have a heavy burden to carry here, it cannot be said with certainty at this time that they will not be able to meet this burden.\n\nRedgrave v. BSO, 557 F. Supp. 230, 234 (D. Mass. 1983).\n\nThe jury was given appropriate instructions to help it determine whether Redgrave had suffered consequential damages through loss of future professional opportunities. They were told to find that the BSO's cancellation was a proximate cause of harm to Redgrave's professional career only if they determined that \"harm would not have occurred but for the cancellation and that the harm was a natural and probable consequence of the cancellation.\" Redgrave v. BSO, 602 F. Supp. at 1211. In addition, they were told that damages should be allowed for consequential harm \"only if the harm was a foreseeable consequence within the contemplation of the parties to the contract when it was made.\" Id. at 1212. In response to special interrogatories, the jury found that the BSO's cancellation caused consequential harm to Redgrave's career and that the harm was a foreseeable consequence within the contemplation of the parties. 602 F. Supp. at 1204.\n\nAlthough we find that Redgrave did not present sufficient evidence to establish that the BSO's cancellation caused consequential harm to her professional career in the amount of $100,000, see infra, slip op. at 20-32, we hold that, as a matter of Massachusetts contract law, a plaintiff may receive consequential damages if the plaintiff proves with sufficient evidence that a breach of contract proximately caused the loss of identifiable professional opportunities. This type of claim is sufficiently different from a nonspecific allegation of damage to reputation that it appropriately falls outside the general rule that reputation damages are not an acceptable form of contract damage.\n\nB. First Amendment Restrictions\n\nThe district court found that, although consequential damages for loss of professional opportunities could be a legitimate contract claim, it was required to overturn the jury's verdict of $100,000 because Redgrave had not met the strict standards required by the First Amendment for the recovery of such damages. According to the district court, the only theory that Redgrave could advance for establishing consequential damages necessarily implicated First Amendment concerns. As the court explained, \"the only possible mechanism of harm to Redgrave's professional career, revealed by the evidence, is the alleged influence of some statement made by the BSO on later decisions of others -- a statement of fact or opinion implied in BSO's cancellation, or express or implied in BSO's press release.\" Redgrave v. BSO, 602 F. Supp. at 1197. In other words, \"an inescapable element of the claimed causal connection between BSO's cancellation and consequential harm to Redgrave's professional career\" was for \"a factfinder reasonably [to] infer that others, upon receiving the news of BSO's cancellation, interpreted the cancellation as conveying a message about Redgrave.\" Id.\n\nHaving concluded that Redgrave's theory of consequential damages necessarily rested on the premise that the BSO had conveyed a message about her to others, the district court felt it was required to apply heightened First Amendment scrutiny to any claim for damages stemming from such communicative activity. It made the threshold decision that state action would exist because it, as a court, would enter a judgment for such damages. 602 F. Supp. at 1199. The court then applied the standard governing damages in defamation cases. Accordingly, it required that Redgrave show that \"BSO has impliedly communicated to others some material issue of fact (and not merely opinion) about Redgrave that it knew to be false, or that BSO acted with reckless disregard for the truth or falsity of a material statement of fact it impliedly communicated.\" 602 F. Supp. at 1201. The court concluded that, in any message the BSO could be said to have sent, no statement of fact to which the jury could apply a \"reckless falsity\" test could be disentangled from the BSO's statements of opinion. Further, any statements of opinion by the BSO would be protected absolutely under the First Amendment. Id. at 1201-03. Thus, the court found that Redgrave had not overcome the significant obstacles created by the First Amendment to recovery of consequential damages.\n\nThe district court is correct in stating that an act can be a protected form of First Amendment activity. See, e.g., NAACP v. Claiborne Hardware Co., 458 U.S. 886, 73 L. Ed. 2d 1215, 102 S. Ct. 3409 (1982) (economic boycott may be form of First Amendment activity); Buckley v. Valeo, 424 U.S. 1, 46 L. Ed. 2d 659, 96 S. Ct. 612 (1976) (contributing money is form of speech); Cohen v. California, 403 U.S. 15, 29 L. Ed. 2d 284, 91 S. Ct. 1780 (1971) (wearing sign on back of jacket is form of speech).\n\nThe BSO's cancellation of its contract with Redgrave was not, however, an act intended to be a form of symbolic speech or a \"statement\" by the BSO.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e As BSO agents testified, the press release announcing the BSO's cancellation went through a number of drafts in order to remove any statement or implication that Redgrave was too controversial or dangerous to hire. In fact, the press release did not even refer to Redgrave by name.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Indeed, in response to special verdict question 11A, the jury found that the BSO's cancellation and press release did not \"impliedly state to others that BSO's managerial agents held the opinion that Vanessa Redgrave was so controversial because of her publicly expressed political views that the risks associated with the series of performances in Boston and New York, in which she was to appear as narrator, were too great to be acceptable to a prudently managed symphony orchestra.\" 602 F. Supp. at 1205. Thus, the evidence does not support an inference that the BSO intended its cancellation to act as a symbolic message to others.\n\nAn act not intended to be communicative does not acquire the stature of First-Amendment-protected expression merely because someone, upon learning of the act, might derive some message from it. Nor is such an act entitled to special protection merely because others speak about it. Accordingly, we believe the district court erred in reasoning that the causal link between the BSO's contract cancellation and Redgrave's harm necessarily involved protected expression by the BSO.\n\nRedgrave's counsel presented two distinct avenues of causation through which the jury could find that the BSO's cancellation caused Redgrave consequential harm and the jury was instructed on both grounds. Besides contending that the BSO's cancellation and press release impliedly stated to others that Redgrave was too controversial to be acceptable to a prudently managed symphony orchestra, Redgrave also contended that \"since BSO was a prestigious cultural organization, the very fact that it decided to cancel rather than proceed with performances in which Vanessa Redgrave was to appear would tend to influence others not to offer her future professional opportunities.\" Redgrave v. BSO, 602 F. Supp. at 1212. The jury was instructed to \"determine whether the evidence supports either, both, or neither of these contentions\" in deciding whether the BSO's cancellation caused Redgrave consequential harm. Id.\n\nThe jury rejected the \"implied message\" theory yet still found that the BSO's contract cancellation caused Redgrave to lose future professional opportunities. Apparently, the jury felt that the BSO's cancellation had caused harm to Redgrave's career, despite its conclusion that the BSO had not intentionally sent any implied message regarding Redgrave. Theodore Mann, a director, testified that he chose not to offer Redgrave a job in a theater performance because\n\nthe Boston Symphony Orchestra had cancelled, terminated Ms. Redgrave's contract. This had a -- this is the premier or one of the premier arts organizations in America who, like ourselves, seeks support from foundations, corporations, individuals; have subscribers; sell individual tickets. I was afraid . . . and those in my organization were afraid that this termination would have a negative effect on us if we hired her.\n\nApp. 1302a. Thus, the jury could appropriately have found that even though the BSO did not intend its contract cancellation to be a purposeful symbolic communication, other performing companies may have derived, or feared that their supporters might derive, some message from the cancellation, causing them concern about hiring Redgrave. Under this theory, the jury could have found that the act of cancellation, unprotected by the First Amendment, was the proximate cause of Redgrave's harm.\n\nThe district court correctly stated that \"plaintiffs must prove that in some way information about BSO's action was communicated to others.\" 602 F. Supp. at 1197. However, as amici correctly point out, the trial court erred in confusing communication about the BSO's contract cancellation with the notion of an implied communication of a particular message by the BSO regarding Redgrave. Absent unusual circumstances suggesting primary interest in communicating an idea transcending the immediate act, a contract cancellation would not trigger the concerns ordinarily protected by the First Amendment. Indeed, under the district court's ruling, the cancellation of almost any contract with a notable figure could effectively be transformed into a statement protected by the First Amendment, thereby unnecessarily diluting the protections intended by contract law. Thus, although Redgrave must meet the ordinary strict contract requirements for finding consequential damages, see infra, slip op. at 20-21, no additional requirements need be imposed in this case because of the strictures of the First Amendment.\n\nC. Sufficiency of the Evidence\n\nThe requirements for awarding consequential damages for breach of contract are designed to ensure that a breaching party pays only those damages that have resulted from its breach. Thus, to receive consequential damages, the plaintiff must establish a \"basis for an inference of fact\" that the plaintiff has actually been damaged, Williston, Contracts, § 1345 at 231, and the factfinder must be able to compute the compensation \"by rational methods upon a firm basis of facts.\" John Hetherington \u0026 Sons, 210 Mass. at 21, 95 N.E. at 964.\n\nIn analyzing the evidence presented by Redgrave on her claim for consequential damages, we are guided by the basic principle that on a motion for judgment notwithstanding the verdict the evidence must be viewed in the light most favorable to the party for whom the jury found, and that that party must be given \"the benefit of every favorable inference that may be fairly drawn.\" Borras v. Sea-Land Service, Inc., 586 F.2d 881, 885 (1st Cir. 1978) (quoting Dumas v. MacLean, 404 F.2d 1062, 1064 (1st Cir. 1968)). In examining the evidence, however, we must not neglect uncontradicted evidence offered by the other party. Layne v. Vinzant, 657 F.2d 468, 472 (1st Cir. 1981); Allen Pen Co. v. Springfield Photo Mount Co., 653 F.2d 17, 19 (1st Cir. 1981). Further, the party for whom the jury found is not entitled to \"unreasonable inferences which rest on conjecture and speculation.\" Carlson v. American Safety Equipment Corp., 528 F.2d 384, 386 (1st Cir. 1976); see also Goldstein v. Kelleher, 728 F.2d 32, 39 (1st Cir. 1984).\n\nIn order for Redgrave to prove that the BSO's cancellation resulted in the loss of other professional opportunities, she must present sufficient facts for a jury reasonably to infer that Redgrave lost wages and professional opportunities subsequent to April 1982, that such losses were the result of the BSO's cancellation rather than the result of other, independent factors, and that damages for such losses are capable of being ascertained \"by reference to some definite standard, either market value, established experience or direct inference from known circumstances.\" John Hetherington \u0026 Sons, 210 Mass. at 21, 95 N.E. at 964. During trial, evidence was presented regarding losses Redgrave allegedly suffered in film offers and American theater offers. Based on this testimony, the jury found that the BSO's cancellation of its contract with Redgrave caused Redgrave $100,000 in consequential damages. We find that the evidence presented by Redgrave was not sufficient to support a finding of damages greater than $12,000, less expenses.\n\nMost of Redgrave's annual earnings prior to April 1982 were derived from appearances in films and the English theater.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Redgrave presented evidence at trial that she earned more than $200,000 on the average since her company's fiscal year 1976, and she testified that she had a constant stream of offers from which she could choose films that had secure financial backing. After the BSO's cancellation in April 1982, Redgrave contended, her career underwent a \"startling turnabout.\" Redgrave testified that she did not work at all for the fourteen months following the cancellation and that the only offers she received during that time were for films with insufficient financial backing.\n\nThe evidence demonstrates that Redgrave accepted three firm film offers in the fourteen months following the BSO cancellation. If these three films had been produced, Redgrave would have earned $850,000 during that period. The first offer, for a film entitled Annie's Coming Out, was for a role in which Redgrave had expressed interest in February 1982, two months prior to the BSO cancellation. The offer for the role was made in July 1982, a short time after the BSO's cancellation, and was finalized in August 1982. The film was to be financed by Film Australia, a government production company, and no evidence was presented that Redgrave believed the film might experience financial difficulties. Redgrave's fee for the film was to be $250,000.\n\nFrom July 1982 until approximately the end of October 1982, Redgrave believed that she would be filming Annie's Coming Out sometime during the fall.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Because of that commitment, Redgrave turned down other firm offers that had secure financial backing. These included an offer received in July 1982 to do a cameo appearance in a Monty Python film entitled Yellowbeard for $10,000 and an offer received in September 1982 to star in the television film Who Will Love My Children ? for $150,000. In late October or early November 1982, Redgrave was informed that Annie's Coming Out would not be produced because of financial difficulties. No evidence was presented that the film's financial failure was related to the BSO cancellation.\n\nIn February 1983, Redgrave accepted an offer to appear in the film No Alternatives, for a fee of $350,000. Until June or July of 1983, Redgrave assumed that she would be filming No Alternatives. During that period, Redgrave turned down other offers, including an offer to appear in a film about Andre Sakharov for a fee of $70,000.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In June or July of 1983, Redgrave was informed that No Alternatives would not be filmed because of financial difficulties. Redgrave received $25,000 as a forfeiture on the contract.\n\nIn June 1983, Redgrave accepted an offer to appear in a film entitled Track 39, for a fee of $250,000. This film fell through in late July 1983. There was no allegation that the financial failures of either No Alternatives or Track 39 were directly related to the BSO cancellation.\n\nAlthough there is no doubt that Redgrave did not have a successful financial year following the BSO cancellation, we cannot say that she presented sufficient evidence to prove that her financial difficulties were caused by the BSO cancellation. No evidence was presented that, at the time she accepted the offer for Annie's Coming Out, Redgrave believed the film would experience financial difficulties.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In addition, there was no allegation that the offers Redgrave turned down because of her commitment to Annie's Coming Out, such as offers to appear in Yellowbeard and Who Will Love My Children ?, did not have firm financial backing. If Annie's Coming Out had been produced, Redgrave would have earned $250,000 in the year following the BSO cancellation -- an amount equal to Redgrave's average earnings before April 1982.\n\nRedgrave contends, however, that the film offers she received following the BSO cancellation lacked secure financial backing and were thus significantly different from offers she had received prior to the cancellation.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Thus, although Redgrave would have received $600,000 had No Alternatives and Track 39 been produced, she argues that the fact that she had to accept two films that ultimately were not produced was itself a result of the BSO cancellation.\n\nWe have some doubt as to whether Redgrave presented sufficient evidence to prove that the type of film offers she received in the year following the BSO cancellation were radically different from the film offers received before the cancellation. On direct examination, Redgrave testified regarding her previous performances, starting from 1966. As to most of the years, Redgrave testified solely regarding the work she did, rather than the offers she received, noting that she could only \"remember what [she] actually did at the moment\" and not the offers she had received. Redgrave did testify that she received four film offers in 1980, none of which she accepted, and four film offers in 1981, two of which she accepted. No evidence was presented, however, regarding the financial backing of those films that were offered to Redgrave but which she did not accept. Thus, the evidence does not present an effective comparison between the type of film offers received before and after the BSO cancellation and we are left primarily with Redgrave's allegation that the film offers received in the two time periods were significantly different.\n\nEven if we accept, however, that Redgrave proved she had experienced a drop in the quality of film offers following the BSO cancellation, Redgrave must also prove that the drop was proximately caused by the BSO cancellation and not by other, independent factors. Redgrave failed to carry her burden of presenting evidence sufficient to allow a jury reasonably to infer this causal connection.\n\nThe defense introduced evidence that Redgrave's political activities and statements had generated much media attention prior to the incident with the BSO. Redgrave conceded that her agents had informed her, prior to April 1982, that certain producers were hesitant to hire her because of the controversy she generated. And, in a newspaper interview in February 1982, Redgrave stated that she \"had lost a lot of work because of her political beliefs\" but that every time there had been a move to stop her working, \"an equally terrific response [came] forward condemning any witch hunts.\" App. 983.\n\nTo the extent that Redgrave may have experienced a decline in the quality of film offers received subsequent to April 1982, that decline could have been the result of Redgrave's political views and not the result of the BSO's cancellation.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Even if the cancellation highlighted for producers the potential problems in hiring Redgrave, it was Redgrave's burden to establish that, in some way, the cancellation itself caused the difference in film offers rather than the problems as highlighted by the cancellation. Redgrave produced no direct evidence from film producers who were influenced by the cancellation. Thus, the jury's inference that the BSO cancellation had caused Redgrave consequential damages was one based more on \"conjecture and speculation,\" Carlson v. American Safety Equipment Corp., 528 F.2d at 386, than on a sufficient factual basis.\n\nRedgrave also claims that the BSO's cancellation caused a drop in her offers to perform on Broadway. Bruce Savan, Redgrave's agent, testified regarding all offers to perform in American theater that had been made to Redgrave prior to April 1982. The offers averaged from two to four plays in the years 1976-1980. There was no evidence of any offers to perform on Broadway made to Redgrave in 1981, the year immediately preceding the BSO cancellation. Redgrave accepted only one of the offers made during this time period, appearing in Lady From the Sea in off-Broadway's Circle in the Square in 1976.\n\nRedgrave contends that, as a result of the BSO cancellation, she no longer received offers to appear on Broadway. She testified that in April 1983 she was appearing in a successful English theater production of The Aspern Papers and was led to believe by the producers that the show would move to New York. Although it was Redgrave's opinion that the reason the play did not move to Broadway was because of the \"situation\" caused by the BSO cancellation, there was no testimony from the producers or others as to why the production did not go to Broadway. Redgrave also testified that in August 1983 she was asked by the Jujamson producers to appear in The Abdication, but that the play was never produced. Again, there was no testimony from the producers or others as to why the production did not materialize. In addition, Redgrave testified that Lillian Hellman had wished Redgrave to portray Hellman in a theater production on Broadway, but that Hellman was concerned about the BSO incident. Finally, Redgrave testified that Theodore Mann had considered offering her a role in Heartbreak House at Circle in the Square, but decided not to extend the offer because of the ramifications of the BSO cancellation.\n\nTheodore Mann was the one producer who testified regarding his decision not to employ Redgrave in a Broadway production. He explained that\n\nthe Boston Symphony Orchestra had cancelled, terminated Ms. Redgrave's contract. This had a -- this is the premier or one of the premier arts organizations in America who, like ourselves, seeks support from foundations, corporations, individuals; have subscribers; sell individual tickets. I was afraid . . . and those in my organization were afraid that this termination would have a negative effect on us if we hired her. And so we had conferences about this. We were also concerned about if there would be any physical disturbances to the performance. . . . And it was finally decided . . . that we would not hire [Redgrave] because of all the events that had happened, the cancellation by the Boston Symphony and the effects that we felt it would have on us by hiring her.\n\nApp. 1302a.\n\nThe evidence presented by Redgrave concerning her drop in Broadway offers after April 1982, apart from Mann's testimony, is not sufficient to support a finding of consequential damages.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e We do not, of course, question Redgrave's credibility in any way. Our concern is with the meager factual evidence. Redgrave had to introduce enough facts for a jury reasonably to infer that any drop in Broadway offers was proximately caused by the BSO cancellation and not by the fact that producers independently were concerned with the same factors that had motivated the BSO. Mann's testimony itself reflects the fact that many producers in New York may have been hesitant about hiring Redgrave because of a feared drop in subscription support or problems of physical disturbances. Apart from Mann's testimony, Redgrave presented nothing other than the fact that three expected offers or productions did not materialize. This type of circumstantial evidence is not sufficient to support a finding of consequential damages.\n\nIn addition, we note that it would be difficult for any assessment of damages resulting from the lack of Broadway theater offers to meet the standard that damages must be \"capable of ascertainment by reference to some definite standard, either market value, established experience or direct inference from known circumstances.\" John Hetherington \u0026 Sons, 210 Mass. at 21, 95 N.E. at 964. See Lowrie v. Castle, 225 Mass. 37, 51-52, 113 N.E. 206 (1916); Williston, Contracts, § 1346 at 239-240. The three specific performances to which Redgrave referred, other than Mann's, were never performed on Broadway and there is no indication of the compensation Redgrave would have received. In addition, Redgrave had accepted only one Broadway offer among the many she had received over the years because, according to Redgrave, the scripts were not good enough for her first Broadway appearance. There was no evidence that Redgrave would necessarily have accepted any Broadway offer made in 1982.\n\nMann's testimony regarding the production of Heartbreak House is the one piece of evidence from which reasonable fact-finders could draw conflicting inferences and upon which a reasonably ascertainable damage award could be granted. We therefore defer to the inferences drawn by the jury from that testimony and grant Redgrave damages on that basis.\n\nMann's testimony reveals that, in considering whether to hire Redgrave, he and his partners were concerned about losing support from foundations and subscribers, having difficulty selling tickets, and dealing with possible physical disruptions. These are factors that result from the community response to Redgrave's political views. They are the same factors that apparently motivated the BSO to cancel its contract with Redgrave and are not the result of that cancellation. Thus, one possibly could infer from Mann's testimony that the BSO cancellation was not a proximate cause of the damage suffered by Redgrave in being denied the part in Heartbreak House.\n\nMann also testified, however, that he and his partners were affected by the BSO cancellation because the BSO was a premier arts organization and was dependent on the same type of support as Circle in the Square. A jury reasonably could infer that the BSO's cancellation did more than just highlight for Mann the potential problems that hiring Redgrave would cause but was actually a cause of Mann's decision, perhaps because Mann's theater support was similar to that of the BSO or because Mann felt influenced to follow the example of a \"premier arts organization.\" Because this is a possible inference that a jury could draw from Mann's testimony, we defer to that inference. We therefore find that Redgrave presented sufficient evidence to prove consequential damages of $12,000, the fee arrangement contemplated by Mann for Redgrave's appearance in Heartbreak House, minus expenses she personally would have incurred had she appeared in the play.\n\nIII. THE MASSACHUSETTS CIVIL RIGHTS CLAIM AND THE DEFENSE OF ACQUIESCENCE TO THIRD-PARTY PRESSURE\n\nThe factor that converts this case from a garden variety, if not simple, contract action into an exotic plant without very apposite precedents is the MCRA (and its judicial gloss as added by the Massachusetts Supreme Judicial Court). As we shall see, the MCRA extends the 42 U.S.C. § 1983 concept of a civil rights claim against government officials to a claim against private individuals, so that it is no defense to the MCRA to show that the defendant's action was not \"state action.\" Further, as with a typical civil rights claim against a government official, it is no defense to the MCRA to show that a defendant acted in response to third-party pressure. Finally, the sweeping liability resulting from the absence of these defenses may be limited by a constitutional right of free speech.\n\nA. The Nature of the Claim\n\nThe MCRA creates a private cause of action for injunctive and other equitable relief, including damages, against \"any person or persons, whether or not acting under color of law, [who] interfere by threats, intimidation or coercion, or attempt to interfere by threats, intimidation or coercion, with the exercise or enjoyment by any other person or persons of rights secured by the constitution or laws of the United States, or of rights secured by the constitution or laws of the commonwealth.\" Mass. Gen. L. ch. 12, §§ 11H -- I (1986). A right is \"secured\" against private parties under the MCRA even though the constitutional provision from which it emanates applies only to government action. See Bell v. Mazza, 394 Mass. 176, 474 N.E.2d 1111 (1985). In this fashion the MCRA dispenses with the state action requirement of ordinary civil rights claims, by permitting a plaintiff to sue a private party for action that would be, absent the MCRA, forbidden only to state actors.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nRedgrave alleged that the BSO interfered with her \"secured\" rights of free speech and free association under the First Amendment\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and the Massachusetts Constitution.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Redgrave asserted that her secured rights were violated whether the BSO cancelled the contract because its own agents disagreed with her political views and intended to punish her for past speech or repress her future speech, or whether the BSO cancelled the contract because it acquiesced to pressure from third parties who disagreed with her views and intended to punish her or chill her expression.\n\nB. The Findings Below\n\nThe jury, in answer to a special interrogatory, found that the BSO did not cancel the contract because its own agents disagreed with Redgrave's political views. Although the district court found that the BSO cancelled because of outside pressure, the court held that Redgrave's MCRA claim failed, because acquiescence to third party pressure, absent any discriminatory intent, did not constitute \"threats, intimidation, or coercion\" under the MCRA.\n\nThe court did not go further and make a finding as to the precise reason why the BSO cancelled, but it did find credible the testimony of BSO officials that the BSO cancelled because of concerns over the physical safety of the performers and audience and over disruptions that might jeopardize the artistic qualities of the performance. The court cited the testimony of, among others, Seiji Ozawa, the BSO's Music Director, who explained that his conception of \"Oedipus Rex\" required an \"atmosphere of hearing\" in which both performers and audience could concentrate, rather than an atmosphere influenced by shouting, booing, and the presence of uniformed police. Earlier in the case, the district court had noted that \"the extent to which a broad interpretation of the MCRA could interfere with the BSO's First Amendment rights to make artistic judgments may depend upon whether the factfinder decides that the cancellation of the concerts was at least in part for artistic reasons.\" In ultimately ruling for the BSO on Redgrave's MCRA claim, however, the district court did not reach this constitutional issue.\n\nC. Our Certified Questions and the Answers\n\nBecause we felt that Redgrave's MCRA claim turned on a significant question of Massachusetts law on which we found no controlling precedent, we certified two questions of law to the Supreme Judicial Court of the Commonwealth pursuant to Supreme Judicial Court Rule 1:03. The questions were as follows:\n\n1. Under the Massachusetts Civil Rights Act, Mass. Gen. Laws ch. 12, § 11H and § 11I, may a defendant be held liable for interfering with the rights of another person, by \"threats, intimidation, or coercion\", if the defendant had no personal desire to interfere with the rights of that person but acquiesced to pressure from third parties who did wish to interfere with such rights?\n\n2. If a defendant can be held liable under the Massachusetts Civil Rights Act for acquiescence to third party pressure, is it a defense for the defendant to show that its actions were independently motivated by additional concerns, such as the threat of extensive economic loss, physical safety, or particular concerns affecting the defendant's course of business?\n\nThe Supreme Judicial Court answered \"Yes\" to the first question. It held:\n\nMaking an exemption for civil rights deprivations resulting from third-party pressure \"would reward and encourage\" the very conduct which the substantive statutes prohibit. See Sarni Original Dry Cleaners, Inc. v. Cooke, 388 Mass. 611, 618 n. 7, 447 N.E.2d 1228 (1983). Whether the issue is phrased in terms of the existence of a specific intent requirement under the Massachusetts Civil Rights Act or a third-party pressure exemption from the statute, recognizing such an exemption would tend to eviscerate the statute and defeat the legislative policies behind the statute. Persons seeking to interfere with the civil rights of others in violation of the statute may not know or believe that the interference may lead to civil or criminal liability. Thus, to be effective, the provisions of §§ 11H and 11I must apply to any threatening, intimidating, or coercive behavior regardless of whether the defendant specifically intended to interfere with a right to which the plaintiff is entitled. Accordingly, we answer \"yes\" to the first question.\n\nRedgrave v. Boston Symphony Orchestra, 399 Mass. 93, 100, 502 N.E.2d 1375, 1379 (1987).\n\nThe second question was answered \"No.\" The court held:\n\nAs an abstract proposition, fear of business disruption, fear for economic loss, or fear for physical safety are not justifications under §§ 11H and 11I. The legislative intent would be negated if such defenses were permitted. See Sarni Original Dry Cleaners, Inc. v. Cooke, supra. In an analogous context, the Supreme Court has rejected the notion that private biases and injuries that may be inflicted as a result of such biases are permissible justifications for deprivations of constitutional rights. Palmore v. Sidoti, 466 U.S. 429, 104 S. Ct. 1879, 80 L. Ed. 2d 421 (1984). Fear that the prejudice of third-party actors may lead to a breach of the peace has also been rejected as a justification for deprivations of civil rights. Buchanan v. Warley, 245 U.S. 60, 81, 38 S. Ct. 16, 20, 62 L. Ed. 149 (1917). We recognize that explicit and imminent danger of physical harm might well in some circumstances justify interference with an individual's civil rights (cf. Brandenburg v. Ohio, 395 U.S. 444, 447, 89 S. Ct. 1827, 1829, 23 L. Ed. 2d 430 [1969]), but the certified question raises no such premise. Our answer to the second certified question is, \"No.\"\n\n399 Mass. at 101, 502 N.E.2d at 1379-80.\n\nThese answers effectively disposed of the district court's view that acquiescence to third party pressure was a defense to an MCRA action. At first blush, this might suggest, as our dissenting colleagues insist, that we must now confront the BSO's additional argument for affirmance -- that the First Amendment protects it from MCRA liability. The response of the SJC, however, significantly expanded upon and went beyond the answers to our specific questions. The nature and deliberateness of these additional remarks convince us that, as a matter of Massachusetts law, the BSO may not in these circumstances be held liable under the MCRA.\n\nIV. THE MASSACHUSETTS CIVIL RIGHTS ACT CLAIM: THE TEACHINGS OF THE SUPREME JUDICIAL COURT\n\nThe response of the Supreme Judicial Court to our questions was divided among three groups of Justices: the Chief Justice, writing for himself and Justices Liacos and Nolan; Justice Wilkins, joined by Justice Abrams, concurring; and Justice O'Connor, joined by Justice Lynch, dissenting. All three groups thought it necessary to identify an issue we had not raised expressly in our two certified questions. All three groups indicated, in tones ranging from strong suggestion to outright certainty, a view that the BSO should not be held liable under the MCRA for exercising its free speech right not to perform.\n\nAlthough all of the Justices' reflections on this issue technically may fall under the heading of dicta, they are so deliberate, so unanimously expressed, and involve such a basic proposition, that we feel constrained to listen carefully. The certification process is the only opportunity for direct dialogue between a federal and a state court. We think it pointless to turn a deaf ear to all but the direct responses to formal questions where, as here, other important issues clearly are implicated. To do so would be to elevate form over substance, to ignore a helpful opportunity to interpret state law correctly, and to demean the principles of comity and federalism. \"In the absence of a definitive ruling by the highest state court, a federal court may consider 'analogous decisions, considered dicta, scholarly works, and any other reliable data tending convincingly to show how the highest court in the state would decide the issue at hand,' taking into account the broad policies and trends so evinced.\" Michelin Tires (Canada) Ltd. v. First National Bank of Boston, 666 F.2d 673, 682 (1st Cir. 1981) (quoting McKenna v. Ortho Pharmaceutical Corp., 622 F.2d 657, 663 (3d Cir. 1980)).\n\nAs two commentators recently have noted:\n\nThe ability of the answering court to reshape or add to the issues is necessary to further the goals of certification. The answering court may be best situated to frame the question for precedential value and to control the development of its laws. If state courts take offense at a poorly framed question, they may miss a genuine opportunity to settle state law on a particular point.\n\nCorr \u0026 Robbins, Interjurisdictional Certification and Choice of Law, 41 Vand. L. Rev. 411, 426 (1988). See also Martinez v. Rodriquez, 394 F.2d 156, 159 n. 6 (5th Cir. 1968) (form of certified question should \"not . . restrict the [state] Supreme Court's consideration of the problems involved and the issues as the Supreme Court perceives them to be in its analysis of the record certified . . ., [including] the Supreme Court's restatement of the issue or issues and the manner in which the answers are to be given, whether as a comprehensive whole or in subordinate or even contingent parts\") (emphasis supplied); St. Paul Fire \u0026 Marine Ins. Co. v. Caguas Federal Savings \u0026 Loan Ass'n of Puerto Rico, 825 F.2d 536, 537 (1st Cir. 1986) (welcoming the advice of the answering court \"on any other question of Puerto Rican law material to this case on which it would like to comment\").\n\nIn order to understand the reaction of the Supreme Judicial Court, it is helpful to describe the difficulty of the free expression issues involved, and the uncommon relation of the MCRA to those issues.\n\nA. A Conflict of Rights\n\nThe MCRA is an unusual statute, a civil rights law that abolishes the state action requirement for constitutional claims of deprivation of rights. This is not difficult to understand in the context of racial discrimination, the prohibition of which was the statute's primary object. Redgrave, 399 Mass. at 105. There, it makes sense to treat private individuals similarly to the state, just as Title VII is designed as a \"private\" analogue to the non-discrimination provisions of the Constitution. But where the issue is the plaintiff's \"right\" to free speech, the analogy is strained.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Such a right traditionally has content only in relation to state action -- the state must be neutral as to all expression, and must not unreasonably restrain speech or expression. The right is to be free of state regulation, so that all private speech is formally on equal footing as a legal matter. In the traditional context, this means that various private actors can, without state interference, battle it out in the marketplace of ideas.\n\nIn the present case, this application of the statute is made doubly unusual because, unlike in the typical discrimination case, there are free speech interests on the defendant's side of the balance as well. The plaintiff's statutory \"free speech\" right against the defendant is to be measured against the defendant's constitutional right against the state. If it were to enforce the statute, the state would be entering the marketplace of ideas in order to restrict speech that may have the effect of \"coercing\" other speech.\n\nWe have grave concerns about the implications of such a conflict. If constitutional protections are effectively to protect private expression, they must do so, to some extent, even when the expression (or lack thereof) of one private person threatens to interfere with the expression of another. To permit a newspaper, for example, wide freedom to pick and choose what to print, freedom to turn down some who would write letters or columns with which a particular newspaper (or its readers) disagrees, is to permit the newspaper to deprive certain speakers of an audience (perhaps deliberately, perhaps for \"speech-content-related\" reasons) or to intimidate the expression of other voices outside the newspaper. But, for the government to guarantee even some of those speakers a \"newspaper\" platform (or guarantee that they will not be coerced by what the newspaper decides to write or not to write) itself risks interfering with the newspaper's editorial freedom. The freedom of mediating institutions, newspapers, universities, political associations, and artistic organizations and individuals themselves to pick and choose among ideas, to winnow, to criticize, to investigate, to elaborate, to protest, to support, to boycott, and even to reject is essential if \"free speech\" is to prove meaningful. The courts, noting that free speech guarantees protect citizens against governmental restraints upon expression, have hesitated to permit governments to referee disputes between speakers lest such mediation, even when it flies the banner of \"protecting speech,\" interfere with the very type of interest it seeks to protect.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWe digress briefly to note that we disagree fundamentally with our dissenting colleagues' analysis of the constitutional questions implicated in this case. The BSO does not demand, as our dissenting colleagues claim, the constitutional right to perform without audience interruption, or an absolute right against any infringement of its artistic expression. Of course there are no such rights. The BSO merely alleges a constitutional right not to be penalized\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e for failing to perform an artistic work where the BSO believes that its expression will be compromised or ineffective. That the reason for its desire to cancel may be the potential for audience disruption does not mean that the decision should be immune from constitutional solicitude.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The BSO asserts, simply, a right to be free from compelled expression.\n\nIt is clear that artistic expression in the performing arts enjoys substantial constitutional protection. Schad v. Borough of Mount Ephraim, 452 U.S. 61, 65-66, 68 L. Ed. 2d 671, 101 S. Ct. 2176 (1981). Protection for free expression in the arts should be particularly strong when asserted against a state effort to compel expression, for then the law's typical reluctance to force private citizens to act, cf., e.g., Lumley v. Wagner, 42 Eng. Rep. 687, 693 (Ch. 1852), augments its constitutionally based concern for the integrity of the artist. A distinguished line of cases has underscored a private party's right to refuse compelled expression. West Virginia State Bd. of Educ. v. Barnette, 319 U.S. 624, 87 L. Ed. 1628, 63 S. Ct. 1178 (1943) (invalidating a compulsory flag salute statute); Miami Herald Publishing Co. v. Tornillo, 418 U.S. 241, 41 L. Ed. 2d 730, 94 S. Ct. 2831 (1974) (invalidating a statute forcing newspapers to print candidates' replies to editorials, as an impermissible burden on \"editorial control and judgment\"); Wooley v. Maynard, 430 U.S. 705, 51 L. Ed. 2d 752, 97 S. Ct. 1428 (1976) (invalidating penalty for refusal to display \"Live Free or Die\" motto on license plate); Pacific Gas \u0026 Elec. Co. v. Public Utilities Comm'n, 475 U.S. 1, 89 L. Ed. 2d 1, 106 S. Ct. 903 (1986) (plurality opinion) (invalidating requirement that utility place consumer group's newsletter in utility's mailings to customers).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e \"The First Amendment guarantees 'freedom of speech,' a term necessarily comprising the decision of both what to say and what not to say.\" Riley v. National Federation of the Blind of North Carolina, Inc., 487 U.S. 781, 108 S. Ct. 2667, 2677, 101 L. Ed. 2d 669 (1988) (emphasis in original). We have been unable to find any case, involving the arts or otherwise, in which a state has been allowed to compel expression. The outcome urged by our dissenting colleagues would, to our knowledge, be completely unprecedented.\n\nRedgrave conceded at oral argument, and presumably the dissent would not disagree, that persons picketing a Redgrave performance would have a free expression defense to MCRA liability. This principle logically would extend as well to persons boycotting Redgrave performances. These are activities that are intended to coerce the exercise of others' speech by means of public approbation and economic pressure. Indeed, that is their animating purpose. Yet they are protected, for the simple reason that we have always tolerated and encouraged private expression, rather than state compulsion, as the antidote to private speech with which we disagree. We see no reason why less protection should be provided where the artist refuses to perform; indeed, silence traditionally has been more sacrosanct than affirmative expression. The BSO argues that it desired simply to protect its own artistic expression, and it chose cancellation as the means of doing so. That this may have had a residual effect of coercing Redgrave's exercise of her speech should not mean that the cancellation is any less protected than expression intended to coerce such exercise.\n\nWe raise these points not to resolve the constitutional questions, but to point out how difficult those questions are to resolve, to indicate that expression-related interests appear on all sides, and to suggest that the dissent's resolution, while motivated by values we share, too easily reduces a very complex clash of rights to a simple equation that neglects the serious weight of the BSO's interests.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nWe have no reason to think that the Massachusetts Legislature enacted the MCRA in an attempt to have its courts, at the insistence of private plaintiffs, oversee the editorial judgments of newspapers, the speech-related activities of private universities, or the aesthetic judgments of artists. To be more specific, our examination of these difficulties helps us understand why at least four, and perhaps as many as seven, members of the Supreme Judicial Court wrote opinions indicating that the statute does not impose liability upon the BSO in the circumstances of this case.\n\nWe therefore present the responses of the Supreme Judicial Court.\n\nB. The Responses of the Supreme Judicial Court\n\n1. The Plurality\n\nChief Justice Hennessey was sufficiently concerned by \"some serious issues which are not addressed in the questions but which are suggested by the record of the case\" that he discussed these issues even before answering our questions. 399 Mass. at 97, 502 N.E.2d at 1377. The Chief Justice wrote:\n\nIt can be inferred from the record that the BSO was itself a victim of violations of G.L. c. 12, § 11H, by those persons who put pressure on the BSO to cancel the Redgrave participation. From the premise that the BSO had the free speech right to perform or not as it saw fit, it can be argued that the BSO's secured rights were interfered with, and that it was not within the legislative intent that anyone should be punished under c. 12 for exercising the constitutional right not to speak (i.e., perform). It can also be argued that when a private person decides not to speak and has no duty to do so, it would be unconstitutional to require that person to speak or, contractual obligations aside, to punish him civilly for not speaking.\n\nThe foregoing arguments can be focused on both of the certified questions. It can be offered that a person exercising constitutional rights who interferes with another's constitutional rights is not (Question 1) \"interfering with the rights of another person by 'threats, intimidation, or coercion,'\" within the meaning of G.L. c. 12, §§ 11H and 11I. It can be further offered by way of defense to an action under §§ 11H and 11I (Question 2) that the defendant was motivated by the \"additional concern[]\" of the artistic integrity of its production; that this motivation is within the defendant's free speech rights; and that this independent motivation, if established, is a complete defense to the action where it is also shown that the defendant had no personal wish either to punish the plaintiff or to intrude upon the plaintiff's rights.\n\nWe have not considered any of the above arguments or issues in answering the two certified questions. We treat the questions as addressed to a typical action under the Massachusetts Civil Rights Act, which does not concern a defendant who is exercising a free speech or other constitutional right in interfering with the secured rights of another. In short, we answer the two questions as they are worded.\n\n399 Mass. at 97, 502 N.E.2d at 1377.\n\nAlthough the Chief Justice was careful to frame most of the above observations as \"offerings\" or arguments, and to disregard these matters in supplying yes-or-no answers to the questions in the form we had posed them, we do not read his comments as mere speculation. On the contrary, the Chief Justice made plain that there might be no MCRA liability where a defendant is exercising its \"free speech right\" not to speak or perform. Either such liability would not be within the realm of behavior that the legislature intended to prohibit, or a constitutional defense might be offered to deny liability. The Chief Justice's opinion did not speak to the source of the constitutional defense, referring only to constitutional \"free speech rights.\"\n\n2. The Concurrence\n\nThe concurring Justices expressed a similar view in even more assertive terms. Justice Wilkins, joined by Justice Abrams, began his concurring opinion by noting that our questions were not \"clear and unequivocal\" but involved \"substantial constitutional questions.\" 399 Mass. at 101, 502 N.E.2d at 1380. He observed:\n\nBecause the BSO's constitutional right to free speech under art. 16 of the Massachusetts Declaration of Rights is present in this case, it may seem surprising to some that no question has been asked of us concerning the BSO's State constitutional right to determine not to perform \"Oedipus Rex.\" Perhaps the Court of Appeals has already concluded that, if the nonconstitutional grounds indicated by its questions are not dispositive of Redgrave's claim, First Amendment considerations will be and that, therefore, it need not ask us about analogous State constitutional considerations.\n\nI have been unable to think of any theory under which, in the circumstances, statutory liability may properly be imposed on the BSO in the face of its State constitutional right to determine what artistic performances it will or will not perform. Redgrave's constitutional rights\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e are no greater than those of the BSO, and there was no way in which the interests of each could be accommodated.\n\n399 Mass. at 102, 502 N.E.2d at 1380. Justices Wilkins and Abrams thus unequivocally expressed their view that article 16 of the Massachusetts Declaration of Rights creates a right not to speak or perform and thus bars MCRA liability in this case.\n\n3. The Dissent\n\nFinally, Justice O'Connor, joined in dissent by Justice Lynch, delved into the legislative history of the MCRA and found that, \"beyond reasonable question,\" it was enacted in 1979 \"in response to a concern about the inadequacy of then current law to deal generally with discrimination against minority groups, and more specifically, to deal with racial violence.\" 399 Mass. at 105, 502 N.E.2d at 1382. The dissenters concluded that \"racial discrimination and violence involve conduct that is specifically designed to interfere with secured rights, and it is that kind of conduct that the Legislature made the basis of civil liability.\" Id. They flatly asserted that the MCRA \"is properly interpreted to provide for liability only when the defendant interferes with a plaintiff's secured rights with the specific intent to do so.\" 399 Mass. at 106, 502 N.E.2d at 1382. Therefore, they concluded, unintentional interference with secured rights would not constitute interference by \"threats, intimidation or coercion,\" as required by the statute. This abstract conclusion was rejected by the other five justices.\n\nAs an alternative ground for rejecting Redgrave's claim, the dissenters, in the last paragraph of their opinion, identified another reason why liability was inappropriate in this case even assuming that no specific intent to coerce was required under the statute. Cancellation of the performance, the dissenters explained, \"may have conveyed a message to Redgrave that in the future other performances may be cancelled, but the conveyance of that message did not amount to threat or intimidation unless it suggested that the BSO itself intended to take future harmful action against her.\" 399 Mass. at 110, 502 N.E.2d at 1385. The dissenters concluded that \"mere cancellation of the performances would not appear to convey the message that the BSO intended to take any future action.\" Id. Thus, there would be no threat or intimidation. This statutory construction, as applied to the facts of this case, was not addressed by any of the other justices, and there is no indication that any of them would have disputed the conclusion that liability could not attach in this case.\n\nIn reaching their conclusions, the dissenting Justices specifically noted that their statutory interpretation was based not only on legislative history and logic, but also was motivated \"by another consideration.\" Justice O'Connor agreed that the plurality's answers to our certified questions implicated\n\nserious constitutional questions stemming from the BSO's constitutional right not to speak (i.e., perform), and not to be civilly liable for not speaking. Those constitutional questions are reduced or altogether removed by construing § 11I as imposing liability only on a defendant who specifically intends to interfere with another's secured rights.\n\n399 Mass. at 106, 502 N.E.2d at 1382. Justice O'Connor reasoned that \"'It is our duty to construe statutes so as to avoid . . . constitutional difficulties, if reasonable principles of interpretation permit.'\" Id. (quoting Langone v. Secretary of the Commonwealth, 388 Mass. 185, 190, 446 N.E.2d 43 (1983) (quoting in turn School Comm. of Greenfield v. Greenfield Educ. Ass'n, 385 Mass. 70, 79, 431 N.E.2d 180 (1982))). In accordance with this principle, and keeping in mind that the BSO may have intended \"only to exercise its constitutional right not to present an inartistic performance,\" 385 Mass. at 103, 502 N.E.2d at 1381, the dissenters construed the statute to preclude liability in the situation presented by this case.\n\nC. Making Sense of the Supreme Judicial Court's Opinions\n\nThere are at least four votes on the SJC denying liability on state law grounds. The concurring justices would establish a state constitutional defense, and the dissenters would interpret the statute, in light of constitutional concerns, to prohibit liability in the first instance. These two grounds are separate and not inconsistent. Because a majority of the SJC would foreclose liability on state law grounds, it is unnecessary and improper for us to reach the federal constitutional issues.\n\nWe are, moreover, confident that the entire SJC would, if explicitly asked to decide the issue, concur with the finding of no liability on both state law grounds. First, we think that there would be unanimity on the dissenters' theory that the statute does not in the first instance impose liability for refusing to perform. The dissent explicitly held so on two separate grounds. One of those grounds was rejected by the rest of the court as a general holding, but not as it related to these specific facts. Indeed, the other justices rejected the dissent's view of \"coercion\" only on the abstract assumption that constitutional concerns were not implicated in a particular case; that is, they established third-party pressure as a source of coercion and thus liability in a typical MCRA case, without reaching the novel issues of statutory construction presented by the instant facts. And none of the other justices rejected the dissent's alternative statutory interpretation in the final paragraph, which related specifically to the facts of this case.\n\nIt is not mere speculation to presume that the justices in the plurality also would deny liability on the facts of this case. In fact, the plurality opinion suggested that the statute could be construed, in light of constitutional concerns, to deny liability for cancellation of an artistic performance. On such a difficult question of statutory construction, regarding a fact situation far removed from the prototype envisioned by the legislature and implicating a plaintiff's free speech rather than equal protection rights, we think it clear that the plurality (and the concurring justices, for that matter) would interpret the statute so as to find that cancellation of a performance could not be the basis for MCRA liability.\n\nSuch a conclusion follows directly from the longstanding principle of statutory construction that \"'[a] statute must be construed, if fairly possible, so as to avoid not only the conclusion that it is unconstitutional but also grave doubts upon that score.'\" Loriol v. Keene, 343 Mass. 358, 363, 179 N.E.2d 223 (1961) (quoting United States v. Jin Fuey Moy, 241 U.S. 394, 401, 60 L. Ed. 1061, 36 S. Ct. 658 (1916)) (emphasis supplied). See also Frisby v. Schultz, 487 U.S. 474, 108 S. Ct. 2495, 2501, 101 L. Ed. 2d 420 (1988) (\"well-established principle that statutes will be interpreted to avoid constitutional difficulties\"). This principle has for many years been a paramount tenet of Massachusetts statutory construction. See, e.g., Spence v. Gormley, 387 Mass. 258, 264, 439 N.E.2d 741 (1982); Baird v. Attorney General, 371 Mass. 741, 745, 360 N.E.2d 288 (1977); Board of Appeals of Hanover v. Housing Appeals Comm., 363 Mass. 339, 364, 294 N.E.2d 393 (1973); Opinions of the Justices to the Governor, 361 Mass. 897, 901, 282 N.E.2d 629 (1972); Worcester Cnty. Nat'l Bank v. Commissioner of Banks, 340 Mass. 695, 701, 166 N.E.2d 551 (1960); Ferguson v. Commissioner of Corporations and Taxation, 316 Mass. 318, 322-24, 55 N.E.2d 618 (1944); Kennedy v. Commissioner of Corporations and Taxation, 256 Mass. 426, 430, 152 N.E. 747 (1926). The SJC has \"traditionally . . . regarded the presence of a serious constitutional question under one interpretation of a statute to be a strong indication that a different possible interpretation of that statute should be adopted, if the constitutional issue can be avoided thereby.\" Baird, 371 Mass. at 745. Even where the SJC is unpersuaded that constitutional infirmities are implicated, it \"prefer[s] to read the statute in a way that will avoid constitutional doubts.\" Spence, 387 Mass. at 264. In light of this unassailable rule of statutory construction, we are certain that the remainder of the SJC would agree with the dissenters that the MCRA, when construed in light of constitutional considerations, does not impose liability for a refusal to perform an artistic work.\n\nIt is clear that all of the justices had at the very least grave doubts about the constitutionality of imposing MCRA liability on the BSO in this case. Without seeing any indication that a single justice would otherwise have construed the statute in this case, we conclude that at least a majority would follow the traditional presumption and construe the statute so as not to implicate the constitutional right, recognized by them all, to refuse to proceed with an artistic performance.\n\nWe are equally confident that a majority, if not all, of the justices, would agree with the concurrence that a state constitutional defense also bars liability. It cannot seriously be contended that the dissenting justices, who were willing explicitly to construe the statute so as to preclude liability, would not join in the concurrence's reasoning. Similarly, the plurality took great pains to acknowledge the possibility of a constitutional defense. While neither the dissent nor the plurality distinguished between possible state and federal sources, they declared the existence of the right to refrain from performing with such certainty that, were we to hold that the First Amendment created no such right, we are confident that they would find such a right in article 16 of the Massachusetts Declaration of Rights.\n\nD. The State Law Basis for the SJC's Opinions\n\nWe think it is clear that the grounds relied upon by the concurrence and the dissent (each of which, we believe, would be adopted by a majority of the court), do in fact arise from consideration of state, rather than federal, law. The dissenting justices' view is that the statute does not contemplate liability under the facts of this case. The dissenters concluded, based on at least two separate theories, that cancellation of a performance could not constitute \"interfere[nce] by threats, intimidation or coercion\" of Redgrave's exercise of her \"right\" to speak freely. This follows from the responsibility to construe Massachusetts statutes so as to avoid possible constitutional doubts.\n\nWe next examine the concurring justices' alternative state law theory for denying liability -- a state constitutional defense. We think that our dissenting brethren are mistaken when they assert that \"any decision by the SJC that the BSO has a state constitutional defense to MCRA liability is virtually the same as, and indistinguishable from, a ruling that the BSO has a federal constitutional defense.\" Infra at 917. We note that Justice Wilkins is himself the author of a careful and scholarly study of the relationship between federal constitutional provisions and parallel provisions of the Massachusetts constitution. See Wilkins, Judicial Treatment of the Massachusetts Declaration of Rights in Relation to Cognate Provisions of the United States Constitution, 14 Suffolk U.L. Rev. 887 (1980). In that article he discusses in detail the Supreme Judicial Court's past treatment of article 16 and the future prospects for construing article 16 as divergent from the First Amendment. See id. at 897-906. In addition, the SJC has itself found it appropriate in certain circumstances to read article 16 to provide greater protection for freedom of artistic expression than does the First Amendment. See Commonwealth v. Sees, 374 Mass. 532, 536-38, 373 N.E.2d 1151, 1155-56 (1978) (finding protection under article 16 for semi-nude dancing that is not protected by the First Amendment -- compare Doran v. Salem Inn, Inc., 422 U.S. 922, 932-33, 45 L. Ed. 2d 648, 95 S. Ct. 2561 (1975)). Accord Cabaret Enterprises, Inc. v. Alcoholic Beverages Control Comm'n, 393 Mass. 13, 468 N.E.2d 612 (1984) (nude dancing). See also Commonwealth v. Upton, 394 Mass. 363, 372, 476 N.E.2d 548, 555 (1985) (reaffirming Sees, and, noting that \"the Constitution of the Commonwealth preceded and is independent of the Constitution of the United States,\" listing numerous cases where the two constitutions have been read to diverge). We do not take lightly Justice Wilkins's express reliance on the existence of a state, as opposed to federal, constitutional right. We read his concurrence as a measured and meaningful conclusion that there is such a state constitutional right.\n\nNor does Michigan v. Long, 463 U.S. 1032, 77 L. Ed. 2d 1201, 103 S. Ct. 3469 (1983), compel us to treat the SJC's constitutional views as reflecting exclusively, or primarily, federal constitutional law. Michigan v. Long addressed the prototypical case where a state court cites a mix of federal and state cases as authority for a \"constitutional\" holding. In that sort of case, the Supreme Court, on direct review of the federal questions, is legitimately concerned about the precedential impact of ambiguity on federal decisional law; the Michigan v. Long rule is devised to prevent unnecessary erosion of federal constitutional law through opaque state court rulings. But in the case before us, we defer to a state court's interpretation of state constitutional law on certification in a diversity case.\n\nWe think it clear that the concurrence did rely on \"adequate and independent state grounds,\" and we are confident that at least a majority of the SJC would join that position. The \"plain statement\" rule in Michigan, quoted at length by the dissent, makes it clear that federal review of such a decision would be inappropriate. The dissent quotes, but fails to emphasize, the Supreme Court's ruling that the state ruling is presumed to be based on federal law when that decision \"fairly appears to rest primarily on federal law, or to be interwoven with the federal law. . . .\" 463 U.S. at 1040. This prerequisite is not met here. Similarly in the next passage quoted by the dissent: there is federal jurisdiction to hear the federal claim \"when it fairly appears that the state court rested its decision primarily on federal law.\" Id. at 1042. There is, of course, no appearance at all here that the concurrence or either of the other opinions from the SJC was referring to federal law when speaking about the BSO's constitutional right not to perform, and the concurrence explictly makes reference to state constitutional law as the adequate and independent ground for denying liability.\n\nIt is not surprising that the various SJC opinions do not cite federal cases, not only because those opinions were tendered in response to questions about state law, but also because there are not any federal cases directly, or even closely, on point in such a strange fact situation and with such an unusual state statute. It cannot plausibly be argued that the SJC's opinions say anything at all about federal law. The concerns of Michigan v. Long therefore are not implicated here.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nE Conclusion\n\nIn these circumstances, and especially in view of our obligation to avoid the unnecessary decision of federal constitutional questions, we see no need to discuss the existence or content of a First Amendment right not to perform an artistic endeavor.\n\nIn sum, we decline to reach the federal constitutional issues not only to avoid the unnecessary resolution of very difficult and novel questions of constitutional law, but also to avoid an unnecessary disputation with a state court over the reach and intendment of a state statute. There are at least four, and as many as seven, votes on the SJC for denying MCRA liability for refusing to perform an artistic work. The four votes are based on separate yet not inconsistent interpretations of state law, even if federal constitutional concerns might animate those state law constructions. We are confident that each of the two state law theories would be accepted by a majority, if not all, of the court, because of the necessity of construing state statutes so as to avoid constitutional doubts. But even if the entire court was not so inclined, a majority has already declared that liability should not be imposed under state law.\n\nAccordingly, we hold, in light of our understanding of state law, that the district court correctly entered judgment for the BSO on Redgrave's MCRA claim.\n\nThe judgment on the MCRA claim is AFFIRMED and the judgment on the contract claim is VACATED and REMANDED for entry of judgment for consequential damages to the extent approved herein. No costs.\n\nBOWNES, Circuit Judge, with whom Circuit Judge SELYA joins, concurring in part and dissenting in part.\n\nAlthough I concur wholeheartedly in part II of the majority opinion concerning Redgrave's consequential contract damages claim, I cannot agree with the majority's treatment of Redgrave's claim under the Massachusetts Civil Rights Act (MCRA). Accordingly, I write separately.\n\nIn framing the terms of my disagreement, it is important to emphasize what the majority actually holds when it rebukes Redgrave's MCRA claim. The majority's opinion is not based on a federal constitutional defense to application of the MCRA against BSO. Notwithstanding that it spends eight pages discussing federal constitutional issues raised by the MCRA, supra, slip. op. at 41-48, the majority opinion -- paradoxically -- goes on to add that \"we see no need to discuss the existence or content of a First Amendment right\" for the BSO. Supra at 911. Rather, the majority purports to rest its decision solely on principles of Massachusetts state law gleaned from the answers to the two questions we certified to the Supreme Judicial Court (SJC). The result of this approach is that the majority allows a state court to bar Redgrave from recovering on essentially first amendment grounds without any independent review by a federal court.\n\nThe majority's reading of the SJC's opinions is ill-founded and wholly unconvincing. It ignores the clear and unequivocal answers to the two questions certified to the SJC, relying instead on dicta in the SJC plurality opinion, it unduly emphasizes the concurring opinion by two justices, and it engrafts onto the plurality and concurring opinions selected statements from the dissent. Then, to hold this pastiche together, it overrules, on the basis of a law review article by one of the associate justices of the SJC, well-established Massachusetts law holding that, as far as freedom of speech is concerned, state and federal rights are coextensive. Not only has the majority ignored the dictates of Michigan v. Long, 463 U.S. 1032, 77 L. Ed. 2d 1201, 103 S. Ct. 3469 (1983), it has rewritten Massachusetts law. This is comity run amok.\n\nI. THE OPINIONS OF THE SUPREME JUDICIAL COURT\n\nUnlike the majority, I do not believe that state law provides a basis for ducking the important and difficult federal constitutional issues raised by this case. Before turning to those issues, however, it is necessary first to examine what the SJC wrote in its answers to the questions certified by this court and how these answers ought to be interpreted in light of state and federal law. My discussion of the SJC's opinions is divided into two parts. The first part reviews what the SJC actually said about the scope of the MCRA and the second part applies a common sense approach concerning the import of possible defenses under the Declaration of Rights of the Massachusetts Constitution.\n\nA. What the Supreme Judicial Court Said\n\nBecause this case involves certified questions, I begin by reviewing the answers supplied by the SJC. I first point out that with respect to the answers as opposed to any dicta, there is no need to distinguish between the plurality opinion on behalf of three justices and the concurrence on behalf of two: the two concurring justices specifically joined \"in the answers given to the questions as the Chief Justice's [plurality] opinion has construed them.\" Redgrave v. Boston Symphony Orchestra, 399 Mass. 93, 101, 502 N.E.2d 1375, 1380 (1987) (Wilkins, J., concurring). A clear majority (five justices) of the SJC thus has agreed to a single answer to each of the certified questions. Each answer was favorable to the claims of Redgrave. They may be summarized as follows.\n\nFirst, a defendant may be held liable under the MCRA even if the defendant did not desire to interfere with the rights of another, but merely acquiesced to third-party pressure. See 399 Mass. at 98-100, 502 N.E.2d at 1378-79. Second, it is no defense to an action under the MCRA that the defendant's actions were motivated independently by concerns for economic loss or physical safety, absent explicit and imminent danger of physical harm. See 399 Mass. at 100-101, 502 N.E.2d at 1379-80. The logical result of these answers, seemingly lost in the majority opinion, is that the MCRA was intended to reach precisely the conduct of the BSO in this case. The only statutory defenses offered by the BSO -- that it merely acquiesced to third-party pressure and acted out of an independent concern for economic loss and physical safety -- were soundly rejected.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe three justices in the plurality and the two concurring justices were not, however, in complete agreement, as evidenced by their separate opinions. Their disagreement lay in a possible state constitutional defense for the BSO, a question which is implicitly raised by the facts of this case, but which was never certified to the SJC. The three justices in the plurality concluded that the constitutional issue was not before them and limited their answers to \"the two questions as they are worded.\" 399 Mass. at 97, 502 N.E.2d at 1377. They specifically stated that they were \"express[ing] no opinion\" on such issues as a free speech defense for the BSO. Id. In contrast, the two concurring justices found that BSO's free speech rights were inseparably involved in the case and thus did reach the question of state constitutional defenses. For himself and Justice Abrams, Justice Wilkins wrote: \"I have been unable to think of any theory under which, in the circumstances, statutory liability may properly be imposed on the BSO in the face of its State constitutional right to determine what artistic performances it will or will not perform.\" 399 Mass. at 102, 502 N.E.2d at 1380.\n\nThe two dissenting justices differed fundamentally from both the plurality and concurring justices on the question of how to interpret the MCRA. The dissenters argued that the statute must be understood to require a showing of specific intent, applying only to persons who specifically intend to interfere with secured rights of another. 399 Mass. at 102-09, 502 N.E.2d at 1380-84. Like the plurality, the dissenters did not decide whether the BSO has any state constitutional defense to the MCRA, although the dissent did use the possibility of some \"constitutional\" problems -- not specifying the federal or state Constitution as the source for such problems -- as support for its interpretation of the statute. Invoking the familiar maxim of statutory construction, the dissent argued that the MCRA should be interpreted to require specific intent so as to avoid \"serious constitutional questions\" that would otherwise arise. 399 Mass. at 106, 502 N.E.2d at 1382.\n\nA plain reading of the SJC's opinions reveals two things. First, a majority of five justices has rejected the statutory defenses offered by the BSO. Two justices dissented on this point, but we are, of course, bound to accept the conclusions of the majority and assume that the BSO's statutory defenses to the MCRA are not valid. Second, the two concurring justices reached the question of whether the BSO has any constitutional defense. They found that it did, under the state Constitution. However, a majority of five justices -- the plurality of three plus the two dissenting justices -- expressly declined to decide the constitutional question. This court is, therefore, left without definitive guidance from the SJC on that issue and must, I believe, decide both the state and federal constitutional questions in order to resolve fully the issues presented by this case.\n\nThe majority of this court obviously views the situation quite differently. It has put forth what are apparently three separate reasons for evading the constitutional questions and \"deferring\" to the views of the SJC on ostensibly state law grounds. Each argument is without merit. I address them individually.\n\nFirst, by aggregating the views of the two dissenting and two concurring justices, the majority suggests that \"there are at least four votes on the SJC denying liability on state law grounds,\" making it \"unnecessary and improper for us to reach the constitutional issues.\" Supra at 909. It is true that four members of the SJC would not have held the BSO liable under the MCRA. The two dissenters found that the MCRA did not extend liability absent specific intent to interfere with secured rights, and the two concurring justices found a state constitutional defense. Therefore, had this exact case arisen in the Massachusetts state courts and proceeded in its present form to the SJC, the BSO would not have been subjected to liability, by virtue of the somewhat unusual combined effect of two minority positions. But that possibility is simply irrelevant to the issues here, because this case did not arise in the state courts, it arose in the federal courts. As a federal court sitting in a diversity case, our task is to apply the substantive law of Massachusetts on any given state law question, not to predict what quirky result might obtain in the state courts because a particular case contains multiple state law issues, each of which attracts a minority as well as a majority position.\n\nThe central state law issues in this case are the two questions of statutory interpretation we certified to the SJC. On those questions, we have received clear answers from a majority of five justices. That two justices disagreed with the majority's analysis should have no bearing on our handling of this case, for their view, however interesting it may be, failed to carry the day in the SJC. Certainly we have no business combining the two dissenting votes with the votes of the two concurring justices, who based their position on entirely different grounds and indeed explicitly rejected the dissent's analysis. In its eagerness to \"defer\" to the SJC, the majority of this court has confused the procedure of certifying questions of state law to a state court with the procedure of certifying entire cases to state courts. Federal courts do not certify cases to state courts. They certify questions of law and then apply the answers to those questions to reach a result which represents the combined effect of majority, not minority, positions.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe second reason offered by the majority for ducking the federal issues in this case is its \"confiden[ce] that a majority, if not all, of the justices [of the SJC], would agree with the concurrence that a state constitutional defense also bars liability.\" Supra at 910. One would expect such a conclusion to be based on a substantive review of SJC decisions in the free speech area. Surprisingly, however, the majority bases its \"confidence\" solely on a reading of the three SJC opinions in this case, only one of which (the concurring opinion) even purported to reach the issue of the state Constitution. It is, therefore, necessary to review the SJC opinions in some detail in order to see how the majority could have reached such a remarkable conclusion.\n\nWriting for a plurality of the SJC, Chief Justice Hennessey addressed the question of a possible constitutional defense, which he termed \"serious issues . . . suggested by the record of this case,\" in prefatory remarks preceding his answer to the two certified questions. 399 Mass. at 97, 502 N.E.2d at 1377. This court's majority opinion quotes liberally from these remarks, concluding that they \"declar[e] the existence of the right to refrain from performing with . . . certainty.\" Supra at 910. I cannot agree.\n\nTo begin with, although the majority extensively quotes and discusses the plurality's \"serious issues\" remarks, it inexplicably omits the crucial paragraph with which these remarks are introduced and which places them in proper perspective: \"We answer the two certified questions in accordance with their clear and unequivocal wording. In so doing, we express no opinion on some serious issues which are not addressed in the questions but which are suggested by the record of the case.\" 399 Mass. at 97, 502 N.E.2d at 1377 (emphasis added). I cannot imagine how to read this passage, except as indicating that, although the plurality felt compelled to mention some issues raised by the certified questions -- including the question of a constitutional defense -- it did not wish even to state an opinion as to how those issues might be resolved. The majority's opinion subverts these clear words of the Chief Justice by reading into the Chief Justice's opinion a view that the opinion itself expressly declined to take.\n\nMoreover, if the plurality's intent not to take a position on the question of a constitutional defense was not made clear in its prefatory remarks, it is amply demonstrated by the language used by the Chief Justice to discuss the \"serious issues.\" Each remark he made, to which the court today attaches overriding significance, is phrased as an \"offering,\" a possible \"inference,\" or an \"argument,\" not as an opinion or a conclusion. See 399 Mass. at 97, 502 N.E.2d at 1377 (\"It can be inferred. . . . It can be argued. . . . It can also be argued. . . . It can be offered. . . . It can be further offered . . . .\") (emphasis added). These comments are pure hypothetical conjecture and equivocation. They do not even rise to the level of dicta because they are not statements of opinion regarding issues not before the court. They are merely recitations of arguments that might be made (concerning issues not before the court), without any indication whether the justices in the plurality indeed thought that the arguments were valid. The plurality deliberately narrowed the focus of both questions, particularly question two, by stating immediately after the remarks: \"We have not considered any of the above arguments or issues in answering the two certified questions.\" Id. The justices of the Supreme Judicial Court know how to offer an opinion, even in dicta, when they choose to do so. This court's attempt to elevate the plurality's comments into rulings of law binding on us ignores its expressed intent not to issue such rulings in this case.\n\nIt is also important to note that Justice Wilkins' decision to reach the question of defenses under the Massachusetts Constitution was the sole reason for his filing a separate concurrence. In every other respect, he agreed with the analysis of the plurality. See 399 Mass. at 101-02, 502 N.E.2d at 1380. By suggesting that both the plurality and concurrence \"would\" have found a state constitutional defense to the MCRA in this case, supra, slip. op. at 57, the majority of this court attempts to read out of existence the one and only distinction between the two SJC opinions. Notwithstanding that the five justices found sufficient disagreement amongst themselves to warrant two separate opinions, this court declares that the justices were actually in total agreement concerning a constitutional defense. This dovetailing of the plurality and concurring opinions is achieved by wresting the justices' words out of the context in which they were used.\n\nAs if it were not presumptuous enough to have disregarded the stated ground for disagreement between the plurality and concurring justices, the majority of this court goes on to create \"unanimity\" on the part of the SJC by declaring that the dissenters as well \"would\" have joined in the concurring justices' finding of a state constitutional defense. Supra, slip. op. at 57. The dissent certainly says no such thing explicitly. No constitutional cases are cited by the dissent. Indeed, the dissent's only reference to any constitution was its assertion that interpreting the MCRA to require a showing of specific intent avoided \"serious constitutional questions.\" 399 Mass. at 106, 502 N.E.2d at 1382. This court's majority opinion pays lip service to this principle of statutory construction, but then overlooks the central point of the dissenting justices' opinion. When the dissent said it was construing the MCRA to avoid constitutional questions, it was doing precisely that: avoiding the constitutional question, not deciding it. It is only by ignoring the very words of the dissent, and inverting the maxim of statutory construction invoked by the dissent, that the majority of this court purports to find within the SJC dissent a resolution of the constitutional question.\n\nFor its third reason to justify avoiding the federal issues in this case, the majority latches on to dictum in the dissent from the SJC. In this dictum, the dissenters identified an additional possible statutory defense for the BSO, namely, that \"merely\" cancelling the performance was not \"threats, intimidation or coercion\" within the meaning of the MCRA. See 399 Mass. at 110, 502 N.E.2d 1385; supra, slip op. at 52-53. Importantly, this argument was not articulated by any party to this case nor was it addressed in any fashion by either the plurality or the concurring justices of the SJC. It was simply a suggested theory, virtually an aside, presented in the last paragraph of the dissent. At that, the dissenting justices noted only that it was \"doubtful\" that the BSO's action amounted to \"interference with secured rights by threats, intimidation or coercion.\" 399 Mass. at 110, 502 N.E.2d at 1385 (O'Connor, J., dissenting).\n\nNevertheless, the majority speculates that there \"would\" be \"unanimity\" on this theory. Supra, slip op. at 54. The majority identifies no precedent of the SJC that supports such speculation. It merely points out that the SJC, like all courts, normally construes statutes so as to avoid constitutional difficulties and also notes that \"none of the other justices rejected\" the dissent's \"novel\" statutory argument. Id. I think it obvious that this important issue of statutory construction cannot stand on such a flimsy foundation. To begin with, I can ascribe no significance to the fact that the plurality and concurring justices failed to reject this argument given that no party ever raised the issue and it was not even the basis for the dissent. More fundamentally, I think that the majority's facile interpretation of the statute is absolutely untenable as applied to the facts of this case. The BSO did not \"merely\" cancel a performance, it cancelled an employment contract with Redgrave -- essentially fired her -- on the basis of community reaction to her political beliefs. In so doing, the BSO substantially undermined Redgrave's ability to obtain other work, as evidenced by the fact that this court has affirmed an award to Redgrave of $12,000 in consequential contract damages. See part II supra. Even if they do not amount to \"threats\" or \"intimidation,\" I fail to see how the BSO's actions, affecting Redgrave's fundamental right to work, can be characterized as other than \"coercive\" within the meaning of the MCRA.\n\nIn sum, I do not agree with the majority's selective reading of the SJC's opinions. I find no basis in those opinions for rejecting Redgrave's claims on state law grounds. Accordingly, I move on to consider the issues not resolved by the SJC: possible defenses for the BSO under the Massachusetts Declaration of Rights and the United States Constitution.\n\nB. Application of the Massachusetts Declaration of Rights\n\nAlthough the issue of a possible state constitutional defense for the BSO was not reached by a majority of the SJC, it remains (at least potentially) an important question in this case. For, if the Massachusetts Declaration of Rights does provide an adequate and independent state law basis for precluding application of the MCRA to the BSO, we need not reach the question of a possible federal constitutional defense. The answer to this question is, however, as simple as it is important: insofar as freedom of speech is concerned, the Massachusetts and federal rights have previously been held to be coextensive. In the words of the SJC, \"the criteria which have been established by the United States Supreme Court for judging claims arising under the First Amendment . . . are equally appropriate to claims brought under the cognate provisions of the Massachusetts Constitution.\" Opinions of the Justices to the House of Representatives, 387 Mass. 1201, 1202, 440 N.E.2d 1159, 1160 (1982) (quoting Colo v. Treasurer \u0026 Receiver General, 378 Mass. 550, 558, 392 N.E.2d 1195, 1200 (1979) (same holding)).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nTo determine the breadth of constitutional free speech defenses in Massachusetts, then, we need only construe the federal Constitution itself and we will have our answer. Moreover, because Massachusetts has chosen to base the interpretation of its own free speech rights on analogous federal rights, as a federal court we cannot avoid construing the federal Constitution even if we could find a state court opinion directly on point. Any decision by the SJC that the BSO has a state constitutional defense to MCRA liability is virtually the same as, and indistinguishable from, a ruling that the BSO has a federal constitutional defense. Such a state court interpretation of federal law is, of course, not binding authority on the federal courts.\n\nThe majority opinion attempts to evade the impact of this point by referring to a law review article by Justice Wilkins, who wrote the concurring opinion in the SJC. Justice Wilkins' article discusses generally the relationship between the United States Constitution and the Massachusetts Declaration of Rights and, among other things, it explores \"the future prospects for construing [the Massachusetts free speech guarantees] as divergent from the First Amendment.\" Supra at 910 (emphasis added). Based solely on this law review commentary, the majority says it feels confident that when Justice Wilkins referred to the Declaration of Rights in his concurrence, he conclusively signalled that the Massachusetts Constitution was to be interpreted as different from the United States Constitution. I do not agree. The principle that Massachusetts and federal free speech rights are coextensive is a firmly established one, noted in many opinions of the SJC. See, e.g., cases cited supra, slip op. at 75. It has never seriously been questioned in any SJC opinion.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e This principle leads to the inescapable presumption that whenever the SJC rules on the state constitutional right to free speech, it is also ruling on the first amendment. The extrajudicial commentary of a single justice does not alter this presumption. If anything, Justice Wilkins' law review article demonstrates a familiarity with past SJC practice such that if he had wanted to depart from the established rule, he would have done so explicitly.\n\nIn discussing its own jurisdiction in Michigan v. Long, 463 U.S. 1032, 77 L. Ed. 2d 1201, 103 S. Ct. 3469 (1983), the Supreme Court also explored the interplay between analogous state and federal constitutional guarantees, and developed a firm rule to be applied by federal courts in determining whether a state court decision rests on \"adequate and independent state grounds\" such that federal review would be inappropriate. As the Court noted, the \"adequate and independent state grounds\" doctrine is based on \"respect for the independence of state courts, as well as avoidance of rendering advisory opinions.\" Id. at 1040. It provides that where there is no dispositive issue of federal law, the federal courts will not disturb state court rulings. The application of the doctrine has not, however, always been easy. The problem confronted by the Long Court was this: state constitutional rulings often do not make clear whether the basis for the ruling is the federal Constitution or an independent provision of the state constitution. Prior to Long, such ambiguity had lead to a series of inconsistent and \"unsatisfactory\" \" ad hoc \" decisions by the Court. Id. at 1039. Thus, in Long, the \"plain statement\" rule was set down:\n\nWhen . . . a state court decision fairly appears to rest primarily on federal law, or to be interwoven with the federal law, and when the adequacy and independence of any possible state law ground is not clear from the face of the opinion, we will accept as the most reasonable explanation that the state court decided the way it did because it believed that federal law required it to do so.\n\n[Thus,] in determining . . . whether . . . to review a case that is alleged to rest on adequate and independent state grounds, we merely assume that there are no such grounds when it is not clear from the opinion itself that the state court relied upon an adequate and independent state ground and when it fairly appears that the state court rested its decision primarily on federal law.\n\nId. at 1040-42 (citations omitted) (emphasis added).\n\nAs I have already stated, I believe that neither the SJC plurality opinion nor the dissent can fairly be read to have decided or opined on any constitutional issue. However, even assuming that all three opinions suggested a constitutional ruling, none satisfies the Long plain statement test and none, therefore, justifies the majority's evasion of the federal constitutional issues raised. With respect to the plurality and the dissent, this court's majority opinion itself notes that neither \"distinguished between possible state and federal sources.\" Supra at 910. To the extent those opinions have any constitutional dimension, they are precisely the kind of \"opaque\" state court rulings that Long was intended to address. See supra, slip. op. at 60.\n\nThe majority attempts to overcome this facial violation of the plain statement rule through its \"confidence\" that the plurality and dissenting justices \"would\" decide this case on state constitutional grounds if that issue were presented to them. Supra, slip. op. at 60. Speculation about what the SJC \"would\" decide does not, however, a plain statement make, and without a plain statement that the justices intended to rely independently on the Massachusetts Constitution, we must, under Long, assume that the justices were relying on the federal Constitution.\n\nThe opinion of the two concurring justices presents a somewhat more difficult question with respect to the plain statement rule because it did rely on the Massachusetts Constitution without explicitly referencing the federal Constitution. As previously noted, however, in invoking the Massachusetts Declaration of Rights, the concurring justices expressed no intent to depart from the established rule that state free speech rights are identical to and based on federal rights. Their opinion, therefore, does not provide \"independent grounds\" as required by Long.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nOverall, the majority has read between the lines of the SJC's three opinions, ferreted out a constitutional ruling where none was intended, and then blindly deferred to that ruling in the complete absence of any plain statement of adequate and independent state grounds.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e This flouts the compelling logic and binding precedent of Long.\n\nThe ultimate irony in this manipulative reading of the SJC's opinions lies in its purported justification: faithfulness to \"principles of comity and federalism.\" Supra at 903. Certainly, the process whereby federal courts certify doubtful questions of state law to state courts can \"save time, energy, resources and hel[p] build a cooperative judicial federalism.\" Lehman Bros. v. Schein, 416 U.S. 386, 391, 40 L. Ed. 2d 215, 94 S. Ct. 1741 (1974). And where, as here, a state court delivers a definite answer to a question of state law which has been put to it, in the interest of comity that answer is normally conclusive in federal court. Even a definite answer to a question of state law not explicitly certified is welcome and entitled to considerable deference. But such principles simply are not involved in the extraordinary action taken by this court today. Not only does the majority of this court ignore the direct answers supplied by the SJC to the questions we certified, it finds controlling a question of law that was never even reached by a majority of the SJC.\n\nThe root of the problem presented by the majority's handling of this case, I believe, lies not with any error by the SJC, but with a mistake by the original panel in this case (which included me). When we certified our two questions to the SJC, we erred by not framing questions that were complete enough and broad enough in scope to elicit definitive answers from the SJC on all relevant, unresolved questions of Massachusetts law. But rather than admitting this error, and certifying new questions to the SJC, the majority now compounds our mistake by entering into a guessing game about what the SJC \"would\" have done if we had certified sufficiently broad questions. The majority opinion is riddled with terms of speculation, actually using the word \"would\" more than twenty times to describe what the SJC \"would\" decide if all the state law issues had been put squarely before it.\n\nThe majority's opinion amounts to nothing more than a prediction, a \"hunch,\" based on comments, or at best dicta, contained in the SJC's opinions, that the SJC \"would\" decide the question of constitutional law raised by this case in favor of the BSO and that the state constitutional ruling \"would\" be independent from the federal Constitution. This approach turns comity on its head, and makes a mockery of the certification process.\n\nFar from deferring to state court prerogative, the majority's action places a federal court in the position of itself deciding a delicate and unresolved question of state law. In so doing, the court disregards the words of the SJC's answers to the certified questions by reading into those answers a view the SJC expressly declined to adopt. And, to make matters worse, the court has resolved the state law issues in a manner that actually constitutes a break with existing state court precedent. Today, the United States Court of Appeals for the First Circuit effectively makes itself the first court ever to hold, as a matter of state law, that free speech rights under the Massachusetts Constitution are not based on federal court interpretations of the first amendment.\n\nThis concludes my reasons for disagreeing with the majority's interpretation of the SJC opinions. My opinion cannot, however, end here. In order to fully resolve the issues of the case, and to demonstrate why the result reached by the majority is wrong, I must discuss whether the BSO has a first amendment defense that blocks application of the MCRA.\n\nII. THE FIRST AMENDMENT \"ARTISTIC INTEGRITY\" DEFENSE\n\nThe next issue, therefore, is whether the BSO has, as it asserts, a first amendment \"artistic integrity\" defense to its violation of the MCRA. Although the words \"artistic integrity\" evoke a positive response and sound as if they ought to come within the protective mantle of the first amendment, I have found no case explicitly recognizing a first amendment right of \"artistic integrity.\" The term is hard to define. It can mean an actor's desire to perform a role as she wishes, the right of an artist to write, paint, or compose free of any outside restraints, or a myriad of other activities involving artistic creation and expression. In the context of this case, however, and as articulated by the BSO, it means the right of the BSO to refuse to perform Oedipus Rex under less than optimal audience conditions. I recognize that the BSO has a first amendment right to control its artistic expression but, like every other first amendment right, this one is not an absolute.\n\nThe MCRA provides a cause of action against \"any person or persons, whether or not acting under color of law, [who] interfere by threats, intimidation of coercion\" with the free speech rights of another. Redgrave argues that the BSO's refusal to perform with her as narrator was motivated, as it clearly was, by the public outcry over her open endorsement of the Palestine Liberation Organization (PLO). She claims that she was deprived of employment because of her political views and that this deprivation amounted to coercion. The SJC agreed, rejecting the BSO's proffered statutory defenses to MCRA liability.\n\nThis case thus presents a clash between Redgrave's right under the MCRA not to be punished for her public espousal of unpopular political views, and the BSO's asserted first amendment right to control its artistic expression. It requires the application of a standard approach to first amendment issues: the balancing of two competing rights. In a number of recent cases, the Supreme Court has considered similar challenges to state antidiscrimination laws that, like the MCRA, incidentally infringe the right to free speech. Under the Court's now well-established test, such laws survive so long as they are necessary to serve a compelling state interest that is unrelated to the suppression of ideas. E.g., Board of Directors of Rotary Int'l v. Rotary Club, 481 U.S. 537, 107 S. Ct. 1940, 1947-48, 95 L. Ed. 2d 474 (1987); Roberts v. United States Jaycees, 468 U.S. 609, 628, 82 L. Ed. 2d 462, 104 S. Ct. 3244 (1984).\n\nIn order to apply that test to this case, I begin by examining the MCRA and Massachusetts' interest in passing it. The effect of the MCRA in this case is to further the Commonwealth's interest in preventing the abridgement of speech. There can be no denying that this interest is substantial. Political speech, like the pro-PLO speech for which Redgrave has been made to suffer, is a particularly valuable and protected commodity. See, e.g., Keyishian v. Board of Regents, 385 U.S. 589, 17 L. Ed. 2d 629, 87 S. Ct. 675 (1967); New York Times Co. v. Sullivan, 376 U.S. 254, 11 L. Ed. 2d 686, 84 S. Ct. 710 (1964). Neither the federal government nor the states may regulate such speech on the basis of its content absent a clear and present danger. See Brandenburg v. Ohio, 395 U.S. 444, 23 L. Ed. 2d 430, 89 S. Ct. 1827 (1969). And, unless accompanied by a present intent to overthrow the government and an actual likelihood of concrete harm, even subversive political speech is protected and may not be made the basis for discrimination by the government. Id. The Commonwealth has reinforced the centrality of these first amendment values by passing a statute that broadens the reach of free speech rights. By eliminating the state action requirement of 42 U.S.C. § 1983, the MCRA proscribes the abridgement of speech rights by private actors, such as the BSO, as well as by state actors, such as the Commonwealth itself.\n\nThe Supreme Court has noted that the states and the federal government have a compelling interest in eliminating invidious discrimination by private persons on the basis of race and sex. Consequently, it routinely has upheld statutes aimed at eradicating such discrimination, even though they have the incidental effect of abridging the first amendment rights of the discriminators. E.g., New York State Club Ass'n v. City of New York, 487 U.S. 1, 108 S. Ct. 2225, 101 L. Ed. 2d 1 (1988); Rotary Int'l, 481 U.S. 537, 107 S. Ct. 1940, 95 L. Ed. 2d 474; Roberts, 468 U.S. 609, 82 L. Ed. 2d 462, 104 S. Ct. 3244; Bob Jones University v. United States, 461 U.S. 574, 76 L. Ed. 2d 157, 103 S. Ct. 2017 (1983).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e I believe that a similar analysis should be applied to the MCRA, which, among other things, prohibits discrimination on the basis of speech or politics.\n\nBranding it \"an unusual statute,\" however, the majority attempts to distinguish the MCRA from \"traditional\" statutes such as Title VII, which forbid racial and gender discrimination. Supra, slip op. at 41. The majority declares that it \"makes sense to treat private individuals similarly to the state\" in order to combat racial discrimination. Id. On the other hand, it does not \"make sense\" to the majority to accord similar treatment to individuals who discriminate on the basis of political speech. The majority asserts that, unlike the right to be free from racial discrimination, the right to free speech \"traditionally has content only in relation to state action. . . . The right is to be free of state regulation.\" Id.\n\nI am at a loss to understand the majority's position except as the \"common sense\" of federal judges so wedded to \"traditional\" thinking that they simply refuse to accept the basis for Massachusetts' innovative antidiscrimination law. Certainly it is not true that the right to be free from racial discrimination is by definition less dependent on state action than the right to be free from restraints on speech. Even today, a primary legal guarantee against racial discrimination in this country is the equal protection clause of the fourteenth amendment which, of course, applies only to state action. Moreover, prior to the civil rights revolution of the 1960s, many Americans, including federal judges, thought that it did not \"make sense,\" even through legislation, to extend that antidiscrimination mandate to private persons. See, e.g., Civil Rights Cases, 109 U.S. 3, 27 L. Ed. 835, 3 S. Ct. 18 (1883) (holding that public accommodations such as railroads and hotels were immune from federal legislation aimed at racial discrimination because they did not involve state action).\n\nIt is also important to note that the first amendment's free speech guarantee textually applies to action by the federal government alone.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e It is the fourteenth amendment's due process guarantee which extends to individuals a federal right to free speech enforceable against the states. Gitlow v. New York, 268 U.S. 652, 666, 69 L. Ed. 1138, 45 S. Ct. 625 (1925). Therefore, insofar as action by states is concerned, the same amendment -- the fourteenth amendment -- provides individuals with both their right to free speech and their right to be free from invidious racial discrimination. How, then, can the majority argue that the free speech right is inherently more dependent on state action than the antidiscrimination right?\n\nVirtually all antidiscrimination rights, whether they pertain to discrimination on the basis of race, sex or political belief, find their \"traditional\" basis in constitutional guarantees which are limited to state action. However, just as Congress through Title VII extended rights against racial discrimination to encompass actions by private persons, so has Massachusetts through the MCRA extended protection to persons like Redgrave whose free speech rights are abridged by private persons. Certainly, laws against racial discrimination have a somewhat more established track record than the Redgrave's use of the MCRA, but I find particularly repugnant the majority's assertion that because Redgrave's claim is innovative, it does not \"make sense.\"\n\nTurning to the constitutional rights aspect of the balancing equation, the BSO argues, in its defense, that its own interest in interpreting and presenting Oedipus Rex as it wishes precludes liability to Redgrave under the MCRA. It asserts that the cancellation of her contract, in response to threats of audience disruption arising out of a disagreement with her prior political expression, was a legitimate means of maintaining artistic control over the production and did not give rise to liability under the MCRA.\n\nIt is necessary to state what the BSO has not alleged. The BSO has never claimed that it cancelled the contract with Redgrave as a symbolic act meant to communicate its disapproval of the PLO. Indeed, this court unanimously has rejected the idea that the BSO's firing of Redgrave intended to be any kind of symbolic speech or \"statement.\" Supra, slip op. at 17. Had the BSO intended to communicate such expression, we would be confronted by a more difficult case, with a conflict between two compelling speech interests: that of Redgrave to be free, under the MCRA, of economic retaliation by an employer for her views on matters of significant public import, and that of the BSO to be free, under the first amendment, of state encroachment on its right to express itself on those same matters.\n\nIn fact, the district court found, and it seems beyond dispute, that the BSO cancelled its contract with Redgrave out of concerns stemming from the potential for disruption during her narration. As the BSO acknowledges and as the record explicitly reveals, BSO agents feared disruption because they received threatening telephone calls from persons protesting the engagement on political grounds:\n\nOne caller . . . stated that there would be \"bloodshed and violence\" at Symphony Hall if Redgrave appeared. Other callers promised \"trouble,\" and some stated that the Redgrave engagement would \"haunt\" the Symphony, that Redgrave should perish, and that the Symphony would \"mourn.\" The persons at the Symphony who received these calls were alarmed and frightened.\n\nBSO Opening Brief at 7. In the words of one BSO agent, \"it was the reaction against her politics that was the problem.\"\n\nThe only possible conclusion to be drawn from this record and from the findings of the district court is that the BSO cancelled its contract with Redgrave in acquiescence to pressure from persons who disagreed with her political views and who, therefore, sought to retaliate against her. The BSO's asserted first amendment right, then, was not an independent artistic judgment to cancel the performance of Oedipus Rex but an instance of caving in to third-party pressure. The BSO, by doing so, effectively has blacklisted Redgrave.\n\nThe Supreme Court previously has held that fear of community reaction is no defense to an action for discrimination on the basis of race. See Palmore v. Sidoti, 466 U.S. 429, 433, 80 L. Ed. 2d 421, 104 S. Ct. 1879 (1984) (\"The Constitution cannot control such prejudices but neither can it tolerate them. Private biases may be outside the reach of the law, but the law cannot, directly or indirectly, give them effect.\"); Buchanan v. Warley, 245 U.S. 60, 81, 62 L. Ed. 149, 38 S. Ct. 16 (1917) (similar). The BSO argues that in this case the acquiescence to third-party pressure was justified by the necessity of protecting the artistic integrity of its own performance. The BSO's musical director, Seiji Ozawa, testified to his belief that, if police were in the audience, the performers could not concentrate, and that, if somebody shouted or booed, the performance might not be able to continue. The artistic administrator, Bernell, referred to the possibility of police lining the halls as a threat to \"artistic integrity.\" The BSO president, Darling, remembered a conversation in which Ozawa commented that the presence of security forces would change the artistic format of the performance.\n\nBy invoking a broad-based defense in the name of \"artistic integrity,\" the BSO is, in essence, asserting a right to unlimited discretion in the presentation of its work. \"Artistic integrity,\" as the BSO defines it, means the absolute and unrestricted power to determine everything about the performance -- from the choice of the production to the hiring of performers, to the quality of the audience ambience. The effect of allowing such a defense would be that the BSO itself would determine when the MCRA would and would not apply simply by deciding what is \"artistic\" and what is not. Under the rubric of \"artistic integrity,\" the BSO could insulate itself from any but the most superficial legal scrutiny.\n\nThe very breadth of this proposed defense renders it suspect. Although I recognize that the BSO does have a first amendment right to control its artistic expression, I do not believe that this right is so broad and so absolute as to outweigh Massachusetts' interest in protecting Redgrave's rights. Cf. Kovacs v. Cooper, 336 U.S. 77, 88, 93 L. Ed. 513, 69 S. Ct. 448 (1949) (\"To enforce freedom of speech in disregard of the rights of others would be harsh and arbitrary in itself.\"). Neither the majority of this court nor the BSO seriously has suggested that Massachusetts does not have a compelling state interest in enacting legislation to protect the free speech rights of citizens in the Commonwealth. Nor has anyone argued that the MCRA does not represent the least restrictive means of achieving that purpose. Rather, the BSO asserts an absolute right against any infringement of its artistic expression. Under established Supreme Court precedent, it is clear that this argument must be rejected.\n\nIn Board of Directors of Rotary Int'l v. Rotary Club, 481 U.S. 537, 107 S. Ct. 1940, 95 L. Ed. 2d 474 (1987), Rotary International asserted that an absolute right of free association and expression under the first amendment immunized it from a California statute prohibiting discrimination on the basis of sex. The Court rejected Rotary International's claim, noting that even if the California act did \"work some slight infringement on Rotary members' right of expressive association, that infringement is justified because it serves the State's compelling interest in eliminating discrimination against women.\" Id. at 1947; see also Roberts v. United States Jaycees, 468 U.S. 609, 82 L. Ed. 2d 462, 104 S. Ct. 3244 (1984) (rejecting a similar challenge by the United States Jaycees to a Minnesota antidiscrimination statute). This holding was recently reaffirmed in New York State Club Ass'n v. City of New York, 487 U.S. 1, 108 S. Ct. 2225, 101 L. Ed. 2d 1 (1988), where the Supreme Court rejected a facial challenge to a New York City ordinance prohibiting discrimination in certain private clubs. I believe these cases conclusively establish that the BSO's claim to absolute first amendment immunity from state antidiscrimination laws is contrary to governing constitutional precedent.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIf the Commonwealth were attempting to dictate how Oedipus Rex should be presented, an entirely different case would be presented. Such an extreme and probably unjustifiable exercise of state power would almost certainly be a violation of the first amendment. Here, however, the Massachusetts statute does not take control of the production away from the BSO. It merely holds the BSO to its own previously and voluntarily adopted contractual obligations. The BSO is still free to interpret and perform Oedipus Rex as it chooses. The only constraint imposed upon the BSO by operation of the MCRA is that the BSO cannot cancel the performance in reaction to anticipated audience disruption.\n\nHistory and experience teach that the risk of catcalls, boos, disruptions, and even being the target of vegetable projectiles is inherent in any public performance by artists who seek to entertain and/or educate the public. Indeed, it could be argued that the audience has a first amendment right to object vociferously to an artistic performance. The record in this case contains a strong dissent from Peter Sellars, the stage director hired by the BSO for the production, to Ozawa's opinion that the presence of police or expressions of displeasure by the audience would affect adversely the BSO's performance. Sellars testified that there is a \"rich history of disruption\" in the history of musical concerts and that, rather than shocking, \"it is an important part of the concert to have a strong audience reaction.\" He pointed out that at the first performance of Stravinsky's Rites of Spring, \"there were riots [and] the audience was stampeding.\" But Sellars went even further. He stated that \"music has a responsibility to incite and is very exciting in this way.\" He believed that, far from disrupting the performance, the presence of police officers in Symphony Hall could be incorporated into the drama of Oedipus Rex. Sellars declared that the political tensions surrounding Redgrave's performance could result in a \"living recreation\" or even a \"living creation\" of the moral essence of the drama of Oedipus Rex.\n\nTo recognize an absolute first amendment defense of \"artistic integrity,\" as the BSO urges, would flout the very values that the first amendment and the MCRA protect. It would mean that a performing artist, or group of artists, could deny another artist her statutorily protected right to perform because of fear that the audience might interrupt the performance. This is the opposite of \"artistic integrity\"; it allows the audience to dictate who shall perform and what shall be played. \"Artistic integrity\" under this view would be a license for the heckler's veto in the arena of artistic expression.\n\nBut perhaps the strongest illustration of the weakness of the BSO's asserted absolute first amendment defense lies in examining the potentially nightmarish consequences of recognizing it. If the first amendment extends absolute protection to the BSO when it fired Redgrave in response to public outcry over her political views, why would it not also protect the BSO in caving in to public views about her sex, her race, or her religion? If, in another case, the BSO refused to hire a Black performer because it felt that protests by bigots would be so intense as to compromise the BSO's \"artistic integrity,\" then the Black performer should have a cause of action under the MCRA against the BSO for infringing her rights under the equal protection clause and any analogous state constitutional provisions banning race discrimination. But the \"artistic integrity\" defense would impose a fatal barrier to the application of the MCRA. And there is no reason to assume that the same defense would not also extend to other institutions, such as newspapers and universities, that engage generally in first amendment activity. In order to qualify for protection, these institutions would only need to characterize their discriminatory acts as based on artistic or intellectual choices and thus effectively foreclose legislative or judicial scrutiny.\n\nIronically, the BSO conceded at oral argument that the first amendment would not protect it from liability for race or sex discrimination. But its attempt to portray laws against race or sex discrimination as having deeper historical roots than laws against discrimination on the basis of political views is not only doctrinally unsound, but historically incorrect. The first amendment, and not the equal protection clause, is the longstanding tradition. The passage of the equal protection clause, and its concomitant application to Blacks came over one hundred years after the passage of the Bill of Rights. And the application of the equal protection clause to women is too recent to characterize as anything short of an innovation.\n\nIn conclusion, it is important to point out that the elimination of the state action requirement by the MCRA puts the BSO in the place of the state. Of course, the BSO retains its first amendment rights against the Commonwealth. But now, by operation of the MCRA, it also has obligations like those of the Commonwealth itself not to abridge the free speech rights of others. In cancelling its contract with Redgrave, the BSO repudiated that obligation and thwarted the Commonwealth's compelling interest in preventing the abridgement of speech.\n\nI respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. Redgrave Enterprises Ltd. was a plaintiff only as to the contract claim; it did not join the MCRA claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The court apparently submitted the factual question to the jury either before it decided the legal issue or to protect against the need for a retrial in the event of reversal on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The BSO notes that Redgrave contended that \"the cancellation, as communicated to other employers through the news media, harmed Vanessa Redgrave because it carried with it the message 'that Vanessa Redgrave was unemployable,' a claim for damage to Redgrave's reputation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We are not convinced that the cancellation of a contract could ever receive First Amendment protection. Unlike engaging in an economic boycott, burning a draft card, or wearing an armband, cancelling a contract is not a traditional form of protest. We would be wary of adopting a principle that would allow a party wishing to breach its contract for economic objectives to hide behind First Amendment protections merely by stating that it has cancelled the contract in order to make a statement about the other party. This question, however, is not before us in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. It is true that, as a result of previous press reports regarding the community reaction to the Redgrave engagement, the public could easily infer that the BSO's cancellation of the performances resulted from the furor over Redgrave. Nevertheless, the fact that the BSO made an intentional effort not to mention Redgrave by name in the press release indicates that the act of cancellation was not intended to be a form of expression.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Although Redgrave received a number of offers to appear in Broadway plays between 1975 and 1980, the only offer she accepted and received payment for was a 1976 play, Lady From the Sea, performed in off-Broadway's Circle in the Square theater, for which Redgrave received $9,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Redgrave testified that the original departure date for Australia had been postponed from October 11th to November 2d, and that she could not recall whether it was in late October or early November that she found out that the film had fallen through.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Redgrave testified that she turned down the offer for the Sakharov film because she obtained \"alternative work\" and because she was afraid the film might be used as anti-communist propaganda. There was no evidence that this film did not have secure financial backing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In fact, Redgrave expressed an interest in filming Annie's Coming Out in February 1982, two months before the BSO cancellation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We assume that Redgrave's claim must refer primarily to offers made after November 1982, when she learned that Annie's Coming Out would not be produced. Offers made before that time, for projects that would have conflicted with the filming of Annie, presumably would not have been accepted by Redgrave in any case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In addition, immediately following the BSO cancellation, Redgrave stopped using the services of her long-term agent, Bruce Savan, and engaged the services of the William Morris agency. After one year, Redgrave re-engaged Savan. The BSO contends that the change in agencies could have been an additional factor causing any decline in offers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. We note that Redgrave's claim regarding American theater offers is both stronger and weaker than her claim regarding film offers. On the one hand, Redgrave indeed did not receive any Broadway offers in 1982, in contrast to various film offers and inquiries that she did receive throughout 1982. On the other hand, Redgrave failed to present evidence of any Broadway offers made to her in 1981, weakening her assertion that a dramatic decline in such offers occurred subsequent to April 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Although Massachusetts has omitted state action as an element of an MCRA claim, Massachusetts' own action in creating rights and duties under the MCRA is, of course, state action. Consequently, rights and duties under the MCRA are limited by the various constitutional constraints on state action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. \"Congress shall make no law . . . abridging the freedom of speech . . . or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\" This amendment is, of course, now applicable to the states.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Article 16 of the Declaration of Rights to the Constitution of the Commonwealth guarantees that \"the right of free speech shall not be abridged.\" Article 19 of the Massachusetts Declaration of Rights provides that \"the people have a right, in an orderly and peaceable manner, to assemble to consult upon the common good; give instructions to their representatives, and to request of the legislative body, by the way of addresses, petitions, or remonstrances, redress of the wrongs done them, and of the grievances they suffer.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Cf. Carpenters v. Scott, 463 U.S. 825, 831-833, 77 L. Ed. 2d 1049, 103 S. Ct. 3352 (1983) (there can be no private conspiracy to violate First Amendment rights under 42 U.S.C. § 1985(3) without state action because that right \"is by definition a right only against state interference\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Of course, a defendant's freedom of expression interests can also be implicated in a traditional race or sex discrimination case under the MCRA. We do not think it at all obvious, as do our dissenting brethren, that liability should attach if a performing group replaces a black performer with a white performer (or vice versa) in order to further its expressive interests. Unlike the case in Palmore v. Sidoti, 466 U.S. 429, 80 L. Ed. 2d 421, 104 S. Ct. 1879 (1984), cited by the dissent, there would in this case be a conflict of protected interests. This presents serious constitutional and statutory questions that we do not pretend to survey here. We do note, however, that the Supreme Court recently has reaffirmed the principle that discrimination might in certain circumstances be justified in order to preserve expressive integrity. New York State Club Ass'n, Inc. v. City of New York, 487 U.S. 1, 108 S. Ct. 2225, 2234, 101 L. Ed. 2d 1 (1988) (\"It is conceivable, of course, that an association might be able to show that it is organized for specific expressive purposes and that it will not be able to advocate its desired viewpoints nearly as effectively if it cannot confine its membership to those who share the same sex, for example, or the same religion.\"). See also id. at 2237 (O'Connor, J., concurring) (\"there may well be organizations whose expressive purposes would be substantially undermined if they were unable to confine their membership to those of the same sex, race, religion, or ethnic background\"); Roberts v. United States Jaycees, 468 U.S. 609, 627, 82 L. Ed. 2d 462, 104 S. Ct. 3244 (1984) (\"It is . . . arguable that, insofar as the Jaycees is organized to promote the views of young men whatever those views happen to be, admission of women . . will change the message communicated by the group's speech because of the gender-based assumptions of the audience.\") (emphasis supplied); id. at 633-36 (O'Connor, J., concurring in part) (\"Protection of the association's right to define its membership derives from the recognition that the formation of an expressive association is the creation of a voice, and the selection of members is the definition of that voice. . . . When an association is predominantly engaged in protected expression . . . state regulation of its membership will necessarily affect, change, dilute, or silence one collective voice that would otherwise be heard.\"). Finally, we note that, even if an artistic organization could not discriminate in favor of a white (or black, or male) performer, presumably it would have a much more compelling interest in cancelling the performance rather than acceding to the casting requirements imposed by the state, even if the reason for cancellation is fear of community reaction. Of course, we here simply point out some of the difficulties that arise when two important protected interests conflict -- where there is a clash of rights. We express no view as to how, in particular cases, that clash might be resolved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. For constitutional purposes, it makes no difference whether the state seeks to compel expression directly by \"forcing\" the artist to perform, or by imposing civil liability for refusing to perform; either form of coercion is burdensome to rights of free expression.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. There are numerous ways in which adverse performance conditions may disturb that synergistic interplay of performers and audience that is so important to the content of the performance. Of course the importance of conditions is not a constant; it will vary with the medium (music, dance, drama), the setting (Circle in the Square, Symphony Hall, Shea Stadium), the audience (young children, rock fans, opera lovers) and the performers (Barnum \u0026 Bailey, the Beastie Boys, the Bolshoi Ballet). Some performers and audiences may be able to ignore adverse conditions; others may welcome the challenge of working around or with those conditions; still others may find adverse conditions intolerable -- there is a long tradition of performers stalking offstage when an audience is not to their liking. But there can be no doubt that performance conditions may sometimes be vitally important to the overall impact of a performance, to the point where it makes little sense to speak separately of the performance's content. Visual or aural disruption easily can destroy the intended mood and atmosphere of a performance and produce an impact on the audience different from that which the performer intended to convey.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Cf. Brown v. Louisiana, 383 U.S. 131, 141-42, 15 L. Ed. 2d 637, 86 S. Ct. 719 (1966) (plurality opinion) (holding that First Amendment rights \"are not confined to verbal expression\" but may also include \"protest by silent and reproachful presence . . . .\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The implications of the dissent's position underscore its problems. For instance, under the dissent's theory of the MCRA, a private university would be liable for denying tenure to a professor whose views it found politically reprehensible, or to a scholar who might cause turmoil on campus. A newspaper could not, without running afoul of the statute, cancel an opinion writer's column in response to outrage in the community, even if it meant that the newspaper's reputation was impugned or that great numbers of people stopped reading the paper. While we may commend those institutions and artists that resist such public pressure, no court has, to our knowledge, ever held legally accountable those private groups or artists that do succumb to public taste.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. We must interpret this reference to mean Redgrave's free speech right, emanating from the state constitution but \"secured\" by the MCRA against private interference. The BSO's free speech right under the state constitution -- that is, the right to speak, or not to speak, free of governmental interference -- would, of course, outweigh Redgrave's merely statutory right under the MCRA, and would in Justice Wilkins' view bar the state from imposing MCRA liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Of course, Michigan v. Long does not in any way affect our decision to defer to the SJC's implicit interpretation of the statute itself, in light of constitutional doubts, to foreclose liability in the first instance. See supra, slip. op. at 54-56. In so doing, we are respecting a state court's discernible reading of its own statute influenced by constitutional concerns. That these concerns might be regarding federal constitutional issues does not change the fact that the state court's decision is, exclusively, one of state statutory construction; there is no suggestion that any view about federal law is being decided.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The majority stresses another possible statutory defense which it borrows from dicta in the SJC dissent. This argument was not, however, put forward by any party to this case and must be rejected at any rate for the reasons set forth infra, slip. op. at 73-74.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. General application of the majority's head-counting approach would produce equally inconsistent and anomalous results in other cases. In deciding cases involving multiple issues of Massachusetts law, federal courts in this circuit would be free to comb the volumes of Massachusetts Reports until they found sufficient dissenting votes from different justices on some combination of issues to produce a \"majority.\" Hypothesizing that the case actually arose in state court, the federal court could then apply its constructed \"majority\" of dissents even though its resulting decision ran counter to the result that would be produced if the court applied the majority position on each issue. Such a situation obviously would be intolerable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This paralleling of federal and state law with respect to constitutional defenses mirrors the fact that the MCRA itself is patterned after and essentially coextensive with federal law. See Redgrave, 399 Mass. at 98, 502 N.E.2d at 1378 (\"The remedy provided in [the MCRA] is coextensive with the remedy provided by Federal law by means of 42 U.S.C. § 1983 (1982), except that the State statute does not condition the availability of the remedy on state action.\") (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The majority has cited three SJC cases in an effort to demonstrate that the SJC has, \"in certain circumstances,\" interpreted the Massachusetts free speech guarantees as divergent from federal rights. Supra, slip op. at 58. The cases, however, do not support that proposition. One of the cases, Commonwealth v. Upton, 394 Mass. 363, 476 N.E.2d 548 (1985), is actually a fourth amendment search and seizure case and has nothing to do with free speech rights. The other two cases, Cabaret Enterprises, Inc. v. Alcoholic Beverages Control Comm'n, 393 Mass. 13, 468 N.E.2d 612 (1984), and Commonwealth v. Sees, 374 Mass. 532, 536-38, 373 N.E.2d 1151 (1978), do involve free speech rights, but do not constitute breaks from the Supreme Court's interpretation of the first amendment. Both cases involve nude dancing, an activity which is treated as protected expression under both the state and federal constitutions. See Schad v. Borough of Mount Ephraim, 452 U.S. 61, 68 L. Ed. 2d 671, 101 S. Ct. 2176 (1981); Doran v. Salem Inn, Inc., 422 U.S. 922, 932, 45 L. Ed. 2d 648, 95 S. Ct. 2561 (1975); Cabaret Enterprises, supra; Sees, supra. Federal and state law regarding nude dancing varies only in that under the twenty-first amendment to the United States Constitution, federal courts must allow states \"broad powers . . . to regulate the sale of liquor, [including the right to] ban [nude] dancing as part of [their] liquor license program.\" Doran, 422 U.S. at 932-33. By contrast, \"no provision of [the Massachusetts] Constitution gives a preferred position to regulation of alcoholic beverages\" and so nude dancing retains its full panoply of constitutional free speech protections even if performed on premises licensed to serve alcohol. Sees, 374 Mass. at 537, 373 N.E.2d at 1155. Neither Sees nor Cabaret Enterprises, therefore, represents a departure from the established principle that the SJC will follow Supreme Court first amendment precedent in deciding free speech claims under the Massachusetts Constitution. They merely evidence the fact that, unlike the Massachusetts Constitution, the federal Constitution has a twenty-first amendment as well as a first amendment. This case, of course, involves no liquor-regulating issues and so the Sees/Cabaret Enterprises distinction is clearly inapplicable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Even if the concurring justices had stated that, contrary to prior practice, their state constitutional ruling was independent of the federal Constitution, their opinion represents the views of only two members of the SJC. The remaining majority of five justices concededly found no independent ground.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Strangely, in arguing that the SJC's opinions did rest on adequate and independent state grounds, the majority makes much of the fact that none of the opinions explicitly mentioned the federal Constitution. Supra, slip. op. at 60. Of course, five of the justices failed to mention the state Constitution as well -- eschewing any constitutional ruling -- because no constitutional issue had been certified to the SJC for resolution in the first place.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority cites the New York State Club Ass'n and Roberts cases for the proposition that \"discrimination might in some circumstances be justified in order to preserve expressive integrity,\" supra, slip op. at 43 n. 17, but neglects to mention that its cited proposition and the remarks it quotes are merely dicta. In both cases, by overwhelming majorities, the Court upheld the challenged statute and dismissed the first amendment argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. \" Congress shall make no law . . . abridging the freedom of speech, or of the press.\" U.S. Const., Amend. I (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The majority has turned the BSO's absolutist first amendment claim on its head, instead suggesting that in order to apply the MCRA to the BSO, this court would have to adopt the absolutist position that there could never be a first amendment defense to the BSO. The majority thus marches out a \"parade of horribles,\" asserting that under my interpretation of the MCRA, the statute would be used to control the editorial practices of newspapers. Supra, slip op. at 42, 48 n. 21. This far-fetched hypothetical, however, demonstrates that the majority has missed the point. First amendment claims are not made of absolutes, they involve the balancing of competing interests. Each case must be judged on its own specific facts, and I am more than willing to concede that certain applications of the MCRA, including the majority's newspaper hypothetical, would be plainly impermissible under the first amendment. See New York State Club Ass'n, 108 S. Ct. at 2233-35 (noting that there might be applications of the New York City ordinance that would be unconstitutional, but adding that such cases must be considered on their own facts); Coffin, Judicial Balancing: The Protean Scales of Justice, 63 N.Y.U. L. Rev. 16 (1988) (a thoughtful espousal of careful, open and detailed judicial balancing in constitutional civil rights cases).\u003c/span\u003e\n\n",
    "body_length": 152472,
    "citedas": [
      "855 F.2d 888"
    ],
    "attorneys": "Daniel J. Kornstein with whom Marvin Wexler and Kornstein Veisz \u0026 Wexler, were on brief for Vanessa Redgrave and Vanessa Redgrave Enterprises, Ltd. Barbara Arnwine, Alan Jay Rom, Lawyers' Committee for Civil Rights Under Law of the Boston Bar Association, F. Anthony Mooney, Maria 0'Brien Hylton, Hale \u0026 Dorr, and Marjorie Heins, Massachusetts Civil Liberties Union Foundation, on brief for Lawyers' Committee, for Civil Rights Under Law of the Boston Bar Association and the Civil Liberties Union of Massachusetts, Amici Curiae. Robert E. Sullivan with whom John T. Harding, Jr., Cassandra Warshowsky, Palmer \u0026 Dodge, Keith C. Long and Nutter, McClennen \u0026 Fish, were on brief for Boston Symphony Orchestra, Inc. Marvin N. Geller, Thomas M. Sobol and Brown, Rudnick, Freed \u0026 Gesmer, on brief for American Jewish Congress, Amicus Curiae. Todd L.C. Klipp, Stephen A. Williams and Michael B. Rosen, Office of the General Counsel, on brief for Trustees of Boston University, Amicus Curiae. Philip Burling, Stephen B. Deutsch and Foley, Hoag \u0026 Eliot, on brief for Boston College and Tufts University, Amici Curiae.",
    "category": [
      "124",
      "36"
    ],
    "judges": "Coffin, Bownes, Breyer, Torruella and Selya, Circuit Judges. Bownes, Circuit Judge, with whom Circuit Judge Selya joins, concurring in part and dissenting in part.",
    "citation_count": 41
  }
}
