{
  "id": "T6KHR2YBTlTomsSBJo1j",
  "document": {
    "title": "People v. Samayoa",
    "full_title": "THE PEOPLE AND v. RICHARD GONZALES SAMAYOA AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1997-06-19T00:00:00.000Z",
    "docket": "S006284",
    "body": "Following the guilt phase of a jury trial, defendant Richard Gonzales Samayoa was convicted of two counts of first degree murder (Pen. Code, §§ 187, 189) \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and one count of residential burglary ( § 459). A jury found true the allegations that defendant used a deadly weapon (a wrench) during the commission of the crimes ( § 12022, subd. (b)), had served three prior prison terms ( § 667.5, subd. (b)), and previously had been convicted of two serious felonies ( § 667, subd.(a)). The jury also found true one multiple-murder special-circumstance allegation -- i.e., that in the present proceeding defendant was convicted of more than one offense of murder ( § 190.2, subd.(a)(3)), and two felony-murder special circumstances -- i.e., that each murder was committed in the course of a burglary ( § 190.2, subd.(a)(17)(vii)). Following the penalty phase of the trial, the jury returned a verdict imposing a sentence of death.\n\nWe conclude that the judgment must be affirmed in its entirety.\n\nI. FACTS\n\nA. The Guilt Phase Evidence\n\n1. The prosecution case\n\n(a) Evidence of the commission of the crimes\n\nIn December 1985 Nelia Silva resided with her husband, Ronaldo, and their two-year-old daughter, Katherine, on Piedra Street in Southeast San Diego. Defendant lived across the street from the Silva family. On the morning of December 18, 1985, Ronaldo Silva walked his daughter across the street to a babysitter's home, and left his daughter there. At approximately 6 p.m., Mrs. Silva returned from work and picked up her daughter from the babysitter.\n\nMr. Silva arrived home at approximately 7:30 p.m. that evening. He opened the garage door, observed his wife's car parked in the garage, and smelled smoke. He entered the kitchen through the interior garage door and found smoke spewing from the stove top where food was burning. After calling out for his wife and receiving no response, he looked down the hallway and saw the bodies of his wife and daughter lying on the floor in pools of blood. After touching his wife and daughter, he realized they were dead, and ran outside seeking help. At 8 p.m., San Diego Police Department officers arrived at the Silva residence and entered through the garage. They discovered the bodies of a small child and a woman lying in the hallway. The child was nude from the waist down, with a large indentation in her head. The woman also was nude from the waist down, wearing only a shirt, and her face was smashed.\n\nOutside the residence, Mr. Silva was comforted by Raul and Deana Samayoa, defendant's brother and sister. Raul and defendant lived across the street with their mother and other members of the Samayoa family.\n\nDetective Richard Carey of the San Diego Police Department arrived at the scene at 9:35 p.m. Approaching the hallway from the kitchen, he observed large pools of blood in the area of the woman's body and the child's head, and blood spattered on the walls and in the three bedrooms off the hallway.\n\nThat evening a police department technician searched the area surrounding the Silva residence. He found a wrench and several pieces of jewelry on the ground near an area spattered with blood. He was unable to lift fingerprints from the wrench, the jewelry, or the interior of the residence. Missing from the house were a jewelry box and jewelry, and Mrs. Silva's purse.\n\nBlood samples taken from the two victims and from defendant all were determined to be type A. Mr. Silva knew of defendant, but neither he, nor to his knowledge his wife, ever had spoken with him.\n\nA forensic pathologist, Dr. Robert Bucklin, performed autopsies on both victims. Mrs. Silva's arms, hands, and fingers were covered with multiple bruises and abrasions. She had been struck with blunt force on the head and neck approximately 24 times. Multiple blunt lacerations covered both sides of her head and scalp. Dr. Bucklin testified that a blunt laceration is a crushing type of injury made with a heavy force without a sharp edge. Her jaw bones and teeth were fractured and the left cheek bone was crushed. The eyes were crushed around the orbital ridges on both sides. Upon removal of the scalp, the pathologist observed several skull fractures, one of which had caused a piece of bone to penetrate the brain, and another serious fracture along the skull base that was caused by extensive force.\n\nThe pathologist testified that Mrs. Silva would have died within several minutes following the infliction of her injuries. He further testified that the wrench (recovered from outside the residence) was consistent with and could have been the instrument that caused the injuries.\n\nThe autopsy of Katherine revealed three injuries, all blunt lacerations of the scalp. One injury on the right side was two inches long and penetrated the skull into the brain, producing hemorrhaging. The most severe injury fractured the skull base. The brain contusions caused hemorrhaging and edema. The wrench was consistent with, and could have been, the instrument that caused the injuries.\n\nA criminalist with the district attorney's office developed a crime scene reconstruction, determining that Mrs. Silva had received many blows while she was lying on the floor. Katherine had been struck once while near the left leg of her mother and then moved along the hallway, smearing blood on the wall, where she was struck again.\n\nFollowing the commission of the crimes, defendant gave various items of jewelry to family members. He gave his mother, Mercedes Samayoa, a hair comb, and gave his sister, Deana, a pearl necklace and a bracelet. Defendant's other sister, Inez Sykes, found a man's diamond gold ring sitting on her bathroom counter. Defendant told her that the ring belonged to him. Each of these items of jewelry later was identified as belonging to Mr. or Mrs. Silva.\n\nIn January 1986, following defendant's arrest for a violation of his parole in another criminal case, his mother and his sister alerted the police that defendant had given them items of jewelry. On January 20, 1986, Officers Art Beaudry and Ronald Jordan met with defendant's mother, brother, and sisters at the Samayoa residence and collected the jewelry. After the officers informed the Samayoas that a jewelry box also was missing, Raul Samayoa discovered it wrapped in a blanket under a shed in the Samayoa backyard. When shown the wrench that was discovered outside the Silva residence, Raul Samayoa told the officers that it appeared similar to the one he had kept in his tool shed.\n\n(b) Defendant's confessions to the commission of the crimes\n\nThe first interview:\n\nOn January 31, 1986, two days after defendant was arrested by his parole officer, he was interviewed by Officers Patrick Padillo and Jordan at a jail facility (he was not under arrest for the murders at this time). At the hearing on defendant's motion to exclude evidence of the ensuing confessions, Officer Jordan, who conducted the interview, testified that he knew defendant from previous contacts arising from defendant's past criminal activities. He asked whether defendant recognized him. Defendant replied that he recognized the police officer but did not recall his name. Officer Jordan told defendant he wished to question him concerning the murders that had been committed across the street from defendant's residence, and also stated that evidence had been found at the crime scene linking defendant to the homicides. Defendant denied any involvement in the murders, stating that he knew the Silvas but had never been inside their home. Officer Jordan then advised defendant of his Miranda rights ( Miranda v. Arizona (1966) 384 U.S. 436, 16 L. Ed. 2d 694, 86 S. Ct. 1602), reading from a standard admonition card that he carried with him. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e He asked whether defendant was willing to speak with the officers, and defendant replied, \"Sure.\" During the interview, Officer Padillo took notes, interrupting intermittently in order to write down verbatim what was said, and by whom.\n\nWhen Officer Jordan told defendant that hairs had been found linking him to the homicides, defendant again denied any involvement. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e When shown a photograph of the wrench, defendant said he did not recognize it. When shown the jewelry, defendant said that he had obtained the jewelry from a friend who recently had been released from jail.\n\nAt this point, Officer Jordan asked whether he could tape-record the interview. Defendant refused. Officer Jordan then stated, \"She was a fighter, wasn't she?\" Defendant nodded his head affirmatively. He then related that on the day of the murders, when he saw Mrs. Silva leave her residence and walk across the street, he decided to enter the residence through the open garage door. He went into a bedroom and took the jewelry box. When leaving the bedroom, he was confronted by Mrs. Silva, holding a child. Surprised, he struck out at the infant with the wrench. Mrs. Silva held onto defendant, pulling at his shirt. According to defendant, he assaulted her two or three times and struck the infant once. He claimed he did not strike Mrs. Silva while she was lying on the ground. Defendant said he removed the sweatpants she was wearing so that the assault would appear to have been a rape and robbery, but denied having had sex with her. He then used the sweatpants to wrap around the jewelry box and to open the front door without leaving fingerprints.\n\nDefendant maintained that he had taken a wrench (which he had obtained from a tool shed behind his house) in the event Mr. Silva or someone else surprised him. He left the Silva residence through the front door, circled around the back of the house, and jumped over the fence. When he jumped the fence, the jewelry box and wrench fell to the ground. He retrieved some of the items and then fled.\n\nDefendant stated that earlier in the day he had been looking for work and had arrived home at approximately 6 or 6:30 p.m. He was standing outside his house smoking a cigarette when he saw Mrs. Silva walk across the street. He said he had not consumed alcoholic beverages or ingested any drugs the day of the crimes. The interview began at 2:45 p.m. and was completed at 3:44 p.m.\n\nThe second interview:\n\nOfficers Padillo and Jordan reinterviewed defendant on February 2, 1986, tape-recording the interview without defendant's knowledge. Defendant was advised of his Miranda rights, explicitly waived them, and then repeated the substance of the confession he made during his first interview.\n\nThe third interview:\n\nOne day later, on February 3, 1986, defendant was interviewed by a psychiatrist, Dr. Wait Griswold, and a psychologist, Dr. Abigale Dixon, at the request of the district attorney's office. Immediately prior to the interview, which was tape recorded, defendant was advised of his Miranda rights, explicitly waived them, and agreed to speak with the doctors. During the interview, defendant again related his commission of the crimes. He stated that he had panicked after hitting the child once, causing him to strike Mrs. Silva four times.\n\n2. The defense case\n\nIn his opening statement to the jury, defense counsel conceded defendant's guilt of two counts of first degree murder and one count of residential burglary. Counsel asserted that evidence of defendant's brain damage would be presented to establish that at the time of his commission of the crimes, defendant lacked the intent to kill his victims (which intent was, at the time of the commission of the crimes, an element of the burglary-murder special-circumstance allegation) (see People v. Anderson (1987) 43 Cal. 3d 1104, 742 P.2d 1306, 240 Cal. Rptr. 585). Thereafter, in support of this theory, the defense presented at the guilt phase the testimony of two psychologists, who testified that the results of neuropsychological tests administered to defendant indicated the presence of organic brain damage.\n\nDr. Meredith Friedman, a licensed clinical psychologist and chief psychologist at the Metropolitan Correctional Center, testified she had been retained by the defense to conduct preliminary neuropsychological testing of defendant. Dr. Friedman explained that the field of neuropsychology involves the relationship of cognitive and perceptual behavior to underlying brain dysfunction. In August 1986, Dr. Friedman conducted a battery of neuropsychological tests, including the Luria-Nebraska series, the Canter Background Interference Procedure, and the Bender-Gestalt visual motor test. (She acknowledged she had no formal training in the administration of the Luria-Nebraska tests.) She also analyzed the results of tests conducted one month earlier, applying the Wechsler Adult Intelligence Scale. Additionally, Dr. Friedman interviewed defendant regarding his history of head injuries, and defendant disclosed he had been rendered unconscious in a bicycle accident at 13 years of age, and again in 1972, when he was struck on the head by a billy club wielded by a police officer.\n\nAccording to Dr. Friedman, the test results indicated global intellectual deterioration and brain damage associated with the left parietal, occipital, temporal, and frontal lobe areas of the brain, which would cause hypersensitivity, unmodulated reaction, and overreaction in novel or stressful situations. Such brain damage also would cause episodes of \"rage reaction,\" resulting in an explosive lack of control, and panic in \"fight or flight\" situations. Dr. Friedman also testified that defendant demonstrated \"viscosity,\" signifying that he obsessively pursued or repeated a single function or response -- an action consistent with temporal lobe damage.\n\nDefendant's school transcripts reflected that while enrolled in the ninth grade in 1967, his academic scores included one C, one B, and the remainder A's. In subsequent semesters, his grades were all D's. Dr. Friedman acknowledged that the results of several portions of the tests administered for coordination, hearing, vision, receptive speech, expressive speech, and memory, fell within the normal range. Defendant's score on the intelligence quotient test initially was 82 (the lower average range) and upon a retest was 95 (average range).\n\nDr. Friedman recommended that defendant be administered the Halsted-Reitman battery of tests, which are more detailed and refined than the Luria-Nebraska, in order to verify the results she obtained.\n\nDr. Saul Saddick, a licensed clinical psychologist, testified that he specialized in neuropsychological assessment, although he does not hold a board certification in neuropsychology. Dr. Saddick administered to defendant the Halsted-Reitan battery of tests and interviewed him regarding his history of head injuries. Dr. Saddick testified that the test results indicated brain damage to the frontal, temporal, and parietal lobes of the brain, which would cause poor impulse control, impairment of reasoning skills, low frustration tolerance, assaultive behavior, and a \"short fuse\" profile, consistent with frontal temporal damage. Defendant also demonstrated \"viscosity\" and \"perseveration,\" signifying that once engaged in an activity such as aggressive behavior, he would have difficulty discontinuing his actions. Viscosity and perseveration were consistent with left temporal lobe damage. Defendant's confession to the police was indicative of viscosity, in that his statement was a monologue unresponsive to questions asked, and he spoke in repetitive circles. Persons with the type of brain damage suffered by defendant may experience episodes of \"rage reactions,\" and according to Dr. Saddick it is difficult to determine whether a person locked into a rage reaction is aware of his conduct or, if aware, is able to stop his conduct. He acknowledged that defendant was aware of the difference between killing someone and inflicting serious bodily injury. Dr. Saddick ultimately diagnosed defendant as having an (1) organic \"explosive type\" personality syndrome, (2) antisocial personality disorder, and (3) moderate cerebral dysfunction.\n\nThe parties stipulated that People's exhibit No. 66 was a drawing by defendant of the court reporter, given by defendant to her. The parties further stipulated that Dr. Dixon, the psychologist retained by the district attorney's office who tested defendant on February 3, 1986, observed during the Rorschach test that defendant often perseverated, indicating \"organicity\" (i.e., brain damage), the origin of which could be alcohol or drug abuse.\n\n3. Rebuttal\n\nDr. Nelson Butters testified that he is a psychologist specializing in neuropsychology and has a diplomate in clinical neuropsychology from the American Board of Professional Psychology. Dr. Butters reviewed all of the reports pertaining to the testing administered to defendant, the testimony of Drs. Friedman and Saddick, and the tape-recorded interviews of defendant conducted by the police and by Dr. Griswold. Dr. Butters concluded that the testing performed by Dr. Saddick was unreliable and inconclusive. He testified that additional testing would be necessary to determine with any degree of reliability whether there was frontal lobe damage, that there was no evidence of damage to the temporal lobe, and that the results of testing for parietal lobe damage were inconclusive. Dr. Butters criticized Dr. Saddick's reliance upon test results indicating brain damage while ignoring other results falling within the normal range. Dr. Butters also stated that the diagram of the brain as labeled by Dr. Saddick was backward, and that a person who did not understand the differences between the front and back portions of the brain would be unable to analyze brain-behavior relationships accurately.\n\nDr. Dilip Jeste, a professor of psychiatry who was board certified in psychiatry and neurology, also reviewed the pertinent materials relating to defendant's mental condition. He testified that the diagnosis of \"organic rage reaction,\" to which Dr. Saddick testified, is not recognized by the American Psychiatric Association, although there are other similar disorders defined as organic personality syndrome, intermittent explosive disorder, and seizure disorder. In Dr. Jeste's opinion, defendant did not appear to suffer from organic personality syndrome or seizure disorder, because his violence was not random and he did not have difficulty recalling his violent episodes. Defendant did not fit the profile of one with intermittent explosive disorder, which characterizes a person otherwise normal but suffering brief periods of unfocused explosive behavior.\n\n4. Defense surrebuttal\n\nDr. Melvin Schwartz, a clinical neuropsychologist and forensic psychologist who was board certified in neuropsychology, examined the same materials reviewed by the other experts. Dr. Schwartz agreed with Dr. Saddick's Conclusion that defendant suffered left hemisphere brain damage. Behavior of the type demonstrated by defendant (viscosity and perseveration) frequently was demonstrated by brain-damaged individuals. He opined that Dr. Saddick competently had administered the tests in the present case, although Schwartz had found errors in Saddick's work in another case.\n\nB. The Penalty Phase Evidence\n\n1. The prosecution case\n\nThe 1976 preliminary hearing testimony of Berta Lou Raymond in a prior unrelated criminal prosecution for burglary and rape was read to the jury. (Raymond was deceased and therefore unavailable as a witness.) Raymond testified that she suffered from multiple sclerosis and usually was confined to a wheelchair. On July 8, 1975, at 2:15 a.m., she was at home alone asleep in bed. She was awakened by the sound of the bedroom door opening, and a flashlight was shined in her face. She could hear two men but could not see them. One of the men held a knife at her throat, asking her where she kept her money. When she heard a belt buckle being loosened and a zipper unzip, she screamed, \"Please don't rape me, I'm a cripple.\" A male voice responded, \"I know, I won't hurt you.\" The man then removed his pants and raped her. At one point he turned her over and entered her rectum with his penis. The initial act of intercourse lasted approximately 15 to 20 minutes. Another man repeatedly entered the bedroom, referring to the man who was raping her as \"Jack.\" She heard a total of three different voices.\n\nRaymond testified that she could not identify any of the men, but she furnished a description of the height and weight of the man who had raped her that was consistent with defendant's appearance. Defendant was convicted of burglary and rape.\n\nDavid Drew Anderson was one of the participants in the Raymond burglary and had pleaded guilty to the crimes. In the present proceedings, at the penalty phase of defendant's trial, Anderson testified that on July 7 and 8, 1975, he had been with defendant and James Glasgow, drinking and ingesting heroin. Defendant, recently having been released from custody, needed money. Both defendant and Glasgow lived in close proximity to Raymond, and the three men decided to burglarize her house. They agreed to use fictitious names in the event they needed to communicate with each other while inside the residence. Defendant entered first and began to rape Raymond. Anderson disclosed for the first time (i.e., at the penalty phase of the trial in the present case) that he and Glasgow also had sexually assaulted Raymond. In 1976, Anderson had denied culpability for the rape in order to avoid prosecution for that offense.\n\nThe prosecution also presented evidence of defendant's 1981 conviction for assault with a deadly weapon on Elvira R. Rosendo R., the brother of the victim, testified that on the evening of November 13, 1981, he returned from a party, accompanied by defendant. They both fell asleep in Elvira's bedroom. Elvira was alone in her bedroom, asleep.\n\nElvira testified that she was awakened that evening by someone striking her. Her assailant threatened that he would kill her if she pulled down the covers, and said he wanted to make love to her. When she jumped up, he responded by forcefully striking her in the face. She saw his face and recognized him, crying out, \"Oh my God Richard.\" After she begged him to allow her to wipe her face, he allowed her to leave the room. She was taken to the hospital that evening for treatment for severe lacerations on her face, requiring stitches.\n\nFinally, the prosecution also introduced evidence of defendant's 1974 burglary conviction.\n\n2. The defense case\n\nIn his opening statement, defense counsel requested the jury to take into account all the evidence of defendant's brain damage that was presented at the guilt phase. No additional evidence of defendant's mental condition was presented.\n\nPaul Dillard, a counselor with the Department of Corrections, testified that in 1981, while defendant was a prison inmate, defendant held a position in the prison kitchen, demonstrating his reliability and responsibility.\n\nRonald Baldwin, an officer at a correctional facility, testified that he had daily contact with defendant for nearly a year in 1983, and that defendant had been a cooperative, above-average worker.\n\nDefendant's mother and sisters testified that although they had assisted the prosecution, they still loved defendant and did not want him condemned to death. Defendant's mother identified various drawings and cards she had received from defendant over the years, as well as family photographs.\n\nII. ANALYSIS\n\nA. The Guilt Phase Issues\n\n1. Claim of insufficiency of the record on appeal\n\nFormer section 190.9, subdivision (a), required that in all capital cases, \"all proceedings . . ., including proceedings in chambers, shall be conducted on the record with a court reporter present. The court reporter shall prepare and certify a daily transcript of these proceedings. The court shall assign a court reporter who uses computer-aided transcription equipment to report all proceedings under this section. Failure to comply with the requirements of this section relating to the assignment of court reporters who use computer-aided transcription equipment shall not be a ground for reversal.\"\n\nDefendant contends that during the trial proceedings, in violation of section 190.9, the court permitted 138 Discussions that were not recorded, and that the sheer number of these off-the-record Discussions, and the inability to reconstruct them in a settled statement, requires reversal.\n\nNo presumption of prejudice arises from the absence of materials from the appellate record ( People v. Cummings (1993) 4 Cal. 4th 1233, 1333-1334, fn. 70, 850 P.2d 1), and defendant bears the burden of demonstrating that the record is inadequate to permit meaningful appellate review ( People v. Arias (1996) 13 Cal. 4th 92, 158, 913 P.2d 980; People v. Freeman (1994) 8 Cal. 4th 450, 509, 882 P.2d 249).\n\nDefendant has not met this burden. First, defendant fails to demonstrate that any of the off-the-record Discussions constituted judicial proceedings in this case, within the meaning of former section 190.9, subdivision (a), much less that they pertained to an issue raised on appeal. The reporter's transcripts indicate that the numerous references to off-the-record Discussions simply reflect a pause in the proceedings to allow private conferences between defense counsel and defendant, or among counsel and cocounsel or their witnesses, which properly were not reported. During the record correction and certification process, in response to an inquiry from appellate counsel, the trial Judge who had presided over the trial (and who since had retired) stated in a letter that he did not recollect the substance of off-the-record Discussions, but that \"nothing material was resolved off the record,\" and that unreported colloquies pertained to matters such as \"professional etiquette\" and scheduling. At the final record certification hearing, the trial court informed the parties that the letters and information received from the trial Judge, the prosecution, and defense counsel indicated that during the trial proceedings, the court reporter generally noted an \"off-the-record\" Discussion whenever the parties conferred privately among themselves or scheduled a matter. At the Conclusion of the certification hearing, appellate counsel stated she was satisfied \"that nothing material happened\" during the unreported Discussions.\n\nSecondly, defendant fails to identify any claim with respect to which the record is inadequate for determination of the issue, or as to which he has been prejudiced by the state of the record. He does not maintain there was any unreported proceeding relating to an issue that he raises on appeal.\n\nFor these reasons, defendant has not met his burden of demonstrating that the record precludes meaningful appellate review ( People v. Freeman, (supra) , 8 Cal. 4th at p. 510), and his claim therefore must fail.\n\n2. Claim of violation of federal constitutional rights in jury selection\n\nDefendant contends that as a result of the trial court's rulings on defense challenges for cause to prospective jurors who exhibited a bias in favor of the death penalty, and on prosecution challenges for cause to prospective jurors who exhibited views against the death penalty, the jury that was selected was skewed in favor of the death penalty, in violation of his federal constitutional right to a fair and impartial jury. In this regard, defendant maintains the trial court employed a different standard when ruling on defense challenges than when ruling on prosecution challenges, thereby improperly favoring the prosecution. Defendant additionally contends he was prejudiced by the trial court's refusal to permit defense counsel to attempt to rehabilitate jurors who expressed views disfavoring the death penalty in response to questioning by the prosecution and the trial court.\n\nTo the extent defendant contends the trial court improperly denied defense challenges for cause to prospective jurors (David Krantz, Nancy Schalles, James Kramer, Gilbert Grotta, Max Israel, and Joseph Peterson), his claim is barred by his failure to exhaust his peremptory challenges -- defense counsel exercised only 14 of the 20 peremptory challenges that were available to him -- or to justify his failure to do so. ( People v. Garceau (1993) 6 Cal. 4th 140, 174, 862 P.2d 664; People v. Morris (1991) 53 Cal. 3d 152, 184, 279 Cal. Rptr. 720, 807 P.2d 949 [\"In order to complain on appeal about the trial court's decisions overruling his challenges for cause, defendant must show: (1) he used a peremptory challenge to remove the juror in question; (2) he exhausted his peremptory challenges or can justify his failure to do so; and (3) he was dissatisfied with the jury as selected.\"].) Defendant therefore fails to demonstrate that his right to a fair and impartial jury was affected by the trial court's denial of his challenges for cause. ( People v. Garceau, supra, 6 Cal. 4th at p. 174.)\n\nWith regard to defendant's claim that the trial court erred in excusing for cause prospective jurors who exhibited anti-death-penalty views, the standard governing our review of such a claim is whether exclusion was necessary because the juror's views concerning capital punishment would \" 'prevent or substantially impair the performance of his [or her] duties as a juror . . . .' \" ( Wainwright v. Witt (1985) 469 U.S. 412, 424, 83 L. Ed. 2d 841, 105 S. Ct. 844; People v. Wash (1993) 6 Cal. 4th 215, 254, 861 P.2d 1107.) When a juror's views are conflicting or ambiguous, the trial court's determination as to his or her state of mind generally is binding on a reviewing court. When there is no inconsistency, but simply a question whether the juror's responses demonstrated a bias for or against the death penalty, the trial court's judgment will not be set aside if supported by substantial evidence. ( People v. Wash, supra, 6 Cal. 4th at p. 254; People v. Cooper (1991) 53 Cal. 3d 771, 809, 281 Cal. Rptr. 90, 809 P.2d 865.)\n\nWe conclude the record supports the trial court's determination that each of the prospective jurors in question (Francis Pilkington, Vincent Guerrero, Zina Hines, John Speights, and Larry Logan) harbored views unfavorable toward the death penalty that substantially impaired their ability to sit as jurors. Although Pilkington stated he did not believe he would vote automatically against the death penalty, upon further questioning he stated variously that he would be \"unwilling to send anyone to death,\" and \"would be very reluctant to vote for the death penalty in certain terms.\"\n\nVincent Guerrero indicated that he \"generally\" did not believe in the death penalty, although it probably was necessary and appropriate for certain crimes. He volunteered that he had refused to undergo a physical examination required for military service during the Korean War, in part because he did not want to kill anyone, and that he did not \"really believe someone should be killed or executed,\" although there might be appropriate circumstances. Guerrero also disclosed that his son had died of kidney failure one year earlier, a circumstance that might make it difficult for him to render a verdict of death, and confirmed that the prosecution might not have a \"fair shot\" with him.\n\nZina Hanes stated she did not believe she should be required to choose between life imprisonment and death because \"I don't . . . have that right.\" Although when asked by defense counsel whether she would vote automatically for a life sentence. she responded \"No,\" that she would \"go by the law,\" and that she would keep an open mind, she reiterated upon questioning by the prosecution that she was against the death penalty because she felt no one had the right to take another person's life, and admitted she did not want to be in that position. Excusing the juror, the trial court observed, \"She was almost categorically disqualified from her initial answers, but there was a little glimmer of light, so that I let defense counsel rehabilitate her to some extent. But the net picture from her demeanor, as well as her words, is that she would find it nearly impossible to conceive of imposing the death penalty on someone.\"\n\nWhen questioned during the death qualification portion of the voir dire, John Speights stated his personal belief that the death penalty was \"inherently wrong,\" and that although he felt he could follow the law in determining the penalty, he was not certain he could do so. He also stated if he were on the jury and a verdict of death were returned, he did not know whether he could face defendant when the jury was polled to confirm that he had voted for death. The trial court denied the prosecution's challenge for cause at this point, stating that the juror had exhibited a reluctance to make difficult decisions rather than an opposition to the death penalty.\n\nWhen examined again during general voir dire, however, Speights indicated that upon further reflection since his earlier questioning, he had become \"really nervous about the death penalty issue\" and did not believe he could set aside his personal views on the death penalty. In excusing Speights for cause, the court noted its view that the basis for doing so was \"compelling now that there is substantial impairment, in view of his agonizing over it.\"\n\nLarry Logan stated that \"in most places I think I would not vote [for the] death penalty,\" and when asked whether there could be a case that was so overwhelming against a defendant that he would be able to vote for death, he stated that it was possible, but that \"I don't think that I -- I would say no.\"\n\nDefendant next claims the trial court improperly restricted defense counsel's questioning of one prospective juror before denying a defense challenge for cause, and improperly restricted or (in certain cases) prohibited, defense counsel's attempts to \"rehabilitate\" through voir dire several prospective jurors who expressed views strongly disfavoring the death penalty, before excusing those jurors for cause.\n\nA trial court has the discretion to deny all questioning by counsel when a prospective juror gives \"unequivocally disqualifying answers\" ( People v. Bittaker (1989) 48 Cal. 3d 1046, 1085, 259 Cal. Rptr. 630, 774 P.2d 659), and may subject to reasonable limitation further voir dire of a juror who has expressed disqualifying answers ( People v. Mattson (1990) 50 Cal. 3d 826, 845-846, 268 Cal. Rptr. 802, 789 P.2d 983; People v. Fields (1983) 35 Cal. 3d 329, 357-358, 197 Cal. Rptr. 803, 673 P.2d 680).\n\nWe find no abuse of discretion. During questioning by defense counsel, prospective juror David Krantz indicated that he felt he could be fair and open-minded, but that he might vote automatically for death if the victim were a two-year-old child, because the child had no chance. He then qualified his statement by asserting that he still could conceive of choosing a sentence of life imprisonment. Subsequently, after being shown the crime scene photographs, he admitted he might have some difficulty keeping an open mind. When questioned by the prosecution, Krantz indicated he thought he could follow the law, stated that he thought he had a \"lot to learn yet about it,\" and answered affirmatively when asked by the trial court whether he felt he could be fair and impartial.\n\nWithout permitting further questioning by defense counsel, the trial court denied the defense challenge for cause, finding that Krantz was conscientious and capable of being fair. No abuse of discretion is shown. Defense counsel had full and unrestricted opportunity to question the prospective juror, and the responses elicited by the prosecution did not reflect any significant change in position that would support further questioning by the defense.\n\nWithout allowing questioning by counsel, the trial court excused for cause prospective jurors Antonette Johnson, Laura Lopez, Connie Adams, Noram Stoskopf, Joseph Filiponni, and Rheamarie Bridy. The record reflects that each of these jurors expressed, either in their written questionnaires or in the course of questioning by the trial court, an unequivocal opposition to the death penalty that would prevent performance of their duties as jurors. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The trial court excused for cause prospective juror Larry Logan without permitting defense counsel to ask him the same question twice (concerning whether he could have an open mind). Because the record reflects that the juror clearly understood and answered the question the first time, the trial court's refusal to permit further inquiry did not exceed the bounds of its discretion.\n\nFor the foregoing reasons, there is no merit in defendant's claim that he was denied a fair and impartial jury as a result of the jury-selection process.\n\n3. Denial of Pitchess motion and restriction of cross-examination of Officers Jordan and Padillo\n\nDefendant challenges as error the trial court's refusal to disclose the personnel files of Officers Jordan and Padillo and the restriction of counsel's cross-examination of these officers regarding complaints and disciplinary actions taken against them, asserting a violation of his right of confrontation, among other rights guaranteed by the federal Constitution. As we shall explain, following our independent examination of the personnel files in question, we conclude defendant's claims have no merit.\n\nOn November 7, 1986, in municipal court proceedings in the present case, the defense filed a motion for the discovery of the personnel files of Officers Jordan and Padillo pursuant to Pitchess v. Superior Court (1974) 11 Cal. 3d 531, 113 Cal. Rptr. 897, 522 P.2d 305 (see Evid. Code, § 1043), \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e based upon a newspaper article reporting incidents of misconduct involving these officers. According to the article, the asserted misconduct resulted in the officers' transfer out of the homicide unit of their department. Allegedly, the officers were reprimanded after they voluntarily gave up their seats on an overbooked airline flight in exchange for air travel coupons. The article also indicated that Officer Jordan previously had been found to have coerced the confession of a juvenile, James M., in an unrelated homicide investigation. The defense sought access to the officers' personnel files containing information pertaining to the officers' history on the ground these records were relevant to the officers' credibility and the determination as to whether defendant's initial confession had been coerced.\n\nFollowing an in camera review of the personnel files (Evid. Code, § 1045), \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e the magistrate ordered the release of a redacted copy of a complaint against Officer Jordan filed by a witness (a Mr. Legg) in another, unrelated homicide investigation. The magistrate ordered that all remaining materials be copied and sealed.\n\nIn the superior court, before the case was assigned to the trial Judge, defendant sought review of the magistrate's ruling on the Pitchess motion by way of a motion to set aside the information pursuant to section 995. At the hearing on the motion, Officers Jordan and Padillo testified that they had been transferred out of the homicide unit following an incident involving their relinquishment of seats on an overbooked airline flight, acceptance of air travel coupons in exchange, and application for overtime pay for the additional time they were required to spend in the airport waiting for a later flight. Following the hearing, the assigned Judge (the Honorable Raul Rosado) reviewed in camera the personnel files of each officer and determined that the files contained nothing relevant to the case, with the exception of the previously disclosed complaint of Mr. Legg. The court accordingly upheld the magistrate's ruling on the Pitchess motion. The Court of Appeal subsequently denied defendant's petition for writ of mandate, concluding there was no showing of an abuse of discretion with respect to the ruling on the Pitchess motion.\n\nOn January 28, 1988, defendant renewed his motion in the superior court, seeking the production of any documents contained in the San Diego Police Department personnel files of Officers Jordan and Padillo that pertained to instances of improper conduct involving these officers, including false arrest, illegal search and seizure, fabrication of charges or evidence, improper techniques employed in obtaining admissions and confessions, failure to give Miranda advisements, inadequate or improper Miranda advisements, the use of physical force or psychological coercion in obtaining statements or confessions, or improper tactics in making arrests or obtaining confessions. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In support of the motion, defense counsel submitted a declaration stating \"upon information and belief\" that during their initial interrogation of defendant, Officers Jordan and Padillo lied to defendant, ignored his request for an attorney, and induced him to confess by telling him \"that things would look better or go easier if he answered questions or admitted crimes.\" Counsel also stated that defendant did not knowingly or intelligently waive his Miranda rights, and claimed that the files might contain information relevant to whether defendant had been coerced physically or psychologically to waive his rights and confess.\n\nThe trial Judge (the Honorable Douglas Woodworth) conducted an in camera review of the officers' complete personnel files. In the course of its review (attended by a deputy city attorney), the court noted on the record the previous disclosure of the airline coupon incident. The deputy city attorney disclosed that one of the officers had been accused of the theft of a \"scanner\" from a suspect during an arrest. The court ultimately concluded that nothing in the personnel files was relevant to the case, stating: \"If something were remotely relevant, it is certainly of such trivial significance as to be outweighed by the privilege, the confidentiality attaching to those personnel records.\"\n\nTrial courts are granted wide discretion when ruling on motions to discover police officer personnel records. ( People v. Memro (1995) 11 Cal. 4th 786, 832, 905 P.2d 1305.) Here, defense counsel did not allege that Officers Jordan or Padillo fabricated charges against defendant, committed violence against him, or obtained evidence against him by false arrest or by illegal search and seizure. Our independent in camera review of the sealed personnel files -- including the \"James M. incident,\" referred to ante, page 22 -- reveals no materials so clearly pertinent to the issues raised by the Pitchess discovery motion that failure to disclose them was an abuse of Pitchess discretion. Accordingly, we conclude the trial court properly exercised its discretion in excluding from disclosure the personnel files of Officers Jordan and Padillo.\n\nDefendant additionally complains the trial court improperly restricted his cross-examination of Officers Jordan and Padillo at trial regarding past incidents of misconduct.\n\nOn February 23, 1988, in the course of hearings on pretrial motions, the prosecution filed a motion in limine seeking to limit cross-examination (for impeachment purposes) of the police officers concerning past incidents of misconduct in unrelated cases. Defense counsel indicated his intention to file a written response to the motion. On March 7, 1988, the trial court made a \" provisional ruling\" for the guidance of counsel during jury voir dire, directing counsel not to mention \"the prior unrelated disciplinary proceedings affecting the two officers,\" remarking that the evidence \"may very well not be allowable.\"\n\nBecause no ruling was actually made below, \"no review can be conducted here.\" ( People v. Rowland (1992) 4 Cal. 4th 238, 259, 841 P.2d 897; People v. McPeters (1992) 2 Cal. 4th 1148, 1179, 832 P.2d 146 [\"the absence of an adverse ruling precludes any appellate challenge\"].)\n\n4. Denial of defendant's motions to suppress his confessions\n\nDefendant contends the trial court erred in denying his motions to suppress his three confessions on the grounds that (1) at the initial interrogation, after being advised of his Miranda rights, defendant invoked his privilege against self-incrimination when he refused the officers' request to tape-record the interview, and (2) defendant's waiver of Miranda rights was not knowing or voluntary, because of the circumstance -- in conjunction with his refusal to be tape-recorded -- that he was not advised specifically that his statements could be used against him \"in court.\" For these reasons, argues defendant, his initial confession was obtained in violation of Miranda, his second and third confessions were the tainted product of his initial confession, and the failure to suppress all three confessions requires reversal of his conviction and sentence of death.\n\n(a) Procedural background\n\nPrior to trial, defendant moved for the suppression of evidence of his confessions on the ground that his first confession was involuntary as the product of coercion, and in violation of his Miranda rights. At the evidentiary hearing on the motions to suppress, Officers Jordan and Padillo testified to the circumstances of their first interview with defendant and his confession. As observed (fn. 2, ante), Officer Jordan did not specify in his testimony that he had advised defendant (at the first interview) that defendant's statements could be used against defendant \"in court.\" As further noted (fn. 2, ante), the court additionally received in evidence the transcript of the preliminary hearing testimony of Officers Jordan and Padillo, the tape recording and transcript of defendant's second interview with the officers (reflecting that Officer Jordan, when reading from the admonition card, specifically advised defendant that his statements could be used against him \"in court\"), and the tape recording and transcript of the interview with Drs. Griswold and Dickson (reflecting that defendant was advised that the interview would be tape-recorded, was advised of his Miranda rights, and waived his rights and agreed to speak with the psychiatrist and the psychologist).\n\nFollowing argument on defendant's motion to suppress on the ground his waiver of rights was involuntary, the trial court denied the motion, finding that defendant had been advised adequately pursuant to Miranda, that any slight deviation in wording from the standard admonition form was immaterial, and that there was \"not a hint of any improper coercion, much less physical force . . .\" at any time. Following argument on the motion to suppress on Miranda grounds (based upon defendant's refusal to allow the officers to tape-record the interview), the trial court denied the motion, finding that defendant had been advised fully of, and explicitly waived, his Miranda rights, and that there was \"no hint on this record that the defendant desired or intended to assert his Fifth Amendment right to remain silent . . . .\" The court further found that Officer Padillo's \"conspicuous note taking\" was \"equivalent\" to a tape recording from defendant's standpoint, precluding any reasonable assumption that his statements were off the record.\n\nOn March 4, 1988, the Court of Appeal (Fourth Appellate District, Division One) denied defendant's petition for a writ of mandate seeking relief from the denial of his motions to suppress his confessions. The appellate court's order stated that the facts supported the Conclusion that \"petitioner's refusal to have his interrogation taped was not an indication of his right to remain silent.\"\n\n(b) Analysis\n\nDefendant first contends he invoked his privilege against self-incrimination when he refused to allow the first interview with Officers Jordan and Padillo to be tape recorded.\n\nIn reviewing the trial court's rulings related to this claim, we accept its resolution of disputed facts and inferences, and its evaluations of credibility, if substantially supported ( People v. Crittenden (1994) 9 Cal. 4th 83, 128, 885 P.2d 887), but we independently determine from the undisputed facts, and those properly found by the trial court, whether the challenged confessions were obtained illegally. (Ibid.)\n\n\" 'Under the familiar requirements of Miranda, . . . a suspect may not be subjected to custodial interrogation unless he or she knowingly and intelligently has waived the right to remain silent, to the presence of an attorney, and to appointed counsel in the event the suspect is indigent.' \" ( People v. Crittenden, supra, 9 Cal. 4th at p. 128; People v. Sims (1993) 5 Cal. 4th 405, 440, 853 P.2d 992, citing Miranda v. Arizona, supra, 384 U.S. 436, 444-445, 473-474.) This court has observed \"that no particular form of words or conduct is necessary on the part of a suspect in order to invoke his or her right to remain silent\" ( People v. Crittenden, supra, 9 Cal. 4th at p. 129), and the suspect may invoke this right by any words or conduct reasonably inconsistent with a present willingness to discuss the case freely and completely (ibid.).\n\nIt is well established, however, that a suspect does not invoke his or her right to remain silent merely by refusing to allow the tape recording of an interview, unless that refusal is accompanied by other circumstances disclosing a clear intent to speak privately and in confidence to others. ( People v. Johnson (1993) 6 Cal. 4th 1, 25-26, 859 P.2d 673.) In People v. Johnson, supra, 6 Cal. 4th 1, the defendant asserted he had invoked his right to remain silent at the outset of a custodial interrogation by remarking: \"No tape recorder. I don't want to incriminate myself.\" Following this remark, he was given the Miranda advisements and expressly consented to be interviewed. Upholding the trial court, we determined that the advisements, and the defendant's agreement to speak following his \"no tape recorder\" remark, clearly confirmed his general willingness to converse with the officers. (6 Cal. 4th at p. 25.) Of particular relevance to the present case, we observed that \" 'it was for the trial court to determine whether [the defendant's] refusal to . . . be recorded was in fact an invocation of his right to silence. The court found [the defendant] in fact had understood his rights and waived them, and his conversations with the officers were therefore voluntary. Such a Conclusion was reasonable, and we will not disturb it on appeal.' \" (6 Cal. 4th at p. 26.)\n\nSimilarly, in the present case, the trial court found that defendant's \"no tape recording\" remark, following an explicit waiver of his Miranda rights, and immediately followed by his incriminating admissions that conspicuously were transcribed by Officer Padillo, was not inconsistent with a willingness to discuss the case freely and completely. The trial court thus reasonably concluded that defendant did not invoke his right to remain silent by refusing to allow the interview to be tape-recorded.\n\nDefendant additionally contends that even if he purported to waive his Miranda rights, the circumstance that he was not advised specifically that his statements could be used against him \"in court,\" in conjunction with his refusal to be tape-recorded, establishes that his waiver of Miranda rights was not knowing or voluntary, because he \"believed he was speaking off the record by not having the interrogation tape recorded.\"\n\nAs the United States Supreme Court has observed, the prophylactic Miranda warnings are \" 'not themselves rights protected by the Constitution but [are] instead measures to insure that the right against compulsory self-incrimination [is] protected' \" ( Duckworth v. Eagan (1989) 492 U.S. 195, 203, 106 L. Ed. 2d 166, 109 S. Ct. 2875), and the warnings therefore need not be given in the exact form described in that decision ( id., at p. 201). Thus, a reviewing court need not examine a Miranda warning for accuracy as if construing a legal document, but rather simply must determine whether the warnings reasonably would convey to a suspect his or her rights as required by Miranda. ( Id., at p. 203; People v. Wash, (supra) , 6 Cal. 4th at pp. 236-237.)\n\nThe trial court made no specific finding as to whether during the officers' first interview of defendant, Officer Jordan included the words \"in court\" when he advised defendant that his statements could be used against him. Instead, the trial court determined that the alleged omission had no significance, in light of the circumstances that defendant otherwise was fully informed of his rights and expressly acknowledged that he understood them, was told the statements could and would be used against him, was an ex-felon who would have been familiar with the Miranda admonitions from his previous criminal involvement, and was aware of Officer Padillo's conspicuous, detailed notetaking, which would enable the officers to reconstruct defendant's statements and use them against him in a future criminal proceeding.\n\nOn the basis of the trial court's findings, which are substantially supported by the record, we conclude the trial court reasonably determined that defendant's explicit waiver of his Miranda rights was knowing and voluntary, and not the result of a misconception that his statements were off the record. Accordingly, the trial court did not err in denying defendant's motions to suppress his confessions on the ground of a Miranda violation.\n\nBecause we conclude that defendant's initial confession was not obtained in violation of Miranda, we also reject defendant's related claims that his second and third confessions -- in which he repeated his statements after full Miranda waivers -- were the tainted product of his initial confession. In any event, we observe that admissions made pursuant to full Miranda waivers may not be suppressed because of prior Miranda violations unless the later admissions were in fact involuntary. ( Oregon v. Elstad (1985) 470 U.S. 298, 84 L. Ed. 2d 222, 105 S. Ct. 1285.) The record discloses no basis on which to conclude that defendant's Miranda waivers at the second and third interviews were other than knowingly and voluntarily given, and thus valid. Accordingly, admission of the first interview, even if erroneous under Miranda, was harmless beyond a reasonable doubt. (See Arizona v. Fulminante (1991) 499 U.S. 279, 306-309, 113 L. Ed. 2d 302, 111 S. Ct. 1246; People v. Sims, supra, 5 Cal. 4th at p. 447.)\n\n5. Trial court's modification of instruction on mental defect in relation to intent to kill\n\nDefendant contends the trial court erred in modifying a jury instruction on mental defect by including an instruction on voluntary intoxication which, according to defendant, undermined his defense on the issue of the intent to kill required under the special circumstance allegation. Defendant's claim has no merit.\n\nDuring the presentation of the prosecution's case, defendant's brother Raul Samayoa testified that on the afternoon of the murders, he was home having a party in the garage while working on his automobile. On cross-examination by defense counsel, evidence was elicited that Raul and several other persons, including defendant, were drinking beer from a keg. Raul testified that he probably was drunk by 5 or 6 p.m., and that defendant was at the party that evening.\n\nAs part of the defense case, it was stipulated that the psychologist, Dr. Abigail Dixon, if called as a witness, would testify that shortly following the crimes she administered psychological tests to defendant that indicated defendant often \"perseverated,\" a circumstance suggesting \"organicity, the origin of which could well be alcohol or drugs.\"\n\nAt the Conclusion of the prosecution's rebuttal case, outside the jury's presence, the trial court raised the issue whether the jury should be instructed on voluntary intoxication, referring to the evidence presented relating to defendant's ingestion of alcohol. At the Conclusion of the presentation of the guilt phase evidence, the trial court again raised the issue of an instruction on voluntary intoxication, indicating its view that such instruction was necessary in light of the evidence of defendant's possible intoxication. At the time of trial (prior to our decision in People v. Saille (1991) 54 Cal. 3d 1103, 820 P.2d 588), appellate decisions indicated that a trial court should instruct sua sponte on voluntary intoxication if warranted by the evidence and not inconsistent with a defense theory of the case. (See People v. Ramirez (1990) 50 Cal. 3d 1158, 1179-1180, 270 Cal. Rptr. 286, 791 P.2d 965; People v. Robinson (1970) 5 Cal. App. 3d 43, 48, 84 Cal. Rptr. 796.) When the trial court stated it would instruct sua sponte on voluntary intoxication pursuant to CALJIC No. 4.21 (\"Voluntary Intoxication -- When Relevant to Specific Intent), \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e defense counsel did not object.\n\nDefense counsel had submitted a modified version of CALJIC No. 4.21, which substituted the term \"mental defect\" for the term \"intoxication.\" The trial court advised counsel that it had determined to add language relating to intoxication to defendant's modified version of CALJIC No. 4.21, to state that the jury could consider mental defect or intoxication, if shown by the evidence, in determining whether defendant had the intent to kill required for the special circumstances. Defense counsel objected to this modification of his proposed instruction.\n\nUltimately, the jury was instructed on this point as follows: \"In each of the three special circumstance charges, the necessary element is the existence in the mind of the defendant of a specific intent to kill. If the evidence shows that the defendant had a mental defect and/or that he was intoxicated at the time of the alleged offense, then the jury should consider such mental defect and/or such state of intoxication in determining whether or not the defendant had such a specific intent to kill. If from all the evidence you have a reasonable doubt whether the defendant formed such specific intent to kill, you must give the defendant the benefit of that doubt and find that he did not have the specific intent.\" (Italics added.)\n\nDefendant contends the trial court erred in modifying the instruction originally proposed by defense counsel (which had referred exclusively to mental defect), because the additional instruction on the assertedly weaker defense of intoxication tended to diminish the significance of a defense based upon mental defect relating to the issue of intent to kill.\n\nThe instruction given by the trial court, however, correctly stated the law, accurately conveying two potential defense theories that could be considered by the jury in determining whether defendant had formed the intent to kill. Defendant fails to identify any language contained in the instruction that would tend to mislead the jury as to the significance of the mental defect evidence. At the time of trial (in 1988), the instruction properly was given sua sponte. (See People v. Ramirez, (supra) , 50 Cal. 3d at pp. 1179-1180; see also Use Note to CALJIC No. 4.21 (4th ed.) (1987 pocket pt.) p. 61 [\"If there is evidentiary basis, this instruction must be given sua sponte.\"].) The jury concurrently was instructed pursuant to CALJIC No. 17.31 that the applicability of some instructions depended upon the jury's determination of the facts, and instructions that were not applicable should be disregarded. Accordingly, there was no reasonable likelihood that the jury was led to believe that the instructional reference to the defense of voluntary intoxication should affect its determination as to the defense of mental defect. (See People v. Kelly (1991) 1 Cal. 4th 495, 525, 822 P.2d 385 [the question \"is whether there is a 'reasonable likelihood' that the jury understood the charge as the defendant asserts\"].) The trial court's instruction did not deprive defendant of a fair trial, a reliable determination of guilt, or a reliable determination of the appropriate penalty.\n\n6. Claim of erroneous admission of photographs of the murder victims and the crime scene\n\nOver the objection of defense counsel, the trial court admitted into evidence several photographs of the crime scene and the autopsies performed on the victims. The crime scene photographs depicted the bodies of Mrs. Silva and Katherine, blood spatters and the smearing of blood on the walls, and the number, location, and severity of the head wounds. Defendant maintains the photographs were highly inflammatory and gruesome, and largely irrelevant to any material issue, because at the guilt phase the only controverted issue for the jury's determination was whether he had the intent to kill. Defendant contends the photographs therefore were more prejudicial than probative of any disputed factual issue for the jury's determination, and that the trial court's ruling admitting these exhibits constituted an abuse of discretion under Evidence Code section 352.\n\nWe disagree. The photographs were probative of the circumstances of the two murders, indicating that Mrs. Silva was struck repeatedly while lying on the floor, and suffered more than twenty serious blows to the head (contrary to defendant's statement that he hit the victims only when Mrs. Silva was standing, and that he struck only defensive blows when she surprised him). The photographs additionally indicated that Katherine had been pressed against the walls, also having received blows to the head caused by a crushing force. The photographs therefore were relevant to establish the prosecution's theory that defendant had possessed the intent to kill both victims, and to refute the defense theory that he had lacked the intent to kill. (See People v. Wilson (1992) 3 Cal. 4th 926, 937-938, 838 P.2d 1212.) Our independent review of the photographs persuades us they were not unduly shocking or inflammatory. We find no abuse of discretion.\n\n7. Claim of improper restriction upon expert testimony relating to defendant's mental condition\n\nDefendant contends the trial court erroneously granted the prosecution's in limine motion seeking to restrict expert testimony relating to defendant's mental state at the time of the commission of the crimes. As a result, defendant asserts, the defense was foreclosed from presenting evidence of a correlation between the defense experts' test results and the circumstances of the crimes. Defendant further contends that, during cross-examination of the defense expert witnesses and argument, the prosecution engaged in misconduct by criticizing the experts' failure to correlate their test results with the evidence of the crimes when, unknown to the jury, the prosecution assertedly had prevented the defense from introducing such evidence. Defendant argues that as a result of the alleged trial court error and prosecutorial misconduct, he was denied a full and fair opportunity to present his sole defense -- that he lacked the intent to kill -- in violation of his right to due process of law, among other rights guaranteed by the federal Constitution.\n\nSection 28, subdivision (a), provides that evidence of mental disease, defect, or disorder is not admissible \"to show or negate the capacity to form any mental state,\" but is admissible solely on the issue whether the accused \" actually formed a required specific intent . . . when a specific intent crime is charged.\" (Italics added.) Section 29 contains a similar limitation upon the admissibility of evidence of a defendant's mental state, providing: \"In the guilt phase of a criminal action, any expert testifying about a defendant's mental illness, mental disorder, or mental defect shall not testify as to whether the defendant had or did not have the required mental states, which include, but are not limited to, purpose, intent, knowledge, or malice aforethought, for the crimes charged. The question as to whether the defendant had or did not have the required mental state shall be decided by the trier of fact.\"\n\nAt the trial, on April 5, 1988, prior to the presentation of the defense case, the prosecution filed a memorandum of points and authorities (in limine memorandum), seeking to limit the defense's proposed expert testimony relating to the issue of intent to kill. The prosecution asserted that under the foregoing provisions, defendant was barred from presenting expert opinion on defendant's capacity to form the mental state required for commission of the charged crimes, or on the ultimate issue whether defendant possessed the required mental state at the time of the commission of the crimes, although an expert properly could testify to whether defendant suffered from a mental defect at the time of the crimes.\n\nThe trial court, in noting the filing of the prosecution's memorandum, commented that \"the nature of the evidence will probably not be very controversial as long as the defense witness doesn't purport to express an opinion on what was in fact in the defendant's mind at the critical moment.\" Defendant did not file any written opposition to the in limine memorandum, and the trial court did not hear argument or formally rule on the prosecution's proposed restriction of evidence set forth in the memorandum, prior to the forthcoming testimony of the defense mental health experts.\n\nDuring the cross-examination of defense witness Dr. Meredith Friedman, the prosecution asked several questions regarding the information the witness had been provided concerning the crimes, including whether she had received the police reports or photographs of physical evidence at the crime scene. When the witness replied that she had not received such information, the prosecution inquired whether such information concerning the circumstances of the crimes would not in fact be pertinent to a diagnosis of defendant's mental condition, and also questioned why the witness had not undertaken a correlation of her test results with such information. When defense counsel objected to this line of questioning, the trial court sustained the objection \"for the time being.\"\n\nThereafter, outside the presence of the jury, defense counsel complained that the prosecution's cross-examination -- regarding whether the witness had integrated the facts of the crimes with the expert's test results in reaching a diagnosis -- was \"somewhat misleading,\" because \"counsel knows very well that the law in this state, and in fact he very aptly filed a memorandum of law on that issue that we were not to ask that question as to what Mr. Samayoa's state of mind was at the moment of -- at the moment of the offense.\" Defense counsel requested a curative instruction to the jury indicating that expert witnesses could not testify as to defendant's state of mind at the time of the offense. In response, the trial court stated that an instruction to the effect that expert witnesses may not testify \"to the defendant's actual intent\" could be given at the time the jury was instructed in full.\n\nAt the close of the guilt phase, during argument, the prosecution commented upon Dr. Friedman's failure to relate the results of her testing of defendant to the facts of the present crimes, and made a similar remark regarding the testimony of Dr. Saddick. Outside the presence of the jury, defense counsel again objected to the prosecution's comments on the ground they were misleading in light of the prosecution's in limine memorandum. The prosecution responded that, as set forth in its memorandum, an expert was barred from testifying concerning his or her opinion as to whether a defendant was capable of harboring the intent to kill, but properly could testify concerning whether the defendant's conduct in committing the crimes was consistent with the expert's diagnosis of the defendant's mental condition. The prosecution clarified that, by its argument, it sought to point out that the defense experts were not provided with all of the information on the case and \"were not asked to correlate the diagnosis with what happened on the day of the crime.\"\n\nThe trial court ruled the prosecution's argument was proper in that it did not suggest \"any culpable failure\" by the witnesses \"to comment on the actual specific intent of the defendant.\"\n\nDefendant first contends that, by the trial court's comments on the prosecution's in limine memorandum (to the effect that the defense witnesses should not \"purport to express an opinion on what was in fact in the defendant's mind at the critical moment\"), the trial court erroneously \"granted\" a prosecution in limine motion, and thereby assertedly excluded evidence of a correlation of the experts' test results to the circumstances of the crimes.\n\nAs shown previously, however, defendant did not seek to argue against or otherwise oppose the prosecution's in limine memorandum, nor did he seek to secure a formal ruling by the trial court on the proposed limitation of expert testimony set forth in the memorandum. Furthermore, defendant never sought to introduce evidence that assertedly would have been excluded under the prosecution's memorandum, and hence the trial court was never required to rule upon the scope of admissible expert testimony relating to defendant's state of mind. Instead, defendant complained of the prosecution's cross-examination and argument (which emphasized the defense experts' failure to correlate their results with the evidence of the crimes) as being inconsistent with the prosecution's memorandum. Again, as noted above, \"the absence of an adverse ruling precludes any appellate challenge.\" ( People v. McPeters, supra, 2 Cal. 4th at p. 1179; People v . Rowland, supra, 4 Cal. 4th at p. 259.) \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nMoreover, the prosecution's line of inquiry during cross-examination of the defense expert witnesses concerning their failure to obtain police reports or photographs of physical evidence at the crime scene, or to correlate their diagnosis of defendant's mental condition with the circumstances of the commission of the crimes, did not constitute misconduct. Neither the trial court, nor sections 28 and 29, barred defendant from presenting expert testimony relating to defendant's mental disorders at the time of the commission of the crimes, or a correlation of the evidence of the crimes to the experts' test results (short of an opinion that as a result of defendant's mental disorders he lacked the capacity to form the intent to kill, or did not in fact have the intent to kill, when committing the crimes). (See People v. Breaux (1991) 1 Cal. 4th 281, 821 P.2d 585; People v. Rangel (1992) 11 Cal. App. 4th 291; People v. Young (1987) 189 Cal. App. 3d 891, 906-907, 234 Cal. Rptr. 819.) The prosecution's comments and argument relating to the failure of the defense experts to consider evidence of defendant's mental condition relevant to their diagnosis, and otherwise properly admissible, therefore were not misleading or otherwise improper.\n\n8. Claim of ineffective assistance of defense psychologist at trial\n\nDefendant contends he was deprived of the effective assistance of a psychologist at trial in violation of his federal constitutional right to due process of law. He maintains the defense expert witnesses who testified regarding his mental condition were incompetent in their psychological testing and in the presentation of their testimony, and as a result of their deficient performance he was denied the opportunity to present the only defense available to him -- that he lacked the intent to kill.\n\nIn support of this claim, defendant relies upon Ake v. Oklahoma (1985) 470 U.S. 68, 84 L. Ed. 2d 53, 105 S. Ct. 1087 (Ake). Ake holds that when an indigent defendant has demonstrated that his sanity is likely to be a significant factor in his defense on the issue of guilt, the state must provide the defendant with \"access to a competent psychiatrist who will conduct an appropriate examination and assist in evaluation, preparation, and presentation of the defense.\" ( Ake, supra, 470 U.S. at p. 83.)\n\nNeither Ake, however, nor the broader rule guaranteeing court-appointed experts necessary for the preparation of a defense (see Corenevsky v. Superior Court (1984) 36 Cal. 3d 307, 319, 204 Cal. Rptr. 165, 682 P.2d 360), give rise to a federal constitutional right to the effective assistance of a mental health expert. Numerous federal decisions have held that the federal Constitution does not recognize a right to the effective assistance of a psychiatrist or other mental health expert, or of the effective assistance of a witness. ( Harris v. Vasquez (9th Cir. 1990) 949 F.2d 1497, 1517-1518; Clisby v. Jones (11th Cir. 1990) 907 F.2d 1047, 1049-1050; Silagy v. Peters (7th Cir. 1990) 905 F.2d 986; Waye v. Murray (4th Cir. 1989) 884 F.2d 765, 767 [\"To inaugurate a constitutional or procedural rule of an ineffective expert witness in lieu of the constitutional standard of an ineffective attorney, we think, is going further than the federal procedural demands of a fair trial and the constitution require.\"]; Bloom v. Vasquez (C.D.Cal. 1993) 840 F. Supp. 1362, 1373 [ Ake does not provide a federal constitutional basis for challenging the competency of the defense psychiatrist used at trial].) These decisions recognize that a mental health expert is clearly distinguishable from legal counsel with regard to the protection of a defendant's fundamental rights in the adversarial process and, unlike the ascertainable standard of competent legal representation, the question whether a mental health expert has performed \"competently\" with regard to the assistance provided in the presentation of a defense is not readily determinable. (See Clisby v. Jones, supra, 907 F.2d at p. 1050; see also People v. Gonzalez (1990) 51 Cal. 3d 1179, 1247, 275 Cal. Rptr. 729, 800 P.2d 1159 [the professional opinions of a neuropsychologist inherently generate expert debate].)\n\nIn the present case, defendant was provided access to the services of two licensed psychologists of his choice to conduct neuropsychological testing and evaluation. These witnesses presented substantial testimony regarding defendant's mental disorders. The circumstance that these witnesses did not provide testimony at defendant's trial which in defendant's view persuasively supported his defense that he lacked the intent to kill does not give rise to a claim of a violation of a federal constitutional safeguard. (See Harris v. Vasquez, supra, 949 F.2d at p. 1516 [ Ake does not guarantee access to a psychiatrist who will reach only biased or favorable Conclusions].)\n\nFor these reasons, defendant's claim of ineffective assistance of a psychologist has no merit.\n\n9. Denial of continuance\n\nAt the Conclusion of the direct examination of the prosecution's criminalist, Wayne Burgess, defense counsel requested a continuance of the proceedings to prepare for the cross-examination of this witness regarding the crime scene reconstruction. Defendant contends the trial court's denial of the request for a continuance constituted an abuse of discretion and violated defendant's rights of confrontation, due process of law, and the effective assistance of counsel under the federal Constitution. For the reasons that follow, we conclude the trial court's denial of a continuance did not constitute an abuse of discretion, nor did it violate defendant's federal constitutional rights.\n\nAt the time the prosecution called Burgess to testify as a crime scene reconstructionist, defense counsel informed the court that he (counsel) had not been provided with a copy of any report from Burgess. When informed that Burgess had not prepared any written report, the trial court ruled that the witness would testify the following day but that defense counsel in the meantime would have the opportunity to interview him regarding the anticipated content of his testimony. The next day, Burgess testified regarding his reconstruction of the crime scene (based upon the crime scene photographs, among other materials), including his opinions that Mrs. Silva had received most of the blows while lying prone on the floor, and that Katherine initially had been struck while close to her mother's leg, and then moved along a wall and was struck again. Burgess opined, \"She could have very well been scooching along the floor to get away from whatever she -- whatever danger she was feeling, and then was, in my view, struck again at least once, and then came to rest.\"\n\nAt the Conclusion of the prosecution's direct examination of Burgess, the defense moved for a continuance to permit counsel to prepare for cross-examination. Defense counsel maintained that the witness's testimony regarding the child's movement along the wall was beyond the scope of the information that Burgess had related to defense counsel, and counsel asserted he wanted the criminalist to examine the crime scene photographs in order to provide counsel with information pertaining to this point.\n\nThe trial court denied the request for a continuance, describing the witness's direct examination testimony as basically \"common sense,\" and noting the defense would have the opportunity to consult its own expert following Burgess's testimony, and to call Burgess as a witness during the defense case.\n\n\" 'The granting or denial of a motion for continuance in the midst of a trial traditionally rests within the discretion of the trial Judge who must consider not only the benefit which the moving party anticipates but also the likelihood that such benefit will result, the burden on other witnesses, jurors and the court and, above all, whether substantial Justice will be accomplished or defeated by a granting of the motion.' \" ( People v. Zapien (1993) 4 Cal. 4th 929, 972, 846 P.2d 704; People v. Laursen (1972) 8 Cal. 3d 192, 204, 104 Cal. Rptr. 425, 501 P.2d 1145.) In the absence of a showing of an abuse of discretion and prejudice to the defendant, a denial of his or her motion for a continuance does not require reversal of a conviction. ( People v. Zapien, supra, 4 Cal. 4th at p. 972; People v. Laursen, (supra) , 8 Cal. 3d at p. 204.)\n\nUnder these standards, no abuse of discretion is shown. Defense counsel had the opportunity to interview Burgess shortly before this witness's testimony regarding the anticipated scope of his testimony. Defense counsel claimed surprise only as to Burgess's opinion that Katherine had moved herself between the striking of blows, possibly in an attempt to evade defendant. As noted by the trial court, however, Burgess's testimony in this regard amounted to a \"common sense\" interpretation of the crime scene photographs, based upon the witness's observation of the location of the blood stains, the smearing of the blood, and the final position of the child's body, as shown in the photographs, and not upon special testing or scientific examination of the photographs or physical evidence. Defense counsel therefore did not reasonably require consultation with an expert or some other source in order to conduct an effective cross-examination of Burgess.\n\nFurthermore, defense counsel had the opportunity during the defense case to accomplish his objective of impeaching Burgess's testimony through the testimony of the defense criminalist. As noted by the trial court, however, in denying defendant's subsequent motion for a new trial on this ground, defense counsel did not introduce in the course of the presentation of the defense case any expert testimony relating to Katherine's movement along the hallway during the commission of the crimes.\n\nFor these same reasons, defendant has failed to demonstrate a violation of his federal constitutional rights to due process of law, confrontation of witnesses, or the effective assistance of counsel. (See People v. Howard (1992) 1 Cal. 4th 1132, 1172, 824 P.2d 1315.)\n\n10. Claim of prosecutorial misconduct\n\nDefendant contends the prosecution committed numerous instances of misconduct during the guilt phase requiring reversal of defendant's conviction and sentence of death.\n\nThe applicable federal and state standards regarding prosecutorial misconduct are well established. \" 'A prosecutor's . . . intemperate behavior violates the federal Constitution when it comprises a pattern of conduct \"so egregious that it infects the trial with such unfairness as to make the conviction a denial of due process.\" ' \" ( People v. Gionis (1995) 9 Cal. 4th 1196, 1214, 892 P.2d 1199; People v. Espinoza (1992) 3 Cal. 4th 806, 820, 838 P.2d 204.) Conduct by a prosecutor that does not render a criminal trial fundamentally unfair is prosecutorial misconduct under state law only if it involves \" ' \"the use of deceptive or reprehensible methods to persuade either the court or the jury.\" ' \" ( People v. Espinoza, supra, 3 Cal. 4th at p. 820.) As a general rule a defendant may not complain on appeal of prosecutorial misconduct unless in a timely fashion -- and on the same ground -- the defendant made an assignment of misconduct and requested that the jury be admonished to disregard the impropriety. ( People v. Berryman (1993) 6 Cal. 4th 1048, 1072, 864 P.2d 40.) Additionally, when the claim focuses upon comments made by the prosecutor before the jury, the question is whether there is a reasonable likelihood that the jury construed or applied any of the complained-of remarks in an objectionable fashion. (Ibid.)\n\nDefendant's first claim of misconduct is based upon the prosecution's guilt-phase argument that the defense mental health experts were not presented with and did not consider the circumstances of the commission of the crimes in this particular case or correlate their diagnosis of brain damage to those particular circumstances. Defendant contends the prosecution, by emphasizing that the defense had failed to present this evidence, misled the jury in light of the circumstance, unknown to the jury, that earlier the prosecution successfully had prevented the defense from introducing this type of evidence.\n\nThis claim previously was raised and rejected (see analysis of claim, pt. A.7, ante). As we have shown, the prosecution's comments and argument relating to the failure of the defense experts to present such evidence were not misleading or otherwise improper.\n\nDefendant next claims the prosecution improperly attempted to mislead the jury regarding the prosecution's burden of proof by indicating that defendant bore the burden of raising a reasonable doubt as to his guilt. Defendant bases this claim upon the prosecution's rhetorical remark during closing argument regarding the defense expert's findings of brain damage: \"Now, has the defense been able to create a reasonable doubt in your mind based on what these doctors have told you? I guess that would be the ultimate decision in this case, have they been able to create a reasonable doubt for you?\"\n\nDefendant's claim is deemed waived, however, by his failure to object or request an admonition. Moreover, defendant's claim fails on the merits. Defense counsel's argument and the court's jury instructions unambiguously communicated to the jury that the prosecution had the burden of proving every element of the case beyond a reasonable doubt. The record does not demonstrate that the prosecution employed deceptive or reprehensible methods to persuade the jury, and, in light of the entire record, there was no reasonable likelihood that the jury erroneously construed the prosecution's burden of proof.\n\nDefendant next contends the prosecution, in the course of its argument pertaining to the issue whether defendant possessed the intent to kill, committed misconduct by making inflammatory remarks describing the effect of defendant's acts upon the life of Mr. Silva. For example, the prosecution stated: \"We're dealing with a man who can destroy another man's life, destroy Rolando Silva's life, his entire reason for being, just because he needed some money . . . . Someone who could walk into a house and destroy a man's wife, destroy the mother of his child, destroy his baby, his future. . . . Someone who quite possibly has ruined every Christmas to come for Mr. Silva.\" The defense objected to this line of \"victim impact\" argument as improper. The trial court sustained the objection, later instructing the jury that the argument regarding the impact upon Mr. Silva was improper and irrelevant to the issue of defendant's mental state. The prosecution subsequently remarked that defendant was \"cold\" in watching Mr. Silva led away by the police as a suspect, and was a liar. The trial court overruled the defense objection, commenting that this argument was relevant to defendant's state of mind. Defendant contends the foregoing comments were improper inflammatory attacks upon his character, and that the court's admonition to disregard the victim impact references were inadequate to cure the prejudicial effect.\n\nTo the extent any of the foregoing argument was improper, however, there is no reasonable likelihood that the prosecution's line of argument misled the jury as to its task in determining whether defendant possessed the intent to kill. The remarks in large part simply articulated circumstances that were obvious or readily inferrable from the evidence presented, and the court's curative instruction would have corrected any misimpression held by the jurors as to the relevance of the evidence in determining the issue of intent to kill.\n\nDefendant next complains that during questioning of Saddick, the prosecution subjected the witness to ridicule by implying that the witness suffered from the same symptom of \"viscosity\" as did defendant (\"Just so I understand it, does [viscosity] happen when somebody can't really answer a question directly, and goes off on a tangent?\") Defense counsel failed to object or request an admonition, however, and this claim therefore has been waived. Moreover, there is no reasonable likelihood the remarks complained of misled or were construed by the jury in an improper manner.\n\nDefendant next claims the prosecution improperly indicated during argument that defendant could have been charged with additional special circumstances, by the remarks that there are \"zillions of crimes in the Penal Code\" and \"we have selected the charges. There are 17, 18, 19 special circumstances; we have selected two.\" The prosecution then stated, \"All you have to worry about is whether or not we prove them. That's all you have to worry about.\" This was not misconduct. The prosecution was responding to defense counsel's argument that the prosecution had overcharged the case, and simply clarified that the issue whether defendant could have been charged with additional or fewer offenses was irrelevant to the matters to be determined by the jury.\n\nDefendant finally contends that, during the cross-examination of defense psychologists Friedman and Saddick, the prosecution made improper references to matters that were not in evidence. He first points to the prosecution's request that Friedman \"rescore\" a test result employing a formula suggested by the prosecution. Defense counsel objected, and the jury was admonished that the prosecution's question should not be considered as evidence. Defendant contends the question improperly implied that the prosecution possessed different test results using different criteria not produced at trial. Contrary to this assertion, any possible erroneous implication created by the prosecution's question would have been corrected by the trial court's admonition.\n\nDefendant next complains that the prosecution mocked Saddick and inflamed the jury by inquiring whether the neurological testing that measured defendant's grip of an object showed that defendant would have been able to grip the wrench used in the murder. Defendant contends the question intimated that the prosecution had information about defendant that had not been presented to the jury. He also objects to the prosecution's questions implying that background information (concerning defendant's visit to a hospital) which defendant had supplied this witness had been fabricated. Defendant failed to object or request an admonition, however, and therefore has waived both claims. Moreover, the questions constituted proper comment upon, or inquiry concerning, the expert witness's testing of defendant. And in light of the trial court's instruction that any statement made by an attorney in the course of the trial did not constitute evidence and \"may be considered only in so far as it supplies meaning to this witness's answer,\" there is no danger the jury was misled by the prosecution's cross-examination.\n\nFinally, defendant asserts the prosecution's questions of Saddick regarding the cost of a computerized axialtomography (CAT) scan, an electroencephalogram (EEG), or magnetic resonance imaging (an MRI), improperly implied that such testing had been performed and the results withheld by the defense because of the failure of such tests to show brain damage. We find no misconduct, but rather proper inquiry regarding the reliability of the witness's testing and ultimate diagnosis of defendant.\n\nIn sum, we conclude that the prosecution's comments and argument of which defendant complains, whether considered singly or together, did not render the guilt phase of the trial fundamentally unfair, or amount to a deceptive or reprehensible means of persuasion as to which there is a reasonable likelihood the jury was misled. Thus we find no prejudicial misconduct.\n\n11. Trial court's instructions regarding availability of written instructions\n\nAt the Conclusion of the guilt phase of the trial during instruction of the jury, the trial Judge informed the jury that a set of the written instructions would not be available immediately during deliberations, because the Judge had made numerous handwritten notations. The court instead encouraged the jurors to take notes to enable them to recall the instructions. The court explicitly clarified, however, that, upon request, a copy of the written instructions would be made available to the jury at some point during its deliberations. The trial court gave similar instructions regarding the availability of written instructions at the penalty phase. The jury did not request and was not provided copies of the written instructions at either the guilt or penalty phases of the trial.\n\nDefendant contends the trial court's instruction to the jury, at the guilt and penalty phases, that copies of the written instructions would be made available only upon request, and urging the jurors to rely upon their notes, violated\n\ndefendant's rights to a trial by jury, a fair trial with due process of law, and a reliable guilt and penalty determination, in violation of several amendments to the federal Constitution and article I, sections 15 and 16, of the California Constitution.\n\nWe conclude the trial court properly instructed the jury regarding the availability of written instructions. Section 1093, subdivision (f), provides in pertinent part, \"Upon the jury retiring for deliberations, the court shall advise the jury of the availability of a written copy of the jury instructions. The court may, at its discretion, provide the jury with a copy of the written instructions given. However, if the jury requests the court to supply a copy of the written instructions, the court shall supply the jury with a copy.\"\n\nThe trial court's instruction to the jury regarding written instructions being provided upon request complied with the requirements of section 1093, subdivision (f). Furthermore, the provision of written instructions to the jury (although generally beneficial and to be encouraged) is not guaranteed by, and therefore does not implicate, any provision of the state or federal Constitution. ( People v. Cooley (1993) 14 Cal. App. 4th 1394, 1399.) We therefore reject defendant's constitutional claim.\n\n12. Claim of ineffective assistance of counsel\n\nDefendant maintains he was deprived of effective assistance of counsel during the guilt phase of the trial. To establish constitutionally inadequate representation, a defendant must demonstrate that (1) counsel's representation was deficient, i.e., it fell below an objective standard of reasonableness under prevailing professional norms; and (2) counsel's representation subjected the defendant to prejudice, i.e., there is a reasonable probability that, but for counsel's failings, the result would have been more favorable to the defendant. ( People v. Mitcham (1992) 1 Cal. 4th 1027, 1058, 824 P.2d 1277; see Strickland v. Washington (1984) 466 U.S. 668, 687-696, 80 L. Ed. 2d 674, 104 S. Ct. 2052.) \"When a defendant on appeal makes a claim that his counsel was ineffective, the appellate court must consider whether the record contains any explanation for the challenged aspects of representation provided by counsel. 'If the record sheds no light on why counsel acted or failed to act in the manner challenged, \"unless counsel was asked for an explanation and failed to provide one, or unless there simply could be no satisfactory explanation,\" [citation], the contention must be rejected.' \" ( People v. Mitcham, supra, 1 Cal. 4th at p. 1058; People v. Pope (1979) 23 Cal. 3d 412, 425, 152 Cal. Rptr. 732, 590 P.2d 859.) Defendant has failed to meet his burden of establishing, on the record before us, that his trial counsel was ineffective.\n\nDefendant first complains of his counsel's explicit concession (in his opening statement) of defendant's guilt of the charges of first degree murder and burglary, and his additional concession (during closing argument) that if one special circumstance allegation were found true, all the special circumstance allegations necessarily were true. The record reflects that defense counsel conceded that defendant was guilty of first degree murder because of the felony-murder rule, but argued that defendant had no intent to kill. In light of the overwhelming evidence of defendant's guilt of the first degree murders of Nelia and Katherine Silva on a felony-murder theory, defense counsel reasonably may have determined that the only viable theory of defense was that defendant had lacked the intent to kill, an element that, at the time of the crimes (see People v. Anderson, (supra) , 43 Cal. 3d 104), was required as to each of the three alleged special circumstances. In that event, counsel's concession as to guilt was based upon a considered tactical determination. (See People v. Wade (1988) 44 Cal. 3d 975, 988, 244 Cal. Rptr. 905, 750 P.2d 794; People v. Jackson (1980) 28 Cal. 3d 264, at 292-293.) We repeatedly have rejected claims that counsel was ineffective in conceding various degrees of guilt under similar circumstances. (See People v. Freeman, (supra) , 8 Cal. 4th at p. 498; People v. Mitcham, supra, 1 Cal. 4th at pp. 1060-1061.)\n\nThe record also fails to establish affirmatively that defense counsel's all-or-nothing approach with regard to the special circumstance allegations was not based upon a reasonable tactical decision. Counsel stated, \"So if he's guilty of one special circumstance, he's obviously guilty of them all. And if he's not guilty of one, he's not guilty of them all, because they all happened basically at the same time.\" Counsel apparently determined that if the jury harbored a doubt as to whether defendant had intended to kill one of the two victims, it was reasonably possible the jury would conclude that defendant had lacked the intent to kill with respect to both of the victims, and thus return a finding of not guilty as to all three special circumstances. Defendant therefore has failed to demonstrate that counsel's position was not based upon a rational tactical decision under the circumstances.\n\nDefendant next complains of counsel's asserted incompetence during argument in describing defendant as a \"bizarre, violent attacker, preyer of women.\" These remarks, however, considered in the context of counsel's entire argument, indicate quite clearly that counsel was seeking to present a forceful argument of explanation that defendant's conduct was the result of an uncontrollable rage reaction -- a reasonable strategic argument in light of the overwhelming evidence that defendant brutally and repeatedly had bludgeoned his two vulnerable victims on the face and other parts of the head.\n\nIn a related argument, defendant asserts that an attorney may not concede to a jury the guilt of his client without the consent of the client. He cites People v. Diggs (1986) 177 Cal. App. 3d 958, 970, 223 Cal. Rptr. 361, in support of this proposition, maintaining that counsel's concessions as to defendant's guilt violated this rule. We observe that the record fails to disclose the nature or extent of defendant's involvement in, or explicit approval of, his counsel's trial strategy with regard to concessions of defendant's guilt, and therefore fails to support defendant's claim that he did not consent to those concessions or any other aspect of his defense. Moreover, the record reflects that defense counsel conceded only those charges for which there was no viable defense, and therefore did not deprive defendant of any meritorious defense without his client's consent. (Cf. People v. Diggs, (supra) , 177 Cal. App. 3d 958, 970 [where counsel incompetently deprived his client of a potentially meritorious defense, he improperly conceded his client's guilt].) We find no error. (See People v. Griffin (1988) 46 Cal. 3d 1011, 1029, 251 Cal. Rptr. 643, 761 P.2d 103 [no waiver required even though defense counsel expressly \"conceded defendant's responsibility for the killing\"].)\n\nDefendant next complains that counsel was deficient in preparing and presenting the testimony of the defense mental health expert witnesses. Defendant criticizes both the choice of psychologists Friedman and Saddick as the defense mental health experts as well as various aspects of their testimony which, according to defendant, demonstrate that these witnesses were unqualified in their fields to performs the tasks assigned, relied upon incomplete background data and testing, and lacked adequate preparation to present their testimony effectively.\n\nRegardless whether there were any negligent omissions by counsel in the preparation and presentation of mental health evidence, however, defendant has failed to demonstrate that but for counsel's alleged incompetence a reasonable probability exists that the result of the guilt phase (or penalty phase) would have been more favorable to defendant. In light of defense counsel's concession of defendant's guilt of two counts of first degree murder, the testimony of the defense experts relating to defendant's mental condition was admissible solely to the extent relevant to the specific issue whether defendant intended to kill his victims. Both of the witnesses in question (who were licensed psychologists) testified that defendant suffered from brain damage that would cause unmodulated, explosive, and \"rage\" reactions in novel and stressful situations, as well as \"viscosity,\" signifying that once engaged in aggressive behavior, defendant was unable to discontinue his actions. This testimony was relevant to the issue of intent to kill, and defendant has failed to establish on this record the likelihood that, but for counsel's alleged failings in selecting and preparing the experts, mental condition testimony would have been presented that would have resulted in a finding more favorable to defendant on this issue. Defendant therefore has failed to establish the second prong required for a successful claim of ineffectiveness of counsel -- prejudice -- and his claim must fail. (See Strickland v. Washington, (supra) , 466 U.S. at p. 696; People v . Price (1991) 1 Cal. 4th 324, 440, 821 P.2d 610.)\n\nDefendant next contends that as a result of counsel's failure to object to evidence presented at the guilt phase, he was denied competent representation. Defendant complains of counsel's failure (1) to raise a Kelly-Frye objection ( People v . Kelly (1976) 17 Cal. 3d 24, 130 Cal. Rptr. 144, 549 P.2d 1240; Frye v . United States (D.C. Cir. 1923) 54 App. D.C. 46, 293 F. 1013) to testimony by the prosecution's criminalist regarding his observations of crime scene blood spatter and their significance based upon his knowledge of blood spatter experiments, (2) to object to testimony that Officer Jordan had been acquainted with defendant prior to the officer's interrogation of defendant regarding the current crimes, and (3) to object to the reference made by the prosecution's criminalist to serological evidence retrieved from the crime scene (to the effect that the results were inconclusive because of degradation of the blood samples), or to make a Hitch motion ( People v . Hitch (1974) 12 Cal. 3d 641, 117 Cal. Rptr. 9, 527 P.2d 361) based upon improper storage of the blood.\n\nThe record fails to demonstrate affirmatively that counsel's omissions were not based upon a rational tactical basis, such as the reasonable assumption that such objections would be overruled. For example, in People v . Clark (1993) 5 Cal. 4th 950, 1017-1018, 857 P.2d 1099, this court held specifically that \"blood-spatter\" testimony \"raises none of the concerns addressed by Kelly-Frye. 'The methods employed are not new to [science] or the law, and they carry no misleading aura of scientific infallibility.' \" (Italics in original.) The testimony relating to the serological evidence retrieved from the crime scene, and the opinion that some blood stains yielded inconclusive results, both were relevant and not unduly prejudicial, and defendant fails to explain the asserted basis for a Hitch motion. Defendant also fails to articulate any legal basis for an objection to the testimony regarding Officer Jordan's prior contacts with defendant.\n\nFor all of these reasons, defendant fails to show that his counsel's performance was deficient in failing to raise objections to prosecution evidence.\n\n13. Claim of cumulative error at guilt phase\n\nDefendant contends he was denied a fair trial based upon cumulative error at the guilt phase, requiring the reversal of his conviction and sentence of death. In light of our Conclusions, however, that none of defendant's claims of error, considered separately, has merit, we reject defendant's contention that cumulative error requires reversal.\n\nB. The Penalty Phase Issues\n\n1. Claim that admission of Raymond's preliminary hearing testimony violated defendant's federal constitutional rights\n\nAt the commencement of the penalty phase, the prosecution moved for admission of the 1976 preliminary hearing testimony of Berta Lou Raymond to prove the circumstances surrounding defendant's 1976 conviction for rape and burglary, including the unadjudicated crime of sodomy. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nAt the time of the present trial, Raymond was deceased, and the prosecution sought to admit her preliminary hearing testimony on the ground she was unavailable as a witness under Evidence Code section 1291.\n\nDefense counsel objected to the admission of Raymond's prior testimony on the ground that such evidence was the equivalent of \"conditional testimony\" under Penal Code section 1335, and therefore was inadmissible in a capital case. He also argued that defendant's objective in cross-examining Raymond at the preliminary hearing was dissimilar from his objective at the penalty phase of the trial in the present case, and therefore the preliminary hearing testimony was inadmissible under Evidence Code section 1291. The trial court overruled these defense objections, indicating the requisite reliability for the admission of hearsay evidence was present, and noting that at the preliminary hearing the victim had testified in open court under oath with knowledge that she was subject to prosecution for perjury and \"subject to cross-examination by counsel who had every motive and inducement to break down her testimony or break her credibility.\"\n\nDefendant now contends the admission of Raymond's preliminary hearing testimony violated Evidence Code section 1291, as well as his right of confrontation under the state and federal Constitutions.\n\nEvidence Code section 1291, subdivision (a), provides: \"Evidence of former testimony is not made inadmissible by the hearsay rule if the declarant is unavailable as a witness and: . . . (2) The party against whom the former testimony is offered was a party to the action or proceeding in which the testimony was given and had the right and opportunity to cross-examine the declarant with an interest and motive similar to that which he has at the hearing.\"\n\nIn People v. Zapien, (supra) , 4 Cal. 4th 929, 975, this court recognized that the \"admission of the former testimony of an unavailable witness is permitted under Evidence Code section 1291 and does not offend the confrontation clauses of the federal or state Constitutions -- not because the opportunity to cross-examine the witness at the preliminary hearing is considered an exact substitute for the right of confrontation at trial [citation], but because the interests of Justice are deemed served by a balancing of the defendant's right to effective cross-examination against the public's interest in effective prosecution.\" The court further determined that a defendant's motive in cross-examining a witness at a preliminary hearing may differ somewhat from the motive at trial, but nevertheless the earlier testimony may be admissible at the trial under section 1291 because the \"motives need not be identical, only 'similar.' \" ( People v. Zapien, supra, 4 Cal. 4th at p. 975, citing People v. Alcala (1992) 4 Cal. 4th 742, 784, 842 P.2d 1192.) Following similar reasoning and principles, in People v. Wharton (1991) 53 Cal. 3d 522, 280 Cal. Rptr. 631, 809 P.2d 290 the court held the defendant's interest and motive in cross-examining the alleged rape victim at the preliminary hearing in a prior unrelated criminal prosecution was sufficiently similar to the defendant's interest and motive at the penalty phase of a subsequent capital trial to warrant the admission of the preliminary hearing testimony under Evidence Code section 1291. (53 Cal. 3d at p. 589.)\n\nDefendant's motive and interest in cross-examining Raymond at the 1976 preliminary hearing were closely similar to defendant's objectives at the penalty phase of the trial in the present capital case -- namely, to attempt to discredit the witness's account of the crime and establish that the witness could not identify the person or persons who committed the rape and burglary, while at the same time, in light of the witness's sympathetic circumstances, not offending or alienating the trier of fact by treating the witness harshly. The record indicates defense counsel at the preliminary hearing acted reasonably in light of these objectives, establishing that the witness was unable to see the face of the rapist and had only a general idea as to the rapist's height and build.\n\nDefendant argues that his motive and interest in cross-examining Raymond at the penalty phase of the present capital trial -- namely, to elicit evidence of mitigating circumstances that would tend to diminish the aggravating nature of the crimes -- was dissimilar from his motive and interest at the preliminary hearing in the rape and burglary prosecution. Defendant fails to suggest, however, the evidence that might have been elicited from Raymond (had she testified at the penalty phase of the present capital case) but was not elicited at the preliminary hearing, and that would have placed defendant's conduct (raping and sodomizing a known multiple sclerosis victim) in a less aggravating light.\n\nFor all of these reasons, we conclude the trial court properly concluded that defendant's \"motive and interest\" in cross-examining Raymond at the preliminary hearing and at the capital trial were sufficiently similar to satisfy the requirements of Evidence Code section 1291.\n\nDefendant additionally claims the admission of Raymond's preliminary hearing testimony violated his federal constitutional right of confrontation because defense counsel rendered incompetent representation at the preliminary hearing by eliciting from the witness damaging information instead of contesting the reliability of the witness's perceptions (including the number of men who raped her). As the court explained in People v. Zapien, (supra) , 4 Cal. 4th 929, as long as a defendant was provided the opportunity for cross-examination, the admission of preliminary hearing testimony under Evidence Code section 1291 does not offend the confrontation clause of the federal Constitution simply because the defendant did not conduct a particular form of cross-examination that in hindsight might have been more effective. (See People v. Zapien, supra, 4 Cal. 4th at p. 975.)\n\nDefendant finally contends the presumption of reliability that normally is accorded preliminary hearing testimony ( California v. Green (1970) 399 U.S. 149, 161-162, 26 L. Ed. 2d 489, 90 S. Ct. 1930) should not apply in the present case, because Raymond's testimony was demonstrated to be in fact unreliable in light of the penalty phase testimony of David Anderson relating that he and the third burglar also had raped the victim. In California v. Green, supra, 399 U.S. 149, however, the United States Supreme Court made clear that when a defendant has had an opportunity to cross-examine a witness at the time of his or her prior testimony, that testimony is deemed sufficiently reliable to satisfy the confrontation requirement ( id., at pp. 166-167), regardless whether subsequent circumstances bring into question the accuracy or the completeness of the earlier testimony. ( Id., at p. 166, fn. 16.) \"The 'reliability' of the statement is based on the circumstances under which it was given . . . .\" (Ibid.)\n\nFinally, we reject defendant's contention that the admission of the preliminary hearing testimony was the equivalent of the admission of deposition testimony given at a \"conditional examination\" in violation of section 1335, which authorizes the People in noncapital cases to have witnesses conditionally examined. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The preliminary hearing at which Raymond testified was not a conditional examination within the meaning of section 1335, and that statute therefore has no application to the present case.\n\n2. Instruction that the law has no preference as to penalty\n\nIn the course of its instructions at the Conclusion of the penalty phase, the trial court instructed the jury: \"At the commencement of your deliberations, let me make it clear that the law of the State of California expresses no preference as to which punishment is appropriate. That is for you to determine.\"\n\nDefendant contends the foregoing instruction prejudicially misled the jury as to the capital sentencing standard under California law, because California has a preference for a sentence of life imprisonment over death. In support of this proposition, defendant relies upon the requirement that a juror must be persuaded that \"the aggravating evidence is so substantial in comparison with the mitigating circumstances\" that a verdict of death should be returned. (See CALJIC No. 8.84.2; People v . Duncan (1991) 53 Cal. 3d 955, 978, 281 Cal. Rptr. 273, 810 P.2d 131.)\n\nContrary to defendant's assertion, the trial court's instruction to the jury that the law expresses no preference as to the appropriate punishment correctly states the sentencing standard under California's death penalty law. In People v. Hayes (1990) 52 Cal. 3d 577, 276 Cal. Rptr. 874, 802 P.2d 376, this court rejected a contention that, in the penalty determination process of a capital case, if a jury finds the circumstances in aggravation and mitigation equal in weight, the jury should vote for life over death, and must be instructed accordingly. The court reasoned that in the determination of penalty, unlike the determination of guilt, there is no burden of proof, and \"the jurors cannot escape the responsibility of making the choice by finding the circumstances in aggravation and mitigation to be equally balanced and then relying on a rule of law to decide the penalty issue.\" ( Id., at p. 643.) In other words, neither death nor life is presumptively appropriate or inappropriate under any set of circumstances, but in all cases the determination of the appropriate penalty remains a question for each individual juror. The trial court's instruction in the present case accordingly did not mislead the jury as to the penalty determination process.\n\n3. Claims of prosecutorial misconduct and ineffective assistance of counsel\n\nDefendant contends the prosecution engaged in several instances of misconduct during the death qualification or Hovey ( Hovey v. Superior Court (1980) 28 Cal. 3d 1, 168 Cal. Rptr. 128, 616 P.2d 1301) portion of voir dire and during the penalty phase, requiring reversal of his conviction and sentence of death. We apply the same standard in reviewing this claim as in our evaluation of defendant's claim of prosecutorial misconduct at the guilt phase. (See People v . Gionis, (supra) , 9 Cal. 4th at p. 1214; People v. Espinoza, (supra) , 3 Cal. 4th at p. 820.)\n\nDefendant first contends the prosecution committed misconduct during the death qualification portion of the voir dire by inquiring of jurors whether, if polled after returning a sentence of death, they could \"stand up and tell\" defendant or \"look at the defendant\" and tell him that their verdict was death. Defendant contends this remark tended to pressure jurors to predecide the determination of penalty in favor of death and intimidate jurors who otherwise would be reluctant to choose the sentence of death, and implied that jurors should be concerned with the public manifestation of their decision as to penalty. Five of the prospective jurors who were questioned in this manner actually served on the jury or were alternates: Jurors McAlpine, Crouch, and Nolan, and alternate jurors Wheelock and Duarte.\n\nWe find no misconduct. By its choice of questions, the prosecution evidently sought to shed light upon the prospective jurors' views of capital punishment in order to enforce their appreciation of the gravity of the decision regarding a sentence of death. The prosecution's use of such phrases as \"look at the defendant\" was an acceptable means of impressing upon each prospective juror that the verdict of death would affect a real person who would be in the courtroom at that time, and sought to elicit whether, under these circumstances, the prospective juror nevertheless would be able to vote for death. The inquiry therefore was directed toward ascertaining whether each prospective juror's views concerning capital punishment would \" ' \" 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.' \" ' \" ( People v. Visciotti (1992) 2 Cal. 4th 1, 47, 825 P.2d 388.) Under this standard the prosecution's questions were proper, neither infecting the trial with unfairness nor misleading the jury as to the penalty determination process.\n\nDefendant further complains of several instances of asserted misconduct during the penalty phase. During presentation of the defense case, defendant's mother testified on direct examination concerning two photographs which she had in her possession depicting defendant as a youth. On cross-examination, the prosecution asked the witness whether she also had photographs of her son (defendant) at two years of age (the age of Katherine Silva) in order \"to show us how big he was at that age . . . how strong he was at two years old?\" Defendant complains the purpose of these questions was to inflame the jury by presenting to it the image of the two-year-old victim, which matter was outside the scope of, and irrelevant to, the direct examination. Because defendant did not object to the prosecutor's questions regarding the witness's possession of photographs of defendant at two years of age, the claim of error has not been preserved for review. In any event, even if the prosecutor's questions properly could have been challenged on relevance grounds, defendant has not demonstrated either that the posing of the questions constituted prosecutorial misconduct (see People v. Berryman, (supra) , 6 Cal. 4th 1048, 1072) or that the question was prejudicial. The prosecution's larger objective -- to ask defendant's mother whether her opinion that her son's life should be spared was affected by the circumstance that he was responsible for the death of a two-year-old child -- was a proper basis for cross-examination, and the question did not bring before the jury any new or improper information. Finally, even if we were to assume that the questions amounted to misconduct, a timely objection and admonition would have cured any error. (Ibid .)\n\nDefendant additionally asserts that several aspects of the prosecution's argument at the penalty phase were improper. He failed to object to any of these various instances of alleged misconduct or to request an admonition, however, and no circumstances that would create an exception to this requirement have been shown. Defendant therefore has waived this claim. ( People v. Berryman, supra, 6 Cal. 4th at p. 1072.)\n\nDefendant maintains his failure to object or to request an admonition was excused by the trial court's direction to both counsel to delay objections to the other party's argument until the completion of that argument. Defendant maintains this procedure precluded a timely curative admonition. We disagree. Although we express no opinion as to the advisability of the trial court's procedure governing the timing of objections, we conclude, with respect to the challenged remarks in the present case, that defendant has failed to demonstrate that a curative admonition made immediately following argument, if otherwise appropriate, would not have served its purpose.\n\nDefendant further contends he received ineffective assistance of counsel at the penalty phase. We apply the same standard in reviewing this claim as we do in our evaluation of defendant's claim of ineffective assistance of counsel at the guilt phase. (See People v . Mitcham, supra, 1 Cal. 4th at p. 1058.)\n\nDefendant argues that he was deprived of the effective assistance of counsel because of his attorney's failure to object and to request an admonition as to each challenged aspect of the prosecution's argument. The mere failure to object to prosecutorial argument, however, rarely establishes incompetence on the part of defense counsel in the absence of some explanation on the record for counsel's action or inaction. ( People v. Wharton (1993) 53 Cal. 3d 522, 567, 280 Cal. Rptr. 631, 809 P.2d 290; People v. Ghent (1987) 43 Cal. 3d 739, 772, 239 Cal. Rptr. 82, 739 P.2d 1250.) Defendant has failed to demonstrate that any exception to this rule applies in the present case.\n\nMoreover, with respect to all of the challenged comments \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e (considered in context, individually or together), we conclude no reasonable likelihood exists that the jury construed or applied any of the argument in an improper fashion. ( People v. Berryman, supra, 6 Cal. 4th at p. 1072.)\n\nDefendant next contends he was denied effective assistance because of remarks made by his attorney during the defense's penalty phase opening statement and argument that (according to defendant) amounted to a plea for sympathy for defense counsel personally rather than for defendant.\n\n\"The decision of how to argue to the jury after the presentation of evidence is inherently tactical\" ( People v . Freeman, supra, 8 Cal. 4th at p. 498), and there is a \"strong presumption\" that counsel's actions were sound trial strategy under the circumstances prevailing at trial. (Ibid.) Defendant first complains of counsel's remarks during opening statement that counsel had been devastated by the jury's verdict as to guilt and the special circumstances, and that defendant's life, \"as we know life to be, effectively ended when you came back with that last verdict.\" The trial court admonished counsel to forego comments on his personal reactions during opening statement. Shortly thereafter, counsel told the jury one of his fears in the case was that he might have said or done something during the guilt phase that offended the jury. The court again reprimanded counsel for the injection of his personal thoughts into the statement.\n\nRegardless whether the foregoing remarks constituted proper argument, they did not constitute deficient representation. The remark regarding the devastation experienced by defense counsel in light of the verdicts indicated that counsel continued to identify with defendant and his case, and could not reasonably have been construed by the jury in a manner prejudicial to defendant. By remarking that counsel feared he might have offended the jury, he indicated that perhaps he was to blame for the jury's verdicts against defendant, again demonstrating a belief in defendant's case that could not reasonably have been prejudicial to the defense.\n\nDefendant also criticizes several of the remarks made by defense counsel during closing argument. He cites counsel's statement that he felt honored to be arguing in favor of someone's life, but \"on the other hand, I just can't help but feel somewhat inadequate to do such an enormous task.\" Defense counsel apparently sought to convey to the jury that if by his argument he was unable to persuade it that the appropriate punishment was life imprisonment, the jury should not automatically assume the appropriate punishment was death, but only that counsel was inadequate for the task. There is no reasonable likelihood that the jury construed these remarks in a manner prejudicial to defendant.\n\nDefendant further complains of counsel's comment concerning \"impossible cases\" and observation that in such cases he had learned never to give up, because \"when you feel every ounce of strength in your heart has been given on the case, you reach down and you try to get a little more.\" Defense counsel then quoted Clarence Darrow regarding the death penalty, to the effect that the jury was faced with the task of balancing \"humane feeling against brutal feelings,\" and that a person who liked to see suffering out of righteous indignation would \"hold fast to capital punishment.\"\n\nContrary to defendant's assertion, these remarks do not suggest that counsel was seeking to elicit sympathy for himself because counsel felt he had had an impossible case. Counsel simply was being candid with the jury by acknowledging that the case was difficult, that he had given it everything he had, and that he would seek to give more. This line of argument implied there was more to give, i.e., there was additional matter favorable to the defense that would be presented to the jury, and did not imply merely that the jury should feel sorry for defense counsel. The argument did not demonstrate deficient performance.\n\nDefendant next complains counsel was ineffective in failing to present penalty phase expert testimony regarding mental disorders suffered by defendant at the time of the commission of the crimes. He claims that, although the trial court barred such evidence at the guilt phase, there was no impediment to presenting -- or tactical purpose in declining to present -- such evidence at the penalty phase. Defendant additionally complains that defense counsel acknowledged that the jury must have disbelieved the defense mental disorder evidence presented at the guilt phase. Finally, defendant complains of defense counsel's failure to explain to the jury that, in the event it was not persuaded by the evidence of defendant's mental disorders that defendant had been \"under the influence of extreme mental or emotional disturbance\" within the meaning of factor (d) of section 190.3, such evidence nevertheless remained available for consideration in mitigation under factor (k) of section 190.3.\n\nWith respect to each of the foregoing objections to defense counsel's performance, however, the record fails to demonstrate affirmatively that there was no rational tactical purpose for counsel's actions or omissions. With regard to counsel's failure to present additional evidence of defendant's mental condition at the time of the commission of the crimes, defendant has failed to establish on this record what additional evidence would have been presented. Moreover, defense counsel may well have determined that doing so would lead to reexamination of the details of the brutal murders of a mother and her two-year-old daughter, and thus may have decided as a reasonable tactical matter to avoid exposing the jury once again to this evidence.\n\nAdditionally, contrary to defendant's assertion, his counsel did not state that the jury must have disbelieved the defense expert testimony presented at the guilt phase. Rather, counsel simply acknowledged candidly that the thrust of his guilt phase argument had related to defendant's lack of intent to kill because of brain damage, and that the jury had \"rejected the brain damage totally, or felt that even if he had the brain damage, he still had the intent to kill.\" Counsel did not argue or concede that the jury had disbelieved testimony upon which he was asking it to rely at the penalty phase. The record establishes that defense counsel argued that a life sentence was appropriate because of defendant's extreme mental disorders, and in light of the trial court's instruction on section 190.3, factor (k) counsel reasonably may have determined that the jury adequately was informed that it could consider the mental health evidence in mitigation under factor (k).\n\n4. Denial of motion to modify death verdict\n\nDefendant contends he was denied a fair hearing on his motion for modification of the death verdict ( § 190.4, subd. (e)), because the trial court improperly considered evidence that was not presented to the jury, and denied the motion for reasons that included the Judge's \"personal political belief in the propriety of the death penalty\" instead of the requisite statutory factors, thus violating several of defendant's federal constitutional rights.\n\nOn June 23, 1988, after the jury had returned its verdict of death, the court heard argument on the defense application for modification of the death verdict. Defense counsel requested the court to consider in mitigation the circumstances, among others, that defendant had confessed to the crimes, his mental disorders, the early recognition (by a correctional official in 1982) of the need for treatment of defendant's mental disorders and the failure to provide such treatment, and defendant's ability to function well in prison. The prosecution argued as factors in aggravation the circumstances of the crimes, defendant's criminal history, his initial denial of any involvement in the crimes, and the jury's apparent rejection of his mental defect evidence. At the Conclusion of argument on this post-trial motion, the trial court stated that it would defer ruling on the motion until the sentencing hearing.\n\nAt the sentencing hearing on June 28, 1988, the court permitted the parties to summarize their arguments pertaining to the motion. The court also permitted, over defense objection, a private attorney representing Mr. Silva (as husband and father of the respective victims) to make a statement to the court on Mr. Silva's behalf, arguing that defendant's future dangerousness called for the death penalty.\n\nThe court ruled that the jury's verdict of death was supported by the evidence, citing the following factors, among others: (1) the overwhelming evidence supporting the finding that the charged special circumstances were true; (2) the viciousness and brutality of the crimes; (3) the circumstance that the victims had been bludgeoned to death in the course of defendant's commission of a burglary; (4) defendant's prior convictions of crimes involving savage violence against highly vulnerable female victims; (5) the finding that defendant's \"emotional disturbance at the time of the crimes was the product of his own willful criminal acts\" and does not appreciably mitigate the crimes; and (6) the Conclusion that \"the death penalty ultimately in a case such as this is the only fitting response by a civilized society for unspeakable crimes which could not properly be punished in any other way that this Court can imagine.\" The court accordingly denied the motion for modification.\n\nThe standards for implementation of subdivision (e) of section 190.4 are well established: \" 'In ruling on the application, the trial Judge must independently reweigh the evidence for aggravating and mitigating circumstances and determine whether, in the Judge's independent judgment, the weight of the evidence supports the jury verdict.' \" ( People v. Memro, supra, 11 Cal. 4th at p. 884.) The Judge also must state on the record the reasons for the ruling, and on appeal we subject the ruling to independent review. \" ' \"Of course, when we conduct such scrutiny, we simply review the trial court's determination after independently considering the record; we do not make a de novo determination of penalty.\" ' \" (Ibid.)\n\nDefendant first contends the trial court improperly considered defendant's probation report (the record indicates that the trial court read the probation report prior to the hearings on the modification motion), as well as the statement by the attorney on behalf of Mr. Silva, both of which contained evidence that had not been presented to the jury. Because of defendant's failure to object to the trial court's consideration of these matters (counsel did not object to the statement itself, but only to its presentation by a private attorney rather than by the prosecution or Mr. Silva), his claim must be deemed waived. ( People v . Hill (1992) 3 Cal. 4th 959, 1013, 839 P.2d 984.) Moreover, the claim has no merit. The record fails to demonstrate that the trial court relied upon any information contained in the probation report or upon any circumstance mentioned in the victim impact statement made on behalf of Mr. Silva that had not been presented to the jury. Absent a contrary indication in the record, we must assume the trial court properly set aside, and was not influenced by, any extraneous material contained in the probation report ( People v . Memro, supra, 11 Cal. 4th at p. 886; People v. Medina (1995) 11 Cal. 4th 694, 784, 906 P.2d 2). Similarly, because the statement of reasons given by the trial court in support of its ruling denying modification indicates that the victim impact statement played no role whatsoever in the court's decision, any error by the court in permitting the statement to be made was harmless. (See People v . Howard, supra, 1 Cal. 4th at p. 1194; People v . Frank (1990) 51 Cal. 3d 718, 741-742, 274 Cal. Rptr. 372, 798 P.2d 1215.)\n\nWe also reject defendant's contention that the trial court erred in denying the motion for modification by failing to consider all mitigating evidence presented by the defense. The trial court's mere failure to mention expressly all evidence presented in mitigation (such as the evidence of the impact of a death verdict upon defendant's family) does not mean the trial court ignored or overlooked such evidence, but simply indicates that the court did not consider such evidence to have appreciable mitigating weight. (See People v . Clark, (supra) , 5 Cal. 4th at p. 1038.)\n\nDefendant additionally complains that two of the reasons stated in support of denial of the motion were identical and improperly duplicative -- the overwhelming evidence of the special circumstances and the fact that the killings occurred in the course of a burglary. This claim has no merit. The two factors recited were distinguishable -- the first characterizing the weight of the evidence of the special circumstances, and the second describing the circumstances of the crime -- and both appropriately were considered in aggravation under section 190.3, factor (a).\n\nDefendant next contends there was no evidence to support the court's statement that defendant's \"emotional disturbance\" was \"the product of his own willful criminal acts.\" To the contrary, substantial evidence presented by the defense supported this factor. The defense expert witnesses testified that defendant suffered from brain damage of a type that would cause overreaction or \"rage reaction\" in novel or stressful situations, and would cause defendant to perceive the need for \"fight or flight.\" One of the experts also testified that the brain damage and mental disorder of the nature suffered by defendant would cause a person to exhibit emotional explosiveness when frightened, rendering the individual more likely to become locked into aggressive behavior once having commenced such behavior. By its statement, the court reasoned that by committing a residential burglary, defendant had placed himself in the circumstance of possibly being caught inside the victims' home, which in turn brought on his emotional disturbance. In other words, the trial court simply reasoned that had defendant not chosen to commit the burglary, he would not have found himself in a situation that triggered his mental disorders.\n\nDefendant next asserts the court's final remarks (that the death penalty in this case was \"the only fitting response by a civilized society for unspeakable crimes . . . .\") indicate that the trial Judge improperly relied upon his own personal political beliefs. To the contrary, the statement simply conveyed the court's view of the appropriateness of the jury's verdict, in light of the evidence presented of defendant's currently charged and past crimes, confirmed by the court's earlier remarks that the aggravating circumstances \"vastly outweigh the mitigating circumstances, in my conscientious opinion.\" The record does not establish a failure to exercise appropriate discretion.\n\nDefendant finally complains that the trial court improperly preJudged the determination of the appropriate penalty prior to hearing argument by counsel, citing various comments made by the trial court at different stages of the trial (prior to commencement of and during the penalty phase proceedings), relating to the scheduling of sentencing proceedings and the imposition of an alternative determinate sentence. For example, at the Conclusion of argument on the modification motion, the court queried whether, hypothetically, if the death penalty were affirmed, there was any need to impose the alternative applicable determinate sentences. The remarks, however, simply reflect the trial court's conscientious effort to foresee and prepare for all eventualities affecting the imposition of sentence, and do not suggest that any improper consideration influenced its decision denying the motion to modify the death verdict.\n\n5. Claim that the three-strikes law supersedes the death penalty law\n\nDefendant contends that California's death penalty law has been superseded by the three strikes sentencing scheme embodied in section 667, subdivisions (b) through (i) (effective March 7, 1994), with respect to all persons such as defendant who, but for the date of their crimes, would be subject to sentencing under that scheme (because of having suffered one or more prior serious or violent felony convictions). Defendant relies upon the language in the three strikes scheme providing that \"notwithstanding any other law,\" the three strikes sentencing scheme is applicable if a defendant has been convicted of a felony and it has been pleaded and proved that the defendant has one or more prior felony convictions as defined therein. ( § 667, subd. (c).) Defendant maintains that the court is required to apply retroactively the three strikes scheme (which assertedly constitutes a change in the law that is beneficial to him), and accordingly must vacate his sentence of death and impose the term prescribed under the three strikes law.\n\nWe previously have rejected this identical claim in People v. Alvarez (1996) 14 Cal. 4th 155, 926 P.2d 365 (see also People v. Williams (1995) 40 Cal. App. 4th 446, 457-458), and defendant presents no persuasive reason that would cause us to reconsider our previous holding.\n\n6. Claim that California's capital sentencing scheme violates the federal Constitution\n\nIn a series of abbreviated arguments, defendant contends numerous features of this state's capital sentencing scheme violate the federal Constitution, thus requiring that his death sentence be set aside. This court previously has rejected similar challenges to California's death sentencing scheme, however, and defendant fails to present any persuasive reasoning that would cause us to reconsider our holdings. Thus, the jury need not be instructed as to which sentencing factors are aggravating and which are mitigating ( People v. Davenport (1995) 11 Cal. 4th 1171, 1229, 906 P.2d 1068), make written findings of aggravating factors ( People v. Sanchez (1995) 12 Cal. 4th 1, 82, 906 P.2d 1129), find any aggravating factor (other than unadjudicated criminal activity) true beyond a reasonable doubt, find beyond a reasonable doubt that the aggravating factors outweigh the mitigating factors, or find beyond a reasonable doubt that death is the appropriate penalty. (See People v. Sanchez, supra, 12 Cal. 4th at pp. 80-81; People v. Stanley (1995) 10 Cal. 4th 764, 842, 897 P.2d 481; People v. Crittenden, supra, 9 Cal. 4th at p. 153.) Additionally no requirement exists that the jury be instructed that mitigating factors need not be proved beyond a reasonable doubt or that unanimity is not necessary for consideration of mitigating evidence ( People v. Breaux, (supra) , 1 Cal. 4th at pp. 314-315). We also have rejected similar challenges to the lack of intercase proportionality review ( People v. Stanley, (supra) , 10 Cal. 4th at p. 842), the introduction of evidence of facts underlying the prior offenses ( People v. Johnson, supra, 6 Cal. 4th at pp. 51-52), the use of adjectives such as \"extreme\" (in section 190.3, factors (d) and (g)) and \"substantial\" (in section 190.3, factor (g)) ( People v. Sanchez, supra, 12 Cal. 4th at p. 80; People v. Davenport, supra, 11 Cal. 4th at p. 1230), the failure to instruct on the definition of mitigation ( People v. Johnson, supra, 6 Cal. 4th at p. 50), the prosecution's unfettered discretion to determine whether to seek the death penalty in a particular case ( People v. Stanley, (supra) , 10 Cal. 4th at p. 842 [prosecution's exercise of discretion in charging a capital case does not violate the federal Constitution]), and the lack of an instruction specifying that a sentence of life imprisonment without possibility of parole means that the defendant never will be considered for parole ( People v. Memro, supra, 11 Cal. 4th at p. 887).\n\nWe reject defendant's additional claim relating to asserted improper reliance upon unadjudicated criminal activity in aggravation. Although defendant fails to identify the challenged \"unadjudicated criminal activity,\" presumably he refers to the previously unadjudicated sodomy incident involving Berta Lou Raymond (ante, p. 12) and the previously unadjudicated assault with intent to commit rape incident involving Elvira R. (ante, p. 13). We have long held that a jury may consider such evidence in aggravation if it finds beyond a reasonable doubt that the defendant did in fact commit such criminal acts. ( People v. Robertson (1982) 33 Cal. 3d 21, 53-55, 188 Cal. Rptr. 77, 655 P.2d 279.) The jury was so instructed here. We have also long held that introduction of such evidence under section 190.3, factor (b), does not offend the federal Constitution. ( People v. Balderas (1985) 41 Cal. 3d 144, 204-205, 222 Cal. Rptr. 184, 711 P.2d 480.) There was no error.\n\nWe reject defendant's intracase proportionality claim, because defendant's sentence of death is not disproportionate to his personal culpability in light of the evidence that defendant brutally bludgeoned to death a helpless mother and her two-year-old child, acts wholly unnecessary to his escape from the victims' residence, and his history of assaulting vulnerable female victims, including the rape and sodomy of a multiple sclerosis victim. This evidence, far outweighing the mitigating circumstances, refutes defendant's contention that his death sentence was disproportionate. (See People v. Crittenden, supra, 9 Cal. 4th at p. 157.)\n\nFinally, defendant contends the California 1978 death penalty law violates the proscription of the Eighth Amendment to the federal Constitution against cruel and unusual punishment, because the law's special circumstances assertedly fail to narrow sufficiently the class of defendants who are death eligible; as a consequence, argues defendant, all defendants who are found guilty of first degree murder qualify for the death penalty. We previously have rejected identical contentions (see People v. Ray (1996) 13 Cal. 4th 313, 356-357, 914 P.2d 846; People v. Crittenden, supra, 9 Cal. 4th at p. 156) [\"the death-eligibility component of California's capital punishment law does not exceed constitutional bounds\"]; People v. Wader (1993) 5 Cal. 4th 610, 669, 854 P.2d 80 [defendant has not demonstrated \"through sources of which we might take judicial notice, that his claims are empirically accurate, or that, if they were correct, this would require the invalidation of the death penalty law\"]), and defendant fails to present any evidence or argument that would cause us to reconsider our previous holdings.\n\n7. Claim that the method of execution constitutes cruel and unusual punishment\n\nSection 3604, subdivision (b), as amended in 1996, permits an election by persons sentenced to death to have the punishment imposed either by lethal gas or lethal injection. Defendant contends that both methods of execution provided for in section 3604 constitute cruel and unusual punishment in violation of the Eighth Amendment to the federal Constitution, citing in support of this claim Fierro v. Gomez (N.D.Cal. 1994) 865 F. Supp. 1387, affirmed sub nomine Gomez v. Fierro (9th Cir. 1996) 77 F.3d 301, 309. In Fierro, the district court held that former section 3604, \"to the extent that it requires or permits the imposition of death by administration of lethal gas, violates the eighth and fourteenth amendments of the United States Constitution,\" and enjoined the state from employing lethal gas to execute any California death row inmate. ( Fierro v. Gomez, supra, 865 F. Supp. at p. 1415.) The United States Supreme Court, however, recently granted certiorari in Fierro, vacated the judgment, and remanded the case to the Ninth Circuit \"for further consideration in light of . . . [section] 3604.\" ( Gomez v. Fierro (1996) U.S. [136 L. Ed. 2d 204], 117 S. Ct. 285.) The district court's holding in Fierro therefore is not dispositive of any aspect of defendant's current claim.\n\nDefendant asserts that death by lethal injection, the alternative to death by lethal gas under section 3604, constitutes cruel and unusual punishment. Defendant, however, neither cites legal authority, nor identifies any portion of the record on appeal, in support of his contention. \" 'In any event, the claim must be rejected out of hand as a ground for reversal of the judgment of death. It bears solely on the legality of the execution of the sentence and not on the validity of the sentence itself.' \" ( People v. Bradford (1997) 14 Cal. 4th 1005, 1059, 929 P.2d 544, quoting People v. Berryman, (supra) , 6 Cal. 4th 1048, 1110.)\n\n8. Claim that the death penalty is cruel and unusual punishment\n\nDefendant requests that this court reevaluate the constitutionality of the death penalty under the Eighth Amendment to the federal Constitution and hold that under all circumstances, imposition of the death penalty constitutes cruel and unusual punishment. The United States Supreme Court, in Gregg v. Georgia (1976) 428 U.S. 153, 169, 49 L. Ed. 2d 859, 96 S. Ct. 2909, held that the punishment of death for the crime of murder did not under all circumstances violate the Eighth or Fourteenth Amendments of the federal Constitution and was not \" per se \" cruel and unusual punishment. Gregg is dispositive of defendant's federal constitutional claim, which accordingly must be rejected.\n\nIII. Disposition\n\nThe judgment is affirmed in its entirety.\n\nGEORGE, C.J.\n\nWE CONCUR:\n\nMOSK, J.\n\nKENNARD, J.\n\nBAXTER, J.\n\nWERDEGAR, J.\n\nCHIN, J.\n\nBROWN, J.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Officer Jordan did not specify in his testimony that during the course of the Miranda warning he advised defendant that defendant's statements could be used against him \"in court.\" The transcript of the tape recording of a second interview with defendant, however, at which the officer read to defendant his Miranda rights from the same admonition card, reflects that Officer Jordan specifically advised defendant on this occasion that his statements could be used against him \"in court.\" Additionally, at the preliminary hearing, Officer Jordan testified that he included the words \"in court\" when he read the Miranda rights to defendant from the card.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The parties stipulated at trial that testing actually revealed that none of the hairs recovered from the crime scene matched defendant's hair.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Although prospective juror Bridy described (in her written questionnaire) the death penalty as a necessary deterrent, upon questioning by the trial court she stated that she personally would be unable to vote for death (\"No, I couldn't do it . . . . I don't think, at least the person I am right now could not do it.\") In excusing her for cause, the trial court remarked that it appeared Ms. Bridy's words and face \"conveyed a very strong conviction that there was no case on the face of the earth where she could vote for the death penalty.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Evidence Code section 1043 provides in part: \"(a) In any case in which discovery or disclosure is sought of peace officer personnel records . . ., the party seeking the discovery or disclosure shall file a written motion with the appropriate court . . . . (b) The motion shall include all of the following: . . . (2) A description of the type of records or information sought. (3) Affidavits showing good cause for the discovery or disclosure sought, setting forth the materiality thereof to the subject matter involved in the pending litigation and stating upon reasonable belief that the governmental agency identified has the records or information from the records. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Evidence Code section 1045 provides in part: \"(a) Nothing in this article shall be construed to affect the right of access to records of complaints, or investigations of complaints, or discipline imposed as a result of such investigations, concerning an event or transaction in which the peace officer participated, or which he perceived, and pertaining to the manner in which he performed his duties, provided that such information is relevant to the subject matter involved in the pending litigation. (b) In determining relevance the court shall examine the information in chambers in conformity with Section 915, and shall exclude from disclosure: (1) Information consisting of complaints concerning conduct occurring more than five years before the event or transaction which is the subject of the litigation in aid of which discovery or disclosure is sought. (2) In any criminal proceeding the Conclusions of any officer investigating a complaint filed pursuant to Section 832.5 of the Penal Code. (3) Facts sought to be disclosed which are so remote as to make disclosure of little or no practical benefit.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant also sought personnel records pertaining to investigations or disciplinary actions involving the officers for \"any acts or omissions of dishonesty, violations of law or departmental policy, violations of trust placed in them by superiors in the department or any other improper act committed while a member of the homicide unit or other detective division which may reflect on the officers' character for honesty or credibility, their custom or habit for following the law and/or departmental rules and regulations in their training and experience investigating crimes, arresting and handling witnesses and suspects, interrogating or interviewing witnesses and/or suspects.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. CALJIC No. 4.21 presently states in part: \"In the crimes of ___ . . . of which the defendant is accused in Counts ___, a necessary element is the existence in the mind of the defendant of the [specific intent to _____ [mental states of ____. If the evidence shows that the defendant was intoxicated at the time of the alleged crime, you should consider that fact in determining whether defendant had such [specific intent] [mental state].\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendant asserts in his reply brief that trial counsel for defendant \"made mention several times of the court's ruling on the section 28 issue and defense counsel's reliance thereon. [Citations.]\" Defendant suggests the trial court had a sua sponte duty to \"correct\" the purported misapprehension of defense counsel, by reminding counsel that the court had not ruled on the motion, and that in failing to do so, the trial court misled defendant to his prejudice. We find no support for defendant's premise: The proffered record citations do not sustain this assertion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Following the preliminary hearing in that proceeding, defendant pleaded guilty to the charges of burglary and rape.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Section 1335, subdivision (a), provides: \"When a defendant has been charged with a public offense triable in any court, he or she in all cases, and the people in cases other than those for which the punishment may be death, may, if the defendant has been fully informed of his or her right to counsel as provided by law, have witnesses examined conditionally in his or her or their behalf, as prescribed in this chapter.\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defendant complains the prosecution \"misstated the legal definition of aggravating factors by including elements of the crime as separate factors.\" The record does not support this claim. Although the prosecution described in detail each aspect of the crimes, contrary to defendant's implication it did not define the elements of the crimes as separate factors in aggravation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDefendant also complains of numerous aspects of the prosecution's argument, as follows: (1) the comment that during the jury selection process, at the moment the jurors first saw the crime scene photographs, they must have known they would be involved in the penalty determination process; (2) the comments that defendant had been released from prison shortly before his commission of the crimes, had lied to the police, and had watched Mr. Silva being taken away from the crime scene as a suspect; (3) the comment that at the Conclusion of defendant's interviews with the police, defendant had inquired whether he would obtain anything in exchange for his confession, thus demonstrating a lack of remorse; (4) the comment that the jury could not consider in mitigation any sympathy for defendant's family; (5) the comment that \"we are certain who did it. We are certain who killed those two people\"; (6) the prosecution's delineation of defendant's prior convictions as both prior violent activity and as prior felony convictions; (7) the criticism of defendant's mental defect evidence as \"bogus\"; (8) the request that the jury view the case through the victims' eyes; and (9) the remark the victims no longer would be able to have photographs taken of them.\u003c/span\u003e\n\n",
    "body_length": 152139,
    "citedas": [
      "15 Cal.4th 795",
      "16 Cal.4th 825A",
      "938 P.2d 2",
      "64 Cal.Rptr.2d 400"
    ],
    "attorneys": "Attorneys for Appellant: Susan D. Shors, under appointment by the Supreme Court, for Defendant and Appellant. Attorneys for Respondent: Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Gary W. Schons, Assistant Atttorney General, Holly D. Wilkens, William M. Wood and John T. Swan, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "George, C.j. WE Concur: Mosk, J. Kennard, J. Baxter, J. Werdegar, J. Chin, J. Brown, J.",
    "citation_count": 1076
  }
}
