{
  "id": "fYH0PWYBTlTomsSBu3e1",
  "document": {
    "title": "Rappa v. New Castle County",
    "full_title": "DANIEL D. RAPPA, SR. v. NEW CASTLE COUNTY; DENNIS E. GREENHOUSE; ROBERT W. O'BRIEN; JOHN C. CARNEY, JR.; MARK A. KLEINSCHMIDT; WILLIAM S. MCINTYRE ; DANIEL D. RAPPA, SR. V. STATE OF DELAWARE; DEPARTMENT OF TRANSPORTATION OF THE STATE OF DELAWARE; KERMIT H. JUSTICE*FN* ANN CANBY, SECRETARY, IN HER OFFICIAL CAPACITY AND KERMIT H. JUSTICE IN HIS INDIVIDUAL CAPACITY",
    "jurisdiction": "Third Circuit",
    "date": "1994-03-11T00:00:00.000Z",
    "docket": "No. 92-7282, No. 92-7293",
    "body": "TABLE OF CONTENTS\n\nI. FACTUAL AND PROCEDURAL BACKGROUND\n\nII. THE DELAWARE STATUTORY SCHEME\n\nIII. CONTENT NEUTRALITY\n\nA. Introduction\n\nB. The Metromedia Plurality\n\nC. Analyzing Plurality Opinions -- Doubts Cast by the Metromedia Concurrence and Dissents\n\nD. Applicability of the Result in Metromedia\n\nIV. CONTENT DISCRIMINATION REVISITED\n\nA. A New Test\n\nB. Application of the Test\n\nC. Summary\n\nV. SECONDARY EFFECTS\n\nVI. PUBLIC FORUM ANALYSIS\n\nVII. SEVERABILITY\n\nVIII. TIME, PLACE AND MANNER\n\nIX. QUALIFIED IMMUNITY\n\nA. Qualified Immunity of Defendant Justice\n\nB. Qualified Immunity of the Individual County Defendants\n\nX. CONCLUSION\n\nOpinion OF THE COURT\n\nBECKER, Circuit Judge.\n\nIn 1990, plaintiff Daniel Rappa sought the Democratic nomination for Delaware's seat in the United States House of Representatives in a primary election contest which pitted him against the incumbent, Thomas Carper. Rappa was a businessman who had not held public office and had little public name recognition. In an effort to achieve it, he placed a large number of signs along Delaware's roadways, only to have many of them peremptorily removed by state and local authorities on the grounds that they were in violation of laws and ordinances enacted by the State of Delaware (\"the State\"), the County of New Castle (\"the County\"), and the City of Wilmington (\"the City\"). Although Rappa's signs were barred, a number of other types of signs, such as \"for sale\" signs and highway beautification signs were permitted. Particularly noteworthy is the fact that the state statute, \"Chapter 11,\" allows signs advertising local industries, meetings, buildings historical markers and attractions. See Del. Code Ann. tit. 17, § 1114(6).\n\nRappa brought suit in the District Court for the District of Delaware challenging these regulatory schemes on First Amendment grounds. After discovery and the submission of extensive affidavits, the district court granted partial summary judgment, holding that the Delaware statute and the New Castle County ordinance were facially unconstitutional under the First and Fourteenth Amendments to the Constitution because they impermissibly restricted speech on the basis of content. The court issued an injunction requiring the state and county defendants to permit political signs to the same extent that commercial or other non-political signs were allowed.\n\nMuch of the case against the City of Wilmington remained unresolved but Rappa and the City settled, and the City's appeal of certain aspects of the district court's decision was therefore dismissed. The appeals of the County and various state and county officials remain, however, and impose on us the difficult task of determining the current state of First Amendment law pertaining to outdoor signs. The district court believed that the Supreme Court's leading pronouncement in the area, Metromedia, Inc. v. San Diego, 453 U.S. 490, 101 S. Ct. 2882, 69 L. Ed. 2d 800 (1981) was controlling, but we think that it has little precedential effect. Metromedia was a badly splintered plurality opinion which has arguably been undermined by the recent decision in Cincinnati v. Discovery Network, 123 L. Ed. 2d 99, 113 S. Ct. 1505 (1993). Although our analysis differs significantly from that of the district court, we nonetheless conclude that the Delaware regulation is sufficiently content-based that a significant part of it is unconstitutional.\n\nBased on the principles underlying the First Amendment, we conclude that statutes aimed at a legitimate end unrelated to the suppression of speech but which nonetheless restrict speech in a certain locality may constitutionally contain content-based exceptions as long as the content exempted from restriction is significantly related to the particular area in which the sign is viewed -- for example, a sign identifying the property on which it sits as a restaurant, or a sign alongside a highway which tells drivers how to reach a nearby city. Such exceptions must also be substantially related to advancing an important state interest that is at least as important as the overall goal advanced by the underlying regulation, be no broader than necessary to advance the special interest, and be narrowly drawn so as to impinge as little as possible on the overall goal. Although under this approach some content-based exceptions will pass constitutional muster, the exception in Chapter 11 relating to signs advertising local industries, meetings, buildings, historical markers and attractions, Del. Code Ann. Title 17 § 1114(6), fails the test. As a result, Chapter 11 is facially unconstitutional.\n\nOur finding that Chapter 11 is unconstitutional does not end the matter, however; that is because we find that certain aspects of the state regulatory scheme are not impermissibly content-based, at least absent the development of facts showing these fail the substantial state interest prong of the constitutional test. The injunction must therefore be modified accordingly. However, after the development of more facts, the plaintiff will, on remand, have the opportunity to attack these provisions as content-based and as unconstitutional time, place, and manner restrictions which do not pass constitutional muster.\n\nWe decline to reach Rappa's contention that the statute is unconstitutionally vague because of the uncertainty of the location of the right of way, from which the placement of signs is to be measured to determine their lawfulness, and Rappa's argument that the defendants violated his procedural due process rights by the manner in which they removed his signs; the record is insufficiently developed for us to make these determinations. We do, however, note our agreement with the district court that the secondary effects doctrine, explicated in Renton v. Playtime Theatres, 475 U.S. 41, 106 S. Ct. 925, 89 L. Ed. 2d 29 (1986), does not save the offending statute and ordinance, for we do not think that the secondary effects of the signs forbidden by the provisions are more harmful than the secondary effects of the signs permitted by the provisions.\n\nWe must also confront the individual defendants' appeals from the district court's denial of their motions for summary judgment which were based on their assertions of qualified immunity from damage claims. We note in this regard that while the County has not appealed the district court's decision concerning the constitutionality of its ordinance, we have had to take it into account with respect to the qualified immunity issue. See Brown v. Grabowski, 922 F.2d 1097, 1105 (3d Cir. 1990). We conclude that officials in the position of these individual defendants reasonably could have concluded, based on the existing case law, that the relevant sections of the state law and the county ordinance were facially constitutional. Accordingly, we will reverse the district court's denial of summary judgment to the individual defendants and remand with direction to enter summary judgment in their favor on the claims for damages, to the extent that they are based on the facial unconstitutionality of the respective regulations.\n\nI. FACTUAL AND PROCEDURAL BACKGROUND\n\nThese suits were precipitated by events surrounding plaintiff Daniel Rappa's campaign for the 1990 Democratic nomination for Delaware's lone seat in the United States House of Representatives against then Representative Thomas Carper, who is now Governor of Delaware. As Rappa explained, he had been a successful businessman and a long time supporter of and contributor to the Democratic Party in Delaware but had never before sought public office. On July 26, 1990, Rappa declared his candidacy for the House seat and began actively campaigning in preparation for the September 8, 1990 primary election. Because Carper was an established incumbent, Rappa's campaign strategy was dependent upon his ability to establish name recognition in the short period before the primary election. In order to establish it, Rappa attempted to blanket Delaware with campaign signs. He placed signs at various locations along roadsides throughout the state, including the following: (1) on the private property of supporters within twenty-five feet of the public right-of-way; (2) on the rights-of-way abutting the private property of supporters; and (3) on the rights-of-way adjacent to sidewalks or public thoroughfares.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e However, in the period between July 26 and September 8, 1990, many of these signs were removed by employees of the Delaware Department of Transportation (\"DelDOT\"), employees of New Castle County, and employees of the City of Wilmington.\n\nShortly after his defeat in the Democratic primary, Rappa filed three civil rights suits under 42 U.S.C. § 1983 in the District Court for the District of Delaware. In these suits, he challenged the constitutionality of the respective statutes and ordinances enacted by the State of Delaware, New Castle County, and the City of Wilmington to regulate the posting of outdoor signs, including political campaign signs. Rappa challenged the statutes and ordinances under the First and Fourteenth Amendments on both facial and as applied grounds, and sought declaratory relief, injunctive relief, damages, and attorneys' fees.\n\nIn the first of the three cases, Rappa sued New Castle County and various county officials, both individually and in their official capacities.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In the second case, Rappa named as defendants the State of Delaware, DelDOT, and Secretary of Transportation Kermit Justice, both individually and in his official capacity. The State and DelDOT were subsequently dismissed on Eleventh Amendment grounds. Additionally, since Justice was subsequently replaced by Mark McNulty as Secretary of Transportation, McNulty was substituted for Justice, in his official capacity, under Fed. R. App. P. 43(c)(1). Justice, however, still remains a defendant in his individual capacity.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In the third case, Rappa sued the City of Wilmington; Daniel Frawley, individually and in his official capacity as Mayor; Paul Ignudo, individually and in his official capacity as Commissioner of the Department of Licenses and Inspections; and James Dipinto, individually and in his official capacity as Zoning Administrator.\n\nThe district court consolidated the three cases and, after (limited) discovery, the parties filed cross-motions for summary judgment. Confining its consideration to the facial constitutionality of Chapter 11 and the county and city ordinances, the district court held that the Delaware statute and the New Castle County ordinance were both facially unconstitutional under the First and Fourteenth Amendments because they impermissibly regulated speech on the basis of its content. More specifically, the court analyzed the statute and ordinance according to its reading of the standard announced by a plurality in Metromedia, see Rappa v. New Castle County, 813 F. Supp. 1074, 1079-80 (1992), and concluded that both the county and state restrictions ran afoul of the First Amendment by favoring commercial over noncommercial speech and by discriminating in favor of some types of noncommercial speech over others. Id. at 1080.\n\nThe court rejected the argument of the state and county defendants that the respective regulations were content-neutral under an application of the secondary effects doctrine announced in Renton v. Playtime Theatres, 475 U.S. 41, 106 S. Ct. 925, 89 L. Ed. 2d 29 (1986). See Rappa, 813 F. Supp. at 1080-81. The district court believed that the secondary effects doctrine had never been applied outside of \"the limited context of zoning ordinances directed at businesses purveying sexually explicit materials,\" and that it should not be extended to political speech, for \"when state action affects political speech it trenches upon an area in which the importance of First Amendment protections is 'at its zenith.'\" Id. at 1081 (internal quotation marks and citation omitted). To correct these constitutional infirmities, the court entered an injunction generally requiring the state and county defendants to permit political signs to the same extent that commercial or other noncommercial signs are allowed. Id. at 1082-83.\n\nThe court concluded that the Wilmington ordinance survived the initial facial challenge, but allowed the case to continue for determinations of whether the ordinance was a valid time, place, and manner restriction and whether it had been applied in a discriminatory manner. Id. at 1081. The court also denied the motions for summary judgment made by the individual defendants in all three cases, which were based on their assertions of qualified immunity as to the claim of facial unconstitutionality. Id. at 1082. All the defendants and Rappa filed timely appeals. Prior to oral argument, however, Rappa and the City settled.\n\nThe state defendants have appealed both the district court's injunction, which was based on the court's holding that the Delaware statute was facially unconstitutional, and the court's refusal to grant qualified immunity to defendant Justice. The state defendants advance a number of arguments as to why the district court erred in finding the relevant enactments unconstitutional. Primarily their argument is that the statute is a valid, content-neutral time, place and manner regulation.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The county defendants have chosen not to press their arguments as to the constitutionality of the county ordinance on this appeal, deferring them until a later stage. With respect to the denial of summary judgment, the individual defendants argue that they were entitled to qualified immunity because the facial unconstitutionality of Chapter 11 and the New Castle ordinance was not clearly established at the time of the primary election. The district court's jurisdiction was based on 28 U.S.C. §§ 1331, 1343(3), 2201, and 2202. We have jurisdiction over the appeal from the district court's injunction pursuant to 28 U.S.C. § 1292(a)(1). See Hershey Foods Corp. v. Hershey Creamery Co., 945 F.2d 1272, 1276-79 (3d Cir. 1991); Cohen v. Board of Trustees, 867 F.2d 1455, 1463-68 (3d Cir. 1989) (in banc). We have jurisdiction over the district court's denial of the individual defendants' motions for summary judgment on grounds of qualified immunity under 28 U.S.C. 1291; a decision denying a claim of qualified immunity based on a question of law is a final decision under the collateral order doctrine. Mitchell v. Forsyth, 472 U.S. 511, 530, 105 S. Ct. 2806, 2817, 86 L. Ed. 2d 411 (1985); Brown v. Grabowski, 922 F.2d 1097, 1105 (3d Cir. 1990). The district court's decisions were made pursuant to motions for (partial) summary judgment, hence we exercise plenary review, applying the same standard the district court was to have applied in the first instance. Kreimer v. Bureau of Police, 958 F.2d 1242, 1250 (3d Cir. 1992).\n\nII. THE DELAWARE STATUTORY SCHEME\n\nThe case against the state defendants centers on the constitutionality of Chapter 11 of Title 17 of the Delaware Code,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Del. Code Ann. tit. 17, §§ 1101-31. Chapter 11, entitled \"Regulation of Outdoor Advertising,\" contains three subchapters, each of which covers a different, though sometimes overlapping, portion of the road system. The stated purpose of Chapter 11 is to promote the general welfare by ensuring full receipt of federal highway funds (which requires compliance with the Federal Highway Beautification Act, 23 U.S.C. § 131 (\"HBA\"), promoting aesthetic values, and promoting driving safety.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Del. Code Ann. tit. 17, § 1101. We will describe each of the subchapters in turn.\n\nSubchapter I has the greatest regulatory scope, covering all \"outdoor advertising\" along \"any state highway,\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e except for outdoor advertising that is located both within the corporate limits of an incorporated town or city and is not within a \"controlled area\" within these towns or cities.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e \"Outdoor advertising\" is itself defined very broadly:\n\n\"Outdoor advertising\" or \"outdoor advertising signs, displays and devices\" shall include any outdoor sign, display, device, picture, emblem, trademark, figure, painting, drawing, message, placard, poster, billboard, light or other thing which is designed, intended or used to advertise, to inform or to attract the attention of the traveling public, which is within 660 feet and visible or beyond 660 feet and visible and erected with the purpose of being read from the main traveled way of any state highway.\n\nDel. Code Ann. tit. 17, § 1102(b)(1).\n\nThe key provisions of Subchapter I, at least for the present appeal, are sections 1108 and 1114, which describe the areas from which signs are prohibited and the specific types of signs that are exempted from these general prohibitions. Section 1108(a) prohibits the posting of signs \"within 25 feet of the right-of-way line of any public highway if visible from any portion of the same.\" Del Code Ann. tit. 17, § 1108(a). Additionally, section 1108(b) prohibits, in relevant part, signs placed \"on the right-of-way of any public highways.\" Del. Code Ann tit. 17, § 1108(b)(1).\n\nThus, Subchapter I prohibits all signs in the right-of-way and within 25 feet of the right-of-way of any state highway (other than those that are both outside of a controlled area and inside of the corporate limits of an incorporated town or city). These general prohibitions, in turn, are limited by a series of often overlapping exceptions set out in sections 1108(c), 1108(d), and 1114. These exceptions are as follows:\n\n(1) Directional or warning signs and official signs or notices are allowed within the restricted zones. Del. Code Ann. tit. 17, §§ 1108(a), 1108(b), 1114(4).\n\n(2) Signs advertising the sale or lease of the real property on which they are located are allowed. Del. Code Ann. tit. 17, §§ 1108(c), 1114(2).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n(3) Signs advertising activities conducted on the real property may be posted on that real property. Del. Code Ann. tit. 17, §§ 1108(c), 1114(1).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n(4) Signs that the State Department of Public Instruction has approved may be displayed on school bus waiting shelters. Del. Code Ann. tit. 17, § 1108(c).\n\n(5) \"Beautification/landscape planting sponsorship signs\" are allowed in rights-of-way, as long as they meet the approval and construction requirements of the section. Del. Code Ann. tit. 17, § 1108(d).\n\n(6) Notices or advertisements required by law in any legal proceeding or put upon the property by a public authority are allowed within the restricted zones. Del. Code Ann. tit. 17, § 1114(3).\n\n(7) Danger and precautionary signs that relate to the premises are allowed within the restricted zones. Del. Code Ann. tit. 17, § 1114(4).\n\n(8) Signs or notices of a railroad, other transportation, transmission, or communication company that are necessary for the direction, information, or safety of the public are allowed within the restricted zones. Del. Code Ann. tit. 17, § 1114(5).\n\n(9) Signs announcing a town, village, or city and advertising itself or its local industries, meetings, buildings, historical markers, or attractions are allowed within the restricted zones, as long as the signs are no larger than 6 square feet and are maintained at public expense. Del. Code Ann. tit. 17, § 1114(6).\n\nSubchapter II, Del. Code Ann. tit. 17, §§ 1121-26, is a direct response to the HBA. Most relevantly, the HBA requires states, upon penalty of losing ten percent of federal highway funds, to restrict along interstate highways and the state's \"primary system\" outdoor advertising that is \"within six hundred and sixty feet of the nearest edge of the right-of-way and visible from the main traveled way\" or \"more than six hundred and sixty feet off the nearest edge of the right-of-way, located outside of urban areas, visible from the main traveled way of the system, and erected with the purpose of . . . being read from such main traveled way.\" 23 U.S.C. § 131(b). Thus, Subchapter II applies to a subset of roads governed by Subchapter I (interstate highways and the primary system) but it restricts signs for a greater distance away from the road.\n\nSubchapter II of Chapter 11 of the Delaware Code tracks generally, but not exactly, the requirements of the HBA.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Like Subchapter I, there is a general prohibition on outdoor advertising in the regulated area and then a list of enumerated exceptions to this general prohibition. See Del. Code Ann. tit. 17, § 1121.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Section 1121 exempts the following specific types of signs:\n\n(1) Directional and other official signs and notices, which signs and notices shall include, but not be limited to, signs and notices pertaining to natural wonders, scenic and historic attractions as authorized or required by the laws of this State;\n\n(2) Signs, displays and devices advertising the sale or lease of the real property upon which they are located;\n\n(3) Signs, displays and devices advertising activities conducted on the real property upon which they are located;\n\n(4) Signs, displays and devices located either (i) in controlled areas adjacent to the interstate system and within the boundaries of incorporated municipalities, as such boundaries existed on September 21, 1959, wherein the use of real property is subject to municipal regulation and control, which are zoned industrial or commercial, or (ii) in other controlled areas adjacent to the interstate system zoned industrial or commercial which were zoned industrial or commercial as of September 21, 1959;\n\n(5) Signs, displays and devices located in controlled areas adjacent to highways of the primary system which are zoned industrial or commercial;\n\n(6) Signs, displays and devices located in unzoned commercial and industrial controlled areas adjacent to highways of the primary system and defined by regulations to be promulgated by the Department;\n\n(7) Any school bus waiting shelter displaying a sign provided such sign does not exceed 32 square feet in area and with a limit of 2 signs per shelter. Should the State Department of Instruction determine that there is no longer a need for a waiting shelter at its present location, the exemption provided by this paragraph shall then terminate.\n\nDel Code Ann. tit. 17, § 1121(1)-(7).\n\nSubchapter III, entitled \"Limitations on Outdoor Advertising Along Limited Access, State Toll Roads,\" which became effective on July 20, 1992, simply provides that \"the provisions of Subchapter II of this chapter shall be applicable to any limited access, state toll road in this State.\" Del. Code Ann. tit. 17, § 1131. Thus, the analysis under Subchapter III is the same as that under Subchapter II.\n\nThe New Castle Ordinance prohibits all exterior signs \"except as permitted.\" New Castle Co. Code Art. XII, § 23-73. The ordinance contains a very long list of permitted signs including directional signs, warning signs, memorial plaques, address signs, signs attached to gasoline pumps, permanent subdivision signs, noncommercial signs relating to ideological, religious, or political thought, signs advertising grand openings on the site, temporary political campaign signs so long as they are removed within 10 days of an election, and many others. See id.\n\nIII. CONTENT NEUTRALITY\n\nA. Introduction\n\nEver since the Supreme Court invalidated an ordinance that prohibited all picketing near a school except for peaceful labor picketing on the basis that \"the ordinance . . . described impermissible picketing not in terms of time, place, and manner, but in terms of subject matter,\" see Police Dep't of Chicago v. Mosley, 408 U.S. 92, 99, 92 S. Ct. 2286, 2292, 33 L. Ed. 2d 212 (1972), the first step in First Amendment analysis has been to determine whether a statute is content-neutral or content-based.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The answer to this question normally determines under which of two very different modes of analysis a statute is to be evaluated. Accordingly, it becomes a (if not the) crucial determination in evaluating a particular regulation of speech. See Mark Tushnet, The Supreme Court and Its First Amendment Constituency, 44 Hastings L.J. 881, 882 (1993) (\"Today the central organizing concept of First Amendment doctrine is the distinction between content-based regulations and content-neutral ones.\").\n\nIf a statute is content-based, then the State is required \"to show that the 'regulation is necessary to serve a compelling state interest and that it is narrowly drawn to achieve that end.'\" Boos v. Barry, 485 U.S. 312, 321, 108 S. Ct. 1157, 1164, 99 L. Ed. 2d 333 (1988). On the other hand, if the statute is content-neutral, and merely restricts the total quantity of speech by regulating the time, the place or the manner in which one can speak, a very different test applies. See, e.g., Ward v. Rock Against Racism, 491 U.S. 781, 791; 109 S. Ct. 2746, 2753, 105 L. Ed. 2d 661 (1989); Members of City Council v. Taxpayers for Vincent, 466 U.S. 789, 804-05, 104 S. Ct. 2118,2128-29, 80 L. Ed. 2d 772 (1984). As the Supreme Court has explained:\n\nEven in a public forum the government may impose reasonable restrictions on the time, place, or manner of protected speech, provided [1] the restrictions \"are justified without reference to the content of the regulated speech, [2] that they are narrowly tailored to serve a significant governmental interest, and [3] that they leave open ample alternative channels for communication of the information.\"\n\nWard v. Rock Against Racism, 491 U.S. at 791; 109 S. Ct. at 2753 (quoting Clark v. Community for Creative Non-Violence, 468 U.S. 288, 293, 104 S. Ct. 3065, 3069, 82 L. Ed. 2d 221 (1984)); see also Taxpayers for Vincent, 466 U.S. at 789, 104 S. Ct. at 2118.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nChapter 11 indisputably distinguishes between, and allows the posting of certain signs, (for example, \"for sale\" signs and directional signs,) based on the subject matter the signs convey. Under a literal understanding of \"content based\" that fact makes the statute content-based. Cf. Discovery Network, 113 S. Ct. at 1516 (\"Under the city's newsrack policy, whether any particular newsrack falls within the ban is determined by the content of the publication resting inside that newsrack. Thus, by any commonsense understanding of the term, the ban in this case is 'content-based.'\").\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nB. The Metromedia Plurality\n\nA plurality of the Supreme Court analyzed a statute very similar to Chapter 11 and found it content-based in Metromedia, Inc. v. San Diego, 453 U.S. 490, 101 S. Ct. 2882, 69 L. Ed. 2d 800 (1981).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Like Chapter 11, the San Diego ordinance in Metromedia consisted of a broad ban subject to a series of exceptions. As does Chapter 11, the San Diego ordinance exempted onsite signs, government signs, signs located at public bus stops, historical signs, and \"for sale\" and \"for lease\" signs. The San Diego ordinance also contained some exemptions not present in Chapter 11 -- exemptions for signs manufactured, transported, or stored within the city if not used for advertising purposes, for signs within shopping malls, for religious symbols, for signs depicting time, temperature, or news, and for temporary political campaign signs. See Metromedia, 453 U.S. at 494-95, 101 S. Ct. at 2885-86 (plurality opinion). Conversely, Chapter 11 contains some exemptions not present in the San Diego ordinance, including exemptions for highway beautification signs, signs advertising local industries, notices required by law, and signs necessary for the safety of the public.\n\nThere are other distinctions between the two ordinances. Most important, the Metromedia plurality deemed the onsite exception in the San Diego ordinance to apply only to commercial signs, meaning that the ordinance permitted onsite commercial signs but not onsite non-commercial signs. Id. at 494, 101 S. Ct. at 2886 (plurality opinion). But see 453 U.S. at 535-36, 101 S. Ct. at 2906-07 (Brennan, J., Concurring in the judgment) (concluding that the onsite exception in the San Diego ordinance should have been interpreted in such a way that \"if the occupant is an enterprise usually associated with noncommercial speech, the substance of the identifying sign would be noncommercial.\"). In contrast, we have interpreted the onsite exception, the exception for signs advertising \"activities conducted upon state real property,\" Del. Code Ann. tit. 17, §§ 1108(a), 1114(1), to apply to both commercial and noncommercial signs. See supra note 11.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIn Metromedia the Court found that the San Diego ordinance unconstitutionally discriminated among types of speech based on content. First, the plurality concluded that by allowing onsite commercial signs but not noncommercial ones on the same site, the ordinance impermissibly discriminated in favor of commercial over noncommercial speech. More specifically, the plurality remarked:\n\nOur recent commercial speech cases have consistently accorded noncommercial speech a greater degree of protection than commercial speech. San Diego effectively inverts this judgment, by affording a greater degree of protection to commercial than to noncommercial speech. . . . The city does not explain how or why noncommercial billboards located in places where commercial billboards are permitted would be more threatening to safe driving or would detract more from the beauty of the city. Insofar as the city tolerates billboards at all, it cannot choose to limit their content to commercial messages; the city may not conclude that the communication of commercial information concerning goods and services connected with a particular site is of greater value than the communication of noncommercial messages.\n\nId. at 513, 101 S. Ct. at 2895 (plurality opinion). Second, the plurality concluded that the ordinance impermissibly favored certain types of non-commercial speech over other types of non-commercial speech by exempting religious signs, historical signs, and temporary political signs but not exempting other non-commercial signs. The plurality stated:\n\nWith respect to noncommercial speech, the city may not choose the appropriate subjects for public discourse . . . . Because some noncommercial messages may be conveyed on billboards throughout the commercial and industrial zones, San Diego must similarly allow billboards conveying other noncommercial messages throughout those zones.\n\nId. at 514-15, 101 S. Ct. at 2896 (plurality opinion) (citation omitted).\n\nHowever, the plurality concluded that the statute's regulation of commercial signs was constitutional because the statute met the test for regulation of non-misleading commercial speech articulated in Central Hudson Gas \u0026 Elec. Corp. v. Public Serv. Comm., 447 U.S. 557, 563-66, 100 S. Ct. 2343, 2350-51, 65 L. Ed. 2d 341 (1980), namely that the regulation reached no further than necessary to advance a substantial governmental interest and it directly advanced that interest. See Metromedia, 453 U.S. at 507-12, 101 S. Ct. at 2892-95 (plurality opinion). Moreover, the plurality concluded that the statute's content-based distinctions within the category of commercial speech -- between onsite and offsite commercial advertising, and between \"for sale\" signs and other signs did not undercut the city's argument that the ordinance directly advanced its aesthetic and safety interests. Id. at 511-12, 101 S. Ct. at 2894-95 (plurality opinion).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThus, the plurality opinion indicated that content-based distinctions within the category of commercial speech were permissible; however, similar distinctions favoring commercial over non-commercial speech or favoring certain speech within the category of non-commercial speech were impermissible. A straightforward application of the plurality opinion would probably lead to an invalidation of the Delaware statute at issue in this case -- although it would do so on only one of the two grounds articulated by the plurality.\n\nThe plurality's first rationale may well not apply in this case. Because we have interpreted the onsite exception to apply to onsite non-commercial as well as to onsite commercial speech, the statutes at issue here do not favor commercial over non-commercial speech within the same category of speech. Both onsite commercial and onsite non-commercial speech are permitted.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Of course, even after we interpret the statute in this way, Chapter 11 still exempts some commercial speech (onsite commercial speech, \"for sale\" signs) while prohibiting some non-commercial speech (offsite non-commercial speech that does not fall into any exemption).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Thus, if the Metromedia plurality meant to indicate that a statute that allowed any commercial speech could not prohibit any non-commercial speech, then the statute at issue here would fail the test. But we interpret the Metromedia plurality to have been concerned with the fact that the San Diego ordinance allowed a broad type of commercial speech (onsite speech) while not allowing non-commercial speech even of the same type. That concern is not implicated here given our interpretation of the statute to allow commercial and non-commercial onsite speech.\n\nThe second basis of the plurality's ruling -- that distinctions within the category of non-commercial speech must be supported by a compelling state interest -- applies much more squarely here. While Chapter 11 does not exempt religious symbols or temporary political campaign signs as did the San Diego ordinance, it does exempt historical signs, government signs, and highway beautification signs. Thus, under the reasoning of the Metromedia plurality, it is unconstitutional. Other courts of appeal have struck down sign ordinances based on just such reasoning. See, e.g., Gilleo v. Ladue, 986 F.2d 1180 (8th Cir. 1993), cert. granted, 62 U.S.L.W. 3242 (1993); National Advertising Co. v. Babylon, 900 F.2d 551, 557 (2d Cir. 1990), cert denied, 498 U.S. 852, 111 S. Ct. 146, 112 L. Ed. 2d 112 (1990); Fisher v. Charleston, 188 W. Va. 518, 425 S.E.2d 194 (W. Va. 1992). But see Messer v. Douglasville, 975 F.2d 1505, 1511-13 (11th Cir. 1992) (finding the ordinance at issue constitutional despite limited content-based exceptions because these exceptions did not \"express a preference between different noncommercial messages\"), cert. denied, 124 L. Ed. 2d 296, 113 S. Ct. 2395 (1993).\n\nC. Analyzing Plurality Opinions -- Doubts Cast by the Metromedia Concurrence and Dissents\n\nThe second Metromedia rationale would seem to dispose of the merits of the case: not only is it the rationale of a Supreme Court plurality, but it seems to flow easily out of the Court's general First Amendment jurisprudence on content neutrality. Nonetheless, this is a hard case, because the concurrence and Dissents in Metromedia call into question whether the specific reasoning of the plurality is the governing law with respect to First Amendment analysis of sign prohibitions and also whether the Court's general First Amendment jurisprudence clearly dictates a particular result here.\n\nThe Metromedia decision was badly splintered, producing five separate opinions. As Justice Rehnquist observed, it is difficult to divine what, if any, principles from Metromedia became the governing standard for future cases, i.e., \"the law of the land.\" See Metromedia, 453 U.S. at 569, 101 S. Ct. at 2924 (Rehnquist, J., Dissenting). He lamented that it was \"a genuine misfortune to have the Court's treatment of the subject be a virtual Tower of Babel, from which no definitive principles can be clearly drawn. \" Id. at 569, 101 S. Ct. at 2924 (Rehnquist, J., Dissenting). See generally Linda Novak, Note, The Precedential Value of Supreme Court Plurality Decisions, 80 Colum. L. Rev. 756 (1980) (discussing the difficulties inherent in interpreting plurality opinions).\n\nObviously, the decisions of the Supreme Court are binding on this Court and constitute the law of the land. This statement is deceptively simple, however, because when a Supreme Court decision fails to garner a majority, it is often difficult to determine what standard the Court has adopted. Aware of this difficulty, the Court has provided some guidance, \"When a fragmented Court decides a case and no single rationale explaining the result enjoys the assent of five Justices, 'the holding of the Court may be viewed as that position taken by those Members who concurred in the judgment on the narrowest grounds.'\" Marks v. United States, 430 U.S. 188, 193, 97 S. Ct. 990, 993, 51 L. Ed. 2d 260 (1977) (quoting Gregg v. Georgia, 428 U.S. 153, 169 n.15, 96 S. Ct. 2909, 2923 n.15, 49 L. Ed. 2d 859 (1976) (opinion of Stewart, Powell, and Stevens, JJ.)).\n\nIn Planned Parenthood of Southeastern Pa. v. Casey, 947 F.2d 682 (3d Cir. 1991), modified on other grounds 120 L. Ed. 2d 674, 112 S. Ct. 2791 (1992), we had an opportunity to consider the Marks rule and explain its application in some depth. We wrote:\n\nThe principle objective of this Marks rule is to promote predictability in the law by ensuring lower court adherence to Supreme Court precedent. This objective requires that, whenever possible, there be a single legal standard for the lower courts to apply in similar cases and that this standard, when properly applied, produces results with which a majority of the Justices in the case articulating the standard agree. . . . Where no single rationale \"enjoys the assent of five Justices,\" the situation becomes more complex, but the controlling principle is the same. Where a Justice or Justices Concurring in the judgment in such a case articulates a legal standard which, when applied, will necessarily produce results with which a majority of the Court from that case would agree, that standard is the law of the land.\n\n947 F.2d at 693 (citation omitted) (emphasis added). Applying the rule, in Casey, this Court adopted Justice O'Connor's \"undue burden\" standard to analyze abortion restrictions. See id. at 697. In a series of cases, Justice O'Connor had taken the middle, and swing, position between Justices who favored more severe tests such as strict scrutiny to evaluate abortion restrictions and other Justices who had favored the less restrictive rational basis review. But any time a regulation constituted an undue burden, Justice O'Connor and those Justices who favored more severe tests would form a majority to strike down the statute. Any time a regulation did not constitute an undue burden, Justice O'Connor and those Justices who favored rational basis review would form a majority to uphold the statute. Thus, the undue burden test had become the law of the land even before Casey.\n\nHowever, it is not always possible to discover a single standard that legitimately constitutes the narrowest ground for the decision. The Court of Appeals for the D.C. Circuit explains:\n\nMarks is workable -- one opinion can be meaningfully regarded as \"narrower\" than another -- only when one opinion is a logical subset of other, broader opinions. In essence, the narrowest opinion must represent a common denominator of the Court's reasoning; it must embody a position implicitly approved by at least five Justices who support the judgment.\n\nKing v. Palmer, 950 F.2d 771, 781 (D.C. Cir. 1991) (en banc); see also Casey, 947 F.2d at 694 (recognizing that the opinions considered had \"a common denominator standard\"). The court in King realized that there would not always be such a common denominator in the Court's reasoning. In some splintered decisions, there will be three or more distinct approaches, none of which is a subset of another; instead, each approach is simply different. See King, 950 F.2d at 782-83; John F. Davis \u0026 William L. Reynolds, Juridical Cripples: Plurality Opinions in the Supreme Court, 1974 Duke L.J. 59, 72; Novak, supra, at 763.\n\nIn such cases, no particular standard constitutes the law of the land, because no single approach can be said to have the support of a majority of the Court. As the court stated in King :\n\nWhen, however, one opinion supporting the judgment does not fit entirely within a broader circle drawn by the others, Marks is problematic. If applied in situations where the various opinions supporting the judgment are mutually exclusive, Marks will turn a single opinion that lacks majority support into national law. When eight of nine Justices do not subscribe to a given approach to a legal question, it surely cannot be proper to endow that approach with controlling force, no matter how persuasive it may be.\n\n950 F.2d at 782. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nMetromedia is such a case. Simply stated, the plurality and the concurrence took such markedly different approaches to the San Diego ordinance that there is no common denominator between them. Like the plurality, Justice Brennan, in a Concurring opinion joined by Justice Blackmun, found the San Diego ordinance unconstitutional. Unlike the plurality, however, the concurrence did not think that the relevant issue was the constitutional effect of the exceptions to the general prohibition. The concurrence viewed the San Diego ordinance as a total ban on billboards because it believed that the ordinance would have the practical effect of eliminating the billboard industry in San Diego and thereby would eliminate billboards as an effective medium of communication. Id. at 525-36, 101 S. Ct. at 2901-02 (Brennan, J., Concurring in the judgment). This understanding of the ordinance, in turn, led to a method of analyzing its constitutionality very different from the plurality's. Id. at 526, 101 S. Ct. at 2902 (Brennan, J., Concurring in the judgment) (\"The characterization of the San Diego regulation as a total ban of a medium of communication has more than semantic implications, for it suggests a First Amendment analysis quite different from the plurality's.\").\n\nUnder the concurrence's view, a total ban of signs could be upheld only on a showing that the governmental interest was substantial, that the governmental interest was directly furthered by the total ban, and that any more narrowly drawn restriction would not further that interest as well. Id. at 528, 101 S. Ct. at 2903 (Brennan, J., Concurring in the judgment).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Justice Brennan concluded that San Diego had failed to establish adequate justification for the ban. In particular, the concurrence concluded that \"the city had failed to come forward with evidence demonstrating that billboards actually impair traffic safety.\" Id. at 528, 101 S. Ct. at 2903 (Brennan, J., Concurring in the judgment). Additionally, the concurrence concluded \"that the city had failed to show that its asserted interest in aesthetics [was] sufficiently substantial in the commercial and industrial areas of San Diego\" because in these areas the elimination of billboards would not necessarily have had more than a negligible effect on aesthetics. 453 U.S. at 530-33, 101 S. Ct. at 2904-06 (Brennan, J., Concurring in the judgment). Thus, the concurrence determined that the San Diego statute was unconstitutional.\n\nIn addition to employing different reasoning from that of the plurality, Justice Brennan seemed explicitly to reject the first basis for the plurality's holding -- that it was impermissible for legislation to favor commercial over non-commercial speech. Justice Brennan seemed to think that content-based distinctions favoring commercial over non-commercial speech were the same as content-based distinctions within the category of non-commercial speech or within the category of commercial speech. To hold otherwise would, in some situations, force the executive branch to evaluate what speech was commercial and what speech was non-commercial:\n\nI cannot agree with the plurality's view that an ordinance totally banning commercial billboards but allowing noncommercial billboards would be constitutional. For me, such an ordinance raises First Amendment problems at least as serious as those raised by a total ban, for it gives city officials the right -- before approving a billboard -- to determine whether the proposed message is 'commercial' or 'noncommercial'.\n\nId. at 536, 101 S. Ct. at 2907 (Brennan, J., Concurring).\n\nThe concurrence also disagreed with the plurality's second justification for its decision -- namely, that distinctions within the category of non-commercial speech require justification by a compelling state interest:\n\nObviously, a city can have special goals the accomplishment of which would conflict with the overall goals addressed by the total billboard ban. It would make little sense to say that a city has an all-or-nothing proposition -- either ban all billboards or none at all . . . . If a city can justify a total ban, I would allow an exception only if it directly furthers an interest that is at least as important as the interest underlying the total ban, if the exception is no broader than necessary to advance the special goal, and if the exception is narrowly drawn so as to impinge as little as possible on the overall goal. To the extent that exceptions rely on content-based distinctions, they must be scrutinized with special care.\n\nId. at 532 n.10, 101 S. Ct. at 2905 n.10 (Brennan, J., Concurring in the judgment).\n\nEven more so than the concurrence, the Dissenters rejected the plurality's analysis of the San Diego statute as content-based. The Dissenters felt that the exceptions in the statute were so de minimis that they should not count as content-based. See id. at 553, 101 S. Ct. at 2916 (Stevens, J., Dissenting in part) (\"The essential concern embodied in the First Amendment is that government not impose its viewpoint on the public or select the topics on which public debate is permissible. The San Diego ordinance simply does not implicate this concern.\"); id. at 564, 101 S. Ct. at 2922 (Burger, C.J., Dissenting) (\"The exceptions San Diego has provided -- the presence of which is the plurality's sole ground for invalidating the ordinance -- are few in number, are narrowly tailored to peculiar public needs, and do not remotely endanger freedom of speech.\"); id. at 570, 101 S. Ct. at 2925 (Rehnquist, J., Dissenting) (\"Nor do I believe that the limited exceptions contained in the San Diego ordinance are the types which render this statute unconstitutional.\"). Not only did the Dissenters disagree with the plurality's view that the San Diego ordinance was content-based, the three Dissenters also disagreed with the concurrence's view that the San Diego ordinance constituted an unconstitutional ban of an entire medium of communication. See id. at 552-53, 101 S. Ct. at 2916-17 (Stevens, J., Dissenting in part); id. at 562-63, 101 S. Ct. at 2921 (Burger, C.J., Dissenting); id. at 570-71, 101 S. Ct. at 2924-25 (Rehnquist, J., Dissenting).\n\nThus, neither the plurality nor the concurrence \"articulates a legal standard which, when applied, will necessarily produce results with which a majority of the Court from that case would agree.\" Casey, 947 F.2d at 693 (emphasis added).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e If a statute banned signs on some but not all roads so that the concurrence did not see it as a total ban of signs, and if it crafted content-based exceptions to the ban justifiable under the test articulated by the concurrence, the Concurring Justices would probably join the Dissenters to form a majority upholding the statute with members of the plurality Dissenting. In contrast, if a statute banned all commercial signs but no other signs along all roads, neither the plurality nor the Dissents would see it as content-based. Thus, the plurality would join with the Dissenters to uphold the statute; the Concurring Justices would Dissent. Cf. Outdoor Sys., Inc. v. City of Mesa, 997 F.2d 604 (9th Cir. 1993) (upholding a statute that allowed any noncommercial message anywhere a sign was allowed, but prohibited all offsite commercial signs). Thus, in a significant number of hypothetical cases, the Court would reach a result at odds with the reasoning of either the plurality or the concurrence; neither approach would necessarily produce a majority result in every case.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Since the opinions in Metromedia share no common denominator, they do not establish a governing standard for future cases.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nD. Applicability of the Result in Metromedia\n\nWhile we are unable to derive a governing standard from the splintered opinions in Metromedia we are still, at a minimum, bound by its result. See Novak, supra, at 779.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e If Chapter 11 is substantially identical to the San Diego ordinance at issue in Metromedia then we are bound to strike it down. However, as explained on pp. 24 - 25 \u0026 n. 18 supra, there are significant differences between the ordinance at issue here and that at issue in Metromedia.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Thus, the result in Metromedia does not control our decision here.\n\nMoreover, because the choice of remedy for any constitutional violation will be shaped by the principles underlying our decision, we could not just follow the result in Metromedia without explicating the First Amendment principles that justify that decision. For example, if we determine that it is impermissible for the statute to distinguish among types of non-commercial speech, we could craft an order requiring the state to permit all types of non-commercial speech while still restricting commercial speech. But if we determine that specific exceptions in the statute are unconstitutional because they fail to meet the test proposed by the Metromedia concurrence for content-based exceptions, then we could not rescue the statute by requiring the State to permit more non-commercial speech. In the view of the concurrence, such a requirement would create new content-based distinctions between the non-commercial speech permitted and offsite commercial speech which would continue to be prohibited. In such a case, we would either have to strike down the offending exceptions or strike down the statute. Thus, we must ourselves determine whether Chapter 11 is a content-based statute, and, if it is, what makes it so.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nIV. CONTENT DISCRIMINATION REVISITED\n\nA. A New Test\n\nIn Part III. A. supra, we indicated that the laws at issue here looked as if they plainly involved content discrimination. After all, they each exempted some signs from regulation based on the content of those signs. Yet neither the concurrence nor the Dissenters in Metromedia agreed that this was dispositive, suggesting that the question of whether the laws are content-based is more difficult than it initially appeared to us. In order to understand and evaluate the difficulties, we must explain why the First Amendment requires content neutrality.\n\nAt the heart of the First Amendment is the concern that government should not restrict speech based on the fear that the speech will persuade listeners that a particular view is correct. Restricting speech on such a basis indicates a fundamental distrust in the rationality of listeners that is incompatible with the notion of an autonomous democratic citizenry. Moreover, such restriction often distorts debate on particular issues by allowing speech on one side of an issue while preventing speech on another side. As the Supreme Court has explained, \"there is an 'equality of status in the field of ideas,' and government must afford all points of view an equal opportunity to be heard.\" Police Dep't of Chicago v. Mosley, 408 U.S. 92, 96, 92 S. Ct. 2286, 2290, 33 L. Ed. 2d 212 (citation omitted).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Distortion of debate can occur even if the restriction does not differentiate by viewpoint but only by subject matter -- for example, if the government bans all speech on labor issues regardless of viewpoint but allows speech on other issues. By limiting debate on a particular issue, government can focus speech on other issues and thus shape the agenda for political action. \"To allow a government the choice of permissible subjects for public debate would be to allow that government control over the search for political truth.\" Consolidated Edison Co. v. Public Service Comm'n, 447 U.S. 530, 538, 100 S. Ct. 2326, 2333, 65 L. Ed. 2d 319 (1980).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nEven when government asserts a motive to restrict speech other than antipathy towards particular content, a long history of governmental attempts to censor speech provides reason to suspect that a restriction that facially differentiates based on content is in fact often motivated by such antipathy. Because of the oft-disguised censorial motive, illicit governmental motivation is not an element of a prima facie case under the First Amendment. Cf. Minneapolis Star \u0026 Tribune v. Minnesota Comm'r of Revenue, 460 U.S. 575, 595, 103 S. Ct. 1365, 1376, 75 L. Ed. 2d 295 (1983) (striking down a statute that singled out a small group of newspapers to tax despite the absence of explicit evidence of illicit governmental motivation, because \"illicit legislative intent is not the sine qua non of a violation of the First Amendment\"); Mosley, 408 U.S. at 95, 92 S. Ct. at 2290 (not bothering to look for evidence of illicit governmental motivation, because the \"central problem\" with such an ordinance was merely that it \"described \" permissible speech \"in terms of its subject matter\" (emphasis added). Moreover, even if government is not intending to limit speech expressing a particular idea, content differentiation can still distort public debate merely by limiting the dissemination of some ideas within that debate.\n\nA final justification for prohibiting content discrimination is that when the government creates content-based exemptions from a general ban, it implies that it does not have as great an interest in limiting speech as the general ban suggests. If some newsracks do not pose enough of an aesthetic threat to justify banning them, perhaps the government's aesthetic interest in banning other newsracks is not that momentous. See Discovery Network, 113 S. Ct. at 1505; cf. Metromedia, 453 U.S. at 521, 101 S. Ct. at 2899 (\"If the city has concluded that its official interests are not as strong as private interests in commercial communications, may it nevertheless claim that those same official interests outweigh private interests in noncommercial communications? Our answer, which is consistent with our cases, is in the negative.\") (plurality opinion). The rule against content discrimination forces the government to limit all speech -- including speech the government does not want to limit -- if it is going to restrict any speech at all. By deterring the government from exempting speech the government prefers, the Supreme Court has helped to ensure that government only limits any speech when it is quite certain that it desires to do so.\n\nAs we have seen, the Metromedia Dissenters did not think that any of these concerns were implicated by exceptions like those at issue here. As Justice Stevens explained, \"the essential concern embodied in the First Amendment is that government not impose its viewpoint on the public or select the topics on which public debate is permissible. The San Diego ordinance simply does not implicate this concern.\" See Metromedia, 453 U.S. at 553, 101 S. Ct. at 2916 (Stevens, J., Dissenting in part). The concurrence, while not going as far as the Dissent, also thought that minimal exceptions to a general ban could be justified. Otherwise, a legislature would essentially be faced with a choice between banning all speech or none. See Metromedia, 453 U.S. at 532 n.10, 101 S. Ct. at 2905 n.10 (Brennan, J., Concurring in the judgment).\n\nWe agree with the concurrence and the Dissents that the exceptions at issue in the San Diego ordinance, and those at issue in the Delaware ordinance, do not raise many of the concerns that mandate limiting government's ability to discriminate based on content. The exceptions are quite small; they are not for particular subjects likely to generate much debate and so are not likely to focus debate on that subject matter at the expense of other subject matter; and they do not discriminate by viewpoint. Thus, they do not appear to be motivated by a desire to suppress certain speech, and they do not eliminate certain issues from Discussion in a way that makes it likely that government is aiming to shape the public agenda or is in fact significantly affecting the shape of that agenda.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Cf. Scadron v. Des Plaines, 734 F. Supp. 1437, 1446 (N.D. Ill. 1990) (basing a decision that a sign regulation was content neutral on the reasoning of the Metromedia concurrence and Dissents).\n\nNonetheless, we are unwilling to follow the suggestion of the Dissenters that whenever content-based discrimination is de minimis, it is permissible. For courts to conduct the analysis necessary to reach such a Conclusion would require undermining many of the advantages of what has been largely a per se rule against content discrimination. Judges are human, like legislators, and often share majoritarian views. Allowing Judges to make a case by case determination that content discrimination is de minimis risks allowing Judges' subconscious judgments about the worth of particular speech to affect whether they deem a limitation on speech to be permissible.\n\nLikewise, the test posited by the Metromedia concurrence poses a concern about excessive judicial discretion. The concurrence states:\n\nIf a city can justify a total ban, I would allow an exception only if it directly furthers an interest that is at least as important as the interest underlying the total ban, if the exception is no broader than necessary to advance the special goal, and if the exception is narrowly drawn so as to impinge as little as possible on the overall goal.\n\nMetromedia, 453 U.S. at 532 n.10, 101 S. Ct. at 2905 n.10 (Brennan, J., Concurring in the judgment). Although the concurrence's test does not allow government to justify restricting speech based on its antipathy towards certain speech but only based on an interest unrelated to content (e.g. aesthetic interests), it does allow government to exempt certain speech from a ban if government justifiably thinks that the speech is important enough to outweigh its general interest in a ban. This would allow government to make a judgment that speech regarding some issues is more important than speech regarding other issues -- and would require courts to ratify that abstract judgment. For example, government could decide that it is especially important that the public be informed about health care policy and thus aesthetic interests that justify banning all other signs do not justify banning signs related to health care. This is exactly the sort of case by case analysis of the importance of speech that the ban on content discrimination test is supposed to prevent.\n\nThe Metromedia concurrence, however, is correct that when government has a significant interest in limiting speech that is unrelated to the content of that speech, government should not be left with a choice of enacting a regulation banning all signs in a particular geographic area or none. Some signs are more important than others not because of a determination that they are generally more important than other signs, but because they are more related to the particular location than are other signs. Allowing such \"context-sensitive\" signs while banning others is not discriminating in favor of the content of these signs; rather, it is accommodating the special nature of such signs so that the messages they contain have an equal chance to be communicated.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nA sign that says \"Speed Limit 55\" or \"Rest Stop\" is more important on a highway than is a sign that says \"Rappa for Congress.\" A sign identifying a commercial establishment is more important on its premises than is a sign advertising an unrelated product. If the former signs are banned from the highway or the place of business, there is no other means of communication that can provide equivalent information. In contrast, placing a sign that says \"Rappa for Congress\" or \"Drink Pepsi\" on a highway, while it may be an important means of communication because of the number of travellers on the highway, has no relationship to the property on which it is placed or to the fact that it is next to a highway. Banning these signs potentially leaves many alternative means of communicating the same information.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThus, we conclude that when there is a significant relationship between the content of particular speech and a specific location or its use, the state can exempt from a general ban speech having that content so long as the state did not make the distinction in an attempt to censor certain viewpoints or to control what issues are appropriate for public debate and so long as the exception also survives the test proposed by the Metromedia concurrence\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e : i.e. the state must show that the exception is substantially related to advancing an important state interest that is at least as important as the interests advanced by the underlying regulation, that the exception is no broader than necessary to advance the special goal, and that the exception is narrowly drawn so as to impinge as little as possible on the overall goal.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nThe requirement that a sign be significantly related to the property can be met in either of two ways. First, the state can show that a sign is particularly important to travellers on the nearby road -- for example, a directional sign, or a sign conveying the nearest location of food. Second, the state can show that a sign better conveys its information in its particular location than it could anywhere else -- for example, an address sign performs its function better when it is actually on the property with that address than if it is anywhere else.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nBy requiring exceptions to be significantly related to a particular locality, we provide a concrete criterion by which legislatures and courts can evaluate particular exceptions.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e{/Cite} Courts will not be making an abstract assessment of the relative worth of various types of speech.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Yet the test we have adopted still allows government some flexibility to limit speech when it has a significant interest in doing so without eliminating all speech.\n\nSuch flexibility does come at a price -- because government is no longer faced with a choice between banning all speech or none, it is more likely to opt to restrict speech. But we do not think that government should be forced to refrain from restricting speech in a place whenever it thinks that particular speech is so important a component of the place that it will be unwilling to restrict any speech if it has to restrict that speech.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Thus, restating the major components of the test we have adopted, we hold that when there is a significant relationship between the content of particular speech and a specific location, the state can exempt speech having that content from a general ban so long as the exemption is substantially related to serving an interest that is at least as important as that served by the ban.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nB. Application of the Test\n\nMost, but not all, of the exceptions in Subchapter I of Delaware Code Ann. tit. 17 meet the test we have adopted. We discuss them seriatim, combining exceptions that are related.\n\n(1) Directional or warning signs and official signs or notices, Del. Code Ann. tit. 17, §§ 1108(a), 1108(b), 1114(4), danger and precautionary signs that relate to the premises, id. § 1114(4); and signs or notices of a railroad, other transportation, or communication company that are necessary for the direction, information, or safety of the public, id., § 1114(5), are all regulatory signs directly related to the functioning of the roads and property on which they are located.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Moreover, most of these signs are important enough that they probably could survive even a compelling state interest test. Cf. John Donnelly \u0026 Sons v. Campbell, 639 F.2d 6, 9 (1st Cir. 1980) (\"Each of the exceptions reflects 'an appropriate governmental interest.' Some -- for signs of governmental and quasi-governmental bodies, and for traffic and bus signs and the like -- are justified by sheer public necessity.\" (quoting Mosley, 408 U.S. at 92, 95, 92 S. Ct. at 2289 (1972)), aff'd 453 U.S. 916, 101 S. Ct. 3151, 69 L. Ed. 2d 999 (1981). Thus, these exceptions certainly survive the intermediate scrutiny component of the test we have adopted -- the state's interest in these signs is greater than the state's aesthetic and safety interests in banning these signs, and the exemption is narrowly tailored to serve the state interest.\n\n(2) Signs advertising the sale or lease of the real property on which they are located, Del. Code Ann. tit. 17, §§ 1108(c), 1114(2), are directly related to that real property; there is a good reason why the signs are on that particular property rather than on other property. Moreover, there is probably an important state interest in allowing such signs in order to facilitate transactions in the housing market -- this interest is probably at least as great as the safety and aesthetic interests in banning these particular signs. However, as it currently stands, the record lacks sufficient facts from which we can conclude that this exception meets the substantial state interest component of the test. Thus, if we do not strike down the statute based on a different exception, the district court will have to address the sale/lease exception on remand. Although the showing of an important state interest should not be difficult to meet, the state will still have to present evidence, such as the testimony of an economist, explaining the importance of its interest in sale/lease signs and demonstrating that that interest is greater than the state's aesthetic and safety interests in banning these particular signs; the state will also have to explain why the exception is narrowly tailored to serve its interest in sale/lease signs.\n\n(3) The exception for signs advertising activities conducted on the premises, Del. Code Ann. tit. 17, §§ 1108(c), 1114(l), is constitutional. It does not even have to meet the test we have adopted, because it is not a content-based exception at all.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Although evaluating whether a sign is an onsite sign does require the state to analyze the content of the sign, the onsite exception does not preclude any particular message from being voiced in any place; it merely establishes the appropriate relationship between the location and the use of an outdoor sign to convey a particular message. R. Douglass Bond explains in his Note that \"the content of onsite noncommercial signs would be as varied as the noncommercial establishments on whose premises they would be found.\" Note, Making Sense of Billboard Law: Justifying Prohibitions and Exemptions, 88 Mich. L. Rev. 2482, 2504 (1990).\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e An Exxon sign could be placed on an Exxon station but not at Rappa's campaign headquarters; conversely, a \"Rappa for Congress\" sign could be placed on Rappa's campaign headquarters but not at an Exxon station. This contrasts, for example, with the exceptions for directional signs or \"for sale\" signs which allow signs of particular content in all locations. Thus, the exception for onsite signs, unlike the other exceptions, is not even subject to the test we have proposed.\n\n(4) The exception for signs that the State Department of Public Instruction has approved for presentation on school bus waiting shelters, Del. Code Ann. tit. 17, § 1108(c), is also, on this record, not a content-based exception. While this exception may well prove to be problematic, there is no indication that the signs approved for placement on these waiting shelters have any particular content or that signs with any particular content are disapproved.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\n(5) The exception for beautification/landscape planting sponsorship signs, Del. Code Ann. tit. 17, § 1108(d), while content-based, probably also meets the requirement that signs be significantly related to the locality -- although we acknowledge that this result initially seems counter-intuitive. Signs indicating that particular property has been landscaped at the expense of X company are directly related to that real property -- for a speaker to be able to communicate the meesage that particular landscaping is attributable to a particular company, it must post the signs on the particular property. There is no other place in which the same information can be conveyed as well. However, whether the State's interest in beautification/landscape planting signs is sufficient to meet the other requirements of the test is dubious. This is a question that will have to be addressed on remand unless we strike down the statute on other grounds.\n\n(6) It is hard to assess the (context-based) exception for notices or advertisements required by law, Del. Code Ann. tit. 17, § 1114(3). If the law only requires the posting of signs related to the property (e.g., zoning notices) and the other requirements of the test we have adopted are met, then this exception is acceptable, so long as it meets the substantial state interest prong of the test (which it would appear to do). Once again, the district court will have to explore these questions unless we strike down the statute on an alternative ground.\n\n(7) The exception for signs announcing a town, village or city and advertising itself or its local industries, meetings, buildings, historical markers, or attractions, Del. Code Ann. tit. 17, § 1114(6), is another matter. An exception which merely allowed signs directing people to local towns, historical sites, or attractions would probably be acceptable -- because the main function of roads is to enable people to travel to where they want to go, signs telling people where they are or directing them to particular sites are especially important along those roads. However, signs advertising a local city or industry or meeting are not related to the land on which they are placed nor to the function of the highway -- at least they are no more related to that land than are signs advertising local stores or local politicians. To allow such signs violates the test we have adopted and constitutes impermissible content discrimination.\n\nC. Summary\n\nSubchapter I of Delaware's statute is therefore unconstitutional, because at least one of the exceptions -- the exception for signs advertising local cities, industries and meetings -- is for signs that are not significantly related to the specific location where the signs are placed or its use. It may seem odd that such an arguably minor infirmity can be the cause of a declaration of unconstitutionality but, as we have already explained, we cannot permit content discrimination just because our intuition is that it is de minimis.\n\nSubchapter II, however, does not contain an exception for signs advertising local cities, industries or meetings. Like Subchapter I, Subchapter II exempts directional and other official signs, signs advertising the sale or lease of real property, other onsite signs, and signs on bus waiting shelters.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e As was the case with Subchapter I, these exceptions are probably all constitutional. On remand, the exception related to sale/lease signs (and perhaps the bus shelter signs, depending on the record developed) must meet the important state interest test to be constitutional.\n\nMoreover, we must interpret the official sign exception in Subchapter II, which allows \"directional and other official signs and notices, which signs and notices shall include . . . signs and notices pertaining to natural wonders, scenic and historic attractions,\" Del. Code Ann. tit. 17 § 1121(1), to include signs pertaining to natural wonders, scenic, and historic attractions only insofar as these signs direct traveller's to the sites.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e A sign with general information about a natural or historic site which does not provide such directional information is not related to the highway or the property alongside the highway any more than a sign describing a nearby restaurant or a local politician. Just as a sign describing a local politician cannot be exempted, a sign describing a historical site cannot be exempted. Thus, we must interpret the exception for official signs narrowly to exclude such general descriptive signs in order to avoid constitutional infirmities. Therefore, the only signs \"pertaining to natural wonders, scenic and historic attractions\" which are allowed are directional signs and on-site signs. On remand, the district court must address whether these signs meet the important state interest components of the test.\n\nIn summary, while Subchapter I of Chapter 11 violates content neutrality by failing the \"significantly related to locality\" test, Subchapters II and III of Chapter 11 do not. We will remand for the district court to evaluate whether the exceptions in Subchapters II and III fail other parts of the content neutrality test. Because the County has not appealed the District Court's decision with respect to the constitutionality of the county ordinance, we need not analyze it. We can resolve the question of the qualified immunity of the county defendants without conducting such a specific analysis.\n\nV. SECONDARY EFFECTS\n\nBefore determining what remedial action we should take as a result of our determination that the exception in Subchapter I for advertising of local industry and meetings is unconstitutional, we must address the state defendants' remaining arguments as to why the statute is entirely constitutional.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e These defendants first argue that regardless of any facial content-based distinctions made by Chapter 11, the statute is nevertheless content-neutral because the legislature was not motivated by the content of the speech but rather by the particular \"secondary effects\" caused by use of the prohibited signs. We disagree.\n\nIn Renton v. Playtime Theatres, Inc., 475 U.S. 41, 48, 106 S. Ct. 925, 929, 89 L. Ed. 2d 29 (1986), the Supreme Court upheld an ordinance that created zoning restrictions for adult theaters but not for any other type of speech and thus that, on its face, discriminated based on content. The Court indicated that the city's ordinance aimed to prevent crime and to protect retail trade and property values, rather than to suppress unpopular views. See id. Crime, and lower retail and property values were not caused by the persuasive power of speech in adult theaters but merely by the presence of adult theaters, and these effects were associated to a greater extent with adult theaters than with other speech. See id. at 49, 106 S. Ct. at 930 (citing Young v. American Mini Theatres, Inc., 427 U.S. 50, 82, 96 S. Ct. 2440, 2458, 49 L. Ed. 2d 310 (1976) (Powell, J. Concurring)). Because the statute aimed to limit these secondary effects, it was content neutral. Defendants argue that the statute at issue here can be similarly treated as content neutral, because it aims to limit the secondary effects of danger and ugliness associated with signs, effects not caused by the persuasive power of those signs. See Wheeler v. Commissioner of Highways, 822 F.2d 586, 590 (6th Cir. 1987) (determining that secondary effects analysis justified upholding a statute regulating signs even though the statute contained various exemptions). We have some doubts, however, that political speech is subject to secondary effects analysis; a majority of the Supreme Court has never explicitly applied the analysis to political speech.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nAt all events, we need not decide this difficult question because, even assuming, arguendo, that secondary effects analysis could justify otherwise content-based restrictions on political speech, the statute at issue here clearly fails that analysis. Under secondary effects analysis, speech that is prohibited must produce a greater secondary effect than speech that is permitted. As the Supreme Court explained last Term in Discovery Network :\n\nRegardless of the mens rea of the city, it has enacted a sweeping ban on the use of newsracks that distribute 'commercial handbills' but not 'newspapers.' Under the city's newsrack policy, whether any particular newsrack falls within the ban is determined by the content of the publication resting inside that newsrack. Thus, by any commonsense understanding of the term, the ban in this case is 'content-based.' Nor are we persuaded that our statements that the test for whether a regulation is content-based turns on the 'justification' for the regulation compel a different Conclusion. . . .\n\nIn contrast to the speech at issue in Renton, there are no secondary effects attributable to respondent publishers' newsracks that distinguish them from the newsracks Cincinnati permits to remain on its sidewalks.\n\n113 S. Ct. at 1516-17 (citations omitted) (emphasis added). Here, there are no aesthetic or safety effects caused by the signs prohibited by Chapter 11 that are not also caused by the signs allowed by Chapter 11. Any justification for treating these signs differently must rely on the content of these signs.\n\nThe defendants made a more focused argument before the district court, and defendants' amicus continues this argument here. Specifically, the argument is that campaign signs tend to proliferate more than other signs and therefore create greater safety and aesthetic problems than other signs. See Rappa, 813 F. Supp. at 1081. This argument fails. First, even were this quantitative comparison a permissible basis for disparate treatment generally, it does not explain why numerous signs other than campaign signs are prohibited. Second, the state defendants have simply offered no proof to support their claim that campaign signs present greater aesthetic and safety problems than other types of signs. See Ladue, 986 F.2d at 1183 \u0026 n.7; cf. Discovery Network, 113 S. Ct. at 1514-15 (\"The city has asserted an interest in esthetics, but respondent publishers' newsracks are no greater an eyesore than the newsracks permitted to remain on Cincinnati's sidewalks . . . . While there was some testimony in the District Court that commercial publications are distinct from noncommercial publications in their capacity to proliferate, the evidence of such was exceedingly weak, the Court of Appeals discounted it, and Cincinnati does not reassert that particular argument.\" (citation omitted)).\n\nVI. PUBLIC FORUM ANALYSIS\n\nThe state defendants also defend Chapter 11 as a regulation within non-public fora -- within fora that have neither traditionally been available for public expression, nor been designated by the State as open for expressive activity. See International Soc. for Krishna Consciousness v. Lee, 120 L. Ed. 2d 541, 112 S. Ct. 2701, 2705 (1992); see generally Perry Educ. Ass'n v. Perry Local Educators' Ass'n, 460 U.S. 37, 44-49, 103 S. Ct. 948, 954-57, 74 L. Ed. 2d 794 (1983) (setting out forum analysis). In non-public fora, the state acts in its proprietary capacity and can therefore regulate speech so long as its regulations do not discriminate by viewpoint and are reasonable. See United States v. Kokinda, 497 U.S. 720, 726, 110 S. Ct. 3115, 3121, 111 L. Ed. 2d 571 (1990). Thus, in non-public fora, discrimination based on content (subject matter) is generally permissible, and the regulation need not survive normal time, place and manner analysis.\n\nDefendants argue that rights of way are non-public fora. This argument, however, is without merit. The Delaware statute at issue regulates the posting of signs both along the rights of way of the majority of roads in Delaware and on private property. Indeed, the state defendants have conceded that rights of way are an indistinguishable portion of the roads themselves. See Del. Code Ann. tit. 17, § 101(a)(6) (\"'Road' and 'highway' include any public way or road or portion thereof and any sewer, drain or drainage system connected therewith and any bridge, culvert, viaduct or other construction or artificial way used in connection therewith and anything which is accessory to any of the same or to the use thereof.\"); Guy v. State, 438 A.2d 1250, 1255 (Del. Super. Ct. 1981) (daylight easement is part of the road as defined in section 101(a)(6) of Title 17 because it has \"no purpose other than its relationship as appurtenant to, and for the use of, the road.\").\n\nOnce it is determined that the forum at issue is public roads, it is clear that it is a public forum. As the Supreme Court explained in rejecting an argument that the historical uses and characteristics of the particular streets need to be considered on a case-by-case basis to determine the nature of the forum:\n\nIn short, our decisions identifying public streets and sidewalks as traditional public fora are not accidental invocations of a \"cliche,\" but recognition that \"wherever the title of streets and parks may rest, they have immemorially been held in trust for the use of the public.\" No particularized inquiry into the precise nature of a specific street is necessary; all public streets are held in the public trust and are properly considered traditional public fora.\n\nFrisby v. Schultz, 487 U.S. 474, 480-81, 108 S. Ct. 2495, 2500, 101 L. Ed. 2d 420 (1988) (quoting Hague v. CIO, 307 U.S. 496, 515, 59 S. Ct. 954, 964, 83 L. Ed. 1423 (1939) (Roberts, J., separate opinion)).\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nThe statutes do not just apply to highways but to all roads. So, even if the highways are not public fora, the statutes apply to streets that clearly are public fora. Finally, because the statutes regulate a private party's speech on his or her own property, they are subject to the highest level of scrutiny, that applied to the regulation of a public forum. See Arlington County Republican Comm. v. Arlington County, 983 F.2d 587 (4th Cir. 1993) (subjecting a regulation limiting the number of signs a landowner was allowed post on his or her own property to normal time, place, and manner analysis).\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nVII. SEVERABILITY\n\nIn view of the foregoing Discussion, neither secondary effects analysis nor non-public forum analysis eliminates the problems of content discrimination in Chapter 11. As a result, we hold to our view that Subchapter I of that Chapter is unconstitutional because it contains an exception for signs announcing a town, village, or city or advertising itself or its local industries, meetings, buildings, historical markers, or attractions. We also continue to believe that the constitutionality of the other exceptions in Subchapter I, as well as those in Subchapters II and III, depends on further development of the record.\n\nIt is settled law that in a challenge to the constitutionality of a statute, \"'a court should refrain from invalidating more of the statute than is necessary.'\" Alaska Airlines, Inc. v. Brock, 480 U.S. 678, 684, 107 S. Ct. 1476, 1479, 94 L. Ed. 2d 661 (1987) (quoting Regan v. Time, Inc., 468 U.S. 641, 652, 104 S. Ct. 3262, 3268, 82 L. Ed. 2d 487 (1984)). Thus, it may be that we should sever the offending provision of Subchapter I, or at least sever Subchapter I as a whole, and leave the rest of the statute intact.\n\nWhen a federal court is called upon to invalidate a state statute, the severability of the constitutional portions of the statute are governed by state law, here the law of Delaware. See Planned Parenthood of Southeastern Pa. v. Casey, 978 F.2d 74, 77 (3d Cir. 1992) (modified on other grounds). Generally, the severability of a statute is a question of legislative intent as to the specific provision. As one commentator explained:\n\nSeparability questions are essentially questions of statutory construction, to be determined according to either the will of the legislature or its manifested meaning. Judicial opinions are replete with statements that separability is to be decided according to the legislative intent.\n\nThe problem is twofold: the legislature must have intended that the act be separable, and the act must be capable of separation in fact.\n\n2 Norman J. Singer, Sutherland Statutory Construction § 44.03, at 483 (4th ed. 1986). As to the first prong, where the legislative intent is not clear from the statute itself, the Delaware courts derive the necessary intent from Delaware's general severance provision, Del. Code Ann. tit. 1, § 308. See State v. Dickerson, 298 A.2d 761, 766 (Del. 1972). Section 308 provides:\n\nIf any provision of the Code or amendments hereto, or the application thereof to any person, thing or circumstance is held invalid, such invalidity shall not affect the provisions or application of this Code or such amendments that can be given effect without the invalid provisions or application, and to this end the provisions of the Code and such amendments are declared to be severable.\n\nDel. Code Ann. tit. 1, § 308. Accordingly, absent a showing that the Delaware legislature specifically intended the provisions not to be severable, which has not been made in this case,\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e the question normally would devolve to the second prong of the inquiry --whether the remaining provisions have a separate purpose and are capable of functioning independently. See In the Matter of Oberly, 524 A.2d 1176, 1182 (1987).\n\nIf we eliminated the exception in Subchapter I regarding advertising local industries and meetings, the rest of the statute could surely function independently. However, we are unwilling to sever the exception, because our severability inquiry here has a constitutional dimension. Eliminating the offending exception would mean that we would be requiring the State to restrict more speech than it currently does.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e All existing restrictions would apply, plus there would be a restriction on signs advertising local industries and meetings. To our knowledge, no court has ever mandated issuance of an injunction such as that, and we decline to be the first. In Mosley, without even commenting on the possibility of eliminating the exception for peaceful labor picketing, the Supreme Court struck down a statute banning picketing near a school rather than striking down the exception. See Mosley, .\n\nWe refuse to strike down the exception in part because of the special status of speech in our constitutional scheme, a scheme which generally favors more speech. A second reason is that if courts were to sever exceptions from content discriminatory statutes, individuals would lose much of their incentive to challenge such statutes, because those whose speech is banned would often not benefit from the remedy. For example, (Rappa would remain unable to post signs.) If we decide to eliminate the content-based exception in Chapter 11. Thus, we hold that the proper remedy for content discrimination generally cannot be to sever the statute so that it restricts more speech than it did before -- at least absent quite specific evidence of a legislative preference for elimination of the exception. Absent a severability clause much more specific than § 308, we refuse to assume that the Delaware legislature would prefer us to sever the exception and restrict more speech than to declare Subchapter I invalid.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nThe only other way we could refrain from striking down Subchapter I altogether would be to countenance an injunction similar to that issued by the district court. Generally, when courts have found billboard statutes to involve content discrimination, they have mandated that states permit all speech with a higher place in the constitutional hierarchy than the speech allowed by the statutory exemption. For example, the Metromedia Court suggested that on remand, the California courts could rescue the San Diego ordinance by holding that non-commercial speech had to be allowed since commercial speech was allowed. See 453 U.S. at 521-23 n.26, 101 S. Ct. at 2899-2900 n.26. The district court here required the state to allow political speech to the same extent that it allowed other speech under a variety of exceptions to the statute. See Rappa, 813 F. Supp. at 1082.\n\nHowever, the district court's injunction in this case itself perpetuates the constitutional infirmity by leaving in place the sweeping restrictions on most signs -- for example, on non-commercial, non-political ideological signs unrelated to the property on which they stand. Allowing political speech to a greater extent than other non-commercial speech unrelated to the property entails content discrimination. Our test does not tolerate it; nor would it endure under the reasoning of the Metromedia plurality, which found content discrimination in the San Diego ordinance impermissible partly because that ordinance exempted temporary political campaign signs but not other non-commercial speech. See 453 d U.S. at 514, 101 S. Ct. at 2896.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nHence, there is no remedy we can implement that will sustain Subchapter I of the Delaware statute. As a result, we must invalidate it entirely.\n\nConversely, we find no similar reason to strike down Subchapters II and III. Unlike the possibility of eliminating the content-based exception in Subchapter I, striking down all of Subchapter I, while leaving Subchapters II and III intact, increases the amount of speech the law allows. This remedy eliminates a subchapter that restricts speech rather than eliminating an exception that allows speech. And the other requirements of severability are met. In particular, as discussed supra p.73, Delaware has statutorily expressed a legislative preference for severability, and we find no specific contrary evidence before us. Moreover, there is no inhibition to each subchapter operating independently, and each subchapter independently helps serve the State's interests in safety and aesthetics. Finally, an additional, primary purpose of Chapter 11 is to ensure Delaware's receipt of the fullest possible amount of federal-aid highway funds. Subchapter II is clearly drafted to meet the relevant requirements established by the Federal Highway Beautification Act, 23 U.S.C. § 131. Accordingly, Subchapter II alone serves an important, independent state interest.\n\nAlthough we believe that Subchapters II and III are severable from Subchapter I, we must remand to the district court for consideration of whether these subchapters, standing alone, are constitutional. In particular, the district court will have to determine if sufficient, independent justifications exist for whatever content-based exceptions exist in Subchapters II and III for in other words, it will have to determine if the exceptions \"for sale\" or \"for lease\" signs, for official signs pertaining to natural wonders, scenic, and historic attractions, and perhaps for signs on school bus waiting shelters, are narrowly tailored to serve a substantial state interest at least as great as the state's aesthetic and safety interests in banning the signs. See supra Part IV. B. Additionally, the district court will have to determine whether Subchapters II and III meet the requirements for time, place and manner regulations. See infra Part VIII. In order to assist the district court in making these determinations in this complex, difficult case, we add the following observations.\n\nVIII. TIME, PLACE AND MANNER\n\nThe Supreme Court has explained that:\n\nEven in a public forum the government may impose reasonable restrictions on the time, place, or manner of protected speech, provided [1] the restrictions \"are justified without reference to the content of the regulated speech, [2] that they are narrowly tailored to serve a significant governmental interest, and [3] that they leave open ample alternative channels for communication of the information.\"\n\nWard, 491 U.S. at 791, 109 S. Ct. at 2753 (1989) (quoting Clark v. Community for Creative Non-Violence, 468 U.S. 288, 293, 104 S. Ct. 3065, 3069, 82 L. Ed. 2d 221 (1984)). The first of these requirements should pose no serious problem on remand. As the district court recognized in commenting on the validity of the city's sign ordinance, see Rappa, 813 F. Supp. at 1018, the sufficiency of the government's interest in aesthetics and safety has, by this juncture, become unquestioned.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e And, while subject to greater doubt, we suspect that Chapter 11 is probably sufficiently narrowly tailored to accomplish these aesthetic and safety interests.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Resolution of the requirement that Chapter 11 leaves open ample alternative channels of communication is, however, quite another matter.\n\nThe state defendants make two arguments to demonstrate the existence of sufficient alternative avenues of communication. First, they argue that the Delaware statute leaves sufficient areas open in which signs may be erected. Second, they argue that there are a number of alternative media that may be used to replace signs as a means to convey political campaign messages. We will address these contentions in turn.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nAs Chapter 11 currently stands, it leaves open only a few areas in which signs covered by the statute may be erected, for example certain portions of urban areas. And because Subchapters II and III contain only very limited exceptions, essentially all signs visible from the road will be prohibited on roads covered by these provisions. See Del. Code Ann. tit. 17, § 1121, 1131; supra Part II. However, if we sever Subchapter I of Chapter 11, an individual will be able to post signs on a significant proportion of roads in the State. Whether the ability to post signs along these roads constitutes an adequate alternative channel of communication to the ability to post signs along the roads covered by Subchapters II and III depends on the extent to which the latter roads are fundamental for communication. Cf. Wheeler v. Comm'r of Highways, 822 F.2d 586, 596 (6th Cir. 1987), cert. denied, 484 U.S. 1007, 108 S. Ct. 702, 98 L. Ed. 2d 653 (1988) (upholding a ban on most signs near interstate or federal-aid primary highways). There are simply not enough facts in the record to address this question.\n\nThe state defendants also argue that there are more than ample alternative channels of communication available because Chapter 11 in no way restricts the use of other media, such as print, radio, television, and leafletting. In Taxpayers for Vincent, where the Court sustained a restriction on posting signs on public property, it emphasized that \"nothing in the findings indicates that the posting of political posters on public property is a uniquely valuable or important mode of communication,\" 466 U.S. at 812, 104 S. Ct. at 2133.\n\nHowever, unlike the plaintiffs in Taxpayers for Vincent, Rappa has introduced powerful expert testimony tending to show that other media does not provide a sufficient alternative. According to Rappa's expert, political signs are uniquely effective in developing name recognition for unknown candidates. The expert contended that the use of most other media, such as television and radio, would have been prohibitively expensive.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e See, e.g., Baldwin v. Redwood City, 540 F.2d 1360, 1368 (9th Cir. 1976), cert. denied, 431 U.S. 913, 97 S. Ct. 2173, 53 L. Ed. 2d 223 (1977). And less expensive media, such as leafletting or canvassing, allegedly are both extremely time consuming, see Arlington County Republican Comm., 983 F.2d at 595, and ineffective.\n\nBut this evidence did not stand uncontested. Defendants introduced an affidavit from the Executive Director of the Republican State Committee of Delaware which indicated that a barrage of radio announcements is the most effective means of gaining name recognition in the Delaware market. Moreover, after we excise Subchapter I, the alternative of radio (and perhaps television) must be considered in combination with the alternative of posting signs on roads not governed by Subchapters II and III. The district court should analyze this combination on remand to determine whether to uphold Subchapters II and III because political candidates retain adequate alternative channels of communication.\n\nWe also note that the restrictions at issue implicate not only the First Amendment rights of political candidates, but of residents of roadside property (homeowners or lessees) as well. See Arlington County Republican Comm. v. Arlington County, 983 F.2d at 595 (\"In addition, the County's laundry list [of alternative methods] fails to recognize that the two-sign limit infringes on the rights of two groups: the candidates and the homeowners. Homeowners also express their views by posting political signs in their yard.\"). Even if a person in Rappa's position has alternatives available, the average homeowner may have few, if any, viable alternative avenues by which to communicate. See id. at 594-95 (concluding that county zoning ordinance limiting property owners in residential districts to two temporary political signs \"leaves no viable alternative means of political speech\"). Posting a sign on one's own property may not only be easier and less expensive than alternative means of communication, but may be a unique means of self-expression for the property owner for whom the sign says not only that Rappa should be a Congressman but also that \"I, John Doe, owner of this piece of property, support Rappa for Congress.\"\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e The fact that we have struck down Subchapter I of Chapter 11 provides little help to those residents who live along roads on which the posting of signs continues to be forbidden.\n\nOn remand, defendants may be able to show that homeowners do have ample alternative channels of communication despite the existence of Chapter 11. Moreover, in order for Rappa to assert the First Amendment interests of the homeowners, the statute must be substantially overbroad \"Judged in relation to the statute's plainly legitimate sweep.\" See Broadrick v. Oklahoma, 413 U.S. 601, 615, 93 S. Ct. 2908, 2917-18, 37 L. Ed. 2d 830 (1973). As of now, there is no evidence in the record that enough people live alongside the roads affected by Subchapters II and III to ground an overbreadth challenge. On remand, of course, plaintiff can introduce such evidence and thus argue that Subchapters II and III are invalid time, place, and manner restrictions because they leave homeowners, as well as politicians, with inadequate alternative channels of communication.\n\nIX. QUALIFIED IMMUNITY\n\nThe individual state and county defendants have appealed the district court's denial of their motions for summary judgment based on assertions of qualified immunity. See Rappa, 813 F. Supp. at 1082. The parties agree that the only immunity issue before the district court and before us is the individual defendants' qualified immunity as to the facial unconstitutionality of the respective restrictions on outdoor signs.\n\nIn evaluating a claim of qualified immunity, the court considers whether the official's conduct \"violated clearly established statutory or constitutional rights of which a reasonable person would have known.\" Harlow v. Fitzgerald, 457 U.S. 800, 818, 102 S. Ct. 2727, 2738, 73 L. Ed. 2d 396 (1981).\n\nIn order for the governing law to be sufficiently well established for immunity to be denied, it is not necessary that there have been a previous precedent directly in point. . . . The ultimate issue is whether, despite the absence of a case applying established principles to the same facts, reasonable officials in the defendants' position at the relevant time could have believed, in light of what was in the decided case law, that their conduct would be lawful.\n\nGood v. Dauphin County Social Services, 891 F.2d 1087, 1092 (3d Cir. 1989); accord Abdul-Akbar v. Watson, 4 F.3d 195 (3d Cir. 1993).\n\nA. Qualified Immunity of Defendant Justice\n\nRappa argues that in light of Metromedia, in which the Court found a similar San Diego law unconstitutional, any reasonable official in the defendant's position would have known that Chapter 11 was facially unconstitutional under the First and Fourteenth Amendments. Justice, the former Secretary of Highways, provides three primary responses. First, he asserts that the effect of the decision in Metromedia, with its five separate opinions, was not clear. Second, he argues that Chapter 11 is content-neutral under the secondary effects doctrine. Finally, Justice submits that existing case law has found statutes similar to Delaware's constitutional under the reasoning of Metromedia. We conclude that Justice has the better of the argument, and that based on the above reasoning, he is entitled to summary judgment as to Rappa's facial challenge on the ground of qualified immunity.\n\nWe have concluded, see supra Part III. C., that the Metromedia Court, because of its splintered reasoning, failed to establish a clear, binding standard by which to evaluate statutes regulating outdoor advertising. Cf. Abdul-Akbar, 4 F.3d at 202-03 (concluding that the standard announced in Bounds v. Smith, 430 U.S. 817, 828, 97 S. Ct. 1491, 1498, 52 L. Ed. 2d 72 (1977), as to what would constitute the constitutionally required \"adequate\" law libraries and assistance from legally trained individuals was sufficiently indefinite that the defendant officials did not violate a clearly established constitutional right). Accordingly, Justice was left to ascertain the constitutionality of Chapter 11 under more general First Amendment analysis. We find that the state officials reasonably could have concluded that Chapter 11 was a constitutional time, place, and manner restriction on the posting of outdoor signs.\n\nFirst, we believe that Justice reasonably could have relied on the secondary effects doctrine to conclude that Chapter 11 is content-neutral. Contrary to the argument of the plaintiff and the statement of the district court, See Rappa, 813 F. Supp. at 1081, the secondary effects doctrine has not been restricted to the zoning of sexually explicit businesses. In Ward, the Supreme Court expressly applied the secondary effects doctrine outside that narrow context. See Ward, 109 S. Ct. at 2754; id. at 2761 n.1 (Marshall, J., Dissenting) (\"Today, for the first time, a majority of the Court applies Renton analysis to a category of speech far afield from that decision's original limited focus.\"). Moreover, in Wheeler, 822 F.2d at 590, the Court of Appeals for the Sixth Circuit found a Kentucky statute regulating billboards constitutional under secondary effects analysis. Although our Conclusion as to secondary effects is contra, see supra Part V, a reasonable official in Justice's position could have concluded that Chapter 11 was constitutional under the secondary effects doctrine.\n\nOnce Justice concluded that Chapter 11 did not unconstitutionally discriminate based on content, we believe that he also reasonably could have concluded that there were constitutionally sufficient alternative channels for communication. We reach this Conclusion even though we have remanded on the issue of whether Chapter 11 violated the test for time, place, and manner regulations because when Justice's actions occurred, uncertainty over the validity of regulations such as Chapter 11 was widespread. See Bond, supra, at 2488. In addition, Justice points to two specific cases that found restrictions on signs to be acceptable under time, place, and manner analysis -- Wheeler, supra Part VIII, and Taxpayers for Vincent, supra Part VIII. Although both cases are distinguishable,\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e we nevertheless believe that a \"reasonable official in the defendant's position at the relevant time could have believed, in light of what was in the decided case law, that [his] conduct would be lawful.\" Good, 891 F.2d at 1092.\n\nAccordingly, we will reverse the district court's order denying summary judgment with respect to Justice and remand with direction to enter summary judgment in favor of Justice on the claim for damages to the extent that it is based on the facial invalidity of Chapter 11.\n\nB. Qualified Immunity of the Individual County Defendants\n\nAlthough the county ordinance varies from Chapter 11 in a number of particulars, the underlying analysis of the qualified immunity question is the same. The exemptions in the county ordinance were no more clearly content-based than were those in the state statute; nor did the overarching ban constitute a more severe time, place, and manner restriction than Chapter 11. Thus, for the reasons discussed, supra Part IX. A, we will reverse the district court's denial of summary judgment and remand with direction to enter summary judgment in favor of the individual county defendants on the claim for damages to the extent that the claim is based on the facial invalidity of the county ordinance.\n\nX. CONCLUSION\n\nFor the foregoing reasons, we will affirm the district court's summary judgment in favor of Rappa that Subchapter I of Chapter 11 is facially invalid. We arrive at this Conclusion, however, based on different reasoning than that the district court employed. In our view, Subchapter I is unconstitutional because the exception for signs advertising local industries or meetings impermissibly discriminates between these signs and other signs unrelated to the property or its use. We will therefore vacate the district court's more limited injunction as to Subchapter I and direct it to enter an injunction generally prohibiting enforcement of that subchapter.\n\nSubchapters II and III, however, have separate import and may operate independently of Subchapter I. To determine whether severance of Subchapter II or III is appropriate, the district court must adJudge whether each subchapter is independently constitutional. Because we cannot make this determination on the present record, we will vacate the judgment with respect thereto and remand to the district court for its consideration of these questions. The district court should consider both whether the various exceptions contained in these subchapters for signs that are related to their location meet the other requisites we have set out for content-based exceptions from a general ban and whether these subchapters leave open ample alternative channels of communication to survive the test for time, place and manner regulations. In the interim, we will vacate the district court's injunction as to Subchapter II.\n\nOn the issue of qualified immunity, we hold that the defendant officials reasonably could have concluded that Chapter 11 and the county ordinance, respectively, were constitutional time, place, and manner restrictions on the use of outdoor signs. Accordingly, we will reverse the district court's denial of summary judgment as to the motions of the individual state and county defendants and remand with direction to the district court to enter summary judgment in favor of the individual defendants on Rappa's claims for damages to the extent that those claims are based on the facial invalidity of Chapter 11 and the county ordinance. Rappa may still seek damages against these defendants to the extent he asserts that they applied the statute in a manner that was clearly unconstitutional under either the First Amendment or the Due Process Clause.\n\nParties shall bear their own costs.\n\nALITO, Circuit Judge, Concurring:\n\nWhile I completely agree with most of the court's opinion, I would, if sitting alone, employ a method of analysis somewhat different from that used by the court. Nevertheless, because this analysis would lead to Conclusions quite similar to those reached by the court and because I think it is important for the panel to agree on a judgment and rationale, I concur in the court's judgment and opinion. I will, however, very briefly explain my own preferred method of analysis.\n\nI view both subchapter I\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e and subchapter II\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e of Title 17, chapter 11 of the Delaware Code as essentially banning signs (within the areas they cover) with two significant exceptions and a number of other exceptions that are insignificant for present purposes. The two significant exceptions pertain to \"for sale\" signs and signs relating to on-site activities. The exceptions that are not important for present purposes are, first, those exceptions, such as the exceptions for directional and warning signs, that are narrowly tailored to further the state's compelling interest in highway safety and could thus survive the test for a content-based restriction on speech (see Maj. Typescript at 55) and, second, those exceptions that I believe are truly de minimis, such as those for highway beautification signs and signs announcing a municipality or a local attraction. Since subchapters I and II (within the areas they cover) ban all signs not falling under their listed exceptions, I think that both subchapters should, at the outset, be tested to see if they can at least pass the test that would be applied to a content-neutral law restricting the locations in which all signs may be placed. Subchapter I, in my view, cannot survive that test. Under that test, a law must, among other things, be \"narrowly tailored to serve a significant governmental interest.\" Ward v. Rock Against Racism, 491 U.S. 781, 791, 105 L. Ed. 2d 661, 109 S. Ct. 2746 (1984) (quoting Clark v. Community for Creative Non-Violence, 468 U.S. 288, 293, 82 L. Ed. 2d 221, 104 S. Ct. 3065 (1984). While Delaware's interests in traffic safety and highway beautification are significant, subchapter I is not narrowly tailored. This subchapter generally prohibits signs on all property within 25 feet of the right of way of all portions of every state highway except for those portions that are located within an incorporated town or city but not within a \"controlled area.\" This regulation sweeps broadly and indiscriminately, and I cannot see how it can be viewed as narrowly tailored. Subchapter II, by contrast, has a very limited geographical reach, applying only to areas adjacent to the interstate and primary highway system, and therefore I think it can survive the test for a content-neutral time, place, or manner restriction. See Wheeler v. Commissioner of Highways, Commonwealth of Kentucky, 822 F.2d 586, 594-96 (6th Cir. 1987), cert. denied, 484 U.S. 1007, 98 L. Ed. 2d 653, 108 S. Ct. 702 (1988).\n\nThe question remains, however, whether subchapter II's exceptions for \"for sale\" signs and signs relating to on-site activities render the subchapter content-based. There is no easy answer to this question. Until the Supreme Court provides further guidance concerning the constitutionality of sign laws (see Maj. Typescript at 42 n.29), I endorse the test set out in the court's opinion (see Maj. Typescript at 51).\n\nGARTH, J., Dissenting and Concurring :\n\nI Dissent from the judgment of the majority, which judgment results in vacating the orders of the district court pertaining to Subchapters II and III of Chapter 11 of the Delaware law, and which judgment sustains the constitutionality of those subchapters. Even more so, I disagree with the majority's analysis which departs from the instructions of Metromedia, Inc. v. San Diego, 453 U.S. 490, 69 L. Ed. 2d 800, 101 S. Ct. 2882 (1981).\n\nAs to Subchapter I, I agree with my colleagues in the majority that the district court order holding Subchapter I unconstitutional must be affirmed, excepting, however, for directional and warning signals. See Del Code Ann. tit. 17, §§ 1108(a), 1108(b), 1114(4).\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e I also agree with the majority that we must reverse the district court order which denied qualified immunity to the individual defendants and that on remand, summary judgment should be entered in the individual defendant's favor on Rappa's claims for damages.\n\nIn order to highlight my disagreement with the panel majority, let me say at the outset that I believe that we are bound by the pronouncements of the Supreme Court in Metromedia. The panel majority does not. Yet, in my view, Metromedia governs the Disposition of this appeal.\n\nApplying the standard of Metromedia, I would -- excepting only for directional and warning signs -- affirm District Court Judge Fullam's order that all three subchapters of the Delaware statute constitute an impermissible restriction on protected speech, and are facially unconstitutional under the First and Fourteenth Amendments to the U.S. Constitution.\n\nI.\n\nContrary to the position of the majority of this panel, I believe that Metromedia is the controlling authority in this case. While not a model of clarity, Metromedia provides a sufficient standard for us to apply. Many other courts have so held. See, e.g., Matthews v. Town of Needham, 764 F.2d 58, 60 (1st Cir. 1985) (following Metromedia plurality opinion in striking down as impermissible content-based regulation local bylaw which permitted posting of certain commercial signs but prohibited posting of political signs on residential property); National Advertising Co. v. Town of Babylon, 900 F.2d 551, 556-57 (2nd Cir.) (applying standard of Metromedia plurality in invalidating on First Amendment grounds content-based ordinance favoring commercial speech over political and other noncommercial speech), cert. denied, 498 U.S. 852, 112 L. Ed. 2d 112, 111 S. Ct. 146 (1990); Major Media of the Southeast v. City of Raleigh, 792 F.2d 1269, 1272 (4th Cir. 1986) (applying Metromedia standard to uphold city signage ordinance because ordinance allowed substitution of non-commercial messages where commercial messages permitted), cert. denied, 479 U.S. 1102, 94 L. Ed. 2d 185, 107 S. Ct. 1334 (1987); Gilleo v. City of Ladue, 986 F.2d 1180 (8th Cir. 1993), (following Metromedia in striking down city ordinance favoring commercial speech over noncommercial speech and favoring certain types of noncommercial speech over others), cert. granted, 114 S. Ct. 55 (1993); Outdoor Sys., Inc. v. City of Mesa, 997 F.2d 604, 610 (9th Cir. 1993) (following Supreme Court's example in Metromedia and considering separately effect of signage restrictions on commercial and noncommercial speech, because Court in subsequent pronouncements never explicitly disavowed commercial-noncommercial analytical distinction);National Advertising Co. v. City of Orange, 861 F.2d 246, 248-49 (9th Cir. 1988) (applying Metromedia standard in striking down city regulation requiring examination of content of noncommercial messages for purpose of determining whether on-site signs permissibly related to activity on premises); Jackson v. City Council of Charlottesville, Va., 659 F. Supp. 470, 474 (W.D. Va. 1987) (concluding that plurality opinion in Metromedia is controlling authority in determining whether ordinance affording greater protection to commercial than to noncommercial speech is facially violative of First Amendment), aff'd in part and vacated in part without opinion, 840 F.2d 10 (4th Cir. 1988); see also Ackerley Communications of Massachusetts, Inc. v. City of Somerville, 878 F.2d 513, 516-17 (1st Cir. 1989) (interpreting majority of Metromedia Court to hold that sign regulation cannot prohibit display of noncommercial messages in places where commercial messages permitted); Georgia Outdoor Advertising v. City of Waynesville, 833 F.2d 43, 46 n. 6 (4th Cir. 1987) (distilling from Metromedia requirement that billboard-restricting ordinance not prefer commercial to non-commercial speech). Contra Wheeler v. Commissioner of Highways, 822 F.2d 586, 591, 593 (6th Cir. 1987) (upholding, as content-neutral time, place and manner restriction, ordinance restricting onsite signage to activities for which site is utilized), cert denied, 485 U.S. 944, 99 L. Ed. 2d 287, 108 S. Ct. 1127 (1988).\n\nMetromedia holds that if the government interest in regulating speech is not so great as to outweigh the placement of signs with certain commercial messages, then First Amendment principles dictate that such an interest is not great enough to outweigh an individual's right to communicate non-commercial messages in the same spot and by the same means. Delaware's stated governmental interests in restricting signs in and around the right-of-way of public highways are no different from those expressed by San Diego in Metromedia -- aesthetics and traffic safety. In exempting certain types of speech from the general prohibitions of Chapter 11, the Delaware Legislature has effectively balanced its asserted governmental interests of aesthetics and safety against the interests of those individuals, such as Rappa, who would erect political or other noncommercial signs unrelated to activities upon the real property where they are posted.\n\nThe distinction drawn by the Delaware Legislature between permitted on-site signs and impermissible signs bears no relationship to Delaware's asserted interests in aesthetics and traffic safety. A \"For Sale\" sign in the eyes of the First Amendment is no less an eyesore than a \"Rappa for Congress\" sign. See City of Cincinnati v. Discovery Network, Inc., 123 L. Ed. 2d 99, 113 S. Ct. 1505, 1514-15 (1993). Nor is there any principled basis for assuming that a \"Rappa for Congress\" sign poses more of a risk to traffic safety than, say, an eye-catching onsite advertisement. All signs, regardless of content, are equally threatening to the asserted governmental interests.\n\nBecause the distinction drawn by the Delaware Legislature between permitted signs and impermissible signs bears no relationship whatsoever to the particular interests it asserts, Chapter 11 of the Delaware Code \"is therefore an impermissible means of responding to the city's admittedly legitimate interests.\" Cf. Discovery Network, 113 S. Ct. at 1514 (striking down categorical ban on commercial newsracks which did not apply to noncommercial newsracks).\n\nHere, as in Metromedia, the allowance of some signs, but not others, is evidence that the government's asserted interests in traffic safety and aesthetics are not sufficiently compelling to justify disparate treatment between classes of speech. See Metromedia, 453 U.S. at 520 (plurality opinion) (\"the city has conceded that some communicative interests . . . are stronger than its competing interests in esthetics and traffic safety\"); see id. at 532 n.10 (Brennan, J., Concurring in judgment) (allowing exception to total billboard ban \"only if it directly furthers an interest that is at least as important as the interest underlying the total ban . . . .\").\n\nII.\n\nThe majority in this case explicitly acknowledges the insufficiency of Delaware's asserted interests in distinguishing between commercial and noncommercial and between different types of noncommercial speech: \"Here, there are no aesthetic or safety effects caused by the signs prohibited by Chapter 11 that are not also caused by the signs allowed by Chapter 11.\" Ante at (typescript at 64). The majority concludes, however, Metromedia does not control because \"there are significant differences between the ordinance at issue here and that at issue in Metromedia.\" Ante at (typescript at 41-42). I disagree. Because, contrary to the majority, I believe that Chapter 11 is substantially identical to the San Diego ordinance at issue in Metromedia, I would hold that we are bound to strike it down.\n\nLike the San Diego ordinance, Chapter 11 of the Delaware Code begins with a broad prohibition against the use of \"outdoor advertising\" on public roads as a means of promoting aesthetic values and driving safety. Chapter 11, like the San Diego ordinance, enumerates exceptions for onsite \"For Sale\" or \"For Lease\" signs, signs advertising onsite activities, beautification and landscape sponsorship signs, government signs, historical signs, signs located at public bus stops. Chapter 11, like the San Diego ordinance, \"does not generally ban [outdoor] advertising as an unacceptable 'manner' of communication information or ideas; rather, it permits various kinds of signs.\" See Metromedia, 453 U.S. at 515-16 (plurality opinion). The plurality opinion in Metromedia is on point:\n\nThere can be no question that a prohibition on the erection of billboards infringes freedom of speech: The exceptions do not create the infringement, rather the general prohibition does. But the exceptions to the general prohibition are of great significance in assessing the strength of the City's interest in prohibiting billboards. . . . By allowing commercial establishments to use billboards to advertise the products and services they offer, the city necessarily has conceded that some communicative interests, e.g., on-site commercial advertising, are stronger than its competing interests in aesthetics and traffic safety. It has nevertheless banned all noncommercial signs except those specifically excepted.\n\nGovernmental interests are only revealed and given concrete force by the steps taken to meet those interests. If the city has concluded that its official interests are not as strong as private interests in commercial communications, may it nevertheless claim that those same official interests outweigh private interests in noncommerial communications? Our answer, which is consistent with our cases, is in the negative.\n\n453 U.S. at 520-21.\n\nThe majority here appears to believe that, because the Delaware statute can be construed as not distinguishing facially between commercial or noncommercial speech, this case somehow stands on a different footing than Metromedia. See ante at (typescript at 25 and 17 n.11). As I read Metromedia, the plurality there accepted the California Supreme Court's narrowing construction of the San Diego ordinance as encompassing -- but nevertheless burdening -- noncommercial speech. Id. at 494 n.2; see also id. at 535 (Brennan, J., Concurring in judgment) (finding onsite premises exception of San Diego ordinance not limited solely to commercial speech). More to the point, the majority's construction of the Delaware statute \"of course . . . still exempts some commercial speech (onsite commercial speech, 'for sale' signs) while prohibiting some non-commercial speech (offsite non-commercial speech that does not fall into any exemption).\" Ante at (typescript at 28).\n\nIn my opinion, the district court correctly analyzed Chapter 11 under the Metromedia standard because Chapter 11 of the Delaware Code impermissibly favors commercial speech over noncommercial speech. Chapter 11, like the invalid San Diego ordinance, prohibits the display of noncommercial messages in places where commercial messages are permitted. Taking instruction from, and paraphrasing, Metromedia : \"Insofar as [Delaware] tolerates [signs] at all, it cannot choose to limit their content to commercial messages; [Delaware] may not conclude that the communication of commercial information concerning goods and services connected with a particular site is of greater value than the communication of noncommercial messages.\" 453 U.S. at 513 (plurality opinion); see also id. at 536 (Brennan, J., Concurring in judgment) (agreeing with plurality that Court's cases have accorded more protection to noncommercial than to commercial speech). But see Wheeler, 822 F.2d at 591 (upholding such a distinction as a content-neutral time, place and manner regulation).\n\nThe district court also correctly concluded that the Delaware statute impermissibly discriminates between different types of noncommercial speech. Chapter 11, as did the San Diego ordinance held to be invalid in Metromedia, exempts certain noncommercial speech (here, e.g., a sign describing a historical site; in Metromedia, temporary political signs) on the basis of content alone. As the district court found, \"The State may not in this way choose the appropriate subjects for public discourse.\" Rappa, 813 F. Supp. at 1080. See Metromedia, 453 U.S. at 514-15 (plurality opinion); see also Consolidated Edison of New York Co. v. Public Serv. Comm'n, 447 U.S. 530, 538, 65 L. Ed. 2d 319, 100 S. Ct. 2326 (1979) (\"To allow a government the choice of permissible subjects for public debate would be to allow that government control over the search for political truth\").\n\nIII.\n\nWithout reconciling its Conclusion with controlling authority, the majority has embarked on its own unconstrained interpretation of First Amendment neutrality requirements. In fashioning \"A New Test\" from the wholecloth, the majority, in my opinion, has discarded traditional doctrinal analysis and has deviated impermissibly from established principles of stare decisis.\n\nA.\n\nThe majority holds that, \"statutes aimed at a legitimate end unrelated to the suppression of speech but which nonetheless restrict speech in a certain locality may constitutionally contain content-based exceptions as long as the content exempted from restriction is significantly related to the particular area in which the sign is viewed . . ..\" Ante at (typescript at 6). Under this unprecedented formulation, content neutrality is assessed by a subjective standard, i.e., whether the restrictions \"appear to be motivated by a desire to suppress certain speech.\" See ante at (typescript at 47).\n\nWhether or not government acts with animus toward certain speech, or with \"a desire to suppress certain speech,\" is not dispositive of the question of whether a restriction on protected speech may constitutionally contain content-based exceptions. The Supreme Court has consistently \"rejected the argument that 'discriminatory . . . treatment is suspect under the First Amendment only when the legislature intends to suppress certain ideas.\" Discovery Network, 113 S. Ct. at 1516 (quoting Simon \u0026 Schuster v. Members of New York State Crime Victims Bd., 116 L. Ed. 2d 476, 112 S. Ct. 501, 509 (1991)). As the Supreme Court has cautioned, \"even regulations aimed at proper governmental concerns can restrict unduly the exercise of rights protected by the First Amendment.\" Minneapolis Star \u0026 Tribune Co. v. Minnesota Comm'r of Rev., 460 U.S. 575, 592, 75 L. Ed. 2d 295, 103 S. Ct. 1365 (1983). For this reason, government regulation of expressive activity must be deemed content-based unless \"justified without reference to the content of the regulation of the speech.\" Ward v. Rock Against Racism, 491 U.S. 781, 791, 105 L. Ed. 2d 661, 109 S. Ct. 2746 (1989) (quoting Clark v. Community for Creative Non-Violence, 468 U.S. 288, 293, 82 L. Ed. 2d 221, 104 S. Ct. 3065 (1984)).\n\nUnder the new test of the majority, whether any particular sign is permissible is determined by the message the sign conveys. \"Thus, by any commonsense understanding of the term, the ban in this case is 'content-based.'\" Discovery Network, 113 S. Ct. at 1516-17. Except for directional and warning signs, however, Delaware's differential treatment of protected speech furthers no asserted state interest. The Court, time and again, has rejected an asserted state interest that has \"'nothing to do with the state's content-based distinctions among expressive activities.'\" Burson v. Freeman, 119 L. Ed. 2d 5, 112 S. Ct. 1846, 1865 (1992) (Stevens, J., Dissenting) (quoting Simon \u0026 Schuster, Inc. v. Members of New York Crime Victims Bd., 116 L. Ed. 2d 476, 112 S. Ct. 501 (1991)); see also Discovery Network, 113 S. Ct. at 1517; Arkansas Writers' Project, Inc. v. Ragland, 481 U.S. 221, 231, 95 L. Ed. 2d 209, 107 S. Ct. 1722 (1987). The absence of any neutral justification for all but the directional and warning signs exceptions to the general prohibition of Chapter 11 infects the entire statute and requires invalidation under established First Amendment jurisprudence.\n\nThe majority therefore errs in suggesting that the exceptions found in Subchapters II and III of Chapter 11 can be justified as legitimate time, place, or manner restrictions on protected speech. This must be so because \"in time, place, and manner cases, the regulation's justification is a central inquiry.\" Burson v. Freeman, 112 S. Ct. at 1859 (Kennedy, J., Concurring) (citations omitted); see also Discovery Network, 113 S. Ct. at 1517 (\"regardless of whether or not [content-based speech restriction] leaves open ample alternative channels of communication, it cannot be justified as a legitimate time, place, or manner restriction on protected speech\"). But see Wheeler, 822 at 591 (holding ordinance similar to both San Diego ordinance in Metromedia and Delaware statute in the instant case to be constitutional as a content-neutral time, place and manner restriction).\n\nBy the majority's standard, whether or not a sign may be maintained on a particular property depends upon the kind of message the sign seeks to convey. Only if the sign conveys the right message (i.e., \"significantly related to the particular area\") is it permissibly posted. If the function of the property is to sell liquor, then a \"Reckless Eddie's Packaged Goods\" sign would be permissible while a \"Don't Drink and Drive\" sign would be impermissible. Although such distinctions may appear benign, I agree with the First Circuit that the \"preference for the 'functions' of certain signs over those of other (e.g., political) signs is really nothing more than a preference based on content.\" Matthews v. Town of Needham, 764 F.2d at 60.\n\nFurthermore, the majority's property-compatibility standard vests enforcement officials with unbridled discretion to decide which activities are site-specific and which are not. A single official, for example, could remove a \"JOE SMITH FOR COUNCIL\" sign from the front lawn of Joe Smith's house, because, in the opinion of that official, Smith's political sign might not be \"significantly related to the particular area in which the sign is viewed\" -- even though Smith may run his campaign out of his house. Yet, Smith's well-financed opponent might well prominently display \"DEFEAT JOE SMITH\" signs at as many campaign offices as campaign contributions will support, because, in the view of that same enforcement official, that sign would reflect the nature of the on-site political activities. Such a result risks discrimination against unpopular viewpoints. Metromedia, 453 U.S. at 536-37 (Brennan, J., Concurring in judgment) (ordinance which permits governmental unit to determine, in the first instance, whether speech is commercial or noncommercial, \"entails a substantial exercise of discretion by a city's official\" and therefore \"presents a real danger of curtailing noncommercial speech in the guise of regulating commercial speech\"); cf. Discovery Network, 113 S. Ct. at 1513 n.19 (\"the responsibility for distinguishing between [protected speech] carries with it the potential for invidious discrimination of disfavored subjects\"); Arkansas Writers' Project, Inc. v. Ragland, 481 U.S. 221, 230, 95 L. Ed. 2d 209, 107 S. Ct. 1722 (1987) (\"official scrutiny of the content of publications as the basis for imposing a tax is entirely incompatible with the First Amendment's guarantee of freedom of the press\").\n\nUnder the majority's formulation, government may not only ascribe a higher value to a commercial sign (e.g., \"Reckless Eddie's Packaged Goods\") than to a noncommercial sign (e.g., \"Don't Drink and Drive\"), it may also ascribe a higher value to one viewpoint (e.g., \"Defeat Smith\") than to another (e.g., \"Elect Smith\"). In fashioning a standard requiring consideration of the function of the property, the majority invites government to disguise its preference for or against the content or the viewpoint of a particular message by simply asserting its preference for the function of the sign. Such a result, in my opinion, is patently unconstitutional. Boos v. Barry, 485 U.S. 312, 319, 99 L. Ed. 2d 333, 108 S. Ct. 1157 (1988); cf. Linmark Assocs., Inc. v. Township of Willingboro, 431 U.S. 85, 52 L. Ed. 2d 155, 97 S. Ct. 1614 (1977) (invalidating as impermissible content-based regulation ordinance prohibiting posting of \"For Sale\" and \"Sold\" signs).\n\nI would hold that limiting noncommercial signs to advocacy of onsite activities, is itself, an unconstitutional content-based regulation.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e See Metromedia, 453 U.S. at 513 (government may not \"prohibit[] an occupant from displaying its own ideas or those of others\"); see also City of Orange, 861 F.2d at 249 n.3 (declining to address this precise issue, but noting that plurality opinion in Metromedia lends support to proposition that offsite/onsite distinction between noncommercial messages would be invalid); Burkhart Advertising Inc. v. Auburn, 786 F. Supp. 721, 732 (N.D. Ind. 1991) (finding ordinance prohibiting off-premise billboards impermissibly content-based \"because the determination of whether the billboard is considered 'on-premise' or 'off-premise' depends upon what it says, i.e., does it promote a business or activity at the location of the billboard?\").\n\nB.\n\nThe exemptions of the Delaware statute are impermissibly content-based. They cannot be justified without reference to the content of the signs. The majority acknowledges this, as it must. Because there are no secondary effects attributed to the excepted signs that distinguish them from the impermissible signs allowed under Chapter 11 of the Delaware Code, the majority must concede that \"any justification for treating these signs differently must rely on the content of these signs.\" Ante at (typescript at 64-65). Having so found, the majority is bound by Supreme Court precedent to strike down Chapter 11, excepting only for directional and warning signs. See, e.g., Perry Educ. Ass'n v. Perry Local Educators' Ass'n, 460 U.S. 37, 45, 74 L. Ed. 2d 794, 103 S. Ct. 948 (1983) (any restrictions of noncommercial speech based on its content can be justified only by a compelling state interest and only if they are narrowly drawn to achieve that interest); Police Dep't of Chicago v. Mosley, 408 U.S. 92, 99, 33 L. Ed. 2d 212, 92 S. Ct. 2286 (1972) (content-based restrictions on protected speech must be carefully scrutinized).\n\nAll other exceptions of Chapter 11, even as the statute is construed by the majority to permit both commercial and noncommercial signs related to an on-premise activity, are unconstitutional because they cannot be justified without reference to the content of the regulated speech and cannot be justified by the interests asserted by Delaware. The Delaware statute, as did the San Diego ordinance in Metromedia, thus violates First Amendment neutrality. See Metromedia, 453 U.S. at 517-21. The majority suggests as much when it acknowledges: \"Under a literal understanding of 'content-based,' the fact that Chapter 11 exempts speech of certain content from its prohibitions (for example, \"for sale\" signs and directional signs) makes the statute content-based.\" Ante at (typescript at 23) (citing Discovery Network, 113 S. Ct. at 1516).\n\nC.\n\nTo justify its result in the face of the content-based exceptions of Chapter 11, the majority engages in a remarkable analytical process. First, it dismisses the respective analytical approaches of the Metromedia plurality, the concurrence, and the Dissent. It then proceeds -- without any supporting authority -- to concoct its own property-compatibility formulation, substituting this novel test for the considered opinions of all members of the Metromedia Court and in disregard of firmly-entrenched First Amendment jurisprudential standards. Finally, and inexplicably, it tacks on to this new formulation the test proposed by the two-Justice Metromedia concurrence, a test which the majority of this panel does not even believe \"'articulates a legal standard which, when applied, will necessarily produce results with which a majority of the Court from that case would agree,'\" ante at (typescript at 38 (quoting Planned Parenthood v. Casey, 947 F.2d 682, 693 (3d Cir. 1991), modified on other grounds, 120 L. Ed. 2d 674, 112 S. Ct. 2791 (1992), or produces a desirable result. Ante at (typescript at 49).\n\nI know of no rule of law which countenances the majority's Disposition of this case. Certainly nothing in the jurisprudence of the Supreme Court, or in ours, suggests that a three-Judge panel of a court of appeals is free to substitute its judgment for that of a four-Justice plurality opinion, let alone that of the entire Court. The majority concedes, in a footnote, that its approach is unprecedented, but justifies its disregard of established principles of stare decisis as an extrapolation of the general reasoning of Casey. Ante at (typescript at 38 n.24). Nothing in Casey, however, suggests that we have the power, indeed the option, to overrule a plurality opinion of the Supreme Court.\n\nD.\n\nThe result reached by the majority is all the more perplexing because, as the majority acknowledges, a \"straightforward application of the plurality opinion would probably lead to an invalidation of the Delaware statute at issue in this case -- although it would so on only one of the two grounds articulated by the plurality.\" Ante at (typescript at 27). That rationale was sufficient for the Ninth Circuit in City of Orange, 861 F.2d at 247-48, to strike down a regulation which, similar to the Delaware statute as construed by the majority of this panel, permitted both commercial and noncommercial on-site signs only if related to an activity on the premises. The Ninth Circuit interpreted Metromedia as requiring invalidation of an ordinance restricting the posting of signs if the ordinance either (1) imposes greater restrictions on noncommercial than on commercial billboards or (2) regulates noncommercial billboards based on their content. The Ninth Circuit found no need to decide whether the ordinance challenged in City of Orange passed the first test of Metromedia because the ordinance clearly violated the second test of Metromedia. 861 F.2d at 248 (citing Metromedia plurality at 453 U.S. at 513).\n\n\"Based on just such reasoning,\" I would follow the example of our sister circuits, and strike down Chapter 11 in its entirety, excepting only for directional and warning signs.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Compare ante at (typescript at 28, 38) with Town of Babylon, 900 F.2d at 557; Ladue, 986 F.2d at 1182; City of Orange, 861 F.2d at 247-48. I would do so because \"not only is it the rationale of a Supreme Court plurality, but it seems to flow easily out of the Court's general First Amendment jurisprudence on content neutrality.\" See ante at (typescript at 30).\n\nIV.\n\nIn my view, the Delaware statute, excepting only for directional and warning signals, must be struck down because it violates both tests of the Metromedia plurality: it imposes greater restrictions on noncommercial speech than on commercial speech and it regulates noncommercial speech based solely on its content. Metromedia, 453 U.S. at 513-16 (plurality); see also id. at 532 n.10 (Brennan, J., Concurring in judgment) (\"To the extent that exceptions rely on content-based distinctions, they must be scrutinized with special care\"). The majority of this panel turns the First Amendment on its head when it suggests that a \"For Sale\" sign is entitled to greater protection under the First Amendment than a \"Rappa for Congress\" sign, merely because of the coincidence of location. Where the suppression of political speech is involved, as it is in the instant case, we must be particularly vigilant. As the Court has repeatedly instructed, \"the First Amendment 'has its fullest and most urgent application' to speech uttered during a campaign for political office.\" Burson v. Freeman, 112 S. Ct. at 1850 (plurality opinion) (quoting Eu v. San Francisco Democratic Comm., 489 U.S. 214, 223, 103 L. Ed. 2d 271, 109 S. Ct. 1013 (1989)) (additional citation omitted).\n\nEven accepting that the more recent pronouncement of the Court in Discovery Network elevates commercial speech to the same level of noncommercial speech in the hierarchy of First Amendment values, I find no support for the majority's elevation of commercial speech over political and other noncommercial speech, or for its tacit approval of disparate treatment between classes of noncommercial speech. Unlike the majority of this panel, however, I do not read Discovery Network to undermine the essential lessons of Metromedia, i.e., that government may neither ban noncommercial billboards in places where commercial billboards are permitted, nor discriminate between different types of noncommercial speech. To the contrary, the Court in Discovery Network emphasized its animosity towards underinclusive restrictions of protected speech -- the very constitutional infirmity of the statute from which the Cincinnati regulation in Discovery Network, the San Diego ordinance in Metromedia, and the Delaware statute at issue in this case all suffer. Discovery Network teaches that government may not distinguish between commercial and noncommercial offsite speech that cause the same aesthetic and safety concerns.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e If such disparate treatment is unconstitutional as between commercial and noncommercial offsite speech, it follows a fortiori that it is unconstitutional as between onsite commercial speech (e.g., site-specific \"for sale\" signs) and other protected speech (e.g., non-\"context-sensitive\" political campaign signs) that also cause the same aesthetic and safety concerns.\n\nV.\n\nBecause the challenged Delaware statute, even as construed by the majority, does not allow any political or other non-commercial message to be placed on a conforming commercial sign, it effectively prefers commercial speech over noncommercial speech. Because it allows certain noncommercial messages and prohibits others, without any justification unrelated to the content of those messages, it is impermissibly content-based. For these reasons, it is unconstitutional under Metromedia.\n\nLike the majority, see ante at (typescript at 68), I also believe that a statute that restricts not only signs on public property, but on private property as well, runs afoul of the First Amendment. See Members of City Council of Los Angeles v. Taxpayers for Vincent, 466 U.S. 789, 811, 80 L. Ed. 2d 772, 104 S. Ct. 2118 (1984) (upholding ordinance banning signs on public but not private property because \"the private citizen's interest in controlling the use of his own property justifies the disparate treatment\"); see also Burson v. Freeman, 112 S. Ct. at 1857-58 (complete ban on temporary, political signs within 100 yards of polling place justified only by two compelling government interests of protecting the right of citizens to vote freely for candidates of their choice and conducting election with reliability and integrity). Unlike the majority, I would strike down Chapter 11 under Metromedia for this reason alone. See Metromedia, 453 U.S. at 513 (plurality opinion) (noting that government may not prohibit occupant \"from displaying its own ideas or those of others\"); see also Matthews, 764 F.2d at 60 (striking down town bylaw that prohibited posting of political signs on residential property but permitted posting of certain commercial signs).\n\nThus, contrary to the majority, I would affirm the judgment of the district court striking down Chapter 11 in its entirety, although I would allow directional and warning signs to be excepted from a general prohibition.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Accordingly, I respectfully Dissent.\n\n\u003cspan class=\"fn\"\u003e* Pursuant to Rule 43(c) see letter received 2/22/94\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. According to Rappa's \"Verified Complaint,\" the signs he utilized were of several types. There were typical poster signs, approximately 2' x 2'; larger signs, either 4' x 4' or 4' x 8', which were of wooden construction and may or may not have been driven into the ground; and posters, 2' x 2', which were fixed to trees, utility poles, fences, or buildings. Additionally, Rappa also made use of bumper stickers affixed to automobiles. While the messages on particular signs may have varied somewhat, the typical Rappa sign stated: \"Dan Rappa 'The' Democrat for Congress.\" According to Rappa, in addition to creating name recognition, these signs were intended to convey a dual message; first, that voters should vote for Rappa, rather than Carper, in the primary, and that they should vote for the Democratic nominee in the general election; and second, that the campaign signs were intended to convey that Rappa, unlike Carper, was a true Democrat in the best traditions of the Democratic Party.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The individual defendants are Dennis Greenhouse, County Executive; Robert W. O'Brien, Director of the Department of Public Works; John Carney, Jr., Executive Assistant; Mark Kleinschmidt, Policy Coordinator; and William McIntyre, Code Enforcement Officer, Department of Public Works. We sometimes refer to these defendants, together with the County, as the \"County defendants.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. McNulty and Justice are sometimes referred to collectively as the State defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. This argument has been amplified by the United States Department of Justice in an amicus curiae brief, which was filed in response to notice from this court that the interests of the United States might be implicated by the present appeal. See infra p. 15 n.12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Title 17 of the Delaware Code is entitled \"Highways\" and governs a variety of issues relating to Delaware's system of roads.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The public policy behind the Federal Highway Beautification Act, 23 U.S.C. § 131, is incorporated by reference as a policy basis for the enactment of Chapter 11. See Del. Code Ann. tit. 17, § 1101. The HBA, in turn, describes the public policy animating the Act as follows: The Congress hereby finds and declares that the erection and maintenance of outdoor advertising signs, displays, and devices in areas adjacent to the Interstate System and the primary system should be controlled in order to protect the public investment in such highways, to promote the safety and recreational value of public travel, and to preserve natural beauty. 23 U.S.C. § 131(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. A \"state highway\" is defined by Title 17 to include \"any road or highway or portion thereof which the Department has constructed or of which the Department has taken or assumed control or jurisdiction.\" Del. Code Ann. tit. 17, § 101(a)(8).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. A \"controlled area\" is defined as \"any area inside the boundaries of this State which is adjacent to the right-of-way of a highway of the interstate or primary systems, except that areas beyond 660 feet of the right-of-way inside urban areas shall be excluded from this chapter.\" Del. Code Ann. tit. 17, § 1102(b)(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We note at this point that Chapter 11 is quite unclear in a number of respects. The specific exceptions in sections 1108 and 1114 often overlap, but, because their terms are not identical, the exact scope of the exception is not always clear. Section 1114(2), for example, includes a limitation on the size of sale and rent signs that is not present in section 1108(c). For present purposes, we need not resolve this ambiguity because Rappa has not challenged the size restrictions provided in Chapter 11. These ambiguities, however, take on greater significance in connection with other exceptions. See infra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Here the drafting of the overlapping sections presents a potential problem. Section 1108(c) exempts signs \"which advertise . . . activities conducted upon[] the real property.\" Section 1114(1), in contrast, exempts signs \"placed on the premises to identify a business conducted thereon.\" The question thus becomes whether the term activities is limited to commercial activities (businesses), or also encompasses noncommercial activities conducted on the site. As a matter of general statutory construction, the more specific provision -- \"business\" -- might well limit the more general, ambiguous term -- \"activities\", thus limiting the exception to commercial speech. However, because this interpretation would raise significant constitutional questions by preferring commercial over noncommercial speech, we will interpret the exception to allow signs advertising both commercial and noncommercial activities conducted on the property. See Edward J. De Bartolo Corp. v. Florida Gulf Coast Bldg. \u0026 Constr. Trades Council, 485 U.S. 568, 575-76, 108 S. Ct. 1392, 1397-98, 99 L. Ed. 2d 645 (1988) (\"Where an otherwise acceptable construction of a statute would raise serious constitutional problems, the Court will construe the statute to avoid such problems unless such construction is plainly contrary to the intent of Congress.\"); Frisby v. Schultz, 487 U.S. 474, 483, 108 S. Ct. 2495, 2501, 101 L. Ed. 2d 420 (1988) (\"To the extent they endorsed a broad reading of the ordinance, the lower courts ran afoul of the well-established principle that statutes will be interpreted to avoid constitutional difficulties.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. For this reason, the United States Attorney General was notified that the present action, to the extent it addresses the validity of Subchapter II, might bear upon the validity of the HBA as well. In response, the United States has filed an amicus curiae brief addressing many of the issues raised in this appeal. While there are clearly parallels between the requirements of the HBA and the requirements of Subchapter II, the HBA is not directly before us, and we therefore do not consider its constitutionality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Specifically, the prohibition provides: Subject to § 1122 of this title, no outdoor advertising sign, display or device, any part of the advertising, informative or attention attracting contents of which is visible from the main traveled way of a highway of the interstate system or primary system, shall be erected or maintained within a controlled area, unless it shall come within 1 or more of the [exempt] categories. Del. Code Ann. tit. 17, § 1121.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. We will refer to Chapter 11 throughout, because the constitutionality of the New Castle ordinance is not before us except as necessary to decide the qualified immunity issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In Taxpayers for Vincent, the Supreme Court applied the standard established in United States v. O'Brien, 391 U.S. 367, 88 S. Ct. 1673, 20 L. Ed. 2d 672 (1968), for evaluating content neutral regulations of expressive conduct. The two standards, however, are essentially equivalent. See, e.g., Clark, 468 U.S. at 298 n.8, 104 S. Ct. at 3071 n.8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Whether or not a literal understanding is the appropriate mode of interpretation is not entirely clear. See Tushnet, supra, at 883 n.6 (Noting in relation to the effect of classifying a regulation as content-based or content-neutral: \"The definition of 'content-neutral' therefore might be a matter of some concern. The Court's definition of content-based regulations has varied.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. It is generally understood, for First Amendment purposes, that each method of expression is \"'a law unto itself' and that law must reflect the 'differing natures, values, abuses and dangers' of each method.\" Metromedia, 453 U.S. at 501, 101 S. Ct. at 2889 (plurality opinion). Here, the method of expression is outdoors signs, which generally embraces the use of billboards and other signs to convey a message.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Additionally, unlike the Delaware statute, the San Diego ordinance did not purport to regulate all outdoor signs, but only those which were \"permanent\" in nature, i.e., billboards. See Metromedia at 493, 101 S. Ct. at 2885 (plurality opinion). Finally, the exemption for historical signs in the San Diego ordinance applied not just to signs involving nearby historical attractions, as does Chapter 11, but also to \"commemorative plaques of recognized historical societies and organizations.\" Id. at 514, 101 S. Ct. at 2896 (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The plurality's decision as to the regulation of commercial speech was expressly joined by Justice Stevens. See Metromedia, 453 U.S. at 541, 101 S. Ct. at 2909-10 (Stevens, J., Dissenting in part).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Favoring onsite over off-site speech probably leads to the effect of favoring commercial speech over non-commercial speech as most conspicuous onsite speech is probably commercial, but this effect is too attenuated for us to take into account. See Outdoor Systems, Inc. v. Mesa, 997 F.2d 604, 612 (9th Cir. 1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Moreover, as the Justice Department strongly argues in its amicus brief, the first basis of the plurality's holding has been significantly called into question by the Court's recent holding in Discovery Network, 123 L. Ed. 2d 99, 113 S. Ct. 1505 (1993). In that case, the Court struck down as content-based an ordinance that banned newsracks for commercial papers but allowed newsracks for non-commercial papers on public property. The Court's refusal to uphold a distinction based on the higher status of non-commercial speech in the First Amendment firmament indicates that, in certain contexts, non-commercial speech is not favored over commercial speech. If the First Amendment does not favor non-commercial speech over commercial speech, the Metromedia plurality is incorrect that there is anything especially problematic about distinctions such as those in the San Diego ordinance -- distinctions favoring commercial over non-commercial speech. However, even if such distinctions are not impermissible because of the hierarchy of categories of speech, they may be impermissible merely because they distinguish speech based on content. In other words, they may be impermissible for the same reason that distinctions within the category of non-commercial speech may be impermissible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. A number of commentators have noted the same concern. For instance, Davis and Reynolds have stated: Traditionally, of course, the Court's primary function has been that of a tribunal whose institutional pronouncements guide and bind the process of adjudication both in the state courts and in the lower federal courts. In that context a plurality opinion is not, strictly speaking, an opinion of the Court as an institution; it represents nothing more than the views of the individual Justices who join in the opinion. A plurality opinion does not, therefore, essentially differ in character from either a Concurring opinion or a Dissenting opinion. Those joining in a plurality opinion may speak with authority accorded wise men, but their voices do not carry the authority of the Supreme Court as an institution. Davis \u0026 Reynolds, supra, at 61-61 (footnotes omitted); see also Ken Kimura, Note, A Legitimacy Model for the Interpretation of Plurality Decisions, 77 Cornell L. Rev. 1593, 1594-1600 (1992) (discussing tension between plurality decisions and principles of precedential legitimacy); Novak, supra, at 757-58 (discussing the values underlying a precedential system).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This test is essentially a more stringent version of the time, place, and manner test. The concurrence thought that this more stringent version of the test applied to bans of an entire medium of communication.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We do not mean to imply that Casey squarely asserts that an opinion has precedential value only when it would \"necessarily produce results with which a majority of the Court from that case would agree.\" 947 F.2d at 694. Casey did not address whether an opinion has precedential effect when none of its holdings would necessarily garner the support of a majority; Casey was addressing whether a Concurring opinion had precedential effect when it would necessarily produce results with which a majority would agree. See id. at 697. That is why Casey concluded that, \"in a constitutional case where (1) there is a 5-4 split or there are only two opinions in the majority and (2) the majority strikes down a law as unconstitutional, the authoritative standard will be that which would invalidate the fewest laws as unconstitutional.\" Id. at 694. Based on the general reasoning of Casey, and that which we have employed above, this Conclusion generally follows, because, when there is a narrowest opinion, it will be the one that would strike down the fewest laws. However, the opinion that strikes down the fewest laws is not the governing standard in those cases in which there is no narrowest opinion; -- Casey does not dictate a contrary result, because Casey was not addressing such a situation and its general reasoning of looking for a \"common denominator\" is consistent with our Conclusion that in such cases there is no governing standard. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Of course, it would be possible to predict the outcome in almost every case simply by counting the votes of the Justices. Thus, a statute that discriminated among types of noncommercial speech and constituted a total ban of a means of communication would be unconstitutional, but a statute that did neither of these things -- or only one of them would probably be constitutional. If we were to count votes in this manner and give them precedential value, it would have the advantage of creating some predictability. However, such a system would be unprincipled. Even though a statute that discriminated among types of non-commercial speech would be constitutional in and of itself, it would somehow be magically transformed into an unconstitutional statute if it also completely banned a means of communication. This would be true even though not one Justice would have argued that there was any special synergistic effect of the two attributes. Thus, giving precedential value to a matrix predicting results would produce a system of low level, fairly predictable, formal rules but a system not rooted in any consistent constitutional values. Moreover, the predictability of such a system is not a significant advantage. First, it is only rare cases in which there is no least common denominator in the view of a majority of the Justices. Second, the predictability of such a system is lower than it appears, because the Supreme Court is likely to reconsider any case which produces a splintered result. This means that the ability of a legislature to rely on the decision when attempting to enact constitutional legislation is relatively small, even if lower courts always decide cases by counting votes in the Supreme Court decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. One might argue that the concurrence's test for content discrimination is a narrower version of the test proposed by the plurality and thus has precedential value for us; five Justices seemed to agree that any statute that fails the concurrence's test is unconstitutional. However, it is not at all clear that the concurrence thought that its test for content based exceptions applied outside the context of a total ban on a means of communication. See Metromedia, 453 U.S. at 533 n.10, 101 S. Ct. at 2905 n.10. Moreover, Metromedia was not a prototypical case in which the concurrence proposed a test that was a narrower version of the test proposed by the plurality and then applied the test to come to the same Conclusion as the plurality (that the statute was unconstitutional). The concurrence did not reach the issue of whether the San Diego ordinance failed the test it proposed for content-based exceptions to sign ordinances; rather, it concluded that the ordinance was impermissible for independent reasons. If it had needed to reach a decision on the constitutionality of the exceptions, it might well have concluded that the exceptions were constitutional under the test it proposed in n.10. Thus, even if the concurrence's test in n.10 is the narrowest view of 5 Justices about content based exceptions from sign bans, it is not a narrowest view that explains the result in Metromedia. It is as if the concurrence's view of content based exceptions was the same as that of the Dissenters -- in such a case, the \"narrowest\" view of five Justices would be that content based exceptions are constitutional so long as they are de minimis. Such a view could not have precedential value as the precedential meaning would then be inconsistent with the result in that case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Novak stated in this context: It seems clear that lower courts must adhere at the minimum to the principle of 'result' stare decisis, which mandates that any specific result espoused by a clear majority of the Court should be controlling in substantially identical cases. The absence of a clear majority rationale supporting the result may give a lower court some flexibility to formulate a justifying rule, it does not, however, justify a court in embracing a line of reasoning that will lead to a contrary result . . . . Adherence to 'result' stare decisis is essential if principles of certainty and uniformity are to have any meaning at all . . . . Id. (footnote omitted)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. One fundamental difference is that the laws in question here, even when considered in combination, probably would not effectively constitute a complete ban on outdoor signs in the view of the concurrence. There remain limited areas in which outdoor signs may still be posted. In particular, Chapter 11 applies only to \"outdoor advertising,\" see Del. Code Ann. tit. 17, § 1103(c) (limiting the scope of Chapter 11 to outdoor advertising and thus, for example, excluding signs posted inside windows), on \"state highways,\" see Del. Code Ann. tit. 17, § 1102(b)(1) (limiting the application of the statute to \"any state highway\" meaning those roads constructed or controlled by DelDOT), which probably leaves some, albeit minimal, portion of the roads in Delaware free from restriction. Additionally, the restrictions of Chapter 11 do not apply to certain select zones within urban areas. See Del. Code Ann. tit. 17, §§ 1102(b)(4), 1103(c). Finally, at least within certain regulated areas, signs are permissible as long as they are set back at least 25 feet from the right-of-way. See Del. Code Ann. tit. 17, § 1108.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. We note that the Supreme Court will soon hear argument in Gilleo v. Ladue, 986 F.2d 1180 (8th Cir. 1993), cert. granted, 62 U.S.L.W. 3242 (1993). This case at least offers the Court the opportunity to clarify and rectify the problems created by its splintered opinion in Metromedia, as evidenced by the foregoing 21 pages of Discussion. We hope that the Court will do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The idea of distortion of public debate assumes that there is some background notion of undistorted public debate against which distortion can be Judged. The idea that an absence of governmental censorship leads to undistorted public debate has been accurately criticized as wrongly assuming that private economic power, which leads to differential access to the marketplace of ideas based, for example, on ability to buy television time, does not itself distort debate. See, e.g., Owen Fiss, Why the State?, 100 Harv. L.Rev. 781 at 787-88. Nonetheless, governmental intervention in the marketplace of ideas to restrict speech often has a significantly greater potential to distort public debate than does private economic power. Cf. John Hart Ely, Democracy and Distrust, 106 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Dean Stone has summarized explanations for the distinct treatment accorded content-neutral and content-based restrictions as follows: The first amendment is concerned not only with the extent to which a law reduces the total quantity of communication, but also -- and perhaps even more fundamentally -- with at least three additional factors: distortion of public debate, improper motivation, and communicative impact. These three factors, which are most clearly presented by content-based restrictions, explain both why the Court tests virtually all content-based restrictions of high-value speech with a single, strict standard of review, and why it does not apply that same standard to all content-neutral restrictions. Geoffrey R. Stone, Content Neutral Restrictions, 54 U. Chi. L.Rev. 46, 54-55 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Of course, government's aim in restricting political campaign signs may well be to distort public debate by depriving non-incumbents of an inexpensive and effective means of communication necessary to challenge incumbents. However, if such an improper motive exists, government's means of achieving its aim is not through the content differentiation existing in this statute -- government is not attempting to focus debate on highway beautification or directional information rather than on elections. If government is attempting to restrict speech about elections, it is doing so by means of the general ban in the statute rather than by means of the exceptions to the general ban. Given current First Amendment doctrine, the proper way to address this type of concern -- at least absent explicit evidence that government's justification for the restriction is to restrict content -- is by arguing that the general limitation is an illegitimate time, place, and manner restriction because it does not leave open ample alternative channels of communication. If we decide that the Delaware statutes do not discriminate based on content, they must still meet time, place, and manner scrutiny.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In the Equal Protection context, the Supreme Court has upheld laws permitting advertisements related to a particular location but not permitting general purpose advertising. See Packer Corp. v. Utah, 285 U.S. 105, 107, 52 S. Ct. 273, 273, 76 L. Ed. 643 (1932) (rejecting Equal Protection challenge to ban on cigarette billboards, excepting, inter alia, the premises of any dealer in such products); Railway Express Agency, Inc. v. New York, 336 U.S. 106, 109-10, 69 S. Ct. 463, 465, 93 L. Ed. 533 (1949) (upholding ordinance banning advertisements on vehicles, except for those relating to a business in which the vehicle is engaged).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Whether alternative means of communication actually exist for signs such as \"Rappa for Congress\" is a question that must be assessed in a time, place, and manner inquiry. The point here is that equally effective alternatives may exist. In contrast, there are no possible effective alternatives to signs such as \"Speed Limit 55.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. We think that the concurrence's proposed test is necessary to ensure that the state is careful when it adopts content based exceptions even within the limited confines of signs significantly related to a location or its use. Although the concurrence may have thought that its test only applied to content based exceptions from total bans of signs, see supra n.26, we see no reason to so limit application of the test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. There may be cases in which some commercial signs, unrelated to the property on which they stand, are exempted from regulation while other commercial speech is restricted. A straight application of the test we have adopted would lead to the Conclusion that such a restriction would constitute impermissible content discrimination. However, under the reasoning of the Metromedia plurality, content differentiation among categories of commercial speech is generally permissible. Thus, so long as the hypothetical regulation we are discussing did not regulate any non-commercial speech, the Metromedia plurality would uphold this regulation. Fortunately, we do not have to decide here whether we agree with the Metromedia plurality on the resolution of this issue. The statutes at issue in this case significantly limit some non-commercial speech as well as some commercial speech. Thus, we need not, and do not, decide whether content-based distinctions solely within the category of commercial speech are permissible even if they fail the test we have articulated. We do note that the view of the Metromedia plurality that such distinctions are permissible is in significant tension with the holding of City of Cincinnati v. Discovery Network, Inc., 123 L. Ed. 2d 99, 113 S. Ct. 1505 (1993), where the Supreme Court struck down an ordinance that banned commercial newsracks but allowed non-commercial newsracks on city streets.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The time, place, and manner test requires that a constitutional restriction on speech must leave in place ample alternative channels of communication. Ward, 491 U.S. at 791, 109 S. Ct. at 2753 (1989). Here, we allow the state to constitutionally exempt from a time, place, and manner restriction -- signs for which there may be alternative channels of communication, but for which the alternatives are inferior because of the context specific nature of the signs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Of course, even if an exception is not related to the particular locale, the exception will be justified if it passes strict scrutiny. In such a case, the state must show that the exception is necessary to a compelling state interest and that it is narrowly drawn to achieve that interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Of course, the \"significantly related to\" test does leave room for case by case analysis in which subconscious biases can potentially creep in; however, our concrete criteria vastly limits the ability of these biases to have an effect as compared with the unguided application of a \"de minimis\" test or the application of the concurrence's test weighing the general importance of speech with particular content.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. We believe this standard is consistent with Mosley, the original case on content neutrality,. There, the Court struck down an ordinance forbidding picketing near schools except for peaceful labor picketing, See 408 U.S. 92, 99, 92 S. Ct. 2286, 2292, 33 L. Ed. 2d 212 (1972). Arguably the exception could have been justified by the fact that the labor picketing was targeted at the school and thus was particularly related to the school location. However, the Court did not consider this possibility. Moreover, the fact that the ordinance only exempted peaceful labor picketing without exempting any other speech related to the school made it likely that the government's actual motive was to favor speech about labor issues. Additionally, allowing labor picketing but not speech opposed to the picketing comes close to viewpoint discrimination. Thus, Mosley does not preclude us from adopting the test we have discussed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The other components of the test are set out on pp.52-53 supra. It may also be the case that just as R.A.V. v. St. Paul, 120 L. Ed. 2d 305, 112 S. Ct. 2538, 2543 (1992), held that content discrimination even within generally proscribable categories of speech such as fighting words is usually impermissible, content discrimination within a category of speech that can generally be excluded from an overall ban may be impermissible. Any exceptions a sign ban creates may have to apply to all speech of a similar relationship to the locality or its use -- if some onsite signs are exempted because onsite signs are significantly related to the locality, then all onsite signs equally related to the locale may have to be exempted. However, applying R.A.V. in this context would have a significant disadvantage as it might force states that enacted sign bans to enact a vague exception for \"any signs significantly related to the locality of the ban\" rather than specifying the content of allowable signs. We decline to reach this issue here as it was not raised by the parties, and we have not been pointed to any signs Delaware did not exempt that were as related to the localities of the sign restrictions as the speech Delaware did exempt.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. To be constitutional, the exception for official signs or notices must be interpreted as limited to signs relating to the property on which they stand, such as directional signs. An official sign that said \"Thomas Carper -- Congressman\" probably would not be related to the property on which it stood unless it was standing at Carper's district office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Because the onsite exception is not content-based, however, does not make it irrelevant to time, place, and manner analysis more generally. To the contrary, it may be highly relevant to evaluating the fit between the regulation and the government's asserted interest. See infra note 58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Additionally, onsite signs are arguably a unique media. Because onsite signs are by definition signs that identify the activities conducted on the real property, they derive their primary meaning and efficacy from the site on which they are located. Bond, supra, at 2496 \u0026 n.95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. There has been no challenge to, or information provided about, the Department's approval procedures. Accordingly, we do not address the constitutionality of rules by which sign space is allocated, any fees charged for access to post signs, or any discretion the State Department of Public Instruction has in approving signs. But see Lakewood v. Plain Dealer Publishing Co., 486 U.S. 750, 108 S. Ct. 2138, 100 L. Ed. 2d 771 (1988) (holding unconstitutional a statute giving unfettered discretion to city's mayor to grant or deny permits to place newsracks on public property).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As we have discussed supra p.20, the exceptions in Subchapter III are the same as those in Subchapter II.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Signs pertaining to such sites are of course also permissible if they fall into the onsite exception, i.e., if they are actually on the historic or natural site to which they relate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The county defendants raise similar arguments in order to demonstrate that the county ordinance was not clearly unconstitutional.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. In the case most directly on point, only a three Justice plurality indicated a willingness to apply the doctrine to political speech. See Boos v. Barry, 485 U.S. 312, 320-21, 108 S. Ct. 1157, 1163-64, 99 L. Ed. 2d 333 (1988) (plurality opinion on this point). Texas v. Johnson, 491 U.S. 397, 411-12, 109 S. Ct. 2533, 2543, 105 L. Ed. 2d 342 (1989), which defendants cite as indicating that secondary effects analysis has been applied in the context of political speech, was essentially explaining that even if secondary effects analysis applied, the statute in question was still unconstitutional.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Defendants cite Kokinda for the proposition that a particularized inquiry into the function of specific streets is necessary. In Kokinda, the Supreme Court held that the sidewalk between a parking lot and a post office was not a traditional public forum. However, the sidewalk at issue was completely contained within the confines of Post Office property, property similar to a private business and thus within the government's proprietary domnin. \"The postal sidewalk was constructed soley to negotiate the space between the parking lot and the front door of the post office, not to facilitate the daily commerce and life of the neighborhood or city.\" 497 U.S. at 727, 110 S. Ct. at 3121. Thus, the Court needed to undertake a particularized inquiry into expressive uses of the sidewalk at issue in Kokinda only because the sidewalk at issue was not a traditional sidewalk; in contrast, the highways at issue here are traditional roads. Moreover, in Kokinda, only a small segment of sidewalk space was removed from the ambit of traditional public forum status.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The state defendants have also argued that the present challenge to Chapter 11 is inappropriate because they acted under the authority of sections 131 and 132 of Title 17 of the Delaware Code, not Chapter 11. These sections grant DelDOT jurisdiction over all public roads and impose on it the duty to \"maintain all state highways under its jurisdiction.\" Del. Code Ann. tit. 17, §§ 132. Maintenance is defined to \"include the keeping of the right-of-way clear of all underbrush and debris which might interfere with the drainage or injure the foundations of such highways.\" Del. Code Ann. tit. 17 § 101(a)(4). Defendants assert that the removal of signs constituted removal of debris. They point to several letters and affidavits concerning elections from 1982 through 1990, which indicated that signs were removed based strictly on safety concerns. However, the district court concluded that the signs were removed under the authority of Chapter 11. Rappa contends that we have no jurisdiction to review this finding, because we have no jurisdiction to review denials of summary judgment. See Grabowski, 922 F.2d at 1105 (3d Cir. 1990). But we do have jurisdiction to review denials of summary judgment that are raised \"in tandem with an appeal of an order granting a cross-motion for summary judgment.\" Nazay v. Miller, 949 F.2d 1323, 1328 (3d Cir. 1991). We agree with the district court that the signs were removed under the authority of Chapter 11. We do not think that §§ 131 and 132 could provide DelDot the authority to remove signs, as the authority they delegate is plainly limited to removal of obstacles that are a threat to drainage or to the foundation of the highways. Moreover, even if the state defendants removed signs for safety reasons, this does not mean that they removed them under the authority of §§ 131 and 132 rather than under Chapter 11 -- none of the evidence in the record cites §§ 131 or 132. In contrast, there is some evidence in the record that during prior elections, DelDOT specifically referred to Chapter 11 as a source of authority empowaering it to remove signs. [JA 399, 428]. More importantly, on August 22, 1990, shortly after removal of the signs at issue here, the Attorney General sent a letter indicating that there had been practical problems with enforcement of Chapter 11 previously but it would henceforth be fully enforced. [JA 392-93]. This letter implies that Deldot had exercised authority for the limited enforcement under the auspices of Chapter 11. Furthermore, it indicated that the statute would be enforced in the future, which means that Rappa, who has stated that he plans to run for public office again, has a basis for his facial challenge to Chapter 11 regardless of whether past state actions relied on that statute. See, e.g., City of Houston v. Hill, 482 U.S. 451, 459 n.7, 107 S. Ct. 2502, 2508 n.7, 96 L. Ed. 2d 398 (1987) (after showing genuine threat of future enforcement, plaintiff had standing to bring facial challenge).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Some evidence suggests that the legislature may have intended that at least Subchapter II be severable. In particular, Subchapter II specifically provides that \"the provisions of this Subchapter relating to the regulation of outdoor advertising in controlled areas are in addition to, and not in lieu of, Subchapter I of this chapter.\" Del. Code Ann. tit. 17, § 1126.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Cf. Finzer v. Barry, 255 U.S. App. D.C. 19, 798 F.2d 1450, 1474 (D.C. Cir. 1986) (commenting as an aside that, \"if the court were to strike only the element of discrimination and leave a flat and neutral prohibition in place, it would be narrowly tailoring the statute by broadening its application -- a peculiar outcome, but one that would end the equal protection problem.\" (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. In an analogous context, Robert Mathews challenged as violative of the Equal Protection Clause a benefits provision in the Social Security Act that he alleged discriminated against men by providing them a lower level of benefits than women. See Heckler v. Mathews, 465 U.S. 728, 104 S. Ct. 1387, 79 L. Ed. 2d 646 (1984). He also challenged as unconstitutional a severability provision in the Act that indicated that if the \"discriminatory\" provision in the Act was found invalid, benefits would not be extended to new persons -- presumably they would be have been reduced instead. If this provision had been enforced and Mathews had won his challenge against the benefits provision, the Court would have mandated that women would receive lower benefits rather than men receiving higher benefits. Thus, like Rappa, the only benefit Mathews could have won from his challenge if the severability provision were enforced would have been equality of benefits (in Rappa's case -- speech); he would not have attained a higher level of absolute benefits. Nonetheless, the Court held that the severability provision could be enforced. The Court explained: although the choice between 'extension' and 'nullification' [of benefits] is within the 'constitutional competence of a federal district court,' and, ordinarily 'extension, rather than nullification, is the proper course,' the court should not, of course, 'use its remedial powers to circumvent the intent of the legislature'. . . . In this case, Congress has, through the severability clause, clearly expressed its preference for nullification, rather than extension, of the pension offset exception.\" Id. at 739 n.5, 104 S. Ct. at 1395 n.5 (quoting Califano v. Westcott, 443 U.S. 76, 91, 99 S. Ct. 2655, 2665, 61 L. Ed. 2d 382). However, unlike in Heckler, here there is no specific severability clause indicating a preference for less speech rather than more speech -- and Heckler itself indicates that ordinarily extension of benefits (here, the ability to speak) is the proper course. Moreover, in the First Amendment context there is a constitutional value favoring more rather than less speech -- in Heckler there was no constitutional value favoring more rather than fewer benefits. And, in the First Amendment context, Mosley provides some counterbalance to the precedential value of Heckler. In any case, we think it is perfectly consistent with Heckler for us to refuse to sever a statute in a manner that reduces speech unless there is a much clearer legislative intent that we do so than exists in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. We could craft an injunction different from that crafted by the district court by following the suggestion of the Metromedia plurality that a state court could have sustained the San Diego ordinance by interpreting its prohibitions to apply only to commercial speech while allowing all non-commercial speech. See 453 U.S. at 521-23 n.26, 101 S. Ct. 2899-2900 n.26. That is, we could require Delaware to allow all non-commercial speech to the same extent that it allows signs advertising local industries and meetings. This would mean that the Delaware ordinances would ban much offsite commercial speech while allowing all non-commercial speech. However, the likely constitutionality of such an injunction has been significantly undermined by Discovery Network, which overturned a law banning commercial newsracks but allowing non-commercial newsracks. In distinguishing Metromedia, the Court stated: The CHIEF JUSTICE is correct that seven Justices in the Metromedia case were of the view that San Diego could completely ban offsite commercial billboards for reasons unrelated to the content of those billboards. Those seven Justices did not say, however, that San Diego could distinguish between commercial and noncommercial offsite billboards that cause the same esthetic and safety concerns. That question was not presented in Metromedia, for the regulation at issue in that case did not draw a distinction between commercial and noncommercial offsite billboards; with a few exceptions, it essentially banned all offsite billboards. 113 S. Ct. at 1514. The Discovery Network Court thus undermines the Metromedia plurality's implication that a law banning commercial signs but not non-commercial signs would be constitutional. But, in any case, it seems fairly clear after Discovery Network that it is unconstitutional to ban commercial speech but not non-commercial speech -- at least absent a showing that the commercial speech has worse secondary effects. See id. at 1516\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. See Metromedia, 453 U.S. at 507-08, 101 S. Ct. at 2892-93 (plurality opinion) (\"Nor can there be substantial doubt that the twin goals that the ordinance seeks to further -- traffic safety and the appearance of the city -- are substantial governmental goals. It is far too late to contend otherwise with respect to either traffic safety, or esthetics.\") (footnote and citations omitted)); see also Taxpayers for Vincent, 466 U.S. at 806-07, 104 S. Ct. at 2130-31 (\"We reaffirm the Conclusion of the majority in Metromedia. The problem addressed by this ordinance -- the visual assault on the citizens of Los Angeles presented by an accumulation of signs posted on public property -- constitutes a significant substantive evil within the City's power to prohibit.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The Supreme Court has explained that \"the requirement of narrow tailoring is satisfied 'so long as the . . . regulation promotes a substantial government interest that would be achieved less effectively absent the regulation.'\" Ward, 491 U.S. at 791, 109 S. Ct. at 2758 (quoting United States v. Albertini, 472 U.S. 675, 689, 105 S. Ct. 2897, 2906, 86 L. Ed. 2d 536 (1985)) (alteration original to Ward). It is true that Delaware might well have substantially accomplished its goals by less restrictive means. In particular, the State has always had available the option of regulating the size, appearance, and density of signs rather than banning them outright. While this would not have completely eliminated the problems caused by signs, the State, by exempting some signs from the regulatory scheme, has demonstrated that it does not believe that the total elimination of signs is necessary. Nonetheless, the result of the \"narrow tailoring\" inquiry may be foreshadowed by the Court's decision in Taxpayers for Vincent. In Taxpayers for Vincent, the Court found that a Los Angeles ordinance totally banning the posting of signs on public property was narrowly tailored because \"by banning these signs, the City did no more than eliminate the exact source of the evil it sought to remedy.\" Taxpayers for Vincent, 466 U.S. at 808, 104 S. Ct. at 2130. Moreover, the Court came to this Conclusion even though Los Angeles allowed signs on private property, which made the ordinance underinclusive since it did not entirely eliminate the substantive evil with which it was concerned. See id. at 810-12, 104 S. Ct. at 2132. Thus, the more minor underinclusiveness of Chapter 11 would not itself appear to cause that chapter to fail the narrowly tailored requirement. But cf. Discovery Network, 113 S. Ct. at 1510 (\"The fact that the city failed to address its recently developed concern about newsracks by regulating their size, shape, appearance, or number indicates that it has not 'carefully calculated' the costs and benefits associated with the burden on speech.\") The district court, with the aid of a more complete record, should be able to resolve the \"narrowly tailored\" inquiry without difficulty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. We focus on Rappa's particular message, as well as campaign speech generally, because that is the subject about which we have been provided the most information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. We take judicial notice, Fed. R. Evid. 201(b), of the fact that the only non-cable stations that are available in Delaware are Philadelphia and Baltimore stations, and that the cost of a television advertisement on these stations, whose primary viewing audiences are elsewhere, would be enormous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Cf. Taxpayers for Vincent, 466 U.S. at 811, 104 S. Ct. at 2132 (upholding an ordinance eliminating signs on public property but allowing them on private property, because \"the private citizen's interest in controlling the use of his own property justifies the disparate treatment.\") Although Tapayers for Vincent was merely allowing rather than requiring a distinction between the posting of signs on private and public property, Taxpayers for Vincent did recognize a special interest in posting signs on private property which should be taken into account in a time, place, and manner analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. In particular, both cases involved restrictions much narrower than those found in Chapter 11. The Kentucky statute at issue in Wheeler applied only to signs along interstate highways and federal-aid primary highways, thus leaving the majority of Kentucky roads unregulated. See Wheeler, 822 F.2d at 587-88, 596. The Los Angeles ordinance considered in Taxpayers for Vincent also provided greater alternative avenues of communication because it only regulated the posting of temporary signs on public property. See Taxpayers for Vincent, 466 U.S. at 811, 104 S. Ct. at 2132.\u003c/span\u003e\n\n",
    "body_length": 189690,
    "citedas": [
      "18 F.3d 1043"
    ],
    "attorneys": "CARL A. AGOSTINI, Agostini, Levitsky \u0026 Agostini, 623 King Street, P.O. Box 2323, Wilmington, DE 19899. THOMAS S. NEUBERGER (Argued), Suite 702, 200 West Ninth Street, Ninth Street Plaza, Wilmington, DE 19801-1646, Attorneys for Appellees in 92-7282 and 92-7293. JOHN A. PARKINS, JR. (Argued), HELEN M. RICHARDS, Richards, Layton \u0026 Finger, One Rodney Square, P.O. Box 551, Wilmington, DE 19899. WILLIAM W. BOWSER, JULIE M. SEBRING, New Castle County Department of Law, 800 French Street, Wilmington, DE 19801, Attorneys for Appellants in 92-7282. MALCOLM S. COBIN (Argued), Department of Justice, Assistant State Solicitor, 820 N. French Street, Wilmington, DE 19801. FREDERICK H. SCHRANCK, Office of Attorney General, Assistant Attorney General, Department of Transportation, P.O. Box 778, Dover, DE 19903-0778, Attorneys for Appellants in 92-7293. STUART E. SCHIFFER, Acting Assistant Attorney General, WILLIAM C. CARPENTER, JR., United States Attorney, ANTHONY J. STEINMEYER, JOHN F. DALY, Attorneys, Appellate Staff, Civil Division, Room 7416-C, Department of Justice, Washington, DC 20530, Attorneys for the United States as Amicus Curiae.",
    "category": [
      "251"
    ],
    "judges": "Before: Becker, Alito and Garth, Circuit Judges.",
    "citation_count": 76
  }
}
