{
  "id": "zaJ_R2YBTlTomsSBDm8j",
  "document": {
    "title": "People v. Marshall",
    "full_title": "THE PEOPLE AND v. GEORGE EDWARD MARSHALL AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1996-08-07T00:00:00.000Z",
    "docket": "No. S004557, Crim. No. 23189.",
    "body": "WERDEGAR, J.\n\nFollowing a mistrial declared when a jury was unable to agree on guilt, a second jury convicted defendant George Edward Marshall of three counts of first degree murder (Pen. Code, § 187; all further statutory references are to the Penal Code unless otherwise indicated) and one count of attempted murder (§ 664/187), and as to each count found defendant used a firearm during the commission of the offense (§ 12022.5). Following a penalty trial, the same jury sentenced defendant to death. The trial court found the jury's multiple murder verdicts constituted true findings on the multiple-murder special-circumstance allegations and denied defendant's motion to modify the verdict. (§ 190.4, subd. (e).) This appeal is automatic. (§ 1239, subd. (b).) Finding no reversible error, we affirm the judgment.\n\nFACTS\n\nI. Guilt Phase\n\nA. Crime Scene and Defendant's Arrest.\n\nOn the morning of January 1, 1981, defendant's wife, Cynthia Marshall, her brother Jeffrey Lee, and a boarder, Henry Thomas, were shot to death at defendant's Locust Street residence in Modesto. A visitor, Annette May, was wounded, but escaped through a bedroom window and sought refuge with a neighbor, who summoned police.\n\nResponding officers found the front door of the residence slightly open. Inside they saw an automatic or semiautomatic weapon lying on the living room floor. The body of Cynthia Marshall lay in a pool of blood in the kitchen, and that of Henry Thomas on a waterbed in one of the bedrooms. Defendant, wearing a blue leisure suit and a white hat with a black brim, was found in the master bedroom, holding two small children. The body of 13-year-old Jeffrey Lee lay just inside the door to the master bedroom. Defendant told an officer Jeffrey had \"just come in here and fell down.\" Defendant was arrested and escorted down the hallway and out of the house. Defendant neither looked into the bedroom where Henry Thomas's body lay, nor commented on his wife's lifeless body, although it was in view. To one officer, defendant appeared dazed or in a state of shock.\n\nWhile being transported to the police station, defendant told an officer he was very tired and had arrived home a few minutes before the shootings. Defendant stated he was in the back bedroom with his two children when he heard shots being fired, and immediately locked the bedroom door. Defendant asked, \"Is Cindy all right?\" The officer responded he did not know. Throughout the booking procedure, defendant appeared calm, quiet and collected. He was transported to the hospital for the taking of a blood sample, and in response to a nurse's inquiry as to his marital status said, \"According to these guys, I'm single.\" In Detective McDonough's opinion, defendant was sober, and he detected no odor of alcohol on defendant's breath. Defendant did not appear to be under the influence of any drugs.\n\nB. Testimony of Annette May.\n\nAnnette May, 20 years old at the time of the offenses, arrived at the Golden Touch disco, an establishment defendant and his wife operated, around 8 p.m. on New Year's Eve 1980. While at the disco, May consumed many different kinds of drinks, including beer, champagne, brandy and hard liquor. She saw defendant at the disco wearing a white suit and a white hat. May remained there until about 4:30 a.m., when she left for the Marshall residence with Henry Thomas. She was feeling tired and \"high.\" Eventually she and Thomas went to sleep in Henry's bedroom.\n\nMay awoke when it was \"kind of light out.\" As she went to the bathroom she saw defendant in his bedroom. She could not see what he was wearing, as he was bending over a pile of clothes. She did not see Cynthia or hear any noise from the kitchen. After May returned to bed, Henry got up and went to the kitchen to get something to eat. She could hear Henry and defendant talking in a normal, friendly tone of voice. As Henry returned to bed, May again fell asleep.\n\nThe next time May awoke she could hear defendant's two children, screaming and crying in the living room. She could also hear Cynthia crying and saying, \"Why, George,\" and \"No, George.\" May then saw the bedroom door open and heard a gun go off. A number of shots were fired into the room. May fell from the bed onto the floor, in the 20-inch-wide space between the bed and the wall. From there she scooted under the headboard. There was a crack or space between the headboard and the bed through which she could see.\n\nMay saw defendant enter the bedroom carrying a large, dark gun with a shoulder strap. Defendant looked at the waterbed and approached May. She pretended to be dead and defendant walked away. He picked up one of his children near the bedroom doorway. He was wearing a white suit and a white hat with dark trim. These appeared to be the same clothes he had been wearing earlier at the disco. After a few minutes, May escaped through the bedroom window and ran, naked and bleeding, to seek help from a neighbor, Anna Baker. It was around noon when May arrived at Baker's house. There was some dispute over whether May identified defendant or responded \"I don't know\" when Baker asked who had shot her.\n\nC. Forensic Evidence.\n\nPost mortem examination revealed each of the victims died as a result of wounds inflicted by a high velocity gun. Four bullets found at the scene were fired from the weapon found in the living room, and seven cartridge cases found in the house had been chambered in it and may have been fired from it. The weapon, a semiautomatic rifle, resembled one that Alvin Green testified he had observed defendant to possess at the disco.\n\nCynthia Marshall's name, with the Locust Street address, appeared on a receipt for an HK-93 rifle purchased at a sporting goods store in San Leandro in November 1979. The HK-93 had later been exchanged for an HK-91, a higher caliber model. The serial number on the weapon found at the crime scene matched that recorded on the Bureau of Alcohol, Tobacco and Firearms form 4473 filed in connection with the exchange.\n\nNo usable fingerprints were found on the rifle. Police tested defendant's hands for gunshot residue, with negative results. The clothes defendant was wearing at the time of his arrest were tested for blood; none was found. Defendant's blood-alcohol level at 3 p.m., some three hours after his arrest, was .10 percent.\n\nD. Testimony of David Moore Regarding Bloodied White Suit.\n\nCynthia Marshall's uncle, David Moore, testified that the day after the offenses he went to the Locust Street residence, when the house was under a coroner's seal, and was admitted by a deputy sheriff. His purpose was to retrieve clothes and toys for defendant's two children. While doing so, he found a clothes hamper in the bathroom and turned it upside down. Going through the clothes, he found a white suit with blood spattered on it, along with some bloody shirts. He did not think his discovery important and did not tell the officers about it until after defendant's first trial ended in a mistrial. The police never found any bloodstained clothing, but the trial court denied a defense motion to suppress Moore's testimony concerning the bloodied white suit.\n\nE. Events of New Year's Eve.\n\nEvidence indicated that, during the day preceding the crimes, defendant ran errands in preparation for the New Year's Eve celebration he was planning at the disco. Around 4 p.m. defendant went to his job at Gallo Glass Company and worked an eight-hour shift. A fellow Gallo employee gave him a ride to the disco, dropping him off around 12:30 or 12:45 a.m. Cynthia was at the door, taking admission fees. Defendant began to pour champagne for the disco patrons, drinking as he did so.\n\nDefendant's attire on New Year's Eve was a subject of dispute. Defendant testified he was initially wearing blue slacks and a blue leisure coat, and at some point changed into a grey coat that he kept at the disco. Two witnesses likewise testified defendant was wearing dark clothing. Other witnesses, however, testified defendant was wearing a white suit on New Year's Eve.\n\nThe celebration began to wane after 4:30 a.m., when disc jockey Henry Thomas left the Golden Touch with Annette May. Together they went to the room Thomas rented in defendant's house. Cynthia had previously gone home by herself, driving defendant's car. Before leaving the disco she traded defendant $80 in small bills for four $20 bills. Defendant testified she also took some money bags with her.\n\nF. Defendant's Relationship With His Wife.\n\nDefendant and Cynthia had been married for two years at the time of the killings, and were the parents of two daughters, Star Child and Jamilah. Both were employed at Gallo Glass Company in Modesto, and during their spare time they operated a disco called the Golden Touch. Defendant and his wife jointly owned their residence, and prior to their marriage defendant had purchased a house on Benson Avenue in Modesto, which they rented out.\n\nDefendant testified he loved his wife and got along well with her, apart from brief separations occasioned by transient emotional changes during each of her pregnancies. She was pregnant at the time of her death and, as was her custom, had gone to stay with her mother, from which stay she had returned around Christmas.\n\nProsecution witness Patsy Thomas testified that, sometime after Christmas, she overheard an argument between defendant and his wife, during which Cynthia said, \"Well, it doesn't really matter because I am leaving anyway--this time for good.\" Thomas testified defendant replied, \"Over my dead body.\" Thomas also testified she heard defendant say he had purchased $100,000 of insurance on Cynthia's life and that Cynthia wanted the money she had put into the disco, as she did not want to be involved in the business.\n\nDefendant denied Cynthia had threatened to leave.\n\nG. Testimony of Alvin Green Regarding Motive.\n\nAlvin Green testified he occasionally worked at the disco as a disc jockey or security guard. Sometime after 4:20 p.m. on New Year's Eve, he went to the disco to pick up his earnings. Defendant, Green said, indicated to him on that occasion that he and Cynthia were not getting along and might be separating. According to Green, defendant expressed concern that if Cynthia left him, as an ex-felon he would lose everything, because their assets were in her name; he would see her dead before he lost everything. Defendant denied seeing Green at the disco on New Year's Eve.\n\nH. Testimony of Informant Gary Brady.\n\nGary Brady became acquainted with defendant while both were incarcerated in the Stanislaus County jail during the first three months of 1981. Brady testified defendant admitted he had shot his wife, a small child, a man and a woman, with a high-powered rifle. Brady claimed defendant offered him a 1966 Mustang and a house defendant owned if Brady would kill the \"bitch\" who escaped out the window, his mother-in-law, and one Green. In return for Brady's testimony, the district attorney's offices in San Joaquin and Stanislaus Counties promised him he would receive a two-year prison term for a pending robbery charge. Brady had received similar consideration for his testimony in the Fresno County murder prosecution of Clarence Ray Allen.\n\nInmate Andrew Crane testified Brady did not enjoy a good reputation for truthfulness and was considered a \"snitch\" by other inmates. Defendant likewise testified Brady had a poor reputation for truth-telling, and stated he never discussed his case with Brady.\n\nI. Testimony of Kenny Mitchell.\n\nIn the prosecution's rebuttal case, Kenny Mitchell testified he had been at the Golden Touch disco on New Year's Eve and went to defendant's residence the following morning, ostensibly to arrange a cocaine deal, but in reality to defraud defendant. As Mitchell approached the front door of the residence he heard a gunshot, followed by another gunshot and a woman's voice saying, \"Oh, God. George, what are you doing this for?\" The door was open about 18 inches. Inside Mitchell saw defendant, wearing a white suit, apparently with a black gun in his hand, emerging from one room and entering a bedroom. Mitchell then left the area.\n\nMitchell was impeached with prior felony convictions, prior inconsistent statements, admissions he had lied in the past, and a further admission that after leaving the Golden Touch disco after the New Year's Eve festivities, he had gone to a gambling shack to gamble, drink, smoke marijuana and use cocaine. Additionally, Benson Neal, an inmate in the Stanislaus County jail who was housed in the cell next to appellant, testified that Kenny Mitchell came to his house several days after New Year's Day 1981. Mitchell was carrying a white calculator, some silver dollars and several rings; he told Neal he had killed three people to get them. Charles Edward Thompson testified Mitchell told him he had made a deal with the district attorney to get two cases dropped in exchange for his false testimony against defendant, urging Thompson to do the same. Albert Ward testified to hearing Mitchell make similar statements.\n\nAfter Thompson and Ward testified, Mitchell was recalled to the stand by the defense. He acknowledged he knew Thompson and Ward and had discussed defendant's case with them. He said he told Thompson he was not really going to testify, but was just \"running a game\" on the police.\n\nJ. Testimony of Defendant.\n\nDefendant narrated the events of New Year's Eve and the morning following. He testified that after most of the disco patrons had left, he got a ride from the disco to his home, where he picked up his car and drove back to the disco. After closing the disco he went to an establishment a few doors away and had a drink. Although he had been drinking throughout the night and could feel the alcohol, he then drove home, a distance of four or five blocks. When he arrived, a little after 7 a.m., Cynthia and his daughter Star Child were waiting for him. He noticed the rifle in the living room beside the closet door. Jeffrey Lee was in the master bedroom, watching television.\n\nDefendant poured himself some champagne and went into the master bedroom to play with his children. Eventually he fell asleep. At some point defendant heard someone call his name. He recognized the voice as his wife's, but he was so tired he did not know whether he was dreaming or not, and did not respond. He heard what sounded like a series of \"pops.\" Eventually he got up, not knowing what time it was. He opened the bedroom door and saw Jeffrey Lee and Star Child in the hallway. Star Child had a toy in her hand and a frightened look on her face. As defendant reached down to pick her up, he noticed, out of the corner of his eye, the form of a man move from the kitchen into the hallway. He saw the form of a weapon and heard a single shot. Defendant quickly reentered the master bedroom and locked the door.\n\nDefendant's younger daughter, Jamilah, was already in the bedroom, in her crib. Defendant took her out of the crib and placed his daughters on the floor, covering them with his body. He was unaware of Jeffrey being in the room. At some point defendant picked up the telephone and tried to call the private number of the Modesto Chief of Police, but the line appeared to be dead. When defendant heard the police walkie-talkie in the hallway, he yelled out that he and his girls were \"back here.\" Soon thereafter defendant was taken into custody.\n\nII. Penalty Phase\n\nA. Prosecution Evidence.\n\nThe prosecution introduced evidence that in 1975 defendant was convicted of assault with a deadly weapon. Defendant was then operating Uptown Saturday Night, an East Oakland cultural club, and providing housing and financial support for Donald Mitchell, an employee who had fallen on hard times. One night some thefts occurred at the club, and defendant suspected Mitchell. The two men armed themselves and went for a drive in defendant's car to discuss the matter.\n\nThe Discussion grew heated as the men drove along Skyline Boulevard. Defendant saw Mitchell reach into the pocket containing his gun. Fearing for his life, defendant immediately pulled over and drew his own weapon. He grabbed Mitchell's hand and tossed his gun onto the passenger side floorboard. Gun in hand, defendant ordered Mitchell out of the car and frisked him. Finding Mitchell was carrying no other weapons, defendant returned his own gun to his pocket.\n\nWhen the men had been talking for several minutes beside defendant's car, two uniformed Oakland park rangers stopped to investigate. Seeing a gun butt protruding from defendant's pocket, they took the pistol and discovered it was loaded. They also found Mitchell's gun on the floor of the car, but noted it was rusty and unloaded. Defendant testified he did not realize Mitchell's weapon was old and had assumed it was loaded.\n\nDefendant served no time in jail for the assault conviction.\n\nB. Defense Evidence.\n\nThe defense presented evidence of defendant's background and religious beliefs. Defendant was the oldest of 13 children born to a desperately poor family. From the age of seven, defendant picked cotton in the fields to help support the family. He cared for his younger siblings while his mother was picking cotton and his father was away on his many trips with the merchant marine. His father beat defendant, singling him out among the children for especially severe abuse. Defendant's parents divorced when he was 10.\n\nAlthough defendant did not complete school as a child, he taught himself to read while in the merchant marine. He has been continuously employed in a variety of jobs and has been self-sufficient since he was 13.\n\nA Christian Science minister testified she had visited defendant some 60 times during his incarceration. She described the depth of his religious commitment and his dedication to helping other inmates, both spiritually and by teaching them to read. She indicated that defendant was responsible for settling a number of potentially violent disputes at the jail and that correctional officers have described him as a model prisoner.\n\nDiscussion\n\nI. Guilt Phase Issues\n\nA. Double Jeopardy.\n\nDefendant was tried twice on three counts of murder and one count of attempted murder. At the first trial, the jury indicated to the trial court it was deadlocked, seven jurors voting to acquit and five to convict. A subsequent vote revealed no change in the jurors' respective positions. The court asked the jury to continue its deliberations. After three hours, the foreman announced a third ballot had produced an identical result. The trial court called the jurors back into court and inquired whether further deliberations would be useful. After the jury indicated it could not overcome the deadlock, the trial court declared a mistrial and dismissed the jury. At no time did the trial court inquire whether the jury was able to reach a partial verdict of acquittal on any of the charged offenses, nor did the jury hint at such a possibility.\n\nDefendant argues that, under the rule of Stone v. Superior Court (1982) 31 Cal. 3d 503, 519 [183 Cal. Rptr. 647, 646 P.2d 809] (Stone), the mistrial was without legal necessity and his retrial placed him twice in jeopardy, in violation of the Fifth Amendment to the federal Constitution, as applicable to the states through the Fourteenth Amendment, and article I, section 15, of the California Constitution. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The constitutional guarantees against double jeopardy protect a defendant's \" 'valued right to have his trial completed by a particular tribunal' \" and his interest in not being subjected to successive prosecutions for the same offense. ( Arizona v. Washington (1978) 434 U.S. 497, 503 [54 L. Ed. 2d 717, 727, 98 S. Ct. 824], fn. omitted; Bigelow v. Superior Court (1989) 208 Cal. App. 3d 1127, 1135 [256 Cal. Rptr. 528].) \"The underlying idea, one that is deeply ingrained in at least the Anglo-American system of jurisprudence, is that the State with all its resources and power should not be allowed to make repeated attempts to convict an individual for an alleged offense, thereby subjecting him to embarrassment, expense and ordeal and compelling him to live in a continuing state of anxiety and insecurity, as well as enhancing the possibility that even though innocent he may be found guilty.\" ( Green v. United States (1957) 355 U.S. 184, 187-188 [2 L. Ed. 2d 199, 204, 78 S. Ct. 221, 61 A.L.R.2d 1119].)\n\nWhen a jury indicates it is unable to reach a verdict, double jeopardy rules bar retrial unless the defendant consents to the discharge of the jury ( People v. Compton (1971) 6 Cal. 3d 55, 62-63 [98 Cal. Rptr. 217, 490 P.2d 537] [defendant's mere silence is not consent to declaration of mistrial]), or the trial court determines further deliberations are not reasonably likely to result in a verdict (§ 1140), in which case legal necessity exists for a declaration of mistrial ( Arizona v. Washington, (supra) , 434 U.S. at pp. 503-505 [54 L. Ed. 2d at pp. 726-727, 98 S. Ct. 824]).\n\nStone, (supra) , 31 Cal. 3d 503, like this case, involved a homicide prosecution in which the jury was instructed on the charge of murder and uncharged lesser included offenses. The jury in Stone deliberated for seven days, but was unable to reach a unanimous verdict within the options presented to it. ( Id. at p. 507.) The prosecution and defense stipulated to an inquiry to determine the jury's position. The foreman reported in open court that no jurors voted for either first or second degree murder, four voted for voluntary manslaughter, two voted for involuntary manslaughter, six voted for justifiable homicide, and none voted for acquittal. (Ibid.) Each juror expressed the opinion the jury was hopelessly deadlocked and further deliberations would not yield a verdict. (Ibid.) The defense moved the court to accept a verdict of acquittal on the offenses of first and second degree murder. Noting no established procedure existed for such a partial verdict, the trial Judge denied the motion and ultimately declared a mistrial. ( Id. at pp. 508-509.) Defendant sought a writ of prohibition to prevent retrial. ( Id. at p. 509.) We concluded the trial court should have received the jury's verdict on first and second degree murder, and prospectively held as follows: \"n all cases in which the jury has not yet begun deliberations as of the date this decision becomes final, the trial court is constitutionally obligated to afford the jury an opportunity to render a partial verdict of acquittal on a greater offense when the jury is deadlocked only on an uncharged lesser included offense. Failure to do so will cause a subsequently declared mistrial to be without legal necessity.\" ( Id. at p. 519.) Our decision in Stone became final two months before the jury declared its deadlock at defendant's first trial.\n\nCiting People v. Chaney (1988) 202 Cal. App. 3d 1109 [249 Cal. Rptr. 251] (Chaney), defendant argues the failure of the trial court in his first trial to inquire whether defendant's jury could eliminate any of the charged offenses resulted in the mistrial lacking legal necessity. In Chaney, the Court of Appeal extended the rule in Stone as follows: \"vidence of an actual implied acquittal is unnecessary to take a declaration of mistrial outside the concept of legal necessity; it is enough if the trial court fails to afford the deadlocked jury with an opportunity to render a partial verdict of acquittal.\" (Chaney, (supra) , 202 Cal. App. 3d at p. 1122.)\n\nUnder the facts of Chaney, the Court of Appeal's statement that evidence of an actual implied acquittal is unnecessary to trigger the trial court's duty under Stone to permit the jury to render a partial verdict was unnecessary to its holding. This is because in Chaney evidence of an actual implied acquittal was in fact presented on the record, albeit not as clearly as in Stone. In stating it was deadlocked on a murder charge, the Chaney jury informed the trial court \" 'We have reached unanimity . . . on several items. Where we are disagreeing is on the degree. . . . The division is on two close possibilities, and . . . it's been this way just about from the first day of the deliberation.' \" (Chaney, (supra) , 202 Cal. App. 3d at p. 1113.) From this, the trial court in Chaney should have been aware the jury had eliminated some of the offenses; thus, the Court of Appeal's statement that evidence of an actual implied acquittal is unnecessary to remove a declaration of mistrial from the concept of legal necessity was, arguably, dictum.\n\nIn any event, we do not agree with the Chaney court's extension of Stone, which must be understood in its context. The problem we addressed in Stone was the unfairness of forcing a defendant to stand trial a second time for a murder of which a jury clearly and unanimously agreed he was not guilty, simply for lack of an established procedure for the receipt of a partial verdict of acquittal. Thus, we held the trial court must afford a jury the opportunity to render a partial verdict of acquittal on a greater offense when it is deadlocked only on an uncharged lesser included offense. (Stone, (supra) , 31 Cal. 3d at p. 519.) Absent some indication of deadlock only on an uncharged lesser included offense, the suggested procedures in Stone do not come into play. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e If the jury, in announcing apparent deadlock, gives such an indication, or if counsel so requests, the trial court, under Stone, should inquire further and determine whether any offenses can be eliminated.\n\nIn the present case, the trial court conducted a sufficient inquiry before declaring a mistrial. Nothing in the jurors' comments hinted they had agreed to acquit defendant of first degree murder and were in disagreement only on lesser included offenses. Moreover, neither the evidence in this case nor the defense proffered supports an inference of partial acquittal on a greater offense. We conclude the mistrial was a matter of legal necessity, and therefore reject defendant's claim of double jeopardy.\n\nB. Faretta motion.\n\nDefendant argues the trial court erroneously denied him his constitutional right to self-representation, despite his repeated request to exercise that right at various points in the proceedings. He specifically asserts error in the denial of his request, four weeks into jury selection, to represent himself. His contention lacks merit.\n\nAs noted, during the fourth week of trial, while the process of jury selection was still under way, the trial court heard defendant's motion to proceed in propria persona. Defendant expressed concern with the progress of the investigation, contending he alone could attempt an inquiry of certain witnesses that would elicit the truth for the jury. The trial court noted trial counsel's competence did not appear to be in question, and observed that the sort of investigation defendant appeared to contemplate would be infeasible given defendant's custodial status. Concluding that a defendant has no right, after the commencement of trial, to relieve counsel and proceed in propria persona unless there is a showing that his present counsel is incompetent, the trial court denied the motion.\n\nAs we have repeatedly held, although a defendant has a federal constitutional right to represent himself ( Faretta v. California (1975) 422 U.S. 806 [45 L. Ed. 2d 562, 95 S. Ct. 2525] (Faretta)), in order to invoke the right he must assert it within a reasonable time before the commencement of trial. ( People v. Clark (1992) 3 Cal. 4th 41, 98 [10 Cal. Rptr. 2d 554, 833 P.2d 561]; People v. Burton (1989) 48 Cal. 3d 843, 852 [258 Cal. Rptr. 184, 771 P.2d 1270]; see People v. Windham (1977) 19 Cal. 3d 121, 128 [137 Cal. Rptr. 8, 560 P.2d 1187] (Windham).) A motion made after this time is addressed to the sound discretion of the trial court, which should consider such factors as the quality of counsel's representation of the defendant, the defendant's prior proclivity to substitute counsel, the reasons for the request, the length and stage of the proceedings, and the disruption or delay that might reasonably be expected to follow the granting of such a motion. (Windham, (supra) , 19 Cal. 3d at p. 128.)\n\nDefendant complains the trial court both abused and failed to exercise its discretion, in that it improperly sought to condition his request on a showing of counsel's incompetence and failed to consider the appointment of advisory counsel. To the contrary: Although in denying defendant's Faretta motion the trial court relied heavily on the absence of any showing counsel was incompetent, the record reflects its explicit or implicit consideration of each of the other Windham factors. Furthermore, the trial court was aware of its power to appoint advisory counsel, but in its discretion elected not to do so. Defendant was not unconstitutionally denied his right to represent himself.\n\nC. Prosecutorial Misconduct.\n\nDefendant contends the prosecutor knowingly adduced perjured testimony by witness Kenny Mitchell and engaged in misconduct by arguing, in summation, that defendant bore the burden of raising a reasonable doubt as to his guilt. These prosecutorial actions, he contends, deprived him of a fair trial as guaranteed by the state and federal Constitutions.\n\n1. Use of Perjured Testimony.\n\nA full understanding of defendant's contentions requires that we set forth in some detail the circumstances under which Kenny Mitchell testified. On May 28, 1981, Mitchell, then in the Stanislaus County jail, gave Detective Ridenour a statement pertaining to the Marshall case. Mitchell was in custody on a parole violation and sought to avoid going back to prison. In return for the statement, Detective Ridenour agreed to appear before the parole board to recommend it not revoke Mitchell's parole. Ridenour performed as agreed, and Mitchell was not ordered back to prison.\n\nAt defendant's first trial, the defense called Mitchell as a witness. Mitchell was then incarcerated in state prison on a burglary conviction. Mitchell refused to respond to questioning, claiming he did not want a \"snitch jacket.\" In lieu of Mitchell's live testimony, a tape recording of his statement to Detective Ridenour was played to the jury and a transcript thereof was received in evidence. Defense counsel at the first trial argued Mitchell was the real killer and was lying about why he was unwilling to testify. The prosecutor argued the defense had wanted to use Mitchell to raise a reasonable doubt, in that the jury might believe Mitchell not only was present at the scene, but also committed the crimes. The prosecutor also pointed out that testimony by a police officer corroborated Mitchell's statement the door to the Marshall residence was open on the morning of the offense.\n\nAt defendant's second trial, the defense again called Mitchell to testify. Mitchell invoked his Fifth Amendment rights and the trial court ruled he was unavailable under Evidence Code section 240. The defense then called Benson Neal as a witness. Neal testified Mitchell admitted having committed the murders. (See Evid. Code, § 1230 [hearsay exception for declaration against penal interest].) In its rebuttal case, the prosecution called Mitchell to the stand. Mitchell indicated he wished to testify and that nothing he said would tend to incriminate him.\n\nMitchell's testimony was generally consistent with the statement he had given Detective Ridenour: Mitchell had arrived at defendant's residence around 10 or 11 a.m. on January 1, 1981, ostensibly to arrange a cocaine transaction, although in fact he intended to leave town with the money he hoped defendant would advance him. Mitchell parked his car around the block, and when he reached the driveway he heard a gunshot. Out of curiosity, he walked up to the porch of the house. At that point he heard another gunshot and the voice of a woman saying, \"Oh, God, George, what are you doing this for?\" The front door was open about 18 inches. Mitchell testified he saw defendant inside the house, wearing a white suit. Defendant appeared to be holding a black gun in his hand, and he was coming out of one room and going into a bedroom. Mitchell then left and drove to an Oak Street gambling shack.\n\nSeveral days later, the trial court interrupted the prosecutor's closing argument to allow the defense to present two newly discovered witnesses, Thompson and Ward. The witnesses testified Mitchell had told one or the other of them that he (Mitchell) had not been at defendant's house on January 1, 1981, and had seen nothing himself; that Annette May's brother had given him the idea of testifying against defendant in order to get charges against him dropped, and that he had obtained such a deal and had learned about details of the killings from films and slides he had viewed at the prosecutor's office.\n\nAfter Thompson and Ward testified, Mitchell was recalled to the stand. He acknowledged he knew Thompson and Ward and had discussed defendant's case with both of them. He acknowledged he had told Thompson he was not really going to testify, but was merely \"running a game\" on the police. Mitchell denied the prosecutor had ever shown him any slides or pictures. Detective Ridenour briefly testified to deny having shown Mitchell any slides or videotapes.\n\nIn closing argument, the prosecutor argued Mitchell had committed perjury on the stand. Defendant now contends the prosecutor's use of perjured testimony requires reversal of his conviction.\n\nDue process is denied when a prosecutor knowingly uses perjured testimony to obtain a conviction. ( Napue v. Illinois (1959) 360 U.S. 264, 269 [3 L. Ed. 2d 1217, 1220-1221, 79 S. Ct. 1173]; In re Imbler (1963) 60 Cal. 2d 554, 560 [35 Cal. Rptr. 293, 387 P.2d 6].) Originally, under the traditional rule, to obtain relief a defendant had to establish by a preponderance of the evidence that perjured testimony was adduced at his trial, that representatives of the state knew of its falsity, and that such testimony may have affected the outcome of the trial. (In re Imbler, (supra) , 60 Cal. 2d at p. 560; cf. § 1473, subd. (b) [writ of habeas corpus available when substantially material false evidence was presented at trial]; see People v. Gordon (1973) 10 Cal. 3d 460, 473, fn. 7 [110 Cal. Rptr. 906, 516 P.2d 298] [when alleged perjury appears from the record, same test applies on appeal as in habeas corpus proceedings].) Under the current rule, a showing that the false testimony was perjurious, or that the prosecution knew of its falsity, is no longer necessary. ( In re Hall (1981) 30 Cal. 3d 408, 424 [179 Cal. Rptr. 223, 637 P.2d 690]; In re Wright (1978) 78 Cal. App. 3d 788, 809, fn. 5 [144 Cal. Rptr. 535].)\n\nDefendant argues it was incumbent on the prosecutor, having acknowledged in closing argument that Mitchell had lied on the stand, to move to strike his testimony. In the absence of such a motion, defendant contends, his conviction must be reversed because Mitchell's testimony was surely false and just as surely material.\n\nWe conclude that, under the peculiar facts of this case, the presentation of Mitchell's testimony, although apparently false and certainly material, does not require reversal. As the Attorney General points out, it was initially the defense that sought to call Mitchell as a witness. Their aim in doing so was obvious: to place Mitchell at the scene of the offense and thereby to support defendant's claim that, notwithstanding the self-exculpating particulars of Mitchell's testimony, he--not defendant--was in fact the perpetrator. The prosecution too had its purpose in calling Mitchell: to rebut the testimony of Benson Neal that Mitchell had admitted responsibility for the killings. Mitchell's testimony thus supported certain aspects of both the defense and the prosecution, and enabled counsel for both sides to argue certain inferences beneficial to their respective positions. The falseness of Mitchell's testimony was not concealed from the jury: As described above, in closing argument the prosecutor repeatedly declared in no uncertain terms that Mitchell had lied on the stand. Both defense counsel and the prosecutor were able to and did argue to the jury concerning the precise nature of Mitchell's lies. Defendant never moved to strike Mitchell's testimony; indeed, given its utility in his defense of third party culpability, defendant probably would have opposed any such motion had the prosecution made it.\n\nWe conclude defendant waived his claim that his conviction was based on false testimony by failing to raise it at trial when the falseness of Mitchell's testimony was well known to him, and the claim lacks merit in any event. Defendant's aim at trial--to use Mitchell's testimony to establish a possible defense--cannot be reconciled with his present argument the testimony should not have been used at all. Defense counsel's evident tactical purpose in acquiescing in the presentation of Mitchell's testimony bars defendant's related claim of ineffective assistance of counsel.\n\nDefendant also contends the prosecutor, in denying Mitchell was at defendant's house, improperly implied there was additional evidence known to him but unavailable to the jury, thereby making himself an unsworn, un-cross-examined witness. (See People v. Bolton (1979) 23 Cal. 3d 208, 213 [152 Cal. Rptr. 141, 589 P.2d 396].) We disagree. In context, the prosecutor's argument was merely fair comment on the evidence.\n\n2. Misstatement of Law on Burden of Proof.\n\nDefendant argues the prosecutor engaged in misconduct by misstating the applicable law in suggesting to the jury, in closing argument, that it was incumbent on defendant to raise a reasonable doubt concerning his guilt, and to do so not just by providing evidence he was not the killer, but by affirmatively showing who the killer was. Defendant notes it is improper for the prosecutor to misstate the law generally ( People v. Bell (1989) 49 Cal. 3d 502, 538 [262 Cal. Rptr. 1, 778 P.2d 129]), and particularly to attempt to absolve the prosecution from its prima facie obligation to overcome reasonable doubt on all elements ( People v. Gonzalez (1990) 51 Cal. 3d 1179, 1215 [275 Cal. Rptr. 729, 800 P.2d 1159]). This, defendant contends, is what the prosecutor did in arguing the defense wanted Kenny Mitchell's testimony in the record, despite the falsity of his story, because \"They had to come up with another possible suspect to create in your minds that reasonable doubt that they want you to have when you enter that jury deliberation room.\" \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDefendant concedes his trial counsel failed to object to these remarks, but urges he should be excused from the usual consequences of such failure (see People v. Gonzalez, (supra) , 51 Cal. 3d at p. 1215 [waiver of error by failure to object]) because counsel thereby rendered ineffective assistance of counsel.\n\nIn the context of the whole argument and the instructions, we see no reasonable likelihood (see People v. Berryman (1993) 6 Cal. 4th 1048, 1072 [25 Cal. Rptr. 2d 867, 864 P.2d 40]) the jury construed the prosecutor's remarks as placing on defendant the burden of establishing a reasonable doubt as to his guilt. When the prosecutor made the challenged comment, he had just finished reviewing the evidence presented in the prosecution's case-in-chief, with the evident aim of demonstrating he had succeeded in proving defendant guilty beyond a reasonable doubt. As in People v. Gonzalez, (supra) , 51 Cal. 3d at page 1215, the prosecutor then could legitimately argue that in order persuasively to cast doubt on the prosecution's case, the defense of third party culpability would need to identify a possible perpetrator. Accordingly, defendant fails to establish either misconduct or, it follows, ineffective assistance of counsel. (See Strickland v. Washington, (supra) , 466 U.S. at pp. 691-692 [80 L. Ed. 2d at pp. 695-697, 104 S. Ct. 2052].)\n\nD. Admission of Photographic Evidence.\n\nDefendant contends the trial court erred in admitting, over his objection, photographs depicting the waterbed as it was reconstructed in October 1982. The reconstruction was designed to show that on the day of the crimes Annette May could, as she testified, have looked through a crack in the headboard of the waterbed and identified defendant. The trial court held a hearing, outside the presence of the jury, to determine whether the prosecution had met its burden of showing that the reconstructed waterbed, as depicted in the photographs, was set up in the same manner as on January 1, 1981, and that the conditions in the bedroom were substantially similar to those prevailing on that date. (Evid. Code, § 403.) The trial court ruled there was sufficient evidence from which the jury could find the foundational facts and, accordingly, admitted the photographs. Defendant contends the trial court erred in so ruling.\n\nEvidence Code section 403, subdivision (a), provides in pertinent part as follows: \"The proponent of the proffered evidence has the burden of producing evidence as to the existence of the preliminary fact, and the proffered evidence is inadmissible unless the court finds that there is evidence sufficient to sustain a finding of the existence of the preliminary fact, when: (1) The relevance of the proffered evidence depends on the existence of the preliminary fact . . . .\" The trial court viewed its function as being \"to establish whether or not there is any sufficient evidence that could possibly support a finding that the foundational fact exists,\" and concluded in the affirmative.\n\nDefendant argues the trial court employed an erroneous standard, and that even applying that standard, admission of the photographs was an abuse of discretion. The proper standard is that of preponderance of the evidence. In other words, the trial court must determine whether the evidence is sufficient to permit the jury to find the preliminary fact true by a preponderance of the evidence ( People v. Simon (1986) 184 Cal. App. 3d 125, 134 [228 Cal. Rptr. 855]), even if the court personally would disagree ( People v. Pic'l (1981) 114 Cal. App. 3d 824, 860 [171 Cal. Rptr. 106], disapproved on other grounds in People v. Kimble (1988) 44 Cal. 3d 480, 498 [244 Cal. Rptr. 148, 749 P.2d 803]). In the present case, the trial court's paraphrase of Evidence Code section 403 enables us confidently to conclude it understood its obligation under that statute.\n\nFurther, we are persuaded the court's ruling was no abuse of discretion. The evidence was ample from which the jury could determine the photographs depicted the waterbed under conditions substantially similar to those prevailing at the time of the offense. Detective Ridenour testified he set up the waterbed in the bedroom, using indentations in the carpet to position it. The photographs were taken around noon, on October 28, 1982, using a flash with no lights on in the room, under bright and clear weather conditions. Thus, the reconstruction took place near the same time of day, under similar lighting conditions (barring the camera flash) as prevailed at the time of the offense, although weather conditions evidently were not identical. Furthermore, Annette May identified the photographs as depicting what she saw through the headboard crack at the time of the offenses, and the prosecution introduced a photograph taken on the day of the offense, showing a crack between the waterbed headboard and the base of the waterbed. Thus, the jury could directly compare the reconstruction photographs with those initially taken at the scene of the offense. Even, however, were we to conclude the trial court abused its discretion in admitting the reconstruction photographs, we would hold reversal to be unwarranted, as we are unpersuaded, in light of the other evidence bearing on May's identification of defendant, a reasonable probability exists the photographs affected the outcome. ( People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].)\n\nIn a related claim, defendant argues the trial court erred in failing to instruct the jury, sua sponte, to disregard the reconstruction photographs unless it found the conditions represented in the photographs to be substantially similar to those prevailing at the time of the offense. Evidence Code section 403, subdivision (c)(1), however, provides that if the court admits the evidence, it \"[m]ay, and on request shall, instruct the jury to determine whether the preliminary fact exists and to disregard the proffered evidence unless the jury finds that the preliminary fact does exist.\" The statute clearly does not contemplate a sua sponte duty to instruct, and we see no abuse of discretion in the court's failure to do so. The jury was aware the waterbed had been taken down and reconstructed, and that it might not have been put back together exactly as it had originally been set up. Defense counsel presented testimony designed to prove there was no visible crack, and argued the jury should disregard the reconstruction photographs. We see no possibility the jury could have misunderstood its obligation to assess the relevancy of the reconstruction photographs.\n\nE. Witness May.\n\n1. Court Questioning.\n\nAnnette May's testimony revealed certain intellectual limitations and difficulties in expressing herself. During her cross-examination, she stated she did not know the meaning of the terms \"perjury\" and \"under oath\" and did not know what happens if a witness fails to tell the truth under oath. The prosecutor suggested the court voir dire May on her understanding of her duty to tell the truth. Defense counsel joined in the suggestion, and requested voir dire be conducted outside the presence of the jury. The court did not respond to defense counsel's request, but proceeded immediately to voir dire the witness without excusing the jury. Although May exhibited confusion over some of the terms the court used, she acknowledged her understanding that upon being sworn by the clerk, the law required her to tell the truth and that a witness who lies under oath can be punished. The court denied the motion to disqualify May under Evidence Code section 701. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nOn appeal, defendant acknowledges the trial court did not err in denying the motion to disqualify May. He urges, however, the trial court abused its discretion in failing to voir dire May outside the presence of the jury. Its failure to do so, he contends, surrounded May's testimony with an undeserved aura of credibility.\n\nAs defendant implicitly concedes, whether to conduct voir dire outside the presence of the jury was a matter within the trial court's discretion. (Evid. Code, § 402, subd. (b) [the court \"may\" determine the admissibility of evidence outside the jury's presence, but in criminal cases the admissibility of a confession or admission by defendant \"shall\" be determined outside the jury's presence on any party's request].) Defendant fails to persuade us the trial court abused its discretion in not doing so in this instance. We see no possibility the jury might have understood the trial court's ruling that May was competent as a witness as placing on her \"a mantle of judicial approval,\" nor any way in which the defense might have been hindered in attacking her credibility. To avoid this very possibility, the trial court admonished the jury that a ruling that certain evidence was admissible in no way implied an endorsement of the witness's credibility or the weight to be given the testimony. Those matters, the court emphasized, were reserved to the jury.\n\n2. Denial of Psychiatric Examination.\n\nOut of the jury's presence, defense counsel, having unsuccessfully sought a mistrial on the ground that Annette May was incompetent as a witness, moved for an order requiring May to submit to a psychiatric or psychological examination to determine her competency. The trial court denied the motion, expressing its belief a psychiatrist or psychologist could not add anything to what had been accomplished in May's cross-examination. Defendant concedes the trial court may very well have been justified in denying the motion, but argues we cannot presume from the silent record that the trial court took \"appropriate factors\" into account in doing so.\n\nWe find no error in either the trial court's ruling on the motion or the manner in which it was made. The use of psychiatric testimony to impeach a witness is generally disfavored. ( In re Darrell T. (1979) 90 Cal. App. 3d 325, 335 [153 Cal. Rptr. 261]; see § 1112 [prohibiting compulsory psychiatric or psychological examination to assess credibility of victim or witness in sexual offense prosecution].) The fact a witness makes inconsistent and exaggerated statements does not compel a different Conclusion. ( People v. Knox (1979) 95 Cal. App. 3d 420, 431 [157 Cal. Rptr. 238].) Defendant fails to enumerate any \"appropriate factors\" the trial court failed to consider, and we see none on this record.\n\nF. Refusal to Permit Rebuttal.\n\nDefendant contends the trial court erred in refusing to allow him to call a witness, Irdee Williams, on surrebuttal. After both sides had rested and the prosecutor had begun his guilt phase summation, the trial court allowed defense counsel to reopen in order to present two witnesses (Charles Thompson and Albert Ward) to impeach Kenny Mitchell. Defense counsel then sought permission to present the testimony of Williams, making an offer of proof she would testify that she had lived in the Black community of Modesto for a number of years; that at times relevant to the offenses she was engaged in the sale of new and used clothing; and that in mid-December 1980 she possessed about 150 three-piece white suits, of which she sold about 50 to the Black community and of which 8 were stolen from her in the period preceding Christmas. Defense counsel argued Williams's evidence would show the prevalence of white suits within the concentrated Black community of Modesto, which in turn would enable him to argue to the jury \"the likelihood that it might have been anyone wearing a white suit within that community who entered the home at Locust Street that morning.\" The trial Judge refused to permit the testimony, stating he did not consider the evidence of sufficient probative value to justify admitting it after the evidence had been, for practical purposes, closed and argument had commenced.\n\nDefendant contends the trial court's ruling denied him his constitutional right to present evidence relevant to his defense theory, and as such constituted an abuse of discretion. ( Washington v. Texas (1967) 388 U.S. 14, 19 [18 L. Ed. 2d 1019, 1023, 87 S. Ct. 1920]; People v. Burrell-Hart (1987) 192 Cal. App. 3d 593, 599 [237 Cal. Rptr. 654].) Although a criminal defendant is constitutionally entitled to present all relevant evidence of significant probative value in his favor, this does not mean the court must allow an unlimited inquiry into collateral matters; the proffered evidence must have more than slight relevancy. ( People v. Jennings (1991) 53 Cal. 3d 334, 372 [279 Cal. Rptr. 780, 807 P.2d 1009]; People v. Babbitt (1988) 45 Cal. 3d 660, 684 [248 Cal. Rptr. 69, 755 P.2d 253].) We review for abuse of discretion a trial court's ruling on a motion to reopen a criminal case to permit the introduction of additional evidence. (§ 1094; People v. Rodriguez (1984) 152 Cal. App. 3d 289, 294-295 [199 Cal. Rptr. 433] [factors an appellate court will consider in reviewing the trial court's determination include the stage the proceedings had reached when the motion was made, the diligence shown by the moving party in discovering the new evidence, the prospect the jury would accord it undue emphasis, and the significance of the evidence].)\n\nWe find no constitutional error or abuse of discretion in the trial court's refusal to permit defendant to present Williams's testimony. The prosecutor had already begun his summation, and Williams's testimony would have increased the disruption already occasioned by the appearance of witnesses Thompson and Ward. While it does not appear defendant failed to exercise reasonable diligence in discovering the witness, that the jury would have accorded her testimony much weight seems very unlikely, because its relevance, in our view, was slight. The primary evidence against defendant, Annette May's identification of him shortly after the shootings, did not hinge on the uniqueness of his white suit. That others in the Black community in Modesto owned white suits did not undermine May's testimony. Accordingly, we cannot say the trial court erred in declining to reopen the case to permit Williams to testify. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nG. Refusal to Declare Mistrial.\n\nThe prosecution tried to establish a motive for the killings through the testimony of Alvin Green. Green had met defendant while defendant and Green's wife were employed at Gallo Glass Company, and Green worked for defendant at the disco as a security guard and substitute disc jockey for several months until December 1980. On December 31, 1980, Green testified, he spoke with defendant at the disco. Defendant told him he and Cynthia were not getting along, that they were having problems and might be separating. Green elaborated that defendant told him \"he was an ex-felon and that so far as the businesswise it was in his wife's name and that if she left him, he would lose everything and that he would see her dead before he lost everything.\"\n\nImmediately after this testimony the trial court dismissed the jury and allowed defense counsel to voir dire the witness. Green indicated he had discussed his testimony with the prosecutor the preceding night, and the prosecutor did not caution him to avoid mentioning in court that defendant was an ex-felon. Defense counsel objected to both the appearance of prosecutorial misconduct and the introduction of what he claimed was a highly inflammatory and inadmissible statement, and moved for a mistrial.\n\nThe prosecutor admitted Green had related the \"ex-felon\" statement to him the previous evening, but contended Green had not told him defendant made the statement during the December 31, 1980, conversation in the disco. Had he understood that to have been the case, the prosecutor stated, he would have instructed Green not to mention it in court.\n\nThe trial court found the evidence did not support a finding the prosecutor had deliberately \"set this matter up for the purpose of prejudicing the defendant's case and that any failure to warn the witness not to mention this was inadvertent.\" The trial court eventually denied the motion for mistrial. Under the impression defendant was not, in fact, an ex-felon, the trial court tentatively expressed the view the jury should be instructed defendant was not an ex-felon. Later, still unsure about the nature of defendant's prior conviction, the trial court expressed an inclination to admonish the jury to consider the ex-felon statement only on the question of motive, if it accorded the statement any weight at all. Defense counsel agreed to submit a draft admonition to the court, but failed to do so. Later, defense counsel acknowledged he had never submitted an admonition because he \"couldn't write one that didn't do more damage than it cured.\" Ultimately, the court granted defense counsel's motion to strike from the record Green's ex-felon testimony, and to give no admonition to the jury. The court, however, never actually struck the testimony, which therefore remained in the record for the jury to consider.\n\nDefendant now contends his conviction must be reversed because the trial court erred in refusing to grant a mistrial. Defendant argues mistrial was required because (1) Green's ex-felon statement was extraordinarily prejudicial; (2) the prosecutor knew or should have known Green would make the statement, yet consciously decided not to caution him; and (3) the trial court's failure to follow through with its stated intention to strike the ex-felon testimony meant the damage was never undone.\n\nTo the extent the second of defendant's arguments implies the prosecutor engaged in misconduct, the record refutes it. As the trial court noted, \"[Green's ex-felon statement] was not presented to me in advance and that was not a matter of design by the District Attorney's office, nor was it done with any knowledge that the witness was going to respond in the particular way that he did respond, and . . . [defense counsel] has indicated while we were off the record that he feels that [the prosecutor] acted in complete good faith in that matter.\" Absent any strong contrary evidence in the record, we will not second-guess the trial court's determination of the prosecutor's bona fides.\n\nAlthough finding no prosecutorial bad faith, the trial court concluded that, had the opportunity existed to rule in advance on the admissibility of the ex-felon statement, exclusion would have been appropriate. This Conclusion was not an abuse of discretion. The trial court could reasonably find, as it did, that the potential prejudice from the statement outweighed its relevance on the issue of motive. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e (Evid. Code, § 352.)\n\nThe question, then, is whether the trial court's inadvertent failure to strike the \"ex-felon\" statement relates back, as it were, to the denial of the mistrial motion or, in other words, whether the denial of the mistrial motion can be said to have been conditioned on striking the statement, so that the failure of the condition vitiated the ruling. Nothing in the trial court's comments suggests it intended the striking of the statement as the sine qua non of its ruling on the mistrial motion. Reviewing the court's denial of the motion for abuse of discretion, we are unable to conclude the court committed reversible error. True, the solution most agreeable to the defense--striking the ex-felon statement--was not effectuated. Nevertheless, at no time during the subsequent progress of the trial was the jury's attention recalled to the statement, whether by an (undesired) admonishment, argument of counsel, or otherwise. Moreover, to the extent it supported a theory of motive, Green's testimony was amply rebutted by evidence showing that most of the property owned by defendant and his wife was in both their names, not, as Green suggested, in Cynthia's alone. And because defendant had, in fact, been convicted of a felony, the jury was not told a damaging falsehood about defendant's criminal record. Accordingly, while to strike the statement, as the trial court intended to do, would arguably have been better, we are unable to say its remaining in the record was so prejudicial as to require reversal.\n\nH. Refusal to Order Discovery of Witnesses' Correctional Records.\n\nDefendant argues the trial court erred in denying his request for discovery of Department of Corrections records pertaining to prosecution witnesses in general and Gary Brady in particular. We first discuss contentions relating to Brady.\n\nBrady testified on direct examination that, while they were both in custody in the Stanislaus County jail, defendant admitted his guilt to Brady. Defense counsel then moved for discovery of Brady's Department of Corrections file, stating he had been informed Brady had once been committed to Patton State Hospital after a section 1368 competency hearing, and the file was needed to cross-examine Brady effectively as to his mental competency. The trial court denied the motion, commenting Brady had indeed been committed to Patton State Hospital, had escaped, and had been wounded and apprehended in Arkansas. Defense counsel argued the file might contain psychiatric evaluations and other evidence casting light on Brady's mental capacity to tell the truth. The trial court denied the motion on the basis the material sought was privileged. It acknowledged, however, that if defense counsel furnished some authority to the contrary, the appropriate course would be to conduct an in camera review of the file to determine specific questions of relevancy and privilege.\n\nDefense counsel did not renew his discovery motion, but cross-examined Brady extensively on his prior criminal history, his involvement in unrelated crimes, his history of testifying against other defendants in return for favorable treatment by the prosecutor in his own cases, and the terms of the arrangement under which he was testifying in defendant's case. Additionally, defense counsel cross-examined Brady concerning his psychiatric history. Brady acknowledged suffering from a mild seizure disorder. He also acknowledged having been sent to Patton State Hospital at a time when he was \"smoking a lot of PCP\" and was \"in a fantasy trip,\" where an EEG (electroencephalogram) revealed slight, temporary abnormalities caused by use of drugs. Brady also stated that after a full psychiatric examination he had been diagnosed as having a psychopathic personality with some paranoid schizophrenic coloring under stress. Asked to elaborate on those diagnoses, Brady stated \"psychopathic personality . . . is the type of outlaw type dude like I am. I have been fighting the law all my life . . . . And the schizophrenic coloring is that under due [ sic ] stress or something like that, I get frustrated and I keep thinking that someone is against me or trying to, you know; otherwise, I provoke something that isn't really there.\" Brady admitted that if alone and under stress or in a state of anxiety, he sometimes imagines things and has violent rages.\n\nDefendant contends he was entitled to discovery of Brady's correctional file in order to secure a fair trial and an adequate opportunity for cross-examination. ( People v. Memro (1985) 38 Cal. 3d 658, 677 [214 Cal. Rptr. 832, 700 P.2d 446]; Davis v. Alaska (1974) 415 U.S. 308, 315-316 [39 L. Ed. 2d 347, 353-354, 94 S. Ct. 1105]; Brady v. Maryland (1963) 373 U.S. 83, 87 [10 L. Ed. 2d 215, 218-219, 83 S. Ct. 1194].) Defendant also suggests the compulsory process clause of the Sixth Amendment to the federal Constitution may be read to require the disclosure of potentially exculpatory evidence. (But see Pennsylvania v. Ritchie (1987) 480 U.S. 39, 55-56 [94 L. Ed. 2d 40, 56-57, 107 S. Ct. 989] (plur. opn. by Powell, J.) [declining to decide how the guarantees of the compulsory process clause differ from those of the Fourteenth Amendment].) He contends the trial court failed to follow established procedure, in that no representative of the state first asserted the privilege, no in camera review took place, and no balancing occurred of defendant's interest in gaining access to the file against the state's interest in maintaining its confidentiality. (See Delaney v. Superior Court (1990) 50 Cal. 3d 785, 807-814 [268 Cal. Rptr. 753, 789 P.2d 934] (Delaney) [articulating the test defendant must meet to overcome newsperson's privilege under shield law].)\n\nAgainst defendant's claim of entitlement to Brady's correctional records, the Attorney General focuses on the generally confidential nature of Department of Corrections files (see § 2081.5; Alanis v. Superior Court (1970) 1 Cal. 3d 784, 787 [83 Cal. Rptr. 355, 463 P.2d 707] [prisoner has no right to access his own correctional file in support of motion for resentencing; implying only those persons authorized by § 2081.5 may have access to correctional records]; Yarish v. Nelson (1972) 27 Cal. App. 3d 893, 902 [104 Cal. Rptr. 205] [media representatives not entitled to prisoner records]), and emphasizes defendant received full disclosure of Brady's felony record and inducements to testify. In light of these disclosures, the trial court's refusal to order disclosure of Brady's correctional file, according to the Attorney General, could not have prejudiced defendant.\n\nPennsylvania v. Ritchie, (supra) , 480 U.S. 39 [94 L. Ed. 2d 40, 107 S. Ct. 989] (Ritchie), is instructive in resolving this issue. In Ritchie, the defendant, accused of sexually molesting his daughter, sought discovery of confidential files maintained by the state child protective agency, claiming the files were needed to enable him effectively to cross-examine his daughter in his criminal trial. The trial court denied disclosure of the files; the state's highest court reversed that ruling, concluding defendant, through his attorney, was entitled under the confrontation and compulsory process clauses of the Sixth Amendment to search the files for any useful evidence. On writ of certiorari, the United States Supreme Court affirmed in part and reversed in part.\n\nA plurality of the high court analyzed the case under the due process clause of the Fourteenth Amendment, noting the confrontation clause is a trial right, not a guarantee of pretrial discovery (Ritchie, (supra) , 480 U.S. at pp. 52-53 [ 94 L. Ed. 2d at pp. 56-57, 107 S. Ct. 989]), and declining to decide the precise contours of the compulsory process clause ( id. at pp. 55-56 [94 L. Ed. 2d at pp. 56-57]). A majority of the court went on to note it is \"well settled\" the government must turn over evidence in its possession that is both favorable to the accused and material to guilt or punishment. ( Id. at p. 57 [94 L. Ed. 2d at p. 57].) Materiality, the Ritchie majority observed, is established on a showing there is a reasonable probability that, had the evidence been disclosed to the defense, the result of the proceeding would have been different, a reasonable probability being a probability sufficient to undermine confidence in the outcome. (Ibid., citing United States v. Bagley (1985) 473 U.S. 667, 682 [87 L. Ed. 2d 481, 494, 105 S. Ct. 3375].) The Ritchie majority acknowledged the state's contention the files were confidential, but because Pennsylvania law recognized specified exceptions to their confidentiality, the Ritchie majority saw no reason to believe the relevant information would not be disclosed on a showing of materiality to the defense of the accused. (Ritchie, (supra) , 480 U.S. at pp. 57-58 [ 94 L. Ed. 2d at pp. 57-58, 107 S. Ct. 989].) Accordingly, the majority affirmed the Pennsylvania Supreme Court judgment to the extent the latter directed a remand to the trial court for a determination of materiality. The Ritchie majority concluded, however, that an in camera review by the trial court, rather than full disclosure to defense counsel, would suffice to protect both defendant's interest in due process and the state's policy of protecting the confidentiality of its child abuse files. ( Id. at pp. 58-61 [94 L. Ed. 2d at pp. 58-60].)\n\nAlthough it appears the trial court in the present case short-circuited the adjudication of the privilege issue in the first instance by failing to require the prosecutor to assert the privilege now claimed, as provided in Delaney, (supra) , 50 Cal. 3d 785 (see also Kerr v. United States Dist. Ct. for North. Dist. of Cal. (9th Cir. 1975) 511 F.2d 192, 198, affirmed, 426 U.S. 394 [48 L. Ed. 2d 725, 96 S. Ct. 2119] (1976) [specifying procedure under federal law for assertion of privilege in correctional records]), we conclude reversal is unwarranted. (Ritchie, (supra) , 480 U.S. at p. 57 [ 94 L. Ed. 2d at p. 57, 107 S. Ct. 989]; United States v. Bagley, (supra) , 473 U.S. at p. 678 [87 L. Ed. 2d at pp. 491-492, 105 S. Ct. 3375]; People v. Pensinger (1991) 52 Cal. 3d 1210, 1272 [278 Cal. Rptr. 640, 805 P.2d 899].)\n\nFirst, assuming Brady's file contained information concerning his 1977 commitment to Patton State Hospital in a temporary, phencyclidine (PCP)-related \"fantasy\" state, defendant does not suggest how that state might be relevant to Brady's mental stability either in 1981, when defendant allegedly confessed his crimes to him, or in 1983, at the time of trial. Second, the jury heard Brady's version of his diagnosis and its significance; although we cannot, of course, say whether Brady's testimony accurately reflected the contents of his correctional file, it did raise questions about his mental stability, to which the jury was entitled to give whatever weight it deemed appropriate. Finally, Brady's credibility was extensively impeached with evidence of his prior criminal history, his involvement in other crimes, and the inducements for his testimony. Even assuming Brady's file contained psychiatric evidence casting doubt on his credibility, therefore, we see no reasonable probability the outcome of this case would have been different had it been disclosed to the defense. (Ritchie, (supra) , 480 U.S. at p. 57 [ 94 L. Ed. 2d at p. 57, 107 S. Ct. 989].) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e For the same reason, we are unpersuaded defendant suffered prejudice as required by People v. Memro, (supra) , 38 Cal. 3d at page 684, where the denial of Pitchess discovery (see Pitchess v. Superior Court (1974) 11 Cal. 3d 531 [113 Cal. Rptr. 897, 522 P.2d 305]) \"deprived [the defendant] of the possibility of presenting evidence\" on the issue whether his confession was voluntary beyond a reasonable doubt.\n\nAs to the contention the trial court erred in refusing to order disclosure of the probation and parole records of other prosecution witnesses, we likewise conclude that, despite any error by the trial court in failing to proceed as discussed above, defendant makes no adequate showing of prejudice in light of the discovery order that was made, i.e., requiring disclosure of prosecution witnesses' felony records and inducements to testify.\n\nI. Trial Court's Rulings on Excusal of Jurors Waldon and McCoy.\n\n1. Applicable Law.\n\nDefendant contends the trial court erred in denying his midtrial motion to excuse Juror Waldon and in granting, over his objection, the prosecutor's similar motion to excuse Juror McCoy. He characterizes the two motions as \"identical\" except for the movant's identity, and argues these asserted errors, \"singly and in combination,\" prejudiced the defense.\n\nSection 1089 provides in relevant part that \"[i]f at any time, whether before or after the final submission of the case to the jury, a juror dies or becomes ill, or upon other good cause shown to the court is found unable to perform his duty . . . the court may order him to be discharged and draw the name of an alternate . . . .\" We review for abuse of discretion the trial court's determination to discharge a juror and order an alternate to serve. ( People v. Ashmus (1991) 54 Cal. 3d 932, 987 [2 Cal. Rptr. 2d 112, 820 P.2d 214].) If there is any substantial evidence supporting the trial court's ruling, we will uphold it. ( People v. Johnson (1993) 6 Cal. 4th 1, 21 [23 Cal. Rptr. 2d 593, 859 P.2d 673].) We have also stated, however, that a juror's inability to perform as a juror must \" 'appear in the record as a demonstrable reality.' \" (Ibid.)\n\nAs a preliminary matter, we note that, as subjects of the respective parties' motions, Juror Waldon and Juror McCoy presented factually distinct problems. The only \"identical\" aspect of the two motions is that both jurors professed the ability to be fair to both parties. To belabor the obvious, Waldon and McCoy displayed different demeanors, attitudes, and nonverbal behavior in their respective voir dires, and the trial court in this case necessarily made individual assessments of their credibility. The court's two rulings are therefore incommensurable, and we cannot review them \"in combination.\" Rather, we must separately examine the trial court's ruling as to each juror under the abuse of discretion standard.\n\n2. Juror Waldon.\n\nSeveral days into the trial, Juror Waldon asked the bailiff, \" 'Do you think we are in any danger of getting shot if the jury should decide that the defendant was guilty?' \" The bailiff advised the trial Judge of her remark. After initially speaking to Waldon outside the presence of defendant and counsel, the Judge conducted a further hearing before defendant and counsel, outside the presence of the jury. Waldon stated that, returning home one night after the proceedings, she told her husband what she had said to the bailiff. Her husband had responded, \" 'Just do the best you can in the trial and don't worry about it. The man isn't a member of the Mafia or something like that.' \" Juror Waldon said, in essence, her remark to the bailiff was made in jest, and she denied any apprehension about her ability to function as a juror. She also said she had not mentioned the remark to the other members of the jury. She denied having formed an opinion concerning defendant's guilt and maintained she could be an unbiased juror.\n\nDefendant moved to discharge Juror Waldon on the grounds that she was apprehensive about retaliation by defendant, she had improperly discussed the case with her husband, and she might have formed an opinion about defendant's guilt.\n\nThe trial court denied defense counsel's motion to discharge Juror Waldon. The Judge found credible her explanation that she had made the statement to the bailiff in jest. He noted Waldon had worked for the California Highway Patrol with uniformed officers for many years and probably was accustomed to trading banter with peace officers, of which the bailiff was one. The Judge noted further that if Waldon were truly apprehensive about her safety, she would have welcomed the opportunity to escape jury service. The Judge also accepted Waldon's assurance she had not yet formed an opinion on the case. Finally, he opined that Waldon's repeating the comment to her husband did not constitute a violation of the admonition, because the statement was merely a general comment having nothing to do with the facts of the case. We conclude the record supports the trial court's ruling, and we decline to overturn its determination as to Waldon's credibility. Consequently, we find no abuse of discretion in the trial court's denial of the defense motion to excuse Juror Waldon.\n\nIn a related claim, defendant argues he was denied his right to be present when the trial court initially spoke with Juror Waldon, outside the presence of defendant and counsel, concerning her remark to the bailiff. A capital defendant has a waivable right to be present at all critical stages of trial. ( People v. Edwards (1991) 54 Cal. 3d 787, 810 [1 Cal. Rptr. 2d 696, 819 P.2d 436].) The record indicates counsel had agreed the court should question Juror Waldon, on the record and outside counsel's and defendant's presence, to determine whether it would be necessary to conduct a hearing on the matter; the trial court furnished counsel with a transcript of that questioning to enable them to make that determination. Furthermore, not only defense counsel, but defendant himself was subsequently afforded the opportunity to question Juror Waldon. Defendant therefore fails to demonstrate he was denied the right to be present at any critical stage of his trial.\n\n3. Juror McCoy.\n\nOn the 43d day of trial, the trial Judge interviewed Juror McCoy outside the presence of the other jurors. The Judge indicated he had learned McCoy had appeared before a municipal court Judge concerning a speeding ticket McCoy had received from the California Highway Patrol. A hearing on the ticket was scheduled for the following Monday, approximately the time the jury would be deliberating defendant's capital case. The municipal court Judge had referred McCoy to the district attorney's office \"to see about having or soliciting the District Attorney's assistance in having a traffic ticket disposed of.\" McCoy explained that under his employer's rules, if the ticket were upheld he would lose his job. Previously he had received four other tickets, on two of which he claimed he had been \"railroaded.\" The trial Judge asked McCoy whether the situation with the ticket would affect his ability to serve as a juror. McCoy acknowledged it would be a problem, because \"it means my job.\" THE JUDGE ASKED: \"Okay. Because the District Attorney's office has refused to intercede in your behalf here, does that mean, though, that you feel you would be influenced as a juror in this particular case, possibly, by that fact?\" McCoy replied, \"Well, I wonder where the Justice is. You're talking about my life, you know, my income.\" Later, in the course of the voir dire, McCoy commented: \"So, I don't know. I mean, it would change my view on Justice, on the system, yes.\" McCoy denied any resentment toward the prosecutor, or any \"particular person,\" but also said if his ticket were not dismissed he \"would set here and wonder where Justice was at.\" McCoy said, \"I don't think it would have any effect on the decision that I would make here except I wouldn't have my mind on what I am doing here.\" Over defense opposition, the prosecutor moved to excuse McCoy from further jury service.\n\nAfter additional voir dire of McCoy and argument of counsel, the Judge granted the prosecutor's motion. He reasoned: \"If it were not for the fact that the man's livelihood is bound up in all of this and if it were not for the fact that he feels so strongly that the system owes him this dismissal, notwithstanding his guilt of the citation, and that ultimately the District Attorney's Office is going to be at least in part responsible, if the worst happens, I agree with [the prosecutor], I really don't think that even though the man basically is honest, even though he has made the decision in his own mind he isn't going to let it bother him, I don't think that there is any way he can avoid it at least unconscientiously [ sic : unconsciously] affecting any judgment that he might render.\"\n\nHere, too, the record supports the trial court's ruling. Juror McCoy adhered to the belief Justice required dismissal of his ticket, and admitted he would be unable to focus on the trial if he were left in doubt as to his employment status. Although he professed no resentment toward the prosecutor, he clearly felt some animosity toward the district attorney's office. We cannot say the trial court abused its discretion in excusing Juror McCoy under these circumstances.\n\nJ. Failure to Instruct on Effect of Intoxication.\n\nDefendant contends the trial court committed reversible error by failing, despite defense counsel's request, to instruct the jury both that intoxication can negate the mental state required for first degree murder and on the lesser included offense of voluntary manslaughter due to diminished capacity and heat of passion. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e At the time of these offenses, diminished capacity, if it negated premeditation and deliberation, precluded conviction of first degree murder; if it also negated malice aforethought, it reduced the homicide from murder to manslaughter. ( People v. Cruz (1980) 26 Cal. 3d 233, 242 [162 Cal. Rptr. 1, 605 P.2d 830].) Voluntary intoxication, as well as mental illness, was recognized as a cause of diminished capacity. ( People v. Saille, (supra) , 54 Cal. 3d at p. 1110.)\n\nA trial court must instruct on a lesser included offense, whether or not so requested, whenever there is evidence sufficient to deserve consideration by the jury, i.e., evidence from which a reasonable jury composed of reasonable persons could have concluded a lesser offense, rather than the charged crime, was committed. ( People v. Wickersham (1982) 32 Cal. 3d 307, 325 [185 Cal. Rptr. 436, 650 P.2d 311], disapproved on other grounds in People v. Barton (1995) 12 Cal. 4th 186, 200-201 [47 Cal. Rptr. 2d 569, 906 P.2d 531].) The determination whether sufficient evidence supports the instruction must be made without reference to the credibility of that evidence. ( People v. Mayberry (1975) 15 Cal. 3d 143, 151 [125 Cal. Rptr. 745, 542 P.2d 1337].)\n\nThe record contains some evidence defendant was under the influence of alcohol and fatigued at the time of the offenses. Defendant arose on the morning of December 31, 1980, and ran errands before going to work at Gallo Glass Company for his usual 4 p.m. to midnight shift. After finishing work for the evening, defendant caught a ride to the disco, arriving about 12:30 a.m. From then until about 3:30 a.m., defendant served champagne to his customers. He poured himself a drink shortly after his arrival and continued to drink throughout the night, consuming champagne, brandy and malt liquor. He felt tired and noticed the effects of the alcohol, although he did not consider himself intoxicated.\n\nWhen defendant left the disco about 7 a.m., he visited nearby Tolden's Pool Hall, where he had another drink. He then drove home, a distance of four or five blocks. He unloaded certain items from his car and poured himself another glass or two of champagne. At this point, he had been up continuously since being awakened the previous day, and was tired.\n\nAfter drinking the glass or two of champagne, defendant went into his bedroom and began to play with his daughters. He was unclear as to what he might have done between having the drinks and entering the bedroom. He testified he did not intend to fall asleep in the bedroom, but soon did. He acknowledged feeling the effects of \"being up that many hours and drinking,\" of being \"aware of tiredness,\" and being \"under the influence of alcohol.\"\n\nWhile asleep, defendant testified he thought he heard someone call his name, but did not know whether he was dreaming. When he finally awoke he did not know how long he had been asleep; he believed he had been home only a short while. When he emerged from the bedroom, he was immediately taken to the police station, where he kept \"going to sleep and waking up, going to sleep and waking up, going to sleep and waking up.\"\n\nOfficer Bratcher, who arrested defendant, described him as \"dazed,\" \"in a state of shock.\" Bratcher testified defendant \"did not appear to be in a normal behavior\" at the time of his arrest.\n\nAlmost three hours after defendant's arrest, a blood test revealed his blood-alcohol level to be .10 percent. As the trial court recognized, defendant's blood-alcohol level would have been higher at the time of the crimes. Criminalist Steven Glass testified that, at the level at which defendant's blood-alcohol tested, defendant's ability to drive a car would be impaired.\n\nIn denying the requested instructions, the trial court observed there was no evidence defendant \"was anywhere close to being grossly intoxicated,\" and that a .10 percent blood-alcohol level, standing alone, gave rise to nothing more than speculation as to intoxication. Evidence of \"gross intoxication,\" as such, however, is not a prerequisite to the giving of the instructions; what is required is evidence from which a reasonable jury could conclude defendant's mental capacity was so reduced or impaired as to negate the required criminal intent. ( People v. Flannel (1979) 25 Cal. 3d 668, 684 [160 Cal. Rptr. 84, 603 P.2d 1].)\n\nWe conclude the evidence did not require the giving of the requested instructions on intoxication. Although the offenses were committed after defendant had gone virtually without sleep for approximately 24 hours, and after he had drunk an unspecified number of alcoholic drinks over a period of some hours, evidence of the effect of defendant's alcohol consumption on his state of mind is lacking. One arresting officer testified that in his opinion defendant was sober when taken into custody. Although another officer testified defendant seemed \"dazed,\" this falls short of a reasonable basis for concluding defendant's capacity to entertain the mental state required for murder was diminished. Defendant's blood-alcohol content, tested about three hours after the shootings, suggested some impairment, as might have rendered him an unsafe driver, but the record does not support a Conclusion that at the time of the offenses defendant was unable to premeditate or form an intent to kill. Accordingly, because no reasonable jury would have so found, the trial court did not err in refusing the requested instruction. (See People v. Avena (1996) 13 Cal. 4th 394, 414-416 [53 Cal. Rptr. 2d 301, 916 P.2d 1000].)\n\nDefendant also argues the trial court erred in refusing his request for an instruction on manslaughter based on sudden quarrel or heat of passion. Defendant cites no substantial evidence in the record supporting such a request, but instead argues the absence of persuasive evidence as to motive should have compelled the giving of the instruction.\n\nThe trial court did not err in refusing the heat of passion instruction. Annette May's testimony that Cynthia Marshall said, \"Why, George?\" or \"George, why?\" shortly before shots were fired simply fails to support an inference defendant and his wife suddenly quarreled. Alvin Green's testimony, that at some point before the crimes defendant was concerned Cynthia was planning to leave him, fails to demonstrate defendant was under the heat of passion at the time of the offense. Even if defendant's statement to Green could be said to reflect heat of passion, a point we need not decide, the interval between defendant's statement to Green and the crimes clearly would have permitted defendant to cool down. We are directed to no authority that the existence of marital problems, without more, warrants a heat of passion instruction. Absent from this case is any evidence even remotely similar to the provocative conduct by the victim in People v. Berry (1976) 18 Cal. 3d 509, 513-514 [134 Cal. Rptr. 415, 556 P.2d 777], where we held it error not to give a heat of passion instruction. In that case, the victim wife had engaged in a two-week pattern of sexually arousing the defendant husband and taunting him into jealous rages over her love for another man, conduct we concluded would stir such a passion of jealousy, pain and sexual rage in an ordinary man of average Disposition as to cause him to act rashly from this passion. ( Id. at p. 515.) In contrast, here the relations between defendant and his wife, according to his own testimony, were generally smooth and harmonious.\n\nK. Failure to Instruct With CALJIC No. 2.02 .\n\nDefendant contends the trial court erred in failing to instruct the jury, sua sponte, in the language of CALJIC No. 2.02, pertaining to the sufficiency of circumstantial evidence to prove the requisite mental state for premeditated and deliberate murder. As defendant acknowledges, however, the trial court instructed the jury with CALJIC No. 2.01, the more inclusive instruction on sufficiency of circumstantial evidence. Use of CALJIC No. 2.01, rather than 2.02, is proper unless the only element of the offense that rests substantially or entirely on circumstantial evidence is that of specific intent or mental state. ( People v. Bloyd (1987) 43 Cal. 3d 333, 352 [233 Cal. Rptr. 368, 729 P.2d 802].) Here, mental state was not the only element of the case resting on circumstantial evidence; consequently, the trial court did not err in reading the more inclusive instruction. ( People v. Rodrigues (1994) 8 Cal. 4th 1060, 1142 [36 Cal. Rptr. 2d 235, 885 P.2d 1].)\n\nII. Failure to Instruct and Obtain Jury Finding on Special Circumstance Allegation\n\nDefendant contends the multiple-murder special-circumstance finding, and thus the death judgment, must be reversed because the trial court refused, contrary to section 190.4, to submit the special circumstance allegation for a finding by the jury. Although the trial court erred, reversal is unwarranted.\n\nThe issue arose in the following context: During Discussions as to what instructions the jury should receive to assist its guilt phase deliberations, the prosecution requested the trial court read CALJIC Nos. 8.80 and 8.81.3 to the jury. Those instructions were designed to inform the jury that (1) if it concluded defendant was guilty of first degree murder, it must then determine the truth of the special circumstance allegations; and (2) to find true the special circumstance allegation of multiple murder, it must find the defendant was convicted in this case of more than one offense of murder in the first or second degree. These instructions were drawn from section 190.2, subdivision (a)(3), which as relevant at the time of trial provided as follows: \"(a) The penalty for a defendant found guilty of murder in the first degree shall be death or confinement in state prison for a term of life without the possibility of parole in any case in which one or more of the following special circumstances has been charged and specially found under Section 190.4, to be true: . . . (3) The defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\"\n\nSection 190.4 provides in relevant part as follows: \"(a) Whenever special circumstances as enumerated in Section 190.2 are alleged and the trier of fact finds the defendant guilty of first degree murder, the trier of fact shall also make a special finding on the truth of each alleged special circumstance. The determination of the truth of any or all of the special circumstances shall be made by the trier of fact on the evidence presented at the trial . . . .\" (§ 190.4, subd. (a).) That statute also provides the trier of fact shall be a jury, unless a jury is waived by the defendant and the prosecution. (§ 190.4, subd. (a).)\n\nIn denying the requested instructions, the trial court explained its reasoning: \"My thought in this particular instance is I don't have to give instructions at all on special circumstances. The jury does not, in the sense, the jury does not have to make a special finding that the defendant committed murder with special circumstances. If they convict the defendant of two first degree murders, or two counts of murder, at least one of which is murder of the first degree, they're persuaded of those beyond a reasonable doubt, then, the special circumstances have been established without any additional or further finding.\" Evidently the trial court feared the special circumstance instructions would confuse the jury.\n\nSection 190.4 plainly contemplates a jury finding on a multiple-murder special-circumstance allegation unless the parties waive a jury. The trial court therefore erred in failing to submit the issue to the jury, and its error implicates the federal due process right. (See Hicks v. Oklahoma (1980) 447 U.S. 343, 346 [65 L. Ed. 2d 175, 180, 100 S. Ct. 2227] [arbitrary denial of a state-created right as denial of due process]; People v. Moreno (1991) 228 Cal. App. 3d 564, 573 [279 Cal. Rptr. 140]; People v. Gastile (1988) 205 Cal. App. 3d 1376, 1382 [253 Cal. Rptr. 283], disapproved on other grounds in People v. Wrest (1992) 3 Cal. 4th 1088, 1104 [13 Cal. Rptr. 2d 511, 839 P.2d 1020].) \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nDefendant argues the error constituted a \"structural defect\" in the trial requiring reversal without consideration of prejudice. ( Arizona v. Fulminante (1991) 499 U.S. 279 [113 L. Ed. 2d 302, 111 S. Ct. 1246]; Sullivan v. Louisiana (1993) 508 U.S. 275 [124 L. Ed. 2d 182, 113 S. Ct. 2078].) A structural defect is the type of error \"affecting the framework within which the trial proceeds, rather than simply an error in the trial process itself,\" one that \" 'transcends the criminal process' \" and \"def[ies] analysis by 'harmless-error' standards.\" ( Arizona v. Fulminante, (supra) , 499 U.S. at pp. 309-311 [113 L. Ed. 2d at pp. 330-332].) Examples of structural defects include total deprivation of the right to counsel at trial ( Gideon v. Wainwright (1963) 372 U.S. 335 [9 L. Ed. 2d 799, 83 S. Ct. 792, 93 A.L.R.2d 733]); trial before a Judge who is not impartial ( Tumey v. Ohio (1927) 273 U.S. 510 [71 L. Ed. 749, 47 S. Ct. 437, 50 A.L.R. 1243]); and the giving of a constitutionally defective instruction on reasonable doubt ( Sullivan v. Louisiana, (supra) , 508 U.S. at pp. 281-282 [124 L. Ed. 2d at pp. 190-191, 113 S. Ct. 2078]). Trial errors, by contrast, are errors that \"occurred during the presentation of the case to the jury, and which may therefore be quantitatively assessed in the context of other evidence presented\" in order to determine whether the error was harmless. ( Arizona v. Fulminante, (supra) , 499 U.S. at pp. 307-308 [113 L. Ed. 2d at pp. 329-330].) There is a strong presumption any error falls within the latter category, and it is the rare case in which a constitutional violation will not be subject to harmless error analysis. ( Sullivan v. Louisiana, (supra) , 508 U.S. at p. 282 [124 L. Ed. 2d at p. 191, 113 S. Ct. 2078] (conc. opn. of Rehnquist, C. J.).)\n\nWe are unpersuaded the trial court's failure to permit the jury to make a finding on the multiple-murder special-circumstance allegation constitutes a structural defect. The error was not so pervasive as to affect the framework within which the trial proceeded. Rather, it is susceptible to quantitative assessment because the record compels the Conclusion the error had no effect on the outcome of the trial and was thus harmless beyond a reasonable doubt. ( People v. Johnson, (supra) , 6 Cal. 4th at p. 45; Chapman v. California (1967) 386 U.S. 18, 24 [17 L. Ed. 2d 705, 710-711, 87 S. Ct. 824, 24 A.L.R.3d 1065].) The factual issue posed by the omitted instruction necessarily was resolved adversely to defendant under other properly given instructions. (See People v. Sedeno (1974) 10 Cal. 3d 703, 721 [112 Cal. Rptr. 1, 518 P.2d 913], disapproved on other grounds in People v. Flannel, (supra) , 25 Cal. 3d at p. 684, fn. 12.) That is to say, the jury's verdict of guilt on three counts of murder in the first degree necessarily established the factual predicate of the special circumstance, that defendant was convicted in this proceeding of more than one count of murder in the first or second degree. And, significantly, the same jury, having heard all the mitigating evidence the defense proffered during the penalty phase, chose the penalty of death rather than life without possibility of parole. We may therefore confidently say there is no possibility this jury would have found defendant not death-eligible had the special circumstance allegation been submitted to it.\n\nWe hasten to emphasize that, although undoubtedly harmless, removal of the multiple-murder special-circumstance allegation from the jury's consideration was error under the plain language of section 190.4. The multiple-murder special circumstance is perhaps unique among those enumerated in section 190.2, subdivision (a), in requiring the finding of no facts beyond the bare recognition the jury has returned a verdict of guilty of murder in the first degree and has convicted defendant of at least one additional count of murder in the same proceeding. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Other special circumstance allegations generally will not be encompassed by other jury findings, and, hence, the making of other special circumstance findings by the wrong entity will not necessarily be harmless beyond a reasonable doubt.\n\nIII. Penalty Phase\n\nA. Defense Counsel's Closing Argument.\n\n1. Bailiff's Snoring.\n\nWhile defense counsel was arguing at the close of the penalty phase, a bailiff fell asleep in the courtroom and snored audibly, resulting in his removal from the courtroom by another court employee. Counsel continued with his argument, evidently unaware of the distraction. When he later learned what had occurred, defense counsel moved to have his penalty phase argument reread to the jury.\n\nThe trial Judge acknowledged the jurors must have been aware of the disturbance, which, he noted, might have persisted for a minute (rather than three to four minutes, as defendant contended), but denied the motion. Defendant assigns this ruling as error.\n\nAs defendant reasons, the right to the assistance of counsel under the Sixth Amendment to the federal Constitution and its state counterpart encompasses the right to have counsel present closing argument at the penalty phase of a capital trial. ( People v. Bonin (1988) 46 Cal. 3d 659, 694 [250 Cal. Rptr. 687, 758 P.2d 1217].) But contrary to defendant's argument, that right was not impaired in this case. His counsel was not prevented from arguing, nor was the jury restrained from listening; at most the jury was distracted for a few moments. To conclude defendant's right to counsel was violated by the bailiff's snoring, or the trial court's refusal to permit rereading of defense counsel's closing argument, would be sheer speculation.\n\n2. Restriction on Scope of Defense Argument.\n\nBefore proceeding with his penalty phase argument to the jury, defense counsel sought an advance ruling regarding his intention to argue the factual elements involved in certain comparable cases in which other Stanislaus County juries had returned death verdicts. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Counsel wanted to persuade the jury that elements present in those other cases, such as the intentional cruelty of the homicide, or its particularly barbaric or torturous nature, were lacking in this case. Counsel contended the facts of those cases were well known in Stanislaus County.\n\nThe trial court concluded that while it would be improper for defense counsel to refer to what the juries in those cases did, counsel could permissibly comment on and compare the circumstances of the present case with those existing in the other cases. Defense counsel could make reference to aggravating factors present in other cases but absent from this. Thus, the court permitted defense counsel to refer to the fact this case was not a cold-blooded killing for hire, and that it did not involve rape or torture (unlike the Guzman and Easley cases, (supra) ). However, the court ruled defense counsel could not argue the facts of those cases in detail.\n\nDefendant contends the trial court erred in prohibiting defense counsel from describing the evidence in, and outcomes of, earlier Stanislaus County capital cases. The ruling, he contends, curtailed counsel's ability to argue the relevant nonstatutory mitigating factor of disproportionate sentencing.\n\nContrary to the argument of the Attorney General, this claim is not governed by the settled rule that our death penalty law does not encompass intercase proportionality review. (See, e.g., Pulley v. Harris (1984) 465 U.S. 37, 50-53 [79 L. Ed. 2d 29, 40-42, 104 S. Ct. 871]; People v. Fierro (1991) 1 Cal. 4th 173, 253 [3 Cal. Rptr. 2d 426, 821 P.2d 1302].) Defendant does not here specifically contend the jury should have been instructed to conduct intercase proportionality review, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e or that this court should do so; rather, he complains of improper limitation on the scope of trial counsel's closing argument, an aspect of the right to counsel. (See Herring v. New York (1975) 422 U.S. 853, 856-862 [45 L. Ed. 2d 593, 597-601, 95 S. Ct. 2550].)\n\nNevertheless, we find no error. The court's ruling fell within its discretion to control the scope of closing argument and did not preclude defendant from making his central point: that there have been murder cases involving more shocking, heinous, cruel or callous facts than those present here.\n\nA criminal defendant has a well-established constitutional right to have counsel present closing argument to the trier of fact. ( Herring v. New York, (supra) , 422 U.S. at pp. 856-862 [45 L. Ed. 2d at pp. 597-601, 95 S. Ct. 2550]; People v. Rodrigues, (supra) , 8 Cal. 4th at p. 1184.) This right is not unbounded, however; the trial court retains discretion to impose reasonable time limits and to ensure that argument does not stray unduly from the mark. ( Herring v. New York, (supra) , 422 U.S. at p. 862 [45 L. Ed. 2d at p. 600, 95 S. Ct. 2550.) We cannot say the trial court exceeded its discretion in implicitly determining that specific and detailed comparison of the facts of this case with those of other Stanislaus County capital trials would not have assisted the jury. Meaningful comparisons of this kind cannot be made solely on the basis of the circumstances of the crime, without consideration of the other aggravating and mitigating factors. Yet the trial court could properly conclude that to allow counsel to argue all such factors would consume too much time and draw the jury's focus away from the instant case. In any event, counsel was granted the latitude to argue, as he sought, that this case lacked the cruelty and callousness found in other murder cases. There was no abuse of discretion.\n\nB. Prosecutor's Comment on Defendant's Lack of Remorse.\n\nDefendant observes the prosecutor, in his closing argument, commented on defendant's failure to show remorse and other feelings during the proceedings. As we noted in People v. Crittenden (1994) 9 Cal. 4th 83 [36 Cal. Rptr. 2d 474, 885 P.2d 887], however, the presence or absence of remorse is a factor \" 'universally' deemed relevant to the jury's penalty determination.\" ( Id. at p. 146.) Defendant, moreover, neither objected nor sought an admonition to the jury to disregard the comment, and it could not in any event have materially lessened the reliability of the death judgment.\n\nC. Excessive Multiple-murder Special Circumstances.\n\nDefendant argues it was error to direct the jury to consider six multiple-murder special-circumstance findings (two for each of the three murders). He is correct: Only one multiple-murder special circumstance should be charged and considered by the jury in a given case. ( People v. Clark, (supra) , 3 Cal. 4th at pp. 167-168; People v. Rodriguez (1986) 42 Cal. 3d 730, 787 [230 Cal. Rptr. 667, 726 P.2d 113].) As we have repeatedly held, however, the jury's consideration of duplicative multiple-murder special circumstances is harmless where, as here, the jury knows the number of murders on which the special circumstances are based. ( People v. Clark, (supra) , 3 Cal. 4th at p. 168.) We shall set aside the excessive special circumstance findings.\n\nD. Deletion of Instructions on Certain Mitigating Factors.\n\nDefendant argues reversal is required under the rule of Penry v. Lynaugh (1989) 492 U.S. 302, 319-328 [106 L. Ed. 2d 256, 276-284, 109 S. Ct. 2934] (Penry), because the trial court deleted from the penalty phase instructions any reference to certain mitigating factors it considered inapplicable. Thus, the jury was not instructed it could consider the presence of an extreme emotional disturbance (§ 190.3, factor (d)), participation by the victim in the homicidal conduct (§ 190.3, factor (e)), the defendant's belief in a moral justification for his conduct (§ 190.3, factor (f)), the presence of extreme duress (§ 190.3, factor (g)), or the effects of alcohol or mental disease on the defendant's capacity to appreciate the criminality of his conduct (§ 190.3, factor (h)). Defendant does not argue he had a right to have the jury instructed on factors wholly unsupported by the evidence; we need consider, therefore, only whether he was improperly refused instruction on a factor on which evidence was introduced and, if so, the consequences of that denial. (See People v. Marshall (1990) 50 Cal. 3d 907, 932-933 [269 Cal. Rptr. 269, 790 P.2d 676] [trial court is not required to instruct sua sponte on factors not applicable on the record of the case].)\n\nThe evidence showed defendant had consumed an unspecified number of alcoholic beverages during the roughly 12 hours preceding his arrest, and his blood-alcohol level measured .10 percent some 3 hours after his arrest. As the trial court itself noted in denying the requested instruction on section 190.3, factor (h), \"There was some evidence at the guilt phase indicating that the defendant had been drinking and had a blood alcohol level that would be consistent with being under the influence for drunk driving cases.\" The trial court explained it would not instruct on factor (h) because \"[t]here was absolutely no evidence whatsoever to indicate that it impaired his capacity either to uphold any requisite intent or to conform his conduct to the requirements of the law, and there were given no diminished capacity instructions at that phase of the trial, and I don't feel that they are, that there is any sufficient evidence to justify such a finding in this phase of the trial.\"\n\nIn Penry, (supra) , 492 U.S. 302 [106 L. Ed. 2d 256, 109 S. Ct. 2934], evidence in the record showed that the defendant, who was convicted of murder and rape, was mildly mentally retarded. The high court concluded that while execution of a mentally retarded person is not per se unconstitutional, the defendant's sentence was infirm because state sentencing procedures were inadequate to assure the defendant's jury had considered all mitigating evidence. Although the jury had heard evidence of defendant's retardation, its sentence had been determined by its answers to three judicial inquiries, none of which concerned the defendant's mental capacity or personal history. In the absence of instructions directing the jury to consider and give effect to all of the evidence relating to the defendant's background and mental deficiencies, the high court remanded for resentencing to avoid the \" 'risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty.' [Citations.]\" (Penry, (supra) , 492 U.S. at p. 328 [ 106 L. Ed. 2d at p. 284, 109 S. Ct. 2934].)\n\nSection 190.3 states that \"[i]n determining the penalty the trier of fact shall take into account any of the following factors if relevant,\" and then proceeds to list the statutory aggravating and mitigating factors. The statute impliedly requires instruction on any factor applicable on the record of the case, and we have noted the better practice is for a court to instruct on all the statutory penalty factors. ( People v. Marshall, (supra) , 50 Cal. 3d at p. 932.) \"Such an instruction 'ensures that the jury is aware of the complete range of factors that the state considers relevant to the penalty determination. With that knowledge the jury is better able to place the individual defendant's conduct in perspective, and thus its exercise of discretion to select the appropriate penalty is further channeled and directed as required by the Eighth Amendment.' [Citation.]\" (Ibid.)\n\nFor a particular sentencing factor, such as section 190.3, factor (h), to apply on the record of the case, the evidence supporting it need not suffice to establish a complete defense to the crime; rather, there need be in the record only some evidence relevant to the factor. The jury would not be called upon to decide penalty, and thus consider sentencing factors, unless it had first returned a verdict of guilt on a murder charge. Applicability of the statutory sentencing factors accordingly cannot be tested by the same standard as that governing the trial court's obligation to instruct on affirmative defenses.\n\nHere, as noted, the record contained evidence, in the form of the blood-alcohol test results, showing defendant was legally intoxicated at the time of the crime. Defendant was entitled to have the jury consider that evidence and to have the exercise of its sentencing discretion informed by section 190.3, factor (h). The trial court erred in refusing so to instruct the jury.\n\nWe cannot, however, conclude the error was prejudicial. Although the trial court did not specifically instruct the jury to consider the evidence of defendant's intoxication in arriving at its penalty determination, it did instruct the jury that \"[i]n determining which penalty is to be imposed on the Defendant, you shall consider all the evidence which has been received during any part of the trial of this case as to any matter relevant to aggravation, mitigation and sentence, including, but not limited to, the Defendant's character, background, mental condition and physical condition.\" Pertinent to that instruction, trial counsel argued to the jury, \"I ask you to remember the Defendant's physical condition was that of one who had been on his feet in motion, in effect, pulling two shifts, for nearly 24 hours; that he had drunk, that he had not eaten. I don't pretend nor suggest to you that he was intoxicated, or that he was drunk, but that he had by legal definition, enough in him to be under the influence of alcohol.\" Nothing the prosecutor said in closing contradicted defense counsel's argument. Thus, unlike in Penry, the jury was not precluded from considering the evidence of defendant's consumption of alcohol prior to the offense if it found such evidence to be relevant.\n\nDefendant argues, similarly, that the trial court erred in refusing to instruct on section 190.3, factor (d), whether the offense was committed while the defendant was under the influence of extreme mental or emotional disturbance. As discussed above in connection with the failure to instruct on heat of passion as lessening the degree of the crime, however, the record simply contained no evidence (as distinct from the absence of evidence of motive) from which the jury could have found such emotional disturbance; consequently, while the better practice would have been to instruct on all sentencing factors, the failure to instruct on factor (d) was not error in this case. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nE. Claim of Brown Error.\n\nDefendant argues the instructions given the jury at the close of the penalty phase may have misled the jury to believe they were required to vote for death even if they determined death was not the appropriate penalty under the circumstances. The instruction told the jury it \"shall\" impose the death penalty if it found that aggravating factors outweighed mitigating. Defendant notes that in People v. Brown (1985) 40 Cal. 3d 512 [220 Cal. Rptr. 637, 709 P.2d 440] (revd. on other grounds sub nom. California v. Brown (1987) 479 U.S. 538 [93 L. Ed. 2d 934, 107 S. Ct. 837]), we cautioned that such an instruction is potentially confusing, because \"[t]he jury must be free to reject death if it decides on the basis of any constitutionally relevant evidence that it is not the appropriate penalty.\" (40 Cal. 3d at p. 540, fn. \u0026 italics omitted.) We declared thenceforth we would examine death sentences obtained through the use of such an instruction \"to determine whether, in context, the sentencer may have been misled to defendant's prejudice about the scope of its sentencing discretion under the 1978 law.\" ( Id. at p. 544, fn. 17.)\n\nDefendant does not clearly identify how the jury might have been misled. He complains of the prosecutor's argument, in response to defense counsel's suggestion imposition of the death penalty on defendant would have no deterrent value, that deterrence \"is not the question. [The question] is, do the circumstances in aggravation in this case outweigh those in mitigation. . . . hichever side of the scale balances, or weighs more heavily than the other, that is the way you decide the issue of penalty.\" The foregoing argument, defendant contends, urged a limited and mechanical view of the jury's function and suggested the jury members were to vote for death even if they concluded death was not the appropriate penalty under all the circumstances. Defendant's interpretation is unsound. The prosecutor did not argue for a mechanical counting of factors, but rather properly urged the jury to weigh the circumstances of the crime.\n\nDefendant argues further that the prosecutor's suggestion the jury should refrain from considering the deterrent, or nondeterrent, effect of the death penalty led the jury to entertain a limited, mechanical view of its function, in contravention of our decision in People v. Brown, (supra) , 40 Cal. 3d 512. The argument lacks merit. We have repeatedly held deterrence arguments rest on unproven assumptions and place a foreign weight on the scale on which should instead be made an individualized determination as to penalty. ( People v. Wrest, (supra) , 3 Cal. 4th 1088, 1106; People v. Bittaker (1989) 48 Cal. 3d 1046, 1105 [259 Cal. Rptr. 630, 774 P.2d 659]; People v. Thompson (1988) 45 Cal. 3d 86, 139 [246 Cal. Rptr. 245, 753 P.2d 37]; People v. Ketchel (1963) 59 Cal. 2d 503, 536-540 [30 Cal. Rptr. 538, 381 P.2d 394], disapproved on other grounds in People v. Morse (1964) 60 Cal. 2d 631, 649 [36 Cal. Rptr. 201, 388 P.2d 33, 12 A.L.R.3d 810].) This principle is equally true whether it is the prosecutor who seeks to argue the death penalty's deterrent value, or the defense its opposite. Questions of deterrence or cost in carrying out a capital sentence are for the Legislature, not for the jury considering a particular case. ( Spaziano v. Florida (1984) 468 U.S. 447, 461-462 [82 L. Ed. 2d 340, 353-354, 104 S. Ct. 3154]; People v. Thompson, (supra) , 45 Cal. 3d at p. 139.) No Brown error appears.\n\nF. Failure to Instruct on Sympathy and Other Nonstatutory Mitigating Factors.\n\nDefendant argues the trial court committed reversible error in failing to instruct the jury that it could consider sympathy for the defendant as a valid factor in mitigation. He contends this failure was compounded by the absence of an instruction to disregard the guilt phase instruction not to consider sympathy in reaching the verdict (CALJIC No. 1.00). We have rejected this contention in the past ( People v. Sanders (1990) 51 Cal. 3d 471, 528 [273 Cal. Rptr. 537, 797 P.2d 561]), and we see no persuasive reason to reconsider that determination.\n\nDefendant also contends the version of CALJIC No. 8.84.1 read to the jury inadequately informed it of its right to consider defendant's character, background, history, mental condition and physical condition in mitigation and, in combination with other asserted penalty phase errors, requires reversal.\n\nThe jury in this case was instructed in May 1983, before our decision in People v. Easley, (supra) , 34 Cal. 3d 858, required trial courts, under section 190.3, factor (k), to inform penalty juries they may consider as a mitigating factor \" 'any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime' \" and any other \" 'aspect of [the] defendant's character or record . . . that the defendant proffers as a basis for a sentence less than death.' \" ( People v. Easley, (supra) , 34 Cal. 3d at p. 878, fn. 10.) Here the prosecution requested the jury be instructed with what has become known as the \"unadorned\" factor (k) instruction, which would simply have directed the jury to consider \"any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for this crime.\" The defense requested a modification of CALJIC No. 8.84.1, including an elaboration of the unadorned factor (k) instruction. In large part the trial court agreed with the defense's proposed modifications, although as discussed above, it deleted certain sentencing factors it considered inapplicable. (See pt. III.D., ante.)\n\nThe trial court thus instructed the jury as follows: \"In determining which penalty is to be imposed on the Defendant, you shall consider all of the evidence which has been received during any part of the trial of this case, as to any matter relevant to aggravation, mitigation and sentence, including but not limited to the Defendant's character, background, history, mental condition and physical condition. You shall consider, take into account and be guided by the following factors, if applicable: The circumstances of the crime of which the Defendant was convicted in the present proceeding and the existence of any special circumstances found to be true. The age of the Defendant at the time of the crime. Any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime. The presence or absence of criminal activity by the Defendant which involved the use or attempted use of force or violence or the express or implied threat to use force or violence. The presence or absence of any prior felony conviction.\"\n\nDuring the course of its deliberations the jury requested a rereading of the instructions on the factors it was to consider; the trial court obliged. Immediately after the jury resumed its deliberations, defense counsel speculated the jury might be having difficulty following the instruction. Defense counsel belatedly objected to the instruction and requested it be redrafted to place the reference to defendant's character, history, background, and mental and physical condition among the other listed sentencing factors. The trial court declined to do so, although it stated it would entertain another instruction in the event the jury indicated further difficulty.\n\nArguing his trial counsel correctly identified a flaw in the instructions, defendant contends the trial court should have reinstructed the jury. As a result of the court's failure to do so, he claims the instructions inadequately informed the jury of its right to consider nonstatutory mitigating factors, because the reference to defendant's character, background, history, and mental and physical condition preceded rather than followed the phrase: \"You shall consider, take into account and be guided by the following factors, if applicable . . . .\"\n\nIn our view, there is no reasonable likelihood the jury would have understood the instruction to preclude it from considering in mitigation the evidence of defendant's character, background, history and condition. ( Boyde v. California (1990) 494 U.S. 370, 382 [108 L. Ed. 2d 316, 330, 110 S. Ct. 1190].) The instruction first told the jury it \"shall consider\" such evidence in arriving at its sentencing determination. It then told the jury it \"shall consider\" certain statutory factors if it found them applicable. In the face of this mandatory language, that the jury would have believed itself precluded from considering any relevant evidence is not reasonably likely. Our Conclusion on this point is not altered by the other nonprejudicial flaws we have identified in the penalty phase argument and instructions in this case. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nG. Trial Court's Failure to Voir Dire Jurors Regarding Newspaper Article.\n\nDefendant argues the trial court committed reversible error when it failed to question jurors individually regarding whether they had read a newspaper article about the case that was published shortly after rendition of the guilt phase verdict and before the commencement of the penalty phase. The circumstances were as follows: On May 17, 1983, defense counsel called the trial court's attention to two articles published in the Modesto Bee on May 14 and May 16, respectively. The first, a front page article discussing the guilt phase verdicts, quoted the prosecutor as saying that \"several new witnesses came forward after Marshall was not convicted at the first trial. Among them was convicted robber Gary Lee \"Rabbit\" Brady, whom [the prosecutor] credited with persuading the jury of Marshall's guilt.\" The article then quoted the prosecutor as listing various factors, including Brady, that enhanced the prosecution's case at the second trial: the waterbed frame and the testimony of David Moore and other witnesses as to the white suit.\n\nThe second article, published two days later, read as follows: \"A story in Saturday's edition of the Bee incorrectly quotes Stanislaus County Deputy District Attorney Roger Beauchesne as saying convicted robber Gary Lee \"Rabbit\" Brady persuaded a jury that George Edward Marshall was guilty of three counts of first degree murder and one of attempted murder.\"\n\nDefense counsel moved for discharge of the jury and impanelment of a new jury for the penalty phase, citing prosecutorial misconduct in connection with the stories. In reply, the prosecutor admitted that after the return of the guilty verdicts he had spoken with a Modesto Bee reporter, to whom he had listed the evidence presented in the second trial but not the first. The prosecutor denied, however, expressing any opinion as to the basis for the jury's verdict. He described his efforts to get the newspaper to publish a retraction, which resulted in the publication of the second article.\n\nThe trial court denied the defense motion to discharge the jury, stating he intended to ask the jurors whether they had read the article and to tell them, if they had, that he had \"made inquiry into the situation.\" The defense continued to press for specific inquiry into possible prejudice.\n\nWhen the penalty phase was about to resume, the trial court said to the jury: \"I don't know whether any of you read the newspaper on Saturday and the article that was in there--it was on the front page--concerning this case. But that is illustrative of the proposition that sometimes the most interesting fiction we read, we read in the newspaper. Mr. Dunford [defense counsel]--Mr. Beauchesne [the prosecutor]--particularly was upset at the remarks attributed to him, particularly to the extent that they implied or said that he had presumed to comment to a reporter as to why the jury had reached their verdicts that the jury had reached, because Mr. Beauchesne had made no such statement. The newspaper did carry a small, kind of weasel-worded retraction on Monday. I don't know whether any of you read that or not, but I have made inquiry into it, and I am satisfied, I am sure that Mr. Dunford is satisfied, we are all satisfied, that Mr. Beauchesne in no way presumed to express your state of mind, or anything concerning it, to a Bee reporter. And I wanted you to understand that so that there would be, you would not be upset with him or with any of us, because I am sure that nobody connected with this proceeding, or with the courts here, has made any comment of that kind to anyone, particularly to anybody in the media. So I hope that you weren't distressed about it; or, if you were, that you will set it aside for now so that we can get on with the business at hand.\"\n\nDefendant argues, first, that the prosecutor's statements to the reporter constituted prejudicial misconduct, and second, that the trial court's failure to conduct individual voir dire of the jurors amounted to reversible error. We consider his arguments in turn.\n\nDefendant contends the prosecutor's comments to the reporter violated the then applicable rule of professional conduct, American Bar Association Model Code of Professional Responsibility, Disciplinary Rule 7-107(E), which provides as follows: \"After the completion of a trial or Disposition without trial of a criminal matter and prior to the imposition of a sentence, a lawyer or law firm associated with the prosecution or defense shall not make or participate in making an extrajudicial statement that a reasonable person would expect to be disseminated by public communication and that is reasonably likely to affect the imposition of sentence.\" \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e This breach of ethics, defendant argues, prejudiced him, because the prosecutor's remarks could have erased any lingering doubt about defendant's guilt the jury might still have harbored. Defendant reasons that by implying his conviction resulted from the \"new\" evidence introduced by the prosecution during the second trial, the first Bee article lent this additional evidence a credibility the jury had not necessarily given it during their guilt phase deliberations. Defendant also contends the article reinforced in the jurors' minds the evidence against him at the critical point when they were to decide whether he lived or died.\n\nWe must reject at the outset the contention the prosecutor acted unethically in saying what he did to the reporter. The prosecutor described on the record his conversation with the reporter, and his description was accepted as truthful by both the trial court and defense counsel. During the conversation, the prosecutor merely listed the evidence that was presented for the first time during defendant's second trial, information that was a matter of public record. The information he conveyed to the reporter was not of a sort reasonably likely to affect imposition of sentence. (ABA Model Code Prof. Responsibility, DR 7-107(E).) The prosecutor was not required, on pain of a misconduct citation, to anticipate the reporter's inaccuracy.\n\nNext we reject the contention the trial court committed reversible error in failing to voir dire the jurors on whether they had read the offending article. Nothing in the record, other than defense counsel's supposition, indicates any juror indeed had read the article. At the outset of trial, the court admonished prospective jurors to avoid reading any articles about the trial, and in the absence of evidence to the contrary we must presume they followed the court's admonition. ( People v. Adcox (1988) 47 Cal. 3d 207, 252-253 [253 Cal. Rptr. 55, 763 P.2d 906].) As defendant points out, for a juror to read newspaper articles about the case he or she is deciding is misconduct, raising a presumption of prejudice ( People v. Holloway (1990) 50 Cal. 3d 1098, 1108 [269 Cal. Rptr. 530, 790 P.2d 1327], disapproved on another point in People v. Stansbury (1995) 9 Cal. 4th 824, 830, fn. 1 [38 Cal. Rptr. 2d 394, 889 P.2d 588]) and triggering a duty of the trial court to make appropriate inquiry. (See People v. Gates (1987) 43 Cal. 3d 1168, 1199 [240 Cal. Rptr. 666, 743 P.2d 301].) Given the lack of the required threshold showing in this case, however, we do not presume prejudice, and the trial court was put on no duty of inquiry.\n\nEven if we were to accept as true the supposition one or more jurors read the first Bee article, we would find the article's innocuous substance rebutted the presumption of prejudice. ( People v. Holloway, (supra) , 50 Cal. 3d at pp. 1108, 1110.) First, the enumeration of the new evidence presented in the second trial largely repeated what defense counsel himself told the jury during his closing argument in the guilt phase. (See People v. Martinez (1978) 82 Cal. App. 3d 1, 23-25 [147 Cal. Rptr. 208] [jury considered maps that duplicated evidence already before the jury; presumption of prejudice rebutted].) Second, the article's false statement that the prosecutor credited the new information with persuading the jury of defendant's guilt simply was not matter of a kind that could have influenced the jury adversely to defendant, as by eliminating any lingering doubt as to his guilt. Like the trial court, we surmise the article, rather than prejudicing defendant, might have caused the jury to become annoyed at the prosecutor for presuming to articulate the basis of the guilt verdict. Because of the harmless nature of the articles, and the consequent rebuttal of any possibility of prejudice, there was no error in the trial court's failure to question the jurors individually concerning whether they had seen the article.\n\nH. Automatic Motion to Modify Verdict.\n\nDefendant argues his sentence must be reversed because the trial court, in ruling on his automatic motion to modify the verdict (§ 190.4, subd. (e)), improperly considered nonstatutory aggravating evidence. In its statement of reasons for upholding the death verdict, the court observed, \"Defendant has steadfastly maintained his innocence in the face of what I deem to be overwhelming evidence of his guilt and has demonstrated no remorse whatsoever.\" Consideration of his lack of remorse was, defendant contends, error. We have in the past rejected a similar claim ( People v. Caro (1988) 46 Cal. 3d 1035, 1067-1068 [251 Cal. Rptr. 757, 761 P.2d 680]), and we see no reason to depart from that Conclusion.\n\nDefendant further argues the trial court must have refused to consider factors of intoxication and emotional distress, and must have viewed defendant as convicted of all six alleged special circumstances. The argument, however, is unsupported by citation to the record, and fails as mere speculation.\n\nI. Sentence as Arbitrary, Discriminatory and Disproportionate.\n\nDefendant asserts the death sentence imposed on him is unconstitutionally arbitrary, discriminatory and disproportionate, considering the facts of the case and his personal characteristics, and requests that we review his sentence for intercase and intracase proportionality. He reasons that article I, section 17 of the California Constitution requires judicial review and reduction of any disproportionate sentences. ( People v. Dillon (1983) 34 Cal. 3d 441 [194 Cal. Rptr. 390, 668 P.2d 697] (Dillon).) Moreover, he argues, this court has conducted the equivalent of comparative sentence review in the course of adjudicating noncapital claims of cruel or unusual punishment. ( In re Rodriguez (1975) 14 Cal. 3d 639 [122 Cal. Rptr. 552, 537 P.2d 384]; People v. Wingo (1975) 14 Cal. 3d 169 [121 Cal. Rptr. 97, 534 P.2d 1001].)\n\nWe have previously rejected the contention that California's capital sentencing law fails to ensure that arbitrary, discriminatory and disproportionate death sentences are not imposed. ( People v. Crittenden, (supra) , 9 Cal. 4th at pp. 156-157.) To the extent defendant contends his sentence must be reduced under the reasoning of Dillon, (supra) , we find no disproportionality on this record and therefore reject the contention. To the extent defendant may be understood to suggest we are obliged to conduct intercase proportionality review, he is in error. ( Pulley v. Harris , (supra) , 465 U.S. at pp. 50-51 [79 L. Ed. 2d at pp. 40-41, 104 S. Ct. 871]; People v. Stanley (1995) 10 Cal. 4th 764, 842 [42 Cal. Rptr. 2d 543, 897 P.2d 481].)\n\nDefendant contends further that \"[c]omparative sentence review is essential to prevent arbitrary and discriminatory death sentences, as demonstrated by the results of capital sentence review in other states.\" Defendant sets forth neither supporting argument nor illustrations of such review; we therefore cannot and need not address his assertion.\n\nFinally, defendant argues principles of equal protection require that capital defendants receive comparative sentence review equivalent to that provided for determinately sentenced felons pursuant to section 1170, subdivision (f). We have previously rejected this claim ( People v. Diaz (1992) 3 Cal. 4th 495, 576 [11 Cal. Rptr. 2d 353, 834 P.2d 1171]), and see no reason to reconsider our Conclusion.\n\nJ. Cumulative Error.\n\nDefendant contends the cumulative effect of penalty phase error requires reversal of the judgment of death. We disagree. The only errors we have found in the penalty phase are the submission of excessive multiple-murder special-circumstance findings to the jury and the failure to instruct on section 190.3, factor (h). Because of the lack of resultant prejudice, as discussed above, neither individually nor cumulatively do these errors require reversal.\n\nDisposition\n\nAll but one of the multiple-murder special-circumstance findings are set aside. In all other respects, the judgment is affirmed.\n\nGeorge, C. J., Baxter, J., Chin, J., and Brown, J., concurred.\n\nKENNARD, J.,\n\nConcurring and Dissenting.--I join the majority in affirming defendant's convictions on three counts of first degree murder and one count of attempted murder. I would, however, reverse the judgment of death.\n\nI disagree with the majority's resolution of two issues that arose during the guilt phase of defendant's capital trial. The first issue involves the trial court's denial of defendant's midtrial motion for discovery of certain prison records that defendant claimed he needed to cross-examine a prosecution witness on the latter's mental competence and ability to testify truthfully. The majority considers the trial court's denial of the discovery motion to be harmless error. In my view, there was no error.\n\nThe second issue pertains to the trial court's decision not to have the jury consider the truth or falsity of the special circumstance allegation that, as phrased in the statutory language, \"defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" (Pen. Code, § 190.2, subd. (a)(3).) The trial court made that decision when it submitted the issue of guilt or innocence on the criminal charges to the jury towards the end of the guilt phase of defendant's capital trial. The court reasoned that if the jury were to return guilty verdicts on at least one count of first degree murder and one additional count of murder in the first or second degree, the jury would have made all of the factual findings necessary to find the existence of the multiple-murder special circumstance. Consequently, in the court's view, it would be superfluous to require the jury to make a specific finding on the multiple-murder special-circumstance allegation. When, following deliberations, the jury returned a verdict of guilt on three counts of first degree murder, the case proceeded to the penalty phase of the trial for a determination by the jury whether defendant should be sentenced to death or to life imprisonment without parole.\n\nUnder California law, a defendant in a capital case becomes eligible for the death penalty only after a finding by the jury that at least one special circumstance allegation is true. Such a finding is therefore a critical component of our capital scheme. Here, the trial court's ruling, which violated the express statutory requirement that the jury \"make a special finding on the truth of each alleged special circumstance\" (Pen. Code, § 190.4, subd. (a)), denied defendant his constitutional right to a jury determination on that issue. Recently, in United States v. Gaudin (1995) 515 U.S. 506 [132 L. Ed. 2d 444, 115 S. Ct. 2310] and in Sullivan v. Louisiana (1993) 508 U.S. 275 [124 L. Ed. 2d 182, 113 S. Ct. 2078], the United States Supreme Court stressed that the right to a trial by jury, as guaranteed by the Sixth Amendment to the federal Constitution, encompasses more than having a jury determine the factual components necessary to a verdict; the right to jury trial, at base, is the right to have a jury determine the ultimate question of guilt or innocence. Here, the ultimate question was whether defendant was guilty or innocent of capital murder, that is, murder that would render him eligible for the death penalty. Because the trial court removed that determination of ultimate guilt from the jury's consideration when it prevented the jury from making a specific finding on the truth or falsity of the special circumstance allegation, defendant was deprived of his Sixth Amendment right to a jury trial on that issue.\n\nI\n\nDefendant was charged with fatally shooting three people: his wife (Cynthia Marshall), his wife's 13-year-old brother (Jeffrey Lee), and a boarder (Henry Thomas). He was also accused of attempting to murder Annette May, who was sleeping in Thomas's bed when she was shot.\n\nProsecution witness Gary Brady testified that while he and defendant were confined in the Stanislaus County jail, defendant admitted he had shot his wife, a \"small kid\", and \"a lady and a guy in the bedroom\" with \"a high-powered rifle.\" Defendant said that he had killed his wife because he \"would rather see his wife dead than her leave him,\" and that he had shot the boy for witnessing the killing. Defendant added that after the shootings he wiped off the gun and left it on the floor; he then took money from the kitchen table to make it look as if the killings were committed in the course of a robbery.\n\nBefore defense counsel's cross-examination of Brady, the parties engaged in a lengthy debate regarding the extent to which defendant could question Brady about his involvement in another capital case. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The following colloquy then took place:\n\n\"Mr. Dunford [defense counsel]: Yes, I haven't mentioned this to [the prosecutor], . . . but there is some indication Mr. Brady, as a result of a [Penal Code section] 1368 hearing [to determine a defendant's competence to stand trial], was committed to Patton State Hospital and may be impeachable on the ground of his mental competence, and I believe that to be discoverable. What I wish to have, because I just interviewed him yesterday an hour before he went on the stand, what I wish to have is the Department of Corrections jacket. In order to effectively cross-examine him. I make that motion that that be made available.\n\n\"THE COURT: Well, I am going to deny that particular motion. He was committed to Patton State Hospital out of this County and escaped, as you probably well know, and all of this occurred substantially before the incident in the jail that we are talking about here. He was apprehended back in, I think, Arkansas after he was wounded on that occasion. I don't know, I don't believe that he has been committed to Patton State Hospital since then. I would be very surprised if he had been committed to Patton State Hospital because of the security risk that he demonstrated he possessed. It was rather unusual that he got there in the first place.\"\n\nAfter the prosecutor made a comment about the admissibility of Brady's prior convictions, defense counsel returned to the subject of discovery:\n\n\" Mr. Dunford: . . . I believe that there may be in the Department of Corrections jacket psychiatric evaluations and other testimony casting a light on the mental capacity of this witness to tell the truth.\n\n\"THE COURT: Well, under the circumstances, as far as I am aware, that would be privileged material, but unless you can furnish me some authority and an order requiring the Department of Corrections to come up with that, I am not going to consider that particular motion. All right.\n\n\"Mr. Dunford: Well, so that the record is complete, I am sure the Court considered it and denied it.\n\n\"THE COURT: Well, I have denied it because I am unaware of any authority, number one, for my making an order like that to the Department of Corrections, and until I am satisfied that that prison jacket is not confidential, which I believe it to be, and that it can be the subject of an appropriate order for production, I would not even tentatively consider making the order.\n\n\"Mr. Dunford: Thank you, Your Honor.\n\n\"THE COURT: Once the order is made, if it were made, upon a showing of that kind, then, of course, of necessity, it would have to be, I suppose, an in camera review of that matter by the Court to determine what matters should be privileged, what matters might be relevant and what would not be, but I don't think we have to reach that at the moment.\n\n\"Mr. Dunford: The thing I need to know, Your Honor, is whether that motion has been denied with prejudice or whether or not it might be renewed when I have a more persuasive position to support by authorities.\n\n\"THE COURT: It is denied without prejudice.\n\n\"Mr. Dunford: Thank you, Your Honor.\" (Italics added.)\n\nIn Hill v. Superior Court (1974) 10 Cal. 3d 812, 816-817 [112 Cal. Rptr. 257, 518 P.2d 1353, 95 A.L.R.3d 820], this court summarized the rules governing discovery in a criminal case as follows:\n\n\"A motion for discovery by an accused is addressed to the sound discretion of the trial court, which has the inherent power to order discovery in the interests of Justice. [Citations.]\n\n\"It has been stated that the basis for granting pretrial discovery to a defendant is the fundamental principle that an accused is entitled to a fair trial [citations], and 'Absent some governmental requirement that the information be kept confidential for the purposes of effective law enforcement, the state has no interest in denying the accused access to all evidence that can throw light on the issues in the case, and in particular it has no interest in convicting on the testimony of witnesses who have not been as rigorously cross-examined and as thoroughly impeached as the evidence permits.' [Citations.]\n\n\"An accused, however, is not entitled to inspect material as a matter of right without regard to the adverse effects of disclosure and without a prior showing of good cause. 'In criminal cases, the trial court retains wide discretion to protect against the disclosure of information which might unduly hamper the prosecution or violate some other legitimate governmental interest. [Citations.] Additionally, the court has discretion to deny discovery in the absence of a showing which specifies the material sought and furnishes a \"plausible justification\" for inspection.' [Citations.] ' \"A showing, however, that the defendant cannot readily obtain the information through his own efforts will ordinarily entitle him to pretrial knowledge of any unprivileged evidence, or information that might lead to the discovery of evidence, if it appears reasonable that such knowledge will assist him in preparing his defense . . . .\" [Citations.]' \" (Fn. \u0026 italics omitted; accord, People v. Clark (1992) 3 Cal. 4th 41, 133 [10 Cal. Rptr. 2d 554, 833 P.2d 561]; People v. McPeters (1992) 2 Cal. 4th 1148, 1171 [9 Cal. Rptr. 2d 834, 832 P.2d 146].)\n\nIn exercising its discretion, the trial court may consider the timeliness of the discovery motion. As pointed out in Hill v. Superior Court, (supra) , 10 Cal. 3d at page 821: \"Although in general motions for discovery may be made either at or before trial [citations], a motion for discovery of felony conviction records . . ., if made at trial, in many cases might delay the trial if the motion were granted. Such a motion ordinarily should be made at a time when it would not have that effect.\" (See also City of Alhambra v. Superior Court (1988) 205 Cal. App. 3d 1118, 1134 [252 Cal. Rptr. 789].)\n\nApplying the standards this court set forth in Hill v. Superior Court, (supra) , 10 Cal. 3d 812, 816-817, I would hold that the trial court in this case did not abuse its discretion in denying, without prejudice, defendant's motion for discovery of certain records held by the Department of Corrections that defendant asserted he needed in cross-examining prosecution witness Brady on his mental competence and his ability to testify truthfully.\n\nFirst, the motion was untimely. Defendant made the motion in the midst of trial, following testimony by Brady describing a conversation with defendant that had occurred two years earlier. There is nothing in the record before this court to suggest that the prosecutor had not furnished defendant with reports disclosing Brady's proposed testimony before the trial commenced or that Brady was in any way a surprise witness. Thus, there appears to be no excuse for defendant's failure to move for discovery of Brady's prison records before trial. Accordingly, the trial court acted well within its discretion in denying, without prejudice, defendant's midtrial motion for discovery.\n\nSecond, compliance with defendant's request for discovery of Brady's prison records could have resulted in substantial trial delay. (See Hill v. Superior Court, (supra) , 10 Cal. 3d at p. 821.) The records were not in the possession of the county prosecutor or local law enforcement agencies, but in the possession of the Department of Corrections, the agency that operates the state prison system. Likely, it would have taken that agency at least a few days to locate Brady's prison records and to bring them from wherever they were being stored to Stanislaus County, where the trial in this case was held. Moreover, once the Department of Corrections' custodian of records had produced the records in court, privilege no doubt would have been asserted, if not by the Department of Corrections or the prosecutor, then by Brady himself. (See Evid. Code, § 1040 [privilege for information acquired in confidence], 1014 [psychotherapist-patient privilege].) As the trial court noted in ruling on defendant's discovery motion, assertion of privilege would have required the court to hold a hearing to determine the existence of any material in Brady's prison records that would be discoverable by the defense. (See generally, Pennsylvania v. Ritchie (1987) 480 U.S. 39 [94 L. Ed. 2d 40, 107 S. Ct. 989] [defendant's right to fair trial is protected by submitting confidential information to in camera review by trial court]; People v. Boyette (1988) 201 Cal. App. 3d 1527, 1532 [247 Cal. Rptr. 795]; People v. Reber (1986) 177 Cal. App. 3d 523 [223 Cal. Rptr. 139]; see also People v. Webb (1993) 6 Cal. 4th 494, 537-538 [24 Cal. Rptr. 2d 779, 862 P.2d 779] (conc. and dis. opn. of Kennard, J.).) \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThird, not only was defendant's discovery request untimely and likely to result in substantial delay of the trial proceedings, but the motion was also made in a manner suggesting that the defense did not attach much importance to obtaining the records in question. The motion was made orally in the midst of trial, it was unaccompanied by any declaration of defense counsel explaining his intended use of the records, and the motion was not supported by any legal authority whatsoever. Thus, defendant's showing of \"plausible justification\" (see Hill v. Superior Court, (supra) , 10 Cal. 3d at p. 817) was minimal at best.\n\nGiven defendant's failure to make a compelling showing of need for prosecution witness Brady's prison records, the trial court was understandably reluctant to grant defendant's motion for discovery of those records. The court did not, however, foreclose the possibility of discovery. The court invited defendant to furnish legal authority supporting his motion for discovery of Brady's prison records. Defendant chose not to do so, however. Under the totality of circumstances, the trial court did not abuse its discretion when it denied, without prejudice, defendant's motion for discovery. ( People v. Ashmus (1991) 54 Cal. 3d 932, 978 [2 Cal. Rptr. 2d 112, 820 P.2d 214].)\n\nIn resolving the discovery issue, the majority uses an analysis with which I disagree. The majority never explicitly addresses whether the trial court abused its discretion when it denied defendant's motion for discovery. The majority holds, however, that there is \"no reasonable probability the outcome of [defendant's] case would have been different\" if the discovery motion had been granted. (Maj. opn., ante, at p. 842.) The majority bases this Conclusion on these assertions: (1) Defendant \"extensively impeached\" Brady with \"evidence of his prior criminal history, his involvement in other crimes, and the inducements for his testimony\"; (2) the psychiatric records of witness Brady would have been minimally relevant because his commitment to Patton State Hospital occurred in 1977, four years before defendant confessed the murder to him and six years before defendant's trial; and (3) the jury in this case \"heard Brady's version of his diagnosis and its significance,\" which raised questions about Brady's mental stability. (Ibid.) Although I conclude that there was no error, I am not persuaded by the majority's reasons that any error was harmless. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe majority points to defendant's \"extensive impeachment\" of prosecution witness Brady with Brady's lengthy criminal record and with the promise of leniency he received in exchange for his testimony (Brady was to receive no more than a two-year sentence on a pending robbery charge). But this impeachment, which the prosecutor no doubt anticipated when he decided to use Brady as a prosecution witness, did not destroy Brady's credibility so completely that no reasonable juror would have believed his testimony. Because Brady's credibility remained an important issue, further impeachment may well have affected the outcome.\n\nNor do I agree with the majority that simply because Brady's commitment to Patton State Hospital predated defendant's trial by six years, Brady's psychiatric records necessarily would have been only minimally relevant to his testimony at defendant's trial. For example, if the psychiatric records would have revealed a tendency by Brady to \"make up\" conversations or indicated that he could not differentiate between reality and fantasy, such information (even if six years old) would have severely discredited Brady's account of defendant's admission of the three murders and thus would have been more than minimally relevant. Because Brady's psychiatric records were never brought into court, however, they were not made a part of the record on appeal and we therefore do not know their contents. Accordingly, it is sheer speculation for the majority to reach any Conclusions about the possible effect upon the jury of impeaching Brady with information from his prison psychiatric records.\n\nFinally, I disagree with the majority that defendant could not have been prejudiced by the trial court's discovery ruling because, in the majority's words, \"the jury heard Brady's version of his diagnosis and its significance.\" (Maj. opn., ante, at p. 842.) When defense counsel questioned Brady upon cross-examination about a psychiatric evaluation that Brady had received just before his release from state prison, Brady gave the following explanation of his understanding of the terms \"psychopathic personality\" and \"schizophrenic paranoid coloring\" AS USED IN THE EVALUATION: \"Well, psychopathic personality[,] that is the type of outlaw type dude like I am. I have been fighting the law all my life and the system, which you can't win, believe me. Anyway, and I am just anti-social to the everyday square John type people. Man, like yourself, you know, I just don't click. And the schizophrenic coloring is that under due [ sic ] stress or something like that, I get frustrated and I keep thinking that someone is against me or trying to, you know; otherwise, I provoke something that isn't really there.\" Brady's self-serving and largely incoherent description of his psychiatric evaluation is no substitute for the objective and professional explanation of Brady's mental abnormalities that would have been revealed by his psychiatric records, and thus does not support the majority's Conclusion that defendant suffered no prejudice from the trial court's denial of his motion for discovery of Brady's psychiatric records.\n\nBrady's testimony that defendant admitted to him that he had committed the three murders and one attempted murder in this case constituted significant evidence of defendant's guilt that might have altered the outcome of defendant's trial. Defendant was tried twice for the murders in this case. At the first trial, at which Brady did not testify, the jury was unable to reach a verdict on the charges of murder and attempted murder. Although Brady's testimony was not the only additional evidence presented at the second trial (this case), it was the most significant because it exposed defendant's confession to the jury. As this court has recognized, a confession often \" 'operates as a kind of evidentiary bombshell which shatters the defense.' \" ( People v. Cahill (1993) 5 Cal. 4th 478, 497 [20 Cal. Rptr. 2d 582, 853 P.2d 1037].) Unlike the majority, therefore, I cannot conclude on the record before this court that defendant suffered no prejudice from the trial court's denial of the motion for discovery of Brady's psychiatric records.\n\nII\n\nAs noted at the outset, in this case the prosecution alleged one special circumstance, that of multiple murder, thus rendering defendant eligible for the death penalty. The allegation was phrased in the statutory language that \"defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" (Pen. Code, § 190.2, subd. (a)(3).) California law expressly requires a jury finding on the truth of any alleged special circumstance. (Pen. Code, § 190.4, subd. (a) [\"Whenever special circumstances . . . are alleged and the trier of fact finds the defendant guilty of first degree murder, the trier of fact shall also make a special finding on the truth of each alleged special circumstance.\" (Italics added.)].)\n\nWhen the trial court instructed the jury at the guilt phase of the trial, it refused to instruct on or provide the jury with verdict forms for this special circumstance allegation; consequently, the jury made no finding regarding the truth of the allegation. The trial court saw no need for instruction or verdict forms for the special circumstance allegation, reasoning: \"The jury does not . . . have to make a special finding that the defendant committed murder with special circumstances. If they convict the defendant of . . . two counts of murder, at least one of which is murder of the first degree, they're persuaded of those beyond a reasonable doubt, then, the special circumstances have been established without any additional or further finding.\"\n\nThe trial court was wrong, and the majority so holds. California law unquestionably gives a defendant in a capital case the right to a jury determination on the truth of the special circumstance itself. The federal Constitution, too, through the Sixth Amendment, guarantees the accused not only a jury determination on individual factual components of a criminal charge, but also a jury determination on the ultimate question of the accused's guilt or innocence. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\n\" No idea was more central to our Bill of Rights than the idea of the jury.\" (Amar, Sixth Amendment First Principles (1996) 84 Geo. L.J. 641, 681.) The constitutional right to jury trial in a criminal case was intended \"to prevent oppression by the Government.\" ( Duncan v. Louisiana (1968) 391 U.S. 145, 155 [20 L. Ed. 2d 491, 499, 88 S. Ct. 1444], fn. omitted.) As the United States Supreme Court explained in Duncan : \"Providing an accused with the right to be tried by a jury of his peers gave him an inestimable safeguard against the corrupt or overzealous prosecutor and against the compliant, biased, or eccentric Judge. If the defendant preferred the common-sense judgment of a jury to the more tutored but perhaps less sympathetic reaction of the single Judge, he was to have it. Beyond this, the jury trial provisions . . . reflect a fundamental decision about the exercise of official power--a reluctance to entrust plenary powers over the life and liberty of the citizen to one Judge or to a group of Judges.\" ( Id. at p. 156 [20 L. Ed. 2d at p. 500]; accord, Williams v. Florida (1970) 399 U.S. 78, 100 [26 L. Ed. 2d 446, 460, 90 S. Ct. 1893, 1905-1906] [\"the essential feature of a jury obviously lies in the interposition between the accused and his accuser of the commonsense judgment of a group of laymen, and in the community participation and shared responsibility that results from that group's determination of guilt or innocence\"].) This allocation of one of the fundamental powers of organized government--the power of criminal condemnation--to a deliberative body drawn specially from the people for the sole purpose of exercising that power in a single criminal case, rather than to a professional class of Judges, is an essential and fundamental feature of our system of government that \"reflects . . . 'a profound judgment about the way in which law should be enforced and Justice administered.' \" ( Sullivan v. Louisiana, (supra) , 508 U.S. at p. 281 [124 L. Ed. 2d at p. 191, 113 S. Ct. 2078, 2083]; see generally, Amar, op. cit. supra, 84 Geo. L.J. at pp. 677-687; Amar, The Bill of Rights as a Constitution (1991) 100 Yale L.J. 1131, 1182-1199.)\n\nTrial by jury as guaranteed by the Sixth Amendment to the federal Constitution encompasses more than having a jury decide whether the prosecution has proven each of several elements of a criminal charge. The right to jury trial, at base, is the right to have the jury decide the ultimate question of a defendant's guilt or innocence. ( United States v. Gaudin, (supra) , 515 U.S. at p. . . . [132 L. Ed. 2d at pp. 451-452, 115 S. Ct. 2310].) This, then, was the historical guarantee of the Sixth Amendment: \"[the] right of criminal defendants to demand that the jury decide guilt or innocence on every issue.\" ( United States v. Gaudin, (supra) , 515 U.S. at p. . . . [132 L. Ed. 2d at p. 452, 115 S. Ct. 2310]; id. at p. . . ., fn. 2 [ 132 L. Ed. 2d at p. 450, 115 S. Ct. at p. 2314] [\"the jury's determination of ultimate guilt is indispensable\" (original italics)]; accord, Sullivan v. Louisiana, (supra) , 508 U.S. at p. 277 [124 L. Ed. 2d at pp. 187-188, 113 S. Ct. 2078] [The \"most important element\" of right to trial by jury is \"the right to have the jury, rather than the Judge, reach the requisite finding of ' guilt.' \" (Italics added.)].)\n\nAs the high court has explained, \"[j]uries at the time of the framing [of the federal Constitution] could not be forced to produce mere 'factual findings,' but were entitled to deliver a general verdict pronouncing the defendant's guilt or innocence.\" ( United States v. Gaudin, (supra) , 515 U.S. at p. . . . [132 L. Ed. 2d at p. 451, 115 S. Ct. 2310], citing Morgan, A Brief History of Special Verdicts and Special Interrogatories (1922) 32 Yale. L.J. 575, 591; Clementson, Special Verdicts and Special Findings by Juries (1905); and Alschuler \u0026 Deiss, A Brief History of the Criminal Jury in the United States (1994) 61 U.Chi. L.Rev. 867, 912-913.) \"he jury's constitutional responsibility is not merely to determine the facts, but to apply the law to those facts and draw the ultimate Conclusion of guilt or innocence.\" (United States v. Gaudin, (supra) , 515 U.S. at p. . . . [132 L. Ed. 2d at p. 452, 115 S. Ct. 2310], italics added.) When a Judge rather than a jury reaches the ultimate verdict of guilty, \" 'the wrong entity Judge[s] the defendant guilty.' \" ( Sullivan v. Louisiana, (supra) , 508 U.S. at p. 281 [124 L. Ed. 2d at p. 190, 113 S. Ct. 2078].)\n\nThe ultimate determination of guilt or innocence by a jury comprises more than the sum of the factual decisions a jury makes to reach that determination. In accord with the principle of having juries deliver general verdicts pronouncing a defendant's guilt or innocence, courts have resisted procedures under which issues in a criminal case are presented piecemeal to a jury, leaving it to the trial court to decide the ultimate issue of guilt or innocence. (See e.g., United States v. Collamore (1st Cir. 1989) 868 F.2d 24, 25-26; United States v. Spock (1st Cir. 1969) 416 F.2d 165, 181; United States v. Ogull (S.D.N.Y. 1957) 149 F. Supp. 272, 276; United States v. Birdsong (11th Cir. 1993) 982 F.2d 481, 482.) These so-called trial-splitting devices include \"bifurcation\" (presenting factual components of a criminal charge to different juries such that no single jury passes on the defendant's guilt or innocence) and \"special verdicts\" (asking the jury to answer a series of questions corresponding to the elements of the crime). (See generally, Granholm \u0026 Richards, Bifurcated Justice : How Trial-Splitting Devices Defeat the Jury's Role (1995) 26 U.Tol.L.Rev. 505.)\n\nHere, the trial court's ruling, in effect, operated like a special verdict. In not submitting to the jury the issue of defendant's \"guilt\" on the multiple-murder special-circumstance allegation, the trial court usurped the jury's historic constitutional power to return a general verdict on the ultimate question of the truth or falsity of a criminal charge (here, the special circumstance allegation that rendered defendant eligible for the death penalty). The court, in effect, made the finding on the special circumstance. In short, \"the wrong entity Judge[d] . . . defendant guilty.\" ( Sullivan v. Louisiana, (supra) , 508 U.S. at p. 281 [124 L. Ed. 2d at p. 190, 113 S. Ct. at p. 2082].)\n\nAlthough the majority concludes that the trial court erred in not submitting the truth of the special circumstance allegation to the jury, it also concludes that the error was harmless. The majority does not consider the error to be a \"structural defect\" affecting the very framework of the trial, which under Arizona v. Fulminante (1991) 499 U.S. 279, 309 [113 L. Ed. 2d 302, 330-331, 111 S. Ct. 1246], would require automatic reversal, thus dispensing with the need to evaluate prejudice. In my view, however, the error was a structural defect affecting the fundamental fairness of defendant's trial.\n\nIn Fulminante, the United States Supreme Court distinguished two kinds of errors in criminal trials, \"structural defects\" and \"trial errors.\" The court defined a structural defect as an error \"affecting the framework within which the trial proceeds, rather than simply an error in the trial process itself.\" ( Arizona v. Fulminante, (supra) , 499 U.S. at p. 310 [113 L. Ed. 2d at p. 331].) Such defects are reversible per se; in other words, they require automatic reversal. Mere \"trial error,\" on the other hand, is reversible only if its occurrence has prejudiced the defendant. ( Id. at pp. 307, 310 [113 L. Ed. 2d at pp. 329-330, 331-332].)\n\nIndisputably, the violation of a criminal defendant's right to trial by jury affects the very framework or structure of the trial itself, thus requiring automatic reversal. As the United State Supreme Court has stated: \"he jury guarantee [is] a 'basic protectio[n]' whose precise effects are unmeasurable, but without which a criminal trial cannot reliably serve its function. [Citation.] . . . . The deprivation of that right, with consequences that are necessarily unquantifiable and indeterminate, unquestionably qualifies as 'structural error.' \" ( Sullivan v. Louisiana, (supra) , 508 U.S. at pp. 281-282 [124 L. Ed. 2d at p. 191, 113 S. Ct. 2078].) This court too has affirmed that under the California Constitution a violation of the right to jury trial is a \"miscarriage of Justice\" that is reversible irrespective of the strength of the evidence presented at trial. ( People v. Cahill, (supra) , 5 Cal. 4th at p. 501.)\n\nTo reach its Conclusion that the trial court's decision not to submit the multiple-murder special circumstance to the jury was harmless, the majority relies on cases in which, in the majority's words, \"[t]he factual issue posed by the omitted instruction necessarily was resolved adversely to defendant under other properly given instructions.\" (Maj. opn., ante, at p. 852, citing People v. Johnson (1993) 6 Cal. 4th 1, 45 [23 Cal. Rptr. 2d 593, 859 P.2d 673] and People v. Sedeno (1974) 10 Cal. 3d 703, 721 [112 Cal. Rptr. 1, 518 P.2d 913].) This is not simply a case of instructional error, however. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Not only did the trial court fail to instruct the jury on the multiple-murder special circumstance, it refused to submit the special circumstance allegation to the jury for decision. \"o hypothesize a guilty verdict that was never in fact rendered--no matter how inescapable the findings to support that verdict might be-- . . . violate[s] the jury-trial guarantee.\" ( Sullivan v. Louisiana, (supra) , 508 U.S. at p. 279 [124 L. Ed. 2d at p. 189, 113 S. Ct. 2078].) This denial of defendant's right to trial by jury was, for reasons set forth above, \"structural error,\" and thus reversible per se .\n\nConclusion\n\nI would reverse the special circumstance finding and the judgment of death.\n\nMOSK, J.\n\nI Dissent.\n\nIt is plain that the superior court erred when it denied defendant's motion for discovery of Gary Brady's file with the Department of Corrections. Brady had just testified that defendant had confessed to the three murders with which he was charged. The superior court wrongly treated the information in Brady's correctional file as though it was shielded by an absolute privilege under California law--even while it declined to review or even obtain its contents. Any such privilege, however, would have been required to yield, for example, to defendant's right under the due process clause of the Fourteenth Amendment to the United States Constitution to disclosure by the state of any information that was favorable to his position and material to guilt or punishment (e.g., United States v. Bagley (1985) 473 U.S. 667, 674 [87 L. Ed. 2d 481, 488-489, 105 S. Ct. 3375]), including such information as could be used to impeach Brady ( id. at p. 676 [87 L. Ed. 2d at p. 490]).\n\nWhat is not plain, however, is whether the superior court's error is reversible. We can readily conjecture that it was prejudicial. Brady was surely a crucial witness. With his testimony at this trial, the People obtained convictions and a sentence of death. Without his testimony at the original trial, defendant had secured a hung jury, with seven of the twelve members voting in favor of acquittal. Nevertheless, we cannot determine the question of prejudice on any principled basis. It is correct to assert, as do the majority, that defendant cannot demonstrate harm. But it is also right to state that the People cannot show the opposite. The reason is this: there is no ground on which either can do otherwise. Because the superior court made no effort to obtain Brady's correctional file, we do not have it in the record on appeal. As a result, we cannot know what information, if any, should have been disclosed or whether it would have had any effect on the outcome. In spite of our lack of knowledge, the error could perhaps be deemed not reversible if we could conclude that Brady was so thoroughly impeached that his testimony was rendered devoid of any weight whatever. We cannot so conclude. Brady was attacked. But his testimony was not destroyed. Therefore, in the face of our lack of knowledge--for which defendant, it must be emphasized, is not to blame--I believe that the only Disposition that we can reasonably order is to vacate the judgment and remand the cause to the superior court with directions to conduct further proceedings as required on the discovery motion.1a\n\nAppellant's petition for a rehearing was denied October 2, 1996. Mosk, J., and Kennard, J., were of the opinion that the petition should be granted.\n\n\u003cspan class=\"fn\"\u003e1. Defendant raises his double jeopardy claim for the first time on appeal, and the Attorney General argues the argument is therefore waived and should not be considered on appeal. If, however, a plea of former jeopardy had merit and trial counsel's failure to raise the plea resulted in the withdrawal of a crucial defense, then defendant would have been denied the effective assistance of counsel to which he was entitled. ( People v. Belcher (1974) 11 Cal. 3d 91, 96 [113 Cal. Rptr. 1, 520 P.2d 385] (Belcher) [acknowledging general rule of waiver, but addressing double jeopardy argument on direct appeal and concluding trial counsel's failure to timely raise plea of former jeopardy constituted a denial of effective assistance of counsel]; see Strickland v. Washington (1984) 466 U.S. 668 [80 L. Ed. 2d 674, 104 S. Ct. 2052].) Consequently, although the Attorney General is technically correct in arguing the issue was waived, as in Belcher we nevertheless must determine whether such a plea would have had merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We have previously construed Stone narrowly. In People v. Kurtzman (1988) 46 Cal. 3d 322, 329 [250 Cal. Rptr. 244, 758 P.2d 572], we declined to allow juries to return verdicts of guilt of lesser included offenses when there is disagreement on the greater offense. We concluded that in such a situation the jury should be instructed not to return a verdict on any lesser included offense unless it unanimously finds defendant has not been proven guilty beyond a reasonable doubt on the greater. (Ibid.; see also People v. Fields (1996) 13 Cal. 4th 289, 303-304 [52 Cal. Rptr. 2d 282, 914 P.2d 832].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Attorney General did not address this argument, and defendant asks that we treat his silence as a waiver of the issue on appeal. We decline to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. At the time of trial, and as relevant here, Evidence Code section 701 provided that: \"A person is disqualified to be a witness if he is: . . . Incapable of understanding the duty of a witness to tell the truth.\" (Stats. 1965, ch. 299, § 2, p. 1311.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant may be understood to suggest his trial counsel rendered ineffective assistance in failing to request the jury be instructed pursuant to Evidence Code section 412, which provides: \"If weaker and less satisfactory evidence is offered when it was within the power of the party to produce stronger and more satisfactory evidence, the evidence offered should be viewed with distrust.\" Defendant essentially argues David Moore's testimony regarding the bloodied white suit was weaker evidence that defendant wore a white suit while committing the killings than the actual suit would have been, and had the jury been so instructed it would have discounted Moore's testimony. The argument must fail, however, in the absence of a showing the prosecution in fact was in possession of, or had access to, the bloodied suit. ( People v. Taylor (1977) 67 Cal. App. 3d 403, 412 [136 Cal. Rptr. 640].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The court subsequently explained: \"My recollection was that initially I intended to tell the jury in so many words that the Defendant had not been previously convicted of a felony, and then, after we investigated a little further, came to the Conclusion that maybe he had been convicted of a felony, and I couldn't tell them that in so many words, and then it became a question of, simply, I think my position was that this--this testimony was relevant. Whether it was true or not was another matter, but the testimony was relevant on the basis of bias or motive. It was excludable for--in the first instance, upon a proper exercise of section 352 of the Evidence Code. However, I didn't have an opportunity to exercise that discretion in advance. I was also of the opinion that this was not deliberate on the part of the People and that it was not by design that the witness made that statement, that they had no way to anticipate it, that there was no bad faith or attempt to slip it in unfairly, and, under the circumstances, since it was relevant evidence, it was best left alone. The jury had already heard it, and now to order it stricken on the ground its probative value was outweighed by its prejudicial impact would accomplish nothing except to emphasize the statement in the jury's mind.\" Defense counsel then proposed the compromise discussed in text, i.e., that the ex-felon statement be stricken with no admonishment to the jury and no mention of the statement in argument of counsel. The prosecutor agreed not to argue the statement. The trial court then accepted the offered compromise, although, as noted, it ultimately neglected to strike the statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant argues to the contrary based on the fact the jury in his first trial, at which Brady did not testify, deadlocked, with seven jurors voting to acquit. We hesitate to ascribe the difference in the outcome of the two trials exclusively to Brady's testimony, in light of his extensive impeachment and the other differences between the trials.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The crimes in this case occurred on January 1, 1981, before the abolition of the defense of diminished capacity. (See People v. Saille (1991) 54 Cal. 3d 1103, 1111-1112 [2 Cal. Rptr. 2d 364, 820 P.2d 588].) Accordingly, the defense remains available in this case. ( People v. Mickey (1991) 54 Cal. 3d 612, 639, fn. 1 [286 Cal. Rptr. 801, 818 P.2d 84].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe record suggests the trial court may have intended to instruct the jury intoxication could negate the mental state required for first degree murder, but inadvertently failed to do so. Our analysis of the omission, whether intentional or inadvertent, is the same.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Concurring and Dissenting opinion characterizes this error as a denial of defendant's Sixth Amendment right to a jury trial. (Conc. and dis. opn. of Kennard, J., post, at pp. 876-877.) It is not. \"Any argument that the Constitution requires that a jury impose the sentence of death or make the findings prerequisite to imposition of such a sentence has been soundly rejected by prior decisions of this Court.\" ( Clemons v. Mississippi (1990) 494 U.S. 738, 745 [108 L. Ed. 2d 725, 738, 110 S. Ct. 1441]; see also People v. Johnson, (supra) , 6 Cal. 4th at p. 45; People v. Cummings (1993) 4 Cal. 4th 1233, 1313 [18 Cal. Rptr. 2d 796, 850 P.2d 1]; People v. Odle (1988) 45 Cal. 3d 386, 411, \u0026 fn. 11 [247 Cal. Rptr. 137, 754 P.2d 184]; People v. Moreno, (supra) , 228 Cal. App. 3d at p. 573.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862], we held that intent to kill was an element of the felony-murder special circumstance. In People v. Turner (1984) 37 Cal. 3d 302 [208 Cal. Rptr. 196, 690 P.2d 669], we held, following Carlos v. Superior Court, (supra) , 35 Cal. 3d 131, that intent to kill is an element of the multiple-murder special circumstance. In People v. Anderson (1987) 43 Cal. 3d 1104, 1149 [240 Cal. Rptr. 585, 742 P.2d 1306], however, we overruled both Carlos and Turner on the requirement of intent to kill. The offenses in the present case transpired before Turner was decided; thus, no intent to kill was required to prove the multiple-murder special circumstance here. (See People v. Payton (1992) 3 Cal. 4th 1050, 1062 [13 Cal. Rptr. 2d 526, 839 P.2d 1035]; People v. Poggi (1988) 45 Cal. 3d 306, 326 [246 Cal. Rptr. 886, 753 P.2d 1082].) Even were intent to kill required here, the jury necessarily found such intent in convicting defendant of three counts of murder in the first degree in a case tried exclusively on a theory of premeditation and deliberation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. People v. Easley (1983) 34 Cal. 3d 858 [196 Cal. Rptr. 309, 671 P.2d 813], opinion following retrial (1988) 46 Cal. 3d 712 [250 Cal. Rptr. 855, 759 P.2d 490]; People v. Guzman (1988) 45 Cal. 3d 915 [248 Cal. Rptr. 467, 755 P.2d 917]; People v. Silbertson (1985) 41 Cal. 3d 296 [221 Cal. Rptr. 152, 709 P.2d 1321]; People v. Fain (1969) 70 Cal. 2d 588 [75 Cal. Rptr. 633, 451 P.2d 65].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Relying on Justice Mosk's Concurring opinion in People v. Carrera (1989) 49 Cal. 3d 291, 347 [261 Cal. Rptr. 348, 777 P.2d 121], however, defendant argues the penalty phase jury should consider intracase proportionality and should be assisted in so doing by defense counsel's argument on the issue. In a one-defendant case such as this, using intracase proportionality as a sentencing factor is essentially indistinguishable from the jury's basic task in any capital case of weighing aggravating and mitigating factors to determine what sentence is appropriate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Attorney General argues the trial court's deletion of section 190.3, factors (d) and (h) did not constitute error for another reason: Defendant maintained his innocence during the penalty phase and, in confining his testimony to his childhood and religious beliefs, disclaimed an intent to \"mitigate\" as he understood the term. Contrary to the implications of the Attorney General's argument, a capital defendant may argue lingering doubt at the penalty phase without forfeiting the right to have the jury instructed on all sentencing factors applicable to the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Defendant contends that although the section 190.3, factor (k) instruction given in this case does not require reversal \"standing alone,\" a contrary Conclusion is compelled when we consider its interaction with several other errors, including the trial court's deletion from the instructions of particular sentencing factors, improper prosecutorial argument, the bailiff's snoring during defense counsel's closing argument, and the trial court's limiting defense counsel's comparisons, during closing argument, of this case to other capital cases. We have rejected most of the claims on which defendant predicates this cumulative error argument, and as to the rest we conclude none, singly or in combination, is reasonably likely to have confused or misled the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. At the time of trial, the professional conduct of California attorneys was governed by the Rules of Professional Conduct, as revised in 1975. Pursuant to a four-year study of the 1975 rules in the light of the American Bar Association Model Code of Professional Responsibility and other sources, the California State Bar Commission for the Revision of the Rules of Professional Conduct drafted a set of revised rules, which were adopted by the Board of Governors on August 27, 1988, were approved by this court on November 28, 1988, and became effective on May 27, 1989. (1 Witkin, Cal. Procedure (3d ed. 1996 supp.) Attorneys, § 368A, p. 176.) Effective October 1, 1995, rule 5-120 was added to the Rules of Professional Conduct. Rule 5-120 prohibits attorneys from making an extrajudicial statement that a reasonable person would expect to be disseminated by means of public communication if he or she knows or reasonably should know that it will have a substantial likelihood of materially prejudicing an adjudicative proceeding in the matter. (See 1 Witkin, Cal. Procedure, (supra) , § 368MM, p. 217.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Brady and a friend, Billy Ray Hamilton, were offered $75,000 by one Clarence Allen to murder several persons at a market in Fresno, California. Both agreed to do so, but ultimately it was Hamilton who committed the murders. Brady testified against Allen, who was convicted and sentenced to death. ( People v. Allen (1986) 42 Cal. 3d 1222 [232 Cal. Rptr. 849, 729 P.2d 115]; see also People v. Hamilton (1988) 46 Cal. 3d 123 [249 Cal. Rptr. 320, 756 P.2d 1348] [affirming Hamilton's conviction and death sentence].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The majority finds fault with the trial court's comment that \"so far as [it was] aware,\" witness Brady's psychiatric records included in his prison file were privileged material. The majority points out that a privilege may be asserted only by the holder of the privilege, not the trial court. (Maj. opn., ante, at p. 842.) The trial court's cursory remark, however, does not appear to have been intended as a definitive resolution of the question of privilege. Instead, it seems to have been merely an attempt to express a tentative view that if a privilege were to be asserted, the court would be required to sustain it. The court specifically invited defendant to furnish legal points and authorities to the contrary, but, as noted in the text above, defendant chose not to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The majority assumes that the question of prejudice can be adequately decided on the record before this court. As set forth earlier, in my view the trial court did not abuse its discretion in denying defendant's discovery motion. But were I to conclude that the denial was error, I would, unlike the majority, not reach the issue of prejudice. Instead, I would vacate the judgment and remand with directions for the trial court to conduct a hearing in chambers to determine whether any information from Brady's psychiatric records should have been provided to the defense and whether defendant suffered any prejudice from the denial of discovery. (See Pennsylvania v. Ritchie, (supra) , 480 U.S. 39, 61 [94 L. Ed. 2d 40, 59-60, 107 S. Ct. 989]; People v. Memro (1985) 38 Cal. 3d 658, 705-710 [214 Cal. Rptr. 832, 700 P.2d 446] (conc. and dis. opn. of Grodin, J.).) If after reviewing the records in chambers, the trial court were to conclude that defendant would not have been entitled to discovery during the trial of this case or that any information he should have received could not have affected the outcome of that trial, then the court would have to reinstate the judgment. If the trial court were to reach the opposite Conclusion, there would be no reinstatement of the judgment; defendant could, of course, be retried on the same charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The majority asserts that the trial court's refusal to submit the multiple-murder special-circumstance allegation to the jury in this case did not violate defendant's constitutional right to a jury trial, apparently reasoning that the Sixth Amendment of the federal Constitution does not apply to the special circumstance findings that must be made under California's death penalty law. (Maj. opn., ante, at p. 851, fn. 9.) The majority is wrong: Denial of a defendant's right to have a jury determine the truth of a special circumstance allegation does violate the Sixth Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs I recently explained in People v. Osband (1996) 13 Cal. 4th 622, 741-742 [55 Cal. Rptr. 2d 26, 919 P.2d 640] (conc. and dis. opn. of Kennard, J.): \"Generally, the definition of crimes and their elements is a legislative prerogative. ( McMillan v. Pennsylvania (1986) 477 U.S. 79 [91 L. Ed. 2d 67, 106 S. Ct. 2411].) . . . If the legislative intent was that the special circumstances in California's capital scheme be treated as the equivalent of or integral to criminal offenses, then the Sixth Amendment of the federal Constitution comes into play, giving defendants the right to have a jury decide the truth or falsity of such allegations. . . . If, on the other hand, the legislative intent was that the special circumstances be treated simply as sentencing factors, the Sixth Amendment would not apply, for 'there is no Sixth Amendment right to jury sentencing, even where the sentence turns on specific findings of fact.' ( McMillan v. Pennsylvania, (supra) , [477 U.S.] at p. 93 [ 91 L. Ed. 2d at p. 81]; accord, People v. Bacigalupo (1991) 1 Cal. 4th 103, 147 [2 Cal. Rptr. 2d 335, 820 P.2d 559] [no Sixth Amendment right to jury trial at the penalty phase, and thus no right to a unanimous jury finding on aggravating and mitigating factors].)\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI concluded in Osband that because California's capital scheme treats a special circumstance as the equivalent of or integral to a criminal offense, the Sixth Amendment requires that a jury determine the existence of any special circumstance allegations. ( People v. Osband, (supra) , 13 Cal. 4th at p. 743 (conc. and dis. opn. of Kennard, J.).) In concluding to the contrary, the majority relies on these decisions: Clemons v. Mississippi (1990) 494 U.S. 738, 745 [108 L. Ed. 2d 725, 735-736, 110 S. Ct. 1441], People v. Johnson (1993) 6 Cal. 4th 1, 45 [23 Cal. Rptr. 2d 593, 859 P.2d 673]; People v. Cummings (1993) 4 Cal. 4th 1233, 1313 [18 Cal. Rptr. 2d 796, 850 P.2d 1]; People v. Odle (1988) 45 Cal. 3d 386, 411 and footnote 11 [ 247 Cal. Rptr. 137, 754 P.2d 184]; and People v. Moreno (1991) 228 Cal. App. 3d 564, 573 [279 Cal. Rptr. 140]. The reliance is misplaced.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Clemons v. Mississippi, (supra) , 494 U.S. at page 745 [108 L. Ed. 2d at page 736], the high court observed: \"Any argument that the Constitution requires that a jury impose the sentence of death or make the findings prerequisite to imposition of such a sentence has been soundly rejected by prior decisions of this Court.\" Thus, under Clemons, neither the Sixth Amendment nor any other provision of the federal Constitution requires that a state structure its death penalty law so that a jury rather than a Judge performs the \"narrowing\" or the \"selection\" functions that are both necessary to the imposition of the death penalty. (See People v. Bacigalupo (1993) 6 Cal. 4th 457, 465 [24 Cal. Rptr. 2d 808, 862 P.2d 808] [explaining that \"narrowing\" pertains to the legislative definition that places a defendant within the class of persons eligible for the death penalty, whereas \"selection\" pertains to the decision whether to impose death or life imprisonment without parole].) Therefore, under Clemons, a state can, if it so chooses, create a statutory scheme whereby, consistent with the Sixth Amendment, a Judge rather than a jury performs the narrowing and selection functions as part of sentencing. But, as I explained in People v. Osband, (supra) , 13 Cal. 4th at page 742 (conc. and dis. opn. of Kennard, J.), California has not done so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs to the majority's reliance on People v. Johnson, (supra) , 6 Cal. 4th 1, 45, and People v. Cummings, (supra) , 4 Cal. 4th 1233, 1313, both decisions cite, without analysis, People v. Odle, (supra) , 45 Cal. 3d 386, 411-412, for the proposition that there is no constitutional right to jury trial on the issue of special circumstances. Odle, in a Discussion unnecessary to any holding in the case and therefore dictum, stated that there is no Sixth Amendment right to have a jury determine the existence of the elements of a special circumstance, citing in support Cabana v. Bullock (1986) 474 U.S. 376, 386 [88 L. Ed. 2d 704, 716-717, 106 S. Ct. 689]. But Bullock did not at all address the issue of special circumstance allegations under California's death penalty law, nor did it provide any support for Odle 's assertion. On the subject of the Sixth Amendment right to jury trial, the United States Supreme Court in Bullock merely observed, in passing, that in Spaziano v. Florida (1984) 468 U.S. 447 [82 L. Ed. 2d 340, 104 S. Ct. 3154] the court had \"specifically rejected the argument that the Sixth Amendment or any other constitutional provision provides a defendant with the right to have a jury consider the appropriateness of a capital sentence.\" ( Cabana v. Bullock, (supra) , 474 U.S. at pp. 385-386 [88 L. Ed. 2d at p. 715, 106 S. Ct. 689].) Spaziano lends no support to this court's dictum in Odle that there is no Sixth Amendment right to have a jury determine the existence of a special circumstance alleged under California's death penalty law. At issue in Spaziano was a claim by a capital defendant sentenced under Florida law (which has a Judge make the ultimate sentencing decision) that \"the capital sentencing decision is one that, in all cases, should be made by a jury.\" ( Spaziano v. Florida, (supra) , 468 U.S. at p. 458 [82 L. Ed. 2d at p. 351, 104 S. Ct. 3154].) The high court rejected that contention, holding that \"the Sixth Amendment does not require jury sentencing.\" ( Id. at p. 464 [82 L. Ed. 2d at p. 355].) As I explained in People v. Osband, (supra) , 13 Cal. 4th at page 742 (conc. and dis. opn. of Kennard, J.), however, under California's death penalty law a determination on the truth of a special circumstance allegation is not a sentencing decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePeople v. Moreno, (supra) , 228 Cal. App. 3d 564, 573, too, is of no assistance to the majority's Conclusion. In Moreno, the Court of Appeal simply asserted without analysis that there is no Sixth Amendment right to have a jury determine the truth of special circumstance allegations, citing in support Walton v. Arizona (1990) 497 U.S. 639 [111 L. Ed. 2d 511, 110 S. Ct. 3047]. Walton involved Arizona's death penalty law, under which findings on aggravating factors (the \"narrowing\" aspect of that state's capital scheme) were to be made at a separate sentencing hearing. ( Walton v. Arizona, (supra) , 497 U.S. at p. 645 [111 L. Ed. 2d at pp. 522-523, 110 S. Ct. 3047].) The high court rejected the assertion that the Sixth Amendment entitled an Arizona capital defendant to have a jury rather than a Judge make those findings. (Walton, (supra) , at p. 647 [ 111 L. Ed. 2d at p. 524].) But in California, the determination of the existence of a special circumstance allegation (the \"narrowing\" aspect of our capital scheme) is made at the guilt phase of trial, together with the determination of the defendant's guilt or innocence on the murder charge, not at a separate sentencing hearing. Therefore, a California capital defendant is entitled under the Sixth Amendment to have a jury decide the truth of a special circumstance allegation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMoreover, even if the majority were correct that the Sixth Amendment does not entitle a California capital defendant to have a jury decide the existence of a special circumstance, removing a special circumstance allegation from the jury's consideration violates a capital defendant's statutory right to jury trial under California law, and thereby denies the defendant due process of law under the Fourteenth Amendment to the federal Constitution, as the majority concedes. (Maj. opn., ante, at p. 850.) Denial of a criminal defendant's right to jury trial in violation of the federal Constitution is \"structural error\" that is reversible per se, whether the federal constitutional right that is violated is the Sixth Amendment right to jury trial or the Fourteenth Amendment right to due process of law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFinally, even if removing a special circumstance allegation from the jury's consideration would not violate any federal constitutional right, constituting merely the denial of a statutory right to jury trial, it would still be a \"structural defect\" establishing a \"miscarriage of Justice\" under our state law harmless error standard (Cal. Const., art. VI, § 13) and therefore reversible per se. (See People v. Cahill, (supra) , 5 Cal. 4th 478, 501-502.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 In this regard, this case is distinguishable from People v. Osband, (supra) , 13 Cal. 4th 622, 746-747 (conc. and dis. opn. of Kennard, J.), in which I concluded that the instructional error involving a special circumstance allegation was harmless. There, the trial court submitted to the jury the truth or falsity of the special circumstance alleged in that case, but inaccurately instructed the jury on the elements of that special circumstance. The error, therefore, was \"instructional\" rather than \"structural.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a I agree with the majority that whatever error the superior court may have committed by declining to instruct the jury on the multiple-murder special-circumstance allegations, and by declining to provide it with forms on which to indicate its findings, is not reversible. To my mind, the superior court did not remove from the jury's consideration the question of the truth of the multiple-murder special-circumstance allegations. Rather, it effectively presented the issue through its instructions on the three murder charges. Moreover, it did not lack a multiple-murder special-circumstance finding. Rather, it obtained one in the form of guilty verdicts on the three murders. I disagree with the majority, however, insofar as it proceeds to address whether the superior court's \"error\" is a so-called \"structural defect\" that is reversible per se under the United States Constitution. If a court's mere instructional misdefinition of the prosecution's burden of proof beyond a reasonable doubt on a question is a \"structural defect\"--and it is ( Sullivan v. Louisiana (1993) 508 U.S. 275, 281-282 [124 L. Ed. 2d 182, 190-191, 113 S. Ct. 2078])--it appears to follow, a fortiori, that a court's omission of any instruction at all on the issue is the same (see Carella v. California (1989) 491 U.S. 263, 268-270 [105 L. Ed. 2d 218, 223-225, 109 S. Ct. 2419] (conc. opn. of Scalia, J.)).\u003c/span\u003e\n\n",
    "body_length": 190604,
    "citedas": [
      "13 Cal.4th 799",
      "919 P.2d 1280",
      "55 Cal.Rptr.2d 347"
    ],
    "attorneys": "Lincoln Nathan Mintz, Dennis P. Riordan, Dylan L. Schaffer and B. E. Bergesen, under appointments by the Supreme Court, for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Steve White and George Williamson, Chief Assistant Attorneys General, Robert R. Anderson, Assistant Attorney General, Eddie T. Keller, Raymond Brosterhous II, Eileen Ceranowski, J. Robert Jibson and William G. Prahl, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "253",
      "78"
    ],
    "judges": "Opinion by Werdegar, J., with George, C. J., Baxter, Chin, and Brown, JJ., Concurring. Concurring and Dissenting opinion by Kennard, J. Dissenting opinion by Mosk, J.",
    "citation_count": 720
  }
}
