{
  "id": "97O2TGYBTlTomsSBwoob",
  "document": {
    "title": "CITY OF BIDDEFORD v. BIDDEFORD TEACHERS ASS'N",
    "full_title": "CITY OF BIDDEFORD BY ITS BOARD OF EDUCATION V. BIDDEFORD TEACHERS ASSOCIATION ET AL. BIDDEFORD TEACHERS ASSOCIATION V. BOARD OF EDUCATION OF CITY OF BIDDEFORD ET AL",
    "jurisdiction": "Supreme Judicial Court of Maine",
    "date": "1973-04-30T00:00:00.000Z",
    "docket": "No Docket Available",
    "body": "These two complaints necessitate our first examination of theprovisions of the Municipal Employees Labor Relations Law, 26M.R.S.A. Chap. 9-A, which was enacted by the Maine Legislature in1969. The complaints direct our attention only to the applicationof the statute to teachers in the public schools.\n\nIn the fall of 1970 the Board of Education of the City of Biddeford and the representatives of the Biddeford Teachers Association entered into negotiations in an attempt to effect a contract for the professional services of teachers in the Biddeford public schools for the school year 1971-1972.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e When the Board and the Association were unable to reach an agreement, the fact-finding procedures provided in section 965(3) were called into play but they proved unsuccessful. Finally, in August of 1971 the parties resorted to the arbitration process found in section 965(4).\n\nThe three arbitrators held a hearing on the various provisions of the proposed contract which were in dispute on September 22 and 23, 1971. Both sides were given opportunity to offer testimony and documentary evidence and to present argument on the disputed issues. Later, on November 17, 1971 the arbitration panel issued a unanimous decision in which it made findings and determinations as to disputed sections and directed the parties to enter into a written agreement (retroactive to September 1, 1971) which included each of their determinations.\n\nThe Board refused to enter into the agreement and on December 13, 1971 the Association brought an 80B complaint against the Board and the Superintendent of Schools asking that the Defendants be ordered to comply with the determination of the arbitration panel and enjoined from continuing to refuse to do so.\n\nOn December 14, 1971 the Board brought an 80B complaint against the Association (and the two then surviving arbitrators) alleging that the award contained erroneous rulings of law and fact and was invalidated by partiality of an arbitrator and by prejudicial conduct of the hearing.\n\nThe two actions were consolidated for appeal and, upon the parties' agreement, the consolidated actions were ordered reported to us upon the complaints, answers and stipulation \"for such final decision as the rights of the parties may require\". The stipulation presents for our study the 1970-1971 contract, the 1971-1972 contract, the Determinations and Recommendations of the Arbitration Tribunal and the agreed fact that \"David W. Bustin [one of the arbitrators] is employed full time by the Maine Teachers Association with which the Biddeford Teachers Association is affiliated and participated as advisor on behalf of the latter association at various times in the bargaining process prior to the arbitration.\"\n\nThe purpose of the Municipal Public Employees Labor Relations Law is stated by 26 M.R.S.A. § 961 as follows:\n\n\"It is declared to be the public policy of this State and it  is the purpose of this chapter to promote the improvement of  the relationship between public employers and their employees  by providing a uniform basis for recognizing the right of  public employees to join labor organizations of their own  choosing and to be represented by such organizations in  collective bargaining for terms and conditions of employment.\"\n\nUnquestionably the Board of Education of the City of Biddeford is a public employer as defined by the Act, and the Association is composed of teachers in the Biddeford public schools who are among the public employees who are entitled to the benefit of the Act. The authority of the Association to represent the teachers as their chosen bargaining agent is not disputed.\n\nThe Act makes it the obligation of the public employer and the bargaining agent to meet and bargain collectively and provides a four-step procedure consisting of negotiation, mediation (when jointly requested), fact finding and arbitration.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The parties are first obligated to negotiate in good faith concerning \"wages, hours, working conditions and contract grievance arbitration\" — with the exception —\n\n\". . . [T]hat public employers of teachers shall meet and  consult but not negotiate with respect to educational policies  for the purpose of this paragraph, educational policies shall  not include wages, hours, working conditions or contract  grievance arbitration;\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nSecondly, if the parties are unable to agree after negotiation they may jointly agree upon mediation procedures. Thirdly, if mediation procedures are omitted or are unsuccessful, either one or both may request fact-finding and the parties are then obligated to present their contending positions to the fact-finding board which will, after hearing, submit its findings to the parties. If a 30-day period of further effort to resolve the controversy is unsuccessful either party may make the findings public. Fifteen more days are then allowed to permit a further good faith effort to resolve the controversy. Fourth, and lastly, if, after another ten days they have not agreed as to an arbitration procedure, either party may request in writing that their differences shall be arbitrated in accordance with the procedure described in subsection 4.\n\nIn brief, this procedure requires each party to choose an arbitrator and the two so chosen shall name a \"neutral\" arbitrator. The three arbitrators shall then proceed to hear the matter. If the subject of the controversy has been salaries, pensions or insurance, the arbitrators shall recommend terms of settlement which are advisory only and may make findings of fact. As to other matters in dispute the arbitrators shall make determinations which are binding upon the parties and \"the parties will enter into an agreement or take whatever other action that may be appropriate to carry out and effectuate such binding determinations\". The determinations are subject to review in accordance with M.R.C.P., Rule 80B but, in the absence of fraud, the arbitrators' decisions upon questions of fact are final.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e PART I\n\nThe Act obviously represents a fresh approach to municipal public employee labor relations problems and enters an area as yet unexplored here. In the field of education, particularly, it appears to clash with traditional concepts of school control and management. As a result, members of the Board here — as several school boards in other jurisdictions have done — protest that if the members entered into the proposed contract, as the arbitration award has ordered them to do — they would be surrendering their authority as public officers to persons who are in no way responsible to the electorate.\n\nTraditionally, the control of the public schools has been entrusted to the local school boards since our State's earliest days. When our Constitution was adopted on October 29, 1819, Article VIII read:\n\n\"A general diffusion of the advantages of education being  essential to the preservation of the rights and liberties of  the people; to promote this important object, the Legislature  are authorized, and it shall be their duty to require, the  several towns to make suitable provision, at their own expense,  for the support and maintenance of public schools; . . .\"\n\nThe first Legislature promptly acted upon this directive (P.L. 1821 Chap. 117) by (sec. 1) requiring the various towns to raise money for maintenance of public schools\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and (sec. 3) by giving local school committees responsibility as to the qualification of teachers, the books to be used and the conduct of the local educational process.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Although the nature of the educational units changed with the growth of our communities through the years,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e the responsibility for the management of local public educational systems has remained, substantially unchanged, in the local school authorities — primarily the local superintending school committees\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e — with the exception of two developments. The Legislature, having originally delegated to local school bodies the entire responsibility for the conduct of public primary and secondary education, soon began taking back selected portions of this authority by enacting specific parcels of legislation which imposed various requirements upon the conduct of the local education process. Examples of this are found today in statutes which create certain school holidays,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e establish a minimum number of sessions,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e require that study in hygiene be offered,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e that health, safety and physical education studies be taught\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and that the school committees appoint a school physician, etc.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In 1868 the Legislature made a single major inroad into local school committee authority when it created the office of State Superintendent of Schools and empowered that officer \"to exercise a general supervision of all the public schools and to advise and direct the town committees in the discharge of their duties\".\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Later, this official became the Commissioner of Education and, under the reorganization of 1971, became the Commissioner of Education and Cultural Resources.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e He still retains supervisory powers, now somewhat more detailed, over the conduct of local education. 20 M.R.S.A. § 102, subsections 1 and 7.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Until the enactment of the Municipal Employees Labor Relations Law, the local school authorities retained all the responsibility for the operation of the public schools which had not been given to the Commissioner of Education or specifically assumed by the Legislature. The effectiveness of their authority has been limited, of course, by the extent that local legislative bodies made finances available.\n\nWhile the present actions present many issues concerning various areas of the arbitrators' award, we must first consider the constitutionality of the Act in so far as it requires local school boards, at the request of the teaching employees, to submit to binding arbitration disputes arising both out of the making of the labor contract and out of later employment under the contract. Can the superintending school committees constitutionally delegate this authority to arbitrators? In requiring them to do so, can the Legislature constitutionally take away the authority which local officials had traditionally exercised and repose it in persons who compose ad hoc boards of arbitration? If so, has there been such a valid delegation of authority here?\n\n\". . . All acts of the legislature are presumed to be  constitutional and this is a `presumption of great strength.' .  . . The burden is upon him who claims that the act is  unconstitutional to show its unconstitutionality. . . . Whether  the enactment of the law is wise or not, and whether it is the  best means to achieve the desired result are matters for the  legislature and not for the Court. . . .\" State v. Fantastic  Fair, 158 Me. 450, 467, 186 A.2d 352, 363 (1961).\n\nWe have examined the few decisions from other jurisdictions which have dealt with these issues.\n\nThe concept of collective bargaining between public officials and their municipal employees is of comparatively recent appearance in the courts of this country. Many courts found this concept impossible to reconcile with the long accepted principle that members of the public are entitled to have public service issues determined according to the best judgment of the officials to whom they have entrusted the responsibilities. In most of the jurisdictions where the issue has been litigated it has been held that municipal officers have no right to bargain collectively in the absence of legislation giving them this authority and that when city officials agree to bargain collectively without such legislation they are abdicating the responsibilities reposed in them by the electorate.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIt appears to be accepted that statutes relating to labor relations in general have uncertain application to the public sector as the courts find that public employees, as servants of the public welfare, occupy a status much different from that of employees engaged in private enterprises.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nWhile a number of states have recently enacted legislation to permit collective bargaining in different forms in the public sector, very few cases involving these laws have reached the courts of last resort and judicial concern over loss of governmental responsibility has not disappeared. When collective bargaining is provided by statute, the public officials cannot be said to have abdicated ultimate responsibility — the legislature has taken it away from them — but the power of the legislature to delegate to private persons discretion to determine issues which are essentially governmental is not free from doubt.\n\nIn 1947 the Pennsylvania General Assembly enacted legislation which established grievance procedure under which public employer-employee disputes should be submitted to a mediation board which, after hearing, would make findings and recommendations to local public officials. Such a mediation board heard such a dispute for the Erie firefighters and then recommended that the City Council enact an ordinance creating a pension plan which the mediators found the public interest required.\n\nIn Erie Firefighters Local No. 293 v. Gardner, 406 Pa. 395, 178 A.2d 691 (1962) the firefighters had brought mandamus to compel the City Council to take this action. The Court chose to face the constitutional issue by \"assuming\" that the statute did require the City Council to take the action the mediators recommended. The Court held that, as so construed, the statute was an unconstitutional delegation of legislative discretion to the mediators.\n\nAn article in the Pennsylvania Constitution contained this language:\n\n\"`The General Assembly shall not delegate to any special  commission, private corporation or association, any power to  make, supervise or interfere with any municipal improvement,  money, property or effects, whether held in trust or otherwise,  or to levy taxes or perform any municipal function whatever.'\"  Erie Firefighters Local No. 293 v. Gardner, supra at 395, 178  A.2d at 695.\n\nThe Court recognized that there was, even then, an important current trend toward delegation of power to administrative bodies, but said:\n\n\"If the delegation of power is to make the law, which  involves a discretion of what the law shall be, then the power  is nondelegable. If the conferred authority is the power or  discretion to execute the law already determined and  circumscribed, then the delegation is unobjectionable. . . . We  are of the opinion, therefore, that if the Act of 1947 makes  the findings of the panel of conciliators binding upon the city  in so far as the creation of municipal ordinances is concerned,  then that portion of the Act which so states is  unconstitutional and cannot be enforced in this proceeding.\"  Erie Firefighters Local No. 293 v. Gardner, supra at 395, 178  A.2d at 695.\n\nThe State of Wisconsin had one of the first comprehensive municipal labor laws in the nation and Local 1226, Rhinelander City Employee's v. City of Rhinelander, 35 Wis.2d 209, 151 N.W.2d 30 (1967) is frequently cited as representing a modern judicial attitude as to this problem. Their statute authorized municipalities to enter into labor contracts with representatives of employees. The statute permitted but did not require cities to make binding agreements to submit grievances to arbitration. (Wisconsin had earlier held in a non-labor dispute case that a city may submit to binding arbitration claims arising out of contract.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e)\n\nThe City entered into a labor contract in which it agreed to submit grievances to arbitration. Later it refused to arbitrate contending that to be required to do so would be an unlawful infringement upon the legislative power of the City. The Court held that the City, having agreed to arbitrate, could now be forced to carry out its agreement. It is necessary, however, to an appreciation of the Court's opinion to note that it added, distinguishing between interests arbitration (that is, disputes involved in the making of the labor contract) and grievance arbitration (disputes arising out of employment under a contract which has already been made):\n\n\"Yet in all of its arguments the city is talking about  arbitration in the collective bargaining context — arbitration  to set the terms of a collective bargaining agreement. Such is  not this case, which involves arbitration to resolve a  grievance arising under an existing agreement to which the city  is a party.\" Local 1226, Rhinelander City Employee's v. City of  Rhinelander, supra at 220, 151 N.W.2d at 36.\n\nWhile the acceptance of any collective bargaining in municipal employment affairs doubtless dilutes the absolute discretion which public officials had formerly enjoyed, the issue becomes acutely presented when statutes or charters provide, as an ultimate step, the right of either party to have issues settled by arbitration which is binding upon the municipality.\n\nState of Washington v. Johnson, 46 Wn.2d 114, 278 P.2d 662 (1955) dealt with a \"home rule\" city charter which provided for binding arbitration between the City and its firefighters concerning working conditions, wages and pensions. The Court found this to be an invalid delegation of public authority and the language of the opinion seems to be representative of the rationale of the majority of courts.\n\n\"Can the legislative body abdicate its responsibility and  turn it over to a board of arbitrators whose decision will be  binding upon the legislative body and the firemen? Clearly it  has no legal right to do so. The theory of delegation of  authority is that the person or group, to whom authority has  been delegated, acts for and as the agent of the person or  group delegating such authority. That is not the situation  here. Here the council would be stepping out of the picture  entirely and the arbitration board would be performing a  function which, by law, is the responsibility of the council.\"  Washington v. Johnson, supra at 121, 278 P.2d at 666.\n\nThe absence of a state statute authorizing binding arbitration did not appear to control the Court's reasoning in Johnson and the same rationale is expressed in Fellows v. LaTronica, 151 Colo. 300, 377 P.2d 547 (1962) where the Colorado Court found that another \"home rule\" charter amendment which authorized city officials to submit municipal labor disputes to binding arbitration constituted an unconstitutional delegation of authority.\n\nIn Joint School District No. 8, City of Madison v. Wisconsin Employment Relations Board, 37 Wis.2d 483, 155 N.W.2d 78, 80-81 (1967) the Court examined the language of the Wisconsin statute which provided that \"municipal employees shall have `. . . the right to be represented by labor organizations of their own choice in conferences and in negotiations with their municipal employers or their representatives on questions of wages, hours, and conditions of employment.'\" The Court decided that in using this language the legislature intended to distinguish between labor relations in the private sector and those in municipal employment. The statute, it found, required the City only to meet and negotiate and engage in fact finding. It said that, while this might affect a determination of the controversy by moral force, it is not an unlawful delegation of authority because it is not binding on the City. The final determination must still be made by the school board. If the statute required the City to participate in collective bargaining, the Court said, in dicta, it would be a surrendering by the members of the school board of the municipal function entrusted to them.\n\nThe constitutionality of a Rhode Island statute known as the Firefighters' Arbitration Act which provided for collective bargaining including binding arbitration was considered by the Rhode Island Supreme Court in City of Warwick v. Warwick Regular Firemen's Association, 106 R.I. 109, 256 A.2d 206 (R.I. 1969). The Court upheld the principles of the legislature's propriety of delegation of power to arbitrators in this language:\n\n\"We concur in the conclusion of the trial justice that it is  within the prerogative of the legislature to vest  administrative boards or public bodies or officers with some  portion of the legislative power where such action is necessary  to give operative effect to the antecedent legislation. We are  of the opinion that when the legislature, in an exercise of its  lawmaking authority, enacts a statute the purpose of which is  to secure to the public some right or benefit, it may delegate  to an appropriate agency or officer some residuals of its  legislative power in order to permit the selected agent to  accomplish the ends contemplated in the original legislation.  Of course, this is not to say that the legislature may abdicate  its duty to legislate. Where the purposes of the antecedent  legislative enactment may be best accomplished through the  employment of an agent acting in its stead, the legislature may  delegate to that agent a sufficient portion of its power to  enable it to make the statute operative.\" City of Warwick v.  Warwick Regular Firemen's Association, supra at 208-209.\n\nFollowing the passage in 1955 of a New Hampshire statute permitting municipalities to \"recognize unions of employees and make and enter into collective bargaining contracts with such unions\" the City of Berlin entered into a contract with the local union representing the city police. A section in the contract provided for grievance arbitration by an impartial arbitrator to be appointed by the state board of arbitration whose decision was to be final and binding. In Tremblay v. Berlin Police Union, 108 N.H. 416, 237 A.2d 668 (1968), this was attacked as an unlawful delegation of municipal authority. The New Hampshire Court said:\n\n\"If that were the end of the matter, it would present a  serious question. But, as previously noted, the clause [of the  contract] was specifically amended to provide that it `shall  comply and be subordinate to N.H. State Law'. This amendment  subjects the grievance and arbitration procedure to Laws 1963,  275:5 as well as the state arbitration statute (RSA 273:12-27)  which contains a provision that a party may give a notice in  writing not to be bound by the arbitrator's decision.\" Tremblay  v. Berlin Police Union, supra at 421, 237 A.2d at 672.\n\nThe contract also contained the Union's acceptance of the fact that the police department must operate with its budget as set by the city council and that nothing in the arbitration paragraph shall be construed so as to conflict with applicable state laws. The Court concluded that the contract was not an unlawful delegation of the city's authority to control the police department.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Thus explained, the opinion constitutes only an approval of legislation permitting municipalities to contract for non-binding grievance arbitration which is not necessarily binding.\n\nWhile there is a little legal precedent, some of the writers on the subject seem to feel that the problem of delegation is more easily satisfied if the arbitrators themselves are public officials.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e It will be remembered that our own statute authorizes the appointment of arbitrators who are private citizens and not in any way responsible to the public although their decisions might affect the quantity, quality and cost of essential public service.\n\nThe Rhode Island statute, earlier discussed, authorized a delegation of authority to a board of arbitrators such as our own — one arbitrator to be chosen by the city, one by the union and those two to select the third — whose decisions are to be binding. It was contended in City of Warwick v. Warwick Regular Firemen's Association, supra, that the statute contemplated an unconstitutional delegation of governmental authority to private individuals but the Court found the delegation to be proper, employing reasoning, however, which appears to be tautological. The Court considered that since the statute provided that the person chosen as arbitrator receives a portion of the sovereign power of the state, that person necessarily becomes a public officer while he is performing these duties.\n\nIt appears, then, that most of the cases holding that agreements to submit public employee labor disputes to binding arbitration are invalid attempts to delegate official responsibility come from states that had no legislation authorizing such agreements. On the other hand, serious concern over the problem is apparent in all the decisions and several of those often spoken of as favorable to the position urged here by the Association limit their holdings to grievance arbitration of contracts which municipalities have already entered into. It may be that the Rhode Island statute is the only one imposing upon the municipalities binding arbitration in the areas of both interest and grievance, without specific constitutional authorization, which has been finally upheld. We consider that decisions involving arbitration in essential industries in the private sector such as hospitals and public utilities give as little assistance as to this problem.\n\nWith scant solid precedent to guide us, we return to our own situation. We find that our Constitution gave the Legislature full responsibility over the subject matter of public schools and education and empowered it to make all reasonable laws in reference to schools and education for the \"benefit of the people of this state\". Opinions of the Justices, 68 Me. 582 (1876). Except for the areas where the Legislature has from time to time seen fit to impose its own requirements and except for the authority later given to the Commissioner of Education, the responsibilities for operating the public schools have remained in the local school boards.\n\nThe Legislature has now decided to take from the school boards the ultimate authority they have exercised in certain areas of school management — that is, as to \"hours, and working conditions\" and contract grievance arbitration — and to give it to ad hoc boards of arbitration.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nIt is settled beyond question that the Legislature may properly conclude that the purposes of its legislation may best be carried out through agents and that it may delegate to the agents a portion of its power to facilitate the functioning of the legislative program. McGary v. Barrows, 156 Me. 250, 163 A.2d 747 (1960); McKenney v. Farnsworth, 121 Me. 450, 118 A. 237 (1922).\n\nThere can be no doubt but that the Legislature, which is thesource of all municipal authority (Squires v. Inhabitants of City of Augusta, 155 Me. 151, 153 A.2d 80 (1959), has also the power to take back frommunicipal officers portions of the authority it has earlier giventhem.\n\nIt is clear that the Legislature has recognized that the maintenance of a satisfactory quality of public education requires harmonious relations between school officials and the teaching staffs and that disagreements inevitably arise during the carrying out of their respective responsibilities. The abrasive effect of the existence of unresolved grievances is one of the threats to harmonious relations which the Legislature considers should be removed.\n\nThe lawmakers have recognized that policy making decisions should remain in the local officials, responsible to the public, and that while the citizens may properly be subjected to moral suasion as to such matters as wages and pensions, the ultimate determination of such matters with such heavy impact upon — and so limited by — municipal appropriations should be made by local officials.\n\nThe Legislature has apparently concluded, on the other hand, that experience has taught that certain aspects of this dynamic and complicated municipal employer-employee relationship no longer need remain subject to arbitrary decision by the employer and that in the area of working conditions and hours and of contract grievances the interests of the employees must in fairness be examined by impartial persons. The Legislature appears to believe that this much can be done without serious disruption of the balancing of operating costs against municipal appropriations.\n\nWe realize that in providing that the contract making process itself (as it affects working conditions and hours) is subject to binding arbitration, our Legislature has moved into an area forbidden by many courts. The Legislature must have concluded that the benefits which are sought by the statute can never be achieved if an impasse occurs at the very beginning of the relationship. This conclusion is not unreasonable.\n\nTrue, the statute does not contemplate the delegation of authority to public administrative boards or agencies but instead gives it to ad hoc panels whose memberships are not to be controlled by governmental action. Here we are of the opinion that the Legislature, mindful of the denial to municipal employees of such economic weapons as strikes and work stoppages which are available to employees in private employment, has sought to avoid the disruptive feelings of resentment and bitterness which may result if the governmental employee may look only to the government for redress of his grievances.\n\nWhere the ultimate arbiter of the dispute is a representative of one side of the dispute, adverse decisions will be hard to accept and the tendency toward alienation will be strong.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nWe consider that there is a rational reason for the Legislature's decision that its purposes would be best effectuated if the parties are left to choose their own arbitrators in the limited non-policy areas which are subject to arbitration.\n\nPART II\n\nWhile we consider that the Legislature may justifiably choose to permit private citizens to exercise the limited portions of its sovereign power (as it concerns teacher-school board labor relations) which we have just discussed, it is well established that a legislative body cannot delegate the legislative power without including in the delegating statute sufficient standards to guide the agents in the exercise of the legislative authority. Small v. Maine Board of Registration and Examination in Optometry, Me., 293 A.2d 786,\n\n(1972); Waterville Hotel Corp. v. Board of Zoning appeals, Me., 241 A.2d 50 (1968); Opinion of the Justices, 155 Me. 30, 48, 152 A.2d 81 (1959); Local 170, Transport Workers Union of America v. Gadola, 322 Mich. 332, 34 N.W.2d 71 (1948); City of Warwick v. Warwick Regular Firemen's Association, supra.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIn 1947 the New Jersey Legislature enacted a law which provided for compulsary arbitration of labor disputes in public utilities and authorized ad hoc boards of arbitration chosen much as our own statute provides. The statute contained no statement of criteria to guide and limit the discretion of the arbitrators. The opinion by Chief Justice Vanderbilt said, in part:\n\n\"If no standards are set up to guide the administrative  agency in the exercise of functions conferred on it by the  legislature, the legislation is void as passing beyond the  legitimate bounds of delegation of legislative power and as  constituting a surrender and abdication to an alien body of a  power which the Constitution confers on the Senate and General  Assembly alone. Nowhere in this act is there any guide  furnished to the board of arbitration other than that it shall  arbitrate `any and all disputes then existing between the  public utility and the employees . . .'\n\n. . . There is, thus, an even greater need of specific standards than there would be in the case of a continuous administrative body which might gather experience as it went along. . . .\n\nStandards of delegation are peculiarly required, moreover,  where the legislature is enacting a new pattern of social  conduct . . .\" State v. Traffic Telephone Workers' Federation  of New Jersey, 2 N.J. 335, 66 A.2d 616, 625-626 (1949).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe extent to which the standards must be detailed must depend upon the nature of the service which the legislative body has determined should be performed by the administrative agency. The need here is to protect both the public and the employee from unnecessary and uncontrolled discretionary power.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nMr. Justice Wernick's opinion agrees that even though the present law involves an area of internal governmental employer-employee relationship, the statute delegates to the arbitrators a portion of the police power of the State (to the extent that it empowers the public employer to force binding arbitration upon the teachers against their wills). It also agrees that there are carry-over effects upon the personal and property rights of the citizenry in general. Although that opinion does not agree that standards are constitutionally mandated in this Act, it appears to concede that, because of the presence of those two factors, potential constitutional infirmities could develop if the Act does not reveal a combination of 1) a \"primary standard\" or \"intelligible principle\", and 2) adequate procedural safeguards and opportunity for effective judicial review which can protect the teachers and the public against irresponsible, arbitrary action. That opinion looks for these primary standards and intelligible principles and is satisfied that they can be found in the totality of the Act.\n\nWe, on the other hand, consider that the constitutional issue is unavoidably presented now. The question is whether there can be found in the Act sufficient standards — specific or generalized, explicit or implicit — to protect the teachers and the public from possible arbitrary and irresponsible exercise of this delegated power by these ad hoc boards of arbitration. We arrive at the conclusion that no such standards can be found.\n\nWe do not concede that the fact that the Act has its primary effect upon the internal governmental employer-employee relationship makes the need for standards more easily satisfied. Neither do we find in the Act procedural safeguards or adequate review techniques which could make the need for standards more easily satisfied.\n\nWe recognize that in an area such as labor arbitration where a great variety of issues may be expected to be presented and where considerable flexibility is essential, it is not reasonable to require that the arbitrators' evaluations and options be restricted rigidly.\n\n\"It is not necessary that Congress supply administrative  officials with a specific formula for their guidance in a field  where flexibility and the adaptation of the congressional  policy to infinitely variable conditions constitute the essence  of the program. `If Congress shall lay down by legislative act  an intelligible principle . . . such legislative action is not  a forbidden delegation of legislative power.'\" Lichter v.  United States, 334 U.S. 742, 785, 68 S.Ct. 1294, 1316, 92 L.Ed.  1694, 1726 (1948).\n\nWhile it is essential to the success of arbitration that arbitrators deal with each case on its own merits, it is not necessary — or constitutionally possible here — that the legislative body give the arbitrators uncontrolled discretionary power.\n\nWe do not agree that the \"primary standard\" or \"intelligible principle\" which some of the federal cases have found sufficient in their situations would necessarily satisfy our own constitutional demand for standards in this case. However, we do not believe that even the \"primary standard\" or \"intelligible principle\" of which Lichter v. United States, supra and Mr. Justice Wernick's opinion speak — can be found here from the totality of legislative expression in the several aspects which are discussed in his opinion and on which we wish to comment with full respect to the points of view of our disagreeing colleagues.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nAs Mr. Justice Wernick's opinion indicates, in some jurisdictions it has been found that an Act's statement of policy furnishes sufficient guidance to assure that the individuals to whom the power has been delegated are not free to exercise unrestricted legislative authority according to their own discretions. Fairview Hospital Ass'n. v. Public Building Service and Hospital and Institutional Employees Union Local No. 113, 241 Minn. 523, 64 N.W.2d 16 (1954). This Act's stated purpose is to promote improvement in the relationship between the public employer and employee by providing adequate machinery for the employers and representatives of the employees to use in settlement of their disagreements. It is the Legislature's aspiration that the availability and use of this new collective bargaining machinery will result in a more harmonious employer-employee relationship but this purpose can hardly be considered as a meaningful criterion for the arbitrators; determination, issue by issue, of the individual subject matters before them.\n\nIn Kovak v. Licensing Board, City of Waterville, 157 Me. 411, 173 A.2d 554 (1961) we ourselves found to be constitutional a statute which authorized a munucipal licensing board to revoke a victualer's license when it is \"satisfied that the licensee is unfit to hold the license\". The Court found that the need for adequate criteria to guide the Board in such determinations — although absent in the section which authorized revocation — was found in several separate but related sections of the same chapter which mandated certain specific good conduct on the part of victualers. We are unable to discern any such related legislation here which supplies the need for standards which the Kovak Court recognized to be required.\n\nWe agree that the Legislature contemplated that these private individuals to whom it has given such authority over the functioning of public education would act fairly and reasonably. Unquestionably, a similar expectation is implicit in every statute which delegates power to administrative bodies. The unspoken demand for integrity is, of course, a standard for the arbitrators' conduct, but it does not furnish the crucial criteria to guide the arbitrators as to what factors should be given consideration in their examination of the issues presented to them.\n\nWhile we share our disagreeing colleagues' expectations that when the issues reach the arbitrators they will have been sharply delineated by the preliminary procedures of collective bargaining — a probable contribution to the efficiency of the arbitration process — this cannot obviate the need for standards. The arbitrators are still left to act upon these issues with undirected and unlimited discretion.\n\nWe cannot agree with Mr. Justice Wernick's opinion that the Act's exclusion of educational policies from consideration by negotiators, fact finders and arbitrators — or its limiting the arbitrators' authority as to salaries, pensions and insurance to recommendations and fact finding — constitute an indication of legislative purpose which can be considered a criteria to guide the arbitrators in their determinations in areas outside the excluded portions. We cannot so construe it. The exclusion of educational policies, salaries, pensions and insurance from binding arbitration only defines the boundaries of the area in which the arbitrators may act with binding effect — to wit, the area of working conditions and hours — without indicating the factors the arbitrators should consider as entering into their decisions concerning working conditions and hours.\n\nWe have considered Mr. Justice Wernick's opinion's reference to the last paragraph in section 965(1) which reads:\n\n\"Whenever wages, rates of pay or any other matter requiring  appropriation of money by any municipality are included as a  matter of collective bargaining conducted pursuant to this  chapter, it is the obligation of the bargaining agent to serve  written notice of request for collective bargaining on the  public employer at least 120 days before the conclusion of the  current fiscal operating budget.\"\n\nWe construe this paragraph as requiring a timely caveat whenever a future bargaining agreement by the parties or a binding award by the arbitrators may necessitate an increased or additional appropriation so that the municipality may anticipate it in the next municipal budget. The language falls short of being a directive to the arbitrators that they are to give consideration to the municipality's ability to meet the cost of the award in view of its other obligations and responsibilities.\n\nWhile it is apparent that the draftsmen of the Act took care to omit from this legislation many elements which have given other courts their greatest concern, we consider that the absence from the Act of any standards to guide and limit the arbitrators invalidates the Act as far as its applicability to binding arbitration of labor disputes in the public school area is concerned.\n\nThere are many features of the bill the cumulative effect of which appear to us especially to demand that the Legislature include standards which will effectuate the carrying out of its purposes. The Act distinguishes between the arbitrators' authority as to disputes involving educational policy and those concerned with working conditions but neither educational policy nor working conditions is defined by the Act. Also, the Act provides the arbitrators with no criteria for dealing with the likely situations where a single decision may bear with substantial importance upon both educational policies and working conditions. The arbitrators are not public officials and are not required to answer to the electorate or to the elected representatives of the electorate. They are completely free to determine issues by the application of their own political, social or economic theories. They will not be members of a permanent panel but will be chosen on a case by case basis which militates against an accumulation of experience and their development of standards. The Act specifies that the third arbitrator shall be \"neutral\" and strongly suggests a legislative intention that the two arbitrators chosen by the parties may be partisan advocates, following a practice prevailing in labor arbitration in the private sector. Thus the discretion being delegated may, in fact, be reposed in one private individual who may not even be a resident of the State.\n\nThis Act — unlike those in some other states — does not provide that the arbitrators' award is to be subject to existing statutory restrictions in the educational field, to existing or future appropriations or to proper orders of the Commissioner of Education. Although decisions in this area of disputes can have serious impacts upon the public interest in general, the quality of education and a municipality's ability to meet its other serious responsibilities, the arbitrators are left completely free to ignore these factors and to use whatever criteria they choose for their final determinations.\n\nAlthough provision is made for review by the Superior Court on questions of law, the arbitration panels' determinations as to questions of fact are final, in the absence of fraud. There is no requirement that the arbitrators make findings of fact, even as to matters in which their determinations are final and binding, which seriously limits the ability of the courts on appeal to protect against unbridled discretion.\n\nFinally, the arbitrators — like those discussed by Chief Justice Vanderbilt in Traffic Telephone Workers' Federation of New Jersey — would be putting into operation a pattern of social conduct which is entirely new to us.\n\nWe do not suggest that all of these elements must — or can profitably — be the subject of specific standards. Rather, we say that, in total, they emphasize the need for standards here. The Constitution has specifically reposed in the Legislature full responsibility over the conduct of public school education for the \"benefit of the people of this state\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and the Legislature has chosen to delegate a final responsibility in the important area of hours and working conditions. It has done so, however, without any clear indication as to what factors the arbitrators must consider in making these final decisions.\n\nWe hold that the Legislature's attempt to delegate to arbitrators binding determination of labor disputes between teachers and their public employers is void for lack of adequate standards.\n\nWe are satisfied that the provisions of the Act concerning arbitration are severable from the remainder of the statute and we find no constitutional infirmity in the Legislature's imposing upon teachers and their public employers the other obligations of collective bargaining found in the Act.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe Court being equally divided on the question of constitutionality, but being in unanimous agreement that the Arbitrators exceeded their statutory jurisdiction in their determination as to \"Class size\", \"Length of a Teacher's Working Day\" and \"Scheduling and Length of School Vacations and of the Commencement of the School Year\", the cases are ordered remanded to the Superior Court for action:\n\n1) In Docket No. 2688-71, City of Biddeford by its Board of Education v. Biddeford Teachers Association, et als., the decision of the arbitration panel of November 17, 1971 is to be modified by striking therefrom the determinations concerning \"Class size\", \"Length of a Teacher's Working Day\" and \"Scheduling and Length of School Vacations and of the Commencement of the School Year\".\n\nAfter such modification, the Superior Court should enter\n\nJudgment affirming the decision of the arbitration panel, as modified.\n\n2) In Docket No. 2690-71, Biddeford Teachers Association v. Board of Education of the City of Biddeford, et als., the case, as remanded, is to await the entry of judgment in case No. 2688-71. Thereafter, the Superior Court shall proceed in such manner as the subsequent conduct of the parties might make necessary or appropriate.\n\nI concur in the conclusions reached in Part One of the opinion of Mr. Justice Weatherbee.\n\nI disagree, however, with Part Two and its conclusion that the statutory provisions for binding arbitration must be nullified as an unconstitutional delegation of powers legislative in nature. My opinion is that the legislature has constitutionally utilized arbitration, and judicial interference with the legislative program is unwarranted.\n\n\"Unconstitutional delegation of legislative powers\" connotes that in a given instance the legislature has transferred a portion of its legislative power to another body in contravention of principles derived from constitutional vesting and separation of the three polar categories of sovereign power: legislative, judicial and executive.\n\nFor one hundred fifty years the \"unconstitutional delegation\" doctrine has been developed largely in relation to the sovereign's exercise of \"police power\" externally to control and regulate private personal and property rights.\n\nIn the instant statute sovereignty appears in a different role. Here, its concerns are directed fundamentally inward to meet internal problems arising from governmental functioning as an \"employer\" of \"employees\" in the \"business\" of providing essential services to the public.\n\nIn this domain there is a paucity of judicial authority on \"delegation\" questions. Since the decision of the instant case thus entails a large measure of pioneering, analysis should not assume that principles of \"delegation\" formulated relative to \"police power\" problems are automatically applicable at all, or with full scope, to the present issues. Inquiry should probe deeply to assess whether, and the extent to which, \"delegation\" principles affecting the exercise of the police powers of government should be transposed into the separate realm of sovereignty's internal \"employer-employee\" relationships in the rendering of essential public services, both as a general matter and as specifically crystallized in the particular statutory program now under scrutiny.\n\nI\n\nBefore American life had been substantially affected by the political, social and economic complexities of the industrial revolution, the constitutional vesting of the \"law-making\" power of sovereignty in a specific body, designated the \"legislature\", was conceived to reflect, literally, the dogma of John Locke:\n\n\"The Legislature neither must nor can transfer the power of  making laws to anybody else, or pass it but where the people  have.\"\n\nSoon, the burgeoning needs and exigencies of the latter part of the nineteenth century caused enormous extension of the scope of governmental police power regulation and necessitated that broad discretionary authority be granted to bodies other than the legislature. In the face of this development, adherence to the Locke dogma created a dilemma which, at first, the courts sought to resolve by giving lip-service to the dogma while escaping its practical strictures with the rationalization that to delegate to another body only a power to \"fill in details\" or \"find facts\" is not really to transfer \"legislative\" power. Illustrative of this earlier approach are cases such as Locke's Appeal, 72 Pa. 491 (1873); Field v. Clark, 143 U.S. 649, 12 S.Ct. 495, 36 L.Ed. 294 (1892); and in Maine, State v. Butler, 105 Me. 91, 73 A. 560 (1909).\n\nAs twentieth century pressures became heavier, the courts were ultimately driven to the recognition that under the fiction that only \"facts were being found\" or \"details being filled in\", they had been sustaining, with increasing frequency, expansive grants of power unquestionably \"legislative\" in character.\n\nIt became apparent that fiction must be discarded to avoid confusion and error. A new approach was necessary by which twentieth century needs could be met realistically but yet consistently with preservation of the essential spirit of the constitutional vesting and separation of the polar categories of sovereign power.\n\nInterestingly, in the mid-nineteenth century a State Court, with remarkably prophetic insight, had provided the root concept for such undertaking. In People v. Reynolds, 10 Ill. 1 (1848) the Illinois Court had observed:\n\n\". . . few will be found to insist, that whatever the  legislature may do, it shall do, or else it shall go undone. .  . . it may still authorize others to do those things which it  might properly, yet can not understandingly or advantageously  do itself. Without this power legislation would become  oppressive, and . . . imbecile. . . . but in doing this it [the  legislature] does not divest itself of any of its original  powers. It still possesses all the authority it ever had.\" (pp.  13, 20 and 21)\n\nSeventy years later, the message, more frequently heard, was amplified — and by another State Court. In State v. Whitman, 196 Wis. 472, 220 N.W. 929 (1928) the Wisconsin Court perceived that (1) necessity had required \"delegation\", and \"cross-delegation\", of the powers of government; (2) to accomplish it the courts, by \"one pretext or another\", had been upholding extensive delegations of legislative power; (3) avoidance of \"confusion and error\", and a \"logical and symmetrical development\" of administrative law, demanded that a new approach be adopted, abandoning the pretense of \"finding facts\" and filling in \"details\" and acknowledging that legislative power, as such, is constitutionally permissible of delegation under appropriate limitations to check against abuse — the most potent of which is the legislature's retention of power to revise or withdraw the power granted; (4) if a prospective legislative \"standard\" is to be used as a device to confine administrative authority, the subject-matter under regulation will often allow as feasible only a generalized \"standard\"; and (5) the \"standard\" need not be expressly stated but may be implicit in the overall statutory context.[fn1A]\n\nIn the development of its rationale Whitman relied substantially upon a course being chartered almost simultaneously by the Supreme Court of the United States in Hampton \u0026 Co. v. United States, 276 U.S. 394, 48 S.Ct. 348, 72 L.Ed. 624 (1928) — a decision itself bringing to fruition the seeds of a newer federal approach to the problems of \"delegation\" germinated in 1924 in Mahler v. Eby, 264 U.S. 32, 40, 44 S.Ct. 283, 68 L.Ed. 549 (1924).\n\nIn Mahler v. Eby the Supreme Court of the United States, taking its clues from leads in Buttfield v. Stranaham, 192 U.S. 470, 24 S.Ct. 349, 48 L.Ed. 525 (1904), had begun to talk explicitly of the constitutional permissibility of delegation of powers avowedly \"legislative\" so long as consent of the governed is channeled through the legislature to be a continuing indirect source of control over the actions of a body not immediately responsible to the people. The mechanism conceived to serve this \"conduit\" function was the prospective prescription by the legislature, as the people's delegate, of a \"primary standard\" to confine the legislature's delegate.\n\nHampton \u0026 Co. v. United States developed this into the full-blown principle:\n\n\"If congress shall lay down by legislative act an intelligible  principle to which the person or body authorized to . . . [act]  is directed to conform, such legislative action is not a  forbidden delegation of legislative power.\" (276 U.S. p. 409,  48 S.Ct. p. 352) (emphasis supplied)\n\nThus, the Court in Hampton \u0026 Co. recognized that the transfer of legislative power will not, as such, produce constitutional infirmity; it is rather the manner of the transfer — whether it places unbridled legislative authority in a body not responsible to the electorate and thus precipitates the potential for an absolutism of power (the primary evil apprehended by Montesquieu and Locke to require the protections embodied in the concepts of \"separation\" and \"checks and balances).\"\n\nIn Panama Refining Co. v. Ryan, 293 U.S. 388, 55 S.Ct. 241, 79 L.Ed. 446 (1935) and Schechter Poultry Corp. v. United States, 295 U.S. 495, 55 S.Ct. 837, 79 L.Ed. 1570 (1935), and even though these decisions represented the solitary instances in which the Supreme Court of the United States had struck down congressional \"delegation\", the Court reaffirmed the \"intelligible principle\" approach — with the further development that the \"principle\" need not be expressly stated by the legislature but might be regarded as legislatively implied.[fn2A]\n\nSubsequent evaluations in the federal Courts saw the most general of \"standards\" relied upon to sustain the constitutionality of large delegations of legislative power. As shown by Yakus v. United States, 321 U.S. 414, 64 S.Ct. 660, 88 L.Ed. 834 (1944) and American Power \u0026 Light Company v. Securities and Exchange Commission, 329 U.S. 90, 67 S.Ct. 133, 91 L.Ed. 103 (1946), the focus was upon whether the legislature had imposed, explicitly or implicitly, a check on absolutism by an \"intelligible principle\" by which the delegated power\n\n\"is . . . canalized within banks that keep it from  overflowing.\" Cardozo, J., concurring, in Schechter Poultry  Corp. v. United States, 295 U.S. 495, 551, 55 S.Ct. 837, 852,  79 L.Ed. 1570 (1935)\n\nTo the objection raised in American Power \u0026 Light Company that Congress had, in effect, because of vagueness and generality, allowed \"unlimited whim\" and \"unfettered discretion\" to the Securities and Exchange Commission\n\n\"to decide whose property shall be taken or destroyed and to  what extent\" (329 U.S. p. 104, 67 S.Ct. p. 142),\n\nthe Supreme Court of the United States answered that (1) in other contexts \"standards\" as broad and indefinite as \"public interest,\" \"just and reasonable rates,\" \"unfair methods of competition\" or even \"relevant factors\" had been approved as adequate limitations upon the exercise of arbitrary power (p. 105, 67 S.Ct. 133); (2) the judicial approval accorded these broad standards reflected a \"necessity\", imposed by complex economic and social problems, which\n\n\". . . fixes [that] . . . it . . . becomes constitutionally  sufficient if Congress clearly delineates the general policy,  the . . . agency which is to apply it, and the boundaries of  this delegated authority\" (p. 105, 67 S.Ct. p. 142)\n\n— the protection of private rights being left, primarily, to judicial review\n\n\"to test the application of the policy in the light of these  legislative declarations\" (p. 105, 67 S.Ct. p. 142);\n\nand (3) permissible sources to derive and provide meaning for the concepts interpretable as the boundaries are\n\n\"the purpose of the Act, its factual background and the  statutory context.\" (p. 104, 67 S.Ct. p. 142)\n\nIn the state courts a similar trend was plainly discernible, notwithstanding that state courts tended to be more prone than the federal to nullify delegations — often revealing strange internal inconsistencies within a given body of decisions.[fn3A]\n\nIn Maine, illustrative is the contrast between Butler, supra, in 1909 and the decision in 1961 in Kovack v. City of Waterville, 157 Me. 411, 173 A.2d 554 (1961). In Kovack, following strong intimations already contained in McGary et al v. Barrows et al., 156 Me. 250, 163 A.2d 747 (1960) (which dealt specifically with \"delegation\" in the field of education), this Court basically discarded its earlier conception that law-making powers and authority may not at all be delegated by the legislature to another body and that administrative tribunals may be permitted only to \"find facts\" or \"fill in details.\" Frankly acknowledging that:\n\n\"There are many instances . . . where the Legislature has  delegated to an administrative body authority to use its  discretion and judgment\" (157 Me. p. 417, 173 A.2d p. 557),\n\nthis Court concluded that it must be held justifiable in principle because\n\n\"[a]dministrative bodies are functionally necessary in the  process of government\",\n\nand\n\n\"There must be that delegation of power sufficient to the end  that a proper, . . . administration may occur.\" (p. 416, 173  A.2d p. 556)\n\nThe approach of Kovack was to test the validity of the delegation of legislative power in the terms that (1)\n\n\"it is important that there exists in the statute adequate  procedural safeguards\",\n\nand (2) the\n\n\"Legislature sets the standard.\" (p. 416, 173 A.2d p. 557)\n\nCf. also: Smith v. Speers, Me., 253 A.2d 701 (1969) dealing with delegation of the power of eminent domain.\n\nIn a dissenting opinion in Arizona v. California, 373 U.S. 546, 83 S.Ct. 1468, 10 L.Ed.2d 542 (1963) Justice Harlan, joined by Justices Douglas and Stewart, incisively summarized the rationale by which the \"intelligible principle\", or \"primary standard\", mechanism for the delegation of substantial legislative power to a body not directly responsible to the electorate may be deemed to fulfill the essential spirit of the constitutional provisions concerning the vesting and separation of the polar powers of sovereignty to achieve \"checks and balances.\" Justice Harlan said:\n\n\"The principle that authority granted by the legislature must  be limited by adequate standards serves two primary functions  vital to preserving the separation of powers required by the  Constitution. First, it insures that the fundamental policy  decisions in our society will be made . . . by the body  immediately responsible to the people. Second, it prevents  judicial review from becoming merely an exercise at large by  providing the courts with some measure against which to judge  the official action that has been challenged.\" (p. 626, 83  S.Ct. p. 1511)\n\nIn a leading decision, Ward v. Scott, 11 N.J. 117, 93 A.2d 385 (1952), the Supreme Court of New Jersey (likewise conceiving the same two constitutional objectives to be fulfilled by a prospectively prescribed legislative \"primary standard\" to control broad discretion reposed in bodies not immediately answerable to the people) offered the following specifications for a sound \"standards\" approach in the exercise of the police power.\n\n(1)  \"It is settled that the Legislature may not vest unbridled       or arbitrary power in the administrative agency . . .\" (p.       388);\n\n(2)  hence, the legislature must give the administrative agency       \"a reasonably adequate standard to guide it\" (p. 388);\n\n(3)  \". . . the exigencies of modern government have       increasingly dictated the use of general rather than       minutely detailed standards in regulatory enactments under       the police power\" (p. 388);\n\n(4) expansive latitude for discretion and judgment under a generalized standard is the more readily tolerable, in police power regulation of private rights, when procedural safeguards are afforded as an additional check upon the danger of unwarranted or arbitrary administrative action (p. 389); and\n\n(5)  \"it is elementary that we . . . must examine the entire       act in the light of its surroundings and objectives. . . .       Nor are we restricted to the ascertainment of standards in       express terms if they may be reasonably implied from the       entire act. . . . `. . . That which is clearly implied is       as much a part of the law as that which is expressed.'\"       (p. 387)\n\nII\n\nIn the present situation, then, attention must be concentrated upon the extent to which the above delineated general, and specific, concepts (as developed in the realm of the police power control and regulation of private rights) have reasonable applicability to government when it is acting as an \"employer\" of \"employees\" engaged in the \"business\" of providing essential services to the public — this being an area in which the police power regulation of private rights is not an inherently prominent factor.\n\nInitially, assessment must be made of whether the powers here granted to \"ad hoc\" arbitrators operate in a domain so attenuated in its relationship to \"law-making\" activity — and, therefore, outside areas likely to precipitate the kinds of value judgments which demand channeling the consent of the governed through the legislature as a continuingly operative control — that insistence upon a \"primary standard\" or \"intelligible principle\" becomes realistically unnecessary.\n\nAs clarified in Part One of the opinion of Mr. Justice Weatherbee, when the focus is strictly upon the internalities of sovereignty separately and independently of extrapolations affecting the rights of the general citizenry, the sovereign (acting through the legislature) is free to adopt a policy by which it gives an advance consent that its own \"employer-employee\" disputes be resolved by the binding determinations of persons serving only \"ad hoc\"; and who, precisely for this reason that they are not continuing governmental officials, are capable of being regarded by the employees of sovereignty as free of its direct, or indirect, pressures or controls.\n\nTo the extent, therefore, that sovereignty, as one party, and its \"employees\" as the other party, both freely consent to submit to \"ad hoc\" binding arbitration areas of controversy lacking significant spill-over into other spheres in which it is thought necessary to preserve the consent of the governed as an indirect monitor of the exercise of legislative power by a body not elected by the people, an approach which demands a legislatively prescribed \"primary standard\" might be dispensed with — reliance to be placed, instead, upon a totality of procedural safeguards and adequate techniques of judicial review to prevent irresponsible, arbitrary or capricious determinations.\n\nIn the present situation, however, and even though we are in the area of internal governmental employer-employee relationships, factors are present which could develop potential constitutional infirmities were we to forego reliance upon the combination of a before-the-fact legislative \"primary standard\", or \"intelligible principle\",\n\nand adequate controls against irresponsible arbitrary action through procedural safeguards and opportunity for effective judicial review.\n\nFirst, notwithstanding that sovereignty has here provided its own advance consent to binding arbitration should the teacher employees request it, sovereignty has not made choice by the teachers the sole determinant. 26 M.R.S.A. § 965, subd. 4 provides that \"either party\" may bring about \"binding arbitration\"; and if arbitration is requested by the public employer, a refusal of the teachers to participate is an unfair labor practice under the combined effects of Sections 964 and 965.\n\nBecause the statute empowers the public employer to force binding arbitration against the will of the teachers, it is, in this respect, a \"police power\" law-making control at least of the teachers; and this involvement with the exercise of police power might generate need for a decision as to whether unconstitutionality results from the absence of a legislatively prescribed \"intelligible principle\", or \"primary standard\", to allow a channeling of the consent of the governed and also to enable judicial review to be more effective in detecting and exposing irresponsible arbitrational conduct.\n\nFurther, there are carry-over effects upon the citizenry generally.\n\nIt may be true that (1) in the statutory scheme before us \"salaries, pensions and insurance\", as well as \"educational policies\", have been removed from the scope of binding arbitration; and (2) thereby, the legislature has taken from the determinative control of the arbitrators areas having the most direct and substantial impact upon the interests of the citizenry not only directly in the field of education but also in the quantity and quality of all other essential public services; and (3) hence, it might be thought that the consent of the governed, as expressed through policy determinations made by the persons whom they elect as their representatives, need not enter as a significant factor to require a prospective legislative \"intelligible principle\" or \"primary standard\" to afford a pipeline of control from the people to the arbitrators.\n\nNevertheless, even as thus carefully limited, the area of \"working conditions\" which is subject to binding arbitration can involve sufficient overlap with the sphere of \"educational policies\" (see infra, pp. 413, 414) to precipitate for decision questions as to the statute's constitutionality should the consent of the governed not be transmitted to the arbitrators by a \"primary standard\" or \"intelligible principle\" prospectively prescribed by the legislature. In addition, insofar as \"working conditions\" (other than \"salaries, pensions and insurance\") can entail financial costs, they generate overtones which beat upon general fiscal policy and which, therefore, affect the personal and property rights of the citizenry (1) in the availability, as well as the quantity and quality, of all essential public services and (2) in the taxes which the citizenry will be called upon to pay to provide the services.\n\nNotwithstanding, therefore, that binding arbitration is here restricted to a narrowed domain encompassing only those \"working conditions\" from which matters of \"educational policies\" as well as \"salaries, pensions and insurance\" have been excluded, there yet remains a sufficient connection with \"law-making\", at least in the sense of important value choices, to induce search for a legislatively prescribed \"primary standard\" or \"intelligible principle\" through which is effected, at least indirectly, a control by the electorate as the ultimate source of fundamental value judgments — and the presence of which will avoid need for a decision concerning potential issues of constitutionality which might be thought to arise were such intelligible principle lacking.[fn4A]\n\nIn the assessment of whether the legislature has provided such \"primary standard\" or \"intelligible principle\" the criteria for judgment, as above delineated, are that (1) the \"standard\" or \"intelligible principle\" need not be expressly stated by the legislature but may be found implicit in the totality of the statutory provisions reasonably construed in relation to surroundings and objectives and (2) large latitude for exercise of discretion and judgment by the arbitrators under a \"standard\" highly generalized becomes the more readily tolerable (a) when the nature of the subject-matter makes such breadth and generality necessary or desirable and (b) ample procedural safeguards are afforded as additional checks to narrow the likelihood of otherwise undetectable irresponsibility, arbitrariness or invidious discrimination.\n\nAt the outset of the \"Municipal Public Employees Labor Relations Law\", the legislature expressly declares the fundamental public policy upon which it has settled. In purpose the policy is \"to promote the improvement of the relationship between public employers and their employees.\" As pragmatic implementation of the purpose, the policy is to achieve it by the specific \"uniform\" processes that (1) public employees shall have full rights \"to join labor organizations of their own choosing\" and (2) such labor organizations are \"legally recognized\" as the representatives of the employees to engage in mandatory \"collective bargaining\" ultimately to achieve \"terms and conditions of employment\" to be embodied in contracts. (Section 961) The details of implementation are elaborated in various other provisions of the statute proclaiming the protection of the right of the public employees to join labor organizations (Section 963), defining unfair labor practices (Section 964) and delineating with the greatest of care the details comprehended within the generalized concept of the \"obligation . . . to bargain collectively.\" (Section 965)\n\nMost importantly, the legislature unequivocally clarifies that the obligation to bargain collectively embraces, specially, that the parties (1) submit in good faith to binding arbitration, as provided in Section 965, subd. 4, concerning the area of \"working conditions\" — exclusive of \"salaries, pensions and insurance\" and, additionally, specifically as to teachers, \"educational policies\" (Section 965, subd. 1, par. C) — and (2)\n\n\". . . enter an agreement or take . . . other action . . .  appropriate to carry out and effectuate such binding  determinations\"\n\nof the arbitrators. (Section 965, subd. 4)\n\nThus, the legislature's policy is clearly and expressly that there be an improvement of the relationship between public employers and their public employees by the mechanism that disputes unresolved by negotiations between the parties shall not continue to fester but shall be forced, at least in part, toward termination, upon the request of either party, by the binding arbitration of such \"working conditions\" as are not \"salaries, pensions and insurance\" or significant aspects of \"educational policies.\" The binding arbitration is to follow after the parties themselves have established the framework within which the controversy is confined not only (1) by virtue of their discharge of their obligation to \"confer and negotiate in good faith\" but also (2) through the highly probable, if not mandated,[fn5A] resort to fact-findings and recommendations developed by an independent panel.\n\nWith arbitrational authority placed within these explicitly stated contours, the omission of the statute to delineate additional express criteria by which the arbitrators are to make their selections among \"working conditions\" creates no fatal deficiency. By what is said expressly, conjoined with what may be ascertained implicitly, the statute has prescribed an adequate \"standard\" and \"intelligible principle\" to contain, and guide, the arbitrators and to allow effective scope to judicial review as a further check upon arbitrariness.\n\nThe statute plainly contemplates that the arbitrators shall act reasonably and fairly to resolve the dispute in terms of the respective positions which have been (1) developed by the parties in negotiations, including independent fact-finding, (2) represented by the parties in the issues presented to the arbitrators for decision, and (3) further supported by evidence taken out during the hearing — the statute making abundantly clear that the entire hearing procedure and the statutory specifications regarding the taking of evidence are calculated to achieve relevance \"to the issues represented to . . . [the arbitrators] for determination.\" (Section 965, subd. 4)\n\nUnless we would destroy all significance in the expressed legislative policy that binding arbitration is an implementing method \"to promote the improvement of the relationship between public employers and their employees\", it must be held an implicit minimal injunction of the statute that the arbitrators act reasonably and fairly to effect accommodation within the bounds developed by the parties and the positions asserted by them. Surely, unless arbitrators act responsibly and with fairness and reasonableness to accommodate the interests of the parties, crystallized in the issues presented for determination and as buttressed by the positions asserted by the parties concerning the issues, and as the parties will themselves have sharpened them through the negotiating process and fact-finding, the arbitrators would frustrate, rather than achieve, the promotion of \"the improvement of the relationship between public employers and . . . employees.\"\n\nThe foregoing analysis could suffice, without more, to sustain the binding arbitration provisions here involved. The legislatively prescribed \"standard\" or \"intelligible principle\" — that the arbitrators shall act with reasonableness and fairness to resolve the issues in a manner tending to promote improvement of relationships — is adequate. The conclusion is a fortiori when we observe, further, that there are ample procedural safeguards concerning the conduct of the hearing and provisions for judicial review by which the Court\n\n\"may, . . . affirm, reverse or modify any . . . binding  determination or decision based upon an erroneous ruling or  finding of law.\" (Section 972)\n\nPrecisely this generalized justification has been approved in an approach taken by the Pennsylvania Supreme Court — and as to a scope of subject-matter including \"salaries, pensions and insurance\" and thus having far more direct and extensive impact upon the general citizenry (in terms of their potential tax burdens and the order of the priorities governmental public service provided them) than we presently confront. In Harney v. Russo, 435 Pa. 183, 255 A.2d 560 (1969), and independently of the consideration that constitutional amendment had made a \"standards\" analysis unnecessary, the Pennsylvania Court chose to deal with the \"delegation\" issue before it on an assumption that adequate limiting standards were necessary to avoid an unconstitutional delegation of legislative power. Sustaining as sufficient the standard that the arbitrators shall act reasonably to accomplish labor peace between the public employer and its employees in the rendering of essential public services, the Court said:\n\n\"To require to a more explicit statement of legislative policy  in a statute calling for labor arbitration would be sheer  folly. The great advantage of arbitration is, after all, the  ability of the arbitrators to deal with each case on its own  merits in order to arrive at a compromise which is fair to both  parties. The arbitrators' services are particularly valuable  where, as the legislative scheme here requires,\n\nthe parties have been unable to reach an agreement through  collective bargaining. Certainly that is what the Legislature  envisioned in its attempt to insure labor peace in this  critical public area, and this is adequate . . . .\" (p. 563)\n\nAs to the statute presently before us, we may observe that it goes further to furnish, as reasonably implicit in its overall context, additional subsidiary \"intelligible principles\" to guide the arbitrators in the discharge of their functions as well as the courts in exercising judicial review.\n\nIn the total statutory context the limitations upon the jurisdiction of the arbitrators to make binding determinations elucidate not only the drawing of a jurisdictional line but also \"intelligible principles\" to guide the exercise of judgmental selectivity within the areas jurisdictionally covered.\n\nIt is to be emphasized that the arbitrators are not denied all authority to deal with \"salaries, pensions and insurance.\" They are responsible to \"recommend terms of settlement\", and they \"may make findings of fact\" thereon, \"such recommendations and findings . . . [to] be advisory only.\" There is thus crystallized not merely an express differentiation of function but also an implicit message as to the reason for the differentiation. Obviously because they have direct and enormous impact, in terms of costs, not only upon the ordering of priorities within the particular sphere of public services affected by the controversy before the arbitrators but also upon the public employer's general fiscal budgeting and appropriations for all public services, and the tax burdens consequently imposed upon the citizenry, \"salaries, pensions and insurance\" are withheld from binding determination by persons who are not directly responsible to the electorate.\n\nSince the legislature has thus manifested an overriding concern with the impact of monetary costs upon the ordering of priorities not only within one sphere of essential public services but as to all public services which the public employer must provide, as well as upon the ultimate burden of taxation, this legislative concern transposes to become one factor which the arbitrators must consider in arriving at determinative decisions concerning any \"working conditions\" which involve monetary costs.\n\nLegislative intention that the arbitrators take into account the impact of the money costs of those \"working conditions\" which are to be settled upon for contractual incorporation is further manifested by the express legislative mandate that not only as to \"wages\" or \"rates of pay\" but also \"any other matter requiring appropriation of money by any municipality\" (emphasis supplied), it is a pre-condition of the subject-matter's being eligible for collective bargaining that\n\n\"the bargaining agent . . . serve written notice of request for  collective bargaining on the public employer at least 120 days  before the conclusion of the current fiscal operating budget.\"  (Section 965, subd. 1)\n\nSimilarly, the exclusion of \"educational policies\" from the jurisdictional scope of binding arbitration, in the case of teachers, operates with carry-over effect to provide additional subsidiary \"intelligible principles\" to guide discretional selectivity by the arbitrators within the domain of the \"working conditions\" which may be bindingly determined.\n\nThe concepts of \"working conditions\" and \"educational policies\" yield a significantly clear core of meaning when they are regarded as the opposite poles of a continuum toward the center of which there will be large degrees of intermixture. Whether a datum is analytically classifiable as \"working conditions\" rather than \"educational policy\", or vice-versa, will depend, therefore, on (1) the decision made as to the legislature's intended direction of emphasis and (2) recognition that notwithstanding the ultimate theoretical classification decided upon, the substantive reality retains those features of the opposed classification which inhered in it as a fact before the theoretical classification process was undertaken.\n\nHence, as a glass containing water to the halfway point may be said to be \"half empty\" or \"half full\", dependent upon the direction of emphasis and, in addition, no matter what the theoretical designation chosen, the reality continues to remain both \"half full\" and \"half empty\", so will the appropriate classification of a given subject-matter as \"working conditions\" or \"educational policy\" be controlled by the presumed legislative emphasis; and the substantive reality after classification will retain in fact the features of both categories.\n\nThus, the process by which the arbitrators decide their jurisdiction to make binding determinations simultaneously provides them with an \"intelligible principle\" to guide their selection (from among the totality of \"working conditions\" subject to their jurisdiction) of those which shall be contractually incorporated. The arbitrators will be obliged to bear in mind that (1) the legislature deemed \"educational policies\" to involve value choices so fundamental that binding decisions concerning them should be made essentially unilaterally and by persons directly responsible to the people and (2) for this reason, even though the arbitrators might reasonably believe a concrete item to embody a sufficient measure of the features of \"working conditions\" to overbalance an admixture of \"educational policy\" — thereby warranting a conclusion that the subject-matter is to be classified as \"working conditions\" and, as such, subject to binding arbitrational determinations by them — the arbitrators must acknowledge the continuing importance of such generalized interests of the citizenry in the overall domain of education as might be relevantly in play. The arbitrators must balance the impacts of such \"educational policy\" overlays as inhere in fact (even though they might not have been sufficient to require that the subject-matter be classified as \"educational policies\" thereby to be totally excluded from collective bargaining and binding arbitration) against the weight of the \"working conditions\" interests of the teachers (e.g., their comfort and their ability to perform and work with efficiency, effectiveness, enjoyment and satisfaction). Into this assessment will enter, also, the consideration that arbitration is offered, policy-wise, as a partial substitute for the denial to the teachers of a right to strike and, hence, counterbalancing evaluation must be made in arbitration of what the teachers might be capable of winning were they allowed resort to the economic force of a right to strike.\n\nIn light of the foregoing discussion disclosing the existence of \"standards\" or \"intelligible principles\" by which, expressly and implicitly, the authority of the arbitrators is legislatively contained, a point cogently made by Professor Louis L. Jaffe and based upon the premise that\n\n\"Delegation of power to administration is the dynamo of the  modern social service state\" (p. 85)\n\nmust be stressed.\n\n\"If, . . ., the legislature has seen fit to create an organism  for the transaction of public business, its validity should be  sustained if one among competing logical implications  reasonably supports it. At such points the theory of separation  is logically too infirm to condemn any sensible or covenient  arrangement. We should in sum keep in mind that the great end  of the theory is, by dispersing in some measure the centers of  authority, to prevent absolutism.\" Jaffe, Judicial Control of  Administrative Action (p. 32)\n\nThus, in the final analysis the potency of the presumption favoring constitutionality of legislative action becomes determinative. As this Court stressed in Crommett et al v. City of Portland, 150 Me. 217,\n\n107 A.2d 841 (1954) quoting Laughlin v. City of Portland, 111 Me. 486, 90 A. 318 (1914):\n\n\"`The Court is bound to assume that, in the passage of any law,  the Legislature acted with full knowledge of all constitutional  restrictions and intelligently, honestly and discriminatingly  decided that they were acting within their constitutional  limits and powers. That determination is not to be lightly set  aside. It is not enough that the court be of the opinion that  had the question been originally submitted to it for decision  it might have held the contrary view. The question has been  submitted in the first instance to the tribunal designated by  the Constitution, the Legislature, and its decision is not to  be overturned by the court unless no room is left for rational  doubt. All honest and reasonable doubts are to be resolved in  favor of the constitutionality of the act. This healthy  doctrine is recognized as the settled policy of this court.\"  (150 Me. pp. 231, 232, 107 A.2d p. 850)\n\nThe attack upon the binding arbitration provisions of the Municipal Public Employees Labor Relations Law, as an unconstitutional delegation of legislative powers, fails. In this respect, the statute is constitutionally valid and must be judicially sustained.\n\nIII\n\nSince this opinion upholds the legislative scheme of binding arbitration, the additional issues are reached of asserted invalidity by virtue of improprieties in the conduct of the arbitration and claimed \"erroneous . . . finding[s] of law\" in the decision.\n\nIII-A\n\nThe conduct of the arbitration is attacked on two grounds: (1) bias and prejudice of the neutral arbitrator as manifested by language contained in the arbitration decision, and (2) disqualification of the person appointed to the arbitration panel by the Biddeford Teachers Association because he had been\n\n\". . . employed full time by the Maine Teachers Association  with which the Biddeford Teachers Association is affiliated and  participated as advisor . . . at various times in the  bargaining process prior to the arbitration.\"\n\nBoth grounds fail.\n\nNotwithstanding that the arbitration decision sharply rebukes counsel for the Biddeford Board of Education and persistently points up his lack of cooperation to assist in the accomplishment of the purposes of the proceeding, the totality of the record — including, specifically, the cogent point that all three arbitrators signed the arbitration decision — shows an absence of bias or prejudice attributable to the neutral arbitrator and likely to affect or in fact tainting his conscientiousness, impartiality and fairness.\n\nSimilarly, no fatal infirmity was caused either in the composition, or the decision, of the arbitration panel because the person designated by the Biddeford Teachers Association might be regarded as \"interested\" in the subject-matter or parties — as an employee of the Maine Teachers Association who had participated in the prior proceedings leading to the arbitration.\n\nThe statutory design for the selection of a tripartite arbitrational panel reveals that the legislature was unconcerned with the \"interests\", pecuniary or otherwise, of the two arbitrators to be designated by the parties. Only as to the third arbitrator — to be appointed by the two arbitrators selected by the parties or, upon their failure to agree, by the American Arbitration Association, — is there a statutory sepcification of qualifications. The third arbitrator shall be (1) \"neutral\" and (2)\n\n\". . . not, without the consent of both parties, . . . the same  person . . . selected as mediator pursuant to subsection 2 nor  any member of the fact-finding board selected pursuant to subsection 3.\"\n\nThis omission of the statute to state qualifications for the party-designated arbitrators, and the implications flowing negatively from the inclusion of restrictive qualifications for the third arbitrator, establish that the two party-appointed arbitrators are neither incompetent nor disqualified because they might have interests concerned with the subject-matter of the arbitration, or the parties, or which arise by virtue of participation in processes prior to arbitration.\n\nThe type of arbitration here involved — so-called \"interests\" arbitration to establish particular terms and conditions of a contract (as distinguished from \"grievance\" arbitration by which the terms of an existing contract are interpreted or applied) — suggests a sound policy reason for favoring, rather than prohibiting, the designation by the parties of \"interested\" arbitrators. In \"interests\" arbitration the function of the arbitrators is to make a contract for the parties which they were unable to make for themselves. It is, therefore, desirable that a degree of \"bargaining\" be part of the arbitration process itself — to assist in the ultimate settlement of contract terms and conditions. Such continuance of bargaining into the arbitrational process, including the reaching of accommodations usually necessary if the arbitration is to result in an improvement of the relationships between the contesting parties, is effectively achieved if the arbitrators appointed by the parties, precisely because they are allowed to have \"interests\", may function as \"advocates\" along the way to becoming, ultimately, decision-makers.\n\nIII-B\n\nParticular aspects of the arbitration decision attacked as \"erroneous . . . finding[s] of law\" must now be evaluated.\n\nIII-B-1\n\nClaim is made that the arbitrators' approval of the contractual clause:\n\n\"Except as otherwise specifically provided in this Agreement or  otherwise specifically agreed to in writing between the parties  . . .\",\n\nto operate as a limitation upon the further contractual language:\n\n\"the determination of educational policy, the operation and  management of the schools and the control, supervision and  direction of the certificated staff are vested exclusively in  the Board\",\n\ncontravenes independent statutory mandates.\n\nThe argument is that the reference to \"certificated staff\" comprehends all full-time principals, all substitute teachers and all part-time teachers (because of the provisions of 20 M.R.S.A. § 1751) — with the consequence that the above stated language of exception, it is said, effectively subjects full-time principals, substitute teachers and part-time teachers to the collective bargaining process as well as to coverage under a collective bargaining contract — in direct violation of the exclusions of 26 M.R.S.A. § 962, subd. 6.\n\nThe argument misconceives the purport of the excepting clause under consideration. In itself the clause is without operative effect to delineate an appropriate bargaining unit or to bring any persons within the coverage of the contract. Some separate and independent provision of the contract is requisite for such purpose. Were the present contract to contain such separate independent provision, subjecting to contractual coverage persons excluded by Section 962, subd. 6, it would be that separate and independent provision which should be attacked as invalid — not the excepting clause under scrutiny. Yet, the Biddeford Board of Education has pointed to no such separate independent contractual provision. It is, therefore, specious for the Board to assail the instant general language of exception, more particularly since this language performs the important, and valid, function of clarifying that various portions of the collective bargaining agreement — pursuant to changes of prior law introduced by the Municipal Public Employees Labor Relations Law — have limiting effect upon what (otherwise) would be unilaterally exclusive powers of superintending school boards or committees.\n\nAssault is made upon the arbitrators' approval of a contractual clause establishing a \"sick-leave bank.\" The \"sick-leave bank\" provision authorizes each teacher, who is independently contractually granted 20 days annual sick leave with unlimited accumulation, voluntarily to become a member of the \"bank\" by a contribution, from his own allowable sick leave days, of one day — the total of contributions to create a maximum of 180 \"banked\" days. Any member of the \"bank\" may draw from it to a maximum of 30 days in any one school year to cover absence because of illness for a period in excess of said teacher's own total \"sick-leave\" authorization. When the number of days in the \"bank\" is reduced to a minimum of 30, the \"bank\" members are to contribute another one day each to re-establish the 180 days \"bank\" maximum.\n\nContention is made that the arbitrational approval of such \"sick-leave bank\" is error of law because (1) 20 M.R.S.A. § 1951 must be interpreted to prohibit the pooling, or transfer, of sick-leave days[fn6A] and (2) in any event, the \"sick-leave bank\" is \"effectively\" a subject-matter relating to \"salary\" and, hence, must be held legally excluded from the scope of binding arbitration. Both points are without merit.\n\nBy its literal language 20 M.R.S.A. § 1951 aims only to guarantee minimal annual sick-leave and accumulativeness. Solely for this purpose, the statute speaks, as it must to establish a unit of reference for computation of the minimum, of a relationship to each individual teacher. There is, however, an absence of language having reasonable tendency to show legislative insistence upon the entirely different concept that sick-leave days must be personal to each teacher and personally utilized, thereby to prohibit pooling or transfer of sick-leave days. Neither does the manifest statutory purpose to mandate a minimum amount of sick-leave days and accumulations suggest that the statute is violated in spirit by recognition of the propriety of pooling or transfer — whether of the statutory minimum or of contractual allowances in excess of the statutory minimum.\n\nThe argument that in making binding determinations for contractual inclusion of a \"sick-leave bank\", the arbitrators exceeded their jurisdiction because the \"sick-leave bank\" is really a form of \"salary\" (concerning which arbitrators are authorized to act only advisorily) is likewise fallacious for error in its premise.\n\n\"Salary\", as ordinarily conceived, reasonably connotes an actual, affirmative regular payment of benefits (usually in monetary form) in exchange for work or services. Measured by such concept the \"sick-leave bank\" does not lend itself, reasonably, to a classification as \"salary.\"\n\nIndependently of the \"bank\" plan, the public employer is contractually committed to \"sick-leave\" to a theoretical maximum for each teacher of 20 days and unlimited accumulativeness. By the \"bank\" arrangement any individual teacher \"member\" derives opportunity for sick-leave enjoyments in excess of said teacher's otherwise allowable maximum. And it is true that such \"benefit\" to individual teachers is achieved through the device of limited pooling and transfer arrangements among teachers from the aggregate of sick-leave days authorized for all teachers without causing need that this aggregate maximum be exceeded.\n\nYet, it must be recognized that the aggregate maximum sick-leave days theoretically authorized for all teachers, in the absence of a sick-leave bank and should each teacher be permitted sick-leave days only on a personal basis without pooling and transferability, are not usually totally claimed in practice. Thus, without the \"sick-leave bank\" the public employer would ordinarily have the \"benefit\" that of the total sick-days authorized for all teachers a residual number remain unused. This \"benefit\" to the public employer is impaired by operation of the sick-leave \"bank\" insofar as transfers from the \"bank\" among individual teachers, even though within the aggregated maximum allowed for all teachers, tends to reduce the number of ultimately unclaimed sick-leave days; and this reduction is to be regarded as an economic \"cost\" to the public employer.\n\nTo categorize such \"economic benefit\" to any individual teacher and \"economic cost\" to the public employer as \"salary\" to the teacher \"paid\" by the public employer, however, would be to pervert the ordinary, plain meaning of \"salary.\" It would be to transform the ordinary connotations of \"salary\" — directness, regularity and actuality of payment — into that which is indirect, sporadic and fortuitous. No sound reason appears suggesting that the legislature intended that \"salary\", as used in the Municipal Public Employees Labor Relations Law, should carry such artificial and distorted meaning.\n\nThe provisions for \"sick-leave bank\" are thus not reasonably to be regarded as a form of \"salary.\" The arbitrators acted within their jurisdiction when they bindingly determined that the \"sick-leave bank\" should be incorporated as a term of the contract.\n\nIII-B-2\n\nAttacks upon other facets of the arbitrational decision are comprehended within the generalized claim that they are errors of law because the arbitrators exceeded their jurisdiction by purporting to make binding contractual determinations on specific matters of \"educational policies.\"\n\nSince the exclusionary concept of \"educational policies\", and its specific relationships to \"working conditions\" as the inclusionary statutory concept for collective bargaining and binding arbitration, will provide the foundation for subsequent analysis, a preliminary exposition of general guidelines will be helpful.\n\nAs already observed (ante at p. 413), \"educational policies\" and \"working conditions\" may be reasonably conceived as categories defining areas with essential purity at the extremities but with intermediate zones of substantial intermixture. Thus, in the controversies between teachers and their public employers (currently prevalent throughout the country), even if some of the concrete items in dispute may be readily classifiable at the pure extremes of \"policies\" or \"working conditions\", it is undeniable that by far the major portion lie in the intermediate areas with substantial intermixings.\n\nHow, then, is exclusionary and inclusionary classification under the Maine statute rationally to proceed? Again, as already discussed (ante at p. 413), the key is found in ascertainment of the legislatively prescribed direction of emphasis by which particular features of one classification must be considered legislatively subordinated to factors of the opposed classification.\n\nThe legislative language on its face sufficiently offers an answer for these purposes. The crucial words appear in Section 965, subd. 1, par. C. After first clarifying that the obligation to bargain includes the duty\n\n\"To confer and negotiate in good faith with respect to wages,  hours, working conditions and contract grievance arbitration .  . .\",\n\nthe statute immediately thereafter specifies, in particular relationship to the public employers of teachers, the exception that\n\n\"public employers of teachers shall meet and consult but not  negotiate with respect to educational policies . . . .\"\n\nHad the legislature seen fit to end its recitation at this point, it might be held a reasonable conclusion that the concept of \"educational policies\" was legislatively intended broadly to mandate continuance of the unilaterally exclusive powers of school boards to \"supervise\" and \"manage\" the public schools — as such powers had been traditionally conferred by statute prior to the enactment of the Municipal Public Employees Labor Relations Law; and that, therefore, any concrete item tending to impinge upon any area ordinarily conceived as \"supervision\" or \"management\" must be excluded as an appropriate subject of mandatory collective bargaining regardless of its concomitant relationships to the \"working conditions\" of teachers.\n\nIt is of extreme significance, therefore, that in Section 965, subd. 1, par. C the legislature revealed that it was not content to leave the language as above set forth — thereby to open the door to the extreme \"exclusive-management-prerogatives\" interpretation above indicated. On the contrary, the legislature was careful, explicitly and definitively, to insert additional language having strong tendency to show that \"educational policies\" was legislatively intended to be restrictively, not broadly, conceived — specifically that \"for the purpose of this paragraph\" the calculated meaning is that\n\n\"educational policies shall not include wages, hours, working  conditions or contract grievance arbitration.\"\n\nSuch double emphasis by the legislature upon the overriding importance of the concept of \"working conditions\" in relation to the collective bargaining process, — first, that by affirmative definition teacher \"working conditions\" are explicitly included within mandatory collective bargaining and, second, that by negative exclusion \"working conditions\" are eliminated from the limitational effects of \"educational policies\" — signifies, most clearly in my view, a legislative design that the general doctrine of \"unilaterally exclusive managerial prerogatives\" must not be permitted to operate as an instrumentality by which all practical substance may be scooped out of the concept of teacher \"working conditions\", to transform teacher collective bargaining — in marked contradistinction to the collective bargaining of all other public employees — into a litany noble in sound but hollow in reality.\n\nMore particularly, I interpret such double legislative emphasis upon the \"working conditions\" of teachers to mean that the legislature intended that teacher \"working conditions\" shall be bilaterally negotiable in collective bargaining and subject to binding arbitration (except for \"salaries, pensions and insurance\") notwithstanding that they touch upon one specific \"managerial\" function with which, as a practical matter the \"working conditions\" of teachers are almost invariably interconnected — i.e., the organization, supervision, direction and distribution of working personnel. Since decisions concerning almost every \"working condition\" of teachers will tend to encroach upon the \"managerial\" organization, supervision, direction or distribution of the working personnel, were this single facet of \"managerial\" functioning to be permitted to accomplish, under the category \"educational policies\", a per se automatic exclusion of teacher \"working conditions\" from the collective bargaining process, there would result precisely that emasculation of \"working conditions\" as a mandatory subject of collective bargaining and of binding arbitration which, as above indicated,\n\nthe legislature — by its specially reiterated emphasis upon \"working conditions\" — must reasonably be interpreted to have sought to prevent.\n\nThus, (1) negatively, not only must impact upon the organization, supervision, direction and distribution of personnel be held insufficient, per se, to exclude items related to teacher \"working conditions\" as proper matters of collective bargaining and binding arbitration but also, (2) affirmatively, the reasonably manifest legislative intention must be held to be that other contacts of such items with other functions generally cognizable as \"managerial\" and \"policy-making\" can subordinate the \"working conditions\" features, and accomplish an exclusion from negotiability and binding arbitration, only if, on balance, their quantitative number or qualitative importance, or both, are found significantly substantial to override the prima facie eligibility for collective bargaining and binding arbitration established by the presence of reasonable relationships to \"working conditions.\"\n\n\"Class Size\"\n\nBy such general approach to the application of the \"working conditions\" — \"educational policies\" dichotomy, and as an initial illustration of the technique in operation, I conclude that the concrete item of \"class size\" lies within \"educational policies\" — excluded from collective bargaining and binding arbitration.\n\nAlthough the size of a class to be taught by a given teacher plainly and seriously affects teacher \"working conditions\", the impacts of \"class size\" overlap into a number of \"managerial\" and \"policy\" areas which are of substantial qualitative importance. \"Class size\" requirements directly involve considerations not merely of organization, supervision, direction and distribution of personnel but also of the needs for additional school building construction or other types of capital outlays, the current population trends, the appropriate use of technological developments (such as television or other electronic teaching aids) and the swings in educational philosophies and theories and the manner of their implementation.\n\nHere, then, (1) \"working conditions\" features are so intimately entwined with an abundant plurality of important \"managerial\" and pure \"policy\" elements that \"class size\" must be deemed to be an integral complex of \"educational policies\" and \"working conditions\" — incapable of separation to allow the \"working conditions\" factors to be negotiated in isolation and (2) with \"class size\" thus treated as an inseparable unit, it cannot, as a unit, qualify for collective bargaining and binding arbitration because the weight of the \"educational policies\" factors contained in it are sufficiently heavy to override the impacts upon the \"working conditions\" of teachers.\n\nThe arbitrators exceeded their jurisdiction in making binding determinations as to \"class size.\"\n\n\"Length of a Teacher's Working Day\"\n\nSimilarly, the length of the school day in terms of the number of hours the teacher will be required to teach or be in attendance at school, is a matter concerning which the \"working conditions\" interests of teachers are fundamentally inseparable from a plurality of non-teacher considerations involving important \"managerial\" and \"policy\" areas.\n\nWhile it is clear that the number of hours which any individual teacher shall be required to work in a given day need not coincide with the number of hours the students are obliged to be in attendance at school, this fact by itself fails to establish that the length of the teacher's school day may be isolated as a proper subject of mandatory collective bargaining. Closer scrutiny reveals that were the length of the teacher's school day negotiable in collective bargaining and in a given situation were economic conditions to preclude the hiring of additional teaching personnel, negotiations aimed at shortening the work-day of teachers would necessarily become directed toward seeking alternatives to the hiring of additional personnel. There would thus eventuate an exploration into such areas as the utilization of newer educational techniques by which a teacher's actual presence or participation is rendered unnecessary — e.g., electronic aids, open class rooms, team teaching programs and subject-matter restrictions or modifications. In this manner, significantly more substantial intrusions into \"policy\" areas, — over and above encroachment simply upon the \"managerial\" supervision, organization, direction and distribution of personnel — become involved.\n\nThus, the length of the teacher's working day is closely and heavily interwoven with judgments bearing upon the welfare of the students, — as reflected in the ultimate quality of their education and the extent to which it may be improved or weakened by use of various types of substitutes, technological or otherwise, for the living presence and active participation of teachers. Such foundational educational value judgments cannot reasonably be subordinated to the overlay of teacher \"working conditions\", and for this reason, the length of the teacher's working day must be held, fundamentally, that kind of \"educational policies\" subject-matter which was legislatively intended to remain outside the scope of mandatory collective bargaining and, therefore, of binding arbitration.\n\nThe arbitrators exceeded their jurisdiction in making binding determinations concerning the length of the teacher working day.\n\n\"Scheduling and Length of School Vacations and of the  Commencement and Ending of the School Year\"\n\nOn similar reasoning, questions concerned with the scheduling and length of school vacations and the commencement and ending of the school year (insofar as such calendar aspects, respectively, are directed at teacher attendance at school) must be held matters of \"educational policies\" and, as such, non-negotiable and beyond the scope of binding arbitration.\n\nHere, again, the \"educational policies\" predominance arises not merely because of an impingement upon the \"managerial\" function of organizing, supervising, directing and distributing personnel but mainly because of a substantial intermixing of judgments transcending teacher interests and embracing important interests of the general citizenry. Since the teaching staff is reasonably to be required to be at school, minimally, whenever the students must attend, the commencement and termination of at least such minimum school year for the teachers, and the scheduling and length of intermediate vacations, will be settled by such calendar arrangements as are to be fixed for student attendance.\n\nInto the calendar arrangements for students enter considerations and decisions involving the plans and interests of families, the need to arrange for the presence of all non-teaching personnel who function while students are in attendance at school and the interests and concerns of all other parts of the community related to, or affected by, the times when students will be in attendance at school or on vacation.\n\nThus, the commencement and termination of the school year and the scheduling and length of intermediate vacations during the school year, at least insofar as students and teachers are congruently involved, must be held matters of \"educational policies\" bearing too substantially upon too many and important non-teacher interests to be settled by collective bargaining or binding arbitration.\n\nThe arbitrators exceeded their jurisdiction in purporting to make binding determinations concerning this subject-matter.\n\n\"Pre- and post-school Day Hours and pre- and post-school Year  Days for Teacher Attendance at School\"\n\nOn the other hand, questions relating to the attendance of teachers at school at times other than when the students will be in attendance are to be regarded as \"working conditions\" of teachers lacking significant relationships to non-teacher interests of a quantitive and qualitative magnitude sufficient to negate collective bargaining or binding arbitration. The negotiation or arbitration of questions related to whether and when teachers shall be at school, even though the students are not in attendance, impinge only upon that \"managerial\" function concerned with the organization, supervision, direction and distribution of personnel. As above emphasized, this single \"managerial\" factor must be regarded as insufficient per se to establish the kind of involvement with \"educational policies\" requisite, statutorily, to remove an item substantially related to teacher \"working conditions\" from the sphere of mandatory collective bargaining or of determination by binding arbitration.\n\nThe arbitrators acted properly within their jurisdiction in making binding determinations concerning pre- and post-school day hours and pre- and post-school year days for teacher attendance at school (at times other than when the students would be in attendance).\n\n\"Teacher Aides for non-teaching `Housekeeping' Functions\"\n\nBy the same analysis the issue of the use of teacher aides to monitor play grounds, supervise lunch periods, load and unload buses and other non-teaching types of activities must be held a subject proper for collective bargaining and within the scope of binding arbitration.\n\nUnquestionably bearing heavily upon the work load of teachers, the issue of teacher aides for various \"housekeeping\" functions touches upon other areas ordinarily deemed to affect \"policy\" — over and above a narrow impingement upon \"managerial\" organization, supervision, direction and distribution of personnel — only in terms of the monetary costs of hiring the additional non-professional personnel. That money costs may become involved — with potential for impact upon not only the ordering of educational priorities but the overall budgeting appropriations and tax rate of the public employer — does not suffice, ipso facto, to exclude from negotiability or binding arbitration any concrete item substantially related to \"working conditions.\" (See ante, p. 413) Rather, these monetary costs of various \"working conditions\" are operative as one consideration providing guidance to the arbitrators as they engage in the balancing of facts leading to the accommodations they make when they select the particular terms to be fixed as contractually binding.\n\nThe subject-matter of teacher aides for non-teaching \"household\" tasks is negotiable and subject to binding arbitration.\n\nIn making binding determinations of the issues, the arbitrators acted within their jurisdiction.\n\n\"Specialist Teachers for Specific Types of Subject-matter  Taught or Services Offered\"\n\nAnalysis discloses that the question of the employment of \"specialist\" teachers for particular subjects being taught or services being offered students is a matter bilaterally negotiable in collective bargaining and included within the sphere of binding arbitration.\n\nThe issue, here, is posited not as requiring decision whether a particular subject, such as art, music or remedial reading is to be taught as part of the curriculum or whether a special type of \"service\" (such as guidance counseling, remedial reading or library) is to be offered. The assumption is that it has been settled that art, music, remedial reading, guidance counseling and library services are to be taught as subjects or offered as services.\n\nThe question is, rather, who, shall do such teaching or provide such services — specifically, whether it shall be an additional ancillary task to be borne by regular class-room teachers who have other primary teaching and class-room responsibilities or whether it shall be made the primary responsibility of teachers who are fundamentally free of generalized regular teaching obligations and who are to concentrate as specialists in a subject-matter which involves special skills or knowledge.\n\nClearly, to the extent that art, music, remedial reading, guidance and counseling or acting as a librarian do involve special types of skills and knowledge, to have regular teachers assume the additional ancillary responsibility for such specialities not only increases the work load of the regular teachers, as such, but also tends, indirectly, to cause them additional difficulties; it tends to introduce a potential for frustrations and dissatisfactions should regular teachers be unable to develop the special skills, or competencies, for which they are thus given ancillary responsibility.\n\nTo have these \"working conditions\" aspects determined by bilateral negotiation and ultimately (should it be necessary) by binding arbitration, as with the issues of teacher aides for \"household\" tasks, impinges upon \"managerial\" and \"policy\" areas — over and above an involvement with the organization, direction and distribution of personnel — basically only in terms of the additional monetary expenditures which might be required to arrange for such \"specialist\" teachers.\n\nHence, as with teacher aides for \"housekeeping\" tasks, the contacts with the \"managerial\" and \"policy\" realm must be held insufficient to override the prima facie eligibility for negotiation and binding arbitration established by the important \"working conditions\" factors present. That money expenditures might be involved does not preclude bilateral negotiation or binding arbitration but rather is only one of a plurality of considerations which enter into the ultimate determination by the arbitrators of whether, and to what extent, \"specialist\" personnel for the above designated \"special\" subjects or services shall be used rather than to have these \"special\" subjects or services (art, music, guidance counseling, remedial reading and library) be taken on as additional ancillary responsibilities of regular teachers who have other primary teaching tasks to perform.\n\nThe arbitrators acted within their jurisdiction in making binding determinations concerning these questions of \"specialists\" for \"special\" subjects or services.\n\nIII-B-3\n\nThe Biddeford Board of Education has levelled a wide ranging onslaught against all of the determinations in the arbitrational decision the implementation of which entails monetary expenditures. The argument is that since the monies for the conduct of the public schools come from the municipal legislative body empowered to make appropriations, the arbitration panel had lawful jurisdiction to settle issues requiring money expenditures for their implementation not bindingly but subject only to a contingency that adequate funds will be provided by appropriations.\n\nThe argument is unacceptable. It is fundamentally at odds with the basic pattern and objectives of the Municipal Public Employees Labor Relations Law.\n\nAs fully explained (ante at p. 413), \"working conditions\" which are other than \"salaries, pensions and insurance\" are placed within the jurisdiction of arbitrators to settle as the terms and conditions of contracts which are to have fully binding legal effect, notwithstanding that they can, or will, require expenditures of money. This is the only meaning reasonably attributable to the explicit provisions of Section 965:\n\n\". . . with respect to a controversy over subjects other than  salaries, pensions and insurance, the arbitrators shall make  determinations . . . and if made by a majority . . . such  determinations will be binding on both parties and the parties  will enter an agreement or take whatever other action that may be appropriate to carry out and effectuate such binding  determinations . . . .\"\n\nThe position being asserted by the Biddeford Board of Education is contrary to this plain statutory language.\n\nMoreover, the position is irreconcilable with the full implications of the legislature's carefully stated differentiation between the function of the arbitrators (1)\n\n\". . . with respect to a controversy over . . . salaries,  pensions and insurance . . .\",\n\nthat the arbitrators in such controversy\n\n\". . . will recommend terms of settlement and may make findings  of fact; such recommendations and findings . . . [to be]  advisory only . . .\"\n\n(Section 965) but (2) otherwise,\n\n\". . . with respect to a controversy over subjects other than  salaries, pensions and insurance . . .\"\n\nshall, by majority,\n\n\". . . make determinations . . . binding on both parties . .  .\"\n\nand to be embodied in an \"agreement\" to be entered into by the parties.\n\nThis legislative concern to point up such differences in arbitrational functioning, dependent upon whether \"salaries, pensions and insurance\" are involved, emphasizes precisely that (1) only as to the major items of money expenditures represented by \"salaries, pensions and insurance\" is the contingency of the need for appropriations recognized, thereby to require that the arbitrators act only as an advisory body making recommendations but (2) concerning all items negotiable in collective bargaining other than \"salaries, pensions and insurance\", and even though such other items can and, will, involve money expenditures when they are to be implemented, the arbitrators are empowered to impose fully binding legal obligations. As to these necessary monetary expenditures resulting from such binding decisions of the arbitrators, it becomes the responsibility of the school board, as well as the appropriate legislative body of the municipality, to make such arrangements as will ensure that these legal obligations will be met. Cf. Providence Teach. U. Local 958 v. School Committee, 108 R.I. 444, 276 A.2d 762 (1971).[fn7A]\n\nIII-B-4\n\nA last issue raised for decision concerns the legal effects under the Municipal Public Employees Labor Relations Law flowing from the binding determinations of arbitrators acting pursuant to Section 965, subd. 4 — in particular, during the period allowed for instituting review (under Section 972) and, if review has been sought, while it is pending.\n\nBy the express language of the statute, when made\n\n\". . . by a majority of the arbitrators . . . determinations  will be binding on both parties and the parties will enter an  agreement . . . to carry out and effectuate such binding determinations.\"\n\nHence, that at least two arbitrators have in fact settled upon determinations becomes the controlling factor by which their determinations become binding and which brings into play the legal obligation of the parties to incorporate the determinations into an agreement. The statute omits to establish an automatic suspension of legal consequences because of the potential that the arbitrational decision might embody errors causing them to be reversed or modified on review.\n\nAny such suspension of \"bindingness\" or of legal obligation is allowed, by the statutory language, to come into play only to the extent that in Section 972[fn8A] the statute prescribes that\n\n\"review shall be sought in accordance with Rule 80B of the  Rules of Civil Procedure\"\n\nand that\n\n\"an appeal [from the Superior Court's review] may be taken to  the law court as in any civil action.\"\n\nAs to any review \"in accordance with Rule 80B . . .,\" the Rule plainly provides:\n\n\"Except as otherwise provided by statute, the filing of the  complaint does not stay any action of which review is sought,  but the court may order a stay upon such terms as it deems  proper.\"\n\nThe present statute fails to provide otherwise and, on the contrary, tends clearly to indicate that until a Court ordered stay is accomplished pursuant to Rule 80B, the arbitrational determinations are immediately and continuingly binding and the parties are under immediate and continuing legal duty to enter an agreement which incorporates them.\n\nAccordingly, regardless of whether it is, or will be, claimed that determinations of arbitrators contain an \"erroneous ruling or finding of law\" subjecting the determinations to potential reversal or modification upon review, the determinations are, and remain, binding in their legal effect and the parties are, and remain, under the legal duty to incorporate them in a signed agreement until the party asserting a right of review achieves the intervention of judicial action in the form of such \"stay\" as the Superior Court sees fit to order in the circumstances.\n\nCONCLUSION\n\nI would remand the cases to the Superior Court for action, as follows:\n\n(1) In Docket No. 2688-71, City of Biddeford by its Board of Education v. Biddeford Teachers Association, et als, the decision of the arbitration panel of November 17, 1971 is to be modified by striking therefrom the determinations concerning \"Class Size\", \"Length of a Teacher's Working Day\" and \"Scheduling and Length of School Vacations and of the Commencement and Ending of the School Year.\"\n\nAfter such modification has been effected, the Superior Court should enter\n\nJudgment affirming the decision of the arbitrational panel (as modified).\n\n(2) In Docket No. 2690-71, Biddeford Teachers Association v. Board of Education of City of Biddeford, et als, the case, as remanded, is to await the entry of judgment in case No. 2688-71 aforesaid. Thereafter, the Superior Court shall proceed in such manner as the subsequent conduct of the parties might make necessary or appropriate — all in accordance with the principles enunciated in this opinion.\n\n[fn1A] As to the specific subject-matter before it the Whitman Court observed: \"While the statute does not in terms provide that the commissioner of insurance shall exercise a sound and reasonable discretion in the disapproval of proposed rules and regulations, that condition is necessarily implied. As has been said many times, in many cases administrative officers or bodies must act, not only within the field of their statutory powers, but in a reasonable and orderly manner. . . . The rule of reasonableness inheres in every law, and the action of those charged with its enforcement must in the nature of things be subject to the test of reasonableness.\" (pp. 942, 943)\n\n[fn2A] The language of Chief Justice Hughes, writing for the majority in Panama Refining Co. v. Ryan, was: \"We examine the context to ascertain if it furnishes a declaration of policy or a standard of action, which can be deemed . . . to imply what is not there expressed.\" (293 U.S. p. 416, 55 S.Ct. p. 246) In dissent Justice Cardozo explicitly added: \"I concede that to uphold the delegation there is need to discover in the terms of the act a standard reasonably clear whereby discretion must be governed. I deny that such a standard is lacking . . . when the act with all its reasonable implications is considered as a whole.\" (p. 434, 55 S.Ct. p. 254)\n\nReiterating the clear permissibility of finding standards implicit, Justice Cardozo said: \"The prevailing opinion concedes that a standard will be as effective if imported . . . by reasonable implication as if put there in so many words.\" (p. 435, 55 S.Ct. p. 254)\n\n[fn3A] A partial explanation might be that the specific subject-matter which most frequently comes before state tribunals involves an overlay of additional and unique problems not entirely answerable by use of the \"standards\" conception as the sole criterion of valid \"delegation\" and requiring special emphasis upon prevention of arbitrary and capricious action — as, for example, licensing controls over the right of a person to earn a living in a profession, trade or business (in which one's peers often sit on the administrative tribunal having the licensing, or revocation, power — thus giving rise to likelihood of the influence of friendship or self-interest); or situations involving zoning boards of appeals and their authority to decide exceptions or variances (and in which inheres the potential for favoritism and discrimination resulting from the influence of small pressure groups or other aspects of local politics). These unique features create special danger of invidious discrimination in the exercise of power — the worse because it might be undetectable and therefore, unexposable by judicial review if the power is not adequately contained; and the dangers are aggravated because in these types of proceedings there is generally an absence of evidentiary hearings conducted with reasonable procedural controls. See: Waterville Hotel Corp. v. Board of Zoning Appeals, Me., 241 A.2d 50 (1968); Small v. Maine Board of Registration and Examination in Optometry, Me., 293 A.2d 786 (1972).\n\n[fn4A] This approach has been taken in the present context with full awareness that much respectable current scholarship advocates (1) abandonment, even in the area of police power regulation and control of private rights, of the methodology which insists upon adequate \"primary standards\", legislatively prescribed, as an absolute precondition of the validity of legislative delegation and (2) reliance, rather, upon a total conglomerate of safeguards against irresponsible, arbitrary or capricious action by administrative bodies in which before-the-fact statutory standards may be a helpful, but not an indispensable, factor. Illustrative of this attitude are the following comments by Professor Kenneth Culp Davis:\n\n\"The non-delegation doctrine can and should be altered to turn  it into an effective and useful judicial tool. Its purpose  should no longer be either to prevent delegation of legislative  power or to require meaningful statutory standards; its purpose  should be the much deeper one of protecting against unnecessary  and uncontrolled discretionary power. The focus should no  longer be exclusively on standards; it should be on the  totality of protections against arbitrariness, including both  safeguards and standards.\" Davis, Administrative Law Treatise  (1970 Supplement, p. 40)\n\nCompare, however, the resurgence of the directly opposite philosophy as recently advanced by Judge J. Skelly Wright in his book review of Professor Davis' book Discretionary Justice: A Preliminary Inquiry.\n\nJudge Wright maintains in Beyond Discretionary Justice, 81 Yale Law Journal 575 (January, 1972):\n\n\"There must be some limit on the extent to which Congress can  transfer its own powers to other bodies without guidance as to  how these powers should be exercised.\" (p. 582) \"I think the  delegation doctrine retains an important potential as a check  on the exercise of unbounded, standardless discretion by  administrative agencies. At its core, the doctrine is based on  the notion that agency action must occur within the context of  a rule of law previously formulated by a legislative body. That  concept is as important now as it was a century and a half ago  when it was first propounded.\" (pp. 583, 584)\n\n\"Delegation is, after all, a matter of degree, and the amount  of power which it is permissible to delegate to an agency  varies with the problem involved. . . . It will be necessary to  do some systematic thinking about the degree to which various  categories of problems are subject to prospective . . .  [legislative] control. We need, in short, some standards for  when we should require standards. . . . [the legislature]  should channel its delegations of power with prospective  guidelines and standards to the greatest extent possible. But  ironically, the courts may have to work out the precise  contours of the requirement of prospective standards on an  empirical, case-by-case basis, . . . .\" (p. 587)\n\nFinally, and to be regarded, probably, as a position mediating between the two extremes, is a recent analysis by Professor Abraham D. Sofaer in his December, 1972 Columbia Law Review article, Judicial Control of Informal Discretionary Adjudication and Enforcement, 72 Col.L.Rev. 1293.\n\nProfessor Sofaer injects a new dimension into the \"standards\" controversy by observations which concentrate upon the opportunity for benefits deriving from \"individualized\" rather than \"standardized\" approach. Professor Sofaer says (1):\n\n\"Even if it were reasonable to expect the courts to insist on  better legislative standards, one cannot be confident that the  results of such action would be salutary\" (p. 1307);\n\nand (2) in respect to Professor Davis' position that the concern should be not so much with prospective legislative standards as with administrative rulemaking,\n\n\"The current focus on rulemaking as a means of limiting and  controlling discretion distracts needed attention from the use  of adjudication for such purposes. A decision is a standard, at  least potentially. If the relevant facts are included along  with the conclusion in a statement made available to interested  persons, then a decision will give guidance. . . . Decisions  can narrow or control discretion just as effectively as  regulations: they can turn on the special circumstances of a  particular case; they can set forth principles applicable to  many cases; and they can even specify the presence of a single  factor as controlling.\" (pp. 1314, 1315)\n\n[fn5A] The language of Section 965, subd. 3, as specifically interrelated with and carried over into Section 965, subd. 4, forcefully suggests that before either party may compel arbitration, such party, as a precondition to arbitration, must have demanded the fact-finding process to have been instituted and completed.\n\nWe need not here decide, however, whether fact-finding is a statutory prerequisite to arbitration since it will suffice for present purposes that the fact-finding process has been available and is highly likely to have been invoked.\n\n[fn6A] 20 M.R.S.A. § 1951 reads: \"Each administrative unit operating public schools within the State shall grant all certified teachers, except substitute teachers as defined by the commissioner, a minimum annual sick leave of 10 school days accumulative to a minimum of 90 school days without loss of salary. Each administrative unit employing teachers who have unused sick leave accumulated in their previous positions shall accept up to 20 days of such sick leave to be transferred to the employing administrative unit, said sick leave to be credited and made effective upon achieving continuing contract status in the new employing unit. Any other plan of sick leave which, in the opinion of the state board, provides at least equal benefits may be approved in lieu thereof. Full-time teachers assistants and teachers aides shall be granted minimum annual sick leave of 10 school days.\"\n\n[fn7A] To assist the public employer (including its school board and legislative body) to deal with the legal obligations which will result if (1) issues as to \"salaries, pensions and insurance\" are settled by collective bargaining, or (2) any other matters requiring the appropriations of money, are settled by collective bargaining or, if collective bargaining has failed, by the binding determinations of arbitrators, the Municipal Public Employees Labor Relations Law has inserted a special provision affording the public employer the benefit of specific timing for all collective bargaining which involves money expenditures. The statute explicitly provides:\n\n\"Whenever . . . any matter[s] requiring appropriation of money  . . . are included as a matter of collective bargaining . . .,  it is the obligation of the bargaining agent to serve written  notice or request for collective bargaining on the public  employer at least 120 days before the conclusion of the current  fiscal operating budget . . . .\"\n\n[fn8A] By P.L. 1970 Chapter 578 § 7, a new section, Section 972, was added to govern the review of binding determinations of arbitrators.\n\nThe consolidated matters now before us are governed by these statutory changes effective (by emergency enactment) as of February 9, 1970.\n\nIt is to be observed that at the Special Session of the Legislature convened from January 24, 1972 to March 10, 1972, other changes were made affecting the remedies for unfair labor practices which could, in future situations, have a relationship to matters arising from binding arbitration and interrelationships between enforcement proceedings and the review proceedings provided by Section 972.\n\nWERNICK, Justice (Agreeing in part and disagreeing in part with the opinion of WEATHERBEE, J.).\n\n\u003cspan class=\"fn\"\u003e1. The parties had succeeded in negotiating a contract for the year 1970-1971.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Act prohibits public employees from engaging in a strike, work stoppage, slowdown or blacklisting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We consider that a printing error doubtless distorted the legislative language here and that the phrase \"for the purpose of this paragraph\" was intended to be the beginning of a separate sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Within the areas covered by the Act either party is entitled to require the other to participate in both interest arbitration (that is, concerning disputes involved in the making of the employment contract) and grievance arbitration (concerning disputes arising out of employment under the contract).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"Sec. 1. Be it enacted by the Senate and House of Representatives, in Legislature assembled, That every town and plantation shall annually raise and expend for the maintenance and support of schools therein, to be taught by school masters duly qualified, a sum of money including the income of any incorporated school fund not less than forty cents for each inhabitant, the number to be computed according to the next proceding census of the State by which the representation thereof has been apportioned: Provided, That a part, not exceeding one third of the money allotted to any district, may, if the district so determine, be applied to the support of a school taught by a mistress, or when the sum so allotted to a district in any year, shall not exceed thirty five dollars, the whole may be expended in the same manner.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. \"Sec. 3. Be it further enacted, That there shall be chosen by ballot at the annual meeting, in each town and plantation, a superintending school committee, consisting of not less than three nor more than seven persons, whose duty it shall be, to examine school masters, and mistresses, proposing to teach school therein. And it shall be the duty of such committee to visit and inspect the schools in their respective towns and plantations, and inquire into the regulations and discipline thereof, and the proficiency of the scholars therein, and use their influence and best endeavours, that the youth in the several districts regularly attend the schools; and the said committee shall have the power to dismiss any school master or mistress who shall be found incapable, or unfit to teach any school, notwithstanding their having procured the requisite certificates; but the towns and plantations shall be bound to pay such instructors for the time they have been employed; and the superintending committee shall have power to direct what school books shall be used in the respective schools; and at the meeting for the choice of town officers, there shall be chosen an agent for each school district, whose duty it shall be, to hire the school masters, or mistresses for their respective districts, and to provide the necessary fuel and utensils for the schools, . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. During the early history of our state, our statutes permitted areas within a town or areas composed of parts of two or more towns to form semi-autonomous school districts and to choose school agents and share with the town superintending school committees the responsibility for maintenance of the public schools. See, for example, R.S. 1871, Chap. 11, §§ 16-51. For a time, towns were permitted to elect a supervisor of schools in lieu of a superintending school committee. R.S. 1871, Chap. 11 § 10. P.L. 1897, Chap. 332 § 1 first required superintending school committees to choose or towns to elect superintendents of schools who succeeded to some administrative duties formerly performed by the superintending school committees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFor a brief period — 1871 to 1872 — our statutes directed the Governor to appoint for each county a county supervisor to public schools who \"shall act as the official advisor and constant assistant to the school officers and teachers in his county. R.S. 1871, Chap. 11, §§ 75-80. This office was abolished by P.L. 1872, Chap. 67.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The members of the Superintending School Committee are elected officials (20 M.R.S.A. § 471) and their statutory duties include (20 M.R.S.A. § 473):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. Management of schools. The management of the schools and the custody and care . . . of all school property in their administrative units . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. General course of instruction; textbooks. [They shall] [d]irect the general course of instruction and approve a uniform system of textbooks . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThey employ the Superintendent of Schools (20 M.R.S.A. § 155) and approve or disapprove of his nomination of teachers. 20 M.R.S.A. § 161(5). They may, after notice and hearing, dismiss a teacher for unfitness. 20 M.R.S.A. § 473(4). Although we have spoken in terms of powers of the superintending school committees, the same principles apply as to directors of School Administrative Districts (20 M.R.S.A. § 219), to committees of supervisory unions (20 M.R.S.A. § 153) and to community school committees. 20 M.R.S.A. § 356.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Now 20 M.R.S.A. § 801.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Now 20 M.R.S.A. § 855.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Now 20 M.R.S.A. § 473(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Now 20 M.R.S.A. § 1011.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Now 20 M.R.S.A. § 1131.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. P.L. 1868, Chap. 221 § 3(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. 20 M.R.S.A. § 101; P.L. 1971, Chap. 492. P.L. 1971, Special Session 1972, Chap. 610 changed his title to Commissioner of Education and Cultural Services.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. \"1. General supervision. To exercise a general supervision of all the public schools and to advise and direct the town committees and superintendents in the discharge of their duties, by circular letters and personal conference, devoting all his time to the duties of his office;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Studies to be taught. To prescribe the studies to be taught in the public schools and in private schools approved for attendance and tuition purposes, reserving to superintending school committees, trustees or other officers in charge of such public or private schools . . the course of study prescribed by the commissioner shall be followed in all public schools and in all private schools approved by the said commissioner for attendance or tuition purposes. Upon the approval by the said commissioner of any course arranged by the superintending school committee of any town, or by the trustees or other officers of any private school, said course shall be the authorized course for said town or private school. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. State Board of Regents v. United Packing House Food and Allied Workers, Local No. 1258, 175 N.W.2d 110 (Iowa 1970); In Re Richfield Federation of Teachers, 263 Minn. 21, 115 N.W.2d 682 (1962); City of Fort Smith v. Arkansas State Council No. 38, 245 Ark. 409, 433 S.W.2d 153 (1968); Norwalk Teachers' Ass'n. v. Board of Ed., 138 Conn. 269, 83 A.2d 482 (1951).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. City of Manchester v. Manchester Teachers Guild, 100 N.H. 507, 131 A.2d 59 (1957); Wichita Public Schools Employees Union, Local No. 513 v. Smith, 194 Kan. 2, 397 P.2d 357 (1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. City of Madison v. Frank Lloyd Wright Foundation, 20 Wis.2d 361, 122 N.W.2d 400 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Our Legislature enacted a Fire Fighters' Arbitration Law in 1965 (26 M.R.S.A. § 980-992) which provided for binding arbitration, both interests and grievance. It was repealed simultaneously with the enactment of the Act now under consideration. P.L. 1969, Chap. 424 § 2. This Court was called upon to interpret the arbitration features of the law in Rockland Professional Fire Fighters Ass'n v. City of Rockland, Me., 261 A.2d 418 (1970) but the issue of its constitutionality was not raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Wellington \u0026 Winter, Structuring Collective Bargaining in Public Employment, 79 Yale L.J. 805 (1970); Comment in 68 Mich.L.Rev. 260, 284 (1969). For example, a Nebraska statute allows submission of public labor disputes to a Court of Industrial Relations. Nebraska Public Laws 1965, Chap. 396.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. It will be remembered that the school boards are required only to consult as to educational policy, that the arbitrators may only recommend terms of settlement in controversies over salaries, pensions and insurance and that school boards' power to comply with the arbitrators' awards in matters that are subject to binding arbitration is limited by other existing statutory enactments and orders of the Commissioner of Education.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. James M. Ringer, Legality and Propriety of Agreements to Arbitrate Major and Minor Disputes in Public Employment, 54 Cornell L.Rev. 129 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As an apparent response to the decision in Erie Firefighters (earlier discussed), a constitutional amendment was presented to and passed by the electorate which specifically authorized the delegation to panels or commissions of the authority to determine municipal labor disputes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe legislature then enacted a statute which authorized collective bargaining between policemen and firemen and their public employers, culminating, when the parties have bargained to an impasse, in binding arbitration. City policemen then brought mandamus to compel the Borough Council to enact legislation to carry out the arbitrators' award. The City objected that the statute provided no standards. The Court held that the new constitutional amendment obviated the need for standards which the Court had on earlier occasions held are demanded if legislative power is to be delegated. The Pennsylvania Court added that even if the constitutional amendment did not apply, the statute revealed a legislative purpose to protect the public from strikes by policemen and firemen which furnished sufficient standards and that a more explicit expression of legislative policy in a statute providing for labor arbitration would be \"folly\". Harney v. Russo, 435 Pa. 183, 255 A.2d 560 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The succeeding legislature enacted a new statute with standards which the New Jersey Supreme Court, in a new case, found to be adequate. New Jersey Bell Tel. Co. v. Communications Workers of America, New Jersey Traffic Division No. 55, 5 N.J. 354, 75 A.2d 721 (1950).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Theodore W. Kheel, Strikes and Public Employment, 67 Mich.L.Rev. 931 (1969); Kenneth Culp Davis, Administrative Law Treatise, §§ 2.11-2.14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Note, Maine's Public Labor Law, 24 Maine L.Rev. 73 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Opinions of the Justices, 68 Me. 582 (1876), supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Our holding is confined to the particular situation of teachers under the Act. We do not intend to suggest any opinion as to the validity of the Act as applied to other public employees.\u003c/span\u003e\n\n",
    "body_length": 145202,
    "citedas": [
      "304 A.2d 387"
    ],
    "attorneys": "Sanborn, Moreshead \u0026 Schade by Richard B. Sanborn, Augusta, forplaintiffs. Locke, Campbell \u0026 Chapman by Frank G. Chapman, Augusta, fordefendants.",
    "category": [
      "124",
      "36"
    ],
    "judges": "Before Dufresne, C.J., and Webber, Weatherbee, Pomeroy, Wernickand Archibald, JJ.",
    "citation_count": 35
  }
}
