{
  "id": "q46UQWYBTlTomsSBiBxe",
  "document": {
    "title": "EVANS v. BUCHANAN",
    "full_title": "Brenda EVANS et al., Plaintiffs, v. Madeline BUCHANAN et al., Defendants",
    "jurisdiction": "D. Delaware",
    "date": "1976-05-19T00:00:00.000Z",
    "docket": "1816, 1822",
    "body": "CALEB M. WRIGHT, Senior District Judge.\n\nThis case arises under the continuing jurisdiction of this Court to implement prior opinions finding unconstitutional segregation in the public schools in Delaware. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" The instant opinion concerns the choice of an appropriate remedy for constitutional violations in the operation of the schools of Wilmington and the surrounding suburban districts and the requirement of an interdistrict remedy. In prior opinions, this Court ruled that the segregation of the Wilmington schools was never erased; \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" and that this segregation resulted from a combination of factors, including demographic and housing patterns initiated and supported by state action; and the redrawing of school district lines during a period of consolidation and reorganization under the Educational Advancement Act, 14 Del.C. §§ 1001, et seq.3 Having found a violation which included inter-district effects, we ruled that under the guidelines laid down in Milliken v. Bradley, 418 U.S. 717, 94 S. Ct. 3112, 41 L. Ed. 2d 1069 (1974), [hereinafter \" Milliken \"] the Court could consider both inter- and intra-district remedies for the constitutional deprivation. 393 F. Supp. at 446-47, aff'd. per curiam, 423 U.S. 963, 96 S. Ct. 381, 46 L. Ed. 2d 293, 44 U.S.L.W. 3299 (1975).\n\nFollowing the ruling of this Court on the liability phase, the parties \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" were directed to develop plans to remedy the violations found, using both inter- and intra-district methods. These plans were to be submitted through the State Board of Education and its staff, the Department of Public Instruction, for professional comment and evaluation. The State Board was then to recommend to the Court the proposals it thought best. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" These original suggestions, some nineteen in number were submitted to the Court in August, 1975. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nThree weeks of evidentiary hearings followed. During the course of those hearings, additions, changes and shifts in emphasis were made to many of the plans. Those presently before the Court, therefore, differ in several respects from those originally submitted. All the factual and legal issues have been briefed, and the matter is ready for decision.\n\nI. Factual Background\n\nThere is no need to discuss here either the prior history of segregated schools in Delaware or New Castle County, nor to recount in detail the prior findings of this Court, since they are set out in prior opinions. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" Nonetheless, a short discussion of some of the facts found in prior opinions will aid in the understanding of the opinion. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nNew Castle County, Delaware, is some four hundred forty-three square miles in area, and northern New Castle County, the area primarily concerned in the opinion, is some two hundred fifty-one square miles in area. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" This area of Northern New Castle County has a public school population of 80,678 of whom 63,370 or 78.5% are white; 15,722 or 19.4% are black; and the remainder of whom are other minorities including American Indian (89 or.1%), Hispanic (1,120 or 1.38%) and Oriental (377 or.46%). \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" Within the area, 11,733 or 74.6% of the black students attend school in the Wilmington District. If the only other majority black school district in the area, DeLaWarr, is added to Wilmington, 13,473 or 85.6% of the black students in the northern County area attend school in those two districts.\n\nThe apparent contrast can be made even plainer by comparing the Wilmington and DeLaWarr enrollments to the other Northern New Castle County districts. Wilmington Public Schools are 84.7% black; DeLaWarr Public Schools are 54.9% black. No other Northern New Castle District is less than 90% white, and most are significantly higher. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\"\n\nDelaware has a long history of using small school districts, and it became apparent during the post-war period that many of these districts could not support a full educational program. In common with many other states, Delaware has, over the years, consolidated many of these smaller districts, some for financial reasons, others for purposes of required desegregation. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" A comparison of a map of the school districts comprising the northern County area shows some nineteen school districts in 1959 \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" to twelve districts in the same area today (excluding the separate Vocational-Technical District). The last major reorganization, carried out under the Educational Advancement Act, as described in the last opinion, 393 F. Supp. at 438 passim, included the consolidation of several small districts into the presently existing districts. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" This Court ruled that the exclusion of Wilmington from the process of reorganization by statute was an unconstitutional racial classification, and \"'contributed to the separation of the races by... redrawing school district lines.'\" \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\nThe variety of plans submitted as remedies may be grouped for analytical convenience into three broad categories. Certain of the plans submitted are \"voluntary plans\" of varying scope. These include so-called free transfer provisions, and magnet schools. A second category of plans calls for the reorganization of the districts in the area, dividing the black population among the new districts or attendance area and having new school boards make assignments of the students within the area. These plans range from one proposed by the State Board which would divide the area into five new districts; several variations which would include smaller or greater areas; and a county-wide plan designed to consolidate the whole area into one district. The last category is a set of mandatory assignment plans providing for the transfer and transportation of students among the existing districts. The plans vary in the area to be included, in the transportation, and in the amount of time students would actually spend in desegregated experiences.\n\nThe Court has considered all these plans as well as the testimony adduced at the hearings, in the light of the requirements of Milliken16 and Swann17, and on that basis has determined the remedy to be followed here.\n\nII. Class Representation\n\nThe State Board of Education urges that the present class plaintiffs are not properly before the Court. The motion was brought on two grounds: first, that the named representatives of the class had left or been graduated from the Wilmington School System, and therefore the issues were mooted as to them; \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" second, that in any event, at least insofar as remedy was concerned, the named plaintiffs and their counsel did not fully, fairly and adequately represent the interests of the class, since (it was alleged) not all black school children and their parents in Wilmington desired particular forms of remedy favored by the representatives. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nProfessor Moore lists four categories which the Court must consider before determining that the proposed representation is adequate: (1) whether the interests of all parties are \"coextensive\"; (2) whether the interests are \"antagonistic\"; (3) the proportion of the named representatives to the class as a whole; and (4) any facts bearing upon the ability of the named representative to speak for the class as a whole. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" In addition to those factors, the Court notes that the present action must continue in any event, since the Wilmington School Board intervened as a party plaintiff and has full right to pursue the action. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" Moreover, even if the named representatives were to be found to be \"unrepresentative\" of all Wilmington school children, they might well represent a substantial sub-class of the group. See Rule 23(c)(4).\n\nHere it would appear that the interests are \"coextensive\", since all the potential plaintiffs have made clear that they desire an end to segregatory actions on the part of the State. The point pressed by the State is that because some Wilmington parents of black children do not support the plan favored by the named plaintiffs, \"antagonistic\" interests are present, and therefore, the class is improperly represented. First, it is not clear that in these circumstances, the exact nature of the remedy proposed is an interest which cuts to the subject matter of the suit. See generally, 3B Moore's Federal Practice P23.07[3] at 23-404. All potential representatives of plaintiffs who have appeared before the Court have agreed that some remedy is required, and all seek relatively broad remedies. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\"\n\nThe remedy ordered by this Court must of necessity apply to all black children within the City. Since any remedy ordered in favor of the purported sub-group represented by the named plaintiffs would be determinative of the rights of all, the question is really not the antagonism of interests, but whether the Court has had a full and fair presentation of all possible views on the matter. We, therefore, hold that the named representatives are at the very least part of a class whose rights have been violated. Through the presentations of all parties to this suit, and that of all amici, the Court has been thoroughly informed of the differing views on remedy. The action may therefore continue as a class action, and the class will continue to be that class whose rights were violated, the school children of Wilmington. Should it, anytime in the future, appear that antagonistic interests would prevent fair adjudication, the Court may take the necessary steps of requiring the addition of new parties to fill any representation \"gaps\". See Rule 23(d) Fed.R.Civ.Proc.\n\nIII. The Legal Standard of Milliken and Swann\n\nBrown v. Board of Education, 347 U.S. 483, 74 S. Ct. 686, 98 L. Ed. 873 (1954), was a major step in American constitutional law, and it is from that case primarily, and its progeny Green v. New Kent County Board of Education, 391 U.S. 430, 88 S. Ct. 1689, 20 L. Ed. 2d 716 (1968), and Keyes v. Denver School District No. 1, 413 U.S. 189, 93 S. Ct. 2686, 37 L. Ed. 2d 548 (1973), that the determination of the existence of a violation of the rights of children in segregated schools is made. That determination has been made in this case, in opinions that date from 1956 to 1975. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" Milliken and Swann deal not with the existence of a violation, but with the standards which a court must follow in remedying the violation which it has found. They are expressions not of constitutional law, but of the proper scope of equitable discretion. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\"\n\nMoreover, Milliken and Swann must not be read in isolation. As the Court in Milliken noted, harking back to both Swann and Brown II,25 the flexibility and pragmatic judgment of the chancellor of equity have been the consistent pattern of determining remedy in desegregation cases. Milliken and Swann are not, therefore, substantial departures from prior case law, nor steps backward in the development of remedies for desegregation. Rather, they establish the limits of the equitable discretion to be exercised by the court. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\"\n\nThus, Milliken makes plain that the remedy to be ordered must be commensurate with the scope of the violation which has been found. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" And insofar as the remedy to be applied is the desegregation of schools, the violation which was found must be proximately related to the operation of the school system, or to its enrollment. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" Further, if it is shown that the substantial disparity in enrollment patterns between districts was substantially caused by governmental activity, an inter-district remedy may be considered. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\"\n\nThe mere fact that an inter-district violation occurred does not necessarily require an inter-district remedy. It is too long-standing a rule of equity to require citation that although equity will give complete relief, it will limit the exercise of its power to a remedy which is reasonably necessary and likely to succeed. Moreover, an inter-district violation having only de minimis effects will not require school desegregation across the district lines. See 418 U.S. at 750, 94 S. Ct. at 3130, 41 L. Ed. 2d at 1094.\n\nWe need not catalogue the set of violations with regard to housing and zoning set forth in the last opinion affirmed by the Supreme Court. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" Nor need we rehearse the reasons why we held the Educational Advancement Act to be an unconstitutional \"redrawing of district lines.\" \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" It suffices to say that the acts described in the prior opinions were the acts of the State and its subdivisions, and had a substantial, not a de minimis, effect on the enrollment patterns of the separate districts. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\"\n\nThe suburban districts have attempted to foreclose the application of an inter-district remedy including them by citing the prior finding of this Court that each of them was at present operating a unitary system, and urging that they had committed no constitutional violation. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" Such a defense is inadequate where, as here, the local boards are creatures of the State, and it was the State Legislature and the State Board of Education which acted in a fashion which is a substantial and proximate cause of the existing disparity in racial enrollments in the districts of Northern New Castle County. The fact that birth rates, or population shifts, or other factors \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" also contributed to a degree will not relieve the State from its obligation to desegregate. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\" The remedy for the violation must include school districts which are its instrumentalities and which were the product of one of the violations. The remedy for the acts of the State may be inconvenient, burdensome, and expensive to some of those instrumentalities, but neither inconvenience, burden nor expense can negate the duty of the Court to order effective relief when a not insubstantial violation has been shown. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\"\n\nThe suburban districts have urged that under the standard laid down by the plurality opinion in Milliken, no inter-district remedy can be ordered to include them, unless they themselves have been guilty of a violation. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\" The suburban districts emphasize that it was not their actions which had any segregatory effect in Wilmington, and that we did not in the last opinion hold that the Educational Advancement Act was drawn with an actual segregatory intent. See, Milliken, supra, 418 U.S. at 745, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1091. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\" That claim, however, must fail, because it misread both the language of Milliken and the prior holding of this Court. First, the Chief Justice's opinion in Milliken made clear that action by the State which caused inter-district segregation would be sufficient to allow an inter-district remedy. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" The further specification of the deliberate drawing of lines to achieve segregation was by way of example, not limitation. As the Supreme Court made clear in Wright v. Council of Emporia, it is not the purpose for which the lines are drawn that is determinative of whether they work an impermissible classification, but whether the effect is such that they do. See 407 U.S. 451, at 461-62, 92 S. Ct. 2196, at 2204, 33 L. Ed. 2d 51, at 60 (1972). The concurring opinion of Mr. Justice Stewart in Milliken, necessary for the majority holding, makes it even clearer that an inter-district remedy may follow wherever it was shown that \"state officials had contributed to the separation of the races by drawing or redrawing school district lines.\" 418 U.S. at 755, 94 S. Ct. at 3132, 41 L. Ed. 2d at 1097. The activities found in the prior opinion clearly met that standard, and those findings have been affirmed. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\" Nor is the liability of the State merely derivative. See Milliken, 418 U.S. at 748, 94 S. Ct. at 3129, 41 L. Ed. 2d at 1093. Rather, here the State actively contributed to the separation of the races. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\" Nor do we find Mr. Justice Stewart's opinion in Gautreaux to be a significant change from his earlier view. Where the State has contributed to the separation of races by redrawing school lines, necessarily the districts on both sides of the lines are part of the violation itself, and exclusion of the suburban districts cannot be predicated on their own purported innocence when their present lines were drawn or redrawn in the course of a violation.\n\nMoreover, the last opinion also found that although the suburban districts now provided a unitary system for all children within their districts, past activity on their part had not been so confined. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\" The actions of the suburban districts therefore meet the test laid down in Gautreaux for inter-district relief, independently of the State's actions. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\" For present purposes, it is sufficient to point out, as we found in the last opinion, that despite the separate operation of the systems since the 1950's, the racial characteristics of the city and the suburbs are still inter-related, and the actions of state officials and local officials were sufficient to create an inter-district effect under Milliken.44\n\nOur duty is to order a remedy which will place the victims of the violation in substantially the position which they would have occupied had the violation not occurred. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\" Prior opinions of the Supreme Court have held unequivocally that where the violation found resulted in the operation of a dual school system, the Court must order the \"greatest possible actual degree of desegregation\", consistent with the practicalities of the situation, Davis v. Mobile County Bd. of School Comm'rs., 402 U.S. 33, 37, 91 S. Ct. 1289, 1292, 28 L. Ed. 2d 577, 580 (1971); and it must do so by a plan which is reasonably certain to achieve desegregation now. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\" In light of this standard, we must determine whether sufficiently remedial actual desegregation is possible under a plan which would be confined to the boundaries of the present Wilmington district; what level of desegregation will at a minimum establish that a dual system is no longer operating; how wide a geographical area must be included to accomplish properly that result; and by what method and with what safeguards this result can be accomplished. It is to these questions that we turn next.\n\nIV. Wilmington Only Plan\n\nAll of the defendants in the instant phase of the case have urged vigorously that the Court has no power to order an inter-district remedy absent further findings of inter-district violation. They have also urged that a plan which involves only the Wilmington schools will be adequate to remedy the violations found in the prior opinions. Since a finding that such a plan was adequate would relieve the Court of the necessity of dealing with many vexing questions, we deal with this issue first. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\"\n\nThe Wilmington School District, the boundaries of which are coterminous with the city lines, presently serves 13,852 students, of whom 11,733 or 84.7% are black and an additional 746 or 5.4% of whom are Hispanic. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\" The system as a whole is therefore 90% minority enrollment. Only two schools within the system are presently majority white: Cedar Hill Elementary School which is 73.4% white; and Highlands Community School which is 59.6% white. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\" All of the other schools are not only majority black, but heavily so. As we noted in an earlier opinion, some of those schools which were black schools de jure in 1954 have continued to have enrollments over 91% black. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\"\n\nThe plan proposed to cluster certain of the elementary schools in an effort to reduce the black enrollment; and to redraw the \"feeder\" lines for the middle schools, and the attendance boundaries of the two high schools. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\" It was drawn in great part by the Wilmington School Board, although some changes and additions were made by the staff of the State Department of Public Instruction. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\" As submitted, the plan is necessarily limited in its effect by the population characteristics of the area it would cover. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\" Nonetheless, it would result in the schools which were formerly de jure minority schools being desegregated to the extent of bringing their enrollments below 90% black for the first time. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\" Other schools would, however, remain more than 90% minority. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\" We must, therefore, determine whether such a level of minority enrollment in the context of the present case would be sufficient to constitute a remedy for the violations found.\n\nThe Supreme Court has made it clear that there is no magic in percentages of minority enrollment. See Swann, 402 U.S. at 25-26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571; Milliken, 418 U.S. at 740-41 \u0026 n. 19, 747 n. 22, 756, 94 S. Ct. at 3125, 3128, 3132, 41 L. Ed. 2d at 1088, 1092, 1097 (Stewart, J., concurring). Such percentages are merely the starting point in the formulation of a remedy and the determination of whether the remedy is complete. Swann, 402 U.S. at 25, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571. Moreover, such figures are meaningless unless seen in the proper context: they must be weighed in light of the characteristics of the community. Id.; and see Wright v. Council of City of Emporia, 407 U.S. at 464-65, 92 S. Ct. at 2204, 33 L. Ed. 2d at 62 (1974).\n\nIf the community whose characteristics would be determinative of the weight to be given to the enrollment figures were seen as Wilmington alone, such a plan might afford the relief which the Constitution requires. The fact that the schools would continue to be heavily black while the suburbs would be white would not alone require an inter-district remedy. Milliken, 418 U.S. at 756, 94 S. Ct. at 3133, 41 L. Ed. 2d at 1097 (Stewart, J., concurring). This Court, however, cannot use such a narrow view of the community, in light of the scope of the prior violations. Gautreaux, 96 S. Ct. at 1547, 47 L. Ed. 2d at 805, 44 U.S.L.W. at 4485.\n\nThe Supreme Court has made it clear that the determination of the violation is a key factor in determining remedy. Swann, 402 U.S. at 16, 91 S. Ct. at 1276, 28 L. Ed. 2d at 566; Milliken 418 U.S. at 744, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1090. We have already determined that the State had not fulfilled its mandate to operate a unitary school system \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\" ; and that in the past the area comprising the suburban and city districts was treated jointly for many school purposes, including the transportation of black students to de jure segregated schools. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\" In these circumstances, it is apparent that the entire northern New Castle area must be treated as one community in terms of its population characteristics, because that is the way it was perceived and treated by the State and its citizenry. Gautreaux, 96 S. Ct. at 1547, 47 L. Ed. 2d at 805, 44 U.S.L.W. at 4485; Keyes v. Denver School District No. 1, 413 U.S. 189, 93 S. Ct. 2686, 37 L. Ed. 2d 548 (1973). While other districts in this area were being consolidated or considered for consolidation, the Wilmington District was expressly reserved from the exercise of discretion by the State Board, and that reservation \"played a significant part in maintaining the racial identifiability of the Wilmington and suburban New Castle County school districts.\" \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\" Moreover, state action was also found to be responsible here for the racial identifiability of the suburbs and the city, through enforcement of racial covenants, zoning and encouragement and support of private discrimination in housing. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\" For these reasons, the effectiveness of any plan must be judged by how well it terminates racial identifiability of the schools in light of the population characteristics of the northern county area. Gautreaux, 96 S. Ct. at 1547, 47 L. Ed. 2d at 805, 44 U.S.L.W. at 4485. Cf., Swann, 402 U.S., at 25, 91 S. Ct. at 1280, 28 L. Ed. 2d at 572. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\" To hold otherwise in the present context would mean that state officials could, by their actions, effectuate a pattern of discrimination in schools and housing, then argue that the area had become divided into separate communities identified by them, and that only the population characteristics of their selected area need be taken into account.\n\nThe school population of Northern New Castle County is presently 78.5% white. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\" A plan limited to the confines of Wilmington would result in city schools that would be, for the most part, 85% to 95% black, while the suburban schools, other than those of DeLaWarr, remained overwhelmingly white. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\" Thus, a Wilmington-only plan would not significantly affect the present racial identifiability of the Wilmington or suburban schools. It is the duty of the State to bring forward a plan that will achieve desegregation, to the \"greatest possible actual degree\", Swann, 402 U.S. at 26, 91 S. Ct. at 1281, 28 L. Ed. 2d at 572; and here that duty will not have been carried out when the schools will maintain their former racial identity.\n\nWe do not here decide that the fact that Wilmington would be a black system surrounded by white systems is sufficient to call for an inter-district remedy. See Milliken, 418 U.S. at 735, 747 \u0026 n. 22, 94 S. Ct. at 3122, 3128, 41 L. Ed. 2d at 1085, 1092. Nor do we determine that a majority black system is of necessity segregated. See United States v. Scotland Neck Board of Education, 407 U.S. 484, 92 S. Ct. 2214, 33 L. Ed. 2d 75 (1972). Rather, we hold only that insofar as the Wilmington-only plan is concerned, where inter-district violations have been found, it is appropriate to look at the population of the area over which the violations occurred to determine in the first instance whether the plan submitted results in actual desegregation. See Gautreaux, 96 S. Ct. at 1547, 47 L. Ed. 2d at 805, 44 U.S.L.W. at 4485. Where the plan would result in the maintenance of the traditional racial identity previously established by State action, and that disparity in racial enrollments remains substantial, it cannot be said that it results in the disestablishment of a dual system. See United States v. Scotland Neck Board of Education, 407 U.S. 484, 490, 92 S. Ct. 2214, 2217, 33 L. Ed. 2d 75, 80. We, therefore, hold that under the proof developed before us, a Wilmington-only plan would not remedy the violations previously found, and that we must go on to consider an inter-district remedy.\n\nV. Proposed Inter-district Remedies\n\nThe Court has had before it several different types of plans for remedying the violations found, some of which have been recommended in varying degrees by the parties, and others of which were proposed by various individuals and submitted through the State Board. We will not take the time to list seriatim all the various proposals, which are part of the record, but it is appropriate to note that not one of the plans submitted has been found to be completely acceptable taking into consideration all the practicalities of the situation. Davis v. Mobile County Bd. of School Comm'rs., 402 U.S. 33, 37, 91 S. Ct. 1289, 1292, 28 L. Ed. 2d 577, 580 (1971). We make the following findings with regard to the various types of inter-district plans.\n\nA. Voluntary Plans\n\nThe category of voluntary plans includes several different proposals. A proposal on which much evidence was adduced calls for the creation by the suburban districts and Wilmington of so-called \"magnet schools\" to serve five \"zones\" which would be drawn up by combining a portion of Wilmington with one or more suburban districts. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\" The racial make-up of the school population of each zone would approximate the racial characteristics of the county as a whole. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\" All of the presently existing school districts would be retained, and, in addition, each \"zone\" would have an \"Advisory Committee\" which would be responsible for implementation of magnet proposals. The actual operation of individual magnet programs in schools would be the responsibility of the district in which the building was physically located. D.DPI.Rem. # 8 at 5-6. \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\"\n\nThe central concept in all of these voluntary proposals is that some schools are or can be made so attractive that students will enroll in those schools for the particular program rather than in the neighborhood school to which they would ordinarily have been assigned. The magnet schools proposed are characteristic of the concept: every school in every district would eventually house some sort of magnet program thought by the residents to be both educationally desirable and desegregatory in its attraction. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\" As originally advanced, no binding racial quotas were to be included, although the State Board agreed at trial that they might be used in addition to the program designs. Educators who testified in favor of the plan all agreed that they hoped the plan would work but that there was no way that success could be guaranteed. They sought instead, time to try the plan. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\"\n\nIn determining whether any voluntary plan developed in the testimony meets the requirements of a desegregation plan, the Court has had to consider the goals which any plan ordered by the Court would be required to meet; and then determine whether the plan proposed offers adequate assurance that the goals would be met. The Supreme Court has made clear that time is a commodity whose place has become restricted in desegregation cases. \"'The time for mere \"deliberate speed\" has run out,'. . . . The burden on a school board today is to come forward with a plan that promises realistically to work, and promises realistically to work now.\" \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\" Moreover, the plan must not offer merely a hope of some desegregation at some time in the future. \"The district judge or school authorities should make every effort to achieve the greatest possible degree of actual desegregation and will thus necessarily be concerned with the elimination of one-race schools.\" \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e\"\n\nThe magnet plans proposed here simply do not measure up to those requirements. We do not hold that magnet plans are incapable of achieving reasonable levels of desegregation. In a different context, with different safeguards, such a plan might be sufficient. See Hart v. Community School Board, 512 F.2d 37 (2d Cir. 1975). However, in other contexts, magnet plans similar to the one here have been disapproved. See, Brinkman v. Gilligan, 503 F.2d 684, 704 (6th Cir. 1974); Spangler v. Pasadena Board of Education, 375 F. Supp. 1304, 1307 (C.D.Cal.1974), aff'd, 519 F.2d 430, 438-39 (9th Cir. 1975), cert. granted, 423 U.S. 945, 96 S. Ct. 355, 46 L. Ed. 2d 276, 44 U.S.L.W. 3279 (1975). The magnet system called to the attention of the Court by the State Board, that beginning operation in Houston, shows relatively little success in actually desegregating schools: it has in fact resulted in some schools receiving an even greater minority enrollment. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\" The suburban districts which brought forward \"expansions\" of the outline made by the State were unable to assure the Court that it would actually result in significant desegregation. \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\" Moreover, the State Board failed to cost out its proposal adequately. \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\" In light of the cost of operating programs in other cities, the cost figures given to the Court in the \"expansions\" seem unreliable indeed. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\"\n\nThe magnet program is heavily dependent upon the unique drawing power of particular programs and faculty to attract and hold students. There is necessarily a limited market for special programs. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\" While magnets might be used to desegregate individual schools otherwise not part of a segregated system, their use as the sole means of system-wide desegregation is decidedly unpromising. See Bradley v. Milliken, 402 F. Supp. 1096, 1147 (E.D.Mich.1975). Absent a showing that significant desegregation must occur in fact as a part of the operation of magnet schools, the Court cannot accept the plan. No such showing has been made.\n\nThe other voluntary plans proposed to the Court suffer from similar defects. As Green, supra, made clear, voluntary programs are unacceptable where there are \"reasonably available other ways . . . promising speedier and more effective conversion to a unitary, nonracial school system. . . .\" \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\" None of the other voluntary plans proposed promises realistically to work effectively now, and those plans lack even the modicum of attraction inherent in the magnet system. Thus, assuming that a voluntary program could be developed in an effort to meet reasonable desegregation goals, the proposals presented to this Court are not adequate to assure meeting that goal, and are therefore inadequate as remedies.\n\nB. Cluster and Center Plans\n\nThe Wilmington School Board, as Intervening Plaintiff, submitted a major proposal [\"the Wilmington Metro Plan\"] which would require the transportation of a sufficient number of students across the district lines to desegregate some of the area schools. See, Int.P.Rem. # 1, 8. The enrollments would be determined by \"clustering\" particular city schools with given suburban schools, so that each school within the cluster would have approximately the same racial characteristics. In order to accommodate all the children involved and to spread the burden among suburban and city children, grade patterns would be altered so that schools would serve part of a given elementary or high school level. \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\"\n\nThe Wilmington Metro Plan proposes that all of the existing districts be retained, at least initially, to insure the fair treatment of the students being transferred, and to assist in the organizational transition from a dual to a unitary system.\n\nThe State Board and the suburban districts are very strongly opposed to the cluster plan, denominating it \"forced busing\" which they call a \"bankrupt concept\". The Wilmington School Board takes the position that it is the only plan which actually insures the re-assignment of students to desegregated schools, and is therefore the only plan presented to the Court which meets the requirements of Green.77\n\nThe only other plan submitted to the Court which effectively reassigns students is the so-called \"Center Plan\" submitted by the Alfred I. DuPont School District. \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\" The Center Plan involves the part-time re-assignment of elementary children, so that those in grades one through six would attend neighborhood schools for all of their academic subjects, and for one day per week would meet in desegregated \"Centers\" for training in e.g., physical education, music and art. Children in the seventh through the twelfth grades would be mandatorily assigned full time to desegregated schools, all seventh graders in the area being taught in the present city schools, and all eighth through twelfth grades being taught in present suburban schools. \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\"\n\nWhere desegregation is to take place in one school district, the use of clusters and pairings, as well as other sorts of re-assignment and transportation schemes offer the best guarantee that actual desegregation will take place. The Supreme Court has made it clear that such plans are a proper part of an overall remedy. See, Swann, 402 U.S. at 29-30, 91 S. Ct. at 1282, 28 L. Ed. 2d at 574. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\" But the Court has also made it clear that all of the circumstances of a particular locality are to be taken into account when the District Court makes its determination of what plan to order. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\"\n\nThe cluster and center plans both include inter-district assignments. We must agree with the Supreme Court that an inter-district transportation plan standing alone is difficult to administer, and fraught with complex problems unsuited for judicial determination. \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\" In particular, we note that in Delaware local districts have had a long history of control over curriculum and text choice, \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\" as well as the common governmental functions of setting and levying taxes, and maintaining communication and accountability between administrators and parents. \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e\" The transportation schemes would endanger all of these functions, or make their performance much more difficult. The mere fact of extra administrative burden is not, of course, sufficient to make a plan so impractical or burdensome as to be beyond the equity power of the Court. \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e\" Nonetheless, where methods are available which will accomplish the result without the associated problems, the Court, as a matter of equitable discretion, should follow that course which will require its intervention in the least possible degree which will insure compliance. See generally, Milliken, 418 U.S. 717 at 740-45, 94, 41 L. Ed. 2d 1069, 94 S. Ct. 3112 S. Ct. 3125, 41 L. Ed. 2d 1088; Gautreaux, 425 U.S. 284, 96 S. Ct. at 1538, 47 L. Ed. 2d 792, 44 U.S.L.W. at 4483-85.\n\nThe Wilmington Metro Plan, though containing many admirable features and safeguards with regard to minority rights, would place the Court in the ongoing position of general supervisor of education in New Castle County. In the event of disagreements over curriculum patterns or textbooks, the Court or a master would have to step in. Moreover, the relationship of parents to the school their child attends, and the interests which they take in the operation and policies of that school can be an important determinant of the success of the child in education. \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e\" Except in the Wilmington and Alexis I. DuPont Districts, school board members are elected. See 14 Del.C. §§ 1051, 1062, 1063. The Wilmington Metro Plan would make it much more difficult for individual parents to require accountability from teachers and administrators who are employed by districts other than that of their voting residence. In light of all the circumstances here, the Court cannot in the exercise of equity order the cluster plan as proposed. Transportation schemes, as well as the redrawing of attendance lines and other shifts in present patterns of attendance, will undoubtedly be required to desegregate. But such plans are better drawn where the greatest possible degree of control is in the hands of local leaders acting in accordance with constitutional limitations.\n\nThe Center Plan suffers from the same defects, at least insofar as it would assign students from one district to schools under the supervision of a district over which their parents have little control or political voice. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e\" Moreover, the Center Plan, whatever the purpose of the originators, would place an inequitable burden on the present staff of the Wilmington schools, requiring, for example, that present high school teachers switch to seventh grade, or scramble for the positions which might open up in their field in the suburban districts. \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\" In addition, while accomplishing the desegregation of the secondary level schools, the mere part-time desegregation for the elementary grades \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\" is inadequate as a final result of a desegregation plan under the standard established by Green and Swann.90 Keyes v. Denver School District # 1, 521 F.2d 465, 477-79 (10th Cir. 1975).\n\nNo cluster or center plan which has been proposed would meet the test of administrative feasibility which is, in our view, an absolute prerequisite to the long-range success of any remedy.\n\nC. Reorganization Plans\n\nThe reorganization plans submitted by various parties propose correcting the prior violations by redrawing the boundary lines found to have been drawn improperly. That is, they attempt to combine Wilmington and various of the suburban districts into new consolidated districts. It is expected that the populations of these districts will reflect the racial character of the area as a whole, \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\" and that following the effectuation of the remedy, the new districts could assign pupils within their localities on a desegregated basis and otherwise operate a unitary system. The differences among the reorganization plans proposed pose two issues: (1) whether the area should be split into several new districts or consolidated into one large district; and (2) the extent of the geographical area to be included in the reorganization.\n\nThe State Board and the suburban districts have introduced a reorganization plan in which the Wilmington District is split into five parts. Five new districts are established, each consisting of one or more suburban districts and one-fifth of Wilmington. \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e\" Two of the suburban districts have sought to include in the five district reorganization plan the Newark District. \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e\" Other than changing the pupil and geographical ranges, the inclusion or exclusion of Newark would not affect the operation of the plan. We will, therefore, discuss the plan in light of its other characteristics, since we deal infra with the extent of geographical area to be required. \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e\"\n\nAfter reorganization, the operation of the proposed five districts would be as present Delaware law requires. New elections for board members would eventually have to be held, but in virtually all respects, the proposal follows the reorganization scheme approved by the State Legislature and described in the last opinion. \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e\" The only departures from the existing state scheme set forth in 14 Del.C. §§ 1001 et seq., would be that in contravention of provisions of the Act, Wilmington would be split; enrollments in certain of the reorganized districts would exceed 12,000; \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e\" and the salaries of teachers and staff in the reorganized district would not be \"leveled up\". \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e\" The only change required by the inclusion of Newark would be that one or more districts other than Wilmington would be split. \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\"\n\nThe other major proposal \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e\" for reorganization was that submitted by the DeLaWarr District, which would require that the whole of New Castle County be included in one school district which would be further divided into four or more attendance areas. \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e\" The area or district would be supervised by an elected board, and each of the attendance areas would have elected or appointed advisory groups which would maintain contact with the citizenry. It is the position of DeLaWarr that by including the entire county, several educational benefits would be achieved as well as desegregation of the schools. The tax assessments and collections across the county would be equalized for all the schools, and the population of the entire county would necessarily be reflected in the population of the school district and the schools. If the population were to shift in ways not now foreseen, the county-wide district could shift attendance zones to ensure the continued operation of a unitary system over the whole county. \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e\"\n\nThe suburban districts other than DeLaWarr do not favor a reorganization, but would prefer it to transportation plans implemented without such shift in control. All of the parties, except DeLaWarr, have generally opposed the county-wide plan as creating a major shift in the way Delaware has historically operated its schools. \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e\" DeLaWarr's preference for its plan is at least partially based on its own unique position. Among the districts in New Castle County, DeLaWarr is relatively poor since not only is its population of a substantially lower income level, but a major part of the district's tax base is exempt from taxation because of public uses of the property, including the approaches to the Delaware Memorial Bridge, etc. The change to a county-wide system would enable DeLaWarr to benefit from the better tax assessment and property ratios of the other suburban districts.\n\nThe power of the Court to order a reorganization would not appear to be in doubt. Justice Stewart's concurring opinion in Milliken makes explicit reference to a decree calling for the restructuring of districts as an appropriate remedy for certain kinds of violations. See 418 U.S. at 755, 94 S. Ct. at 3132, 41 L. Ed. 2d at 1097; and see Gautreaux, 425 U.S. 284, 96 S. Ct. 1538, 47 L. Ed. 2d 792, 44 U.S.L.W. 4484 \u0026 n. 12. The Supreme Court has made clear in other contexts that the courts have the power to prevent a reorganization or creation of new districts when to allow the shift would recreate dual systems. See Wright v. Council of City of Emporia, 407 U.S. 451, 92 S. Ct. 2196, 33 L. Ed. 2d 51 (1972); United States v. Scotland Neck Board of Education, 407 U.S. 484, 92 S. Ct. 2214, 33 L. Ed. 2d 75 (1972). Moreover, as noted by the state defendants, reorganization may well be peculiarly suited as the remedy in the instant case, where one of the violations which was found was the prior improper reorganization of districts including some of those now before the Court. \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e\" The standard formulated by the Court is that the remedial decree should be directed toward placing the victims of the violation in the position they would have occupied had the violation not occurred. \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e\" Where one of the violations was the isolation of Wilmington from the possibility of union with other districts, prima facie an appropriate remedy would be ordering of the union to take place.\n\nWe have determined that the violations found in the instant case present a situation where some sort of consolidation or reorganization is required. There is ample testimony that without reorganization of some kind, no plan will be able to function in an administratively feasible manner. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e\" We will, therefore, require the implementation of a reorganization plan. Nonetheless, for the reasons which follow, the Court cannot order any of the reorganization plans as proposed.\n\nThe Supreme Court in Milliken mentioned some of the major problems in consolidating districts, including assessing taxes and setting of election periods. Those decisions are difficult, but in the main, standards exist either in state statutory materials or court decisions which could be used by the equity court to determine some of these issues, and whether proper discretion had been exercised by the state and local officials. The decisions we are asked to make here are much more difficult, and much more open to question with little guidance from state law or federal constitutional guarantees. The State Board and the suburban districts would have us determine, e.g., where present districts should be cut, and what weight should be given to equalizing tax assessments or populations. Although the State Board has presented a plan, during testimony it admitted that, in light of more recent figures, it would probably recommend somewhat different lines be drawn. \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e\" In view of the major differences in opinion with regard to the inclusion or exclusion of Newark, the issues of transportation time and population levels of appropriately sized districts ought to be dealt with explicitly by State education officials. Had the State Board's plan or any other plan been drawn with reference to specific criteria formulated after consideration of the task to be accomplished, and was therefore a reasonable method of accomplishing the goal by persons given such power in the state system, the Court could then view the matter as requiring only a determination of whether discretion was properly exercised in drawing the lines, etc. Absent such criteria, we feel that the more proper course is to create a situation which will not freeze the district lines by court order, but will create a framework within which the State can make a future determination of proper districts for the area, while insuring that actual desegregation will take place.\n\nThe State Board has claimed that its plan for reorganization does nothing but follow the method approved by the State Legislature in the Educational Advancement Act, and that therefore some weight should be given to it. First, as we noted above, the proposal varies from the statute in certain respects, and we cannot now determine by hindsight what weight was attached to those portions of the statute with which the proposal differs. The State Board's proposal splits at least one district, despite the bond problems which might be caused thereby. We do not know and cannot now guess how the State Legislature would have desired to handle such a problem. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\" The State Board treats rather lightly the size limitation of reorganized districts imposed by the Legislature. It may well be that size is no longer the problem it was once thought to be, \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e\" but we have no evidence upon which we can say with finality that the State Legislature would treat it as such.\n\nSimilarly, to impose a county-wide system although it would offer significant advantages not only to DeLaWarr but also to the Court, would be to order a major shift in Delaware school policy. If such a shift were necessary to remedy a constitutional violation, it would be permissible, but as we find in our treatment of geographic area, infra, pp. 353-354, no such showing has been made here.\n\nNonetheless, as we noted supra, some reorganization is required. The Court must at a minimum determine the districts which will be included in such a reorganization, and make provisions for the governance of the area in the event that the State officials fail to act. We note that our opinion in this regard is not a final determination of the organization of the area and of the lines to be followed in setting up such an area, as would be the case if we were to order one of the reorganization plans proposed to us. Rather, the reorganization outlined infra is effective only in absence of proper state action to change it. Of course, if the state or local officials were to act in such a manner as to defeat or block desegregation under the guise of a shift in the reorganization plan, the Court would be forced to review the State's action in light of the requirements set out in Wright v. Council of City of Emporia, 407 U.S. 451, 92 S. Ct. 2196, 33 L. Ed. 2d 51 (1972); and United States v. Scotland Neck Board of Education, 407 U.S. 484, 92 S. Ct. 2214, 33 L. Ed. 2d 75 (1972).\n\nIn determining how such a reorganization would best be accomplished in light of our limited objectives, we have, whenever possible, attempted to comply with state law. It would seem clear that we are not bound by state law, for this is a matter of a federal remedy for a violation of federal rights. See Louisiana v. United States, 380 U.S. 145, 154-56, 85 S. Ct. 817, 822, 13 L. Ed. 2d 709, 715 (1965); Haney v. Board of Education of Sevier County, 429 F.2d 364, 368 (8th Cir. 1970). However, we read Milliken as requiring that the equity court in ordering desegregation remedies give proper deference to the traditions and acts of the states in setting up educational units. 418 U.S. at 741-42, 94 S. Ct. at 3125, 41 L. Ed. 2d at 1089; and see Gautreaux, 96 S. Ct. at 1543, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483-84. Such decisions are far better left to legislators and the process of compromise than to the rigors of judicial determination. 418 U.S. at 744, 94 S. Ct. at 3126, 41 L. Ed. 2d at 1090. We have, therefore, followed state law in determining the extent of reorganization and the method by which districts will be included, except where those provisions would prevent a remedy from becoming effective. Determinations of methods of governance, and the day-to-day operations of the schools will be left in the hands of appropriate local officials. This Court should have no need to interfere in those decisions, unless they violate federal law or constitutional provisions. In any event, the initial determination will be by those who are by training, expertise and experience qualified to make such judgments. See Milliken, 418 U.S. 717, 94 S. Ct. 3112, 41 L. Ed. 2d 1069.\n\nVI. Remedy\n\nAs we have made clear, reorganization or consolidation of some portion of the existing districts is required, since otherwise an inter-district plan would fail by reason of its administrative burden. While there are undoubtedly problems in the management of large school districts, the problems of curriculum coordination, planning, teacher and staff control and supervision, policy implementation, and coordination of school programs with the needs of the community can be better met by a district with sufficient power to meet the problems which will arise, rather than by having 11 or 12 different districts arrange separate solutions. Moreover, it will allow the parents of children attending the schools to have some voice and control over their child's education by the power to elect school board members.\n\nIn reviewing the evidence, it has become plain that the Court must choose between following the provision of state law which confined reorganized districts to enrollments of fewer than 12,000; and that provision which sought to limit reorganization to whole districts. The reasons for the first limitation were several, including a desire to maintain small units which would require a lower administrative overhead, and to continue the use of small locally elected school boards. \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e\" We have already found that there is substantial professional disagreement over whether the 12,000 population figure is necessary to achieve the administrative economies sought, \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e\" and the present testimony has reinforced that view. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e\" Moreover, as we have already noted, even the State Board in its suggestions to us did not find the 12,000 figure a controlling limitation. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e\"\n\nLocal community control is, of course, an important feature of American education, and we are required to give deference to it unless circumstances dictate otherwise. Milliken, 418 U.S. at 741, 94 S. Ct. at 3125, 41 L. Ed. 2d at 1089, and see Gautreaux, 96 S. Ct. at 1545, 47 L. Ed. 2d at 800, 44 U.S.L.W. at 4484-85. We find that circumstances here indicate that the required change in local control need not be so substantial as to give rise to major problems. The 12,000 pupil limitation would require us to split existing districts, and would for all practical purposes make any reasonable reorganization impossible. The change which we require infra, although initially setting up a large district, is not only subject to appropriate subdivision for local control over issues of policy in particular schools, or local initiative with regard to curriculum, etc., \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e\" but is also subject to redivision into smaller governmental units by action of the State, so long as such subdivision does not result in the frustration of the desegregation objective. Even if the State should decline the opportunity, experience in other states has shown that districts of the size proposed infra can be effectively administered. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e\"\n\nThe alternative in the instant case would be for the Court to attempt to redistribute the population and tax ratables of the area by drawing new district lines. Although such an operation is theoretically possible, and might be accomplished in reliance on the evidence presented by the State Board and other parties, we are unwilling to impose our view of the most reasonable distribution of tax base and population levels. Even if we were to assume, as the State Board evidently did, that Wilmington should be treated separately as the source of the \"problem\" and that no other district lines need be shifted, \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e\" we would be required to determine which alternative presented by the parties was the \"fairest\" way to split that district. For the Court to become involved in such a task in the first instance, would be to raise many of the problems which the Supreme Court in Milliken found to be unsuited for judicial determination. 418 U.S. at 743-44, 94 S. Ct. at 3126, 41 L. Ed. 2d at 1090. And see San Antonio School District v. Rodriguez, 411 U.S. 1, 41, 93 S. Ct. 1278, 1301, 36 L. Ed. 2d 16, 47 (1973). The problem of splitting the liability on bonds and other outstanding obligations also raises difficult questions of how much of a tax \"break\" to allow to some of the districts, \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e\" and an examination of the Educational Advancement Act makes clear that the problem is not one previously determined by the State Legislature. \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e\" For these reasons, the proper course for this Court is to consolidate whole districts, subject to the power of the Legislature to redivide the areas in the future, using appropriate lines which are non-racial in their purpose and effect. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e\"\n\nA. Extent of Area\n\nHaving determined that only whole districts are to be included in the plan; that the 12,000 pupil limitation on enrollments does not apply; and that this Court is not the proper agency to subdivide the area into new districts, we turn to the question of which districts must be included in the remedy to be ordered. It is apparent, of course, that this will affect the question of what will constitute a prima facie desegregated school, and will affect the administrative and other operational burdens.\n\nThis determination is primarily a question of whether two outlying districts, Appoquinimink and Newark are to be included within the scope of the plan. The decision as to Appoquinimink is relatively easy. Only DeLaWarr's plan sought to include Appoquinimink, and then only for the sake of logical consistency in urging a \"County-Wide\" plan, since Appoquinimink would be treated as a separate \"attendance area\". \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e\" Another district partially within the county was excluded since it has no school buildings in the area. \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e\" As Milliken emphasized, the task before the Court is to remedy the violation found. 418 U.S. at 738, 94 S. Ct. at 3124, 41 L. Ed. 2d at 1087. The Court cannot conclude on the present evidence that Appoquinimink would in any way have properly been part of the exercise of discretion of the State Board in eliminating the dual schools at the time of the Educational Advancement Act. \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e\" The district was created by the reorganization, as a combination of the former Odessa and Middletown districts. \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e\" Moreover, the district is apparently operating a unitary system which is approximately 70% white. \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e\" Its schools are located in the approximate center of the district, a substantially greater distance from the major black population centers in Wilmington and DeLaWarr than any other district. Since its inclusion would in any event be of very little impact on the existence of predominately white or black schools in other areas of the county, we have determined that Appoquinimink need not be included.\n\nNewark School District has also urged that it is too far distant from Wilmington to make its inclusion proper, saying inter alia, that transportation time would increase greatly. \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e\" See, Swann, 402 U.S. at 30-31, 91 S. Ct. at 1282, 28 L. Ed. 2d at 574. It has also urged that Mount Pleasant and Conrad seek to include it for an impermissible reason, viz, the prevention of white flight to Newark following the desegregation of other schools in the area. \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e\"\n\nThe mere existence of racial disparity in the enrollments of neighboring districts is not a constitutional violation; \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e\" and thus the existence of such a disparity is no grounds for ordering a remedy. It is clear from other cases, however, that the potential of white flight may be included in the exercise of the Court's informed discretion on what would constitute an appropriate remedy. \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e\" We have already determined that a constitutional violation existed at the State level, and moreover, we have said that the effects of the pre-Brown segregation to which Newark was a party have not yet been dissipated. \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e\"\n\nBased on the evidence presented to us, we think it clear that Newark is not so far from some portions of Wilmington that a workable desegregatory school attendance plan could not be implemented. In fact, transportation times even on the longest and most unlikely routes were not so significantly long as to endanger health or welfare of students. \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e\" See, Swann, 402 U.S. at 30-31, 91 S. Ct. at 1282, 28 L. Ed. 2d at 574. The witnesses from Newark agreed that the present bus route times were not dispositive because the routes would have to be redesigned in light of whatever new assignments were made, \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e\" and that such assignments would most likely be made to include only those schools which were geographically near. \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e\"\n\nIt is difficult to say with any certainty that Newark would have been included in any reorganization had the State Board been entitled to exercise its discretion in 1968. Since Newark at that time had close to 12,000 students, the effect of the enrollment limitation may have been to foreclose Newark's inclusion. \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e\" On the other hand, had the Legislature or the State Board considered desegregation as one of the appropriate goals to be accomplished in the course of reorganization, \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e\" very different criteria might have led to the consolidation of part of either Wilmington or DeLaWarr with part of the present Newark district. We do not, however, rest our holding on such post hoc rationalizations, and on what might have been. Rather, uncontradicted testimony indicates that the stability of any desegregation plan is enhanced by the inclusion of larger geographical areas and higher white populations. \u003cspan class=\"fnref\"\u003e134\u003c/span\u003e\" The Court cannot ignore the fact brought so forcefully to its attention that desegregation is costly, in ways beyond dollars spent on additional equipment and training. The difficulties of declining tax bases, and the problem of preventing growth areas from maintaining the duality of schools in the Northern New Castle County area require the inclusion of Newark.\n\nWe note for the sake of clarity that the inclusion of Newark in the area to be desegregated does not ipso facto require the transportation of students from schools in the far western or southern fringe of the present district to schools in eastern Wilmington and vice versa. Newark shares this problem of distance with the New Castle-Gunning Bedford and parts of Alexis I. DuPont Districts, and shares as well the position of having some of its schools easily accessible to desegregation plans. The issue in assignment of students will be whether the assigning agency in the future meets its burden of showing that the existence of one race schools is not due to the maintenance of a dual system. \u003cspan class=\"fnref\"\u003e135\u003c/span\u003e\"\n\nFor reasons substantially similar, it is apparent that the remaining districts in Northern New Castle County not specifically addressed, supra, must also be included to remedy the inter-district violations found in the last opinion. We will not repeat that analysis, but say simply that the desegregation area which is required to remedy the effects of violations found in the instant case is that area presently comprised of the suburban districts of New Castle County north of the northern line of the Appoquinimink School District, and the District of Wilmington.\n\nB. Numbers\n\nAs we have noted the school age population of the Northern New Castle County area is 80,678, of whom 78.5% are white. \u003cspan class=\"fnref\"\u003e136\u003c/span\u003e\" In the plans submitted to this Court, all the defendants based their enrollment projections on the assumption that every school in the desegregation area would be required to approximate those percentages in their enrollments. \u003cspan class=\"fnref\"\u003e137\u003c/span\u003e\" In addition, one attack leveled at the plan proposed by the Wilmington School Board was that it left some schools \"perilously\" close to enrollment figures which would favor so-called white flight. \u003cspan class=\"fnref\"\u003e138\u003c/span\u003e\"\n\nOrdinarily, racial enrollments of each school would not be a question to be addressed initially by this Court. As the Supreme Court said in Swann, assignment of students is first and foremost a function to be performed by local officials in light of local conditions. We do not propose the imposition of definitive racial quotas for particular schools. Swann, 402 U.S. at 24, 26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571. \u003cspan class=\"fnref\"\u003e139\u003c/span\u003e\" What we set forth here is not a determination of a \"quota\". Rather, it is a statement of what will be considered a desegregated school upon any necessary review of actual assignments made by local officials. \u003cspan class=\"fnref\"\u003e140\u003c/span\u003e\"\n\nThe question to be considered, therefore, is what constitutes a prima facie \"one race\" school within the context of the desegregation area. A \"one race\" school for these purposes will be defined as a school whose racial enrollment figures indicate that its population is substantially disparate from the expected range of enrollments in a genuinely nondiscriminatory system, allowing for a variation in pupil assignments. \u003cspan class=\"fnref\"\u003e141\u003c/span\u003e\" The starting point of any such analysis must be the actual school population figures for each grade of the school system as a whole. \u003cspan class=\"fnref\"\u003e142\u003c/span\u003e\" To that figure must be added a variational range, which is reflective of the informed judgment of the Court on how actual enrollments will affect the perception of the community on whether the school is in fact desegregated, or is predominantly of one race; \u003cspan class=\"fnref\"\u003e143\u003c/span\u003e\" and the psychological impact of the number of students upon the members of the minority. \u003cspan class=\"fnref\"\u003e144\u003c/span\u003e\"\n\nThe figure of approximately 15% variation on either side of the actual minority school age population has been mentioned to the Court as the \"usual figure\". \u003cspan class=\"fnref\"\u003e145\u003c/span\u003e\" Here, however, that figure would produce the substantial possibility of minority enrollments of under 10% in predominantly white schools. The testimony to the Court has been uncontradicted that such a figure presents severe difficulties in the \"identity\" of minority youngsters, who would not see fellow minority students in positions of leadership in the school. \u003cspan class=\"fnref\"\u003e146\u003c/span\u003e\" Moreover, the 15% variation would allow enrollments in schools at the higher end of the range to approach 40% black enrollment, a figure which is said to produce a substantial likelihood of white flight. \u003cspan class=\"fnref\"\u003e147\u003c/span\u003e\" Taking into consideration all of the factors in the present case, including those already described, the geographical proximity of the area and the transportation network available, the Court will consider that any school whose enrollments in each grade range between 10 and 35% black to be prima facie desegregated. \u003cspan class=\"fnref\"\u003e148\u003c/span\u003e\" We emphasize, however, that the assignments made by the local authority must remedy the existence of dual schools and must otherwise be designed to achieve the greatest possible degree of actual desegregation. \u003cspan class=\"fnref\"\u003e149\u003c/span\u003e\" School officials making the assignments may, if they choose, follow a much stricter percentage range whether for reasons of preventing white flight, or otherwise. \u003cspan class=\"fnref\"\u003e150\u003c/span\u003e\"\n\nC. Governance\n\nIn ordering reorganization or consolidation of existing districts, we must define who will be charged with the operation of the system on a day-to-day basis. We repeat that the State Legislature and the State Board of Education may take such steps as are not violative of constitutional rights to change the pattern set here. Although the following governance devices should thus be regarded as interim pending such action by the State, they will necessarily remain operative for so long as the State takes no action.\n\nThe governance of the reorganized desegregation area shall be by a board whose membership will initially be composed of certain representatives from existing boards. Delaware State law presently provides that a school board be composed of five members, except vocational-technical school boards which are made up of seven members. \u003cspan class=\"fnref\"\u003e151\u003c/span\u003e\" A board of this size is small enough to work closely together and to be called together quickly to deal with policy matters. To provide the same per capita level of representation to all constituents as at present would, in an area the size of the desegregation area, require a much larger board. \u003cspan class=\"fnref\"\u003e152\u003c/span\u003e\" Moreover, the Court would have to be concerned with the division of that number among the districts, either on a geographical basis or a population basis. \u003cspan class=\"fnref\"\u003e153\u003c/span\u003e\"\n\nThe interim board will therefore be appointed in accordance with the system used in the reorganizations under the Educational Advancement Act. That is, the new board will consist of five members appointed by the State Board of Education from among the existing boards of the component districts. \u003cspan class=\"fnref\"\u003e154\u003c/span\u003e\" The discretion of the State Board will be controlled to provide some geographical range and population equality only to the extent that one member of the interim board shall be appointed from the present Wilmington Board; one from the Newark Board; one from either the New Castle-Gunning Bedford, DeLaWarr or Conrad Boards; one from Stanton, Marshallton-McKean or Alexis I. DuPont; and one from Alfred I. DuPont, Mount Pleasant or Claymont.\n\nWe are aware, of course, that this method will leave some existing boards without a representative on the interim board. Given the choice, however, between devising our own method of selection or election, and following as nearly as possible the present State law, we have chosen to follow State law, which we deem reasonable under the circumstances. There do not appear to be any potential conflicts of interest among the suburban districts which would require their individual representation. Any potential problems which do arise may be minimized by allowing extensive advisory opportunities for the existing district boards, during an interim period, or by seeking to have the State Board and the State Legislature change the existing mode specified by statute.\n\nThe interim board so appointed will be responsible for the operation of the school system in accordance with 14 Del.C. §§ 1041 et seq., until such time as the State may adopt changes. Included in these responsibilities will be the initial assignment of students for the purposes of desegregation; and the levying of necessary taxes, etc., as well as the hiring of faculty and the choice of curriculum. \u003cspan class=\"fnref\"\u003e155\u003c/span\u003e\"\n\nFor reasons discussed infra, this Court will stay the operation of certain phases of this Opinion until time for final review has passed. The present school boards will continue to maintain their responsibilities during the stay. Nonetheless, the State Board should immediately undertake to appoint the new board, so that that group may begin its planning and other necessary operations. The interim board shall be required to make initial assignments for the fall of 1977, subject to the supervision and control of the State Board of Education, which bears the final responsibility for compliance with the orders of this Court. We assume the State Board will act with sufficient speed to allow the planning and assignment to be made within a time frame which will allow review by the State Board.\n\nUnder the provisions of state law, the old boards of the component districts will be dissolved upon the interim board's assuming full responsibility in accordance with this Opinion. The appointed members of the new board will serve in their capacity as members until elections for new members can be held in the reorganized districts in accordance with existing state law \u003cspan class=\"fnref\"\u003e156\u003c/span\u003e\" or in new election districts designed by appropriate State authority.\n\nVII. Other Issues of Consolidation\n\nAlso before the Court are several categories of issues which relate principally to the operations of the consolidated district. For convenience, these issues are treated here seriatim.\n\nA. Faculty\n\nMost of the plans submitted to the Court included provisions for the implementation of an \"affirmative action plan\" with regard to the hiring and assignment of faculty in a desegregated fashion. The Court is cognizant of the difficulties which may be involved in switching from a system of separate districts, and the potential for abuse which is present. \u003cspan class=\"fnref\"\u003e157\u003c/span\u003e\" We are also cognizant that as a matter of law, racially identifiable faculties are one signal of a racially identifiable school, and the Court, in examining the results of any plan, must necessarily be aware of those figures. \u003cspan class=\"fnref\"\u003e158\u003c/span\u003e\" Several difficulties arise in the present case, however. We have no figures in the record to indicate whether there is a substantial disparity in racial makeup of existing staffs. We have no evidence of violations by the present boards, except some hint that there are presently actions by the Equal Employment Opportunity Commission pending in this regard. \u003cspan class=\"fnref\"\u003e159\u003c/span\u003e\" Under these circumstances, we have no record upon which to determine the scope of any alleged violation, and no basis upon which to order an affirmative action plan.\n\nThe second major issue with regard to faculty relates to the decision of whether to require \"leveling up\" of staff salary and benefits as part of the reorganization. This issue arises because at present the teachers and staff throughout the districts have separate bargaining agents and have separate contracts with each of the districts. \u003cspan class=\"fnref\"\u003e160\u003c/span\u003e\" The issue of \"leveling up\" arises with particular force because the initial annual cost of doing so has been variously estimated as an additional 14 to 16 million dollars or more. \u003cspan class=\"fnref\"\u003e161\u003c/span\u003e\"\n\nTestimony before the Court indicated that as a matter of preference in educational circles, \"leveling up\" is beneficial, since it eases labor strife. In fact, as part of the reorganization of the schools under the Educational Advancement Act, \"leveling up\" was required. \u003cspan class=\"fnref\"\u003e162\u003c/span\u003e\" Briefs of certain of the parties have urged that we consider leveling up; and the State teachers' organization, the Delaware State Education Association, as an amicus, has taken the position that such leveling up is required in order to prevent disruption in the schools as part of the desegregation process.\n\nWe decline to order leveling up, for several reasons. First, as we have made clear, we do not by this Opinion intend to \"freeze\" the organization of schools within the area. We therefore cannot be sure, especially since there was no testimony before us upon which we could even estimate the nature of the differences, to what level salaries in differing combinations of districts might have to rise. Moreover, the issue is directly related to local policies and practices with regard to education and employer-employee relations. If any contractual changes are required, the new board appointed pursuant to this decision or its successor or successors ought to make such a determination. Any decision affecting tax rates and day-to-day operations which is not necessary for the actual desegregation of the schools, is better left in the first instance to the local decision makers. See Milliken, 418 U.S. at 743-44, 94 S. Ct. at 3126, 41 L. Ed. 2d at 1090.\n\nB. Hispanic Students\n\nThe Court allowed representatives of the Hispanic population in the area to intervene to protect the existence of certain bilingual programs and to insure that the success of those programs would not be endangered by any plan which the Court might order.\n\nOur allowance of the intervention and our comments here are designed only to protect the program as it now exists. We make no determination on the present adequacy of compliance with the requirements of 20 U.S.C. §§ 880b, et seq. Nor do we here find that the members of the Hispanic population have otherwise been victims of any discriminatory action on the part of any school district which is a part of this litigation. \u003cspan class=\"fnref\"\u003e163\u003c/span\u003e\"\n\nWith regard to those students already identified as requiring bilingual education, or who are otherwise taking part in such education now, the interim board or such other board or boards as may be appointed by the operation of state law, shall in the course of implementing this decision insure that those students will be placed in schools in sufficient numbers to allow the program to continue; and shall insure that the program will not be reduced or cut back as to those students presently receiving it. In all other respects, we assume that the new district or districts will comply with the requirements of federal law in this regard, including those statutes or regulations of HEW which may require the identification of other students needing such assistance and the provision of the programs made necessary thereby. \u003cspan class=\"fnref\"\u003e164\u003c/span\u003e\" We also note that in enrollment statistics as provided by the State, Hispanic students are listed as a minority population, \u003cspan class=\"fnref\"\u003e165\u003c/span\u003e\" and we assume that the new board or boards will so categorize them for purposes of determining whether a school is racially identifiable. \u003cspan class=\"fnref\"\u003e166\u003c/span\u003e\"\n\nC. Exceptions to General Assignments\n\nFor reasons of equity and practicality, the Court will exempt from any requirement of inclusion in desegregation plans certain students and types of students as follows:\n\nFirst, there are several schools operating in the New Castle County area which serve various special students, e.g., those who are orthopedically handicapped, \u003cspan class=\"fnref\"\u003e167\u003c/span\u003e\" audially handicapped, \u003cspan class=\"fnref\"\u003e168\u003c/span\u003e\" or otherwise eligible for special programs. \u003cspan class=\"fnref\"\u003e169\u003c/span\u003e\" These schools are subject to the day-to-day control of the district in which the are located, and we have no evidence that they presently operate on other than a nonracial basis. We see no reason to change the operation of these schools or the special requirements which they might have with regard to qualification for entrance. The interim board and its successors may continue their operation in their present locations.\n\nSecond, for reasons of practicality, the Court will not require two groups of students to bear the burden of any transfers from present schools which may result from this Opinion. Seniors in the year in which the plan goes into effect would suffer unduly if it became necessary to transfer their files from their present schools at a time when they are most in need of advice, letters of recommendation, and so on, in applying for further education or jobs. Moreover, they have developed strong attachments and loyalties to their present school, and will most likely be serving in positions of leadership in student organizations, whose continuation adds much to the community life of the school. Therefore, rising seniors will not be required to be reassigned.\n\nFor other reasons, the Court will not require the reassignment of kindergarten children. The program presently available in Delaware is for a half-day. The Court is aware of the difficulty in getting children of that age to and from school on a half-day basis, without requiring additional time for transportation. A half-day program is not so significant a part of the educational process as to demand it be made a part of any reassignment of children. Of course, any kindergarten desegregation which can be accomplished by means short of transportation to schools other than those closest to the child's home offering his level of program may and ought to be considered by the assigning agency.\n\nLastly, as to those children who are to be included in the desegregation plan itself, the Court will not at this time require any particular method. Several listings of the order of alternatives to be used are available. See, e.g., 20 U.S.C. § 1713; and Tr. at 2492-96, 2504-06. In making their plans, the new board or its successors should make such changes in attendance boundaries, or other methods as will insure the desegregation of the schools as we have already defined it.\n\nIn order to assist in the orderly transformation to a unitary system, and to prevent any requirement of a burdensome expenditure of funds in the first year of operation, the Court will allow the plan to become effective over a two-year period. The initial desegregatory assignments, especially in the high schools and intermediate schools, must be made for the fall 1977 term. Full compliance with constitutional requirements on all grade levels must be completed with the school year commencing in September, 1978.\n\nIn achieving this goal, the Court will not prevent the utilization of any voluntary method of desegregation, so long as the schools are actually desegregated in accordance with the timetable set forth. Thus, if the new board were to try magnet schools to desegregate the upper elementary grades during the first year of operation, the Court will follow the attempt with great interest. Regardless of the success of that endeavor, however, the Court will require the plan to achieve actual effective desegregation for all affected grades by the second year of operation, by whatever methods should reasonably become necessary.\n\nD. Vocational Technical Schools\n\nThe Court was urged by the Intervening Defendant, New Castle County Vocational Technical Board of Education (\"VoTech Board\") to address the operation of vocational-technical schools in the desegregation area. At present, the operation of the schools in the area is not uniform. One school is operated by the VoTech Board, which taxes county-wide to support it. Two other schools are funded separately by the districts in which they are located, Wilmington and Newark. \u003cspan class=\"fnref\"\u003e170\u003c/span\u003e\" The Court considers the mode by which such education is delivered to the students and the supervising body of such schools to be a matter left to the discretion of state authorities. Absent a showing that the present method offends constitutional guarantees, the Court has no power to interfere. Cf., Milliken, 418 U.S. at 744-45, 94 S. Ct. at 3126, 41 L. Ed. 2d at 1090. Those schools presently operated by districts to be merged into the reorganized district will become the responsibility of the new board or its successor. The DelCastle Center will continue its operation as at present, subject to any change to be made by the State, or its agencies.\n\nVIII. Effect of 20 U.S.C. §§ 1701 et seq.\n\nThe Court requested briefing on the effect of certain amendments to the Equal Educational Opportunity Act passed by Congress in 1974. \u003cspan class=\"fnref\"\u003e171\u003c/span\u003e\" After consideration of the issues raised by the briefs, and an examination of the terms of the Act and the legislative history, it is our view that we have complied fully with the statutory requirements applicable here.\n\nWe note first that Congress explicitly stated that it did not intend to modify or diminish the powers of the courts to enforce fully the Fourteenth Amendment to the Constitution. \u003cspan class=\"fnref\"\u003e172\u003c/span\u003e\" This section was based on a Senate provision included as a declaration of policy by the Conference Committee. \u003cspan class=\"fnref\"\u003e173\u003c/span\u003e\" Moreover, the courts which have considered the matter have held that the law should not be read as diminishing the power of the courts to deal with violations which have been found. See Brinkman v. Gilligan, 518 F.2d 853 (6th Cir. 1975), cert. denied, 423 U.S. 1000, 96 S. Ct. 433, 46 L. Ed. 2d 376, 44 U.S.L.W. 3331 (1975). \u003cspan class=\"fnref\"\u003e174\u003c/span\u003e\"\n\nAny findings required by § 1715 have been set forth supra as part of Section V(C) of this Opinion. \u003cspan class=\"fnref\"\u003e175\u003c/span\u003e\" The requirements of §§ 1715 and 1756, that district lines cannot be altered absent certain showings related to purpose and effect of segregation have been met in the prior opinions of this Court. It is true that in the last opinion we refused to hold that the Educational Advancement Act was passed for racially discriminatory purposes. \u003cspan class=\"fnref\"\u003e176\u003c/span\u003e\" There was no need in that opinion to so hold, nor do we find such a need here. Construing the language of the statute requires us to read \"purpose\" in light of the prior holdings of the Supreme Court with regard to the Fourteenth Amendment. In particular, \"purpose\" must be construed in light of the holding in Milliken, the language of which is similar. We note that the original legislation, available as early as March, 1974, was introduced in specific response to the District Court order in Milliken. 129 Cong.Rec.H. 2160. We have found that the lines drawn in the instant case were drawn with the effect of excluding Wilmington; and that such a decision was made knowing the effect. The decisions of the Supreme Court are clear that knowingly to make a suspect classification is sufficient to create a Fourteenth Amendment violation. \"Dominant purpose\" of the legislators is not and never has been the key to such holdings. See Wright v. Council of City of Emporia, 407 U.S. at 461-62, 92 S. Ct. at 2202, 33 L. Ed. 2d at 60. To read the statute otherwise would require us to vitiate the language found in § 1702(b). We refuse to do so. \u003cspan class=\"fnref\"\u003e177\u003c/span\u003e\" We also note that § 1756 specifically refers to actions within the school districts which have segregatory effects. Such actions have previously been described in our opinions. \u003cspan class=\"fnref\"\u003e178\u003c/span\u003e\"\n\nThe 1974 amendments also include a provision requiring the stay of any order until the time for final appeal has run. See 20 U.S.C. § 1752; cf., id., § 1757. Those provisions are not controlling here, since this opinion deals with a remedy for de jure and not de facto segregation. See Morgan v. Kerrigan, 523 F.2d 917, 920 (1st Cir. 1975), pet. for cert. filed, 44 U.S.L.W. 3614 (U.S. April 27, 1976) (No. 75-1445), and cases cited therein. Nonetheless, we feel that a stay is appropriate here in some respects.\n\nFirst, we acknowledge the Congressional policy expressed. Moreover, it is clearly within the discretion of the Court to approve a stay where the factual situation warrants it. See Scripps-Howard Radio, Inc. v. FCC, 316 U.S. 4, 9-10, 62 S. Ct. 875, 879, 86 L. Ed. 1229, 1233 (1942); All Writs Act, 28 U.S.C. § 1651. Here, the rights of the parties demand that certain aspects of the Opinion be carried out immediately, while portions be stayed. Thus, the State Board will be required to name the members of the Interim Board, and that group will be required to begin its planning and preparation immediately. Taxation of residents, liability to bondholders, contracts with teachers and staff, and title to property in the event of changes in the pattern of reorganization are properly issues of concern to the interim board. To avoid disruption in the administration of the schools for the upcoming year, actual vesting of full responsibility in the new board for the day-to-day operation of the schools will be delayed until September, 1977.\n\nThe State Board shall set a day certain prior to September 1, 1977, when full responsibility will be transferred to the new board. Prior to such transfer, any expenses incurred by the new board shall be the responsibility of the component districts and the State Board. The State Board is also directed to select a name for the reorganized district or its successors, in the event the new board is unable to agree on such a name.\n\nDuring the period prior to September 1977, and the transfer of full responsibility to the new board, the existing component boards may, of course, cooperate in attempting to implement magnet or other proposals which might achieve some level of desegregation.\n\nIX. Miscellaneous Other Issues\n\nThe Court was asked to rule on certain other matters which relate principally to the ongoing operation of the new districts which might be formed, and of other areas of state law. The present record does not allow us to rule on these motions, and any decision with regard to them must be left for further actions to be initiated by complaining parties in light of further developments.\n\nThe first issue relates to the imposition by the Court of limits on further growth of certain schools which it is urged will still be operated as predominantly white schools. This was suggested to the Court as a means of restricting the scope of any actual transfer of students, while preventing the continuation or expansion of a dual system. The present record and the plan ordered by the Court herein do not now require us to make such an order. We must assume that the local authorities charged with the implementation of the plan will do so in good faith, and will follow existing law with regard to the construction of new facilities. \u003cspan class=\"fnref\"\u003e179\u003c/span\u003e\" If they do not, we are certain that interested parents will insure that a proper remedy is pursued. Until an assignment plan is drawn by the new board and approved by the State Board, we have no way of knowing how many, if any, schools will be identifiably one-race majority schools, nor where those schools would be located. As part of its burden in justifying the existence of those schools, the local authorities should include whatever safeguards they feel are needed to prevent maintenance or creation of dual schools. \u003cspan class=\"fnref\"\u003e180\u003c/span\u003e\"\n\nB. Private Transportation\n\nIn the prior opinion, we found that the subsidy provided by the State to cover the transportation of students to private schools had some effect on maintaining the racial disparity between the Wilmington and suburban school populations. \u003cspan class=\"fnref\"\u003e181\u003c/span\u003e\" The plaintiffs have continued to press this point to the Court as a ground for relief against the State. The Court understands that the subsidy presently costs the State upwards of $700,000 per year, \u003cspan class=\"fnref\"\u003e182\u003c/span\u003e\" which the plaintiffs urge could be used for other purposes. We are urged on the basis of its racial effects to declare the statute unconstitutional, and enjoin its operation.\n\nWe refuse to so hold. Our previous finding indicated only that the effect of the statute was to assist in maintaining racial disparity. We assume for present purposes that the remedy which we have ordered is complete, and will end the existence of a dual system. Any injunction against the continuation of the State's policy of providing this subsidy must await a showing of its effects under the operation of the remedial plan here ordered. Other possible grounds of unconstitutionality were not raised by the parties, and are not ruled upon. Plaintiffs' motion for an injunction to prevent payment by the State of any subsidy for transportation to private schools is hereby denied.\n\nC. Monitoring the Remedy\n\nLastly, we have been urged to appoint a monitoring commission to oversee the development and implementation of the plan. \u003cspan class=\"fnref\"\u003e183\u003c/span\u003e\" On the present record, we see no need for such a commission to be invested with power by the Court. The existing committees have derived their power from the concern of State or local officials and groups. To add the power of the Court to these groups would raise disturbing issues of how to support and supervise such an ad hoc \"master\". \u003cspan class=\"fnref\"\u003e184\u003c/span\u003e\" The parties before the Court include school districts, with their associated expertise and staffs, which will continue in existence up to the actual implementation and beyond, and the State Board of Education with its statutory supervisory and appeal powers. \u003cspan class=\"fnref\"\u003e185\u003c/span\u003e\" The Court also takes judicial notice that in the past the State has implemented desegregation decisions in good faith. We have no reason to find that the present course of events will differ in that regard. Absent showings of bad faith or obstruction which are not present here, we see no need for a special master or other monitoring body.\n\nThe operation of public schools is traditionally a matter of local concern, and properly so. \u003cspan class=\"fnref\"\u003e186\u003c/span\u003e\" This Court has intervened only reluctantly in that process, and only for limited purposes. We were urged throughout the hearings in this case to be concerned with the \"quality of education\" offered by the area schools. That is much more properly the concern of local officials and the parents of children in the schools. Our duty here is not to impose quality education even if we could define that term, though we must be conscious that the implementation of the remedy does not defeat the ability of local agencies to fulfill their duty to offer it. We do not find in Brown v. Board of Education, 347 U.S. 483, 74 S. Ct. 686, 98 L. Ed. 873 (1954), a mandate for District Courts to concern themselves with how well the educative function is performed. The decision in Brown was rather that the operation of a dual school system, based on race, is an impermissible classification under the Fourteenth Amendment. \u003cspan class=\"fnref\"\u003e187\u003c/span\u003e\" There has been much discussion, and there undoubtedly will continue to be much writing upon the topic of whether black children learn better in desegregated classrooms. \u003cspan class=\"fnref\"\u003e188\u003c/span\u003e\" Our holding does not rest upon those considerations, not least because judges are unqualified and inexpert in answering such questions. \u003cspan class=\"fnref\"\u003e189\u003c/span\u003e\" Rather, we have found a constitutional violation in the racially suspect treatment of Wilmington during a school district reorganization, and other actions in the past by the State and local authorities. We believe that those violations, upon the implementation of this Opinion, will be remedied. Therefore, we dissolve the three judge panel convened for these purposes. Under the obligation imposed upon the District Court by Evans v. Ennis, 281 F.2d 385, 391 n. 1 (3rd Cir. 1960), supervisory jurisdiction will remain in the District Court. Further action will be taken, however, only upon the initiation of the parties by proper motion or complaint.\n\nSubmit Order.\n\n\u003cspan class=\"fn\"\u003e1. See, Evans v. Buchanan, 379 F. Supp. 1218, 1220-21 (D.Del.1974), for a recitation of the previous course of this litigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. 379 F. Supp. at 1223.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Evans v. Buchanan, 393 F. Supp. 428 (D.Del.1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The original parties before the Court included the purported class of black children of Wilmington, and the State Board of Education. The Wilmington School Board intervened as a party plaintiff in the liability phase, and has continued in the remedy phase of the hearings. A group representing the interests of Hispanic and bilingual children [hereinafter \"Hispanic Intervenors\"] was permitted to intervene by the Court in the remedy phase solely for the purpose of protecting the bilingual program as it presently operates from disruption by any remedy ordered. See Transcript of Hearings of the Remedy Phase at 203-04 [hereinafter \"Tr. \"]. The plaintiff class representing black children has not previously been certified under Rule 23, Fed.R.Civ.Proc., and a motion is pending before the Court concerning whether the named representatives and their attorneys adequately and fairly represent the interests of the purported class. See, infra, Part II. The Court after its first opinion in this matter, and in light of the decision in Milliken, allowed each of the surrounding suburban school districts to intervene as party defendants. 393 F. Supp. at 430, and n. 1. In addition to the districts named therein, the New Castle County Vocational-Technical School Board has intervened in the remedy phase. Other interested groups, including groups of concerned parents on various sides of the issue; teachers' unions; and special committees have been permitted to take part as amici, by filing briefs only.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Throughout the course of this litigation, the Courts have continually held that the primary burden of the duty to desegregate rests with the State Board. See, e.g., 393 F. Supp. at 430. It was also apparent that any plans submitted should be reviewed by professional educators in order to sift out those plans which were unworkable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The proposals were developed by the professional staff of the State Board; other professional educators; individual citizens; and interested groups. See Docket Items # 332-41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See 393 F. Supp. 428 and 379 F. Supp. 1218. It should be noted that at the time of Brown v. Board of Education [Brown I], 347 U.S. 483, 74 S. Ct. 686, 98 L. Ed. 873 (1954), Delaware by statute required the maintenance of separate schools; and Gebhart v. Belton, 33 Del. Ch. 144, 91 A.2d 137 (1952) (holding that separate schools were \"unequal\" under Plessy v. Ferguson, 163 U.S. 537, 16 S. Ct. 1138, 41 L. Ed. 256) was a companion case to Brown I. Since that time, there have been eleven reported decisions by this Court and the Third Circuit with regard to this case. See, 393 F. Supp. 428; 379 F. Supp. 1218; 207 F. Supp. 820 (D.Del.1962); 195 F. Supp. 321 (D.Del.1961); 281 F.2d 385 (3rd Cir. 1960); 173 F. Supp. 891 (D.Del.1959); 172 F. Supp. 508 (D.Del.1959); 256 F.2d 688 (3rd Cir. 1958); 152 F. Supp. 886 (D.Del.1957); 149 F. Supp. 376 (D.Del.1957); 145 F. Supp. 873 (D.Del.1956). In this sense, Delaware has much in common with some other areas which have been the subject of school litigation for much of the last two decades. See, e.g., Leedes \u0026 O'Fallon, School Desegregation in Richmond: A Case History, 10 Univ. Of Rich.L.Rev. 1 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Several types of abbreviations are used throughout this Opinion to refer to documents introduced in the case, etc. All evidentiary material admitted in the most recent phase of the hearings is identified by the inclusion of the abbreviation \"Rem.\" in the reference, and further identified by the designation of the party introducing them, and the status of the party as defendant or plaintiff. Thus, \"D.DPI.Rem. # 24\" refers to Exhibit 24 introduced in the Remedy phase by the State Defendant, the Department of Public Instruction; D.Newark Rem. # 1 refers to the Exhibit # 1 introduced by the defendant school district of Newark; Int.Pl.Rem. # 1 refers to Exhibit # 1 introduced by the intervening school board of Wilmington, etc. Exhibits introduced at prior phases are so identified. Those from the liability phase are identified as \"Exh. (liability phase)\". Those from prior proceedings not directly concerned with the present relief are identified by the year in which the hearings were held.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See 393 F. Supp. at 432; PX 23-0 (Liability Hearing) at back cover, for figures and their derivation. The remaining area above the 251 square miles is contained in the Smyrna School District, only half of which lies in New Castle County, and the Appoquinimink School District which occupies the next southernmost tier of the county. Id. Only one plan before the Court urged the inclusion of Appoquinimink, and under that plan, it was to be an \"attendance area\" complete unto itself. See, D.DeLaWarr Rem. # 3. Since under no plan proposed to the Court would Appoquinimink be a part of any transfer of students, or other remedy of the violation found in the prior opinions, and for other reasons discussed infra, pp. 353-354 et seq., the Court has focused its attention on northern New Castle County, comprised of the Districts of Alfred I. DuPont; Alexis I. DuPont; Claymont; Conrad; DeLaWarr; Marshallton-McKean; Mount Pleasant; Newark; New Castle-Gunning Bedford; Stanton; and Wilmington. The references in this opinion to the Northern New Castle County area, unless otherwise specified, should be understood as descriptive of that area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The figures are derived by calculation from data given in D.DPI.Rem. # 24, the final enrollment figures for 1975 broken down by race.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See D.DPI.Rem. # 24. Alexis I. DuPont is 93.8% white; Alfred I. DuPont is 97.8% white; Claymont is 94.9% white; Conrad, 95.9%; Marshallton-McKean, 94.9%; Mount Pleasant, 96%; New Castle-Gunning Bedford, 92.9%; Newark, 94.2%; Stanton, 98.1%. It should also be pointed out that the Wilmington schools house 746, or 66.1% of the Hispanic students in the same area. Of course, the existence of a disparity in the racial characteristics of the population of the city and the suburbs is not a constitutional violation standing alone. Nor do we impose a remedy solely because of the existence of such a disparity. See Parts III, IV, infra. The foregoing facts are set out solely as an aid and to set the context of the violations previously found.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See generally, PX 23-K (liability phase) at 12, 13. In some instances, the prior school districts had comprised a \"white\" district and a \"black\" district within coterminous boundaries operating separate schools. See Evans v. Buchanan, 207 F. Supp. 820 (D.Del.1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See State's Exhibit 8 (1959 hearings).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See PX 23-0 (liability phase), where the frontpiece describes the changes as inter alia, the Middletown and Odessa Districts being combined to form Appoquinimink; H. C. Conrad, Oak Grove, Richardson Park and Newport being combined to form the Conrad Area District; Arden and Mount Pleasant being combined to form the present Mount Pleasant District; and Stanton and Dickinson being combined to form the present Stanton District.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See 393 F. Supp. at 431-43, 446, quoting Milliken.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. 418 U.S. 717, 744-46, 94 S. Ct. 3112, 3126, 41 L. Ed. 2d 1069, 1091 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Swann v. Charlotte-Mecklenburg Board of Education, 402 U.S. 1, 91 S. Ct. 1267, 28 L. Ed. 2d 554 (1971) (\"Swann\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See Indianapolis Board of School Comm'rs v. Jacobs, 420 U.S. 128, 95 S. Ct. 848, 43 L. Ed. 2d 74 (1975); DeFunis v. Odegaard, 416 U.S. 312, 94 S. Ct. 1704, 40 L. Ed. 2d 164 (1974). But see Sosna v. Iowa, 419 U.S. 393, 95 S. Ct. 553, 42 L. Ed. 2d 532 (1975); Franks v. Bowman Transp. Co., 424 U.S. 747, 96 S. Ct. 1251, 1258, 47 L. Ed. 2d 444, 455, 44 U.S.L.W. 4356, 4357-58 (1976). We consider that the \"named representatives\" are those members of the purported class who continue to have standing by reason of the present enrollment of their children in the public schools, see note 19, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Prior to this phase of the case, the action had been treated by all concerned as a proper class action. See, e.g., 379 F. Supp. at 1219; 393 F. Supp. at 446. The only issue we need determine is whether the named plaintiffs continue fairly and adequately to represent the interests of the class. There has not been a prior determination that the action could proceed as a class action, as required by Rule 23(c), since the action was commenced before the amendments to the Rule in 1966; that is, at a time when no such requirement was present. See 3B Moore's Federal Practice, PP 23.02-1, 23.50. The present phase arises under the continuing jurisdiction of the Court over the case, 379 F. Supp. at 1220; and no separate certification was sought or made. We note that this action does not raise all the questions possible under Rule 23. The potential class of all or a substantial portion of the school children of Wilmington meets the requirements of numerosity, common questions of law and fact, typical claims and defenses; and it is clear that the State Board has acted or refused to act on grounds generally applicable to the entire class, and there exists no danger of inconsistent adjudications or single actions being dispositive of rights. See, Fed.R.Civ.Proc. Rule 23(a), (b)(1) and (2). Nor has there been any serious dispute of those facts. The named plaintiffs have established by affidavit that some of their children remain in the system, and the State Board has not pressed the point of mootness. It is clear to us that the jurisdictional requirement of case or controversy which is inherent in the mootness issue has been satisfied. It cannot be questioned that there exists sufficient adversity between the parties to meet the requirements of a concrete sharpening of issues. See Franks v. Bowman Transp. Co., supra, 424 U.S. 747, 96 S. Ct. 1251, at 1259, 47 L. Ed. 2d 444, at 455, 44 U.S.L.W. 4356, at 4358.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. 3B Moore's Federal Practice, P23.07[1] at 23-352-53.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Cf., Sosna v. Iowa, supra, 419 U.S. at 399, 95 S. Ct. at 556, 42 L. Ed. 2d at 536.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The \"Committee for the Improvement of Education\", a group to which the State Board points as epitomizing the antagonism of interests, submitted a document in the nature of an amicus brief, which urges, inter alia, a consolidation of districts, and the creation of mandatory minority housing programs in the suburbs. See Docket Item # 430 at A-2, A-3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See note 7, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See Hills v. Gautreaux, 425 U.S. 284, 96 S. Ct. 1538, at 1543, 47 L. Ed. 2d 792, at 797, 44 U.S.L.W. 4480, at 4483 (U.S. April 20, 1976); Milliken, 418 U.S. at 737-38, 94 S. Ct. at 3123, 41 L. Ed. 2d at 1086 (plurality opinion) and 418 U.S. at 753, 94 S. Ct. at 3131, 41 L. Ed. 2d 1069 (Stewart, J., concurring); and Swann, 402 U.S. at 15, 91 S. Ct. at 1275, 28 L. Ed. 2d at 566.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Brown v. Board of Education, 349 U.S. 294, 75 S. Ct. 753, 99 L. Ed. 1083 (1955).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See Gautreaux, 96 S. Ct. at 1543, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 418 U.S. at 744-45, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1090; and see, Gautreaux, 96 S. Ct. at 1543, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. 418 U.S. at 744-46, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1090 (plurality opinion); 418 U.S. at 755-56, 94 S. Ct. at 3132, 41 L. Ed. 2d at 1097 (Stewart, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. \"Specifically, it must be shown that racially discriminatory acts of the state... have been a substantial cause of interdistrict segregation.\" 418 U.S. at 745, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1091. See also, \"The Constitution simply does not allow federal courts to attempt to change that situation unless and until it is shown that the State, or its political subdivisions, have contributed to cause the situation to exist.\" 418 U.S. at 756, 94 S. Ct. at 3133, 41 L. Ed. 2d at 1098, n. 2 (Stewart, J. concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. 393 F. Supp. at 433-38, aff'd., per curiam, 423 U.S. 963, 96 S. Ct. 381, 46 L. Ed. 2d 293, 44 U.S.L.W. 3299 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Idem. at 439-46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See note 29, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Cf. Gautreaux, supra, 96 S. Ct. at 1538, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. See Milliken, 418 U.S. at 756, 94 S. Ct. at 3132, 41 L. Ed. 2d at 1096, n. 2 (Stewart, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Milliken, 418 U.S. at 744-45, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1091; Swann, 402 U.S. 1, 91 S. Ct. 1267, 28 L. Ed. 2d 554.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See Gautreaux, 96 S. Ct. at 1543, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483-84.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. \"Specifically, it must be shown that racially discriminatory acts of the state or local school districts, or of a single school district have been a substantial cause of interdistrict segregation. Thus in interdistrict remedy might be in order where the racially discriminatory acts of one or more school districts caused racial segregation in an adjacent district, or where district lines have been deliberately drawn on the basis of race.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. 393 F. Supp. 428, aff'd. per curiam, 423 U.S. 963, 96 S. Ct. 381, 46 L. Ed. 2d 293, 44 U.S.L.W. 3299.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. \"Unlike the situations in Detroit, where the suburban districts had never been implicated in de jure segregation, . . . and in Richmond, where suburban districts had participated in de jure segregation, but independently from the city school system, . . ., de jure segregation in New Castle County was a cooperative venture involving both city and suburbs. Although the Wilmington School District was predominately white at that time, a desegregation decree could properly have considered city and suburbs together for purposes of remedy. At that time, in other words, Wilmington and suburban districts were not meaningfully 'separate and autonomous'.\" 393 F. Supp. at 437 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See Gautreaux, 96 S. Ct. at 1543, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483-85. Justice Stewart's emphasis in Gautreaux on the independence of local governmental units, and the requirement that federal courts defer to that independence is an echo of that same concern in Milliken. See, Gautreaux, 96 S. Ct. at 1543, 47 L. Ed. 2d at 797, 44 U.S.L.W. at 4483. Although the local districts in Delaware have great autonomy, the violations here go directly to that autonomy. Thus, at the time when they carried on segregative acts, the local districts did so in such a way as to make clear that they were not so separate from Wilmington and its operations as now to be free from all culpability for the remaining effects of the segregatory regime which was never completely abolished. 393 F. Supp at 437-38. The combination of their prior acts negating complete independence; and the State's actions to create boundaries which favored the existing separation of races is sufficient to show that the lines of independent authority are entitled to less weight here than in Milliken. See Gautreaux, 96 S. Ct. at 1545, 47 L. Ed. 2d at 800, 44 U.S.L.W. at 4484-85. As we note infra, p. 352, we respect the autonomous functioning of the school districts, and we will avoid needless interference with those local operations. We establish here only that the remedy which we order may include the suburban districts, because their existence and their actions were part of the violations which lead to the remedy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. See, 393 F. Supp. at 438.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Milliken, 418 U.S. at 746, 94 S. Ct. at 3128, 41 L. Ed. 2d at 1092.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Gautreaux, 96 S. Ct. at 1545, 47 L. Ed. 2d at 800, 44 U.S.L.W. at 4484; Green v. Board of Education of New Kent County, 391 U.S. at 439, 88 S. Ct. at 1694, 20 L. Ed. 2d at 724.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In its last opinion, this Court was careful to note that it had not considered what scope any remedy would be required to take. 393 F. Supp. at 446, n. 37. For that reason, the Court sought the submission of a plan that would be confined to the present Wilmington School District. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See D.DPI.Rem. # 24 at 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See 379 F. Supp. at 1223, \u0026 n. 8. The present enrollments of schools listed in that footnote continue to be over 95% black, except for the former Howard High School. Elbert Elementary is 97.6% black; Stubbs Elementary is 97.6% black; Drew Elementary is 98.2% black; and Bancroft Middle School is 96.3% black. The Howard High School has been reopened as a vocational-technical school, and is now 85.2% black. The Court notes that the only other vocational-technical school in the area presently open (a third will open next fall) is 93.2% white.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See D.DPI.Rem. # 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Tr. 1506-07.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. See p. 342, supra ; Tr. 1507.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Under the proposal, Stubbs would become 86.5% black; Drew would become 75.7% black; Elbert would become 79.8% black; and Bancroft Middle School would become 88.1% black. See D.DPI.Rem. # 19 at 14, 16 and 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. E.g. Cool Springs Elementary would be 92.9% black; Harlan Elementary would be 93.9% black; Highlands Community School, containing only the fifth grade of one \"cluster\" would be 93.5% black, while two of its components for the lower grades (K-4), Gray and North East, would be 92.3% and 90% black respectively. D.DPI.Rem. # 19, at 13, 14. The Warner Middle School would be 91.9% black; and the Burnett Middle School would be 92.3% black. Id. at 21, 23. P. S. DuPont High School would be 91.1% black. Id. at 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. 379 F. Supp. at 1223.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. 393 F. Supp. at 433.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. 393 F. Supp. at 445.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. 393 F. Supp. at 437-38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. \"As we said in Green [ Green v. New Kent County School Board, 391 U.S. 430, 88 S. Ct. 1689, 20 L. Ed. 2d 716], a school authority's remedial plan or a district court's remedial decree is to be judged by its effectiveness. Awareness of the racial composition of the whole school system is likely to be a useful starting point in shaping a remedy to correct past constitutional violations.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. See pp. 335-336, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. See, pp. 336, 342, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. This is the so-called \"Zone Transfer Plan\", see D.DPI.Rem. # 8. In each instance, except one, a part of Wilmington would be joined to two or more suburban districts. In one instance, the zone would include only one suburban district.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. The lines were drawn so as to equalize substantially racial enrollments, tax assessments and populations, while maintaining geographical contiguity and the identity of existing suburban districts. See Tr. at 213-17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Other familiar types of voluntary programs were proposed initially by various interested persons or groups, but were not carried forward by the State Board before the Court. These included majority-to-minority transfer programs; and the amendment of state law to allow transfers among districts. 14 Del.C. § 603 presently provides for payment of \"tuition\" when a child who is a resident of one district attends school in another district. Subsection (c) allows a student who is a resident of Wilmington, Alexis I. DuPont, Mount Pleasant, or Alfred I. DuPont to attend school in any of those districts, provided that the board of the \"receiving\" district approves the application for transfer. The proposed amendment would be designed to restrict the approval power to reasons of space or reasonable disciplinary requirements, to prevent exclusion on racial grounds, and to extend the number of districts involved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. See Tr. 233-40. That is, each of the schools would be not only educationally sound, but also be seen by sufficient numbers of white and black parents and students as desirable enough to cause the voluntary enrollment of the school to be desegregated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. See, e.g., Tr. 554, 682-83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Green v. New Kent County School Board, 391 U.S. 430, 438-39, 88 S. Ct. 1689, 1694, 20 L. Ed. 2d 716, 723 (1968) (emphasis in the original) (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Swann, supra, 402 U.S. at 26, 91 S. Ct. at 1281, 28 L. Ed. 2d at 572.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. See D.DPI.Rem. ## 12, 13, 14. Tr. 585-90, 616-17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. See, e.g., Tr. 792-97, 682.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See Tr. 302-04, 392, 400, 437-38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. For example to operate forty-six magnet programs in Houston will cost approximately $9.3 million. The present 34 programs are funded at $5 million. D.DPI.Rem. # 12 at 195; Tr. 527-28. The proposed programs here are funded at well below that level. See, D.Mt.Pl.Rem. # 1 at 104 and D.Mt.Pl.Rem. # 1A at 3; D.Alf.I.Rem. # 1 at A-7; D.Stanton Rem. # 1 at 39; and D. Alexis I.Rem. # 1 at 24, 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. See, e.g., Tr. at 95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Green v. New Kent County School Board, 391 U.S. at 441, 88 S. Ct. at 1696, 20 L. Ed. 2d at 725.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Thus, for example, a city school presently serving grades K-6, would be clustered with two or more suburban schools serving the same grade levels. Under the plan, the city school might then house all the K-2 students presently enrolled in all three schools, and the suburban schools would divide the remaining grades and students between them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. See, p. 345, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. See D.Alfred I.Rem. # 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. See, id. and Tr. 2775-85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. \"The importance of bus transportation as a normal and accepted tool of educational policy is readily discernible in this and the companion case. . . . The District Court's conclusion that assignment of children to the school nearest their home serving their grade would not produce an effective dismantling of the dual system is supported by the record. . . . . . . In these circumstances, we find no basis for holding that the local school authorities may not be required to employ bus transportation as one tool of school desegregation. Desegregation plans cannot be limited to walkin school.\" 402 U.S. at 29-30, 91 S. Ct. at 1282, 28 L. Ed. 2d at 574.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. See Swann, 402 U.S. at 28-32, 91 S. Ct. at 1282, 28 L. Ed. 2d at 573.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. Milliken, 418 U.S. at 742-44, 94 S. Ct. at 3125, 41 L. Ed. 2d at 1089, catalogues some of the major problems.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. 14 Del.C. § 1049.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. 14 Del.C. §§ 1902-23, 1058.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. Swann, 402 U.S. at 28, 91 S. Ct. at 1282, 28 L. Ed. 2d at 573.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. See Tr. 2836, 2861.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. See Tr. at 2775-76.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. See Tr. at 2810-12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. Tr. at 2803-04, 2805-06, 2808.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. See 402 U.S. pp. 30-31, 91 S. Ct. p. 1282, 28 L. Ed. 2d p. 574, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. See Tr. 213. They were also drawn to allow equalization of tax bases, sufficient space in existing facilities for the projected enrollments, etc. Id. 213-17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. See D.DPI.Rem. # 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. See D.Mt.Pl.Rem. # 9. The \"laboring oar\" of this dispute was borne by the attorneys for Mount Pleasant, Conrad and Newark. Mount Pleasant and Conrad sought to include Newark in order to prevent it from becoming or remaining a white haven in an otherwise desegregated area, and to spread the associated tax burden. Newark sought to narrow the area, at least to its exclusion. The DeLaWarr District, favoring a county-wide plan, also provided some evidence on the inclusion of Newark.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. See Part VI A, pp. 354-355, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. See 393 F. Supp. at 438, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. 14 Del.C. § 1004(c)(2), (3) required that only \"whole districts\" which were contiguous could be joined, and then only if the resulting enrollment of the reorganized district was no greater than 12,000 pupils. According to D.DPI.Rem. # 18, three of the five reorganized districts proposed would have enrollments in excess of 12,000. See D.DPI.Rem. # 18 at 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. Under the Educational Advancement Act, the salaries of all employees in a reorganized district were set at the level of the highest salary for that position among the former component districts. 14 Del.C. § 1009. This insured that all staff personnel in the new district with equal service and skills would be receiving equal pay. Such leveling up would be quite expensive, however, at a time when bond issues and tax increases have not met with a favored response by the electorate. For that reason, the State chose not to recommend leveling up as part of its plan. See Tr. 1558-61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. See D.Mt.Pl.Rem. ## 7, 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. The Wilmington Board agreed through certain of its witnesses that a reorganization of the desegregation area would eventually prove necessary. See Tr. 2361, 2370. The feeling of the Wilmington Board, not unlike that of this Court, was that the State Legislature or its delegates should be the appropriate agency to make the determinations of district lines, etc. Since no details of a \"Wilmington redistricting proposal\" were submitted or otherwise put before the Court, we do not comment further upon it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. See D.DeLaWarr Rem. ## 2, 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. See D.DeLaWarr Rem. # 2 at 7-10; cf., e.g., Tr. at 1045A, 1045B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. See, e.g., Tr. at 451-52.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. See p. 336, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. Milliken, 418 U.S. at 746, 94 S. Ct. at 3128, 41 L. Ed. 2d at 1092.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. See, e.g., Tr. at 2948.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. See Tr. at 1603-04.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. But see also, 14 Del.C. § 1028, which deals with the division of an existing district into two or more separate districts, and the resulting treatment of the indebtedness of the former district. Under that section, the indebtedness of the component district remained the obligation of the residents of the area of the former district, to be collected through taxation by the new districts whose boundaries included the former district lines. 14 Del.C. § 1028(d), (e). We note, however, that the problem of bonded indebtedness becomes much different when a district is not simply divided, but divided and merged into still another district. This would require maintaining the identity for tax purposes of the former district's area, so that the residents of that area might be taxed for purposes unrelated to their present district, and to thus create several different tax structures within a new district dependent upon whether one lives in the former district area split off or the whole joint district, which would be not only administratively burdensome, but would also require some modifications in the present tax structure of the New Castle County districts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. Cf., 393 F. Supp. at 444-45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. See, 393 F. Supp. at 444.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. Id. at 445.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. See, e.g., Tr. at 1269-70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. See note 96, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. See Tr. 1837-38, 1901.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. We note that some school districts in Florida presently operate with an even larger number of students; in one instance, almost triple that here. (Dade County in 1973-74 had 259, 949 pupils). The Court also heard testimony from Charles Wendorf, presently an administrator with the Prince George's County School System in Maryland, see Tr. at 1807, et seq., which serves some 148,000 students. Tr. at 1810-11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. See Tr. at 170, 253, 254-55, 260, 265. We do not treat the issue of whether the determination that only Wilmington would be split might be an improper classification. Such a plan was proposed at the time of the 1968 Act. See, e.g., Tr. 2551-52.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. Tr. 1563-69; 1667-69; D.DPI.Rem. # 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. Compare 14 Del.C. § 1006 and § 1028.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. See Wright v. Council of City of Emporia, 407 U.S. 451, 92 S. Ct. 2196, 33 L. Ed. 2d 51 (1972); United States v. Scotland Neck Board of Education, 407 U.S. 484, 92 S. Ct. 2214, 33 L. Ed. 2d 75 (1972); Keyes v. Denver School District # 1, 413 U.S. 189, 93 S. Ct. 2686, 37 L. Ed. 2d 548 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. See D.DeLaWarr Rem. # 2 at 160, and # 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. This is the Smyrna District, which is south of Appoquinimink, and whose boundaries cross from New Castle County into Kent County. See D.DeLaWarr Rem. # 3; Tr. 1933-34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. See generally, 393 F. Supp. at 445.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. See PX-23-0 (liability phase), at frontpiece.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. See D.DPI.Rem. # 24 at 1. The enrollment of the district as a whole is 72.2% white, and the schools range from 69.0% white to 76.3% white, an insignificant variation in light of the fact that the variation is centered in the elementary schools which range from 70.2% to 75.6% white, which even in the school with the greatest elementary enrollment would amount to an actual difference of 35 pupils in an enrollment of 658.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. See Tr. at 131, 1090; D.New.Rem. # 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. See, e.g., Tr. at 890. In general, if Newark were excluded, its schools would remain more than 90% white (they are presently 94.2% white), while most of the schools in the other districts would have substantially greater black enrollments. See D.DPI.Rem. # 18; D.Mt.Pl.Rem. # 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. See, Milliken, 418 U.S. at 756, 94 S. Ct. at 3133, 41 L. Ed. 2d at 1097 (Stewart, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. See, Wright v. Council of City of Emporia; supra, 407 U.S. at 465, 92 S. Ct. at 2204, 33 L. Ed. 2d at 63; United States v. Scotland Neck Board of Education, 407 U.S. at 490-91, 92 S. Ct. at 2215, 33 L. Ed. 2d at 81.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. See 393 F. Supp. at 433 \u0026 n. 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. See Tr. at 1123, 1130-31; see also, Tr. at 1064-83. It should also be noted that at present, vocational education students from Newark are bused out of the district and into Wilmington. Tr. at 283.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. Tr. at 1138-39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. Id. Moreover, Newark found unobjectionable the time required to transport black children to Newark, focusing its objection instead on the time required to transport white children into Wilmington. Tr. 1235, 1240.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. See 393 F. Supp. at 444.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. Id. at 445.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134. See, e.g., Tr. at 890, 899, 983, 1007-08.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135. Swann, 402 U.S. at 26, 91 S. Ct. at 1281, 28 L. Ed. 2d at 572.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136. See, pp. 5-6, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137. See, e.g., D.DPI.Rem. # 8; D.DPI.Rem. # 18; D.Mt.Pl.Rem. # 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138. See, e.g., Tr. at 887-88.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139. \"If we were to read the holding of the District Court to require, as a matter of substantive constitutional right, any particular degree of racial balance or mixing, that approach would be disapproved and we would be obliged to reverse. The constitutional command to desegregate the schools does not mean that every school in every community must always reflect the racial composition of the school system as a whole.\" 402 U.S. at 24, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140. That is, the function of racial enrollment figures is to serve as a signal to both the assigning officials and the Court on review of their actions, of whether the system has in fact been desegregated or remains dual. Milliken, 418 U.S. at 741, 94 S. Ct. at 3125, 41 L. Ed. 2d at 1089, n. 19; Swann, 402 U.S. at 26, 91 S. Ct. at 1281, 28 L. Ed. 2d at 572.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141. A range of variations is required, simply because students do not come neatly packaged in groups of 30 per grade with perfect racial balances. See Tr. at 908. There are also variations in the racial enrollments between school levels, e. g., there are more black students in elementary schools than in high schools. See Tr. 2572.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142. See, Swann, 402 U.S. at 24-26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143. See Tr. 898-900, 992-93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144. See Tr. at 904, 905-06; 2350-02; 2417-18; 2426.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145. See Tr. 2571, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146. See citations, note 144, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e147. See Tr. at 887, 905, 983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e148. Some schools on the far edges of the county may necessarily remain all or predominantly of one race because of transportation problems or other practical difficulties. In those instances, the assigning authority will bear the burden of showing that assignments were genuinely nondiscriminatory. See, Swann, 402 U.S. at 26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e149. Swann, 402 U.S. at 26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e150. The record before the Court indicates that racial enrollments within a small range are possible if school officials so determine. Tr. 2526. Our Brother Layton's concurring and dissenting opinion seemingly advocates the adoption of a variation of the Wilmington Metro Plan, our objections to which are discussed in another section of our opinion. For the sake of clarity, we emphasize that the racial characteristics of the population of the area as a whole are the necessary starting point in determining whether a school is disproportionately of one race. See Swann, 402 U.S. at 26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571. Our figures of not less than 10% nor more than 35% black, which signal the prima facie achievement of a desegregated school, are not arbitrary figures, but are drawn from the record as described, supra, p. 356. Whether the result is commensurate with the constitutional standard established in Swann, 402 U.S. at 26, 91 S. Ct. at 1280, 28 L. Ed. 2d at 571, must await the actual assignments by the proper authorities to achieve \"the greatest possible degree of actual desegregation, taking into account the practicalities of the situation.\" Davis v. Mobile County School Comm'rs., 402 U.S. at 37, 91 S. Ct. at 1292, 28 L. Ed. 2d at 581.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e151. 14 Del.C. §§ 1052, 1064.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e152. Assuming that the reorganized districts were to have a peak enrollment of 12,000 students and be controlled by a five person board, there would be a ratio of board members to students of 1 to 2400. To achieve that same ratio where 80,678 students are involved would require a board of 33 members.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e153. The component districts range in enrollment from Newark which has 20.9% of the total enrollment of the desegregation area, to DeLaWarr which has 3.9%; Wilmington has 17.1%; Alexis I. DuPont has 4.03%; Alfred I. DuPont has 12.7%; Claymont has 4.09%; Conrad has 6.61%; Marshallton-McKean has 4.6%; Mount Pleasant has 6.03%; New Castle-Gunning Bedford has 11.1%; and Stanton has 6.61%. Figures derived from D.DPI.Rem. # 24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e154. See 14 Del.C. § 1065.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e155. The powers of this Board will, of course, be circumscribed by the general powers of the State Board under 14 Del.C §§ 121, 122; and the decisions of the new board would be in accordance with the regulations which the State Board is empowered to make.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e156. See 14 Del.C. §§ 1051, 1052.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e157. See Tr. 941, 2354-57, 2405-07, 2518-21, 2825-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e158. See generally, Keyes v. Denver School District # 1, 413 U.S. at 202, 93 S. Ct. at 2694, 37 L. Ed. 2d at 559; and cf. id. at 206, 93 S. Ct. at 2696, 37 L. Ed. 2d at 562.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e159. See Tr. at 2359.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e160. The faculty and staff salaries are funded in part by the State which establishes a \"floor\". Local districts may then supplement this amount with local funds according to agreements made with local teacher representatives. See 14 Del.C. § 1711.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e161. Tr. 2247; Int.Plaintiffs' Exh.Rem. # # 9, 10; D.New.Rem. # 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e162. 14 Del.C. § 1009.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e163. Cf., Keyes v. Denver School District # 1, 413 U.S. 189, 93 S. Ct. 2686, 37 L. Ed. 2d 548 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e164. See, e.g., 20 U.S.C. §§ 1703(f), 1921(b)(12); 20 U.S.C. § 880b, et seq.; and Lau v. Nichols, 414 U.S. 563, 94 S. Ct. 786, 39 L. Ed. 2d 1 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e165. See, e.g., D.DPI.Rem. # 24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e166. We have heard no testimony on the question of whether Hispanic students would constitute a minority in Delaware for Fourteenth Amendment purposes, and we do not determine that the State Board or the local board or boards would be constitutionally required to treat the Hispanics as a minority group. The issue before the Court on the intervention was solely the protection of existing programs, and our Opinion is limited strictly to that question. See generally, Keyes v. Denver School District # 1, 413 U.S. at 197, 93 S. Ct. at 2696, 37 L. Ed. 2d at 556.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e167. Leach School in DeLaWarr District, which draws from the county as a whole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e168. Sterck School draws from the whole State.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e169. D.DeLaWarr Rem. # 3 shows six special schools altogether.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e170. In actuality, the VoTech school located in the Newark area is not yet in operation. This school, the so-called Hodgson Career Center, will open in the fall of 1976.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e171. Act of August 21, 1974, 88 Stat. 514, 20 U.S.C. §§ 1701 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e172. See 20 U.S.C. § 1702(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e173. See Sen. Conference Rep. 93-1026, reprinted in 1974 U.S.Code Cong. \u0026 Admin.News, Vol. 3, 4206 at 4219. The effect of this section was critical in the debate over passage of the Act. As originally drawn by Rep. Esch of Michigan, the amendments had no such proviso. See 129 Cong.Rec.H. 2158 (March 26, 1974). [All Cong.Rec. citations are to the daily edition.] Following attempts at substitution of other provisions, 129 Cong.Rec.H. 2166 (remarks of Mr. Anderson, March 26, 1974), the House passed the Esch bill as an amendment to the Education Act. 129 Cong.Rec.H. 2177. The Senate refused to agree to the Esch bill, however, and passed differing legislation, which included the separate provision (the so-called Scott-Mansfield amendment) that the terms of the bill were not in any way to affect the power of the courts to deal with violations of constitutional rights. For a comparison of the provisions of each chamber, see 129 Cong.Rec.H. 7209 (remarks of Mr. Quie, July 25, 1974). The Senate rejected the Esch bill only narrowly, but the Senate Conference Committee refused to agree to any bill which did not include that disputed language. The House was similarly incalcitrant and instructed its Committee several times to stand by its original language. See, e.g., 129 Cong.Rec.H. 5844-45 (June 27, 1974); 129 Cong.Rec.H. 6815 (July 22, 1974). Finally, because the bill provided funding for certain other educational programs and was greatly desired, the Conference Committee agreed to the inclusion of the Senate language as a part of the Congressional policy statement. See Senate Conference Report, supra. The supporters of the original legislation in the House responded with accusations of betrayal, and the statements that the result of the amendment was the effective \"gutting\" of the provisions of the bill dealing with remedy. See, e.g., 129 Cong.Rec.H. 7402 (remarks of Mr. Esch, July 31, 1974); H. 7406 (remarks of Mr. Landgrebe, July 31, 1974); H. 7410 (remarks of Mr. Parris, July 31, 1974); H. 7414 (Mr. Bauman, July 31, 1974). The members of the Conference Committee from the House responded by saying that the effect of the provision was only to insure that the courts would have the opportunity to review the legislation for constitutionality, see 129 Cong.Rec.H. 7413 (remarks of Mr. Lehman, July 31, 1974), an understanding which flies in the face of the language itself and the powers of the federal courts since Marbury v. Madison, 5 U.S. (1 Cranch.) 137, 2 L. Ed. 60 (1803). Although generally the remarks of those who oppose the passage of legislation are not convincing as to its purpose and meaning, because of their zeal to defeat it, see Ernst \u0026 Ernst v. Hochfelder, 425 U.S. 185, 96 S. Ct. 1375, 1385, 47 L. Ed. 2d 668, 681, 44 U.S.L.W. 4451, 4457 n. 24 (1976); here such remarks are useful to show that the language was seen as changing the original House bill to something quite different from the intent of the framers of the original legislation. This is particularly true when the Senate Committee members in their remarks to their own house made the same point in support of the amendment as accomplishing what the Senate had desired. See, e.g., 129 Cong.Rec.S. 13382 (remarks of Senator Javits, July 24, 1974). Our understanding of the effect of that provision is therefore the most logical reading of both the language on its face, and its intent by the framers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e174. Cf., Swann, supra, 402 U.S. at 17, 91 S. Ct. at 1276, 28 L. Ed. 2d at 567, construing 42 U.S.C. § 2000c.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e175. 20 U.S.C. §§ 1715 \u0026 1756 deal with the preservation of existing district lines, absent particular findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e176. 393 F. Supp. at 439.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e177. See generally, Vorchheimer v. School Dist. of Philadelphia, 532 F.2d 880 at 885 (3rd Cir. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e178. We note that this reading of the meaning of purpose is in accordance with the views expressed by the Senate Conference Committee who were the drafters of the language. \"In this case what [the bill] basically provides -- and I do not agree with this because I think busing is a necessary tool, it should not have too many restrictions on it -- is that no youngster may be bused beyond the second nearest school to him unless it is in accordance with the Fifth and Fourteenth Amendments to the Constitution of the United States.\" 129 Cong.Rec.S. 13349 (Senator Pell, July 24, 1974). Similarly, Senator Javits in support of the Conference Committee report spoke of the provision as requiring only an \"affirmative showing\" of a violation of the constitutional rights of individuals. 129 Cong.Rec.S. 13382 (Senator Javits, July 24, 1974). The bill was addressed, it should be noted, to transportation plans, not consolidation plans. See 129 Cong.Rec.H. 2160 (Mr. Esch, March 26, 1974), and remarks of Senator Pell, supra. Nonetheless, the Senate language is helpful as it also speaks to \"purpose\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e179. See, e.g., Swann, 402 U.S. at 20-21, 91 S. Ct. at 1278, 28 L. Ed. 2d at 568; Keyes v. Denver School District # 1, 413 U.S. at 201-02, 93 S. Ct. at 2694, 37 L. Ed. 2d at 559.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e180. See, Swann, 402 U.S. at 20-21, 91 S. Ct. at 1278, 28 L. Ed. 2d at 568; Tr. at 2511-12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e181. See 393 F. Supp. at 436-37; 14 Del.C. § 2905.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e182. See 393 F. Supp. at 436, and cf., Tr. at 1493.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e183. The Governor's Committee on the Schools Decision, appearing as an amicus, filed a paper on the need for such an agency, and volunteered to serve as the nucleus of such an organization. The Court is also aware that various concerned citizens have begun preparations to assist in efforts to make the implementation of the plan smooth and peaceful.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e184. See generally, Note, The Wyatt Case: Implementation of a Judicial Decree Ordering Institutional Change, 84 Yale L.J. 1338 (1975), discussing the difficulties of a monitoring commission appointed in Alabama as a result of litigation concerning the operations of a state mental hospital. Wyatt v. Stickney, 344 F. Supp. 373 (M.D.Ala.1972), modified sub nom., Wyatt v. Aderholt, 503 F.2d 1305 (5th Cir. 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e185. See, e. g., 14 Del.C. §§ 121, 122, 1058.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e186. See, Milliken, 418 U.S. at 741-42, 94 S. Ct. at 3125, 41 L. Ed. 2d at 1089; San Antonio School District v. Rodriguez, 411 U.S. 1, 93 S. Ct. 1278, 36 L. Ed. 2d 16 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e187. See, e.g., United States v. Jefferson County Bd. of Educ., 372 F.2d 836, 871 n. 76 (5th Cir. 1966); see generally, Fiss, Racial Imbalance in the Public Schools: the Constitutional Concepts, 78 Harv.L.Rev. 564, 590-98 (1965); Pollak, Racial Discrimination and Judicial Integrity: A Reply to Professor Wechsler, 108 U.Pa.L.Rev. 1 (1959); Read, The Judicial Evolution of the Law of School Integration since Brown v. Board of Education, 39 Law \u0026 Contemp.Prob. 7, 9 fn. 11 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e188. For a review of the recent literature on the subject, see Symposium The Courts, Social Science and School Desegregation, 39 Law \u0026 Contemp.Prob. 50, passim (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e189. Cf., Milliken, supra, 418 U.S. at 744, 94 S. Ct. at 3127, 41 L. Ed. 2d at 1090. DISSENT FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. This Act permitted the State Board of Education to redraw a number of school district boundaries but provided that the lines of the Wilmington School District, a predominantly Black district, should remain as heretofore.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. There are also approximately 800 Hispanic, Oriental and \"other\" students in the District who make up the remaining 5.5% of the school population.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Even after this reassignment of White students among Black schools, the latter would remain heavily Black. Thus, Elbert would be 79.8% Black; Stubbs, 86.5% Black; Drew, 75.7% Black; and Bancroft Middle School, 88.1% Black.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Newark, for instance, buses some 11,773 students daily as a part of its own separate school program.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. These figures are not exact because some students live within walking distance of their newly assigned schools and some students presently bused will simply be bused to a different school under the majority's plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This is, of course, theoretical in the sense that schools and their classes vary considerably in overall numbers as well as proportions of Black to White. However, the overall proportion of Black to White in the Wilmington School District is about 9 to 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. These numbers are calculated by seeking a 3:1 Black to White, student ratio. The present Black student population of the Wilmington schools is 11,733 and the present White student population is 1,360. Thus, in order to achieve a 3:1 ratio, the Black student population of the Wilmington schools must be reduced to 9,819. This would require busing 1,914 Black students out of Wilmington and replacing them with an equal number of White suburban students. For ease of discussion, I have rounded the figure up to 2,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. There is nothing inflexible about the drawing up of a plan provided an acceptable racial mix is maintained both in students as well as faculty, staff and personnel. For instance, and purely as a suggestion, Wilmington could be divided into 4 Zones: A, B, C and D; each zone would be attached to its immediately contiguous school district in the County so that 4 exchange areas would be created: Zone A -- Mount Pleasant; Zone B -- Alfred I. DuPont; Zone C -- Alexis I. DuPont; Zone D -- Conrad. Thus, adapting the school population ratio of the 4 districts to each other (for instance, Alfred I. is 5 times larger than Alexis I.), then Mount Pleasant and Zone A would exchange about 300 Whites and Blacks; Alfred I. with Zone B about 1,000; Alexis I. with Zone C about 300; and Conrad with Zone D about 400. On the other hand, the State Board might deem it wiser to spread the burden more equally among a greater number of districts. Moreover, constant experimentation could be carried on. One of the great oppositions to Court-ordered busing is that it tends to destroy the neighborhood school concept. In order to preserve this concept as much as possible, a different 4,000 Whites and Blacks might be bused each year. Nor is it essential to adopt as a basis for this alternative proposal a 3 Black to 1 White ratio. A 2 1/2 Black, or 2, Black, to 1 White ratio might be established. This would, of course, increase the number of children to be bused to 5,000 or 6,000. If a plan somewhat like the above were adopted, I think it only fair that the State pay all the costs, capital or otherwise, upon the theory that it created the constitutional violation which must be remedied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. It may be argued that cost is irrelevant where constitutional rights are concerned. However, cost is not irrelevant in comparing several plans, any one of which is designed to cure the constitutional violation involved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The thing that disturbs me most about the majority plan is that it departs so sharply from the past that, with respect to numbers of students to be bused and the cost, neither the citizens of this County, the State Board of Education nor the Court itself know quite where we are heading.\u003c/span\u003e\n\n",
    "body_length": 147121,
    "citedas": [
      "416 F. Supp. 328"
    ],
    "attorneys": "Louis L. Redding, Irving Morris, and Joseph A. Rosenthal, of Morris \u0026 Rosenthal, Wilmington, Delaware, for individual Plaintiffs. , Louis R. Lucas, of Ratner, Sugarmon \u0026 Lucas, Memphis, Tennessee, Richard Allen Paul, Wilmington, Delaware, for Intervening Plaintiffs, The Board of Education of the City of Wilmington. , William Prickett, and Mason E. Turner, of Prickett, Ward, Burt \u0026 Sanders, Wilmington, Delaware, Philip B. Kurland, Chicago, Illinois, for Defendants. , John P. Sinclair, and William Poole, of Potter, Anderson \u0026 Corroon, Thomas S. Lodge, of Connolly, Bove \u0026 Lodge, Sheldon N. Sandler, of Bader, Dorsey \u0026 Kreshtool, Samuel R. Russell, of Biggs \u0026 Battaglia, Edward W. Cooch, Jr., of Cooch \u0026 Taylor, Wilmington, Delaware, Jerome O. Herlihy, of Herlihy \u0026 Herlihy, Clifford B. Hearn, of Balick \u0026 Hearn, Christian White, Stephen R. Spiller, Aida Waserstein, Wilmington, Delaware, Oscar Garcia-Rivera, Richard J. Hiller, and Herbert Teitelbaum, New York, New York, James T. McKinstry, of Richards, Layton \u0026 Finger, James M. Tunnell, Jr., and Richard D. Allen, of Morris, Nichols, Arsht \u0026 Tunnell, Howard M. Handelman, of Bayard, Brill \u0026 Handelman, William H. Bennethum, Wilmington, Delaware, for Intervenors and Amici.",
    "category": [],
    "judges": "CALEB M. WRIGHT, Senior District Judge.",
    "citation_count": 0
  }
}
