{
  "id": "uIqEQGYBTlTomsSBHGSZ",
  "document": {
    "title": "United States v. Kopituk",
    "full_title": "UNITED STATES OF AMERICA v. DOROTHY O. KOPITUK, RAYMOND C. KOPITUK, OSCAR MORALES, FRED R. FIELD, JR., CLEVELAND TURNER, JAMES VANDERWYDE, LANDON L. WILLIAMS, WILLIAM BOYLE, GEORGE BARONE",
    "jurisdiction": "Eleventh Circuit",
    "date": "1982-11-04T00:00:00.000Z",
    "docket": "No. 80-5025",
    "body": "CHARLES R. SCOTT, District Judge:\n\nAppellants, waterfront union officials and employers, were convicted in the United States District Court for the Southern District of Florida on numerous charges arising from their participation in a widespread pattern of corruption aimed at securing control of the business activity at several major ports in the Southeastern United States. The evidence adduced at the seven-month trial\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e revealed an extensive, well-orchestrated conspiracy spanning a period of more than 10 years in which union officials pressured waterfront employers to make illegal payoffs in return for assured labor peace and lucrative business contracts.\n\nIn 1975, the Federal Bureau of Investigation ('FBI') began an extensive undercover investigation of the corrupt enterprise when Joseph Teitlebaum, a waterfront employer who had participated in the conspiracy for several years, agreed to cooperate with the government. With Teitlebaum's assistance, FBI agents successfully infiltrated the enterprise and obtained tape-recordings of conversations transpiring in the course of illegal payoff transactions. The covert investigation continued until January 1977 when the case became public with the issuance of grand jury subpoenas.\n\nOn June 7, 1978, a federal grand jury, sitting in Miami, Florida, returned a 70-count, 128 page indictment charging appellants and others\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e with a variety of offenses including: racketeering, 18 U.S.C. § 1962(c); conspiracy to engage in racketeering, 18 U.S.C. § 1962(d); payment and receipt of money and other articles of value in exchange for labor peace, 29 U.S.C. § 186; extortion, 18 U.S.C. § 1951; receipt of kickbacks in connection with a labor matter, 18 U.S.C. § 1954; obstruction of justice, 18 U.S.C. § 1503; and filing false income tax returns, 26 U.S.C. § 7206.\n\nTEITLEBAUM\n\nJoseph Teitlebaum was the government's \"star\" witness at trial.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Teitlebaum's involvement in the conspiracy was extensive and long-lasting and, as such, his testimony constituted the backbone of the government's case.\n\nIn the 1960's, Teitlebaum was a vice-president of Eagle Shipping, Inc., a company that performed stevedoring\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e services at the port of Miami. In 1966, Teitlebaum met appellant Fred R. Field, Jr. at a labor negotiation meeting in Miami. Field, who was General Organizer of the International Longshoremen's Association ('ILA'), asked Teitlebaum if they could talk privately somewhere. (9:83).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Teitlebaum arranged to use a friend's boat to take Field on a fishing trip. Field brought three other union officials with him on the trip, including Benny Astorino. (9:84-85).\n\nAt one point on the trip, Astorino told Teitlebaum that Field was coming to Miami to establish a new checkers'\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e union and that it would be in Teitlebaum's \"best interest\" to do business with Field. He added that Teitlebaum could demonstrate his \"good faith\" by paying him $3,000. (9:87-88). Teitlebaum testified that Field was sitting about eight feet behind him and Astorino, looking at Teitlebaum, while the conversation was taking place. (9:86).\n\nTeitlebaum responded that he would have to discuss the matter with his father and uncles, who were responsible for running Eagle, Inc. (which owned Eagle Shipping, Inc.) (9:89). Shortly after returning from the fishing trip, Teitlebaum received telephone calls from two of his customers.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e (9:91). The next day, Teitlebaum received a telephone call from Field in which Field asked him if he had \"had a change of heart about the three aces.\" (9:92). Teitlebaum told him that he had not and that he did not appreciate Field pressuring his customers to persuade Teitlebaum to sign a union contract. (9:92). Field responded, \"Listen, prick, you'll sign the contract and like it.\" (9:93). Teitlebaum ultimately signed the contract.\n\nThe next stage of Teitlebaum's involvement in the criminal enterprise did not commence until 1972.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Throughout the intervening years, Teitlebaum had come to know appellant George Barone, president of the checkers' union in Miami (ILA Local 1922), appellant William Boyle, secretary-treasurer of ILA Local 1922, appellant James Vanderwyde, office manager of ILA Local 1922, and appellant Cleveland Turner, president of the longshoremen's union in Miami (ILA Local 1416).\n\nIn 1972, Teitlebaum purchased a 90-ton crane to be used for loading and unloading ships and formed M \u0026 M Crane Co. Within a week after the crame was brought to the Dodge Island Seaport at the port of Miami, someone had vandalized it. (9:110). Shortly thereafter, Teitlebaum received a visit from co-defendant Sebastian \"Benny\" Cotrone. Cotrone advised Teitlebaum that he should \"make . . . . peace\" with appellant Barone if he wished to stay in business. Cotrone told Teitlebaum that \"they\" wanted \"a piece of the action from the crane.\" (9:112). Teitlebaum subsequently began leasing the crane to Marine Terminals, Inc. ('MTI'), a waterfront company managed by George Wagner, who had close ties to the union. (9:128). Wagner was paid a kickback of $15 for every hour of crane use billed to MTI. (19:93-94).\n\nIn early 1972, Teitlebaum contacted appellant Boyle about obtaining a contract to perform stevedoring services for the Mardi Gras, a passenger ship owned and operated by the Carnival Cruise Lines. (19:109). Boyle said that he would talk with \"the boys\" and let Teitlebaum know if it could be done. A couple days later Boyle informed Teitlebaum that he could have the contract, but that it would cost him \"two big ones and a free cruise every now and then.\" (19:109). Teitlebaum agreed and his company subsequently obtained the contract. He paid Boyle $2,000 in installments of $200 per week. (19:123).\n\nWhen it became apparent to Teitlebaum that it was necessary to reduce the number of porters assigned to work on the Mardi Gras in order to save money, Teitlebaum presented the problem to Boyle, who in turn told Teitlebaum to contact appellant Cleveland Turner, president of the Miami longshoremen's union. Teitlebaum did so and worked out an agreement to pay Turner $50 per week to reduce the number of porters assigned to the dock. Turner told Teitlebaum to talk with the head porter on the dock and to have the head porter call Turner if there was any problem. Teitlebaum made payoffs to Turner from 1972 to 1976. (19:114).\n\nAt one point in early 1972, Boyle told Teitlebaum that Teitlebaum's cousin owed the union between $1,800 and $2,000 in delinquent health insurance and dues payments and that it would be in Teitlebaum's best interest to pay the debt on his behalf. (19:95). Teitlebaum agreed to pay the debt. In October or November of 1972, after the debt had been paid, appellant James Vanderwyde told Teitlebaum: \"You did a nice job paying off your cousin's debt. Don't let it stop.\" Teitlebaum asked him what he was talking about, to which Vanderwyde responded: \"Are you stupid? We're going to have control of this fucking port right here. Control. That's what counts, control.\" (19:128). Teitlebaum testified that while he was saying this, Vanderwyde made a fist and gritted his teeth. (19:128).\n\nApproximately one week after his conversation with Vanderwyde, Teitlebaum saw Boyle at the Dodge Island Seaport. Boyle told him that he was going to have to start paying the union $200 per week, but that he would receive additional business for doing so. Boyle made specific reference to the Siboney, a cargo ship operated by Ocean Trailer Transport, Inc. (19:129). Teitlebaum agreed that if he acquired the Siboney contract, he would pay Boyle the $200 per week. (19:129).\n\nTeitlebaum did obtain the Siboney contract and began making the weekly payments to Boyle. He was frequently late in making the payments, however, prompting Boyle to tell him on one occasion that \"if the little guy for George found out that you were late, you would have a lot of trouble.\" (19:209). Boyle identified the \"little guy\" as appellant Vanderwyde. (19:209).\n\nIn late 1973, Teitlebaum met with Boyle at the Miami ILA office and told him that he was interested in improving his company's position by acquiring a contract to service either the Mamenic Line or Gran Columbiana Line. Boyle responded that Teitlebaum should speak with appellant Field about it. (20:13). That evening Field visited Teitlebaum's office and Teitlebaum reiterated his interest in the Mamenic and Gran Columbiana lines. Field told Teitlebaum that the Mamenic contract would be the easier of the two to acquire. Teitlebaum expressed concern because he knew of a Mamenic representative that was working for a competing stevedoring company, but Field told Teitlebaum not to worry, stating that the representative could \"be taken care of.\" (20:14). Teitlebaum reported to appellant Barone that Field had promised to help him acquire the Mamenic account. Barone said he would check into it and subsequently gave Teitlebaum instructions as to whom he should contact regarding the account. Teitlebaum's company entered into a contract to perform stevedoring services for the Mamenic Line in June 1974. (20:21-23). As payment for the assistance he received in acquiring the Mamenic account, Teitlebaum, at Boyle's request, purchased three pairs of cruise tickets and gave them to Boyle. (20:29-30).\n\nLater in 1974, Teitlebaum learned that Harrington \u0026 Co., a competing business operated by co-defendant Neal L. Harrington, was submitting bids to perform stevedoring work for Nopal Line, a Norwegian steamship company, which was already one of Teitlebaum's customers. Teitlebaum complained to Boyle about the fact that he was paying $200 per week and that he expected his accounts to be protected. Boyle said he would \"talk to the boys\" and take care of the matter. (20:36). Shortly thereafter, Barone, in Vanderwyde's presence, told Teitlebaum that Harrington \u0026 Co. would withdraw its bid. (20:37-38). Teitlebaum's company retained Nopal's business.\n\nIn early 1975, Teitlebaum expressed to Boyle his interest in acquiring a contract to do business with Puerto Rico Marine Management, Inc. ('PRMMI'). Boyle once again said he would \"talk to the boys\" about it. (20:62). Approximately one week later, Teitlebaum ran into Barone in the hallway outside Teitlebaum office and reiterated his desire to obtain the PRMMI contract. Barone rubbed his foot on the floor, picked up his trouser leg and said, \"Heavy.\" (20:63). Teitlebaum testified that Barone had done precisely the same thing when Teitlebaum received the Siboney contract.\n\nThe next day Teitlebaum met with Boyle who told him it would cost \"five up front\" for the PRMMI contract. Teitlebaum asked whether he meant \"big ones or little ones,\" to which Boyle responded, \"Big ones.\" Teitlebaum asked what his guarantee was and Boyle replied, \"If you don't get this one, the next big one belongs to you.\" (20:64). Either that same day or the following day, Teitlebaum gave Boyle $5,000 in $100 bills. (20:67). Teitlebaum, however, did not get the PRMMI contract.\n\nIn the summer of 1975, Boyle told Teitlebaum that he wanted some cruise tickets for appellant Vanderwyde and for appellant Landon Williams, president of ILA Local 1408 in Jacksonville, Florida. Boyle told Teitlebaum that Williams wanted to give the tickets to the son of the mayor of Jacksonville as a wedding present. (20:71). Teitlebaum accommodated the request by obtaining three sets of tickets from the Commodore Cruise Line, one of Teitlebaum's customers. (20:72). Teitlebaum's company paid for all the tickets. (20:76).\n\nIn September 1975, Teitlebaum was arrested on state charges of solicitation to commit murder, conspiracy to commit murder and attempted murder. (20:80). In return for his pledge to cooperate with the government in the instant matter, he was permitted to enter a plea of nolo contendere to the misdemeanor charge of solicitation to commit murder and the other charges were dropped. (20:80). He received a sentence of one-year probation.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e From the time of his arrest until conclusion of the investigation, Teitlebaum worked closely with FBI agents in an effort to gather direct evidence of the corrupt enterprise operating on the waterfront.\n\nIn the latter part of 1975, Barone told Teitlebaum, in Vanderwyde's presence, that he should \"take Savannah\" and that Boyle would tell him what to do. (21:31). Accordingly, Teitlebaum set up a company called Georgia Container Agencies to operate at the port of Savannah, Georgia. (21:35). Georgia Container Agencies was to receive a lucrative contract from Zim-Israel Navigation Co., Ltd., an Israeli steamship line. In return for the Zim contract in Savannah, however, Boyle told Teitlebaum that he would have to surrender another account. Teitlebaum told Boyle he would give up the Mamenic account and Boyle said that would be acceptable, stating that he would tell \"the fat man\" about Teitlebaum's selection. (21:41). Teitlebaum testified that he knew from previous reference that the fat man was appellant Field. (21:42).\n\nIn December 1975, Boyle informed Teitlebaum what it would cost for the Zim contract in Savannah: $15,000 \"front money,\" one percent of the value of all ocean freight handled, $12 for each container loaded or unloaded from a ship and 50 cents per ton for bulk cargo. (21:124-126). Teitlebaum agreed to pay the $15,000 front money to Boyle in 10 installments of $1,500 each. (21:131). Teitlebaum made several of the $1,500 Savannah payments to Boyle, occasionally using money provided by the FBI.\n\nIn January 1976, Teitlebaum travelled to Savannah with Boyle for the purpose of meeting co-defendant Elizah Jackson, president of ILA Local 1414 in Savannah, to determine how much money was going to have to be paid to Jackson. (22:11). Boyle negotiated with Jackson privately and then told Teitlebaum it would cost $300 \"up front,\" $50 per week, and an additional $50 for each ship serviced. (22:25).\n\nUsing a tape recorder fitted into his boot by FBI agents, Teitlebaum was able to record some of the conversations that transpired in the course of making the Savannah payments, as well as other payments. Teitlebaum stopped carrying the tape recorder, however, following a February 1976 incident which indicated the defendants may have been getting suspicious of him. On February 11, 1975, Boyle summoned Teitlebaum to the ILA office in Miami. When he arrived Boyle was waiting for him along with co-defendants Vincent James Fiore, Jr. and Cornelius \"Butch\" Vanderwyde.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Boyle told Teitlebaum, \"Take off your shoes, get comfortable.\" Teitlebaum testified that he became extremely nervous. He took off his shoes, pulled out his pockets and said, \"What's wrong with you?\" Boyle simply said, \"Everything is fine.\" (22:118). Teitlebaum related the incident to FBI Special Agent Ray Maria and it was decided that Teitlebaum would no longer wear a body recorder. (22:120).\n\nIn April 1976, Teitlebaum visited the ILA office in Miami to give Boyle one of the weekly \"peace\" payments. Boyle was not there so Teitlebaum gave the money to appellant Vanderwyde. Vanderwyde complained that Teitlebaum was getting too far behind on his payments and said that he wanted at least $500 more. Teitlebaum went next door to his office and borrowed $500 cash from his uncle and his cousin. He returned to the ILA office and gave the money to Vanderwyde. Vanderwyde patted him and said, \"Good boy.\" (24:21-22).\n\nVanderwyde then told Teitlebaum that he wanted to take a cruise and said he needed six pairs of tickets. (24:23). The following month Boyle gave Teitlebaum a list containing the names of persons who wanted to take a cruise in June on the Mardi Gras. Included on the list were Boyle and his wife and Vanderwyde and his wife. (24:37-38). Teitlebaum purchased the tickets for them. (24:113).\n\nIn June 1976, Teitlebaum and representatives of the Zim steamship line discussed the possibility of Georgia Container Agencies, Teitlebaum's Savannah company, performing waterfront services for the Zim line in Mobile, Alabama. Teitlebaum went to Boyle to discuss how much it would cost him to expand into Mobile and Boyle estimated that it would cost $5,000 up front under the same operating conditions that were in effect in Savannah. (24:50). Shortly thereafter, Boyle informed Teitlebaum that appellant Field had contacted co-defendant Isom Clemon, president of ILA Local 1410 in Mobile, and made arrangements for Teitlebaum to meet Clemon. (24:72).\n\nOn June 11, Boyle flew to Mobile and was met by Clemon at the airport. Clemon told Teitlebaum that \"he was the man in Mobile,\" that Boyle had told him to \"take care\" of Teitlebaum, and that \"he [Clemon] liked his little white envelope.\" At a later meeting with Clemon in Mobile, Teitlebaum, in the presence of FBI Special Agent Richard Artin (who was posing as an employee of Teitlebaum's), paid Clemon $400 while they were driving to a restaurant to have lunch. (24:138-140). At the restaurant, Clemon told Teitlebaum and Artin that he would not even be talking with them if he had not received an \"okay\" from Boyle or Field. (24:141). After that meeting, Agent Artin continued to make payments to Clemon. (38:175; 39:30).\n\nSubsequent to Teitlebaum's first meeting with Clemon, Boyle informed him that \"Freddie [appellant Field] underestimated the price\" for expanding into Mobile and that it would cost $10,000 up front rather than $5,000. (24:84-85). Teitlebaum was told that he could satisfy this obligation by making five $1,000 weekly installment payments, waiting 30 days, and then making five additional $1,000 weekly payments. (24:97).\n\nIn July 1976, a business associate of Teitlebaum's contacted him regarding a company that wished to move four trailer loads of cigarettes through the port of Miami without having the cigarettes unpacked and then repacked (\"stripped\" and \"stuffed\") by union dockworkers as was required under the union contract. Teitlebaum explained the situation to Boyle who said that the cigarettes could move through untouched if the shipper agreed to pay an extra $200 per load. The shipper so agreed and the $800 was incorporated into a special invoice as \"extra handling\" charges. (24:146-148). The same arrangement was followed with regard to another shipment of cigarettes later in the year. (25:136-137).\n\nThroughout this period, Teitlebaum continued making payments to appellant Cleveland Turner, alternately with cash, cruise tickets and even automobile tires. In August 1976, Teitlebaum delivered a $200 check to Turner, but as he was leaving Turner ran out to Teitlebaum's car and gave him the check back, saying he wanted only cash from then on. Teitlebaum took back the check and gave Turner $160 in cash that he was carrying. (24:176).\n\nIn the latter part of August 1976, Boyle told Teitlebaum that Barone was angry at him for using Southeastern Maritime, Inc. as a stevedoring company in Savannah because it \"belong[ed] to another group.\" (24:185, 194). Subsequently, Teitlebaum met with Boyle and Barone in the hallway outside of his Miami office and Barone told Teitlebaum that he \"was going to work with whomever he [Barone] designated\" and that Teitlebaum \"was going to love every goddam piece of business . . . . [he] had.\" (24:196-197).\n\nDuring this period, Teitlebaum was continuously behind in the money he owed and Boyle, Barone and Vanderwyde pressured him to catch up. When Teitlebaum received a $25,000 payment from the Zim line for services rendered in Savannah, Boyle told Teitlebaum that he wanted $2,000 out of it. (24:102). When Teitlebaum asked if he could deduct the cost of the June 1976 cruise tickets from the money he owed, Boyle told him to consider the tickets as a present for Vanderwyde. (24:114). At one point, Boyle told Teitlebaum that it would \"relieve a lot of tension\" if Teitlebaum were to make payments of $3,500 for Mobile, $1,000 for Savannah and $1,000 for Miami. (24:193). Shortly thereafter, Barone told Teitlebaum, in the presence of Boyle and Vanderwyde, to \"get even in Mobile.\" (25:36). Barone asked Teitlebaum if he was experiencing any problems with the Nopal Line. When Teitlebaum said that he was not, Barone told him, \"you may start experiencing some problems.\" (25:36-37).\n\nIn early September 1976, Boyle told Teitlebaum that Field wanted tickets for himself and some friends to take a Christmas cruise on the Mardi Gras. (25:25). In early December, Teitlebaum visited the ILA office and Boyle (in the presence of Field, Barone, appellant Vanderwyde and Cornelius Vanderwyde) asked Teitlebaum if he had made arrangements for Field's tickets. Teitlebaum said that the tickets cost $6,200 and the cruise line who operated the Mardi Gras was not going to give them away because it was the Christmas cruise. (25:152). Teitlebaum called his friend at the cruise line to let Boyle speak with him. Teitlebaum heard Boyle telling the person: \"You know who he is. He is our general organizer.\" (25:156). After a pause, Boyle added, \"When contract time comes around, don't look for any favors.\" (25:156).\n\nBoyle then handed the phone back to Teitlebaum who tried to persuade the cruise line representative to split the cost of the tickets with him. (25:156). At that point Field looked at Teitlebaum and said: \"Fuck you and your Jew friend. I am not going. You'll repent. Believe me, you'll repent.\" (25:157).\n\nIn the latter part of 1976, Teitlebaum spoke with Boyle about the possibility of expanding his waterfront operations into the port of Jacksonville, Florida. (24:161). In October, Teitlebaum made arrangements to meet appellant Landon Williams for dinner in Miami. (25:48). They met in the lobby of the Americana Hotel and discussed the Jacksonville operation. Williams told Teitlebaum that it would cost him \"ten cents a ton, $250 a week, $1,000 a month, no matter what does,\" in order to operate in Jacksonville. (25:55).\n\nEnroute to the restaurant Teitlebaum gave Williams $400. (25:80). Williams held up five fingers and said, \"I was looking for this.\" Teitlebaum told him that he would receive the additional $100, plus the first monthly payment of $1,000 when they met in Jacksonville. (25:81). Teitlebaum started to discuss the cruise tickets he had obtained for Williams in 1975, but Williams said he did not like to talk in cars because they could easily be bugged. (25:81). Shortly after the Miami meeting, Teitlebaum travelled to Jacksonville where he paid Williams the $1,100, using money supplied by the FBI. (25:96).\n\nOTHER WATERFRONT EMPLOYERS MAKE ILLEGAL PAYOFFS\n\nWhile Joseph Teitlebaum was the government's key witness, other waterfront employers also testified that they made illegal payments to union officials.\n\nAlvin P. Chester was one of the principals of Chester, Blackburn \u0026 Roder ('C, B \u0026 R'), a company that rendered steamship agency services at the port of Miami. In 1967, the principals of C, B \u0026 R formed Marine Terminals, Inc. ('MTI'), a stevedoring company. Chester testified that he met appellant Barone in 1967 shortly after MTI was established. (14:120). Barone told Chester that he had done him a favor by interfering with an attempt to execute a murder contract on one of Chester's business associates. Chester testified that Barone told him Joseph Teitlebaum was responsible for the contract. (14:122).\n\nBarone explained to Chester that life was different on the docks and that Chester needed a \"consultant\" to \"watch out for things.\" (14:123). Accordingly, Barone suggested that MTI enter an \"arrangement\" with Barone whereby the company would pay him a monthly retainer of $1,500. (14:124). Chester said that was too high and they ultimately agreed that MTI would pay Barone $750 each month. (14:124). Chester made the first two payments himself, but his associate Jacob Sklaire made the subsequent payments. (14:195-197).\n\nSklaire testified that he continued paying Barone $750 each month from 1967 through 1972. In 1972, Sklaire and his associates formed Caribbean Freightways, Inc., a freight consolidating business, to operate at the Miami International Airport. (14:204-205). The function of the business was to receive freight from several different companies and pack (\"stuff\") it into containers destined for different ports.\n\nSklaire asked Barone whether it would be possible to obtain a union contract for the airport operation inasmuch as containers stuffed by non-union personnel that passed through the port were subject to a substantial financial penalty. (14:206). Barone responded negatively, stating that they were not going to award any more union contracts. Nevertheless, Sklaire and Barone arrived at an agreement whereby Barone would permit Sklaire to use non-union personnel without incurring any penalty in return for increasing Barone's monthly payment to $1,000. (14:209). The $1,000 payments continued until January 1977. (14:211).\n\nGeorge Wagner began working as a checker for MTI in 1967. (43:35). In 1968, the principals of MTI approached Wagner regarding the possibility of him becoming a manager. (43:41). Wagner, concerned that he might lose his union status if he accepted the job, discussed the matter with Barone, Boyle and Vanderwyde. (43:41, 45). They were all very positive about Wagner's promotion, telling him to \"be on the lookout to be a help to the union\" and to \"make a dollar wherever . . . . [he] could.\" (43:47).\n\nAs soon as Wagner became manager, he began making monthly payments of $800 to Boyle on behalf of MTI. (43:56). He continued making such payments through 1971. (43:60). In a discussion that occurred late in 1970 at the MTI warehouse, Boyle told Wagner that the money was going into a \"pot,\" and that Boyle's position would improve because he would \"share in the entire pot.\" (43:68-70). Shortly after that discussion, Wagner increased the payments to $1,000 per month. (43:72). Wagner testified that he also paid Boyle from $4,000 to $8,000 in each of the years 1972, 1973 and 1974 over and above the $1,000 monthly payments. (43:77).\n\nDuring this same period, Wagner was making cash payoffs to appellant Cleveland Turner in amounts ranging from $5,000 to $7,000 each year. In 1972, however, Wagner was experiencing problems generating enough cash to pay Turner so they arranged for Wagner to put ghost employees on MTI's payroll, that is, persons who did not actually work for MTI. Wagner would then turn the payroll checks of such persons over to Turner. (43:85-89).\n\nIn mid-1972, Wagner met with Julio Navarro, who worked for a container/trailer repair company operating at the port of Miami. Navarro wanted Wagner to explore the possibility of allowing appellants Raymond Kopituk and Oscar Morales, friends of Navarro's, to open a container/trailer repair business on Dodge Island. (43:119). Wagner said he would entertain the idea and arranged to meet with them.\n\nPrior to meeting with Kopituk\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and Morales, Wagner discussed the matter with Barone, in the presence of Boyle and Vanderwyde. (43:120). Wagner suggested that he would tell Kopituk and Morales that a union contract on Dodge Island would cost them $10,000 up front and $1,000 per month thereafter. (43:120). Barone said that would be acceptable. (43:121). When Wagner met with Kopituk and Morales, however, he told them it would cost $15,000 up front, rather than the $10,000 he had discussed with Barone. They readily agreed. (43:122).\n\nApproximately four weeks later, Wagner met with Kopituk and Morales at a Howard Johnson's where they delivered the $15,000 in cash. Wagner kept $2,500, gave Julio Navarro $2,500 and gave the remaining $10,000 to Barone. (43:126-131). Shortly thereafter, MTI began sending business to Florida Welding Services Corp. ('FWS'), the company operated by Kopituk and Morales. (43:135). In order to allow FWS to recoup some of the initial payoff money, Wagner prepared inflated invoices on behalf of FWS that were paid by MTI. (43:124, 138, 151-152). He terminated this arrangement after FWS began receiving a substantial amount of waterfront business. (43:154).\n\nWagner collected the $1,000 monthly payments from FWS and delivered them to Boyle, Vanderwyde or Barone. (43:155-156). He testified that on two occasions he received the payment from appellant Dorothy Kopituk, wife of appellant Raymond Kopituk. (43:170; 44:22-24). On one such occasion, Mr. Kopituk explained to Wagner that they were having trouble generating cash and asked if he would accept a check. Wagner said he would and Mrs. Kopituk asked him how she should record the check. Wagner told her he did not care and that as far as he was concerned she could write down \"Happy Birthday.\" She asked him if \"consulting fee\" would be acceptable and he answered affirmatively. (44:23). She proceeded to record the check in that manner.\n\nIn the summer of 1973, Morales approached Wagner concerning a friend of his who wished to begin a trucking operation at Dodge Island Seaport. He asked if Wagner could do the same for him as he had done for FWS. Wagner agreed to try. (44:41). Wagner discussed the proposal with Barone, in the presence of Boyle and Vanderwyde, and Barone gave his approval. The trucking company, Jasca Transfer, Inc., was to pay the union $10,000 up front. (44:43). As he had done with FWS, however, Wagner told Jeronimo Acosta, the owner of Jasca Transfer, that the initial payoff would be $15,000. (44:47). In turn, Wagner agreed to split the extra $5,000 with Morales. (44:45). The deal was transacted as planned and, shortly thereafter, MTI began sending trucking work to Jasca Transfer.\n\nCo-defendant Joseph Cotrone came to Miami from New York in 1972. Along with his father and sister Laura (also co-defendants), he established United Container and Ship Repair, Inc., a company that performed container, trailer and minor ship repairs. In early 1974, Barone and Boyle visited Cotrone's office and Barone told Cotrone that he should pay Barone $200 per month \"to make everything move smoothly,\" i.e., for union peace. (59:196). Barone told Cotrone that the other trailer and container repair companies operating at the port had already agreed to such an arrangement. Barone stressed the fact that he had close connections with the steamship lines, with which companies such as Cotrone's did a substantial amount of business, and that it would mean trouble for him if he declined to go along. (59:196-197).\n\nAfter discussing Barone's proposal with his father, Cotrone agreed to make the payments. (59:197). The payments were made to Barone in cash, using $20 bills at Barone's request. (59:198). After the initial payments were made, the means of generating sufficient amounts of cash to make the payments was left to co-defendant Francesca Cotrone, another of Joseph Cotrone's sisters, who began working for the company in 1975. (59:205).\n\nIn September 1975, Barone informed Cotrone that he wanted to alter the payoff schedule by charging Cotrone 25 cents for every hour worked by each of his employees. (59:203). Once again, Barone told Cotrone that his competitors had already agreed to the increase, that Barone's relationship to the steamship lines was very strong and that it would be \"wise\" for Cotrone to acquiesce. (59:203).\n\nCotrone discussed the demand with his family and it was agreed that they would make the payments. (59:205). This new method of calculating the payoffs owed to Barone dramatically increased the amount of the monthly payments. Cotrone testified that he began paying Barone from $1,000 to $1,500 each month. (59:207). The payments continued until December 1975. (59:212).\n\nCotrone's company, United Container and Ship Repair, Inc., had the contract to perform container and trailer repair work for PRMMI, the Puerto Rican steamship line. In 1975, representatives of PRMMI offered Cotrone's company a contract to perform their maintenance and repair work at the port of Jacksonville, Florida. (60:35-36). Cotrone discussed the possibility with Barone and Boyle. Barone said Cotrone would have to pay $3,000 to appellant Landon Williams in order to get an introduction into the Jacksonville area. (60:42).\n\nCotrone subsequently gave Barone the $3,000 and in June 1975 Barone took Cotrone to Jacksonville to meet Williams. (60:52). Shortly after they sat down to discuss the labor situation in Jacksonville, Williams told Cotrone: \"Jacksonville is like Egypt and I'm the Pharaoh in Egypt; and anything that's done up here must come through the Pharaoh.\" (60:53).\n\nThe Cotrones formed a new company, United Trailer Services, Inc., to operate in Jacksonville and hired Robert Gillespie and Stephen Miller to manage it. (60:55). Shortly after Cotrone's Jacksonville company began functioning, Barone told Cotrone that he expected peace payments amounting to 25 cents for every hour worked by each of Cotrone's Jacksonville employees. (60:64-65). Cotrone discussed the matter with his father who concluded that the situation was \"getting ridiculous\" and that they were not going to pay Barone anything for the Jacksonville operation until they spoke with Landon Williams. (60:66).\n\nOn October 3, 1975, Cotrone travelled to Jacksonville to meet with Williams. Upon learning of Barone's request for payment, Williams said: \"There's no way anything like that is going to happen in my port. If anybody is going to receive any money, it's going to be me.\" (60:73). Accordingly, Williams and Cotrone arrived at an agreement whereby Williams would be paid 25 cents for each man-hour worked in Jacksonville. (60:74). Thereafter, Miller and Gillespie, at Cotrone's direction, made regular payments to Williams, although in 1975 the 25 cents-per-hour formula was abandoned in favor of a flat $1,000 per month. (63:26-27, 39-45; 64:141, 172-203).\n\nGreat Southern Trailer Corp. was a container and trailer repair business operating in Savannah, Georgia, during the period covered by the indictment. It was jointly owned by Ramon DeMott and James Hodges. In the summer of 1975, DeMott and Hodges learned that the container repair work at the port of Savannah was going to be unionized and that it would therefore be necessary for them to obtain a union contract in order to stay in business. (11:28; 13:40).\n\nDeMott sought advice from appellant Morales, whom he had met a year earlier in a business context, because he knew Morales was operating under a union contract. (11:39-40). DeMott and Hodges subsequently met with Morales and appellant Kopituk at Great Southern's Savannah office to discuss how to go about acquiring a union contract. (11:42-43). Morales told them it would cost money, anywhere from $5,000 to $15,000. (11:44; 13:48). Kopituk agreed with Morales' estimate. (11:45; 13:48).\n\nShortly after Morales and Kopituk departed, DeMott and Hodges received a telephone call from appellant Boyle, who said that he wanted to meet with them at his Savannah office. (11:46; 13:48-49). When they arrived, Kopituk was sitting inside Boyle's office and Morales was outside on the veranda talking with Boyle. (11:46; 13:50). After Morales and Kopituk left, Boyle told DeMott and Hodges that it would cost them $10,000 to obtain a union contract in Savannah. (11:49; 13:52).\n\nThey complained that they did not have that much money and Boyle told them they could pay $6,000 initially and $4,000 at a later date. (11:50; 13:52). DeMott and Hodges subsequently borrowed $6,000 which they gave to Boyle on their way to the ILA office in Savannah to sign the union contract. (11:50-63; 13:52-62).\n\nPresent at the contract \"negotiation\" meeting were appellant Boyle, co-defendant Jackson, DeMott and Hodges. DeMott and Hodges attempted to negotiate certain changes in the terms of the contract, but Williams told them: \"Well, this agreement that's there is going to be it and you are going to sign the fucking contract or get out of the damn business.\" (11:71-72). When DeMott and Hodges persisted in attempting to discuss the content of the agreement, Williams told them that \"people who had gained disfavor wound up on their backs in bed and their arms and legs in traction, sipping soup through a straw and thinking about the follies of their ways.\" (11:72). DeMott and Hodges signed the contract. (11:73).\n\nWhile DeMott and Hodges were driving Boyle back to his office, Boyle explained to them that they would have to pay him 30 cents for every hour worked by each of their employees. (11:134). Boyle said that the money was not just for him, but for his associates as well. (11:134). DeMott and Hodges thereafter made regular payments to Boyle calculated on the basis of the 30 cents-per-hour formula. (11:85-86, 94-98, 114-121, 156-162, 198-204; 13:81, 87-88, 90, 106-111, 153-154).\n\nToward the end of 1975, Boyle suggested that DeMott and Hodges expand their container repair business into Charleston, South Carolina. (11:82). He said this could be accomplished for $5,000. (11:83). DeMott and Hodges agreed to establish a Charleston operation and, in February 1976, paid Boyle $5,000. (11:85, 117). Business, however, did not go well in Charleston and the operation lasted only about six months. (11:137). About the time they were dismantling their business in Charleston, DeMott and Hodges had dinner with appellant Field in Savannah. Hodges complained to Field that they were never given the opportunity to submit bids in Charleston, to which Field replied, \"Don't expect anything for nothing.\" (11:143).\n\nHarrington \u0026 Company is a steamship agent and stevedoring company that operates at the Dodge Island Seaport in Miami. Dorothy T. Howard, secretary-treasurer of the company, testified that in 1972, at the direction of co-defendant Neal L. Harrington, she began preparing and cashing monthly checks in amounts of several hundred dollars, which she charged to the company loan account of either Harrington or Royal O. White (the co-owners of Harrington \u0026 Company). (17:24, 26-27, 33). She would place the cash in an envelope and give it to Harrington. (17:32). Preparation of these checks coincided with visits from appellant Boyle. (17:35-36)\n\nEventually, Howard herself, through an implicit understanding with Harrington, developed the \"habit\" of giving envelopes containing varying amounts of cash to Boyle on a monthly basis. (17:37). On each occasion, she charged the amounts to the personal loan account of either Harrington or White. In March 1974, the same practice was commenced with respect to appellant Turner. (17:46-49). The amounts contained in the envelopes ranged from $400 to $1,380 for Boyle and $200 to $800 for Turner. (17:53-59). White, Harrington's business partner, testified that Harrington told him the payments were for the purpose of ensuring labor peace and were necessary in order to stay in business. (18:13, 20, 25).\n\nCoordinated Caribbean Transport, Inc. ('CCT') is a transportation company that has its headquarters at the port of Miami. The company is involved in transferring cargo received at the port from overland carriers to trailers that are then loaded onto ships destined for foreign ports. (18:132-133). During the period covered by the indictment, the company had contracts with the Miami longshoremen's union (ILA Local 1416) and the checkers' union (ILA Local 1922). (18:134-135).\n\nBoyle served as liaison between CCT and the longshoremen's and checkers' unions, respectively. (18:148-149). In 1974, CCT was trying to improve its warehousing operations through negotiations with the unions. Hector C. Calderon, a vice-president for CCT, testified that Boyle approached him early in 1974 and suggested that labor conditions at the warehouse could be improved for \"certain considerations.\" (18:150). Calderon ignored the statement, but Boyle broached the subject again at a subsequent meeting. (18:151-152).\n\nBoyle suggested that if CCT began paying him $1,000 per month, labor conditions at CCT's warehouse would improve. (18:152). After discussing the matter with a senior official of CCT's parent company, Calderon informed Boyle that he had received authorization to make the payments. (18:157-158). Boyle and Calderon ultimately agreed that CCT would pay Boyle $600 per month. (18:159). In late 1975, however, officers of CCT decided to terminate the payments to Boyle. (18:166). Shortly thereafter, Calderon informed Boyle of CCT's decision to terminate the arrangement, while making one last payment of $3,600 (intended to represent six future monthly payments). (18:167-168).\n\nGeorge Krickovich was employed by Eller \u0026 Company, a Miami-based stevedoring operation, throughout the period covered by the indictment. Krickovich testified that in early 1973, a 155-ton crane owned and operated by Eller \u0026 Company was idled until he agreed to pay George Wagner $50 per month. (51:192). Wagner told Krickovich that other cranes on Dodge Island were operating only because the companies that owned them were \"taking care of some stevedores.\" (51:191).\n\nIn 1976, Krickovich asked appellant Boyle about the possibility of Eller \u0026 Company obtaining a contract to perform stevedoring work for a shipping company that operated between the United States and Puerto Rico. (51:194). Boyle responded that no contract for the work had yet been awarded and that Eller \u0026 Company could receive favorable treatment if four or five ghost employees were placed on the company's payroll. (51:194). Krickovich asked what work the employees would be performing and Boyle said, \"Nothing.\" (51:195). Boyle told Krickovich that the employees would have to be paid in cash. (51:195). Krickovich discussed the matter with a senior official of Eller \u0026 Company who rejected the arrangement. (51:196).\n\nIn January 1977, the covert portion of the investigation terminated with the issuance of numerous grand jury subpoenas. The indictment was returned in June 1978 and the case went to trial in January 1979. In September 1979, the jury returned guilty verdicts as to all nine appellants herein.\n\nAll of the appellants except Dorothy Kopituk were found guilty of the substantive and conspiracy charges (Counts 1 and 2) brought under the Racketeer Influenced and Corrupt Organizations ('RICO') Act, 18 U.S.C. § 1961 et seq. Additional charges upon which appellants were found guilty included:\n\nBarone extortion (Count 3), 18 U.S.C. § 1951, 18 U.S.C. § 2; substantive Taft-Hartley Act violations (Counts 4, 6, 7, 11, 12, 13, 19, 25, 27, 31, 43 and 48), 29 U.S.C. § 186, 18 U.S.C. § 2; filing of false income tax returns (Counts 58, 59, 60, 61 and 62), 26 U.S.C. § 7206(1).\n\nBoyle extortion (Count 3), 18 U.S.C. § 1951, 18 U.S.C. § 2; substantive Taft-Hartley Act violations (Counts 4, 5, 6, 7, 8, 9, 11, 13, 16, 17, 19, 20, 22, 24, 27, 32, 35, 39, 41, 43, 46, 47 and 52), 29 U.S.C. § 186, 18 U.S.C. § 2; receipt of illegal kickbacks (Counts 21 and 23), 18 U.S.C. § 1954; obstruction of justice (Count 33), 18 U.S.C. § 1503; filing of false income tax returns (Counts 63, 64, 65, 66 and 67), 26 U.S.C. § 7206(1).\n\nField substantive Taft-Hartley Act violations (Counts 17 and 24), 29 U.S.C. § 186, 18 U.S.C. § 2.\n\nTurner substantive Taft-Hartley Act violations (Counts 5, 10, 14 and 18), 29 U.S.C. § 186, 18 U.S.C. § 2.\n\nVanderwyde extortion (Count 3), 18 U.S.C. § 1951, 18 U.S.C. § 2; substantive Taft-Hartley Act violations (Counts 4, 8, 16, 27 and 43), 29 U.S.C. § 186, 18 U.S.C. § 2.\n\nWilliams substantive Taft-Hartley Act violations (Counts 9 and 15), 29 U.S.C. § 186, 18 U.S.C. § 2.\n\nMorales substantive Taft-Hartley Act violations (Counts 44 and 46), 29 U.S.C. § 186, 18 U.S.C. § 2; filing of false income tax returns (Counts 68 and 70), 26 U.S.C. § 7206(1).\n\nR. Kopituk substantive Taft-Hartley Act violation (Count 44), 29 U.S.C. § 186, 18 U.S.C. § 2; filing of false income tax returns (Counts 68 and 70), 26 U.S.C. § 7206(1).\n\nD. Kopituk substantive Taft-Hartley Act violation (Count 44), 29 U.S.C. § 186, 18 U.S.C. § 2; filing of false income tax returns (Counts 68 and 69), 26 U.S.C. § 7206(2).\n\nA. SUBSTITUTION OF ALTERNATE JUROR\n\nThe central issue raised in this appeal is whether the district court erred in substituting an alternate juror for a disabled regular juror after the jury had begun deliberating.\n\nAt approximately 1:00 P.M. on Saturday, August 11, 1979, the jury retired to begin its deliberations. (99:144). The judge ordered that the two remaining alternate jurors be sequestered and directed a deputy United States marshal to escort them back to the hotel. (99:144-145). The trial judge instructed the alternate jurors not to discuss the case with anyone, telling the alternates that \"there is still a possibility that you may have to serve.\" (99:146). The judge subsequently arranged to have the alternates sequestered on a floor of the hotel separate from that of the regular jurors. (99:156-157). The jurors deliberated only two-and-one-half hours on this first day. The trial judge excused them at 3:30 P.M. to allow them to tend to their personal needs. (99:172).\n\nThe jury resumed its deliberations on Monday, August 13. On Wednesday, August 15, the trial judge released the two alternates from their sequestration and sent them home. In so doing, the trial judge specifically told the alternates that they were \"discharged.\" (102:22-23). Nevertheless, he proceeded to instruct them to avoid all newspaper and television coverage of the trial \"in the slim possibility that we might still call you.\" (102:23). He further instructed them not to discuss the case with anyone and not to leave the state until the case was concluded. (102:23-24).\n\nOn Friday afternoon, August 17, the court received a note from the foreperson of the jury expressing concern as to the mental condition of one of the jurors. (104:4). The foreperson requested that the jury be permitted to adjourn until Monday, promising that she would monitor the condition of the ill juror during the weekend. (104:4). The trial judge granted the request and deliberations were suspended until Monday, August 20. (104:6). On Monday morning, the foreperson sent the court another note stating that, in her opinion, the juror about whom she had previously expressed concern required professional help. (104:6). Shortly thereafter, the court received yet another note from the foreperson stating that the jury would be unable to continue deliberating until some action was taken with respect to the troubled juror. (104:7).\n\nA hearing was held that afternoon at which the court, together with counsel, explored the juror's condition. It became readily apparent that the juror was mentally ill. The deputy marshal responsible for guarding the jury room related to the court that the juror stated that the Lord was talking to her, that Lucifer was after her and, at one point, that she was Moses. (104:8). The foreperson of the jury told the court and counsel that the juror had been hallucinating (104:46) and that she was extremely unstable, repeatedly alternating between states of elation and depression. (104:46, 50). The ill juror had told the other jurors of a revelation she experienced the night of August 16 in which she realized she was a genius with an IQ of 200 and that her position as a juror in this case was part of a divine mission. (104:33, 68-69).\n\nOn Tuesday, August 21, the court arranged for the juror to be examined by a psychiatrist, who concluded that she was mentally disabled and unfit to continue in her capacity as a juror in this case.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Following extensive discussion with counsel, the trial judge, without objection, ordered that the incapacitated juror be discharged. (105:25). When defense counsel objected to proceeding with an 11-person jury, the court adjourned for the remainder of the day to consider whether or not the first alternate juror should be recalled. (105:27-28).\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe following day, the court, over the objections of defense counsel, decided to substitute the first alternate juror, Mrs. Evangelist, for the disabled juror. (106:45). Before doing so, however, the trial judge extensively questioned Mrs. Evangelist as to her continued fitness to serve as a juror. Mrs. Evangelist testified that, in accordance with the court's instructions, she had not discussed the case with anyone, she had not received any information about the case through the media or any other extrinsic source and that she felt she was capable of rendering a fair and impartial judgment with respect to all defendants. (106:55-58).\n\nAfter questioning the alternate juror, the court proceeded to examine each of the remaining 11 regular jurors individually regarding their respective abilities to begin deliberating anew. (106:73-141). Each juror stated that he or she would be able to disregard any opinions or conclusions previously expressed during deliberations and start all over again. While some jurors expressed reservations about having to commence their deliberations anew, such reservations were attributable to their understandable desire to be reunited with their families rather than to any obstacle relating to their thought processes. (106:73-141).\n\nAccordingly, on Thursday, August 23, the alternate juror was seated with the 11 original regular jurors and the court reinstructed them in full. (107:36-106). As part of the instructions, the court repeatedly emphasized that the jurors were duty-bound to begin their deliberations afresh, disregarding all of their previous deliberations. (107:36-39, 105-106).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The jury then retired and deliberated for just over one week before returning its verdict on September 1, 1979.\n\nResolution of this issue, that is, whether the trial court erred in substituting an alternate juror for a disabled regular juror after deliberations had begun, is controlled by a recent decision of the United States Court of Appeals for the Fifth Circuit, United States v. Phillips, 664 F.2d 971 (5th Cir. 1981), cert. denied, 457 U.S. 1136, 102 S. Ct. 2965, 73 L. Ed. 2d 1354 (1982),\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e wherein it was held that such a procedure constitutes reversible error only if the defendants are prejudiced by the substitution. In Phillips, the panel found that the procedural safeguards taken by the trial judge (which were expressly patterned after those employed by the trial judge in the instant case) operated to obviate any danger of unfair prejudice. 664 F.2d at 993.\n\nThe decision in Phillips is binding as precedent in this circuit pursuant to the Fifth Circuit Court of Appeals Reorganization Act of 1980, P.L. 96-452, 94 Stat. 1995. Bonner v. City of Prichard, Alabama, 661 F.2d 1206, 1207 (11th Cir. 1981). Extrapolating from that fact, it is clear that this panel is bound by the Phillips decision because one panel of the court of appeals is not permitted to overrule or reconsider the decision of a prior panel. Branch v. Phillips Petroleum Co., 638 F.2d 873, 877 (5th Cir. 1981); United States v. Alfrey, 620 F.2d 551, 555 (5th Cir. 1980).\n\nThe facts in Phillips were remarkably similar to those in the instant case. Indeed, Phillips approaches the status of the proverbial \"red cow\" case with respect to the substituted juror question raised herein. Phillips, like the case at bar, was a massive, complex RICO case. The trial involved several defendants and lasted more than five months. After the jury had been deliberating for approximately two days, one of the regular jurors became ill and subsequently suffered a heart attack. The district court decided to replace the disabled regular juror with an alternate juror who had been kept separately sequestered. In so doing, the court expressly relied upon the procedures employed by the district court in the instant case, the trial of which had concluded six months earlier. 664 F.2d at 991 n.13.\n\nIn accordance with those procedures, the trial judge in Phillips questioned the alternate juror as to whether he had discussed the case with anyone or whether he had been exposed to any extrinsic information concerning it and questioned each of the remaining regular jurors as to whether they would be able to begin their deliberations anew. He also ordered that all notes and other handwritten material compiled by the jurors during deliberations be confiscated. Finally, he reinstructed the jury in full, particularly emphasizing their duty to commence their deliberations with a clean slate. 664 F.2d at 991.\n\nIn Phillips, the appellate court was faced with challenges that mirror those raised herein, i.e., that substitution of an alternate juror after the jury has commenced its deliberations violates the clear provisions of Fed.R.Crim.P. 24(c), the right to trial by a fair and impartial jury guaranteed by the Sixth Amendment, and the prohibition against being placed in double jeopardy incorporated within the Fifth Amendment.\n\nTurning first to the constitutional arguments, the Phillips panel found no per se constitutional impediment to substitution of an alternate after deliberations have begun where good cause has been shown for the substitution and where adequate safeguards, such as instructing the reconstituted jury that they must begin deliberating anew, have been taken. 664 F.2d at 992-993. In so finding, the court relied in part upon People v. Collins, 17 Cal.3d 687, 552 P.2d 742, 131 Cal.Rptr. 782 (1976), cert. denied, 429 U.S. 1077, 97 S. Ct. 820, 50 L. Ed. 2d 796 (1977), wherein the California Supreme Court held that substitution of an alternate juror after jury deliberations have begun is permissible under the California constitution. The California court determined that so long as \"a properly qualified alternate juror is available and that juror fully participates in all of the deliberations which lead to a verdict,\" the right to jury trial is not violated. 131 Cal.Rptr. at 786, 552 P.2d at 746. The Phillips panel found such reasoning to be equally applicable to the Federal Constitution and, therefore, dispositive of appellants' Sixth Amendment argument.\n\nThe appellants in Phillips also claimed, as do the appellants herein, that substitution of the alternate juror operated to place them twice in jeopardy for the same offense in violation of the Fifth Amendment. That argument was rejected offhandedly, the court concluding that:\n\nconsideration of defendant's case by a jury which includes a former alternate who has replaced a regular juror after deliberations have begun no more violates the double jeopardy clause than does consideration by a jury which includes a former alternate who has replaced a regular juror during the trial before jury deliberations have begun.\n\n664 F.2d at 991-992 n.14.\n\nFinally, with regard to appellants' most pressing argument, i.e., that substitution of the alternate juror mandated declaration of a mistrial because such a procedure is contrary to the express language of Fed.R.Crim.P. 24(c), the Phillips court commenced its analysis with a determination that Rule 24(c) is not constitutionally grounded. 664 F.2d at 992.\n\nRule 24(c) reads in pertinent part as follows:\n\nAlternate jurors in the order in which they are called shall replace jurors who, prior to the time the jury retires to consider its verdict, become or are found to be unable or disqualified to perform their duties . . . . An alternate juror who does not replace a regular juror shall be discharged after the jury retires to consider its verdict.\n\nWhile recognizing that substitution of the alternate juror constituted a violation of Rule 24(c), the court declined to adopt a position that would require automatic reversal in all cases in which the rule was violated. Rather, the appropriate inquiry, according to the court, is whether the defendants were prejudiced by the substitution. 664 F.2d at 993. In Phillips, the court found that the precautions employed by the trial judge sufficed to obviate any danger of prejudice to the appellants, stating:\n\nThe safeguards utilized by the court neutralized the possible prejudice to the appellants. We need not remand for an evidentiary hearing on the issue of prejudice, [citing case], because we conclude that the instructions to the jury to begin anew, the jurors' individual assurances that they could in fact begin anew, and the full participation of the substituted alternate in the deliberations, which lasted six days, obviated the danger of undue prejudice. On the record before us we cannot discern that appellants were prejudiced by the substitution. The substitution procedure utilized by the court did not deprive appellants of their right to a full consideration of their cases by an impartial jury panel.\n\n664 F.2d at 996.\n\nHaving the benefit of Judge Johnson's opinion in Phillips, further discussion of appellants' legal arguments relative to the substituted juror question would be superfluous. Each of those arguments has been effectively disposed of as a matter of legal principle. All that remains is to apply Phillips to the facts at bar.\n\nIt is of no small significance that the safeguards approved in Phillips were formulated in express reliance upon the district court's opinion previously entered in the instant case. See United States v. Barone, 83 F.R.D. 565 (S.D.Fla.1979). As in Phillips, the trial judge in the instant case extensively questioned the alternate juror as to whether her continued fitness to serve had been tainted by any extrinsic influence. As in Phillips, the trial judge questioned each remaining regular juror individually and received assurances from all jurors that they would commence their deliberations anew. As in Phillips, the trial judge confiscated all notes and handwritten material compiled by the jurors during their original deliberations. Finally, as in Phillips, the trial judge reinstructed the jurors in full, emphasizing their duty to disregard all prior deliberations and begin afresh.\n\nIn Phillips, the panel noted that the jury deliberated on its verdict for six days following substitution of the alternate juror. 664 F.2d at 991, 996. Similarly, in the instant case, the jury deliberated for more than a week following substitution of the alternate. This is significant because one of the primary concerns of permitting an alternate juror to be substituted after jury deliberations have commenced is that the 11 original regular jurors may have already made up their minds to convict and, together, may coerce the alternate juror into joining in their position. See United States v. Lamb, 529 F.2d 1153, 1156 (9th Cir. 1975).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The fact that the jury continued to deliberate for an entire week after the alternate was substituted negates any inference that the original regular jurors had previously decided to convict and that they impressed that position on the alternate.\n\nNotwithstanding the many similarities between the instant case and the Phillips case, however, some factual distinctions do exist. In Phillips, the alternate juror was kept separately sequestered up until the moment he was substituted. In the instant case, although the trial judge initially decided to keep the alternates separately sequestered, he released them from their sequestration after four days. Upon doing so, however, he instructed them not to discuss the case with anyone and to avoid all media coverage of the trial because there was a possibility that they would be recalled. Moreover, prior to seating the alternate as a regular juror, the judge made an extensive inquiry to satisfy himself and counsel that the alternate had indeed obeyed his instructions. Consequently, the fact that the alternate juror was physically sequestered for only a portion of the time prior to being substituted is not, in light of the other precautions taken by the trial court, a distinguishing fact of such significance as to command a different result.\n\nAnother factual distinction between this case and Phillips concerns the period of time the jury spent deliberating prior to substitution of the alternate juror. As noted supra, in Phillips, the jury deliberated for approximately two days before the regular juror became incapacitated and the alternate was substituted. In the instant case, the jury spent a total of approximately five days deliberating prior to substitution of the alternate.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Admittedly, the further along deliberations proceed, the more difficult it becomes to disregard them and begin anew. Nevertheless, the jurors' individual assurances that they could and would begin deliberating anew, combined with the fact that the jury deliberated for a full week subsequent to substitution of the alternate juror, is sufficient indication that the jurors were able to and did in fact obey the court's extensive instructions regarding their duty to eliminate all prior deliberations from their minds and begin with a clean slate.\n\nFinally, the facts of this case are distinguishable from those in Phillips in that the trial judge, upon releasing the alternate jurors from their sequestration, specifically stated that they were \"discharged,\" whereas, it is argued, no such statement was ever made in the Phillips case. Appellants focused on this point during oral argument, although no attempt was made to explain why such a distinction should be determinative.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Although the trial judge used the word \"discharged\" in sending the alternate jurors home, he made it clear to them that their duties as jurors had not necessarily terminated. In fact, he expressly told them that there was still a possibility that they would be recalled and instructed them not to discuss the case with anyone, to avoid all media coverage of the case and to remain within the state of Florida.\n\nThe tenor of appellants' argument suggests that it would have been acceptable for the trial judge to have said, \"Go home, I release you,\" or use any other combination of words of similar import, so long as he did not use the word \"discharge.\" We decline to attribute any such talismanic quality to that word and accordingly reject appellants' argument on this point.\n\nOur decision that substitution of the alternate juror after deliberations had begun does not constitute reversible error should not be misconstrued as a stamp of approval upon such a practice. As was true in Phillips, the trial court's decision to substitute the alternate was made in the context of a trial of truly epic proportions in terms of length, scope and expense to both sides. We endorse the statement in Phillips that, \"Our conclusion that the district court committed no reversible error must likewise be understood as limited to such an exceptional context.\" 664 F.2d at 996.\n\nIt is not our intention, nor is it within our province, to authorize routine deviation from the terms of Rule 24(c). That rule is \"the rule\" and the substituted juror procedure upheld herein is a narrowly limited exception to the rule, applicable only in extraordinary situations and, even then, only when extraordinary precautions are taken, as was done below, to ensure that the defendants are not prejudiced.\n\nB. SEVERANCE ISSUES\n\nAppellants raise a variety of claims that focus upon the failure of the district court to grant any of their several motions to sever certain offenses and/or defendants from the trial below. Their arguments, while somewhat convoluted, state claims of misjoinder under Fed.R.Crim.P. 8 and improper denial of relief from prejudicial joinder under Fed.R.Crim.P. 14.\n\n(1) Misjoinder\n\nAppellants Vanderwyde, Williams, Morales and the Kopituks contend that the counts of the indictment charging income tax offenses (Counts 58 through 70) were improperly joined with the counts charging non-tax offenses. A substantial portion of appellants' argument on this issue, however, is erroneously premised upon Fed.R.Crim.P. 8(a), which deals with joinder of offenses. It is well established that Rule 8(a) applies only in cases involving a single defendant charged with multiple offenses, whereas Rule 8(b) governs in cases involving multiple defendants.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e United States v. Levine, 546 F.2d 658, 661 (5th Cir. 1977); United States v. Park, 531 F.2d 754, 760 n.4 (5th Cir. 1976); United States v. Marionneaux, 514 F.2d 1244, 1248 (5th Cir. 1975); United States v. Gentile, 495 F.2d 626, 628 n.2 (5th Cir. 1974); United States v. Bova, 493 F.2d 33, 35 (5th Cir. 1974); Cupo v. United States, 123 U.S. App. D.C. 324, 359 F.2d 990, 992 (D.C.Cir.1966), cert. denied, 385 U.S. 1013, 87 S. Ct. 723, 17 L. Ed. 2d 549 (1967); King v. United States, 355 F.2d 700, 704-705 (1st Cir. 1966). See generally 1 C. Wright, Federal Practice and Procedure § 143, § 144 (1969). But see United v. Diaz-Munoz, 632 F.2d 1330, 1335-1336 (5th Cir. 1980).\n\nNevertheless, while it is clear that appellants' reliance upon Rule 8(a) is misplaced, this does not destroy their underlying argument on appeal, for the analysis under either subsection is, with one exception, more or less the same.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The critical difference between the two subsections is that Rule 8(a) allows joinder of offenses against a single defendant that \"are of the same or similar character,\" even if such offenses do not arise out of the same series of acts or transactions. Under Rule 8(b), offenses may not be joined unless they arise out of a series of acts or transactions, regardless of how similar they may be in character. 1 C. Wright, Federal Practice and Procedure § 144 (1969). That distinction, however, does not bear on the resolution of this appeal.\n\nThe substance of appellants' argument that it was improper to join the counts charging tax offenses with the counts charging other types of offenses is derived largely from United States v. Diaz-Munoz, supra, in which a panel of the former Fifth Circuit Court of Appeals reversed the convictions of three defendants on the ground that, inter alia, counts of the indictment charging various income tax offenses were improperly joined with counts charging embezzlement and insurance fraud. 632 F.2d at 1335-1336.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIn Diaz-Munoz, the defendants moved prior to trial for severance of the tax counts, contending that they were totally unrelated to the counts charging embezzlement and insurance fraud and, therefore, could not be joined with those counts under Rule 8. The government responded that \"the proof at trial will show the allegations of the subject counts to be part of a series of transactions which began with the acts of fraud and were concluded when the fraudulent income was not reported as income to the Internal Revenue Service.\" 632 F.2d at 1335. Accepting the government's representation that the counts would be connected up at trial, the district court denied the motions for severance.\n\nAt trial, however, the government failed to produce any evidence tending to prove a connexity between the tax counts and the non-tax counts, and even conceded this point at oral argument. 632 F.2d 1336. The appellate panel found that in representing to the court that the counts were part of a series of transactions, the government \"assumed the risk that its proof would fail\" and, accordingly, had to bear the consequences appertaining to that risk. 632 F.2d at 1336.\n\nThus, the decision in Diaz-Munoz was based upon the government's failure to prove a nexus between the tax and non-tax counts and does not, as appellants argue, stand for the proposition that joinder of tax and non-tax offenses in a single indictment is per se improper. Indeed, there would be no legal or logical basis for such a rule and, in fact, there is ample authority supporting the position that tax counts can properly be joined with non-tax counts where it is shown that the tax offenses arose directly from the other offenses charged. United States v. Beasley, 519 F.2d 233, 238 (5th Cir. 1975), vacated on other grounds, 425 U.S. 956, 96 S. Ct. 1736, 48 L. Ed. 2d 201 (1976); United States v. Kenny, 645 F.2d 1323, 1344-1345 (9th Cir. 1981); United States v. McGrath, 558 F.2d 1102, 1106 (2d Cir. 1977), cert. denied, 434 U.S. 1064, 98 S. Ct. 1239, 55 L. Ed. 2d 765 (1978); United States v. Isaacs, 493 F.2d 1124, 1158-1159 (7th Cir.), cert. denied, 417 U.S. 976, 94 S. Ct. 3184, 41 L. Ed. 2d 1146, 94 S. Ct. 3183 (1974). Assumably, had the government been able to fulfill its pretrial representation that the evidence would establish that the unreported income charged in the tax counts constituted the proceeds of the embezzlement and/or insurance fraud offenses charged in the other counts, the result in Diaz-Munoz would have been different.\n\nThe pertinent focus in misjoinder claims of this type is not upon the nature of the offenses that are joined together, but upon whether the terms of Rule 8(b) have been met, that is to say, whether the offenses arose from the \"same series of acts or transactions.\" In order to constitute a \"series\" of acts or transactions under Rule 8(b), there must be \"substantial identity of facts or participants\" among the various offenses. United States v. Marionneaux, supra, 514 F.2d at 1249.\n\nIt is well established that substantive offenses arising out of a single conspiracy can properly be joined, since the conspiracy provides a common link connecting the offenses. United States v. Phillips, supra, 664 F.2d at 1016; United States v. Gentile, supra, 495 F.2d at 631-632; Gordon v. United States, 438 F.2d 858, 878 (5th Cir. 1971); United States v. Adams, 581 F.2d 193, 197 (9th Cir. 1978); United States v. Bernstein, 533 F.2d 775, 789 (2d Cir.), cert. denied, 429 U.S. 998, 97 S. Ct. 523, 50 L. Ed. 2d 608 (1976); United States v. Somers, 496 F.2d 723, 729-730 (3d Cir.), cert. denied, 419 U.S. 832, 95 S. Ct. 56, 42 L. Ed. 2d 58 (1974); 1 C. Wright, Federal Practice and Procedure § 144 (1969).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e In other words, the fact that the substantive offenses emanated from a single, central conspiracy is a sufficient indication that substantial identity of facts or participants exists among the offenses.\n\nIn the instant case, the government alleged and succeeded in proving that the tax counts and the non-tax counts were part of a series of acts or transactions arising from the conspiracy and criminal enterprise charged in Counts 1 and 2 of the indictment, respectively. Counts 58 through 67 charged appellants Barone (58-62) and Boyle (63-67) with filing false income tax returns. Counts 68 through 70 charged appellants Morales and Raymond and Dorothy Kopituk with assisting in the preparation of fraudulent corporate income tax returns on behalf of their company, Florida Welding Services Corp., by claiming false business deductions.\n\nThe government's proof at trial showed that the unreported income that formed the basis of the tax offense counts against Barone and Boyle stemmed from funds they received as a result of their participation in the conspiracy and the criminal enterprise that constituted the foundation for all the other charges against them. Similarly, the government's proof showed that the unlawful business deductions claimed by Morales and the Kopituks on behalf of Florida Welding Services Corp. stemmed from illegal payments they made in connection with their participation in the conspiracy and criminal enterprise.\n\nThe tax offenses were thus part of a series of acts committed in furtherance of the overall conspiracy. In the case of the unreported income received by Boyle and Barone, the filing of false income tax returns operated to maximize the benefits enjoyed as a result of their participation in the conspiracy and, of course, facilitated their efforts to avoid detection of the criminal enterprise. As for the fraudulent deductions claimed on behalf of Florida Welding Services Corp., the preparation of false corporate income tax returns enabled the Kopituks and Morales to minimize the adverse financial impact of the illegal payoffs they were making in order to acquire waterfront business.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Accordingly, since the tax offenses arose directly and solely out of the other offenses committed in furtherance of the conspiracy, they were properly joined under Rule 8(b).\n\n(2) Prejudicial Joinder\n\nFed.R.Crim.P. 8 sets \"the limits of tolerance\" on the process of joinder of offenses and defendants. United States v. Bova, supra, 493 F.2d at 36. If those limits are exceeded, joinder becomes misjoinder and is deemed to be inherently prejudicial. Where there is misjoinder, severance under Rule 8 is mandatory. United States v. Levine, supra, 546 F.2d at 661; United States v. Marionneaux, supra, 514 F.2d at 1248; United States v. Bova, supra, 493 F.2d at 35-36.\n\nNevertheless, joinder of defendants or offenses, even though proper under the terms of Rule 8, can be so prejudicial as to require severance under Fed.R.Crim.P. 14.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The decision of whether relief is appropriate under Rule 14, however, is entrusted to the sound discretion of the district court and is reviewable on appeal only for abuse of that discretion. United States v. McCulley, 673 F.2d 346, 349 (11th Cir. 1982); United States v. Kabbaby, 672 F.2d 857, 861 (11th Cir. 1982); United States v. Salomon, 609 F.2d 1172, 1175 (5th Cir. 1980); United States v. Marionneaux, supra, 514 F.2d at 1248; Tillman v. United States, 406 F.2d 930, 933 n.5 (5th Cir.), vacated on other grounds, 395 U.S. 830, 89 S. Ct. 2143, 23 L. Ed. 2d 742 (1969).\n\nHaving determined that joinder in this case was proper under Rule 8, it becomes necessary to consider appellants' claims of prejudicial joinder under Rule 14. Some of these claims raise constitutional questions which, while distinct from the issue of joinder, are nevertheless related. Accordingly, they will be dealt with in this section.\n\nAppellants Turner, Williams, Morales and the Kopituks contend that they were prejudiced by the existence of antagonistic defenses that resulted from the government's decision to jointly indict both the union officials and the waterfront employers, and that the lower court erred in denying their respective motions for severance. The crux of this argument concerns the defense of co-defendant Neal L. Harrington, a waterfront employer who was, in fact, ultimately severed during trial.\n\nHarrington, as noted in the facts section of this opinion, was co-owner of a Miami-based steamship agency and stevedoring company during the period covered by the indictment. He was charged with making illegal payoffs to union officials in return for labor peace. At the beginning of trial, counsel for Harrington informed the court of Harrington's intention to rely upon an \"economic duress\" theory of defense, i.e., Harrington would admit making illegal payoffs to union officials but would claim that he did so under economic coercion. Counsel for Harrington told the court and other counsel that he intended to pursue this course in his opening statement.\n\nSeveral of the appellants moved for a severance at that point, contending that Harrington's position was prejudicial to their own, since they would be denying any and all participation in the criminal enterprise. The trial judge declined to order a severance at that point, reserving a final ruling until the trial had progressed to a stage where the issue would be more clearly focused. In order to avoid any possible prejudice in the interim, the court instructed counsel for Harrington to limit the scope of his opening statement to what he believed the government would or would not be able to prove with respect to his client alone. The court told counsel for Harrington that he would be permitted to make a second opening statement at the close of the government's case if it were ultimately decided that his client would not be severed.\n\nDuring his opening statement, counsel for Harrington told the jury that \"the Government's evidence will show that physically certain things took place; physically certain money passed.\" (4:110). Further on, he stated: \"Now, the Government has indicated in its opening statement -- and I concur that the evidence will show that that was a way of life on the docks -- the Government has contended in their opening statement that the enterprise, --.\" (4:111). At that point, an objection was interposed and sustained, and the court advised counsel to remember the previous order. No other statements were made that even remotely implicated Harrington's co-defendants.\n\nLate in the trial, but before Harrington ever had an opportunity to introduce evidence on his own behalf to support his economic duress theory, the court ordered him severed from the trial. Appellants contend that the district court abused its discretion when it failed, alternatively, to sever Harrington at the beginning of the trial or to sever them once it became apparent that Harrington's defense was clearly irreconcilable with their own.\n\nTo show an abuse of discretion by a district court in refusing to grant a motion for severance, a defendant must demonstrate that the joint trial subjected him to compelling prejudice against which the trial court was unable to afford protection. United States v. Harper, 11 Cir. 1982, 680 F.2d 731; United States v. Kabbaby, supra, 672 F.2d at 861; United States v. Tombrello, 666 F.2d 485, 492 (11th Cir. 1982); United States v. Swanson, 572 F.2d 523, 528 (5th Cir.), cert. denied, 439 U.S. 849, 99 S. Ct. 152, 58 L. Ed. 2d 152 (1978). In the context of an antagonistic defense claim, it is necessary to show not simply that the defenses were antagonistic, but that they were irreconcilable and mutually exclusive. United States v. Mota, 598 F.2d 995, 1001 (5th Cir. 1979); United States v. Crawford, 581 F.2d 489, 491 (5th Cir. 1978); United States v. Swanson, supra, 572 F.2d at 529.\n\nIn the case sub judice, the trial court ultimately became convinced that Harrington's defense was irreconcilable with those of his co-defendants and ordered that he be severed from the trial. In so doing, the court fulfilled its \"continuing duty at all stages of the trial to grant a severance if prejudice does appear.\" Schaffer v. United States, 362 U.S. 511, 516, 80 S. Ct. 945, 4 L. Ed. 2d 921 (1960). Consequently, the only question is whether the action of the trial court in severing Harrington was \"too little, too late,\" that is, whether appellants had already suffered compelling prejudice warranting reversal of their convictions. We think not.\n\nAppellants rely upon United States v. Johnson, 478 F.2d 1129 (5th Cir. 1973), and United States v. Crawford, supra, to support their position, but each case is readily distinguishable. In Johnson, two defendants, Johnson and Smith, were jointly tried on a charge of passing counterfeit bills. Johnson's defense at trial was that he was not present when the crime was committed. Smith, on the other hand, admitted that he and Johnson passed the counterfeit bills, but claimed that he was working as an informer for the municipal police department at the time. Indeed, the foundation of Smith's entire defense consisted of laying the blame upon Johnson and a third party. As the appellate panel observed, \"[a] study of the record reveal[ed] that Smith's attorney implicated Johnson at every opportunity.\" 478 F.2d at 1133.\n\nAccordingly, the court of appeals reversed Johnson's conviction, finding that, while severance was not mandatory prior to trial, \"as the trial progressed it became clear that the prejudice to Johnson of defending at a joint trial with Smith outweighed any possible disruption in the judicial process which would result from having separate trials.\" 478 F.2d at 1134. In so finding, the court noted that there were only two defendants \"and it would not have been very time consuming, but entirely practicable, to have accorded them separate trials.\" 478 F.2d at 1134.\n\nIn United States v. Crawford, supra, two defendants, Crawford and Blanks, were jointly tried on a charge of possessing an unregistered sawed-off shotgun. At trial, the sole defense of each defendant was to incriminate the other:\n\nBlanks incriminated Crawford and exculpated himself at every opportunity. Crawford, on the other hand, attempted to show that he was not culpable because Blanks alone had possession of the firearm. Each was the government's best witness against the other. Each defendant had to confront not only hostile witnesses presented by the government, but also hostile witnesses presented by his co-defendant.\n\n581 F.2d at 492. In light of such circumstances, the court reversed the convictions, noting that \"because the evidence was uncomplicated and only two defendants were involved, the inconvenience and expense of separate trials would not have been great.\" 581 F.2d at 492.\n\nThe instant case differs substantially from both the Johnson and Crawford cases in two major respects -- the degree of prejudice inhering in the respective cases as a result of the joint trials and the degree to which the interest of judicial economy was served by the decision to pursue joint, rather than separate, trials. The degree of prejudice suffered by the defendants in the Johnson and Crawford cases was truly compelling. In both cases, there were, in effect, two prosecutors -- the government and the co-defendant. The defendants in Johnson and Crawford, respectively, were inseparably intertwined due to the fact that, in each case, there were only two defendants charged with a single offense. This made it impossible for any defendant to escape the prejudicial impact ensuing from his co-defendant's \"He did it\" defense. Despite this fact, the trial court in each case refused to grant a severance even when the irreconcilable nature of the defenses clearly manifested itself.\n\nTo the contrary, in the instant case, the trial judge properly exercised his authority to sever Harrington once it became apparent that his defense was irreconcilable with that of the defendant union officials. Consequently, unlike the situation in Johnson and Crawford, Harrington never had the opportunity to offer his testimony or other evidence directly implicating his co-defendants.\n\nAppellants seize upon the statements made by counsel for Harrington during his opening statement, see text supra, as the primary evidence of prejudice arising from his antagonistic defense. As noted, Harrington's counsel stated that the government's evidence would show that \"physically certain money passed\" and acknowledged that such conduct was a \"way of life on the docks.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Beyond that, appellants obliquely refer to the antagonistic nature of Harrington's cross-examination of government witnesses.\n\nNowhere, however, is it asserted that Harrington's attorney directly \"pointed the finger\" at or apportioned the blame upon any particular appellant herein, as was the case in both Johnson and Crawford. Moreover, because there were many defendants and many charges involved in the trial below, there was no \"inseparable intertwining\" between Harrington and the other defendants. Any negative implications raised by Harrington's counsel were thus diffused, rather than concentrated upon any particular individual, thereby diminishing the likelihood of prejudicial impact.\n\nThis case is somewhat similar to United States v. Mota, supra, wherein the court of appeals rejected a claim of prejudice based on antagonistic defenses. Mota and Flores were charged together with federal drug offenses. At the joint trial, counsel for Flores stated in his opening statement that the evidence would show Flores did indeed commit the offense charged, but that he was insane at the time. Mota contended at trial and on appeal that he was prejudiced by such statements, arguing that the admission by Flores' counsel implicated him as well since both defendants were charged with committing the same offense at the same time and place.\n\nThe court of appeals rejected the argument, attaching significance to the fact that the concession was made by counsel during opening statement and not by Flores himself. 598 F.2d at 1000. The court found that any risk of prejudice was diminished by the instruction to the jury that the comments of counsel were not evidence and were not to be considered as such. 598 F.2d at 1000. A similar instruction was given in the instant case. (107:43). See also United States v. Vadino, 11 Cir., 1982, 680 F.2d 1329 (assertion of entrapment defense by one defendant does not necessarily entitle co-defendant who denies all involvement in the offense to a severance).\n\nThe second major distinction between the instant case and those relied upon by appellants involves the relative degree to which the interest of judicial economy was served by opting for joint, rather than separate, trials. The appellate decisions in both Johnson and Crawford emphasized the minimal demand that the holding of separate trials would make upon judicial resources inasmuch as the original joint trials were uncomplicated and involved only two defendants. Conversely, trial of the instant case lasted seven months, involved 12 defendants, and necessitated the calling of 130 witnesses. The demand upon scarce judicial resources was enormous. Because it was necessary to prove the existence of the criminal enterprise and underlying conspiracy with respect to each defendant, a substantial portion of the government's proof would necessarily have had to be repeated for each defendant who was granted a separate trial. The interest of judicial economy was thus well-served by proceeding with a joint trial.\n\nOf course, the interest of the public and the government in efficiently utilizing judicial resources would never justify denying a person a fair trial. If a person demonstrates that he will incur compelling prejudice if forced to undergo a joint trial, a severance must be granted, regardless of the impact on judicial economy. Nevertheless, it must be recognized that joint trials involving numerous defendants and offenses almost inevitably present a danger of some degree of prejudice to the participants. United States v. Levine, supra, 546 F.2d at 662; Cupo v. United States, supra, 359 F.2d at 993. This imposes a duty upon the court to balance the defendant's allegations of prejudice against the interest of judicial economy and concomitant policy favoring joint trials in conspiracy cases. United States v. Mota, supra, 598 F.2d at 1000; United States v. Swanson, supra, 572 F.2d at 528.\n\nWe find that the degree of prejudice suffered by appellants resulting from the trial court's refusal to sever defendant Harrington until late in the trial was slight when compared with the substantial countervailing interest of judicial economy. Accordingly, the trial court did not abuse its discretion in denying appellants' motions to sever based upon Harrington's antagonistic defense.\n\nAppellants Williams\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e and Field make a separate but related claim that they were prejudiced by the defense strategy adopted by appellant Boyle, whose counsel admitted in closing argument that Boyle was guilty of receiving money on several occasions (Taft-Hartley Act violations) but was innocent of the more serious charges such as conspiracy and extortion. Field's entire argument hinges upon the Sixth Amendment confrontation clause, that is, Field argues that his right to confront the witnesses against him was violated because he was unable to cross-examine Boyle, who declined to testify at trial.\n\nThis argument is fatally flawed by the fact that none of the statements made by Boyle's attorney incriminated Field or any of the other appellants. The statements of Boyle's counsel merely conceded that Boyle alone, one of 12 defendants on trial, committed some violations of the Taft-Hartley Act. As such, they were insufficient justification to characterize Boyle as a \"witness against\" Field so as to entitle Field to the right to cross-examine Boyle. It simply cannot be said that the statements at issue seriously prejudiced any of the appellants, particularly in light of the court's numerous instructions to the jurors that they were to evaluate each defendant and the charges and evidence against him (or her in the case of Dorothy Kopituk) separately. (99:58, 63-64, 135; 101:76; 107:40, 44-45, 94).\n\nField also contends that, since he was unable to cross-examine Boyle regarding his admissions, he should have been permitted to comment upon Boyle's decision not to testify. In support of this contention, Field relies upon DeLuna v. United States, 308 F.2d 140 (5th Cir. 1962). In DeLuna, two defendants, DeLuna and Gomez, were jointly indicted on a federal narcotic charge. They were arrested after police observed Gomez throw the narcotics out his car window. At trial, Gomez testified that he had never seen the package of narcotics until DeLuna handed it to him and told him to throw it out the window. DeLuna declined to testify, but his attorney attempted to fix the sole blame upon Gomez. During closing argument, counsel for Gomez made reference to the failure of DeLuna to take the stand, telling the jury that \"at least one man was honest enough and had courage enough to take the stand and subject himself to cross examination, and tell you the whole story . . . .\" 308 F.2d at 142 n.1. DeLuna was convicted and Gomez was acquitted.\n\nOn appeal, DeLuna's conviction was overturned. The panel concluded that he had an absolute privilege to exercise his right to remain silent free from the prejudicial comments of his co-defendant's attorney. The panel found further, however, that counsel for Gomez had a duty to make such prejudicial comments for the benefit of his client, stating:\n\nIf an attorney's duty to his client should require him to draw the jury's attention to the possible inference of guilt from a co-defendant's silence, the trial judge's duty is to order that the defendants be tried separately.\n\n308 F.2d at 141.\n\nIn United States v. Kahn, 381 F.2d 824 (7th Cir. 1976), the Seventh Circuit Court of Appeals construed the right recognized in DeLuna as limited to situations where it is shown that \"real prejudice\" will result unless the defendant is allowed to comment upon the failure of his co-defendant to testify. 381 F.2d at 840.\n\nThe question as we see it is how essential is it to a fair and complete defense, an attribute of a fair trial, that defendants be permitted to comment upon a co-defendant's exercise of his right against self-incrimination. The procedural difficulties and the complication of joint trials arising from the rule suggested by dicta in DeLuna are so great that we cannot say there is an absolute right, without reference to the circumstances of defense at trial, for a defendant to comment on the refusal of a co-defendant to testify.\n\n381 F.2d at 840.\n\nThe circumstances in the case sub judice did not justify any comment on behalf of Field regarding Boyle's failure to testify. To begin with, it does not appear that Field even requested that he be permitted to make such a comment. Indeed, it would have been a somewhat inane strategy for Field's attorney to condemn Boyle's failure to testify when Field himself did not testify. More importantly, because the statements of Boyle's counsel did not inculpate Field or any other defendant, there was no basis under the law emanating from DeLuna and Kahn for making any comment upon Boyle's decision to remain silent. Those cases authorize such comments only where an attorney has a clear \"duty\" to make them, 308 F.2d at 141, in order to avoid \"real prejudice\" to his own client. 381 F.2d at 840. In this case, there was no such prejudice and, hence, no such duty. The trial court, therefore, did not err in denying appellants' motions for severance grounded upon the statements of Boyle's attorney during closing argument.\n\nAppellant Williams next contends that he was prejudiced by a joint trial in that he was prohibited from eliciting Teitlebaum's testimony concerning a discussion in which appellant Boyle told him that Williams might have to be killed. At one point during the course of the conspiracy, Williams was running for a higher union office and had, according to Teitlebaum, threatened to report appellants Turner and Field to the Department of Labor and the Internal Revenue Service unless they supported his election bid. Boyle told Teitlebaum that unless Williams \"straighten[ed] up\" they might have to kill him. (29:58-60). After discussing the matter with counsel outside the presence of the jury, the trial judge ruled that the testimony was inadmissible because it was not relevant to any issue involved in the case. (29:64-65). Consequently, the testimony was not excluded, as Williams contends, due to a conflict arising from the fact that it was a joint trial, but rather because it was irrelevant.\n\nDeterminations as to the relevance of evidence are well within the broad discretion of the trial court and will not be disturbed on appeal absent a showing that the trial court abused its discretion. Williams v. Hoyt, 556 F.2d 1336, 1339 (5th Cir. 1977), cert. denied, 435 U.S. 946, 98 S. Ct. 1530, 55 L. Ed. 2d 544 (1978); United States v. Linetsky, 533 F.2d 192, 204 (5th Cir. 1976); United States v. Calles, 482 F.2d 1155, 1160 (5th Cir. 1973); United States v. Allison, 474 F.2d 286, 288-289 (5th Cir. 1973). The trial court did not abuse its discretion in refusing to admit the testimony of Teitlebaum's conversation with Boyle.\n\nSeveral appellants claim they were prejudiced by the length and complexity of the joint trial. These factors, appellants claim, combined to deprive them of a fair trial because it was impossible for the jury to reach an intelligent individualized verdict with respect to each defendant. Admittedly, the proportions of the trial below were somewhat extraordinary: 12 defendants, 130 witnesses, 22,000 pages of trial transcript, seven months of trial, 70-count indictment. Nevertheless, while we do not endorse the government's modern penchant for drawing together evermore complex and extensive conspiracies into a single indictment, we are unable to conclude that appellants suffered compelling prejudice as a result of the scope and breadth of the trial below. Consequently, they were not entitled to a severance under Rule 14. United States v. Harper, supra, at 733; United States v. Kabbaby, supra, 672 F.2d at 861; United States v. Tombrella, supra, 666 F.2d at 492; United States v. Swanson, supra, 572 F.2d at 528.\n\nThe pertinent inquiry in reviewing this question on appeal is whether the jury was able to \"individualize each defendant in his relation to the mass.\" Kotteakos v. United States, 328 U.S. 750, 773, 66 S. Ct. 1239, 1252, 90 L. Ed. 1557 (1946). The correlative concern is that the jury may allow the evidence produced with respect to one defendant or one offense to \"spillover\" and influence their decision regarding a different defendant or a different offense. The most efficacious tool to protect against this danger is a clear cautionary instruction from the trial court as to the duty of the jurors to consider each defendant and the evidence against him or her separately. United States v. Morrow, 537 F.2d 120, 136 (5th Cir. 1976), cert. denied, 430 U.S. 956, 97 S. Ct. 1602, 51 L. Ed. 2d 806 (1977). The most telling, and really the only, means through which to measure the jurors' collective adherence to such an instruction is to look at the verdict. Convictions will generally be upheld if it can be inferred from the verdict that the jury \"meticulously sifted the evidence\" as demonstrated by its decision to acquit on certain counts. Tillman v. United States, supra, 406 F.2d at 936, quoting 8 J. Moore, Moore's Federal Practice para. 14.04[1] at 14-15 (2d ed. 1968).\n\nAs noted supra, the trial court in the case sub judice gave precise instructions to the jurors that they should give separate consideration to each defendant on each count. Moreover, the court reiterated this directive several times. (99:58, 63-64, 135; 101:76; 107:40, 44-45, 94). The verdicts returned by the jury reflect that the jurors fulfilled their duty in this regard. The jury returned split verdicts as to four of the nine appellants and was unable to reach a verdict at all as to one defendant.\n\nIn reaching our determination that appellants were not unduly prejudiced by the length and complexity of the joint trial, we are guided by recent cases of similar magnitude that have rejected the same argument. See, e.g., United States v. Phillips, supra, 664 F.2d at 1016-1017 (six month trial; 36-count, 100 page indictment; 12 defendants); United States v. Martino, 648 F.2d 367, 385-386 (5th Cir. 1981) (20 defendants, most with Spanish or Italian surnames; 35-count indictment; three month trial; more than 200 witnesses); United States v. Morrow, supra, 537 F.2d at 135-137 (23 defendants). These and other cases teach that it is not enough simply to show that the trial was lengthy and/or complex. It is necessary to demonstrate with particularity compelling prejudice and appellants have failed in this regard. We believe the trial court's cautionary instructions sufficed, as evidence by the jury's verdict, to minimize any pernicious effect that might otherwise have resulted from the length and complexity of the joint trial.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Finally, we would be remiss in failing to note that where, as in the case herein, conspirators have created an extensive and far-flung conspiracy, deviously constructed and pursued, it is their unlawful conduct that produces a complex trial and, accordingly, they have no basis to insist that they be insulated from its complexities.\n\nThe final severance issue warranting discussion is appellant Williams' claim that he was improperly forced to undergo a joint trial in Miami rather than a separate trial in Jacksonville. While framed in terms of a due process claim, this argument amounts to an assertion that the district court abused its discretion in refusing to sever Williams and transfer his case to the Jacksonville Division of the United States District Court for the Middle District of Florida.\n\nFed.R.Crim.P. 21(b) provides that a court \"may\", upon motion of the defendant, transfer a criminal proceeding to another district \"for the convenience of parties and witnesses, and in the interest of justice.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Williams filed a Rule 21 motion three weeks prior to trial\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e claiming he would suffer extreme prejudice from the inconvenience of having to stand trial in Miami, rather than in Jacksonville, where he resided.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e He cited several financial reasons, including an inability to absorb the expenses of accommodations in and travel to Miami, as well as the expenses and fees of his attorney. The motion was denied.\n\nThe prejudice of which Williams complains manifested itself in the fact that on several occasions during trial Williams was, over the government's objection, permitted to excuse himself from the proceedings to attend to personal or business obligations back in Jacksonville. Counsel for Williams was also permitted to absent himself from the proceedings on numerous occasions. On appeal, the absences of Williams' attorney are attributed to an effort to reduce the expenses he would otherwise have incurred on Williams' behalf. The record makes it clear, however, that counsel's absences were motivated in large part by his concern for the continued well-being of his Jacksonville law practice.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e While this is perhaps understandable from the attorney's point of view, it does much to deflate Williams' hardship claim. More important than the reasons for the absence of Williams' counsel is the fact that at no time during the proceedings was Williams without legal representation. Early in the trial, counsel for Williams enlisted the services of another attorney in the case and made it clear to the court that the other attorney \"has been regularly associated as counsel with me and he will be representing Mr. Williams throughout the trial in association with me.\" (30:100).\n\nMoreover, Williams and his attorney were not the only persons required to absent themselves from the trial from time to time. The trial judge, recognizing that \"there still is a problem of life to some extent going on on the outside\" (14:223), frequently accommodated the requests of various attorneys and defendants to be excused from the trial proceedings. It was, after all, a seven month trial. This was generally permitted, however, only at times where it was clear that the on-going proceedings would not directly involve the absent defendant or attorney. (14:223). Significantly, Williams does not point to any particular event that resulted in prejudice to him. He does not, e.g., claim that he was unable to effectively cross-examine any witness against him, that he was unable to contest the admissibility of any material evidence against him, or that he was unable to pursue any particular line of defense.\n\nIt undoubtedly would have been more convenient for Williams to have undergone trial in Jacksonville rather than Miami. It was not, however, patently unfair to force Williams to stand trial in Miami. While most of the illegal activity charged against Williams transpired in Jacksonville, it was not limited solely to that city. His outside activity included: accepting the $400 \"down payment\" on Teitlebaum's Jacksonville operation while in Miami; requesting Boyle, who was in Miami, to obtain some cruise tickets from Teitlebaum, who was also in Miami; and conducting the union contract negotiation meeting with Ramon DeMott and James Hodges in Savannah. Thus, as the government notes in its brief, this is not a case where a defendant who has engaged in no misconduct outside his home district is hauled away to some remote district to stand trial.\n\nMoreover, Rule 21 accords weight not just to the convenience of the defendant, but to the convenience of all \"parties and witnesses.\" We have already discussed the government's interest in judicial economy and how the \"convenience\" of the government is fostered by the policy favoring joint trials for persons who are properly joined together in a single indictment. If Williams was entitled to a separate trial in Jacksonville, then surely co-defendant Elizah Jackson was entitled to a separate trial in Savannah and co-defendant Isom Clemon was entitled to a separate trial in Mobile. Such an approach, however, would deprive the valid interest in judicial economy of all force. Rather than try each defendant separately in his respective place of residence, the government chose the next best option -- it sought and obtained a joint indictment in Miami, the most convenient forum for the overwhelming majority of witnesses and defendants.\n\nA criminal defendant does not have a constitutional right to be tried in the district encompassing his residence. Platt v. Minnesota Mining and Manufacturing Co., 376 U.S. 240, 245, 84 S. Ct. 769, 772, 11 L. Ed. 2d 674 (1964). Since venue properly laid in the Southern District of Florida (see note 30, supra), Williams was properly indicted and brought to trial in Miami. The decision of whether to grant Williams' motion to transfer under Rule 21 was within the trial court's discretionary authority and is reviewable only for abuse of discretion. United States v. Pry, 625 F.2d 689, 691 (5th Cir. 1980), cert. denied, 450 U.S. 925, 101 S. Ct. 1379, 67 L. Ed. 2d 355 (1981); United States v. Juarez, 573 F.2d 267, 280 (5th Cir.), cert. denied, 439 U.S. 915, 99 S. Ct. 289, 58 L. Ed. 2d 262 (1978); United States v. Walker, 559 F.2d 365, 372 (5th Cir. 1977). The policy favoring joint trials in conspiracy cases, the convenience of most of the witnesses and defendants, and the fact that Williams has failed to particularize any real prejudice, all lead to the conclusion that the trial court did not abuse its discretion in refusing to sever Williams and transfer his case to Jacksonville.\n\nC. SUFFICIENCY OF EVIDENCE\n\nSix of the nine appellants (Field, Vanderwyde, Williams, Morales, Raymond Kopituk and Dorothy Kopituk) argue that the evidence produced at the trial below was legally insufficient to support their convictions. The standard to be applied in reviewing such claims is \"whether a jury could reasonably find that the evidence was inconsistent with every reasonable hypothesis of innocence or, put another way, whether a reasonably minded jury must necessarily entertain a reasonable doubt of the defendant's guilt.\" United States v. Marx, 635 F.2d 436, 438 (5th Cir. 1981); accord, United States v. Arrendondo-Morales, 624 F.2d 681, 683-684 (5th Cir. 1980); United States v. Rodgers, 624 F.2d 1303, 1306 (5th Cir. 1980); United States v. Witt, 618 F.2d 283, 284 (5th Cir.), cert. denied, 449 U.S. 882, 101 S. Ct. 234, 66 L. Ed. 2d 107 (1980).\n\nIn making that determination, we must view all the evidence in the light most favorable to the government, accepting all reasonable inferences and credibility choices that tend to support the jury's verdict. Hamling v. United States, 418 U.S. 87, 124, 94 S. Ct. 2887, 2911, 41 L. Ed. 2d 590 (1974); Glasser v. United States, 315 U.S. 60, 80, 62 S. Ct. 457, 469, 86 L.Ed 680 (1942); United States v. Marx, supra, 635 F.2d at 438; United States v. Arrendondo-Morales, supra, 624 F.2d at 684; United States v. Middlebrooks, 618 F.2d 273, 278 (5th Cir.), cert. denied, 449 U.S. 984, 101 S. Ct. 401, 66 L. Ed. 2d 246 (1980).\n\nAs noted supra, all of the appellants herein, with the exception of Dorothy Kopituk, were convicted on the two RICO charges (Counts 1 and 2). The essential elements of a substantive RICO offense, 18 U.S.C. § 1961 et seq., which the government must prove beyond a reasonable doubt, are: (1) the existence of an enterprise; (2) that the enterprise affected interstate commerce; (3) that the defendant was employed by or associated with the enterprise; (4) that he participated, either directly or indirectly, in the conduct of the affairs of the enterprise; and (5) that he participated through a pattern of racketeering activity, i.e., through the commission of at least two racketeering acts. United States v. Martino, supra, 648 F.2d at 394.\n\nCulpability under the conspiracy provision of the RICO Act, 18 U.S.C. § 1962(d), is established by a showing that the defendant manifested his assent to participate, either directly or indirectly, in the affairs of the conspiracy through the commission of two or more predicate crimes. United States v. Elliott, 571 F.2d 880, 903 (5th Cir.), cert. denied, 439 U.S. 953, 99 S. Ct. 349, 58 L. Ed. 2d 344 (1978). It is, of course, unnecessary to prove that a conspirator had full knowledge of every detail concerning the conspiracy. Rather, it is sufficient to show that he had knowledge of the \"essential nature of the plan.\" United States v. Elliott, supra, 571 F.2d at 903, quoting United States v. Brasseaux, 509 F.2d 157, 160 n.3 (5th Cir. 1975).\n\nMoreover, participation in a conspiracy need not be proved by direct evidence. It can be inferred from a \"development and a collocation of circumstances.\" United States v. Malatesta, 590 F.2d 1379, 1381 (5th Cir.) (en banc), cert. denied, 440 U.S. 962, 99 S. Ct. 1508, 59 L. Ed. 2d 777 (1979), quoting Glasser v. United States, supra, 315 U.S. at 80, 62 S. Ct. at 469. A defendant's participation in a conspiracy may be inferred from acts of his which furthered the objectives of the conspiracy. United States v. Marx, supra, 635 F.2d at 439; United States v. Middlebrooks, supra, 618 F.2d at 278. Keeping these legal principles in mind, we will proceed to consider appellants' insufficiency of the evidence claims seriatim:\n\nField\n\nAppellant Field was convicted on the RICO and RICO conspiracy charges (Counts 1 and 2) and on two charges of violating Section 186 of the Taft-Harley Act, 29 U.S.C. § 141 et seq. (Counts 17 and 24).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e While he contends that the sum total of the evidence against him was insufficient to support his conviction on any of those charges, his primary argument is that the district court erred in admitting coconspirator declarations against him. Without reference to those declarations, he argues, the court would have had no choice but to acquit him on all charges.\n\nPrior to trial, the court held a three day hearing for the purpose of determining the admissibility of extra-judicial co-conspirator declarations against each of the defendants. Although such a hearing was held prior to entry of the en banc decision in United States v. James, 590 F.2d 575 (5th Cir.), cert. denied, 442 U.S. 917, 99 S. Ct. 2836, 61 L. Ed. 2d 283 (1979), there is no dispute that the trial court employed the correct legal standard, as enunciated in James, in ruling that the co-conspirators' out-of-court declarations were admissible against Field.\n\nJames requires a showing that, to be admissible under Fed.R.Evid. 801(d) (2) (E), a co-conspirators' extra-judicial declaration must have been made: (1) by a person who conspired with the party against whom the declaration is offered; (2) during the course of the conspiracy; and (3) in furtherance of the conspiracy. United States v. James, supra, 590 F.2d at 578. The standard of proof governing the admissibility of the declarations in a pretrial context is one of substantiality. There must be substantial evidence, independent of the declarations themselves, sufficient to satisfy the three-part test set forth above. 590 F.2d at 581. If, however, co-conspirator declarations are admitted pursuant to a finding that there is \"substantial\" evidence that the defendant was a member of the conspiracy and that the declarations were made by a co-conspirator during the course of and in furtherance of the conspiracy, the defendant may, upon motion made at the conclusion of all the evidence, require the trial judge to re-evaluate the admissibility of the declarations by determining, at that point, where a preponderance of the evidence on that issue lies. United States v. Grassi, 616 F.2d 1295, 1300 (5th Cir.), cert. denied, 449 U.S. 956, 101 S. Ct. 363, 66 L. Ed. 2d 220 (1980).\n\nWe shall consider whether the independent evidence against Field established by a preponderance of the evidence that he was a member of the conspiracy.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The independent evidence against Field showed that in 1966 Field solicited a $3,000 payoff from Teitlebaum. While Field points to the fact that it was one of his associates, Benny Astorino, who first asked Teitlebaum for the money, the evidence was more than sufficient to infer that Field was the motivating force behind Astorino's request. It was Field who initiated the Miami checkers' union, it was Field who asked Teitlebaum if there was someplace they could talk privately, and it was Field who brought Astorino along on the subsequent fishing trip with Teitlebaum. (9:83-85). Teitlebaum testified that Field was sitting only eight feet behind him when Astorino stated that Field was coming to Miami to establish a new checkers' union, that it would be in Teitlebaum's \"best interest\" to do business with him, and that Teitlebaum could demonstrate his good faith by paying him $3,000. (9:86-88). Finally, it was Field himself who called Teitlebaum to ask if he had \"had a change of heart about the three aces.\" (9:92).\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn 1973, when Teitlebaum expressed interest in the Mamenic Line account, Field promised that he would assist him in acquiring it. (5:189-191). Field eased Teitlebaum's concerns regarding a Mamenic representative who was working for a competing stevedoring company by telling him that the representative would be \"taken care of.\" (20:14). Teitlebaum reported to Barone that Field had promised to help him obtain the Mamenic account and Barone, after checking into the matter, told Teitlebaum whom to contact within the Mamenic company. (20:21-23). In June 1974, Teitlebaum's company entered into a contract with the Mamenic Line. Teitlebaum compensated the union officials for their assistance by purchasing three sets of cruise tickets which he gave to appellant Boyle. (20:29-30).\n\nIn 1976, Field and other union officials solicited tickets from Teitlebaum for a Christmas cruise aboard the Mardi Gras. Appellants Field, Boyle, Barone, and Vanderwyde were all present when Teitlebaum, under pressure from Boyle, telephoned a cruise line representative named Meshulam Zonis and attempted to persuade Zonis to acquire the cruise tickets for him at a reduced charge.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e (25:152-155). The representative insisted that it was impossible for him to do so because the cruise was completely booked. After Teitlebaum's efforts failed, Boyle unsuccessfully attempted to persuade the cruise line representative to procure the tickets by warning him that contract renewal time was approaching. (25:156). When it appeared that all further efforts at acquiring the tickets would be futile, Field cursed at Teitlebaum, said that he was not going on the cruise and warned Teitlebaum that he would \"repent.\" (25:157). Field asserts that his refusal to go on the cruise demonstrated that he never participated in the solicitation of the cruise tickets. The fallacious nature of that assertion becomes clear, however, when one views the entire episode in context. Field's angry refusal to go on the cruise came only after it was clear that Teitlebaum was unable or unwilling to purchase the tickets at their full price.\n\nThe final piece of independent evidence tending to prove Field's participation in the conspiracy occurred in the latter part of 1976 when Field had dinner with Ramon DeMott and James Hodges in Savannah. When Hodges and DeMott complained that their Charleston operation floundered because they were never given the opportunity to submit bids, Field responded, \"Don't expect anything for nothing.\" (11:143). While that statement may not have amounted to a solicitation of money, it did bear on Field's knowledge of and participation in the conspiracy.\n\nWe believe that the evidence against Field, independent of any extra-judicial declarations by his co-conspirators, was sufficient to establish Field's membership in the conspiracy by a preponderance of the evidence so as to render the statements of his co-conspirators admissible against him. The independent evidence showed Field personally pressured Teitlebaum for an illegal payoff, furthered the goals of the conspiracy by helping Teitlebaum acquire the Mamenic account for which the union officials were compensated with cruise tickets, and participated in the solicitation of tickets from Teitlebaum for the 1976 Christmas cruise. Moreover, his statement to DeMott and Hodges summed up the central operating doctrine of the entire conspiracy: \"Don't expect anything for nothing.\"\n\nHaving concluded that the co-conspirator declarations were properly admitted against Field, the next question is whether those statements, when combined with the independent evidence against him, constituted sufficient evidence to prove his knowing participation in the conspiracy and criminal enterprise. The out-of-court declarations of Field's co-conspirators showed that:\n\n(1) When Teitlebaum agreed to surrender the Mamenic account in order to acquire the Zim account, Boyle said he would report the decision to Field. (21:41).\n\n(2) When Teitlebaum was considering expanding his business into Mobile, Boyle told him that Field had arranged a meeting between Teitlebaum and co-defendant Isom Clemon, president of the ILA local in Mobile. (24:72). At a meeting in Mobile, Clemon told Teitlebaum and FBI Agent Artin that he would not be meeting with them if he had not received an \"okay\" from either Boyle or Field. (24:141).\n\n(3) Subsequent to Teitlebaum's meeting with Clemon, Boyle informed Teitlebaum that Field had \"underestimated the price\" of Teitlebaum's contract in Mobile. (24:84-85).\n\n(4) At one point, when Boyle was pressing Teitlebaum for payment of $2,400 ($2,000 from a large payment Teitlebaum received on his Zim account and $400 for delinquent \"peace payments\"), Boyle told Teitlebaum that he was going to meet with Field in Savannah and wanted \"everyone to know we were up to date.\" (24:117).\n\n(5) In late 1976, Boyle told Teitlebaum that Field was unhappy with him for refusing to cooperate with Harrington \u0026 Company, a competitor of Teitlebaum's which was also making payoffs to the union officials. (24:211).\n\n(6) Boyle and Clemon both told Agent Artin that Field was sharing a payoff arising from a fertilizer transaction Artin was involved in. (38:171; 39:126; 40:57).\n\n(7) With regard to the solicitation of tickets for the 1976 Christmas cruise, Boyle had told Teitlebaum that Field wanted the tickets so that he could take his wife, son and four other people on the cruise. (25:25).\n\nThe independent evidence against Field, combined with the co-conspirator statements outlined above, was sufficient to prove Field's knowing participation in the criminal enterprise and concomitant conspiracy. This same evidence was also sufficient to support Field's convictions on Counts 17 and 24, which charged violations of the Taft-Hartley Act. Field's convictions on those two counts fulfilled the essential element of both the RICO substantive and conspiracy charges that the defendant engage in two or more predicate crimes. Count 17 related to Field's participation in Teitlebaum's expansion into Mobile, which resulted in a $10,000 payment to the union officials. Count 24 related to Field's participation in the solicitation of tickets for the 1976 Christmas cruise.\n\nVanderwyde\n\nAppellant Vanderwyde was convicted of the RICO substantive and conspiracy charges (Counts 1 and 2), the Hobbs Act extortion charge (Count 3), and five Taft-Hartley charges (Counts 4, 8, 16, 27 and 43). His argument that the evidence was insufficient to support his conviction on any of those charges is without merit.\n\nVanderwyde claims the evidence showed only that he was present on occasions when illegal activities were discussed and points out that mere presence at the scene of a crime is insufficient to establish participation in a conspiracy. United States v. Falcone, 311 U.S. 205, 209-210, 61 S. Ct. 204, 205-206, 85 L. Ed. 128 (1940); United States v. Salinas-Salinas, 555 F.2d 470, 473 (5th Cir. 1977). The evidence adduced at trial, however, was more than sufficient to allow the jury to reasonably find that Vanderwyde was a willing, active participant in the conspiracy and criminal enterprise.\n\nThe evidence showed that Vanderwyde accepted money and cruise tickets from waterfront employers and that he pressured employers to stay current with their payments. Briefly, the evidence against Vanderwyde showed that:\n\n(1) When Teitlebaum finished paying off his cousin's debt to the union, Vanderwyde told him not to let the payments stop. When Teitlebaum asked him what he meant, Vanderwyde responded that they were seeking \"control\" of the port. (19:128).\n\n(2) When Teitlebaum was behind in his weekly \"peace payments,\" Boyle warned him that if Vanderwyde found out, Teitlebaum would be in serious trouble. (19:209-210).\n\n(3) In the spring of 1975, Boyle obtained cruise tickets from Teitlebaum on behalf of Vanderwyde and others. Vanderwyde did, in fact, go on the cruise. (20:76).\n\n(4) In April 1976, Teitlebaum visited the Miami ILA office to pay Boyle $250. Boyle was not there, but Vanderwyde was. Vanderwyde told Teitlebaum that he was too far behind in his payments and that $250 was not enough. He demanded an additional $500 in cash, which Teitlebaum produced. (24:21-22).\n\n(5) At the same meeting, Vanderwyde told Teitlebaum he wanted to take a cruise on the Mardi Gras and said he needed six pairs of tickets. (24:23). Boyle subsequently gave Teitlebaum a list of the couples who would be taking the cruise. Included on the list were Vanderwyde and his wife. (24:36-37).\n\n(6) When Teitlebaum received a substantial payment from the Zim Line for services rendered to the company at the port of Savannah, Boyle demanded $2,000 of the amount as partial payment for getting Teitlebaum the contract in Savannah. Subsequently, Vanderwyde approached Teitlebaum and asked for the money, saying \"Boyle told me you have a commitment for him.\" (24:105).\n\n(7) When Teitlebaum asked Boyle if he could deduct the price of the six pairs of cruise tickets he had previously purchased for the union officials from the $2,000 he owed for Savannah, Boyle told him to consider the cruise tickets as a gift to Vanderwyde. (24:114).\n\n(8) In September 1976, Vanderwyde reminded Teitlebaum that he still owed the union officials $4,000 for the privilege of expanding into Mobile. (25:26).\n\n(9) When Teitlebaum told Vanderwyde that a shipping company operator was trying to sell Teitlebaum his company for $100,000 more than it was worth, Vanderwyde responded that that was too much if the seller intended on keeping all of the money for himself, but \"if it . . . . [was] for a little division, that . . . . [was] something else.\" (25:161).\n\n(10) After Boyle had told Teitlebaum that Field wanted tickets for the 1976 Christmas cruise, Vanderwyde subsequently reminded Teitlebaum not to forget about the tickets. (25:26).\n\n(11) When George Wagner was making payoffs to the union on behalf of Marine Terminals, Inc., Vanderwyde told Wagner that the payoffs were going into a \"pot\" and \"bitterly complained\" because his share of the pot was only $700 to $800 per month. (44:77).\n\n(12) Wagner testified that when Boyle was not available, he would frequently deliver MTI's $1,000 monthly payments to Vanderwyde. (43:74-75).\n\n(13) Vanderwyde also accepted delivery of the $1,000 monthly payments that were made on behalf of Florida Welding Services Corp. (43:155-156).\n\n(14) Vanderwyde was present at numerous meetings where unlawful activity in furtherance of the conspiracy either transpired or was discussed.\n\nThis evidence was clearly sufficient to support the jury's verdict on the RICO counts, for it showed that Vanderwyde actively pursued furtherance of the objects of the conspiracy and enterprise through the commission of at least two predicate crimes.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe evidence also supported Vanderwyde's conviction on the extortion charge. Title 18 U.S.C. § 1951, known as the Hobbs Act, makes it a crime to obstruct or affect interstate commerce by obtaining the property of another through extortionate means. In order to convict under the Hobbs Act, the government need show only that the defendant received the property of another without any lawful claim to such property and that the person who made the payment did so out of fear.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e United States v. Enmons, 410 U.S. 396, 399-400, 93 S. Ct. 1007, 1009-1010, 35 L. Ed. 2d 379 (1973); United States v. Nell, 570 F.2d 1251, 1258 (5th Cir. 1978). The fear experienced by the victim does not have to be the consequence of a direct threat. It is sufficient if the government can show circumstances surrounding the act of extortion that render the victim's fear reasonable. United States v. Nell, supra, 570 F.2d at 1258; United States v. Quinn, 514 F.2d 1250, 1266 (5th Cir. 1975), cert. denied, 424 U.S. 955, 96 S. Ct. 1430, 47 L. Ed. 2d 361 (1976). Fear of economic loss is included within the purview of Section 1951. United States v. Quinn, supra, 514 F.2d at 1267; United States v. Jacobs, 451 F.2d 530, 542 (5th Cir.), cert. denied, 405 U.S. 955, 92 S. Ct. 1170, 31 L. Ed. 2d 231 (1972).\n\nThe evidence was sufficient to permit the jury to reasonably conclude that Vanderwyde, together with the other defendants charged in Count 3, obtained money and other articles of value, i.e., cruise tickets, from Teitlebaum through extortionate means. There was, in fact, an implicit threat of economic injury underlying the entire conspiracy. Teitlebaum's weekly \"peace payments\" were for the purpose of ensuring continued labor peace. Teitlebaum's payments in connection with Mobile and Savannah were necessary in order to receive any waterfront business at those ports. The threat of economic loss cast a continuous shadow over Teitlebaum's dealings with the Miami union officials and Vanderwyde played a major role in those dealings.\n\nFinally, there was also sufficient evidence to support Vanderwyde's convictions on the Taft-Hartley charges. As noted supra, a violation of Section 186 of that statute is proved by a showing that a union officer accepted any payment of money or other article of value from an employer. The evidence established that Vanderwyde: accepted money from Teitlebaum between 1972 and 1977 (Count 4); accepted cruise tickets from Teitlebaum in the spring of 1975 (Count 8); accepted cruise tickets from Teitlebaum in May or June 1976 (Count 16); accepted money from George Wagner at various times between 1970 and 1973 (Count 27); and accepted money on behalf of Morales and the Kopituks at various times between 1973 and 1975 (Count 43).\n\nWilliams\n\nAppellant Williams was convicted on the two RICO charges (Counts 1 and 2) and on two Taft-Hartley charges (Counts 9 and 15). The gist of Williams' attack upon the sufficiency of the evidence is that all of the pertinent evidence against him consisted of the testimony of government witnesses who were not telling the truth. This approach is patently invalid, however, inasmuch as we are required to review the evidence in the light most favorable to the government. That standard requires that all credibility determinations be resolved in favor of the government. Glasser v. United States, supra, 315 U.S. at 80, 62 S. Ct. 469; United States v. Marx, supra, 635 F.2d at 438; United States v. Arrendondo-Morales, supra, 624 F.2d at 684; United States v. Middlebrooks, supra, 618 F.2d at 278.\n\nThis is in accordance with the fundamental rule that credibility determinations lie within the sole province of the trier of fact. United States v. Phillips, supra, 664 F.2d at 1032; United States v. McCrary, 643 F.2d 323, 328 (5th Cir. 1981); United States v. De Los Santos, 625 F.2d 62, 65 (5th Cir. 1980). Accordingly, we are not in a position to evaluate the relative credibility of the witnesses who testified against Williams. Suffice it to say that the testimony of those witnesses was more than adequate to establish Williams' guilt on the two RICO counts, as well as on the two Taft-Hartley counts. The evidence against Williams can be summarized as follows:\n\n(1) In the Spring of 1975, Williams contacted Boyle about obtaining some cruise tickets from Teitlebaum. (20:71). Teitlebaum purchased the tickets at his own expense and gave them to Boyle. (20:73).\n\n(2) In October 1976, Teitlebaum met with Williams in Miami to discuss expanding his stevedoring operation into Jacksonville. They agreed that Teitlebaum would pay Williams $1,000 per month plus additional money depending upon the amount of cargo handled. (25:55-57). Teitlebaum gave Williams $400 up front, but Williams indicated he wanted $500. Teitlebaum responded that he would receive the additional $100, along with the first $1,000 monthly payoff, when they met in Jacksonville. (25:80-81).\n\n(3) At the same meeting, Teitlebaum attempted to discuss the 1975 cruise tickets, but Williams cut him off, stating that it was too easy for someone to \"bug\" an automobile. (25:81).\n\n(4) Shortly after Teitlebaum met with Williams in Miami, he travelled to Jacksonville and paid Williams $1,100, using money supplied by the FBI. (25:96).\n\n(5) In 1975, co-defendant Joseph Cotrone received an offer from PRMMI to perform the company's maintenance and repair work at the port of Jacksonville. Barone told Cotrone it would be necessary to give Williams $3,000 in order for Cotrone to get an introduction into the Jacksonville area. (60:42). The Cotrones eventually formed a new company in Jacksonville and began paying Williams 25 cents for each hour worked by Cotrone's Jacksonville employees. That formula was later abandoned in favor of a flat $1,000 per month. (63:26-27, 39-45; 64:141, 172-203).\n\n(6) Williams presided over the meeting at which Ramon DeMott and James Hodges attempted to negotiate a union contract in Savannah. When DeMott and Hodges sought to make certain changes in the contract, Williams warned them that people who gained disfavor with the union \"wound up on their backs in bed and their arms and legs in traction, sipping soup through a straw and thinking about the follies of their ways.\" (11:72).\n\nWhile the major portion of Williams' argument relating to the sufficiency of the evidence consists of a general attack upon the credibility of the witnesses who testified against him, he focuses particular attention upon Count 9 of the indictment. Count 9 charged that Williams solicited and received cruise tickets from Teitlebaum in or about May 1975, in violation of Section 186 of the Taft-Hartley Act. Williams, testifying at trial, admitted receiving the tickets, but claimed he paid Boyle for them. Boyle did not testify.\n\nWilliams argues that the jury could not have reasonably returned a guilty verdict on Count 9 in light of his uncontradicted testimony that he paid Boyle for the tickets. The government argues that the jury was free to reject Williams' testimony as not being credible, pointing out that there was contradictory testimony concerning the ticket transaction. Williams testified that he paid Boyle for the tickets while at a union meeting in Charleston, South Carolina. He further testified that he received the tickets at the time of payment and that he personally delivered them to the mayor's office upon his return to Jacksonville.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e (81:53-55). The mayor, on the other hand, testified that Williams told him the tickets could be picked up in Miami and the mayor's son testified that that was in fact where he picked them up. (34:164-165; 88:149-150).\n\nTeitlebaum's testimony concerning his initial meeting with Williams cast further doubt upon the truthfulness of Williams' version of the facts. When Teitlebaum attempted to discuss the cruise tickets he had obtained for Williams, Williams cut him short, stating that he did not want to discuss the matter in an automobile because cars were too easy to bug. (25:81). Surely, had Williams actually paid Boyle the full value of the tickets he would have had no reason to fear that a discussion of the incident was being surreptitiously overheard.\n\nThe fact that Teitlebaum was never reimbursed for the cost of the tickets, combined with Williams' contradictory testimony and his reluctance to discuss the ticket transaction for fear of being electronically surveilled, was sufficient to allow the jury to infer that Williams never in fact paid for the tickets. The evidence was sufficient to convict Williams on Counts 1, 2, 9 and 15.\n\nMorales, R. Kopituk, D. Kopituk\n\nAppellant Morales was convicted of the two RICO charges (Counts 1 and 2), two Taft-Hartley charges (Counts 44 and 46), and two income tax charges (Counts 68 and 70). Raymond Kopituk was convicted of the two RICO charges, the same two income tax charges, and one Taft-Hartley charge (Count 44). Dorothy Kopituk was not charged in the substantive RICO count and was acquitted on the RICO conspiracy count. She was convicted of two income tax charges (Counts 68 and 69) and one Taft-Hartley charge (Count 44). Together, they challenge the sufficiency of the evidence as to all counts upon which they were convicted.\n\nMorales and Kopituk contend that the evidence was insufficient to support their convictions on either RICO count. In the final analysis, however, their argument boils down to another ill-fated attack upon the credibility of the witnesses who testified against them.\n\nWith respect to the RICO substantive count, the government produced sufficient evidence to prove the existence of the enterprise,\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e that Morales and Kopituk were associated with the enterprise, and that Morales and Kopituk participated in the affairs of the enterprise through a pattern of racketeering activity. United States v. Martino, supra, 648 F.2d at 394. With respect to the RICO conspiracy count, the evidence was sufficient to allow the jury to reasonably find that Morales and Kopituk agreed to participate, either directly or indirectly, in the affairs of the enterprise through the commission of two or more predicate crimes. United States v. Elliott, supra. 571 F.2d at 903.\n\nAt the trial below, Morales and Kopituk attempted to establish their innocence by denying all participation in the criminal enterprise. While they adhere to that position on appeal, they apparently make the further contention that, assuming the evidence was sufficient to establish their participation in the enterprise, such participation resulted solely from coercion exerted upon them by union officials. In other words, Morales and Kopituk attempt to adopt a position similar to that taken by co-defendant Harrington at trial, i.e., that they were unwilling victims of the criminal enterprise who were coerced into making illegal payoffs under the threat of economic ruin. The evidence adduced at trial, however, was clearly sufficient to establish that Morales and Kopituk sought out the union officials and willingly agreed to make payoffs in return for lucrative waterfront business. Viewing the evidence in the light most favorable to the government, it showed that:\n\n(1) In 1972, Morales and Kopituk sought out George Wagner in an effort to obtain a union contract to engage in container and trailer repair work at the Dodge Island Seaport. (43:119-120). Wagner discussed the matter with Barone, Boyle and Vanderwyde, and it was agreed that Morales and Kopituk could acquire a union contract for an initial payment of $10,000 and $1,000 each month thereafter. (43:120-121). Wagner, however, told Morales and Kopituk that it would cost $15,000 up front, intending to keep the extra $5,000 for himself. Morales and Kopituk readily agreed to the payoffs. (43:122).\n\n(2) Shortly thereafter, Morales and Kopituk met with Wagner and paid him the $15,000. (43:126). Wagner subsequently began sending business from MTI to Florida Welding Services Corp., the company operated by Morales and Kopituk.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e (43:135).\n\n(3) In 1973, Wagner began receiving the $1,000 monthly payoffs from Morales and Kopituk, which he delivered alternately to Boyle, Barone or Vanderwyde. (43:156). The government established the probable method through which FWS generated cash for the payoffs by producing several witnesses who testified that, at the request of Morales or Kopituk, they cashed FWS checks designating them as payees and returned the cash to either Morales or the Kopituks.\n\n(4) In January 1975, Morales and Kopituk contacted Wagner about acquiring a second union contract to enable them to expand their operation. Wagner assented to the initiative and told Morales and Kopituk that it would cost them another $15,000 up front. They gave Wagner a $5,000 installment which he kept, unbeknownst to the union officials. (43:173-176). Morales and Kopituk later complained to Barone about the fact that \"they were not getting any service from . . . . [Wagner] and that they were going to discontinue paying if they did not get some more attention from the union.\" (44:35).\n\n(5) In mid-1973, Morales approached Wagner about the possibility of securing some waterfront business on behalf of a friend of his who operated a trucking company. Wagner discussed the proposal with Barone, who gave his approval. Wagner contacted Morales and explained that his friend, Jeronimo Acosta, could obtain the union contract for $15,000, that $10,000 of that amount would go to the union, and that he and Morales would split the remaining $5,000. (44:45). Morales agreed and the deal was transacted in that manner.\n\n(6) In June 1975, Ramon DeMott and James Hodges discovered that it would be necessary for them to obtain a union contract in order to continue operating their container repair business in Savannah. They contacted Morales and arranged to meet. When DeMott and Hodges subsequently met with Morales and Kopituk in Savannah, Morales told them that it would cost anywhere from $5,000 to $15,000 to acquire a union contract. (11:44; 13:48). Kopituk agreed with Morales' estimate. (11:45; 13:48). Shortly after Morales and Kopituk departed, DeMott and Hodges received a telephone call from Boyle, who requested a meeting with them. (11:46; 13:48-49). When DeMott and Hodges arrived at Boyle's Savannah office, Morales and Kopituk were already there. (11:46; 13:50). Morales and Kopituk left and Boyle made the payoff arrangements which ultimately led to DeMott and Hodges entering into a union contract. (11:49; 13:52).\n\nThe response of Morales and Kopituk to the evidence summarized above is that the witnesses were not telling the truth. There were, in fact, some inconsistencies in the testimony of the witnesses. The discrepancies, however, related to more or less extraneous facts, rather than to the substance of the illegal transactions. In other words, while the testimony of some witnesses differed as to events that led up to or occurred during the illegal transactions, the testimony was consistent as to the issues central to the jury's verdicts, i.e., that the illegal transactions did in fact transpire. Moreover, as noted supra, conflicts in the testimony were for the jurors to resolve, based upon their collective evaluation of the respective witnesses' credibility.\n\nThe evidence demonstrated that Morales and Kopituk knowingly and voluntarily associated themselves with the criminal enterprise and participated in its affairs through a pattern of racketeering activity. Similarly, the evidence demonstrated that Morales and Kopituk had conspired to participate in the affairs of the enterprise through the commission of two or more predicate crimes. Thus, the evidence was sufficient to support their convictions on both the RICO substantive and conspiracy charges.\n\nMorales, Raymond Kopituk and Dorothy Kopituk were all convicted on Count 44, which charged them with making the $1,000 monthly payments to the Miami union officials. The testimony of George Wagner provided sufficient evidence to support the jury's verdict on that count. As outlined above, Wagner regularly received the $1,000 payments from either Morales or Raymond Kopituk, which he then delivered to either Boyle, Barone or Vanderwyde.\n\nMoreover, Wagner testified that on two occasions he received the payment directly from Dorothy Kopituk. His testimony regarding one of those transactions served to demonstrate Mrs. Kopituk's knowing participation in the payoff scheme. Wagner testified that, on the occasion in question, he visited the offices of FWS to collect the $1,000 monthly payment. Raymond Kopituk explained that they were having problems generating enough cash to satisfy the payments and asked if Wagner would accept a check. Wagner said that he would and Dorothy Kopituk asked him how she should record the check. Wagner told her it did not matter to him and that as far as he was concerned she could write \"Happy Birthday.\" She asked him if \"consulting fee\" would be acceptable and he said that would be fine, so she proceeded to record the check in that manner. (44:22-24).\n\nWagner's testimony, along with that of Jeronimo Acosta and George Medina, also furnished sufficient evidence to support Morales' conviction on Count 46, which charged him with aiding and abetting Boyle's receipt of $10,000 on behalf of Jasca Transfer, Inc. In return for the $10,000, Jasca Transfer was awarded a union contract to perform trucking work at the port of Miami.\n\nMorales, Raymond Kopituk and Dorothy Kopituk all challenge the sufficiency of the evidence supporting their convictions on the income tax counts. Those counts charged that Morales and the Kopituks knowingly assisted in the preparation of (and, in the case of Dorothy Kopituk in Count 69, knowingly made and subscribed to) income tax returns for the 1974 and 1975 fiscal years that claimed false deductions. The government's evidence showed that many amounts claimed as legitimate business expenses actually constituted illegal payoffs to union officials.\n\nSpecifically, the tax counts on which Morales and the Kopituks were convicted charged that: (1) for the fiscal year ending March 31, 1974, Morales and both Kopituks assisted in the preparation of a fraudulent tax return on behalf of FWS (Count 68); (2) for the fiscal year ending March 31, 1975, Dorothy Kopituk made and subscribed a false tax return on behalf of FWS (Count 69); and (3) for the fiscal year ending March 31, 1975, Morales and Raymond Kopituk assisted in the preparation of a false tax return on behalf of FWS (Count 70). The defense to these charges was that, with respect to Counts 68 and 70, the appellants never examined or signed the tax returns and, with respect to Count 69, that Dorothy Kopituk, although signing the return, never examined it. Appellants press this same argument on appeal.\n\nThe evidence, however, was sufficient to support their convictions on the tax counts even if appellants' testimony that they never examined the returns is accepted as true (which, of course, the jury was not required to do). Appellants rely upon the fact that it was their accountant, rather than themselves, who actually prepared the returns, yet they do not contest that the returns were prepared with reference to the corporate records they compiled. Since the tax returns were prepared in reliance upon the information supplied by appellants, they were chargeable with knowledge of the content of those returns regardless of the fact that they did not actually fill out the tax forms. See United States v. Cramer, 447 F.2d 210, 219 (2d Cir. 1971), cert. denied, 404 U.S. 1024, 92 S. Ct. 680, 30 L. Ed. 2d 674 (1972); United States v. Maius, 378 F.2d 716, 718 (6th Cir.), cert. denied, 389 U.S. 905, 88 S. Ct. 216, 19 L. Ed. 2d 219 (1967).\n\nThose records fraudulently designated amounts used to pay off union officials as expenses for \"commissions,\" \"repairs\" and other items. The fact that appellants did not examine or sign the returns is not a determinative factor. See United States v. Wolfson, 573 F.2d 216, 225 (5th Cir. 1978). The evidence was sufficient for the jury to find Morales and the Kopituks guilty of the tax charges.\n\nD. ADMISSION OF FIELD'S CONVICTION\n\nAppellant Field argues that it was error for the trial court to admit evidence of his prior conviction on federal racketeering charges.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e In 1977, Field was convicted in the Southern District of New York on RICO and Taft-Hartley charges for unlawfully demanding and receiving payments from employers while serving as General Organizer of the ILA.\n\nAs with many other issues involved in this appeal, our standard of review in considering the propriety of the district court's decision to admit the evidence of Field's prior conviction is limited to a search for abuse of discretion. United States v. Bulman, 667 F.2d 1374, 1382 (11th Cir. 1982); United States v. McMahon, 592 F.2d 871, 873 (5th Cir.), cert. denied, 442 U.S. 921, 99 S. Ct. 2847, 61 L. Ed. 2d 289 (1979). Our analysis proceeds under the guidance of Fed.R.Evid. 404(b) and the decision entered in United States v. Beechum, 582 F.2d 898 (5th Cir. 1978) (en banc), cert. denied, 440 U.S. 920, 99 S. Ct. 1244, 59 L. Ed. 2d 472 (1979).\n\nRule 404(b) provides that evidence of other crimes is not admissible to prove the bad character of a person, but is admissible for a variety of other purposes, such as to show intent, motive, opportunity, preparation, or the absence of mistake. In Beechum, the former Fifth Circuit Court of Appeals, sitting en banc, set out a two-part test for determining the admissibility of extrinsic offense evidence under Rule 404(b): \"First, it must be determined that the extrinsic offense evidence is relevant to an issue other than the defendant's character. Second, the evidence must possess probative value that is not substantially outweighed by its undue prejudice and must meet the other requirements of Rule 403.\" 582 F.2d at 911.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nSimilarity of the extrinsic offense to the offense charged is the standard by which relevancy is measured under Rule 404(b). In the context of a claim that the extrinsic offense is relevant to the issue of intent, as is the case herein, relevancy is determined by comparing the state of mind of the defendant in perpetrating the respective offenses. A finding that the offenses involved the same state of mind renders the extrinsic offense relevant to an issue other than character because it lessens the likelihood that the defendant acted with lawful intent in connection with the charged offense. 582 F.2d at 911.\n\nThe similarity and, hence, relevancy of Field's extrinsic offenses to the offenses charged below is undeniable. The charges in both cases involved Field using his position as a union official to extort or otherwise demand and receive money and other articles of value from employers. The state of mind inherent in the commission of such nearly identical offenses would necessarily be the same. As such, the first portion of the Beechum test was clearly satisfied.\n\nThe next question is whether the probative value of the extrinsic offense evidence was substantially outweighed by the danger of unfair prejudice. This second part of the Beechum test requires application of a heightened test of relevance with reference to the posture of the case at the time the government seeks to admit the extrinsic offense evidence. If the issue of intent is contested and the government lacks other strong evidence of intent, then the extrinsic offense evidence will likely posses great probative value, sufficient to outweigh any danger of unfair prejudice. On the other hand, if the defendant's intent is uncontested, \"then the incremental probative value of the extrinsic offense is inconsequential when compared to its prejudice\" and the evidence should be excluded. 582 F.2d at 914.\n\nField contends that this latter principle was applicable to the trial below and mandated exclusion of the evidence relating to his prior conviction. He argues that since he denied any and all participation in the offenses charged, his intent was never placed in issue. While other courts have held that denial of participation in the acts charged does not place the defendant's intent at issue, e.g., United States v. Powell, 587 F.2d 443 (9th Cir. 1978), the law in this circuit is that, in the context of a conspiracy case, the mere entry of a not guilty plea sufficiently raises the issue of intent to justify the admissibility of extrinsic offense evidence.\n\nIn United States v. Roberts, 619 F.2d 379 (5th Cir. 1980), it was held that:\n\nin every conspiracy case . . . . a not guilty plea renders the defendant's intent a material issue and imposes a difficult burden on the government. Evidence of such extrinsic offenses as may be probative of a defendant's state of mind is admissible unless he 'affirmatively take[s] the issue of intent out of the case.'\n\n619 F.2d at 383, quoting United States v. Williams, 577 F.2d 188, 191 (2d Cir.), cert. denied, 439 U.S. 868, 99 S. Ct. 196, 58 L. Ed. 2d 179 (1978); accord, United States v. Bulman, supra, 667 F.2d at 1382; United States v. Renteria, 625 F.2d 1279, 1282 (5th Cir. 1980). The decision in Roberts was based upon the unique difficulty of proving intent in a conspiracy case, where it must be shown that the defendant knowingly joined in a scheme to commit a crime or a series of crimes and not simply that he committed a particular criminal act or that he associated with other conspirators. The court took special cognizance of the particularly onerous burden involved in attempting to prove the intent of a defendant who was a \"passive\" member of the conspiracy. 619 F.2d at 383.\n\nThe rule enunciated in Roberts, that entry of a not guilty plea in a conspiracy case suffices in and of itself to render the defendant's intent a material issue, is not an exception to the rationale of Beechum. Rather, it is an extension of that rationale. Beechum merely held that where a defendant's intent is uncontested or where the government's other proof of intent is strong, the extrinsic offense is unnecessary to the government's case and, therefore, lacks any real probative value. As such, the danger of unfair prejudice overshadows the probative value of the evidence and justifies its exclusion. The Roberts decision adhered to that principle but, recognizing the difficulty of proving intent in a conspiracy case, held that intent is virtually always at issue in such cases and that extrinsic offense evidence is thus highly probative when it bears on that issue. Only when the defendant \"affirmatively takes the issue of intent out of the case,\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e is he entitled to exclusion of the evidence. 619 F.2d at 383.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nIn the instant case, Field was, of course, charged with conspiracy. The government's evidence of Field's intent to participate in the conspiracy was not strong. Indeed, it appears that, while Field's role in the conspiracy was substantial, he was one of those \"passive\" or insulated participants alluded to in Roberts. Much of the proof bearing on Field's intent was arguably susceptible to innocent interpretation. For example, counsel for Field attempted to establish through the cross-examination of Ramon DeMott that Field's statement, \"Don't expect something for nothing,\" was devoid of any ominous meaning, suggesting that, \"It could have meant anything, couldn't it?\" (12:138).\n\nIn short, the evidence of Field's prior conviction was highly probative of Field's intent and outweighed any possible prejudice he or his co-defendants suffered from its admission into evidence. This was particularly true in light of the lengthy limiting instruction read to the jury immediately after admission of the evidence\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e which repeatedly emphasized: that the evidence of Field's prior conviction could not be considered as evidence that Field committed the acts charged in the indictment below; that the evidence could not be considered for any purpose whatsoever unless the jury first found that the other evidence established beyond a reasonable doubt that Field committed the acts charged in the indictment; that if the jury found beyond a reasonable doubt that Field committed the acts charged in the indictment then it could consider the extrinsic offense evidence only in determining Field's state of mind in committing those acts; and that the evidence did not in any way relate to any of the other defendants in the case and could not be considered as relating to any other defendant. (71:207-210).\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nBecause the evidence of Field's prior conviction was relevant to Field's intent and because its probative value outweighed any danger of unfair prejudice to Field or his co-defendants, the trial court did not abuse its discretion in admitting the evidence.\n\nE. CROSS-EXAMINATION OF TEITLEBAUM\n\nAppellants Williams and Vanderwyde maintain that the trial court improperly limited the scope of their cross-examination of Joseph Teitlebaum, the principle government witness. As noted supra, Teitlebaum was arrested in 1975 on state charges for his participation in a plot to kill a business associate in South America. In return for his agreement to cooperate with the government in connection with this case, Teitlebaum was permitted to plead guilty to a misdemeanor charge and the other charges were dropped.\n\nAt trial, appellants were permitted to elicit the following information from Teitlebaum during cross-examination concerning the state charges: (1) that in 1975 he was charged by the state of Florida with solicitation to commit murder, conspiracy to commit murder and attempted murder; (2) that he faced a maximum exposure of 21 years in prison; (3) that in return for his agreement to testify for the government in this cause he was permitted to plead to the misdemeanor charge of solicitation to commit murder; and (4) that pursuant to that plea arrangement, he received a sentence of one year probation and the other charges against him were dropped. (31:34-37).\n\nNevertheless, despite the wide latitude of inquiry accorded by the trial court regarding these charges, appellants contend the court committed reversible error in prohibiting questions relating to the method in which the contract killing arranged by Teitlebaum was to be executed -- with an ice pick. Appellants claim this limitation on the scope of their cross-examination of Teitlebaum contravened their Sixth Amendment right to confront the witnesses against them.\n\nWilliams and Vanderwyde cite a litany of cases holding that the confrontation clause bestows upon a defendant the right to cross-examine a prosecution witness as to any possible biases, prejudices or ulterior motives that bear upon his testimony. The cases make it clear that \"the exposure of a witness' motivation in testifying is a proper and important function of the constitutionally protected right of cross-examination,\" Davis v. Alaska, 415 U.S. 308, 316, 94 S. Ct. 1105, 1110, 39 L. Ed. 2d 347 (1974), and that \"cross-examination of a witness in matters pertinent to his credibility ought to be given the largest possible scope.\" United States v. Partin, 493 F.2d 750, 763 (5th Cir. 1974), quoting McDonnell v. United States, 393 F.2d 404, 406 (5th Cir. 1968).\n\nAs was observed in United States v. Mayer, 556 F.2d 245 (5th Cir. 1977), wide latitude in exploring a witness' motivation for testifying is particularly necessary where:\n\na prosecution witness has had prior dealings with the prosecution or with other law enforcement officials, so that the possibility exists that his testimony was motivated by a desire to please the prosecution in exchange for the prosecutor's actions in having some or all of the charges against the witness dropped, [citing case], securing immunity against prosecution for the witness, [citing case], or attempting to assure that the witness receives lenient treatment in sentencing, [citing case].\n\n556 F.2d at 248-249. This observation was particularly applicable to the trial below where Teitlebaum, who had previously entered into an agreement with prosecutors whereby he would testify in return for a favorable plea package in connection with the state charges against him, was unquestionably the government's most vital witness. The flaw in appellants' claim, however, is that their rights under the confrontation clause were more than adequately protected by the leeway accorded to them by the trial court in conducting their cross-examination of Teitlebaum. The trial court allowed appellants to elicit all pertinent information concerning Teitlebaum's prior conviction and its bearing upon his decision to cooperate with the government.\n\nThe claim that the method of killing that was to be employed in executing the murder contract (i.e., attack with an ice pick) was critical to appellants' efforts to discredit Teitlebaum's testimony lacks any persuasive merit. As the trial judge aptly noted, the fact that death was to be effectuated through a \"pill or a gun or an ice pick\" did not in any way impact upon Teitlebaum's credibility. (26:220). The critical point, which the trial court correctly permitted to be brought out before the jury, was that Teitlebaum had arrived at an agreement with the government whereby he would testify in the instant matter in return for a lenient plea agreement in connection with his state charges.\n\nA defendant's right to cross-examine witnesses against him is not absolute. The information sought to be elicited must be relevant. Greene v. Wainwright, 634 F.2d 272, 275 (5th Cir. 1981); United States v. Love, 599 F.2d 107, 108 (5th Cir.), cert. denied, 444 U.S. 944, 100 S. Ct. 302, 62 L. Ed. 2d 312 (1979). Once cross-examination has been permitted to an extent sufficient to satisfy the defendant's Sixth Amendment rights, the trial judge's discretionary authority comes into play. Greene v. Wainwright, supra, 634 F.2d at 275; United States v. Mayer, supra, 556 F.2d at 250; United States v. Bass, 490 F.2d 846, 858 n.12 (5th Cir. 1974).\n\nIn the case sub judice, the trial court, after allowing appellants to cross-examine Teitlebaum to the full extent necessary to explore his motives for testifying, properly exercised its discretionary authority to prohibit questioning as to the proposed method of killing. Such questioning would have added nothing to the appellants' legitimate interests in impeaching Teitlebaum's credibility. Rather, as the trial court found, testimony on this matter would have served only to inflame the jurors and divert their attention from the real issues in the case.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nAppellants exhaustively cross-examined Teitlebaum for five full days. They were permitted to pursue every possible course of questioning designed to discredit his testimony including his underlying motives, inconsistencies between his trial testimony and his prior statements, and his own participation in the criminal enterprise. References to Teitlebaum's 1975 arrest were made at several points during the cross-examination. In short, appellants were accorded a full, fair opportunity, which they took advantage of, to cross-examine Teitlebaum as to every material matter.\n\nF. BRADY VIOLATIONS?\n\nAppellants Vanderwyde and Williams contend that they were denied due process of law by the prosecutors' actions in failing to disclose allegedly exculpatory information to them, in violation of the rule enunciated in Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963). The Brady doctrine holds that \"suppression . . . . of evidence favorable to an accused upon request violates due process where the evidence is material either to guilt or to punishment, irrespective of the good faith or bad faith of the prosecution.\" 373 U.S. at 87, 83 S. Ct. at 1196.\n\nAppellants' central Brady claim revolves around a conflict in the testimony of two government witnesses, Jeronimo Acosta and George Medina, who were business partners in the Miami-based trucking company, Jasca Transfer, Inc. Acosta testified that he paid $15,000 to the Miami union officials to acquire a union contract to operate his trucking business at the Dodge Island Seaport. Business went very well for a few months after Acosta entered into the contract, but then began to decline. Dismayed at the small amount of business that was being parceled out to Jasca Transfer, Acosta complained to George Wagner and demanded to meet with Boyle and Barone. When Boyle, Barone and Wagner visited Acosta's office the next day, Acosta reiterated his complaints and threatened to expose the criminal enterprise to the FBI and the media unless the union officials took action to solve his \"problem.\" Barone's response to Acosta's threat was, according to Acosta, a counter-threat against Acosta's life. Acosta testified that his partner, George Medina, was present at and participated in the discussion.\n\nMedina had testified earlier in the trial. While his testimony corroborated Acosta's as to many material matters, it differed as to many details. Medina was not questioned about the meeting at which Barone allegedly threatened Acosta.\n\nImmediately prior to appellants' cross-examination of Acosta, one of the government attorneys discovered that he had inadvertently failed to include a transcript of Acosta's testimony taken at one of his appearances before the grand jury in a package of Jencks Act materials delivered to defendants.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e The omitted transcript contained Acosta's assertion that Medina was present when Barone threatened Acosta, a claim concerning which Acosta testified at trial but which was not referred to in any of the materials delivered to defendants prior to Medina's appearance at trial. Appellants subsequently obtained an affidavit from Medina setting forth that he had no knowledge of the discussion in which Barone threatened Acosta and that he had informed the government attorneys of that fact prior to testifying.\n\nAccordingly, appellants moved the district court to either dismiss the indictment or declare a mistrial, contending that the prosecutors' actions in failing to timely deliver a copy of Acosta's grand jury testimony and in failing to inform them of Medina's claim that he never witnessed Barone threatening Acosta constituted violations of the Brady doctrine. Prejudice resulted, appellants claimed, from the fact that they were deprived of an opportunity to discredit Acosta's testimony regarding the death threat by showing, through cross-examination of Medina, that Acosta was lying as to other details surrounding the conversation; namely, that Medina was present and participated in the discussion.\n\nThe trial court denied appellants' motions but, finding that the undisclosed information came \"sufficiently close\" to constituting Brady material, allowed Medina to be recalled as a government witness. On their renewed cross-examination of Medina, appellants elicited his claim that, contrary to Acosta's assertions, he had no knowledge of the discussion wherein Barone threatened Acosta's life.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The trial court refused, however, to permit any questions bearing on the prosecutors' alleged misconduct, that is, Medina was not permitted to testify to the fact that he had previously told the government attorneys that he had no knowledge of the meeting described by Acosta.\n\nOn appeal, appellants challenge the denial of their respective motions to dismiss the indictment or to declare a mistrial and argue further that the trial court erred in prohibiting them from questioning Medina as to his statements to the government attorneys.\n\nA defendant seeking to show a breach of the Brady doctrine warranting reversal of his conviction must establish three facts: (1) that the prosecution suppressed evidence; (2) that the evidence bore favorably on the defendant's defense; and (3) that the evidence was material to the question of guilt or innocence. Moore v. Illinois, 408 U.S. 786, 794-795, 92 S. Ct. 2562, 2567-68, 33 L. Ed. 2d 706 (1972); United States v. Anderson, supra, 574 F.2d at 1353. While we believe appellants have failed to meet this tripartite standard, it is unnecessary to explore the question in detail, for we find that the actions of the trial court in recalling Medina as a witness operated to erase any potential prejudice appellants might otherwise have suffered as a consequence of the government's omissions.\n\nClearly, the circumstances at the trial below did not resemble the typical situation giving rise to a Brady claim. As the Supreme Court observed in United States v. Agurs, 427 U.S. 97, 108, 96 S. Ct. 2392, 49 L. Ed. 2d 342 (1976), the context in which Brady claims are generally raised \"involves the discovery, after trial, of information which had been known to the prosecution but unknown to the defense.\" 427 U.S. at 103, 96 S. Ct. at 2397 (emphasis added).\n\nIn considering whether the government's nondisclosure of exculpatory information operated to deny a federal defendant his right to due process of law guaranteed by the Fifth Amendment, the focus is not upon the fact of nondisclosure, but upon the impact of the nondisclosure on the jury's verdict. See United States v. Anderson, supra, 574 F.2d at 1356. As was stated in United States v. Agurs, supra, no denial of due process occurs \"unless the omission deprived the defendant of a fair trial . . . .\" 427 U.S. at 108, 96 S. Ct. at 2399-2400.\n\nAt the trial below, the government's omissions had no impact upon the jury's verdicts because the omissions were discovered during trial, rather than after trial, thereby enabling the trial court to take action to remedy the effect the omissions might otherwise have had. Allowing Medina to be recalled as a government witness afforded appellants the opportunity to fully exploit the inconsistencies between the respective testimony of Medina and Acosta, and it is clear that the entire thrust of appellants' Brady argument at the trial below was founded upon the fact that they were initially deprived of such an opportunity.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Consequently, since the omissions in no way impacted upon the jury's verdicts, appellants have no basis to claim they were denied a fair trial.\n\nAppellants' claim that they should have been permitted to elicit Medina's testimony, in the presence of the jury, relating to his prior oral statements to the government attorneys similarly lacks merit. The theory behind this argument is that appellants should have been permitted to expose to the jury, through Medina's testimony, what they perceived to be prosecutorial misconduct in intentionally concealing evidence favorable to their defense. Appellants failed to convince the trial court, however, that any intentional prosecutorial misconduct necessarily occurred. That fact combined with the fact that the testimony lacked any real relevance to the issues in the case moved the district court to reject appellants' argument on this point. The court ruled that, under Fed.R.Evid. 403, the probative value of Medina's testimony as to what he told the government attorneys was outweighed by its potential for misleading the jury.\n\nIn considering appellants' claim, it is significant to first note what is not involved. Contrary to appellants' assertions at trial, this is not a case where the government intentionally produced perjured testimony. The government attorneys explained to the trial court that they did not attach great significance to Medina's conflicting version of the facts because they simply accepted it as another of many discrepancies between the testimony of Acosta and Medina.\n\nAt trial, the prosecutors argued that it was not their burden to develop appellants' case and, in fact, the law supports the proposition that where information is otherwise available to a defendant, \"truth, justice, and the American way do not . . . . require the Government to discover and develop the defendant's entire defense.\" United States v. Brown, 628 F.2d 471, 473 (5th Cir. 1980). Since the prosecutors believed they had already provided appellants with a transcript of Acosta's grand jury testimony containing Acosta's assertion that Medina was present when Barone threatened to kill Acosta, they apparently did not feel it was necessary to relate the content of Medina's oral statements to appellants. While perhaps it would have been more desirable for the prosecution to have erred on the side of caution, we are unable to conclude that there was any egregious prosecutorial misconduct at the trial below. Consequently, we cannot say that the trial court abused its discretion in determining that the probative value of Medina's testimony bearing on the alleged prosecutorial misconduct was outweighed by the considerations enumerated in Rule 403.\n\nAppellant Williams sets forth a sundry list of other Brady violations purported to have occurred at trial, none of which warrant detailed discussion. Suffice it to say that none of the claims rise to the level of Brady violations because the evidence underlying the individual claims was either non-exculpatory in nature or was not sufficiently material to warrant reversal of Williams' conviction.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Moreover, like the claim involving Acosta and Medina, all of Williams' Brady claims involve mere delays in the transmittal of information or materials to the appellants and not outright omissions that remained undiscovered until after trial. Accordingly, since Williams was able to fully and effectively utilize the information or materials, he was not deprived of a fair trial.\n\nG. THE PROSECUTOR'S CLOSING ARGUMENT\n\nAppellant Field challenges the propriety of the prosecutor's closing argument on two grounds. First, he argues that the prosecutor improperly expressed his personal opinion in commenting upon Field's role in the conspiracy and suggested to the jury that there was evidence other than that produced at trial that proved Field's guilt. Second, Field argues that the prosecutor improperly suggested to the jurors that they had a personal stake in the outcome of the case.\n\nOur central inquiry in reviewing a claim of misconduct in connection with a prosecutor's closing argument is whether the challenged remarks were improper and whether they prejudicially affected substantial rights of the defendant. United States v. Dorr, 636 F.2d 117, 120 (5th Cir. 1981); United States v. Garza, 608 F.2d 659, 663 (5th Cir. 1979); United States v. Corona, 551 F.2d 1386, 1388 (5th Cir. 1977). Employing this standard, we find neither of Field's claims to be persuasive.\n\nThe first prong of Field's argument focuses upon the prosecutor's statements made in the course of his rebuttal argument that Field was the \"elusive\" \"number one man\" who was sharing in the \"pot\" comprised of illegal payoff money. (98:226-227, 231-232). Counsel for Field objected to those statements on the ground that they were not supported by any evidence in the case. The trial court sustained the objection, agreeing that there was no direct evidence to support the prosecutor's assertions. The court found, however, that the prosecutor's characterizations of Field's role in the conspiracy were reasonable inferences that could be drawn from the evidence and directed the prosecutor to adjust his line of argument accordingly. The prosecutor obeyed the court's instructions and argued to the jury that:\n\nalthough there is no direct evidence -- and we would submit that given the way this enterprise operated, there wouldn't be -- although there was no direct evidence, it is reasonably inferable from the facts, from the testimony, the direct acts of Mr. Field, the statements of co-conspirators during the furtherance and during the course of the conspiracy, that Mr. Field was, in fact, the man or one of the men that was sharing in the pot.\n\n(98:236).\n\nContrary to Field's claims, at no point did the prosecutor offer his own opinion in an attempt to vouch for the government's case. That, of course, would be improper. United States v. Corona, supra, 551 F.2d at 1389; United States v. Herrera, 531 F.2d 788, 790 (5th Cir. 1976); Gradsky v. United States, 373 F.2d 706, 710 (5th Cir. 1967). Similarly, the prosecutor's statements cannot be characterized as a suggestion that he possessed evidence other than that produced at trial that proved Field's complicity. That, too, would be improper. Berger v. United States, 295 U.S. 78, 85, 55 S. Ct. 629, 632, 79 L. Ed. 1314 (1935); United States v. Morris, 568 F.2d 396, 401 (5th Cir. 1978); United States v. Corona, supra, 551 F.2d at 1390.\n\nWe believe the remarks made by the prosecutor constituted a fair and permissible effort to argue the reasonable inferences that could be drawn from the evidence in the case. The evidence against Field has been discussed in detail and it is unnecessary to recount it at length here. Suffice it to say that the evidence was clearly sufficient for the jury to reasonably infer that Field shared in the proceeds of the payoff scheme. The evidence also supported the inference that Field was the \"number one man\" in the criminal enterprise. For example, when Teitlebaum agreed to surrender the Mamenic account to acquire the Zim account, Boyle said he would report the decision to Field. Similarly, when Boyle was pressing Teitlebaum to catch up on his delinquent payments, he told Teitlebaum that he was going to meet with Field in Savannah and wanted \"everyone to know we were up to date.\" In late 1976, Boyle told Teitlebaum that Field was unhappy with him for refusing to cooperate with his competitors, who were also making payoffs to the union officials. Finally, it was Field who first organized the Miami checkers' union that employed Boyle, Barone and Vanderwyde.\n\nBecause there was some evidence supporting the inference that Field was one of the principal figures in the enterprise, the comments of the prosecutor were not patently improper. In this respect, the instant case is similar to United States v. Allen, 588 F.2d 1100 (5th Cir. 1979). In Allen, the prosecutor remarked in his closing argument that defendant Perkins had succeeded a man named Pace as the head of a lottery operation. On appeal, Perkins argued that the prosecutor's comments were improper because there was no direct evidence tending to show that Perkins succeeded to Pace's position as operator of the lottery. The court of appeals rejected the argument on the ground that \"an attorney is entitled to urge the conclusions which the attorney thinks the jury should draw from the evidence.\" 588 F.2d at 1108. Because there was some evidence to support the inference that Perkins had in fact succeeded Pace, the court found the prosecutor's comments to that effect to be justified, concluding that:\n\neach attempt to draw an inference such as this should not be the basis of an objection by defense counsel, much less lead to a mistrial.\n\nEven if the inference which the prosecution sought to draw here was beyond the reach of the evidence in this case, it was not substantially prejudicial as to require a mistrial.\n\n588 F.2d at 1108; see United States v. Rodgers, supra, 624 F.2d at 1311. Like the prosecutor in Allen, the prosecutor below was entitled to argue all reasonable inferences drawn from the evidence to the jury, including the inference that Field was one of the principal participants who shared in the proceeds of the enterprise.\n\nThe second portion of Field's claim relating to the prosecutor's closing argument arises from the following comments made at the end of the prosecutor's rebuttal argument:\n\nYou ladies and gentlemen, representing the citizens of this community and the citizens of Southeastern United States by your verdict telling them that enough is enough. We ask you by your verdict, ladies and gentlemen, to help clean up Dodge Island. We ask you by your verdict to help rid the ports of Jacksonville, Savannah and Charleston of people who by participating, directly and indirectly, in racketeering activity are corrupting our nation's ports, who by misusing and utilizing their position of fiduciary responsibility on behalf of unions and on behalf of different companies are influencing and controlling and affecting the lives of people and everyone that works in these different cities.\n\nBy your verdict, ladies and gentlemen, we ask you to tell them enough is enough.\n\n(98:237-238). Field moved for a mistrial on the ground that these comments suggested to the jurors that they had a personal stake in the outcome of the case, but the motion was denied.\n\nThe challenged remarks, while approaching the line demarcating permissible oratorical flourish from impermissible comment calculated to incite the jury against the accused, did not constitute a direct suggestion that the jury had a personal stake in the outcome of the case. Appeals to the jury to act as the conscience of the community, unless designed to inflame the jury, are not per se impermissible. United States v. Lewis, 547 F.2d 1030, 1037 (8th Cir. 1976), cert. denied, 429 U.S. 1111, 97 S. Ct. 1149, 51 L. Ed. 2d 566 (1977); see United States v. Alloway, 397 F.2d 105, 113 (6th Cir. 1968). Even assuming, however, that the statements were improper, they were not so offensive as to prejudice any substantial rights of Field or the other appellants.\n\nH. FORFEITURE\n\nAppellants Morales and Raymond Kopituk contest the forfeiture of their interest in Florida Welding Services Corp., but it is clear that their claim is not properly before this Court. In accordance with the decision of Morales and Kopituk to waive trial by jury as to the forfeiture issues in the case, separate forfeiture proceedings commenced before the district judge following return of the jury's verdicts.\n\nOn January 11, 1980, the district court denied appellants' post-trial motions and entered separate Judgment \u0026 Commitment Orders with respect to each appellant, including Morales and Kopituk. On January 14, 1980, Morales and Kopituk filed their respective Notices of Appeal from the Judgment \u0026 Commitment Orders and order denying their post-trial motions.\n\nOn April 7, 1981, the district court entered its final judgment pertaining to the forfeiture of Morales' and Kopituk's interests in Florida Welding Services Corp. No appeal from that order was ever taken. Indeed, that order is not even part of the record on appeal. Morales and Kopituk bore the responsibility to include in the record on appeal all material upon which they intended to rely. United States v. Gerald, 624 F.2d 1291, 1296 n.1 (5th Cir. 1980), cert. denied, 450 U.S. 920, 101 S. Ct. 1369, 67 L. Ed. 2d 348 (1981). This would necessarily include all orders of court which they contend are in error.\n\nThe forfeiture judgment entered in this cause was separate and distinct from the Judgment \u0026 Commitment Orders, arising as it did from a separate proceeding. Consequently, Morales and Kopituk were required to file a separate notice of appeal from the forfeiture judgment. Because they failed to do so, we are unable to consider the merits of that judgment.\n\nConclusion\n\nThe trial below was a long and arduous affair, fraught with the difficulties one would expect from a seven month proceeding involving numerous defendants and offenses. Much credit is due to the trial judge who continually exhibited thoughtful, evenhanded judgment in resolving the dilemmas, both legal and otherwise, that arose on a daily basis. While the proceedings were not error-free, we believe that, overall, all parties received a fair and just trial. Accordingly, the convictions of William Boyle, George Barone, James Vanderwyde, Fred R. Field, Jr., Landon Williams, Cleveland Turner, Oscar Morales, Raymond Kopituk and Dorothy Kopituk are hereby AFFIRMED.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Hororable Charles R. Scott, U.S. District Judge for the Middle District of Florida, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The trial commenced on January 28, 1979, and continued to September 1, 1979.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Twenty-two persons were charged in the indictment. Eight defendants (Robert Bateman, Alvin P. Chester, Jeremy Chester, Francesca Cotrone, Joseph Cotrone, Laura Cotrone, Sebastian \"Benny\" Cotrone and Vincent James Fiore, Jr.) entered guilty pleas prior to trial. Three defendants (Neal L. Harrington, Max Forman and Cornelius \"Butch\" Vanderwyde) were severed. Defendant Elizah Jackson was acquitted and the jury was unable to reach a verdict with respect to defendant Isom Clemon. All of the nine defendants against whom guilty verdicts were returned have joined in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Because six of the nine appellants (Dorothy Kopituk, Raymond Kopituk, Oscar Morales, Fred Field, James Vanderwyde and Landon Williams) challenge the sufficiency of the evidence supporting their convictions, it is necessary to review the evidence, particularly as it relates to those appellants, in some detail.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. \"Stevedoring\" is the process of loading and unloading ships.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. References to the trial transcript will be cited as \"( : ),\" the first number representing the volume of the transcript and the second number representing the particular page cited to.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. \"Checkers\" are persons employed by stevedoring companies who monitor or \"check\" cargo as it is loaded or unloaded from a ship.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Teitlebaum was not permitted to discuss the content of the telephone conversations inasmuch as the statements made by the callers constituted hearsay not subject to any exception enumerated in Fed.R.Evid. 803, 804.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Teitlebaum assumed full control of Eagle, Inc. in 1972.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The charges stemmed from Teitlebaum's attempt to arrange a contract killing of a business associate in South America. As part of the arrangement, Teitlebaum specified that the murder was to be committed with an ice pick. (26:213, 220, 228).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Cornelius \"Butch\" Vanderwyde is the son of appellant James Vanderwyde.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. For purposes of convenience, we will usually refer to Raymond Kopituk simply as \"Kopituk\" and to appellant Dorothy Kopituk either by her full name, as \"D. Kopituk,\" or as \"Mrs. Kopituk.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In an in camera proceeding, the psychiatrist told the court and counsel that \"the sooner . . . . [the ill juror] is removed from the situation the better. As I said, I don't believe that she is capable of functioning as a juror, so it would also be in terms of the best interests of the legal process.\" Vol. 3, Supp. Record on Appeal, at 9. The psychiatrist testified that she was experiencing \"a manic episode, with marked grandiosity, marked religiousity, and is by every definition psychotic.\" Id. at 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Throughout the period that the court and counsel were wrestling with the problem of the disabled juror, the other 11 regular jurors were kept sequestered in their hotel, having been ordered not to discuss the case further until the matter was resolved. (105:3). All of their notes, verdict sheets and the indictment were collected by the deputy marshal and placed under seal. (105:30-31; 106:63-64).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The following excerpt demonstrates the extraordinary extent to which the trial court stressed, even belabored, this point at the commencement of the instructions: As you will recall, yesterday I asked you whether you would be able to start your deliberations anew and put out of your mind all deliberations you have engaged in since August 11. I want to remind you now that each of you stated you could do so, and I now instruct you that you must do so. You must each put out of your minds all the deliberations that you have engaged in thus far. You must consider the evidence in this case anew just as you did when you first retired to deliberate this case. You must each determine to start anew your consideration of each count and each defendant. You must not let anything that has happened in the course of the period you have spent in deliberation in any way affect the course of your new deliberation. You are to start fresh as if the past days have simply not happened. Each of you must keep in mind your pledge that you can begin your deliberations with a completely open mind. On each shoe [sic] you must decide and you must abide by that pledge throughout your deliberations. In order to help you start fresh in your thinking about this case, I am going to reinstruct you on the law, just as I instructed you on August 11. I want each of you, as you listen to the instructions, to consider only the evidence you have heard at this trial and not in any way consider the deliberations you have engaged in during the past twelve days or any conclusions, tentative or final, that any of you may have reached in the course of your deliberations. The reason for this requirement is that the law grants to the prosecution and to each defendant the right to a unanimous verdict, reached only after full participation of the twelve jurors who ultimately return verdicts. That right can only be assured if the twelve of you who now make up this jury begin today as if no prior deliberations had ever occurred. The verdict of the jury cannot be unanimous unless each and every one of you reaches the decision through deliberations which are the common experience of all of you. Each member of your group must have the benefit of the opinions and deliberations of the other eleven, and each of you must heed the personal reactions and interreactions of your fellow jurors, including your new member. I emphasize this point because it is essential under the law that you deliberate together, among yourselves and without regard to what may have occurred earlier. Although this requirement that you start deliberations anew may impose and undoubtedly does impose some hardship upon you in terms of the time spent re-reviewing the evidence of the trial, I am confident that each one of you will follow this necessary procedure. I want to thank you for and commend you for your patience and your understanding. We have been in trial many months. The unfortunate events of this past week are the fault of no one, as I am sure you all understand. It is to solve that problem that we are proceeding the way that we are presently proceeding. I was certainly, as I am sure all counsel were, impressed with your willingness to do that which you have agreed to do under these difficult circumstances and, that is, to begin your deliberations anew. (107:36-39).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Phillips decision was entered after the briefs had been submitted in the case at bar, but prior to oral argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In Lamb, contrary to the instant case, the circumstances indicated a strong likelihood that the 11 original jurors coerced the substituted alternate juror into voting to convict. Prior to substitution of the alternate, the original jury had returned a guilty verdict after deliberating for four hours. The trial judge refused to accept the verdict, believing that it was reached in a manner contrary to his instructions. He declared a luncheon recess, after which one of the jurors requested to be excused, stating that she was \"emotionally unable to come to a decision.\" The judge excused the regular juror and substituted an alternate juror, instructing the jury that they had to begin their deliberations anew. Nevertheless, despite the court's instructions, the reconstituted jury returned a guilty verdict only 29 minutes after it retired to deliberate. 529 F.2d at 1155.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. While there was a gap of 12 days between the day the jury first began deliberating and the day the alternate juror was actually seated as a regular juror, a review of the events that transpired shows that actual deliberations occupied less than five of those days. The jury retired to deliberate at 1:00 P.M. on Saturday, August 11, and was excused two-and one-half hours later. Since they had to elect a foreperson and did not even receive the evidentiary exhibits until the following week, it is unlikely that any serious deliberation occurred on that first day. Deliberations were resumed on Monday, August 13, and continued until Friday afternoon, August 17, when deliberations were suspended following receipt of the first note concerning the mentally ill juror. Although deliberations purportedly resumed on Monday, August 20, at 9:00 A.M., it was only 9:45 when the court received the second note from the foreperson suggesting that the ill juror needed professional help. Shortly thereafter, the court received a third note stating that jury deliberations could proceed no further until some action was taken with respect to the ill juror. The following morning the court expressly instructed the jury to cease all further deliberations until the problem of the disabled juror was resolved. Thus, although there was a 12-day period between the day the jury first retired to deliberate and the day the alternate juror was substituted, it appears that actual deliberations occurred only from Monday, August 20, through Friday, August 24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. As the government points out in its brief, since the trial court expressly \"discharged\" the alternate jurors, it could be argued that Rule 24(c) was not even violated. The rule simply states that the alternate \"shall be discharged after the jury retires to consider its verdict.\" It says nothing about whether the alternate jurors can be recalled. While the government attorneys deserve credit for their ingenuity, we reject this argument and assume that Rule 24(c) was violated when the alternate juror was recalled.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Rule 8 reads as follows: (a) Joinder of Offenses. Two or more offenses may be charged in the same indictment or information in a separate count for each offense if the offenses charged, whether felonies or misdemeanors or both, are of the same or similar character or are based on the same act or transaction or on two or more acts or transactions connected together or constituting parts of a common scheme or plan. (b) Joinder of Defendants. Two or more defendants may be charged in the same indictment or information if they are alleged to have participated in the same act or transaction or in the same series of acts of transactions constituting an offense or offenses. Such defendants may be charged in one or more counts together or separately and all of the defendants need not be charged in each count.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In United States v. Marionneaux, supra, it was held that, because there has been some misapplication of subsection (a) to cases involving multiple defendants, improper reliance upon that subsection, rather than subsection (b), is not fatal to a defendant's cause on appeal. 514 F.2d at 1249.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The panel in Diaz-Munoz relied upon subsection (a) of Rule 8 in analyzing the severance question regarding the propriety of joining counts charging tax offenses with counts charging non-tax offenses, even though that case involved multiple defendants. Given the well established precedent in the Fifth Circuit, as well as in other circuits, that subsection (a) has no application to cases involving more than one defendant, see authority cited in text supra, we can only conclude that the panel's reliance upon that subsection resulted from an oversight, rather than from an intentional action to reformulate the rules governing the applicability of the provisions of Rule 8. Of course, adherence to a subsection (b), rather than a subsection (a), analysis in Diaz-Munoz would in no way have affected the result in that case, since the critical term distinguishing the two subsections (\"of the same or similar character\") was not at issue therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Appellant Vanderwyde cites United States v. Levine, 546 F.2d 658 (5th Cir. 1977), for the principle that there must be a determination, absent the conspiracy count, as to whether joinder is proper under Rule 8(b), but the case does not even remotely embrace such a principle. In Levine, joinder of certain offenses and defendants was found to be improper because the offenses were actually part of two separate and distinct conspiracies. 546 F.2d at 665-666. The court simply held that there was an insufficient identity of facts or participants involved in the two conspiracies to constitute a \"series\" of acts under Rule 8(b). 546 F.2d at 666.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Since Rule 8 was designed to facilitate trial convenience and efficiency by avoiding duplicative proceedings, see 8 J. Moore, Moore's Federal Practice para. 8.02[1] (2d ed. 1981), it is noteworthy that proof of the overall conspiracy and criminal enterprise comprised a substantial portion of the proof necessary to prosecute the tax offenses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Rule 14 reads in pertinent part as follows: If it appears that a defendant or the government is prejudiced by a joinder of offenses or of defendants in an indictment or information or by such joinder for trial together, the court may order an election or separate trials of counts, grant a severance of defendants or provide whatever other relief justice requires.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. It is unlikely that these two statements, made at the opening of trial, played any part in the jury's verdicts returned more than seven months later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Williams raises this claim, but does not argue it in any detail.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As a tangential argument to the complexity claim, appellants Morales and the Kopituks contend they were denied a fair trial by the fact that only a small portion of the testimony presented at trial related to them. In United States v. Morrow, supra, the court rejected a similar challenge based upon the quantum of evidence presented against particular defendants therein, concluding that, \"needless to say, more is required to overturn on appeal the district court's exercise of discretion in denying a motion for severance.\" 537 F.2d at 137.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Rule 21(b) provides in full as follows: (b) Transfer in Other Cases. For the convenience of parties and witnesses, and in the interest of justice, the court upon motion of the defendant may transfer the proceeding as to him or any one or more of the counts thereof to another district.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The fact that Williams' motion was filed only three weeks prior to trial was a sufficient reason in and of itself justifying its denial. Fed.R.Crim.P. 22 provides that \"[a] motion to transfer under these rules may be made at or before arraignment or at such time as the court or these rules may prescribe.\" Williams was arraigned on June 15, 1978, seven months prior to the filing of his Rule 21 motion. In Cagnina v. United States, 223 F.2d 149 (5th Cir. 1955), the fact that a defendant's motion for transfer was filed \"many weeks\" after arraignment and just one week prior to trial was held to be an adequate ground for denying the motion. 223 F.2d at 154.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Williams does not contend on appeal, although he apparently did so in the lower court, that venue was improperly laid in the Southern District of Florida. Venue in a conspiracy case is proper in any judicial district in which the conspiratorial agreement was formed or in any district where an overt act was committed in furtherance of the conspiracy. Hyde v. United States, 225 U.S. 347, 363, 32 S. Ct. 793, 800, 56 L.Ed 1114 (1912); United States v. Williams, 424 F.2d 344, 352 (5th Cir. 1970); Bellard v. United States, 356 F.2d 437, 438 (5th Cir.), cert. denied, 385 U.S. 856, 87 S. Ct. 103, 17 L. Ed. 2d 83 (1966); Miller v. Connally, 354 F.2d 206, 208 (5th Cir. 1965). Clearly, the bulk of the overt acts charged in the indictment occurred in Miami. Similarly, it appears clear that the underlying agreement was formulated in Miami.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. At one point Williams' attorney told the court that representing Williams in Miami was a \"first class problem,\" and that he was not sure his Jacksonville law practice could endure the strain. (37:148-149). Accordingly, he requested that attorneys in the case not be required to be present unless \"we absolutely know that there is something coming in against our client.\" (37:149). It is clear, therefore, that the absences of Williams' attorney were attributable as much to his own \"hardship\" concerns as to those of his client. Williams, of course, had the option of retaining a Miami-based attorney from the beginning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Title 29 U.S.C. § 186(b) (1) makes it unlawful for any union officer \"to request, demand, receive, or accept, or agree to receive or accept, any payment, loan, or delivery of any money or other thing of value . . . .\" from any employer, with certain exceptions not applicable herein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. There is no question that the statements admitted against Field were made by members of the conspiracy during the course of the conspiracy and in furtherance thereof.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Field argues that evidence of the 1966 solicitation incident should not have been considered in ruling upon the admissibility of co-conspirator declarations against him and should not have been admitted into evidence for the jury to consider in determining Field's guilt or innocence because the incident occurred at a time too remote from later acts charged in the indictment. Field relies upon United States v. Solis, 612 F.2d 930 (5th Cir. 1980), to support this contention, but that case is inapposite. In Solis, it was held that evidence concerning the defendant's prior crimes \"did not, without more, supply substantive proof\" of his participation in a later, unrelated conspiracy. 612 F.2d at 934. In the instant case, evidence of the 1966 solicitation was not admitted to show participation in a later, unrelated conspiracy. To the contrary, the 1966 incident was charged as part of the conspiracy for which Field was on trial (the first three overt acts of the conspiracy count [Count 1] relate to the 1966 solicitation from Teitlebaum).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Contrary to Field's assertion that the entire conversation between Teitlebaum and Zonis was spoken in Yiddish, Zonis testified that Teitlebaum spoke only \"a couple of words\" in Yiddish. (33:254).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Vanderwyde was convicted of five separate Taft-Hartley charges, but contends that violations of Section 186(b) of the Taft-Hartley Act do not constitute the requisite racketeering acts under the RICO statute. He relies upon the definition of \"racketeering activity\" found in 18 U.S.C. § 1961(1) (C), which provides: (1) \"Racketeering activity\" means . . . . (C) any act which is indictable under title 29, United States Code, section 186 (dealing with restrictions on payments and loans to labor organizations) . . . . Vanderwyde argues that the Taft-Hartley charges against him did not involve \"restrictions on payments and loans to labor organizations\" and, hence, were not within the purview of the definition of racketeering activity. We agree with the government's contention, however, that the parenthetical language following the reference to Section 186 was included as a means to facilitate identification of 29 U.S.C. § 186 and was not intended to limit the definition of racketeering activity only to Taft-Hartley charges involving \"restrictions on payments and loans to labor organizations.\" A similar argument was rejected by the Second Circuit Court of Appeals in United States v. Scotto, 641 F.2d 47, 56-57 (2d Cir. 1980), cert. denied, 452 U.S. 961, 101 S. Ct. 3109, 69 L. Ed. 2d 971 (1981), wherein it was held that violations of 29 U.S.C. § 186(b), which is the subsection of the Taft-Hartley Act within which Vanderwyde's offenses fell, constitute predicate acts of racketeering activity under 18 U.S.C. § 1961(1) (C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. There is, of course, also a requirement that the extortion affect or obstruct interstate commerce but that element is not in contention here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. As noted in the facts section of this opinion, supra, Williams apparently acquired the tickets on behalf of the mayor of Jacksonville, who gave them to his son as a wedding present.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Morales and Kopituk apparently contend that the evidence was insufficient to prove the existence of an \"enterprise,\" an essential element of the RICO substantive offense charged herein. This contention is wholly without merit. The RICO statute defines \"enterprise\" as \"any individual, partnership, corporation, association, or other legal entity, and any union or group of individuals associated in fact although not a legal entity . . . .\" 18 U.S.C. § 1961(4). Count 2 of the indictment charged that the appellants and others \"associated with an enterprise . . . . to corruptly control and influence the waterfront industry of various ports in the United States . . . . through a pattern of racketeering activity.\" The evidence adduced at trial overwhelmingly established the existence of an extensive, well-defined criminal enterprise dedicated to achieving economic control of several major ports in the Southeastern United States. In United States v. Turkette, 452 U.S. 576, 101 S. Ct. 2524, 69 L. Ed. 2d 246 (1981), the Supreme Court observed that \"there is no restriction upon the associations embraced by the definition [of enterprise]: an enterprise includes any union or group of individuals associated in fact.\" 452 U.S. at 580, 101 S. Ct. at 2527, 69 L. Ed. 2d at 253. Without question, the enterprise charged in the indictment, the existence of which was proved at trial, fell within the broad definition of enterprise encompassed by the RICO Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Not only did FWS receive lucrative waterfront business as a direct result of their illegal payoffs, they were even able to recoup a substantial portion of the payoff money itself. Wagner testified that he prepared inflated invoices on behalf of FWS that were paid by MTI in order to allow Morales and Kopituk to offset their initial payoffs to the union. (43:124, 138, 151-152). This fact further diminishes the claim of Morales and Kopituk that no business would want \"to promote and be a part of an organization that required these payments in exchange for the opportunity to run a legitimate business.\" Brief for Appellants Morales, R. Kopituk and D. Kopituk at 54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Appellant Turner also raises this issue, claiming that all of Field's co-defendants were prejudiced by the admission of Field's prior conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. As a threshold matter, the trial court must determine whether the government has produced sufficient evidence to support a finding that the defendant did in fact commit the extrinsic offense. United States v. Beechum, supra, 582 F.2d at 913. Since Field was convicted of the extrinsic offense at issue herein, this matter was never at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The Roberts court noted that a defendant can withdraw the issue of intent from a case by denying participation in the acts charged, but stipulate that those acts prove intent if it is in fact shown that he committed the acts. 619 F.2d at 383 n.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Of course, even under Roberts, the government must always establish, as a predicate to admissibility of the extrinsic offense evidence, that the defendant committed the extrinsic offense and that the extrinsic offense was perpetrated with the same state of mind as the charged offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The evidence of Field's prior conviction was limited to admission of a copy of the Judgment \u0026 Commitment Order entered in the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Appellant Vanderwyde argues that the \"ice pick\" evidence was necessary to dispel the jurors' impression that Teitlebaum was an innocent, gentle man who was intimidated into participating in the criminal enterprise. A reading of the transcript of Teitlebaum's testimony, however, does not convey any such impression, for his testimony clearly established his own complicity in the criminal enterprise. Moreover, while the jury may not have been apprised of the method of killing, they were well aware that Teitlebaum sought to hire someone to murder a business associate. Surely that was sufficient to dissipate any notion that he was a gentle, timid person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. It appears clear from perusal of the record that the government's failure to furnish appellants with copies of Acosta's grand jury testimony at an earlier date was indeed inadvertant. Following a recital by one of the defense attorneys of his version of how the events transpired, the following exchange occurred: THE COURT: I don't think that is quite how it happened. It developed yesterday morning when Mr. Evans [co-counsel for the government] was looking over somebody's shoulder at what he had, and he said, 'You don't have, apparently, something that I do have,' and Mr. Rosen [counsel for appellant Barone] joined in and said, 'Well, I don't have it, either,' and then he produced this other grand jury testimony. Now, I do remember that correctly or incorrectly? MR. MASIN [Counsel for appellant Boyle]: I don't recall it like that. MR. EVANS: That is how I recall it. Your Honor. I went to look and see what Mr. Martinez [co-counsel for appellants R. Kopituk, D. Kopituk and Morales] had marked because I was attempting to figure out some sort of stipulation as to whether Acosta had said something or not in an interview or prior grand jury testimony. THE COURT: That is my recollection of how it developed, and then at one point he produced and Mr. Rosen immediately began to review grand jury testimony, after which he had it copied and distributed to all parties. I don't think anybody was testifying at the time. (51:114-115). It appears, therefore, that no prosecutorial misconduct was involved in the delayed delivery of Acosta's grand jury transcript. One must remember that the transcript at issue pertained to only one of Acosta's many grand jury appearances. A finding of inadvertant error would not impact upon a valid Brady claim because the Supreme Court expressly held in Brady that nondisclosure of exculpatory material violates due process \"irrespective of the good faith or bad faith of the prosecution.\" 373 U.S. at 87, 83 S. Ct. at 1196. In the instant case, however, it is probable that the government's delivery of Acosta's grand jury transcript, while untimely as compared with the government's practice to furnish such materials well in advance of the witness' appearance at trial, did not constitute a violation of the Brady doctrine. The Jencks Act, 18 U.S.C. § 3500, provides that in any criminal prosecution brought by the United States, no statement or report of a government witness need be produced to a defendant until after completion of the witness' direct testimony at trial. 18 U.S.C. § 3500(a). While a transcription of a witness' grand jury testimony is included within the definition of \"statement\" in 18 U.S.C. § 3500(e) (3), courts have uniformly adhered to the strictures of Section 3500(a) in holding that disclosure of a witness' grand jury testimony need not be made until after the witness has testified on direct examination. See United States v. Rivero, 532 F.2d 450, 461 (5th Cir. 1976); United States v. Pelton, 578 F.2d 701, 709 (8th Cir.), cert. denied, 439 U.S. 964, 99 S. Ct. 451, 58 L. Ed. 422 (1978); United States v. Wilkinson, 513 F.2d 227, 232 (7th Cir. 1975). The government produced the grand jury transcript at issue herein after Acosta testified and before any of the appellants had cross-examined him. Thus, with respect to appellants, there was no violation of the Jencks Act. It has been held that \"when alleged Brady material is contained in Jencks Act material, disclosure is generally timely if the government complies with the Jencks Act.\" United States v. Martino, supra, 648 F.2d at 384, quoting United States v. Anderson, 574 F.2d 1347, 1352 (5th Cir. 1978). Consequently, in light of the foregoing, it appears that the alleged Brady violation concerning the transcript of Acosta's grand jury testimony was not only inadvertant, but in all likelihood nonexistent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The impact of the discrepancy between the testimony of Acosta and that of Medina regarding this discussion was not as great as appellants contend, for as the government notes in its brief, Medina had previously testified that Barone did in fact threaten Acosta's life, albeit in a different context. Medina stated that Barone once visited his office and complained about the fact that Acosta was using Barone's name to procure business on the waterfront. According to Medina's testimony, Barone told him that if Acosta continued to do so, \"he . . . . [was] the one that . . . . [was] going to be missing.\" (48:79).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The following exchange is indicative of this observation: THE COURT: Well, back to my point, is the reason you classify it as Brady material and claim that it should have been provided you early is so you could have prepared and, more specifically, to examine Mr. Medina on the question of whether or not, in fact, a meeting which you knew was going to be testified about ever took place, and you could have covered him in advance? MR. LEIB [Counsel for Morales, R. Kopituk, D. Kopituk]: Yes, sir. (51:118).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. To be of sufficient materiality to mandate reversal of a conviction the omitted evidence must create a reasonable doubt that otherwise would not exist. United States v. Agurs, supra, 427 U.S. at 112, 96 S. Ct. at 2401.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Issues raised by appellants, but not expressly dealt with in this opinion, have been considered and rejected as not worthy of discussion.\u003c/span\u003e\n\n",
    "body_length": 208823,
    "citedas": [
      "690 F.2d 1289"
    ],
    "attorneys": "Atlee W. Wampler, III, U.S. Attorney, Miami, Florida, William Hyatt, Special Attorney, U.S. Dept. of Justice, Miami, Florida, S. Michael Levin, Miami, Florida, William C. Bryson, Attorney, Dept. of Justice, Washington, District of Columbia, for Appellee. Leib and Martinez, Coral Gables, Florida, Karl J. Leib, Jr., Coral Gables, Florida, for Kopituks \u0026 Morales. Kogen \u0026 Kogan, Miami, Florida, Geoffrey C. Fleck, Miami, Florida, Loren H. Cohen, Miami, Florida, for Field. Flynn, Rubio \u0026 Tarkoff, Miami, Florida, Michael H. Tarkoff, Miami, Florida, for Turner. Varon \u0026 Stahl, Hollywood, Florida, Joseph A. Varon, Hollywood, Florida, for Vanderwyde. Mahon, Mahon \u0026 Farley, Jacksonville, Florida, Lacy Mahon, Jr., Jacksonville, Florida, for Williams. Michael A. Masin, Miami, Florida, Richard M. Gale, Miami, Florida, for Boyle. Rosen \u0026 Rosen, Miami, Florida, E. David Rosen, Miami, Florida, for Barone.",
    "category": [
      "75"
    ],
    "judges": "Hill and Clark, Circuit Judges, and Scott,*fn* District Judge.",
    "citation_count": 218
  }
}
