{
  "id": "gYHzPWYBTlTomsSBUHJ7",
  "document": {
    "title": "In re Lower Lake Erie Iron Ore Antitrust Litigation",
    "full_title": "IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; WILLS TRUCKING, INC.; CONSOLIDATED DOCK AND STORAGE, INC.; TOLEDO WORLD TERMINAL, INC. v. BALTIMORE \u0026 OHIO RAILROAD COMPANY, INC.; BESSEMER \u0026 LAKE ERIE RAILROAD, INC.; CHESAPEAKE \u0026 OHIO RAILWAY COMPANY, INC.; CSX CORPORATION; CONSOLIDATED RAIL CORPORATION; NORFOLK \u0026 WESTERN RAILWAY COMPANY, INC.; PITTSBURGH \u0026 LAKE ERIE RAILROAD COMPANY WILLS TRUCKING, INC. AND TOLEDO WORLD TERMINAL, INC. IN 91-1526; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1586; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; WILLS TRUCKING, INC.; CONSOLIDATED DOCK AND STORAGE, INC.; TOLEDO WORLD TERMINAL, INC. V. BALTIMORE \u0026 OHIO RAILROAD COMPANY, INC.; BESSEMER \u0026 LAKE ERIE RAILROAD, INC.; CHESAPEAKE \u0026 OHIO RAILWAY COMPANY, INC.; CSX CORPORATION; CONSOLIDATED RAIL CORPORATION; NORFOLK \u0026 WESTERN RAILWAY COMPANY, INC.; PITTSBURGH \u0026 LAKE ERIE RAILROAD COMPANY BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1587; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; C.D. AMBROSIA TRUCKING CO., INC. V. CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; BALTIMORE AND OHIO RAILROAD COMPANY, INC.; CSX CORPORATION, INC.; NORFOLK \u0026 WESTERN RAILWAY COMPANY, INC.; BESSEMER AND LAKE ERIE RAILROAD COMPANY, INC.; CONSOLIDATED RAIL CORPORATION; THE PENN CENTRAL CORPORATION, INC., BESSEMER AND LAKE ERIE RAILROAD COMPANY,APPELLANT IN 91-1588; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; REPUBLIC STEEL CORPORATION V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; CONSOLIDATED RAIL CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; NORFOLK \u0026 WESTERN RAILWAY COMPANY; AND THE PITTSBURGH \u0026 LAKE ERIE RAILROAD COMPANY, BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1589; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; NATIONAL STEEL CORPORATION V. PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; CONSOLIDATED RAIL CORPORATION, BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1590; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; JONES \u0026 LAUGHLIN STEEL INCORPORATED V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; NORFOLK \u0026 WESTERN RAILWAY COMPANY; NORFOLK \u0026 SOUTHERN CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; CONSOLIDATED RAIL CORPORATION, BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1591; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; WHEELING-PITTSBURGH STEEL CORPORATION V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; NORFOLK \u0026 WESTERN RAILWAY COMPANY; NORFOLK \u0026 SOUTHERN CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; CONSOLIDATED RAIL CORPORATION, BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1592; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; TAURO BROTHERS TRUCKING CO. V. BALTIMORE AND OHIO RAILROAD COMPANY, INC.; BESSEMER AND LAKE ERIE RAILROAD, INC.; CHESAPEAKE \u0026 OHIO RAILWAY COMPANY, INC.; CONSOLIDATED RAIL CORPORATION; AND NORFOLK AND WESTERN RAILWAY COMPANY, INC. V. PITTSBURGH \u0026 LAKE ERIE RAILROAD CO., BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1593; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; SHARON STEEL CORPORATION V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD; CONSOLIDATED RAIL CORPORATION, BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1594; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; ERIE WESTERN PENNSYLVANIA PORT AUTHORITY; AND CODAN CORPORATION V. CHESAPEAKE \u0026 OHIO RAILWAY COMPANY, INC.; BALTIMORE AND OHIO RAILROAD COMPANY, INC.; CSX CORPORATION; NORFOLK \u0026 WESTERN RAILWAY COMPANY, INC; BESSEMER AND LAKE ERIE RAILROAD COMPANY, INC.; CONSOLIDATED RAIL CORPORATION, INC.; AND THE PENN CENTRAL CORPORATION, INC., BESSEMER AND LAKE ERIE RAILROAD COMPANY IN 91-1595; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; C.D. AMBROSIA TRUCKING CO., INC. V. CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; BALTIMORE AND OHIO RAILROAD COMPANY, INC.; CSX CORPORATION, INC.; NORFOLK \u0026 WESTERN RAILWAY COMPANY, INC.; BESSEMER AND LAKE ERIE RAILROAD COMPANY, INC.; CONSOLIDATED RAIL CORPORATION; THE PENN CENTRAL CORPORATION, INC., C.D. AMBROSIA TRUCKING COMPANY (\"AMBROSIA\") IN 91-1627; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; REPUBLIC STEEL CORPORATION, V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; CONSOLIDATED RAIL CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; NORFOLK \u0026 WESTERN RAILWAY COMPANY; AND THE PITTSBURGH \u0026 LAKE ERIE RAILROAD COMPANY, REPUBLIC STEEL CORPORATION IN 91-1628; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; NATIONAL STEEL CORPORATION V. PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; CONSOLIDATED RAIL CORPORATION, NATIONAL STEEL CORPORATION IN 91-1629; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; JONES \u0026 LAUGHLIN STEEL INCORPORATED V. THE PENN CENTRAL CORPORATION, THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; NORFOLK \u0026 WESTERN RAILWAY COMPANY; NORFOLK \u0026 SOUTHERN CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; CONSOLIDATED RAIL CORPORATION JONES \u0026 LAUGHLIN STEEL INCORPORATED IN 91-1630; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; WHEELING-PITTSBURGH STEEL CORPORATION V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; NORFORLK \u0026 WESTERN RAILWAY COMPANY; NORFOLK \u0026 SOUTHERN CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD COMPANY; CONSOLIDATED RAIL CORPORATION, WHEELING-PITTSBURGH STEEL CORPORATION IN 91-1631; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; TAURO BROTHERS TRUCKING CO. V. BALTIMORE AND OHIO RAILROAD COMPANY, INC.; BESSEMER AND LAKE ERIE RAILROAD, INC.; CHESAPEAKE \u0026 OHIO RAILWAY COMPANY, INC.; CONSOLIDATED RAIL CORPORATION; AND NORFOLK AND WESTERN RAILWAY COMPANY, INC. V. PITTSBURGH \u0026 LAKE ERIE RAILROAD CO., TAURO BROTHERS TRUCKING COMPANY IN 91-1632; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; SHARON STEEL CORPORATION V. THE PENN CENTRAL CORPORATION; THE CHESAPEAKE \u0026 OHIO RAILWAY COMPANY; THE BALTIMORE \u0026 OHIO RAILROAD COMPANY; CSX CORPORATION; BESSEMER \u0026 LAKE ERIE RAILROAD; CONSOLIDATED RAIL CORPORATION, SHARON STEEL CORPORATION IN NO. 91-1633; IN RE: LOWER LAKE ERIE IRON ORE ANTITRUST LITIGATION; ERIE WESTERN PENNSYLVANIA PORT AUTHORITY AND CODAN CORPORATION V. CHESAPEAKE \u0026 OHIO RAILWAY COMPANY, INC.; BALTIMORE AND OHIO RAILROAD COMPANY, INC.; CSX CORPORATION, INC.; NORFOLK \u0026 WESTERN RAILWAY COMPANY, INC.; CONSOLIDATED RAIL CORPORATION, INC.; AND THE PENN CENTRAL CORPORATION, INC., ERIE-WESTERN PENNSYLVANIA PORT AUTHORITY AND CODAN CORPORATION (\"ERIE\") IN 91-1634",
    "jurisdiction": "Third Circuit",
    "date": "1993-05-27T00:00:00.000Z",
    "docket": "Nos. 91-1526, 91-1586, 91-1587, 91-1588, 91-1589, 91-1590, 91-1591, 91-1592, 91-1593, 91-1594, 91-1595, 91-1627, 91-1628, 91-1629, 91-1630, 91-1631, 91-1632, 91-1633, 91-1634",
    "body": "Opinion OF THE COURT\n\nMANSMANN, Circuit Judge.\n\nIndustries involved in the transportation and manufacturing of iron ore are the adversaries in this complex multi-district antitrust litigation. Five steel companies, three dock companies and three trucking companies filed civil actions in various federal district courts, alleging that the railroad companies serving the lower Lake Erie industrial region conspired in violation of federal and state antitrust laws to preclude potential competitors from entering the market of lake transport, dock handling, storage and land transport of iron ore.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The cases were consolidated and transferred to the United States District Court for the Eastern District of Pennsylvania for pre-trial proceedings.\n\nThe eventual trial was bifurcated into liability and damages phases. The liability jury reached a verdict against Bessemer and Lake Erie Railroad Company (\"B\u0026LE\"), the sole remaining defendant, and in favor of all plaintiffs but one - David W. Reaney and Reaney Dock Co. The first jury was discharged and a new jury, empaneled for the damages phase, reached a verdict awarding all but one claim for damages. B\u0026LE's motion for judgment n.o.v. was denied in most respects. Post-trial motions lodged by the Wills plaintiffs were likewise denied.\n\nOn appeal and cross-appeal, numerous issues have been raised. In its appeal, B\u0026LE contends, as threshold arguments, that (1) the conduct complained of as violative of the antitrust laws was exempt from liability under the doctrine of Keogh v. Chicago \u0026 Northwestern Railway, 260 U.S. 156, 67 L. Ed. 183, 43 S. Ct. 47 (1922), and the statutory immunity conferred by section 5a of the Interstate Commerce Act, 49 U.S.C. § 5(b) (1970); (2) some plaintiffs lacked standing under Illinois Brick v. Illinois, 431 U.S. 720, 52 L. Ed. 2d 707, 97 S. Ct. 2061 (1977), and Associated General Contractors, Inc. v. California State Council of Carpenters, 459 U.S. 519, 74 L. Ed. 2d 723, 103 S. Ct. 897 (1983), to raise antitrust claims; and (3) the claims were time-barred by the federal statute of limitations and the doctrine of laches. B\u0026LE also argues that the proof offered at trial did not establish that its misconduct caused damage to the plaintiffs. In addition, claims B\u0026LE, the evidence of damages was too speculative to be sustained. Finally, as a post-verdict matter, B\u0026LE asserts that post-judgment interest was calculated from the wrong date.\n\nCross-appeals include the issues of whether the district court erred in disallowing the steel companies' fraudulent concealment defense to toll the running of the statute of limitations and whether there was error in the district court's refusal to award prejudgment interest under Ohio law.\n\nNational Steel cross-appealed on the ground that judgment n.o.v. was improperly granted in favor of B\u0026LE with respect to National Steel's investment cost damage claim.\n\nFinally, the Wills plaintiffs claim that their Seventh Amendment right to a fair trial was violated because the district court allowed the damage phase jury to hear and evaluate liability evidence.\n\nWe will affirm, in most respects, the order of the district court. We will reverse the grant of judgment n.o.v. against National Steel and remand for entry of judgment for National Steel because the ground upon which it was based was not preserved by B\u0026LE. We will also reverse the district court's denial of Wills' post-trial motions because as to these plaintiffs, the conduct of the bifurcated trial violated the Seventh Amendment. We will, therefore, remand for a new trial limited strictly to a calculation of damages suffered by the Wills plaintiffs.\n\nI.\n\nA. Regulatory Background\n\nThe Interstate Commerce Act (\"the ICA\") governs \"any individual or joint rate . . . charged . . .\" by the railroads. 49 U.S.C. § 15(1) (1970) repealed, Pub. L. 95-473, § 4(b), (c), October 17, 1978, 92 Stat. 1466, 1470; Pub. L. 96-258, § 3(b), June 3, 1980, 94 Stat. 427.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The enforcement arm of the ICA, the Interstate Commerce Commission (\"the ICC\"), is charged with regulating the rates filed and charges levied by the railroads in a manner consistent with the purposes of the ICA. 49 U.S.C. § 15(1)(1976).\n\nUnder the ICA and directly contrary to activity forbidden in other industries, the railroads were legally permitted to engage in joint rate-making activity. However, in 1944 the inevitable tension presented by the ICC's policy of condoning concerted action and the general prohibition against industry consortia embraced in the antitrust laws prompted the Justice Department to invoke the provisions of the Sherman Act in an effort to enjoin some railroad rate-setting practices. See United States v. Association of American Railroads, 4 F.R.D. 510 (D.Neb. 1945) (denying defense motion to dismiss). In that same year, the State of Georgia alleged that an eastern railroad conspiracy in restraint of trade caused an increase in freight rates throughout its state. Georgia v. Pennsylvania Railroad Company, 324 U.S. 439, 89 L. Ed. 1051, 65 S. Ct. 716 (1945). Sitting as the court of original jurisdiction, the Supreme Court responded to the defendants' allegation that Georgia's complaint failed to state a cause of action, by holding that \"regulated industries are not per se exempt from the Sherman Act,\" 324 U.S. at 456-47, and suit was permitted to proceed.\n\nCongress responded by passing the Reed-Bullwinkle Act, ch. 491, 62 Stat. 472 (1948), (current version codified at 49 U.S.C. § 10706), authorizing the creation of rate bureaus which would provide a sanctioned forum for the railroads to set agreements on rates. In section 5a of the 1970 version of the Act, Congress expressly granted railroads antitrust immunity for any collective rate-making activity accomplished in accordance with the procedures described in the Act. 49 U.S.C. § 5(b). Unless and until \"suspended or modified or set aside by the Commission or be disapproved . . . by a court,\" these rates are lawful as between the carrier and shipper. 49 U.S.C. § 15(2).\n\nB\u0026LE was a member of the Coal, Coke and Iron Ore Committee, an ICC-approved rate bureau. Through this vehicle the defendants established the rates of concern here. At issue is whether the railroads' rate-making activity occurred within the legal framework of the ICA. The plaintiffs do not challenge the original agreement or the defendants' right collectively to set rates pursuant to the terms and conditions of the agreement. Instead the anti-competitive activity charged here allegedly arises from the collective response of the members of the rate bureau to a technological innovation in the iron ore industry.\n\nB. Factual Background\n\nGiven the jury verdict in favor of the plaintiffs, we review the evidence in a light favorable to their position.\n\nThe theory of the plaintiffs' case is that beginning approximately 25 years ago, B\u0026LE conspired with its industry partners to eliminate competition and monopolize the transportation and handling of iron ore. The iron ore originates from mines in Michigan, Minnesota and eastern Canada. It is brought to the steel companies' plants by ship transport across the Great Lakes and is unloaded at railroad-owned docks along lower Lake Michigan, Lake Erie and the Detroit River.\n\nThe traditional method of unloading ore from the vessels, known as bulkers, was by the use of huletts, large cranes affixed to the docks. The huletts lifted the ore from the bulkers and either placed it in waiting railroad cars for immediate shipment or positioned it for later movement to a storage facility. Some of the docks are located directly adjacent to steel mills, but most of the ore was reloaded at the dock onto land-based transportation, most often railroads, for delivery to the inland mills. The non-railroad docks were not competitors for this segment of the ore business because they were not equipped with huletts.\n\nA change in ore producing technology catalyzed a different method of moving iron ore across Lake Erie. In the 1950s, some iron ore producers began to \"pelletize\" their ore. As the term implies, instead of a mud-like form, the iron was formulated into pellets. This innovation made possible the transport of the ore by means of self-unloading vessels, capable of unloading cargo by means of a conveyor belt without the use of a hulett.\n\nSelf-unloaders could carry greater loads than the conventional bulkers and could unload in significantly less time at docks which did not require special handling equipment. Using self-unloaders, non-railroad docks could now compete as unloading sites for iron ore, and could receive, store and tranship ore from self-unloaders at lower cost than railroad hulett docks because they did not need land-based unloading equipment and crews. In addition, demurrage charges, the amount assessed while equipment stands idle, were reduced. The non-railroad docks, in combination with self-unloaders, were able to compete directly with the railroad-owned docks for the iron ore transport market. The plaintiffs contend that the railroads, perceiving the threat presented by the existence of the non-railroad docks and unwilling to jeopardize their substantial investment in the off-loading equipment, plotted to halt the progress of self-unloader technology to maintain the railroads' dominance in the iron ore transport market.\n\nBecause the railroads also controlled access to their docks and provided inland transportation of ore from the docks only by rail, the self-unloader/non-railroad dock system also compromised the railroads' monopoly on the inland transportation of iron ore. With self-unloaders discharging cargo at private docks, less costly trucks could haul the ore from the non-railroad docks and provide land transportation savings to the steel companies.\n\nRoused by the possibility of the demise of the railroad industry as the literal mover and shaker of the iron ore transport business, its high ranking officials convened to discuss a course of action designed to circumvent the incorporation of self-unloaders into the iron ore industry. Railroad officials orally agreed that leases of railroad docks or facilities should be examined or modified to frustrate the efforts of non-railroad docks to handle ore from self-unloaders. They also agreed to refuse to provide competitively-priced inland rail service, i.e., to publish commodity line haul rates for moving ore from such docks. Finally, it was agreed that railroad docks should assess the same handling charges for unloading ore from bulkers as from self-unloaders, regardless of the extent of service performed.\n\nThe words were converted into action. To effectuate the goal of market preclusion, the railroads used coercion to enforce adherence to the agreement to foreclose competition from private docks. B\u0026LE and its co-conspirators did indeed restrict the lease and sale of railroad-owned dock property and boycotted non-railroad docks. These activities eliminated much of the economic incentives to use self-unloaders. By impeding the progress of the private dock system, the railroads were also effective in foreclosing competition from trucks.\n\nC. The Litigation\n\nOn October 13, 1981, a federal grand jury returned an indictment charging B\u0026LE and other railroads operating docks and inland rail lines with criminal conspiracy in violation of section 1 of the Sherman Act. B \u0026LE pled nolo contendere and was convicted and fined. The conviction was affirmed on appeal. United States v. Bessemer \u0026 Lake Erie Railroad Co., 230 U.S. App. D.C. 316, 717 F.2d 593, 602 (D.C. Cir. 1983).\n\nAfter the indictment, between 1982 and 1984, the original complaints were filed in this civil action in various federal district courts. Seeking recovery under sections 1 and 2 of the Sherman Act, 15 U.S.C. §§ 1, 2, section 4 of the Clayton Act, 15 U.S.C. § 15, and the Ohio Valentine Act, Ohio Revised Code §§ 1331.01-1331.99, the plaintiffs claimed that a conspiracy existed among the defendant railroads to delay the utilization of self-unloading vessels for the transportation of iron ore. On April 17, 1984, the Judicial Panel on Multidistrict Litigation consolidated the ten cases.\n\nThe steel company plaintiffs requested damages for the savings lost to them, alleging that the railroads' anti-competitive behavior generally denied them savings that would have resulted from swifter development of self-unloader technology. Specifically, the plaintiffs identified as compensable: (1) savings resulting from lower dock handling rates from private commercial docks had the self-unloader industry been more dynamic; (2) savings from lower dock handling rates at the railroad docks had there been competition from private docks; (3) savings from lower trucking rates had their market entry not been restrained; (4) savings lost because of the railroads' failure to publish commodity line haul rates and (5) in a catchall provision, the savings it would have enjoyed had the steel companies had the option to choose the most efficient and economical combination of transportation alternatives.\n\nThe dock company plaintiffs claimed injury due to the railroads' refusal to permit them entry into the iron ore unloading business. Their damage claims thus represented the profits that their industry would have realized had they been able to break into the market. The trucking companies' claim for damages is similar. Had they not been precluded from entering the market of the land transport of ore, they would have engaged in such operations and realized significant profits.\n\nIn a series of pre-trial rulings, the district court dismissed the steel companies' claims for the damages based on the allegation that, absent the conspiracy, these plaintiffs would have paid lower rates for costs associated with the transportation of ore. The court ruled that these claims were barred by Keogh v. Chicago \u0026 Northwestern Railway, 260 U.S. 156, 67 L. Ed. 183, 43 S. Ct. 47 (1922) (antitrust liability in private action cannot be predicated on rates approved by the ICC). The district court, however, permitted to proceed to trial those damage claims that resulted from \"defendants' elimination of competitive non-railroad dock facilities.\" These claims were not considered rate-related, because they required proof that the defendants conspired to exclude low cost competitors from the market. The court determined that Keogh did not bar the damage claims of the dock and trucking companies because they were competitors, and not customers, of the railroads.\n\nIn motions to dismiss, the defendants challenged the standing of some classes of plaintiffs to pursue antitrust claims. The court dismissed the steel companies' damage claim that was based on the theory that had the conspiracy not delayed the use of self-unloading vessels, the steel companies would have paid vessel companies a lower rate for lake transportation. Applying Illinois Brick Co. v. Illinois, 431 U.S. 920 (1977), and Associated General Contractors, Inc. v. California State Council of Carpenters, 459 U.S. 519, 74 L. Ed. 2d 723, 103 S. Ct. 897 (1983), the district court concluded that claims for such lake freight savings were indirect, potentially duplicative and too speculative. The court held that because the steel companies were only potential customers of non-conspiring competitors, (the vessel companies), damages could be ascertained only by speculating when the vessel companies would have begun using self-unloaders absent a conspiracy. Assessment of damages would also require additional conjecture related to the rates the private docks would have charged to handle the self-unloaders.\n\nBecause the steel company plaintiffs had also pled that they were directly involved in the ownership and operation of self-unloaders, however, the court held that self-unloader damages could sustain a standing challenge. Similarly, the steel companies' damages resulting from the inability to use non-railroad docks were not barred because the court perceived that these damages arose from the inability to seek lower prices from competitors who were either denied participation or experienced entry delay in the relevant market due to the illegal conspiracy.\n\nOn the issue of whether application of the federal statute of limitations precluded recovery or whether the statute was tolled because the railroads fraudulently concealed the conspiracy, the district court granted B\u0026LE's motion for summary judgment against the steel company plaintiffs and Erie but denied it against Wills and the trucking company plaintiffs. The court ruled that the steel company plaintiffs and Erie knew or should have known about the conspiracy, thereby denying the fraudulent concealment defense and limiting recovery to damages sustained within four years of the commencement of this suit. The period was, however, tolled during the pendency of the related criminal case.\n\nThe consolidated trial was bifurcated into liability and damage phases. After six weeks of trial, the liability phase concluded in a jury verdict in favor of all the plaintiffs except David W. Reaney and Reaney Dock Company. The jury's findings, as set forth on special verdict forms, are summarized as follows:\n\nThe conspiracy in which B\u0026LE participated was a material cause of injury to each steel company plaintiff. Each injury resulted from foreclosure or delay in utilizing self-unloading vessels for the delivery of iron ore and from the inability to use non-railroad docks to handle iron ore.\n\nWith regard to the dock companies, the jury found, first, that Erie's injuries resulted from acts designed to prevent it from purchasing or leasing dock property at Erie, Pennsylvania, and from acts designed to foreclose competitive inland rail service from that dock. Second, the injury found that the Wills' injuries resulted from acts which precluded it from purchasing or leasing dock property at Toledo, Ohio and from trucking ore inland from that dock. The jury rejected Wills' claims that it had been injured by the railroads' refusal to sell or lease other dock property.\n\nAs to the trucking companies, the jury found that Ambrosia Trucking Company's injury resulted from acts which prevented or delayed the handling of iron ore by non-railroad docks which would have permitted the trucking of ore. The jury denied the recovery of damages on claims that B\u0026LE interfered with Ambrosia's trucking from railroad docks and from one non-railroad dock in Ashtabula, Ohio.\n\nThe jury further found that Tauro Brothers Trucking Company's injury resulted from the foreclosure or delay in the utilization of self-unloading vessels to bring iron ore to docks that granted access to truckers, as well as the inability of steel mills to use to their fullest capacity non-railroad docks to which trucks were allowed access. The jury rejected Tauro's claim that it had been injured by unlawful acts designed to prevent trucking from railroad docks.\n\nThe court discharged the liability jury and subsequently empaneled a new jury for the damages phase. It reached a verdict awarding all but one claim of damages. The steel companies were awarded damages measured by the difference between the lower prices that would have been charged by the excluded competitors and the higher prices actually paid. Damages sustained by the docks and the trucking companies were measured by the profits that each would have earned on the businesses from which they had been excluded. Wills Trucking Company and Toledo World Terminal were awarded only nominal damages ($1) on their claim that the railroads refused to sell or lease dock property to them.\n\nOn February 27, 1991, the district court denied, in substantial part, B\u0026LE's motion for judgment n.o.v., rejecting all of B\u0026LE's arguments except that concerning National Steel's investment cost damage award. First, the court upheld the jury's determinations that 1) B\u0026LE had violated the antitrust laws by conduct which was not immune, i.e., not protected by regulatory statutes or Supreme Court decisions, notably Keogh ; and 2) the plaintiffs' damages were attributable to this conduct.\n\nThe court next rejected B\u0026LE's argument that the plaintiffs lacked standing to bring this action. Specifically, the court held that no serious standing issue arose with respect to the steel companies' dock handling awards nor with respect to the claims of the Erie or trucking company plaintiffs. The court, with admitted reservation (\"although with less than complete confidence\"), App. at 2108, also held that the steel companies had standing to seek self-unloader damages since the steel companies had assumed responsibility for financing and operating ore carrying vessels.\n\nThe district court also denied B\u0026LE's argument that certain of the plaintiffs' Sherman Act claims were barred by the four-year statute of limitations and that laches barred all of the plaintiffs' Ohio Valentine Act claims. The court found that the injuries did not result solely from pre-limitations periods acts and that Zenith Radio Corp. v. Hazelton Research, Inc., 401 U.S. 321, 28 L. Ed. 2d 77, 91 S. Ct. 795 (1971), did not require plaintiffs to trace each item of damages to specific overt acts within the limitations period. The court ruled alternatively that the plaintiffs' Sherman Act claims fit within the Zenith exception that permits assertion of claims which were too conjectural to have been litigated earlier.\n\nWith respect to the Valentine Act claims, the district court held that under Ohio law, an equitable defense does not apply to actions at law for damages; but that, in any event, the jury's findings that the railroads acted affirmatively to conceal their conspiratorial activities, as well as B\u0026LE's failure to show that significant prejudice attributed to any delay in filing suit, ruled out a laches defense.\n\nThe court further rejected B\u0026LE's argument that plaintiffs' damages were not caused by the unlawful conspiracy. The court noted that throughout both phases of the trial B\u0026LE vehemently argued and sought to prove that any damages actually sustained by the plaintiffs were attributable to economic factors other than the alleged conspiracy. The court stated that these factual issues were properly submitted to the jury and that viewing the record in the light most favorable to the verdict winner, there was no doubt that the evidence supported the jury's determinations.\n\nB\u0026LE has appealed the judgment of the district court. The plaintiff steel companies have cross-appealed on two issues: whether the district court erred in granting summary judgment in favor of B\u0026LE on the statute of limitations concealment issue when it ruled that the steel companies, as a group, had knowledge of facts which would have reasonably given them notice of the conspiracy. Second, the plaintiffs argue that the district court erred in refusing to award them prejudgment interest under Ohio law. The Erie dock company and Ambrosia Trucking join in cross-appealing the issue of prejudgment interest.\n\nAs noted, the district court granted B\u0026LE's motion for judgment n.o.v. with respect to National Steel's claim for investment cost damages. The court held that National Steel's claim was not recoverable under the antitrust laws because it represented inflation, a non-compensable loss. National Steel has cross-appealed on this issue.\n\nThe Wills plaintiffs, although prevailing on the issue of liability, were only awarded nominal damages. In their cross-appeal, the Wills plaintiffs contend that the district court impermissibly allowed the damage phase jury to re-examine a liability issue - the fact of damage of the Wills' antitrust claim - in violation of the Seventh Amendment. The Wills plaintiffs also argue that even if nominal damages were appropriate, the district court erred in not trebling them.\n\nWe turn now to Discussion of each of the issues presented, beginning with the appeal brought by B\u0026LE.\n\nII. B\u0026LE's Appeal\n\nA. Antitrust Immunity\n\nPursuant to Keogh v. Chicago \u0026 N. R. Co., 260 U.S. 156, 67 L. Ed. 183, 43 S. Ct. 47 (1922) and 49 U.S.C. § 5(b) (1970), railroads may engage in some joint activity which might otherwise run afoul of the antitrust laws. A major issue permeating this case is whether the railroads' activity, upon which the plaintiffs based their treble-damages causes of action, is protected by Keogh or by statute. It is a question of law over which we exercise plenary review.\n\n1. The Doctrine of Keogh\n\nIn Keogh, a shipper sued a railroad carrier for participating in a conspiracy to fix rates in violation of the Sherman Act. The ICC had previously approved the rates. The Supreme Court held that even though the ICA does not immunize regulated carriers from government antitrust prosecution, it does preclude treble damage awards to private litigants. The Court gave a number of reasons for its holding. First, because the subject rates were accepted by the ICC, they were the \"legal\" rates. The Court believed it inconsistent that Congress, in enacting the ICA, would intend that carriers could be sued for price-fixing when they were charging the rates required by law. 260 U.S. at 162-63. Second, if Keogh were to prevail, he would receive a lower rate not available to other shippers. This situation would create, in effect, a discriminatory rebate, avoidance of which was one of the reasons for the ICA. Id. Third, to establish injury, Keogh would be put to the task of proving hypothetical lower rates which would have been charged in the absence of the conspiracy and the acceptability of those rates to the ICC. Additionally, Keogh would have to overcome the problem of speculative calculation of damages. Id. at 164.\n\nThe Court re-examined the Keogh doctrine in Square D Co. v. Niagara Frontier Tariff Bureau Inc., 476 U.S. 409, 90 L. Ed. 2d 413, 106 S. Ct. 1922 (1986). In Square D, shippers brought antitrust actions against motor carriers and their rate-making bureau, claiming that the carriers and the bureau had conspired to fix rates without complying with their ICC-approved rate agreement. The shippers claimed entitlement to the difference, trebled, between the rates actually paid and the rates which would have prevailed in an open market. The district court dismissed the actions under the authority of Keogh.\n\nWhile the Court of Appeals for the Second Circuit affirmed the district court's principal ruling, Square D Co. v. Niagara Frontier Tariff Bureau, 760 F.2d 1347, 1349 (2d Cir. 1985), it noted a possible distinction between rate-making activity, shielded by Keogh, and other, unprotected, concerted activity. The Square D shippers had alleged that the defendant carrier rate bureau had: (1) used an unauthorized Committee to \"set rates and inhibit competition\"; (2) ignored \"the notice, publication, public hearing, and recordkeeping requirements of its [freight agreement] and ICC regulations\"; (3) strategized \"threats, retaliation, and coercion against [rate bureau] members to inhibit independent actions\"; and, (4) employed \"pressures, threats, and retaliation to interfere with independent actions.\" Square D, 476 U.S. at 412-13.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The court of appeals identified these four allegations as potential support for a claim that the carriers jeopardized the shippers' economic health by blockading their ability to sell their goods. \"Thus, on remand, appellants should be afforded an opportunity, if they believe the facts justify it, to amend their complaint to state a proper claim for damages.\" Square D, 760 F.2d at 1366.\n\nOn certiorari, the Supreme Court acknowledged that while the joint setting of rates is protected activity under 49 U.S.C. § 5(b), the \"statute strictly limits the exemption to actions that conform to the terms of the agreement approved by the ICC.\" Square D, 476 U.S. at 413-14. The Court also recognized that \"nothing in the language of the Interstate Commerce Act, moreover, necessarily precludes a private antitrust treble damages remedy for actions that are not specifically immunized within the terms of the Reed-Bullwinkle Act,\" 476 U.S. at 414. The Court nonetheless determined that, under Keogh, the Square D shippers could not bring a treble damages action because:\n\nKeogh simply held that an award of treble damages is not an available remedy for a private shipper claiming that the rate submitted to, and approved by, the ICC was the product of an antitrust violation.\n\nId. at 422. The Court then affirmed the dismissal of the complaints, albeit without specific Discussion of whether Keogh protected the carriers from liability for concerted, non-rate activity.\n\nThus the question left unresolved by Square D remains for us to answer today: Does Keogh, with its reaffirmation in Square D, preclude treble-damage recovery for private litigants claiming that members of a regulated industry conspired to preclude competition in which ICC-approved rates played a role in thwarting market entry? As with many of the other issues before us, our response differs depending upon the particular group of plaintiffs and the damages sought.\n\na. The Steel Companies\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe district court, without the benefit of the Supreme Court's Square D opinion, relied upon Keogh to dismiss the plaintiffs' original claims for damages based upon rates charged by the defendant railroads. According to the district court, two steel company antitrust claims survived this dismissal:\n\n(1) [a claim] that [the steel companies] could have paid lower dock-handling rates (sooner) to the private docks than they did to the railroad docks if the railroads had not retarded the development of the self-unloader industry; and (2) [a claim] that [the steel companies] could have paid lower land transport rates (sooner) to the truckers, had the railroads not restrained competition by that industry and monopolized line-hauling from their docks. In my view, plaintiffs' generalized claims regarding savings they would have realized had defendants not impeded self-unloader development and had they been able to choose the most economic combination of transportation alternatives come within these two categories.\n\nApp. at 234 (footnote omitted).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn a subsequent order, the district court dismissed any damage claims that would require estimating what rates the ICC would have accepted, an estimation forbidden by Keogh. According to the district court, the sole remedy for these claims would be before the ICC. App. at 362-63.\n\nAs to the surviving claims, the district court reasoned:\n\nWith respect to Keogh. . . plaintiffs need not prove what prices, but for the conspiracy, defendants would have charged; plaintiffs need prove only that, in the context of tariffs that I must accept as legitimate, defendants' exclusionary activities and other antitrust violations slowed penetration of the relevant markets by defendants' competitors. Thus, plaintiffs' damages do not depend on proof of price-fixing by defendants, which Keogh would bar, but on proof that defendants conspired to exclude low cost competitors from the market, which does not implicate the ICC's exclusive jurisdiction and therefore is not barred by Keogh. In short, as Judge Friendly as explained, '[a] shipper may recover damages if it can show that carriers caused injury to the shipper's business or property other than by higher tariffs . . . .' Square D, 760 F.2d at 1365.\n\nApp. at 372-73.\n\nThe district court also discussed Republic Steel's claims for damages emanating from the delay in the construction and use of Republic's own dock facilities. To apply Keogh to bar this complaint, opined the court, would allow a blockade of a competitor to escape scrutiny. This would overextend Keogh 's reach and could produce a rule that one who pays for services governed by ICC tariffs is foreclosed from asserting that antitrust violations prevented use of a less expensive, equivalent service.\n\nBefore the liability jury, the plaintiffs presented evidence of the railroads' agreements to restrict the sale and lease of dock property, boycotts of unregulated docks, refusals to handle self-unloaders in a way that would make economic sense for a steel company to utilize them, and coercion to prevent independent action. Indeed, the district court described the forcefulness of the evidence against B\u0026LE as follows:\n\nLiterally thousands of documents, from the railroads' own files, establish beyond dispute the existence of an illegal conspiracy, dating back to at least 1950, to prevent self-unloading vessels, private docks, and trucking firms from gaining a foothold in the transportation of ex-lake iron ore. The record is so clear and complete, in fact, that it can be read to suggest that the participants may have genuinely believed that the antitrust laws did not apply to railroads at all.\n\nApp. at 2102.\n\nWe conclude that the district court correctly characterized B\u0026LE's anti-competitive activity as market preclusion, and Keogh 's protective rule cannot apply to forbid recovery for the resulting economic detriment. As the Supreme Court has succinctly stated, Keogh merely prevents private shippers from sustaining an award of treble damages by claiming that ICC-approved rates were the product of an antitrust violation. Square D, 476 U.S. at 422. That statement of Keogh's protection does not preclude liability based on non-rate anticompetitive activity. Indeed, the steel companies' case involves damage claims based on non-rate activity that targeted potential low-cost competitors.\n\nWe recognize that the success of anticompetitive non-rate activity would coincidentally implicate rates promulgated under the jurisdiction of the ICC. It is fully consistent with Keogh, however, to accept these rates as lawful and nonetheless to conclude that through non-rate activities, particularly the restriction on the sale or lease of dock space and the refusal to deal with potential competitors, the railroads effectively retarded entry of lower cost competitors to the market. The instrument of damage to the steel companies was the absence of the lower-cost combination. In contrast, the Supreme Court in Keogh made it clear that \"the instrument by which Keogh is alleged to have been damaged is rates approved by the Commission.\" 260 U.S. at 161. As a result,\n\nthe burden resting upon the plaintiff would not be satisfied by proving that some carrier would, but for the illegal conspiracy, have maintained a rate lower than that published. It would be necessary for the plaintiff to prove, also, that the hypothetical lower rate would have conformed to the requirements of the Act to Regulate Commerce. For unless the lower rate was one which the carrier could have maintained legally, the changing of it could not conceivably give a cause of action.\n\nKeogh, 260 U.S. at 163-64.\n\nThe proof required to show the harm alleged here thus differs from that deemed objectionable in Keogh. In this case, the plaintiffs showed that the railroads conspired to protect their stronghold in the ore transport market by blocking entry by low-cost competitors, not that the railroads charged an unlawful rate.\n\nThe facts in Square D also differ from those proven at trial here. The Square D plaintiffs contended that unlawful conduct caused shipping rates to be higher than a freely competitive market. They sought treble damages measured by that difference. Thus, the Square D plaintiffs, like the plaintiff in Keogh, grounded their damage claims on the allegation that the motor carriers, a group regulated by the ICC, would have charged a lower rate absent the conspiracy. Here, the question of hypothetical lower rates is ancillary. If the self-unloader/private dock/trucking triad had been permitted to develop, conceivably the steel companies would no longer be captive customers of the railroads and the rates charged by them would not be so pervasive a consideration. Admittedly, to remain competitive, the railroads would no doubt be forced to lower their rates, but the goal of the antitrust laws is to provide an open and competitive market place. It was the railroads' hindering the development of the market which defines this antitrust litigation.\n\nThe opinion of the Court of Appeals for the Sixth Circuit in Pinney Dock and Transport Corp. v. Penn Central Corp., 838 F.2d 1445 (6th Cir. 1988), while not binding on us, does provide some guidance. The Pinney Dock case involves the same defendants and the same conspiracy at issue here. The plaintiffs were a dock company, Pinney, and a builder of self-unloading vessels, Litton. On motions to dismiss, the court of appeals held that Keogh would bar claims based on the handling and line-haul rates charged by the railroads. Id. at 1457. However, the court of appeals also deemed certain claims outside the scope of the Keogh doctrine. These claims included Litton's contention that the defendants refused to permit Litton to purchase, lease or use dock facilities that could have accommodated Litton's self-unloading vessels and the contention of both plaintiffs that \"defendants used harassing tactics and spurious challenges to try to forestall legitimate business activities of competitors.\" Id. After a full trial, we are in a different procedural position than that of Pinney Dock. We have definite evidence of the railroads' refusal to handle self-unloaders at their docks, restrictions on the sale and lease of dock property to unregulated entities, boycotts of unregulated docks, and intra-industry coercion claims which mirror those deemed by the court of appeals in Pinney Dock to escape Keogh. Because the railroads derailed their potential competitors, the steel companies could not use alternative, lower-cost, private docks, and thus they lacked the economic incentive to develop self-unloaders. The by-product of this delay in introducing these vessels was that the steel companies were compelled to continue to pay the railroad fixed rates. Even strained to simplification, the railroads' anticompetitive behavior involved far more than the assessment of rates. The mere measure of damages, which begins with an ICC-approved rate, does not define the nature of the conspiracy.\n\nAlthough we conclude from the evidence produced that the steel company plaintiffs proved at trial an antitrust conspiracy that was not grounded in rate-related claims, the question remains whether the district court properly instructed the jury concerning the types of rate activity protected by Keogh. In a liability segment of the trial, the district court charged on Keogh, in part, as follows:\n\nWhat is forbidden by the antitrust law are joint actions, actions taken pursuant to an agreement which restrains trade unreasonably -- that is, which adversely affect competition -- and which are not within the protection, the immunity, granted by the rate bureau proceeding -- that is to say, which are not rate related.\n\nBut once a rate is being charged pursuant to a duly filed tariff which has not been disapproved by the Interstate Commerce Commission, then it is conclusively presumed so far as the law is concerned that the charge is a reasonable one. And what that means is that nobody can claim damages under the antitrust laws or any other law -- no shipper who pays railroad rates, who pays freight charges to a railroad -- can complain to have been damaged either by the antitrust laws or by other laws merely by the allegation that those charges were higher than they should have been.\n\nApp. at 4981-82.\n\nThe district court also instructed the jury concerning B\u0026LE's good faith and regulatory climate defenses and informed the jury that, if the company's conduct was consistent with the overall policies of the ICC, it was not in violation of the antitrust laws. App. at 5002.\n\nB\u0026LE takes issue with the charge, arguing that, under the Keogh doctrine, no matter how unlawful the means to fix or maintain rates, and no matter how anti-competitive those means may be, the tariff rates are the legal rates and cannot give rise to liability for antitrust damages. We disagree. Keogh does not give ICC-regulated industries carte blanche to preclude competition. The instruction, as a whole, recognized this principle and so did not misinform the jury as to the scope of the Keogh doctrine's protection.\n\nIn sum, we conclude that Keogh and Square D, prohibiting treble-damage recovery for private litigants based upon rate-related activity, cannot be applied here to deny antitrust recovery to the steel companies.\n\nb. The Dock and Trucking Companies\n\nThe dock companies and trucking companies argue that Keogh does not bar their damage awards because Keogh and its progeny apply only to customers and not to competitors.\n\nWe have held that Keogh does not apply to claims of competitors. In Essential Communications Systems, Inc. v. American Telephone \u0026 Telegraph Co., 610 F.2d 1114 (3d Cir. 1979), we stated that \"the filed tariff rule has little or nothing to do with [defendants'] duties under the antitrust laws toward its competitors . . .; competitors are not the intended beneficiaries of the rule of public utility regulation.\" Id. at 1121. We then distinguished Keogh as follows:\n\nIn this case the plaintiff is not suing in the capacity of a customer for communication services. Essential seeks recovery for injury to its business or property from actions taken by the defendants in formulating a tariff, and in rendering customer services. The Bell System will not be asked to disgorge to any customers any revenues derived under the filed tariff. Indeed, it can continue to collect those revenues until a new tariff is filed. There is no policy conflict, actual or potential, therefore, between the Section 4 Clayton Act remedy and the antidiscrimination purposes of the filed tariff rule.\n\nId. at 1122; see also Barnes v. Arden Mayfair, Inc., 759 F.2d 676, 679 (9th Cir. 1985); Kirkwood v. Union Electric Co., 671 F.2d 1173, 1179 (8th Cir. 1982), cert. denied, 459 U.S. 1170, 74 L. Ed. 2d 1013, 103 S. Ct. 814 (1983); Groton v. Connecticut Light \u0026 Power Co., 662 F.2d 921, 929 (2d Cir. 1981). But see Pinney Dock, 838 F.2d at 1457 (applying Keogh to bar competitors' claims).\n\nAlthough in Essential Communications we dealt with regulation of a utility by the FCC rather than of a common carrier by the ICC, our reasoning there is forceful here and we will apply this precedent. The section 4 claims of the dock and trucking companies are therefore not impacted by the Keogh rule.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n2. Section 5a Immunity and the Doctrine of Primary Jurisdiction\n\nCollective rate-making activity by regulated railroads is also afforded a measure of protection by section 5a of the Interstate Commerce Act:\n\nParties to any agreement approved by the Commission under this section and other persons are, if the approval of such agreement is not prohibited by paragraph (4), (5), or (6) of this section, relieved from the operation of the antitrust laws with respect to the making of such agreement, and with respect to the carrying out of such agreement in conformity with its provisions and in conformity with the terms and conditions prescribed by the Commission.\n\n49 U.S.C. § 5b(9) (1970). B \u0026LE argues that, under the doctrine of primary jurisdiction, the district court should have referred to the ICC the question of whether the railroads' activity was immune under section 5a. However,\n\nthe doctrine of primary jurisdiction, despite what the term may imply, does not speak to the jurisdictional power of the federal courts. It simply structures the proceedings as a matter of judicial discretion, so as to engender an orderly and sensible coordination of the work of agencies and courts.\n\nUnited States v. Bessemer \u0026 L.E. R. Co., 230 U.S. App. D.C. 316, 717 F.2d 593, 599 (D.C. Cir. 1983) (footnotes omitted), quoting Cheyney State College Facility v. Hufstatler, 703 F.2d 732, 736 (3d Cir. 1983). Cf. United States v. Western Pacific Railroad, 352 U.S. 59, 64, 1 L. Ed. 2d 126, 77 S. Ct. 161 (1956) (\"No fixed formula exists for applying the doctrine of primary jurisdiction\"). A district court's decision not to submit an issue for initial determination by the agency will be reversed only for an abuse of discretion. Puerto Rico Maritime Shipping Authority v. Valley Freight Systems, Inc., 856 F.2d 546, 549 (3d Cir. 1988).\n\nIn Pinney Dock, the Court of Appeals for the Sixth Circuit decided that whether the ICC-approved rate bureau agreement had been violated and thus whether section 5a immunity applied \"should be addressed, at least first, to the wisdom and expertise of the ICC.\" 838 F.2d at 1459. In the related criminal antitrust case, United States v. Bessemer \u0026 L.E., 717 F.2d at 600, in which B\u0026LE pled nolo contendere and then appealed the sufficiency of the indictment, the Court of Appeals for the District of Columbia Circuit reached a different Conclusion, holding that \"the activities described in the indictment do not fit within the narrow 5a privilege.\" 717 F.2d at 600.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e We agree with the Court of Appeals for the District of Columbia Circuit that the conduct alleged and proven violated both the substantive and procedural requirements of section 5a. We therefore conclude that the district court exercised sound discretion in not referring the section 5a immunity issue to the ICC.\n\nB\u0026LE then argues that the jury instruction, particularly the district court's equation of the agreement not to establish line haul rates from non-railroad docks to an illegal refusal to deal - a rate-related activity subject to a section 5a immunity - manifestly prejudiced their case.\n\nIn the relevant portion of the charge concerning the refusal to deal, to which the defendant has lodged a specific objection, the district court instructed as follows:\n\nNow, I mentioned that we have various claims relating to the alleged agreement not to establish line haul rates from non-railroad docks and not to allow the use of hopper cars by the steel companies in ways that would enable the trucking companies better to compete. A whole set of claims by various plaintiffs have to do with this allegation that the railroads refused to deal - that is to say, refused to enable the private docks to be established.\n\nI mentioned earlier that each railroad acting independently had a perfect right to decide whether to lease the property to another company or not, but that it would be a violation of the antitrust laws for them to get together and agree that none of them would lease land to a private dock that could be used for a private dock or that could accommodate self-unloader vessels or that could be used by trucking companies.\n\nApp. at 4996.\n\nReading, as we must, the jury instructions as a whole, we find that the district court competently charged the jury regarding the scope of immunity afforded concerted railroad activity under the Reed-Bullwinkle Act.\n\nThe district court did not, as B\u0026LE contends, tell the jury that failure to establish line haul rates amounted to a boycott. Instead, the court recounted the plaintiffs' allegations that certain railroad activities were refusals to deal and informed the jury that it must decide whether or not the railroads did conspire to foreclose private dock competition. There is nothing erroneous about this charge.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nB. Standing\n\nIn addressing the \"standing\" of parties to bring a claim under § 4 of the Clayton Act, the Supreme Court has focused on the nexus between the antitrust violation and the plaintiff's harm and on whether the harm alleged is of the type for which Congress provides a remedy. Blue Shield of Virginia v. McCready, 457 U.S. 465, 478, 73 L. Ed. 2d 149, 102 S. Ct. 2540 (1982).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn determining that the plaintiffs had standing here, the district court focused on Illinois Brick Co. v. Illinois, 431 U.S. 720, 52 L. Ed. 2d 707, 97 S. Ct. 2061 (1977), in which the Supreme Court held that § 4 does not generally permit indirect purchasers to sue on a \"pass-on theory\", that is, a theory that illegal overcharges have been passed on through a chain of distribution. Three important policies supported this holding: avoiding the risk of multiple liability for defendants, avoiding evidentiary complications in identifying affected parties and measuring their damages, and avoiding the difficulties of managing large and complex suits. Id. at 741, 745.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Later, in Blue Shield of Virginia v. McCready, the Court discussed the range of § 4 plaintiffs, and while recognizing \"a point beyond which the wrongdoer should not be held liable\", McCready, 457 U.S. at 477, the Court also discouraged \"engrafting artificial limitations on the § 4 remedy\", id. at 472.\n\nIn Associated General Contractors, Inc. v. California State Council of Carpenters, 459 U.S. 519, 74 L. Ed. 2d 723, 103 S. Ct. 897 (1983) (\"AGC \"), the Supreme Court synthesized its prior decisions and outlined a multi-factor inquiry to determine standing questions. Although the development of the doctrine is important to understanding the concerns of the Court in granting or denying standing, it is the AGC analysis - the most recent, comprehensive and relevant statement by the Court - which will resolve the standing question here. We exercise plenary review over application of the legal principle of standing.\n\n1. B\u0026LE's Standing Arguments\n\nB\u0026LE challenges the standing of Republic, Wheeling-Pitt and J\u0026L to claim \"lake transport damages,\" that is, damages resulting from the steel companies' higher cost of shipping ore via vessel companies during the conspiracy-induced delay in introducing low-cost self-unloaders.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e B\u0026LE characterizes these payments of the steel companies to the vessel companies as \"inherently indirect\" and argues that Illinois Brick and Mid-West Paper Products Co. v. Continental Group, Inc., 596 F.2d 573 (3d Cir. 1979), which hold that only those who suffer direct injury have standing to seek antitrust damages, prevent the steel companies from asserting a § 4 claim for lake transport damages.\n\nB\u0026LE also challenges the steel companies' standing to seek damages based on the difference between the dock handling rates that they actually paid to the railroad docks and Pinney Dock\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and the rates that they would have paid in an open and competitive market.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e B\u0026LE contends that the amount of savings the docks would have passed on to the steel companies presents problems of double recovery and complex apportionment of damages condemned by the Supreme Court in Illinois Brick.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe district court resolved the standing issue in its post-verdict opinion by concluding, with reference to the \"indirect purchaser\" rule of Illinois Brick, that the steel companies' de facto ownership of bulker vessels allowed the jury to conclude reasonably that, but for the conspiracy, the steel companies would have become similarly involved with self-unloaders. Ownership of the vessels, reasoned the court, translated to direct cost reduction of the steel companies' cost related to the movement of ore.\n\nAlthough de facto ownership of the vessels might well relieve that steel companies from dismissal under Illinois Brick, we conclude that the standing requirement is satisfied under a different rationale.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The Supreme Court's cumulative pronouncements concerning directness of injury in antitrust cases mandates a more complex and differently focused inquiry.\n\n2.Associated General Contractors, Inc. v. California State Counsel of Carpenters\n\nIn Associated General Contractors, Inc. v. California State Council of Carpenters (\"AGC \"), the Court reviewed concerns addressed in previous cases\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and set forth an integrated § 4 \"standing\" analysis. In AGC, unions representing California construction workers sued an association of employers with whom the union had collective bargaining agreements. The complaint charged the association and its members with coercing some employers into doing business with non-union contractors and sub-contractors. In assessing the union's standing to sue, the Court did not distinguish between antitrust standing and antitrust injury.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nInstead, the Court provided a number of factors to consider in § 4 actions to determine if the plaintiff has suffered an injury which bears a causal relation to an alleged antitrust violation. These factors provided a theoretical framework for courts to utilize when presented with a standing challenge. They are: (1) the causal connection between the antitrust violation and the harm to the plaintiff and the intent by the defendant to cause that harm, with neither factor alone conferring standing; (2) whether the plaintiff's alleged injury is of the type for which the antitrust laws were intended to provide redress; (3) the directness of the injury, which addresses the concerns that liberal application of standing principles might produce speculative claims; (4) the existence of more direct victims of the alleged antitrust violations; and (5) the potential for duplicative recovery or complex apportionment of damages. This fifth factor addresses the disfavor, expressed in Illinois Brick, of complex antitrust trials which not only \"burden the courts, but also undermine the effectiveness of treble damages suits.\" AGC, 459 U.S. at 545, citing Illinois Brick, 431 U.S. at 745.\n\nAt least one commentator suggests that although deciphering a distinction between the two concepts is not obligatory, it is important to understand that even after the Court's consolidating opinion in AGC, antitrust injury is more than a component to be factored in a standing analysis, it must be present in every case.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn a case decided shortly after the AGC decision, we characterized the Supreme Court's discourse:\n\nThe Court's case-by-case approach reflects the fact that § 4 standing analysis is essentially a balancing test comprised of many constant and variable factors and there is no talismanic test capable of resolving all § 4 standing problems.\n\nMerican, Inc. v. Caterpillar Tractor Co., 713 F.2d 958, 965 (3d Cir. 1983), quoting Bravman v. Bassett Furniture Industries, 552 F.2d 90, 99 (3d Cir.), cert. denied, 434 U.S. 823, 54 L. Ed. 2d 80, 98 S. Ct. 69 (1977). In Merican we indicated (albeit with citation to a different case) that the AGC factors should be weighed and balanced. The AGC opinion does not assign specific weight to its factors, individually, collectively or relatively. Nor for that matter does the decision explicitly instruct us to balance the factors, although implicit instruction is discernable from the language - \"other relevant factors . . . weigh heavily against judicial enforcement of the Union's antitrust claim.\" 459 U.S. at 545 (emphasis added).\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe plaintiffs in Merican were independent distributors who purchased Caterpillar-manufactured products from its authorized dealers for resale in the foreign market. The plaintiffs alleged that by imposing a service fee on its dealers for certain transactions, Caterpillar violated the Sherman Act. The service fee was characterized as a mechanism through which Caterpillar conspired with its authorized dealers to eliminate the plaintiff's position in the market place. While recognizing that the Supreme Court had recently enumerated the list of factors to be utilized in analyzing standing in § 4 cases in AGC, we decided the case solely on the operation of the Illinois Brick concern, i.e., that the potential for duplicative recovery and complex apportionment of damages meant that the plaintiffs were \"not persons injured in their business or property by reason of violation of the antitrust laws within the meaning of section 4.\" 713 F.2d at 969. See also Link v. Mercedes-Benz of North America, Inc., 788 F.2d 918, 932 (3d Cir. 1986) (under Illinois Brick, threat of duplicative recovery and potential for complex theory of damages bars consumer price fixing claims against automobile manufacturer).\n\nThe facts of the present case, however, require, under AGC, a more complete analysis, to which we now turn.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\na. The Steel Companies' Lake Transport Charges\n\ni. and ii. Directness of Injury and Causation\n\nThe lake transport injury asserted by the steel companies is that the payments made to the vessel companies to tranship their ore were inflated because B \u0026LE illegally thwarted the development of self-unloaders.\n\nTo determine if lake freight savings are recoverable, our decision in Mid-West Paper Products Co. v. Continental Group, 596 F.2d 573 (3d Cir. 1979), is helpful. In that case, like this one, damages were predicated on amounts paid to a non-conspiring party. While recognizing that a non-conspiring competitor of a defendant supplier was included under the \"umbrella\" of those suffering economic impact from the defendants' conspiracy, we denied standing \"in light of the tenuous line of causation between the defendants' price fixing and the prices paid by [the plaintiff].\" Id. at 583. Standing was also denied because \"the outcome of any attempt to ascertain what price the defendants' competitors would have charged had there not been a conspiracy would at the very least be highly conjectural.\" Id. at 584.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThus, Mid-West Paper instructs, consistent with AGC, that we inquire whether the injury resulting from payment of excessive lake transport charges is directly traceable to the railroad's anti-competitive behavior. This AGC causation focus is not an overruling of Illinois Brick - an AGC analysis incorporates the Illinois Brick principles of discouraging speculative and overly complex claims. Thus, although we remain loyal to upholding the concerns voiced by the Supreme Court in Illinois Brick, echoed by our precedent in Mid-West Paper and Merican, the mere fact that monies paid to third parties (the vessel companies) represent a component by which the steel companies measure their damages does not foreclose further inquiry as to whether standing existed.\n\nWe agree with the district court and B\u0026LE that the steel companies, in respect to lake transport damages, are, in some sense, \"indirect\" purchasers. Although B\u0026LE suggests that indirect purchaser status is the death knell of plaintiffs' claim, this Conclusion is not supported by the current law. We are, instead, instructed by AGC to ascertain the nature of the relationship between the parties. This directness factor thus sets the tone for our standing analysis.\n\nThe form of this conspiracy was market exclusion. B\u0026LE concedes that an agreement existed among the railroads to take anticompetitive action to maintain its dominance in the ore transport market. Although this aim itself is not illegal, the nefarious means to achieve it were. By charging the same rate for unloading a self-unloader as for unloading a bulker, by refusing to approve commodity line haul rates from private docks which would have handled self-unloaders, and by concertedly refusing to make dock property available for use by private docks, the railroads delayed the introduction of the more efficient self-unloader. This delay caused loss of the profits which would have been realized had the less costly transport system been in place.\n\nThe relevant question is whether B\u0026LE's antitrust activity directly impacted the steel companies. Undeniably it did. The steel companies were the sole customers of the industry involved in the transhipment of ore; indeed, the industry existed for them. True, the steel companies made payments for ore movement services to various parties, defendants and non-defendants alike, but it was unquestionably the steel companies who bore the brunt of the increased costs attributed to the railroad's agreement to thwart development of the less expensive technology.\n\nThe direct nature of the injury absorbs the question of causal connection. There are no missing links in the causation chain here. The correlation between the steel companies' inability to utilize the lower cost method to carry its ore and the railroad's attempt to close the ore transport market is obvious. The goal of the railroads in preventing the self-unloader/private dock/private trucking company system from coming into existence left four victims in its wake, the three component industries, and the steel companies. However, the steel companies suffered the greatest harm in connection with the delay of the use of the self-unloader technology. This all-important, directness factor thus weighs greatly in the steel companies' favor.\n\niii. Goal of Antitrust Laws\n\nWe ask next whether the alleged injury was the type that Congress sought to redress in providing a private remedy for violations of the antitrust laws. AGC, 459 U.S. at 538, quoting Blue Shield of Virginia, 457 U.S. at 483. \"The Sherman Act was enacted to assure customers [here, the steel companies] the benefits of price competition, and our prior cases have emphasized the central interest in protecting the economic freedom of participants in the relevant market. Id. (footnote omitted.) Thus, factor three clearly favors the steel company plaintiffs.\n\niv. Other Victims\n\nAs discussed, others suffering economic harm here included the vessel companies, the dock companies and the trucking companies. They, too, as competitors for the ore transport business, have suffered direct antitrust injury, yet the unique circumstances of this conspiracy compel us to classify their injuries as tangential to that of the steel companies. The economic health of the dock and trucking companies was, nonetheless, significantly compromised as part and parcel of the railroads' scheme to force the steel companies to remain loyal to a system where the railroads would reap the greatest profits. Therefore, other direct victims exist, but their presence does not diminish the directness of the steel companies' injury. This factor, thus, weighs evenly.\n\nv. Duplicative Recovery and Complex Apportionment\n\nThe concern for duplicate recovery and the potential for complex apportionment of damages are real. Nonetheless, the involvement of other parties and their resultant damages here are not the particular kind of double recovery Illinois Brick sought to prevent. In Illinois Brick the concern was that overlapping parties would compete for the same pool of illegal profits garnered from the antitrust activity. This type of duplication would be implicated here if B \u0026LE's illegal activity were subject to suit by a \"downstream\" industry alleging, as was alleged in Illinois Brick, that the steel companies had passed on the transportation increase in the price of steel. Here, different parties allege different injuries - the steel companies' claim is for the savings which would be realized if the less expensive method of transport was in place, while the vessel and dock companies' claim focuses on lost profits.\n\nThe distinctive labelling of the claims does not solve the problem of overlap when the steel companies' claim of damages is called to proof. The steel companies would have to demonstrate meticulously that none of its lost savings includes any amounts which the vessel companies might potentially claim as lost profits.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nNevertheless, while complex apportionment problems are implicated here, we do not hold that litigation must be avoided solely because it might be difficult to ascertain damages. Injured parties cannot be penalized and left without recourse because measurement of their damages is difficult. In this vein, it is important to focus on the word \"potential.\" We are either gifted or vexed by hindsight in this matter, but standing is a threshold determination. It decides if the plaintiffs have alleged a cause of action and have requested the recovery of damages that are cognizable under the law. The damage theories here should not be deemed complex simply because that is the way in which they were ultimately presented. Reliability is instead an evidentiary question properly decided under evidentiary standards - are the figures economically reliable? Was the expert witness credible? At the standing stage we look to the initial allegation of damages, and, at that point, the steel companies' damages did not appear incapable of accurate calculation.\n\nThe facts as found by the jury were that self-unloaders were generally less expensive to utilize. The steel companies' damages were measured as the difference between the amounts they actually paid to transport their ore and the lower prices they would have paid had the conspiracy not excluded a lower cost system. Although, as in antitrust matters involving traditionally defined direct purchasers, other pricing considerations no doubt would factor, that the operating costs would be reduced overall does not require undue speculation. While we recognize that the potential for overlap existed, we are not convinced that it should prevent the matter from proceeding. Thus, although this factor weighs against the steel companies, we do not find it a reason, standing alone, sufficiently compelling to support a standing challenge. A balancing of the AGC factors, thus, weighs in favor of the steel companies' standing; the lake transport damages are recoverable.\n\nb. The Steel Companies Dock Handling Damages\n\nB\u0026LE contends that the steel companies' dock damages are also barred by Mid-West Paper, because these damages resulted from amounts paid to non-conspiring competitors of the defendant. In Midwest Paper we dismissed antitrust damage claims of indirect purchasers of defendant's consumer bags under Illinois Brick. We held that direct purchasers from defendants' competitors lacked standing to sue on the grounds that the competitors' prices would have been lower but for the defendants' illegal price fixing. We concluded that this claim was highly speculative, and that any \"attempt to determine the effect of the defendants' overcharges upon their competitors' prices would transform this antitrust litigation into the sort of complex economic proceeding that Illinois Brick Court was desirous to avoid if at all possible.\" Id. at 585 (footnote omitted). B\u0026LE characterizes the steel companies' request for dock damages as an attempt to recover the difference between the prices set and actually paid by the steel companies to the railroad docks and prices they would have paid private docks if their services had been available. Thus, B\u0026LE argues, the claim is dependent upon prices paid to parties other than the defendants and Midwest Paper bars recovery.\n\nThe defect in this argument is apparent. The steel companies directly purchased from, and paid monies to, the railroads for dock services. Thus, the amounts contested as being paid to third parties reflect only the second part of the damage equation. To refute the directness factor, the railroads break down the component costs of the dock handling charge and argue that because a portion of the charge was actually paid by the vessel companies to the railroad, here too, the steel companies are indirect purchasers.\n\nWe disagree. The dominant relationship in the context of the steel companies purchasing dock services from B\u0026LE is one of customer-provider. The specter of indirectness does not haunt us here and a full AGC analysis is not mandated. The presence of the dock companies as another direct victim does not dilute the causal connection between the inflated dock handling charges paid by the steel companies and the railroads' conspiracy. The jury awarded dock damages for the steel companies' inability to utilize the private docks to handle iron ore. Thus, the damages arose from the conspiracy's effective attempt to eliminate competition from private docks, not from the charges which might have been paid to those private docks.\n\nWe have already determined that the potential for complex apportionment is not a sufficient reason to deny standing. Therefore, the AGC factors likewise support and uphold standing of the steel companies to claim dock handling damages.\n\nc. The Trucking Companies\n\nIn Pre-Trial Order 49 filed in this matter, the district court dismissed all trucking company claims \"relating to the alleged suppression of self-unloader technology, denial of line haul rates, and suppression of (refusal to sell to) private docks.\" App. at 1429. Nonetheless, at the Conclusion of the liability phase of the trial, the jury, in response to the special verdict questionnaire found that C. D. Ambrosia Trucking Company was injured by \"acts to prevent or delay iron ore handling by private docks\", App. at 1898, and that Tauro Brothers Trucking Company was injured by \"foreclosure and/or delay in the utilization of self-unloader vessels\" and the \"inability of steel mills to fully use private docks.\" App. at 1899. The jury rejected other related claims of Ambrosia and Tauro. In response to the post-trial standing challenge levied against the trucking companies, in its judgment n.o.v. opinion the district court summarily stated that the rule of Illinois Brick did not arise in connection with the trucking companies' claims for damages.\n\nIn its main argument, B\u0026LE does not urge that the jury instruction was faulty; rather, it argues that, under AGC, the trucking companies' injuries were too remote to confer standing to bring these claims.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e B\u0026LE also asserts, under the authority of Matsushita Electronic Industrial Co. v. Zenith Radio Corp., 475 U.S. 574, 89 L. Ed. 2d 538, 106 S. Ct. 1348 (1986), that the trucking companies' § 4 claims are barred because these companies were the benefactors of the excessive handling charges assessed by the railroads. By B\u0026LE's logic, its refusal to provide lower line haul rates from private docks opens the door for the trucking companies to step in and offer their allegedly lower cost service.\n\nThe evidence, typified by the following excerpts from railroad communiques, shows that a primary goal of the railroad conspiracy was to prevent or delay the trucking of ore from non-railroad facilities: \"We have strongly resisted for years all proposals to sell or lease Erie ore dock as a bulk materials handling facility which would be open to trucking . . .\" (App. at 7952); providing line haul rates to a non-railroad dock \"might influence a movement by truck\" (App. at 6626); \"There is one thing about rates from a private facility which has always bothered me, and that is the possibility of trucking ore and pellets to a steel plant\" (App. at 7026); and, \"If you lease ground to Litton, trucks could break the rail rate on iron ore - particularly on short haul moves\" (App. at 7458). The actions taken by B\u0026LE and the other railroads thus were clearly intended to inhibit the trucking companies' entry into the business of land transportation of ore. There is thus a direct relationship between the defendants' antitrust activity and the trucking companies' injuries.\n\nThis type of injury, a restraint upon market entry, is precisely the type of injury that the antitrust laws were designed to prevent. There is no question of overlap here because no other plaintiff could seek the lost profits that the trucking companies request.\n\nWhile the concern for speculation regarding the measurement of damages is present, the nature of the speculation chiefly concerns when, absent the conspiracy, the steel companies would have adopted the self-unloader/private dock/trucking company system. It is the railroads who took measures to impede the development of the technology and who thus are responsible for any uncertainty concerning when market entry would have been accomplished. The AGC factors, thus, weigh in favor of granting the trucking companies standing to assert a claim for § 4 damages.\n\nWe, therefore, conclude that all plaintiffs, directly injured by B\u0026LE's conspiratorial activity with the other railroads, have standing to assert § 4 claims for damages.\n\nC. Limitation of Actions\n\nB\u0026LE claims that the federal actions filed against it are time-barred by the four-year Sherman Act statute of limitations. The Ohio actions suffer the same fate, according to B\u0026LE, by application of the doctrine of laches. These issues present mixed questions of law and fact which implicate our plenary review of the questions of law and the clearly erroneous standard to the district court's factual findings.\n\n1. Federal Law\n\nPointing out that the conspiracy began in the 1950's and that some plaintiffs had knowledge of the conspiracy as early as 1972, B\u0026LE argues that those plaintiffs' claims were barred by the 4-year statute of limitations.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e B\u0026LE also argues that the statute of limitations permits recovery only of damages resulting from \"injury-causing overt acts\" that occurred within the limitations period; therefore, it would follow that the district court misapplied the statute of limitations by not requiring the jury to link damages to specific overt acts.\n\nThe Supreme Court has considered and rejected the argument that, in the context of a defendant's continuing violation of the Sherman Act, the statute of limitations runs from the violation's earliest impact on a plaintiff. Hanover Shoe, Inc. v. United Shoe Machinery Corp., 392 U.S. 481, 502, n.15, 20 L. Ed. 2d 1231, 88 S. Ct. 2224 (1968). In Hanover Shoe, the defendant had initiated an illegal policy in 1912, some forty-three years before the plaintiff sued in 1955. The Court allowed damages within the limitations period, opining:\n\nWe are not dealing with a violation which, if it occurs at all, must occur within some specific and limited time span. Rather, we are dealing with conduct which constituted a continuing violation of the Sherman Act and which inflicted continuing and accumulating harm . . . . Although [the plaintiff] could have sued in 1912 for the injury then being inflicted, it was equally entitled to sue in 1955.\n\nId. (citation omitted). To the extent that the steel companies' continued shipment of ore on Lower Lake Erie resembles the continued rents paid to the defendants in Hanover Shoe, the cases are indistinguishable.\n\nThe main thrust of B\u0026LE's limitations argument has not been to distinguish Hanover Shoe, to which it refers briefly only in its reply brief. Rather, B\u0026LE first argues that another Supreme Court decision, Zenith Radio Corp. v. Hazeltine Research, Inc., 401 U.S. 321, 338-42, 28 L. Ed. 2d 77, 91 S. Ct. 795 (1971), applies. B\u0026LE contends that Zenith generally requires proof that a newly accruing claim be based on an injurious act within the limitations period, then further argues that Zenith allows recovery of only those damages attributable to overt acts occurring within the limitations period. In Zenith, the Court articulated an exception to the general rule that a cause of action accrues each time an act causes an injury. The exception in Zenith was for damages that would be speculative at the time the injury-causing act was committed. Id.\n\nWe have held that an injurious act within the limitations period may serve as a basis for an antitrust suit. Harold Friedman, Inc. v. Thorofare Markets, Inc., 587 F.2d 127, 139 \u0026 n.45 (3d Cir. 1978). In the present matter, the plaintiffs have met their burden of showing that the conspiracy continued into the limitations period. For example, rebuffed efforts to lease dock property from the railroads extended into 1978. Also in that year, the refusal to grant commodity line haul rates from non-railroad docks was still at issue. Coercion to prevent independent action continued into the limitations period. Finally, post-October 1977, dock handling rates charged to discharge ore from self-unloaders remained artificially inflated. The existence of the continued conspiracy thus undermines B\u0026LE's argument that damages within the limitations period were caused \"solely from acts committed by the defendant outside the four-year [limitations] period.\"\n\nB\u0026LE's further argument - that Zenith and its progeny limit recovery to damages resulting \"from injury-causing overt acts\" - has no merit because it fails to recognize, in circumstances such as here, that continuing and accumulating damage may result from intentional, concerted inaction. The purposeful nature of the inaction - here an ongoing refusal to sell or lease - obviously constitutes an injurious act, although perhaps not an overt one in the commonly-understood sense.\n\nB\u0026LE's argument results from an overreading in which B\u0026LE directs a myopic gaze at a general rule not at issue in Zenith :\n\nIn the context of a continuing conspiracy to violate the antitrust laws . . ., each time a plaintiff is injured by an act of the defendants, a cause of action accrues to him to recover the damages caused by that act, and . . . as to those damages, the statute of limitations runs from the commission of the act.\n\nZenith, 401 U.S. at 338. B \u0026LE focuses tightly on the words \"injured by an act . . . caused by that act\" to propose a narrow rule that a plaintiff must tie all damages to specific overt acts within the limitations period.\n\nB\u0026LE's argument obfuscates the difference between, on the one hand, an \"overt act\" necessary to show the existence of a conspiracy, and, on the other hand, an \"injurious act\" causing damages within the limitations period. This argument fails to recognize that certain conspiracies, such as boycotts, operate through inaction. As the district court observed in this case, \"overt acts aren't what cause damage. It is the effectiveness of the overall conspiracy that causes damages.\" App. at 2376.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIndeed, in Poster Exchange, Inc. v. National Screen Service Corp., 517 F.2d 117 (5th Cir. 1975), from which B\u0026LE quotes out of context to support its proposed \"injury causing overt act\" rule, the Court of Appeals for the Fifth Circuit recognized that a conspiracy's refusal to deal, which began outside the limitations period, \"may be viewed as a continuing series of acts upon which successive causes of action may accrue.\" Id. at 125. Far from requiring that the plaintiff tie its damages to specific acts, the court acknowledged that a continuing conspiracy may give rise to \"continually accruing rights of action,\" and the court simply required the plaintiff to support its allegation that the defendant had \"continued during the period in suit to refuse to deal.\" Id. at 128.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nHere, with respect to the statute of limitations, the district court instructed the jury during the liability phase of the trial that \"the plaintiffs would have to establish that the conspiracy was still in effect after October 1977, and that at least one of the conspirators took some overt action in furtherance of the conspiracy after October 13, 1977, and that the particular plaintiff whose case you are considering was damaged after October 13, 1977.\" App. at 4999. While the interrogatories did not require the jury to link the overt act and injury-producing act, as a whole, the requisite findings to defeat a statute of limitations defense were present. Via separate questions, the compilation of the jury's verdicts was that B\u0026LE committed Sherman Act violations within the limitations period which caused injury to most of the plaintiffs. These responses, together with the district court's emphasis on causation in its charge to the jury, see App. at 4784-89, were sufficient to inform the jury that damages must have been caused within the limitations period by an active, injurious conspiracy. As the statute of limitations did not provide a basis to grant B\u0026LE's motion for judgment n.o.v., the district court properly denied the motion.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\n2. State Law - Laches\n\nThe state antitrust claims asserted are governed by the Ohio Valentine Act. The Act expressly provides that \"no statute of limitations shall prevent or be a bar to any suit or proceeding for any violation of [this Act].\" Ohio Rev. Code Ann. § 1331.12 (Anderson 1979 and Supp. 1990). B \u0026LE contends that the steel companies' and Erie's Ohio Valentine Act claims are nonetheless time-barred by the doctrine of laches.\n\nThe district court rejected B\u0026LE's laches contention for three reasons. First, the court held that laches is an equitable defense that had no application under Ohio law to actions at law for damages. Second, the district court held that the liability jury's finding that the defendant railroads took affirmative acts to conceal the conspiracy or conceal any act in furtherance of the conspiracy, precluded the application of laches. Finally, the district court found that B\u0026LE had not demonstrated any significant prejudice attributable to the delay.\n\nWe need not determine whether the law of Ohio permits assertion of a laches defense to antitrust suits\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e or whether the fraudulent concealment claims of the steel companies and Erie should have been submitted to the jury. \"'Delay in asserting a right does not of itself constitute laches, and in order to successfully invoke the equitable doctrine of laches it must be shown that the person for whose benefit the doctrine will operate has been materially prejudiced by the delay of the person asserting his claim.'\" Emrick v. Multicon Builders, Inc., 57 Ohio St. 3d 107, 566 N.E.2d 1189, 1194 (Ohio 1991), quoting Smith v. Smith, 168 Ohio St. 447, 156 N.E.2d 113, 119-20 (Ohio 1954).\n\nThe district court found that B\u0026LE had not shown any significant prejudice attributable to the delay. Unless clearly erroneous, we will not disturb that finding. B\u0026LE contends that it was prejudiced by the death of many critical witnesses and the loss of numerous documents; B\u0026LE, however, details neither the substance of these witnesses' testimony nor the content of lost documents and what they would have revealed concerning its defense against the conspiracy. Given the number of witnesses and documents which were admitted in evidence, it is difficult to see how B\u0026LE was prejudiced by the lack of either of those two components of evidence. We therefore conclude that laches is not a bar to the Valentine Act claims.\n\nSince the plaintiffs have survived the threshold challenges to the legality of the lawsuit, we now address the issues raised concerning the evidence presented at trial and the amount of damages awarded.\n\nD. Sufficiency of Evidence\n\nIn support of its argument that the plaintiffs failed to prove the necessary elements to establish both the fact of antitrust injury and the amount of damages, B \u0026LE submits three reasons for reversal: (1) that unrelated economic factors impacted upon the steel companies' decisions to delay investment in self-unloaders; (2) even if injury was demonstrated, the jury was not instructed nor could it discern from the special verdict questions that a causal connection must be established between the alleged violations and the amount of damages awarded; and (3) the damage models upon which the awards were predicated were either speculative or unrealistic.\n\n1. The Liability Verdict\n\nWhile B\u0026LE advances thought-provoking factual assertions that economic causes other than those connected to illegal antitrust activity made the use of self-unloaders financially unappealing, we are not free to revisit the factual issues other than to determine whether the evidence supports the jury's verdict.\n\nThe district court evaluated the sufficiency question as follows:\n\nThroughout both phases of the trial, the defendant vehemently argued, and sought to prove, that any damages actually sustained by the plaintiffs were attributable to economic factors other than the alleged conspiracy; that the economic studies upon which plaintiffs' damage claims were predicated were unreliable and erroneous; and that the damages claimed were either speculative, grossly exaggerated or non-existent. It is certainly true, in my view at least, that the evidence of damages did not so heavily preponderate in favor of the plaintiffs as to render the jury's verdict a foregone Conclusion. The evidence as a whole did not suffice to remove all reasonable questions concerning the timing and profitability of the charges in ore transport the defendants' conspiracy allegedly delayed.\n\nBut these are all factual issues and were properly submitted to the jury. Viewing the record in the light favorable to the verdict, there can be no doubt that the evidence sufficed, in all respects, to support the jury's determinations.\n\nApp. at 2129.\n\nRelying on our similarly circumscribed review and the deference owing to the trial Judge presiding over this lengthy and complex matter, we agree that the evidence sufficed to establish liability. We have discussed, in the context of other issues presented here, the persuasive evidence against B\u0026LE documenting anticompetitive behavior violative of the antitrust laws. The presence of contrary evidence does not eradicate the probative worth of the plaintiff's case. The jury heard all the evidence and rendered a verdict, in most part, favorable to the plaintiffs. Unless the evidence is critically deficient as to the prevailing party's side so that no reasonable jury could grant it relief, we will affirm the district court's denial of the motion. Kinnel v. Mid-Atlantic Mausoleums, Inc., 850 F.2d 958, 961-62 (3d Cir. 1988).\n\nOur review of the record more than satisfies us that the jury's verdicts for the plaintiffs were bolstered by sufficient evidence. Documents from the railroads' files establish their agreement to prevent the steel companies from utilizing the self-unloader transportation alternative. Specifically, memos and letters chronicled cancellation of railroad services from non-railroad docks, denial of competitive rates for inland rail transport from private docks, and refusal to sell or lease dock properties - all aimed toward precluding entry of the plaintiffs into the ore transport business. Also documented were the railroads' refusal to accept self-unloaders at their docks and their assessment of the same rates for bulkers and self-unloaders, regardless of the difference in services performed.\n\nAt trial, steel company officials testified concerning their interest in investing in the more cost-effective self-unloaders but that they were discouraged from doing so by the railroads' refusal to alter their rates to make the system economical. In addition, expert economic testimony offered by the plaintiffs concluded that the railroad conspiracy, delaying the utilization of the self-unloader/private dock system, caused the steel companies to pay more to transport iron ore to its facilities.\n\nAccordingly, as to the claim of insufficiency of the evidence, the district court did not err in refusing to grant B\u0026LE's motion for judgment n.o.v.\n\n2. The Antitrust Claims of the Erie Plaintiffs\n\nB\u0026LE contends that the Erie plaintiffs' damages, traceable to an alleged refusal by Penn Central to sell dock property to Erie, were caused by Erie's own financial disability and not by railroad misconduct. Once again, this is a point argued during trial which the jury heard and disregarded.\n\nWe have reviewed the record and find that the quantum of evidence needed to uphold this award is present. A former member of the Erie Port Commission testified that the sale of the dock property was unacceptable to it because it included a restriction on the handling of iron ore. When Penn Central offered to remove the restrictions in exchange for an approximately 40 percent increase in the selling price, the Commission deemed the sale uneconomical. In contrast, the documentary evidence which B\u0026LE asserted demonstrated that the sale failed because of a funding shortfall was, at best, equivocal. The damages award granted on this basis will not be disturbed.\n\n3. The Jury Instructions and Special Verdict Questions\n\nB\u0026LE asserts that only a retrial can cure the prejudicial windfall to the plaintiffs resulting from the district court's failure to provide the jury with proper guidance. According to B\u0026LE, the jury was never told to limit the plaintiffs' monetary recovery to amounts directly related to the defendants' illegal activity.\n\nB\u0026LE is correct when it asserts that one pursuing antitrust recovery must establish that the damages suffered were caused by the defendant's participation in a scheme repugnant to the antitrust laws. Brunswick Corp. v. Pueblo Bowl-O-Mat, Inc., 429 U.S. 477, 50 L. Ed. 2d 701, 97 S. Ct. 690 (1977). Once causation is determined, however, the actual amount of damages may result from a \"reasonable estimate, as long as the jury verdict is not the product of speculation or guess work.\" MCI Communications Corp. v. American Tel. \u0026 Tel. Co., 708 F.2d 1081, 1161 (7th Cir. 1983), citing J. Truett Payne, Inc. v. Chrysler Motors Corp., 451 U.S. 557, 566-67, 68 L. Ed. 2d 442, 101 S. Ct. 1923 (1981); Zenith Radio Corp. v. Hazeltine Research, Inc., 395 U.S. 100, 123-24, 23 L. Ed. 2d 129, 89 S. Ct. 1562 (1969). The Supreme Court, in its decisions of Continental Ore Co. v. Union Carbide \u0026 Carbon Corp., 370 U.S. 690, 699, 8 L. Ed. 2d 777, 82 S. Ct. 1404 (1962) and Story Parchment Co. v. Paterson Parchment Paper Co., 282 U.S. 555, 75 L. Ed. 544 , 51 S. Ct. 248 (1931), did not impose stringent proof requirements regarding the damages alleged in the injury-causing acts. It was emphasized, however, in Bigelow v. RKO Radio Pictures, 327 U.S. 251, 264-65, 90 L. Ed. 652, 66 S. Ct. 574 (1946), that antitrust recovery can constitute compensation for only those damages directly caused by unlawful competition. The relaxed measure of proof is afforded to the amount, not the causation of loss - the nexus between the defendant's illegal activity and the injuries suffered must be reasonably proven. MCI Communications, 708 F.2d at 1081.\n\nWe overturned a jury verdict when review of the evidence showed that a damage award was partially based on legally-permitted competition by the defendant, Coleman Motor Co. v. Chrysler Motors Corp., 525 F.2d 1338 (3d Cir. 1975), but similar considerations are not operable here. The damages awarded here were not attributable, in any extent, to lawful railroad activity. Rather, B\u0026LE asserts that outside economic factors, totally unrelated to its industry, made investment in self-unloader technology unattractive. And, forming the focus of B\u0026LE's challenge, the jury instruction and special interrogatories were inadequate to convey to the jury the importance of the link of causation to damages.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nTo the contrary, the instruction to the damages jury explained the proper focus of the jury's deliberation - how damages were to be calculated, how to evaluate the evidence and the ways in which the parties disagreed on the method of calculation of damages.\n\nWhat is required, and the burden is upon the plaintiff, is to provide you with a reasonable estimate of their damages, what your regard as a reasonably reliable estimate. You are not permitted to simply guess or speculate or pull figures out of the air. You have to have a rationale, reasonable basis for supposing the damages' figure that you come up with is a reasonable estimate, a fair estimate of the probable loss sustained by the plaintiffs. To the extent that you find that any money was lost because of general conditions in the steel industry not attributable to this conspiracy and so forth, you should, of course, not include any such sums in your calculation of damages . . . there should not be any overlapping or duplication of damages.\n\nApp. at 6377.\n\nThe jurors could deduce from the charge that they were to divorce from their deliberations any non-conspiratorial activity. Because the language conveyed this clearly, the challenge to the instruction fails.\n\nConcerning the specificity of the interrogatories, we must determine whether the district court abused its discretion in their formulation. McNally v. National Ins. Co., 815 F.2d 254 (3d Cir. 1987). The interrogatories are adequate if they will determine the facts essential to the judgment. Kornicki v. Calmar S.S. Corp., 460 F.2d 1134, 1139 (3d Cir. 1972).\n\nOur review shows that the questions sent to the jury here met that criteria. There was no abuse of discretion calling for a new trial.\n\n4. The Damage Models\n\nB\u0026LE next points to the models designed by the plaintiffs to assess damage and characterizes them as overspeculative and in conflict with the economic realities of the time. As with its sufficiency of evidence causation claim, B\u0026LE was given the opportunity to confront the plaintiff's evidence, aggressively seized upon the opportunity to do so and presented its own version of the extent of damages to the jury.\n\nOur review of the record convinces us that the jury's verdict in the plaintiffs' favor is fully supported. The district court did not err in refusing to award a new trial on the damages issue.\n\nE. Post-Judgment Interest\n\nThe last issue we address on B \u0026LE's appeal is the date from which post-judgment interest should be calculated. 28 U.S.C. § 1961, the governing statute, reads in relevant part:\n\n§ 1961. Interest\n\n(a) Interest shall be allowed on any money judgment in a civil case recovered in a district court. . . . Such interest shall be calculated from the date of the entry of judgment . . . .\n\nWith the statute in mind, we examine, under plenary review, the order of events here.\n\nOn April 19, 1989, the district court, in Pre-Trial Order No. 49, determined that \"all claims against the defendant Penn Central Corporation are dismissed.\" App. at 1430. On July 18, 1989, the damages jury returned its verdict against B\u0026LE in favor of the plaintiffs. On July 20, 1989, the court ordered judgment on the jury's verdict.\n\nOn August 2, 1989, B\u0026LE moved for judgment n.o.v. and on February 27, 1991, the district court issued its opinion and orders on post-trial motions.\n\nOn March 5, 1991, B\u0026LE filed a supplemental motion to correct the final judgment to substitute July 19, 1989 for July 18, 1989 as the date of final judgment and the date from which interest accrues. The court responded to the motion and amended its order to reflect that interest on the judgment runs from July 19, rather than July 18, 1989.\n\nOn March 28, 1991, B\u0026LE filed its notices of appeal. Amended notices of appeal were filed on March 29, 1991. Then, on June 17, 1991, the district court re-entered judgment in favor of the appellees/cross-appellants against B\u0026LE in accordance with its order on post-trial motions. At this time, the court also entered judgment in favor of the defendant Penn Central Corporation.\n\nIn response, on July 15, 1991, B\u0026LE filed a supplemental motion to amend the judgment, contending that post-judgment interest should not run from July 19, 1989 as previously requested but rather from June 17, 1991, when the trial court for the first time entered the final judgment in this complex matter - the order in favor of Penn Central against plaintiffs. App. at 2205.\n\nWe conclude that July 19, 1989 - the date upon which judgment was entered in favor of the plaintiffs and against B\u0026LE - is the appropriate date from which post-judgment interest should run. In Kaiser Aluminum \u0026 Chemical Corp. v. Bonjorno, 494 U.S. 827, 108 L. Ed. 2d 842, 110 S. Ct. 1570 (1990), the Supreme Court identified the purpose of post-judgment interest as the successful plaintiff's compensation for the loss between determination of damages and payment by the defendant. Id. at 835-36; 28 U.S.C. § 1961. The statute does not, by its terms, mandate that the judgment from which interest is calculated must be a final judgment. Our view is consistent with the statute's philosophy of providing compensation from a point at which the loss-causing defendant's liability is entered on record.\n\nHere, judgment against the loss-causing defendant, B\u0026LE, was entered on July 19, 1989. The subsequent \"housekeeping\" entry, dismissing finally the plaintiffs' claims against Penn Central, was completely divorced from a determination of the prevailing plaintiffs' loss. While concerns of finality and appealability might be implicated by the eventual entry of judgment against Penn Central, the statute's purpose in awarding post-judgment interest was satisfied when judgment was entered against B\u0026LE in July of 1989.\n\nWe turn now to the issues raised in the cross-appeals.\n\nIII. The Cross-Appeals\n\nA. Fraudulent Concealment - The Steel Companies\n\nTo surmount the four year statute of limitations hurdle which would preclude recovery for pre-October 1977 damages, the steel companies claimed that the statute was tolled because the railroads fraudulently concealed the conspiracy.\n\nIn Pretrial Order 49, the district court granted summary judgment for B\u0026LE on the steel companies' fraudulent concealment assertion. The court ruled:\n\nThe steel company plaintiffs are precluded from recovering damages sustained more than four years before the respective complaints in this action were filed. Not only did they plainly have knowledge of facts which should have reasonably made them aware of a basis for asserting the very claims now being asserted, but it is also clear that they were specifically being urged to support an antitrust suit by Pinney Dock -- at least as early as 1972, and more than four years before the criminal indictment.\n\nApp. at 1427-28.\n\nAt a subsequent pretrial argument, the steel companies challenged the entry of summary judgment referring, as one basis, to the statement of the court regarding Pinney's request to the steel companies to support Pinney's antitrust cause of action. The steel companies disputed first, that Pinney was soliciting support for an antitrust lawsuit and, second, that each steel company was an individual recipient of Pinney's petition for participation. The court replied:\n\nWell there was a slight misunderstatement [sic] I agree. They were asked to support an application to the ICC. And certainly from the standpoint of Pinney it was also Pinney's knowledge that it was considering an antitrust action, and this would be the first step before it.\n\nI agree there is nothing in some instances at least to suggest that they were requested to support an antitrust action.\n\nThe important thing is, however, that they were certainly aware of what the railroads' policies had been.\n\nApp. at 2321 (emphasis added). The court did not substantively respond to the challenge to the lack of evidence that some steel companies (National, Republic and Sharon), were even approached by Pinney.\n\nOn review, we apply the same test that district courts employ in summary judgment matters. The facts must be viewed favorably to the non-movant, B\u0026LE. If there is no disputed question of material fact, and B\u0026LE is entitled to judgment as a matter of law, then summary judgment will be affirmed.\n\nThe steel companies contend that because twenty-eight of its officials testified at trial that they had neither knowledge nor suspicion of the conspiracy, the question of fraudulent concealment was not factually foreclosed and should have been submitted to the jury.\n\nWe have not specifically elucidated the standards for pleading fraudulent concealment in the antitrust context. However, in a case decided under Pennsylvania law, Bohus v. Beloff, 950 F.2d 919 (3d Cir. 1991), we identified the three factors necessary to forestall the running of the limitations statute by way of a fraudulent concealment allegation: (1) an affirmative act of concealment; (2) which misleads or relaxes the plaintiff's inquiry, who (3) exercised due diligence in investigating his cause of action. Id. at 925-26.\n\nThe Court of Appeals for the Sixth Circuit directly addressed the issue of the tolling of antitrust claims by fraudulent concealment in Dayco Corp. v. Goodyear Tire \u0026 Rubber Co., 523 F.2d 389 (6th Cir. 1975). Holding that the exercise of due diligence is required in antitrust cases to employ the fraudulent concealment doctrine to avoid bar of the statute of limitations, the court referred to the requirement for the defense set out by the Supreme Court many years ago in Wood v. Carpenter, 101 U.S. 135, 25 L. Ed. 807 (1879):\n\nAny fact that should excite his suspicion is the same as actual knowledge of his entire claim. Indeed, the means of knowledge are the same thing in effect as knowledge itself. 101 U.S. at 143. If the plaintiff has delayed beyond the limitations period, he must fully plead the facts and circumstances surrounding his belated discovery and the delay which has occurred and must be shown to be consistent with requisite diligence.\n\n523 F.2d at 394.\n\nThe Sixth Circuit revisited the issue of fraudulent concealment in the Pinney Dock case. There, the court rejected the defense because the antitrust causes of action \"were nonetheless discovered or could with reasonable diligence have been discovered notwithstanding such a concealment and well within the appropriate time for commencing such actions.\" 838 F.2d at 1483.\n\nGiven our precedent in Boh us, we agree with the Court of Appeals for the Sixth Circuit that the exercise of due diligence must be shown in the antitrust context. The steel companies, who have the burden of proof, see Pinney Dock, 838 F.2d at 1465 (plaintiff has burden of proving fraudulent concealment elements), have identified areas of factual dispute concerning their ignorance of the railroads' sub rosa rate-setting activity and anti-competitive non-rate actions. But these assertions did not include evidence of due diligence. Given the scope of the steel companies' knowledge of publicized railroad rate-making decisions - the same rates charged for handling self unloaders as bulkers and the refusal to grant commodity line haul rates from private docks - we find that the steel companies have failed to satisfy the diligence component of the defense. What the steel companies did know about the railroads' rate-making should reasonably have made them aware of a basis for asserting the very claims now being raised. The district court properly granted summary judgment for B \u0026LE on this issue.\n\nB. Waiver - National Steel\n\nLike the other steel company plaintiffs, National Steel sought recovery under federal and state antitrust laws for damages resulting from B \u0026LE's participation in the conspiracy to delay the introduction of the self-unloader/private dock system. Setting National Steel apart from the other steel company plaintiffs is the fact that National Steel owned and operated its own fleet of vessels for the transportation of iron ore. National Steel's established proprietary interest in vessels, in particular the self-unloader, the Stinson, gave rise to National Steel's additional claim for damages - that, absent the conspiracy, National Steel would have built the Stinson earlier and at a lower cost.\n\nThe liability jury found that the conspiracy caused injury to National Steel resulting from \"foreclosure and or delay in the utilization of self-unloading vessels for the delivery of iron ore\" and \"the ability to fully use private docks to handle iron ore.\" App. at 1894. At the damages phase of the trial, National Steel's expert witness testified that National Steel would have purchased the Stinson in 1972 instead of 1974, which would have resulted in a significant cost savings.\n\nB\u0026LE moved for a directed verdict at the Conclusion of the damages phase of the trial, alleging that National Steel failed to present evidence from which the jury could reasonably calculate damages, that its evidence rested on false assumptions and ignored significant contributing factors to its alleged injuries, and that B\u0026LE's expert damages witnesses demonstrated the inadequacy and unreasonableness of National Steel's allegation. App. at 2037-38. The district court denied B\u0026LE's motion.\n\nThe damages jury determined that the cost savings to which National Steel was entitled amounted to $16,700,000, portions of which were trebled under federal law and doubled under Ohio state law, for a total award of $39,700,000.\n\nIn its judgment n.o.v. opinion, the district court determined that B\u0026LE had properly preserved the issue concerning the amounts awarded to National and concluded that the jury's cost savings verdict was impermissible, reasoning that the cost savings damages reflected only the impact of inflation, an aspect of monetary damage not recoverable under the relevant antitrust laws. Granting B\u0026LE's motion for judgment n.o.v., the court elaborated its rationale:\n\nNational did eventually invest in self-unloader vessels. It claimed that the vessels cost more to build than would have been the case if they had been constructed earlier. The inescapable Conclusion, however, is that the difference in costs reflects merely the impact of inflation, presumably offset by the time value of money, and not an actual loss to the plaintiff.\n\nApp. at 2108-09.\n\nNational Steel cross-appealed on two grounds. First, National Steel claims that by asserting only a general objection to the evidence of damages in its directed verdict motion, B\u0026LE waived its right to argue that the award of cost savings damages was not cognizable under the antitrust laws. Second, even if the argument was properly preserved, National Steel argues that the additional amount paid for the Stinson was legally recoverable as actual damages resulting from B\u0026LE's conduct and that the jury's verdict was rationally based on the expert testimony presented by National Steel.\n\nWe need not decide the merits issue because we conclude that B\u0026LE has not preserved its argument in accordance with our decision in Bonjorno v. Kaiser Aluminum \u0026 Chemical Corp., 752 F.2d 802, 814-15 (3d Cir. 1984). In Bonjorno, the district court granted judgment n.o.v. in an antitrust action concluding that damages for diminution of \"going concern\" value were not recoverable. We reversed because the defendant only challenged damages generally and failed to raise that specific reason in its motion for a directed verdict. 752 F.2d at 814-15. We explained that the \"specific grounds for a JNOV must be asserted in the motion for a directed verdict,\" 752 F.2d at 814, citing Abraham v. Pekarski, 728 F.2d 167, 172 (3d Cir.), cert. denied, 467 U.S. 1242, 82 L. Ed. 2d 822, 104 S. Ct. 3513 (1984), and the lack of specificity on a particular issue will defeat a motion for judgment n.o.v. on that ground. Id. This requirement affords the non-moving party a chance to respond with additional evidence, and avoids infringement of the non-moving party's Seventh Amendment rights. Id., citing Lowenstein v. Pepsi-Cola Bottling Co., 536 F.2d 9, 11 (3d Cir.), cert. denied, 429 U.S. 966, 50 L. Ed. 2d 334, 97 S. Ct. 396 (1976).\n\nWhile B\u0026LE contends that its directed verdict motion explicitly contested the inclusion of inflation as a component of damages, B\u0026LE additionally argues that, by the content of the trial, National Steel was put on notice that there was a challenge to National Steel's recovery for cost savings resulting from the delayed construction of the Stinson.\n\nWe disagree with B\u0026LE's assertions. First, the portion of the directed verdict mounting a challenge to the damages claims of all plaintiffs did not confront National Steel's cost savings damages claim with the required specificity such as would have alerted National Steel that B\u0026LE was contesting damages attributed solely to inflation. National Steel argued that such notice would have prompted it to develop an alternative theory of recovery, and to introduce evidence that the timing of the construction of the self-unloader exposed National Steel to increased competition in the building of these vessels, and hence diminished its profit. We believe that the lack of opportunity to present additional evidence, followed by a grant of judgment n.o.v., is tantamount to the trial court deciding an issue already submitted to and deliberated on by the jury which compromises the non-moving parties' right to a fair trial. Bonjorno, 752 F.2d at 814.\n\nSecond, we do not credit B\u0026LE's assertion that, during the course of the trial, it was challenging National Steel's recovery as representing only inflation. We have reviewed the record references and do not find that the evidence cited would have put National Steel on guard that its proof of damages was inadequate. By our reading, the questioning at trial concerned whether National Steel's expert computed a deduction for the use of equity; that is, because National Steel did not invest in the self-unloader, it had additional cash to invest elsewhere. This other investment and its return, argued B\u0026LE, should have been deducted from the figure representing the amount suffered because National Steel did not buy the self-unloading vessel earlier. This challenge to the evidence is not specific as to how inflation factored into the calculations nor does it even mention inflation as a disputed element.\n\nWe conclude that B\u0026LE failed to preserve, in its motion for a directed verdict, the ground upon which the district court relied to grant judgment n.o.v. in B\u0026LE's favor. The district court was, thus, without authority to decide the merits of the issue and the judgment abrogating the award of damages to National Steel will be reversed.\n\nC. Prejudgment Interest - The Steel and Dock Companies\n\nUnder Ohio law, the prevailing party may recover prejudgment interest if the losing party failed to make a good- faith effort to settle the case. Ohio Rev. Code Ann. § 1343.03(C) (Anderson 1979 and Supp. 1990). This includes consideration of whether a party rationally evaluated its risks and potential liability and whether a good faith monetary settlement offer or response to an offer by the other party occurred. Kalain v. Smith, 25 Ohio St. 3d 157, 495 N.E.2d 572, 574 (Ohio 1986). If a party has a good faith, objectively reasonable belief that liability does not exist, the party does not need to offer a cash settlement in order to avoid prejudgment interest liability in the event it does not prevail. Id.\n\nThe district court refused to award prejudgment interest on the plaintiffs' Ohio Valentine Act judgments because it found that B\u0026LE's refusal to settle the case was based on the reasonable belief that it was without liability to the plaintiffs.\n\nThe plaintiffs contend that B\u0026LE's plea of nolo contendere in its criminal prosecution and the substantial settlements by co-conspirators evidence B\u0026LE's lack of a good faith, objectively reasonable belief that it was not liable. In light of this, B\u0026LE's repeated refusals to engage in settlement negotiations were in bad faith and thus subject B\u0026LE to liability for prejudgment interest. The plaintiffs refer to several settlement overtures which they offered both pre-trial and after the liability verdict which B\u0026LE declined to pursue. Although B\u0026LE did make a settlement proposal during the second day of the damages trial deliberations, plaintiffs classified the offer as grossly inadequate because it was far exceeded by the then current toll of attorney's fees.\n\nWe review the district court's decision whether to grant prejudgment interest for abuse of discretion. Given the difficulty in resolving many of the legal issues presented here, we agree with the district court that B\u0026LE had a reasonable expectation that it would not be liable to the plaintiffs. We thus conclude that the district court did not abuse its discretion in failing to award prejudgment interest under Ohio law.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nD. The Seventh Amendment Right to a Fair Trial - The Wills Affiliates\n\nDespite a finding of antitrust liability in favor of the Wills affiliates, the damages jury awarded them only nominal damages. Wills asserts that this award results from the trial court's failure to confine the second trial to a calculation of the amount of damage sustained. Instead, complains Wills, B\u0026LE was permitted to retry its liability defense. Because causation elements re-entered the damage phase of the trial, Wills contends that its Seventh Amendment right to a fair trial was violated. We exercise plenary review when constitutional questions are presented on appeal.\n\nSeventh Amendment problems are inherent when separate juries determine fact of damage and amount of damages. According to the Supreme Court, bifurcated trials are permitted only if the separate issues are so distinct that a trial of one without the other may be had without inJustice. Gasoline Products Co. v. Champlin Refining Co., 283 U.S. 494, 500, 75 L. Ed. 1188, 51 S. Ct. 513 (1931). If \"the question of damages . . . is so interwoven with that of liability that the former cannot be submitted to the jury independently of the latter without confusion and uncertainty, [this] would amount to a denial of a fair trial.\" Id.\n\nAlthough we have not, in a majority opinion, discussed the Seventh Amendment dilemma posed by bifurcation of an antitrust case, the constitutional concerns have been recognized by our colleagues. See Bonjorno v. Kaiser Aluminum, 752 F.2d at 816 (\"Bifurcation of trial resulting in different juries determining liability and damages raises serious questions under the standard set forth by the Supreme Court in Gasoline Products. . . .\") (Statement of Adams, J., sur denial of the petition for rehearing en banc.) Also, in Link v. Mercedes-Benz, 550 F.2d 860, 875, the Dissenting Judge rendered this prescient opinion:\n\nAdmittedly, in an action under § 4 the task of defining which issues are so separate and distinct as to satisfy the test of Gasoline Products is complex. Since liability under § 4 necessarily includes proof of injury to business and property, bifurcation to separate juries of liability and damages in a § 4 case inevitability introduces the possibility that in the liability phase the first jury might find that there was such injury, while the second jury might on the same evidence of injury in the damage phase, find none.\n\nId. (Gibbons, J., Dissenting).\n\nThis articulated possibility became reality here.\n\nDuring the liability phase of the trial, Wills presented evidence to show that its attempts to purchase dock facilities to accommodate self-unloading vessels were continually thwarted by the railroad conspiracy. To demonstrate injury to its business, Wills contended that had it been able to acquire the necessary dock space, its companies would have handled the iron ore unloading and land transport needs of Armco Steel. This loss of Armco's business was the sole evidence of property injury to Wills. Thus, Wills' claims were tied to its ability to serve a specific customer and it was required to show, during the liability phase, that Armco would have used its dock and truck service. This basis of liability was vigorously challenged by B\u0026LE who attempted to show that Armco would not have utilized Wills' services to the extent alleged, if at all.\n\nThe liability jury was instructed that to find for all plaintiffs here they must determine that:\n\nThe particular plaintiff . . . was genuinely interested in doing it, it requested the transaction, and was financially able to carry it out . . . . You can't claim to have been damaged unless you were genuinely damaged, and you can't be genuinely damaged unless if the [private docks]\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e had been willing and would have been in a position and would have carried through with the project.\n\nApp. at 4998.\n\nAfter hearing the evidence and the instruction, the liability jury answered \"yes\" to the following questions concerning B\u0026LE's antitrust liability to Wills:\n\nWas the agreement, combination or conspiracy a material cause of any injury to the business or property of Wills' Dock Company (Toledo World Terminals, Inc. and its predecessors, Consolidated Dock, Inc. and Consolidated Dock \u0026 Storage, Inc.)?\n\nDid the injury result from:\n\nacts in furtherance of the conspiracy, including the refusal to sell or lease dock properties or the refusal to lease or sell dock properties without restrictions, to prevent Wills from engaging in an iron ore business at Toledo, Ohio?\n\nWas the agreement, combination or conspiracy a material cause of any injury to the business or property of Wills Trucking, Inc. because it was unable to provide a trucking service in combination with Wills' dock service?\n\nApp. at 1900.\n\nSince the jury found that Wills had suffered damage to its property by the conspiracy, in order not to violate the Seventh Amendment, the role of the second jury should have been limited to determining the amount of damages Wills incurred from acts taken in furtherance of the conspiracy. Nonetheless the Seventh Amendment prohibition against reexamination of the issue of fact of damage was compromised soon after the damages jury was empaneled. Upon seating the jury, the district court informed it that \"the defendant will be entitled to defense on the ground that these damages have not been established or that any damages that they might have suffered stem from causes other than the antitrust conspiracy claim.\" App. at 5113-14 (emphasis added). This comment, although not starkly objectionable, set the tone for the overlap of causation questions which the damages jury was permitted to hear.\n\nDuring the course of the damages trials, Wills offered evidence necessary to calculate damages under a lost profits theory. B\u0026LE's key defense witness on damages was Dr. H. W. Pifer, who was also B\u0026LE's primary witness during the liability phase. At the damages trial, Dr. Pifer began to discuss documents relevant to events dated in the mid-1950's, before any plaintiff's damage period began. The court denied an objection to the entry of this evidence. Dr. Pifer then cited to exhibits indicative of potential causes for the plaintiff's damage other than the antitrust conspiracy. At this point the plaintiffs were granted a continuing objection to the use of testimony and documents relevant to causation and fact of damage issues. When the objection was raised, the court responded, \"I am not so sure it is limited to impact. Objection overruled. It conceivably might have something to do with the amount.\" App. at 6041.\n\nAfter further testimony by Dr. Pifer, the plaintiffs moved for a mistrial or, in the alternative, to strike the testimony of Dr. Pifer because of its direct contradiction to what the prior jury had held. The court, in overruling the objection and denying the mistrial, stated that he would \"straighten it out in the charge of the court.\" App. at 6078.\n\nHowever, as the following excerpts reveal, the subsequent charge to the jury could not be construed as curative:\n\nIn an antitrust conspiracy case, the law is that each member of the conspiracy is equally responsible for all the damages caused by the entire conspiracy. So that it is not necessary for the plaintiffs to have shown that the Bessemer \u0026 Lake Erie Railroad Company in and of itself caused each and every element of damage that is claimed. All that they had to show was that they were injured as a result of the antitrust conspiracy of which it has been established that the Bessemer \u0026 Lake Erie Railroad Company was an active participant.\n\nApp. 6355 (emphasis added). And later,\n\nNow, with respect to the claims of the dock company plaintiffs, the issue is relatively straightforward at least in theory. If they were deprived of the chance to handle iron ore at their private docks, they were deprived of the chance to get into the private dock business for handling iron ore, the question is: When would they have gotten into that business? How much tonnage would they have handled? And what would have been their profit on the tonnage they would have handled?\n\nApp. at 6367. Finally, as to nominal damages:\n\nNow, I mentioned in passing, but I will recapitulate, that the burden of proof is on the plaintiffs in any case which the plaintiffs are seeking to recover damages. But once the plaintiffs have established that they did suffer an injury, it is not encumbent upon the plaintiffs to show their damages with mathematical certainty.\n\nIn any case such as this where you are trying to reconstruct what would have happened in the absence of a conspiracy, it is obviously beyond human possibility to know for certain exactly what would have happened. What we are trying to do here is reconstruct in our minds a hypothetical world which would have existed in the absence of this suppression of competition.\n\nIn that situation the law says the plaintiff who has shown injury is not to be faulted because of the inability to prove damages with mathematical precision or with any very great degree of certainty.\n\nWhat is required, and the burden is upon the plaintiffs, is to provide you with a reasonable estimate of their damages, what you regard as a reasonably reliable estimate. . . . If you conclude that the plaintiffs have not established a reasonably sound basis on which you can make a rational estimate that is satisfactory to you, you would have the right to say they haven't proven their damages. In that case you would award only nominal damages, a dollar.\n\nApp. at 6375-77.\n\nThe instructions given concerning the function of the jury at this juncture were confusing. Taken as a whole, and in combination with the court's opening statement and the liability-type evidence which was introduced during the damage phase, the jury could have easily understood that they were to consider causation. Of particular concern is the court's statement that \"all that they had to show was that they were injured as a result of the antitrust conspiracy.\" Although the past tense utilized might indicate that the court was describing the necessary proof in the first trial, since that was not spelled out, the opposite interpretation is just as easily understood - that the plaintiffs were now required to show injury resulting from the antitrust conspiracy. We point also to the language of the court when it explained to the jury how it should determine dock company damages. The district court stated that if the plaintiffs were deprived of the chance to handle iron ore at their private docks, then the jury should proceed to answer further questions. Once again, causation considerations were put before the jury.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nFinally, the award of nominal damages to Wills can only be understood if the jury considered causation. The sole injury alleged by Wills was its inability to acquire a private dock and to truck ore for Armco Steel. For the liability jury to return a verdict in its favor can only mean that Wills proved that it was injured, to some extent, by the preclusion from handling Armco's business. The first jury heard both the plaintiffs' case and the defense's evidence concerning the prospects of Wills to serve Armco's transport needs and found in favor of Wills. It impliedly found that, by virtue of the conspiracy, Wills was precluded from making profits by handling at least some of Armco Steel's iron ore. Nominal damages are appropriate only when plaintiffs are unable to prove any amount of damages and are not properly awarded when a plaintiff, like Wills, has established a quantifiable loss of revenue. While Wills' calculations as to the quantity of ore it would have handled and the amount of potential profit were certainly challengeable in the damage phase, an award of nominal damages was simply inappropriate.\n\nWe note a similarity to our decision in Rea v. Ford Motor Co., 497 F.2d 577 (3d Cir.), cert. denied, 419 U.S. 868, 42 L. Ed. 2d 106, 95 S. Ct. 126 (1974). In Rea, an antitrust defendant argued that the trial court erred when at a retrial for damages it refused to allow one defendant to introduce evidence that its acts were not the cause of the plaintiff's injury. We rejected the defendant's contention that these elements of causation were really damages issues. \"Causation is an element of liability. Our remand left open only the amount of damages, not the fact of damage.\" Id. at 577.\n\nThe admonition of Rea against retrial of causation issues in a damages trial was violated here. Even B\u0026LE does not dispute that it put before the jury facts tending to disprove that its conspiratorial actions were the cause of Wills' injury. This is a clear violation of the Seventh Amendment.\n\nWe therefore reverse the order of the district court denying Wills' Seventh Amendment claim and order a retrial of Wills' damage phase case. Because we are reversing on legal grounds, we need not address the other issue raised by Wills - that a new trial is mandated by allegedly objectionable remarks concerning causation presented by defense counsel to the jury during the damages trial.\n\nIV.\n\nAt the outset of this opinion, we stated our substantial affirmation of the order of the district court. We conclude here with grateful acknowledgment of the district court's careful analysis and profound scholarship in shepherding the parties and issues through the complexities of the lawsuit.\n\nWe will, therefore, affirm all but two aspects of the order of the district court. We will reverse the grant of judgment n.o.v. against National Steel and remand for entry of judgment in its favor. We will also reverse the denial of the Wills' post-trial motions and remand for a new trial limited to a calculation of damages.\n\n\u003cspan class=\"fn\"\u003e1. The steel company plaintiffs are Republic Steel Corporation, Jones \u0026 Laughlin Steel Incorporated (which includes Youngstown Sheet and Tube Company), National Steel Corporation, Wheeling-Pittsburgh Steel Corporation and Sharon Steel Corporation. The dock company plaintiffs are Erie-Western Pennsylvania Port Authority and Codan Corporation (Erie), Toledo World Terminal, Inc., and David W. Reaney and Reaney Dock Company. The trucking company plaintiffs are Wills Trucking, Inc., Tauro Brothers Trucking Company, and C.D. Ambrosia Trucking Company. Toledo World and Wills Trucking are corporate affiliates and will be referred to as the Wills plaintiffs. When the action commenced, the railroad companies named as defendants were the Bessemer and Lake Erie Railroad Company, (\"B\u0026LE\"), Chesapeake and Ohio Railway Company, Baltimore and Ohio Railroad Company, CSX Corporation, Pittsburgh and Lake Erie Railroad Company, Consolidated Rail Corporation, Norfolk and Western Railway Company, Norfolk Southern Corporation, Penn Central Transportation Company and Penn Central Corporation. The claims against all of the defendants, except B\u0026LE, were settled or dismissed before or during trial, leaving B\u0026LE as the sole defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Interstate Commerce Act was originally enacted in 1887 and was codified and recodified with little change until its substantial revision in 1980 by the Railroad Revitalization and Regulatory Reform Act and the Staggers Rail Act. These changes are not implicated here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. According to one commentator, secret price fixing and retaliation against carriers exercising independent action were not unusual in the 1960s and 1970s, yet the ICC was apparently unaware of such activity until government and private antitrust lawsuits focused upon the problem. Dissatisfaction with the ICC's overall performance led to the 1980 enactment of the Staggers Rail Act which substantially deregulated rail and motor transportation. The legislation endorsed greater competition as the best way to stimulate transportation industry development, accomplished by circumscribing the immunity of a rate bureau's activities and by substantially removing from the ICC its rate setting function. This 1980 statute did not specifically overrule Keogh, but significantly undermines its central rationale. See William Eskridge, Jr., Overruling Statutory Precedents, 76 Geo. L.J. 1361 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. National Steel, which invested in and operated its own self-unloading vessel, was a competitor, not a customer of the railroads. Thus, as to the various immunity issues, it stands in the shoes of the dock and trucking companies and not the steel companies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The district court elsewhere described these claims in terms of damages resulting from the defendants' conduct as: damages directly resulting from defendants' elimination of competitive non-railroad dock facilities from the market of providing unloading and trans-shipment services to plaintiffs . . . [and] damages directly resulting from the defendants' elimination of competition from trucking in the market of inland transportation services to plaintiffs. App. at 372.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. B\u0026LE contends that the Supreme Court applied Keogh to bar suits by a competitor in Georgia v. Pennsylvania Railroad Company, 324 U.S. 439, 89 L. Ed. 1051, 65 S. Ct. 716 (1945). In that case, the state of Georgia alleged that the defendant railroads had \"fixed arbitrary and non-competitive rates and charges for transportation of freight by railroad to and from Georgia so as to prefer the ports of other states over the ports of Georgia.\" Id. at 443. Georgia sued both in its parens patriae capacity and as owner of a railroad and other public institutions. Id. at 447. Although Georgia's ownership of a railroad placed it in competition with the defendants, the court clearly focused on Georgia's parens patriae claim and treated the injury to the state as proprietor merely as \"make weight.\" Id. at 450. In dismissing Georgia's claims for antitrust damages, the Court held: We think it is clear from the Keogh case alone that Georgia may not recover damages even if the conspiracy alleged were shown to exist. . . . The [Keogh] Court held . . . the legal rights of a shipper against a carrier in respect to a rate are to be measured by the published tariff. That rate until suspended or set aside was for all purposes the legal rate as between shipper and carrier and may not be varied or enlarged either by the contract or tort of the carrier. And it added: \"This stringent rule prevails, because otherwise the paramount purpose of Congress -- prevention of unjust discrimination -- might be defeated. If a shipper could recover under § 7 of the Anti-Trust Act for damages resulting from the exaction of a rate higher than that which would otherwise have prevailed, the amount recovered might, like a rebate, operate to give him a preference over his trade competitors.\" 260 U.S. p.163. 324 U.S. at 453. Despite B\u0026LE's diligence in presenting the pleadings in Georgia to support its cast of the case as one between competitors, it is obvious that in rendering its decision the Court's focus was on Georgia's claims as a customer. We, therefore, do not construe Georgia as Supreme Court precedent to apply Keogh to bar competitor suits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. To reconcile its holding with that in the United States v. Bessemer \u0026 L.E. case, the court of appeals in Pinney Dock drew a distinction between the criminal enforcement role of the United States and the remedial nature of the ICC's jurisdiction. Pinney Dock, 838 F.2d 1445 at 1460-61, n.15. We, to the contrary, do not find these role classifications as indicative of whether the court properly exercised its discretion in retaining jurisdiction. The same conspiratorial conduct described in the criminal indictment is the subject of this civil antitrust suit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. B \u0026LE, citing, as authority, 49 U.S.C. § 10706(a)(3)(C)(ii) of the Staggers Act, also challenges the issue's submission to the jury in the first instance. This issue has not been preserved for review, nor would it be of merit. The Staggers Act, enacted in 1980, has no application to this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In Alberta Gas Chemicals Ltd. v. E. I. DuPont deNemours \u0026 Co., 826 F.2d 1235 (3d Cir. 1987), cert. denied, 486 U.S. 1059, 100 L. Ed. 2d 930, 108 S. Ct. 2830 (1988), we addressed whether antitrust injury and antitrust standing are distinct doctrines: It has been suggested that although standing is closely related to antitrust injury, the two concepts are distinct. Once antitrust injury has been demonstrated by a causal relationship between the harm and the challenged aspect of the alleged violation, standing analysis is employed to search for the most effective plaintiff from among those who have suffered loss. However, in the sense that plaintiffs who sustain no antitrust injury may not recover, they may be loosely said to lack standing. (Citations omitted.) Id. at 1240.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Illinois Brick, a defendant manufacturer of bricks sold its product to masonry contractors, who provided the materials to building contractors. The contractor incorporated the bricks into buildings owned by the plaintiffs, numerous government entities. The plaintiffs claimed that they were injured by the prior purchasers' payment of excessive prices of the bricks charged by the manufacturer. The Court held that § 4 did not permit these indirect purchasers, with two narrow exceptions, to recover for the overcharge passed through the chain of distribution. The Court relied heavily on its earlier decision in Hanover Shoe, Inc. v. United Shoe Machinery Corp., 392 U.S. 481, 20 L. Ed. 2d 1231, 88 S. Ct. 2224 (1968), that a seller who imposes an illegal overcharge on a direct purchaser cannot escape antitrust liability by arguing that the first purchaser passed on the illegal overcharge by increasing the prices it charged for the products when it sold them to the public. In Hanover Shoe, the Court rejected the pass-on theory for a seller and in Illinois Brick made the symmetrical decision, consistent with Hanover, to disallow an offensive use of the theory. Although Illinois Brick is often cited as the standard bearer of antitrust standing cases, we note that the Court specifically stated that \"we do not address the standing issue. . . .\" 431 U.S. at 728 n.7. Instead, the Court based its holding on the grounds of remoteness of injury and defined this consideration as analytically distinct from the issue of standing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. National Steel Corporation, which owned and operated self-unloader vessels, offered substantial evidence that their intent and readiness to enter into the lake transportation business was frustrated by the conspiracy. National Steel actually purchased its own self-unloading vessel, the Stinson, in 1974. Because National Steel transported its own iron ore, rather than contracting with outside vessel companies, it did not offer evidence concerning lake transport damages. Also, because it was a vessel owner, notions of indirect injury concerning dock handling charges do not apply to National Steel. Further, National's claim is not jeopardized by the threat of overlapping damages as no other plaintiff suffered this distinct type of injury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Although Pinney was a privately owned dock, the plaintiffs claimed that the rates charged by it were artificially inflated by the conspiracy. According to the plaintiffs, because Pinney was the only private game in town, it was not required to set its prices based upon competition from other privately owned docks.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In addition to the three steel companies awarded lake transport damages, Sharon Steel and National Steel were awarded dock handling damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Because the private dock companies themselves were direct competitors of the railroads and because they were injured by the conspiracy's goal to preclude them from market entry, no standing problem is posed by their quest for damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The three companies averred in discovery that they were not in the business of purchasing, leasing, chartering, hiring or investing in vessels in the transshipment of bulk commodities over the Great Lakes. Indeed, the district court originally dismissed the self-unloader damage claims asserted by the steel companies, but gave the steel companies the opportunity to amend their complaints to allege the requisite ownership. To avoid a subsequent dismissal, the steel companies amended their complaint to allege that they had ownership interests in the vessels. However, the steel companies have not provided any record reference which points to an intent or preparation on their part to acquire self-unloaders. The only evidence of de facto ownership of the vessels that was offered was admitted during the damages phase of the trial. Nor were we directed towards evidence identifying the specifics of contractual relationships that would indicate ownership interests by means of either significant financing or other proprietary rights. Moreover the jury was not required to find that the steel companies intended to acquire self-unloaders and were prevented by the conspiracy from doing so. The specific question submitted to the jury was whether the plaintiffs suffered antitrust injury from \"foreclosure and delay in the utilization of self-unloading vessels for the delivery of iron ore.\" (Emphasis added.) True, the term \"utilization\" could be read to encompass an \"ownership\" determination, but, given the specific nature of the district court's reliance on the finding to confer entitlement to recovery, a definite statement by the jury that the lease and contracts conferred de facto ownership would be necessary. Given the evidence, we express concern that such a finding is supported.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See generally James R. McCall, The Disaggregation of the Damages Requirement in Private Monopolization Matters, 62 Notre Dame L. Rev. 643 (1987) and Nat Stern and Kevin B. Getzendenner, Gauging the Impact of Associated General Contractors on Antitrust Standing under Section 4 of the Clayton Act, 20 U.C. Davis L. Rev. 159 (1986), outlining the evolution of the antitrust standing doctrine.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. There is a similarity between the struggle of common-law Judges to articulate a precise definition of the concept of \"proximate cause,\" and the struggle of federal Judges to articulate a precise test to determine whether a party injured by an antitrust violation may recover treble damages. It is common ground that the judicial remedy cannot encompass every conceivable harm that can be traced to alleged wrongdoing. In both situations the infinite variety of claims that may arise make it virtually impossible to announce a blackletter rule that will dictate the result in every case. Instead, previously decided cases identify factors that circumscribe and guide the exercise of judgment in deciding whether the law affords a remedy in specific circumstances. 459 U.S. at 535-37 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Julian D. Von Kalinowski, Antitrust Laws and Trade Regulation, § 11.04[1][c] n. 35 (1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Some elucidation concerning the balancing of factors was provided by the Court in its decision last term in Holmes v. Securities Investor Protection Corp., 117 L. Ed. 2d 532, 112 S. Ct. 1311 (1992). In discussing the right to sue under the treble damages provision of the Racketeer Influenced and Corrupt Organization Act (borrowed from the Clayton Act), the Court stressed that although the AGC case did not identify directness of relationship between plaintiff and defendant as the \"sole requisite of Clayton Act causation,\" id. at 1318, directness of injury was construed as the focal point by which the remainder of the AGC factors are guided: First, the less direct an injury is, the more difficult it becomes to ascertain the amount of a plaintiff's damages attributed to the violation as distinct from other independent factors. Second, quite apart from the facts of proving factual causation, recognizing claims of the indirectly injured would force courts to adopt complicated rules apportioning damages among plaintiffs removed at different levels of injury from the violative acts to obviate the risk of multiple recoveries. And finally, the need to grapple with these problems is simply unjustified by the general interest in deterring injurious conduct, since directly injured victims can generally be counted on to vindicate the law as private attorneys general without any of the problems attendant upon suits by plaintiffs injured more remotely. Id. (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Before we undertake such an analysis, the most recent Supreme Court case discussing standing must be noted. This case is Kansas v. Utilicorp United Inc., 497 U.S. 199, 111 L. Ed. 2d 169, 110 S. Ct. 2807 (1990), where antitrust claims arose out of an alleged conspiracy to inflate natural gas prices. Defendants in this action were three companies and two limited partnerships that produced natural gas. Among the plaintiffs were three investor-owned public utilities that had purchased gas directly from the pipeline in the states of Kansas and Missouri, whose attorneys general asserted claims in parens patriae capacity on behalf of its residential customers who purchased gas from the utilities. The gas producers in defense claimed that the public utilities, despite the fact that they were direct purchasers, lacked standing because they had raised their own prices to offset the illegal charge, and thus had not suffered any damage. The district court rejected this pass-on defense and, moreover, dismissed the states as parens patriae on the same theory. The court of appeals affirmed. In a 5-4 decision, the Supreme Court rejected the States' argument that indirect purchaser standing should be allowed in cases involving a regulated activity that has passed on 100 percent of an overcharge to its customers. The Court opined that the mere fact that a price rise followed an unlawful cost increase was insufficient proof of antitrust injury. The indirect purchaser, stated the Court, would have to show that the utilities had not incurred any damage from the overcharge and would have to demonstrate that the utilities would not have raised prices had there not been an increase in fuel costs. The Court then took the opportunity to caution courts not to carve out exceptions to the general rules announced in its prior standing decisions: The rationales underlying Hanover Shoe and Illinois Brick will not apply with equal force in all cases. We nonetheless believe that ample jurisdiction exists for our stated decision 'not to carve out exceptions to the [direct purchaser] rule for particular types of markets'. The possibility of allowing an exception, even in rather meritorious circumstances, would undermine the rule. 497 U.S. at 216, quoting Illinois Brick, 431 U.S. at 744. B\u0026LE avers that this language in Utilicorp prohibits us from examining the facts of this case to determine if an exception lies under Illinois Brick. Utilicorp, however, does not rule because it concerned the pass-on theory of standing and whether the regulated consumer-energy market, or any other market involving a distribution chain that resembled a series of \"cost-plus\" contracts, would justify an exception to the unavailability of standing on the basis of the pass-on theory. The broader concerns of Illinois Brick and later cases are discussed infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We do not, however, interpret this statement in Mid-West Paper or the \"indirect purchaser\" rule of Illinois Brick as announcing a strict prohibition against recovery by indirect purchasers. Despite the Court's remark in Utilicorp that permitting parties with indirect purchaser status to proceed with a § 4 claim would require it to \"create an exception to the direct purchaser rule established in Hanover Shoe and Illinois Brick. . . .\" 497 U.S. at 207, we discount the import of this language because the Utilicorp decision was addressing the peculiarities of applying the pass-on theory of standing in the public utility arena. See n.9, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. An illustration of why the steel companies' damages would not necessarily duplicate the damages of the vessel and docking companies can be made by hypothesizing that the steel companies paid $10 in transport and docking charges for a ton of ore under the old system; with self-unloading bulkers they would pay $7 for transport and docking the same amount of ore. The steel company damages would then be $3, the difference between $10 and $7. The vessel and docking companies' lost profits would, however, have been incorporated in the $7 and thus would not be duplicative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In its reply brief, B \u0026LE also contends that it was unfairly prejudiced by what it refers to as the trial court's \"subsequential overruling of PTO 49\" in its judgment n.o.v. opinion. It does not, however, detail the form of the prejudice such as an allegation that it would have presented its evidence in a different manner or objected to testimony offered by the trucking companies regarding the fact of damage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. B\u0026LE's argument and this Discussion do not apply to the trucking company plaintiffs and Reaney, who had no knowledge of the conspiracy until events within the limitations period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Although B\u0026LE has couched its challenge in terms of the limitations period and we therefore discuss the challenge in that context, we note that, at root, B\u0026LE is arguing about proximate cause and attempting to limit its liability by seeking to narrow the scope of causes from the conspiracy itself (within the limitations period) to particular \"overt acts\" (within the limitations period). This argument formulation accounts for the district court's \"cause and effect\" description. We are in agreement with this observation by the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Our decision in Pennsylvania Dental Asso. v. Medical Service Asso., 815 F.2d 270 (3d Cir.), cert. denied, 484 U.S. 851, 98 L. Ed. 2d 109, 108 S. Ct. 153 (1987), upon which B \u0026LE in part relies, is not to the contrary. Pennsylvania Dental was concerned with the resolutions of various dental associations not to deal with Blue Cross and with the concomitant withdrawal from Blue Cross participation by numerous dentists. Most of the resolutions and withdrawals had taken place outside the limitations periods, but as none of the resolutions had been rescinded and there was evidence of overt acts -- within the limitations period -- in furtherance of the conspiracy, we held that the plaintiff's claim for injunctive relief, if subject to the limitations period at all, was not time barred. Id. at 278. Furthermore, citing Hanover Shoe, we opined that \"damages caused by any overt act taking place from [the beginning of the limitations period] may also be recovered.\" Id. Although the clause, read narrowly, appears to support B\u0026LE's proposed rule that damages must be tied to particular overt acts, it is clear from the context of the opinion that the conspiracy as a whole caused damages. The opinion, read in proper context, thus reiterates the rule that damages caused by injurious activity (such as an conspiracy active within the limitations period) could be recoverable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Moreover, the district court alternatively found, on sufficient evidence, that damages were not ascertainable until within the limitations period. This would suffice to bring them within the Zenith exception for speculative damages. See Zenith, 401 U.S. at 338-42. Because we have concluded that an active, injury-causing conspiracy suffices to bring the cause of action, we need not address B\u0026LE's disputations regarding Zenith's exception to the rule that an action for damages occurs at the time of an injurious act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. It is not clear from the caselaw that laches, an equitable defense, applies only to defenses at equity. See Smith v. Smith, 168 Ohio St. 447, 156 N.E.2d 113, 120 (Ohio 1954) (recognizing equitable nature of laches doctrine, but noting its applicability in certain statutory actions). See also Thirty-Four Corp. v. Sixty-Seven Corp., 15 Ohio St. 3d 350, 474 N.E.2d 295, 298 (Ohio 1984) (court referred to mortgage foreclosure action as \"lawsuit\" and considered whether laches applied). It is also the law in Ohio that assertion of the defense and its applicability is one which should be presented to the jury. See, Ferree v. Sparks, 77 Ohio App. 3d 185, 601 N.E.2d 568, 570 (Ohio App.3d 1991) (evaluation of evidence concerning application of laches is for trier of fact). The jury's findings here concerning fraudulent concealment are not conclusive as to the steel companies, and, as to Erie, are not applicable since the jury found that the Erie plaintiffs had actual knowledge of the conspiracy prior to October 14, 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. B\u0026LE contends that the district court erred as a matter of law in not instructing the jury on the fact and import of market power. The primary ground for this assertion is that the plaintiffs claimed and recovered damages for ore moved outside the lower Lake Erie region, on Lake Michigan and Lake Detroit. We note that B\u0026LE stipulated to the tonnages of ore involved in the conspiracy. During the damages charge, the district court informed the jury that \"everyone agrees on the total amount of pelletized ore that was transported during the relevant time.\" App. at 6338. Because B\u0026LE agreed to the specific tonnages involved in the conspiracy, it cannot now come forward and dispute the amount as improperly including tonnages which were moved beyond the geographic range of the conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. B \u0026LE also doubts that an award of prejudgment interest is permissible for damages awarded under Ohio's Valentine Act. Since we are denying the cross-appeal on other grounds, we need not reach this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. We have signified a change from the text which requires some explanation. In the transcript, the word \"railroads\" appeared where we have bracketed \"private docks.\" We altered the quote because it is obvious from the full context, that the reference was to the dock companies and not the defendant. We are confident, too, that, in hearing the instruction as a whole, the jury understood the court to be discussing the burden of the dock companies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The district court's clouding of the fact and the amount of damages is exemplified in a portion of its judgment n.o.v. opinion where it observed: \"Throughout both phases of the trial, the defendant vehemently argued, and sought to prove, that any damages actually sustained by the plaintiffs were attributable to economic factors other than the alleged conspiracy. . . .\" App. at 2129 (emphasis added).\u003c/span\u003e\n\n",
    "body_length": 150866,
    "citedas": [
      "998 F.2d 1144"
    ],
    "attorneys": "Paul F. Beery, Esquire, Michael Spurlock, Esquire (ARGUED), Kitt C. Cooper, Esquire (ARGUED), Beery \u0026 Spurlock Co., L.P.A., 275 East State Street, Columbus, OH 43215, Counsel for Wills Trucking Inc. and Toledo World Terminal, Inc. James V. Dick, Esquire, Timothy W. Bergin, Esquire, Squire, Sanders \u0026 Dempsey, 1201 Pennsylvania Avenue, N.W., P.O. Box 407, Washington, DC 20044, James M. Porter, Esquire, Thomas S. Kilbane, Esquire, Stacy D. Ballin, Esquire, Squire, Sanders \u0026 Dempsey, 1800 Huntington Building, Cleveland, OH 44115, Howard J. Trienens, Esquire (ARGUED), G. Paul Moates, Esquire, Carter G. Phillips, Esquire, Sidley \u0026 Austin, 1722 Eye Street, N.W., Washington, D.C. 20006, Thomas A. Masterson, Jr., Esquire, William J. Taylor, Esquire, Taylor \u0026 Taylor, 1801 Market Street, 811 Ten Penn Center, Philadelphia, PA 19103, Counsel for Bessemer \u0026 Lake Erie Railroad Company. Kenneth P. Kolson, Esquire, Association of American Railroads, 50 F Street, N.W., Washington, DC 20001, Counsel for Amicus Association of American Railroads. Richard McMillan, Jr., Esquire, Crowell \u0026 Moring, 1001 Pennsylvania Avenue, N.W., Washington, DC 20004-2505, Counsel for Amicus CSX Trans. Inc. Laurence Z. Shiekman, Esquire, Pepper, Hamilton \u0026 Scheetz, 3000 Two Logan Square, Philadelphia, PA 19103-2799, Counsel for Amicus Consolidated Rail Corporation. Bruce J. Ennis, Esquire (ARGUED), Carl S. Nadler, Esquire, Jenner \u0026 Block, 601 13th Street, N.W., 12th Floor, Washington, DC 20005, Lawrence R. Velvel, Esquire, Michael L. Coyne, Esquire, 27 Hickory Lane, Windham, NH 03087, Counsel for CD Ambrosia Trucking, Erie Western Pennsylvania Port Authority and Codan Corporation. Richard T. Colman, Esquire (ARGUED), Robert F. Ruyak, Esquire, Robert L. Green, Jr., Esquire, Jerrold J. Ganzfried, Basil C. Culyba, Esquire, Marcia P. Kaplan, Esquire, Howrey \u0026 Simon, 1730 Pennsylvania Avenue, N.W., Washington, DC 20006-4793, Counsel for Republic Steel Corporation, Jones \u0026 Laughlin Steel Incorporated and Wheeling-Pittsburgh Steel Corporation. William M. Wycoff, Esquire (ARGUED), Kevin C. Abbott, Esquire, George P. Faines, Esquire, Julie A. Maloney, Esquire, Thorp, Reed \u0026 Armstrong, One Riverfront Center, Pittsburgh, PA 15222, Counsel for National Steel Corporation and Sharon Steel Corporation. Jerry S. Cohen, Esquire, Ann C. Yahner, Esquire, Cohen, Milstein, Hausfeld \u0026 Toll, 1401 New York Avenue, N.W., Washington, DC 20005, Counsel for Tauro Bros. Trucking Company.",
    "category": [
      "242",
      "252",
      "36",
      "75"
    ],
    "judges": "Before: Mansmann, Scirica and Roth, Circuit Judges.",
    "citation_count": 154
  }
}
