{
  "id": "Iq3hSmYBTlTomsSBYbkT",
  "document": {
    "title": "In re Contested Case Hearing on Water Use",
    "full_title": "IN THE MATTER OF THE CONTESTED CASE HEARING ON WATER USE, WELL CONSTRUCTION, AND PUMP INSTALLATION PERMIT APPLICATIONS, FILED BY WAIOLA O MOLOKAI, INC. AND MOLOKAI RANCH, LIMITED.",
    "jurisdiction": "Hawaii Supreme Court",
    "date": "2004-01-29T00:00:00.000Z",
    "docket": "No. 22250",
    "body": "FOR PUBLICATION\n\nThis appeal arises from a contested case hearing before the appellee Commission on Water Resource Management [hereinafter, \"the Commission\"] involving the water use permit, well construction permit, and pump installation permit applications submitted by the applicant-appellee Wai`ola O Moloka`i, Inc. (Wai`ola) and its parent company Moloka`i Ranch, Ltd. (MR) [collectively, hereinafter, \"MR-Wai`ola\"] to construct and utilize the proposed Kamiloloa-Wai`ola Well (Well No. 0759-01) within the Kamiloloa aquifer system of the Kamiloloa water management area (WMA) on the island of Moloka`i. The appellant Department of Hawaiian Home Lands (DHHL), the intervenor-appellant Office of Hawaiian Affairs (OHA), the intervenors-appellants Walter Ritte, Karl Mowat, and Glenn Davis [hereinafter, \"the Ritte intervenors\"], and the intervenors-appellants Martin Kahae, Wayde Lee, Sheldon Hamakua, Walter Mendes, Louise Bush, Judy Caparida, and Robert Alcain [hereinafter, \"the Kahae intervenors\"] appeal from the decision and order (decision) of the Commission, filed on December 28, 1998, granting MR-Wai`ola's application for a water use permit, pursuant to Hawaii Revised Statutes (HRS) § 174C-49 (1993),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and authorizing the chairperson of the Commission to issue well construction and pump installation permits, pursuant to HRS § 174C-84 (1993) as requested by MR-Wai`ola.\n\nOn appeal, DHHL, OHA, the Ritte intervenors, and the Kahae intervenors [hereinafter, collectively, \"the appellants\"] raise the following issues: (1) whether the Commission clearly erred in finding that MR-Waiola had satisfied the conditions requisite to obtaining a water permit for a \"new\" use, as set forth in HRS § 174C-49(a), see supra note 1; (2) whether the Commission's decision violated the State's duty to protect DHHL's water rights, pursuant to the Hawaii Homes Commission Act (HHCA) §§ 220 and 221 (1993),\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e article XI, sections 1 and 7 and article XII, section 7 of the Hawaii Constitution,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and HRS chapter 174C, the State Water Code (Code); (3) whether the Commission's decision sufficiently protected native Hawaiians' traditional and customary gathering rights, as guaranteed by the HHCA, the Hawaii Constitution, and HRS § 174C-101 (1993);\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e (4) whether the Commission (a) erred in interpreting the four-year \"use or lose\" provision set forth in HRS § 174C-58(4) (1993), seeinfra note 39, as an enforcement, and not a planning, tool and (b) abused its discretion by finding that the circumstances of the present matter warranted an allocation of water for \"future\" uses that would extend beyond a four-year time frame; (5) whether the Commission erred in granting an \"interim\" permit for a \"new,\" vis-a-vis an \"existing,\" use of water, pursuant to HRS § 174C-53 (1993);\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e (6) whether the Commission clearly erred in finding that MR had correlative rights to transport groundwater outside the watershed of origin; and (7) whether the Commission clearly erred in finding that a monitoring well located in Kakalahale was \"reasonable and proportional to the effect\" of MR-Wai`ola's permitted uses.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In addition, the Ritte and Kahae intervenors [hereinafter, collectively, \"the Intervenors\"] argue that the Commission abused its discretion by refusing to permit the cross-examination of MR-Wai`ola's oceanography expert, Steven Dollar, Ph.D., with prior inconsistent statements made in an unrelated contested case hearing, pending before the Commission. Finally, the Kahae intervenors separately contend that the Commission abused its discretion under Hawaii Administrative Rules (HAR) §§ 13-167-56(b) and 13-167-59(a) (1998)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e by denying their oral motion to admit Exhibits B-28 through B-34 into evidence upon MR-Wai`ola's objection that the proffered evidence had not been properly identified on the exhibit lists and filed by the parties prior to the contested case hearing.\n\nFor the reasons fully explained below, we hold that: (1) the Commission's decision violated DHHL's reservation rights as guaranteed by HHCA §§ 220 and 221, article XI, sections 1 and 7 of the Hawaii Constitution, HRS §§ 174C-49(a)(7) and 174C-101(a), and the public trust doctrine; (2) the Commission clearly erred in finding that MR-Wai`ola had satisfied the conditions requisite to obtaining a water permit for a \"new\" use, as set forth in HRS § 174C-49(a); (3) the Commission failed adequately to discharge its public trust duty to protect native Hawaiians' traditional and customary gathering rights, as guaranteed by HHCA § 220(d), article XII, section 7 of the Hawaii Constitution, and HRS §§ 174C-101(a) and (c) by refusing sufficiently to permit the cross-examination of MR-Wai`ola's oceanography expert, Dr. Dollar; (4) HRS § 174C-58(4) is a statutory mechanism by which to enforce allocations of water anticipated by the Commission to be used within four years of issuing a water use permit; (5) although the Code supplants the common law doctrine of correlative rights in WMAs, the Commission nevertheless rendered the findings, prescribed by HRS § 174C-49(c), requisite to permitting MR-Wai`ola to transport groundwater outside the aquifer of origin; and (6) the Commission erred in granting MR-Wai`ola an \"interim\" permit for a \"new\" use, pursuant to HRS § 174C-49(a). Accordingly, we vacate the Commission's decision and order and remand this matter for further proceedings consistent with this opinion.\n\nI. BACKGROUND\n\nA. Introduction\n\n1. MR and Wai`ola MR owns approximately one third of the land on Molokai (approximately fifty thousand acres). Wai`ola, a domestic water purveyor, is a wholly-owned subsidiary of MR and operates as a public utility under a certificate of public convenience and necessity issued by the Hawaii Public Utilities Commission. As of 1998, Waiola supplied potable water to approximately one sixth of the population of Moloka`i, primarily consisting of residences and commercial businesses in Kipu, Kualapu`u, and Maunaloa, all located in west Moloka`i. Although Wai`ola owns and operates transmission and distribution systems across the island, neither it nor MR controls any source of potable groundwater on Moloka`i. Instead, Wai`ola purchases potable water from the County of Maui (County), DHHL, and Kukui (Moloka`i), Inc. (KMI) in order to service its existing customer base; DHHL, the County, and KMI operate wells located in the Kualapu`u aquifer system.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nMR created a thirty-year development plan to revitalize the Moloka`i economy.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The plan is premised on (1) maintaining and capitalizing on Molokai's rural character and vast open space, (2) increasing and diversifying economic opportunities for Molokai residents in the areas of agriculture, tourism, and light industry, and (3) protecting and promoting the physical and cultural environment unique to the island of Moloka`i. Although the majority of MR's land would continue to be used for agriculture, the plan seeks to fuse MR's ranching operations with low-impact tourism in order to afford opportunities for economic success while preserving and maintaining the working ranch and paniolo (i.e., cowboy) culture. MR further anticipated that the implementation of its plan would expand the industrial park at Plau, consisting of approximately ninety-one acres, for small industrial uses; MR projected that approximately twenty-five percent of the development of the industrial park would be completed within four years. In essence, MR contemplated that, by incorporating its ranching and agricultural activities with light industry, tourism, and rural towns, the long-term development plan would dramatically improve Molokai's economy. 2. MR's proposed water use In order to effectuate its development plan, MR filed an application for a water use permit on behalf of Wai`ola, requesting approximately 1.25 million gallons per day (mgd) of groundwater from the Kamiloloa aquifer system to accommodate its current and future domestic, commercial, industrial, and municipal needs. More specifically, it requested approximately 100,000 gallons per day (gpd) to serve current water needs in Maunaloa and an additional 100,000 to 120,000 gpd to serve its current needs in Kualapu`u and Kipu, in the event that Wai`ola was unable to continue its purchase agreements with DHHL and/or KMI. Waiola requested the remaining 1.0 mgd for the ongoing development of MR's lands over the next fifteen to twenty years.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe proposed well site is approximately three miles from the existing Kualapu`u well field, from which the County, DHHL, and KMI currently pump drinking water. MR selected the proposed well site because (1) it was outside the Kualapu`u aquifer system where the existing drinking-water wells were concentrated, (2) it was located in an area where it appeared that potable groundwater could be developed, and (3) MR owned the land upon which the proposed well would be constructed.\n\n3. Molokai's Hydrology and the Proposed Well Site\n\nVirtually the entire island of Molokai` rests atop fresh groundwater, which results from water seeping into the soil and being stored in highly permeable volcanic basalt rock. Moloka`i depends on high-level groundwater and basal groundwater\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e for its water supply. Within the rift zones of the East Moloka`i Volcano, fresh groundwater is impounded to high levels in the volcanic rocks between low-permeability dikes. Within the flank lava flows of the island, a freshwater lens floats on the denser, underlying saltwater; the intermediate transition zone composed of brackish water rests between the freshwater and saltwater.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The freshwater lens consists of groundwater recharge from (1) upgradient high-level groundwater areas, (2) infiltration of rainfall, and (3) irrigation water. The thickness of the freshwater lens increases with (1) increasing rates of groundwater recharge, (2) decreasing rates of withdrawal, and (3) decreasing aquifer permeability.\n\nMoloka`i is composed of four hydrologic units: the West, Central, Northeast, and Southeast sectors. The four hydrologic units have been subdivided into sixteen aquifer systems. The Kualapu`u aquifer system is located in the Central sector, and the Kamiloloa aquifer system (Wai`ola's proposed well site) is located in the Southeast sector, adjacent to and east of the Kualapu`u aquifer system. Presently, four wells tap into the Kualapu`u aquifer system to pump drinking water for the County, DHHL, and KMI. The sustainable yield, see infra note 25, of the Kamiloloa aquifer system is 3.0 mgd; the existing water allocations in the Kamiloloa aquifer system total 0.211 mgd with no reservations for future water uses.\n\nIn addition to high-level groundwater and basal groundwater, the Moloka`i Irrigation System (MIS) provides another water source to the island. The MIS receives water from three wells that tap into the Waikolu aquifer system, which is located in the northeast sector and adjacent to the Kamiloloa aquifer system. The proposed well in the Kamiloloa aquifer system, however, is separate from the dike compartments in the Waikolu valley and, therefore, would not diminish the water sources available to the MIS. 4. DHHL and the HHCA Pursuant to the Admissions Act of 1959, the people of Hawaii, as a condition of Statehood, adopted the HHCA as part of the State Constitution, thereby accepting an obligation to manage and administer the Hawaiian home lands program. The HHCA allocated approximately 200,000 acres of State land to be held in trust for the benefit of native Hawaiians, of which 25,383 acres of land are located on Moloka`i in Ho`olehua, Kalama`ula, Kalaupapa, Kamiloloa, Kapa`akea, Makakupa`ia, and Ualapu`e. DHHL, the agency exerting exclusive control over Hawaiian home lands pursuant to HHCA § 204, has a reservation of 2.905 mgd in the Kualapu`u aquifer system, pursuant to HAR § 13-171-63 (1996).\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Although HAR § 13-171-63 does not expressly set forth any uses for the 2.905 mgd reservation, the record reflects that DHHL obtained 0.905 mgd to satisfy domestic water needs at Ho`olehua and Kalama`ula; the remaining 2.0 mgd was allocated to satisfy DHHL's homesteader's agricultural needs. On September 12, 1996, DHHL filed a water use permit application to withdraw an additional 0.9 mgd of groundwater from its two existing wells in the Kualapu`u aquifer system for domestic and agricultural uses in Ho`olehua and Kalama`ula. Although, at the time of the filing of its application, DHHL had not determined a location for a future well in Kualapu`u, MR-Wai`ola's hydrology expert testified that \"it would be advisable for DHHL to place its next well to the east of its existing wells in Kualapu`u in the direction of Wai`ola's proposed well.\"\n\nApproximately five months prior to the filing of the applications at issue in the present appeal, MR filed well construction, pump installation, and water use permit applications with the Commission for the proposed Kualapu`u-MR Well (Well No. 0901-03) in the Kualapu`u aquifer system where MR owns approximately forty-four percent of the developable land. On October 20, 1995, the Commission approved MR's application for the proposed exploratory well in the Kualapu`u aquifer system. MR, however, subsequently abandoned its plan to construct the Kualapu`u-MR well; it appears from the record that, when the sustainable yield of the Kualapu`u aquifer decreased, MR's proposed use would have inevitably interfered with DHHL's reservation, thereby foreclosing MR's ability to obtain a water use permit under HRS § 174C-49(a)(7), see supra note 1. 5. Traditional and customary practices of the native Hawaiians OHA, the Ritte intervenors, and the Kahae intervenors intervened in the contested case hearing to voice their concerns regarding the effect of the proposed Kamiloloa well on native Hawaiians' subsistence gathering due to a reduction in groundwater discharge into the near-shore environment. The coastal boundary of the Kamiloloa aquifer system comprises approximately six kilometers of shoreline, extending west of the Kaunakakai Gulch to east of Alii Fishpond, and includes the Kaunakakai Harbor Channel and two large fishponds (Alii and Kaloko`eli fishponds).\n\nThere are no perennial streams within the Kamiloloa aquifer system, and surface runoff reaches the ocean only after significant rainfall. Groundwater discharge into the ocean, however, is reduced by the amount of well pumping in either the Kualapu`u or Kamiloloa aquifer systems; at least five fishponds along the thirteen-mile stretch \"will likely experience reduced discharge of groundwater flow into the near-shore environment as a result of pumping from the proposed well.\" The near-shore environment fronting the Kamiloloa aquifer system consists of brackish water that is essential to the livelihood of several species of fish -- e.g., mullet, holehole, and milkfish -- and limu\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e -- e.g., ogo, manauea, ele`ele, and huluhuluwaena.\n\nNative Hawaiians gather limu and other marine resources along the southern and eastern coastline of Molokai, including the Kamiloloa shoreline, for, inter alia, home consumption, fertilizer, and a healthier diet and lifestyle.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Dr. Dollar, MR-Wai`ola's oceanography expert, conducted a study to determine the effects of a reduction of groundwater discharge on the water quality in the near-shore environment. More specifically, the study considered three factors: (1) nutrient concentrations in well water collected from wells in the Kamiloloa aquifer -- i.e., the extent to which increases in freshwater could provide an increase in nutrients that facilitate the growth of limu; (2) the water chemistry of the near-shore environment as determined by water samples collected in the ocean down-slope from existing wells and from the proposed well site; and (3) the potential impact upon limu resources that could result from the removal of groundwater from the proposed well. Dr. Dollar concluded that the \"highest concentrations of limu were found in near-shore areas\" located on the western side of Moloka`i. He observed only four species of limu on the southern Moloka`i shoreline, three of which were edible (palahalaha, ele`ele, and huluhuluwaena). Dr. Dollar \"only found ogo growing in boxes and found none in the wild\" and \"found ele`ele in places only where there [was] a hard bottom for it to grow, not on the mud or right on the sand.\" Several Moloka`i residents, however, testified that they \"regularly found ogo within 10-50 yards of the shoreline\" located in the study area closest to the proposed well site and that they \"regularly and frequently pick[ed] limu beyond the Dollar study area, along the entire coastline between Coconut Grove (Kioea) and Kamalo, including Kapa`akea, Onealii.\" B. Procedural Background On May 13, 1992, the Commission designated all sixteen of the Moloka`i aquifer systems as a WMA, pursuant to HRS § 174C-41 (1993),\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e which, pursuant to HRS § 174C-48 (1993),\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e required both \"existing\" and \"new\" users of water within a designated area to apply for water use permits. On January 25, 1996, the Commission took receipt of MR-Wai`ola's well construction permit, pump installation permit, and water use permit applications for 1.25 mgd in the Kamiloloa aquifer system. On May 21, 1996, commission staff recommended partial approval of the water use permit pertaining to the proposed Kamiloloa-Wai`ola Well to the extent of the reasonable-beneficial use of 0.33 mgd for existing uses and proposed future (i.e., new) uses; the uses that the commission's staff was proposing the approval of included the assumption of existing services supplied by other providers. The Commission, however, conditioned the recommended amount upon various parties reducing their previously permitted water allocations by the following amounts: (1) DHHL was to reduce its water use by 14,000 gpd from 0.367 mgd to 0.353 mgd, being the amount that DHHL provided to the Kipu and Pu`ukolea residential projects; (2) the Maui Department of Water Supply (MDWS) was to reduce its water use by 85,910 gpd from 0.516 to 0.430 mgd, being the amount that it provided to Maunaloa Town; and (3) KMI was to reduce its water use by 19,952 gpd from 1.2 mgd to 1.025 mgd, being the amount that it provided to Kualapu`u Town.\n\nOn October 3, 1996, DHHL filed a timely petition for a contested case hearing on the water use, well construction, and pump installation permit applications for the Kamiloloa-Wai`ola Well, alleging that MR-Wai`ola's application would have widespread and adverse impacts on DHHL's interests, which included, inter alia: (1) the capacity of the State of Hawaii and the Hawaiian Homes Commission, the State agency responsible for the administration of the HHCA, to carry out its legal responsibilities, public policies, plans, and projects to support the advancement of native Hawaiians; (2) current and future homestead, community, and economic development uses of Hawaiian home lands; (3) the quality and quantity of water required for current and foreseeable needs of the Hawaiian home lands; and (4) major capital investments of public and trust funds for infrastructure support, such as the DHHL Molokai` Water System.\n\nOn October 23, 1996, the Commission determined that DHHL had standing to contest MR-Wai`ola's permit applications and initiated the contested case hearing process.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Shortly thereafter, the Commission held a hearing to determine which petitioners, in addition to DHHL, had standing to participate in the contested case hearing. On May 14, 1997, the Commission, upon the recommendation of the hearing officer, granted the following intervening parties standing to participate: (1) the County\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and OHA, pursuant to HAR § 12-167-54(a)(2) (1996), on the basis that these government agencies' jurisdiction included the land or water in question; (2) the Kahae intervenors, pursuant HAR § 12-167-54(a)(3) (1996), on the basis that they either had a property interest in the land or lawfully resided on the land within the Kamiloloa aquifer system; and (3) the Ritte intervenors, pursuant to HRS § 174C-101(c), see supra note 4, on the basis that they claimed traditional and customary gathering rights of ahupua`a\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e tenants whose native Hawaiian descendants inhabited the Hawaiian Islands prior to 1778. DHHL, OHA, the Ritte intervenors, and the Kahae intervenors essentially asserted that DHHL's reservation of water in the Kualapu`u aquifer system constituted an existing legal use and that MR-Wai`ola's proposed water use violated HRS § 174C-49(a)(3), seesupra note 1.\n\nThe contested case hearing, which occupied seven days, commenced on October 27, 1997 and concluded on November 21, 1997. The Commission limited the hearing to (1) the effect of the proposed well on the two adjacent aquifers (Kualapu`u and Waikolu) and (2) the effect of the proposed well on the near-shore environment. With respect to the first issue, the hearing focused on whether the proposed and/or existing uses of water satisfied the conditions for a water use permit, as set forth in HRS § 174C-49(a), see supra note 1, and HRS § 174C-50 (1993), seeinfra note 44. In particular, the Commission requested that the parties address the following issues: (1) whether the proposed water use constituted a \"reasonable-beneficial use\" as defined by HRS § 174C-3 (1993) and was permissible under the common law of the State; (2) whether the proposed use was consistent with the public interest, including, but not limited to, the statement of policy objectives declared to be in the public interest, as set forth in HRS § 174C-2(c) (1993),\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and the quantified effect of the proposed pumping of groundwater on stream flow and near-shore waters; and (3) whether any party had appurtenant or riparian rights in accordance with HRS § 174C-101, see supra 4, or any other right to a quantifiable amount of water that was equal to or had priority over the proposed water use by MR-Waiola. The second issue addressed the conditions, if any, that would be placed on MR-Wai`ola's water use, in the event that the Commission granted a water use permit to MR-Wai`ola. On August 19, 1998, the Commission issued its proposed findings of fact (FOF), conclusions of law (COL), and decision to which the parties submitted written exceptions. The Commission issued its final decision on December 28, 1998.\n\nC. The Commission's Final FOFs, COLs, And Decision\n\nThe Commission's final decision consisted of 214 FOFs, 46 COLs, and a decision, which set forth the Commission's disposition of the contested case hearing. The following summary highlights the relevant components of the Commission's analysis and decision.\n\nIn its COLs, the Commission evaluated MR-Wai`ola's application for a water use permit as an application for a \"new use\" governed by HRS § 174C-49, which placed the burden on MR-Wai`ola to establish that the proposed water use satisfied the seven conditions set forth in HRS § 174C-49(a) by a preponderance of the evidence. As a preliminary matter, the Commission, citing this court's decision in City Mill Co., Ltd. v. Honolulu Sewer and Water Commission, 30 Haw. 912 (1929), concluded that, inasmuch as MR owned the property overlying an artesian basin, it had correlative rights to make reasonable use of the underlying water with due regard to the rights of adjacent landowners in the same waters and subject to government regulations of water. Based on the evidence adduced at the contested case hearing, the Commission concluded that MR-Wai`ola's water use permit application satisfied the conditions set forth in HRS § 174C-49(a), see supra note 1, and issued an \"interim water use permit\" for the Kamiloloa-Wai`ola Well (Well No. 0759-01) for the reasonable-beneficial use of 655,928 gpd, approximately one half of the amount that MR-Wai`ola had requested. 1. Accommodating the proposed water use HRS § 174C-49(a)(1) requires that an applicant for a water use permit \"establish that the proposed use of water . . . [c]an be accommodated with the available water source.\" See supra note 1. Inasmuch as (1) 2.789 mgd of the total 3.0 mgd sustainable yield in the Kamiloloa aquifer system had not been allocated and (2) there were no water reservations in the Kamiloloa aquifer system, the Commission concluded that 1.25 mgd could be allocated from the available water source. 2. Reasonable-beneficial use HRS § 174C-49(a)(2) provides that the applicant must \"establish that the proposed use of water . . . [i]s a reasonable-beneficial use as defined in [HRS §] 174C-3.\" See supra note 1. The Commission concluded that, inasmuch as the domestic, commercial, industrial, and municipal uses set forth in MR-Wai`ola's water use permit application were consistent with, or more conservative than, the standards utilized by the County, the proposed use, as amended by its decision, was an economic and efficient utilization of water and, therefore, a reasonable-beneficial use. The Commission, however, expressly limited the proposed water use to 655,928 mgd, reasoning that \"any allocation of water in excess of that granted to Wai`ola under the proposed decision and order would not be an economic or efficient utilization of water because the future developments in question do not have certain land use approvals and therefore do not meet the criteria under sections 174C-49(a)(5) and (6).\" 3. Interference with existing legal uses HRS § 174C-49(a)(3) requires that an applicant for a water use permit \"establish that the proposed use of water . . . [w]ill not interfere with any existing legal use of water.\" See supra note 1.\n\na. DHHL's reservation in the Kualapu`u aquifer\n\nThe Commission concluded that a reservation of water was not an existing legal use, for purposes of HRS § 174C-49(a)(3) and HAR § 13-171-63, see supra note 13, for two reasons. First, because HRS § 174C-49(d) separately denotes \"existing legal uses\" and \"reservations,\" the Commission determined that it was incongruous to equate a \"reservation\" with an \"existing legal use.\" The Commission further noted that to so interpret the term \"reservation\" would render the proviso language of HRS § 174C-49(d) nugatory.\n\nSecond, the Commission concluded that all lawful reservations were aquifer-specific. See HAR §§ 13-171-61, -62, and -63 (delineating with particularity the aquifer system wherein a reservation is designated). In this regard, DHHL's existing 2.905 mgd reservation was limited to the Kualapu`u aquifer system, pursuant to HAR § 13-171-63, see supra note 13. Therefore, inasmuch as MR-Wai`ola's proposed water use was located in the Kamiloloa aquifer system, the Commission concluded that it did not interfere with DHHL's reservation in the Kualapu`u aquifer system. The Commission further reasoned that,\n\n[t]o extend the reservation to an adjacent aquifer, especially where the evidence clearly demonstrates that there will be minimal, if any, impact on the DHHL well in Kualapu`u, does not comport with the intent of section 174C-49(d). To do so, at its most extreme, would result in DHHL having a blanket reservation in all adjacent aquifers without going through the regulatory process required by chapter 13-171, HAR, and chapter 174C, HRS.\n\nb. DHHL's existing uses in the Kualapuu aquifer\n\nNotwithstanding the Commission's conclusion that the proposed water use did not interfere with DHHL's reservation in the Kualapu`u aquifer system, the Commission addressed, in accordance with the mandate of HRS § 174C-49(a)(3), whether the proposed water use would interfere with DHHL's existing uses in Kualapu`u. In so doing, the Commission considered two case studies, the McNulty Model and the United States Geological Survey (USGS) Model, submitted by the parties to assist in evaluating the effect of the proposed well on DHHL's wells located in the Kualapu`u aquifer, as well as the impact of the proposed well on the near-shore environment. Both models predicted a small degree of water-level decline at the Kualapu`u well field and an insignificant reduction of groundwater discharge to the near-shore area.\n\n(1) The McNulty Model\n\nThe McNulty Model, proffered by MR, studied the effect of pumping 1.25 mgd from the Kamiloloa aquifer on the existing wells in Kualapu`u. The McNulty Model predicted that pumping 1.25 mgd from the proposed well in Kamiloloa would result in a water-level decline of 0.17 to 0.32 feet at the existing Kualapu`u well field and a decline of 0.09 to 0.11 feet at the near-shore well. The testimony adduced at the contested case hearing revealed that the foregoing water-level declines were conservative for Kualapu`u and Kawela, because the model did not include the effect of intrusive structures, which could limit water-level declines to the Kamiloloa aquifer system. The McNulty Model essentially predicted the \"worst case response\" incident to the proposed pumping and, in fact, predicted a more extreme effect on the existing Kualapu`u wells than the USGS Model. In sum, the McNulty Model concluded that the water-level declines at the predicted levels would have no measurable effect on the quality or quantity of water drawn from the existing wells.\n\nWith respect to the near-shore environment, the McNulty Model predicted that, by pumping 1.25 mgd of groundwater from the proposed Kamiloloa well, the flux of groundwater at the Kamiloloa shoreline would be reduced by approximately fifteen percent.\n\n(2) The USGS Model\n\nThe USGS Model, proffered by DHHL, analyzed the long-term effects of current and additional withdrawals on groundwater levels on the entirety of Moloka`i. The USGS Model predicted that pumping 1.326 mgd from the proposed well would cause a drawdown at the Kualapu`u wells of up to 0.5 foot and approximately 1.0 foot in the vicinity of the Kamiloloa well itself. In this connection, the study opined that \"the largest effects occur in areas nearest the well and effects diminish with distance from the well.\" The resulting water-level decline was \"likely to be less than normal seasonal fluctuations of the groundwater level and of the same order of magnitude of normal semi-diurnal water level fluctuations created by varying barometric pressure. In other words, the impact is relatively small.\"\n\nWith respect to the near-shore environment, the USGS Model predicted that pumping 1.326 mgd from the proposed well would result in a reduction of coastal discharge by three percent over a thirteen-mile stretch of coastline.\n\nBased on the foregoing studies and the actual pumping levels permitted by the Commission (i.e., 655,928 gpd), the Commission concluded that the proposed use would have a minimal impact, if any, upon DHHL's wells in Kualapu`u and, therefore, would not interfere with any existing legal uses in the Kualapu`u aquifer system. 4. Public interest HRS § 174C-49(a)(4) requires that the applicant \"establish that the proposed use of water . . . [i]s consistent with the public interest.\" See supra note 1. In evaluating the foregoing, the Commission acknowledged its public trust responsibilities over all waters of the State, citing Robinson v. Ariyoshi, 65 Haw. 641, 658 P.2d 287 (1982). Specifically, the Commission explained that:\n\n[t]he State has a duty to protect, control, and regulate water resources and must act with a sense of fiduciary responsibility with regard to the use of water. The [ ] Code embodies the public trust responsibilities over all waters of the State. The Code mandates consideration of the large variety of public interests. The definition of \"public interest\" in the Code broadly encompasses the protection of the environment, traditional and customary practices of native Hawaiians, scenic beauty, protection of fish and wildlife, and protection and enhancement of the waters of the State. These values embodied in the Code encompass those values set forth in public trust responsibilities set forth in Robinson.\n\nBased on the public interests delineated in HRS § 174C-2, seesupra note 21, the Commission concluded that MR-Wai`ola's proposed use, which included municipal, domestic, commercial, and industrial uses, was consistent with the public interest of the State. The Commission further concluded that, based on its minimal effect, if any, on the near-shore environment, fish and wildlife, and the waters of the State, coupled with the conditions set forth in its decision -- i.e., the monitoring well program, see infra, section I.C.7.c. --, which the Commission believed would ameliorate any negative effects of the proposed water use, MR-Wai`ola's proposed use satisfied the public trust principles espoused in Robinson and subsequently codified in HRS chapter 174C. 5. State and county general plans and land use designations and county land use plans and policies HRS §§ 174C-49(a)(5) and (6) mandate that the applicant \"establish that the proposed use of water . . . [i]s consistent with state and county general plans and land use designations\" and \"county land use plans and policies,\" respectively. The Commission concluded that MR's existing uses were consistent with state and county general plans and land use designations and the county land use plans and policies. The Commission, however, found that several of MR's proposed future uses were not consistent the foregoing conditions and, therefore, did not meet the conditions set forth in HRS §§ 174C-49(a)(5) and (6).\n\nIn its analysis, the Commission also elaborated on its authority to grant allocations of water beyond a four-year time horizon, pursuant to HRS § 174C-58(4), see infra note 39. More specifically, the Commission explained that \"the four year non-use limitation . . . is primarily an enforcement tool.\" The Commission reasoned that \"[o]ne of the goals of the [ ] Code is to facilitate long-range planning for the economic and efficient utilization of water\" and that \"the circumstances in this case present good and sufficient reasons for authorizing an allocation beyond the four year period where the Applicant has received all land use approvals.\" Further elaborating, it concluded that,\n\n[a]lthough the Commission is not limited by law to allocations based on a four year time frame, the Commission does believe that granting water use permits in excess of the four year time frame must be made on a case by case basis based on the facts of each case. In this case, the fact the applicant had all land use approvals for the water uses granted in this decision and order, the need to facilitate long-range planning, the lack of competition for the water in the Kamiloloa Aquifer System, the small amount of water already allocated, and the determination that the effect of this proposed use, as modified by this decision and order, will be minimal on the Kamiloloa Aquifer, the adjacent Kualapuu Aquifer, and the near-shore resources, all support the allocation of water beyond the four year time frame. This case should not be considered as a binding precedent for any future case as the Commission shall consider each case on its individual circumstances.\n\nMoreover, the Commission reiterated that, in the event that Waiola did not effect its four-year projected use, HRS § 174C-58 provides for the revocation of the water use permit. 6. Interference with DHHL's rights HRS § 174C-49(a)(7) directs that the applicant \"establish that the proposed use of water . . . [w]ill not interfere with the rights of [DHHL] as provided in [HHCA § 221].\" See supra note 1. The Commission expressly rejected two arguments that DHHL asserted with respect to the impact of MR-Wai`ola's proposed water use on DHHL's rights under the HHCA. First, the Commission disagreed that the proposed use would interfere with DHHL's existing wells located in the Kualapu`u aquifer system and noted that DHHL's contentions appeared to be significantly undermined by its plan to file an application for a water use permit to pump an additional 0.905 mgd from the same well that it vehemently maintained would be significantly affected by the proposed well located three miles away from DHHL's well in Kualapu`u. The Commission opined that \"[a]additional pumping from DHHL's own well in Kualapu`u would have a much greater impact on the Kualapu`u Aquifer System and the DHHL well than the proposed well.\"\n\nSecond, the Commission dismissed DHHL's assertion that the proposed well would render it impossible for DHHL to utilize its full allocation in Kualapu`u because it would be unable to drill a well on the borderline between the Kualapu`u and Kamiloloa aquifer systems. The Commission concluded that \"[t]here was no evidence presented that DHHL intended ever to place a well at that location or had any current or foreseeable funding to do so\" and that, therefore, \"the evidence was too speculative and not credible to establish that this proposed use will leave DHHL unable to fully utilize its current reservation in the Kualapu`u Aquifer.\"\n\nBased on the foregoing reasoning, the Commission ultimately ruled that MR-Wai`ola had satisfied its burden under HRS § 174C-49(a) to obtain a water use permit for 655,928 gpd in the Kamiloloa aquifer system. 7. Miscellaneous issues relating to MR-Waiola's permit a. Interference with native Hawaiians' traditional and customary gathering rights\n\nThe Commission discussed at length its conclusion that MR-Waiola's proposed water use would not abridge or deny traditional and customary gathering rights of native Hawaiians. In particular, the Commission reviewed its obligation to protect native Hawaiians' rights secured by article XII, section 7 of the Hawaii Constitution and this court's decision in Public Access Shoreline Hawaii (PASH) v. Hawaii County Planning Commission, 79 Hawaii 425, 903 P.2d 1246 (1995). The Commission considered the following three questions in determining whether the proposed water use interfered with native Hawaiian rights: (1) whether traditional and customary native Hawaiian rights were exercised in the project area; (2) the extent to which, if such rights were being exercised, they would be affected by the proposed action; and (3) the feasible measures, if any, that could be undertaken by the Commission to protect these rights.\n\nBased on the evidence adduced at the contested case hearing, the Commission determined that the Intervenors had sufficiently demonstrated that native Hawaiians were actually exercising traditional and customary practices on the shoreline and near-shore area makai\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e of the proposed well site in Kamiloloa. The Commission, however, concluded that \"no evidence was presented that the drilling of the well would affect the exercise of traditional and customary native Hawaiian rights\" and, therefore, that the decision to grant a water use permit for the proposed well was consistent with article XII, section 7 of the Hawaii Constitution and the relevant case law.\n\nWith respect to the protection of native Hawaiian rights under HRS § 174C-101, see supra note 4, the Commission similarly concluded that MR-Wai`ola's proposed water use would have a minimal impact, if any, on the limu, fish, and other marine species traditionally and customarily gathered and consumed by native Hawaiians. Although the Commission rejected the Intervenors' argument that the withdrawal of groundwater in the Kamiloloa aquifer would reduce the amount of groundwater discharge into the near-shore area makai of the project area, thereby adversely affecting the marine life traditionally and customarily gathered by native Hawaiians, the Commission nevertheless acknowledged its legal mandate to protect the reasonable exercise of traditional and customary native Hawaiian practices:\n\nBecause the project may have an impact, albeit minimal, if any, on the traditional and customary native Hawaiian practices, the Commission imposes[,] as a condition of this permit[,] a well monitoring program as set forth in the decision and order. The well monitoring program will provide data to calibrate the ground-water models presented as to the possible effect of the well pumping on the reduction and resulting distribution of groundwater in the Kamiloloa Aquifer, which could possibly affect the marine life in question.\n\nSubject to the foregoing, the Commission concluded that MR-Wai`ola's proposed water use, as amended by its decision, would \"not abridge or deny traditional or customary Hawaiian rights, customs, practices, or appurtenant water rights, or any other rights referred to in or protected by Part IX of the state Water Code, the common law, or the Constitution of the State of Hawaii.\"\n\nb. Municipal Reservation\n\nInasmuch as MR-Wai`ola's water use application involved the integration of land use planning and water resource management, the Commission's decision emphasized that the availability of water was critical to the success of MR's plans for economic development. As such, the Commission invoked its authority under HRS § 174C-49(d), see supra note 1, to provide for a municipal reservation in the Kamiloloa aquifer system in order to insure the proper utilization and allocation of water on Moloka`i. The Commission concluded that the reservation of water \"would not be limited to any one user but would be set up for municipal uses as defined in the Water Code.\" The Commission maintained that a municipal reservation would effectuate one of the express purposes of the Code, which was to facilitate long-range planning as a means of facilitating proper water resources management.\n\nc. The Kakalahale Well Monitoring Program\n\nInasmuch as the evidence adduced at the contested case hearing indicated that the proposed use might have an effect on Molokai's water resources, the Commission imposed a condition on MR-Wai`ola's water use permit to protect these water resources, pursuant HAR § 13-171-20(e) (1996).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Specifically, the decision provided for the installation of an observation well in Kakalahale, which is located between the proposed well site and the Kamiloloa shoreline, to monitor (1) the effect of the additional pumping in the Kamiloloa aquifer system and (2) the reduction of groundwater discharge into the near-shore environment by logging water-level data. The data would be used to extrapolate tidal functions in order to establish long-term water-level trends. The Commission believed that \"the well monitoring program . . . [was] reasonable and proportional to the effect that the proposed use of 655,928 gpd . . . [would] have on the water resources.\"\n\nMoreover, the Commission expressly retained jurisdiction over MR-Wai`ola's water use permit and reserved the right to modify the operation of the Kamiloloa-Waiola well in the event of \"a significant and unexpected drawdown in the well,\" thereby causing a reduction in groundwater discharge into the near-shore environment.\n\nAdditional contested FOF and COL appear in the relevant discussion sections of this opinion.\n\nII. STANDARDS OF REVIEW\n\nA. Judicial Review Of Decisions Of The Commission\n\n[HRS] § 174C-12 (1993) provides: \"Judicial review of rules and orders of the commission under this chapter shall be governed by [HRS] chapter 91 [i.e., the Hawaii Administrative Procedures Act, or HAPA]. Trial de novo is not allowed on review of commission actions under this chapter.\" Regarding appeals from agency decisions generally, this court has stated:\n\nThis court's review is . . . qualified by the principle that the agency's decision carries a presumption of validity[,] and appellant has the heavy burden of making a convincing showing that the decision is invalid because it is unjust and unreasonable in its consequences. Konno v. County of Hawaii, 85 Hawaii 61, 77, 937 P.2d 397, 413 (1997) (citations omitted).\n\nHRS § 91-14(g) (1993) enumerates the standards of review applicable to an agency appeal and provides: Upon review of the record the court may affirm the decision of the agency or remand the case with instructions for further proceedings; or it may reverse or modify the decision and order if the substantial rights of the petitioners may have been prejudiced because the administrative findings, conclusions, decisions, or orders are:\n\n(1) In violation of constitutional or statutory provisions; or\n\n(2) In excess of the statutory authority or jurisdiction of the agency; or\n\n(3) Made upon unlawful procedure; or\n\n(4) Affected by other error of law; or\n\n(5) Clearly erroneous in view of the reliable, probative, and substantial evidence on the whole record; or\n\n(6) Arbitrary, or capricious, or characterized by abuse of discretion or clearly unwarranted exercise of discretion.\n\nGATRI v. Blane, 88 Hawaii 108, 112, 962 P.2d 367, 371 (1998) (citing Poe v. Hawaii Labor Relations Board, 87 Hawaii 191, 194-95, 953 P.2d 569, 572-73 (1998)).\n\n[FOFs] are reviewable under the clearly erroneous standard to determine if the agency decision was clearly erroneous in view of reliable, probative, and substantial evidence on the whole record. Alvarez v. Liberty House, Inc., 85 Hawaii 275, 277, 942 P.2d 539, 541 (1997); HRS § 91-14(g)(5).\n\n[COLs] are freely reviewable to determine if the agency's decision was in violation of constitutional or statutory provisions, in excess of statutory authority or jurisdiction of agency, or affected by other error of law. Hardin v. Akiba, 84 Hawaii 305, 310, 933 P.2d 1339, 1344 (1997) (citations omitted); HRS §§ 91-14(g)(1), (2), and (4).\n\n\"A COL that presents mixed questions of fact and law is reviewed under the clearly erroneous standard because the conclusion is dependent upon the facts and circumstances of the particular case.\" Price v. Zoning Bd. of Appeals of City and County of Honolulu, 77 Hawaii 168, 172, 883 P.2d 629, 633 (1994). When mixed questions of law and fact are presented, an appellate court must give deference to the agency's expertise and experience in the particular field. Dole Hawaii Division-Castle \u0026 Cooke, Inc. v. Ramil, 71 Haw. 419, 424, 794 P.2d 1115, 1118 (1990). \"[T]he court should not substitute its own judgment for that of the agency.\" Id. (citing Camara v. Agsalud, 67 Haw. 212, 216, 685 P.2d 794, 797 (1984)).\n\nPoe, 87 Hawaii at 197, 953 P.2d at 573.\n\nCurtis v. Board of Appeals, 90 Hawaii 384, 392-93, 978 P.2d 822, 830-31 (1999).\n\nAn FOF or a mixed determination of law and fact is clearly erroneous when (1) the record lacks substantial evidence to support the finding or determination, or (2) despite substantial evidence to support the finding or determination, the appellate court is left with the definite and firm conviction that a mistake has been made. See Leslie v. Estate of Tavares, 91 Hawaii 394, 399, 984 P.2d 1220, 1225 (1999). \"We have defined 'substantial evidence' as credible evidence which is of sufficient quality and probative value to enable a person of reasonable caution to support a conclusion.\" Id. (quoting State v. Kotis, 91 Hawaii 319, 328, 984 P.2d 78, 87 (1999)).\n\nIn re Water Use Permit Applications (Waiahole), 94 Hawaii 97, 118-19, 9 P.3d 409, 430-31 (2000) (some brackets added and some in original).\n\nB. Review Of Decisions Of The Commission Relating To State Water Resources Trust\n\nFinally, the special public interests in trust resources demand that this court observe certain qualifications of its standard of review . . . . As in other cases, agency decisions affecting public trust resources carry a presumption of validity. The presumption is particularly significant where the appellant challenges a substantive decision within the agency's expertise as \"clearly erroneous,\" HRS § 91-14(g)(5), \"arbitrary,\" \"capricious,\" or an \"abuse of discretion,\" HRS § 91-14(g)(6). See Save Ourselves[v. Louisiana Env't Control Comm'n], 452 So. 2d [1152,] 1159 [(La. 1984)].\n\nThe public trust, however, is a state constitutional doctrine. As with other state constitutional guarantees, the ultimate authority to interpret and defend the public trust in Hawaii rests with the courts of this state. See State v. Quitog, 85 Hawaii 128, 130 n.3, 938 P.2d 559, 561 n.3 (1997) (recognizing the Hawaii Supreme Court as the \"ultimate judicial tribunal with final, unreviewable authority to interpret and enforce the Hawaii Constitution\").\n\nJudicial review of public trust dispensions complements the concept of a public trust. . . . \"The duties imposed upon the state are the duties of a trustee and not simply the duties of a good business manager.\" Kadish v. Arizona State Land Dep't, 155 Ariz. 484, 487, 747 P.2d 1183, 1186 (1987), aff'd, 490 U.S. 605 . . . (1989). Just as private trustees are judicially accountable to their beneficiaries for dispositions of the res, so the legislative and executive branches are judicially accountable for the dispositions of the public trust. The beneficiaries of the public trust are not just present generations but those to come. The check and balance of judicial review provides a level of protection against improvident dissipation of an irreplaceable res.\n\nArizona Cent. for Law in Pub. Interest v. Hassal, 172 Ariz. 356, 837 P.2d 158, 168-69 (Ariz. Ct. App. 1991), review dismissed, 172 Ariz. 356, 837 P.2d 158 (1992) (brackets and citation omitted).\n\nThis is not to say that this court will supplant its judgment for that of the legislature or agency. However, it does mean that this court will take a \"close look\" at the action to determine if it complies with the public trust doctrine and it will not act merely as a rubber stamp for agency or legislative action.\n\nKootenai [Envtl. Alliance v. Panhandle Yacht Club, Inc.], 671 P.2d [1085,] 1092 [(Idaho 1983)] (emphasis added.) See also Owsichek [v. State, Guide Licensing and Control Bd.], 763 P.2d [488,] 494 [(Alaska 1988)] (holding that grants of exclusive rights to harvest natural resources should be subjected to \"close scrutiny\"); Weden v. San Juan County, 135 Wash. 2d 678, 958 P.2d 273, 283 (1998) (observing that, even absent a constitutional mandate, \"courts review legislation under the public trust doctrine with a heightened degree of judicial scrutiny, as if they were measuring that legislation against constitutional protections\") (citation and internal quotation marks omitted).\n\nWaiahole, 94 Hawaii at 143-44, 9 P.3d at 455-56.\n\nC. Interpretation Of The State Water Code\n\n. . . . In construing statutes, we have recognized that\n\nour foremost obligation is to ascertain and give effect to the intention of the legislature, which is to be obtained primarily from the language contained in the statute itself. And we must read statutory language in the context of the entire statute and construe it in a manner consistent with its purpose.\n\nWhen there is doubt, doubleness of meaning, or indistinctiveness or uncertainty of an expression used in a statute, an ambiguity exists. . . .\n\nIn construing an ambiguous statute, \"[t]he meaning of the ambiguous words may be sought by examining the context, with which the ambiguous words, phrases, and sentences may be compared, in order to ascertain their true meaning.\" HRS § 1-15(1) [(1993)]. Moreover, the courts may resort to extrinsic aids in determining legislative intent. One avenue is the use of legislative history as an interpretive tool.\n\nGray [v. Administrative Dir. of the Court], 84 Hawaii 138,] 148, 931 P.2d [580,] 590 [(1997)] (quoting State v. Toyomura, 80 Hawaii 8, 18-19, 904 P.2d 893, 903-04 (1995)) (brackets and ellipsis points in original) (footnote omitted). This court may also consider \"[t]he reason and spirit of the law, and the cause which induced the legislature to enact it . . . to discover its true meaning.\" HRS § 1-15(2) (1993). \"Laws in pari materia, or upon the same subject matter, shall be construed with reference to each other. What is clear in one statute may be called upon in aid to explain what is doubtful in another.\" HRS § 1-16 (1993).\n\nBarnett v. State, 91 Hawaii 20, 31, 979 P.2d 1046, 1057 (1999) (quoting State v. Davia, 87 Hawaii 249, 254, 953 P.2d 1347, 1352 (1998)).\n\nIf we determine, based on the foregoing rules of statutory construction, that the legislature has unambiguously spoken on the matter in question, then our inquiry ends. See, e.g., Chevron U.S.A., Inc. v. Natural Resources Defense Council, Inc., 467 U.S. 837, 842-43, 104 S.Ct. 2778, 81 L.Ed.2d 694 (1984)). When the legislative intent is less than clear, however, this court will observe the \"well established rule of statutory construction that, where an administrative agency is charged with the responsibility of carrying out the mandate of a statute which contains words of broad and indefinite meaning, courts accord persuasive weight to administrative construction and follow the same, unless the construction is palpably erroneous.\" Brown v. Thompson, 91 Hawaii 1, 18, 979 P.2d 586, 603 (1999) (quoting Keliipuleole v. Wilson, 85 Hawaii 217, 226, 941 P.2d 300, 309 (1997)). Seealso Government Employees Ins. Co. v. Hyman, 90 Hawaii 1, 5, 975 P.2d 211, 215 (1999) (\"[J]udicial deference to agency expertise is a guiding precept where the interpretation and application of broad or ambiguous statutory language by an administrative tribunal are the subject of review.\" (quoting Richard v. Metcalf, 82 Hawaii 249, 252, 921 P.2d 169, 172 (1996))). [Footnote omitted]. Such deference \"reflects a sensitivity to the proper roles of the political and judicial branches,\" insofar as \"the resolution of ambiguity in a statutory text is often more a question of policy than law.\" Pauley v. BethEnergy Mines, Inc., 501 U.S. 680, 696, 111 S.Ct. 2524, 115 L.Ed.2d 604 (1991).\n\nThe rule of judicial deference, however, does not apply when the agency's reading of the statute contravenes the legislature's manifest purpose. See Camara v. Agsalud, 67 Haw. 212, 216, 685 P.2d 794, 797 (1984) (\"To be granted deference, . . . the agency's decision must be consistent with the legislative purpose.\"); State v. Dillingham Corp., 60 Haw. 393, 409, 591 P.2d 1049, 1059 (1979) (\"[N]either official construction or usage, no matter how long indulged in, can be successfully invoked to defeat the purpose and effect of a statute which is free from ambiguity. . . .\"). Consequently, we have not hesitated to reject an incorrect or unreasonable statutory construction advanced by the agency entrusted with the statute's implementation. See, e.g., Government Employees Ins. Co. v. Dang, 89 Hawaii 8, 15, 967 P.2d 1066, 1073 (1998); In re Maldonado, 67 Haw. 347, 351, 687 P.2d 1, 4 (1984).\n\nWaiahole, 94 Hawaii at 144-45, 9 P.3d at 456-57 (brackets and ellipsis points in original) (footnote omitted).\n\nIII. DISCUSSION\n\nA. The Commission's Decision Violated DHHL's Reservation Rights As Guaranteed By The HHCA, The Hawaii Constitution, The Code, And The Public Trust Doctrine.\n\nThe present appeal addresses an issue of first impression, namely, the extent to which a reservation of water precludes an applicant for a \"new\" water use permit from satisfying the conditions requisite to obtaining such permit, as set forth in HRS § 174C-49(a), see supra note 1. The crux of the appellants' contentions on appeal stem from (1) the Commission's decision that a \"reservation\" of water did not constitute an \"existing legal use\" for purposes of the Code and (2) the Commission's finding that DHHL's \"reservations\" were aquifer- specific and that, therefore, MR-Wai`ola's application for a water use permit in the Kamiloloa aquifer system could not interfere with DHHL's reservation in the Kualapu`u aquifer system as a matter of law. We address the foregoing issues at the outset because they are outcome-dispositive of many of the appellants' points of error. 1. Reservations of water are aquifer-specific. The Ritte intervenors, with whom OHA and the Kahae intervenors join, contend that the Commission's conclusion that DHHL's reservations were aquifer-specific and, therefore, that MR-Wai`ola's proposed water use in the Kamiloloa aquifer system would not interfere with DHHL's reservation rights in the Kualapu`u aquifer system was arbitrary, capricious, and contrary to Hawaii law.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e More specifically, the Ritte intervenors assert that the concept of \"separate\" aquifer systems, upon which the Commission predicated its decision, was incongruous with the hydrological evidence adduced at the contested case hearing -- i.e., that the Kamiloloa and Kualapu`u aquifer systems were hydrologically connected and, thus, that a drawdown of water from one aquifer would, of necessity, affect the other. The Ritte intervenors posit that the Commission formulated the sixteen aquifers on Moloka`i based on topographical distinctions for \"administrative convenience\" and, in so doing, deprived DHHL of the effective use of its 2.905 mgd reservation in the Kualapu`u aquifer system, as guaranteed by HAR § 13-171-63, see supra note 13.\n\nThe Commission responds that, although neither the HAR nor the Code expressly define the term \"reservation,\" the relevant sections that utilize the term imply that \"reservations\" are indeed aquifer-specific. The Commission argues that the HAR expressly entitle DHHL to a designated quantity of water in a particular aquifer and that, inasmuch as \"[a]ctual use of reserved water requires a water use permit,\" a reservation of water is \"almost [on] the same footing as another party's application for water.\"\n\nSimilarly, MR-Wai`ola discounts the appellants' argument that, hydrologically speaking, the sixteen aquifers of Moloka`i are connected and, therefore, actually constitute a single overarching aquifer. In this regard, MR-Wai`ola contends that each aquifer has its own sustainable yield\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e of water and that the Code authorizes the Commission to establish each hydrologic unit\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e and sustainable yield through the adoption of the State Water Resources Protection Plan. As such, MR-Wai`ola maintains that, in order to change the boundaries of hydrologic units and sustainable yields, the Commission would have to conduct a separate rule-making process, and, therefore, that to accept the appellants' argument (i.e., that the Kamiloloa and Kualapu`u aquifers are, in fact, a single aquifer) \"would circumvent the Hawaii Administrative Procedures Act and rewrite rules without going through the proper process.\" Finally, MR-Wai`ola asserts that, assuming arguendo that the Kualapu`u and Kamiloloa aquifers were a single aquifer, the combined sustainable yields could nonetheless accommodate DHHL's 2.905 mgd reservation in addition to the permitted allocation of 655,928 gpd to MR-Wai`ola. Although we agree that the HAR denominate aquifer-specific reservations of water to DHHL, we hold that such a limitation for purposes of water resource management does not divest DHHL of its right to protect its reservation interests from interfering water uses in adjacent aquifers.\n\nPursuant to HRS § 174C-5 (1993), \"[t]he general administration of the state water code shall rest with the commission on water resource management.\" Moreover, \"[t]he commission shall adopt and enforce such rules as may be necessary or convenient to administer\" the Code. HRS § 174C-8 (1993). Pursuant to the foregoing enabling statutes, the Commission adopted HAR § 13-170-2 (1996),\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e which mandates that the Commission formulate the \"Hawaii water plan\" in order to protect, conserve, and manage the waters of the state. HAR § 13-170-2(c) further provides that, \"[i]n preparing the Hawaii water plan[,] each county shall be divided into sections [(aquifers)] which shall conform as closely as practicable to hydrologic units\" and that \"[t]he Plan shall describe and inventory the . . . [s]ustainable yield.\" See supra note 27. The HAR also require the counties, in developing their own water use and development plan, to \"utilize the hydrologic units designated statewide by the commission for the presentation of data and analyses.\" HAR § 13-170-32(a) (1996); see also HAR §§ 13-170-30 and 13-170-42 (1996).\n\nWith respect to interpreting the HAR,\n\n[t]he general principles of construction which apply to statutes also apply to administrative rules. As in statutory construction, courts look first at an administrative rule's language. If an administrative rule's language is unambiguous, and its literal application is neither inconsistent with the policies of the statute the rule implements nor produces an absurd or unjust result, courts enforce the rule's plain meaning.\n\nInternational Bhd. of Elec. Workers, Local 1357 v. Hawaiian Tel. Co., 68 Haw. 316, 323, 713 P.2d 943, 950 (1986) (citations omitted). Moreover, an administrative agency's interpretation of its own rules is entitled to \"deference unless it is plainly erroneous or inconsistent with the underlying legislative purpose.\" Id.\n\nLee v. Elbaum, 77 Hawaii 446, 457, 887 P.2d 656, 667 (App. 1993). Furthermore, \"insofar as an administrative hearings officer possesses expertise and experience in his or her particular field, the appellate court 'should not substitute its own judgment for that of the agency[.]'\" Okada Trucking Co., Ltd. v. Board of Water Supply, 97 Hawaii 450, 458, 40 P.3d 73, 81, reconsideration denied, 101 Hawaii 233, 65 P.3d 180 (2002).\n\nIn the present matter, HAR § 13-171-63, see supra note 13, expressly reserves 2.905 mgd of groundwater for DHHL in the Kualapu`u aquifer system. On its face, HAR § 13-171-63 is unambiguously aquifer-specific in that the Commission dedicated a precise quantity of water in a particular aquifer for an enumerated purpose. In promulgating HAR § 13-171-63, the Commission, using the \"best available information,\" see HAR § 13-170-2(c)(3) supra note 27, ascertained the sustainable yield in the Kualapu`u aquifer and designated a reservation of water in such quantity as was deemed necessary for purposes that were consistent with the use of Hawaiian home lands, pursuant to HHCA § 221 and HRS § 174C-101(a). See HAR § 13-171-60(b) (1996). That being the case, insofar as (1) the Commission, as the agency authorized to administer the Code, determines the contents of the Hawaii water plan, which includes the designation of hydrologic units and sustainable yields, and (2) the Commission's \"interpretation of its own rules is entitled to 'deference unless it is plainly erroneous or inconsistent with the underlying legislative purpose,'\" Lee, 77 Hawaii at 457, 887 P.2d at 667, we believe that it is within the Commission's authority to limit reservations of water to specific aquifers.\n\nMoreover, assuming arguendo that the Commission's designation of the sixteen aquifers on Molokai was strictly topographical -- i.e., without consideration of any sub-surface geological barriers that divide the bodies of underground water -- we do not believe that this court should redefine what constitutes an aquifer, or DHHL's aquifer-specific reservations for that matter, based purely on the hydrological data on the record before us. Quite simply, the Commission possesses the expertise and experience in its particular field and, thus, is in a better position to amend the HAR if necessary. Cf. Koolau Agricultural Co., Ltd. v. Commission On Water Resource Management, 83 Hawaii 484, 493, 927 P.2d 1367, 1376 (1996) (\"The Commission, by virtue of its agency expertise, is certainly in a better position than the courts to evaluate scientific investigations and research to determine whether a water resource may be threatened by existing or proposed withdrawals and diversions of water.\" (Internal quotation marks omitted.)). Thus, in light of the foregoing, the Commission's designation of aquifer-specific reservations, as set forth in HAR §§ 13-171-61 through 63, although based in part on topographical distinctions, was not arbitrary, capricious, or contrary to law.\n\nNotwithstanding the foregoing, HAR § 13-171-63 does not divest DHHL of its statutory and public trust rights to protect and preserve its reservation interests from interfering uses in adjacent aquifers. See HRS § 174C-49(a)(7), supra note 1 (\"[T]he applicant must establish that the proposed use of water . . . [w]ill not interfere with the rights of the [DHHL] as provided in section 221 of the [HHCA].\"); HRS § 174C-49(e), supra note 1 (\"All permits issued by the commission shall be subject to the rights of the [DHHL] as provided in section 221 of the [HHCA], whether or not the condition is explicitly stated in the permit.\"); HRS § 174C-53(b), supra note 5 (\"[T]he commission need consider only those objections filed by a person who has some property interest in any land within the hydrologic unit . . . or who will be directly and immediately affected by the water use proposed in the application. . . .\"); HRS § 174C-101(a), supra note 4 (\"Decisions of the commission on water resource management . . . shall, to the extent applicable and consistent with other legal requirements and authority, incorporate and protect adequate reserves of water for current and foreseeable development and use of Hawaiian home lands as set forth in section 221 of the [HHCA].\"). To hold otherwise would cripple DHHL's ability to contest proposed uses in adjacent aquifers that could significantly diminish its ability to utilize its reservations in the future simply because the proposed use was outside the Kualapu`u aquifer; such an interpretation defies not only legal but also scientific logic. That being the case, MR-Wai`ola had the burden of establishing, pursuant to HRS § 174C-49(a)(7), that the proposed use would not interfere with DHHL's 2.905 reservation of water in the Kualapu`u aquifer system. Likewise, the Commission was duty bound to hold MR-Wai`ola to its burden under the Code and the public trust doctrine. See further discussion infra in section III.A.3.c. 2. A reservation of water does not constitute an existing legal use, for purposes of HRS § 174C-49(a)(3). One of the conditions requisite to obtaining a water use permit, pursuant to HRS § 174C-49(a), is that the proposed use \"not interfere with any existing legal use of water.\" See HRS § 174C-49(a)(3) supra note 1 (emphases added). The appellants presuppose, or otherwise urge this court to hold, that a \"reservation\" of water constitutes an \"existing legal use,\" for purposes of HRS § 174C-49(a)(3). The appellants essentially contend that HHCA §§ 220 and 221 grant to DHHL a \"first call\" right to all \"government-owned\" waters and that the 1991 amendments to the Code -- namely, HRS §§ 174C-49 and 174C-101 -- incorporated DHHL's priority water rights under the HHCA by mandating that the State reserve water for DHHL's water needs and protect DHHL's reservations against competing interests. The appellants assert that the Commission erred in concluding (1) that DHHL's reservation in the Kualapu`u aquifer system was not an \"existing legal use\" and (2) that MR-Wai`ola's proposed water use in the Kamiloloa aquifer system would not affect DHHL's reservation rights in the Kualapu`u aquifer system. The appellants maintain that the Commission \"has a duty to set aside adequate reservations to meet DHHL's current and foreseeable needs\" and that \"DHHL's rights take priority over other government and private interests,\" all of which requires the Commission to \"insure that other users do not interfere with DHHL's reservations.\"\n\nFor its part, DHHL argues that the legislature amended the Code in order to grant DHHL an \"'absolute' priority to water\" by (1) requiring applicants for new water use permits to establish that the proposed use would not interfere with DHHL's rights, see HRS § 174C-49(a)(7), supra note 1, (2) mandating that existing users be subject to DHHL's rights under HHCA § 221, see HRS § 174C-49(e), and (3) providing that the Commission \"incorporate and protect adequate reserves of water for current and foreseeable development and use of Hawaiian home lands as set forth in section 221 of the [HHCA],\" see HRS § 174C-101(a). In addition, DHHL contends that the increased salinity in its existing wells in Kualapu`u, the Commission's rejection of DHHL's application to pump additional water from its existing wells, and MR-Wai`ola's proposed well, in combination, will inevitably force DHHL (1) to decrease its permitted uses, (2) forego exercising its reservation rights from its existing wells in Kualapu`u, and (3) acquire alternative water sources that are both geographically and economically undesirable.\n\nThus, the appellants posit that \"the only effective way to give meaning to a reservation is not to grant other uses subject to recall, but to actually bar use which draws down any of DHHL's reserved water.\"\n\nThe Commission counters that, inasmuch as HRS § 174C-49(d) separately denominates \"existing legal uses\" and \"reservations,\" it would be fallacious to interpret a \"reservation\" as coextensive with an \"existing legal use.\" In addition, the Commission reiterates its argument that reservations of water are aquifer-specific and that, therefore, the proposed use in the Kamiloloa aquifer system would not interfere with DHHL's existing uses or reservation rights in the Kualapu`u aquifer system.\n\nWe agree with the Commission that, pursuant to the plain language of HRS § 174C-49(d) and HAR § 13-171-63, a \"reservation\" of water does not constitute an \"existing legal use\" for purposes of HRS § 174C-49(a)(3). At the outset, we note that the term \"reservation\" is nowhere defined in the HRS or the HAR. Both the HRS and the HAR, however, expressly refer to a \"reservation\" of water. See HRS § 174C-49(d) and HAR §§ 13-171-61 through 63 (designating reservations of water to DHHL in certain WMAs on O`ahu and Moloka`i). Specifically, HRS § 174C-49(d), see supra note 1, provides that \"[t]he commission, by rule, may reserve water in such locations and quantities . . . as in its judgment may be necessary. Such reservations shall be subject to periodic review and revision in light of changed conditions; provided that all presently existing legal uses of water shall be protected.\" (Emphases added.) Moreover, HAR § 13-171-63 states that DHHL's 2.905 mgd reservation of groundwater from state lands in the Kualapu`u aquifer system \"shall be in excess of the existing uses of water on Hawaiian home lands[.]\" (Emphasis added.) The foregoing language plainly and unambiguously distinguishes a \"reservation\" from an \"existing legal use,\" and, accordingly, it is inconceivable that the legislature intended that the terms be coextensive with each other. We therefore hold that a \"reservation\" of water does not constitute an \"existing legal use\" within the meaning of HRS § 174C-49(a)(3).\n\nAlthough we ground our holding in the plain language of HRS § 174C-49(d) and HAR § 13-171-63, we nonetheless note that, to read the Code as defining a \"reservation\" as an \"existing legal use\" would also render HRS § 174C-49(a)(7), which expressly addresses DHHL's rights under the HHCA, superfluous. See supra note 1. HRS § 174C-49(a)(7) requires that an applicant for a water use permit establish that the proposed use \"[w]ill not interfere with the rights of the [DHHL] as provided in Section 221 of the [HHCA].\" That being the case, insofar as DHHL's right to reservations of \"sufficient water . . . for current and foreseeable domestic, stock water, aquaculture, and irrigation activities\" stem from HHCA § 220, HRS § 174C-49(a)(7), and not HRS § 174C-49(a)(3), protects DHHL's reservation rights in the present matter. See Coon v. City and County of Honolulu, 98 Hawaii 233, 250, 47 P.3d 348, 365 (2002) (\"'Our rules of statutory construction requires us to reject an interpretation of [a] statute . . . that renders any part of the statutory language a nullity.'\") (quoting Potter v. Hawaii Newspaper Agency, 89 Hawaii 411, 423-24, 974 P.2d 51, 63-64 (1999) (citations omitted) (bracket in original)); Keliipuleole v. Wilson, 85 Hawaii 217, 221, 941 P.2d 300, 304 (1997) (\"'[C]courts are bound to give effect to all parts of a statute, and that no clause, sentence, or word shall be construed as superfluous, void, or insignificant if a construction can be legitimately found which will give force to and preserve all words of the statute.'\") (Citations omitted.). Thus, \"existing legal uses\" and \"reservations\" of water constitute distinct interests in the State's water resources, which HRS § 174C-49(a) protects separately against interference by competing interests. 3. Reservations of water constitute a public trust purpose, which the commission has a duty to protect in balancing the competing interests for a water use permit application. The appellants assert that the Commission's decision violated the State's constitutional public trust duty to honor and carry out the terms and conditions of the HHCA. The appellants essentially contend that DHHL has an \"absolute\" or \"first call\" priority to all government-owned waters. More specifically, the appellants argue (1) that DHHL's priority water rights stem from HHCA §§ 220 and 221, the Hawaii Constitution, which adopted the HHCA as a provision of the state Constitution, and HRS §§ 174C-49, 174C-101, and 174C-31 (1993) and (2) that the legislature intended to insure that Hawaiian homelands (a) received adequate water for future uses, (b) not be prejudiced by DHHL's delay in developing infrastructure for Hawaiian homestead lands, and (c) not be prejudiced by other private land owners' attempts to exploit water resources without regard to the present and future needs of DHHL. Put simply, the appellants maintain that the Commission is subject to a duty to set aside adequate reservations of water to meet DHHL's current and future needs and to insure that other users do not interfere with DHHL's reservations of water, all of which takes priority over other government and private interests.\n\nAs we mentioned supra in section III.A.2, the appellants posit that MR-Wai`ola's proposed well would adversely affect DHHL's section 221 \"first call\" rights to water from government lands and DHHL's ability to exercise its 2.905 mgd reservation in the Kualapu`u aquifer system in light of the fact that the Commission had previously rejected DHHL's request to pump additional water from its existing wells in Kualapu`u due to rising salinity, which, in turn, would inevitably require DHHL to drill a new well in close proximity to MR-Wai`ola's proposed well site in Kamiloloa. The appellants argue that if DHHL were subject to the impairment of its ability to withdraw water from its reservation by virtue of intervening water use permits granted prior to DHHL obtaining its own water use permit, then DHHL's reservation would be completely illusory, affording no rights beyond those already enjoyed by persons without existing reservations.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThe Commission counters that its decision upholds the public trust doctrine, the Commission having \"evaluated the water available, evaluated the competing interests, and . . . accommodate[d] all interests in the Kamiloloa aquifer.\" In particular, the Commission maintains that its decision accommodated all of the parties' interests by allocating only one-half of the quantity of water that MR-Wai`ola had requested and keeping all allocations from the Kamiloloa aquifer system significantly below the sustainable yield without adversely affecting the near-shore environment. The Commission asserts that it considered DHHL's argument that it needed more water from the Kualapu`u aquifer and recognized that DHHL had a reservation in Kualapu`u for 2.905 mgd. The Commission, however, argues that DHHL was unable to demonstrate additional future needs of water distinct from its reservation in Kualapuu and that there was evidence that DHHL could secure other sources of water for future development if necessary. As such, the Commission contends that, inasmuch as DHHL's evidence regarding its future needs was speculative, it correctly found that DHHL was able to use its reservation in the Kualapu`u aquifer and that the proposed use would not interfere with DHHL's reservation rights protected by the HHCA.\n\n(a) This court's decision in Waiahole\n\nIn Waiahole, this court held that the public trust doctrine applied \"to all water resources, unlimited by any surface-ground distinction.\" 94 Hawaii at 133-35, 9 P.3d at 445-47 (affirming Robinson, 65 Haw. at 674, 658 P.2d at 310, wherein the court stated that \"a public trust was imposed upon all the waters of the kingdom\"). In so doing, this court traced the historical development of the public trust doctrine in Hawaii and reasoned therefrom that article XI, sections 1 and 7 of the Hawaii Constitution, see supra note 3, adopted \"the public trust doctrine as a fundamental principle of constitutional law in Hawaii\" and that the legislature, pursuant to the constitutional mandate of article XI, section 7, incorporated public trust principles into the Code. Id. at 130-32, 9 P.3d at 443-45. Moreover, in holding that the Code \"does not supplant the protections of the public trust doctrine,\" this court recognized that \"[e]ven with the enactment and any future development of the Code, the doctrine continues to inform the Code's interpretation, define its permissible 'outer limits,' and justify its existence.\" Id. at 133, 9 P.2d at 445.\n\nIn addressing the substance of the state water resources trust, this court identified three valid trust purposes, which the Commission was duty-bound to protect against competing interests in the State's water resources: (1) water resource protection, which includes \"the maintenance of waters in their natural state\" as \"a distinct use\" and \"disposes of any portrayal of retention of waters in their natural state as 'waste'\"; (2) domestic use protection, particularly drinking water; and (3) the exercise of native Hawaiian and traditional and customary rights. Id. at 136-38, 9 P.3d at 448-50. This court held, however, \"that, while the state water resources trust acknowledges that private use for 'economic development' may produce important public benefits and that such benefits must figure into any balancing of competing interests in water,\" private commercial use is not a public trust purpose. Id. at 138, 9 P.3d at 350. This court opined that \"if the public trust is to retain any meaning and effect, it must recognize enduring public rights in trust resources separate from, and superior to, the prevailing private interests in the resources at any given time.\" Id. (Emphasis added.) Consequently, this court affirmed the Commission's conclusion that the public trust doctrine \"effectively prescribes a 'higher level of scrutiny' for private commercial uses . . . [and] that the burden ultimately lies with those seeking or approving such uses to justify them in light of the purposes protected by the trust.\" Id. at 142, 9 P.3d at 454.\n\nThis court has described the public trust relating to water resources as the authority and duty \"to maintain the purity and flow of our waters for future generations and to assure that the waters of our land are put to reasonable and beneficial uses.\" Id. at 674, 658 P.2d at 310 (emphases added). Similarly, article XI, section 1 of the Hawaii Constitution requires the state both to \"protect\" natural resources and to promote their \"use and development.\" The state water resources trust thus embodies a dual mandate of 1) protection and 2) maximum reasonable and beneficial use.\n\nThe mandate of \"protection\" coincides with the traditional notion of the public trust developed with respect to navigable and tidal waters. As commonly understood, the trust protects public waters and submerged lands against irrevocable transfer to private parties, see, e.g., Illinois Central [Railroad Co. v. Illinois], [146 U.S. 387, 452-53 (1892),] [] or \"substantial impairment,\" whether for private or public purposes, see, e.g., State v. Public Serv. Comm'n, [81 N.W.2d 71, 74 (Wis. 1957)] []. In this jurisdiction, our decisions in McBryde and its progeny and the plain meaning and history of the term \"protection\" [footnote omitted] in article XI, section 1 and article XI, section 7 establish that the state has a comparable duty to ensure the continued availability and existence of its water resources for present and future generations.\n\nId. at 138-39, 9 P.3d at 450-51. In Hawaii, \"the water resources trust also encompasses a duty to promote the reasonable and beneficial use of water resources in order to maximize their social and economic benefits to the people of this state.\" Id.; see also article XI, section 1 of the Hawaii Constitution, supra note 3 (\"For the benefit of present and future generations, the State . . . shall promote the development and utilization of these [water] resources in a manner consistent with their conservation and in furtherance of the self-sufficiency of the State.\"). As we have mentioned, however, maximizing the water resource's social and economic benefits includes the protection of the resource in its natural state. Thus, unlike other jurisdictions, this court noted that \"the object is not maximum consumptive use, but rather the most equitable, reasonable, and beneficial allocation of state water resources, with full recognition that resource protection also constitutes 'use.'\" Id. at 140, 9 P.3d at 452.\n\nFinally, with respect to balancing the foregoing mandates of the state water resources trust, this court held that the trust embodies the following fundamental principles. Id. at 141-43, 9 P.3d at 453-55. First, \"the state has both the authority and duty to preserve the rights of present and future generations in the waters of the state,\" which, in effect, \"precludes any grant or assertion of vested rights to use water to the detriment of a public trust purpose.\" Id. \"This authority empowers the state to revisit prior diversions and allocations, even those made with due consideration of their effect on the public trust.\" Id. at 141, 9 P.3d at 453. Second, \"[t]he state [] bears an 'affirmative duty to take the public trust into account in the planning and allocation of water resources, and to protect public trust uses whenever feasible.'\" Id. at 141, 9 P.3d at 453 (quoting National Audubon Society v. Superior Court of Alpine County, 658 P.2d 709, 728, cert. denied, 464 U.S. 977 (Cal. 1983)) (emphasis in original) (footnote omitted). Third, there are no \"absolute priorities between broad categories of [trust] uses under the water resources trust,\" precisely because all public trust purposes must be protected; thus, the Commission must \"weigh competing public and private water uses on a case-by-case basis[.]\" Id. at 142, 9 P.3d at 454. That being the case, the Commission, \"as the primary guardian of public rights under the trust,\" must \"take the initiative in considering, protecting, and advancing public rights in the resource at every stage of the planning and decisionmaking process.\" Id. at 143, 9 P.3d at 455. \"In sum, the state may compromise public rights in the resource pursuant only to a decision made with a level of openness, diligence, and foresight commensurate with the high priority these rights command under the laws of our state.\" Id.\n\n(b) Reservations: a public trust purpose\n\nWe have consistently recognized the heightened duty of care owed to the native Hawaiians. See PASH, 79 Hawaii at 451, 903 P.2d at 1272 (holding that the Hawaii Planning Commission must protect the reasonable exercise of customary and traditional rights of the native Hawaiians); Pele Defense Fund v. Paty, 73 Haw. 578, 620-21, 837 P.2d 1247, 1272 (1992) (holding that \"native Hawaiian rights protected by article XII, section 7 may extend beyond the ahupuaa in which a native Hawaiian resides\"); Kalipi v. Hawaiian Trust Company, Ltd., 66 Haw. 1, 7-8, 656 P.2d 745, 749 (1982) (interpreting HRS § 7-1 \"to assure that lawful occupants of an ahupua[`]a may, for the purposes of practicing native Hawaiian customs and traditions, enter undeveloped lands within the ahupua[`]a to gather those items enumerated in the statute\"); Ahuna v. Department of Hawaiian Home Lands, 64 Haw. 327, 338, 640 P.2d 1161, 1168 (1982) (holding that DHHL assumed the obligation to implement the state's fiduciary duty under the HHCA on behalf of eligible native Hawaiians). Native Hawaiians' water rights are no exception. Waiahole, 94 Hawaii at 137, 9 P.3d at 449 (upholding the exercise of native Hawaiian and traditional and customary rights as a public trust purpose).\n\nOur analysis in Waiahole, however, begs the question whether a reservation of water constitutes a public trust purpose with respect to the state's continuing trust obligation to \"ensure the continued availability and existence of its water resources for present and future generations.\" 94 Hawaii at 139, 9 P.3d at 451. We answer the foregoing in the affirmative and hold that, pursuant to article XI, sections 1 and 7 of the Hawaii Constitution, HHCA § 220(d), and HRS § 174C-101(a), a reservation of water constitutes a public trust purpose. As discussed supra in section III.A.3.a, the Commission bears a duty to protect the continued availability of water resources in balancing the competing interests for a water use permit. In addition, HHCA § 220(d), see supra note 2, expressly requires that \"sufficient water shall be reserved for current and foreseeable domestic, stock water, aquaculture, and irrigation activities on tracts leased to native Hawaiians . . . .\" Moreover, HRS § 174C-101(a) states in relevant part that \"[d]ecisions of the commission on water resource management relating to the planning for, regulation, management, and conservation of water resources in the State shall . . . incorporate and protect adequate reserves of water for current and foreseeable development and use of Hawaiian home lands as set forth in section 221 of [HHCA].\" (Emphasis added.) See also HRS § 174C-49(e), supra note 1 (\"All permits issued by the commission shall be subject to the rights of the [DHHL] as provided in section 221 of the [HHCA], whether or not the condition is explicitly stated in the permit.\"). Inasmuch as a reservation of water is an essential mechanism by which to effectuate the State's public trust duty to \"ensure the continued availability and existence of its water resources for present and future generations,\" see Waiahole, 94 Hawaii at 139, 9 P.3d at 451, we hold that DHHL's reservations of water throughout the State are entitled to the full panoply of constitutional protections afforded the other public trust purposes enunciated by this court in Waihole. To hold otherwise would undermine the public trust doctrine, which is a state constitutional doctrine, and the relevant policy declarations set forth in the Code. See HRS § 174C-101(a), supra note 4 (\"Traditional and customary rights of ahupuaa tenants . . . shall not be abridged or denied by this chapter.\"); HRS § 174C-2(c), supra note 21 (\"[A]dequate provision shall be made for . . . the protection and procreation of fish and wildlife, the maintenance of proper ecological balance and scenic beauty, and the preservation and enhancement of waters of the State for municipal uses, public recreation, public water supply, agriculture, and navigation. . . .\").\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\n(c) Although the Commission discharged its public trust duty to protect DHHL's existing legal uses in the Kualapu`u aquifer, it failed adequately to discharge its duty to protect DHHL's reservation in the Kualapu`u aquifer.\n\nIn light of the foregoing, we now address whether the Commission discharged its duty to protect DHHL's reservation rights in the Kualapu`u aquifer system against competing interests in the state's water resources trust. To begin, we recognize that, generally, \"agency decisions affecting public trust resources carry a presumption of validity.\" Waiahole, 94 Hawaii at 143, 9 P.3d at 455. Moreover, \"[t]he presumption is particularly significant where the applicant challenges a substantial decision within the agency's expertise as 'clearly erroneous,' HRS § 91-14(g)(5), 'arbitrary,''capricious,' or an 'abuse of discretion,' HRS § 91-14(g)(6).\" Id. However, the foregoing presumption of validity presupposes that the agency has grounded its decision in reasonably clear FOFs and COLs. In the present matter, the record is void of a single FOF regarding whether MR-Wai`ola established that the proposed use would interfere with DHHL's reservation in the Kualapu`u aquifer as mandated by the Code. The Commission concluded that, because (1) HAR § 13-171-63 granted DHHL an aquifer-specific reservation in the Kualapu`u aquifer and (2) the proposed use was located in the Kamiloloa aquifer, MR-Wai`ola need not meet its burden with respect to DHHL's reservation. As discussed supra in section III.A.1, the aquifer-specific nature of DHHL's reservation, as set forth in the HAR, does not eliminate MR-Wai`ola's burden under HRS § 174C-49(a)(7), and, consequently, the Commission was duty bound to hold MR-Wai`ola to its burden.\n\nInasmuch as the Commission failed to render the requisite FOFs and COLs with respect to whether MR-Waiola had satisfied its burden as mandated by the Code, it violated its public trust duty to protect DHHL's reservation rights under the HHCA, the Code, the Hawaii Constitution, and the public trust doctrine in balancing the various competing interests in the state water resources trust. Accordingly, we vacate and remand for the entry of further FOFs and COLs on the matter.\n\nNotwithstanding the foregoing violation of the public trust doctrine, we believe that the Commission upheld its public trust obligation to protect DHHL's existing legal uses in Kualapu`u -- i.e., DHHL's existing wells -- against the competing private commercial use proposed by MR-Wai`ola. As this court observed in Waiahole with respect to offstream uses, article XI, section 1 of the Hawaii Constitution mandates that all water uses, public or private, \"promote the best economic and social interests of the people of this state.\" 94 Hawaii at 141, 9 P.3d at 453. Moreover, as discussed supra in section III.A.3.a, private commercial use for economic development, although not a cognizable trust objective, \"may produce important public benefits and . . . must figure into any balancing of competing interests of water.\" Id. at 138, 9 P.3d at 450. Unquestionably, our decision in Waiahole does not preclude the controlled development of water resources for private commercial use. Id. at 141, 9 P.3d at 453 (\"The public has a definite interest in the development and use of water resources for various reasonable and beneficial public and private offstream purposes[.]\" (Emphasis added.)). Instead, Waiahole ensures (1) that \"any balancing between public and private purposes begin with a presumption in favor of public use, access, and enjoyment,\" id. at 142, 9 P.3d at 454, and (2) that the planning and allocation of water resources for purposes of economic development must account for the public trust and protect public trust uses to the extent feasible. Id. (recognizing that the public trust establishes \"use consistent with trust purposes as the norm or 'default' condition\"). Consequently, we stated that \"reason and necessity dictate that the public trust may have to accommodate offstream diversions inconsistent with the mandate of protection, to the unavoidable impairment of public instream uses and values.\" Id. at 141, 9 P.3d at 453. The Commission, however, owes a duty to \"consider the cumulative impact of existing and proposed diversions on trust purposes and to implement reasonable measures to mitigate this impact, including the use of alternative sources.\" Id. at 143, 9 P.3d at 455.\n\nIn the present matter, the Commission clearly addressed the potential impact of MR-Wai`ola's proposed water use in the Kamiloloa aquifer system on DHHL's existing wells in the Kualapu`u aquifer system. First, the Commission considered two hydrological studies in rendering its FOFs and COLS. In particular, the McNulty Model (proffered by MR-Wai`ola) predicted that the impact of \"pumping 1.25 mgd from the proposed well in Kamiloloa will result in water level declines of 0.17 to 0.32 feet at the existing Kualapu`u well field\" with \"[t]he largest impact . . . at the nearest well\" in Kakalahale. Accordingly, the Commission found that the \"[w]ater level declines at the levels predicted by the McNulty Model would have no measurable effect on the quality or quantity of water drawn from existing wells\" in Kualapu`u. (Emphasis added.) The USGS Model, the study proffered by DHHL, predicted that pumping 1.326 mgd from the proposed well in Kamiloloa (0.076 mgd more than the amount requested by MR-Wai`ola) would result in a drawdown \"greater than 0.1 feet and less than 0.5 feet\" and that \"[s]uch change is likely to be less than normal seasonal fluctuations of the groundwater level and of the same order of magnitude of normal semi-diurnal water level fluctuations created by varying barometric pressure. In other words, the impact is relatively small.\" (Emphasis added.)\n\nSecond, the Commission granted MR-Wai`ola a water use permit for only 655,928 gpd, approximately one-half of the requested quantity, thereby diminishing the foregoing predictions with respect to water-level declines in Kualapu`u, and only for the proposed future uses that were consistent with state and county general plans and land use designations and county land use plans and policies. Finally, in recognition of \"the importance and need for long-range planning for the efficient and effective use of water,\" the Commission's decision proposed a municipal reservation in the Kamiloloa aquifer system, which \"would not be limited to any one user but would be set up for municipal uses as defined in the Water Code.\" Thus, to the extent that the Commission's decision compromised DHHL's existing wells in the Kualapuu aquifer system, we believe that the Commission did so \"with a level of openness, diligence, and foresight commensurate with the high priority these rights command under the laws of our state.\" Waiahole, 94 Hawaii at 143, 9 P.3d at 455.\n\nB. The Commission Clearly Erred In Finding That MR-Waiola Had Satisfied The Conditions Requisite To Obtaining A Water Use Permit, As Set Forth In HRS § 174C-49(a).\n\n\"Hawaii . . . has a bifurcated system of water rights.\" Koolau Agricultural Co., Ltd., 83 Hawaii at 491, 927 P.2d at 1374 (\"In WMAs, the permitting provisions of the Code prevail; water rights in non-designated areas are governed by the common law.\"). Consequently, inasmuch as the entire island of Moloka`i has been designated a WMA, the Code governs all applications for a water use permit on the island. Id. Pursuant to HRS § 174C-48(a), see supra note 17, \"[n]o person shall make any withdrawal, diversion, impoundment, or consumptive use of water [in a WMA] . . . without first obtaining a permit from the commission.\" HRS § 174C-49(a) sets forth the conditions requisite to obtaining a water permit for a \"new,\" as opposed to an \"existing,\" use under the Code. See supra note 1. Moreover, \"[u]nder the public trust and the Code, permit applicants have the burden of justifying their proposed uses in light of protected public rights in the resource. . . . [T]he public trust effectively creates this burden through its inherent presumption in favor of public use, access, and enjoyment.\" Waiahole, 94 Hawaii at 160, 9 P.3d at 472.\n\nOn appeal, the appellants contend that MR-Wai`ola failed to satisfy its burden of proof under HRS § 174C-49(a) and, thus, that the Commission erred in granting MR-Wai`ola a water use permit for 655,928 gpd. Although the Commission argues that its decision was \"just and reasonable,\" the Commission's answering brief does not address the appellants' argument that MR-Wai`ola failed to satisfy each of the conditions requisite to obtaining a water use permit under HRS § 174C-49(a). The Commission asserts that, in addition to the \"substantial, probative, and reliable evidence\" supporting its FOFs and COLs, its decision provides safeguards\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e to ensure fair and just consideration of the parties' competing interests in the State's water resources. Given the complexity of the arguments relating to each of the conditions enumerated in HRS § 174C-49(a), we address separately each condition and the arguments relating thereto. 1. HRS § 174C-49(a)(1) The appellants argue that the Commission erred in \"disregarding the uncontroverted evidence that there was a single or physically related body of ground water underlying Kamiloloa and Kualapu`u.\" The appellants essentially reassert the same arguments advanced with respect to whether reservations of water are aquifer-specific, see supra section III.A.1, and posit that the undisputed evidence established that groundwater flows between the Kamiloloa and Kualapu`u aquifer systems. DHHL contends that, notwithstanding the evidence that Molokai's \"aquifer systems\" constitute a hydrological fiction, the Commission nevertheless \"limited its analysis to subtracting prior existing permitted uses (0.211 mgd) from Kamiloloa's estimated sustainable yield of 3 mgd\" and concluded that, because 2.789 mgd remained, MR-Wai`ola's proposed use could be accommodated by the available water source.\n\nHRS § 174C-49(a)(1), see supra note 1, provides that \"the applicant shall establish that the proposed use of water . . . [c]an be accommodated with the available water source[.]\" HRS § 174C-3 (1993) defines a \"water source\" as \"a place within or from which water is or may be developed, including but not limited to: (1) generally, an area such as a watershed defined by topographic boundaries, or a definitive ground water body; and (2) specifically, a particular stream, other surface water body, spring, tunnel, or well or related combination thereof.\" For purposes of the present matter, the \"water source\" at issue is a \"ground water body.\"\n\nHere, the Commission concluded that MR-Wai`ola's proposed use could be accommodated with the available water source in the Kamiloloa aquifer system, because (1) there were approximately 2.789 mgd of unallocated water in the aquifer and (2) DHHL had no reservations of water in the Kamiloloa aquifer system. Insofar as reservations of water, as denominated in the HAR, are aquifer-specific, see supra section III.A.1, it is intuitively obvious that the sustainable yield of a particular aquifer is, likewise, aquifer-specific. See HAR § 13-170-2(c)(3), supra note 27 (\"The [Hawaii water] plan shall describe and inventory the [sustainable yield] within each designated hydrologic unit . . . using the best available information and shall be reviewed periodically. . . .\"). That being the case, we believe that the Commission did not clearly err in finding that, based on the current sustainable yield (3.0 mgd) and current allocations of water (0.211 mgd) for the Kamiloloa aquifer system, MR-Wai`ola's requested allocation (1.25 mgd) could be accommodated with the available water source (2.789 mgd) in the Kamiloloa aquifer system. 2. HRS § 174C-49(a)(3) The appellants collectively argue that the Commission erred in finding that the proposed water use would have a \"minimal impact, if any,\" upon DHHL's wells in Kualapu`u. More specifically, the appellants maintain that the Commission refused to consider the impact of MR-Wai`ola's proposed well on DHHL's existing wells in the Kualapu`u aquifer system, on the sole basis that the proposed use was confined to the Kamiloloa aquifer system. DHHL asserts that the undisputed evidence established that \"if the top of the fresh/salt water transition zone was near or at the bottom of DHHL's wells, Wai`ola's well could cause 'significant' increase in the salinity of the water in DHHL's wells.\" DHHL, however, concedes that \"the experts were unable to state with certainty where the transition zone was located.\"\n\nThe Ritte intervenors dispute DHHL's concession that the depth of the transition zone was unknown at the time of the contested case hearing and argue that the evidence demonstrated that \"it [was] likely that DHHL's wells [in Kualapu`u would] be adversely affected by pumping at the proposed well.\" More specifically, they assert that the record reflects (1) that \"the transition zone in Kualapu`u is apparently near the bottom of DHHL's wells,\" (2) that pumping water in Kamiloloa at the proposed rate of 1.326 mgd \"is likely to adversely affect DHHL's wells,\" (3) that DHHL's wells \"are susceptible to increased salinity resulting from pumping at other wells,\" and, therefore, (4) that it must be assumed that pumping 655,928 gpd from the proposed well would also likely increase the salinity of DHHL's wells in Kualapu`u. The Ritte intervenors contend that the USGS's expert testimony demonstrated that pumping 1.326 mgd from the proposed well in Kamiloloa \"would cause a loss in production at DHHL's existing wells of approximately 160,000 [gpd],\" which constitutes an impermissible interference with DHHL's \"existing legal uses\" under HRS § 174C-49(a)(3). As such, the Ritte intervenors argue that the Commission's decision is not only unsubstantiated, but also contrary to the Commission's own findings. Finally, the Ritte intervenors assert that, although the Commission granted MR-Wai`ola a water use permit for approximately one half of the requested use, the Commission nevertheless failed to analyze the potential impacts of pumping 655,928 gpd of water from the proposed well.\n\nMR-Wai`ola responds that both the McNulty and USGS models predicted water-level declines at existing well locations that were not significant enough to have any effect on the quality or quantity of water withdrawn from DHHL's existing wells in Kualapu`u. In addition, MR-Wai`ola contends that DHHL's experts testified that the predicted drawdown level at the Kualapu`u wells resulting from pumping 1.326 mgd at the Kamiloloa well site was \"likely to be less than normal seasonal fluctuations of groundwater level and of the same order of magnitude of normal semi-diurnal water level fluctuations created by varying barometric pressure.\" Finally, MR-Wai`ola argues that DHHL's water use application to pump an additional 900,000 mgd from its wells in Kualapu`u belies its concern that the top of the transition zone near the Kualapu`u wells was near the bottom of the wells. We agree with MR-Wai`ola.\n\nHRS § 174C-49(a)(3), see supra note 1, provides that \"the applicant shall establish that the proposed use of water . . . [w]ill not interfere with any existing legal use of water[.]\" In the present matter, the Commission concluded that, because there would be minimal impact, if any, upon DHHL's wells in Kualapu`u, MR-Wai`ola's proposed water use would not interfere with any existing legal uses. The record reflects that there was substantial evidence from which the Commission could conclude that MR-Waiola's proposed water use would have a \"minimal impact, if any,\" on DHHL's wells in Kualapu`u. In particular, both the McNulty and USGS models predicted a minimal degree of water-level decline at the Kualapu`u well field. The McNulty model (proffered by MR-Wai`ola) predicted that pumping 1.25 mgd from the proposed well in Kamiloloa would result in a water-level decline of 0.17 to 0.32 feet at the existing Kualapu`u well field, concluding that the predicted levels of decline would have no measurable effect on the quality (i.e., the salinity, see supra section I.A.3 and notes 11 and 12) or quantity of water drawn from the existing wells. The expert testimony also established that the McNulty model's projected water-level declines were conservative -- i.e., the \"worst case response\" from pumping at the proposed well site -- because the model did not include the effect of intrusive structures that could restrict the potential water-level decline to the Kamiloloa aquifer system. Similarly, the USGS model (proffered by DHHL) predicted that pumping 1.326 mgd from the proposed well in Kamiloloa would result in a water drawdown at the Kualapu`u wells of up to 0.5 feet and approximately 1.0 feet in the vicinity of the Kamiloloa well, ultimately concluding that \"the impact is very small.\" Moreover, the Commission granted MR-Wai`ola a water use permit for only one-half of the requested amount (655,928 gpd), thereby deflating the impacts predicted by the McNulty and USGS Models.\n\nThus, \"in view of [the] reliable, probative, and substantial evidence on the whole record,\" Waiahole, 94 Hawaii at 119, 9 P.3d at 431, we believe that the Commission did not clearly err in finding that MR-Wai`ola satisfied the condition set forth in HRS § 174C-49(a)(3). 3. HRS §§ 174C-49(a)(2), (5), and (6) DHHL asserts that MR-Wai`ola's economic development plan, which consists of a two-page spreadsheet delineating its planned water uses, was a speculative effort to justify its application for a water use permit and, therefore, that MR-Wai`ola failed to comply with HRS §§ 174C-49(a)(2), (5), and (6), which require \"the applicant [to] establish that the proposed use of water . . . (2) [i]s a reasonable-beneficial use as defined in section 174C-3; . . . (5) [i]s consistent with state and county general plans and land use designations; [and] (6) [i]s consistent with county land use plans and policies[.]\" DHHL maintains that \"Wai`ola's 15-20 year time horizon for its as yet undeveloped 'plan' is a perversion of the process -- an attempt to 'reserve' water for itself for the foreseeable future without proving its actual need.\"\n\nThe Kahae intervenors argue that the Commission erred in concluding that MR-Wai`ola's proposed water use satisfied the requirements set forth in HRS §§ 174C-49(a)(5) and (6), inasmuch as the proposed use was inconsistent with both the Maui County General Plan (MCGP) and the Moloka`i Community Plan (MCP). Consequently, the Kahae intervenors maintain that, based on the foregoing inconsistencies, the proposed use, by definition, could not be a \"reasonable-beneficial use,\" as mandated by HRS § 174C-49(a)(2). In essence, the Kahae intervenors argue that, had the Commission accurately examined MR-Wai`ola's proposed use for consistency with the actual designations for land use in the MCGP or the MCP, it would have been self-evident that MR-Wai`ola's proposed use violated HRS §§ 174C-49(a)(5) and (6).\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nCorrelatively, OHA argues that the plain language of HRS § 174C-49(a)(5) -- in particular, the use of the present tense verb \"is\" -- mandates that the proposed use be consistent with the state and county general plans and land use designations at the time of the filing of the application for a water use permit. OHA contends that MR-Wai`ola's land-use-planning expert conceded at the contested case hearing that the present application did not satisfy HRS § 174C-49(a)(5). OHA posits that, because the record does not identify \"if, when, or how the waters will be utilized,\" there was no evidentiary basis to support the Commission's finding that MR-Wai`ola's proposed use was a \"reasonable-beneficial use,\" as required by HRS § 174C-49(a)(2).\n\nThe County responds that the twenty-year water development horizon that the Commission approved in its decision was appropriate and should be sustained \"in consideration of the significant long-term investment this represents for the Moloka`i economy.\" The County contends that the development of a new water resource is essential to the success of MR-Wai`ola's economic development plan for the island of Moloka`i and, therefore, urges this court to consider seriously \"the devastating impact\" of reversing the Commission's decision \"on the already ailing economy of the island of Moloka`i.\" With respect to the State and county general plans and land use designations and the county land use plans and policies, the County argues that the MCP effectuates the sole objective of the MCGP, which is \"'[t]o encourage the independent economic revitalization of the island of Moloka`i.'\" The County further asserts that MR-Wai`ola's plan to develop new water resources over a twenty-year horizon is \"entirely consistent\" with the MCP, which contemplated that water resources development on Molokai would occur over a period of one to twenty years and envisioned both public and private action to accomplish any development plan. Thus, the County posits that the Commission's decision will enable MR-Wai`ola (1) to implement the MCGP and the MCP with respect to the development of new water resources, (2) to stimulate Molokai's economy, and (3) to \"engage in solid, sound, and economically viable infrastructure planning so as to assure a reasonable possibility of the development's success.\"\n\nMR-Wai`ola concedes that its application for 1.25 mgd of water in the Kamiloloa aquifer system included uses for which all land use approvals had not yet been obtained, particularly with respect to its future residential uses. MR-Wai`ola, however, argues that the Commission's decision did not grant any water allocations for such uses, which amounted to approximately 585,000 gpd. In other words, the Commission restricted its decision to uses for which no further land use approvals were necessary. We agree with MR-Wai`ola.\n\nHRS §§ 174C-49(a)(5) and (6), see supra note 1, mandate that the applicant \"establish that the proposed use of water . . . [i]s consistent with the State and county general plans and land use designations\" and the \"county land use plans and policies.\" Although we acknowledge that the content of MR-Wai`ola's development plan is meager, the Commission was nevertheless able to glean therefrom whether the proposed future uses satisfied HRS §§ 174C-49(a)(5) and (6). Specifically, in its decision, the Commission concluded that several of MR-Wai`ola's future residential and commercial uses (as well as the expansion of the Plau Industrial Park) satisfied the relevant conditions for a water use permit under the Code, on the basis that all final land use approvals had been acquired prior to the submission of MR-Wai`ola's application; the approved uses amounted to 655,928 gpd. The proposed future residential, commercial, and municipal uses, however, were not consistent with either the state and county general plans and land use designations or the county land use plans and policies, and, therefore, the Commission concluded that MR-Wai`ola had not met its burden under the Code requisite to obtaining a water use permit for those uses, which amounted to 584,752 gpd. Thus, inasmuch as the Commission granted MR-Wai`ola a water use permit only for uses that satisfied HRS §§ 174C-49(a)(5) and (6) at the time of the filing of its application, the appellants' arguments relating thereto are without merit.\n\nMoreover, MR-Wai`ola's long-range development plan appears to be consistent with the MCGP and the MCP. One of the express objectives of the MCGP is \"[t]o encourage the independent economic revitalization of the island of Moloka`i.\" Similarly, the MCP,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e into which the MCGP's policy statements have been incorporated, emphasizes the need to improve current water distribution systems and develop new water sources on Moloka`i through both public and private action. In addition, the Moloka`i Working Group (MWG), which convened for the purpose of recommending a water resource development plan on Moloka`i to the Commission and assisting the County in developing its water use and development plan (WUDP), utilized a ten to twenty year planning window in developing its guidelines and recommendations for water allocations. Finally, there was evidence to support the Commission's finding that \"where there is a major infrastructure investment required, as in this case, the longer into the future the water commitment can be assured, the project has a greater possibility of succeeding.\" That being the case, MR-Wai`ola's fifteen to twenty year development plan falls within the purview of the MWG's recommended WUDP. Thus, upon review of the Commission's detailed breakdown of the approved and non-approved uses attached to its decision, we believe that the Commission did not clearly err in finding that MR-Wai`ola's \"approved uses\" satisfied the conditions for a water use permit set forth in HRS §§ 174C-49(a)(5) and (6).\n\nWe believe that the record also supports the Commission's findings that MR-Waiola's proposed water use constituted a \"reasonable-beneficial use as defined by section 174C-3.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e See HRS § 174C-49(a)(2), supra note 1. As we noted in Waihole, \"the 'reasonable-beneficial use' standard and the related criterion of 'consistent with the public interest' demand examination of the proposed use not only standing alone, but also in relation to other public and private uses and the particular water source in question.\" 94 Hawaii at 161, 9 P.3d at 473. HRS § 174C-3 (1993) defines \"reasonable-beneficial use\" as \"the use of water in such a quantity as is necessary for economic and efficient utilization, for a purpose, and in a manner which is both reasonable and consistent with the state and county land use plans and the public interest.\" In demonstrating the foregoing, the applicant for a water use permit, \"[a]t a very minimum, [] must prove their own actual water needs . . . [and] demonstrate the absence of practicable mitigating measures, including the use of alternative water sources.\" Id.\n\nAs we have noted, MR-Wai`ola submitted a two-page spreadsheet, entitled \"MR Ltd. Water Use Projections,\" which itemized existing and proposed water uses for residential, commercial, camping, and municipal uses, accompanied by corresponding water allocations in gpd for the first four years of MR-Wai`ola's development plan. Our review of the record reflects that MR-Wai`ola satisfied its threshold burden of proving its actual water needs for its proposed future uses \"insofar as circumstances allow.\" See 94 Hawaii at 161, 9 P.3d at 473.\n\nIn addition, the evidence supported the Commission's finding that MR-Wai`ola selected the proposed well site in the Kamiloloa aquifer system because (1) the proposed site was outside the Kualapu`u aquifer system where DHHL's 2.905 mgd reservation and existing drinking water wells were located, (2) the site appeared to support the development of potable groundwater, and (3) it was located on land owned by MR. Based on the foregoing, the Commission concluded that \"[t]he domestic, commercial, industrial, and municipal uses as set forth in the application [were] consistent with or more conservative than standards utilized by the County of Maui\" and, thus, that \"the proposed use, as amended by [the] decision and order, [was] an economic and efficient utilization of water.\" Inasmuch as (1) there was evidence to support the Commission's finding that the proposed use was (a) \"necessary for economic and efficient utilization\" and (b) \"reasonable and consistent with the state and county land use plans and the public interest\" and (2) the Commission limited MR-Wai`ola's water use permit to future uses for which all land use approvals had been obtained at the time of the filing of MR-Wai`ola's water use permit application, the Commission did not clearly err in finding that MR-Wai`ola had met its burden of establishing that the approved future uses constituted a \"reasonable-beneficial use\" of water. 4. HRS § 174C-49(a)(7) DHHL argues that \"the uncontroverted expert testimony found that [MR-Wai`ola's] proposed well would adversely affect DHHL's wells by reducing productivity, and causing the transition zone to rise, thereby, in all likelihood, increasing salinity.\" DHHL contends that the proposed well would exacerbate the problem of rising salinity, thereby directly interfering with its reservation rights under HHCA § 221. The Ritte intervenors maintain that, because \"it is undisputed that DHHL, to withdraw the full amount of its reservation, will need to drill additional wells in the direction of the proposed well, and that this proximity will make the impacts of the proposed well even greater, the conclusion that the [proposed use] interferes with DHHL's reservation is inescapable.\" Both DHHL and the Ritte intervenors essentially assert that MR-Wai`ola failed to meet its burden under HRS § 174C-49(a)(7) and, therefore, that the Commission clearly erred in concluding that MR-Waiola did, in fact, meet its burden under the Code.\n\nHRS § 174C-49(a)(7), see supra note 1, provides that \"the applicant shall establish that the proposed use of water . . . [w]ill not interfere with the rights of the [DHHL] as provided in section 221 of the [HHCA].\" As discussed supra in sections III.A.1. and III.A.3.c., DHHL has a protected interest in its 2.905 mgd reservation located in the Kualapu`u aquifer system, notwithstanding the fact that MR-Waiola's proposed use would be located in the adjacent Kamiloloa aquifer system. In this connection, MR-Wai`ola had the burden to establish that the proposed use would not interfere with DHHL's reservation rights.\n\nOur review of the record in the present matter reveals that FOF Nos. 201 through 214 -- i.e., the Commission's findings supporting its conclusion that the proposed use would not interfere with DHHL's rights under HHCA § 221 -- failed to address whether MR-Wai`ola had adduced sufficient evidence with respect to the impact of the proposed use on DHHL's reservation in Kualapu`u. In fact, COL Nos. 36 through 39 appear to shift the burden to DHHL to establish that the proposed use would interfere with its reservation rights, which is contrary to this court's well-settled interpretation of an applicant's burden under the Code, for purposes of obtaining a water use permit for a \"new\" use. Inasmuch as the Commission entered no FOFs or COLs as to whether MR-Wai`ola satisfied its burden under HRS § 174C-49(a)(7), we remand the matter for further FOFs and COLs relating thereto. C. The Commission Failed Adequately To Discharge Its Public Trust Duty To Protect Native Hawaiians' Traditional And Customary Gathering Rights, As Guaranteed By The HHCA, The Hawaii Constitution, And The Code. A substantial population of native Hawaiians on Moloka`i engages in subsistence living by fishing, diving, hunting, and gathering land and marine flora and fauna to provide food for their families. Aside from the nutritional and affordable diet, subsistence living is essential to (1) maintaining native Hawaiians' religious and spiritual relationship to the land and near-shore environment and (2) perpetuating their commitment to \"malama ka aina,\" which mandates the protection of their natural ecosystems from desecration and deprivation of their natural freshwater resources. The Commission granted the Intervenors standing to participate in the contested case hearing on the basis that they either (1) claimed property interests in or resided on the land within the Kamiloloa aquifer system or (2) claimed traditional and customary rights of the ahupuaa tenants who were descendants of the native Hawaiians inhabiting the Hawaiian islands prior to 1778. The Intervenors testified that they traditionally and customarily gathered food and fish along the Kamiloloa shoreline and that MR-Wai`ola's proposed pumping would significantly reduce groundwater discharge into the ocean, thereby adversely affecting the limu growth and fish populations that they gathered for subsistence living. The Intervenors' points of error with respect to the foregoing address whether the Commission's decision adequately protected their traditional and customary gathering rights, as guaranteed by HHCA §§ 220(d) and 221(b) and (c), article XII, section 7 of the Hawaii Constitution, and HRS § 174C-101. See supra notes 2, 3, and 4, respectively. 1. The Commission Erred in Precluding The Intervenors From Cross-examining Dr. Dollar With Respect To The Alleged Prior Inconsistent Testimony Given In The Waihole Matter, Thereby Prejudicially Affecting The Intervenors' Substantial Rights. The Intervenors, with whom OHA joins, argue that the Commission erred in concluding that MR-Wai`ola's proposed use would have \"a minimal impact, if any,\" on the limu, fish, and other marine species traditionally and customarily gathered by the Native Hawaiians on Moloka`i. They assert that HRS §§ 174C-2(c) and 174C-101(c) place an affirmative duty on the Commission to provide adequately for (1) protection of native Hawaiians' traditional and customary gathering rights, (2) protection and procreation of fish and wildlife, and (3) maintenance of a proper ecological balance in rendering any decision with respect to the state water resources trust. Citing this court's decision in PASH, the Intervenors contend that MR-Wai`ola bore the burden of proving either (1) that its \"new\" water use would not adversely affect native Hawaiians' reasonable exercise of traditional and customary gathering rights or (2) that it was not \"feasible\" to protect native Hawaiian gathering rights and that the permit granted by the Commission would not \"abridge[ ] or den[y]\" such rights.\n\nThe Intervenors primarily argue that the Commission erred in rejecting the expert testimony of Celia M. Smith, Ph.D., and Clyde Tamaru, Ph.D., with respect to its conclusion that the impact of the proposed water use would be minimal, if any, on native Hawaiian gathering and fishing practices in Kamiloloa, and, instead, relying solely on the expert testimony of Dr. Dollar. They contend that, unlike Drs. Smith and Tamaru, Dr. Dollar, as an expert in oceanography, testified outside the scope of his expertise in rendering an opinion as to the potential effects of MR-Waiola's proposed water use on the limu population resulting from the reduction in groundwater discharge along the Kamiloloa coast.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e They maintain (1) that Dr. Dollar was not qualified as an expert in, inter alia, (a) phytology, (b) the identification of various types of limu, and (c) the natural habitat requisite to sustaining the life cycle of fish and (2) that Dr. Dollar's lack of expertise \"predictably put him at odds with the expert Hawaiian limu gatherers who ultimately know the various types of edible limu they have traditionally gathered for a lifetime.\"\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e As such, the Intervenors argue that the Commission abused its discretion in relying on Dr. Dollar's testimony rather than the \"more qualified\" testimony of Drs. Smith and Tamaru.\n\nThe Intervenors further assert that the Commission violated their due process right to engage in effective cross-examination by denying their request to impeach Dr. Dollar with prior inconsistent statements regarding the vitality of limu along the Moloka`i shoreline that he made in the course of the Waiahole and Ewa Marina contested case hearings, both of which were pending before Hearing Officer Cox at the time the contested case hearing was being conducted in the present matter.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e At the contested case hearing, MR-Wai`ola interposed an objection to the Ritte intervenors' cross-examination of Dr. Dollar regarding the alleged prior inconsistent statements; the Intervenors responded by orally moving to strike Dr. Dollar's testimony in its entirety, on the basis that they had been denied the right to effectively cross-examine him. The Commission sustained MR-Wai`ola's objection and denied the Intervenor's motion to strike, reasoning that to permit Dr. Dollar to be questioned in the present matter regarding statements he allegedly made in the Waiahole matter could compromise the hearing officer's neutrality with respect to deciding the Waiahole matter.\n\nThe Commission responds that the bulk of the Intervenors' arguments with respect to ocean resources used for traditional and customary practices by native Hawaiians went to the weight of the evidence and the credibility of witnesses and, thus, should be \"left to the forum that received the testimony and evidence.\" The Commission contends that it recognized its obligation to protect the reasonable exercise of native Hawaiian rights and that, although the evidence established that MR-Wai`ola's proposed well site would have a minimal impact on such traditional and customary practices, it nonetheless imposed a well monitoring program as a condition of MR-Wai`ola's water use permit and retained jurisdiction to alter the terms of the water use permit in the event of an excessive reduction in groundwater discharge to the near-shore environment. As such, the Commission maintains that it not only \"embraced its legal obligations under PASH and its progeny,\" but also that it \"went a step further to create a method by which possible negative effects on traditional and customary gathering rights [could] be remedied.\"\n\nLikewise, MR-Wai`ola contends that pumping 655,928 gpd from the Kamiloloa aquifer would have an insignificant impact on the near-shore environment and native Hawaiian gathering practices, because \"[c]urrent and past pumping has not resulted in [a] significant adverse impact [on] the near-shore environment and the cumulative effect of reducing groundwater discharge by another 656,000 gpd will not be the 'straw that broke the camel's back.'\" In this connection, MR-Wai`ola asserts that the McNulty prediction -- i.e., that pumping 1.25 mgd of water would result in a fifteen percent reduction in groundwater discharge spread over the six kilometer shoreline -- and the USGS prediction -- i.e., that pumping 1.326 mgd would result in a three percent reduction in groundwater discharge over a thirteen-mile stretch of coastline -- support the Commission's conclusion that such reductions in groundwater discharge would have a minimal effect on the near-shore environment. Moreover, MR-Wai`ola urges that the evidence relating to the anticipated increases in fishpond salinity supports the Commission's conclusion that the changes resulting from the proposed well would be insignificant, inasmuch as a ten-percent reduction of groundwater discharge along the Kamiloloa coastline would only increase salinity from 28.6 parts per thousand (ppt) to 29.4 ppt and a ten-percent reduction of groundwater discharge along the outer boundary of the fishponds would increase salinity only from 33.3 ppt to 33.5 ppt.\n\nMR-Wai`ola further responds that the Commission correctly precluded the Intervenors from cross-examining Dr. Dollar regarding his alleged prior inconsistent statements made in the Waihole contested case hearing, because \"the 'spin' on evidence from the other case could, from the point of view of the other case, be deemed to be an ex parte communication.\" MR-Wai`ola also contends that, assuming arguendo that the Commission erred in sustaining MR-Wai`ola's objection to the proposed line of cross-examination, any error was harmless, inasmuch as the Commission, in its final decision, expressly relied on the testimony of various lay witness whom the Intervenors had called in fashioning (1) its FOFs with respect to the abundance of limu that native Hawaiian residents gather along the Kamiloloa coastline and (2) its COLs that the Intervenors exercised traditional and customary gathering practices on the shoreline and near-shore area on the ocean side of the proposed well in the Kamiloloa aquifer system. We disagree with the Commission and MR-Wai`ola and agree with the Intervenors.\n\nAs discussed supra in section III.A, an applicant for a water use permit bears the burden of establishing that the proposed use will not interfere with any public trust purposes; likewise, the Commission is duty bound to hold an applicant to its burden during a contested-case hearing. See Waiahole, 94 Hawaii at 136-38, 9 P.3d at 448-50. In the present matter, MR-Wai`ola had the burden of proving, inter alia, that the proposed water use would not abridge or deny traditional and customary native Hawaiian rights. In its COL No. 24, the Commission concluded:\n\nthat no evidence was presented that the drilling of the well would affect the exercise of traditional and customary native Hawaiian rights. Nor does the Commission find that any evidence was presented that the proposed use will affect any access to the shoreline or the near-shore areas. Therefore, the Commission finds that the proposed use will not in any way diminish access for the purpose of practicing traditional and customary native Hawaiian rights in the project area, shoreline, or near-shore areas.\n\nThe foregoing COL was unsupported by any clearly articulated FOF and erroneously placed the burden on the Intervenors to establish that the proposed use would abridge or deny their traditional and customary gathering rights. Contrary to the implications of COL No. 24, MR-Wai`ola was obligated to demonstrate affirmatively that the proposed well would not affect native Hawaiians' rights; in other words, the absence of evidence that the proposed use would affect native Hawaiians' rights was insufficient to meet the burden imposed upon MR-Waiola by the public trust doctrine, the Hawaii Constitution, and the Code. Accordingly, the Commission's COL No. 24 concluded in a vacuum that \"the proposed use will not in any way diminish access for the purpose of practicing traditional and customary native Hawaiian rights in the project area, shoreline, or near-shore areas.\"\n\nMoreover, the record reflects that the Commission sustained MR-Wai`ola's objection to the introduction of selected portions of the transcripts from the Waiahole contested case hearing for purposes of impeaching Dr. Dollar's testimony regarding the limu population along the Kamiloloa shoreline, on grounds similar to those expressed in the Hawaii Rules of Evidence (HRE) Rule 403 (1993), which prescribes the exclusion of otherwise relevant evidence where the \"probative value is substantially outweighed by the danger of unfair prejudice . . . .\" (Emphasis added.) More specifically, the hearing officer reasoned as follows:\n\n1. Without all the parties and their general counsel in the Ewa Marina and Waiahole cases present to waive any objection from my receipt of such evidence, I believe [that] the receipt of the evidence even for the possible impeachment or possible appearance of impropriety on my part may create a cloud over my further participation in the Waiahole and Ewa Marina cases. It may jeopardize the ultimate decision in those cases.\n\nMy attorney cannot guarantee me that[,] absent a waiver by all parties[,] that this will not be an issue in those cases. I have grave concerns about that.\n\n2. As a hearing officer[,] I have broad discretion in the admission of evidence. I believe that to admit portions of the transcript even for impeachment of the context would open the door [to] many tangential issues in this hearing involving the Ewa Marina and Waiahole contested cases that are, frankly, not relevant here and not particularly helpful to me as the Hearing Officer.\n\n3. Were the transcripts the only evidence available to rebut Dr. Dollar's testimony today[,] it may be a closer question. However, the parties opposing this application already plan to present several expert witnesses and multiple lay witnesses to rebut Dr. Dollar's testimony.\n\nTherefore, on balance[,] I find [that] the potential harm and problems created by the admission of the transcripts even for impeachment purposes outweighs [its] probative value. And I sustain the objection.\n\n(Emphases added.) As a preliminary matter, we note that the plain language of HRS § 91-10(1) (1993),\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e which sets forth the rules of evidence applicable to contested-case hearings, does not provide for the exclusion of otherwise relevant evidence on grounds of prejudice or potential compromise of the trier of fact's impartiality. See Cazimero v. Kohala Sugar Co., 54 Haw. 479, 483, 510 P.2d 89, 92 (1973) (construing HRS § 91-10(1) as directing an administrative agency to admit \"any and all evidence limited only by considerations of relevancy, materiality and repetition\"). HRS § 91-10(1) provides only for the \"exclusion of irrelevant, immaterial, or unduly repetitious evidence . . . .\" That being the case, the ruling of the Commission, through the hearing officer, precluding the cross-examination of Dr. Dollar through the use of otherwise relevant prior inconsistent statements made in an unrelated contested case hearing in order to protect the trier of fact from criticism in unrelated matters was erroneous.\n\nFurther to the foregoing, the Commission's refusal to permit the Intervenors to cross-examine Dr. Dollar regarding the limu population along the Kamiloloa shoreline adversely affected the Intervenors' substantial rights, inasmuch as the ruling, in effect, precluded the Commission from effectively balancing MR-Wai`ola's proposed private commercial use of water against an enumerated public trust purpose, namely the protection of native Hawaiians' traditional and customary gathering rights, as mandated by article XII, section 7 of the Hawaii Constitution, HHCA §§ 220(d) add 221(b) and (c), HRS § 174C-101(c), and the relevant case law. See HRE Rule 103(a)(2) (1993) (\"Error may not be predicated upon a ruling which . . . excludes evidence unless a substantial right of the party is affected . . . .\" (Emphasis added.)). Contrary to the Commission's ruling, Dr. Dollar's alleged prior inconsistent statements regarding the limu population on the eastern shoreline of Moloka`i was clearly relevant to the question whether the proposed use would diminish the groundwater discharge to the near-shore environment, which is critical to the production of the type of limu traditionally and customarily gathered by the native Hawaiians inhabiting Moloka`i. That being the case, the Intervenors' inability to cross-examine Dr. Dollar rendered clearly erroneous the Commission's finding that, although the thirteen-mile stretch of shoreline would likely experience a three to fifteen percent reduction in groundwater discharge as a result of pumping approximately 1.25 mgd from the proposed well, the resulting change in salinity in the fishponds would not significantly affect native Hawaiians' ability to exercise traditional and customary gathering rights. Correlatively, the Commission's COL No. 29 lacked an adequate evidentiary basis for its conclusion that MR-Wai`ola's \"applied-for uses . . . do not abridge or deny traditional or customary Hawaiian rights, customs, practices, or appurtenant water rights, or any other rights referred to in or protected by Part IX of the state Water Code, the common law, or the Constitution of the State of Hawaii.\" Accordingly, the Commission having failed adequately to discharge its public trust obligation to protect native Hawaiians' traditional and customary gathering rights, we have no choice but to vacate the Commission's decision and to remand for further proceedings.\n\n2. The Kakalahale Monitoring Well\n\nThe Intervenors urge that the monitoring well program mandated by the Commission's decision neither addresses Dr. Tamaru's concerns regarding the effect of a reduction in groundwater discharge into the near-shore environment on various marine species nor incorporates his recommendations for a coastal monitoring program. The Intervenors contend that, assuming arguendo that the well monitoring program would ameliorate any negative effects of pumping 655,928 gpd in Kamiloloa, the program nonetheless does not support the issuance of a water use permit in the present matter, because the Code mandates that the applicant establish the seven conditions, enumerated in HRS § 174C-49(a), see supra note 1, requisite to obtaining a water use permit prior to the issuance of a permit. In other words, the Intervenors argue that the Commission's approach of monitoring potential harms caused by pumping 655,928 gpd in Kamiloloa and permitting the filing of a petition to reduce the permitted allocation in the event of any negative effects on the near-shore environment impermissibly relieved MR-Wai`ola of the obligation to meet its statutory burden of proof.\n\nIn addition, the Intervenors assert that the Kakalahale well is \"demonstrably useless,\" because its location renders it incapable of gauging any negative effects that MR-Wai`ola's proposed pumping in the Kamiloloa aquifer system may inflict upon DHHL's wells in Kualapu`u. The Intervenors point out that the Kakalahale well is located in the Kamiloloa aquifer, approximately two miles southeast of the Kualapu`u wells, which, they argue, contravenes both DHHL's and MR-Waiola's experts' recommendation that a monitoring well be located in Kualapu`u. In further support of the foregoing, the Intervenors point to the Commission's FOF No. 90, which expressly stated that \"[t]he Kakalahale well will not serve this purpose because it is not located properly in relation to [the] transition zone that underlies the DHHL wells in Kualapu`u.\"\n\nMR-Wai`ola counters that the Intervenors' argument is misplaced because they misapprehend the purpose of the Kakalahale well. MR-Wai`ola concurs, as did the Commission, that the Kakalahale well would not be useful in measuring the effects of the proposed well on DHHL's wells in Kualapu`u. MR-Wai`ola points out, however, that the purpose of the monitoring program at the Kakalahale well was not to gauge the impact of the proposed well on DHHL's existing wells in Kualapu`u; rather, the purpose of the monitoring well was to measure the impact of the proposed well on the groundwater discharge into the near-shore environment within the Kamiloloa aquifer system, which could affect the marine life along the Kamiloloa shoreline and, in turn, native Hawaiians' gathering practices. Inasmuch as the Kakalahale well is located approximately a mile and a half to the southwest of MR-Wai`ola's proposed well, between the proposed well and the Kamiloloa shoreline, MR-Wai`ola argues that the monitoring well would be useful for its intended purpose.\n\nWe agree with MR-Wai`ola that the Intervenors misconstrue the stated purpose of the monitoring well, as set forth in the Commission's COL No. 28, which provides as follows:\n\nEven though the Commission finds that the impacts are minimal and the proposed use is in the public interest, the Commission believes that it has a legal mandate to protect the reasonable exercise of traditional and customary native Hawaiian practices. Because the project may have an impact, albeit minimal, if any, on the traditional and customary native Hawaiian practices, the Commission imposes as a condition of this permit a well monitoring program as set forth in the decision and order. The well monitoring program will provide data to calibrate the ground-water models presented as to the possible effect of the well pumping on the reduction and resulting distribution of ground water in the Kamiloloa Aquifer, which could possibly affect the marine life in question.\n\n(Emphasis added.) It is true that, in its FOF No. 90, the Commission expressly found that the Kakalahale well was not suitable to serve as a deep monitoring well for purposes of obtaining data with respect to the availability of freshwater in the Kualapu`u aquifer system and the thickness of the transition zone, because the well was \"not located properly in relation to [the] transition zone that underlies the DHHL wells in Kualapu`u.\" As such, assuming arguendo that the Commission had imposed, as a condition of MR-Wai`ola's water use permit, a monitoring program utilizing the Kakalahale well to measure data relating to DHHL's wells in Kualapu`u, such a condition would have been clearly erroneous \"in view of the reliable, probative, and substantial evidence on the whole record,\" see HRS § 91-14(g)(5) (1993), and the Commission's own findings.\n\nThe Commission's COL No. 28, however, unequivocally sets forth the stated purpose of the Kakalahale well, which was to gauge the impact of the proposed well on the near-shore environment where native Hawaiians exercise traditional and customary gathering practices, and not to monitor DHHL's existing wells in Kualapu`u. In light of the foregoing, the Commission did not abuse its discretion in imposing a well monitoring program as a condition to granting MR-Wai`ola a water use permit in the present matter and utilizing the Kakalahale well for such purpose.\n\nD. HRS § 174C-58(4) Is A Statutory Mechanism By Which To Enforce Allocations Of Water Anticipated By The Commission To Be Used Within Four Years Of Issuing A Water Use Permit.\n\nOHA argues that the Commission erred in granting a water use permit for 338,279 gpd of water that would not be utilized by MR-Wai`ola within four years of the permit's issuance. OHA contends that HRS § 174C-58(4), see infra note 39, \"provides a clear process for revocation after four years of nonuse[ ] and circumstances under which the four-year period might be extended.\" Thus, OHA suggests that the Commission's decision \"simply assumes the authority to nullify the processes and standard of HRS § 174C-58(4) at any time a permit is issued\" via a water use permit that allows for nonuse beyond four years.\n\nOHA further argues that, even if HRS § 174C-58(4) authorized the Commission to issue a permit for nonuse beyond a four-year horizon, it nevertheless erred in finding \"good and sufficient reasons\" for doing so in the present matter. More specifically, OHA contends that the Commission erroneously predicated its decision to grant MR-Wai`ola a permit for four years of nonuse upon (1) the availability of water in the Kamiloloa aquifer, (2) the alleged minimal harm to native Hawaiians' traditional and customary gathering practices, and (3) the need to facilitate long-range planning. In support of the foregoing, OHA essentially reasserts its argument that the Kamiloloa and Kualapu`u aquifers are hydrologically connected, see supra section III.A.1, and that the Commission failed adequately to protect native Hawaiians' traditional and customary gathering rights, see supra section III.C.1. With respect to the Commission's reference to \"long-range planning\" as a justification for granting a permit for four years of nonuse, OHA acknowledged that, although long-range planning is not a condition requisite to obtaining a water use permit under HRS § 174C-49(a), it \"may perhaps constitute a special circumstance[ ] to justif[y] a waiver of enforcement responsibilities.\"\n\nMR-Wai`ola responds that the Commission correctly interpreted HRS § 174C-58(4) as an enforcement, and not a planning, tool. MR-Wai`ola contends that HRS § 174C-31 (1993), which mandates the development of the Hawaii water plan, encourages long-range planning and that, where development plans span a thirty-year horizon, \"it is incongruous to limit water planning to only four years.\" Moreover, MR-Wai`ola argues that the Commission's decision to grant allocations of water in excess of a four-year time frame is consistent with the MCGP, MCP, and MWG, all of which advocate planning windows in excess of four years.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Finally, although MR-Wai`ola acknowledges that \"[g]ranting water rights for merely conjectural needs may encourage those with money to monopolize water, [thereby] forcing others to purchase water from the water speculator to the speculator's own profit,\" it posits that \"the circumstances here do not lend themselves to water speculation for profit,\" because \"there is no competition for water in the Kamiloloa aquifer system.\" As such, MR-Wai`ola maintains that restricting the issuance of a water use permit to four years is \"neither economically efficient, consistent with good planning, nor does it promote sound water management principles.\" We agree with MR-Wai`ola.\n\nHRS § 174C-58(4) (1993)\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e provides that \"the commission may suspend or revoke a [water use] permit for [p]artial or total nonuse . . . of the water allowed by the permit for a period of four continuous years or more.\" (Emphasis added.) It is well established that, \"'[w]hen construing a statute, our foremost obligation is to ascertain and give effect to the intention of the legislature, which is to be obtained primarily from the language contained in the statute itself.'\" Gray, 84 Hawaii at 148, 931 P.2d at 590 (citations omitted). The legislature's use of the term \"may\" plainly and unambiguously indicates that the suspension or revocation of a water use permit based on partial or total nonuse is permissive, rather than mandatory. Cf. Metcalf v. Voluntary Employees' Benefit Ass'n of Hawaii, 99 Hawaii 53, 67, 52 P.3d 823, 837 (2002) (\"Inasmuch as [the statute] employs the term 'may,' it is plainly meant to indicate permissive use[.]\"). In addition, HRS § 174C-58(4) expressly provides that \"[t]he Commission and the permittee may enter into a written agreement that . . . any period of nonuse may not apply towards the four-year revocation period.\" Thus, the Code both expressly and impliedly authorizes the Commission to issue a water use permit that allocates water in excess of a four-year time frame.\n\nWe believe that the foregoing interpretation is consistent with the Commission's conclusion that HRS § 174C-58(4) constitutes an enforcement, rather than a planning, tool. HRS § 174C-2(b) (1993)\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e declares that \"[t]here is a need for a program of comprehensive water resources planning to address the problems of supply and conservation of water.\" The Hawaii water plan, as set forth in HRS § 174C-31, mandates that the water resource protection plan include \"existing and contemplated uses of water, as identified in the [WUDPs] of the State and the counties, their impact on the resource, and their consistency with objectives and policies established in the water resource protection and water quality plans[.]\" HRS § 174C-31(d)(3) (emphasis added); see also HRS § 174C-31(f)(2) (\"Each county [WUDP] shall include but not be limited to . . . [f]uture land uses and related water needs . . . .\") (emphasis added); HAR § 13-170-2(a), supra note 27 (\"The Hawaii Water Plan shall serve as a continuing long-range guide for water resource management.\") (Emphasis added.). That being the case, the Code and the subsequently adopted Hawaii water plan unequivocally envision a long-range comprehensive water resource plan for both the State's \"existing\" and \"contemplated\" water needs. Accordingly, reading HRS § 174C-58(4) in pari materia with HRS § 174C-2(b), HRS § 174C-31, and HAR § 13-170-2(a), see HRS § 1-16 (1993), we believe that it would be incongruous -- and even absurd -- to interpret HRS § 174C-58(4) as proscribing the allocation of water for future development beyond a four-year time horizon. To the contrary, we interpret HRS § 174C-58(4) as an enforcement mechanism by which the Commission may suspend or revoke a water use permit upon knowledge that a permitted allocation of water, which the Commission has expected to be used within a four-year time frame, has not been utilized.\n\nIn the present matter, the Commission granted MR-Wai`ola a water use permit for 655,928 gpd for approved existing and future (i.e., new) uses. The Commission, however, concluded that the circumstances of the present matter warranted an allocation of approximately 338,279 gpd for future uses that would not be utilized within the first four years of the permit's issuance.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Specifically, in its COL No. 34, the Commission reasoned as follows:\n\nAlthough the Commission is not limited by law to allocations based on a four[-]year time frame, the Commission does believe that granting water use permits in excess of the four year time frame must be made on a case by case basis based on the facts of each case. In this case, the fact [that] the application had all land use approvals for the water uses granted in this decision and order, the need to facilitate long-range planning, the lack of competition for the water in the Kamiloloa Aquifer System, the small amount of water already allocated, and the determination that the effect of this proposed use, as modified by this decision and order, will be minimal on the Kamiloloa Aquifer, the adjacent Kualapu`u Aquifer, and the near-shore resources, all support the allocation of water beyond the four[-]year time frame. This case should not be considered as a binding precedent for any future case as the Commission shall consider each case on its individual circumstances.\n\nThe Commission's COL No. 35 further supports our interpretation of HRS § 174C-58(4), insofar as it expressly provides that \"any party or the Commission itself can initiate a revocation action\" in the event that \"Wai`ola does not utilize the four year projected use\" (emphasis added), which conspicuously refers to the 317,649 gpd allocated by the Commission to be utilized within four years of issuing MR-Wai`ola a water use permit. That being the case, inasmuch as (1) the Code and the Hawaii water plan envision a long-range comprehensive program for the State's water resources and (2) the record before us supports the Commission's conclusion that the circumstances of the present matter -- namely, the fifteen to twenty-year horizon to implement MR-Wai`ola's economic development plan -- warrant an allocation of water in excess of a four-year time frame, we hold that the Commission did not abuse its discretion in allocating 338,279 gpd for future uses to be utilized beyond the first four years of the issuance of MR-Wai`ola's water use permit.\n\nE. Pursuant To HRS § 174C-49(c), MR-Wai`ola May Transport Water Outside The Aquifer Of Origin\n\nThe individual appellants raise different arguments relating to whether MR-Wai`ola, by virtue of owning land in the Kamiloloa aquifer system, has correlative rights to transport water from the proposed well in Kamiloloa to various existing and future service areas outside of Kamiloloa. DHHL concedes that the Code embraces the common law doctrine of correlative rights, as set forth in HRS § 174C-49(c), see supra note 1, but contends that such rights are \"conditional and subject to superior claims.\" DHHL argues that, because MR-Wai`ola failed to satisfy the conditions, as set forth in HRS § 174C-49(a), see supra note 1, requisite to obtaining a water use permit, MR-Wai`ola has no correlative rights to export water from the aquifer of origin.\n\nBy contrast, OHA and the Ritte intervenors assert that MR-Waiola has no correlative rights to transport groundwater, because the proposed well is within a designated WMA and, therefore, the Code supercedes the common law doctrine in such areas. The Ritte intervenors also argue that the Commission's reliance on this court's holding in City Mill Co., Ltd. v. Honolulu Sewer and Water Commission, 30 Haw. 912 (1929), is misplaced, insofar as the doctrine of correlative rights applies only to artesian waters -- i.e., naturally pressurized groundwater that flows to the surface without pumping from a well. Finally, the Ritte intervenors maintain that, if the doctrine of correlative rights applies to non-artesian waters, the doctrine is nonetheless limited to the use of groundwater on lands overlying the source. As such, the doctrine does not permit the diversion of water from one parcel of land to another, and, thus, the Commission erred in granting MR-Wai`ola a water use permit that, in effect, authorized it to transport water from Kamiloloa to other service areas on Moloka`i. MR-Wai`ola responds that the appellants fail to demonstrate that the Commission's finding that it has correlative rights to export groundwater from the Kamiloloa aquifer system in any way prejudiced their collective water rights in the Kualapu`u aquifer.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Notwithstanding the foregoing, MR-Wai`ola contends that this court need not reach the appellants' arguments, inasmuch as the Commission's decision was not premised on MR-Wai`ola's correlative rights; instead, the Commission granted MR-Wai`ola a water use permit on the basis that MR-Wai`ola had met its burden of establishing the conditions requisite to obtaining a water use permit as set forth in HRS § 174C-49(a). As such, whether MR-Wa`iola has correlative rights to transport groundwater from the aquifer of origin is immaterial to the Commission's decision.\n\nIn Waiahole, this court revisited its holding in City Mill and the applicability of the common law doctrine of correlative rights to non-artesian waters. 94 Hawaii at 176-80, 9 P.3d at 488-92. Waiahole extended the \"correlative rights rule,\" as enunciated in City Mill, to all groundwater resources in Hawaii as follows:\n\nAs a preliminary matter, we affirm the Commission's conclusion that the rule of correlative rights applies to all ground waters of the state. [Citation and footnote omitted.] As the Commission observed, although the facts of City Mill involved \"artesian\" waters specifically, the decision offers no sound basis for distinguishing \"artesian\" water from any other category of ground water, including the dike-impounded \"percolating\" waters involved in this case. [Footnote omitted.] Modern hydrology has erased the traditional distinctions among ground water categories. See [A. Dan] Tarlock, [Law of Water Rights and Resources], § 4:5 [(2000)]. Present knowledge and necessity have also compelled states to abandon the \"absolute dominion\" or \"common law\" rule, which imposed no limitation on a landowner to drain \"percolating\" water to the injury of his or her neighbors. See id. §§ 4:7 to 4:18; City Mill, 30 Haw. at 926-33 (recognizing the general trend away from the rule of absolute ownership). The City Mill court avoided the issue, stating that the common law rule \"may, or it may not, be applicable to waters merely oozing in or seeping through soil.\" 30 Haw. at 924. Presented with it here, we adopt the correlative rights rule in City Mill in relation to all the ground water resources of our state. To the extent that previous cases may be construed as following the \"absolute dominion rule\" for certain ground water categories, see Davis v. Afond, 5 Haw. 216, 222-23 (1884); Wong Leong v. Irwin, 10 Haw. 265, 270 (1986), they are hereby overruled.\n\nId. at 178, 9 P.3d at 490. \"Correlative rights, however, extend only to uses on lands overlying the water source,\" and, therefore, \"[p]arties transporting water to distant lands are deemed mere 'appropriators,' subordinate in right to overlying landowners.\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Id. (relying on Katz v. Walkinshaw, 74 P. 766, 772 (Cal. 1903)) (emphasis added).\n\nMoreover, Waiahole established that the relevant Code provisions, and not the common law doctrine of correlative rights, apply to WMAs:\n\nFinally, although the common law rules of riparian and correlative rights impose certain restrictions on the export of water out of the watershed or to nonoverlying lands, the Code expressly provides:\n\nThe common law of the State to the contrary notwithstanding, the Commission shall allow the holder of a use permit to transport and use surface or ground water beyond overlying land or outside the watershed from which it is taken if the commission determines that such transport and use are consistent with the public interest and the general plans and land use policies of the State and counties.\n\nHRS § 174C-49(c).\n\nThe foregoing provisions, therefore, reflect the legislative purpose of substituting, in designated management areas, a comprehensive regulatory system based on permits issued by the Commission in place of the common law regime of water rights administered by the courts. . . .\n\nId. at 179, 9 P.3d at 491 (citations omitted) (emphasis added).\n\nInasmuch as the entire island of Moloka`i has been designated a WMA, the common law doctrine of correlative rights is inapplicable to the present matter. That being the case, the Commission erred in concluding that MR-Wai`ola \"has correlative rights to make reasonable use of the water . . . .\" Even if MR-Wai`ola had correlative rights with respect to their lands in Kamiloloa, however, such rights would not have included the right to transport groundwater outside the Kamiloloa aquifer system. Waiahole, 94 Hawaii at 178, 9 P.3d at 490.\n\nNevertheless, assuming that the Commission renders similar findings on remand with respect to MR-Waiola's satisfaction of the conditions requisite to obtaining a water use permit, as set forth in HRS §§ 174C-49(a)(4), (5), and (6), MR-Wai`ola has the right to transport groundwater beyond the Kamiloloa aquifer system, pursuant to HRS § 174C-49(c). As previously mentioned, the right to transport water outside the watershed of origin is contingent upon a finding by the Commission that \"such transport and use are consistent with the public interest and the general plans and land use policies of the state and counties.\" See HRS § 174C-49(c), supra note 1. Although the Commission did not expressly invoke HRS § 174C-49(c) to establish the prerequisite for permitting MR-Wai`ola \"to transport or use . . . ground water beyond overlying land or outside the watershed from which it is taken,\" the Commission nevertheless made the necessary findings in the context of determining that MR-Wai`ola's application satisfied the conditions prescribed by HRS §§ 174C-49(a)(4), (5), and (6). In particular, the Commission expressly found that the proposed use was consistent with the public interest, as required by HRS § 174C-49(a)(4), when it favorably considered the impact of the proposed use on Molokai's economy and natural environment. See FOF Nos. 111-168; see also supra note 33. Moreover, the Commission expressly found that the proposed use was consistent with state and county general plans and land use designations, see HRS § 174C-49(a)(5), and county land use plans and policies, see HRS § 174C-49(a)(6). See FOF Nos. 182-200. As discussed supra in section III.B.3, the Commission did not clearly err in rendering the foregoing FOFs; accordingly, and notwithstanding that the Commission erroneously characterized MR-Wai`ola as having correlative rights to make reasonable use of its permitted water, the Commission's FOF with respect to HRS §§ 174C-49(a)(4), (5), and (6) establish the findings, as set forth in HRS § 174C-49(c), requisite to allowing MR-Wai`ola to transport and use groundwater outside the Kamiloloa aquifer system.\n\nF. The Commission Erred In Granting An \"Interim\" Water Use Permit For MR-Wai`ola's Proposed Future Uses.\n\nThe Kahae intervenors argue that the Commission erred in granting an \"interim\" water use permit, pursuant to HRS § 174C-50(e) (1993),\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e inasmuch as MR-Wai`ola had applied for a water permit for a \"new\" use, pursuant to HRS § 174C-49(a).\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e The Kahae intervenors further contend that, by granting an \"interim\" permit, the Commission impermissibly shifted the burden of establishing the conditions set forth in HRS § 174C-49(a) to the opponents of the application, thereby giving MR-Wai`ola \"the benefit of the doubt as to the potential effect of the future withdrawal of groundwater from the Kualapuu aquifer.\"\n\nMR-Wai`ola concedes that the Commission erred in granting an \"interim\" permit for a \"new\" use and that the Commission should have issued a \"permanent\" permit.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e MR-Wai`ola, however, contends that the Kahae intervenors incorrectly assume that, because the Commission issued an \"interim\" permit, it must have reviewed MR-Wai`ola's application for a water use permit under HRS § 174C-50, rather than HRS § 174C-49(a). In this connection, MR-Wai`ola asserts that the Kahae intervenors' argument ignores the Commission's COL No. 5, which expressly and unequivocally states that the Commission, in fact, reviewed MR-Wai`ola's application pursuant to HRS § 174C-49(a) and that MR-Wai`ola bore the burden of proof with respect to the seven conditions contained therein.\n\nPursuant to HRS § 174C-48(a), see supra note 17, \"[n]o person shall make any withdrawal, diversion, impoundment, or consumptive use of water in any designated [WMA] without first obtaining a permit from the commission. . . .\" See also HRS § 174C-53(a) (pertaining to \"new\" uses) and HRS § 174C-53(b) (pertaining to \"existing\" uses), supra note 5. As discussed supra in section III.B, HRS § 174C-49(a), see supra note 1, prescribes the conditions requisite to obtaining a water permit for a \"new\" use, which include, inter alia, that \"the applicant . . . establish that the proposed use of water . . . [w]ill not interfere with any existing legal use of water.\" See HRS § 174C-49(a)(3). By contrast, HRS §§ 174C-50(a) and (e), see supra note 44, provide that \"[a]ll existing uses of water in a designated [WMA] . . . may be continued after [the effective date of designation] only with a permit\" and that \"[t]he commission shall issue an interim permit; provided that the existing use meets the conditions of subsection (b).\" (Emphasis added.) Based on the foregoing, the Code provides, pursuant to HRS § 174C-50, for the issuance of an interim use permit only for \"existing legal uses.\"\n\nIt is apparent from the Commission's FOFs that MR-Waiola's application was correctly construed as seeking a \"new\" use of water, pursuant to HRS § 174C-49. Moreover, as duly noted by MR-Wai`ola in its answering brief, the Commission's COL No. 5 expressly stated that MR-Wai`ola's application was for a \"new\" use governed by HRS § 174C-49, which \"place[d] the burden on [MR-Waiola] to establish that the proposed water use [met] all of the . . . seven criteria by a preponderance of the evidence.\"\n\nQuite perplexing in light of the foregoing FOFs and COLs, however, the Commission set forth the following in its decision:\n\nThe Commission approves the issuance of an interim water use permit for the Kamiloloa-Wai`ola Well (Well No. 0759-01) for the reasonable-beneficial use of 655,928 gpd as listed in Exhibit 1, the Table of Allocations Approved, subject to the standard water use permit conditions of Attachment E, and the following special conditions:\n\nA. This interim water use permit shall cease to be interim and shall become subject to [HRS] § 174C-55,[\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e] upon the administrative review of the quantity within 5 years, provided that all of the use (including the review of the quantity which shall not be greater than the amount initially granted) remain the same.\n\n(Emphases added.) Furthermore, in its answering brief, the Commission seems to reaffirm the validity of its decision to issue an \"interim\" use permit by stating that \"the decision and order contain additional elements that ensure a just and reasonable situation. . . . The additional elements are that the Commission . . . issues an interim water use permit for only five years even though the Commission has the latitude to issue a permit for a longer time.\" (Emphasis added.)\n\nSimply put, we are unable to glean from the FOFs, COLs, or any other part of the record before us the Commission's reasons for issuing an \"interim\" use permit in the present matter. Although the proposed well would accommodate both \"existing\" and \"future\" uses -- e.g., 146,370 gpd from the proposed well would service existing customers on Moloka`i -- MR-Waiola's water use application seeks to establish a new groundwater source from which to make such uses. Currently, MR-Wai`ola does not control any source of potable groundwater to service its existing customers on Moloka`i. Rather, as we have noted, MR-Wai`ola purchases water from the County, DHHL, and KMI. Consequently, the proposed well in Kamiloloa would enable MR-Wai`ola to service its existing and future customers directly without an intermediary wholesaler.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e We therefore hold that the proposed well in Kamiloloa constitutes a \"new\" use, irrespective of whether a portion of the water derived therefrom would be utilized for existing purposes; accordingly, the Commission erred in granting MR-Wai`ola an \"interim\" use permit, ostensibly pursuant to HRS § 174C-49(a).\n\nIV. CONCLUSION\n\nOn the basis of the foregoing discussion, we vacate the Commission's decision and order and remand the matter to the Commission for further proceedings consistent with this opinion.\n\nI concur in the result. (J. Acoba)\n\n\u003cspan class=\"fn\"\u003e1. HRS § 174C-49 provides in relevant part: Conditions for a permit. (a) To obtain a permit pursuant to this part, the applicant shall establish that the proposed use of water: (1) Can be accommodated with the available water source; (2) Is a reasonable-beneficial use as defined in section 174C-3; (3) Will not interfere with any existing legal use of water; (4) Is consistent with the public interest; (5) Is consistent with state and county general plans and land use designations; (6) Is consistent with county land use plans and policies; and (7) Will not interfere with the rights of the department of Hawaiian home lands as provided in section 221 of the Hawaiian Homes Commission Act. (c) The common law of the State to the contrary notwithstanding, the commission shall allow the holder of a use permit to transport and use surface or ground water beyond overlying land or outside the watershed from which it is taken if the commission determines that such transport and use are consistent with the public interest and the general plans and land use policies of the State and counties. (d) The commission, by rule, may reserve water in such locations and quantities and for such seasons of the year as in its judgment may be necessary. Such reservations shall be subject to periodic review and revision in the light of changed conditions; provided that all presently existing legal uses of water shall be protected. (e) All permits issued by the commission shall be subject to the rights of the department of Hawaiian home lands as provided in section 221 of the Hawaiian Homes Commission Act, whether or not the condition is explicitly stated in the permit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. HHCA § 220 provides in relevant part: Development projects; appropriations by legislature; bonds issued by legislature; mandatory reservation of water. (a) Subject to subsection (d), the department is authorized directly to undertake and carry on general water and other development projects in respect to Hawaiian home lands and to undertake other activities having to do with the economic and social welfare of the homesteaders, including the authority to derive revenue from the sale, to others than homesteaders, of water and other products of such projects or activities, or from the enjoyment thereof by others than homesteaders, where such sale of products or enjoyment of projects or activities by others does not interfere with the proper performance of the duties of the department; provided that roads through or over Hawaiian home lands, other than federal-aid highways and roads, shall be maintained by the county in which the particular road or roads to be maintained are located. . . . .(d) For projects pursuant to this section, sufficient water shall be reserved for current and foreseeable domestic, stock water, aquaculture, and irrigation activities on tracts leased to native Hawaiians pursuant to section 207(a). HHCA § 221 provides in relevant part: Water. (b) All water licenses issued after the passage of this Act shall be deemed subject to the condition, whether or not stipulated in the license, that the licensee shall, upon the demand of the department, grant to it the right to use, free of all charge, any water which the department deems necessary adequately to supply the livestock, aquaculture operations, agriculture operations, or domestic needs of individuals upon any tract. (c) In order adequately to supply livestock, the aquaculture operations, the agriculture operations, or the domestic needs of individuals upon any tract, the department is authorized (1) to use, free of all charge, government-owned water not covered by any water license or covered by a water license issued after the passage of this Act or covered by a water license issued previous to the passage of this Act but containing a reservation of such water for the benefit of the public, and (2) to contract with any person for the right to use or to acquire, under eminent domain proceedings similar, as near as may be, to the proceedings provided in respect to land by sections 101-10 to 101-34, Hawaii Revised Statutes, the right to use any privately owned surplus water or any government-owned surplus water covered by a water license issued previous to the passage of this Act, but not containing a reservation of such water for the benefit of the public. Any such requirement shall be held to be for a public use and purpose. The department may institute the eminent domain proceedings in its own name.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Article XI, section 1 of the Hawaii Constitution provides: For the benefit of present and future generations, the State and its political subdivisions shall conserve and protect Hawaii's natural beauty and all natural resources, including land, water, air, minerals and energy sources, and shall promote the development and utilization of these resources in a manner consistent with their conservation and in furtherance of the self-sufficiency of the State. All public natural resources are held in trust by the State for the benefit of the people. Article XI, section 7 of the Hawaii Constitution provides: The State has an obligation to protect, control and regulate the use of Hawaii's water resources for the benefit of its people. The legislature shall provide for a water resources agency which, as provided by law, shall set overall water conservation, quality and use policies; define beneficial and reasonable uses; protect ground and surface water resources, watersheds and natural stream environments; establish criteria for water use priorities while assuring appurtenant rights and existing correlative and riparian uses and establish procedures for regulating all uses of Hawaii's water resources. Article XII, section 7 of the Hawaii Constitution provides: The State reaffirms and shall protect all rights, customarily and traditionally exercised for subsistence, cultural and religious purposes and possessed by ahupuaa tenants who are descendants of native Hawaiians who inhabited the Hawaiian Islands prior to 1778, subject to the right of the State to regulate such rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. HRS § 174C-101 provides in relevant part: Native Hawaiian water rights. (a) Provisions of this chapter shall not be construed to amend or modify rights or entitlements to water as provided for by the Hawaiian Homes Commission Act, 1920, as amended, and by chapters 167 and 168, relating to the Molokai irrigation system. Decisions of the commission on water resource management relating to the planning for, regulation, management, and conservation of water resources in the State shall, to the extent applicable and consistent with other legal requirements and authority, incorporate and protect adequate reserves of water for current and foreseeable development and use of Hawaiian home lands as set forth in section 221 of the Hawaiian Homes Commission Act. (c) Traditional and customary rights of ahupuaa tenants who are descendants of native Hawaiians who inhabited the Hawaiian Islands prior to 1778 shall not be abridged or denied by this chapter. Such traditional and customary rights shall include, but not be limited to, the cultivation or propagation of taro on one's own kuleana and the gathering of hihiwai, opae, oopu, limu, thatch, ti leaf, aho cord, and medicinal plants for subsistence, cultural, and religious purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. HRS § 174C-53 provides in relevant part: Permit issuance. (a) The commission shall determine, after a hearing, if required, whether the conditions set forth in section 174C-49(a) have been established; provided that the commission may make such determination without a hearing if the quantity of water applied for does not exceed an average amount per month to be established by rule or if the quantity of water applied for exceeds an average amount per month to be established by rule, but no objection to the application is filed by any person having standing to file an objection. (b) In acting upon any application, the commission need consider only those objections filed by a person who has some property interest in any land within the hydrologic unit from which the water sought by the applicant is to be drawn or who will be directly and immediately affected by the water use proposed in the application. The commission shall adopt rules governing the filing of objections and the persons having standing to file objections.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Kahae intervenors and OHA expressly join in DHHL's and the Ritte intervenor's opening briefs on appeal. Although DHHL and the Ritte intervenors raise many of the same issues on appeal as OHA and the Kahae intervenors, they do not expressly join in OHA's or the Kahae intervenor's opening briefs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. HAR § 13-167-56(b) provides: Conduct of hearing. (b) The presiding officer shall have the power to give notice of the hearing, administer oaths, compel attendance of witnesses and the production of documentary evidence, examine witnesses, certify to official acts, issue subpoenas, rule on offers of proof, receive relevant evidence, hold conferences before and during hearings, rule on objections or motions, fix times for submitting documents, briefs, and dispose of other matters that normally and properly arise in the course of a hearing authorized by law that are necessary for the orderly and just conduct of a hearing. The commission members may examine and cross-examine witnesses. HAR § 13-167-59(a) provides that \"[t]he presiding officer may exercise discretion in the admission or rejection of evidence and the exclusion of immaterial, irrelevant, or unduly repetitious evidence as provided by law with a view to doing substantial justice.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. At the time of the contested case hearing, Wai`ola purchased 100,000 gallons per day (gpd) from the County, 75,000 gpd from KMI, and 20,000 gpd from DHHL to service its customers on Moloka`i. Wai`ola's purchase agreements with DHHL and KMI serve its customers in Kipu and Kualapu`u, respectively; the proposed water use does not affect the foregoing agreements. Wai`ola, however, intends to discontinue its purchase agreement with the County upon completion of the proposed well construction. In addition, Wai`ola has developed an alternative means to servicing its customers' potable water needs in the event that it is unable to purchase water or obtain its own groundwater source. Specifically, Wai`ola's contingency plan contemplates treating surface waters collected from MR's mountain water system to meet potable standards. Treating surface water to achieve potable quality, however, is an expensive alternative and threatens agricultural irrigation -- i.e., for every gallon of surface water put to potable use, there is one gallon less that is available for agriculture uses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. MR's development plan is quite brief, consisting of a two-page spreadsheet. Specifically, the spreadsheet sets forth MR's existing uses for residential, commercial, and agricultural purposes, as well as MR's projected future uses for residential, commercial, and agricultural purposes. The future commercial uses are subdivided into the following categories, which we presume reflect MR's long-range economic development plan: (1) Maunaloa Village includes (a) rodeo, (b) restaurant/office, (c) light industrial, and (d) lodge uses; (2) Kualapu`u includes an old theater site; and (3) Pala`au Industrial Park. With respect to future residential uses, it appears from the spreadsheet that MR plans to expand its residential holdings in Maunaloa Village, Kualapu`u Town, and Pu`ukolea. Future agricultural uses include a community park in Maunaloa Village. In sum, although the development plan upon which MR-Wai`ola bases its application for a water use permit is minimal at best, the spreadsheet does include (1) a detailed breakdown of the projected water use for each category and subcategory and (2) as to each category and subcategory, the percent of the total requested water to be used within the first four years of the implemented development plan. We note, however, that the appellants maintain that MR's development plan constitutes a speculative \"back-of-the-envelope\" effort, without any community input or an overall business plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Wai`ola based its request on the following formula, which did not exceed the standards for water use applied by the County: (1) residential -- 500 gpd per dwelling unit; (2) commercial -- 140 gpd per 1000 square feet; (3) light industrial -- 4,000 gpd per acre; (4) visitor accommodations/lodging -- 250 gpd per room; and (5) camp sites -- 100 gpd per site.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Broadly defined, \"basal groundwater\" is \"water below the lowest water table.\" United States Geological Survey, Groundwater in Hawaii 3 (2000). In Hawaii, however, the term \"basal groundwater\" has generally been limited to \"ground water with a water table near sea level in high-permeability rocks.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. A transition zone results from saltwater that \"flows landward in the deeper parts of the aquifer, rises, and then mixes with seaward-flowing freshwater.\" United States Geological Survey, Geohydrology and Numerical Simulation of the Ground-Water Flow System of Moloka`i, Hawaii 28 (1997). The thickness of the transition zone depends on the extent of mixing between freshwater and saltwater. Id. The Ghyben-Herzberg principle estimates the thickness of a freshwater lens as follows: \"[i]f the specific gravities of freshwater and saltwater are assumed to be 1.000 and 1.025, respectively, then the Ghyben-Herzberg principle predicts that every foot of freshwater above sea level must be balanced by 40 ft of freshwater below sea level.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. HAR § 13-171-63 provides: Department of Hawaiian homelands reservation for Kualapu`u, Moloka`i. The commission hereby reserves 2.905 million gallons per day of ground water from state lands in the Kualapu`u aquifer system for use on Hawaiian home lands on Moloka`i. This amount shall be in excess of the existing uses of water on Hawaiian home lands as of the effective date of this rule. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. \"Limu\" is \"[a] general name for all kinds of plants living under water, both fresh and salt . . . .\" M.K. Pukui \u0026 S.H. Elbert, Hawaiian Dictionary 207 (Rev. Ed. 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Several native Hawaiians testified that they have \"a religious and spiritual relationship to the land and water areas and a commitment to malama ka aina, which requires protecting the natural ecosystems from desecration and deprivation of its natural freshwater resources.\" Moreover, the map of Subsistence Sites indicated that the Kamiloloa shoreline and near-shore waters are used for fishing and ocean gathering.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. HRS § 174C-41 provides in relevant part: Designation of water management area. (a) When it can be reasonably determined, after conducting scientific investigations and research, that the water resources in an area may be threatened by existing or proposed withdrawals or diversions of water, the commission shall designate the area for the purpose of establishing administrative control over the withdrawals and diversions of ground and surface waters in the area to ensure reasonable-beneficial use of the water resources in the public interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. HRS § 174C-48 provides in relevant part: Permits required. (a) No person shall make any withdrawal, diversion, impoundment, or consumptive use of water in any designated water management area without first obtaining a permit from the commission. However, no permit shall be required for domestic consumption of water by individual users . . . . An existing use in newly designated areas may be continued until such time as the commission has acted upon the application subject to compliance with section 174C-51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. On April 15, 1997, Chairperson Michael Wilson appointed Commissioner Richard H. Cox to preside over the contested case hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The appellee County of Maui separately filed an answering brief in the present appeal and also joined in the answering brief submitted by MR-Wai`ola.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. \"An 'ahupua`a' is a land division usually extending from the mountains to the sea along rational lines, such as ridges or other natural characteristics.\" Public Access Shoreline Hawaii v. Hawaii County Planning Commission, 79 Hawaii 425, 429 n.1, 903 P.2d 1246, 1250 n.1 (1995) (emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. HRS § 174C-2(c) provides: Declaration of policy. (c) The state water code shall be liberally interpreted to obtain maximum beneficial use of the waters of the State for purposes such as domestic uses, aquaculture uses, irrigation and other agricultural uses, power development, and commercial and industrial uses. However, adequate provision shall be made for the protection of traditional and customary Hawaiian rights, the protection and procreation of fish and wildlife, the maintenance of proper ecological balance and scenic beauty, and the preservation and enhancement of waters of the State for municipal uses, public recreation, public water supply, agriculture, and navigation. Such objectives are declared to be in the public interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. \"Makai\" means \"on the seaside, toward the sea, in the direction of the sea.\" M.K. Pukui \u0026 S.H. Elbert, Hawaiian Dictionary 114 (Rev. Ed. 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. HAR § 13-171-20(e) provides that \"[t]he commission shall condition permits under this chapter in such a manner as to protect instream flows and maintain sustainable yields of ground water established under the Hawaii Water Plan.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. DHHL neither raises as a point of error that the Commission erred in finding that reservations of water were aquifer-specific nor joins in the Intervenors' or OHA's opening briefs on appeal. DHHL, however, arguing that the proposed water use would interfere with its existing uses in the Kualapu`u aquifer system, asserts that \"the Water Code does not allow the Commission arbitrarily to limit its duty to prevent (or at least minimize) interference with existing uses by artificially dividing a water system into two.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. HRS § 174C-3 (1993) and HAR § 13-170-1 (1996) define \"sustainable yield\" as \"the maximum rate at which water may be withdrawn from a water source without impairing the utility or quality of the water source as determined by the commission.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. HRS § 174C-3 (1993) and HAR § 13-170-1 (1996) define \"hydrologic unit\" as \"a surface drainage area or a ground water basin or a combination of the two.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. HAR § 13-170-2 provides in relevant part: Formulation of the Hawaii water plan. (a) The commission shall formulate an integrated program for the protection, conservation, and management of the waters of the State. This program . . . shall be known as the Hawaii water plan. The Hawaii water plan shall serve as a continuing long-range guide for water resource management. . . . (c) In preparing the Hawaii water plan[,] each county shall be divided into sections which shall conform as closely as practicable to hydrologic units. The plan shall describe and inventory the following information within each designated hydrologic unit: . . . . (3) Sustainable yield. (The sustainable yield shall be determined using the best available information and shall be reviewed periodically. Where appropriate[,] the sustainable yield may be determined to reflect seasonal variation.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. OHA argues that DHHL's reservation rights are grounded in the \"federal-reserved-water-rights\" doctrine espoused by the United States Supreme Court in Winters v. United States, 207 U.S. 564 (1908). In Winters, the Supreme Court held that the federal government, in granting reservations of federal land to native Americans, impliedly reserved sufficient water to make such land productive. Id. at 575-77. As the Commission and MR-Wai`ola correctly point out in their answering briefs, however, the legislative history underlying the 1991 amendments to the Code and the HHCA reflect a legislative intent that the Code supercede the Winters doctrine for purposes of Hawaii law. The following legislative history is particularly germane: In carrying out this duty to reserve water for the DHHL as provided under Section 221 of the HHCA, the Commission on Water Resource Management in particular must act in a manner consistent with its other legal obligations and its own authority. At the same time that the needs of Hawaiian home lands must be honored, constitutionally protected private interests must also be respected. Your Committee amended this bill by deleting any reference to the Winters Doctrine or to water law as it has evolved on the continental United States, which has a different history and a different set of water doctrines. This bill expressly creates as a matter of state law Hawaii's own form of water reservation for Hawaiian home lands. Sen. Conf. Comm. Rep. No. 48, in 1991 Senate Journal, at 763. In essence, the 1991 amendments to HHCA § 220, HRS § 174C-49(a)(7), and HRS § 174C-101(a) comprise the state law equivalent to the Winters doctrine for purposes of homesteaders on Hawaiian homelands. Thus, the Winters doctrine is inapplicable to the present matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. As mentioned supra in section III.A.2, the Code separately protects both \"reservations\" and \"existing legal uses.\" In particular, HRS § 174C-49(a)(3) protects all existing legal uses -- in this case, DHHL's existing wells in Kualapu`u -- from interfering uses; likewise, HRS § 174C-49(a)(7) protects DHHL's reservations from interfering uses. In addition to the protections afforded by HRS § 174C-49(a)(7), for purposes of an application for a \"new\" water use permit, the public trust doctrine, which \"continues to inform the Code's interpretation, define its permissible 'outer limits,' and justify its existence,\"Waiahole, 94 Hawaii at 133, 9 P.2d at 445, mandates that DHHL's reservations of water be afforded protections under the Hawaii Constitution, as well as the Code. That being the case, our holding that reservations constitute a public trust purpose/use does not undermine our holding supra in section III.A.2 that reservations do not constitute an \"existing legal use.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. For example, the Commission's decision provides for the following safeguards: (1) continuing jurisdiction over the matter; (2) permitting any party or the Commission to initiate a revocation action under HRS § 174C-58 against MR-Wai`ola in the event that Wai`ola does not utilize its water allocation; (3) allowing any party to petition the Commission to order a \"show-cause hearing\" in the event that \"'there is a significant and unexpected drawdown in the well and consequent reduction in the groundwater discharge into the near-shore area substantially in excess of the USGS model predictions presented in this case'\"; and (4) a well monitoring program, which mandates, inter alia, that MR-Waiaola implement a long-term testing plan to collect water-level data to be evaluated by the Commission staff for detrimental effects on the near-shore environment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The Kahae intervenors also argue that the Commission erred in denying their oral motion to admit Exhibits B-28 through B-34 -- a series of correspondence between MR executives and the County dated from September 29, 1995 through November 13, 1996 -- into evidence. The Kahae intervenors sought to introduce the foregoing exhibits during the final day, November 21, 1997, of the contested case hearing in order to establish (1) that MR-Wai`ola had not met its burden under HRS §§ 174C-49(a)(5) and (6) and (2) that the proposed use was inconsistent with the Moloka`i Working Group's recommendations. The record reflects that the Commission denied the oral motion on the bases (1) that the evidence was untimely, having been proffered after October 3, 1997, which was the final date for the submission of documents and exhibits as fixed by the Commission, and (2) that \"the marginal relevance, if any, [was] outweighed by the prejudice that introducing this evidence at this late date [would] have for Applicants.\" Inasmuch as \"the presiding officer shall have the power to . . . fix times for submitting documents,\" see HAR § 13-167-56(b), supra note 7, and \"may exercise discretion in the admission or rejection of evidence,\" see HAR § 13-167-59(a), supra note 7, we believe that the Commission did not abuse its discretion in denying the Kahae intervenors' oral motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The island of Moloka`i is one of nine regions that comprise Maui County. Each region has its own community plan that incorporates the Maui County land use plans and policies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Although the appellants raise as a general point of error that MR-Wai`ola failed to establish each of the conditions requisite to obtaining a water use permit, as set forth in HRS § 174C-49(a), the appellants nowhere specifically argue that MR-Wai`ola failed to meet its burden of establishing that the proposed use was \"consistent with the public interest,\" pursuant to HRS § 174C-49(a)(4). That being the case, the appellants waived that portion of their point of error. See Hawaii Rules of Appellate Procedure (HRAP) Rule 28(b)(7) (2002) (\"Points not argued may be deemed waived.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Dr. Smith recommended that the Commission obtain \"more refined field data on the relation of nutrient and freshwater to limu growth,\" prior to rendering its decision in the present matter. Similarly, Dr. Tamaru, the only fisheries expert to testify at the contested case hearing, opined that a reduction in freshwater discharge as low as five to fifteen percent along the Kamiloloa coast \"could lead to the diminishment of a whole ecosystem of habitats for a large range of creatures, micro algae, crustaceans, opae, hee, birds, juvenile and adult fish, and ultimately, people.\" Dr. Tamaru urged the Commission to implement a long-term monitoring program along the Kamiloloa shoreline to gauge the effects of the proposed withdrawal prior to proceeding with a water use permit in the present matter. He further suggested that the well monitoring program record data on a monthly basis, at a minimum, for approximately one to two years to ascertain a baseline; he then recommended that the monitoring program continue to record the salinity, rainfall, phytoplankton, micro algae, invertebrates, and fish for approximately five years after the commencement of MR-Wai`ola's withdrawal of water.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. For example, the Intervenors assert that Dr. Dollar's conclusion that, due to the muddy and sandy condition of most of the Kamiloloa near-shore area, there were no significant amounts of edible limu in his study area was significantly undermined by several native Hawaiian limu gatherers who testified that they \"regularly find abundant amounts of limu, huluhuluwaena, plahalaha, waewae`ole, ele`ele, and ogo, along the same shoreline\" as Dr. Dollar's study area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. At the time of the contested case hearing in the present matter, the Commission had not yet issued its final decision in the Waiahole matter and was yet to conduct the contested case hearing in the Ewa Marina matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. HRS § 91-10(1) provides in relevant part that \"[a]ny oral . . . evidence may be received, but every agency shall as a matter of policy provide for the exclusion of irrelevant, immaterial, or unduly repetitious evidence . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. David Blane, the County's Planning Director at the time of the contested case hearing, testified that long-range water commitments were essential to the success of a water resource development plan. In addition, the MWG utilized a ten to twenty year planning window in recommending a plan to the Commission for water development on Moloka`i. Finally, the MCP contemplates water resources development over a period of one to twenty years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. HRS § 174C-58(4) provides: Revocation of permits. After a hearing, the commission may suspend or revoke a permit for: (4) Partial or total nonuse, for reasons other than conservation, of the water allowed by the permit for a period of four continuous years or more. The commission may permanently revoke the permit as to the amount of water not in use unless the user can prove that the user's nonuse was due to extreme hardship caused by factors beyond the user's control. The commission and the permittee may enter into a written agreement that, for reasons satisfactory to the commission, any period of nonuse may not apply towards the four-year revocation period. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In 1999, the legislature amended HRS § 174C-2(b), replacing \"state water use and protection plan\" with \"Hawaii water plan.\"See 1999 Haw. Sess. L. Act 197, § 1 at 656-57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The record reflects that only fifty percent of the allocated water for future residential and commercial uses would be utilized within the first four years of MR-Wai`ola's development plan; future commercial uses for lodging, however, would utilize one hundred percent of its allocation within four years. With respect to the Plau Industrial Park, only twenty-five percent of the allocated water would be utilized within four years of the issuance of the water use permit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The Commission's answering brief does not address the arguments relating to the common law doctrine of correlative rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. We note that the correlative rights analysis in Waiahole involved the prioritizing of alleged \"existing correlative uses.\" 94 Hawaii at 176-80, 9 P.3d at 488-92. By contrast, the issue on appeal in the present matter is whether MR-Wai`ola has correlative rights to transport water for \"new\" uses outside the Kamiloloa aquifer system. Moreover, there was no competition for water use in the Kamiloloa aquifer system, as was the case in Waiahole; in Waiahole, there were approximately seven water use permit applications, which collectively requested amounts of water in excess of the entire flow of the Waiahole ditch (27 mgd). Notwithstanding the foregoing factual distinctions, we believe that the principles of law enunciated in Waiahole -- i.e., that the common law doctrine of correlative rights does not apply to WMAs and, therefore, that the Code governs any claim to transport groundwater outside the watershed from which it is taken -- are applicable to MR-Wai`ola's application for a water use permit in the present matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. HRS § 174C-50 provided in relevant part: Existing uses. (a) All existing uses of water in a designated water management area, except those exempted from regulation by this chapter, may be continued after July 1, 1987, only with a permit issued in accordance with sections 174C-51, 174C-52, and 174C-53(b). (e) The commission shall issue an interim permit; provided that the existing use meets the conditions of subsection (b). The commission shall also issue an interim permit for an estimated, initial allocation of water if the quantity of water consumed under the existing use is not immediately verifiable, but the existing use otherwise meets the conditions of subsection (b) for a permit or an interim permit. An interim permit is valid for such time period specified therein. The commission may issue successive interim permits of limited duration. Interim permits are subject to revocation under section 174C-58. . . . In 2001, the legislature retroactively amended HRS §§ 174C-50(a), (b), and (d) by replacing \"July 1, 1987\" with \"the effective date of designation.\" See Haw. Sess. Laws Act 10, § 3 at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Although the Kahae intervenors failed to raise this issue in the points of error on appeal section of their opening brief, we nevertheless address their argument in order to correct the Commission's error. See HRAP Rule 28(b)(4) (\"[T]he appellant shall file an opening brief, containing . . . [a] concise statement of the points of error set forth in separately numbered paragraphs. . . . Points not presented in accordance with this section will be disregarded, except that the appellate court, at its option, may notice a plain error not presented.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. MR-Wai`ola declined to file a notice of appeal with respect to the Commission's error.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. HRS § 174C-55 (1993) provides: Duration of permits. Each permit for water use in a designated water management area shall be valid until the designation of the water management area is rescinded, unless revoked as provided in section 174C-58 or modified as provided in section 174C-57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. . The record reflects that MR-Waiola intended to discontinue its purchase agreement with the County in the event that the Commission granted it a water use permit in the present matter. Seesupra note 8.\u003c/span\u003e\n\n",
    "body_length": 198009,
    "citedas": [
      "103 Hawai'i 401",
      "83 P.3d 664"
    ],
    "attorneys": "On the briefs: William M. Tam, of Alston, Hunt, Floyd \u0026 Ing, for the appellant, Department of Hawaiian Home Lands. Alan T. Murakami, of Native Hawaiian Legal Corporation, for the intervenors-appellants, Martin Kahae, Wayde Lee, Sheldon Hamakua, Walter Mendes, Louise Bush, Judy Caparida, and Robert Alcain. Paul H. Achitoff, of Earthjustice Legal Defense Fund, for the intervenors-appellants, Walter Ritte, Earl Mowat, and Glenn Davis. Jon M. Van Dyke, for the intervenor-appellant, Office of Hawaiian Affairs. Linden H. Joesting, Deputy Attorney General, for the appellee, State of Hawaii. Yvonne Y. Izu, of Oshima, Chun, Fong \u0026 Chung, for the applicant-appellee, Wai`ola O Moloka`i, Inc. and Moloka`i Ranch, Ltd. Gary W. Zakian, Deputy Corporation Counsel, for the appellee, County of Maui.",
    "category": [],
    "judges": "Moon, C.J., Levinson, And Nakayama, JJ., Circuit Judge Mckenna, IN Place OF Duffy, J., Recused, And Acoba, J., Concurring Separately",
    "citation_count": 34
  }
}
