{
  "id": "-4IhPmYBTlTomsSBqg5s",
  "document": {
    "title": "Florida Power \u0026 Light Co. v. Westinghouse Electric Corp.",
    "full_title": "FLORIDA POWER \u0026 LIGHT COMPANY v. WESTINGHOUSE ELECTRIC CORPORATION",
    "jurisdiction": "Fourth Circuit",
    "date": "1987-08-12T00:00:00.000Z",
    "docket": "No. 85-1089",
    "body": "RUSSELL, Circuit Judge:\n\nThis litigation had its beginning over two decades ago, though actual litigation has been in progress only a little over a decade. During this period the development of a program of peaceful use of nuclear power as authorized by Congress, begun with such enthusiasm, has since experienced a chequered career, marked by many changes in official policy and subjected to increasing regulatory and judicial constraints. All of these circumstances have contributed to the complexities and difficulties of the present litigation. In its court life of a little over a decade this litigation has generated thousands of pages of trial and discovery testimony and has produced for the record innumerable exhibits, some of an extremely technical nature. Highly expert engineering and scientific testimony and records have been developed. The result has been three separate district court decisions, spread over about four years, which have not been consistent. It is our task on this appeal to resolve the issues that have arisen in the litigation over the last decade in these contradictory decisions.\n\nI.\n\nThe subject of the action is a contract between the appellee, Florida Power \u0026 Light Company (Florida), and the appellant, Westinghouse Electric Corporation (Westinghouse). This contract had its source in the early 60's when Florida determined to give careful consideration to the construction of a nuclear power plant or plants at Turkey Point, in the State of Florida. Florida's interest in such a development was prompted by the high cost to it of transporting coal or oil necessary for firing its electric generating plants. Nuclear power was thought likely to provide Florida with a less expensive alternative to coal or oil for its power generation. Florida invited three concerns experienced in providing nuclear power plants to submit detailed proposals for the plant it was considering. These concerns were the defendant Westinghouse, the General Electric Corporation, and Babcock \u0026 Wilcox. Only Westinghouse and General Electric Corporation, however, responded to Florida's invitation with complete proposals. The proposals of the two were carefully compared and evaluated by Florida over a considerable period of time. Florida finally settled on Westinghouse as its supplier, selecting the latter's pressurized water reactor (PWR) as the favored facility. Florida, in announcing the signing of the contract of purchase with Westinghouse, said the facility selected had \"been operating successfully for several years in commercial generating stations\" both in this country and abroad.\n\nAfter Westinghouse and its PWR facility had been chosen by Florida, the parties engaged in the drafting of a definitive purchase contract. The contract negotiations proceeded over a number of months. In the course, drafts were exchanged between the parties. The district court found that, while Westinghouse was supposedly more expert in the field of nuclear energy, Florida was more expert in the drafting of agreements and that it had demonstrated this superior expertise by \"out-negotiating\" Westinghouse in negotiating the ultimate purchase contract. Whether Westinghouse was \"out-negotiated\" or not is, however, irrelevant in this context since the contract was freely and voluntarily executed by the parties. Under the contract executed Westinghouse, in consideration of Florida's agreements, obligated itself (1) to supply Florida with a Westinghouse PWR-type nuclear power installation, (2) to furnish at a fixed price the uranium to be required for the first ten years of the plant's operations, and (3) to grant Florida an option to exercise one of three options for the disposal of the spent fuel discharged by the plant's reactors for the first ten years of the plant's operations. One of the options (Option A) contemplated disposal of the spent fuel by Florida; the other two, with some minor variations, (Options B and C) provided for disposal by Westinghouse. Florida was required to exercise its option on or before \"initial criticality\" (i.e., before the plant became operational).\n\nInitial criticality, namely when the plants became operational, (the contract had been expanded after initial execution of the contract to include the furnishing of a second plant) was reached in October of 1972 for the first plant and in June, 1973 for the second. The two plants have been successfully operated since completion with considerable savings to Florida and its customers in energy costs. While there was a dispute between the parties with respect to that part of the contract which imposed on Westinghouse the obligation to furnish uranium at a fixed price for the first ten years of the plants' operations, this controversy has been settled between the parties and is not an issue on this appeal. The only part of the contract involved in this appeal is that section dealing with the disposal of spent fuel. In October, 1972, Florida formally elected to require Westinghouse to dispose of the spent fuel discharged by the plants' reactors under Option C of the contract. It had, though, earlier in 1970 informally [and in 1972 formally] informed Westinghouse that it was electing to require Westinghouse to do this.\n\nOption C is set forth in Section 27(a)(2) of the contract. It is:\n\nSection 27. Scope\n\n(a) Westinghouse will: . . . .\n\n(2) Remove the irradiated fuel from the Plant site and dispose of it as Westinghouse sees fit; . . . .\n\nEarlier in 1969, Westinghouse had, with the knowledge of Florida and on the assumption it might be required by Florida to dispose of the spent fuel at the plant, begun discussions with Allied General Nuclear Services (AGNS) which had a construction permit from the Atomic Energy Commission (AEC) to construct a reprocessing plant at Barnwell, South Carolina,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e for the purpose of securing reprocessing of the Turkey Point spent fuel at AGNS's reprocessing plant then under construction as a means of disposing of the Turkey Point spent fuel. By April, 1970, these negotiations resulted in a letter of intent between Westinghouse and AGNS for the reprocessing of such spent fuel at the Barnwell plant \"subject to the negotiation of a mutually acceptable agreement.\" The parties arrived at an unsigned agreement in 1974. AGNS, however, refused to sign the agreement. As summarized in a Westinghouse memorandum, AGNS\n\n\"claimed that its contracts, including a letter of intent agreement with Westinghouse were no longer valid and must be renegotiated. AGNS claim[ed] that changing government regulations [had] increased its costs several times. They are currently seeking government aid in several areas to assure their ability to run the facility. Westinghouse and AGNS have discussed several proposals since AGNS refused to sign the original contract in 1974. These proposals have been open ended on the cost to Westinghouse while maintaining a degree of profit for AGNS. Westinghouse continues to maintain its position that these proposals are not consistent -- with the letter of intent and draft agreement agreed on by the parties.\"\n\nAGNS itself stated its reasons for refusing to execute the agreement in a formal letter to Westinghouse dated March 28, 1974:\n\nDuring the more than four years since we submitted our proposal, matters have developed regarding the processing of fuel which are considerably different from those anticipated at time of submission of our proposal. Therefore, we advise that we will not be in a position to execute an agreement until such matters have been further discussed with you.\n\nFor some time while these negotiations between AGNS and Westinghouse were going on, Florida had been storing the spent fuel on-site by reracking it. However, it had been understood that, with the exercise of Florida of Option C under the contract, Westinghouse was to remove the spent fuel when it had cooled and this was estimated at about six months after removal of the fuel from the core of the installation. When spent fuel was ready for removal and disposal, Florida called on Westinghouse in mid-1975 to proceed to dispose of the spent fuel at the site. Westinghouse responded to this request by advising Florida in writing on September 2, 1975, that at that time it was unable to dispose of the fuel and was also unable to make \"any plans for the removal of the spent fuel from the Turkey Point site.\" It explained the reason for this position:\n\nThe schedule for removing and reprocessing the Turkey Point discharged fuel is, of course, dependent on the Allied-General Nuclear Services (AGNS) reprocessing facility schedule. Although Westinghouse has had recent discussions with AGNS, major uncertainties still exist which make it impossible to establish the long-range plans you [Florida] inquired about.\n\nNo agreement was thereafter reached between AGNS and Westinghouse. In the meantime, Florida became concerned with the accumulation of spent fuel at the site and Westinghouse's failure to dispose of such spent fuel. To resolve this problem, it filed this action.\n\nFlorida sought in its action specific performance of Westinghouse's obligation to dispose of the spent fuel or, in the alternative, damages for breach of the contract. Westinghouse answered the action, alleging in defense \"(1) that its non-performance [under the contract was] excused by the common law doctrine of impossibility of performance; (2) that the government's change of policy concerning commercial reprocessing discharge[d] its duty under the force majeure clause; (3) that performance by it has been rendered commercially impracticable under § 2-615 of the Uniform Commercial Code; (4) that the non-availability of reprocessing [had] frustrated the purposes of the contract; and (5) that the parties' erroneous expectation that the spent fuel would be reprocessed discharge[d] Westinghouse's obligation under the doctrine of mutual mistake.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAfter a trial, the district court issued on June 25, 1981, its first opinion herein, in which it dismissed the several pleas in defense by Westinghouse but deferred for further discussion and review the appropriate remedy for such breach. Three years later, it issued a second opinion, which, though reaffirming substantially its earlier dismissal of Westinghouse's pleas in defense, found that, as a result of unanticipated events, performance under the contract by Westinghouse was \"vitally different\" from that anticipated at the time of the contract's execution, thereby excusing performance by Westinghouse. It, therefore, divided the costs of reracking the spent fuel on-site between the parties but imposed the costs of permanent disposal and storage upon Florida, on the assumption that Florida would be permitted to pass such cost on to its ratepayers. Following a request for rehearing by Florida, the district court issued a third opinion on November 8, 1984, in which, again, it in effect divided the costs of reracking the spent fuel between the parties but imposed the obligation to pay for the storage of such fuel on Westinghouse. Westinghouse has appealed from that order and the judgment issued thereunder. It is that judgment which is the subject of this appeal.\n\nII.\n\nAn understanding of the questions raised by this appeal and of the rulings of the district judge herein requires a limited review of the development of atomic energy and, in particular, the Governmental postwar policy toward the private development of peaceful uses of this atomic energy. It was this Governmental policy to foster peaceful use of atomic energy, or, more correctly, the changes in that policy, which have created this controversy and the facts on which Westinghouse's defense of impossibility rests.\n\nAtomic energy, the so-called \"splitting-of-the-atom,\" was initially the product of Government research and action under a program generally described as the Manhattan Project, a program carried out successfully with great dispatch and in the utmost secrecy and security during World War II at a cost of over $2 billion, with an employment force of 600,000 persons spread over 37 installations in the United States and Canada.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e As first contemplated, its purposes envisioned a military use for the product.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In the years after the end of the war, however, interest in the peaceful use of atomic energy in the private sectors was sparked. Any program for such use, though, could evolve only as a part of a broad Governmental program under federal regulations which would preserve the security of our military atomic program and contemporaneously provide for the commercial use of such energy under circumstances assuring the safety and health of the public. Congress, in the Atomic Energy Act of 1954, as amended, 42 U.S.C. §§ 2011 et seq., sought to accomplish this purpose so far as the peaceful use of such energy was concerned.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn the legislative findings in support of this 1954 Act the Congress declared that the \"source and special nuclear material, production facilities, and utilization facilities\" for the use of nuclear energy were to be treated as \"affected with the public interest\" and that the regulation of such use and any facilities connected therewith, whether for military or peaceful purposes, were to be strictly regulated \"in the national interest to assure the common defense and security and to protect the health and safety of the public.\" Section 2012(e). Within such purposes, the Congress directed, inter alia, the formulation of a \"program to encourage widespread participation in the development and utilization of atomic energy for peaceful purposes to the maximum extent consistent with the common defense and security and with the health and safety of the public.\" Section 2013(d). See 1954 U.S. Cong. \u0026 Admin. News, pp. 3458-89, § 2051(a)(4) of the Act. The Atomic Energy Commission (AEC) was created and vested with the responsibility of effectuating this program and of carrying out the purposes mandated by the Act, including the development of a commercial nuclear electric industry, Sections 2031 et seq.\n\nThe first area identified by the AEC as one where the peaceful use of nuclear energy might be efficiently and safely applied was electric power generation.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The AEC had already, by its own statement, \" acquired substantial experience in the design, construction, and operation of nuclear power reactors.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e It, therefore, knew that the use of nuclear energy to generate electric power was practical. But the use of nuclear materials in power generation had to include more than the solution of the fissionable process and the design and operation of practical and efficient nuclear power reactors; a safe, effective method of disposing of the irradiated fuel at the end of the processing stage was equally necessary because of the severe danger such fuel posed for public health and safety. This spent or irradiated fuel, which includes plutonium with \"a half-life of 25,000 years,\" admittedly posed a \"severe potential health hazard\" and its disposal presented \"complex technical problems.\" Natural Resources Defense Council v. U.S. Nuclear Reg. Com'n., 178 U.S. App. D.C. 336, 547 F.2d 633, 638, n.10 (D.C. Cir. 1976).\n\nBoth the AEC and Congress recognized that the \"public acceptance of nuclear power [was] dependent upon resolving\" this problem of disposal of spent fuel which was aptly described as the \"most pressing\" concern in the promotion of a commercial nuclear power development. 1980 U.S. Code Cong. \u0026 Admin. News at 3933. It was plainly recognized that without the assurance of a safe method of disposal, no utility would have prudently considered the hazard of constructing a nuclear power plant. Absent that assurance, any utility which constructed a nuclear power plant could only have looked forward to that early day when inability to dispose of the fuel would have required it to abandon the heavy investment it had made in the plant without any guarantee of recoupment through rates. Moreover, because of the complexity and technological uniqueness and hazard to public health and safety, disposal of this spent fuel was not an endeavor to be left to private industry but was a matter, the responsibility for which had to be the subject of careful governmental attention and strict regulation. And the Congress had made plain that this was the policy of the Government. Thus, in an official legislative Report reviewing the progress of federal management of nuclear energy under the Atoms-for-Peace Program, Congress had declared positively that \"the stated policy of the Federal Government has always been that the safe disposal of high-level waste is to be accomplished under Federal management.\" 1980 U.S. Code Cong. \u0026 Admin. News at 6934.\n\nIn discharging this responsibility to assure reasonably safe disposal of spent fuel in its Atoms-for-Peace Program, the Government had but two possible options: one was the promotion of disposal by storage of the fuel in off-site surface depositories; the other the promotion of reprocessing of such fuel.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e However, the Government had not regarded storage as a feasible and acceptable method of disposal and took no steps to develop or provide this method of disposal of spent fuel. This had been true from the very beginning of the Government's nuclear program and it remained so for all practical purposes until 1977, when reprocessing was effectively suspended by judicial actions and presidential dictates. Neither in its own operations nor in its planning under the Atoms-for-Peace Program had the Government contemplated, recommended, or supported the use of storage depositories for such disposal.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Until 1971, it had never given any thought even to an experimental program for storage of the fuel, and even then it did so only under the pressure of environmental groups contesting the safety of reprocessing. Because of the complaints of these groups, the Commission made a stab in that year at developing an experimental storage depository for spent fuel at Lyons, Kansas. Such attempt, however, quickly foundered under \"an intense political attack on the program,\" followed by the revelation of \"technical flaws in the site.\" This failure of an attempt at experiment with storage was later described in the legislative history of the Nuclear Waste Policy Act of 1982 (NWPA) as \"now widely recognized as the landmark event in nuclear waste management history which would color future repository siting activities through the present day.\" 1982 U.S. Code Cong. \u0026 Admin. News at 3793. Five years later, in 1976, after the courts had suspended further licensing of reprocessing facilities pending their action,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e the commission sought to renew its earlier checkmated 1971 effort by planning an experimental storage depository in Michigan, but a \"political uproar quickly brought the program to defeat again, this time even before enough drilling could be accomplished to determine whether technical flaws in the site existed.\" Ibid., at 3793.\n\nIn 1977 President Carter terminated the uncertainty, deferring indefinitely the commercial reprocessing and recycling of the plutonium produced in the commercial nuclear power plants and in the process terminating the promotion of the Atoms-for-Peace Program. He declared in connection with AGNS that \"the plant at Barnwell, South Carolina, will receive neither Federal encouragement nor funding for its completion as a reprocessing facility.\" While he terminated reprocessing, he promised as a replacement the construction of permanent storage depositories for spent fuel. He was, however, unable to obtain Congressional authorization for such construction.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nAs late as 1982, the Congressional Committee, in reporting NWPA, remarked reprovingly that \"the failure of the government to provide a permanent waste disposal facility during more than 30 years of Federal nuclear activities is unmitigated.\" Ibid., at 3794. And, while the Congress in the 1982 Act provided authorization for storage depositories for spent fuel, even the sites for such depositories have not yet been selected and the Commission in a Report dated August 31, 1984, said that, while it found it to be a \"reasonable assurance that a repository would be available by 2007-09 \"under the 1982 Act,\" it cautioned that \"the repository development schedule may have to accommodate such contingencies as vetoes of proposed repository sites, prolonged public hearings, protracted litigation, possible project reorientation or delay in promulgation of siting guidelines.\" 49 Fed. Reg. at 34663. It seems clear from this review that at no time since the enactment of the Atoms-for-Peace Program in 1954 has storage for the disposal of spent fuel been available for commercial nuclear power plants, nor did any planning for such facilities, and then only tentatively, actually begin until reprocessing was barred in 1977.\n\nReprocessing as a method for disposing of spent fuel, on the other hand, was from the beginning of the 1954 program regarded and actively advanced by the AEC as not only an available means for disposal of spent fuel from nuclear power reactors but as the only proper and acceptable method. As Judge Edwards in his concurring opinion in Natural Resources Etc. Council v. U.S. Nuclear Reg. Comm'n, 222 U.S. App. D.C. 9, 685 F.2d 459, 502 (D.C.Cir. 1982), said: \"The NRC's original assumption was that all spent fuel produced by nuclear power reactors would be reprocessed before it was stored.\" In its own operations prior to the 1954 Act the Government had acted on this assumption and had developed and used reprocessing for the disposal of the spent fuel discharged from its own reactors. Based on this experience, reprocessing was in its judgment an established and proven method for the disposal of the spent fuel. Moreover, all those knowledgeable in the nuclear field agreed with this judgment of the Government that reprocessing should be assumed as the proper way to dispose of the spent fuel. It was manifest then that both the Government and industry accepted reprocessing as the only practical method of disposing of spent fuel during the 60's and that storage was neither recommended nor considered as a proper method of disposing of spent fuel.\n\nIt was not enough, though, that reprocessing was an acceptable and proven method for disposing of spent fuel; the power industry had to be assured that reprocessing would be available when the spent fuel discharged by their proposed nuclear power reactors required removal from on-site. This was important because there were in the 50's, when the Atoms-for-Peace Program was launched, no commercial reprocessing facilities, and the only available reprocessing facilities were owned and controlled by the Government. If its program for peaceful use of nuclear energy was to succeed, the AEC recognized the wisdom of promoting the development by industry of a commercial reprocessing industry in order to relieve the Government of any responsibility for providing reprocessing for the commercial nuclear plant and the even more important need to allay any concern on the part of the power industry that it would have available reprocessing for the disposal of its spent fuel, whether commercial reprocessing ever eventuated or not. The Government addressed the first need by offering to industry access to much of its own technological and engineering research and development particularly in the reprocessing field. On the other hand, in order to assure the power industry about the availability of reprocessing in its own facilities, the AEC issued on February 27, 1957, an official announcement in the Federal Register, of \"a [Governmental] policy of assuring the nuclear power industry that the Government would, in the event that commercial reprocessing services were not available at reasonable times and conditions when irradiated power reactor fuels were discharged from their reactors, make financial settlement for the materials contained in those elements, and reprocess them.\"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The language of the Commission's order was:\n\nThe Commission will undertake under contracts individually negotiated with persons licensed pursuant to sections 103 or 104 of the act, and possessing spent reactor fuel or blanket materials, to provide for processing of these materials in facilities owned by the Commission. Such processing will include the mechanical, metallurgical, and chemical treatment of these materials to recover the source and special nuclear materials remaining therein, and the storage of resulting wastes.\n\nThis assurance to the utility industry was critical to the promotion of a nuclear power industry. As we have already observed, without this promise, it was highly unlikely that any utility would have been willing to accept the financial hazard of constructing an expensive nuclear power plant. The Government by this announcement intended to relieve this anxiety on the part of the industry by providing the power industry with the positive assurance of the availability when needed of facilities to dispose of its spent fuel for such nuclear reactors as it should install.\n\nSubsequent to its official announcement of its assurance to the electric industry that it would provide reprocessing services for any commercial nuclear power plants if commercial reprocessing were not available, the Government demonstrated its firm resolution to carry out that commitment. Although the Government's reprocessing facilities would require some minimal adaptation in order to process spent fuel from the commercial nuclear reactors, the Congress, at the instance of the Commission, had made available funds for such adaptation in 1959. In its 1961 report (p. 47), the Commission had said:\n\nThe Commission's responsibility to receive irradiated fuels from research, test, power and propulsion reactors [for reprocessing] and to make financial settlement for the contained fuel values in accordance with existing notices (sic) has been consolidated at the Commission's Savannah River and Idaho Offices.\n\nMoreover, see AEC Report for 1963, p. 54. The AEC clearly demonstrated its ability to reprocess commercial spent fuel by the execution in the early 60's of contracts covering the reprocessing of spent fuel from the Yankee Atomic Electric Plant at Rowe, Massachusetts, and the Dresden Nuclear Power Station near Morris, Illinois. And in its 1966 Report, the Commission advised the Congress that its \"Idaho and Savannah River operations received 'spent' fuel for processing from 3 domestic and 10 foreign reactors during the year.\" It was thus clear that the Government not only intended but was punctually complying with the commitment given by it to the commercial nuclear power industry in its official announcement of 1957.\n\nThe electric power industry in turn had responded affirmatively to this activity by the Commission. In 1958, the next year after the Commission's assurance to the power industry, the first license for a nuclear power plant was issued and, since that time, some 82 licenses for the operation of nuclear power plants were issued.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Moreover, in 1964, the Congress, in order to encourage the construction of commercial plants, had authorized utilities contracting for such plants to acquire and use uranium. P.L. 88-489, 78 Stat. 602; 1964 U.S. Code Cong. \u0026 Admin. News, 3105.\n\nIndustry was not far behind the utilities, which were proceeding to construct nuclear power plants, in responding on its own part to the Government's encouragement to enter the reprocessing field. The first commercial reprocessing facility was undertaken by the Nuclear Fuel Services, Inc. (NFS) in upper New York under a provisional construction permit issued in 1963. See 1963 AEC Report to Congress, pp. 53-54. Incidental to this permit, the AEC had entered into an agreement with NFS that if sufficient spent fuel was not offered for reprocessing after completion of the facility to permit the full operation of the facility, it (the Commission) would offer to NFS \"certain of the private fuels now on hand or expected to be received by the AEC pursuant to its March 12, 1957, Federal Register notice offering to accept irradiated fuels for licensees until June 30, 1967, or until private reprocessing services are available at reasonable charges.\" The AEC, also, announced:\n\nAfter start-up of the NFS plant, AEC-owned facilities will no longer receive irradiated reactor fuels unless the private processing services are not available at charges and terms which the AEC considers to be reasonable. In addition, the AEC has agreed not to intercede in any arrangement whereby a reactor operator voluntarily agrees to have his fuel processed at NFS. However, if a reactor operator believes that NFS's charges and terms are unreasonable, it can present its case to AEC. If the Commission determines that such charges and terms are unreasonable, the AEC will accept the reactor operator's irradiated fuel under the March 12, 1957, Federal Register notice.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nConstruction had proceeded expeditiously on the reprocessing facility of NFS at West Valley, New York. The ground-breaking ceremony for the plant had been held on June 13, 1963, and in April 1966 (over a month before the contract involved in this litigation was signed) full-scale processing of irradiated reactor fuel began at the plant. That plant operated successfully from 1966 to 1971. In September of that same year (1966) General Electric announced it would build a reprocessing plant near Morris, Illinois, with operations expected to begin by the early 70's. See 1966 Report of AEC, p. 359, App. 836. Allied Chemical in the same year declared its interest in developing a reprocessing plant. NFS announced in 1970 \"plans to modify and expand its West Valley, N.Y., facility over the next five years,\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e practically doubling its capacity, and construction had continued in the meantime on General Electric's Morris, Illinois, facility with completion extended to July 1, 1971. In December 1970, a construction permit was issued to the Allied Gulf Nuclear Services (AGNS), a joint subsidiary of Allied Chemical Nuclear Products, Inc. and Gulf Energy, and Environmental Systems, Inc., for the Barnwell Nuclear Fuel Plant to be located at Barnwell, South Carolina. In Natural Resources Defense Council, supra, 539 F.2d at 832, there is a comment that during this time Westinghouse itself had \"applied for a license to undertake mixed oxide fuel fabrication at a proposed plant near Anderson, South Carolina.\" The testimony in this case also is that in this period Exxon Nuclear Corporation had retained Bechtel Power Corporation to begin designing work on a large reprocessing plant and had acquired an option on 2,000 acres of land at Oak Ridge, Tennessee, on which it intended to build the plant. Encouraged by this response by industry and feeling assured of private industry's ability to supply all needed reprocessing services, the Commission in the late 60's deferred any further development of its own reprocessing facilities in order to service the increasing number of commercial nuclear power plants.\n\nIt is obvious that by 1970, reprocessing was firmly accepted by the Government and the utility industry as the approved and proper method for disposing of spent fuel. And this was recognized by the Congress and publicly declared by the AEC. According to the House Report on the NWPA of 1982 (1982 U.S. Code Cong. \u0026 Admin. News at 3793), the Congressional understanding was categorically stated:\n\nDuring this period [i.e., prior to 1976] the U.S. nuclear industry relied not on the repository development program but rather on a spent fuel reprocessing industry, and recycle of uranium and plutonium as the solution to the \"back end\" of the nuclear fuel cycle. Utilities' liability for nuclear spent fuel was expected to end when the fuel was shipped to a reprocessing facility; contracts for reprocessing services were expected to cover management and disposal of waste streams from the facilities.\n\nThe Commission in an order published in 40 Fed. Reg. 42801, used similar language in describing the only method contemplated by the electric utility industry for disposing of spent fuel discharged by nuclear power reactors in the period prior to 1977:\n\nFrom the early days of the nuclear power industry in this country, electric utilities planning to construct and operate light water nuclear power reactors contemplated that the used or spent fuel discharged from the reactors would be chemically reprocessed to recover the remaining quantities of fissile and fertile materials (uranium and plutonium) and that the materials so recovered would be recycled back into fresh reactor fuel. It was contemplated by the nuclear industry that spent fuel would be discharged periodically from operating reactors, stored in onsite fuel storage pools for a period of time to permit decay of radioactive materials contained within the fuel and to cool, and periodically shipped offsite for reprocessing.\n\nThis recitation of events makes it plain that at the time the contract in this case was executed (1966) the practicality of reprocessing as a method of disposing of spent fuel discharged from nuclear reactors at private nuclear electric generating plants had been demonstrated both in the Government's plants and in NFS's facility and further that the AEC had, by reprocessing spent fuel for three private nuclear electric generating plants at its own facilities, shown that it was strictly observing its 1957 assurance to the utility industry of providing reprocessing of such fuel at its plants where reprocessing was not available at reasonable charges at private reprocessing facilities. Further, as the later 1970 Reports of the AEC established, NFS was not only successfully operating its reprocessing plant at that time but, encouraged by the success, also was later to seek to enlarge its facility in order to practically double its capacity. And, shortly after the contract herein was executed, other industrial concerns, as we have observed, had undertaken the construction of reprocessing facilities for the purpose of disposing of spent fuel discharged by the private electric utility nuclear plants. Reprocessing of spent fuel appeared both practical and available up to 1970, with a bright and seemingly assured promise of additional commercial reprocessing facilities in the future.\n\nBy the early 70's, however, a disturbing cloud on this promising picture of available commercial reprocessing facilities was evident, caused as it was by a rising crescendo of environmental complaints charging that the plutonium in such fuel presented an intolerable risk to health and safety requiring additional stringent regulations, if not complete discontinuance of reprocessing at all. These complaints by environmentalists rested to some extent on the procedural requirements of an environmental impact statement prior to any licensing of any nuclear power plants or any addition to it under the National Environmental Policy Act of 1969 (NEPA). The environmental complaints against the reprocessing of spent fuel and particularly the presence of plutonium in spent fuel, became from that point a recurrent assault on any licensing of reprocessing facilities and the operation of existing facilities. As one commentator has accurately put it, many of these assaults were intended for \"delay\" rather than for asserting \"any substantive legal challenge.\" Note, The Use of Generic Rulemaking to Resolve Environmental Issues in Nuclear Power Plant Licensing, 61 Va.L.Rev. 869, 878 (1975).\n\nIf so, the complaints accomplished their purposes. To resolve these complaints and to avoid costly delays, both the Commission and the contractors took steps to meet the objections by changing to some extent their operations. All of these developments increased substantially the cost of construction of reprocessing facilities and of their operations. The effect of these developments was evident in AGNS's statement of its objection to signing a contract with Westinghouse to reprocess the spent fuel of the Turkey Point plants because, as it said, since its earlier letter of intent, costs of reprocessing had increased \"fourfold.\" At the same time but without abandoning its policy of recommending reprocessing as the appropriate method for disposing of spent fuel, the Commission, which had in effect abandoned reprocessing for these commercial nuclear power plants, sought, as we have already observed, to test, on an experimental basis, storage as a practical alternative for the disposal of such spent fuel. But as Congress was later to observe, the project was quickly abandoned, a victim of public objections and complaints.\n\nBy 1972, there were proceedings pending before the Commission to undertake different steps in the plutonium recycle process. These proceedings were described as follows: \"Nuclear Fuel Services [for instance had] applied for permission to alter and expand its existing plant; Allied-General Nuclear Services [sought] licensing of proposed separations and uranium conversion facilities presently under construction at Barnwell, South Carolina; and Westinghouse Electric Corporation [had] applied for a license to undertake mixed oxide fuel fabrication at a proposed plant near Anderson, South Carolina.\" See Natural Resources, 539 F.2d 824 at 832. Certain environmental groups and the State of New York had intervened in these proceedings and raised strong objections to the granting of the petitions on environmental grounds. As a result of these and other objections, the Commission, which had the responsibility of addressing environmental concerns at the licensing stage of any proceedings before it, instituted in 1972 an informal \"generic\" rulemaking proceeding primarily for the purpose of considering and settling in one proceeding a number of issues of fact or policy common to the large number of licensing proceedings then before the Commission. This proceeding was intended to dispose of long-term \"generic\" waste disposal environmental concerns for all pending proceedings in one administrative process. All the pending license proceedings were accordingly brought within this broad generic proceeding.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In February 1974, the Commission announced, as a step in that proceeding, \"that a generic environmental impact statement \" (GESMO) would be prepared examining such essential issues as nation-wide environmental effects, safeguards against adverse effects, and alternatives to the recycle activities.\n\nIn a later \"provisional\" decision in this \"generic\" rulemaking proceeding, issued in 1975, the Commission suggested a ban on any licensing of reprocessing facilities or spent fuel transportation until the final GESMO report. When this \"provisional\" decision was publicized, the nuclear industry protested the terms of the decision, claiming it would impose excessive costs in purchases of additional enriched uranium and in meeting the costs of spent fuel disposal. The Commission responded to these complaints by issuing its final decision in November 1975, in which it provided that \"certain interim commercial licensing [of reprocessing] should be allowed\" and that a \"final version of the GESMO study, both in environmental concerns and safeguards . . . be issued in 1976.\" This order of the Commission was reviewed by the Second Circuit in accordance with the review procedure set forth in the Act, on petition of the environmental groups. The result of such review was the decision in Natural Resources Defense Council v. U.S. Nuclear Reg. Comm'n, 539 F.2d 824.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The Court held that the Commission could not grant licenses for reprocessing facilities or for the transportation of plutonium and uranium mixed oxide fuel \"until the GESMO Report and supplement had been issued in final form and the Commission had made its final decision thereon.\" The Court, however, affirmed the procedural guidelines developed by the Commission in its decision for further proceedings in this case. Certiorari was sought in Natural Resources, 430 U.S. 944, 51 L. Ed. 2d 791, 97 S. Ct. 1578 (1977),\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e but in October 1976, two months after the decision, President Carter issued a policy statement urging temporary deferral of reprocessing.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nPreviously, in 1971, NFS, discouraged by the delays in acting on its request for authority to increase its reprocessing facilities and doubtful that it could operate under the increasing restraints imposed, abandoned its application and operations. All other applications for the construction of reprocessing facilities were tied up in what seemed to be interminable dilatory proceedings. As we have said, the Government had abandoned its policy of accepting spent fuel from the commercial nuclear power plants for reprocessing. By that time there were no reprocessing facilities available anywhere for spent fuel discharged by private nuclear power plants. This was the situation which forced Westinghouse to advise Florida it could not carry out its contract to remove and dispose of the Turkey Point spent fuel.\n\nIn November of 1976, two operators of nuclear electric generating plants, facing the same dilemma as Florida, filed applications for an amendment of their licenses to operate in order to increase their capacity for on-site storage of spent fuel as the only immediate method of disposing of spent fuel on an interim basis. The proposed increases \"contemplated [in the petition as filed] no increase in the physical dimensions [of the pools for on-site storage], but rather the installation of new racks that would permit closer spacing of the fuel assemblies in the pool.\" Both of the petitions were predicated on the absence, after the decision by the Second Circuit, of any available method for reprocessing or storage of such spent fuel and the imminent necessary discontinuance of operations at the plants unless additional on-site storage were permitted until the Government provided a new means of disposal. In reviewing orders issued in connection with those petitions the Court in Minnesota said: \"No one disputes that solutions to the commercial waste dilemma are not currently available.\" Minnesota v. U.S. Nuclear Regulatory Comm'n, 195 U.S. App. D.C. 234, 602 F.2d 412, 416 (D.C. Cir. 1979). The results of these proceedings were orders authorizing reracking on-site by commercial nuclear plants. See, 1982 U.S. Code Cong. \u0026 Admin. News, 3803.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nAt this point in the controversy on how to deal with the spent fuel, President Carter announced that \"spent fuel reprocessing and the development of advanced plutonium non-based reactors would be indefinitely deferred in this country.\" President Carter in the same announcement told \"the domestic nuclear industry that the Federal government would provide interim storage for utilities' spent fuel,\" 1982 U.S. Code Cong. \u0026 Admin. News, 3794. President Carter's administration was, however, unable to obtain authority to provide such interim storage from Congress, and no storage facilities for spent fuel were either planned or constructed in accordance with President Carter's official announcement.\n\nIn October 1977, the Department of Energy announced its \"New Spent Fuel Policy\" implementing President Carter's April 1977 announcement of the indefinite suspension of \"civilian reprocessing of spent nuclear fuel in order to evaluate alternative fuel cycles and processes which may reduce the risk of nuclear weapons proliferation.\" It described this action as \"a logical extension . . . of the long-established Federal responsibility for permanent disposal of high-level wastes.\" It stated a policy of planning permanent storage, backed up by interim storage by private interests whom the Government might interest in establishing such interim storage facilities. The immediate payment of a future-calculated storage fee should be required, and on payment of that fee, the Government would take full title to the spent fuel. The Department, however, added, that, \"Questions surrounding the permanent disposition of nuclear wastes have not yet been resolved.\" The Department's announcement included this language: \"If, at some time in the future, the U.S. should decide that commercial reprocessing or other energy recovery methods for spent fuel can be accomplished economically and without serious proliferation risks, the spent fuel [can] either be returned with an appropriate storage charge refund, or compensation could be provided for the net fuel value.\" Comments were later invited from the nuclear utility industry. In reporting the response of the utilities, the Department observed that: \"Almost unanimously the utilities voiced their concern with the policy of deferral of reprocessing. . . . Virtually everybody desired recognition of the future value of the recovered fuel. This relates in part to the virtually unanimous position on reprocessing as desirable.\" The Nuclear Regulatory Commission issued a \"Memorandum of Decision\" on December 23, 1977, after the above announcement and comments. In this Memorandum it decided to terminate the GESMO proceeding and proceedings \"on pending or future plutonium recycle-related license applications\" with some limited exceptions not relevant here.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIn October 1981, President Reagan, however, shifted ground and issued a \"Series of Policy Initiatives\" in this area. In this Statement, the President expressed the need to develop a commercial nuclear power industry. He recognized the problem of \"commercial waste disposal\" and, in order to assist in removing the handicaps to the solution of such problem, President Reagan lifted \"the indefinite ban which previous administrations placed on commercial reprocessing facilities in the United States.\" He added: \"We will pursue consistent, long-term policies concerning reprocessing of spent fuel from nuclear power reactors and eliminate regulatory impediments to commercial interest in this technology, while insuring adequate safeguards.\" The importance of having \"the private sector take the lead in developing commercial reprocessing services\" was reiterated. That Government had failed in meeting \"its responsibilities\" in this area was accepted in the Statement. 17 Weekly Comp. of Pres. Doc., 1101-02 (October 12, 1981).\n\nAt this point Congress realized that \"failures in the Federal repository development program, the collapse of the domestic spent fuel reprocessing industry and quickly deteriorating public confidence in our ability to deal safely with nuclear waste, together with other critical safety and economic issues, were seriously undermining the strength of the domestic nuclear industry\" and that \"nuclear waste management was on its way to becoming a top Federal energy priority.\" 1982 U.S. Code Cong. \u0026 Admin. News, 3794-95. This realization was the catalyst for the enactment of Nuclear Waste Policy Act (NWPA) of 1982, 42 U.S.C. § 10101, et seq. (1983).\n\nThis Act of 1982 provided for the expeditious development of permanent, deep repositories for nuclear waste. While these depositories were being developed, Congress anticipated that, by increased reracking, on-site storage for spent fuel could be assured for the operating plants, with the proviso that, in those special cases when the Commission should find that there were not on-site facilities for storage of spent fuel in the interim before the completion of the permanent depositories, the Department of Energy would offer interim storage for such fuel until such permanent depositories were completed.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e All utilities using nuclear fuel were required to enter into a negotiated contract for the payment of a fee to the Department of Energy for such future storage to be available after the Government had constructed permanent storage facilities. The Congress contemplated that the costs of disposal of spent nuclear fuel should be paid by those ratepayers who receive the benefit of the lower cost of nuclear-generated electric power. The reason for this was stated in the Senate Report on the 1980 Act. See 1980 U.S. Code Cong. \u0026 Admin. News, 6941:\n\nCongress finds that the responsibility for both the storage and disposal of nuclear waste rests with the Federal Government and that the costs associated with such storage and disposal should, to the greatest extent possible, be borne by the direct beneficiaries of nuclear activities.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nActually, President Carter had \"emphasized [at the time that he proposed in 1977 the development of permanent storage] that all costs of storage and permanent disposal will be borne through fees paid by the direct users of the facilities and will ultimately be borne by those who benefit from the activities generating the waste.\"\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e And, at the instance of Florida, the Florida Public Service Commission had agreed in principle with this proposition holding that the ratepayers receiving the benefit of the nuclear fuel should pay the costs of permanent disposal of the spent fuel and had agreed that Florida could make provisions for the collection of these charges in its rate base. It is true that the Commission did note that there was a controversy between Florida and its \"vendors\" over certain parts of this cost and it reserved determination on this part of the costs.\n\nDespite the strong words and the confident assertions reflected in the Report on NWPA, the Department of Energy has failed five years later to identify a site for the permanent storage of spent fuel discharged by the private nuclear generating plants. When such sites will finally be located remains indefinite and speculative. In any event, this record of Government activity in the development of commercial nuclear power generation, it would seem, has created a situation recognized by the Court in Minnesota v. U.S. Nuclear Regulatory Comm'n, 602 F.2d at 416, to be \"undisputed\" that since 1972 there have been not only no available reprocessing facilities to dispose of spent fuel from the Turkey Point plants but also there has been no available alternative off-site storage facilities for such disposal. When there will be any facility for the disposal of such spent fuel remains uncertain to this day.\n\nIt is interesting that, although reprocessing has been stymied, reliance on reprocessing in disposing of the spent fuel is still considered as possible at some point in the Government's disposal program. This is evident from the language in the Congressional Reports on the Low-Level Radioactive Waste Policy Act of 1980. The Congress said the bill was \"neutral with respect to the option for further processing of the spent fuel or the high-level waste\" (p. 6937) and referred to the continuance of rights of the nuclear plant to the residual value of the spent fuel taken by the Government from the plant should reprocessing of such fuel be later available.\n\nSuch was the record of Governmental activity in promoting the commercial use of atomic energy in the generation of electric power. This record is an integral part of the proceedings herein and was in large part the basis for many of the findings of fact and conclusions stated by the district court in its opinions herein. We, therefore, turn now to the opinions of the district court.\n\nIII.\n\nOver a period of almost four years, the district court filed three opinions in disposing of the issues in this case. In all the opinions it was accepted that Westinghouse had not performed its agreement to dispose of the spent fuel discharged by the Turkey Point reactors for the first ten years of the reactors' operations. The dispute between the parties, therefore, centered on the issue whether such non-performance was excusable under the facts of the case. Admittedly, the opinions are not entirely consistent in their resolution of this issue; in fact the opinions admit the inconsistency as between the second opinion, on the one hand, and first and third, on the other.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e For a full understanding of the district court's findings and reasoning in these several opinions, it is necessary to review them separately. We begin our review with the first opinion, entered on June 25, 1981, and reported in 517 F. Supp. 440.\n\nA. District Court's First Opinion\n\nIn this initial opinion, the district court treated all the pleas in excuse filed by Westinghouse and found them inadequate to excuse performance by Westinghouse of its obligation to dispose of the spent fuel. The primary emphasis of this opinion, however, was on Westinghouse's plea of excuse because of impossibility of performance, though, as we have said, it considered and dealt with the other defenses in its opinion. The district court justified its primary emphasis on impossibility, observing that all the defenses were related to impossibility and rested on the same factual assumptions as that defense. Since in our opinion the resolution of the defense of impossibility of performance may well resolve the issue, we confine our review of the first opinion to its treatment of that plea. Actually, this seems to have been the later treatment of the case by the district court, since its second and third opinions deal almost exclusively with the impossibility defense.\n\nAny analysis of the district court's first opinion must begin with a statement of the doctrine of impossibility of performance as a defense to a breach of contract suit as enunciated in the opinion by the district court. Looking to the doctrine as stated in the older traditional version of impossibility, as phrased in Texas Co. v. Hogarth Shipping Co., 256 U.S. 619, 629, 65 L. Ed. 1123, 41 S. Ct. 612, 629 (1921), and the modern, more liberal doctrine of commercial impracticability, as stated in Transatlantic Financing Corp. v. United States, 124 U.S. App. D.C. 183, 363 F.2d 312, 315 (D.C. Cir. 1966), the district court summarized the current statement of this doctrine of impossibility or impracticability of performance and defense to a breach of contract to be as follows: When the contracting parties contract in contemplation of the existence of \"some particular thing essential to its performance\" and \"before the time of performance and without the fault of either party the particular thing ceases to exist or be available for the purpose,\" the promisor will be excused from performance, irrespective of whether the existence of the thing was stated as a condition of the contract or not. Under those circumstances performance has become in the words of Eastern Air Lines, Inc. v. McDonnell Douglas Corp., 532 F.2d 957, 991 (5th Cir. 1976), \"so vitally different from what was anticipated [by the parties] that the contract cannot reasonably be thought to govern.\" To this statement of the doctrine, the district court added two subsidiary principles applicable to the invocation of the doctrine. In the first of these the district court drew a distinction between the situations where the means of performance was specified in the contract and the situations where the means of performance, though clearly contemplated by the parties, was not specified in the contract. In the former situation, impracticability of performance under the specified means excused performance; in the later situation, the impracticability of performance by the concededly contemplated means will not excuse performance if there is available a reasonable alternative means of performance that can be utilized without excessive costs. The district court found warrant for these additions in the rulings in Transatlantic Financing Corp. v. United States, 124 U.S. App. D.C. 183, 363 F.2d 312, 315 (D.C. Cir. 1966), and in American Trading and Production Corp. v. Shell International Marine, Ltd., 453 F.2d 939, 941 (2d Cir. 1972). The other addition the district court made in the application of the doctrine is deduced from the decision in United States v. Wegematic Corp., 360 F.2d 674 (2d Cir. 1966). As the district court construed that decision, it held that if \"the promisor entered [into] the contract knowing that the technology [or means of performance] it intended to use was uncertain and that difficulties and added expense might occur, . . . [in that situation] the risk of such difficulties was implicitly allocated to the [promisor].\"\n\nThe district court concluded that the application of this defense of impossibility or impracticability of performance, as deduced by it from the authorities cited, raised four factual questions which it phrased as:\n\n(1) Was performance as agreed rendered impracticable? (2) Did the claimed impracticability arise from an unforeseen contingency? (3) Was the non-occurrence of the contingency a basic assumption of the contract? (4) Did the parties, explicitly or implicitly, allocate the risk that the contingency would occur?\n\nThe district court resolved all those factual questions against the defendant and, therefore, dismissed Westinghouse's defense of impossibility or impracticability of performance.\n\nThe district court said, in answer to the first question, that performance as agreed had not become impracticable. In reaching this conclusion, it cited Transatlantic Financing and American Trading, both of which involved sea-carriage contracts for transportation of cargo originally intended to move through the Suez Canal but which, as a result of the closing of that Canal during the Israeli-Egyptian War, was forced to move through the longer and more expensive Cape of Good Hope route. The carrier sought payment for the excessive costs of the longer Cape of Good Hope route. The plea of impracticability was dismissed. The reasoning of the Court in both cases for such dismissal was stated in American Trading, 453 F.2d at 942:\n\nThis leaves us with the question as to whether the owner was excused from performance on the theory of commercial impracticability (Restatement of Contracts § 454 (1932)). Even though the owner is not excused because of strict impossibility, it is urged that American law recognizes that performance is rendered impossible if it can only be accomplished with extreme and unreasonable difficulty, expense, injury or loss. There is no extreme or unreasonable difficulty apparent here. The alternate route taken was well recognized, and there is no claim that the vessel or the crew or the nature of the cargo made the route actually taken unreasonably difficult, dangerous or onerous. The owner's case here essentially rests upon the element of the additional expense involved -- $131,978.44. This represents an increase of less than one third over the agreed upon $417,327.36. We find that this increase in expense is not sufficient to constitute commercial impracticability under either American or English authority.\n\nMere increase in cost alone is not a sufficient excuse for non-performance (Restatement of Contracts § 467 (1932)). It must be an \"extreme and unreasonable\" expense (Restatement of Contracts § 454 (1932)).\n\nThe district court found this case analogous to the situation stated by the Court in American Trading. To reach this result, it said that, while \"both Westinghouse and Florida contemplated that the spent fuel would be reprocessed,\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e reprocessing was not \"viewed as the exclusive means of performance. Indeed, reprocessing was not in actuality the contemplated 'means' of performance at all; it was the contemplated disposition of the spent fuel after performance.\" (Court's Italics). It then apparently assumed that there was a method of disposal of the spent fuel that provided an alternative to reprocessing\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e and, having made that assumption, it found that, though \"the additional cost of removal itself [by the alternative method] might be sufficient to constitute impracticability in another context,\" Westinghouse assumed the risk that reprocessing would prove more expensive than anticipated. It added that any increased expense incurred by Westinghouse in disposing of the fuel was not \"sufficient to rise to the level of impracticability.\"\n\nThe district court dismissed any claim that the impracticability of performance arose out of an \"unforeseen occurrence\" because as it said, Westinghouse knew at the time it executed the contract that \" reprocessing was, at best, a highly uncertain proposition. In fact, as a practical matter, there was no such thing as commercial reprocessing in 1966 . . . [and] at the time the contract was executed, reprocessing for Florida's anticipated spent fuel was . . . unavailable.\" Further, it held Westinghouse was in effect the author of its own problem because of its own \"less than zealous attempts to obtain a facility.\" Apart from its long-drawn-out negotiations with AGNS, Westinghouse, it held, had \"made no significant attempts to secure storage or reprocessing facilities, and gave little, if any, serious consideration to building its own facility. . . .\" Such were the grounds on which it resolved this question against Westinghouse. Based on these grounds primarily, the district court found that the existence of reprocessing was not \"a basic assumption of the contract\" and that the risk that reprocessing would be unavailable was one Westinghouse implicitly assumed. As evidence in reaching its finding that the availability of reprocessing was not a \"basic assumption\" of the parties, the district court had relied on the same reasoning expressed by it in responding to the previous findings. Thus, it said, i.e., that \"it is difficult to discern how the availability of reprocessing could have been a basic assumption of the parties, given the fact that commercial reprocessing did not exist at the time the contract was executed, as well as the fact that the contract specifically calls for Westinghouse to do with the spent fuel as 'it sees fit.'\" It also declared apparently as an additional point that \"Florida deemed reprocessing too speculative to undertake it.\" It dismissed the fact that the contract's bargained-for price per kilowatt hour had been arrived at by factoring in the costs of reprocessing as not reflective of \"the parties' anticipation that the fuel would be reprocessed,\" finding that this circumstance was \"not sufficient to transform an expectation into a basic assumption or a condition of performance.\" In finding that Westinghouse had assumed the risk of the unavailability of reprocessing, the district court said: \"knowing that reprocessing, not being available even then as a practical matter, was highly uncertain, Westinghouse agreed to a contract term which in plain, unequivocal, unqualified language, required it to remove the spent fuel from Florida's plants. If this is not assumption of risk, the Court confesses itself unable to discern what would be.\"\n\nHaving made these findings, based on its construction of the governing principles of the defense of impossibility or impracticability of performance, the district court concluded that the defense had not been made out of impossibility/impracticability of performance in this case. It accordingly turned to the determination of a remedy. At this point, it confessed it faced what appeared to be a difficult, if not unresolvable, dilemma. The district court realized that Florida could not obtain from another party \"performance substantially similar to that promised by Westinghouse\" but \"by the same token . . . the very factors which might render it difficult for Florida to contract for removal with a third party would, obviously, make performance by Westinghouse difficult.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e It suggested that these reasons argue for \"consideration [being given] to the hardship of performance in deciding the question of remedy.\" The district court expressed the confidence that \"the parties themselves [were] in a far better position [than it was] to find an equitable solution\" for the controversy and it returned the matter to the parties to seek to arrive at what it described as \"fair and equitable solutions of [the] myriad complex problems\" in the case and accordingly called on the parties to make \"a good faith\" effort to agree on a proper decree. It added that if \"further evidence . . . [is] necessary,\" provision for such would be allowed. Finally, the district court said that, should the parties be unable to arrive at a fair decree after taking additional testimony and conferring among themselves, the parties should report such fact to the district court which, at that time, would enter its own decree.\n\nB. Second Opinion of District Court\n\nAfter the issuance of the first opinion herein, additional testimony was taken, the Act of 1982 became law, and a panel of experts, selected by the parties and approved by the district court, filed a report on the means of disposing of the spent fuel. Based on these additions to the record, the district court heard extended arguments of the parties. Approximately three years after its initial opinion, the district court filed its second opinion in this controversy. This opinion has not been reported.\n\nIn its second opinion, the district court reviewed some of the developments since the issuance of its first opinion. It took note of the enactment of NWPA in 1982, providing for future permanent off-site storage of spent fuel under a mandatory program established under the Act whereby nuclear power plants were to enter into agreement with the Government for future removal, transportation and storing of the spent fuel. Florida, it found, had executed a contract with the Department of Energy for ultimate future storage in the Government's to-be-built storage facility under the Act at an estimated cost of $72.4 million paid by it at the time to the Department of Energy. The district court recognized and the parties agreed there was \"currently no place to which the spent fuel in issue [could] lawfully be removed from Florida's Turkey Point site,\" though it later disputed Westinghouse's assertion that the record established that \"since 1975 it has been impossible to remove spent fuel \"from that site.\"\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e It said that \"a portion of [the spent fuel] could have been removed prior to Florida having to . . . spend over $9 million in reracking.\" It found in that connection that Westinghouse could have developed storage for the spent fuel except for its commitment to reprocessing. It ascribed Westinghouse's failure to construct storage and to continue to look to possible reprocessing because of its economic interest in realizing a profit from the sale of the extracted usable materials in the spent fuel. It agreed with the parties that the only immediate way to handle the spent fuel for some fifteen years was by \"rerack[ing] the Turkey Point spent fuel pools again.\"\n\nUnder the circumstances of the case as it thus perceived it, the district court found specifically \"that the portion of the contract that contemplated removal of the spent fuel by Westinghouse has become of no force and effect because of circumstances that neither party anticipated nor could reasonably be expected to have anticipated. Although it is not simply the additional costs, which are substantial, cost is a factor that must be considered.\" Citing Eastern Air Lines, Inc. v. McDonnell Douglas Corp., 532 F.2d 957, 991 (5th Cir. 1976), it said that \"the passage of the Act rendered performance of the contract 'vitally different' from what the parties anticipated at the time of execution of the contract,\" adding that \"while the Court found that Westinghouse assumed the risk that reprocessing would not come to pass, neither it nor Florida could have reasonably foreseen that Westinghouse would, as a matter of law, be precluded from fulfilling its obligation to remove the spent fuel from the Turkey Point site within a reasonable time\" . . . nor could it have been \"reasonably foreseeable that the anticipated removal of the spent fuel would impose a financial burden in excess of $70 million.\" It cited in explanation of the latter statement Hadley v. Baxendale, 9 Exch. 341, 156 Eng. Rep. 145 (1854) which, as stated by the district court, held that only those damages \"that arise naturally from the breach, or those that were in the contemplation of the parties at the time the contract was made\" are recoverable. It found specifically in that connection that \"the government, having brought about an abrupt revocation of the reprocessing alternative for reasons of national policy, [had] proceeded to develop the necessary alternative -- disposal [by storage] of spent fuel.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e It then found that the Act of 1982 (NWPA) \"contemplate[d] that the costs of final disposition of spent fuel will be passed through to ratepayers, and The Florida Public Service Commission has determined that as a matter of policy it was fair and equitable for ratepayers to pay the final disposition costs.\" Florida and its ratepayers, according to the district court, had benefited substantially from the construction of the Turkey Point plants, the approximate savings to ratepayers being $1,330,750,000 during the years 1973 through 1980, and, even \"after consideration of projected costs of repair,\" $5,246,588,000 in the years 1982 to 1991.\n\nFinally, the district court concluded that where performance of a contract becomes \"commercially impracticable and/or impossible, the Court has the authority to order an equitable adjustment of the rights and obligations of the parties\" and that in this case, \"equity will be served by requiring Westinghouse to pay the interim storage costs of the first and second re-rackings but leaving the other costs of interim and long-term disposal on Florida.\" It accordingly entered judgment for the reracking in the sum of $9,473,242 in favor of Florida against Westinghouse but granting no judgment in favor of Florida for the sums it had paid the Department of Defense for future permanent storage of the spent fuel or added costs.\n\nC. Third Opinion of District Court\n\nThe district court's third opinion, entered after granting a rehearing on the motion of Florida, is reported at 597 F. Supp. 1456 (E.D. Va. 1984). This decision began by disapproving certain parts of the court's second decision, declaring that decision to be \"in at least some significant regards, inconsistent with its 1981 decision and . . . the inconsistencies arise from errors of law in the later decision.\" The court did not identify specifically the significant conclusions of law in its second opinion to which it referred except as those differences might be gleaned from the later statements in the opinion. It in effect reaffirmed the findings made by it in its first opinion, as modified by developments since 1981. It then took notice of those significant factual developments that it said had taken place after the district court's 1981 decision. The first of these developments was that \"further technological study has revealed that it is indeed possible to 're-rack' the Turkey Point spent fuel storage pits a second time, so as to provide sufficient on-site storage for all the spent fuel that the reactors will discharge over its [sic] useful life.\" A second development identified by the district court was the enactment of NWPA in 1982, which the district court said represented a \"firm step[] toward creating a permanent disposal site for nuclear spent fuel,\" to be available in 1998. Finally, it recognized that generally the 'generators and owners' of spent fuel would typically be utilities,\" which \"would be allowed,\" under the Congressional intention, \"to pass the expense [of permanent storage] on to their ratepayers.\" This intention and the rule of allocation, the district court said, \"was not intended to alter whatever responsibility a party such as Westinghouse might have to a utility.\" It based this conclusion on a short colloquy on the floor of the House of Representatives while the bill was under consideration. There was another fact of \"minimal\" significance which had not been previously discussed in either of the prior opinions: President Reagan had in 1981 \"lifted the ban on commercial reprocessing.\" The district court recognized, though, while this development made commercial reprocessing available, the \"intense political opposition\" that had already been generated to reprocessing remained and, whether the presidential ban continued or not, the licensing of a reprocessing facility, in the court's opinion, \"would [have been] long and expensive at best,\" so much so that \"no further business venture into commercial reprocessing [was] likely to take place.\"\n\nHaving set forth this background, the district court addressed anew Westinghouse's plea of commercial impracticability or impossibility. While as we have said it affirmed the findings previously made in its 1981 opinion, it did so by adopting in effect for its decision on such facts the doctrine of impossibility of performance as set forth in the Restatement (Second) of Contracts § 265. As formulated by the district court in this opinion, the doctrine requires that the impracticability or impossibility of performance which will satisfy the doctrine must rest on a frustration of performance caused by the occurrence of an event \"the non-occurrence of which was a basic assumption on which the contract was made.\" It would seem, too, that the district court accepted in its discussion of the doctrine that \"if . . . the existence of a specific thing is necessary to the performance of a duty [under the contract] . . . [and] its failure to come into existence, destruction, or . . . deterioration . . . makes performance impracticable,\" that fact is an event, \"the non-occurrence of which was a basic assumption on which the contract was made.\" Restatement (Second) of Contracts § 263. The district court had recognized both in its first and second opinion, and implicitly accepted in its third opinion, that the application of the doctrine does not depend on the language of the contract, but comes into play when \"extraordinary circumstances may make performance so vitally different from what was reasonably to be expected as to alter the nature of that performance.\" This was the language of Transatlantic Financing, supra, which the district court cites and seems to assume to have given a correct exposition of the doctrine of impossibility or commercial impracticability of performance. And it plainly recognized that, while added cost may not amount to a frustration of such basic assumption \"within the normal range of risk,\" \"[a] thing is impossible in legal contemplation when it is not practical; and a thing is impracticable when it can only be done at an excessive and unreasonable cost.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e (Italics added).\n\nThe district court, in applying these criteria of the doctrine, found at the outset that performance had not been frustrated. It based this conclusion, as it had in its first decision, on its finding that \"Westinghouse [had] not convinced the Court that it could not have removed at least some of the spent fuel exactly as agreed -- i.e., within six months to a year -- had it energetically attended to its contract obligations in the early 1970's.\" 597 F. Supp. at 1476. In reaching this conclusion, the district court assumed that AGNS's facilities, although \"built for reprocessing, had existing storage capacity in 1975 which would have been more than enough for the spent fuel disputed here\" and had \"Westinghouse pressed its contract negotiations with AGNS more aggressively, . . . at least some of this space [in the AGNS facility] could have been made available to Westinghouse.\" A few paragraphs later in its opinion, the district court said that\n\nHowever, although the AGNS facility could conceivably have been expanded, the evidence suggests that any attempt to expand the AGNS facility into a full-scale AFR facility would have met intense and possibly insurpassable political opposition . . . .\n\nIn this light, the Court is not prepared to find that Westinghouse could have forced AGNS to convert its facility to a full-scale AFR that could have accepted the Turkey Point spent fuel throughout the life of the 1973-1983 contract between Florida and Westinghouse. Nor is the Court prepared to find that Westinghouse could have built its own AFR to have served that purpose. It would be purely speculative to reach a conclusion in either direction on these two points.\n\nHowever, Westinghouse has not disturbed the Court's 1981 finding that had Westinghouse acted with diligence, it could have removed some portion of the spent fuel to the existing storage space at the AGNS facility or to similar space at a number of other sites summarized in the experts' report.\n\nIt ends this phase of its findings with the declaration that, whatever may have been the situation earlier, the enactment of the 1982 Act provides the means whereby \"Westinghouse can now ultimately meet its obligation in reference to removal and disposal of the spent fuel as a consequence of Florida's having contracted with DOE for its removal to the permanent federal repository\" and the costs of such removal and storage under the contract was not such as to support a finding of excessive expense, considering the profit that Westinghouse should have made on other parts of its contract with Florida. In short, it found that it had been possible for Westinghouse, in part at least, to have performed its obligation to dispose of the spent fuel prior to 1976 and, so far as the future was concerned, it could now perform that obligation absolutely as a result of the enactment of NWPA in 1982.\n\nSecondly, it found that any reliance by Westinghouse on the unavailability of reprocessing was something clearly foreseeable by the parties and, therefore, not an \"unforeseen occurrence within the doctrine.\" It gave three reasons for the finding that the unavailability of reprocessing was so foreseeable that \"a reasonable, informed person, or company, in the nuclear industry should have taken them into account.\" In its view, commercial reprocessing was, first of all, unproven technologically. Beyond this, it was reasonably foreseeable that, for safety reasons, reprocessing would likely be subjected to continuing more stringent and expensive regulations which could destroy the viability of the industry. And, these uncertainties and difficulties either were or should have been seen by Westinghouse and that, because of this, it is to be assumed as a matter of law that Westinghouse voluntarily accepted the risk of the unavailability of reprocessing and could not rely on such unavailability as a defense. It dismissed Westinghouse's contention that it had a right to rely on the Government's assurance that, if commercial reprocessing were not available, it (the Government) would provide reprocessing in reasonable terms, declaring that, while \"Westinghouse [was] clearly correct that the Government was promoting private reprocessing . . . during this period,\" those \"promotional efforts never rose to the level of an assurance of commercial viability\" of reprocessing; in fact, it said the Government's promotional activities were merely \"to generate sufficient experience to enable the AEC to evaluate whether or not nuclear power had practical value in this application [ i.e., on the commercial generation of electric power],\" adding that \"given that this was an acknowledged open question, the AEC was in no position to guarantee the industry's viability, and it did not do so.\" It recognized that such finding somewhat conflicted with the Commission's 1957 official announcement, but said that this assurance expired on December 31, 1970. Despite this statement, the opinion then retreated by adding that \"the principle underlying [this assurance] . . . remained in effect although the policy was not renewed [after 1970].\"\n\nThis conclusion that the parties -- Westinghouse, in particular -- had no right to rely in May 1966 on the Government's assurance that reprocessing on reasonable terms would be available seems to conflict with an essential finding made later by the district court. Thus, near the end of its opinion the district court states:\n\nWestinghouse contends that a series of Government actions in the 1970's and 1980's have rendered performance of the \"remove and dispose\" obligation impossible and/or impracticable. As discussed supra, the Court rejects for the most part Westinghouse's factual contentions in this regard. All that remains to be addressed is the significance of the fact that the Government did not act in a timely fashion in honoring its implied commitment regarding spent fuel.\n\nThe Court is satisfied that this failing on the part of the Government was an unforeseeable contingency the non-occurrence of which was a basic assumption of the contract and which has rendered performance of Westinghouse's implicit timeliness obligation to Florida impossible. No one could have anticipated the poor planning, delays, and policy reversals that have added up to more than twenty years of delay, after the outlook for commercial reprocessing became clouded, before the Government will be providing any alternative. Both Florida and Westinghouse were aware that reprocessing might not be available, but neither of them anticipated that no alternative means of removal would be available until 1998 or after. This assumption can be inferred from their mutual agreement to build only six months to a year's worth of capacity into the original storage facilities at Turkey Point.\n\nIt concluded this phase of its opinion with this: \"The failing in the Government's policies was that a permanent means of disposal was not available in time to avoid unnecessary costs for interim storage either on site or off-site. . . . The Court is satisfied that at least some of the interim storage costs must be attributed solely to unnecessary delays in the fulfillment of the Government's implied commitments. Westinghouse cannot fairly be held liable for the full amount of these unnecessary costs (Court's Italics).\"\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nThe most important conclusion stated by the district court was its reiteration of its earlier conclusion in its first opinion that reprocessing was not a basic assumption of the parties at the time of the execution of the contract. It is the thesis of both the first and third opinions that Florida never assumed the availability of reprocessing at the time of the contract's execution. The district court conceded not once but repeatedly throughout all three of its opinions and findings that reprocessing was the \"contemplated\" means of disposal at the time. It declares this to have been \"abundantly clear.\" Yet the district court states that while the parties \"contemplated\" that reprocessing would be the means of performance, that was not equivalent to finding that the parties intended that reprocessing should be used for disposal of the spent fuel. It did, however, recognize that all \"knowledgeable\" in the nuclear industry assumed that reprocessing was the proper way in which to dispose of spent fuel. In reaching the conclusion that Florida had not, however, had this view the district court, as we have already indicated, relied on a memorandum prepared by Gardner, an assistant to Florida's chief executive officer, even though Gardner testified that ultimately reprocessing was understood to be the only way to dispose of spent fuel. We later discuss this memorandum.\n\nThe district court sought to answer its earlier reliance in its second opinion on the rule in Hadley v. Baxendale, as broadly adopted in Section 351 of the Restatement (Second) of Contracts that \"damages are not recoverable for loss that the party in breach did not have reason to foresee as a probable result of the breach when the contract was made.\" It declared that this language of the Restatement \"focus[es] as it does on the foreseeability of the loss rather than the foreseeability of the damages \" (Court's Italics) and that there was \"nothing unforeseeable about the damages except perhaps the amount: it was not only foreseeable but a virtual certainty that if Westinghouse failed to remove and dispose, Florida would suffer damages in the amount necessary to obtain removal and disposal from some other source. . . . Uncertainty in the amount, rather than the kind, of damage is not the sort of uncertainty that Hadley addresses.\" This conclusion of the district court is premised on its assumption that storage was always foreseen as a viable alternative, albeit at some greater cost, to reprocessing as a means of disposing of the spent fuel.\n\nFinally, the district court, by way of remedy, provided that the costs of reracking at the Turkey Point site should be divided between the parties but that the full costs of ultimate permanent storage (whenever it became available, if ever) of the spent fuel should fall on Westinghouse. In reaching this conclusion, it found that the Government had failed in its commitment to provide a means for the disposal of spent fuel if no other means was available and that, while the 1982 Act provided such \"other means\" it had not done so when the need for disposal was required. It held that this failure of the Government was an unforeseen occurrence which excused Westinghouse so far as prompt performance was considered. It did not relieve Westinghouse entirely, however, since, in its view, Westinghouse could have taken care of some of the spent fuel if it had been diligent in carrying out its obligation under the contract. For this reason, it divided the cost of reracking between the parties.\n\nWe now proceed to analyze this reasoning of the district court in the light of the facts and circumstances of this case.\n\nIV.\n\nThe first task in resolving the issues in this case is the determination of the governing principles of law. There is no controversy that Westinghouse was obligated under the contract to dispose of the spent fuel discharged by the Turkey Point nuclear reactors or that Westinghouse in 1975 breached that obligation. The question is whether this breach of that section of the contract was excused under the facts of the case. As we have already observed, Westinghouse asserted a number of legal grounds for excuse. But the primary ground which received the greatest attention in the district court's first opinion and was essentially the only ground discussed and analyzed in the second and third opinions was the defense of impossibility or commercial impracticability of performance. Since we think the case can be disposed of on the basis of that defense we shall confine our discussion to that ground of excuse.\n\nIt is important to emphasize at the outset that the doctrine of impossibility-impracticability does not depend on nor is it limited in its application by the specific language of the contract. This is true because of the rationale of the doctrine as stated both in Corbin and Williston and as expressed in both the Restatement and the Uniform Commercial Code. Williston puts this rationale as follows:\n\nAny qualification of the promise is based on the unfairness or unreasonableness of giving it the absolute force which its words clearly state. In other words, because the court thinks it fair to qualify the promise, it does so and quite rightly; but clearness of thought would be increased if it were plainly recognized that the qualification of the promise or the defense to it is not based on any expression of intention by the parties.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nCorbin expresses the same thought in these words: \"The doctrine [of impossibility of performance] is invented by the court in order to supplement the defects of the actual contract. The parties did not anticipate fully and completely, if at all, or provide for what actually happened.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn its Introductory Note on Impracticability of Performance in the Restatement (Second) of Contracts, at 309-310, the commentators phrased the doctrine's justification in slightly different language but without any change in the basis of the doctrine itself:\n\nEven where the obligor has not limited his obligation by agreement, a court may grant him relief. An extraordinary circumstance may make performance so vitally different from what was reasonably to be expected as to alter the essential nature of that performance. In such a case the court must determine whether justice requires a departure from the general rule that the obligor bear the risk that the contract may become more burdensome or less desirable.\n\nIn its actual phrasing of the doctrine in Section 265 of the Restatement (Second) of Contracts the commentators stated the doctrine thus:\n\nWhere, after a contract is made, a party's principal purpose is substantially frustrated without his fault by the occurrence of an event the non-occurrence of which was a basic assumption on which the contract was made, his remaining duties to render performance are discharged, unless the language or the circumstances indicate the contrary.\n\nIt supplements this statement with a definition of the event the \"non-occurrence of which [may be] a basic assumption on which the contract was made\" in § 263 of the Restatement:\n\nIf the existence of a specific thing is necessary for the performance of a duty, its failure to come into existence, destruction, or such deterioration as makes performance impracticable is an event the non-occurrence of which was a basic assumption on which the contract was made.\n\nIn section 2-615(a) of the Uniform Commercial Code, non-performance of the contract is excused \"if performance as agreed has been made impracticable by the occurrence of a contingency the nonoccurrence of which was a basic assumption on which the contract was made,\" thus treating impossibility as synonymous with commercial impracticability as an excuse for breach of a contract.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nThese statements of the doctrine, save for their disapproval of the rationale of the doctrine as resting on a theory of \"implied condition,\" do not depart substantially from its enunciation in Texas Co. v. Hogarth Shipping Co., 256 U.S. 619, 629-30, 65 L. Ed. 1123, 41 S. Ct. 612 (1921), which the district court took as its guide in the application of the doctrine in its first opinion. In that case, the Supreme Court said:\n\nWhere parties enter into a contract on the assumption that some particular thing essential to its performance will continue to exist and be available for the purpose and neither agrees to be responsible for its continued existence and availability, the contract must be regarded as subject to an implied condition that, if before the time for performance and without the default of either party the particular thing ceases to exist or be available for the purpose, the contract shall be dissolved and the parties excused from performing it.\n\nIt is obvious from these statements of the doctrine that the language of the contract itself is irrelevant in the application of the doctrine, since, as Williston aptly comments,\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e the doctrine of impossibility or commercial impracticability of performance as a defense to an action for breach of contract is \"essentially an equitable defense,\" without any basis in the specific language of the contract in question or \"any expression of intention by the parties,\" but resting firmly \"on the unfairness [and] unreasonableness of giving [the contract] the absolute force which its words clearly state.\" We accepted this reasoning as the basis for the doctrine in The Opera Company of Boston, Inc. v. Wolf Trap Foundation, 817 F.2d 1094 (4th Cir. 1987) and deduced from the Restatement and other authorities cited that under the doctrine, \"a party relying on the defense of impossibility of performance must establish (1) the unexpected occurrence of an intervening act, (2) such occurrence was of such a character that its non-occurrence was a basic assumption of the agreement of the parties, and (3) that occurrence made performance impracticable. When all those facts are established the defense is made out.\" 817 F.2d at 1102.\n\nWe proceed to a review of the facts in this case under the requirements as phrased by us in Opera Company to determine whether under the clear evidence the defense of impossibility/impracticability of performance as an excuse for breach of the contract by Westinghouse has been established.\n\nV.\n\nThe first step in this determination in any particular case is the ascertainment, first, of the exact act or thing the promisor obligated himself to perform or furnish and, second, the identification of the means whereby the parties contemplated performance by the obligor was to be had. It is at this initial point in the application of the doctrine that the district court erred. It is easy, of course, to ascertain the obligation imposed under Option C on the promisor, Westinghouse, which Florida elected to require in the 70's, some five years after the contract herein was signed. That obligation is to \"remove the irradiated fuel . . . and dispose of it as Westinghouse sees fit.\" The promise thus encompasses both removal from the site and disposal of the spent fuel off-site. The parties perceived no difficulty in removal provided there was some place to which the material could be taken for disposal. After all, the difficulty was the method or means of disposing of this spent fuel. The district court held that the method or means of disposing of the spent fuel was \"left unspecified\" in the contract. However, the district court found at varying points in its opinions that the parties \"intended,\" or \"contemplated,\" or \"anticipated,\" or \"understood\" at the time they executed the contract that reprocessing would be the method for disposing of the spent fuel.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e This finding is repeated time after time in the district court's first opinion and is abundantly supported in the record.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nWhile the district court said that \"there can be no doubt that both Westinghouse and Florida contemplated that the spent fuel would be reprocessed\" as the \"means of disposal,\" the district court at another point stated that \"reprocessing was merely an option to Westinghouse\" for such purpose and was not \"viewed as the exclusive means of performance.\"\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e If, by this language, the district court was saying merely that reprocessing was not specified in the contract as the means of disposing of the spent fuel, such statement is accurate. But if it was meant to suggest that the parties foresaw and contemplated or intended some means of disposal other than reprocessing, the statement is manifestly erroneous. This is so because there was no means of disposal available other than reprocessing when the contract was signed in 1966. At that time the \"only alternative\" to reprocessing had always been \"long-term storage,\" as the district court said.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e It repeated this finding at another point, saying that, \"if spent fuel is not reprocessed, long-term storage of some sort appears to be the only alternative. . . .\" Gardner, Florida's primary witness on the issue, conceded that \"at some point [in the fuel cycle] you have to store [the spent fuel] or reprocess it.\" However, there has never been any long-term storage available as an alternative to reprocessing for this spent fuel. The Government has never provided such storage facilities and no private venturer has ever constructed or even considered the construction of such a facility. This fact is undisputed by the parties. By the Act of 1982, it is true that the Government authorized the construction of long-term storage but such facilities are unlikely to be available, under the most favorable circumstances, until the first quarter of the 21st century. The fact remains that long-term storage was not available in 1966 when the contract was executed, was not available when performance by Westinghouse was required under the contract, and is not now available for disposal of spent fuel from commercial nuclear power plants. Reprocessing, therefore, was not just an \"option\" for disposal; it was the only, the \"exclusive,\" means for disposing of spent fuel in the contemplation of the parties in 1966 when the contract herein was executed. By 1975 the Government discontinued any reprocessing for commercial nuclear plants; there were no commercial reprocessing facilities operating or licensed, and there was no off-site storage facilities. Thus, in 1975, when Florida called upon Westinghouse to dispose of the Turkey Point spent fuel the \"intended\" means of disposal did not exist nor was there any reasonable alternative available. Such findings, compelled as they are by the undisputed facts, make out a textbook illustration of the circumstances warranting the application of the doctrine of impracticability/impossibility of performance as a valid excuse for breach of a contract.\n\nThe district court, however, found a number of reasons not to accept Westinghouse's defense of impossibility/commercial impracticability -- even though the record appeared to establish a clear basis for that defense. The district court assigned three reasons for denying Westinghouse's plea of impossibility of performance: 1. Reprocessing was in the opinion of Florida, if not of Westinghouse, too \"uncertain\" and \"speculative,\" to have been a basic assumption of the contract the non-occurrence of which would excuse performance by Westinghouse; 2. Westinghouse's failure to perform was due in part at least to its lack of \"zeal\" and reasonable effort to secure a means of disposal at time performance was due; and 3. Disposal of the spent fuel could be \"accomplished [without] extreme and unreasonable difficulty, expense, injury or loss.\"\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e We shall examine these three reasons separately, beginning with the first one stated.\n\nA.\n\nThe district court's first objection to sustaining Westinghouse's defense of impossibility is stated in its conclusion that reprocessing under the evidence was too \"uncertain\" and \"speculative\" to have been \"a basic assumption of the contract\" at the time the contract was made. It would find in particular that Florida at all times considered reprocessing to be \"uncertain\" and \"speculative\" and for that reason, it never considered reprocessing itself, even though the district court repeatedly in its opinion said that both parties \"contemplated\" or intended to dispose of the spent fuel by reprocessing. If, by this conclusion, the district court was deciding that reprocessing as a method of disposing of spent fuel was \"speculative\" and \"uncertain \", its conclusion was completely refuted by the record.\n\nReprocessing was a method of disposal developed and perfected by the Government when it began the processing of atomic material in the 1940's. It had been used for disposal of spent nuclear material successfully ever since. Other nations that had been associated with the United States in the development of atomic energy had constructed without any difficulty reprocessing facilities and were reprocessing spent fuel from commercial nuclear plants in those facilities. The Government assumed, from the very onset of the program for the civilian or peaceful use of atomic material under the Act of 1954, that reprocessing would be the accepted method of disposing of spent fuel and it, from its superior knowledge of the use of atomic materials, recommended this method of disposal of the spent fuel generated under the Atoms-for-Peace program authorized in the 1954 Act. The program, however, was slow to develop. Before 1957 no private nuclear plant had been constructed or planned. One reason for the delay was undoubtedly concern over the ability to dispose of a nuclear power plant's spent fuel. The Government recognized this. In order to breathe life into the program of private nuclear power plants the Government issued in March 1957 a formal assurance (the district court described it as \"implied commitments,\" 597 F. Supp. at 1478) that if commercial reprocessing were not to become available on reasonable terms for the spent fuel of any nuclear power plant constructed under its license issued under the authorization of the 1954 Act, it would reprocess in its own plants such spent fuel.\n\nIt was this assurance that was the catalyst for the development of the civilian nuclear power program. With this assurance of the Government the utility industry, relying on the Government's assurance, began aggressively to construct nuclear power plants, confident that if commercial reprocessing never developed (there was none in 1958 when the first nuclear power plant was begun; actually, the first reprocessing power plant was not completed and did not begin operation until April 1966, about a month before the contract in this case was signed) government reprocessing would be available. A finding of uncertainty of reprocessing would \"fly in the face\" of the undisputed fact that reprocessing was thus being successfully carried on both here and abroad. In fact, the Government in 1966 was actually reprocessing fuel under its 1957 commitment to utilities which had constructed nuclear power plants after that announcement. Reprocessing, unlike the method in Wegematic which the district court cited in its opinion, was not an untried \"revolutionary\" method which had never been successfully used;\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e it was a long-established successful process the construction and operation of which presented no known obstacles.\n\nNor do we think the record justifies the assumption made by the district court that Florida did not understand that the Turkey Point spent fuel would be reprocessed. Everything in the evidence refutes such notion. Florida was not uninformed or \"uncertain\" about reprocessing or the fuel cycle. Gardner, one of Florida's negotiators, testified that he had \"read everything [he] could get hold of, the books and publications. He had talked to whomever [he] could talk to, the vendor, fuel people, government people, to get an idea about the various elements of the fuel cycle, including reprocessing prior to the signing of the contract herein.\" He claimed on the basis of this study and inquiry an acquaintance with the whole fuel cycle process. And he called upon this information in the preparation of the extensive memorandum in which he reviewed for Florida's chief negotiator and chief executive officer, Smith, the full fuel cycle.\n\nIn this memorandum Gardner set forth in detail and extensively the steps in the process of using nuclear fuel to generate electric power. In particular, it dealt fully with the critical matter of disposing of the plant's spent fuel. It identified reprocessing as the method for disposing of the spent nuclear fuel at the proposed plants. In describing reprocessing, it expressed no uncertainty about the process itself or even about the commercial feasibility of reprocessing as an industry. It did state that NFS was the only company engaged at the time [1965] in constructing a plant for which it was then accepting applications for reprocessing, but it gave a very confident picture of other large industrial interests which were either actively considering or had taken active steps to engage in the construction of a reprocessing facility. In this regard, the memorandum was to the same effect as the testimony of the head of Florida's nuclear analysis department, which was that the utility industry (which it may be assumed to include Florida) in the 60's was enthusiastic about reprocessing.\n\nThe memorandum raised only one word of caution. This caution did not relate to either the feasibility or the availability of reprocessing, whether performed in Government plants or in private commercial plants. It dealt strictly with the stability of the market price for plutonium. The only relevance this price of plutonium had was in assessing the value of the spent fuel, a matter of interest to a party accepting responsibility for the spent fuel with the expectation of deriving a profit from the by-products of reprocessing consisting primarily of reusable uranium and plutonium. At the time of this memorandum, the Government offered a guaranteed market and price for plutonium. But this guaranteed market and price would expire in 1970, and if the military program were curtailed, this market might, in the opinion of the memorandum, likewise be curtailed and the price paid by the Government reduced. This, as we have said, was a matter of interest to one who would assume the risk of reprocessing because, if the market or price for plutonium deteriorated, one of the profitable items which was to be developed from reprocessing might not provide the anticipated profit. This remark on the possibility of a weak market for plutonium after 1970,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e which incidentally is the only part of the memorandum quoted by the district court, did not question the feasibility of reprocessing, nor did it assume reprocessing to be \"uncertain\" or \"speculative;\" it suggested only that if Florida elected to handle the reprocessing of the Turkey Point spent fuel, it should recognize that there was some risk on the market and price of the by-product plutonium after 1970. This memorandum thus establishes if anything that Florida regarded reprocessing as feasible and any uncertainty it had related simply to the future price that might be expected for plutonium should Florida elect to accept responsibility for disposal of the plants' spent fuel, a matter Florida did not resolve until almost five years after the contract was signed.\n\nThere are cogent evidences in the contract itself that make any finding that Florida was uncertain about reprocessing and had scrupulously refused to make any agreement assuming that reprocessing would be used to dispose of the spent fuel from these Turkey Point plants, simply incredible, without any reasonable foundation in the record. The only authority that the district court cites to support its statements of uncertainty about reprocessing is some obscure testimony of Gardner, by that time (1981) an executive vice-president of Florida. Testifying almost fifteen years after the contract was signed and after the disastrous developments in reprocessing in the 70's before him, Gardner said he had never considered reprocessing practical. However, a few months before the contract was signed, Gardner had, as we have pointed out, prepared a memorandum which discussed reprocessing as the accepted method for disposing of spent nuclear fuel and expressed to his superior no doubt whatsoever about the practicality or availability of reprocessing. Further, after his testimony that he though reprocessing to have been impractical, Gardner was forced to concede, in response to a question from the district judge, that spent fuel could only be disposed of by \"reprocessing\" or \"storage.\" There was no storage available in 1966; therefore, the only method known by Florida in 1966 when this contract was executed after months of evaluation was reprocessing. If reprocessing was uncertain, as Gardner would suggest, then Florida signed a contract to construct a nuclear power plant at great cost, knowing at the time under his testimony that there was only an \"uncertain\" and \"speculative\" means of disposing of the spent fuel from those plants. When it is recognized that the ability to dispose of spent fuel is an essential element of a successful, operating nuclear power plant, a fact which this record makes crystal clear, then it is necessary, if one is to accept the ambiguous belated professions of uncertainty by Gardner, to find that Florida chose to hazard all the monies required for the construction of the Turkey Point plants despite its belief that the disposal of the spent fuel of those plants was, in its mind, uncertain. To assume that Florida would have made such a palpably imprudent decision stretches too far credulity.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Moreover, later in the 60's Florida entered into another contract with Combustion Engineering for the construction of a nuclear power plant.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Gardner admitted that there it was expected and contemplated that the spent fuel of the plant would be reprocessed. Such action is plainly inconsistent with any notion that Florida regarded reprocessing in 1966 as \"uncertain.\"\n\nGardner further sought to justify Florida's action in executing the contract herein, even though reprocessing was in his opinion \"uncertain,\" by saying that Florida, under the contract, had transferred the problem to Westinghouse and thus was disinterested in the problem.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Actually, the contract as it was executed in 1966 did not transfer that responsibility to Westinghouse; that responsibility was only transferred to Westinghouse when informally in the latter part of 1970 and again formally in 1972, some four or five years after the contract was signed, Florida elected not to take Options A or B, under which it (Florida) would have been responsible for disposal but to take Option C which then placed at that time the responsibility on Westinghouse for disposal. But Option C covered only the first ten years of the Turkey Point plants' operations. These plants, however, had an expected operations life of thirty years. All the cost evaluations of the project were based on that expected life. Thus, Florida, with the twenty year exposure for disposing of the spent fuel after Westinghouse's obligation under Option C would have expired, had proportionally a far greater interest in the practicality and availability of reprocessing than did Westinghouse, with its limited ten year responsibility under Option C. It, therefore, is no answer to respond blithely that Florida had no responsibility and no interest in the availability of reprocessing.\n\nIn addition, it must be remembered that Florida reserved to itself the right to exercise an option to handle the reprocessing of the Turkey Point spent fuel at any point up to criticality (i.e., when the plants were completed or sooner for five years after the contract was signed). This right in Florida to make such later election was a right favoring Florida, not Westinghouse. There would have been no occasion for the inclusion of such an option if Florida, as the district court said, was adamantly resolved not to have any traffic with reprocessing or disposal of the plants' spent fuel. There is even indication in the record that Gardner drafted at least one version of the options, action inconsistent with any notion that Florida never had any intention to reprocess the Turkey Point spent fuel. Even more significant, Florida never exercised its option until the early 70's when the chorus of complaints and the multitude of interventions in all pending proceedings before the AEC involving reprocessing had arisen. There was no reason why, if it intended firmly from the outset of negotiations until up to the execution of the contract not to have anything to do with reprocessing, Florida had the option included in the contract and, even more important, did not exercise its option immediately and did not wait until it had become evident that the likelihood of reprocessing had become cloudy. Neither Florida nor the district court in its decisions offered any explanation for this delay. Yet the obvious one under the circumstances was that, until the early 70's, Florida regarded reprocessing as perfectly feasible and wished to take the full time allowed under the contract to determine whether its election should be to give the responsibility of disposal to Westinghouse or to undertake such responsibility itself.\n\nIf further evidence is required of the intention of the parties that reprocessing was the means and the only means of disposal contemplated by the parties, that evidence is supplied by the record of negotiations leading up to the execution of the contract herein and by the contract itself. Reprocessing was the only method of disposal that is identified in any memoranda of discussions between the parties, or in any documents or proposals passing between them during these negotiations. All through the contract negotiations, the parties manifested their firm intention that the spent fuel discharged by the proposed Turkey Point plants would be reprocessed. In its proposal preceding the signing of a letter of intent between the parties, Westinghouse spelled out in great detail the terms of the proposed contract. Such terms included repeated references to reprocessing as the method for disposing of spent fuel. This proposal was submitted to Florida and was the subject of discussion between the parties. There is no record in the testimony that Florida ever took issue with reprocessing or raised any question about either its feasibility or its availability.\n\nA few months before the contract was signed, Florida obtained from Westinghouse a statement detailing the fuel needs of the Turkey Point plants under the proposed contract. This statement showed in express terms that the spent fuel discharged from the plants' nuclear reactors would be reprocessed. It went further to spell out the amount of reusable uranium and plutonium that would be realized from reprocessing the spent material over the life of the plants. About two years after this contract was executed, Gardner requested another such compilation. The professed reason for which Florida wished this compilation was for inclusion of the material in the compilation in certain material Florida was required to file for licensing either by the AEC or the Florida Public Service Commission. It is significant that at this time Florida was negotiating with Combustion Engineering for the construction of another nuclear power plant. It is possible Florida wanted this information in order to check the reprocessing proposal by Combustion, since it seems agreed that reprocessing was included in this new plant. See note 38, supra. Again, the compilation demonstrated that the spent fuel would be reprocessed, and the amounts of reusable uranium and plutonium that would be realized from the reprocessing were stated.\n\nThere is another document in the record that makes even more incredible the suggestion that Florida never considered reprocessing as a means of disposal of the plants' spent fuel. It is a memorandum of a conference between representatives of Florida and Westinghouse. The memorandum was prepared by Gardner, who was one of the participants in the conference representing Florida. This conference took place two days before the contract was actually signed. In memorializing what had been discussed and agreed at the conference, Gardner said in part:\n\nDollard [who was a representative of Westinghouse at the conference] proposed a formula whereby even though the initial price for the fuel assemblies would vary, either Florida would get an increase in burn-up, an adjustment in price after reprocessing, or both. The adjustment would be such that Florida's fuel cycle costs would be fixed with reference to the warranted Regional Energy Prices in Option B and would be fixed with reference to the warranted Regional Energy Prices in Option B and would be based on fixed assumed values for shipping, reprocessing, and plutonium and uranium prices.\n\nWith some minor changes this proposal was accepted by Florida. It is true that this agreement refers to Option B which Florida did not select. However, until Florida made its selection five years after the contract was signed, this language bound the parties so far as Option B was concerned. Moreover, Option B, like Option C, designated Westinghouse as responsible for disposing of the spent fuel and was largely similar in requirements. This memorandum demonstrates clearly that both parties expected that there would be reprocessing resulting in certain valuable by-products for which Florida was to be credited.\n\nPerhaps the strongest and most compelling evidence that Florida as well as Westinghouse understood and assumed that the Turkey Point spent fuel would be reprocessed is established by the bargained price in the contract itself on which the parties agreed. The district court correctly stated the background for this part of the agreement:\n\nFlorida's continued insistence on guaranteed fuel costs, for as long a period as possible, together with the extreme importance Westinghouse placed on obtaining the construction contracts, prompted Westinghouse's offer of a guaranteed ten year fuel cycle cost. This, of course, included the cost of uranium and the purchase and disposal of the spent fuel as a part of the fuel cycle.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nWhen the contract was signed, the parties included, as the district court found, that \"the bargained for price per kilowatt hour [in contract] reflected the parties' anticipation that the fuel would be reprocessed.\" 517 F. Supp. at 455. It is difficult to imagine any scenario of negotiations and contracting that would establish more clearly and conclusively that not only Westinghouse but also Florida contemplated and contracted on the \"basic assumption\" that the spent fuel would be reprocessed, whether done by Florida or Westinghouse, than that the price to be paid for performance under the contract was based on what the parties assumed to be the cost or profit realized from reprocessing the spent fuel discharged by the plants' reactors. After all, nothing in the contract was more important than the price bargained for. When the bargained-for price was understood to include as an integral part thereof the cost of reprocessing and the profit realized for the sale or use of the products resulting from the reprocessing, such reprocessing must be taken as a basic assumption of the contracting parties.\n\nBut the district court dismissed the clear evidence that reprocessing was a basic assumption of the contracting parties by declaring that the agreement on pricing represented merely \"an expectation\" and was not a \"basic assumption\" or a condition of performance, citing American Trading, supra, and Transatlantic Financing, supra, as sustaining its conclusion. We find it difficult to discern any similarity between this case and the two cited authorities. As we have already observed, both of the cited cases involved contracts of carriage by sea (from a port in Texas to a port in India in the case of American Trading and from a port in Texas to a port in Iran in (Transatlantic Financing). The cases did refer to the fact that the \"contemplated\" route to be followed by the ships involved was the Suez Canal, but the decision in the cases did not turn on some tortured construction of the term \"contemplation\" but on the existence of a reasonable alternative available without excessive costs. When the Suez Canal was closed by the Israeli-Egyptian War, the shipping companies were forced to divert the ships to follow the well-known alternative Cape of Good Hope route. There was thus in both of these cases a reasonable long-used and accepted alternative for performance. In both cases, the ship charterer sued for the extra costs involved in the longer-than-anticipated voyage around the Cape and lost because the Courts found that the increased costs of carriage were not excessive within the contemplation of the impossibility doctrine. This case is not in the least similar to those cases.\n\nIt is clear beyond dispute in ending the discussion of this part of the district court's reasoning, that it was a basic assumption of both parties -- Florida and Westinghouse -- that the disposal of the spent fuel would be effected by reprocessing, that in their negotiations leading up to the execution of the contract both assumed that the spent fuel would be reprocessed, that neither party doubted that reprocessing would be both feasible and available when they executed the contract and when performance under the contract would become due, that they based the bargained- for price to be paid Westinghouse on the basis of the cost of reprocessing, and that there were in the contract itself references to reprocessing. See Section 1(d), Section 18(b) [\"actual performance will be determined from the results of isotopic analysis of the reprocessed fuel or in a manner agreeable to Westinghouse and Florida\"] and Section 24(c). This was essentially the district court's finding in its second opinion, as we have already said. If we were to apply the test stated by the Supreme Court in Hogarth, it would be proper to say that under these undisputed facts reprocessing was an \"implied condition\" of the contract, as that term was used in that case.\n\nWe are unable to distill from this record the slightest credible evidence that at the time this contract was executed both parties had not assumed (1) that reprocessing was a practical and available method for disposing of spent fuel, (2) that it was the method of disposal by which it was intended that, dependent on Florida's election under the option granted it, the party obligated would dispose of the spent fuel, and (3) that, if commercial reprocessing was not available on reasonable terms, the Government would reprocess the plants' spent fuel. Actually, neither the district court nor Florida seemed to take issue with but one of these conclusions.\n\nThe district court would find, however, that what the parties considered was commercial reprocessing facilities as a means of disposal, and it was commercial reprocessing that was uncertain and speculative in 1966 when the contract was signed. It rested this conclusion on its finding that the difficulties caused by the intervention of environmentalist groups in the early 70s were \"sufficiently foreshadowed in 1965 that a reasonable, informed person, or company, in the nuclear industry should have taken them into account.\" 597 F. Supp. at 1468. There is, so far as we can ascertain, no credible evidence in the record to support this finding. The only fact that the district court cites is that there was no commercial reprocessing plant in operation when this contract was signed. This finding is erroneous: NFS's plant began operations a month before this contract was signed. But this error is not important. The important fact is that no one knowledgeable (except possibly Gardner) in the nuclear field regarded commercial reprocessing as speculative or uncertain. Even Florida's head of its nuclear analysis department agreed with the district court's summation of the facts on the assumption in the nuclear and electric industry that\n\nIn the years -- the late '60s and early '70s, up until the time somebody in Washington put the kibosh on all of it, that it was generally -- the industry was generally enthusiastic about the prospects of reprocessing for several reasons: One, it was generally thought that it would be commercially feasible; and two, it was good because it was going to cut down on the amount of uranium that we were going to need.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nBeyond this, electric utilities other than Florida were erecting nuclear power plants all through the 60's. In fact, Florida contracted for another nuclear plant in 1967 or 1968, to be constructed by Combustion Engineering, in which Florida knew that reprocessing would be the method of disposing of that plant's spent fuel. See note 38, supra. Is it credible to assume that any of the utilities, including Florida itself, would have undertaken the construction of these expensive plants if they had thought that they would have been dependent completely on commercial reprocessing, which they reasonably should have foreseen at the time would be stymied by environmental complaints? Beyond that, it is incredible that Combustion Engineering would have entered into a contract with Florida in 1968 if it had thought later environmental concerns \"foreshadowed\" the death of commercial reprocessing. Even more incredible is this assumption when it is noted that Exxon, Allied Chemical, Gulf Oil, and General Electric were all planning to enter the commercial reprocessing business in the 60's. We find in this record no credible evidence to support the finding that the woes of commercial reprocessing which developed in the 70's were foreshadowed in 1965.\n\nBut this entire argument rests on the assumption that Florida and all the other utilities that constructed nuclear power plants in the late 50's and 60's relied absolutely in their assumptions on the availability of commercial reprocessing. Certainly, the utilities that contracted for the construction of nuclear power plants during that period did not do so. The complete record of private nuclear electric power from 1957 on demonstrates conclusively that this was not so. Thus, there were no commercial reprocessing plants either in existence or planned in the late 50's when a number of these plants were begun. That is not to say that these utilities did not think that commercial reprocessing was practical and feasible, as Florida's own nuclear expert affirmed, and would probably develop. But the important fact is that these utilities, like Florida, had an assurance from the Government that, if commercial reprocessing did not become available on reasonable terms, the Government would provide reprocessing in its own plants. It was that assurance that was the basis of confidence on the part of the utility industry inducing the utilities like Florida to construct nuclear power plants in the late 50's and 60's. And that assurance was given, as we have always said, by the Government for the very purpose of allaying any fear by the utility industry of the availability of reprocessing as a means of disposing of the spent fuel.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Moreover, everything the Government did supported the assumption that reprocessing would be available in Government plants for these nuclear power plants if commercial reprocessing never became feasible and reasonable in charges. Accordingly, in 1963 when the AEC entered into an agreement with NFS incident to the constructing of the latter's reprocessing plant, the AEC had attempted to encourage NFS to construct that plant by assuring if it did not secure enough contracts from commercial nuclear power plants to permit full operation of the plant, the AEC would supply the necessary fuel for such operation by transferring to NFS's plant irradiated fuels received by it (AEC) for reprocessing from the commercial nuclear plants under its March 12, 1957, assurance. But it made it clear that the private nuclear power plants would not be dependent on the commercial reprocessing plants for it provided that if NFS's charges for reprocessing were shown to the utility to be unreasonable, the AEC would \"accept the reactor operator's irradiated fuel under the March 12, 1957, Federal Register notice.\" AEC Report for 1963 at 54. No doubt commercial reprocessing was expected to be available but always the utilities assumed that they were protected by the Government's assurance, an assurance which the district court in its third opinion described as an \"implied commitment.\" 597 F. Supp. at 1478. And it is the failure of the Government to carry out this commitment -- an event neither Florida nor Westinghouse anticipated -- that made it impossible for Westinghouse to carry out its obligation to dispose of the Turkey Point spent fuel. Such failure, it would seem, excuses Westinghouse's failure to perform. And this is specifically what the district court in another aspect of the case held.\n\nAfter Westinghouse had failed to dispose of the Turkey Point spent fuel in 1975, it was established that the spent fuel could for several years be retained on site by increasing the reracking at the plant. Florida had completed some reracking. It sought repayment for this cost, claiming that the reracking was caused by Westinghouse's failure to dispose timely of the spent fuel. In partially absolving Westinghouse for this failure timely to dispose of the fuel, the district court in its third opinion justified its conclusion to this effect by finding first that \"the Government did not act in a timely fashion in honoring its implied commitment regarding spent fuel\" [ i.e., the assurance in the March 12, 1957, announcement] and then it said\n\nThis failure on the part of the Government was an unforeseeable contingency the non-occurrence of which was a basic assumption of the contract and which has rendered performance of Westinghouse's implicit timeliness obligation to Florida impossible.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nIt seems clearly illogical for the district court to excuse the failure of Westinghouse to dispose timely of the spent fuel on the specific findings that the Government failed to prepare under its \"implied commitment\" to provide reprocessing, if reprocessing was otherwise unavailable,\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e and then not to make precisely the same findings in connection with Westinghouse's failure to dispose of the spent fuel by reprocessing. In our opinion, the result in the two situations demanded the same treatment. It therefore follows that Westinghouse is entitled to be excused of liability for failure to dispose of the spent fuel for impossibility of performance.\n\nB.\n\nIn its second reason to deny relief to Westinghouse herein, the district court suggests that Westinghouse is foreclosed from claiming relief under the doctrine of impossibility/impracticability of performance because had it been more zealous it could have \"removed\" some, if not all the spent fuel, before 1977 and thus there was not at least partial impossibility/impracticability. It based this conclusion in its first opinion on its finding that the \"unavailability of reprocessing or storage for Florida's spent fuel prior to 1977 is clearly attributable, at least in part, to Westinghouse's own less than zealous attempts to obtain a facility.\" 517 F. Supp. at 455. In its third opinion, the district court repeated its earlier finding \"that Westinghouse failed to act diligently in the early 1970's to secure a reprocessing and/or storage facility for the Turkey Point spent fuel,\" and it repeated that finding by saying that \"the unavailability of reprocessing or storage for Florida's spent fuel prior to 1977 [was] clearly attributable\" to Westinghouse's less than zealous efforts to secure either reprocessing or storage. 597 F. Supp. at 1463.\n\nThe district court in its third opinion identified the way in which, in its opinion, Westinghouse could have, had it been diligent, secured either reprocessing or storage for the spent fuel prior to 1977. It opined that storage or reprocessing at AGNS's facilities at Barnwell, South Carolina, could have been obtained had Westinghouse preceded with greater \"zeal.\" The district court explained its reasoning in this regard with this statement: \"Had Westinghouse pressed its contract negotiations with AGNS more aggressively, or had it sought to enforce what its witnesses claimed was a lawful contract whereby AGNS agreed to remove and reprocess the disputed fuel, at least some of this space could have been made available to Westinghouse.\" In explaining its reasoning, just quoted, it is uncertain whether Westinghouse is being faulted for failing to obtain reprocessing services at AGNS's facility or to obtain storage at such facility. It seems from later language in the opinion that the district court assumed that Westinghouse could have secured storage for the spent fuel at AGNS's facility if it had acted more \"aggressively.\" Thus, it said: \"Indeed, the AGNS facility could conceivably have been expanded to serve as an AFR [offsite] storage facility for a much larger quantity of spent fuel, making space available for all of Westinghouse's spent fuel. . . .\" It dismissed the argument that the AEC would not have licensed the site for storage, saying that the only reason the Commission \"would [have done so was because it was] unwilling to license this expensive and environmentally costly option so long as the relatively cheap and easy alternative of re-racking at Turkey Point is available.\" Yet, after this statement, the district court added: \"However, although the AGNS facility could conceivably have been expanded, the evidence suggests that any attempt to expand the AGNS facility into a full-scale AFR [ i.e., away from site] facility would have met intense and possibly insurpassable political opposition. . . . In this light, the Court is not prepared to find that Westinghouse could have forced AGNS to convert its facility to a full-scale AFR that could have accepted the Turkey Point spent fuel throughout the life of the 1973-1983 contract between Florida and Westinghouse. Nor is the Court prepared to find that Westinghouse could have built its own AFR to have served that purpose.\" Despite these positive findings, the district court concluded this aspect of its opinion with this declaration: \"However, Westinghouse has not disturbed the Court's 1981 finding that had Westinghouse acted with diligence, it could have removed some portion of the spent fuel to the existing storage space at the AGNS facility or to similar space at a number of other sites summarized in the expert's report.\"\n\nIt is difficult to follow this reasoning. At one point the district court faults Westinghouse for failure to store the spent fuel at the AGNS facilities, entirely disregarding the fact that before any such storage could be had AGNS would have had to be converted to storage for which it would have been required to secure an additional AEC license. Immediately following this, the district court stated that it was unprepared to find that such conversion (which, under the testimony of the AGNS witness, the AGNS was not interested in) could be accomplished. Similarly, it expressed unwillingness to find that Westinghouse could have built its own reprocessing or storage facilities. These conclusions were clearly demanded by the evidence. Until Florida made its election of Option C, Westinghouse could not be charged with want of diligence in planning to dispose of the Turkey Point spent fuel. This election was made informally in the fall of 1970 and formally in 1972. Had Westinghouse sought to construct a reprocessing or storage facility after 1970, a license from the AEC would have been required. AGNS at that very point had an application for a license to operate a reprocessing facility, and NFS had one to expand substantially its plant. Those applications were pending among the applications unacted on because of the complaints of intervenors, see Natural Resources Defense Council, supra, 539 F.2d at 832, and were involved in the proceedings in that case which dragged on until a decree in the fall of 1976 enjoining the granting of any application \"for commercial licenses to construct or operate plutonium-related separation or reprocessing facilities, nor may it license commercial scale transportation or use of plutonium and uranium mixed oxide fuel\" until a full environmental impact statement had been approved. 539 F.2d at 845-46. Shortly after this President Carter directed and the AEC entered an order terminating any grant of license for reprocessing or use of plutonium and uranium mixed oxide. Manifestly, Westinghouse could not have secured a license to construct and operate a reprocessing facility at any point after 1970.\n\nThe picture for constructing an AFR storage facility was no more promising. The AEC itself had sought to develop such a storage facility in 1971. The political hailstorm that followed the announcement of such a plan forced the AEC to abandon the project. Another attempt in 1976 was equally futile. When the Government was unable to construct in the 70's such a storage facility, it is unreasonable to assume that Westinghouse could. It is obvious that there was no possible way Westinghouse, however diligent and alert it may have been, could in the period from 1970 or 1972 on have constructed a reprocessing or storage facility. Nor could it ever have secured reprocessing or storage at the AGNS facility. AGNS was never able to secure a license for its reprocessing facility and it never intended to convert its facility to AFR storage. The contrary conclusion of the district court is without any support in the record or, for that matter, in the findings of the district court itself.\n\nMoreover, the charge of want of diligence on Westinghouse's part loses any weight whatsoever in the light of the evidence of Westinghouse's negotiations with AGNS for a contract to reprocess the Turkey Point spent fuel. In 1969, as a precaution in case Florida chose either Option B or C, Westinghouse entered into negotiations with AGNS for a contract to reprocess the Turkey Point spent fuel at AGNS's plant then under construction, and in the early 70's it had obtained a letter of intent to execute a contract for such reprocessing. Westinghouse made repeated efforts to translate this letter of intent into a firm contract without success. AGNS was unwilling to fix a price in the confused picture for reprocessing arising out of the various judicial attacks on reprocessing at that time and while its license application was caught up in the pending litigation. There is no evidence to support the assumption in the district court's opinions that Westinghouse might have secured a contract had it not been so slow in its negotiations. Actually, the party delaying any signing of a firm contract was AGNS, and its reasons for such refusal were reasonable under the circumstances. Any charge that Westinghouse had been unable to secure reprocessing for the Turkey Point spent fuel because of a lack of zealous diligence on the part of Westinghouse is without any support in the record.\n\nC.\n\nFinally, the district court's opinion advances the point that Westinghouse, with the passage of the NWPA in 1982, acquired a means whereby it could remove all the fuel and dispose of it in government storage at what is not an impracticable cost. For this argument, it relies again on the decisions in Transatlantic Financing, supra, and American Trading, supra, dealing with an alternative means of performance. Both of those cases involved, as we have already observed, sea carriage from the East to the West, for which there are alternative routes: one through the Suez Canal; the other around the Cape of Good Hope. Obviously, carriage through the Canal would be shorter and less expensive for the carrier, and both parties to the contract of carriage could have expected to use the Canal route. However, the Canal was closed by the Israeli-Egyptian conflict, and the carriers were forced to carry their cargo by way of the longer route. The carriers sought to recover the extra cost on the ground that it was a basic, though unexpressed in the contract, assumption that carriage would be via the Canal, and the impossibility of performance under that basic assumption warranted recovery of the extra cost of the more expensive Cape route. The courts denied recovery, finding that the extra costs did not rise to a level authorizing the invoking of the doctrine of impossibility of performance. The increase in costs in Transatlantic Financing was but 16 % and in American Trading less than 33 1/3 %.\n\nFor the reasons already delineated, those cases are plainly different from this case. In those cases, there was always a foreseeable and reasonable alternative means of carriage of the cargo existing both at the time the contract of carriage was executed and at the time performance was called for. In this case, however, there was neither a reprocessing plant nor, for that matter, a storage facility available to Westinghouse subsequent to the time Florida elected to exercise Option C. Its only possible reprocessing facility was AGNS's facility at the time performance was in order -- unlicensed and uncompleted. But that facility was never licensed and could never operate. Neither in 1970 nor at any time since have there been any AFR storage facilities available to Westinghouse for the storage of the spent fuel. Thus, this is an entirely different scenario, with tremendously increased costs of performance and with a means of performance not contemplated or intended by the parties from that presented in Transatlantic Financing and American Trading.\n\nWe do not, however, regard the promise of storage, as made by the Government under the Act of 1982, to represent a reasonable alternative to the reprocessing, the availability of which was, to use the district court's own characterization of the Government's 1957 assurance, an \"implied commitment.\" Under the original governmental assurance, reprocessing was to be available when required, an event that occurred at least by 1975, and, as we have seen, both parties foresaw and assumed that the plants' spent fuel would be disposed of by reprocessing. Storage was not contemplated at the time, nor was it when the contract was executed, as the means of disposal.\n\nHad reprocessing been available, Westinghouse would reasonably have realized a profit from disposing of the Turkey Point spent fuel. That fact is undisputed in the record. What is now offered Westinghouse as an alternative is a method of disposal which neither existed nor was even planned or considered by the parties when the contract was executed or when performance was due in 1975. Assuming the storage is finally provided, it would not only fail to yield a profit of some $18,000,000 to $20,000,000 to Westinghouse, as contemplated by the parties when this contract was signed, but would, if the district court's decision is affirmed, cost Westinghouse at least well over $80,000,000. The difference here is not 50 % as the district court reasoned but percentages in the hundreds range. We know of no case where the use of the alternative not only wiped out the expected profit but resulted in a loss some four or five times greater than the expected profit and that was not found to be so excessive as to justify the application of the impossibility doctrine. Further, the storage alternative is not presently available. The site for storage has not been selected. As the NRC has said, it may be as late as 2010 before storage is available and even that estimate is not firm but is subject to many contingencies, already specified. Certainly, storage was not available at any time during which Westinghouse had responsibility for disposing of the Turkey Point spent fuel (i.e., from 1972, when there was first \"initial criticality\" to 1982, 10 years later).\n\nThe district court, however, would discount the cost of the storage alternative, assuming that storage can be sufficiently certain to represent an alternative. In its first opinion, the district court said that it could not find the extra cost of the storage excessive without considering the profit on the parts of the contract other than that for disposal. Westinghouse, at a hearing on remand, answered this argument of the first opinion by establishing that there was a loss on the other parts of the contract. In its third opinion, the district court proceeded to add the revenue received by Westinghouse for the plant ($222,000,000 approximately) and add to it the cost of the storage. It estimated that the cost of storage was not quite 50 % of the combined total, which it would find was not an excessive cost under the impossibility doctrine. It then concluded that the cost of the alternative (i.e., storage), when compared with the entire cost of the whole project, including plant construction, was less than 50 % of the cost of the whole project.\n\nWe find this method of calculation improper. The only thing to be considered is the cost or profit to be realized by Westinghouse if reprocessing had been available compared with the cost of storage as an alternative to that method of disposal of the spent fuel. Under this scenario, a method of performance under which Westinghouse would have netted just less than twenty million dollars is to be compared with an alternative which would have burdened Westinghouse with a loss of well over eighty million dollars. This, in our opinion, is the proper form of analysis in determining whether the cost of the supposed alternative is \"excessive\" within the meaning of the impossibility/impracticability doctrine. Under this analysis, it is obvious that the alleged alternative represents an unreasonable and excessive cost to Westinghouse. We, therefore, have no difficulty in holding that as a matter of law the promise of future storage in this case is not a reasonable alternative and that Westinghouse has established its right to be excused from performance of the obligation of disposal of the spent fuel under the defense of impossibility/impracticability. The separateness of the three parts of the contract is illustrated by the fact that this controversy involves only the contract for the disposal of the spent fuel; the controversy has nothing to do with the furnishing either of the plant or of the uranium to be used in the plants (unless the reclaimed uranium resulting from the reprocessing is considered, though Westinghouse's obligation to offer this uranium to Florida at the fixed price is not clear).\n\nThere is another reason for concluding that the cost of this promised alternative is too different in character to qualify as damages reasonable in an action for breach of contract and too \"excessive\" to meet the requirements for barring the excuse of impossibility of performance as a reasonable alternative form of performance under Transatlantic Financing and American Trading. This reason was suggested by the district court in its second opinion and is based on the long-established principle stated in Hadley v. Baxendale, 9 Exch. 341, 156 Eng. Rep. 145 (1854), and now incorporated substantially in Section 351 of the Restatement (Second) of Contracts. As phrased in Hadley, the principle is:\n\nWhere two parties have made a contract which one of them has broken, the damages which the other party ought to receive in respect of such breach of contract should be such as may fairly and reasonably be considered either arising naturally; i.e., according to the usual course of things, from such breach of contract itself, or such as may reasonably be supposed to have been in the contemplation of both parties at the time they made the contract as the probable result of the breach.\n\nThis principle has been accepted as controlling in breach of contract cases in both federal and state courts, including those of Florida where this contract was to be performed. T.D.S., Inc. v. Shelby Mutual Ins. Co., 760 F.2d 1520, 1531 n.11 (11th Cir. 1985) (decided under Florida law).\n\nOf course, any costs of obtaining reprocessing elsewhere than from Westinghouse would have been damages arising from a breach \"in the ordinary course of events\" and reasonably foreseeable by the parties. But costs of long-term storage of the spent fuel were not damages that either party to this contract -- either Westinghouse or Florida -- had any reason \"to foresee as a probable result of the breach when the contract was made.\" Moreover, the parties always contemplated that there would be a \"substantial\" profit in disposing of the spent fuel. Storage, on the other hand, offered no opportunity of a profit. As we have already noted, what the parties foresaw \"as a consequence of the breach\" was at the most some decrease in the value of plutonium, with a consequent reduction in the profit of the processor. That was the \"natural\" and \"ordinary course of events.\" Neither party foresaw that reprocessing would be completely unavailable, that the Government's \"implied commitment\" to reprocess would be abandoned, and that, after years of waffling, the Government would impose on all nuclear power operators the requirement that they should pay the Government substantial storage fees for the storage of this spent fuel in a facility that at best will only be available so far in the future that by that time these plants will have completed their operating life. This certainly is not what the parties contemplated or intended when this contract was signed.\n\nWe think the situation in this case fits completely into the requirements stated in both Hadley itself and the Restatement. We are unable to follow the distinction that the district court seeks to make between \"loss\" and \"damage\" and between \"kind\" and \"amount\" of damages as applied to the facts of this case and thereby find Hadley on point here. The question under Hadley was whether the \"kind\" of loss which occurred was one contemplated by the parties when they signed the contract. Unquestionably, loss resulting not from reprocessing but from storage, which neither party foresaw, was not the \"kind\" of loss foreseen by the parties in 1966 as a possible result of the breach of contract. Damages resulting from such a \"kind of loss\" are the damages which are not recoverable under Hadley. This is, therefore, another reason for concluding that the district court incorrectly dismissed the rule in Hadley as applicable in this case.\n\nWe, accordingly, find that the three objections to the plea of impossibility of performance, stated by the district court, are without support in the record. On the other hand, we find the record completely establishes that Westinghouse had proved every element of an impossibility defense as stated by us in Opera Company and the reasons assigned by the district court for finding to the contrary are without any credible support in the record.\n\nVI.\n\nThe determination that Westinghouse has made out its defense of impossibility of performance does not, though, dispose of the case. Since the doctrine is in essence an equitable defense, as the district court in its second opinion recognized, it is necessary that we consider the equities of the parties. The district court did this in its second opinion. It held that it would be equitable to impose this expense of storage on the ratepayers of Florida, who were the great beneficiaries of the Turkey Point nuclear plants. Over the expected life of the plants, the ratepayers would realize a saving in their electric costs of some eight billion dollars, and for the period for which Westinghouse was obligated to dispose of the spent fuel, a saving of just under two billion dollars. It seemed fair to assess the relatively insubstantial costs of storage against these tremendous savings rather than upon Westinghouse which was the victim of the Government's failure to carry out its \"implied commitment.\" The Congress has recognized that such a result is fair and recommended in its report on the 1982 Act that these unforeseen costs should fairly fall on the ratepayers of the utility which enjoyed the benefits of the lower costs of the nuclear plants. Prior to that President Carter had, in his termination of reprocessing and order for the construction of permanent long-term storage for spent fuel, recommended this same result. Moreover, the Florida Public Service Commission has given Florida this form of relief for the 20 years of the plants' expected life because of the unavailability of processing. There is no reason in fairness or justice why Westinghouse should not receive the same consideration and relief as was given Florida by the Commission. And the district court in its second opinion did precisely this.\n\nIn its third opinion, the district court refused to provide that the cost of the storage for the initial ten years of the plants' operation that Westinghouse was obligated to dispose of the Turkey Point fuel should be recovered through a charge against the ratepayers. It sought to justify this result on a short, inconclusive colloquy on the floor of the House during the consideration of the 1982 Act. There was in the colloquy no discussion of any reason to make any distinction between the justice of absolving Florida and not absolving Westinghouse. Both Florida and Westinghouse had intended that the spent fuel would be reprocessed, netting a profit to whichever one did the reprocessing; both had relied on the Government's assurance, which the district court described as an \"implied commitment.\" The equities in favor of Westinghouse are thus the same as those in favor of Florida. We conclude that it is equally fair to impose the costs of storage for the spent fuel discharged during the initial ten-year period of the plants' operation (when Westinghouse was to dispose of the spent fuel) on the ratepayers as it was to impose on them the costs of the twenty-year period during which the obligation of disposal rested on Florida, and we find the district court properly assessed the costs of the storage on the ratepayers for the initial ten-year period under the contract in its second opinion. We agree with the result in this regard reached by the district court in its second opinion which found that, under the undisputed record, the costs of storage for the first ten years of the plants' operation should fall on the ratepayers of Florida.\n\nAccordingly, we hold that Florida is not entitled to recover from Westinghouse the cost of future storage in a Government storage facility, to be hereafter built, for the spent fuel discharged by the Turkey Point nuclear power plants for their initial ten-year period of operations. The judgment of the district court in its third opinion in assessing such costs against Westinghouse is reversed. In reaching this conclusion we are aware that in all probability Florida will be permitted to recover its costs from its ratepayers. This result is consistent with the views expressed by Congress and President Carter. It is also consistent with the judgment of the Florida Public Service Commission with respect to the cost of storage after the initial ten-year period. Since neither Westinghouse nor Florida has appealed the judgment dividing the costs of the reracking between Florida and Westinghouse, that part of the decision and judgment of the district court is affirmed.\n\nAFFIRMED IN PART AND REVERSED IN PART.\n\nDisposition\n\nAFFIRMED IN PART AND REVERSED IN PART.\n\n\u003cspan class=\"fn\"\u003e1. AGNS was a joint subsidiary of Allied Chemical Nuclear Products, Inc. and Gulf Energy and Environmental Systems, Inc. It had filed an application with the Atomic Energy Commission in November, 1968. After AEC review and a public hearing a construction permit was granted by the AEC and construction commenced. In September and October of 1974, hearings were held on the continuation of construction and matters relating to the issuance of an operating license. At the same time AGNS submitted to the Nuclear Regulatory Commission (the successor of AEC) an application for early receipt and early storage of spent fuel. When President Carter issued his order deferring commercial reprocessing, the licensing procedure was terminated. At that time 117 objections by intervenors on environmental grounds to the licensing of the facility had been filed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. This summarization of Westinghouse's defense to the complaint of Florida is taken from the first opinion herein of the district court. Matter of Westinghouse Elec. Corp., Etc., 517 F. Supp. 440, 450 (E.D.Va.1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See 1964 U.S. Code Cong. \u0026 Admin. News, 3109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. For a short account of the Manhattan Project, including a comment that, \"In 1914, H.G. Wells, in a novel, The World Set Free, forecast that this source of energy could be used for both atomic bombs and reactors for peace,\" see Hugh Thomas, Armed Truce, 433 et seq. (Atheneum, 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This program was known generally as the \"Atoms-for-Peace Program.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For a description of the method of generating electric power by atomic energy, see Note, The Use of Generic Rulemaking to Resolve Environmental Issues in Nuclear Power Plant Licensing, 61 Va.L.Rev. 869, 872-73 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See, 1964 U.S. Code News Cong. \u0026 Admin. News, 3112.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The district court, in its third opinion, recognized that there were but two options for the disposal of spent fuel. Thus, it said: \"If spent fuel is not reprocessed, long-term storage appears to be the only alternative. . . .\" 597 F. Supp. at 1468. Gardner, Florida's witness, testified similarly that \"at some point [in the fuel cycle] you have to store it [ i.e., spent fuel] or reprocess it.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Natural Resources, Etc. v. U.S. Nuclear Reg. Comm'n, 222 U.S. App. D.C. 9, 685 F.2d 459, 510 (Edwards, J., concurring in part and dissenting in part) (D.C. Cir. 1982): \"[The Commission] has yet to license a private corporation to build a retrievable surface storage facility, if, indeed, such will ever be built. It has yet to choose a site for its proposed long-term repository. And it has yet to license a commercial reprocessing facility, [since the licensing in 1966 of NFS, the opinion might have said by way of qualification], although it now appears that such will be licensed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Natural Resources Defense Council v. U.S. Nuclear Reg. Comm'n, 539 F.2d 824 (2d Cir. 1976), cert. granted, 430 U.S. 944, 51 L. Ed. 2d 791, 97 S. Ct. 1578 (1977), judgment vacated and case remanded for consideration of mootness, 434 U.S. 1030, 54 L. Ed. 2d 777, 98 S. Ct. 759 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. 1982 U.S. Code Cong. \u0026 Admin. News, 3794.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The phrase \"financial settlement for the materials\" in this announcement referred specifically to the reusable uranium and plutonium in the spent fuel, both of which would be separated and reclaimed in reprocessing. This salvage value of the spent nuclear fuel [ i.e., the reusable uranium and plutonium] was estimated to be greater than the cost of recovery and disposal of the fuel. See, 1980 U.S. Code Cong. \u0026 Adm. News at 6943, where the spent fuel was described as having \"a significant residual value.\" It will be noted that while this initial promise of the Government was to expire by its terms on June 30, 1967, the promise was renewed for an additional three years. Despite these time periods, the district court in its third opinion, correctly opined that \"the principle underlying the earlier policies, i.e. that government would provide the necessary [reprocessing] services if the industry were unable to do so, remained in effect although the policy was not renewed.\" 597 F. Supp. at 1470.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See concurring opinion of Judge Edwards in Natural Resources, Etc. v. U.S. Nuclear Reg. Comm'n, 685 F.2d at 501.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. This agreement thus included two important obligations by the Government: 1. It agreed that it would not undercut private processors by competing with them so long as they offered commercial reprocessing to utilities on reasonable terms; and 2. If the power industry did not supply the reprocessors with sufficient spent fuel for economical operations of the reprocessing facility, it would make available spent fuel from its own facilities for reprocessing commercially by NFS.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See 1970 Report of AEC, p. 92 (App. 835).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. This summarization of the \"generic\" proceeding is a paraphrase of Judge Wilkey's careful statement of the proceedings in his dissent in Natural Resources, Etc. v. U.S. Nuclear Reg. Comm'n, 685 F.2d at 518-19. (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In Natural Resources Defense Council v. U.S. Nuclear Reg. Com'n, 178 U.S. App. D.C. 336, 547 F.2d 633 (D.C. Cir. 1976), reversed in part and remanded in part sub nom. Yankee Nuclear Power Corp. v. Natural Resources Defense Council, Inc., 435 U.S. 519, 55 L. Ed. 2d 460, 98 S. Ct. 1197 (1978), the Court reached much the same conclusion, and, while the Supreme Court reversed the narrow ruling of the Court of Appeals on the procedural issue, it did not reverse the holding below that additional findings were required on the substantive environmental issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The Supreme Court granted certiorari but remanded the case to the Court for consideration of mootness after the several presidential actions later noted, 434 U.S. 1030, 54 L. Ed. 2d 777, 98 S. Ct. 759 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See House Report on the Nuclear Waste Policy Act of 1982, 1982 U.S. Code Cong. \u0026 Admin. News, 3794.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. While reracking on-site provided a temporary method of storage, it did not constitute effective disposal of the spent fuel with its ingredient of plutonium. Plutonium has \"a half-life of 25,000 years\" and because of this, it \"must be isolated from the environment for 250,000 years before it becomes harmless.\" Natural Resources Defense Council, supra, 547 F.2d at 638.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See Natural Resources, Etc. v. U.S. Nuclear Reg. Comm'n, 685 F.2d at 506 (Edwards, J., concurring and dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. It is interesting that the Congress recognized that Federal facilities for reprocessing were \"exempt from licensing by the Nuclear Regulatory Commission,\" this being the thing that had stymied commercial reprocessing. See 1982 U.S. Code Cong. \u0026 Adm. News at 3803.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The background for this statement by the Congress was expressed in the Senate Report on the Low-Level Radioactive Waste Policy Act of 1980 (1982 U.S. Code Cong. \u0026 Admin. News, 3803): [A] bottleneck developed in the nuclear fuel cycle when reprocessing failed as a domestic industry. The private sector was unprepared for large-scale storage of spent nuclear fuel previously supposed to be sent for reprocessing, and the Federal government was unprepared to take the spent fuel for disposal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See testimony of Dr. N. Barrie McLeod as an expert witness on behalf of Florida in its application to the Florida Power Service Commission for authority to charge costs of storage against Florida's ratepayers. Appendix at 768.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Such inconsistency is perhaps understandable in view of the changing conditions in the disposal of spent nuclear fuel over the period of the three opinions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. At another point in its opinion, the district court had found that there was \"abundant evidence that the parties contemplated reprocessing [as the method for disposing of the spent fuel].\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. At the time this opinion was issued, the Act of 1982 providing for future permanent storage in Government-built and Government-owned depositories had not been enacted and there was no available alternative means of performance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Compare this finding with the language of Judge Mulligan in American Trading, quoted supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. This conclusion seems inexplicable in view of other findings of the district court and the undisputed evidence that the spent fuel could not have been removed from the plant site in 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Of course, the Government has not to this date developed storage facilities for spent fuel; in fact, it has yet to identify the site or sites for such storage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. This, again, is the language of Transatlantic Financing, supra, at 315.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. There are two interesting aspects of this language of the district court. First, the \"implied commitment\" of the Government in its 1957 official announcement related to reprocessing. There was nothing in that announcement about storage of the spent fuel; the announcement was confined to reprocessing services. In fact, storage was not an alternative considered by the Government until in the 1970's and then only after the attacks by environmental forces began against reprocessing. Second, earlier in both its first decision and in this opinion the district court declared that there was no \"commitment\" by the Government to provide means for the disposal of spent fuel; in this finding, the district court reached a completely contrary conclusion of an \"implied commitment\" of the Government.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. 18 Williston on Contracts § 1937, p. 33 (Jaeger, 3d ed. 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. 6 Corbin on Contracts, § 1331, p. 360 (1962 ed.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. This is essentially the language of Eastern Air Lines, Inc. v. McDonnell Douglas Corp., 532 F.2d 957, 991 (5th Cir. 1976), a case cited with approval by the district court in its several opinions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. 18 Williston on Contracts, § 1931, p. 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. We have looked both to the third opinion and the first opinion for the district court's factual findings, since, in its third opinion, the district court reaffirmed its findings of fact (except such as had occurred since that decision in 1981) in its first opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Actually, this fact was most conclusively developed by the district court itself in the testimony of one of Florida's own witnesses. In the examination of Florida's head of the department of nuclear analysis, the testimony turned to a contract executed in the late 60's after the contract for the Turkey Point plants had been executed. This contract was between Florida and Combustion Engineering involving the construction of another nuclear power plant. In this contract, it was agreed that Combustion would purchase the spent fuel discharged from the new plants' reactors. The district court addressed this question to the witness and elicited the quoted answer: THE COURT: Then your understanding, then, in simple language, was that Combustion was to purchase your spent fuel? THE WITNESS: That's right. THE COURT: And remove it? THE WITNESS: That's right. At a firm price. THE COURT: Is it fair to say that any reasonable person, even reasonably knowledgeable about the business, would understand that they intended to reprocess it? You didn't expect them to keep the fuel on their dresser, did you, as a souvenir? They must have thought there was some commercial value to it, is that a fair statement? THE WITNESS: Certainly when they signed the contract they did. Later, the district court directed this question to the same Florida witness and received this response: THE COURT: Anybody with any sense knows that Combustion wasn't going to purchase your spent fuel just as a nice guy to get it out of there. You knew that they intended to reprocess it. Don't you think everybody in the company knew that that's what they intended? You might not have agreed that they were going to make a lot of money out of it, but they must have thought so, right? THE WITNESS: Yes, sir. THE COURT: And is it just as fair to say that the same situation was just as true with Westinghouse, that everybody understood that that's what Westinghouse intended to do, was to reprocess it? THE WITNESS: Yes. But whether that reprocessing resulted in positive or -- you know -- that was a very complicated situation. And I'm sure that if reprocessing costs go up and uranium costs go down, they wouldn't reprocess. It wouldn't be economical.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. 517 F. Supp. at 453. The district court said at one time in its opinion: \"Indeed, reprocessing was not in actuality the contemplated 'means' of performance at all; it was the contemplated disposition of the spent fuel after performance. The means of performance, of removal, were left unspecified.\" (Court's Italics) Ibid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. 597 F. Supp. at 1468.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. This is a paraphrase of the ruling in American Trading \u0026 Production Co. v. Shell International Marine, Ltd., 453 F.2d 939 (2d Cir. 1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. There is no basis in this record for likening reprocessing to the \"revolutionary\" computer system which had never been developed but existed only as an idea in the promoter's mind, discussed in Wegematic, a case which the district court cites as analogous to this case. Everyone \"knowledgeable in the industry\" assumed, based on actual experience, that reprocessing, both governmental and private, had been proven as a viable industry under conditions as they existed in 1966.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. It is interesting that in President Reagan's 1981 \"memorandum\" order, as quoted earlier, providing for resumption of reprocessing, he listed as one of the reasons for resuming reprocessing of spent fuel from private electric plants was the need of the Government to obtain plutonium from private sources. This memorandum is quoted in full in the concurring and dissenting opinion of Judge Edwards in Natural Resources, Etc. v. United States Nuclear Reg. Comm'n, 222 U.S. App. D.C. 9, 685 F.2d 459, 509-10 (D.C. Cir. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. In its very first opinion, the district court recognized that, without a means of disposal of the spent fuel discharged by its nuclear reactors, nuclear power plants could not be operated successfully. There it held that in the absence of reprocessing or storage, the \"Turkey Point plants will be shut down by the year 1986 as to one plant, and 1988 as to the other.\" 517 F. Supp. at 450.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The testimony of this point is given in footnote 38, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. In its first decision, the district court appears to have accepted this reasoning. Thus, it said: Under the option which it exercised [Option C], if spent fuel were not reprocessed, Florida ran little risk, and though the parties contemplated that Westinghouse would remove the spent fuel and reprocess it, the contract by its terms requires Westinghouse to \"dispose of it as Westinghouse sees fit.\" 517 F. Supp. at 445-46. By this statement, the district court clearly recognized that reprocessing was the intended method of disposal of both parties. It seems to dismiss intention as unimportant; that the contract is absolute and admits of no qualification. This reasoning would deny the established defense that the spent fuel had to be disposed of after 1985 for another twenty years and that the later period was Florida's obligation of disposal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. 517 F. Supp. at 444.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Appendix, p. 514.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. While recognizing that the Government had actively encouraged the electric industry about reprocessing and had sought to induce the industry to construct plants, it had done so in order \"to generate sufficient experience to enable AEC to evaluate whether or not nuclear power had practical value in this application.\" 597 F. Supp. at 1471. We find no evidence to support this supposition of Government intent nor are we persuaded that the AEC was engaged in duplicity in encouraging industry in this regard, or that it entertained doubt about reprocessing, either by it or by commercial interests. The Government, in giving its 1957 assurance, was acting on its assumption, joined in by all knowledgeable in the nuclear industry, that reprocessing of the spent fuel of the nuclear electric plants was practical and feasible both in government plants and in commercial plants which it was confident would arise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. This assurance was renewed several times, the last being in 1970. But, as the district court correctly observed, this was a continuing assurance of the Government. This it said was so because \"the principle underlying the earlier policies, i.e. that government would provide the necessary sources if the industry were unable to do so, remained in effect although the policy was not renewed.\" 597 F.2d at 1470. This ruling accords with the Government's own statement of its assurance as it put it in its contract with NFS as quoted in the AEC Report for 1963 at 54. There the Commission agreed to deliver to NFS \"certain of the private fuels now on hand or expected to be received by the AEC pursuant to its March 12, 1957, Federal Register notice offering to accept irradiated fuels from licensees until June 30, 1967, or until private processing services are available at reasonable charges \" (Italics added), if private utilities did not supply NFS sufficient fuel for reprocessing to permit reasonable operations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The district court did charge Westinghouse with liability for one-half of the cost of reprocessing on the ground that Westinghouse could have disposed timely without the necessity of re-racking if it had been \"zealous.\" We deal with this point in the next section of this opinion.\u003c/span\u003e\n\n",
    "body_length": 173450,
    "citedas": [
      "826 F.2d 239"
    ],
    "attorneys": "Ira M. Millstein, Richard J. Davis, Richard A. Rothman, Weil, Gotshal \u0026 Manges, John S. Battle, Jr., McGuire, Woods \u0026 Battle on brief, for Appellant. Alvin B. Davis, Nancy E. Swerdlow, Steel, Hector \u0026 Davis, on brief, for Appellee.",
    "category": [
      "252"
    ],
    "judges": "Russell and Widener, Circuit Judges, and Butzner, Senior Circuit Judge.",
    "citation_count": 13
  }
}
