{
  "id": "Es_1YWYBTlTomsSBPDfs",
  "document": {
    "title": "Hennigan v. State",
    "full_title": "JOSEPH M. HENNIGAN, JR. (DEFENDANT), v. THE STATE OF WYOMING (PLAINTIFF).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1987-11-16T00:00:00.000Z",
    "docket": "No. 86-82.",
    "body": "The primary focus of Joseph Hennigan's contentions in this appeal is his indictment of the institution of the grand jury. His complaints are directed generally to the function of the grand jury in Wyoming and specifically to claimed defects that are present in his case. His claims encompass assertions that he was denied due process of law and the equal protection of the laws. He also argues that his conviction should be set aside because the grand jury was not properly impaneled since there was no specific finding of necessity for calling a grand jury; the indictments are fatally defective because the grand jury foreman did not personally endorse the words \"A True Bill\" upon the indictment; and the proceedings manifest the lack of any indicia of reliability in determining probable cause. We conclude that the institution of the grand jury has been maintained in Wyoming as a proper prosecutorial procedure; there is no constitutional defect attaching to its use as it has been structured; and no error occurred in connection with the charges brought against Hennigan by indictment. The judgment and sentence with respect to each of the several counts brought against him is affirmed.\n\nIn his brief, Hennigan articulates the issues presented in this way:\n\n\"I. Whether the Appellant has been denied due process and equal protection of the law by the actions of the prosecution in deliberately avoiding the preliminary hearing and obtaining indictments without observing minimal standards of fundamental fairness.\n\n\"II. Whether the current Grand Jury was improperly impaneled under Section 7-5-102 in that there was no necessity for said body, requiring the dissolution of the panel and the dismissal of the indictments.\n\n\"III. Whether the indictments in these cases are fatally defective for failure to conform to the statutory requirement that the foreman endorse the words `A True Bill' upon each indictment.\n\n\"IV. Whether the indictments should be dismissed because the conduct of the Grand Jury lacks any indicia of reliability in the assessment of probable cause.\"\n\nIn the Brief of Appellee, the State of Wyoming restates and reorders the issues in this way:\n\n\"I. Did appellant's indictment by the grand jury deny him due process and equal protection?\n\n\"II. Was there probable cause for the grand jury to return the indictments against the appellant?\n\n\"III. Was the indictment of appellant fatally defective because the grand jury foreman did not endorse `A True Bill' on the indictment in his own handwriting?\n\n\"IV. Was the grand jury properly impaneled?\"\n\nHennigan was charged by indictment with four counts of delivery of marihuana in violation of §§ 35-7-1031(a)(ii) and 35-7-1014(d)(xiii), W.S. 1977. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e An arrest warrant was issued premised upon the indictment, and Hennigan, following his arrest, was arraigned on each of these counts. He entered a plea of not guilty as to each count. Prior to trial, Hennigan and a number of other individuals who had been indicted by the same grand jury presented a common motion to dismiss the indictments against them and dissolve the grand jury. That motion asserted the same contentions set forth in Hennigan's brief in this court, and it was denied following a hearing by the district court. At the jury trial which followed, Hennigan was found guilty on each of the four counts, and he then was sentenced to a term of not less than 18 months nor more than 36 months on each count with those sentences to run concurrently. He was given credit against both the minimum and maximum terms for 216 days that he spent in the Campbell County jail in pre-trial confinement. Hennigan also was fined $750 on each of the four counts; the $25.00 surcharge for victims of crimes was imposed as to each count; and he was ordered to reimburse the State of Wyoming and Campbell County for the services of his court-appointed attorney in the amount of $1,000.\n\nHennigan does not attack the proceedings at trial nor the sufficiency of the evidence upon which the jury found him guilty beyond a reasonable doubt. His only claims of error in this case address the grand jury proceedings. The identical issues are being presented by other individuals who were charged by the same grand jury, found guilty by a petit jury, and now have appealed to this court. Because the contentions relating to the grand jury proceedings are identical in these several cases, we will treat with them definitively in this decision.\n\nHennigan's contentions and arguments are heavily weighted toward a call for reform. Essentially philosophic in tone, they do not afford optimum assistance in our effort to identify incidents that can be characterized as errors of law. Walker v. Karpan, Wyo., 726 P.2d 82 (1986). Hennigan's arguments, instead, manifest an effort to explain the errors that could be present if the extant rules were as Hennigan wishes them to be. This presentation broaches upon a failure to support the issues by cogent argument or pertinent authority which might justify a refusal to consider them. Newton v. State, Wyo., 698 P.2d 1149 (1985); Ostrowski v. State, Wyo., 665 P.2d 471 (1983); Stolldorf v. Stolldorf, Wyo., 384 P.2d 969 (1963).\n\nHennigan relies upon general statements of the law, arguments in favor of reform by various individuals and the American Bar Association, and a dissenting position by a justice of the Supreme Court of the United States. He has failed to cite any pertinent authority which is not distinguishable, and we may assume that such authority does not exist. Taylor v. State, Wyo., 658 P.2d 1297 (1983); Deeter v. State, Wyo., 500 P.2d 68 (1972). Given the essentially philosophic, rather than legal, debate still we shall address in detail Hennigan's claims of error.\n\nIn doing so, we turn first to the claimed constitutional defects. Hennigan's arguments about deprivation of due process and equal protection weave together and certainly are closely related. We address initially the claim that the utilization of the grand jury in this instance resulted in a deprivation of due process of law. Because of the rather free-wheeling nature of Hennigan's claims, it perhaps is worthwhile to place the due process and equal protection concepts in the context of the pertinent constitutional measures. In Amendment Fourteen of the Constitution of the United States, the following language is found:\n\n\"* * * No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\"\n\nIn the Constitution of the State of Wyoming, we find Art. 1, § 6:\n\n\"No person shall be deprived of life, liberty or property without due process of law.\"\n\nInvocation of these constitutional protections depends upon some lack of due process or the denial of equal protection in connection with the event which had the effect of depriving Hennigan of his liberty or property. That event was the judgment and sentence entered upon the finding of guilty by the jury which tried his case. Hennigan does not discern any distinction between the conviction in the trial court and the institution of the charges upon which that conviction was premised. In our judgment that distinction makes a substantial difference.\n\nThe distinction just alluded to requires that we analyze the demand for due process which attaches to the temporary invasion of an individual's liberty arising out of a determination that he should be held to answer a criminal charge in a trial court. An examination from this perspective teaches that the constitutional requirement for indictment by a grand jury found in Art. 1, § 13 of the Constitution of the State of Wyoming \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and the Fifth Amendment to the Constitution of the United States \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e was assumed by the drafters to be essential to the protection of citizens from overreaching by government. The purpose of the grand jury presentment or indictment was to assure that there was probable cause to present an individual before a petit jury for trial. The grand jury proceeding was perceived as the standard of due process which was part of the law of the land at common law. Historical exposition of the concept is set forth in Hopkinson v. State, Wyo., 664 P.2d 43, cert. denied 464 U.S. 908, 104 S.Ct. 262, 78 L.Ed.2d 246 (1983); In re State v. Boulter, 5 Wyo. 329, 39 P. 883 (1895); Ex Parte Bain, 121 U.S. 1, 7 S.Ct. 781, 30 L.Ed. 849 (1887); Hurtado v. People of State of California, 110 U.S. 516, 4 S.Ct. 111, 28 L.Ed. 232 (1884); United States v. Smyth, 104 F. Supp. 283 (N.D.Cal. 1952); L. Clark, The Grand Jury: The Use and Abuse of Political Power (1975); Campbell, Eliminate the Grand Jury, 64 J.Crim.L. \u0026 Criminology 174 (1973); J. Stephen, 1 History Criminal Law of England (1893); 38 C.J.S. Grand Juries §§ 2-47 (1943); 38 Am.Jur.2d Grand Jury §§ 1-41 (1968).\n\nHistorically, the debate has been whether alternative procedures, apparently recognized by constitutional provisions similar to those found in Art. 1, § 13 of the Constitution of the State of Wyoming, afforded the same measure of due process to the accused as did the grand jury. In Hurtado v. People of State of California, supra, the decision of the State of California to substitute charging by information for a grand jury indictment was challenged as contrary to the due process clause found in the Fourteenth Amendment to the Constitution of the United States. The United States Supreme Court decided that indictment by a grand jury is not the exclusive method for affording due process in a criminal case and upheld the determination of the California legislature to permit probable cause to be found by a magistrate as affording due process to an accused. Subsequently, the court recognized that the determination of probable cause necessary to bring a person to trial could be made by a prosecuting attorney under some circumstances and that this also is consistent with due process. Beck v. Washington, 369 U.S. 541, 82 S.Ct. 955, 8 L.Ed.2d 98, reh. denied 370 U.S. 965, 82 S.Ct. 1575, 8 L.Ed.2d 834 (1962); Ocampo v. United States, 234 U.S. 91, 34 S.Ct. 712, 58 L.Ed. 1231 (1914); Lem Woon v. State of Oregon, 229 U.S. 586, 33 S.Ct. 783, 57 L.Ed. 1340 (1913).\n\nIn Gerstein v. Pugh, 420 U.S. 103, 95 S.Ct. 854, 43 L.Ed.2d 54 (1975), the Supreme Court addressed due process in the context of a procedure for determining probable cause, which would justify incarceration prior to trial, and required such a determination to be made in a judicial proceeding, which would include a grand jury. It is pertinent, however, to emphasize how that limitation was articulated.\n\n\"In holding that the prosecutor's assessment of probable cause is not sufficient alone to justify restraint of liberty pending trial, we do not imply that the accused is entitled to judicial oversight or review of the decision to prosecute. Instead, we adhere to the Court's prior holding that a judicial hearing is not a prerequisite to prosecution by information. Nor do we retreat from the established rule that illegal arrest or detention does not void a subsequent conviction.\" Gerstein v. Pugh, supra, 420 U.S. at 118-119, 95 S.Ct. at 865. (Citations omitted.)\n\nThe members of the constitutional convention in Wyoming not only retained the grand jury but provided that the legislature could adjust that system. In addition to Art. 1, § 13 of the Constitution of the State of Wyoming, quoted in footnote 2, Art. 1, § 9 of the Constitution of the State of Wyoming provides:\n\n\"* * * Hereafter a grand jury may consist of twelve men, any nine of whom concurring may find an indictment, but the legislature may change, regulate or abolish the grand jury system.\"\n\nSince 1895, the statutes in Wyoming have provided:\n\n\"All crimes, misdemeanors and offenses may be prosecuted in the court having jurisdiction thereof, either by indictment as hereinafter provided, or by information.\" Section 7-6-101, W.S. 1977.\n\nThe statutory provision has been superseded by substantially similar language found in Rule 9, W.R.Cr.P.\n\nThe procedure for prosecution by information first was challenged in 1891, and this court held that the legislature did have the authority to provide an alternative method for determining probable cause. In re Wright, 3 Wyo. 478, 27 P. 565 (1891). Subsequently, the court concluded that the legislature could provide for a determination of probable cause by the prosecutor, at least within certain limited periods of time. State v. Spears, 76 Wyo. 82, 300 P.2d 551 (1956); State v. Vines, 49 Wyo. 212, 54 P.2d 826 (1936); State v. Tobin, 31 Wyo. 355, 226 P. 681 (1924); Ackerman v. State, 7 Wyo. 504, 54 P. 228 (1898); State v. Sureties of Krohne, 4 Wyo. 347, 34 P. 3 (1893). This court has indicated some skepticism with respect to the procedure involving only the prosecutor. Nevertheless, the rule is clear that a determination as to when a preliminary hearing is necessary is within the prerogative of the legislature, and because the proceeding was unknown at common law, \"[i]n the absence of a statute, no preliminary examination is necessary * * *.\" State v. Tobin, supra, 31 Wyo. at 368, 226 P. at 685; see also Montez v. State, Wyo., 670 P.2d 694 (1983).\n\nIn considering the constitutionality of a determination of probable cause by a non-lawyer justice of the peace, in Thomas v. Justice Court of Washakie County, Wyo., 538 P.2d 42 (1975), we said that, in accordance with Gerstein v. Pugh, supra, the protection of an individual's Fifth Amendment rights against unfounded invasions of liberty and property requires a determination of probable cause by someone other than the prosecutor. We carefully noted, however, that a judicial hearing is not a prerequisite to prosecution by information, stating that \"`although a suspect who is presently detained may challenge the probable cause for that confinement, a conviction will not be vacated on the ground that the defendant was detained pending trial without a determination of probable cause.'\" Thomas v. Justice Court of Washakie County, supra, at 49, quoting from Gerstein v. Pugh, supra, 420 U.S. at 119, 95 S.Ct. at 865, 866.\n\nWe do not understand this history as justifying a claim in Wyoming that, in the charging stages of a criminal case, due process can be afforded only by preliminary examination. Conceding that there are perceived advantages to a preliminary hearing, (In re Wright, supra; State v. Clark, 291 Or. 231, 630 P.2d 810, cert. denied 454 U.S. 1084, 102 S.Ct. 640, 70 L.Ed.2d 619 (1981)), which largely arise out of its adversarial nature (See Coleman v. Alabama, 399 U.S. 1, 90 S.Ct. 1999, 26 L.Ed.2d 387 (1970)), we are persuaded that in Wyoming the constitutional authority to declare how probable cause may be determined and whether a preliminary hearing is required has been granted to the legislature. E.g., Montez v. State, supra; Tobin v. State, supra. The legislature has retained the grand jury as one method for initiating criminal prosecutions and has provided for the filing of a complaint followed by a preliminary examination as another way. Our rules of criminal procedure recognize the determination of probable cause by either a grand jury or a magistrate after a preliminary examination. Rule 9, W.R.Cr.P.\n\nHennigan's approach, and that of the others making the same claims, seeks to elevate the alternative procedure for prosecuting criminal cases, which first had to be tested in a due process context against the grand jury proceeding, to the standard for due process. The argument that those proceedings, which have been tested for their constitutional sufficiency against grand jury proceedings, now set the standard for due process is indeed circuitous. We are not persuaded to adopt it in the absence of any mandatory authority.\n\nHennigan claims that, even though the institution of the grand jury may survive a due process challenge, the utilization of the grand jury in his instance resulted in a denial of due process. The only authority Hennigan has presented to support his position is a number of proposals relating to the grand jury promulgated by the American Bar Association (ABA). The cases which Hennigan cites from other jurisdictions are premised upon statutory procedures different from those adopted for Wyoming, and the result in those cases is controlled by the difference in the statutes. The Supreme Court of the United States, in a trial context, has said \"`the failure to observe that fundamental fairness essential to the very concept of justice'\" is a denial of due process. Lisenba v. People of State of California, 314 U.S. 219, 236, 62 S.Ct. 280, 290, 86 L.Ed. 166 (1941), quoted in Munoz v. Maschner, Wyo., 590 P.2d 1352, 1355 (1979). This court, however, has adopted the principle that it is incumbent upon the appellant to demonstrate how the procedures which were utilized denied him the process which is his due. In State v. Spears, supra, 300 P.2d at 557, we said, quoting Adams v. United States ex rel. McCann, 317 U.S. 269, 281, 63 S.Ct. 236, 242, 87 L.Ed. 268, 143 A.L.R. 435 (1942):\n\n\"`* * * [I]t is not asking too much that the burden of showing essential unfairness be sustained by him who claims such injustice and seeks to have the result set aside, and that it be sustained not as a matter of speculation but as a demonstrable reality. * * *'\"\n\nIn espousing the principles promulgated by the ABA, Hennigan first argues that:\n\n\"The defendants were given no notice or opportunity to be heard even though there was no indication that such notification would result in a flight, endanger other persons or obstruct justice.\"\n\nIt is essential to due process that one be afforded notice and a meaningful opportunity to be heard before a court of competent jurisdiction. Hall v. Hall, Wyo., 708 P.2d 416 (1985); Hopkinson v. State, supra. Due process does not incorporate a right to be heard at every stage of the proceeding, however, including a non-adversarial proceeding such as the grand jury, any more than it requires that a person be offered two opportunities for trial, one at the preliminary examination and another before the petit jury. Wilson v. State, Wyo., 655 P.2d 1246 (1982); see also, Hall v. Hall, supra.\n\nA grand jury proceeding does not result in a determination of guilt or innocence. Thomas v. Justice Court of Washakie County, supra; United States v. Calandra, 414 U.S. 338, 94 S.Ct. 613, 38 L.Ed.2d 561 (1974); Silverthorne v. United States, 400 F.2d 627 (9th Cir. 1968), cert. denied on appeal after remand 400 U.S. 1022, 91 S.Ct. 585, 27 L.Ed.2d 633 (1971).\n\n\"* * * An indictment returned by a legally constituted and unbiased grand jury, like an information drawn by the prosecutor, if valid on its face is [only] enough to call for trial of the charge on the merits.\" Costello v. United States, 350 U.S. 359, 363, 76 S.Ct. 406, 409, 100 L.Ed. 397, reh. denied 351 U.S. 904, 76 S.Ct. 692, 100 L.Ed.2d 1440 (1956).\n\nThis limited effect does not require the full panoply of Sixth Amendment protections that are perceived necessary in a proceeding substituted for the grand jury proceeding, the preliminary hearing, in order to afford due process. As we have noted above, that necessity attaches because of the adversarial nature of the preliminary examination, and we have been unable to discover any precedent which requires that an accused be afforded notice and an opportunity to be heard before a grand jury in order to protect his constitutional right to due process.\n\nStill relying on the principles espoused by the ABA, Hennigan contends:\n\n\"The grand jury was not fully instructed as to its duties and powers, particularly as to the definition of probable cause, its ability to call its own witnesses and the right to seek additional legal counsel from the court.\n\n\"The grand jury was not properly instructed as to the elements of the crime considered by it.\"\n\nPrior to appeal, Hennigan was not successful in his effort to obtain disclosure of the grand jury proceedings in the trial court. Consequently, he was unable to demonstrate what instructions were given to the grand jury. He urged this court to require disclosure of that record, but we did not find disclosure to be necessary. Subsequently, while the case was pending on appeal, the trial court entered an order authorizing the disclosure, and two additional volumes of a record of the grand jury proceedings, a transcript of the hearing on a motion to quash indictments, and 38 volumes of the transcript of the testimony of various witnesses were forwarded to this court. None of the transcribed testimony is material in Hennigan's case, and only the Motion to Convene Grand Jury, the Order Convening Grand Jury, Instructions to the Grand Jury, Campbell County Grand Jury Report and the transcript of the hearing on the Motion to Quash Indictments and Dismiss the Grand Jury have any significance in this case.\n\nIn light of the new material, we address Hennigan's parallel contentions about instructions in the context of the statutory procedures for a grand jury. Sections 7-5-203 through 7-5-205, W.S. 1977, set forth the required charges with respect to grand juries in Wyoming, and they provide:\n\n\"§ 7-5-203. Oath of foreman.\n\n\"When the foreman shall be appointed, an oath or affirmation shall be administered to him in the following words: `You, as foreman of this grand inquest, do solemnly swear (or affirm) that you will diligently inquire and true presentment make all of such matters and things as shall be given you in charge, or otherwise come to your knowledge touching the present service. The counsel of the state, your own and your fellows you shall keep secret, unless called on in a court of justice to make disclosures. You shall present no person through malice, hatred or ill will, nor shall you leave any person unpresented through fear, favor or affection, or for any reward or hope thereof; but in all your presentments you shall present the truth, the whole truth and nothing but the truth, according to the best of your skill and understanding.'\n\n\"§ 7-5-204. Oath of jurors.\n\n\"Thereupon the following oath (or affirmation) shall be administered to the other grand jurors: `The same oath which A.B., your foreman, hath now taken before you on his part, you and each of you shall well and truly observe and keep your respective parts.'\n\n\"§ 7-5-205. To be charged by judge; jurisdiction.\n\n\"The grand jury after being sworn, shall be charged as to their duty by the judge, who shall call their attention particularly to the obligation of secrecy which their oaths impose, and to such offenses as he is by law required to specially charge. After the charge of the court, the grand jury shall retire with the officer appointed to attend to them, and shall proceed to inquire of, and present all offenses whatever committed within the limits of the county in and for which they were impaneled and sworn or affirmed.\"\n\nContrary to Hennigan's assertions that these statutory provisions were not complied with, a presumption of regularity controls:\n\n\"* * * It must be presumed that the grand jury followed the court's instructions as to its powers, duties and obligations and that each grand juror fully lived up to and observed his solemn oath. Indeed there is a strong presumption of regularity accorded to the deliberations and findings of grand juries.\" United States v. Kahaner, 204 F. Supp. 921, 923 (S.D.N.Y. 1962).\n\nThe supplementary material, in part, demonstrates compliance with the statutory requirements and, in part, validates the presumption of regularity. The required oaths encompass the general instructions with respect to a grand jury, and we must assume that these oaths were administered. The validity of this presumption of regularity is substantiated in this case by the Instructions to the Grand Jury which were forwarded informally as part of the record which the district judge ordered to be disclosed. That document, which is quoted in part in the dissenting opinion, demonstrates compliance with §§ 7-5-203, 7-5-204 and 7-5-205, W.S. 1977, including particularly admonishments as to fairness and skepticism with respect to hearsay testimony. It also alludes to the oaths presumably administered in accordance with the statute. The Campbell County Grand Jury Report manifests familiarity with the elements of the offenses in issue in this case and the evidence needed to establish those elements.\n\nFurthermore, the Instructions to the Grand Jury encompass the assistance of § 7-5-206, W.S. 1977, which provides:\n\n\"§ 7-5-206. Right of prosecuting attorney to appear before jury; no one but jury to be present when jury votes, etc. \"The prosecuting attorney, or the assistant prosecuting attorney, shall be allowed at all times to appear before the grand jury for the purpose of giving information relative to any matter cognizable by them, or giving them advice upon any legal matter when they may require it; and he may be permitted to interrogate witnesses before them when they or he shall deem it necessary; but no such attorney, nor any other person shall be permitted to be present during the expression of their views, or the giving of their votes on any matter before them.\"\n\nThe several counts in the indictment encompass the appropriate elements for the offenses charged, and, whatever instruction may have been given to the grand jury, it is apparent that its members did understand the elements of these offenses. We conclude that the presumption of regularity which attaches; the requirements for administering oaths in the Wyoming statutes; and the correctness of the indictment itself overcome the claims of Hennigan with respect to these aspects of the ABA principles.\n\nHennigan's next claim relying upon the ABA principles is:\n\n\"The grand jury was permitted to hear only hearsay offered by a deputy sheriff who recited from reports of the undercover agent.\"\n\nHennigan concedes that he is not certain that this occurred, but we will assume that he is correct and that the grand jury's determination of probable cause was based exclusively on hearsay.\n\nRule 7(b), W.R.Cr.P., states in pertinent part:\n\n\"(b) Probable cause finding. — * * * The finding of probable cause may be based upon hearsay evidence in whole or in part. * * *\" (Emphasis added.)\n\nHennigan has not cited, and we have not discovered, any case which has held that the exclusive use of hearsay is a violation of due process. Conversely, the general rule, in the absence of some inhibiting statute or rule, is that hearsay is admissible in grand jury proceedings without limitation, and the determination of probable cause may rest exclusively on such evidence. Cases cited in Annot., 37 A.L.R.3d 612 (1971); see also, Wilson v. State, supra. We have no rules or statutes similar to those found in other states and the federal courts which eliminate or restrict the use of hearsay in grand jury proceedings or which require disclosure by the prosecutor that hearsay evidence is being given and provide that the grand jurors may require that the declarant be called. See United States v. Arcuri, 282 F. Supp. 347, aff'd 405 F.2d 691 (2nd Cir. 1968), cert. denied 395 U.S. 913, 89 S.Ct. 1760, 23 L.Ed.2d 227 (1969); cases cited in Annot. 37 A.L.R.3d at 626-630 (1971). Therefore, we conclude that it is proper to follow the general rule not the exception. See State v. Bauman, 125 Ariz. 404, 610 P.2d 38 (1980).\n\nHennigan also relies upon a claimed practice of Wyoming judges to weigh the reliability of the proffered hearsay and require the declarant to be produced if they find the hearsay questionable. If this does occur, it is not necessary nor constitutionally required. In our judgment, the disclosure at trial of unreliable evidence is a sufficient control upon the prosecutor in the presentation of cases before a grand jury. Questions of credibility and weight of the evidence are appropriately determined at trial, and there is no due process requirement for a determination of these issues in the course of determining probable cause. Wilson v. State, supra; Costello v. United States, supra. There is no more a constitutional limitation upon the use of hearsay in grand jury proceedings than there is a statutory limitation in Wyoming. See Costello v. United States, supra.\n\nHennigan's next argument is:\n\n\"The grand jury proceedings were not recorded, thereby preventing a review of their sufficiency and propriety.\"\n\nThe fallacy in Hennigan's argument, in this regard, is that it assumes a requirement that there be a review of grand jury proceedings for sufficiency and propriety. The general rule is that grand jury testimony need not be recorded in the absence of a procedural rule or statute which requires recording, and the failure to do so does not violate due process. See cases cited in Annot. 25 A.L.R.Fed. 723 (1975). While the federal rules have been amended to require that grand jury testimony be recorded, Rule 6(e), F.R.Cr.P. (1979), and the same situation is true in many states, we have found no case holding that the failure to do so is a violation of due process. The appropriate response to this contention by Hennigan is summarized in United States v. Martel, 17 F.R.D. 326, 329 (N.D.N.Y. 1954), appeal dismissed sub nom United States v. Caiola, 222 F.2d 369 (2nd Cir. 1955):\n\n\"The moving parties' argument is one that may better be addressed to Congress, which has in the past and may in the future legislate as to the subject matter involved in this motion. The need for stenographic reports of grand jury proceedings has been the subject of discussion. The requirement for same must be based in the statute. This court may not legislate.\" (Citations omitted.)\n\nRule 18, W.R.Cr.P., permits the inspection and copying of the transcript of grand jury testimony of the defendant or the testimony of a witness after he has testified, if the testimony was recorded. This provision satisfies any due process requirements and is in accord with what other states and the federal courts have required in determining when inspection of grand jury testimony should be permitted. Hennigan made no effort to demonstrate any particular need to obtain inspection of the grand jury minutes. Bary v. United States, 292 F.2d 53 (10th Cir. 1961); cases cited in Annot., 20 A.L.R.3d 7 (1968 \u0026 Supp. 1986). Even under the amended federal rules, the defendant need not be given access to grand jury testimony for the mere purpose of a fishing expedition or an effort to obtain discovery. See cases cited in Annot., 20 A.L.R.3d 7 (1968) and 3 A.L.R.Fed. 29 (1971).\n\nHennigan also urges that the failure to record the proceedings and the failure to permit him to inspect any proceedings which were recorded denied him a right of discovery afforded through preliminary hearing. As we discuss later, his argument is without merit. A preliminary hearing is not conducted for purposes of discovery but is designed to determine probable cause. Wilson v. State, supra. We understand that the preliminary hearing may provide some opportunity for discovery, but that is not mandated by the constitutional requirement of due process, statute or rule. Weddle v. State, Wyo., 621 P.2d 231 (1980).\n\nThere is also an inconsistency in Hennigan's position. He claims that the failure to make a record of the grand jury proceedings has deprived him of the right to discovery in almost the same breath in which he claims that the indictment was based wholly on hearsay. Both could not be true. Certainly, the acceptance of the assumption that this indictment was based upon hearsay testimony makes clear the proposition that no prejudice could attach with respect to the failure to report the proceedings, as there would have been no statement available of a witness who testified at the trial. Instead, it would appear that had he pursued discovery from the information in the prosecutor's file, Hennigan would have obtained substantially the same information that was available to the grand jury.\n\nTo a similar contention, Judge Learned Hand commented:\n\n\"* * * Under our criminal procedure the accused has every advantage. While the prosecution is held rigidly to the charge, he need not disclose the barest outline of his defense. He is immune from question or comment on his silence; he cannot be convicted when there is at least fair doubt in the minds of any one of the twelve. Why in addition he should in advance have the whole evidence against him to pick over at his leisure, and make his defense, fairly or foully, I have never been able to see. No doubt grand juries err and indictments are calamities to honest men, but we must work with human beings and we can correct such errors only at too large a price. Our dangers do not lie in too little tenderness to the accused. Our procedure has been haunted by the ghost of the innocent man convicted. It is an unreal dream. What we need to fear is the archaic formalism and the watery sentiment that obstructs, delays, and defeats the prosecution of crime.\" United States v. Garsson, 291 F. 646, 649 (D.C.N.Y. 1923).\n\nThe discovery rules for criminal cases in Wyoming satisfy the demands for due process. Hennigan was entitled to pursue the discovery available under such rules, but the fact that he was not permitted to expand upon those rights by being afforded a preliminary examination does not deprive him of due process. He is not entitled to more than the rules provide.\n\nThis contention, in addition to the assertion of deprivation of discovery, assumes that Hennigan would be entitled to a review of the grand jury proceedings for their sufficiency and propriety. We have found no case in which a court has held it to be proper, absent statutory authority, to review the sufficiency of the evidence in a grand jury proceeding, and several precedents advise against such practice. E.g., Costello v. United States, supra; State v. Jacobson, 22 Ariz. App. 128, 524 P.2d 962 (1974); State v. Reese, 91 N.M. 76, 570 P.2d 614 (1977).\n\nIn Wyoming, the legislature specifically has restricted the court's authority to review a grand jury proceeding. Section 1-27-125, W.S. 1977, a part of the statutory fabric of the grand jury in Wyoming since 1876, provides in pertinent part:\n\n\"Habeas Corpus is not permissible to question the correctness of the action of a grand jury in finding a bill of indictment, * * * when acting within their jurisdiction and in a lawful manner.\"\n\nIn In re McDonald, 4 Wyo. 150, 33 P. 18, 22 (1893), this court commented on this statute and said:\n\n\"* * * `Manner' has reference to the method or mode of acting, more than to the degree of perfection or correctness in the conclusion or results arrived at.'\n\nIt follows that the accuracy or sufficiency of the grand jury conclusions are not subject to review in a habeas corpus proceeding. The only question which could be raised is whether the grand jury acted in a lawful manner and within its jurisdiction. Hennigan, of course, did not pursue that remedy. Yet, that would have been an appropriate attack to pursue the contentions that are present in Hennigan's arguments because the efficacy of the indictment is to require a defendant to answer to criminal charges in front of a petit jury and to justify restraint of liberty pending trial.\n\nWisdom is found in not providing a method for reviewing grand jury proceedings for sufficiency of the evidence prior to trial. Early decisions by this court quoted from W.S. Church in his work, Habeas Corpus. His treatise points out that a review of the sufficiency of the evidence prior to trial usurps the province of the jury because the court would be reviewing the same evidence that a trial jury presumably would be hearing at a later time.\n\n\"* * * The question of guilt or innocence, therefore, should not be tried by the court or judge after indictment and upon habeas corpus; though the prisoner may be able to prove his innocence, he must abide his trial by jury.\" W. Church, Habeas Corpus § 244 at 344 (2d ed. 1893).\n\nThe Supreme Court of the United States also has spoken to the problems created by review of grand jury evidence prior to trial.\n\n\"* * * If indictments were to be held open to challenge on the ground that there was inadequate or incompetent evidence before the grand jury, the resulting delay would be great indeed. The result of such a rule would be that before trial on the merits the defendant could always insist on a kind of preliminary trial to determine the competency and adequacy of the evidence before the grand jury. This is not required by the Fifth Amendment.\" Costello v. United States, supra, 350 U.S. at 363, 76 S.Ct. at 408-409.\n\nIn a similar vein, Church concluded:\n\n\"* * * [E]stablish the principle that inquiry may extend beyond the indictment, and where will the range of inquiry cease?\" W. Church, Habeas Corpus, supra, at 344.\n\nWhile legislation in other states permits the courts to test the sufficiency of evidence presented before a grand jury, the legislature of this state, in its wisdom, has limited inquiry by courts to those areas that affect the manner of the proceedings or the jurisdiction to act. We accept this legislative limitation and will go no further of our own accord. See Maldonado v. State, 93 N.M. 670, 604 P.2d 363 (1979).\n\nIt is no more proper, in the absence of legislative authority or court rule, to review the sufficiency of the evidence supporting an indictment after a petit jury has returned a finding of guilty under the standard of proof beyond a reasonable doubt than it is after a plea of guilty by the defendant. United States v. Mechanik, 475 U.S. 66, 106 S.Ct. 938, 89 L.Ed.2d 50 (1986); Tollett v. Henderson, 411 U.S. 258, 93 S.Ct. 1602, 36 L.Ed.2d 235 (1973). In holding that even though error in the grand jury proceeding which may have required dismissal of the indictment prior to trial was present, the Supreme Court of the United States declared that it was inappropriate to dismiss the indictment after trial and a jury verdict of guilty.\n\n\"* * * The error * * * in these cases had the theoretical potential to affect the grand jury's determination whether to indict these particular defendants for the offense with which they were charged. But the petite jury's subsequent guilty verdict not only means that there was probable cause to believe that the defendants were guilty as charged, but that they are in fact guilty as charged beyond a reasonable doubt. Measured by the petit jury's verdict, then, any error in the grand jury proceeding connected with the charging decision was harmless beyond a reasonable doubt.\" United States v. Mechanik, supra, 475 U.S. at 70, 106 S.Ct. at 941-42.\n\nOur holding, which prevents any inquiry into the sufficiency of the evidence supporting a grand jury indictment, is soundly based. A finding of probable cause serves only to bind the defendant over for trial; conversely, the return of a \"no bill\" by a grand jury does not acquit the defendant because no jeopardy has attached at that stage of the proceedings. Wilson v. State, supra. The same charge could be presented to a different grand jury with either the same or additional evidence. If the grand jury finds probable cause, then the defendant is brought to trial, and he has his constitutionally guaranteed day in court. At that juncture, the evidence is tested by the standard of guilt beyond a reasonable doubt, the highest standard recognized in our system of jurisprudence. \"The acid test of their actions [the findings of the grand jury], however, will come when the petit jury renders its verdict upon the charges they have brought.\" Bartram v. State, 33 Md. App. 115, 364 A.2d 1119, 1157 (1976), aff'd 280 Md. 616, 374 A.2d 1144 (1977). Any additional evaluation of the evidence presented before the grand jury prior to trial does not provide any significant protection of the defendant's rights so as to justify the judicial and economic waste that it would require. Costello v. United States, supra.\n\n\"* * * [T]he greatest safeguard to the liberty of the accused is the petit jury and the rules governing its determination of a defendant's guilt or innocence.\" Silverthorne v. United States, supra, 400 F.2d at 634.\n\nOur holding foreclosing any review of the sufficiency of the evidence to support a grand jury indictment is also consistent with prior holdings of this court relating to possible claims of error in the preliminary stage and the effect of such error on a pleading or finding of guilt. Commenting on Coleman v. Alabama, supra, and Gerstein v. Pugh, supra, we said in Thomas v. Justice Court of Washakie County, 538 P.2d at 49, n. 7:\n\n\"If we correctly interpret these decisions, the effect [of] whether a proper preliminary examination was had or whether it was properly conducted is unimportant in considering on appeal the legality of the conviction of the defendant. This appears to be the position taken by this court in State v. Spears, 76 Wyo. 82, 300 P.2d 551 (1956), and State v. Vines, 49 Wyo. 212, 54 P.2d 826 (1936).\"\n\nSimilarly, we have stated that a defendant who pleads guilty cannot raise constitutional deprivations on appeal which do not reach the jurisdiction of the court. Vallo v. State, Wyo., 726 P.2d 1045 (1986). The issue is also like the question of the legality of an arrest warrant in Wyoming; it affects the lawfulness of the taking into custody but has no impact upon the question of guilt or innocence. Crouse v. State, Wyo., 384 P.2d 321 (1963).\n\nFashioning an appropriate remedy for any harm arising out of an error in the preliminary stage that did not have any effect upon the fairness of the trial before the petit jury, after a verdict of guilty has been returned, would be difficult, if not impossible. It could not warrant a reversal of the conviction. United States v. Mechanik, supra; Arcuri v. United States, supra. If the defect is brought to light prior to trial, that problem is not present. For example, the defendant may challenge a defect in the jurisdiction of the grand jury by habeas corpus prior to trial. Section 1-27-125, W.S. 1977; United States v. Taylor, supra. It is appropriate that the defendant be permitted to test the jurisdiction prior to trial before a petit jury, and if a record of the grand jury proceeding exists, he should be allowed access to it upon a showing of need and a demonstration of materiality to his defense. That opportunity, however, does not justify a fishing expedition in search of possible jurisdictional defects because there is a strong presumption of regularity in grand jury proceedings and particular irregularities must be alleged. United States v. Johnson, 319 U.S. 503, 63 S.Ct. 1233, 87 L.Ed. 1546 (1943).\n\nIn the absence of a record, Rule 606(b), W.R.E., permits a member of a grand jury to answer questions with respect to whether extraneous prejudicial information improperly was brought to the jury's attention or whether any outside influence improperly was brought to bear upon a juror. That rule, however, forecloses testimony by a juror into the validity of an indictment with respect to: any matter or statement occurring during the course of the jury's deliberations; the effect of anything upon his or any other juror's mind or emotions as influencing him to assent or dissent from the indictment; or his mental processes in connection therewith. Logic dictates that a re-evaluation of the sufficiency of the evidence to justify an indictment infringes upon the protected prerogatives of the grand jury.\n\nIn his next argument, Hennigan complains that the number of indictments and the individual counts found in a relatively short period of time support an inference of rubber stamping. We reiterate the strong presumption of regularity in grand jury proceedings. United States v. Johnson, supra. Hennigan and others assert that the return of 61 indictments encompassing 327 counts in three days overcomes that presumption. We note that these cases were not complex, and it would seem that the grand jury might have relied upon the same evidence in addressing cases involving several defendants. Given these circumstances, we cannot say that the grand jury did not properly perform their assigned tasks in the time available; we will presume that they did.\n\nAs a final assertion of procedural error, Hennigan contends that he was deprived of his right to discovery. Hennigan's assumption that there is a constitutional right to discovery in a criminal case is contrary to the rule articulated by the Supreme Court of the United States. Weatherford v. Bursey, 429 U.S. 545, 97 S.Ct. 837, 5 L.Ed.2d 30 (1977), quoted in Fitzgerald v. State, Wyo., 601 P.2d 1015 (1979). Hennigan also proposes that the purpose of a preliminary hearing is to offer an opportunity for discovery, a position that previously has been refuted by decisions of this court. E.g., Wilson v. State, supra; Weddle v. State, supra.\n\n\"`From appellant's discussion * * * it seems that his main purpose in asking for a preliminary examination [or access to the grand jury testimony] was to obtain knowledge of the facts the state expected to prove at the trial. He was really seeking a disclosure of the state's evidence in order that he might prepare his defense. It is clear that under out statute a preliminary examination is not for that purpose. * * * There seems to be no rule of the common law or statute that gives a defendant the right before trial to pry into the state's case by obtaining a disclosure of its evidence, though there is authority for the view that the trial court has at least a discretionary power to permit the defendant to inspect documents or chattels for the purpose of obtaining information that will enable him to make a defense.'\" State v. Spears, supra, 300 P.2d at 556, quoting from State v. Vines, supra, 49 Wyo. at 221, 223, 54 P.2d at 828, 829.\n\nHennigan also argues that a denial of due process occurred because he was forced to plead to charges with the only available information being the date and the quotation from the statute he allegedly violated. Hennigan chose not to file a motion for a bill of particulars. If he needed more information in order to make a plea, the bill of particulars is the procedural tool which accomplishes that purpose. Hawkes v. State, Wyo., 626 P.2d 1041 (1981). Our rules of discovery in Wyoming go beyond what is constitutionally necessary, and if Hennigan's rights to discovery did not afford him protection, it must be attributed to the fact that he did not invoke them. Otherwise, the discovery rules would be inadequate in a constitutional context. If that inadequacy were present, then the appropriate redress would be by statute or rule and not in an argument on appeal in a case in which available discovery was not utilized.\n\nOur careful review of Hennigan's contentions and this record convinces us that the process and procedure followed in the grand jury proceedings resulting in his indictment did not deny Hennigan due process of law.\n\nWe next address Hennigan's argument that he was denied equal protection of the law. Hennigan fails to offer any support for this argument. He relies on Hawkins v. Superior Court of City and County of San Francisco, 22 Cal.3d 584, 150 Cal.Rptr. 435, 586 P.2d 916 (1978), in which the Supreme Court of California held that prosecution by indictment and the denial of a post-indictment preliminary hearing resulted in a denial of equal protection under the provisions of the constitution of the state of California. That decision was premised upon state constitutional grounds not federal constitutional grounds, and no case has been discovered by either the appellant or this court which suggests that the denial of a preliminary hearing by virtue of presenting the case to a grand jury is a violation of the equal protection clause of the federal constitution.\n\nSince Hennigan cites no federal authority for his constitutional proposition, we must assume that his argument is premised on state not federal constitutional grounds. See State v. Sisneros, 137 Ariz. 323, 670 P.2d 721 (1983). We presume, then, that Hennigan's goal is to persuade this court to adopt the rationale of Hawkins v. Superior Court of City and County of San Francisco, supra, and conclude that the denial of a preliminary hearing violated his right to equal protection under Wyoming law.\n\nThe concept of equal protection is addressed in three provisions of the Constitution of the State of Wyoming:\n\n\"Since equality in the enjoyment of natural and civil rights is only made sure through political equality, the laws of this state affecting the political rights and privileges of its citizens shall be without distinction of race, color, sex or any circumstance or condition whatsoever other than individual incompetency, or unworthiness duly ascertained by a court of competent jurisdiction.\" Wyo. Const., Art. I, § 3.\n\n\"In their inherent right to life, liberty and the pursuit of happiness, all members of the human race are equal.\" Wyo. Const., Art. I, § 2.\n\n\"All laws of a general nature shall have a uniform operation.\" Wyo. Const., Art. I, § 34.\n\nThe argument was made in In re Boulter, supra, 5 Wyo. at 335, 40 P. at 521, that Art. 1, § 34 made it \"unjust and unconstitutional to subject one man to an accusation by means of an information and another by an indictment found and returned by a grand jury, at the caprice of the prosecuting officer.\" This court responded that the law was uniform because it required a finding of probable cause either by \"a grand jury upon sworn testimony or by a magistrate upon evidence publicly given and in the presence of the accused, with a right on his part to cross-examination and to produce witnesses in his own behalf\". In re Boulter, supra, 5 Wyo. at 337, 40 P. at 522. The court went on to say:\n\n\"* * * It seems clear to us that the legislature had the right to retain the grand jury system, and to provide for accusation by information as well as by indictment, under the authority given by constitutional permission to `change, regulate, or abolish the grand jury system.' * * * The provision for the dual system of accusation is not fatal to the act.\" In re Boulter, supra, 5 Wyo. at 338, 40 P. at 523.\n\nThe authorized dual charging system in Wyoming does not violate Art. 1, §§ 2 and 3 of the Constitution of the State of Wyoming any more than it offends Art. 1, § 34 of the Constitution of the State of Wyoming. The perceived advantages which flow from the procedure involving a complaint and preliminary examination followed by an information do not justify a conclusion that Hennigan has been denied equal protection of the law because the grand jury was used. Our law provides for discretionary treatment at several stages in the prosecution. The exercise of that discretion cannot be found to work a denial of equal protection solely because of disparate treatment unless the denial is based upon an identifiable class. As we noted in another context, in Cavanagh v. State, Wyo., 505 P.2d 311, 312 (1973):\n\n\"* * * [N]either the Fourteenth Amendment of the United States Constitution nor Art. 1, § 2, Wyo. Const., requires exact equality. Only arbitrary and invidious discrimination are condemned, neither of which are present in this case.\"\n\nIn our judgment, the rationale found in State v. Clark, supra, satisfactorily refutes Hawkins v. Superior Court of City and County of San Francisco, supra. The Oregon court there held that a statute which justified a defendant being charged either by indictment or information did not deny equal protection, despite the fact that the procedures afforded through the preliminary hearing were unquestionably potentially important to the defendant and offered important advantages over prosecution by indictment. The court pointed out that there are two kinds of equal protection arguments: first, where a distinction of class exists which is created by law, in such instances an equal protection argument usually fails; second, in the instance of a distinction of class created by a separate condition which results in disparate treatment in the law apart from the law itself, such a circumstance serves as a successful premise for an equal protection argument. The Oregon court pointed out that the defendant's argument concerning preliminary hearings belongs in the first class, that is, he was denied equal protection of the law simply because the law provided for two alternative treatments and not in the second class because of some characteristic applicable to the defendant that was apart from the law. In fact, no class can be shown until the prosecutor exercises the discretion which the law affords.\n\n\"* * * But these defendants do not exist as categories or classes with distinguishing characteristics before and apart from a prosecutor's decision how to charge one, or some, or all defendants. Aside from the manner in which the decision is made, [citation omitted] defendants charged under either procedure are `classes' only as an effect of the dual procedural scheme itself.\" State v. Clark, supra, 630 P.2d at 818.\n\nSee also, State v. Cisneros, supra; People v. District Court for Second Judicial District, Colo., 610 P.2d 490 (1980), also rejecting the Hawkins rationale.\n\nFurthermore, the dissent in Hawkins v. Superior Court of City and County of San Francisco, supra, is well taken. The California constitution, like the constitution in Wyoming, gave the legislature the power to alter or abolish the grand jury procedure. As the dissent noted, if the system is to be abolished, it should be accomplished by the legislature enacting the apparent will of the people rather than by court decision. Hennigan's plea for reform of the grand jury system is addressed to the wrong forum. We do not discuss Hennigan's arguments concerning disparity of treatment beyond that which we have said in discussing his claimed denial of due process.\n\nThe second issue urged by Hennigan is that the grand jury was impaneled improperly, and for that reason, it was without jurisdiction to return an indictment. This challenge is premised upon the contention that there was no finding of necessity by the district court with respect to impaneling a grand jury. Hennigan argues that this finding is required by § 7-5-102, W.S. 1977, which provides in pertinent part:\n\n\"Whenever in the opinion of the district judge a grand jury be necessary he must make an order directing a grand jury to be drawn and summoned to attend before the court.\"\n\nHennigan argues that, since the order directing the impaneling of this grand jury does not contain a sufficient statement of facts or even cite this statute, the court did not make the required finding of necessity. Our analysis of the statute leads us to the conclusion that a formal finding of necessity is not necessary to impanel a grand jury pursuant to § 7-5-102, W.S. 1977. The statute grants authority to the district court to call a grand jury in its discretion if the court believes one is necessary.\n\nThis statute was adopted in its initial form in 1899. It would appear that the purpose was to confer authority on the district court to impanel a grand jury when the regular convening of the grand jury, as known at common law, was no longer necessary because of the adoption of the alternative form of prosecution by information. In re Wright, supra. The general rule is that the legislature may determine the proper circumstances for the summoning and impaneling of a grand jury.\n\n\"No restraint has been imposed by the constitution upon the power of the legislature to determine at what time, under what circumstances and in what manner, a grand jury may be summoned, but the matter has been left entirely to the discretion of the legislature.\" People v. Grizzel, 382 Ill. 11, 46 N.E.2d 78, 82 (1943).\n\nIn Wyoming, the legislature has extended the authority to impanel a grand jury to the district court, and that authority is available whenever the district court deems it necessary to impanel a grand jury.\n\nAfter examining the history of this statute, it is clear that the word \"necessary\" does not imply any specific finding that calling the grand jury is necessary. That interpretation would have been foreign to the common law and is inconsistent with the discretionary authority found in the statute. No case has been found from other jurisdictions which requires that a court make a finding of necessity even though the use of the word \"necessary\" appears in similar statutes. The district court stated that the grand jury was necessary, and that is sufficient. Pinn v. State, 107 Neb. 417, 186 N.W. 544 (1922). Further, the district court did not abuse its discretion in calling the grand jury. The generally accepted rule is that the district court need not take evidence or seek advice concerning the propriety of calling a grand jury; such inherent authority is available at its discretion. Williams v. People, 46 Colo. 183, 103 P. 298 (1909). There is nothing in the record to indicate any abuse of discretion in the district court's exercise of its power to impanel a grand jury. Cf. State ex rel. Woodahl v. District Court of First Judicial District in and for Lewis and Clark County, 166 Mont. 31, 530 P.2d 780 (1975).\n\nHennigan then insists that the indictment should be dismissed because the foreman of the grand jury did not endorse the words \"A True Bill\" on the indictment. This argument relies upon the language of § 7-5-106, W.S. 1977, to the effect:\n\n\"Nine (9) of the grand jury must concur in the finding of an indictment. When so found the foreman of the grand jury shall endorse upon such indictment the words, `A True Bill,' and shall subscribe his name thereto.\"\n\nThe words \"A True Bill\" were typed upon the indictment returned by the grand jury rather than being personally endorsed by the foreman. Each indictment did contain the signature of the foreman.\n\nAgain Hennigan chooses to go \"bare\" in terms of his reliance upon any authority. The authorities we found refute his contentions. In Frisbie v. United States, 157 U.S. 160, 15 S.Ct. 586, 39 L.Ed. 657 (1895), the Supreme Court of the United States held that the failure to endorse the words \"A True Bill\" and the failure of the foreman to sign the indictment did not require that it be set aside. The court there explained that the formality of the words \"A True Bill\" once played an important role and possibly was the only evidence of the grand jury's determination. This formality is no longer required unless it be by statute.\n\nAt common law, the words \"A True Bill\" on the indictment denoted probable cause had been found. Conversely, if there was no finding of probable cause, the indictment was returned with the word \"ignoramus.\" Frisbie v. United States, supra. In that context, the significance of the words \"A True Bill\" was to furnish evidence of the finding of probable cause by the grand jurors. Other evidence indicating that decision is thus acceptable in the absence of some requirement of strict compliance with the statute. Kirkland v. State, 86 Fla. 64, 97 So. 502 (1923).\n\nThe evidence found in this record is that the indictment was returned in open court in the presence of all jurors; the foreman personally signed the verdict; and the words \"A True Bill\" were contained in each of the indictments. Strict compliance with the statute is not necessary, and this state of facts results in a clear manifestation that the grand jury found probable cause. No possible prejudice to Hennigan can be discerned from the failure to have the words \"A True Bill\" endorsed personally by the foreman on the indictment. See Glasser v. United States, 315 U.S. 60, 62 S.Ct. 457, 86 L.Ed. 680, reh. denied sub nom Kretske v. United States, 315 U.S. 827, 62 S.Ct. 629, 86 L.Ed. 1222 (1942) (failure to recite indictment in open court was not sufficient to make it defective).\n\nLastly, Rule 9, W.R.Cr.P., is pertinent and controlling in this case. It provides:\n\n\"* * * The indictment or information shall state for each count the official or customary citation of the statute, rule, regulation or other provision of law which the defendant is alleged therein to have violated. Error in the citation or its omission or any other defect or imperfection which does not tend to prejudice any substantial right of the defendant upon the merits or to mislead the defendant to his prejudice shall not be grounds for dismissal of the indictment or information or for reversal of a conviction.\" (Emphasis added.)\n\nThe language of this rule manifests the spirit of the law not to elevate form over substance. The thrust of Hennigan's argument is to make form paramount, and in the light of a jury's verdict of guilty, measured by the standard of guilt beyond a reasonable doubt, it would be ludicrous to vacate his conviction for this sort of hypertechnical reason.\n\nThe last issue raised by Hennigan essentially is a reiteration of his due process and equal protection claims. Hennigan, in effect, requests that this court adopt a presumption that these indictments failed to manifest a reliable determination of probable cause and invites us to search the record for some possible violation. That presumption is contrary to the applicable one. United States v. Johnson, supra. It also is inconsistent with the finding of guilt beyond a reasonable doubt by the petit jury. United States v. Mechanik, supra. Hennigan's burden is to identify some specific violation of the grand jury procedure or some defect reaching its jurisdiction. It is not appropriate for this court to examine the record to seek out some possible violation that in all probability is a phantom. We will not undertake a review of the record to search for the figments of Hennigan's imagination. See United States v. Smyth, supra.\n\nWe have given careful and lengthy consideration to Hennigan's claims because they are asserted by a number of defendants indicted by the same grand jury. We are satisfied that there was no abuse of the grand jury process; no violation of Hennigan's constitutional rights; and no infringement upon his right to a fair trial, the product of which was that he was found guilty beyond a reasonable doubt. The judgment and sentence is affirmed.\n\nMACY, J., filed a concurring opinion.\n\nURBIGKIT, J., filed a dissenting opinion.\n\nMACY, Justice, concurring.\n\nI concur with this opinion simply because the failure to strictly comply with the grand jury statutes in effect at the time did not violate defendant's constitutional rights to due process. However, I cannot subscribe to the reasoning that we are free to consider irregularities in criminal proceedings as being harmless merely because a defendant later is found guilty by a jury.\n\nIt clearly was wrong for the prosecutor in this case to not reveal that at least part of the grand jury proceedings had been recorded.\n\nThose who do not fairly conduct criminal proceedings should take little comfort with the holdings in this case. There is a point at which this Court must provide the remedy of reversal when those in the justice delivery system do not exercise fundamental fairness in conducting criminal proceedings, regardless of whether or not irregularities reach constitutional proportions.\n\nURBIGKIT, Justice, dissenting.\n\nIn times past in our English heritage before the jury-trial process for criminal guilt determination was developed, the justice system invoked oath and ordeal. In one adaptation of ordeal, the accused was thrown into the water and if accepted thereby and not returned to the surface, he was determinably innocent; conversely, if repulsed by the water to return alive to the surface, he was guilty and therefore to be punished appropriately for his criminal character. M. Frankel and G. Naftalis, The Grand Jury, An Institution on Trial, p. 7 (1977); Murov, An Examination of The Grand Jury: Inquest and Quest, 51 N Y St.B.J. 115 (February 1979). For a different perspective, see Helmholz, The Early History of the Grand Jury and the Canon Law, 50 U.Chi.L.Rev. 613 (1983).\n\nNot particularly different in essential function was the Gillette, Campbell County, Wyoming, grand jury in its conduct during the session from late June, 1985 through early January, 1986. Any suggested semblance to an instrumentality of due process is not only antithetical but imaginary. This court will not change that fact by distinguished style and detail of the approving opinion. See United States v. Kilpatrick, 821 F.2d 1456 (10th Cir. 1987), Seymour, J., dissenting.\n\nUnfortunately, in some singular respects, Wyoming as a state is developmentally late, especially in regard to the function of the grand jury. This state only this year statutorily left the Nineteenth Century to progress to a position that many state courts and to a degree the federal government had reached decades ago through policy changes and procedural protection. In dissenting, I invite the supervisory responsibility of this court for procedural modernization and not regression to outmoded and discarded standards. That supervisory responsibility for the state justice-delivery system is not dissimilar to the function of the United States Supreme Court in the administration of justice in the federal courts, McNabb v. United States, 318 U.S. 332, 63 S.Ct. 608, 87 L.Ed. 819, reh. denied 319 U.S. 784, 63 S.Ct. 1322, 87 L.Ed. 1727 (1943); United States v. Hasting, 461 U.S. 499, 103 S.Ct. 1974, 76 L.Ed.2d 96 (1983), although that position may now be in remission if not abandonment. Hobby v. United States, 468 U.S. 339, 104 S.Ct. 3093, 82 L.Ed.2d 260 (1984); United States v. Mechanik, 475 U.S. 66, 106 S.Ct. 938, 89 L.Ed.2d 50 (1986). See also United States v. Kilpatrick, supra, and United States v. Pino, 708 F.2d 523 (10th Cir. 1983).\n\nIn an informative article on elimination of delay in criminal trials, Judge Campbell, in addressing grand juries, observed:\n\n\"A most effective way to reduce delay and back-log in our criminal justice system and expedite trials would be to abolish the Grand Jury. * * * This great institution of the past has long ceased to be the guardian of the people for which purpose it was created at Runnymede. Today it is but a convenient tool for the prosecutor — too often used solely for publicity. Any experienced prosecutor will admit that he can indict anybody at any time for almost anything before any grand jury.\" 55 F.R.D. 229, 253 (1973).\n\nIn this case, as well as in other grand jury cases coming to this court from the session in Campbell County, I will dissent not only to the process-driver application of an outdated statute now repealed, but also by virtue of the majority opinion here reasserting outdated principles which should have been interred. These outmoded axioms will now be applied to a somewhat modernized law which otherwise, with progressive application and suitable rules, could have justified the continued institution of the grand jury in a specialized and closely defined status within a modern system of criminal law. See L. Clark, The Grand Jury, The Use and Abuse of Political Power, and the countervailing view for retention with reform, M. Frankel and G. Naftalis, The Grand Jury, An Institution on Trial, supra.\n\nAfter reviewing and then defining the Campbell County epoch as \"law by Murray,\" it is clear that the future of the grand jury deserves the close attention of this court, the trial judiciary, the Bar, and the legislature for process correction to reach present standards of prevailing precedent, modern practice, and constitutional due process and equal protection. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Goldstein, The State and the Accused: Balance of Advantage in Criminal Procedure, 69 Yale L.Rev. 1149 (1960); Rosenfeld, Justice and the Grand Jury, 4 Cal.Lawyer, p. 22 (February 1984); Essay, How Grand is a Grand Jury, 31 S.D.L.Rev. 245 (1985):\n\n\"As a result of these factors and characteristics of the grand jury, prosecutors may lack the burden of proving guilt beyond a reasonable doubt. They do not, however, lack the burden of ensuring that grand jury proceedings are conducted properly with no abuses, while striving to epitomize the twin ethics of integrity and fairness. * * *\n\n\"The foundation must again be established for the grand jury to operate as protector of the accused.\" Id. at 250.\n\nI. ISSUES PRESENTED BY THE GRAND JURY PROCESS\n\n1. General: Validity of the proceedings and results in the Campbell County session.\n\n2. Recording and availability of a record.\n\n3. Discovery and disclosure of grand jury activities and witness testimony.\n\n4. Use of hearsay and incompetent evidence for indictment.\n\n5. Due-process requirements under the Wyoming Constitution.\n\n6. Equal-protection requirements under the Wyoming Constitution.\n\n7. Burden of the cases — where there are so many that it does not really matter how the result was achieved.\n\n8. Prosecutorial misconduct and erroneous advice, including: (a) term of grand jury; (b) inter-spousal privilege of witnesses; (c) alleged grant of immunity in order to require testimony; and (d) insulation of witness by use of third-party hearsay for indictment.\n\n9. Waiver of misconduct by subsequent jury verdict, United States v. Mechanik, supra, 475 U.S. 66, 106 S.Ct. 938, 89 L.Ed.2d 50.\n\n10. Empaneling jury and engrossment of indictments.\n\nII. FACTUAL AND LEGAL BACKGROUND\n\nA. The Saga of the Campbell County Grand Jury Circa 1985\n\nNot completely incomparable with the Johnson County wars of the same general area of nearly a century before, the Campbell County grand jury accommodates an interesting legal and historical perspective.\n\nOn June 10, 1985, James R. Murray, Campbell County Attorney, filed a motion to convene a grand jury, in general substance stating: \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\n\"1. The Campbell County Sheriff's Department has been conducting an undercover controlled substance investigation for the past nine (9) months.\n\n\"2. In excess of seventy cases are presently ready for prosecution presentation.\n\n\"3. The investigation has revealed several controlled substance distribution schemes which will require the investigative power of a Grand Jury to complete the investigation.\n\n\"4. The needs of the community dictate that a Grand Jury should be convened to investigate professional and official corruption.\"\n\nAccommodating this motion, and accompanied by a hearing which was apparently not reported and certainly not transcribed, the order convening the grand jury stated:\n\n\"The State of Wyoming's motion to convene a Campbell County Grand Jury having come before the Court, the Court having received sworn testimony in support of the motion and being otherwise advised in the premises;\n\n\"IT IS THEREFORE ORDERED AND ADJUDGED the:\n\n\"1. The Clerk of the Court pursuant to 7-5-102, W.S. shall summon sixteen (16) prospective Grand Jurors.\n\n\"2. The prospective Grand Jurors shall report to the Clerk of District Court, Campbell County Courthouse, at 1:30 P.M. on the 21st day of June, 1985.\n\n\"3. The State's motion and the hearing on the State's motion shall be sealed until further order of the Court.\n\n\"DONE this 10th day of June, 1985.\"\n\nDetails of the initiating event, records or transcripts (never produced), and the substance of the instructions to the grand jury, were not in the record and were unknown to anyone except the trial judge, the county attorney, and the membership of the grand jury, until inquiry by this writer as a member of the Supreme Court revealed some aspects of the minimal documentation in May of 1987, when preparation for this opinion was underway. However, in sequential relationship to the events that occurred, undisclosed to defendants and their counsel, the grand jury instructions directed:\n\n\"With respect to those accused of crime you will hear only one side of a case. It is not your duty to decide the guilt or innocence of the accused. You are an investigative and accusatorial body. As to the degree of evidence sufficient to warrant the return of an indictment; I instruct you that an indictment should be found when all of the evidence before you taken together, if unexplained or if uncontradicted, would in your judgment warrant a conviction by a trial jury. If the evidence fails to establish the degree of evidence sufficient to warrant the return of an indictment, then you must refuse to return a `true bill'.\n\n\"No public purpose would be served by indicting a person when it appears to you that the evidence is not sufficient to sustain a conviction. Unjust or unfounded indictments should not be returned against anyone.\n\n\"You must be fair and just in your deliberations to the best of your ability and understanding. Your oath requires that you not indict any person through malice, hatred or ill-will. Nor should you fail to indict any person through fear, favor, affection, reward or hope of reward. You must be guided by an impartial spirit, free from personal, social, racial, religious bias or feeling.\n\n\"You are cautioned that rumor is unreliable, it must be entirely disregarded. You must be cautious in receiving hearsay testimony; that is to say testimony of a witness as to what someone else said, unless you are satisfied that the source is reliable. You are an investigative body and hearsay often provides the means and direction of furthering your investigation. No person may be compelled to be a witness against himself unless he has been furnished a grant of immunity. You should cautiously weigh testimony which is received under a grant of immunity. The County and Prosecuting Attorney and the court will resolve any questions concerning immunity.\n\n\"The County and Prosecuting Attorney is by law the representative of the State of Wyoming in all criminal prosecutions. It is his duty to be present with the Grand Jury in its room, to present evidence, to examine the witnesses and to give advice upon any matter of law which may be raised. You should follow the instructions of the Prosecutor on matters of law unless you are instructed to the contrary by the Court. You are, however, the sole judges of the facts and neither the Prosecuting Attorney nor any of his assistants will influence you in your decision as to whether an indictment should be approved. Statements by the County and Prosecuting Attorney or any of his assistants on matters other than the law are not evidence and should be disregarded unless supported by sworn testimony and exhibits brought before you. In addition to the Prosecuting Attorney and witnesses, there may be also present in the Grand Jury Room a court reporter who will record the testimony of the witnesses.\" (Emphasis added.)\n\nDetails generally about what occurred must be based in part on unanswered assumptions in briefs and general information, since it cannot even be told for sure at what times a court reporter was actually present, but it is clear that transcripts were made of only selected testimony in the later investigatory stages, and the existence of these transcripts was never made known to defendants' counsel.\n\nThe grand jury met for three days, June 24, 25, and 26, 1985, and rendered indictments against 67 individuals, encompassing about 237 separate criminal counts. No transcribed record is available as to what witness or witnesses testified to or how the indictments were supported in evidence. It is assumed from a multitude of comments made in its briefs, as well as generally considered in public information and not denied in any response, that these indictments were obtained by the testimony of the deputy sheriff testifying about and summarizing investigative reports of an undercover agent who was then also employed in Campbell County as a deputy sheriff. This undercover agent, David Michael Lauck, who used the undercover name of Dale Lucas, although available, for some reason was not called to appear and testify before the grand jury and only testified at the individual trials held in the fall. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nSeven appeals resulted from the initial 67 indictments, and two subsequently occurred in the continuing activities which lasted through the end of the year and into January of 1986. After the initial three-day course of indictments, the grand jury pursued a course of investigative interviews, subpoenaed witnesses, some as targets, some stated not to be targets, some granted immunity, some not, others called for an apparent purpose of perjury charges. An additional total of 27 indictments were apparently then made, including some controlled-substance charges, perjury complaints, and concluding with gambling charges through to a 13-page final report filed January 31, 1986, which, in addition to a recommendation of an annual session, also included a note for this court:\n\n\"9. The Wyoming Supreme Court should review its policies on the use of illicit drugs and illegal activities by public officials who are attorneys to determine their fitness for continued professional practice.\"\n\nIn historical perspective, the reaction of the community to the grand jury activity resulted in the 1986 Fall primary election defeat of the long-time sheriff who had been in the forefront of the activity, by an adverse vote of 6,387 to 3,087, and of the county and prosecuting attorney by a similar vote of 5,947 to 3,322. Not immunized from grand jury subpoena or target consideration were five or six members of the legal profession, of whom none were indicted in the Campbell County grand jury sessions. The number of trials is not established in appeal records, except that nine appeals to this court were filed, including: Brown v. State, Wyo., 738 P.2d 1092 (1987); Gist v. State, Wyo., 737 P.2d 336 (1987); Heggie v. State, No. 86-22 (dismissed August 5, 1987); Sword v. State, Wyo., 746 P.2d 423 (1987); Deckert v. State, No. 86-34 (dismissed July 27, 1987); Lee v. State, Wyo., 743 P.2d 296 (1987); Burke v. State, Wyo., 746 P.2d 852, (1987); and Kortz v. State, Wyo., 746 P.2d 435 (1987).\n\nThree cases have thus far been reversed, and three of the accused received commutation from the Governor, including Hennigan, who is the defendant here. Two of the commutations effectuated dismissals of appeals; Hennigan did not. At this time, three of the nine appeals remain for decision of this court. The character of the facts and records upon which post-indictment motions were considered, reviewed by certiorari in this court, and finally on appeal, is demonstrated from hearing exchanges and briefing comment. Exceptionally noteworthy is the fact that a court reporter was actually present at least part of the time, and perhaps all the time, in accord with the original court instructions, none of which information was ever made available to appellants. It is this status of disinformation that was reflected in the post-indictment, pre-trial motion hearing to dismiss the indictments.\n\n\"[MR. GALLIVAN, University of Wyoming law professor serving as one of the counsel for defendants — oral argument to the trial court on the motion to dismiss indictment:] What I'm doing now I think is, having just received the brief very recently of the county attorney, I am doing orally what would probably be done by way of a reply brief, and some form of contrast between the brief of the defendants in this case and the brief of the county attorney.\n\n\"At the outset, normally one would be expected to be able to say that these are the statements of the facts, and this is what we're talking about. I think that a large part of the problem of the defendants in this case revolves around the fact that we know nothing about the proceedings except what is reflected in the court file, the court's recorded instructions. We know nothing about the number of investigations, except what we read in the newspaper. We do not know how long any of these things went. We assumed from what we did know that they had rather rapid review of the cases. We stated that we believed that these indictments were returned solely on the basis of hearsay by deputy sheriffs, as that has not been denied, and, if anything, it's been confirmed by the county attorney's brief.\n\n\"We believe, but we do not know, that none of the proceedings were recorded, and I think that is conceded by the county attorney's brief without saying so much in words. [Emphasis added.]\n\n\"THE COURT: * * * I'm going to assume, as you do for the purpose of these arguments, that there was, as you put it, a rapid review of the cases. It was a very short period of time.\n\n\"I'm also going to assume that it was based, if not entirely, almost entirely at least on hearsay testimony — well, I guess I should not say on hearsay testimony.\n\n\"My belief is that it might have been the testimony of an undercover officer that participated in the alleged offenses. And if that is the case, I suppose it probably wouldn't be hearsay.\n\n\"So I think it's probably one of those two, although I know the state's brief talks a great deal about hearsay, and I would say that is also my understanding.\n\n\"And I'm going to assume for purposes of this argument, that none of the testimony upon which these indictments were based, although I understand there has been some recorded testimony since then, but that none of the testimony upon which these indictments were based was reported testimony.\n\n\"MR GALLIVAN: Thank you. I think that's the version we proceeded upon, and it finds some substantiation in the mode of response of the county attorney's brief.\n\n\"MR. MURRAY: * * * I think that the brief speaks for itself and shows that basically what Professor Gallivan is pleading to the court is a novel argument that's without basis so far as Wyoming law is concerned and federal law.\n\n\"I'm a little mystified with respect to the denial of equal protection and denial of due process because the cases have consistently held that there's no denial of due process and no right to confrontation with a grand jury, that is to say, 6th amendment rights afforded to the defendant at trial.\n\n\"There is certainly nothing wrong with exclusive reliance on hearsay for the simple reason that even at a preliminary hearing the rules of criminal procedure, specifically Rule 6(b), states that finding of probable cause can be made wholly or in part based solely upon hearsay.\n\n\"There is speculation and that's all we have heard here today, Your Honor, that somehow the grand jury ought to be dissolved or the indictments quashed for the simple reason that there may be a particularized need that may raise its head at some point in the future.\n\n\"I might point out to the court that before the court here this afternoon, or this evening, there is no particularized need, none whatsoever has been brought forth in evidence. There has been no evidence to indicate that there is a need. There has been no evidence to indicate any misconduct.\n\n\"We've heard a lot of speculation as to the what the grand jury did, what the grand jury thought.\n\n\"Specifically, what we have is a statutory scheme here in Wyoming by which a grand jury can be impaneled to make a finding of probable cause. And we've heard a lot of attacks on the grand jury, but this court very carefully instructed this grand jury at the time it was impaneled. And although somebody looks and says that some 232 counts were returned in a rather rapid length of time, I can tell you and this court is well aware of the fact, that a number of hours went into that three days session.\n\n\"And there has been no denial of due process, there has been adequate discovery, and any defendant that wishes to can assert his 6th amendment right to go ahead and proceed to trial. At that point he will have the right to confront the witnesses before him and the people that are making the allegations against him.\n\n\"There is no common law right to a preliminary hearing. That right must be statutory, and that right does not exist in Wyoming following a grand jury action in the form of an indictment. It's only by statute and the rules of criminal procedure following a felony charge or a felony arrest warrant wherein you are afforded a preliminary hearing in county court. There is no constitutional right to a preliminary hearing. And we dealt with that with some degree of specificity in our brief. There's no denial of due process. That was dealt with at some length.\n\n\"What we have before the court, Your Honor, is kind of a generalized, philosophical statement that, `Judge, it's just not fair what's gone on. You know, we ought to be able to clog the system up with having a whole series of preliminary hearings at the county court level, and then proceed on into district court.'\n\n\"The fact of the matter is that the probable cause aspect of it was done and handled by the grand jury, and now jurisdictionally we're in the district court and we're ready to proceed.\n\n\"Any defendant, and I mentioned this before, that feels that he is not guilty of what he's charged with has a 6th amendment right, and that right is to confrontation, and all the due process protections that go along with it will emerge at his trial and that's where he ought to be exercising that, not in the form of a motion to dismiss, saying that it was simply a denial of due process that he got indicted by the grand jury.\n\n\"[THE COURT:] With regard to the discovery issues that were discussed, it is this court's belief and finding that there are sufficient methods under our rules for discovery with regard to the grand jury versus a preliminary hearing.\n\n\"I believe that any discussion of discovery in that context is misplaced. The preliminary hearing is not to be used for discovery. We all know that, as a practical matter, it's quite often used that way. That is not what the rules provide, and although it is commonly used that way, that is not the proper use of a preliminary hearing.\n\n\"So, I fail to see how lack of a preliminary hearing could have any substantial effect on discovery by the defendants.\n\n\"Additionally, of course, there is, as everyone I think concedes, no constitutional or common law right to a preliminary hearing, and Rule 7(a) of our Rules of Criminal Procedure specifically exempts indictments from preliminary hearings here in the state of Wyoming.\n\n\"In short, it is the finding of this court that the grand jury was legally constituted, and that because it was a legally constituted grand jury, that the motions to dismiss should be denied.\n\n\"I will say that, as I said earlier, it is obviously not the common method used in this state. I think I'm beginning to learn why the more I get involved in this, and I say that in somewhat of a facetious manner. I have been inundated with work, as Judge O'Brien has. The county court judges seem very pleased. They have been saved a number of preliminary hearings by this. So I suppose not everyone would feel as I do.\n\n\"And I worry, as many people in this country do, and many people have expressed lately, about abuses of a grand jury. I would hope that we would have none of those abuses here. None have been demonstrated by defense counsel.\n\n\"Because of that, and because of my finding it is a legally constituted grand jury, the motions are denied.\"\n\nFurther stated, as submitted by defendant in the memorandum accompanying the Petition for Writ of Certiorari to this court as a later challenge to the session and its procedure before the jury trials were undertaken:\n\n\"Compounding the perfunctory indictment process are the problems that come to light before trial. The secrecy, non-discoverability and nonreviewability of proceedings not only undermines the reliability of the indictment process, but the defendant may well go to trial without the basic knowledge necessary to defend the charges.\"\n\nB. Defendant\n\nBackground of the Individual\n\nTypical of most of the accused in the Campbell County grand jury session, Hennigan was 20 years of age, had ten years of formal education and an intermittent work record in the oil fields, and was single. He suffered from an alcoholic problem and was a controlled-substance user. Although not generally involved with the other controlled substances, he both used and sold some marijuana.\n\nThe facts, undisputed in the record, reveal sales of 1/4 ounce January 30, 1985 for $30; one ounce February 1, 1985 for $105; 1/4 ounce February 4, 1985 for $25; and a further sale of one ounce February 21, 1985 for $100. Original contact had occurred between him and the undercover agent, Lauck, through introduction by a third party with whom Lauck had embarked on a course of substance purchase and who was later indicted. The trial was nondescript and occurred early in the course of events (see Lee v. State, supra), so that no member of the jury had previously served in the trial of any grand jury instituted criminal complaint. Considering the concurrent rather than the consecutive sentence, and in view of the alternative which had been given to Hennigan to go to the State Hospital for treatment with a period of probation, or undergo penitentiary confinement, with nothing noteworthy in the trial process absent discernible defense, except that if the case had been preceded by information, a preliminary hearing probably would have concluded any not-guilty plea defense, and disposition by plea would have expeditiously occurred. Since counsel in opening statement announced that Hennigan chose not to testify, no actual defense of substance was presented.\n\nThe sentence of not less than 18 months nor more than 36 months on each of the four counts also included a fine of $750 on each charge, $25 surcharge on each count for the Victims' Compensation Fund, and to \"reimburse the State of Wyoming and the County of Campbell for the services of court appointed counsel which the Court determines to be $1000.00.\" \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The credit for confinement of 216 days was given in the sentence dated February 4, 1986, and on December 5, 1986 the remaining unserved sentence was commuted by the Governor to time served. Appellant is presently released from confinement.\n\nC. Wyoming Constitution and Statutes\n\nFor its day in 1890, the Wyoming Constitution reflected the modern attitude:\n\n\"The right of trial by jury shall remain inviolate in criminal cases, but a jury in civil cases in all courts or in criminal cases in courts not of record, may consist of less than twelve men, as may be prescribed by law. Hereafter a grand jury may consist of twelve men, any nine of whom concurring may find an indictment, but the legislature may change, regulate or abolish the grand jury system.\" Article 1, § 9.\n\nAlthough grand jury provisions have existed from territorial days, Ch. XIV, Title VI, Compiled Laws of Wyoming 1876, the first state legislature was progressive in providing in Ch. 59, S.L. of Wyoming 1890-91, for the alternative information and preliminary hearing as a most efficient process. The 1890-91 statute, which remained in effect for these proceedings, has now been completely rewritten by Ch. 157, S.L. of Wyoming 1987, effective May 22, 1987 (now § 7-5-101, et seq., W.S. 1977, 1987 Replacement). Substantive provisions historically provided in § 7-5-101, et seq., W.S. 1977, in addition to specifications for calling by the district judge, arrangement for compensation and qualification, and oath to be taken, included provision for a report and other significant requirements of a circa 1890 nature.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nWyoming cases construing either the constitutional or statutory provisions from territorial days to 1985, total five: In re Wright, 3 Wyo. 478, 27 P. 565 (1891); Cook v. Territory, 3 Wyo. 110, 4 P. 887 (1884); and In re Boulter, 5 Wyo. 329, 40 P. 520 (1895), predating statehood; and from that date not to reappear for appellate consideration until the unusual circumstances of the Hopkinson cases in 1983, Hopkinson v. State, Wyo., 632 P.2d 79 (1981), cert. denied 455 U.S. 922, 102 S.Ct. 1280, 71 L.Ed.2d 463 (1982), except for State v. Boyd, Wyo., 528 P.2d 287 (1974), cert. denied 423 U.S. 871, 96 S.Ct. 137, 46 L.Ed.2d 102 (1975), which gave minimal consideration to grand jury issues although involving indictment. The minimal state-process involvement of the grand jury in the interim 90 years was occasioned by the more efficient, additionally protective, and far less expensive information-charging process.\n\nIn the 1884 Cook case, a challenge to the indictment was inappropriately raised by a motion to quash which reached only errors apparent on the face of the record rather than the appropriate plea in abatement. The next two cases, In re Wright, supra, and In re Boulter, supra, determined that the information process with preliminary hearing was correct. Hopkinson and Boyd raised no questions material here, and consequently we undertake the due-process, equal-protection, and flawed-process inquiries free from earlier Wyoming authority on the subjects presented.\n\nThe Wyoming Supreme Court fairly recently adopted some general rules which include grand jury process, identical or similar to the federal rules of criminal procedure:\n\n\"In all cases triable in district court, except upon indictment, the defendant shall be entitled to a preliminary examination.\" Rule 7, W.R.Cr.P.;\n\nRule 10, W.R.Cr.P., relating to issue of warrant on indictment; Rule 18(a)(3), W.R. Cr.P., which provided the Jencks Act federal rule provisions of Rule 16(b), F.R.Cr.P.; and Rule 1101(b)(2), W.R.E., providing that rules of evidence would not apply to proceedings before the grand jury.\n\nCommencing with the redrafting of Wyoming Statutes Title 7, the Wyoming grand jury code was rewritten in Ch. 157, S.L. of Wyoming 1987. Note will be made in the discussion in this opinion where reference to the Campbell County scenario may not be relevant to future application by virtue of a change in the statute. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nD. Distribution of Powers\n\nFrom a Wyoming Constitution Art. 2 perspective, the legislature has the authority within Art. 1, § 9 of the Wyoming Constitution to continue, discontinue, or modify the generic obligation of the grand jury. With a determined separation-of-powers status, I have no difference from the comparable discussion in the majority opinion.\n\nConcomitantly, however, the Supreme Court cannot abdicate its separate constitutional power and responsibility to assure citizen guarantees of rights expressly enumerated in Art. 1 of the Wyoming Constitution, or empirical, implicit, or explicit responsibilities for appropriate rules of procedure for that criminal justice institution in operation in accord with both inherent powers of Art. 5 of the Wyoming Constitution, and statutory designation as found in §§ 5-2-114 and 5-2-115, W.S. 1977. See White v. Fisher, Wyo., 689 P.2d 102 (1984); Matter of Amendment of Court Rules for Fees and Costs, 737 P.2d LXXXIX (1987), Urbigkit, J., dissenting; and the comprehensive evaluation of exercised responsibility of the Wyoming Supreme Court, Gallivan, Supreme Court Jurisdiction and the Wyoming Constitution: Justice v. Judicial Restraint, XX Land \u0026 Water L.Rev. 159 (1985).\n\nAlthough under the call-to-reform criteria the continuation of indictment function of the grand jury in its present form is probably unjustified, such decision is legislative; however, the operational function and constitutional characteristics cannot properly be ignored and unattended by this court. It is in the perspective of prior statutes, new statutes that now control, and recognized principles of constitutional law, that I respectfully dissent to the decision of this court in affirming the conviction of Joseph M. Hennigan, Jr. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe thesis to be presented in this dissent in assessing the supervisory responsibilities of the Supreme Court to provide a properly operative system as long as legislatively retained, is that more than legislative, the problems and answers are judicial, springing directly from the Wyoming Constitution.\n\nMoses Lasky, a prominent California attorney, in analysis of the legality of folklore as applied to the subject of California antitrust law, considered inconsistent assertions which \"are also mythology\" to suggest that mythical history is \"created to support legal propositions reached without regard to history.\" Indeed, he suggests that the premise of legal opinions is often selected after the conclusion has been reached:\n\n\"* * * A Court may create law based upon a falsehood of history, and its law is the law whatever the illegitimacy of its birth. But courts cannot alter truth.\" Lasky, Folklore and Myth in Judicial Opinions — Some Reflections Inspired by Texaco-Getty, 20 U.C.Davis L.Rev. 591, 592 (1987)\n\nHis reactivity to the course of present adjudicatory responsibilities is further amplified in conclusion:\n\n\"* * * Archimedes exclaimed, `Give me a fulcrum on which to rest a lever, and I will move the world.' A cynic might paraphrase, `Give me the premise from which to begin, and I will reach the result I desire.'\n\n\"So it may be with judicial decisions: they do not start with a premise and then by a course of reasoning proceed to their conclusions. In the formal opinion the film indeed runs forward, but before the opinion was written the film was run backward. The court starts with the desired conclusion and then, by running the film backward, discovers the premises from which to begin the reasoning that will compel the conclusion. And, Miracle Visu, so it does!\" Id. at 607.\n\nI worry that here we do just that in purgation of the Campbell County grand jury process.\n\nAs directly applied to this subject, a comprehensive consideration of the actual function of the grand jury is analyzed in historical detail in Schwartz, Demythologizing The Historic Role of the Grand Jury, 10 American Crim.L.Rev. 701, 770 (1972). In noting the abolition of the grand jury in England, the author reflected:\n\n\"Abolition of the grand jury is not the answer. Even the most conservative among us recognize that `the myth that \"ours is a government of law, not men\" is infinitely cherished, and it is infinitely hollow.' Constitutional provisions are therefore subject to evolution by interpretations which change as swiftly as does membership on the bench of the Supreme Court. Facing the likelihood of narrowed protections at the secondary (trial) level, it would be foolish indeed to abandon the primary barrier between the accused and the accuser, the grand jury. In this age of conflict, it is infinitely more important that the traditional shield be reenforced; that it not continue to degenerate into a mere shibboleth, lauded as a protection when in reality it is not.\"\n\nA recognization that folklore aside, the grand jury is no guardian of liberty is seen in Antell, The Modern Grand Jury, Benighted Supergovernment, 51 A.B.A.J. 153 (Feb. 1965), and substantially amplified by former United States Senator Abourezk in The Inquisition Revisited, 7 Barrister 19 (1980), and of Judge Lucile A. Watts, Michigan Grand Jury an Anachronism or Useful Tool?, 1983 Det.C.L.Rev. 1477.\n\nThe Colorado legislature directly recognized reform by comprehensive curative action in 1977, including adequate instruction; a complete record without off-the-record interstices; subpoena advisement of rights; transactional immunity; target-victim protection; right to testify; right to in-session counsel; and actual record factual support in indictment. Bayless, Grand Jury Reform: The Colorado Experience, 67 A.B.A.J. 568 (May 1981). Similarly, note the recommendation of a tiered review system in decision to seek an indictment; earlier access to grand jury testimony; reduction in size of the panel; counsel representation; and only particularized justified use of hearsay. Sullivan and Nachman, If It Ain't Broke, Don't Fix It: Why the Grand Jury's Accusatory Function Should Not be Changed, 75 J.Crim.L. and Criminality 1047 (1984), supported in reform by earlier publication of the American Bar Association in Janofsky, Association Proposes Grand Jury Reforms, 66 A.B.A.J. 810 (July 1980).\n\nMost literature would generally reflect that\n\n\"* * * today, the grand jury is a total captive of the prosecution who, if he is candid, will concede that he can indict anybody, at any time, for almost anything, before a grand jury.\" Campbell, Eliminate the Grand Jury, 64 J.Crim.Law and Criminality 174 (1973).\n\nSee also Comment, The Improbability of Probable Cause — The Inequity of the Grand Jury Indictment Versus the Preliminary Hearing in the Illinois Criminal Process, 1981 S.Ill.L.J. 281; Note, The Exercise of Supervisory Powers to Dismiss a Grand Jury Indictment — A Basis for Curbing Prosecutorial Misconduct, 45 Ohio St.L.J. 1077 (1984). As concluded in Trichter and Lewis, The Grand Jury, Putative Grand Jury Witnesses and the Right to Limited Counsel — A Historical Overview and Modest Proposal, 20 S.Tex. L.J. 81, 110 (1979):\n\n\"Our government is based on the notion that an individual's rights are of primary importance, and that by safeguarding the right of one person, the rights of all persons are then protected. It has been conceded that what the grand jury is supposed to be, and what it actually is, are two different things. Because of the dominance of its investigative role, and because of the absence of counsel and other pretrial safeguards from such proceedings, the grand jury, at least in respect to the rights of a suspect witness, is an anomaly of American jurisprudence.\"\n\nEven more definitively, as stated in Shannon, The Grand Jury: True Tribunal of the People or Administrative Agency of the Prosecutor?, 2 N.M.L.Rev. 141, 170 (1972), in referring to the monumental study of Dean and later Senator Wayne Morse:\n\n\"* * * Those who would reform [grand jury indictment] might well adopt as their model the sage counsel of one judge from Wisconsin who answered the Morse questionnaire in 1930 with these words:\n\n\"`I can think of no possible use for a grand jury where there is a conscientious prosecutor. Where the prosecutor is no good I cannot imagine where a grand jury is going to make him any better. . . .'\"\n\nElimination of the grand jury has received broad consideration in discussion and analysis generally inclusive of a repetitive criticism of unfairness and incompetency. Miller, Shall the Grand Jury in Ordinary Criminal Cases be Dispensed with in Minnesota?, 6 Minn.L.Rev. 615 (1924). \"Cessante ratione legis cessat et ipsa lex.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Lawyer, Should the Grand Jury System be Abolished?, 15 Yale L.J. 178, 187 (1906).\n\nA comprehensive view of similar import was found in the reformist apologist of the investigatory grand jury by the populist ideology, as discussed by Younger, The Grand Jury Under Attack III, 46 J.Crim.Law and Criminology 214, 225 (1955). The grand jury process is singularly denied in present application, and surely so in its prosecutorial application here. Any idea of an independent function is not supportable in the record made or the activities observed.\n\nAn exceptionally comprehensive consideration is found in Bennett L. Gershman, Prosecutorial Misconduct (1986), Ch. 2, Prosecutorial Misconduct in the Grand Jury, p. 2-1.\n\n\"* * * [T]he discretionary power accorded the prosecutor cannot be justified as a tactical weapon to be used merely to circumvent the preliminary hearing and the benefits that proceeding bestows on the defendant. Unlimited prosecutorial manipulation of that power should no longer be tolerated.\" Note, The Prosecutor's Duty to Present Exculpatory Evidence to an Indicting Grand Jury, 75 Mich.L.Rev. 1514, 1538 (1977).\n\nMore recently, editorial consideration of the Utah experience is directly expressed in an editorial of the Ogden Standard-Examiner, Friday, July 10, 1987, at 14A:\n\n\"The grand jury has been dismissed. It becomes a matter of urgency that the task force, which includes many scholarly minds, be reassembled with a mandate to determine the future of the system in Utah and recommend avenues for major reform.\n\n\"Trial Court Judge Scott Daniels, presiding judge of the 3rd District, made cogent references to the judicial anachronism of a system that is too expensive, too cumbersome, don't protect the rights of the accused as designed. Speaking as a task force member, not as the authoritative spokesmen for the courts, Daniels recommends that the system be eliminated.\n\n\"Daniels suggests that the task force renew aggressively their work to recommend a system of justice such as a special prosecutor to replace the grand jury as a means of investigating extraordinary crimes and corruption.\n\n\"* * * It is clear that something must be done to overcome the confusion, conflicts and ambiguities of the grand jury statute, not to mention a costly system of getting to the bottom of criminal complaints. Legislative reform to eliminate the antiquated grand jury system is imperative.\"\n\nSimilar, although dated nearly 30 years earlier, is reference to North Carolina newspapers, in Watts, Grand Jury: Sleeping Watchdog or Expensive Antique?, 37 N.C.L.Rev. 290, 297 (1959):\n\n\"* * * [T]he inexorable movement seems to be in the direction of by-passing the jury in the accusation process either by virtue of waiver of indictment or by suspension of the indictment requirement in all or in all but capital or serious felony cases,\"\n\nalthough the author concludes that with significant reform, the institution should not be \"lightly cast away.\" Id. at 314.\n\nOf the essence in dissent is the inquiry whether in the improved function of the grand jury we can ignore the supervisory responsibility of the judiciary to answer the manifest failures and defeasances consistently discussed by nearly all current writers on the subject. The justice system functional issue and my constitutional concern are not novel, new, or unnoticed.\n\nIII. ISSUES PRESENTED FOR APPELLATE REVIEW\n\nA. General\n\nIt is recognized that this case as a first-impression decision writes our standard for the future; consequently this court should not be unmindful of its constitutional responsibility of Art. 5, §§ 2 and 3, Wyoming Constitution. In our exercise of appellate review and administrative responsibility, grand jury procedural supervision should not be unwittingly excluded. Comment, Grand Jury Proceedings: The Prosecutor, the Trial Judge and Undue Influence, 39 U.Chi.L.Rev. 761, 767 (1972), discusses the grand jury as an \"arm of the court.\" I cannot justify the \"whatever goes\" attitude of criminal-process justification as the limit of judicial responsibility. Hoffman v. United States, 341 U.S. 479, 71 S.Ct. 814, 95 L.Ed. 1118 (1951); Note, Powers of Federal Grand Juries, 39 Cal.L.Rev. 573 (1951).\n\nI do not ignore the abrasive protection afforded federal grand juries by the trend of recent United States Supreme Court cases. United States v. Calandra, 414 U.S. 338, 94 S.Ct. 613, 38 L.Ed.2d 561 (1974); Costello v. United States, 350 U.S. 359, 76 S.Ct. 406, 100 L.Ed. 397, reh. denied 351 U.S. 904, 76 S.Ct. 692, 100 L.Ed. 1440 (1956); and United States v. Mechanik, supra, 475 U.S. 66, 106 S.Ct. 938, 89 L.Ed.2d 50. This case, it is to be remembered, involves a state court, and invokes state laws which construe and apply our state Constitution. The United States Congress, administrative agencies such as the Department of Justice, and the federal judiciary, have an emplaced, mandatory grand jury. Federal impediments to an equivalent process by indictment realistically affording equality with the information-charging process do not exist in this state and should not now be created out of whole cloth in contravention of Wyoming constitutional due process and equal protection.\n\nB. Recording and Grand Jury Records\n\nDespite its extensiveness, the discussion of this subject in the majority opinion appears to be totally academic. Divined from the prosecuting attorney's prior experience in the federal court system grand juries, as well as appearances that a reporter was present, together with a partial but extensive actual record, amplified by the cuteness in brief reference, it would appear that the total session was \"reported.\" This scenario, lacking anything to contribute a contrary notion and with Hennigan out of confinement anyway by commuted sentence, adds little as to whether or not the prosecutor in this case only called in the reporter after the first 67 indictments, since there is no transcribed record for these appeals.\n\nThe terrible danger of the court's discussion is to suggest that a future nonutilization of reporters at grand jury sessions, contrary to universal federal practice and at least by implication contrary to rules and the recently enacted statute of this state, might be acceptable. See § 7-5-206, W.S. 1977, 1987 Replacement. A record is required after refusal to testify for action properly to be taken upon trial court appearance. The statutory provision, \"If a witness appearing before a grand jury refuses, without just cause shown,\" will obviously impose a burden if there is no record of earlier events invoking refusal.\n\nFurthermore, § 7-5-208, W.S. 1977, 1987 Replacement, obviously contemplates a record:\n\n\"(a) Disclosure of matters occurring before the grand jury, other than its deliberations and the vote of any juror, may be made to the district attorney for use in the performance of his duties. The district attorney may disclose so much of the grand jury's proceeding to law enforcement agencies as he deems essential to the public interest and effective law enforcement.\n\n\"(b) Except as provided in subsection (a) of this section, a juror, attorney, interpreter, stenographer, operator of a recording device or any typist who transcribes recorded testimony may disclose matters occurring before the grand jury only when so directed by the court preliminarily to or in connection with a judicial proceeding or when permitted by the court at the request of the defendant upon a showing that a particularized need exists for a motion to dismiss the indictment because of matters occurring before the grand jury.\"\n\nPerjury charges cannot be pursued unless a record is made. Selective reporting might afford a usable trial defense if perjury should be charged and prosecuted where the entire sessions have not been reported.\n\nFinally, I would question that a prosecutor can obviate discovery rights of Rule 18, W.R.Cr.P. found in subsection (a)(1) or whatever Jencks Act rights are provided in subsection (b), by failing to provide a reporter for the sessions. This court brings unnecessary problems to procedure and due process in its present failure to exercise both adjudicatory responsibility and constitutional supervision in providing, as generally exists for other processes in criminal procedure, that a record will be made and retained for transcription or audio consideration. I would find that the prosecuting attorney, with or without concurrence of the district court, if he did exclude the reporter's participation occasionally or regularly, has deliberately undertaken to avoid due process and equal protection and consequently calls into question the validity of the session. In addition to defending counsel, appellate jurists might have a vicarious interest in the process used and in any construction of the law given to the grand jury by the prosecuting attorney.\n\nC. Discovery and Disclosure — Grand Jury Secrecy\n\nThe sole Wyoming statute in force at this time relating to confidentiality of the grand jury session was derived from § 75, Chapter XIV, Wyoming S.L. 1876:\n\n\"No grand juror shall be allowed to state or testify in any court in what manner he or other members of the grand jury voted on any question before them, or what opinion was expressed by any juror in relation to such question.\" Section 7-5-213, W.S. 1977. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe Wyoming rule on discovery in criminal cases, Rule 18, W.R.Cr.P., Discovery and inspection, is comparable with some of the provisions of Rule 16, F.R.Cr.P. and some of the Jencks Act provisions of Rule 26.2, F.R.Cr.P., with substantial differences. Most notable in the resulting provisions is the elimination of Rule 16(c)(3), F.R.Cr.P.:\n\n\"Except as provided in 612(i) and 26(2) and subdivision (a)(1)(a) of this rule, these rules do not relate to the discovery of the grand jury.\"\n\nCountervailing the provisions in regard to production of a statement of witness as derived from Rule 26.2(f), F.R.Cr.P., the definition of the term \"statement\" in Rule 18(c)(4), W.R.Cr.P. does not include a \"statement however taken or recorded or transcription thereof made by the witness to a grand jury.\" See an analysis of the federal grand jury in Orfield, The Federal Grand Jury, 22 F.R.D. 343. This confusion of Wyoming rule as countervailing the Jencks Act constitutional concern is unexplained and unexplainable. Cf. Jones v. State, Wyo., 568 P.2d 837 (1977); DeLuna v. State, Wyo., 501 P.2d 1021 (1972). Consequently, the application of federal precedent to the status of Wyoming law, except in the constitutional and due-process purviews, is minimally persuasive in view of the limited requirement of confidentiality afforded by then effective Wyoming statutes.\n\nActually, it appears that the investigating officer was available, apparently identified, but not called to testify before the grand jury. Whatever, if anything, this process did to isolate the investigation reports of Lauck from discovery in the open-file arrangement later professed by the prosecuting attorney cannot be established on this record. The particular document beneficial to the defense if available either in open-file or Jencks Act disclosure would be the undercover agent's investigation report in comparison with trial testimony. See Rule 18(c)(1), W.R.Cr.P. The relevant grand jury issue was whether the hearsay indictment report was consistent with trial testimony. Shaded meaning is not unknown in statement or testimony where the searchlight of knowledgeable cross-examination is extinguished. Capacity to question affords a factor of validity.\n\nIn discovery activities, following arrest, arraignment on July 5, 1985, and plea entry, a general-case management order was issued and filed July 11, 1985 for each of the persons represented by the Public Defender's office (two local attorneys), providing:\n\n\"1. All motions under Rules 9, 12, 13, 16B(1), 16(b)(2), 17, 18, 22, 23 [except 23(d)], and 40 and demands under Rules 16.1 and 16.2, W.R.Cr.P. shall be filed and scheduled so as to be heard on or before Aug. 19, 1985.\n\n\"2. This case will be tried to a jury of 12 commencing on 9th day of September, 1985, at the hour of 9:00 o'clock a.m. (stacked case # 7) in a District Courtroom, Campbell County Courthouse, Gillette, Wyoming.\n\n\"3. Pursuant to Rule 19, W.R.Cr.P. a pretrial conference will be held on the 19th day of August, 1985 at the hour of 1:30 o'clock P.M., (scheduled for 1 hour) in the office of the undersigned.\"\n\nThereafter, on August 12, 1985 the State filed a motion for reciprocal discovery, requesting examination, inspection, photocopy, etc.:\n\n\"1. List of all witnesses that the defendant intends to call at the trial in this matter.\n\n\"2. Copies of any and all written statements made by witnesses to be called by the defendant (excluding statements of the defendant).\n\n\"3. Any scientific or medical reports, books, papers, documents, or other tangible objects the defendant expects to produce at trial.\n\n\"4. Production for viewing of any and all tangible evidence in the possession of the defendant that the defendant expects to introduce at trial.\"\n\nThe anomaly of this request, while grand jury records were denied, cannot be unnoticed in unjustified expectancy, if not chutzpah, since on the same day, the Public Defender, through two attorneys, Steven Weerts and Michael Rosenthal, had filed a motion to produce transcript and minutes of the grand jury proceedings and evidence related thereto in behalf of 22 indicted individuals of the grand jury indictees on the 45 cases for which they had then been appointed. On August 16, 1985, the State filed a demand for notice of alibi in the form required by Rule 16.1, W.R.Cr.P. and Rule 12, F.R.Cr.P. The Public Defender, aided through the assistance of the Defender Aid Program at the University of Wyoming, by Professor Gerald M. Gallivan, then moved to dismiss the indictments, with extensive brief support, stating in part:\n\n\"The defendants have no direct knowledge of the course of investigation and prosecution because of the self-serving cloak of secrecy. The minimal information available from court files has been supplemented by press releases and common talk. Any inaccuracies in the following are unintentional and result from the prosecution's choice of secrecy.\n\n\"5. The Grand Jury proceedings were not recorded, thereby preventing a review of their sufficiency and propriety. See A B A Grand Jury Principle 15. Compare the recording requirements at the preliminary hearing.\"\n\nThe prosecuting attorney responded in part:\n\n\"Rule 6(e)(3)(c) Federal Rules of Criminal Procedure provides the following:\n\n\"(c) Disclosure otherwise prohibited by this rule of matters occurring before the grand jury may also be made\n\n\"(i) when so directed by court preliminary to or in connection with the judicial proceedings; or\n\n\"(ii) when permitted by a court at the request of the defendant, upon a showing that grounds may exist for a motion to dismiss the indictment because of matters occurring before the grand jury.\n\n\"If the court orders disclosure of matters occurring before the grand jury, the disclosure shall be made in such manner, at such time, and under such conditions as the court may direct.\n\n\"* * * The State must point out that the above named defendants all have submitted Notices of Discovery to the State and the State has submitted all police reports, chemical testing reports, evidence log-in reports, transcribed telephone conversations and other investigative information contained in the files of the above named defendants.[ \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e]\n\n\"* * * The present Motion to Dismiss the indictments against the defendants and the Motions by the above named defendants for discovery and the State's compliance with the discovery motion, mandates that the defendant's Motion to Dismiss Indictments in the above captioned matter be denied.\"\n\nAt the hearing, appellant's counsel considered the lack of factual knowledge of what record was available.\n\nAfter an extended hearing-time discussion, the order denying motion to dismiss filed September 9, 1985 also considered rights to discovery and provided:\n\n\"8. There are sufficient methods under the Wyoming Rules of Criminal Procedure for discovery with regard to Grand Jury Indictments to avoid a denial of due process.\n\n\"9. The lack of a preliminary hearing should not have any substantial effect on discovery by the defendant. Further, there is no constitutional or common law right to a preliminary hearing.\"\n\nThe problem with the foregoing is that none of it is centered upon the actual fact that a record may have been made and that a court reporter actually was recording the entire session, which fact was never made known to defendant in court session or otherwise. The first time this court or, as far as is known, the Public Defender became aware of the fact that there was any transcription record of the grand jury session as retained by the prosecuting attorney until after his election defeat and his departure from Wyoming, was by a telephone call. The clerk of the district court telephoned on Friday, April 10, 1987, revealing for the first time that the prosecuting attorney had retained this record without filing it with her until after other records had been certified and sent to the Supreme Court upon appeal. Documents to be included by the Designation of Record dated February 19, 1986, could not, of course, be honored by the clerk of the district court because these records had not been filed by the prosecuting attorney:\n\n\"COMES NOW the Defendant, Joseph M. Hennigan, by and through his Attorney, Michael B. Rosenthal, and hereby designates the entire transcript and all court records as the record on appeal, including without limitation, the peremptory challenges, pleadings, briefs, orders, exhibits, instructions and judgment and sentence.\n\n\"Pursuant to Rule 2.01 of the Wyoming Rules of Appellate Procedure, as amended, I would like to request that the transcription in the case of The State of Wyoming v. Joseph M. Hennigan, Criminal Action No. 2061, be prepared. Please include all pre-trial proceedings, all trial proceedings, including voir dire, opening and closing statement, post-trial motions and the sentencing hearing.\n\n\"Judge Judson has signed an Order allowing this appeal to proceed in forma pauperis. Therefore, the transcript will be paid by the County, pursuant to Section 7-11-518 of the 1977 Wyoming Statutes.\n\n\"If you have any questions about the composition of this record, please do not hesitate to contact me. Thank you very much for your assistance in this matter.\n\n\"Very truly yours,\n\n\"/s/\n\n\"Michael B. Rosenthal\n\n\"Assistant Public Defender\"\n\nFollowing denial by the district court of the motion to quash indictments and dismiss the grand jury, as the result of the hearing on August 29, 1985, the Public Defender, in behalf of 43 named individuals, next filed a proceeding in this court, as the appropriate appellate tribunal, for an order staying proceedings. The issue was reiterated in the memorandum of law accompanying the application which repeated the complaint about the absence of a known record of the grand jury proceedings:\n\n\"Compounding the perfunctory indictment process are the problems that come to light before trial. The secrecy, non-discoverability and non-reviewability of proceedings not only undermines the reliability of the indictment process, but the defendant may well go to trial without the basic knowledge necessary to defend the charges.\n\n\"The Grand Jury proceedings were not recorded, thereby preventing a review of their sufficiency and propriety. See ABA Grand Jury Principle 15. Compare the recording requirements at the preliminary hearing.\n\n\"In the present case, the words `A true bill' have been typed at the bottom of each pre-prepared indictment in absolute defiance of the Statute. The significance of this `rush to judgment' increases in the context of a Grand Jury returning 67 indictments and 232 counts in less than 3 days. Taking into consideration the requirement under Section 7-5-206 that no attorney nor any other unauthorized person be present during the expression of Grand Juror's views or the giving of their votes on any matter, one is left with a picture of hurried comings and goings in order to return 20 indictments and 80 counts per day, scarcely time to endorse `A true bill' on each.\"\n\nAttached to the proceeding filed in this court, was a copy of the American Bar Association Grand Jury Policy and Model Act (1982), which included as items of relevance:\n\n\"15. Principle # 15 would mandate stenographic or electronic recording of all matters before the grand jury — except the deliberations of the grand jury itself. This would represent a logical step forward in grand jury reform, and is not inconsistent with the necessity of maintaining grand jury secrecy. The judge's charge to the grand jury would be recorded, as would the prosecutor's introductory remarks and testimony and questioning of all witnesses. Some 31 states already require recording of all grand jury proceedings other than votes and deliberations, and an additional 6 states permit it, according to a Library of Congress study (printed in 1976 Hearings Record, House Judiciary Subcommittee on Immigration, Citizenship and International Law, at 714).\n\n\"Since this proposal was adopted by the ABA in 1977, the Federal Rules of Criminal Procedure have been amended to require recordings of all grand jury proceedings. This is a major step forward.\n\n\"Major groups have supported this requirement. The American Law Institute, in its Model Code of Pre-Arraignment Procedure, urges that a record be made of all proceedings before the grand jury. The ABA Standards for Criminal Justice on the Prosecution Function [§ 33.5(c)] — already ABA policy — provide that, `The prosecutor's communications and presentations to the grand jury should be on the record.' The accompanying commentary points out that `since grand jury proceedings are generally secret and ex parte, it is particularly desirable that a record be made of the prosecutor's communications and representations to the jury.' The Prosecution Standards of the National District Attorneys Association [§ 14.2(F)] also urge that `all testimony before the grand jury should be recorded.' Recording will aid the prosecution — by insuring that perjured testimony does not go unpunished. Recording would also act as a restraint on the prosecutor not to exercise undue or improper influence on the grand jury.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThis court was not advised that the assumption of fact was in error and that at least some part of the grand jury session had been reported and partly transcribed. Consequently, not only was the trial judge misled, but this court was also misled. A serious ethical concern is presented.\n\nIn his brief, appellant related to the absence of the record on the assumptive basis that no record of the grand jury session existed:\n\n\"5. the failure to record the proceedings and the vote as to each count.\"\n\nIn response, the attorney general failed to afford information to this court that a record did exist, and to the contrary stated in summary:\n\n\"Appellant's battery of charges leveled against the grand jury system in Wyoming can be reduced to its simplest terms, he was not accorded discovery in the format he preferred, i.e., through a preliminary hearing. In making this assault Appellant ignores that he has no constitutional right to discovery, that a preliminary hearing is not intended to serve as a discovery device, and that he was afforded the usual discovery provided by our rules of procedure.\"\n\nWe should not ignore explicit rules or current authority which, in this case, were hidden by suggestion of the prosecutor that a record did not exist or could not be obtained. I deny avoidance of explicit Wyoming rule and statutory provision by the use of secrecy to hide the fact that a record could be obtained. The importance is recently reemphasized in Jones v. State, 297 Md. 7, 464 A.2d 977 (1983), and Martinez v. State, 309 Md. 124, 522 A.2d 950 (1987), wherein the Maryland court said that once a prosecution witness has testified on direct examination, a defendant is entitled to inspect that witness' grand jury testimony for cross-examination purposes without any further showing of need; here, this would include the suppression hearing, where the appropriateness for disclosure is as compelling as at trial. The court pointed out that suppression hearings are often the most important phase of the prosecution and resemble full trials in many respects.\n\nDiscussion of discovery within the grand jury indictment scenario becomes something to be pursued between obiter dictum and academic or hypothetical review on this record. In retrospective evaluation, the prosecutor intentionally, deliberately, and effectively misled defense counsel and the court as to what record might exist. As a consequence, the trial court, in its order of September 9, 1985, denied the motion to dismiss (without affording discovery), essentially aproving that which, as far as was known, did not exist — even though it did exist, at least in some still unknown part. The result was no actual right to discovery although authorized pro forma by the court. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nOn September 2, 1986, after primary election defeat and early departure from Wyoming, Murray, as the county prosecuting attorney, filed a motion to seal notes and records:\n\n\"COMES NOW the State of Wyoming by and through the undersigned Campbell County and Prosecuting Attorney and moves this honorable court for an order sealing the notes and records of the Campbell County Grand Jury which met from June, 1985 to January, 1986.\n\n\"As grounds for this motion the State of Wyoming alleges and asserts that:\n\n\"1. The proceedings of the Campbell County Grand Jury and thus the notes taken during those proceedings are secret and cannot be disclosed absent an order from this court. In addition the Grand Jury maintained records pursuant to the charging order of this court which reflect the business conducted by the Grand Jury.\n\n\"2. The records and notes have been consolidated into two boxes which have been sealed pending disposition by the court.\n\n\"WHEREFORE the State of Wyoming moves this court to direct the Clerk of the District Court to take custody of the records and seal them pending further order of the court.\"\n\nThe resulting order, dated September 2, 1986, stated:\n\n\"The State of Wyoming's `Motion to Seal Notes and Records of the Campbell County Grand Jury' having come before the court, the court hav[ing] reviewed the motion, and being otherwise advised in the premises;\n\n\"IT IS THEREFORE ORDERED AND ADJUDGED that the Clerk of the District Court shall take custody of the notes and records of the Campbell County Grand Jury which are presently in two sealed boxes, seal and keep same until further order of the court.\"\n\nIn review of this record, after current discovery that some records did exist, this court addressed a request of counsel by reference to the district court for consideration, to which an order was issued:\n\n\"The above-entitled cases having come before the Court for the purpose of considering appellants' motion to supplement the record on appeal with the transcripts and other records of the proceedings of the grand jury, and the Court finding no good reason why the record should not be so supplemented, it is\n\n\"ORDERED that all transcripts and records of the proceedings of the grand jury be transmitted to the Supreme Court of Wyoming.\"\n\nThe point in academic consideration of this constitutional discovery issue is informative about what was furnished: transcript of hearing of motion to dismiss August 29, 1985; two files containing order convening, jury list, jury summons and returns, precipes, subpoenas, returns, motion and order to unseal grand jury records; 30 volumes of grand jury testimony, involving interviews of two dozen persons taken in the period between July and December, 1986; plus notification that the testimony of 16 witnesses also taken in the same period was not transcribed. In casual review, we find what was not included: no exhibit of any kind, leading one to wonder whether 94 indictments were obtained without a single exhibit (including samples of controlled substances), and specifically no undercover agents' investigative reports; no notes or records of the grand jury referenced in the motion to seal; no transcript of the initial charging session; no record of advice furnished to the session generally as to the process; and no record of witness appearances before the district court to record testimony or grant immunity, except Volume IIIA as to one witness. It takes less suspicion than this experienced practitioner can afford to deny suggestion that the absence of candor and exercise of fair-minded prosecutorial responsibility is less than discernible in evaluation of this bobtail record said to be all transcripts and records of the proceedings of the grand jury.\n\nSimplistically, the majority apprehend to this arrogant display a presumption of regularity. The lack of candor of the prosecutor leaves circumstantial justification to question that unsupported assumption. We also make note of an apparent misunderstanding of the record where the court says:\n\n\"There is also an inconsistency in Hennigan's position. He claims that the failure to make a record of the grand jury proceedings has deprived him of the right to discovery in almost the same breath in which he claims that the indictment was based wholly on hearsay. Both could not be true. Certainly the acceptance of the assumption that this indictment was based upon hearsay testimony makes clear the proposition that no prejudice could attach with respect to the failure to report the proceedings as there would have been no statement available of a witness who testified at the trial.\" Majority opinion at 370.\n\nWe know what we do from admissions by brief of the State clearly stating how the initial 67 indictments were factually founded:\n\n\"The grand jury heard evidence received through testimony of the supervising officers of the undercover agent, containing information about the contacts and buys of controlled substances from the above named defendants. This is determined sufficient for the grand jury to find probable cause.\"\n\nDiscovery in a material sense invoking the perjury inquiry, related to a comparison of what was provided the grand jury with what was said at trial, is the first obvious concern. Assuming, rationally, that Deputy Hamilton summarized and discussed investigative reports of Lauck to the grand jury, trial counsel would be finitely interested in those reports for comparison with trial testimony as well as procedural aspects involving instructions given by the court and \"legal instruction\" provided by the prosecutor. From what is more than a somewhat academic inquiry, it is fruitful to wonder what Murray actually did during the grand jury discussion and voting, including method of use of the pre-typed indictments.\n\nLogically, then, to further regurgitate the Gillette scenario in behalf of Hennigan, who after all has secured a commutation of his sentence, we are called to analyze standards for the future in event of recurrence in the context of the pre-May 22, 1987 Wyoming law, the federal law from which precedence is announced, and then the present Wyoming statutes and rules. Perhaps more so than in any subject on grand jury law, availability of information for defense counsel provides the only meaningful protection against abuse, misuse, and totalitarianism in the system operation.\n\nIn adoption of the rules of criminal procedure, this court provided for discovery in Rule 18, W.R.Cr.P., similar to Rule 16, F.R. Cr.P. and the exclusion of rule of evidence, Rule 1101(b)(2), F.R.Cr.P.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nBy statute, included in the 1876 territorial code as Ch. LXI, Compiled Laws of Wyoming 1876, and now found in § 1-27-125, W.S. 1977, the use of habeas corpus is defined:\n\n\"Habeas corpus is not permissible to question the correctness of the action of a grand jury in finding a bill of indictment, or a petit jury in the trial of a cause nor of a court or judge when acting within their jurisdiction and in a lawful manner.\"\n\nSince the Wyoming rule provision for discovery accords rights similar to the federal process, I would apply the comment of extensive authorities found in Federal Criminal Code and Rules, p. 70 (West 1986 ed.), as referenced to a dozen law journal articles and extensive case law. State v. Moffa, 36 N.J. 219, 176 A.2d 1 (1961). Summarized accurately:\n\n\"The extent to which pretrial discovery should be permitted in criminal cases is a complex and controversial issue. The problems have been explored in detail in recent legal literature, most of which has been in favor of increasing the range of permissible discovery.\" Federal Criminal Code and Rules, supra, Notes, p. 70.\n\nThe newly enacted statute now provides, with reference to secrecy and discovery:\n\n\"(a) After the grand jury is impaneled and sworn, the district judge shall charge the jurors as to their duties particularly to the obligation of secrecy which their oaths impose, and give them any information the court deems proper concerning any offenses known to the court and likely to come before the grand jury.\" Section 7-5-202, W.S. 1977, 1987 Replacement.\n\n\"(a) Disclosure of matters occurring before the grand jury, other than its deliberations and the vote of any juror, may be made to the district attorney for use in the performance of his duties. The district attorney may disclose so much of the grand jury's proceeding to law enforcement agencies as he deems essential to the public interest and effective law enforcement.\n\n\"(b) Except as provided in subsection (a) of this section, a juror, attorney, interpreter, stenographer, operator of a recording device or any typist who transcribes recorded testimony may disclose matters occurring before the grand jury only when so directed by the court preliminarily to or in connection with a judicial proceeding or when permitted by the court at the request of the defendant upon a showing that a particularized need exists for a motion to dismiss the indictment because of matters occurring before the grand jury.\n\n\"(c) No obligation of secrecy may be imposed upon any person except in accordance with this section and W.S. 7-5-207.\" Section 7-5-208, W.S. 1977, 1987 Replacement.\n\nConsequently, the legislature adopted the particularized need criteria for support of a motion to dismiss the indictment because of \"matters occurring before the grand jury.\" \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAs with all other problematic aspects of grand jury operation, the issue of availability of information has usually been considered in the context of secrecy, disclosure and discovery.\n\n\"There remain, therefore, on principle, no cases in which, after the grand jury's functions are at an end, the privilege of witnesses to have their testimony blanketed in secrecy should be deemed to continue. This is, in effect, the law as it is generally accepted today, but it is not usually stated so sweepingly. By statute or decision the rule of absolute secrecy has been abolished, and the common expression of the rule now is that disclosure may be required `whenever it becomes necessary in the course of justice.' Rule 6(e) of the Federal Rules of Criminal Procedure is the statutory basis for disclosure in the federal courts and it provides for inspection of grand jury minutes both by the prosecution and defense within the discretion of the court. Similar provisions are in effect throughout most of the states.\" Comment, The Impact of Jencks v. United States and Subsequent Legislation on the Secrecy of Grand Jury Minutes, 27 Fordham L.Rev. 244, 245 (1958).\n\nComment, Disclosure of Federal Grand Jury Material, 68 J.Crim.Law \u0026 Criminology 399 (1977); Comment, Discovery By a Criminal Defendant of His Own Grand-Jury Testimony, 68 Colum.L.Rev. 311 (1968); Note, Lifting the Bridled Veil: Disclosure of Grand Jury Proceedings Under Rule 6(e) of the Federal Rules of Criminal Procedure, 3 Am.J. of Trial Advocacy 459 (1980); Seltzer, Pre-trial Discovery of Grand Jury Testimony in Criminal Cases, 66 Dick.L.Rev. 379 (1962).\n\nIn addition to the direct issue of discovery and disclosure, the general subject of secrecy has occasioned frequent, critical and comprehensive review. See 2 Beale \u0026 Bryson, Grand Jury Law \u0026 Practice; Comment, Secrecy in Grand Jury Proceedings: A Proposal For a New Federal Rule of Criminal Procedure 6(e), 38 Fordham L.Rev. 307 (1969); Note, A Reexamination of the Rule of Secrecy of Grand Jury Minutes in the Federal Courts, 34 N.Y.U.L.Rev. 606 (1959); Kennedy and Briggs, Historical and Legal Aspects of the California Grand Jury System, 43 Cal.L.Rev. 251 (1955); Note, Grand Jury Minutes and the Rule of Secrecy in Federal Litigation, 55 Nw.U.L.Rev. 482 (1960). In one of the more significant early reviews on the subject, Professor Sherry made these comprehensive remarks:\n\n\"* * * In the light of this experience, and since it is self-evident that disclosure is far more compatible with a just, fair and equitable administration of justice than the policy of secrecy, it seems plain that there is no rational basis for the opinion that complete grand jury secrecy is indispensable. Liberal as some courts may be in permitting inspection of the minutes for the purpose of impeachment or in the case of `particularized need,' the prevailing, traditional policy of secrecy is an anachronism that has long outlived any real necessity.\" Comment, Grand Jury Minutes: The Unreasonable Rule of Secrecy, 48 Va.L.Rev. 668, 684 (1962).\n\nSee Maldonado v. State, 93 N.M. 670, 604 P.2d 363 (1979); and Comment, Criminal Procedure — Grand Jury — Inadmissible Evidence, Due Process, 11 N.M.L.Rev. 451 (1981).\n\nA demonstration of the trend and delineation of the reasons is found in Connecticut, where by recent constitutional amendment the indicting function of the grand jury was replaced by information in serious-crime cases, as described by the Connecticut Supreme Court in State v. Rollinson, 203 Conn. 641, 526 A.2d 1283, 1288 (1987):\n\n\"The changes * * * represent the collective judgment of the legislature and of the voters that indicting grand juries did not provide adequate safeguards for those accused of having committed serious crimes. As we noted in State v. Mitchell, 200 Conn. 323, 326-27, 512 A.2d 140 (1986), `[a]lthough originally conceived as a shielding device to protect individuals from unfounded prosecutions [citation] the grand jury system came to be widely criticized for its secret operation and its ex parte nature. [Citations.]'\n\n\"The grand jury system precluded the accused person from effective participation in its processes and precluded judicial review of the evidentiary basis of any indictment that the grand jury might return.\"\n\nFurther support for a modernized or enlightened view is found in approval by the American Bar House of Delegates, Grand Jury Principle No. 32 (1987), which \"provides for the release of all grand jury materials to the defendant after indictment unless, upon a showing of good cause, a court decides that a protective order is appropriate.\" 56 U.S.L.W. at 2095.\n\nD. Hearsay\n\nIt is not the burden of my dissent to exclude all hearsay from indictment and preliminary-hearing processes, although legalistic justification for a requirement of real, knowledgeable evidence can be found in logic and precedent. In due-process terms, we should not justify second-hand evidence when the real thing, namely the actual witness, is available. I do not accord Wyoming justice to cases such as State v. Higgins, 201 Conn. 462, 518 A.2d 631 (1986) (before that state constitutionally abandoned the grand jury process), in adopting United States v. Mechanik, supra, by rote. Better evidence when readily available but not used should justify indictment dismissal.\n\n\"The practice — as in the instant case — of relying on hearsay rather than upon the testimony of eye-witnesses is pernicious for two reasons. First, it habituates the grand jury to rely upon `evidence' which appears smooth, well integrated and consistent in all respects. Particularly because neither cross-examinations nor defense witnesses are available to them, grand jurors do not hear cases with the rough edges that result from the often halting, inconsistent and incomplete testimony of honest observers of events. Thus, they are unable to distinguish between prosecutions which are strong and those which are relatively weak. All cases are presented in an equally homogenized form. A grand jury so conditioned is unable to adequately serve its function as a screening agency. It cannot exercise its judgment in refusing to indict in weak cases where, technically, a prima facie case may have been made out. It is, moreover, unlikely to demand additional evidence.\n\n\"The second reason the practice is undesirable is that it prevents the defendant from utilizing grand jury testimony in cross-examining witnesses who will testify at the trial. Since no witness the government intends to use is called before the grand jury, it avails a defendant little to have the grand jury testimony furnished to him at the trial.\" United States v. Arcuri, 282 F. Supp. 347, 349 (E.D.N.Y.), aff'd 405 F.2d 691 (2d Cir. 1968), cert. denied 395 U.S. 913, 89 S.Ct. 1760, 23 L.Ed.2d 227 (1969).\n\nProbably the most controversial and criticized penumbras of the grand jury denominated inquiries is the use of hearsay evidence. Standards utilized in various jurisdictions move from complete acceptance as existent here to the further removed reform status where normal rules of trial admissibility are applied. Addressing the subject in consonance of a rule of reason, if the total grand jury system justifies retention, the moderate view is clearly indicated by justice, due process, and rational use. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe rule followed is generally a principle of necessity that a total hearsay prosecution is unacceptable, but the use of some hearsay is not a basis for successful attack on the grand jury indictment if the live witness is not reasonably available to testify. Directly, this means that Lauck, and not the completely uninformed supervisor, should have provided actual rather than second- or even third-hand hearsay testimony as was apparently presented in the original indictments in these cases. This rule accords with the general practice of modern-view states, and is not inapposite to the federal court practice by manual direction of the Department of Justice now utilized.\n\nIn addressing indictments based on hearsay, the New York courts have said:\n\n\"* * * [A]s a matter of public policy, the courts, in an effort to deter baseless prosecutions, have established that criminal prosecutions be underpinned by the sanctity of an oath which would subject the complaint to the penalty of perjury if it is willfully false * * *.\" People v. Bishop, 64 Misc.2d 147, 314 N.Y.S.2d 419, 420 (1970).\n\nUnabashed hearsay does not necessarily meet this New York test. In like rationale, in a concurring opinion in State v. Parks, Alaska, 437 P.2d 642, 645-646, 37 A.L.R.3d 605 (1968), Justice Rabinowitz, one of the premier justices of current time, discerned:\n\n\"In State v. Shelton [Alaska, 368 P.2d 817, 818-819 (1962)] this court said that one of the purposes of grand juries, as provided for in article I, section 8 of the Alaska constitution, is to carry out the vital function of protection of the innocent against oppression and unjust prosecution. Unless this court is prepared to change its evaluation of the role that grand juries actually play, or should play, in our society, rejection of the Supreme Court of the United States' construction of the fifth amendment, announced in Costello v. United States, is indicated.\n\n\"If the institution of the grand jury is viewed as an anachronism, then Costello has appeal, for there the Supreme Court held that an indictment proper on its face returned by a legally constituted and unbiased grand jury is sufficient to require a trial on the merits. The Supreme Court in Costello also emphasized the likelihood of interminable delays and abuses of criminal practice which would result if indictments were held subject to attack on grounds of the inadequacy, or incompetency, of the evidence which was presented to the grand jury. Admittedly, these are factors which must be considered in the shaping of any system for the administration of criminal justice. Yet it seems to me that our system of criminal laws must include procedures whereby cases in which there is an absence of reliable evidence can be detected and filtered out prior to the trial stage. Before an individual suffers any of the serious inconveniences which are apt to ensue upon the return of a felony indictment (arrest, loss of job, humiliation, etc.), there should be a reliable determination made as to the probability of his guilt.\"\n\nSee in accord, State v. Gieffels, Alaska, 554 P.2d 460, 465 (1976), subsequently retried and affirmed in Gieffels v. State, Alaska, 590 P.2d 55 (1979):\n\n\"In restricting the type of testimony which may be introduced to the grand jury, it is not our intention to turn this stage of the proceedings into a mini-trial. However, the rationale for limiting hearsay testimony appears evident; before the accused suffers any of the grave inconveniences which are apt to ensue upon the return of a felony indictment, there should be a reliable determination made as to the probability of his guilt. This can best be guaranteed when witnesses against the accused appear in person before the grand jury so that the panel can view their demeanor and subject them to cross-examination. In our view hearsay evidence, if unchecked, would erode the protective value of the grand jury so as to make it nothing more than an administrative arm of the district attorney's office. If the grand jury indictment process is to fulfill its intended functions, this must not be allowed to happen.\"\n\nThe struggle of the federal courts, commencing with some recognition of the philosophy of Judge Learned Hand in United States v. Garsson, 291 F. 646 (S.D.N.Y. 1923), came to United States v. Costello, 221 F.2d 668 (2d Cir. 1955), reargument denied 232 F.2d 958 (2d Cir. 1956), in which even Judge Hand recognized that cases should exist where\n\n\"`* * * the finding of a grand jury is based upon such utterly insufficient evidence, or such palpably incompetent evidence as to indicate that the indictment resulted from prejudice, or was found in wilful disregard of the rights of the accused.'\" Id. at 679, quoting from United States v. Farrington, 5 F. 343, 348 (D.C.N.Y. 1881).\n\nAssessing the symptom as a cure for the disease, the United States Supreme Court in Costello v. United States, supra, birthed the rule that even if all the evidence presented to the grand jury was hearsay, no basis to quash the indictment existed. Neither the historical assumptions manifested by the opinion nor the perspicacity to recognize future problems as reflected by later cases was evidenced. It was apparent that Justice Burton in concurrence had more clearly understood:\n\n\"* * * I agree with Judge Learned Hand that `if it appeared that no evidence had been offered that rationally established the facts, the indictment ought to be quashed; because then the grand jury would have in substance abdicated.' [United States v. Costello,] 221 F.2d 668, 677. Accordingly, I concur in this judgment, but do so for the reasons stated in the opinion of the Court of Appeals and subject to the limitations there expressed. See also Notes, 62 Harv.L.Rev. 111; 65 Yale L.J. 390.\" Costello v. United States, 350 U.S. at 365 [76 S.Ct. at 409], Burton, J., concurring.\n\nEditorial writers have reflected:\n\n\"* * * However negligible may be the impact of the Costello rule in practice, it undoubtedly will provide an opportunity for renewed discussion of the validity of the grand jury today.\" Note, Indictment Upheld Even Though Founded Solely on Hearsay Evidence, 104 U.Pa. L.Rev. 429, 435 (1955).\n\nThe pathway of persuasion in Second Circuit progression is found in seven succeeding cases. Judge Friendly, in United States v. Borelli, 336 F.2d 376, 391 (2d Cir. 1964), cert. denied 379 U.S. 960, 85 S.Ct. 647, 13 L.Ed.2d 555 (1965), said:\n\n\"If [the witness] had testified before the grand jury, the defendants would have been entitled to have the judge inspect the minutes and turn over any parts useful for cross-examination. [Citations.] The Government ought not be allowed, by having its principal witness speak to the grand jury through the voice of another, to deprive a defendant of this right to impeach by contradiction. It is true that inconsistencies found in the grand jury testimony of such a surrogate are less susceptible of effective use than if the witness himself had testified; when the witness is confronted with what appears to be an inconsistency, he may deny having made the contradictory statement to the agent and counsel's only recourse would be to call the agent and endeavor to have him prove the contrary.\"\n\nIn United States v. Payton, 363 F.2d 996, 999-1000 (2d Cir.), cert. denied 385 U.S. 993, 87 S.Ct. 606, 17 L.Ed.2d 453 (1966), Judge Feinberg wrote the majority, and Judge Friendly, in dissent, again stated:\n\n\"The course followed by the Government in this case makes a mockery of the Fifth Amendment's guarantee that `No person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury.' What compromises this indictment is not that the grand jury heard only hearsay testimony as in Costello, [supra,] but that, in sharp contrast to that case, it had no way of knowing that the testimony which was all it was hearing was hearsay. Despite the lame apology offered at trial by Agent Ward, his statements to the grand jury, recorded in the transcript annexed to this opinion, were the words of a man who had seen or heard whereof he spoke and were plainly meant to be taken as such; the Government does not contend anything was said to the grand jury before Ward was sworn that would have apprised it of his limited knowledge. * * *\n\n\"If, in these narcotics peddling cases, the Government insists on pressing Costello to the point of offering a grand jury only hearsay testimony by a surveilling agent when there is no apparent reason save a transparently unworthy one for not producing the agent with firsthand knowledge, it must make clear to the jurors the shoddy merchandise they are getting so they can seek something better if they wish; thus pressing the prosecutor for more reliable evidence — particularly important in these narcotics prosecutions where there is often a problem of the reliability of an agent's identification — is the grand jury's historic function.\"\n\nNext addressed in United States v. Umans, 368 F.2d 725, 730 (2d Cir. 1966), cert. dismissed 389 U.S. 80, 88 S.Ct. 253, 19 L.Ed.2d 255 (1967), the standard was established:\n\n\"While we are not condemning the procedure used here before the grand jury, we think it not amiss for us to state that excessive use of hearsay in the presentation of government cases to grand juries tends to destroy the historical function of grand juries in assessing the likelihood of prosecutorial success and tends to destroy the protection from unwarranted prosecutions that grand juries are supposed to afford to the innocent. Hearsay evidence should only be used when direct testimony is unavailable or when it is demonstrably inconvenient to summon witnesses able to testify to facts from personal knowledge.\"\n\nIn United States v. Beltram, 388 F.2d 449 (2d Cir.), cert. denied sub nom. Colon v. United States, 390 U.S. 955, 88 S.Ct. 1860, 20 L.Ed.2d 869 (1968), the majority denied attempt to mislead the grand jury, and Judge Medina dissented:\n\n\"I dissent. But I do not dispute the fact that there is no constitutional obstacle to the presentment of a case to the grand jury by means of hearsay evidence. Such a view is foreclosed by Costello v. United States, [supra]. My point has a double aspect. As the grand jury may and often does refuse to indict, it seems to me that it is only just and fair to require the prosecutor at least to warn the grand jury that most or all of the proofs presented are at second hand. Of even greater significance, in my opinion, is the evil practice, especially in narcotics cases, of using before the grand jury only a peripheral witness, who recites in more or less narrative fashion what other narcotics agents have seen, heard or done.\" 388 F.2d at 451.\n\nNext arising as an issue in United States v. Catino, 403 F.2d 491 (2d Cir. 1968), cert. denied 394 U.S. 1003, 89 S.Ct. 1598, 22 L.Ed.2d 780 (1969), the court adhered to the Umans standard, but defined that because of the indictment being less than a week after that case, it would be unduly harsh exercise of supervisory power to impose sanctions upon the government for failing to achieve compliance. Judge Friendly, in writing the opinion in United States v. Arcuri, 405 F.2d 691 (2d Cir. 1968), cert. denied 395 U.S. 913, 89 S.Ct. 1760, 23 L.Ed.2d 227 (1969), accepted the trial court analysis of the short time occurring after the Umans and Beltram cases, and found absolute requirement for dismissal on the basis of hearsay use for indictment.\n\nMorality and fairness finally survived, and despite the misguided posture earlier pontificated in Supreme Court decision in finding that enough was enough in United States v. Estepa, 471 F.2d 1132, 1136-1137 (2d Cir. 1972), a conviction was dismissed by virtue of the hearsay usage in indictment. Judge Friendly spoke for the court:\n\n\"* * * When the framers of the Bill of Rights directed in the Fifth Amendment that `No person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury,' they were not engaging in a mere verbal exercise. The importance of avoiding undue reliance upon hearsay before a grand jury is heightened by this circuit's view that an indictment constitutes a finding of probable cause and avoids the need for a preliminary hearing under F.R.Cr.P. 5(c). * * *\n\n\"The many opinions in which we have affirmed convictions despite the Government's needless reliance on hearsay before the grand jury show how loathe we have been to open up a new road for attacking convictions on grounds unrelated to the merits. We have been willing to allow ample, many doubtless think too ample, latitude in the needless use of hearsay, subject to only two provisos — that the prosecutor does not deceive grand jurors as to `the shoddy merchandise they are getting so they can seek something better if the wish' * * *. * * * We cannot, with proper respect for the discharge of our duties, content ourselves with yet another admonition; a reversal with instructions to dismiss the indictment may help to translate the assurances of the United States Attorneys into consistent performance by their assistants.\"\n\nIt was found that procedural rules of the Justice Department failed, and that only reversal could remove the evil of uncontrolled hearsay usage.\n\nNot dissimilar in substance to the use of factually uninforming hearsay is the subject of prosecutorial abuse derived from perjured or knowingly false testimony. United States v. Basurto, 497 F.2d 781 (9th Cir. 1974); United States v. Phillips Petroleum Co., 435 F. Supp. 610 (N.D.Okla. 1977); State v. Reese, 91 N.M. 76, 570 P.2d 614 (1977); Note, Quashing Federal Indictments Returned Upon Incompetent Evidence, 62 Harv.L.Rev. 111 (1948); Comment, The Prosecutor's Unnecessary Use of Hearsay Evidence Before the Grand Jury, 61 U.Wash.L.Q. 191 (1983); Comment, Exclusion of Incompetent Evidence From Federal Grand Jury Proceedings, 72 Yale L.J. 590 (1963); Westling, Use of Hearsay Testimony Before Oregon Grand Juries, 62 Or. L.Rev. 505 (1983).\n\nAs court processes sometimes tend to bury reason in ritual and rationalization, it is fairly observed that the practical basis for hearsay exclusion is ignored. It is simply unreliable. The error factor in repeated conversation is exponentially extended. In current literature, Bergman, Ambiguity: The Hidden Hearsay Danger Almost Nobody Talks About, 75 Ken.L.J. 841 (1987), essays the thought-provoking function of ambiguity. We need only evaluate his thesis and included topics to recognize that as in the saga of Campbell County, unbridled use of hearsay for any purpose defeats the basic interest of the justice system of search for truth and validity. In analyzing the ambiguity of ambiguity, the author reminds us of the language features of abstraction, polarity, unconventional meanings, form versus function, chronology, filling, and conclusion, all of which directly challenge the factual validity of hearsay, not to disregard faulty memory, diminished perception, and insincerity. In rejecting uncontrolled hearsay usage for indictment or for preliminary hearing for that matter, I abjure reexecution of Sir Walter Raleigh:\n\n\"A few centuries ago, Sir Walter Raleigh was executed in the Tower of London after being convicted of treason. The conviction rested in part on the hearsay testimony of a fisherman, who testified that `a Portuguese gentleman' had told him that Raleigh intended to murder the King. One would think that the possibility that the fisherman's testimony would be admissible today had been safely put to rest. Yet, if a federal judge believed that the Portuguese gentleman's statement was made under conditions suggesting its trustworthiness, Sir Walter might fare no better today than he did under Elizabeth.\" Id. at 883.\n\nUncontrolled and unnecessary hearsay as a basis for factually charging may actually be as discerned by Justice Burton: to be \"`no evidence.'\" \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Costello v. United States, supra, 350 U.S. at 365, 76 S.Ct. at 409. Paraphrased to the \"Not wrong, don't fix it\" rule, we should reasonably say, \"If it isn't any good, don't use it.\"\n\nE. Due Process\n\nThe conduct of the initial grand jury session accords most interest in only conjecture since undocumented by available record. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Critically, we have a due-process question where the equivalently valid result would have been achieved if either the undercover investigating officer or the prosecuting attorney simplistically and procedurally, without additional ceremony, had signed the indictments by endorsement of \"a true bill,\" in counterpoint to any execution by the grand jury foreman. It is passing strange that all efforts undertaken to date have produced neither a testimony transcript of the deputy sheriff, or copies of whatever reports were used in conjunction with the oral testimony of the supervising deputy sheriff, Steve Hamilton, for informational delivery to the grand jury membership. A minimum effort to afford compliance with due process would require that the undercover agent, as well as his reports and summarization, should have been presented in order to afford evidence first-hand as would actually inform the grand jury.\n\nIt is fair from what is decided in this case to say that the contention of deprivation of due process was answered factually that no due process was afforded in the indictment methodology; none was denied, since none was offered or provided. With that status established, I then consider whether this accords constitutionally required rights. I will not concur with the court in its essential conclusion that the charging process where the grand jury is used can be illusory so that it becomes a contrived excursion of the will of the prosecuting attorney, as a clerical accomplishment.\n\nIn effect, this court seems to conclude that constitutional protection need only be provided in the trial itself, and the distinction of the erosion of the individual's liberty interest to enjoy due-process rights does not arise at the earlier accusatory or investigatory stages. The distinction cannot be discerned from Wyoming Constitution terminology that the grand jury in indictment delivery would eschew a validating criminal-charge characteristic and instead afford a rubber-stamp prosecutorial fiat by ministerial result:\n\n\"No person shall be deprived of life, liberty or property without due process of law.\" Article 1, § 6, Wyoming Constitution.\n\nIt is established in historical activity, differentiated from factually unsupported repetition in some opinion writing, that the grand jury essentially never was utilized to protect the individual. Reason abounds why the vast majority of nonfederal criminal proceedings in all but a few states now proceed by information and preliminary hearing processes as being less expensive, dispositively faster, and most particularly preferable in affording desired protection to the individual from the misguided, mistaken or promiscuous prosecutorial process empowered to the prosecuting attorney.\n\nThe distinction must be clearly understood between the grand jury which constitutes a conduit to initiate a criminal charge, constituting only an indictment function, and the investigatory grand jury, which does serve to be informed, advised, and intrinsically decisional. We need not travel backward in moralistic regression to debate the due-process advantage which incubated and nurtured the prosecutorial disuse of the grand jury in favor of the information-preliminary hearing. Wyoming in essence since statehood has normally utilized the information in recognizing the reason for pre-trial protection of the individual from conflagration by the prosecutorial process. See National Lawyers Guild, Representation of Witnesses Before Federal Grand Juries, Ch. 12, Abuse of the Grand Jury Process, and Ch. 13, Prosecutorial Misconduct (1979).\n\nNote also is required that less than ten percent of all criminal complaints are ever considered in jury trial. Consequently, the only due process which would ever be accorded 90 percent of the time is at issue before a plea is entered. Within its territorial imperative, the prosecutorial function exhibits more discretional aura over the life, liberty, and conduct of individuals than exists in any other character of officialdom within the democratic society. Rational persuasion is critically de minimis to expand that territory by determination that due process only arrives when the petit jury convenes. I cannot accommodate to an analysis that in the absence of statute no preliminary hearing is required, since the statute now exists and any repeal would undoubtedly engender serious procedural and due-process constitutional inquiry. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nA view is expressed that the baby should be saved even if the bath water is discharged:\n\n\"All of these values will be fostered if we require the prosecutor to present the federal grand jury with a prima facie case of legal guilt, strengthen the grand jury's capacity to make a reliable ex parte adjudication of guilt, and provide greater judicial safeguards against prosecutorial misconduct before the indicting grand jury.\" Arenella, Reforming the Federal Grand Jury and the State Preliminary Hearing to Prevent Conviction Without Adjudication, 78 Mich.L. Rev. 463, 579 (1980).\n\nNearly every authority similarly analyzes societal requests to either eliminate or renovate. I reject the \"see no evil, hear no evil\" posture of the majority, and would accrue to the institution's operative protections to justly present retribution for a civilized society, or if not done, then foresee that the legislature should follow England and eliminate.\n\nIn the absence of the elimination of the grand jury as presently constituted, I would find a due-process requirement that its function as an actual evaluative entity requires real evidence and proper procedure, or contrarily that a preliminary hearing can be required as a matter of right by the indicted party. In due-process terms, the process should afford reasonable reliability as to be compared as a reflection of the prosecutor's beliefs, however well intended, and his prosecutorial desires, however motivated. In constitutional terms, it is this requirement of reasonable determinate reliability that becomes the responsibility of this court in exercise of its supervisory responsibility. The collective acceptance of oppressive conduct in the name of criminal justice effectuates a denial of due process.\n\nF. Equal Protection\n\nBecause of prosecutorial immunity, this court is denied effectuation of the general ideal stated by Justice Scalia in Anderson v. Creighton, ___ U.S. ___, 107 S.Ct. 3034, 3038, 97 L.Ed.2d 523 (1987), when he said that if\n\n\"* * * government officials abuse their offices, `action[s] for damages may offer the only remedial avenue for vindication of constitutional guarantees,' Harlow v. Fitzgerald, 457 U.S.\n\n814, 102 S.Ct.\n\n2736, [72 L.Ed.2d 396 (1982)],\"\n\neven though, as he continues in the opinion, the Supreme Court of the United States has\n\n\"never suggested that the precise contours of official immunity can and should be slavishly derived from the often arcane rules of the common law.\" 107 S.Ct. at 3041.\n\nWith prosecutorial immunity granted in Wyoming by Blake v. Rupe, Wyo., 651 P.2d 1096 (1982), cert. denied 459 U.S. 1208, 103 S.Ct. 1199, 75 L.Ed.2d 442 (1983), misconduct can only be addressed by challenges to the process aberrations by judicial supervision and rejection. Prosecutorial abuse that is not repaired by damage responsibility must certainly be circumscribed by judicial supervision.\n\nWith the recently enacted grand jury statute in Wyoming, and the complete absence of any realistic authority from the previous law, it is now the province of this court to determine the fairness and viability of the grand jury system as acceptable to the electorate and the political system. My premise in dissent is accommodated by the view that the legislature has determined that the grand jury system as an adjunct in criminal-law enforcement serves a purpose, and that this court then has its primary obligation to assure a proper functioning in constitutional perspective, fairness and justice. In my opinion, the reasoned start of the United States Supreme Court in recognizing protective requirements for prosecutorial processes as found in Hurtado v. California, 110 U.S. 516, 4 S.Ct. 111, 28 L.Ed. 232 (1884), with Gerstein v. Pugh, 420 U.S. 103, 95 S.Ct. 854, 43 L.Ed.2d 54 (1975), now fails to achieve accommodation under the Constitution of the State of Wyoming, in abject yielding to the diminished justice guarantees afforded by United States v. Calandra, supra, 414 U.S. 338, 94 S.Ct. 613, 38 L.Ed.2d 561; Costello v. United States, supra, 350 U.S. 359, 76 S.Ct. 406, 100 L.Ed. 397; and now most recently United States v. Mechanik, supra, 475 U.S. 66, 106 S.Ct. 938, 89 L.Ed.2d 50. See Tollett v. Henderson, 411 U.S. 258, 93 S.Ct. 1602, 36 L.Ed.2d 235 (1973).\n\nIn according the effect of this decision not just to Hennigan but to a 1987 world and a new statute, we do not deal in construction or reapplication of intent of the legislature except that a process be available. We are concerned with the fundamental factors of the justice-delivery system in execution of a process created or diminished by judicial supervision and constitutional application.\n\nI find no basis in our constitutional heritage for the use of the grand jury as a prosecutorial tool, with little differentiation from the filing of an information except for additional investigatory support by secretly subpoenaed witnesses. Consequently, the basic intent that pretrial appearances to test probable cause should not be differently available in either of the prosecutorial methods which may be employed in the courts of this state is recognized in simple application of the terms of our Constitution itself. This court cannot have it both ways and hide any disingenuous activities of the prosecutor behind secrecy, and then say that the individual is afforded due process when a right for an impartial magistrate is ignored or denied. I would simply say today that such a right is required by the Constitution of our state. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIt cannot be ignored that the English nation, the birthplace of our system of justice, found that the operational grand jury lacked societal justification in its total elimination now more than 55 years ago. Furthermore, in Wyoming, it cannot be denied that in preservation of due-process and liberty interests, indictment is not equal to charging by information, and cannot, in procedural terms, be academically characterized as fair. Attacking as it does that liberty interest which invokes the strict-scrutiny standard, I cannot relate unfairness and inequality to reach acceptance within constitutional guarantees. Neither equality nor fair protection is accorded to the individual by the uncontrolled grand jury encroaching upon rights reserved to him by explicit constitutional guarantee. In assessing that the denial of a right must be vindicated by an effective remedy, Marbury v. Madison, 5 U.S. (1 Cranch) 137, 163, 2 L.Ed. 60 (1803); Hobby v. United States, supra, 468 U.S. 339, 104 S.Ct. 3093, 82 L.Ed.2d 260, equal protection must not be denied.\n\nG. Burden of Cases\n\nThis court adjusts to the 67 indictments and the approximately 237-count, three-day session in remarking that:\n\n\"* * * [T]he grand jury might have relied upon the same evidence in addressing cases involving several defendants. Given these circumstances we cannot say that the grand jury did not properly perform their assigned tasks in the time available; we will presume that they did.\" Majority opinion at 373.\n\nMy power to presume is comparably limited in absence of an actual record to determine real events. Hopefully, these events will not be repeated \"while the foresight of man doth run not to the contrary;\" cross-assumption in argumentative opinions does little to establish a standard for future conduct of these criminally charging processes.\n\nPragmatically, I cannot presume more than extensive trial experience and analysis would permit me to conclude in application of Frankfurter's criteria of ignoring as judge what we know as man. First, no real evidence by a knowledgeable witness was presented in that three-day session; second, in following his anticipation, all indictments were pre-prepared by the prosecutor; and third, the grand jury had no conception of proof or process in the actual indictment production.\n\nMy real concern about the Campbell County grand jury episode is the fundamental overwhelming of the Public Defender's office in post-indictment process and subsequent trial, where individual rights to justice became enfolded or ensnared in the grab-bag, mass-produced factory for conviction. Inadequate records and unprovided discovery occurred. The statutory compliance and constitutionally provided rights of the preliminary hearing process were demonstratively denied in the proscription of a fair and adequate justice-delivery system. Not to be either Chicken Little or Cassandra, uncontrolled totalitarianism of the criminal process can happen here if constitutional guarantees are ignored when first denied to someone else.\n\nH. Prosecutorial Misadventure And Legally Impermissible Conduct\n\n1. Inter-spousal privilege and denied witness privilege\n\nIn his examination of a male subpoenaed witness who was not granted immunity, Murray engaged in a colloquy under the reconstructible probability in prosecutorial approach that the witness was probably a target, as was his wife:\n\n\"Q. * * * Let me tell you that you have a right to exercise a privilege as I ask you questions which is called the marital privilege, and that is to say, you do not have to testify about anything of a communicative nature between you and your wife. If I were to ask you some questions, did your wife tell you this or that, you do not have to answer those questions unless you choose to do so. That's called a marital privilege.\n\n\"However, my understanding of the privilege is it does not exist as to those things that you have observed her do.\n\n\"A. Okay.\n\n\"Q. I tell you that not because I intend to get into a large amount of questions concerning what you have observed your wife doing. Rather, we're going to discuss other people. But I believe you have a right to know about the marital privilege, and that you will be able to exercise the same privilege.\n\n\"Okay. Do you have any questions in that regard concerning the privilege?\n\n\"A. No, sir.\n\n\"Q. I'll try to alert you to the fact if I'm going to ask you questions that you have a right not to answer, if you choose not to do so.\"\n\nIn the examination of Julie Jean Stahnke, whose husband was obviously a target, was later indicted, entered a plea, and was sentenced, and where the inter-spousal privilege was not even mentioned, Murray's introductory comment was:\n\n\"I must advise you that your responses that you give to the grand jury should in fact be truthful, because if you knowingly or intentionally made a statement in here which you knew not to be the truth, then you will have committed a crime called perjury, which is a felony punishable by five years in the Women's Correction Center down at Lusk.\n\n\"Do you understand that?\"\n\nHe later further commented:\n\n\"Q. I have to honestly tell you that I don't think that's the truth, and I am placing you on notice that I think you are committing perjury at this particular point in time.\n\n\"Q. Have you ever seen — strike that.\n\n\"Has your husband ever discussed the sale of methamphetamine or crank with you in the last three years?\n\n\"Q. When was the last time you saw your husband consume methamphetamine?\n\n\"A. I would say the last time I saw him was when I did.\"\n\nApparently Murray lacked familiarity with §§ 1-12-101 and 1-12-104, W.S. 1977, as well as the not unknown cases of Blau v. United States, 340 U.S. 332, 71 S.Ct. 301, 95 L.Ed. 306 (1951), and Trammel v. United States, 445 U.S. 40, 53, 100 S.Ct. 906, 63 L.Ed.2d 186 (1980), where, in conclusion, even Justice Burger said:\n\n\"* * * Accordingly, we conclude that the existing rule should be modified so that the witness-spouse alone has a privilege to refuse to testify adversely; the witness may be neither compelled to testify nor foreclosed from testifying. This modification — vesting the privilege in the witness-spouse — furthers the important public policy in marital harmony without unduly burdening legitimate law enforcement needs.\"\n\n2. Immunity\n\nPervasive in the conduct of the grand jury sessions was the attitude of the prosecutor that he was vested with the power to grant immunity and consequently forced testimony when Fifth Amendment rights were asserted.\n\nThe relationship of the district court to the process is generally not recorded by available transcript, since it is revealed that on one occasion, after a witness refused to testify and was then taken to the district court for \"instruction,\" the session before the court was not transcribed by the prosecuting attorney's direction. The relationship of the so-called informal immunity to subsequent perjury charges affords some interesting academic review which does not occasion our instant comment since apparently none of the individuals subject to perjury is presently before this court on appeal. Lacking authority in common law or by statute for prosecutorial right to afford immunity, Murray apparently relied on what is characterized as \"informal immunity.\" See United States v. Anderson, 577 F. Supp. 223 (D.Wyo. 1983), rev'd by 778 F.2d 602 (10th Cir. 1985), wherein in the latter case the right against self-incrimination was not considered on a lack of standing of a defendant to assert, by citation of United States v. Skolek, 474 F.2d 582 (10th Cir. 1973). See more recently United States v. Kilpatrick, supra, 821 F.2d 1456.\n\nImmunity under the federal system requires a court order granted upon formal application. 2 Beale \u0026 Bryson, Grand Jury Law \u0026 Practice, supra, § 9.06, p. 20. Actually, the United States Attorney cannot act alone in seeking the order, but requires approval of certain ranking officers in the Department of Justice. Wyoming is classified generally as a state with no general-immunity statute. Id., § 9.09, p. 28. This text recites that the general statutory scheme is that immunity is granted by the court and not asserted by the prosecutor alone, and as to the Wyoming constitutional and statutory structure, only Art. 1, § 11 provides:\n\n\"No person shall be compelled to testify against himself in any criminal case, nor shall any person be twice put in jeopardy for the same offense. If a jury disagree, or if the judgment be arrested after a verdict, or if the judgment be reversed for error in law, the accused shall not be deemed to have been in jeopardy,\"\n\nand no other provision for immunity or requirement is provided that testimony can be elicited involuntarily when the right is invoked, except in separate statutory provision relating to controlled substance:\n\n\"All duly authorized peace officers including any special agents or other personnel appointed by the commissioner [attorney general], while investigating violations of this act [§§ 35-7-1001 to 35-7-1055] in performance of their official duties, shall be immune from prosecution under this act. Any person working under the immediate direction, supervision or instruction of a duly authorized peace officer, special agent or other person appointed by the commissioner, may be granted immunity from prosecution under this act by the commissioner. In addition to the foregoing persons, such immunity may also be granted to any person whose testimony is necessary to secure a conviction under this act with the consent of district judge in the district wherein prosecution is to take place. Any person granted immunity under this section shall not be excused from testifying or producing evidence on the ground that the testimony or evidence required of him may tend to incriminate him or subject him to penalty or forfeiture. Any person who except for the provisions of this act, would have been privileged to withhold the testimony given or the evidence produced by him shall not be prosecuted, subjected to any penalty, forfeiture, for or on account of any transaction, matter or thing concerning which, by reason of said immunity, he gave testimony and produced evidence; and no such testimony given or evidence produced shall be received against him in any criminal proceeding. Provided, no person given immunity under this section shall be exempt from prosecution for perjury or contempt committed while giving testimony or producing evidence under compulsion as provided in this section.\" Section 35-7-1043, W.S. 1977. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nSee, however, Miskimmins v. Shaver, 8 Wyo. 392, 58 P. 411, 49 L.R.A. 831 (1899); Richmond v. State, Wyo., 554 P.2d 1217 (1976), reh. denied 558 P.2d 509 (1977). Cf. Haselhuhn v. State, Wyo., 740 P.2d 387 (1987), Thomas, J., specially concurring.\n\nAlthough three of the witnesses, as determinable through the record, were taken before the district court, the only recorded appearance available involved Jayme Sue Fristam, who incidentally was later subjected to a perjury charge for which she undoubtedly inopportunely entered a guilty plea following a November, 1985 indictment. That initial exchange, in the absence of counsel, although her legal representation status was noted, is most curious:\n\n\"THE COURT: Court is in session in the matter of the Campbell County Grand Jury.\n\n\"Present in chambers is the official court reporter, Mr. Murray, the Campbell County and Prosecuting Attorney, and someone else that I do not know.\n\n\"Would you please identify yourself.\n\n\"MISS FRISTAM: I'm Jayme Sue Fristam.\n\n\"THE COURT: Jayme what?\n\n\"MISS FRISTAM: Fristam.\n\n\"THE COURT: All right.\n\n\"MR. MURRAY: Your Honor, Miss Fristam was subpoenaed before the Campbell County grand jury and went into testify in front of the grand jury at — approximately 10 minutes ago.\n\n\"She was properly sworn and then began to give testimony, and specifically in regards to a person by the name of James Charles McFarlane.\n\n\"I placed Miss Fristam on notice that I believed she was in the process of either committing or about to commit perjury, and explained perjury to her concerning the testimony that she was rendering, and then asked a question as to whether or not she'd ever been present at the time Mr. McFarlane had ever sold a controlled substance.\n\n\"At that time, and for purposes of this hearing, she then invoked her Fifth Amendment right to remain silent, not as artfully, perhaps, as the Fifth Amendment may state, but essentially she wanted to remain silent and exercise her constitutional rights.\n\n\"I recognized that and at that time I told her that I was conferring upon her use and derivative use immunity and explained to her that her, her testimony and the fruits of her testimony could not be used against her in any court proceeding today or in the future.\n\n\"At that time she indicated she was still not going to answer the question and wanted to see her attorney.\n\n\"I enquired as to who her attorney was. She said that the attorney's name was Steve Johnson.\n\n\"I might note for the record, and I think the court's aware, that Mr. Johnson has entered an appearance on behalf of Mr. McFarlane. So I don't believe he can represent Miss Fristam.\n\n\"I asked her if she had been in contact with Mr. Johnson. She explained no, that his telephone was not working, and that she was unable to make contact with him.\n\n\"I then asked her whether or not she was going to answer my questions. She informed me that she was not going to answer my questions.\n\n\"And then I informed her that we would then come down before the judge for the purposes of the state moving for her to show cause why she should not be held in contempt of court.\n\n\"That is the reason that we're in front of you now.\n\n\"THE COURT: Thank you.\n\n\"Is that correct, Miss Fristam?\n\n\"MISS FRISTAM: Fristam.\n\n\"Yes.\n\n\"THE COURT: I'm sorry.\n\n\"Did Mr. Murray explain to you what he means by use immunity, that is, what you say cannot be used against you? That, of course, does not mean it cannot be used against other people, but it cannot be used against you.\n\n\"In addition, what he calls the fruits of that statement cannot be used against you. If what you say to the grand jury leads to the discovery of other evidence against you, that is called the fruits of your statement, and that cannot be used against you also.\n\n\"Do you understand that?\n\n\"MISS FRISTAM: Yes.\n\n\"THE COURT: By giving you that immunity you no longer are placed in jeopardy.\n\n\"And what the Fifth Amendment of the United States Constitution provides is that you are not required to give statements that can be used against you in criminal prosecutions. By being offered immunity they can no longer be used against you. So you no longer have a reason not to answer.\n\n\"Do you understand that?\n\n\"MISS FRISTAM: Yes.\n\n\"THE COURT: If you fail to answer the questions, the statutes dealing with the grand jury provide that if the court — and that's me — determines that the witness is bound to answer, and he persists in his refusal, he should be brought before the court and shall proceed in the same — who shall proceed in the same manner as if the witness had been interrogated and refused to answer in open court, which means we apply Rule 41(e) of our Rules of Criminal Procedure, and that's the rule dealing with criminal contempt.\n\n\"And that provides that a criminal contempt may be punished summarily if the judge certifies that he saw or heard the conduct constituting the contempt, and that it was committed in the actual presence of the court.\n\n\"And, as you see, that statute says that if you refuse to answer the grand jury, it is to be treated as if it was done in front of the court.\n\n\"The order of contempt shall recite the facts, shall be signed by the judge, and entered on the record, and I may then place you in the county jail for a period of up to six months.\n\n\"In the alternative, if Mr. Murray should wish to proceed by way of filing a criminal contempt against you for criminal contempt, he may do that. A jury trial may be had. And if you are convicted you would face a possible penalty much in excess of six months.\n\n\"I believe that it is probably Mr. Murray's desire not to do that at this point, but I must tell you that if you refuse to answer the questions you will go to jail.\n\n\"I need to know now. Do you wish to answer the questions or not?\"\n\nApparently the district court did not recognize that only he and not the prosecutor could grant immunity pursuant to the only applicable statute, § 35-7-1043, W.S. 1977.\n\nDerivation of any common-law immunity which otherwise was considered to be within the authorization of the prosecutor cannot be additionally justified or explained in the record then made. In the context that \"power corrupts, and absolute power corrupts absolutely,\" I see this uncontrolled and irresponsible grand jury session as an unusually clear demonstration of that historical adage.\n\nIt is also noteworthy that the immunity statute affords a transactional immunity contrary to the posture adopted by the prosecutor. The differentiation is described in 2 Beale \u0026 Bryson, Grand Jury Law \u0026 Practice, supra, § 9.03, p. 9:\n\n\"The two principal types of immunity are referred to as `transactional immunity' and `use and derivative use immunity.' Transactional immunity is broader. A witness who is given transactional immunity is protected against prosecution for any matter about which he testifies under the grant of immunity. Use and derivative use immunity gives the witness protection only against the use of his immunized testimony and the use of any evidence obtained by exploiting his testimony. Thus, while a witness with transactional immunity cannot be prosecuted at all for the offenses about which he testifies, a witness with use and derivative use immunity does not have that guarantee.\"\n\nSee Kastigar v. United States, 406 U.S. 441, 92 S.Ct. 1653, 32 L.Ed.2d 212, reh. denied 408 U.S. 931, 92 S.Ct. 2478, 33 L.Ed.2d 345 (1972); Foreword, Symposium: `The Granting of Witness Immunity', 67 J.Crim.Law \u0026 Criminology 129 (1976); and particularly Wolfson, Immunity — How it Works in Real Life, 67 J.Crim.Law \u0026 Criminology 167 (1976). Nothing is found in the opinions of the United States Supreme Court considering grants of immunity that suppose any common-law derivation conclusion. Kastigar v. United States, supra; Ullmann v. United States, 350 U.S. 422, 76 S.Ct. 497, 100 L.Ed. 511, 53 A.L.R.2d 1008, reh. denied 351 U.S. 928, 76 S.Ct. 777, 100 L.Ed. 1457 (1956); Hoffman v. United States, supra, 341 U.S. 479, 71 S.Ct. 814, 95 L.Ed. 1118; Brown v. Walker, 161 U.S. 591, 16 S.Ct. 644, 40 L.Ed. 819 (1896).\n\nAny basis for the prosecutor to accord to himself the power to grant immunity is certainly not justified by Wyoming case law, statute, or constitution. As a matter of fact, under the present circumstances, the right where no statute exists to \"waive prosecution\" by a grant of immunity and require testimony, lacks determinate validity. Attention by the legislature or by this court by rule, or both, would not be inappropriate.\n\n3. Requirement that witnesses not discuss their grand jury testimony\n\nSimplistically stated, this absurd but generally used command of the prosecutor not only lacks legal validity, but under rule and statute is now directly contrary to express Wyoming statutory provisions. Perhaps the witnesses would like to have been accorded the same function as jurors, but, lacking statutory responsibilities, they could not be obligated by the same secrecy accountability. More expressively stated, although generally occurring in all cases except where for some reason the ending grand jury session contact with the witness \"went off the record,\" we find a female witness-prosecutor exchange illustrative:\n\n\"However, you are not at liberty to discuss it with any other members of the hospital staff, or with other members of the community unless you receive permission from a district court judge.\n\n\"[THE WITNESS]: District court judge?\n\n\"This is all — I have been in court 30 years ago when I divorced.\n\n\"May I explain that, sir?\n\n\"MR. MURRAY: We're not interested in the divorce.\n\n\"[THE WITNESS]: No, I know you are not.\n\n\"* * * I would just like you all to know that, if I, if something slips and I slip and say something.\n\n\"Tell me what I do?\n\n\"MR. MURRAY: Don't slip.\n\n\"[THE WITNESS]: Don't slip. Okay.\n\n\"MR. MURRAY: It's real simple.\n\n\"[THE WITNESS]: That's what I need to know.\n\n\"MR. MURRAY: Don't talk about what went on here today with anybody except your attorney and you won't have a problem.\n\n\"[THE WITNESS]: Okay.\n\n\"MR. MURRAY: And if you want to talk about it with somebody else, you contact your attorney; he'll apply to the court for permission, which will routinely be denied.\n\n\"[THE WITNESS]: Okay. Thank you.\n\n\"MR. MURRAY: But that's — the proceedings are secret.\n\n\"[THE WITNESS]: Okay.\" (Emphasis added.)\n\nThis requirement asserted by the prosecutor compares with the secrecy criteria for only jurors and officers of court in prior law and present statutory provisions making clear in § 7-5-208(c), W.S. 1977, 1987 Replacement, that the obligation of secrecy is restricted.\n\n\"No obligation of secrecy may be imposed upon any person except in accordance with this section [basically court personnel] and W.S. 7-5-207 [secrecy of indictments until a warrant issues].\" (Emphasis added.)\n\nSynthesized in the silence demand and explicitly communicated threat of the prosecutor is the behavioral principle that \"it is OK if you can get by with it,\" in that in secrecy no one knows how the rules are written. Reference to the philosophical review found in Wood v. Georgia, 370 U.S. 375, 82 S.Ct. 1364, 8 L.Ed.2d 569 (1962) is helpful.\n\n4. Jury term\n\nThe Wyoming statute in force when these events occurred \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e contained no provision for length of term. One of the nine appeals, Kortz v. State, 746 P.2d 435, supra, invokes this specific question, together with other issues. The term of the District Court for Campbell County began on the first Monday of February and ended before the second Monday in September. Without regard for the argument otherwise pursued about completed investigations of individuals, Kortz v. State, supra, the county attorney continued without regard for the general rule that where not otherwise stated, grand jury terms end with the term of court for petit juries.\n\n\"At common law, the grand jury's term expired at the end of the term of the court during which the grand jury was convened. Many states continue to adhere to this common law rule; others have altered the common law rule by enacting statutes or rules governing the length of the grand jury's term.\n\n\"In the federal system, a regular grand jury sits for up to 18 months, although the court can discharge the grand jury before the end of the 18 month period. A special grand jury also sits for 18 months, unless discharged earlier by the court, but the court may extend the term of the special grand jury for periods of up to six months for each extension, if the court determines that the grand jury's business is not completed. The total term of the special grand jury, however, cannot exceed 36 months. A grand jury whose term has expired is no longer considered a grand jury; it loses the power to indict, to subpoena witnesses, and to engage in any of the other actions that a grand jury is otherwise entitled to perform.\n\n\"Because of the difference in their maximum potential terms, it is important to know whether a particular federal grand jury was convened as a regular grand jury or as a special grand jury. In most cases, the application and the order convening the grand jury will make this clear, but occasionally it will not be clear whether the grand jury was intended to be a regular or a special grand jury. In those cases, the reviewing court must consider factors such as the identity of the requesting authority, the language of the application, and the court's charge to the grand jurors in order to determine whether the grand jury is governed by the rules applicable to regular grand juries or by those applicable to special grand juries.\n\n\"The terms of state grand juries vary widely, from a minimum of 10 days to a maximum of 18 months, with extensions ordinarily available if authorized by the court. Typically, the extensions are authorized only to complete investigations or presentations that were already begun during the grand jury's regular statutory term.\" 1 Beale \u0026 Bryson, § 5.09, pp. 37-38.\n\nThe issue is relevant as to this appeal only as the indicated attitude of the prosecuting attorney and further reason why this Supreme Court should not have so precipitously denied the writ for mandamus and prohibition on September 5, 1985, without hearing, all of which justifies the extent and detail of present consideration on this first completed and denied appeal. These events of misuse and erroneous advice are demonstrations of the absolutely compelling principle that secrecy and denied justice are joint passengers in this criminal-process vehicle.\n\nI. Waiver By Jury Verdict\n\nUnited States v. Mechanik\n\nOne of the most irrational recent case results from the United States Supreme Court is inculcated in United States v. Mechanik, supra, 475 U.S. 66, 106 S.Ct. 938, 89 L.Ed.2d 50, which applied a confusing harmless-error implication to grand jury rule process violation in appending a cured-by-trial jury-verdict ratio decidendi. Predictably, the operative federal judiciary, through trial-court action and current court decision, has reacted in two ways.\n\nOne line of authority is to grant an interim right of appeal to challenge grand jury process defalcation. United States v. Benjamin, 812 F.2d 548 (9th Cir. 1987), citing Cohen v. Beneficial Industrial Loan Corporation, 337 U.S. 541, 69 S.Ct. 1221, 93 L.Ed. 1528 (1949).\n\n\"The question before us, then, is whether the effect of Mechanik will be to deprive appellants of any effective review of their claim after final judgment. Another way to put the question is to ask whether, after giving full precedential effect to Mechanik, we would be able to afford appellants any relief if their contentions proved to be meritorious. We conclude that the answer is `no.'\n\n\"First, it seems clear enough that the harmless error doctrine adopted by the majority in Mechanik rendered the claim of grand jury irregularities asserted by the defendant there effectively unreviewable. Indeed, the government concedes that a similar application of the harmless error rule to appellants' claims in this case would render them effectively unreviewable after final judgment.\n\n\"There is another distinction between this case and Mechanik. The grand jury irregularity in this case was the subject of a motion made and ruled upon before trial. In Mechanik, the irregularity was discovered, and the motion made, after the trial had begun. The majority in Mechanik stated: `We express no opinion as to what remedy may be appropriate for a violation of Rule 6(d) that has affected the grand jury's charging decision and is brought to the attention of the trial court before the commencement of trial.' Id. 106 S.Ct. at 943 (footnote omitted). This disclaimer means that Mechanik does not automatically apply to our case, involving as it does the denial of a pretrial motion to dismiss.\n\n\"* * * Our conclusion that the district court's order in this case is appealable as a collateral order stems not only from its meeting the technical requirements for an interlocutory appeal, but also from the fact that if no appeal is allowed at this stage, appellants will wholly fail to benefit from the protections Rule 6(e) imposes on the constitutionally-mandated grand jury process. Errors that affected the grand jury proceedings to the detriment of the accused, and that would have justified the district court in dismissing the indictment before trial, would go wholly unremedied if the district court itself erred in denying dismissal. We cannot believe that Congress and the Supreme Court intended such ineffectiveness for the Rule. An interlocutory appeal will prevent that untoward result, and § 1291 is to be given a `practical rather than a technical construction.'\" United States v. Benjamin, supra, 812 F.2d at 551-554.\n\nThe other line of authority confines the Supreme Court decision to what would customarily be harmless error, so that the case becomes meaningless in any newly created law standard, evaluation, or application. For a procedural-error application, see United States v. Thomas, 788 F.2d 1250 (7th Cir.), cert. denied, ___ U.S. ___, 107 S.Ct. 187, 93 L.Ed.2d 121 (1986). Then see Porter v. Wainwright, 805 F.2d 930 (11th Cir. 1986), reh. denied 810 F.2d 208 (11th Cir.), cert. denied sub nom. Porter v. Dugger, ___ U.S. ___, 107 S.Ct. 3195, 96 L.Ed.2d 682 (1987), egregious-conduct test, petit jury verdict rendering harmless beyond a reasonable doubt. The First Circuit Court of Appeals has recently taken a position directly contrary to the Ninth Circuit in denial of the interim appeal in United States v. LaRouche Campaign, 829 F.2d 250 (1st Cir. 1987).\n\nThis court can hardly take comfort in anticipation of either approach, since a direct-contest proceeding was instituted before trial, and rules for waiver or cure by jury verdict cannot now properly be applied. This court cannot ignore its responsibility or its own abrogation of adjudicatory obligation at this time, since it denied the proceedings filed to challenge the justiciability and propriety of the grand jury sessions before any jury trial was convened.\n\nIn United States v. Taylor, 798 F.2d 1337, 1339-1340 (10th Cir. 1986), the court indicated that the one line of effectuation was distinctly presented.\n\n\"* * * Thus, the only question we must decide is whether an additional exception to the final judgment rule has arisen from Mechanik, like Athena from the head of Zeus.\n\n\"Defendants argue the logical extension of Mechanik makes unreviewable any alleged irregularity which occurred during the charging process; but the contrary is true. Mechanik was carefully crafted along very narrow lines, and it has not resulted in another exception to the final judgment rule.\n\n\"We perceive that the Court has drawn a distinction between a defendant's right not to stand accused except upon a finding of probable cause and a broader right to fundamental fairness throughout the criminal process, from initial investigation to final judgment. In Mechanik, no allegations were made that the government attempted to unfairly sway the grand jury or to otherwise affect the fairness of the accusatory process. There was no alleged pervasive attempt to charge without cause or to undermine the defense. In short, there was no question whether the government had transgressed the defendants' rights to fundamental fairness. The error of which the prosecution was guilty, at worst, was technical, and, at most, could have affected only the grand jury's determination of probable cause. Since the error was not discovered until after the trial began, the trial was more than three months in duration, and the outcome effectively eliminated any question of whether there was probable cause, the Court found the error was harmless.\n\n\"The Supreme Court in Mechanik did not hold that a Rule 6 violation of any sort or any other act which affects the fundamental fairness of the criminal proceedings discovered prior to trial is not justiciable after conviction. That is a critical distinction.\"\n\nSee also from the Tenth Circuit, United States v. Page, 808 F.2d 723, 726-727 (10th Cir.), cert. denied, ___ U.S. ___, 107 S.Ct. 3195, 96 L.Ed.2d 683 (1987):\n\n\"We may dismiss an indictment only if the prosecutorial misconduct is so flagrant that there was `some significant infringement on the grand jury's ability to exercise independent judgment.'\n\n\"This clearly is not a case involving abuse, bad faith, or vindictiveness.\"\n\nSee, however, United States v. Hintzman, 806 F.2d 840 (8th Cir. 1986), differentiating errors connected with the charging decision; United States v. Murphy, 768 F.2d 1518 (7th Cir. 1985), cert. denied 106 S.Ct. 1188, 89 L.Ed.2d 304 (1986), considering sufficiency of the evidence as a review after trial as no basis for inquiry about grand jury conduct following adverse petit-jury verdict (use of hearsay issue); and as similar to United States v. Mechanik, supra, United States v. Roth, 777 F.2d 1200, 1204 (7th Cir. 1985), considering perjured testimony:\n\n\"The first requirement, that the government know the evidence was perjured, is intended to preserve the principle that an indictment cannot be challenged on the basis of the insufficiency of the evidence on which the grand jury acted. The objection recognized in these cases is not to the insufficiency of the evidence but to the prosecutor's knowledge of its insufficiency, which makes the case one of prosecutorial misconduct. Whether consistency is preserved by this route is not certain. * * * What makes the government's knowing use of perjured testimony different is that it involves an element of deceit, which converts the issue from the adequacy of the indictment's evidentiary basis to fraudulent manipulation of the grand jury that subverts its independence. The second requirement in the cases, that the indictment would not have been issued except for the perjured testimony, confines judicial intervention to cases of prejudicial misconduct, that is, to cases where the misconduct made a difference to the defendant.\"\n\nSee also United States v. Ciambrone, 601 F.2d 616 (2d Cir. 1979), Friendly, J., dissenting.\n\nThe Court of Appeals of New York specifically declined to follow Mechanik in People v. Wilkins, 68 N.Y.2d 269, 508 N YS.2d 893, 501 N.E.2d 542 (1986), by statutory interpretation in separating defects in proceedings from insufficiency of evidence. See also People v. Dunbar, 53 N.Y.2d 868, 440 N YS.2d 613, 423 N.E.2d 36 (1981). Rhode Island applies the error-beyond-a-reasonable-doubt test upon petit jury verdict, following Costello v. United States, supra, 350 U.S. 359, 76 S.Ct. 406, 100 L.Ed. 397, as an adequacy-of-evidence application. New Jersey applied Mechanik as to delay waiver in State v. Lee, 211 N.J. Super. 590, 512 A.2d 525 (1986), in an untimely challenge discussion, and then in State v. Murphy, 213 N.J. Super. 404, 517 A.2d 501 (1986), lack of prejudice in a real sense rendered harmless after jury verdict. (It is noted that a petition for certification was granted by the Supreme Court of New Jersey in State v. Murphy, 107 N.J. 120, 526 A.2d 188 (1987)). The principle of distinguishing Mechanik is most expressly found in current statement where habeas corpus was granted in Saldana v. State, 665 F. Supp. 271 (S.D.N.Y. 1987).\n\nAlthough Wyoming does not have a rule comparable to Rule 6(e)(3)(C)(ii), F.R.Cr.P., the text of present § 7-5-208(b), W.S. 1977, 1987 Replacement, clearly demonstrates that a motion to dismiss an indictment is authenticated statutorily:\n\n\"* * * [A] juror, attorney, interpreter, stenographer, operator of a recording device or any typist who transcribes recorded testimony may disclose matters occurring before the grand jury only when so directed by the court preliminarily to or in connection with a judicial proceeding or when permitted by the court at the request of the defendant upon a showing that a particularized need exists for a motion to dismiss the indictment because of matters occurring before the grand jury.\"\n\nI see an invitation in adoption of United States v. Mechanik, supra, for this court to cultivate a responsive approach as cogently advised in Weinberg, After Mechanik: What's Left of Grand Jury Safeguards?, 1 A.B.A. Criminal Justice 2, 39-40 (Winter 1987):\n\n\"(1) Defense counsel should press vigorously, in appropriate cases, for the pre-trial release of grand jury minutes under Rule 6(e)(3)(C)(ii). That provision authorizes disclosure where the minutes are shown to be necessary because `grounds may exist for a motion to dismiss the indictment because of matters occurring before the grand jury.' Since Mechanik may make midtrial disclosure under the Jencks Act too late for a defendant to obtain relief for any abuses the minutes reveal, district courts should be sensitive to the resulting need for more liberal application of Rule 6(e)(3)(C)(ii) than in the past.\n\n\"(2) When the government argues that a motion to dismiss should be denied because defendant has not shown that a Rule 6 or constitutional violation is prejudicial — within the meaning of the Mechanik majority or O'Connor concurrence, both of which reject the per se rule — defendant should press for full disclosure of the pertinent grand jury record under Rule 6(e)(3). This is the only way that the defense can fairly litigate the question of whether an error was `harmless.' Although this is obvious in the context of the appellate review of trial errors, where the defense and the court have the entire trial record available to assess the context and effect of the error in the petit jury's decision-making, the same rationale must apply to assessing a government claim that a violation was harmless in its effect on the grand jury's deliberations.\n\n\"(4) When a pretrial motion to dismiss the indictment for grand jury violations is denied, defense counsel should consider noting an appeal, and securing a stay of trial pending its resolution, if any resulting delay would not hurt the defendant's interest. Unless and until a Supreme Court majority holds such pretrial denials are not appealable orders, Justice Marshall's opinion in Mechanik may provide authority for such appeals. In addressing a point not considered in the majority or concurring opinions, Marshall noted that the logical consequence of the majority's holding grand jury errors unreviewable after conviction, was that preconviction orders denying dismissal may be deemed `collateral orders' immediately appealable * * *.\"\n\nThe characterization of Mechanik by the author, a partner in the Washington, D.C. law firm of Williams and Connolly, is expressive:\n\n\"Justice Rehnquist's recent opinion for a five-member majority, reversing the dismissal of a grand jury's conspiracy charge in United States v. Mechanik [supra], entails a remarkable departure from both precedent and protection of the accused's rights in grand jury proceedings.\n\n\"Invoking the harmless error rule in a novel fashion, the Mechanik majority held that grand jury errors may not be remedied on appeal because the petit jury's verdict of guilt established that `any error in the grand jury proceeding connected with the charging decision was harmless beyond a reasonable doubt.'\n\nId. at 942. Thus, the presence of an unauthorized person in the grand jury room — a hitherto well-recognized ground for dismissing an indictment pretrial — was treated by the Mechanik majority as harmless error when raised on appeal. The policy justification for this unusual legal rule rested upon a combination of `Chicago School' economics and Persian poetry. The `societal costs of reversal and retrial' were held to outweigh the benefits of vindicating a convicted defendant's grand jury rights. And Omar Khayyam's Rubaiyat supplied Rehnquist with the philosophical rationale he required: `In courtroom proceedings as elsewhere, \"the moving finger writes, and having writ moves on\".' Id. at 942-43.\" Id. at 2.\n\n\"* * * The ABA House of Delegates unanimously called for such legislation at the August 1986 ABA Annual Meeting, adopting a resolution proposed by the Criminal Justice Section's White Collar Crime Committee in March and approved by the Section Council in April. Rarely does the ABA react so quickly to a Supreme Court decision; its speed reflects the profession's concern with Mechanik's potentially sweeping effects. Indeed, the ABA Journal's Supreme Court column had warned, `Without congressional action to create the mechanism for enforcing Rule 6, criminal practice may no longer be concerned in any meaningful way with grand jury abuses.' 72 ABAJ 88, 90 (May 1986).\n\n\"* * * It is urgent that the 100th Congress adopt a `Grand Jury Procedural Protection Act of 1987' to ensure that the Mechanik case may not long continue to make historic grand jury safeguards `a dead letter.'\" Id. at 40-41.\n\nI find no differentiation in system compliance and justice delivery between Vasquez v. Hillery, 474 U.S. 254, 106 S.Ct. 617, 88 L.Ed.2d 598 (1986), and United States v. Mechanik, supra, except by artificialities of result orientation. This is result-determined justice adjudication in its clearest terms as a reassertion that the end justifies the means. A more rational recognization and reconsideration of prosecutorial misconduct is found in conviction reversal in United States v. Valentine, 820 F.2d 565 (2d Cir. 1987) in prosecutorial misrepresentation of grand jury testimony.\n\nAdditionally, it would seem that this court further misreads Mechanik since the no-consideration rule denominated in the concurrence of Chief Justice Burger found no other support as the court's opinion. The seriousness with which this aberration from fairness and due-process case law is considered, is illustrated by subsequent evaluation in the number of concerned law journal articles and symposium comments.\n\nI am also lost in supposition as to what the court proposes in suggestion of a test of defect by habeas corpus. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e In the first place, the defendant is not always in jail. Not only is this ephemeral in application by denied records, but I suggest it more realistically invites interim appeal, certiorari, or prohibition, or all three, to procedurally raise and dispositively document grand jury process error on a far broader attack than is the jurisdictional inquiry of habeas corpus. Assuming that Headrest might be the prosecution witness, do we resolve here that individual trial-testimony sufficiency cannot be tested? Gary Trudeau, Doonesbury. A logical extension is to eliminate criteria for any evidence, with process then to be identifiable with the Marine drill sergeant and his platoon as the grand jury is acclimated to obeyed directive. See somewhat similarly directed comments of Justice Douglas in special concurrence in Coleman v. Alabama, 399 U.S. 1, 15, 90 S.Ct. 1999, 26 L.Ed.2d 387 (1970), where he observed that in Russia the courtroom trial concerned only the issue of punishment.\n\nConstitutional protection of individual rights in the face of discernible United States Supreme Court trends is now a primary responsibility of state courts.\n\n\"The 1980s could prove to be a decade of significant state court leadership in the field of individual rights protection. In the era since Warren Burger replaced Earl Warren as Chief Justice of the U.S. Supreme Court, state courts of last resort have rendered some 300 published opinions declaring that the constitutional minimums set by certain U.S. Supreme Court interpretations of the U.S. Bill of Rights and the fourteenth amendment are insufficient to satisfy the more demanding precepts of state law. This trend continued in 1985.\" Collins and Galie, Models of Post-Incorporation Judicial Review: 1985 Survey of State Constitutional Individual Rights Decisions, 55 Cin.L.Rev. 317 (1986).\n\nThoughtful application of the opportunity suggested by Gallivan, Supreme Court Jurisdiction and the Wyoming Constitution: Justice v. Judicial Restraint, XX Land \u0026 Water L.Rev. 159, supra, is not inapposite in progressive persuasion. For current review in other states considering either or both prosecutorial or investigatory attributes, see Note, The Reportorial Power of the Alaska Grand Jury, III Alaska L.Rev. 295 (1986), and Gingerich, The Arkansas Grand Jury: 19th Century Answers to 20th Century Problems, 40 Ark. L.Rev. 55 (1986). This court should follow the Wyoming Constitution and long-existent precedent clearly recognized by New York in People v. Wilkins, supra, 68 N.Y.2d 269, 508 N YS.2d 893, 501 N.E.2d 542. The need to exercise that responsibility was never so immediately obvious as now clearly portrayed in the current Tenth Circuit case of United States v. Kilpatrick, supra, 821 F.2d 1456.\n\nJ. Empaneling Jury and Engrossment of Indictments\n\nArgument considering the propriety of the action is artificial and academic because of the absence of a record of what was presented to the court that may or may not have justified the grand jury call except the obviously intended avoidance of preliminary hearings. The majority presume validity, while from a lifetime nurtured in cynicism, fortified by fact-denying secrecy, I profess doubt.\n\nI will not as simplistically excuse statutory compliance with the indictment execution process. In this drumhead race to attenuated indictment, the pre-appearance prepared indictments included in typed phraseology the \"a true bill\" statutory endorsement requirement for the jury foreman. This status is symptomatic of the entire operation where the State denies its statutory obligation as the process is hidden in secrecy. Why should a rule compliance be a non sequitur for the prosecutor when waiver and harmless error impale the defendant? Cf. Frisbie v. United States, 157 U.S. 160, 163, 15 S.Ct. 586, 39 L.Ed. 657 (1895), where no statutory provision existed requiring \"such endorsement and authentication.\"\n\nI do not need \"authority\" to deny rationally the court's conclusion. The Wyoming legislature specifically decided the execution process for indictment. Through either ignorance or willful noncompliance of the prosecutor, the statute was ignored. Case law is missing, since where else would 67 indictments be prepared in an explicit fashion contrary to statute? In dissent, I doubt the question deserves further consideration, since future prosecutors can surely follow § 7-5-104, W.S. 1977, 1987 Replacement, as then subjected to court examination upon presentation by § 7-5-209, W.S. 1977, 1987 Replacement:\n\n\"Indictments found by the grand jury shall be presented by the foreman to the court in the presence of the jury and filed with the clerk.\"\n\nI find the form-and-substance rule to be a two-way street, particularly as applied or ignored in statutory mandatory requirements for indictment execution and authentication. I would find there is no indictment unless executed in the statutorily required fashion, or the requirement is properly waived by failure of any attack on the indictment before trial. Surely one lawyer, one judge, one clerk of court, and one jury foreman can combine to assure proper execution of this singularly oppressive personal-liability document. A not unfair comparison would be the unsigned affidavit for issuance of an arrest or search warrant. The ratio decidendi of Kirkland v. State, 86 Fla. 64, 97 So. 502 (1923), of failure to object to indictment prior to trial in one case can scarcely be applied as authority in this case to 67 or 94 improperly executed criminal-charge documents. See State v. DeBoard, 119 W. Va. 396, 194 S.E. 349 (1937), and State v. Burnette, 118 W. Va. 501, 190 S.E. 905 (1937). The Wyoming statute does not say \"may,\" but says \"shall\" in § 7-5-106, W.S. 1977, and still says \"shall\" in the present statute, § 7-5-104(c), W.S. 1977, 1987 Replacement:\n\n\"If an indictment is found as provided by this section the foreman of the grand jury shall endorse upon the indictment the words `A True Bill' and shall sign the indictment.\"\n\nIV. CONCLUSION\n\nIn conclusion, I cannot conform with the result as exculpated by the majority, by seeing the grand jury saga of Campbell County as a phantom or a figment of the imagination of those drawn into that vortex of societal disputation. There were real people, involving real events, invoking criteria of a real Constitution, with real consequences. Although Hennigan, now released from confinement, can hardly be expected individually to be providing future guidance, I challenge this sorry history in uneasy contemplation of recurrence, when any of us, or any other citizens, might improvidently be entrapped within the encircling web. I perceive with historical relevance to the efforts of the framers of the Wyoming Constitution, that their endeavors in composing that document are at least in this aspect now to be denied effectuation in securing civil liberties for posterity.\n\nI conclude that this court was mistaken in the summary denial of writs of certiorari or prohibition which would have afforded a much earlier and expeditious opportunity to have analyzed and considered the operation of the Campbell County grand jury in constitutional and historical perspective. Now, nine filed appeals and thousands of words later, the societal perspectives of the justice-delivery system demonstrated by the past Campbell County events cannot be ignored for future standards.\n\nIn accord with the prayer of the appeal, I would reverse the conviction. The confinement time of Hennigan has been served, and the commutation resolves jeopardy from retrial.\n\n\u003cspan class=\"fn\"\u003e1. Section 35-7-1031(a)(ii), W.S. 1977, provides: \"(a) Except as authorized by this act [§§ 35-7-1001 to 35-7-1055], it is unlawful for any person to manufacture, deliver, or possess with intent to manufacture or deliver, a controlled substance. Any person who violates this subsection with respect to: \"(ii) Any other controlled substance classified in Schedule I, II or III, is guilty of a crime and upon conviction may be imprisoned for not more than ten (10) years, fined not more than ten thousand dollars ($10,000.00), or both.\" Section 35-7-1014(d), W.S. 1977, includes marihuana in the controlled substances classified in Schedule I.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Art. 1, § 13 of the Constitution of the State of Wyoming provides as follows: \"Until otherwise provided by law, no person shall, for a felony, be proceeded against criminally, otherwise than by indictment, except in cases arising in the land or naval forces, or in the militia when in actual service in time of war or public danger.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Amendment V to the Constitution of the United States provides in pertinent part as follows: \"No person shall be held to an answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury, except in cases arising in the land or naval forces, or in the Militia, when in actual service in time of War or public danger; * * *.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Relevantly, as stated in philosophy by Laurence H. Tribe: \"This is not to advocate permanent skepticism or indecision or to urge a halt to confident and even deeply committed advocacy of constitutional positions. It is to say that, in matters of power, the end of doubt and distrust is the beginning of tyranny.\" L. Tribe, Constitutional Choices, p. 7 (1985). A bibliography of books and authors on the subject of the grand jury is found in 10 Am. Crim.L.Rev. 867 (1971-72), and encompasses more than 20 books and 150 articles.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. A copy of this motion, any hearing evidence, the order calling the jury, and the instructions given, were never made available to defendants, either in district-court hearing, or in the record on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. One assumption manifested with some justification is that insulation from perjury and cross-examination was assured since the undercover representative, in not having to testify before the grand jury about his investigation, would be first under oath at time of trial examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. This provision is clearly not supportable by state law or precedent, but was not raised as an appeal issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. We would note on secrecy, § 7-5-207, W.S. 1977, 1987 Replacement, and § 7-5-208(b) and (c), W.S. 1977, 1987 Replacement, which now provide: \"The district judge may direct that an indictment shall be kept secret until the defendant is in custody or has given bail, and in that event the clerk shall seal the indictment and no person shall disclose the finding of the indictment except when necessary for the issuance and execution of a warrant or summons.\" Section 7-5-207. \"(b) Except as provided in subsection (a) of this section, a juror, attorney, interpreter, stenographer, operator of a recording device or any typist who transcribes recorded testimony may disclose matters occurring before the grand jury only when so directed by the court preliminarily to or in connection with a judicial proceeding or when permitted by the court at the request of the defendant upon a showing that a particularized need exists for a motion to dismiss the indictment because of matters occurring before the grand jury. \"(c) No obligation of secrecy may be imposed upon any person except in accordance with this section and W.S. 7-5-207.\" Section 7-5-208.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This task is not approached as suggested by the trial court in its consideration of defendant's motions in this case challenging the grand jury, wherein, in anticipation of argument of counsel and directly addressing the Wyoming Supreme Court, the trial judge stated: \"As you know, I have returned recently from the National Judicial College in Reno, where among other things, I learned the definition of an appellate judge, and it's one who comes down from the hills after the battle is over and shoots the wounded. I hope you'll keep that in mind when you review the transcript in this case.\" Conversely, what we must actually consider are fundamental issues and constitutional responsibilities of judicial officers whose right to office is created by the Constitution, and whose responsibilities are controlled by oath.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The reason of the law ceasing, the law itself also ceases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Wyoming law first found in Ch. XIV, Compiled Laws of Wyoming 1876, later found in similar form in pre-1987 enactment, provided in regard to secrecy: \"Sec. 64. When the foreman shall be appointed, an oath or affirmation shall be administered to him in the following words: `You, as foreman of this grand inquest, do solemnly swear (or affirm) that you will diligently inquire and true presentment make of all such matters and things as shall be given you in charge, or otherwise come to your knowledge touching the present service. The counsel of the Territory, your own and your fellows you shall keep secret, unless called on in a court of justice to make disclosures. You shall present no person through malice, hatred or ill will, nor shall you leave any person unpresented through fear, favor or affection, or for any reward or hope thereof; but in all your presentments you shall present the truth, the whole truth and nothing but the truth, according to the best of your skill and understanding.'\" A similar obligation of secrecy was charged to other jury members: \"Sec. 67. The prosecuting attorney, or the assistant prosecuting attorney, shall be allowed at all times to appear before the grand jury for the purpose of giving information relative to any matter cognizable by them, or giving them advise upon any legal matter when they may require it, and he may be permitted to interrogate witnesses before them when they or he shall deem it necessary; but no such attorney, nor any other person, shall be permitted to be present during the expression of their views, or the giving of their votes on any matter before them.\" \"Sec. 70. If any witness appearing before a grand jury shall refuse to answer any interrogatories during the course of his examination, the fact shall be communicated to the court in writing, in which the question refused to be answered shall be stated, together with the excuse for the refusal, if any be given by the person interrogated; and the court shall thereupon determine whether the witness is bound to answer or not, and the grand jury shall be immediately informed of the decision.\" \"Sec. 74. No grand juror or officer of the court shall disclose that an indictment has been found against any person not in custody or under bail, except by the issuing of process, until the indictment is filed and the case docketed.\" These sections included the total statutory provisions for grand jury secrecy which applied to this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The accuracy of this statement is the singular issue of defense discovery demand. Confirmation by the prosecutor whether the original investigative report was in the open file or not could have saved a tremendous interest in majority opinion and this dissent, and, if actually furnished, might have rendered most of this decision at best academic and more particularly moot on appeal. If the issues here were to be restated in simple language, they would be unfairness, and inaccuracy or perjury in prosecution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The American Bar Association again addressed grand jury concerns in its 1987 national meeting when the house of delegates approved the Criminal Justice Section recommendation of Grand Jury Principle No. 32 which provides for the release of all grand jury materials to the defendant after indictment unless, upon a showing of good cause, a court decides that a protective order is appropriate. 56 U.S.L.W. 2095.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. These events are addressed in this dissent in some detail, with the reasoned expectation that there will be no recurrence in Wyoming jurisprudence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. To the extent that United States Supreme Court decisions provide persuasion for application to the Wyoming Constitution, we need not consider the somewhat dissimilar authorities relating to release of grand jury records for civil processes, including, among others, Douglas Oil Co. of California v. Petrol Stops Northwest, 441 U.S. 211, 99 S.Ct. 1667, 60 L.Ed.2d 156 (1979). I cannot completely identify civil discovery cases with constitutional due-process and equal-protection concerns extant in grand jury records in criminal prosecution. Otherwise, we again subscribe to an immutable principle of primary significance that the end justifies the means. In an exceptional analysis on trial reversal for denial of grand jury testimony, the United States Supreme Court said: \"* * * [I]t is especially important that the defense the judge, and the jury should have the assurance that the doors that may lead to truth have been unlocked. In our adversary system for determining guilt or innocence, it is rarely justifiable for the prosecution to have exclusive access to a storehouse of relevant fact.\" Dennis v. United States, 384 U.S. 855, 873, 86 S.Ct. 1840, 16 L.Ed.2d 973 (1966). The Court then reminded us: \"In our adversary system, it is enough for judges to judge. The determination of what may be useful to the defense can properly and effectively be made only by an advocate.\" Id. at 875 [86 S.Ct. at 1851]. See likewise Napue v. Illinois, 360 U.S. 264, 269, 79 S.Ct. 1173, 3 L.Ed.2d 1217 (1959), involving \"false testimony, to obtain a tainted conviction.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. I do not ignore either the rule of this court, Rule 7(b), W.R.Cr.P., or our case law relating to hearsay evidence in pre-trial hearing, Wilson v. State, Wyo., 655 P.2d 1246 (1982). Several aspects justifying clear differentiation should be discerned. (1) Rule 7(b) is persuasive within the discretion of the impartial examining magistrate in application to the preliminary hearing and not solely by choice of the prosecuting official; (2) the moral responsibility as an impartial examiner vested in the magistrate affords a dissimilar aptitude from that existent in prosecutorial zeal; (3) if experience affords intellectual basis for appropriate decision, the magistrate employs a discretionary ability not similarly available for layperson grand jurors untrained in evidence and practical rules of legal persuasion, cf. State v. Carter, Wyo., 714 P.2d 1217 (1986), Urbigkit, J., dissenting; (4) a right to cross-examine the tendered witness is afforded. In any and every event, real knowledge, not second-hand recitation, should always be desired, provided, and required, if reasonably available. Too many judges and academicians have spent too few hours trying lawsuits to adequately understand the general invalidity of most hearsay — not just hearsay, but testimony untempered by cross-examination. \"* * * We are mindful of the oft-quoted words of Judge Learned Hand that `[s]ave for torture, it would be hard to find a more effective tool of tyranny than the power of unlimited and unchecked ex parte examination.' United States v. Remington, 208 F.2d 567, 573 (2d Cir. 1953) (L. Hand, J., dissenting), cert. denied, 347 U.S. 913, 74 S.Ct. 476, 98 L.Ed. 1069 (1954).\" United States v. Kilpatrick, supra, 821 F.2d at 1464-1465.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In the first Costello case in Circuit Court, Judge Learned Hand recognized, in quoting Professor Morgan in Model Code of Evidence, A.L.I., p. 223: \"`The fact is, then that the law governing hearsay to-day is a conglomeration of inconsistencies, developed as a result of conflicting theories. Refinements and qualifications within the exceptions only add to its irrationality.'\" United States v. Costello, 221 F.2d at 678.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Also paraphrasing substantially, the terminology of a closing line of numbers of contemporary jokes applies: \"67 individual indictments of about 237 counts, achieved in three days, may not be a record, but it is a d____ good average.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Judith Resnik, in a most thoughtful analysis entitled Failing Faith: Adjudicatory Procedure in Decline, 53 U.Chi.L.Rev. 494 (1986), in recognizing that fewer and fewer criminal cases are tried, related: \"On the criminal and administrative sides of the docket, parallel illustrations of the anti-adjudication posture are easily identified. Most criminal decisionmaking occurs through the settlement process — plea bargaining. Criticism of plea bargaining comes from prosecution, defense, and the judiciary; no one much likes the system but no one wants to pay for the alternative — adjudication. \"Further, in the few criminal cases that are tried, the decisions reached have impressive durability; harmless error doctrine has grown and enforcement of criminal defendants' rights has diminished. The recent evisceration of the Brady v. Maryland requirement that prosecutors provide exculpatory evidence to defendants underscores the distance between the adjudicatory premises of the past decades and the current acceptance of a disposition-oriented system.\" Id. at 532-533. See the countervailing attack on plea bargaining in a sensationalized attack on the judiciary and judicial system in R. Adamfine, Escape of the Guilty (1986). I would reflect by current review: \"Not every constitutional theory matters, and not every difference in competing constitutional theories matters. But many constitutional theories matter, and profound differences in constitutional theory matter profoundly.\" Laycock, Constitutional Theory Matters, 65 Tex.L.Rev. 767, 775 (1987). Consider, also, Jenkins, The Lobster Shift, A.B.A.J. at 56, (November 1, 1986). \"Our citizens see the courts as the ultimate protection, and the rock of stability, in the protection of their rights in the face of a lack of commitment on the part of the executive and legislative branches in protecting those rights. Our citizens understand that the political winds may blow against the frail reeds of statutory protections of their rights, but that our courts are the solid rocks of protection of fundamental rights.\" Greene, The Jury — Protecting the Rights of our Citizens, XVII CTLA Forum 38 (March 1987). Ovio C. Lewis, having served as a grand jury foreman, initiated his comments in The Grand Jury: A Critical Evaluation, 13 Akron L.Rev. 33 (1979): \"It seems in retrospect that our grand jury was a microcosm of grand juries generally in that many of the problems noted in the literature were manifest throughout our term. This supports the proposition that the weaknesses and defects of grand juries are not reflective of lack of zeal or devotion to duty on the part of individual members of the juries, but rather are indicative of systemic and institutional dysfunctionalities that are inherent in the grand jury system as it is presently constituted and organized. Thus, the critical comments that appear herein ought not to be taken as an attack upon the competence or integrity of a particular prosecutor, judge or grand jury, but rather as directed at reformation of the current institutional arrangement.\" Historically noting: \"Although it is clear that historically the Grand Jury was designed as an agency of the executive, and in fact generally acted like a ventriloquist's dummy, the myth of the institution as a bulwark to protect the individual from despotic and arbitrary prosecution led to placing in the Bill of Rights the requirement of a presentment or indictment of a grand jury as a prerequisite to prosecution.\" Id. at 39-40. He concluded: \"A survey of the literature and a term as grand jury foreman have convinced me that the powers that be do not want a truly independent grand jury which on its own would challenge the circumlocution office and the contemporary political equilibrium. Instead, adhering to Hoffenstein's, `come weal come woe, my status is quo,' a docile and malleable institution is praised as the `people's panel' serving as a bulwark of protection for the individual against the state. Given this posture and the absence of any lobby for change, reform is most unlikely. Further, as indicated above, other constitutional arrangements would better serve the same ends as the proposed reformed grand jury. It is revolting to discover that there is no better reason for the continuation of a practice detrimental to the rights of the individual than that it existed in the time of Henry II. The Grand Jury no longer serves, nor given contemporary conditions, can it serve its constitutional function of protecting the citizen from arbitrary and oppressive prosecution by the state. Accordingly, the only rational course of action requires abolition of the institution.\" Id. at 66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. In all reasonable political probability, Murray might still be county attorney and Hladky still sheriff if the processes utilized in Campbell County had included an information and preliminary hearing, or if this court had required the availability of a preliminary hearing after the 67, three-day indictment sessions had been completed, so that rational examination in a fair relationship of probable cause would have been afforded for a perception of an operationally fair justice system in community view.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The relationship of this statute to the use and derivative use immunity attempted to be afforded by the prosecutor is an interesting inquiry in itself. More specifically, the process is defined when one witness, obviously more informed than the normal subpoenaed participant, occasioned this exchange: \"A. Do you have the authority to grant immunity? \"Q. That's correct, I do. \"A. Under what authority? \"I've got some questions, and I guess I just — I don't mean to discuss that in front of the grand jury, but I think that it's appropriate to do it. \"Q. Okay. Judge Judson for other witnesses over the past three weeks from the time that we have met has formally held that I had the common law authority to grant use and derivative use immunity. \"A. Okay. \"Q. And my understanding here from you today is unless you are compelled to testify that you do not intend to testify? For the purpose of the record, I am compelling that testimony, and in violation — or in light of your fifth amendment assertion. \"A. Okay. The only question that I have is — and I want to testify in front of the grand jury. \"I seek your immunity that you are giving me, but the only question I have is, according to the common law and according to Wyoming statutes, § 35-7-1043 provides for certain methods for giving of immunity to other people including law enforcement officials and others. \"What I'm concerned is that the immunity that you are giving me, which I hope is good, will in fact be good, but the pertinent portion of that statute provides that — it says, `in addition to the foregoing persons,' — referring to law enforcement officials — `such immunity may also be granted to any person whose testimony is necessary to secure a conviction under this act with the consent of the district judge in the district wherein prosecution is to take place.' \"My concern is that the statutes abrogating the common law provide the need for some judicial stamp of approval for my immunity. \"Q. Judge Judson has ruled that is not an exclusive way of granting immunity. \"A. Okay. \"Q. I think the important thing for you to remember is that you've announced for purposes of the record that you do not wish to testify unless you are compelled to do so. \"Once it's compelled testimony, it obviously cannot be used against you. \"A. Yeah. \"Q. And I think if you wish to make any further statements on the record concerning the fact that you do not wish to testify, and I very clearly am telling you that I am compelling you to testify — \"A. Okay. \"Q. I think you are probably amply protected. \"Furthermore, you are not a target of the grand jury. We do not intend to seek prosecution. \"A. All right.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The present law in effect May 22, 1987, provides that the term shall be for one year after selection unless discharged sooner by the district judge. Section 7-5-102, W.S. 1977, 1987 Replacement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The majority opinion states: \"Fashioning an appropriate remedy for any harm arising out of an error in the preliminary stage that did not have any effect upon the fairness of the trial before the petit jury, after a verdict of guilty has been returned, would be difficult if not impossible. It could not warrant a reversal of the conviction. [Citations.] If the defect is brought to light prior to trial that problem is not present. For example, the defendant may challenge a defect in the jurisdiction of the grand jury by habeas corpus prior to trial. Section 1-27-125, W.S. 1977; [citation].\" Majority opinion at 373.\u003c/span\u003e\n\n",
    "body_length": 241577,
    "citedas": [
      "746 P.2d 360"
    ],
    "attorneys": "Leonard D. Munker, State Public Defender; Julie D. Naylor, Appellate Counsel; Gerald M. Gallivan, Director, Wyoming Defender Aid Program; and Megan Olson, Student Intern, Wyoming Defender Aid Program, for appellant. A.G. McClintock, Atty. Gen.; Gerald A. Stack, Deputy Atty. Gen.; Mary B. Guthrie, Sr. Asst. Atty. Gen., and John W. Renneisen, Sr. Asst. Atty. Gen., for appellee.",
    "category": [
      "243",
      "75"
    ],
    "judges": "BEFORE BROWN, C.J., AND THOMAS, CARDINE, URBRIGKIT AND MACY, JJ.",
    "citation_count": 0
  }
}
