{
  "id": "NIZiP2YBTlTomsSBLXlu",
  "document": {
    "title": "Marozsan v. United States and Veterans' Administration",
    "full_title": "STEPHEN MAROZSAN v. THE UNITED STATES OF AMERICA AND THE VETERANS' ADMINISTRATION",
    "jurisdiction": "Seventh Circuit",
    "date": "1988-07-25T00:00:00.000Z",
    "docket": "No. 86-1954",
    "body": "Joel M. Flaum, Circuit Judge, with whom William J. Bauer, Chief Circuit Judge, and Walter J. Cummings, Harlington Wood, Jr., Richard D. Cudahy, Richard A. Posner, John L. Coffey, Frank Easterbrook, Kenneth F. Ripple, Daniel A. Manion, and Michael S. Kanne, Circuit Judges, join.\n\nStephen Marozsan filed a complaint in the district court alleging in part that the Veterans' Administration violated his constitutional right to due process of law. The district court ruled that 38 U.S.C. § 211(a) \"bars a court from hearing and reviewing an action challenging a decision of the V.A., even when a plaintiff alleges that the decision violates his constitutional rights.\" Marozsan v. United States, 635 F. Supp. 578, 580 (N.D. Ill. 1986). Because Marozsan challenges the constitutionality of the procedures used by the Administrator, and because we do not read § 211(a) to preclude a federal court from hearing this challenge, we reverse and remand for further proceedings consistent with this opinion.\n\nI.\n\nMarozsan injured his back in 1949 while on active duty in the Navy. He filed his first claim for veterans' benefits in 1953. This and subsequent claims\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e were denied until 1981, when the Board of Veterans' Appeals rated Marozsan 20 % disabled. The Board refused Marozsan's petitions to increase this rating. In August of 1984, Marozsan filed an action in federal court alleging, among other things, that the V.A. employed an arbitrary quota system in processing claims that denied him due process of law. In his complaint, Marozsan requested that the district court issue a \"directive to the Agency\" enjoining \"capricious and arbitrary\" decisions. He also asserted that he\n\ndoes not seek judicial review of the decision rendered in his own particular V.A. claim action, erroneous as it may be, but is questioning the constitutionality of the V.A. procedures which make it impossible for veterans to obtain a fair and impartial hearing.\n\nThe district court dismissed all of the defendants except the United States and the V.A.,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e converted the defendants' motion to dismiss into a motion for summary judgment, and entered summary judgment in their favor. The court found that § 211(a) was an unequivocal bar to judicial review of Marozsan's due process claims, and rejected on the merits his equal protection challenge to the statute itself.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nII.\n\nThe district court interpreted Marozsan's claim as a challenge to his benefit level and therefore a claim essentially seeking money from the Treasury. But this is an inappropriate characterization of the complaint. Although it is not a model pleading, a reading of Marozsan's complaint clearly reveals that it establishes a claim for more than benefits. He alleges serious constitutional violations, including a claim that the V.A. employs a quota system\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e which arbitrarily limits the number of benefits claims granted. This procedure, he asserts, unconstitutionally deprived him of his property interest in his veterans' benefits.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e It is evident that Marozsan would like to obtain increased benefits from the Administrator; were he not a disabled veteran seeking benefits the events giving rise to this action would not have occurred, and Marozsan would not have standing to challenge the V.A.'s procedures. But the V.A.'s decision to grant or deny him higher benefits under the veterans' benefits statutes and regulations is not our concern. Marozsan properly asks us to review the methods--not the decision--of the Administrator. He claims that a federal executive agency has acted outside its constitutional authority by violating his right to due process. Marozsan's action therefore is not essentially a suit to recover veterans' benefits; \"it is a suit to enforce lawful conduct on the part of the [administrator].\" Starnes v. Schweiker, 715 F.2d 134, 141 (4th Cir. 1983) (holding that § 1395ff of the Social Security Act did not bar claims that the Secretary's reimbursement ceilings violated the Constitution). When the issue is \"not whether the Administrator's decision granting or denying benefits in a particular case was right or wrong, but rather whether the Administrator had acted consistently with his grant of authority or had exceeded his authority and acted in violation of veterans' rights guaranteed by the fifth amendment,\" § 211(a) does not apply. Arnolds v. Veterans' Administration, 507 F. Supp. 128, 130-31 (N.D. Ill. 1981).\n\nThe district court, having labeled Marozsan's challenge a claim for benefits despite its constitutional allegations, ruled that a federal court could not exercise review. This holding, if correct, would imply that Congress has chosen not to grant Marozsan a judicial remedy against V.A. procedures that violate the Constitution. As a result, Marozsan would have no judicial forum, and indeed--since the V.A. disclaims authority to consider constitutional claims\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e --no forum at all in which to raise his due process claim.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e See Bartlett v. Bowen, 259 U.S. App. D.C. 391, 816 F.2d 695, 703 (D.C. Cir. 1987). Yet if § 211(a) deprives us of jurisdiction, that statute would implicate profound and long-debated questions about the power of Congress, consistent with Article III, to preclude all judicial review of executive agency action. We must construe statutes to avoid such difficult constitutional questions whenever possible. Edward J. DeBartolo Corp. v. Florida Gulf Coast Bldg. and Constr. Trades Council, 485 U.S. 568, 108 S. Ct. 1392, 1397, 99 L. Ed. 2d 645 (1988); Johnson v. Robison, 415 U.S. 361, 366-67, 39 L. Ed. 2d 389, 94 S. Ct. 1160 (1974). The logical extension of the Supreme Court's reasoning in Johnson and Traynor v. Turnage, 485 U.S. 535, 108 S. Ct. 1372, 99 L. Ed. 2d 618 (1988) and the structure of our constitutional form of government dictate that we not read § 211(a) to preclude all judicial review of a veteran's serious constitutional claims. To preserve its constitutionality, we must instead construe § 211(a) to allow substantial constitutional challenges\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e to the veterans' benefits statutes and regulations, as well as to the procedures established by the V.A. to administer them.\n\nIII.\n\nWhen the district court ruled on Marozsan's claim, it did not have the benefit of two decisions of this court which narrowly construed § 211(a). Because the statute is facially ambiguous, it is possible to interpret it as barring review of all decisions of the Administrator (a broad interpretation), or only those decisions of law or fact under V.A. benefits laws (a narrower construction).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In Winslow v. Walters, 815 F.2d 1114, 1117 (7th Cir. 1987) a veteran filed an action challenging the constitutionality of the V.A.'s procedures, claiming that the agency did not provide him with a hearing before changing his disability rating. We held in Winslow that § 211(a) does not bar review of claims that the procedures of the V.A. violate the due process clause. In Mathes v. Hornbarger, 821 F.2d 439, 440 (1987) we reiterated the holding of Winslow that \"federal courts are not divested of jurisdiction over suits challenging the constitutionality of the VA's procedures under the Due Process Clause of the Fifth Amendment.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The narrow interpretation of § 211(a) that we adopted in Winslow and Mathes is not only viable, it is required in order to avoid the serious constitutional questions necessarily raised by a broader construction of the statute.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nMathes and Winslow interpreted and applied Johnson v. Robison, 415 U.S. 361, 39 L. Ed. 2d 389, 94 S. Ct. 1160 (1974), the seminal case on the construction of § 211(a). The Supreme Court held in Johnson that veterans may challenge in federal court the constitutionality of veterans' benefits legislation. The Court held that the statute does not bar challenges to the constitutionality of such legislation because its enactment is a decision of Congress, not the Administrator.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The Court chose to read § 211(a) to allow constitutional review of veterans' benefits statutes in order to avoid \"serious questions concerning the constitutionality\" of the statute which would be raised by a contrary construction. Id. at 366. Whatever the statute precludes, the Court in effect said, it does not preclude judicial review of the constitutionality of the legislation. The Court did not need to go beyond the statutory challenge at issue to consider whether review of constitutional challenges to the V.A.'s regulations or procedures might also be required. Chief Justice Rehnquist later suggested, however, that Johnson implicitly interpreted § 211(a) to allow precisely the kind of challenge Marozsan makes. \"Despite the general preclusion of judicial review with respect to VA benefits claims, this Court held in Johnson . . . that the district courts have jurisdiction to entertain constitutional attacks on the operation of the claims systems.\" Walters v. Nat'l Ass'n of Radiation Survivors, 473 U.S. 305, 311, 87 L. Ed. 2d 220, 105 S. Ct. 3180 n.3 (1985).\n\nEven though Johnson did not explicitly resolve the fate of constitutional challenges to the procedures employed by the Administrator in his \"operation of the claims systems,\" the reasoning of that case compels federal court review of Marozsan's claim. The Johnson decision was based on three factors in addition to the Court's desire to avoid an unnecessary construction of § 211(a) which would implicate constitutional concerns. First, the statute itself contains no explicit language barring judicial consideration of a veteran's constitutional challenge to the benefits system. This factor applies to Marozsan's claim as well, because the statute is equally silent on judicial review of claims that the procedures utilized to effectuate the benefits system violate the Constitution. Second, the Johnson Court accepted the V.A.'s protestations that the Administrator is not competent to decide constitutional questions. 415 U.S. at 368. See Weinberger v. Salfi, 422 U.S. 749, 761, 45 L. Ed. 2d 522, 95 S. Ct. 2457 (1975) (section 211(a) did not preclude review in Johnson partially because \"the issue was one which the Administrator considered to be beyond his jurisdiction\"); Taylor v. United States, 385 F. Supp. 1034, 1036 (N.D. Ill. 1974), rev'd on other grounds, 528 F.2d 60 (7th Cir. 1976) (section 211(a) does not prevent judicial review \"where the controversy involve[s] constitutional questions beyond the scope of authority of the Veterans' Administration\"). See also Traynor, 108 S. Ct. at 1379 (there is no \"reason to believe that the [V.A.] has any special expertise in assessing the validity of its regulations construing veterans' benefits statutes under a later-passed statute of general application\"). Marozsan's allegation that the Administrator utilizes an arbitrary quota system requires constitutional analysis peculiarly within the competence of an independent judiciary.\n\nFinally, the legislative history of § 211(a) contains no indication that Congress intended to bar judicial review of constitutional questions.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e As the Court in Johnson found, the legislative history clearly evinces two purposes. Section 211(a) was intended to avoid burdening the courts with requests for review of individual claims determinations. though it is clear that Congress feared that the courts would be inundated if required to review fact-specific benefits decisions, there is not even a hint that Congress intended to exclude consideration of substantial constitutional claims, whatever the marginal burden on the courts. Further, as Judge Posner points out in his concurrence, the post-Johnson advent of Federal Rule of Civil Procedure 11 protects the federal courts from a flood of insubstantial claims. Veterans or their counsel who file frivolous claims, whether or not they allege violations of the Constitution, will now be sanctioned under Rule 11. In addition, it is not clear what incentive lawyers would have to file frivolous constitutional challenges when courts have no jurisdiction to hear related meritorious benefits claims. See Fallon, On Legislative Courts, Administrative Agencies, and Article III, 101 Harv. L. Rev. 916, 976 n.328 (1988).\n\nThe statute was also intended to ensure the expert and uniform adjudication of individual claims.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Yet this \"interest in uniform administration of veterans' benefits focuses . . . on the technical interpretations of the statutes granting entitlements, particularly on the definitions and degrees of recognized disabilities and the application of the graduated benefit schedules.\" Rose v. Rose, 481 U.S. 619, 107 S. Ct. 2029, 2035, 95 L. Ed. 2d 599 (1987). Johnson noted that \"the prohibitions [of § 211(a)] would appear to be aimed at review only of those decisions of law that arise in the administration by the Veterans' Administration of a statute providing benefits for veterans. A decision of law or fact 'under' a statute is made by the Administrator in the interpretation or application of a particular provision of the statute to a particular set of facts. . . .\" 415 U.S. at 367. See Rose, 107 S. Ct. at 2035. The Court thus implicitly recognized that § 211(a) was intended to bar only those actions that challenge the V.A.'s application of benefits laws to specific fact situations. See Gott v. Walters, 244 U.S. App. D.C. 193, 756 F.2d 902, 918-19, vacated and dismissed as moot, 791 F.2d 172 (D.C. Cir. 1985) (Wald, J., dissenting).\n\nThe Supreme Court's recent decision in Traynor v. Turnage, 485 U.S. 535, 108 S. Ct. 1372, 99 L. Ed. 2d 618 (1988) confirms this reading of Johnson.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Traynor was an honorably discharged veteran who had not exhausted his educational benefits. Ne sought to continue receiving benefits after the expiration of the applicable ten-year limit on the ground that he had been disabled by alcoholism during much of that period. The administrator found that alcoholism was \"willful misconduct\" under a V.A. regulation and denied the requested benefits. \"Traynor sought review of the Veterans' Administration's decision\" in his case, id. at 1377, which he claimed violated § 504 of the Rehabilitation Act.\n\nThe Court found that § 211(a) did not bar judicial review of Traynor's claim. Seven Justices\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e concluded that \"[s]ection 211(a) insulates from review decisions of law and fact 'under any law administered by the Veterans' Administration,' that is, decisions made in interpreting or applying a particular provision of that statute to a particular set of facts.\" Id. at 1379. The challenge in Traynor, like Marozsan's challenge, did not involve the application of any particular provision of the V.A. statute to a specific set of facts; rather Traynor alleged that a V.A. regulation violated a statute of general applicability. As the Court observed, Traynor's claim did not \"challenge . . . the Veterans' Administration's construction of any statute dealing with veterans' benefits, except to the extent that its construction may be affected by the Rehabilitation Act.\" Id.\n\nIn concluding that § 211(a) did not deprive the Court of jurisdiction to hear Traynor's challenge, the Court specifically rejected the argument that allowing review of such a claim would contravene congressional intent by opening the \"floodgates\" to disgruntled veterans seeking benefits. The Court reasoned that\n\n[i]t cannot be assumed that the availability of the federal courts to decide whether there is some fundamental inconsistency between the Veterans' Administration's construction of veterans' benefits statutes, as reflected in the regulation at issue here, and the admonitions of the Rehabilitation Act will enmesh the courts in \"the technical and complex determinations and application of Veterans' Administration policy connected with veterans' benefits decisions\" or \"burden the courts and the Veterans' Administration with expensive and time-consuming litigation.\"\n\nId. at 1379 (quoting Johnson, 415 U.S. at 370). See also id. at 1379 n.9 (noting that in the four circuits allowing \"judicial review of statutory challenges to [V.A.] regulations, only eight such challenges have been filed\"). Concern that the floodgates would be opened if § 211(a) does not bar claims that the V.A. violated a generally applicable federal statute was insufficient to deny jurisdiction in Traynor, and is similarly insufficient to deprive us of jurisdiction to hear Marozsan's challenge.\n\nThe reasoning of the Johnson and Traynor decisions mandates federal court review of the type of challenge to the V.A.'s procedures that Marozsan presents. It is hard to see how the Court would insist on the right to review the constitutionality of legislation, but hold immune from review all unconstitutional administrative actions taken pursuant to that legislation.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e See Reisch, 211 in Progress: Must the Veterans' Administration Comply with Federal Law?, 40 Stan. L. Rev. 323, 343 (1987) (student author). Similarly, because courts can review V.A. action for compliance with non-V.A. statutes, it would be anomalous to suggest that the V.A.'s actions in violation of the Constitution are immune from scrutiny. As the D.C. Circuit reasoned in Ralpho v. Bell, 186 U.S. App. D.C. 368, 569 F.2d 607, 620 (1977):\n\n[I]f legislation by Congress purporting to prevent judicial review of the constitutionality of its own actions is itself constitutionally suspect, legislation that frees an administrative agency from judicial scrutiny of its adherence to the dictates of the Constitution must pose grave constitutional questions as well. Not only is it daring to suggest that Congress, though subject to the checks and balances of the Constitution, may create a subordinate body free from those constraints; it also beggars the imagination to suggest that judicial review might be less crucial to assuring the integrity of administrative action than it is to make certain that Congress will operate within its proper sphere. If the courts are disabled from requiring administrative officials to act constitutionally, it is difficult to see who would perform that function.\n\n(citations omitted).\n\nCourts are properly reluctant to look into complex, fact bound, discretionary determinations of an agency's decisionmaking process. Id. at 622. But they must be equally reluctant to license \"free-wheeling agencies [to mete] out their own brand of justice.\" Id. at 623 (quoting Oestereich v. Selective Serv. Sys. L ocal Bd. No. 11, 393 U.S. 233, 237, 89 S. Ct. 414, 21 L. Ed. 2d 402 (1968)). Johnson and Traynor thus support the conclusion that federal courts are empowered and obligated to review substantial claims of unconstitutional agency action, such as the imposition of an arbitrary quota system.\n\nIV.\n\nWe emphasize that because Marozsan demands constitutional Veterans' Administration procedures--not merely money from the Treasury--no aspect of sovereign immunity can bar his claim. Cf. Bartlett v. Bowen, 259 U.S. App. D.C. 391, 816 F.2d 695, 711 (D.C. Cir. 1987) (Bork, J., dissenting). We are asked here to consider allegedly unlawful government action, not simply a request for money. It is axiomatic that Congress may not act unconstitutionally, nor may it delegate authority to executive agencies to do so. Furthermore, Congress cannot insist that the executive be immune from judicial review requiring it to act in a constitutional manner. It is the essential function of the judiciary to review and enjoin such illegal action. See B. Schwartz, Administrative Law 436 (2d ed. 1984) (\"The responsibility of enforcing the limits of statutory grants of authority is a judicial burden. . . . Without judicial review, statutory limits would be naught but empty words.\"); Note, Congressional Preclusion of Judicial Review of Federal Benefit Disbursement: Reasserting Separation of Powers, 97 Harv. L. Rev. 778, 786 (1984). See also Northern Pipeline Constr. Co. v. Marathon Pipeline Co., 458 U.S. 50, 70, 73 L. Ed. 2d 598, 102 S. Ct. 2858 n.23 (1982) (where Congress creates adjudicative schemes for executive agencies, the Supreme Court has \"suggested that it may be required to provide for Article III review\"). Since the Administrator lacks sovereign authority to contravene the Constitution, he cannot assert sovereign immunity from liability for such acts. Half a century of burgeoning administrative agency adjudication has not diminished the vitality of the words of Chief Justice Hughes:\n\nThe recognition of the utility and convenience of administrative agencies for the investigation and finding of facts within their proper province, and the support of their authorized action, does not require the conclusion that there is no limitation of their use, and that the Congress could completely oust the courts of all determinations of fact by vesting the authority to make them with finality in its own instrumentalities or in the Executive Department. That would be to sap the judicial power as it exists under the Federal Constitution, and to establish a government of a bureaucratic character alien to our system, wherever fundamental rights depend, as not infrequently they do depend, upon the facts, and finality as to facts becomes an effect finality in law.\n\nCrowell v. Benson, 285 U.S. 22, 56-57, 76 L. Ed. 598, 52 S. Ct. 285 (1932). It would be surprising and profoundly troubling if federal courts had no jurisdiction to consider whether a federal agency violated the Constitution. See Fallon, 101 Harv. L. Rev. at 963 (\"No modern case . . . holds that Congress may cut off all judicial review of the administration of an entitlement program.\"); Gunther, Congressional Power to Curtail Federal Court Jurisdiction: An Opinionated Guide to the Ongoing Debate, 36 Stan. L. Rev. 895, 921 n.113 (1984) (commentators \"agree that Congress cannot bar all remedies for enforcing federal constitutional rights\").\n\nV.\n\nIf we were to accept the government's position that § 211(a) bars review of Marozsan's claim, we would face a difficult issue--the scope of judicial power to curb unconstitutional agency action--which lies at the core of our conception of a government of separated powers.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e If § 211(a) precluded review, it would subvert the judiciary's function of providing a \"check against arbitrariness and self-aggrandizement by Congress, the executive, and their administrative agents.\" Fallon, 101 Harv. L. Rev. at 975-76 (footnote omitted). To deny jurisdiction to claimants like Marozsan would be to find that veterans simply have no forum in which to pursue a claim that the V.A. violated the Constitution. The necessary implication of such a holding, candidly conceded by the government at oral argument, is that the V.A. may not be called to account for any method it uses in administering the veterans' benefits laws, no matter how egregious.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Surely if the V.A. could deny hearings and employ arbitrary quotas without judicial review, as is alleged here, it could also grant benefits only to those veterans born on July 4th or only to white veterans. A statute which precludes review of such obviously unconstitutional decisions must be just as unconstitutional as the underlying action of the Administrator. See Bartlett v. Bowen, 259 U.S. App. D.C. 391, 816 F.2d 695, 711 (D.C. Cir. 1987).\n\nThe government conceded at oral argument that its broad interpretation of § 211(a) bars review even of such abhorrent practices. It must concede this, because there is no basis for distinguishing, for purposes of judicial review, between a due process, equal protection or other constitutional violation by the Administrator.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e This untenable distinction may not be avoided by trivializing Marozsan's due process claim as a challenge to mere details of evidence taking. An alleged arbitrary quota system that obviates the Administrator's need to consider the evidence is no mere detail but a serious question of constitutional dimension. The V.A.'s procedures may not be scrutinized for a high degree of accuracy, but they must comport with the minimum requirements of due process. Only the federal courts can finally ensure this compliance, and § 211(a) cannot remove their power to do so. Congress could not (nor do we think it intended to) so blithely circumvent the requirements of the Constitution.\n\nA reading of § 211(a) that bars review of Marozsan's constitutional claims is thus suspect and unnecessary. We must construe § 211(a) so as to render it constitutional. Courts presume judicial review unless intent to preclude review is fairly discernable from the legislative scheme. Bowen v. Michigan Academy of Family Physicians, 476 U.S. 667, 670, 90 L. Ed. 2d 623, 106 S. Ct. 2133 (1986). As Johnson indicates, the statute is ambiguous on its face and the legislative history provides no indication that § 211(a) precludes review of constitutional claims. Had Congress truly wished to preclude review even of constitutional challenges to the administration of the veterans' benefits laws, § 211(a) could have clearly specified that even these claims against the V.A. are unreviewable in federal court. See Webster v. Doe, 486 U.S. 592, 56 U.S.L.W. 4568, 100 L. Ed. 2d 632, 108 S. Ct. 2047 (June 15, 1988). Unlike § 211(a), however, the constitutionality of such a statute could not be saved by canons of statutory construction.\n\nIt is true that Congress did not affirmatively state that constitutional claims against the V.A.'s procedures are reviewable. When questioned at oral argument, however, counsel for the government was unable to point to a single statute which affirmatively asserts the jurisdiction of the federal courts to entertain constitutional challenges to a statute's administration. This is surely because the presumption in favor of review is not just a guideline for interpreting statutes, but part of the very fabric of our constitutional scheme as we--and Congress--understand it. Congress may have initially assumed that the V.A. would be fair in carrying out its mandate; that federal officials will perform their duties consistent with the Constitution is presumed in every congressional enactment.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e It is at least as likely that Congress failed to address the issue, or assumed review of constitutional questions, as it is that Congress sought to preclude such review altogether. See Bartlett, 816 F.2d at 708. The federal judiciary's responsibility to review constitutional challenges would be hollow indeed if federal executive agencies, immune from judicial review, could circumvent the Constitution at will. See generally Hart, The Power of Congress to Limit the Jurisdiction of Federal Courts: An Exercise in Dialectic, 66 Harv. L. Rev. 1362 (1953). Since the statute itself is ambiguous and there is not one shred of evidence in the legislative history that Congress ever meant to preclude review of V.A. procedures that violate the Constitution, we certainly should not strain to find any such intent.\n\nVI.\n\nThis court's decisions in Winslow v. Walters, 815 F.2d 1114 (7th Cir. 1987), and Mathes v. Hornbarger, 821 F.2d 439 (7th Cir. 1987), reflect the proper construction and application of § 211(a); they remain the law of this circuit. Marozsan's complaint on its face makes a substantial, non-frivolous assertion, see Hagans v. Lavine, 415 U.S. 528, 537-42, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974); Bell v. Hood, 327 U.S. 678, 90 L. Ed. 939, 66 S. Ct. 773 (1946), that the V.A. violated his constitutional rights by employing arbitrary methods of determining which benefits claims to grant. Section 211(a) does not deprive a federal court of jurisdiction to entertain this type of constitutional challenge. The district court should therefore assume federal question jurisdiction over Marozsan's due process claims under 28 U.S.C. § 1331.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Accordingly, we affirm in part, reverse in part, and remand this case to the district court for further proceedings consistent with this opinion.\n\nPOSNER, Circuit Judge, with whom CUDAHY, Circuit Judge, joins, concurring in the opinion and judgment of the court.\n\nI agree with the majority's interpretation of 38 U.S.C. § 211(a), and shall note some reasons why in a moment, but first I want to point out that there is an argument for avoiding the interpretive question on the ground that the case is outside the jurisdiction of the district court even if section 211(a) is not a bar to that jurisdiction. Suppose Marozsan was entitled to have the district court review the denial of his claim to veterans' benefits to the extent necessary to determine whether his constitutional rights had been violated; then if he proved such a violation he would be entitled to an order directing the Veterans' Administration to give him a new hearing. But he did not ask for a new hearing--only for $5 million in damages and an order granting him the amount of veterans' benefits that he claims. He is emphatic about the nature of the relief he is seeking. (And he has been represented by counsel throughout this proceeding.) As stated in one of his briefs in the district court, \"the Plaintiff does not seek judicial review of the decision rendered in his own particular VA claim action . . . .\" His original complaint makes passing reference to an injunction; his amended complaint does not.\n\nThe claim for damages is barred by 28 U.S.C. § 1346(a)(2), which, with immaterial exceptions, denies federal district courts jurisdiction over claims against the United States in excess of $10,000. See, e.g., Hahn v. United States, 757 F.2d 581, 586-88 (3d Cir. 1985). Such claims must be filed in the Claims Court instead. See 28 U.S.C. § 1491. As for Marozsan's claim to benefits, proof of a denial of due process would entitle him not to a federal court order granting him benefits but merely to an order that the Veterans' Administration give him a new hearing. For even if the Veterans' Administration processed his claim in a manner that denied him due process of law, it would not follow that his claim was a good one under the Veterans' Benefits Act. Only the Veterans' Administration can make that determination; this much section 211(a) makes clear.\n\nAlthough Rule 54(c) of the Federal Rules of Civil Procedure provides that \"every final judgment shall grant the relief to which the party in whose favor it is rendered is entitled, even if the party has not demanded such relief in his pleadings,\" this provision was not intended to empower courts to force unwanted relief upon a party. See 10 Wright, Miller \u0026 Kane, Federal Practice and Procedure § 2662, at pp. 132-33 (2d ed. 1983). Nor does it entitle a plaintiff to circumvent jurisdictional limitations, as by bringing a diversity suit for less than $10,000 and arguing that, should the evidence show that he is entitled to more, Rule 54(c) will allow the court to award more. Nevertheless, giving Marozsan the benefit of the doubt and bearing in mind that he wants benefits and can get them only by first obtaining a new hearing before the Veterans' Administration, I conclude that his complaint should be interpreted as asking that the Veterans' Administration be ordered to give him a new hearing. See Hahn v. United States, supra, 757 F.2d at 587; Massachusetts v. Secretary of Health \u0026 Human Services, 816 F.2d 796, 800 (1st Cir. 1987), aff'd, Bowen v. Massachusetts, 487 U.S. 879, 56 U.S.L.W. 4878, 101 L. Ed. 2d 749, 108 S. Ct. 2722 (June 29, 1988).\n\nThis mode of relief, prospective in character, would not involve a money judgment against the United States, and is, I believe, within the power of the district court. That would be clear enough if section 211(a) did not exist. Although no statute explicitly authorizes judicial review of decisions by the Veterans' Administration denying applications for benefits, ordinarily when a government agency makes a decision alleged to violate the Constitution or laws of the United States and Congress has failed to specify the method for obtaining judicial review of the decision, a person harmed by the decision can bring suit in federal district court under 28 U.S.C. § 1331 to set the decision aside. See, e.g., 5 U.S.C. § 704; Abbott Laboratories v. Gardner, 387 U.S. 136, 141, 18 L. Ed. 2d 681, 87 S. Ct. 1507 (1967); General Finance Corp. v. FTC, 700 F.2d 366, 371 (7th Cir. 1983). If Marozsan can prove his constitutional claim, the decision of the Veterans' Administration denying his application for benefits will be set aside and the Administration directed to reconsider the application using constitutionally permissible procedures.\n\nFor reasons more fully explained in the majority opinion, I do not think 38 U.S.C. § 211(a) bars judicial relief as limited as that just described even though the statute provides that \"the decision of the Administrator on any question of law or fact under any law administered by the Veterans' Administration providing benefits for veterans and their dependents or survivors shall be final and conclusive.\" Traynor v. Turnage, 485 U.S. 535, 108 S. Ct. 1372, 99 L. Ed. 2d 618 (1988), seems dispositive. The plaintiffs, like Marozsan, had asked the Veterans Administration for disability benefits. The Administration turned the plaintiffs down in reliance on one of its regulations, and they sought judicial review of the Administration's action in federal district court, contending that the regulation on which the Administration had relied violated the Rehabilitation Act of 1973, 29 U.S.C. § 794. The Supreme Court held that section 211(a) was not a bar to judicial review. It emphasized the distinction between 'decisions made in interpreting or applying a particular provision of [the Veterans' Benefits Act] to a particular set of facts,\" and decisions on whether the Act (or its interpretation by the Veterans' Administration) is valid in light of another law, such as the Rehabilitation Act or the Constitution, \"whose enforcement is not the exclusive domain of the Veterans' Administration.\" 108 S. Ct. at 1379 (footnote omitted). That distinction implies that judicial review is permitted in the present case as well. It would be strange if a regulation of the Veterans' Administration alleged to violate the Rehabilitation Act could be challenged in federal court notwithstanding the supposedly clear words of section 211(a) but practices of the Administration alleged to violate the Constitution could not be. That would imply that if the Veterans' Administration adopts a regulation fixing a quota of successful administrative appeals from denials of benefits the regulation can be challenged in court, but if the identical quota is established and followed as a matter of informal practice (as Marozsan charges) it is immune from judicial review. Such a distinction would not promote compliance with the Constitution; it would merely encourage the Veterans' Administration to avoid codifying unconstitutional practices.\n\nThe fact that a regulation was involved in Traynor provides no basis for regarding the suit (actually suits) in that case as somehow independent of the Veterans' Benefits Act in a way that the present suit is not. In both that case and this one the plaintiffs are persons seeking veterans' benefits. If they were not, they would have no standing to challenge the conduct of the Veterans' Administration. If someone who wants benefits necessarily makes a claim under the Veterans' Benefits Act and not under the statute or constitutional provision that he contends the Veterans' Administration is violating, Traynor was decided incorrectly; for Traynor was such a person, just like Marozsan.\n\nIn light of Traynor the government can get little mileage from decisions in which the Supreme Court has enforced statutes that close the doors of the federal courts to persons with money claims against the federal government. See, e.g., United States v. Fausto, 484 U.S. 439, 108 S. Ct. 668, 98 L. Ed. 2d 830 (1988). The question is whether and in precisely what sense section 211(a) is such a statute. Certainly Marozsan cannot obtain a money judgment from the United States by demonstrating that the Veterans' Administration committed a legal or factual error in denying his claim for benefits. But Traynor suggests that he can obtain a judgment enjoining the Administration from processing his claim under procedures that violate the Constitution, and directing the Administration to give him a new hearing under constitutional procedures. To that extent the doors to the federal courts remain ajar.\n\nThough it hardly matters at our level, I think Traynor was decided correctly and that section 211(a) does not foreclose judicial review of actions by the Veterans' Administration that are alleged to violate laws other than the Veterans' Benefits Act itself. Of course this does not mean that 5 U.S.C. § 702, which authorizes judicial review of federal agency action except where forbidden by statute, unravels section 211(a) and allows decisions by the Veterans' Administration to be challenged even when they, are challenged solely for nonconformity with the Veterans' Benefits Act. It could mean judicial review of decisions alleged to violate the provisions of the Administrative Procedure Act that govern administrative proceedings, see, e.g., 5 U.S.C. § 554, but it appears that the Veterans' Administration is not subject to those provisions. Cf. Colorado v. Veterans Administration, 602 F.2d 926, 928 (10th Cir. 1979).\n\nThe issue of judicial review in Traynor and the present case is a textbook illustration of the deficiencies of literalism as a style of statutory interpretation. The idea that semantically unambiguous sentences--sentences clear \"on their face\"--sentences whose meaning is \"plain\"--can be interpreted without reference to purpose inferred from context is fallacious. Take that clearest of directives: \"Keep off the grass.\" Read literally it forbids the grounds-keeper to mow the grass. No one would read it literally. Read literally, 38 U.S.C. § 211(a) would preclude judicial review of any decision by the Veterans' Administration, yet this would result in placing beyond judicial review a decision by the Administration not to hire blacks, Lutherans, or socialists, provided the Administration based the decision on a \"law administered by the Veterans' Administration providing benefits for veterans and their dependents or survivors.\" For as I read the statute, the decision need not provide benefits, only the law on which the decision is based; if the only decisions encompassed by section 211(a) were decisions providing benefits, the statute would have no application to this case, which involves a denial of benefits.\n\nEven a reading that barred judicial review of any decision that denied, for whatever reason, a claim for veterans' benefits--the reading urged by the government--have extreme consequences that Congress almost certainly did not intend: it would insulate from judicial review a denial of benefits that was based on the veteran's race or political beliefs. The veteran would have no legal remedy of any kind, since a suit against the officials who had denied his claim (in contrast to a suit against an official who had made a nonadjudicative decision, such as a decision to hire or fire an employee of the agency, see Forrester v. White, 484 U.S. 219, 108 S. Ct. 538, 98 L. Ed. 2d 555 (1988), or had issued a general policy directive to the adjudicators) would be barred by the absolute immunity of adjudicators. See Butz v. Economou, 438 U.S. 478, 57 L. Ed. 2d 895, 98 S. Ct. 2894 (1978).\n\nThe government acknowledges that there is no purchase the language or history of the statute for a distinction between procedural and substantive constitutional claims. (And such a distinction, if drawn, would only show that section 211(a) cannot be read literally.) The distinction lacks even intuitive appeal unless one contrasts a strong substantive claim with a weak procedural one--admittedly a comparison that Marozsan's threadbare complaint invites. Compare instead a contention that a difference in the level of veterans' benefits based on whether the veteran participated in a declared war rather than in an undeclared war is arbitrary, and hence a denial of equal protection (which has been read back from the Fourteenth Amendment to the Fifth Amendment), with a contention that the Veterans' Administration denies a veteran due process of law by submitting his claim to trial by Ouija board or Tarot pack. It would be arbitrary to suggest that the first contention could ground a federal court suit but not the second. The only principled ground for a decision in favor of the government in this case would be that the judicial correction of unconstitutional denials of veterans' benefit claims is forbidden no matter what the nature of the constitutional infirmity.\n\nA reading of section 211(a) that immunized the decisions of the Veterans' Administration from judicial review based on allegations of racial, religious, or sexual discrimination, or infringement of freedom of speech, would be implausible. I know that section 211(a) was not enacted yesterday. But I find it hard to imagine that in 1970, when it was last amended, or even in 1933, when it was first enacted, a majority of Congress, with the concurrence of the President, would have agreed to extinguish all constitutional remedies against the Veterans' Administration that veterans might otherwise possess, or might acquire by virtue of subsequent enactments. The question is not whether Congress in 1933 or 1970 conferred any such remedies but whether it meant to forever preclude all such remedies even if the result would someday be a bizarre discrepancy between the constitutional position of veterans and that of other citizens. If the statute were as clear as the government believes, we could interpret it without speculating about how Congress would have answered a question not actually presented to it. But if the statute were that clear, one would have expected Traynor--a suit based merely on the Rehabilitation Act, and not on the Constitution--to be decided in favor of the government.\n\nThe fact that Marozsan's suit is based on the Constitution assumes additional significance in light of Webster v. Doe, 486 U.S. 592, 56 U.S.L.W. 4568, 100 L. Ed. 2d 632, 108 S. Ct. 2047 (June 15, 1988), decided even more recently than Traynor. Doe had been fired by the CIA for being a homosexual, and he brought suit against the Agency on a variety of constitutional grounds. The Agency argued that judicial review of Doe's dismissal was barred by section 102(c) of the National Security Act of 1947, which provides that the Director of Central Intelligence \"may, in his discretion, terminate the employment of any officer or employee of the Agency whenever he shall deem such termination necessary or advisable in the interests of the United States.\" 50 U.S.C. § 403(c). The Supreme Court held that this provision foreclosed judicial review under the Administrative Procedure Act, but not under the Constitution: \"where Congress intends to preclude judicial review of constitutional claims its intent to do so must be clear. . . .Nothing in § 102(c) persuades us that Congress meant to preclude consideration of colorable constitutional claims arising out of the actions of the Director pursuant to that section; we believe that a constitutional claim based on an individual discharge may be reviewed by the District Court.\" 56 U.S.L.W. at 4571 (footnote omitted). Similarly, nothing in 38 U.S.C. § 211(a) reflects a specific intent to preclude constitutional review of the denial of veterans' benefits--and without this \"heightened showing\" of legislative intent, a showing that the Court requires \"in part to avoid the 'serious constitutional question' that would arise if a federal statute were construed to deny any judicial forum for a colorable constitutional claim,\" constitutional review is not precluded. 56 U.S.L.W. at 4571.\n\nIt is natural to be concerned lest the federal courts be inundated with run-of-the-mine procedural challenges dressed up as constitutional claims. Marozsan's suit may illustrate that danger, and it is not one to be taken lightly in an age of staggering federal judicial caseloads. However, federal courts are not only empowered but directed by Rule 11 of the Federal Rules of Civil Procedure to levy sanctions on persons who file frivolous suits. If the frivolousness of the suit is apparent from the pleadings, the suit does not even invoke federal jurisdiction, see, e.g., Levering \u0026 Garrigues v. Morrin, 289 U.S. 103, 77 L. Ed. 1062, 53 S. Ct. 549 (1933); Hagans v. Lavine, 415 U.S. 528, 537-38, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974); Crowley Cutlery Co. v. United States, 849 F.2d 273. This circuit has been in the fore-front of judicial efforts to enforce Rule 11 vigorously. The rule contains no exception for veterans.\n\nWe should not take the weakness of Marozsan's suit as proof that all due process challenges by disappointed claimants for veterans' benefits must be laughable. And as between a reading of the statute that would allow judicial review for the correction of substantive but not procedural violations of the Constitution and one that allows judicial review for the correction of either type of violation, the former would not only be arbitrary but also more difficult to square with the statute's language and purpose. The statute confers finality on decisions by the Veterans' Administration \"on any question of law or fact under any law administered by the Veterans' Administration providing benefits.\" In other words, you cannot bring suit to overturn its decision on the ground that the decision violates or misapplies the Veterans' Benefits Act. But you can bring suit under 28 U.S.C. § 1331 to set aside the decision on the ground that it violates the Constitution. The district court has no power to award damages or even benefits in such a suit but only to tell the Veterans' Administration to reconsider its decision, this time in accordance with the Constitution. The supremacy of the Veterans' Administration in detetermining the facts and law relating to the veteran's claim is unimpaired by such an approach, and Rule 11 should deter disappointed claimants from attempting to transmute ordinary procedural challenges into constitutional ones.\n\nJudicial review is no panacea. Maybe, because of the strength of the veterans' lobby or other reasons, the Veterans' Administration can be trusted always to obey the Constitution without judicial prodding, and if not, maybe the costs of such prodding will exceed the benefits. It might be best to leave the Veterans' Administration completely alone, and section 211(a) could be read as doing just that. But such a reading would be policy-based rather than dictated by \"plain meaning,\" would be inconsistent with Traynor and Webster, would run counter to the strong modern trend (judicial as well as legislative) toward providing judicial remedies for constitutional violations, and would impute to Congress the implausible purpose of denying any legal remedy to veterans wronged as a result of constitutional violations--however egregious--committed by the very agency established to help veterans.\n\nRIPPLE, Circuit Judge, dissenting in part and concurring in part.\n\nI\n\nThe jurisdictional issue noted by Judge Posner in his concurring opinion cannot be overlooked. The amended complaint--the operative complaint at this stage of the litigation--requests only damages. The district court does not have jurisdiction to adjudicate the only claim presented by the amended complaint--a claim against the government for five-million dollars in damages. See 28 U.S.C. § 1346(a)(2). Exclusive jurisdiction for claims against the United States in excess of ten-thousand dollars rests in the Claims Court. See 28 U.S.C. § 1491.\n\nMoreover, under the circumstances presented here, the amended complaint cannot be construed as requesting injunctive relief. A request for such relief was included in the initial complaint and dropped in this amended complaint. Nor do I believe that, under the circumstances here, we ought to permit an amendment to the complaint to include a claim for injunctive relief. Even if we assume, arguendo, that such amendment can be ordered by an appellate court, there are several reasons why it ought not he undertaken in this case. First, as noted above, the deletion of a claim for injunctive relief was a deliberate choice by the plaintiff. He included such a claim in his first complaint and then removed it in the later complaint.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Secondly, the unfocused, rambling presentation of the plaintiff's submissions up to this point give us little hope that, if amendment is allowed, the plaintiff is able or willing to present to the district court the sort of carefully presented case necessary to permit adjudication of the allegations set out here.\n\nIn determining whether it is appropriate to hold that the district court had jurisdiction here, there is one additional factor that must be considered--evenhandedness in the application of jurisdictional standards. This court applies stringently jurisdictional standards. It is essential, I respectfully submit, that we be uniform in our application of those standards. The fact that this case has been heard en banc does not, of course, alter in any way our obligation to stay within the limits of our authority and to require that the district court do likewise. Accordingly, I would vacate the judgment of the district court and remand the case with instructions to dismiss the complaint.\n\nII\n\nDespite this significant jurisdictional problem, the court has decided to reach the merits of this case. I, therefore, must construe its action as a de facto amendment of the complaint to include a request for injunctive relief. Under these circumstances, I am constrained to reach the merits. Here, I agree with Judge Posner that\n\n[t]he statute confers finality on decisions by the Veterans' Administration \"on any question of law or fact under any law administered by the Veterans' Administration providing benefits.\" In other words, you cannot bring suit to overturn its decision on the ground that the decision violates or misapplies the Veterans' Benefits Act. But you can bring suit under 28 U.S.C. § 1331 to set aside the decision on the ground that it violates the Constitution. The district court has no power to award damages or even benefits in such a suit but only to tell the Veterans' Administration to reconsider its decision, this time in accordance with the Constitution. The supremacy of the Veterans' Administration in determining the facts and law relating to the veteran's claim is unimpaired by such an approach, and Rule 11 should deter disappointed claimants from attempting to transmute ordinary procedural challenges into constitutional ones.\n\nSupra at 28-29 (Posner, J., concurring).\n\nFinally, in my view, the majority's discussion in Parts IV and V of its opinion, concerning the inherent power of the Article III courts to review administrative action, is not necessary to a decision in this case. This case presents no necessity to address broadly such an important constitutional issue. In Part III of the majority opinion, Judge Flaum convincingly demonstrates that neither the plain language of the statute nor its legislative history requires an interpretation that denies veterans any protection against unconstitutional misbehavior by the Veterans' Administration. We cannot, therefore, presume that Congress meant to preclude such review. See Webster v. Doe, 486 U.S. 592, 56 U.S.L.W. 4568, 4570-71, 100 L. Ed. 2d 632, 108 S. Ct. 2047 (U.S. June 15, 1988). If Congress had determined explicitly to treat the veteran in such a manner, we could then address the limits, if any, of Congress' authority to preclude judicial review. Therefore, assuming arguendo that the court properly reaches the merits, I would join both the disposition ordered by the majority and its essential rationale.\n\nEASTERBROOK, Circuit Judge, with whom COFFEY and MANION, Circuit Judges, join, dissenting. \"[T]he decisions of the Administrator on any question of law or fact under any law administered by the Veterans' Administration providing benefits for veterans . . . shall be final and conclusive and no other official or any court of the United States shall have power or jurisdiction to review any such decision by an action in the nature of mandamus or otherwise.\" 38 U.S.C. § 211(a). This is a bold assertion of the sovereign immunity of the United States. Decisions of the Administrator are \"final and conclusive\". The \"decision\", not the legal issues that might influence it, is off limits. No wonder the Supreme Court has described this statute as the model of language that Congress uses when it wants to bar judicial review altogether\". Lindahl v. OPM, 470 U.S. 768, 779-80, 84 L. Ed. 2d 674, 105 S. Ct. 1620 \u0026 n.13 (1985).\n\nI\n\nOur case lies at the core of § 211(a). Marozsan does not contend that any statute governing the award of benefits is unconstitutional or that any of the VA's regulations is illegal. Contrast Johnson v. Robison, 415 U.S. 361, 366-74, 39 L. Ed. 2d 389, 94 S. Ct. 1160 (1974) (constitutional challenge to statutory eligibility criteria); Traynor v. Turnage, 485 U.S. 535, 108 S. Ct. 1372, 1378-80, 99 L. Ed. 2d 618 (1988) (contention that a regulation of general applicability is inconsistent with a subsequent statute). Marozsan wants judicial review of the decision to rate him 20 % rather than 100 % disabled. His complaint asks the court to \"restore the Plaintiff to his proper disability, retroactive to the date of disability\" and to give him $5 million as damages. Marozsan does not seek prospective relief for a class; he wants money for himself. Marozsan's current theory about why the court should review his case is that the procedures the VA used violated the Due Process Clause of the fifth amendment. Section 211(a) does not distinguish among reasons for believing the VA's decision to be erroneous; it protects the \"decision\" from review. Other courts say that § 211(a) bars review of individual veterans' cases even when the veteran contends that the VA violated the Constitution in the course of resolving his claim. E.g., Higgins v. Kelley, 824 F.2d 690 (8th Cir. 1987); Pappanikoloaou v. Administrator of Veterans Administration, 762 F.2d 8 (2d Cir. 1985); Rosen v. Walters, 719 F.2d 1422, 1423 (9th Cir. 1983); Anderson v. Veterans Administration, 559 F.2d 935 (5th Cir. 1977); Ross v. United States, 462 F.2d 618 (9th Cir. 1972); de Rodulfa v. United States, 149 U.S. App. D.C. 154, 461 F.2d 1240, 1257-58 (D.C. Cir. 1972); Milliken v. Gleason, 332 F.2d 122 (1st Cir. 1964). Devine v. Cleland, 616 F.2d 1080, 1083-85 (9th Cir. 1980), disagrees, but Devine conflicts with Ninth Circuit cases before (Ross) and since (Rosen). We stand alone among the circuits in declining to give § 211(a) its ordinary meaning.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea\n\nThe history of § 211(a) shows that it has the scope its language portends. Versions of this statute date back to 1933. Johnson, 415 U.S. at 371-73, traces the history. The earliest version quickly was invoked in Lynch v. United States, 292 U.S. 571, 587, 78 L. Ed. 1434, 54 S. Ct. 840 (1934), in which Justice Brandeis described the statute as a rule that\n\nconcerns . . . grants to veterans and their dependents--pensions, compensation allowances and special privileges, all of which are gratuities. The purpose of the section appears to have been to remove the possibility of judicial relief in that class of cases even under the special circumstances suggested in Crouch v. United States, 266 U.S. 180, 69 L. Ed. 233, 45 S. Ct. 71 ; Silberschein v. United States, 266 U.S. 221, 69 L. Ed. 256, 45 S. Ct. 69 ; United States v. Williams, 278 U.S. 255, 73 L. Ed. 314, 49 S. Ct. 97 ; Smith v. United States, 57 F.2d 998.\n\nThe \"special circumstances\" suggested in Crouch, Silberschein, and Williams--three cases that held the courts without jurisdiction to review administrative decisions concerning benefits--were that review might be possible when the decision was wholly arbitrary or without colorable support; Lynch seems to say that even in these \"special circumstances\" there could be no review of veterans' benefit cases.\n\nA modification in the statute some years after Lynch led the D.C. Circuit to assert a limited power of review. Congress was unwilling to accept even a small erosion of administrative finality, so in 1970 it passed an amendment giving § 211(a) its current language. The House Report, H.R. Rep. No. 91-1166, 91st Cong., 2d Sess. 10 (1970), identifies the three decisions to be rejected by the amendment. One of these, Thompson v. Gleason, 115 U.S. App. D.C. 201, 317 F.2d 901 (D.C. Cir. 1962), was a constitutional challenge to a decision to deny benefits. Congress certainly wanted to cut off any possibility of judicial review of individual veteran's benefits decisions, and it was aware--to the extent institutions can be \"aware\"--that § 211(a) would block constitutional challenges. It is still so aware. Since 1970 many Members of Congress have favored judicial review of the VA's decisions. Bills to provide for review have cleared committee, e.g., S. Rep. No. 97-466, 97th Cong., 2d Sess. 37-49 (1982), but have not become law. One bill that has attracted substantial support in the 100th Congress would create review of constitutional and strictly \" legal\" questions, while preserving administrative finality on factual ones. No one participating in this ongoing debate believes that § 211(a) already provides for judicial review of constitutional claims in individual cases.\n\nCongress enacted § 211(a) for two reasons:\n\n(1) to insure that veterans' benefits claims will not burden the courts and the Veterans' Administration with expensive and time-consuming litigation, and (2) to insure that the technical and complex determinations and applications of Veterans' Administration policy connected with veterans' benefits decisions will be adequately and uniformly made.\n\nJohnson, 415 U.S. at 370 (footnote omitted). See also Traynor, 108 S. Ct. at 1379 (adhering to this assessment); Rose v. Rose, 481 U.S. 619, 107 S. Ct. 2029, 2035, 95 L. Ed. 2d 599 (1987) (identifying the same purposes). The statute is part of a system of benefits decision-making designed to operate outside the adversarial process. Walters v. National Ass'n of Radiation Survivors, 473 U.S. 305, 87 L. Ed. 2d 220, 105 S. Ct. 3180 (1985). It is hard to have a non-adversarial administrative procedure if the parties' next stop is a court. Everyone will want to build the record for review.\n\nJohnson and Traynor concluded that litigation about the constitutionality of the statutory criteria used to award benefits, and the legality of the VA's regulations, would not prevent § 211(a) from achieving any of its purposes. The Court drew a line between reviewing cases and reviewing rules. The line the Court adopted in Johnson and Traynor accords not only with the functions of § 211(a) but also with its language. The statute forbids review of a \"decision of the Administrator\", and it is natural to read this as a decision in a case. Hiring employees, leasing office space, and similar choices come to mind as \"decisions\" outside the scope of § 211(a), if for no other reason than that they are not decisions concerning \"benefits for veterans\" within the scope of the statute.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe line between reviewing decisions in cases and reviewing rules is familiar in governmental law. Substantive criteria, whether in a statute or in a regulation, may be reviewed in litigation seeking prospective relief. Such suits are authorized by 5 U.S.C. § 702 (waiving sovereign immunity in injunctive cases), and are common against the states, despite the eleventh amendment. Edelman v. Jordan, 415 U.S. 651, 39 L. Ed. 2d 662, 94 S. Ct. 1347 (1974). Suits seeking money for a particular claimant are something else again, not permissible against the states because of the eleventh amendment, or against the federal government because of sovereign immunity. Because \"[n]o money shall be drawn from the Treasury, but in Consequence of Appropriations made by Law\" (Art. I, § 9, cl. 7), only an unambiguous waiver permits monetary awards. United States v. King, 395 U.S. 1, 4, 23 L. Ed. 2d 52, 89 S. Ct. 1501 (1969); United States v. Testan, 424 U.S. 392, 399-403, 47 L. Ed. 2d 114, 96 S. Ct. 948 (1976); Army \u0026 Air Force Exchange Service v. Sheehan, 456 U.S. 728, 738-41, 72 L. Ed. 2d 520, 102 S. Ct. 2118 (1982). Section 211(a) is an unambiguous non-waiver. The line drawn in Johnson and Traynor respects the nature of § 211(a) as an assertion of sovereign immunity, limiting judicial review to the kind of prospective relief that courts may award against the government.\n\nII\n\nPerhaps it seems that the majority and I are discussing different cases. The court insists that Marozsan has asked for class-wide, prospective relief, not for a review of his disability rating. It affirms the district court's conclusion that Marozsan may not attack the disposition of his particular case. Slip op. 3 n.3. If Marozsan were waging a campaign along the lines of Johnson and Traynor, § 211(a) would have little to do with the case. But I fear that my colleagues are as inventive with Marozsan's complaint as they are with § 211(a).\n\nThe complaint starts by describing the handling of Marozsan's case. It grumbles, for example, about \"the VA's Foreign asiatic general practitioner (M.D.), who could not even grammically write a concise medical report with out assistance from the Plaintiff\". (Here, and throughout, I omit [sic]s.) The complaint is concerned only about Marozsan's treatment. It ends by asking for a review of the disability rating, a restoration \"to his proper disability, retroactive to the date of the disability\", and $5 million. Not a peep about class-wide practices, and no request for injunctive relief. (The amended complaint, filed by counsel, deleted the request for an injunction that had been in the original complaint, filed by Marozsan personally.) When the defendants moved to dismiss under § 211(a), Marozsan did not reply that he was challenging practices of general applicability. He instead said that § 211(a) is unconstitutional, a violation of the equal protection component of the Due Process Clause of the fifth amendment. The district court rejected that contention.\n\nMarozsan's briefs on the original argument and the reargument say two things: that § 211(a) is unconstitutional, which if true entitles him to relief on his particular claim, and that the court en banc should follow Winslow v. Walters, 815 F.2d 1114, 1116-18 (7th Cir. 1987), and Mathes v. Hornbarger, 821 F.2d 439, 441-42 (7th Cir. 1987). These cases hold that despite § 211(a) a veteran may obtain review in his individual case, provided his legal theory rests on the Constitution. Again he did not ask for prospective relief (except to the extent of holding § 211(a) unconstitutional), and at oral argument he disclaimed such a request.\n\nHis opening brief explains why he believes § 211(a) violates the equal protection component of the Due Process Clause. It lists claims cut off by § 211(a), and it contends that these are sufficiently serious that the statute must be unconstitutional. Here is his recitation:\n\n(1) There is no requirement for the VA to confront Veteran's evidence and as a result, decisions may be rendered without addressing any of the Veteran's contentions, and when the Veteran continues to protest this he is accused of repetitiveness.\n\n(2) Decisions are rendered at stages of the VA process without affording the Veteran the opportunity for a hearing. [Citation omitted.]\n\n(3) A conflict of interest in that the same rating personnel who origionally denied the claim may be hearing the appeal. A further conflict exists between the various service organizations and the VA with the crux being the use of VA facilities by service organizations, with space provided free. . . .\n\n(4) Rating personnel making the decision are often not present for the hearing.\n\n(5) Informed discussion with VA personnel is denied, leaving the Veteran, who does not understand the rules, at a loss to pursue the case.\n\n(6) Expert opinions in behalf of Veteran's are disregarded in favor of the opinion of the general practitioners who are without medical specialization, and no attempt is made to reconcile differences of medical opinion.\n\n(7) The VA acts as the investigative arm, judge, jury and attorney for both sides, using their subpoena power only in their behalf and not for the Veteran.\n\n(8) Although the Veteran is denied representation by an attorney, attorneys for the VA dominate every stage.\n\n(9) The imposition of a quota system as demonstrated by the percentages of successful appeals which varies less than 1 % over the years.\n\nIt is impossible to figure out which of these Marozsan thinks happened to him, which happens frequently to others and is unconstitutional, and which illustrates why (in his view) § 211(a) is undesirable.\n\nNone of these, however, is stated as ground of injunctive relief against the VA. Each is a reason, according to Marozsan, why § 211(a) should be held unconstitutional, so that veterans may litigate case by case. None of his assertions, moreover, finds support in the record. The defendants moved to dismiss, and the district court converted the motion to one for summary judgment. To avoid summary judgment Marozsan had to put in evidence, or at least file an affidavit under FED. R. Civ. P. 56(f) to explain why evidence was unavailable. He did neither. My search for support in the record for any of his assertions was fruitless. They are, so far as this case is concerned, nothing but hot air.\n\nWe have to take Marozsan's case the way he and the record frame it: as a challenge to the denial of his claim for benefits, expanded to an attack on the constitutionality of § 211(a). There is nothing else to consider--not only because nothing else was raised, but also because any rumblings in his appellate brief are unsupported by the record and so cannot stave off summary judgment. My colleagues say that § 211(a) is proof against an equal protection attack (slip op. 3 n.3). That ought to end things; it is not our business to resurrect a case so that the court may address contentions that the litigants never advanced.\n\nAt all events, the majority is trying to have things both ways. One would have thought that the conclusion (slip op. 3 n.3) barring review of Marozsan's own claim would require us to overrule Winslow and Mathes; instead the court reaffirms them (slip op. 6-7, 20). Those cases hold that a veteran may obtain review of his individual case, provided he contends that the VA committed constitutional error in the course of making a decision. The court writes that those cases \"reflect the proper construction and application of § 211(a)\". If that is so, the hoo-ha about Marozsan's claim being class-wide and prospective throws sand in the reader's eyes. What the court holds today is that review may be had, case by case, despite § 211(a)--and also may be had on a prospective basis in Marozsan's case.\n\nUnder Winslow and Mathes every case may be reviewed to see whether the VA violated the Constitution in the course of reaching a decision. To say that a \"veteran may obtain review, not of his individual claim determination, but of unconstitutional methods employed by the V.A. in arriving at that benefits decision\" (slip op. 7 n.10) is to say that the veteran may obtain review in his individual case. Review of \"methods employed\" by an agency to make a decision is review of the individual case. If not, it is an advisory opinion. Such review is what the Administrative Procedure Act provides, what the federal courts provide when resolving collateral attacks on criminal convictions. Because any principle of administrative law may be recast in the language of \"due process\", every benefits decision is reviewable, if only to determine whether the procedural error should be called \"constitutional\". And a court may not evaluate claims of procedural error in the abstract. It must get down to the nitty-gritty, looking at the whole proceedings, both to determine whether the gaffe is an \"error\" and to evaluate whether the error is harmless. In other words, the kind of review the majority approves will in Johnson's words \"burden the courts and the Veterans' Administration with expensive and time-consuming litigation\" and require many judges to examine the \"complex and technical determinations\" of veterans' benefits law that are supposed to be \"uniformly made\" by a single Administrator. Hundreds of district judges cannot match one Administrator's (or Board's) decisions for \"uniformity\". Homemakers North Shore, Inc. v. Bowen, 832 F.2d 408, 412 (7th Cir. 1987).\n\nDissenters often cry \"Wolf!\", but this prediction is based on the federal courts' daily experience. I speak of collateral review of criminal convictions. Such review generally is limited to claims of constitutional error, just as review of veterans' benefit decisions is restricted to constitutional questions under the majority's approach. Federal courts engage in collateral review of a significant portion of all state and federal criminal convictions, sometimes more than once per case. The ability to state any procedural question in constitutional terms gets these cases over the transom, and the court must review the record to satisfy itself that no error properly denominated \"constitutional\" occurred. This task frequently requires extensive study. Jackson v. Virginia, 443 U.S. 307, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979), also requires the court to review the sufficiency of the evidence. Although review under Jackson depends on the reasonable-doubt standard inapplicable outside criminal law, Jones v. Thieret, 846 F.2d 457, 460-62 (7th Cir. 1988), the Due Process Clause often demands at least a smidgeon of evidence, once the government sets up the sort of substantive rules that create a liberty or property interest. Superintendent of Walpole v. Hill, 472 U.S. 445, 453-55, 86 L. Ed. 2d 356, 105 S. Ct. 2768 (1985); cf. University of Michigan v. Ewing, 474 U.S. 214, 88 L. Ed. 2d 523, 106 S. Ct. 507 (1985). Every evidentiary question has a constitutional dimension under Hill, and although most such claims are dead losers, each must be reviewed. Yet we know from Lynch that § 211(a) is designed to put federal courts out of the business of reviewing the sufficiency of evidence behind veterans' benefits decisions.\n\nConstitutional \"questions\" are everywhere--it is easy to pose questions and occasionally is possible to characterize a mistaken view of the law or the facts as \"arbitrary\", an \"abuse of power\", hence unconstitutional. Compare Cole v. Young, 817 F.2d 412, 423-26 (7th Cir. 1987), and Argento v. Village of Melrose Park, 838 F.2d 1483, 1491-92 (7th Cir. 1988), with Jones v. Thieret and Archie v. City of Racine, 847 F.2d 1211 (en banc). Only an imaginative lawyer would be unable to find a constitutional \"question\" in most proceedings before the VA. If veterans take their cases to court at the same rate social security claimants do, today's decision will produce some 13,000 civil actions and 1,000 appeals per year.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Judicial review to sift constitutional wheat from statutory chaff may be even more time consuming than review under the Administrative Procedure Act, for a court will need to grapple with a series of anterior questions that are missing in \"straight\" administrative review. We need only think of the forfeiture and exhaustion rules in criminal cases, e.g., Wainwright v. Sykes, 433 U.S. 72, 53 L. Ed. 2d 594, 97 S. Ct. 2497 (1977), and the nagging questions of characterization, e.g., Donnelly v. DeCristoforo, 416 U.S. 637, 94 S. CT. 1868, 40 L. Ed. 2d 431 (1974), to see what lies ahead. The process of line-drawing may consume more energy than the resolution of the substantive claims.\n\nIII\n\nWhat is the justification for engaging in review in the teeth of the language, history, and functions of § 211(a)? The best line of argument is that § 211(a) is limited to statutory and evidentiary challenges because it addresses only decisions \"on any question of law or fact under any law administered by the Veterans' Administration providing benefits\" (emphasis added). A constitutional question does not arise \"under\" a law providing for benefits. So, the argument goes, § 211(a) does not block review of constitutional questions.\n\nThe approach has some force; it is derived from the Court's analysis in Johnson. But it is unsatisfactory. The statute bars review of \"decisions\", not of the legal issues the VA must resolve to reach decisions. One may intelligibly say that a suit seeking an injunction against a statute or regulation \"arises under\" the Constitution (Johnson) or Rehabilitation Act (Traynor) because in those cases the Constitution or statute was the foundation of the claim for relief. The plaintiff filed an independent suit; the claim did not depend on a veterans' law. The only thing to be construed in order to adjudicate the case was the non-veterans' rule.\n\nThat a constitutional issue comes up in the course of adjudicating a claim for benefits does not mean that the claim itself \"arises under\" the Constitution. Someone who wants benefits necessarily makes a claim under the veterans' laws, and § 211(a) therefore applies. Under the well-pleaded complaint rule, the claim arises under the rule of law that gives it vitality. Gully v. First National Bank, 299 U.S. 109, 81 L. Ed. 70, 57 S. Ct. 96 (1936); Franchise Tax Board v. Construction Laborers Vacation Trust, 463 U.S. 1, 27-28, 77 L. Ed. 2d 420, 103 S. Ct. 2841 (1983). Without a claim under the veterans' laws, Marozsan has nothing, no matter what constitutional arguments he may make; without a claim under the veterans' laws Marozsan does not even have standing. Cases concerning the federal question jurisdiction show that a claim does not \"arise under\" federal law for purposes of 28 U.S.C. § 1331 just because a court needs to consider a federal issue to reach a decision. The arising-under jurisdiction depends on \"what necessarily appears in the plaintiff's statement of his own claim . . ., unaided by anything alleged in anticipation or avoidance of defenses which it is thought the defendant may interpose.\" Franchise Tax Board, 463 U.S. at 10; see also, e.g., Christianson v. Colt Industries Operating Corp., 486 U.S. 800, 56 U.S.L.W. 4625, 100 L. Ed. 2d 811, 108 S. Ct. 2166 (U.S. June 17, 1988). \"The well-pleaded complaint rule . . . focuses on claims, not theories\". Id. at 4628; see also Franchise Tax Board, 463 U.S. at 26 \u0026 n.29. Marozsan's claim is for benefits, even if his theory about why he gets them has something to do with the Constitution. We know what issues Marozsan raised in his complaint: he wanted review of the decision denying his claim for benefits. That he anticipated the VA's invocation of § 211(a) by nodding lightly to constitutional arguments does not give him a constitutional claim for arising-under purposes.\n\nThe Court has not accepted Justice Holmes's position that the claim invariably arises under \"the law that creates the cause of action\", American Well Works Co. v. Layne \u0026 Bowler Co., 241 U.S. 257, 260, 60 L. Ed. 987, 36 S. Ct. 585 (1916), but this is at least the starting point and in most cases the finishing point as well. E.g., Merrell Dow Pharmaceuticals Inc. v. Thompson, 478 U.S. 804, 808, 92 L. Ed. 2d 650, 106 S. Ct. 3229 (1986). For example, a claim based on state law becomes a \"federal\" claim only when federal law so occupies the field that it supplies the only possible remedy, or when the federal right is so integral to the state claim that one cannot think of them separately. E.g., Caterpillar Inc. v. Williams, 482 U.S. 386, 107 S. Ct. 2425, 2429-30, 96 L. Ed. 2d 318 (1987). That a court inevitably will consider an issue of federal law to reach a final decision does not mean that the claim \"arises under\" that law. E.g., Luckett v. Delpark, Inc., 270 U.S. 496, 70 L. Ed. 703, 46 S. Ct. 397 (1926); cf. Christianson.\n\nThis way of defining what kind of claim \"arises under\" a given rule governs jurisdiction-withdrawing statutes with an \"arising-under\" component, just as it governs jurisdiction-granting statutes. Heckler v. Ringer, 466 U.S. 602, 615-16, 80 L. Ed. 2d 622, 104 S. Ct. 2013 (1984); Weinberger v. Salfi, 422 U.S. 749, 760-64, 45 L. Ed. 2d 522, 95 S. Ct. 2457 (1975). Salfi dealt with a portion of the Social Security Act providing that claims arising under that statute could be reviewed in one way only. The plaintiff attempted to get review in a different way on the argument that his claim really arose under the Constitution, because he was making a constitutional challenge to the way the program was administered. The Court acknowledged that in a sense such a claim arises under the Constitution but concluded that it also arises under the Social Security Act and held that it was therefore barred. The suit, though invoking the Constitution, arose under the statute because the statute was an essential ingredient of the claim for benefits. Franchise Tax Board and Christianson, decided since Salfi and Ringer, strengthen their holdings. The same principles should apply to § 211(a). The veteran's claim for benefits arises under the veterans' laws. This claim is what gets the administrative procedure going. The \"decision\" of the administrator therefore occurs under those laws. The complaint challenges that decision, and the anticipation of a defense based on § 211(a) does not change the basis of the complaint. An objection to the procedure used during any given case, even to the Administrator's regular ways of taking evidence and issuing decisions, is an issue arising in the course of a proceeding under the statute. Section 211(a) therefore covers it. A choice by the VA to act in a certain way, even to dispense with a hearing, is a \"decision\", and a constitutional objection to that decision is one based on \"law\". The Administrator could follow a different course if he were persuaded of the validity of the legal argument. Although the Administrator has disclaimed the power to review the constitutionality of Acts of Congress, he has not disclaimed the power to think about the constitutionality of his own decisions implementing the statutes--how could the Administrator promise not to change his own mind? The VA has full authority to entertain, and resolve, the kind of constitutional arguments Marozsan presses.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nWhat reason could Congress have had for treating a procedural contention as reviewable just because articulated under the Constitution? There is no functional reason; I have already remarked that constitutional, statutory, and common law procedural contentions are just three different ways of expressing a demand for \"fair\" procedure--which here means procedure reasonably calculated to produce an accurate result. Marozsan's contentions could be founded on the Administrative Procedure Act more naturally than on the Constitution, yet as claims under the APA they are securely barred by § 211(a)--even though § 211(a) does not mention the APA (or the common law) any more than it mentions the Constitution. If we read § 211(a) to reject judicial determination of APA claims, the analysis of APA claims decked out in constitutional garb must be the same.\n\nMarozsan's constitutional contentions add up to the belief that the VA's procedures are not sufficiently careful, or adversarial, to produce accurate resolutions of disputed factual issues. They are in the mold of Mathews v. Eldridge, 424 U.S. 319, 47 L. Ed. 2d 18, 96 S. Ct. 893 (1976). Yet on what account would constitutional arguments concerning the procedures used to achieve accuracy be reviewable, when the substantive decisions themselves are not? We know for sure--from Lynch and the debates in 1970--that Congress meant to cut off review of claims that decisions are inaccurate. Lynch tells us that even the no-evidence case is not reviewable, and what could be less accurate than a decision without a scintilla of evidence behind it? A clear review-preclusion statute must be enforced even when it cuts off constitutional arguments. Swain v. Pressley, 430 U.S. 372, 377-78, 51 L. Ed. 2d 411, 97 S. Ct. 1224 (1977). Since Congress did not want the VA's decisions to be reviewed for accurate implementation of the statutory criteria, why attribute to Congress a decision to provide judicial review of contentions that the procedures used in reaching those decisions did not ensure a sufficient degree of accuracy?\n\nThe political process is the guarantor of sufficient accuracy over the run of cases. To say that Congress meant to leave the decision in individual cases to the agency is not to say that the decision has been left to solitary, unaccountable bureaucrats. The staff at the VA is less solitary, and more accountable, than is the federal judiciary. Hearing officers receive evidence and make decisions; dissatisfied applicants may appeal to the Board of Veterans Appeals. 38 C.F.R. § 3.103. State judges with the benefit of less tenure regularly hear and decide cases fairly; the public servants at the VA can do likewise. Savage v. CIA, 826 F.2d 561, 563-64 (7th Cir. 1987). Before Congress made the Court of Claims an Article III tribunal, final decisions concerning claims against the government almost invariably were made outside the Article III system. Cf. Glidden Co. v. Zdanok, 370 U.S. 530, 8 L. Ed. 2d 671, 82 S. Ct. 1459 (1962). A veteran dissatisfied with the handling of his claim appeals not to the courts but to veterans' organizations (which have exercised considerable influence in shaping the current system) and to the successors in office of those who made the decision. The VA does not use res judicata, 38 C.F.R. § 3.105, and Marozsan has received numerous dispositions through the years. That the VA rated him 20 % disabled effective March 1980, for an injury supposedly incurred in 1949, says something for the agency's patience and open-mindedness. Congress also monitors the VA closely, at the behest of organized veterans' groups. Judges are not the only or the best friends of applicants for benefits.\n\nIV\n\nThe majority offers several additional reasons for giving a stingy reading to § 211(a). One is the presumption in favor of judicial review of the constitutionality of agency action. The Supreme Court has said many times that there is such a presumption. E.g., Califano v. Sanders, 430 U.S. 99, 109, 51 L. Ed. 2d 192, 97 S. Ct. 980 (1977) (constitutional contention reviewable unless there is clear and convincing evidence of a contrary legislative decision). The most recent, and most emphatic, of these cases is Webster v. Doe, 486 U.S. 592, 108 S. Ct. 2047, 100 L. Ed. 2d 632, 56 U.S.L.W. 4568 (1988), which holds that a district court may review the constitutionality of the CIA's dismissal of an employee even though a statute, 50 U.S.C. § 102(c), gives the Director of Central Intelligence authority to dismiss any employee whenever \"in his discretion\" he \"shall deem such termination necessary or advisable\".\n\nPresumptions in favor of review are not, however, bits of \"evidence\" that stand unless overcome by stronger evidence. This presumption is a rule of statutory construction, which leaves in place all of the usual tools of that art. United States v. Fausto, 484 U.S. 439, 108 S. Ct. 668, 675-76, 98 L. Ed. 2d 830 (1988). Cases such as Webster deal with statutes giving broad discretion to the Executive Branch but not regulating the relations between the Executive and Judicial Branches. Nothing on the statute books said that the CIA's decision was unreviewable. Webster and like cases hold that given the grant of federal-question jurisdiction by 28 U.S.C. § 1331, and its application to the United States under 5 U.S.C. § 702, when Congress does not say that review of constitutional issues is precluded, only the clearest evidence of intent closes the doors. One may question why intent divorced from language would ever do the trick, given multiple grants of jurisdiction to award prospective relief. When Congress passes a law withdrawing the authorization of § 1331 and § 702, that law is to be enforced. Department of the Navy v. Egan, 484 U.S. 518, 108 S. Ct. 818, 823-27, 98 L. Ed. 2d 918 (1988); Briscoe v. Bell, 432 U.S. 404, 409-10, 53 L. Ed. 2d 439, 97 S. Ct. 2428 (1977). Cf. Block v. Community Nutrition Institute, 467 U.S. 340, 81 L. Ed. 2d 270, 104 S. Ct. 2450 (1984); Southern Ry. v. Seaboard Allied Milling Corp., 442 U.S. 444, 60 L. Ed. 2d 1017, 99 S. Ct. 2388 (1979); Morris v. Gressette, 432 U.S. 491, 53 L. Ed. 2d 506, 97 S. Ct. 2411 (1977) (three cases inferring preclusion from statutory structure). It is to be enforced even when, as in Swain v. Pressley, the subject foreclosed is a constitutional argument. Now the \"intent\" shoe is on the other foot. Given language barring review, it takes a showing of intent to authorize it. Section 211(a) is a law barring review; Lynch and Lindahl show that the Supreme Court recognizes it as one. How could Congress have been clearer, except by adding \"and we really mean it!\" at the close?\n\nThe notion of a presumption of judicial review brews trouble in litigation, for it collides with another line of cases--the one saying that waivers of sovereign immunity are to be construed narrowly. In addition to King and Testan, see, e.g., Block v. North Dakota, 461 U.S. 273, 287, 75 L. Ed. 2d 840, 103 S. Ct. 1811 (1983); United States v. Sherwood, 312 U.S. 584, 590, 85 L. Ed. 1058, 61 S. Ct. 767 (1941). These lines of cases do not cross-cite. Many of the cases employing a presumption of review involved claims to benefits--the very circumstance that calls for strict construction of the waiver. A formal distinction is that only the substantive terms of the waiver are strictly construed, while procedural attributes (such as judicial review to ensure compliance with substance) are generously read. The distinction does not harmonize the cases, however, because several in the \"strict\" line dealt with the availability of judicial review. Block v. North Dakota, for example, declines judicial review by construing a statute of limitations in the sovereign's favor. And the distinction does not convince because it does not explain why substantive disputes should be resolved with a thumb on the government's side of the scales and procedural disputes with the other thumb on the other side.\n\nA more plausible distinction is that the presumption of review comes into play when a court is asked to issue prospective relief, while the strict construction approach takes over when the court is asked to compel the payment of money. Then the line is drawn where the eleventh amendment and correlative principles of governmental immunity draw it: prospective relief is permitted against the sovereign once the fiction of Ex parte Young, 209 U.S. 123, 52 L. Ed. 714, 28 S. Ct. 441 (1908), is indulged, even though awards of damages are not. United States v. Mitchell, 463 U.S. 206, 212-19, 77 L. Ed. 2d 580, 103 S. Ct. 2961 (1983); United States v. Mottaz, 476 U.S. 834, 841, 90 L. Ed. 2d 841, 106 S. Ct. 2224 (1986). When courts have the constitutional power to award relief, there is a presumption that Congress authorized the award; when the power to award relief depends on an affirmative authorization, this waiver is read more cautiously. If this is the right line, then Johnson and Traynor were on one side (the prospective-injunction side), while Marozsan's claim, along with Winslow and Mathes, are on the other (the retrospective-money side). Webster v. Doe, the most potent of the pro-review cases, is on the Johnson and Traynor side of the line. Plaintiff Doe sought only prospective relief: reinstatement but not back pay, 56 U.S.L.W. at 4569.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Marozsan wants money; even if we construe Marozsan's claim as looking forward, what he wants prospectively is cash, only. So although judges are apt to get lost hacking through this jungle of inconsistent precedents, a bold assertion of sovereign immunity in a money case still ought to be respected.\n\nAnother of the majority's contentions is that we ought to construe § 211(a) to avoid holding it unconstitutional, perhaps even to avoid addressing constitutional questions about it. See Edward J. DeBartolo Corp. v. Florida Gulf Coast Building \u0026 Construction Trades Council, 485 U.S. 568, 108 S. Ct. 1392, 1397, 99 L. Ed. 2d 645 (1988); The Charming Betsy, 6 U.S. (2 Cranch) 64, 2 L. Ed. 208 , *118 (1804). Construction to avoid unconstitutionality or a serious question, see NLRB v. Catholic Bishop of Chicago, 440 U.S. 490, 500-01, 59 L. Ed. 2d 533, 99 S. Ct. 1313 (1979), must be distinguished from revising statutes to avoid any questions at all. What with the proliferation of constitutional \"questions\", courts could do anything they pleased. Henry J. Friendly, Benchmarks 210-11 (1967). This canon properly may be invoked only when a substantial problem coincides with the possibility of fairly reading the statute to avoid that problem. \"This canon of construction does not give a court the prerogative to ignore the legislative will in order to avoid constitutional adjudication.\" CFTC v. Schor, 478 U.S. 833, 106 S. Ct. 3245, 3252, 92 L. Ed. 2d 675 (1986) (collecting cases); see also Swain, 430 U.S. at 378 n.11. Construing statutes to avoid all constitutional questions treats the penumbra around the Constitution as if it has independent force, and thereby denies effect to real laws on the basis of insubstantial \"concerns\". See Boxhorn's Big Muskego Gun Club, Inc. v. Electrical Workers, 798 F.2d 1016, 1021 (7th Cir. 1986).\n\nIs there a serious constitutional problem in § 211(a)? No; there is not even a humorous one. When Congress creates a right to recover money from the United States, it may \"provide an administrative remedy and make it exclusive.\" Dismuke v. United States, 297 U.S. 167, 172, 80 L. Ed. 561, 56 S. Ct. 400 (1936). Accord, United States v. Babcock, 250 U.S. 328, 331, 63 L. Ed. 1011, 39 S. Ct. 464 (1919). It does so as a condition on the waiver of sovereign immunity, for the power to stand on immunity implies the power to waive immunity with conditions. E.g., Lehman v. Nakshian, 453 U.S. 156, 69 L. Ed. 2d 548, 101 S. Ct. 2698 (1981) (the power of Congress to withhold any remedy against the Treasury permits it to grant a remedy without a jury trial). All § 211(a) does is make the administrative remedy exclusive. Until recently there was doubt whether Congress could allow Article III tribunals to resolve claims against the Treasury. Five Justices held in Glidden (on two incompatible theories) that Congress may. It is quite a leap to transmute this grudging permission into constitutional compulsion to provide review in the Article III courts.\n\nPerhaps one could say, as two judges did in dicta in Bartlett v. Bowen, 259 U.S. App. D.C. 391, 816 F.2d 695, 703-11, rehearing en banc vacated, 263 U.S. App. D.C. 260, 824 F.2d 1240 (D.C. Cir. 1987), that sovereign immunity no longer permits the United States to close the courts to requests for funds from the Treasury; in that event the foundation for cases such as Dismuke would be gone, and there could be a substantial question about § 211(a). The ruminations in Bartlett are unpersuasive, however, and a majority of the D.C. Circuit has rejected them, see 816 F.2d at 712-28 (Bork, J., dissenting, and discussing cases on, and scholarly treatments of, the subject), 824 F.2d at 1248-49 (Bork, Starr, Buckley, Williams \u0026 D.H. Ginsburg, JJ., dissenting, calling the dicta \"plainly wrong\"), 824 F.2d at 1247 (Silberman, J., concurring in the order vacating rehearing but \"inclined to favor the dissent's analysis\" on the jurisdictional question). It is familiar in the jurisprudence of the eleventh amendment that the constitutional footing of a claim does not authorize judicial review or open state treasuries, e.g., Kentucky v. Graham, 473 U.S. 159, 169-70, 87 L. Ed. 2d 114, 105 S. Ct. 3099 (1985); Cory v. White, 457 U.S. 85, 90, 72 L. Ed. 2d 694, 102 S. Ct. 2325 (1982); Alabama v. Pugh, 438 U.S. 781, 57 L. Ed. 2d 1114, 98 S. Ct. 3057 (1978). Congress' power to assert or waive sovereign immunity is no less than the states' immunity under the eleventh amendment. See Maricopa County v. Valley National Bank, 318 U.S. 357, 362, 87 L. Ed. 834, 63 S. Ct. 587 (1943).\n\nMy colleagues' assertion that \"[s]ince the Administrator lacks sovereign authority to contravene the Constitution, he cannot assert sovereign immunity from liability for such acts\" (slip op. 16) misunderstands sovereign immunity. They might say with equal force that because no one has \"authority to contravene the Constitution\" (or law) there is no such thing as sovereign immunity. That doctrine nonetheless exists. It is not a privilege to violate the law, any more than judicial immunity is such a privilege. No person or institution has \"authonty to contravene\" the law. Sovereign immunity has to do with the allocation of powers among the branches of the government. Congress alone has the authority to decide when to permit suit against the United States as an entity. Graham, Cory, Pugh, and a host of other cases show that governmental immunity defeats a claim for money as a remedy, even when the plaintiff has shown a violation of the Constitution. That is why in Bivens v. Six Federal Agents, 403 U.S. 388, 29 L. Ed. 2d 619, 91 S. Ct. 1999 (1971), the plaintiff seeking damages on account of unconstitutional action by an agent of the federal government had to sue the person who acted unconstitutionally: sovereign immunity barred access to the Treasury. Ours is a suit seeking money from the United States in its own name, which is what sovereign immunity is all about. Officers of the government are personally liable for their wrongs, for they are not the sovereign, but no such officer is a party to this case.\n\nThe many subtle questions that attend legislative efforts to close the Article III courts to suits seeking to protect natural liberty and private property from governmental interference--or to close courts selectively in ways reflecting hostility to certain constitutional rights--are irrelevant to the validity of § 211(a). See Gerald Gunther, Congressional Power to Curtail Federal Court Jurisdiction: An Opinionated Guide to the Ongoing Debate, 36 Stan. L. Rev. 895 (1984). Marbury v. Madison, 5 U.S. (1 Cranch) 137, 2 L. Ed. 60 , *177-80 (1803), held that because a court with jurisdiction must decide, it is entitled to resolve a constitutional question logically entailed in reaching a conclusion. Judicial review came from the authority to decide. It is not yet true that the authority to decide may be inferred from the institution of judicial review, for that institution pre-supposed the rightful authority to decide. So it is not true that whenever someone presents a constitutional issue, the court must have power to decide. Quotations (see slip op. 16) from cases such as Crowell v. Benson, 285 U.S. 22, 56-57, 76 L. Ed. 598, 52 S. Ct. 285 (1932), miss this point. The statute at issue in Crowell authorized a federal agency to transfer money from private person A to private person B on finding that A had committed a civil wrong. Congress passed another statute authorizing judicial review of the administrative decision. Crowell, which dealt with the rights of the person called on to pay, had nothing to do with suits against the United States seeking welfare payments, or with the power of courts to engage in review in the teeth of statutes denying them jurisdiction. No case has held that Congress must allow review of claims against the Treasury; Dismuke and many other cases that my colleagues choose not to discuss hold that it need not.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe Supreme Court has never held a door-closing statute unconstitutional, and it has seen many, starting with the denial of all federal-question jurisdiction to the federal courts in the first Judiciary Act. It has enforced those it encountered. Ex parte McCardle, 74 U.S. (7 Wall.) 506, 19 L. Ed. 264 (1868); and see the string of modern cases such as Fausto (no review of certain disputes arising out of governmental employment); NLRB v. United Food Workers, 484 U.S. 112, 108 S. Ct. 413, 98 L. Ed. 2d 429 (1987) (no review of decisions of the Board's General Counsel not to issue, or to dismiss in settlement, unfair labor practice complaints); and United States v. Erika, Inc., 456 U.S. 201, 72 L. Ed. 2d 12, 102 S. Ct. 1650 (1982) (no review of certain decisions under the Medicare statute). Cases such as Erika show that even a request for a remand to the administrative agency requires statutory authorization and may be blocked by a statute precluding review. Interpreting Marozsan's suit as one requesting a remand rather than money does not give us the statutory authority necessary to grant that relief.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e A remand is just a step on the way to money, and statutes precluding judicial review of agency action invariably are treated as forbidding adjudication followed by remand to the agency. Cf. Florida v. Long, 487 U.S. 223, 56 U.S.L.W. 4718, 101 L. Ed. 2d 206, 108 S. Ct. 2354 (U.S. June 22, 1988) (treating an increase in pension payments for future months as a \"retroactive\" award of money because the payments are attributable to earlier work--a conclusion equally applicable to veterans' disability awards).\n\nMarozsan contends that § 211(a) violates the equal protection component of the Due Process Clause, which is ludicrous. The majority gives it the back of the hand, slip op. 3 n.3. Veterans are hardly a disfavored class; instead they receive benefits and preferences in governmental employment. E.g., Personnel Administrator of Massachusetts v. Feeney, 442 U.S. 256, 60 L. Ed. 2d 870, 99 S. Ct. 2282 (1979). Veterans have not been singled out compared with, say, persons whose security clearances are revoked, see Egan, or persons alleging unfair labor practices, see United Food Workers, or chemical companies that believe that their formulae have been appropriated, see Thomas v. Union Carbide Agricultural Products Co., 473 U.S. 568, 582-84, 87 L. Ed. 2d 409, 105 S. Ct. 3325 (1985), or railroad workers who believe that their employers have disregarded collective bargaining agreements, see Union Pacific R.R. v. Sheehan, 439 U.S. 89, 94, 58 L. Ed. 2d 354, 99 S. Ct. 399 (1978). Section 211(a) is rationally related to the purposes of ensuring that the veterans' benefits program operates outside the adversarial system (see National Ass'n of Radiation Survivors) and ensuring that complex questions get consistent treatment from a unitary Administrator. It serves these functions well--too well, Marozsan tells us--which dissipates any equal protection challenge. There is no plausible constitutional challenge to § 211(a), and no reason to \"construe\" the statute to sidestep a phantom attack.\n\nOne more part of my colleagues' approach calls for comment. The majority uses a familiar technique that starts with an unpalatable hypothetical, observes that there must be some way to deal with that, and concludes that given the power to reach the necessary result in the hypothetical situation, there is no principled ground to stop short of the result about which there is greater doubt. See Paul Gewirtz, The Jurisprudence of Hypotheticals, 32 J. Legal Education 120 (1982). Applied to § 211(a) the method proceeds: (1) racial and religious discrimination are obnoxious; (2) the Nation has decided that judicial review is necessary to wipe out these invidious forms of discrimination; (3) surely Congress would allow judicial review of claims that the Administrator of the VA was granting benefits to white or Christian veterans but denying them to identically-situated black or Jewish veterans; (4) there is no evidence in the legislative debates that Congress wanted to permit racial discrimination, which a denial of judicial review would do; yet (5) nothing in § 211(a) would permit judicial review of claims based on racial or religious discrimination but deny it for other claims; and because (by # 3) there must be review of claims of invidious discrimination, (6) the legislation necessarily permits review of other constitutional claims.\n\nI do not doubt these premises; I doubt only the conclusion. This is too syllogistic, and the \"life of the law has not been logic: it has been experience.\" Oliver Wendell Holmes, Jr., The Common Law 1 (1881). See also Lydon v. Justices of Boston Municipal Court, 698 F.2d 1, 10 (1st Cir. 1982) (Campbell, J., dissenting), reversed, 466 U.S. 294, 313, 104 S. Ct. 1805, 80 L Ed. 2d 311 (1984). The technique starts by putting a hypothetical question to the minds of deceased legislators who never thought about it while they were living--let alone while they were in Congress assembled. These ghostly legislators always give the answer the questioner prefers; they are in no position to do otherwise. Their \"answer\" becomes the basis for insisting that the statute they actually wrote be construed consistently with the views we have put in their mouths--for they did not deny that they wanted the statute construed consistently with the answer they did not give! Yet the fact that they did not answer a question that was not asked of them does not grant us the authority to disregard the answer they gave to the question that was asked. Rodriguez v. United States, 480 U.S. 522, 107 S. Ct. 1391, 1393, 94 L. Ed. 2d 533 (1987).\n\nThe terror of extreme hypotheticals produces much bad law. Just as the answer to the claim that \"the power to tax involves the power to destroy\" (and the conclusion that there can be no power to tax) is \"not . . . while this Court sits\", Panhandle Oil Co. v. Mississippi ex rel. Knox, 277 U.S. 218, 223, 72 L. Ed. 857, 48 S. Ct. 451 (1928) (Holmes, J., dissenting), overruled by Alabama v. King \u0026 Boozer, 314 U.S. 1, 86 L. Ed. 3, 62 S. Ct. 43 (1941), so the generic answer to the extreme hypothetical is \"we'll cross that bridge when we come to it\". If Congress actually were to do something that from today's perspective seems \"extreme\" maybe it would have a good reason; the flow of events may make things more sensible when done than they appear from a distance. Legislation that in 1905 appeared to a majority of Justices to be bizarre and destructive appears to a majority today to be benign, perhaps inevitable. Only after understanding an \"extreme\" proposal are we in a position to assess its consequences and craft the proper response. Taking anticipated reactions to an extreme result--one divorced from plausible justifications--and using this as the basis of reconstructing a law on the principle of parity of treatment, disregards the genius of common law development. We must start from the cases and laws at hand and understand them as best we can. The stuff of daily litigation must be resolved under existing statutes; fear of the future, of what's at the bottom of a long, slippery slope, is not a good reason for today's decision. See Frederick Schauer, Slippery Slopes, 99 Harv. L. Rev. 361, 368-77 (1985).\n\nConsider the application of the extreme hypothetical to § 211(a). My colleagues are convinced that Congress would not close the courts to claims of racial discrimination. Detestable though discrimination is, Congress rationally might conclude that judicial review of claims of discrimination would come at too great a purchase. Many claims of discrimination take the form: \"My case was sufficient under the governing law, yet I was denied benefits; therefore my race must have been held against me\", or \"My claim is as good as that of someone else, yet his request was granted and mine was denied; therefore my race must account for the difference.\" This line of reasoning, common in litigation about age, sex, and race discrimination in employment, would break down all barriers against review. If claims agents of the VA engage in racial, religious, or political discrimination, the Board of Veterans' Appeals can correct the situation. The federal courts do not receive complaints that adjudicatory tribunals are themselves discriminators; the vast jurisprudence arising out of social security disability claims (a parallel to veterans' claims) does not reveal any substantiated charge of discrimination by the administrative law judges and the Appeals Council of the Department of Health and Human Services. Congress could well conclude that the ratio of actual discrimination by professional adjudicators to efforts to obtain back-door review of the merits is too small to authorize a search by another system of tribunals. Judges, of all people, should recognize that this conclusion may be reached by conscientious persons. Judges have absolute immunity, including immunity from suits seeking damages on account of racial discrimination, because of a belief that the costs of such litigation would swamp the good it could do in correcting wrongs. A thoughtful legislature also could come out the other way, providing review of claims of racial (and other) discrimination but not of \"the merits\" of benefits decisions.\n\nA belief that Congress is likely to do this, if asked, is not a sufficient reason to say that it has already done so, and because it has neglected to distinguish racial from other constitutional contentions, every constitutional argument is reviewable today. This confuses a prediction with a fact. Section 211(a) was passed in 1933 and last amended in 1970. The first Congress of the Franklin Roosevelt Administration was not searching for ways to expand the power of the courts, and any proposal to protect civil rights would have produced an endless filibuster. Not until 1972, in an amendment to Title VII of the Civil Rights Act of 1964, did Congress first expose the United States to suits based on claims of racial discrimination. Not until 1976, in an amendment to 5 U.S.C. § 702, did Congress first permit litigation against the United States, as a general matter, when subjects other than money are at issue. It is revisionism to read earlier statutes as if they had been enacted by recent Congresses. The clash in this case is not between sensible statutory construction and wooden \"plain meaning\" construction, as the concurrence would have it; no one believes that words have meanings apart from linguistic (and other) contexts. The clash is between understanding and enforcing a 1933 law on its own terms and the impulse to follow \"strong modern trend[s]\" (concurring op. 29).\n\nIf we must choose between applying the statute we have and imagining how today's Congress would handle the same problem, we must take the former path. \"[U]nenacted approvals, beliefs, and desires are not laws.\" Puerto Rico Department of Consumer Affairs v. Isla Petroleum Corp., 485 U.S. 495, 108 S. Ct. 1350, 1354, 99 L. Ed. 2d 582 (1988) If we must choose between applying the statute we have and imagining how the enacting Congress would have handled the questions we pose for it (concurring op. 27), again the path is clear. The case \"must be measured against the . . . statute Congress passed, not against the hypothetical statute it is most 'reasonable to believe' Congress would have passed had it considered the question\". Lukhard v. Reed, 481 U.S. 368, 107 S. Ct. 1807, 1812-13, 95 L. Ed. 2d 328 n.3 (1987) (plurality opinion).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e If we must wonder whether in 1933 Congress \"would have agreed to extinguish all constitutional remedies against the Veterans' Administration that veterans might otherwise possess, or might acquire by virtue of subsequent enactments\" (concurring op. 27), the answer is that he had none against the United States as an entity in 1933, and nothing in § 211(a) inhibits Congress from doing in \"subsequent enactments\" whatever it pleases. The concurrence thinks it implausible to conclude that § 211(a) \"forever preclude[s]\" (concurring op. 27) remedies--which would indeed be implausible, but which none of the contending interpretations implies. Congress may amend or supersede § 211(a) tomorrow, yet later laws such as 5 U.S.C. § 702 leave existing bars alone. Our question is whether that statute authorizes relief against the United States: for if it does not, sovereign immunity bars what Marozsan wants. My colleagues must believe that courts are responsible for keeping laws \"up to date\" even if that means altering them; the Supreme Court believes that \"a statute 'is not an empty vessel into which [a] Court is free to pour a vintage that . . . better suits present-day tastes.' . . . Considerations of this kind are for Congress, not the courts.\" National Broiler Marketing Ass'n v. United States, 436 U.S. 816, 827, 56 L. Ed. 2d 728, 98 S. Ct. 2122 (1978).\n\nIn trying to produce consistency between the treatment of racial claims to which my colleagues believe Congress \"would have agreed\" had it been asked, and the actual treatment of other claims, the court may create a real inconsistency. Nothing in § 211(a) suggests that constitutional claims are to be treated differently from claims based on statutes other than veterans' benefits legislation. The Administrative Procedure Act is one such statute. If consistency is our aim, must we not hold that all contentions based on the APA are reviewable? The majority opinion seems to balk, treating constitutional claims as special; the concurring opinion bites the bullet for most laws, concluding: \"section 211(a) does not foreclose judicial review of actions by the Veterans' Administration that are alleged to violate laws other than the Veterans' Benefits Act itself\" (concurring op. 24-25). The APA is such a law, but the concurrence shies away. Congress--the one sitting in 1933, the one sitting in 1970, the one sitting today--would be surprised to learn that standard APA review is available in veterans' benefits cases, just because my colleagues are confident how it would answer questions about racial discrimination. Stopping short, however, entails the same sort of line-drawing that the court otherwise abjures. The right lesson to draw from this cascade of inferences is that the method of instilling meaning into a statute based on lines Congress did not draw, as a result of things it did not consider, is fundamentally flawed.\n\nV\n\nIt still may be worth recognizing what this case does not involve. It does not involve a demand for prospective relief of the sort that is granted despite governmental immunity. It does not involve a \"claim\" arising under the Constitution; it involves only a constitutional issue arising in the course of adjudicating a claim arising under the veterans' laws. It has long been recognized that litigants have no general right to resolution in federal court of constitutional issues arising in other forums. E.g., Johnson v. Mississippi, 421 U.S. 213, 44 L. Ed. 2d 121, 95 S. Ct. 1591 (1975) (collecting cases). It does not involve a contention that the VA used racial, religious, political, or other criteria. It does not involve a claim for damages against the persons said to have violated the Constitution. Compare Bivens with Bush v. Lucas, 462 U.S. 367, 76 L. Ed. 2d 648, 103 S. Ct. 2404 (1983), and Schweiker v. Chilicky, 487 U.S. 412, 56 U.S.L.W. 4767, 101 L. Ed. 2d 370, 108 S. Ct. 2460 (U.S. June 24, 1988). It is a suit seeking money against the United States in its own name, a claim traditionally barred unless a statute unambiguously authorizes the suit.\n\nThe submission my colleagues find most appealing is Marozsan's assertion that the VA uses a \"quota system\". What he apparently means is that the Board of Veterans' Appeals reverses approximately the same percentage of decisions each year.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e This is true of federal appellate courts too. The table shows the percentage of reversals by the Board, and by the United States courts of appeals in civil cases, in the same years:\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nReversel Rate\n\nU.S.\n\nYear BVA Courts\n\n1975 30.7 20.7\n\n1976 29.5 21.9\n\n1977 28.3 16.9\n\n1978 25.9 19.7\n\n1979 26.3 18.8\n\n1980 26.8 19.0\n\n1981 26.7 19.3\n\n1982 28.2 18.4\n\n1983 29.1 18.4\n\n1984 28.7 18.6\n\n1985 29.6 18.3\n\n1986 31.6 20.0\n\n1987 - 17.5\n\nBoth institutions have stable rates, though the Board's is not so flat as Marozsan believes. The stability is no surprise, for the rate of reversal depends on litigants' choices. Because taking an appeal is costly, litigants do so only if they believe that the law and facts offer them a decent chance of success. Unless the costs of appealing change, the rate of success for a given kind of case should be stable. See George L. Priest \u0026 Benjamin Klein, The Selection of Disputes for Litigation, 13 J. Legal Studies 1 (1984). Stability no more suggests that the Board of Veterans' Appeals uses a \"quota\" than that courts do. Even if it did, what would judicial review entail? Determining whether the stability in the rate of reversal comes from equilibrium forces or from inclination to damn the facts and get the cases out would require the most painstaking case-by-case inquiry. This \"quota\" contention, if taken seriously, would demand the examination of the files even of the veterans who do not seek judicial review. The Board of Veterans' Appeals decides on the merits between 35,000 and 45,000 cases per year, about double the out-put of all of the U.S. courts of appeals put together, so the inquiry could take a little time. A process farther removed from the language and functions of § 211(a) is impossible to imagine.\n\nThis is not to praise § 211(a). Arguments may be made for and against review. Judicial review by the more than 700 district judges would sacrifice consistency and technical expertise, but it might improve the implementation of the rule of law at the VA. Many people are dissatisfied with the way the VA handles claims, which may be why proposals to provide for judicial review have currency. A conscientious Congress might strike the balance either way. We know, however, how Congress has struck the balance between 1933 and today. Wherever the fringe of § 211(a) may be, its core is the principle that there shall be no case-by-case review to ensure accurate implementation of the statutory rules. It is exactly case-by-case review to ensure accuracy that the court today requires.\n\n\"Without jurisdiction the court cannot proceed at all in any cause. Jurisdiction is power to declare the law, and when it ceases to exist, the only function remaining to the court is that of announcing the fact and dismissing the cause.\" Ex parte McCardle, 74 U.S. at 514. The federal courts lack jurisdiction of Marozsan's case. Courts must scrupulously observe the limits on their own jurisdiction. Judges have only power granted, not whatever powers they think best. If I must choose between reading even this simple statute as license to follow a \"modern trend\" (concurring op. 29) of decisions under laws post-dating § 211(a)--a process that makes one assertion of judicial power the foundation for the next--and reading this statute as a choice binding on me until amended by its author, I choose the latter without hesitation or regret.\n\n\u003cspan class=\"fn\"\u003e1. Veterans may file successive claims for benefits even if their previous claims were denied. 38 C.F.R. §§ 3.103, 3.104, 3.105.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Marozsan originally sued the United States of America, the United States Attorney General, the Veterans' Administration, Harry N. Walters, Administrator, R. L. Hornbarger, Regional V.A. Adjudication Officer of Indiana, the National American Legion, Robert E. Lyngh, Director of Veterans' Affairs \u0026 Rehabilitation, and the National American Legion Executive Officers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Marozsan contended that \"veterans are denied judicial review of V.A. decisions whereas Social Security disability and general welfare recipients have judicial review rights.\" Marozsan, 635 F. Supp. at 581. The district court properly construed this argument as an equal protection challenge to the constitutionality of § 211(a). See Johnson v. Robison, 415 U.S. 361, 39 L. Ed. 2d 389, 94 S. Ct. 1160 (1974). We agree with the district court that § 211(a) bears a rational relationship to the legitimate state ends of ensuring adequate and uniform decisions on veterans' benefits and not burdening federal courts with review of these benefits decisions. We therefore affirm the portion of the district court's opinion granting summary judgment in favor of the defendants on Marozsan's equal protection challenge to § 211(a). In addition to asking for V.A. compliance with the due process clause, Marozsan sought retroactive benefits, restoration to his proper level of disability, and $5 million in damages. Section 211(a) clearly precludes our review of the Administrator's decision to set benefits and disability levels, Winslow v. Walters, 815 F.2d 1114, 1117 (7th Cir. 1987), and 28 U.S.C. § 1346(a)(2) precludes a district court from hearing claims against the United States for more than $10,000. We therefore Bum that portion of the district court's opinion dismissing these claims for lack of subject matter jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See N.Y. Times, February 19, 1988, sec. D, at 17, col. 1 (witnesses testifying before House Government Operations Subcommittee denounce V.A. appeals system's production quotas for case workers as arbitrary, subject to abuse, manipulative and supportive of slipshod work); N.Y. Times, June 10, 1988, sec. 1, at 8, col. 6 (V.A. announces end of production quotas).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In asserting jurisdiction in the district court, Marozsan may have been arguing that Congress could not have intended to set up a veterans' benefits system in which constitutional violations are not subject to review. To the extent that this may have been Congress' intent in enacting § 211(a), this is a challenge to a decision of Congress, see Devine v. Cleland, 616 F.2d 1080 (9th Cir. 1980), which is not precluded by § 211(a) under Johnson. We find, however, that the district court had jurisdiction over Marozsan's constitutional challenge to the procedures employed by the V.A., and therefore express no opinion on whether Marozsan's complaint also challenges a decision of Congress on due process grounds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See Johnson v. Robison, 415 U.S. 361, 368, 39 L. Ed. 2d 389, 94 S. Ct. 1160 (1975). See also Weinberger v. Salfi, 422 U.S. 749, 765, 45 L. Ed. 2d 522, 95 S. Ct. 2457 (1974) (constitutional issues beyond jurisdiction of Secretary administering the Social Security Act).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is beyond dispute that the administrative procedures of the V.A. do not provide review as constitutionally meaningful as that available in the courts. Indeed, it has been suggested that the V.A. is not even an impartial, deliberative body. See, e.g., National Ass'n of Radiation Survivors v. Turnage, 115 F.R.D. 543 (N.D. Cal. 1987) (V.A. sanctioned for willfully or recklessly destroying, and thwarting discovery of documents relevant to veterans' claims); N.Y. Times, March 29, 1988, at 16, col. 1 (mounting public criticisms of V.A.'s paralysis, delays and denials of due process in its benefits and pension programs). See also Ralpho v. Bell, 186 U.S. App. D.C. 368, 569 F.2d 607, 629 (D.C. Cir. 1977) (much needless litigation could be avoided if agencies would show a modicum of consideration for claimants).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See Hagans v. Lavine, 415 U.S. 528, 537-42, 39 L. Ed. 2d 577, 94 S. Ct. 1372 (1974); Bell v. Hood, 327 U.S. 678, 90 L. Ed. 939, 66 S. Ct. 773 (1946).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. For a discussion of the broad and narrow interpretations of § 211(a), see Reisch, 211 in Progress: Must the Veterans' Administration Comply with Federal Law?, 40 Stan. L. Rev. 323 (1987) (student author).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Winslow and Mathes, like Marozsan and virtually all veteran claimants the courts encounter, were unhappy with the V.A.'s determination of their benefits levels. We unequivocally held in Winslow that § 211(a) \"clearly deprives a federal court of the power to alter determinations made by the V.A. regarding disability ratings and entitlements to benefits.\" Winslow, 815 F.2d at 1117. But Marozsan, Winslow, and Mathes also challenged the constitutionality of the process afforded them by the Administrator in the course of deciding their individual claims. We held then, as we hold now, that this type of challenge is not barred by § 211(a). A veteran may obtain review, not of his individual claim determination, but of unconstitutional methods employed by the V.A. in arriving at that benefits decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We note that Weinberger v. Salfi, 422 U.S. 749, 45 L. Ed. 2d 522, 95 S. Ct. 2457 (1975) and Heckler v. Ringer, 466 U.S. 602, 80 L. Ed. 2d 622, 104 S. Ct. 2013 (1984) do not support the assertion that Marozsan's claim is unreviewable because it \"arises out of\" a claim for benefits. The district court found § 211(a) unequivocal and thus susceptible of only one viable reading under which the statute precludes judicial review of all decisions made by the Administrator. In Marozsan's case, the government argues, the Administrator \"decided\" to employ the methods at issue, thereby rendering these methods immune from review. See supra note 9 and accompanying text. First, it is unconvincing to assert that § 211(a) must logically control whenever the V.A. violates the Constitution in the course of deciding benefits claims. This interpretation begs the fundamental question of whether the district court's broad reading of § 211(a) is constitutionally permissible. Any violation of the Constitution by the V.A. will inevitably arise in the context of a claim for benefits. If the government's view of § 211(a) were correct, no veteran would ever have standing to challenge such violations. The Court's Salfi and Ringer decisions do not preclude a narrow reading of § 211(a) which allows federal courts to hear constitutional claims. Salfi held that § 405(h) of the Social Security Act deprived the federal courts of jurisdiction over a widow's claim for benefits on behalf of her child from a previous marriage. The widow claimed that the \"duration of the relationship\" requirement of the Social Security Act created a constitutionally impermissible classification. The Court held that § 405(h) precluded jurisdiction despite the fact that the claim also arose under the Constitution. Unlike the V.A. statutes, however, the Social Security Act specifically provides for federal court review following a final administrative determination. In concluding that § 405(h) prohibited jurisdiction, the Salfi Court expressly stated that Johnson was inapposite because unlike the Social Security Act, \"if § 211(a) reached constitutional challenges to statutory limitations, then absolutely no judicial consideration of the issue would be available.\" 422 U.S. at 762 This \"extraordinary\" result was unacceptable. Id. Further, although § 405(h) bars even challenges to the constitutionality of the statute (until the prescribed administrative remedies are exhausted), Johnson demonstrates that § 211(a) cannot be given such a broad reading. Section 405(h) is thus in crucial respects unlike § 211(a), and Salfi therefore offers scant support for the view that § 211(a) must be read to preclude judicial review even of claims that the Administrator violated the Constitution. Ringer is similarly inapposite. In that case the Court held only that § 405(h) initially requires Medicare claimants into channel their claims into the administrative process before seeking judicial review. 466 U.S. at 614. In any event, the Court's recent decision in Traynor v. Turnage, 485 U.S. 535, 108 S. Ct. 1372, 99 L. Ed. 2d 618 (1988) moots this debate over the significance of Salfi and Ringer. Traynor specifically adopted a narrow reading of § 211(a) that precludes review only of \"decisions made in interpreting or applying a particular provision of [the veterans' benefit laws] to a particular set of facts.\" Traynor, 108 S. Ct. at 1379. The Traynor Court even framed the issue before it as whether the V.A.'s \"decision\" was subject to review, id. at 1377, thereby implicitly rejecting the government's view that every action of the Administrator is an unreviewable \"decision.\" Marozsan challenges the constitutionality of the Administrator's procedures, not the accuracy of his decision under the veterans' benefits laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Both constructions of § 211(a) reach this result. Under the broad construction, the statute is not a decision of the Administrator; under the narrow construction, it is not a decision of the Administrator under the veterans' benefits laws. See Reisch, supra note 9, at 338 n.81.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Congress amended § 211(a) in 1970 in reaction to three decisions of the D.C. Circuit. These decisions held that certain individual claims determinations were subject to judicial review despite section 211(a) by reading the term \"claim\" very narrowly. [Specifically, they held that a forfeiture of benefits did not create a \"claim\" to benefits, and thus V.A. decisions that veterans had forfeited their benefits were held reviewable in federal court.] See Tracy v. Gleason, 126 U.S. App. D.C. 415, 379 F.2d 469 (D.C. Cir. 1967); Thompson v. Gleason, 115 U.S. App. D.C. 201, 317 F.2d 901 (D.C. Cir. 1962); Wellman v. Whittier, 104 U.S. App. D.C. 6, 259 F.2d 163 (D.C. Cir. 1958). The House Report accompanying the 1970 amendments clearly states that the language change was designed to reject the \"fairly tortured construction adopted by the court of appeals in the Wellman, Thompson, and Tracy holdings.\" H.R. Rep. No. 1166, 91st Cong., 2d Sess. 11 (1970), U.S. Code Cong. \u0026 Admin. News 1970, p. 3731. In particular, Congress feared that judicial review might be extended under those decisions to \"millions of decisions terminating or reducing many types of benefits provided under laws administered by the Veteran's Administration.\" Gott v. Walters, 244 U.S. App. D.C. 193, 756 F.2d 902, 924-25 (D.C. Cir. 1985) (Wald, J., dissenting). Thus Congress simply reaffirmed that fact-specific benefits determinations under veterans' benefits laws are immune from federal judicial review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We note that the preclusion of federal judicial review has not produced a high level of uniformity in benefits decisionmaking. See Reisch, supra note 9, at 353 \u0026 n.160.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Our reading of Johnson is further confirmed by Webster v. Doe, 486 U.S. 592, 56 U.S.L.W. 4568, 100 L. Ed. 2d 632, 108 S. Ct. 2047 (June 15, 1988), in which the Court refused to read § 102(c) of the National Security Act of 1947 to exclude review of constitutional claims by a discharged CIA employee. Section 102(c), codified at 50 U.S.C. § 403(c), gives the Director of Central Intelligence discretion to fire employees whose termination he deems \"necessary or advisable in the interests of the United States.\" The court held that this language did not evince a clear enough intent to preclude federal court review of constitutional challenges to the Director's action. Writing for a six Justice majority, Chief Justice Rehnquist stated: Nothing in § 102(c) persuades us that Congress meant to preclude consideration of colorable constitutional claims arising out of the actions of the Director pursuant to that section; we believe that a constitutional claim based on an individual discharge may be reviewed by the District Court. Id. at 4571 (footnote omitted). The Court refused to read the statute as precluding constitutional claims in part \"to avoid the 'serious constitutional question' that would arise if a federal statute were construed to deny any judicial forum for a colorable constitutional claim.\" Id. (citing Bowen v. Michigan Academy of Family Physicians, 476 U.S. 667, 681, 90 L. Ed. 2d 623, 106 S. Ct. 2133 n.12 (1986)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Justices Scalia and Kennedy took no part in the consideration or decision of the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Many lower courts have therefore interpreted Johnson to mean that § 211(a) does not bar judicial review of the constitutionality of the regulations, procedures or policies of the Administrator. See Arnolds v. Veterans' Administration, 507 F. Supp. 128, 130 (N.D. Ill. 1981) (listing cases).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The underlying constitutional conception is that wielders of governmental power must be subject to the limits of law, and that the applicable limits should be determined, not by those institutions whose authority is in question, but by an impartial judiciary. As Professor Sunstein pithily puts it, the proposition that foxes should not guard henhouses is as applicable to administrative agencies as it is to Congress or the executive. Indeed, the absence of electoral safeguards against arbitrary and self-interested bureaucratic decisionmaking and the documented risk of agency susceptibility to influence by private groups furnish compelling separation-of-powers arguments for retaining the Article III courts as guarantors of agency fidelity to law. Fallon, 101 Harv. L. Rev. at 938 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Congress could not have intended the V.A. to consider itself free to engage in \"politically motivated infidelity to the requirements of the law.\" Fallon, 101 Harv. L. Rev. at 943.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See Judge Posner's concurring opinion at 26-27 and Rabin, Preclusion of Judicial Review in the Processing of Claims for Veterans' Benefits: A Preliminary Analysis, 27 Stan. L. Rev. 905, 908 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We presume that \"Congress intends the executive to obey its statutory commands and, accordingly, that it expects the courts to grant relief when an executive agency violates such a command.\" Bowen v. Michigan Academy of Family Physicians, 476 U.S. 667, 106 S. Ct. 2133, 2141, 90 L. Ed. 2d 623 (1986). Congress must expect executive agencies to be no less faithful to the Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. We remand because the district court erred in holding that § 211(a) barred it from considering Marozsan's due process claim. It may be true, however, that even under the proper construction of § 211(a) Marozsan has not made a showing adequate to survive a motion for summary judgment. This determination should be made by the district court in the first instance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. I agree with Judge Posner that, under the circumstances here, Rule 54(c) offers no solace to the plaintiff. He has considered--and declined--to ask for injunctive relief. See 10 C. Wright, A. Miller \u0026 M. Kane, Federal Practice and Procedure § 2662 at 131-33 (2d ed. 1983). 1a Rescigno v. Walters, 773 F.2d 47 (3d Cir. 1985), may support Devine, but more likely holds only that § 211(a) does not bar a challenge to the validity of § 211(a) itself.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The specter that a literal construction of § 211(a) nullifles Title VII of the Civil Rights Act of 1964, extended to the government in 1972, see concurring op. at 26, is therefore insubstantial. The introductory clause to § 211(a)--\"except as provided in sections 775, 784, and as to matters arising under chapter 37 of this title\"--permits review of some additional matters. Sections 775 and 784 deal with veterans' life insurance, chapter 37 with home loans.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Appeals Council of the Department of Health and Human Services heard 44,621 administrative appeals in fiscal year 1986. Social Security Administration, Executive Handbook of Selected Data 32 (May 1987). During fiscal year 1987, the claimants took 13,322 of these to the district courts under 42 U.S.C. § 405(g). (This assumes a lag between administrative closure and the institution of the civil action.) Almost 1,000 appeals in social security disability cases are filed yearly. Director of the Administrative Office of the United States Courts, Annual Report 1987 Table B-7 (1988) (982 appeals classified as \"U.S. Defendant - Social Security Laws\" in fiscal 1987). Social security disability cases thus make up some 6 % of the district courts' cases and 3 % of the appellate courts'. The Board of Veterans' Appeals hears almost exactly as many cases every year as does the Appeals Council. E.g., Veterans Administration, Annual Report 1984 p. 125 (1985) (61,328 appeals filed in fiscal 1984; after settlement of many of these, the Board issued 44,064 decisions).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The majority's contrary statements, e.g. slip op. 5 (because \"the V.A. disclaims authority to consider constitutional claims\" the veteran \"has . . . no forum at all in which to raise his due process claim\"), rest on a confusion of challenges to statutes with challenges to practices. The VA told the Supreme Court in Johnson that it lacked the authority to disregard statutes on constitutional grounds. I doubt that this is correct; the Constitution is supreme for administrative as well as judicial personnel, and nothing about the constitutional hierarchy implies that only judges have the power to place the Constitution above mere law. Every governmental official has the duty to do this. The power of judicial review comes from the hierarchy or rules, with the Constitution superior to law; that same hierarchy applies to every other governmental actor, and each takes an oath of obedience to the Constitution. See Rex E. Lee, The Provinces of Constitutional Interpretation, 61 Tulane L. Rev. 1009, 1012-14 (1987) (collecting presidential views on the subject). But see Lear Siegler, Inc. v. Lehman, 842 F.2d 1102, 1119-26 (9th Cir. 1988), and Continental Air Lines, Inc. v. Department of Transportation, 269 U.S. App. D.C. 116, 843 F.2d 1444, 1455 (D.C. Cir. 1988), both saying that the Executive Branch is forbidden by the Constitution from giving the Constitution precedence over statutes. To state the position is to refute it. Each case relies on the requirement in Article II § 3 that the President \"take Care that the Laws be faithfully executed\", but \"Laws\" for this purpose must include the Constitution. Cf. National Wildlife Federation v. ICC, 271 U.S. App. D.C. 1, 850 F.2d 694 (D.C. Cir. 1988) (remanding a case so that the agency may consider a constitutional objection to its decision). Let this pass. Assume for the moment that the VA takes a contrary view of its powers and duties. The VA's view in Johnson was that when Congress says \"jump\" it jumps. Nothing about the VA's belief that statutes must be followed implies that when promulgating or revising 38 C.F.R. § 3.103 (establishing rules for holding hearings), the Administrator does not consider constitutional questions; indeed, that regulation is captioned \"Due process-procedural and appellate rights. . . \" . If the Board uses a \"quota\" in deciding cases, or exalts the medical views of general practitioners over those of specialists, someone at the VA has decided to do this and he, she, or a successor in office can reverse course.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Webster v. Doe does not make anything turn on this, but that is not surprising in light of the absence of a claim for money, and the waiver of sovereign immunity in 5 U.S.C. § 702 for claims not seeking damages. I concede, however, that another aspect of Webster is both at odds with the approach taken here and not so easy to explain. Webster relied, 56 U.S.L.W. at 4571, on Johnson v. Robison for the proposition that \"where Congress intends to preclude review of constitutional claims its intent to do so must be clear.\" The Court did not remark on the potential difference between reviewing the constitutionality of enabling legislation (as in Johnson) and of reviewing day-to-day decisions (as in Webster). That difference was one Johnson itself stressed in order to demonstrate that the Court could review the constitutionality of a law because it was not reviewing a decision of the Administrator within the meaning of § 211(a). And, the Court added in Johnson, review of the law itself would not create a risk of embroiling the courts in the tens of thousands of disputes under veterans' benefits acts, the very thing § 211(a) is designed to prevent. Although Webster did not refer to those limiting aspects of Johnson, neither did it repudiate them. The parties in Webster did not join issue on the scope and effect of Johnson; the Solicitor General's briefs do not mention that case. Instead of reading tea leaves, an inferior court should stick to Johnson's stated rationale until told that it is no longer authoritative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For example, Mottaz invoked sovereign immunity to prohibit adjudication of a suit that included a claim that the government had violated the Due Process Clause; Lynch, 292 U.S. at 581, remarked that in a suit seeking recovery from the Treasury \"[t]he rule that the United States may not be sued without its consent is all-embracing\" and \"applies alike to causes of action arising under acts of Congress . . . and to those arising from some violation of rights conferred upon the citizen by the Constitution\" (citing Schillinger v. United States, 155 U.S. 163, 166, 39 L. Ed. 108, 15 S. Ct. 85 (1894)); Maricopa County used sovereign immunity to eject from federal court a contention that the grant of certain powers to the Reconstruction Finance Corp. violated the Due Process Clause because it retroactively burdened property, remarking, 318 U.S. at 362: \"No such suit may be maintained without the consent of the United States\"; see also California v. Arizona, 440 U.S. 59, 63, 59 L. Ed. 2d 144, 99 S. Ct. 919 (1979) (\"It is clear, of course, that Congress could refuse to waive the Nation's sovereign immunity in all cases or only in some cases but in all courts. Either action would bind this Court even in the exercise of its original jurisdiction\"--a jurisdiction granted by the Constitution and therefore not subject to the legislative power to make \"exceptions\"). Morrison v. Work, 266 U.S. 481, 69 L. Ed. 394, 45 S. Ct. 149 (1925) (no review of constitutional claims concerning management of Indians' property); and Murray v. Wilson Distilling Co., 213 U.S. 151, 53 L. Ed. 742, 29 S. Ct. 458 (1909) (no review of constitutional claim to money concerning the government's handling of liquor), are just a smattering of the other cases on point. Perhaps these cases need revision; the majority's opinion oozes hostility to sovereign immunity; but until the Supreme Court tells us to throw that doctrine away we ought to implement it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The concurring opinion says that courts may remand benefits cases to agencies. A remand is a judicial order running against the government as an entity and therefore requires authorization. The Administrative Procedure Act provides that authorization for many cases, even when the claimant wants money--provided the money is not \"damages\", see Bowen v. Massachusetts, 487 U.S. 879, 56 U.S. L.W. 4878, 101 L. Ed. 2d 749, 108 S. Ct. 2722 (U.S. June 29, 1988). Section 702 of the APA, the statute interpreted in that case, waives immunity, and the question was \"how far?\" Section 211(a) asserts immunity; the more general rules established by the Administrative Procedure Act do not govern. See 5 U.S.C. § 701(a)(1), providing that the judicial-review sections of the APA (including § 702) do not apply when \"statutes preclude judicial review\". Sections 702(1) and (2) reinforce this; each subsection states that § 702 does not permit review that is forbidden by some other law. So we are back to § 211(a), for if it applies, § 702 (like the rest of the APA) does not, and we are missing statutory authority to grant relief against the United States as an entity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The plurality in Lukhard was Chief Justice Rehnquist and Justices White, Stevens, and Scalia. Chief Justice Rehnquist and Justices Blackmun, O'Connor and Scalia expressed the same position even more strongly in K Mart Corp. v. Cartier, Inc., 486 U.S. 281, 108 S. Ct. 1811, 1834-35, 100 L. Ed. 2d 313 (1988) (concurring and dissenting opinion). The view therefore has the support of a majority of the Court. (Justice Kennedy has not addressed this subject.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. There is another sense of \"quota system\" to which Marozsan may refer. Until recently, see New York Times, June 10, 1988, § 1, p. 8, col. 6 (reporting the abolition of this system), the VA gave bonuses to those among the 62 members of the Board of Veterans Appeals who disposed of the most cases per year. The line separating bonus from no bonus may be called a \"quota Perhaps the pressure to dispose of more cases leads the members to do less well with each. This could cut in favor of the veteran as readily as against. At all events, the crush of business is attributable to legislative choices. Congress determines how much money is available to hire appellate adjudicators, which fixes how many cases each will have. Cf. Heckler v. Day, 467 U.S. 104, 81 L. Ed. 2d 88, 104 S. Ct. 2249 (1984). It is not clear why financial incentives to clear up a backlog of cases--incentives that might lead to inaccurate decisions but also may induce the adjudicators to spend the extra time necessary to keep up with their work--are a constitutional problem.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The data come from the annual reports of the Administrative Office of the U.S. Courts and of the Veterans Administration and are for the fiscal or statistical years ending in the calendar year in question. The VA has three categories of dispositions: claims allowed, denied, and remanded (or \"closed\"). I combine the \"allowed\" and \"remanded\" figures to produce the reversal rate. In most years there were slightly more remands than allowances. The reversal rate for the courts of appeals is the column \"reversed or denied\" in the Administrative Office's annual report for the year. After 1984 the Administrative Office stopped reporting an aggregate \"civil\" rate and gave the rates for sub-categories of civil cases. For 1985-87 I give a reversal rate derived by dividing the total civil reversals (all reversals listed in Table B-5, less the number of criminal reversals) by the total number of terminations on the merits (less criminal decisions on the merits). Data for the VA in 1987 are not yet available.\u003c/span\u003e\n\n",
    "body_length": 143278,
    "citedas": [
      "852 F.2d 1469"
    ],
    "attorneys": "Philip R. Skodinski, South Bend, Indiana, for Plaintiff. John S. Koppel, Washington, D.C., for Defendant.",
    "category": [
      "124",
      "242",
      "36"
    ],
    "judges": "En Banc. William J. Bauer, Chief Circuit Judge, and Walter J. Cummings, Harlington Wood, Jr., Richard D. Cudahy, Richard A. Posner, John L. Coffey, Joel M. Flaum, Frank Easterbrook, Kenneth F. Ripple, Daniel A. Manion, and Michael S. Kanne, Circuit Judges.",
    "citation_count": 34
  }
}
