{
  "id": "rqAGR2YBTlTomsSBrO4h",
  "document": {
    "title": "State v. Richard Lynn Bible",
    "full_title": "STATE OF ARIZONA v. RICHARD LYNN BIBLE",
    "jurisdiction": "Arizona Supreme Court",
    "date": "1993-08-12T00:00:00.000Z",
    "docket": "No. CR-90-0167-AP",
    "body": "Defendant Richard Lynn Bible was convicted of first degree murder, kidnapping, and molestation of a child under fifteen years of age. He was sentenced to death for the murder conviction and to consecutive twenty-two year terms for the other convictions. Appeal to this court is automatic. Ariz.R.Crim.P. 26.15, 31.2(b). We have jurisdiction pursuant to Ariz. Const. art. VI, § 5(3), Ariz.R.Crim.P. 31, and A.R.S. § 13-4031.\n\nFACTS AND PROCEDURAL HISTORY\n\nBecause the guilty verdicts are primarily based on circumstantial evidence,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e we set forth the facts in some detail. In late May 1987, Defendant was released from prison after serving a sentence imposed in 1981 for kidnapping and sexual assault. At all times relevant to this case, Defendant lived in Flagstaff, Arizona.\n\nIn April 1988, the Coconino County Sheriff seized a dark green and white GMC \"Jimmy\" (or \"Blazer-type\") vehicle in Sedona, Arizona. The GMC had been used to deliver newspapers. A deputy who drove it to Flagstaff noticed rubber bands in the GMC, as well as damage to the left rear quarter panel. Another officer noticed the damaged quarter panel and saw bags of rubber bands in the vehicle. The Sheriff stored the vehicle in a fenced impound lot near Flagstaff, close to Sheep Hill. On June 5, 1988, Defendant stole the GMC from the impound lot. A police officer saw the vehicle parked in Flagstaff later that day.\n\nThe next day, June 6, 1988, shortly after 10:30 a.m., the victim, a nine year-old girl, began bicycling from where her family was staying in Flagstaff to a ranch a mile away. The victim's family passed her while driving to the ranch. When the child did not arrive at the ranch, her family began to search and found her bicycle by the side of the road. Unable to locate the girl, the victim's mother called the police at 11:21 a.m.\n\nThe Flagstaff police arrived within minutes; they called in a helicopter, set up roadblocks, and alerted the Federal Bureau of Investigation (\"FBI\"). The victim's mother told the police that she saw two vehicles on her way to the ranch. One was a royal blue Blazer-type vehicle. While at the ranch, she saw this same vehicle going the opposite direction at a high rate of speed. She described the driver as a dark-haired, dark-complected Caucasian male, mid-to-late twenties, possibly wearing a white T-shirt. He had looked at her intently.\n\nThat same day, Defendant's brother was at his home near Sheep Hill. Defendant arrived there shortly before 1:00 p.m., driving a dark green or dark silver, white-top Blazer-type vehicle with a dented left bumper -- the vehicle Defendant had stolen. Defendant was wearing levi pants, a plaid shirt, a camouflage baseball-type cap, and boots. He told his brother that the Blazer belonged to a friend. After Defendant left, his brother -- who thought that Defendant had been stealing from him -- called the police and described the vehicle.\n\nShortly thereafter, a detective realized that the victim's mother's description of the Blazer-type vehicle and its driver approximated Defendant and the GMC Jimmy. At about 5:00 p.m., the GMC was discovered missing from the impound lot. At 6:20 p.m., police officers saw Defendant driving the GMC -- although it had been painted a different color. The officers attempted to stop Defendant, and a high-speed chase began. When finally cornered, Defendant ran from the vehicle and hid.\n\nUsing a tracking dog, officers found Defendant hiding under a ledge, camouflaged with twigs, leaves, and branches. When arrested, Defendant was wearing a \"levitype\" jacket, jeans, a plaid shirt, boots, but no underwear. Defendant also had wool gloves, and police found a baseball-type cap nearby. Police also found a large folding knife where Defendant was hiding and another knife in one of his pockets.\n\nWithin hours after his arrest, Defendant confessed to stealing the GMC the previous day and painting the vehicle two hours before his arrest, but denied being in the area of the abduction. Defendant had planned to drive the GMC to Phoenix, but a helicopter had him \"pinned down.\" When Defendant was booked, the police confiscated his clothing. Defendant was incarcerated for the rest of the relevant time period.\n\nIn the GMC, police found a green blanket and numerous rubber bands but no rubber band bags. The steering column had been cut open and one piece of metal had fallen to the floorboard. The GMC contained a case of twenty 50-milliliter bottles of \"Suntory\" vodka with two bottles missing. In the console was a wrapped cigar broken in two places, a \"Dutchmaster\" cigar wrapper and band were in the ashtray, and Carnation \"Rich\" hot chocolate packets were in the vehicle. Investigators found blood smeared inside and under the GMC, although testing did not reveal whether the blood was human.\n\nFollowing a large and unsuccessful police search, hikers accidentally found the victim's body near Sheep Hill nearly three weeks after her disappearance. Police secured the area and later videotaped the scene and processed evidence. The victim's naked body was hidden under a tree, mostly covered with branches, with her hands tied behind her back with a shoelace. Police found one of the victim's sneakers, without a shoelace, near the body. The victim's panties were in a tree nearby.\n\nAn unwrapped, unsmoked cigar with two distinctive breaks in the middle was on the ground near the body. The cigars near the body and in the GMC looked very similar, had consistent breaks, and had identical seals. Microscopic analysis showed that the cigars had similar thresh cuts and tobacco mixtures. The cigars also had similar sieve test results and pH values. Although the nicotine values and ash content were slightly different, the cigars were from the same lot and were similar to, and consistent with, tobacco residue found in Defendant's shirt pockets.\n\nAn empty ten-pack box of Carnation \"Rich\" hot chocolate -- matching the packets in the GMC -- was near the body. Also nearby were two empty 50-milliliter \"Suntory\" vodka bottles -- one approximately fifty feet from the body. Testing, which revealed no fingerprints, washed away the lot numbers on these empty bottles. In all other respects, these bottles were identical to the full bottles found in the GMC.\n\nRubber bands were everywhere: on a path near the body; over, on, and under the body; in the tree where the panties were hanging; near the victim's other clothing; in the brush covering the body; in a tree above the body; and under a tree where one of the victim's shoes was found.\n\nVisual observation as well as testing revealed that the rubber bands in the GMC were round rather than oblong and were identical to those found near the body. A rubber band bag containing a few rubber bands was found five feet from the body.\n\nA patch of blood-matted grass was near the body. Testing revealed that this blood was human and was phosphoglucomutase (\"PGM\") subtype 2[+], the same subtype as the victim's blood. Luminol spraying revealed a faint blood trail leading from the blood-matted grass to the body. Testing showed blood on the top of the branches covering the body.\n\nNear the body, police found a piece of metal that fit the GMC's steering column. In Flagstaff, at the location where the GMC was seen parked the day before the victim disappeared, police found another piece of metal from the vehicle's steering column. The three metal pieces (found inside the GMC, near the body, and where the GMC had been parked) fit together like jigsaw puzzle pieces. An investigator concluded that the three metal pieces were part of the GMC's steering column.\n\nAn autopsy revealed that portions of the body (including the head and genital area) were severely decomposed, consistent with having been on Sheep Hill for approximately three weeks. Multiple skull fractures and a broken jawbone indicated that blows to the head caused the victim's death. The blood-matted grass near the body was consistent with the blows being inflicted there. Although the body was naked with the hands tied, suggesting sexual molestation, no sperm or semen was found. The physician performing the autopsy took public hair and muscle samples.\n\nNear the body were several clusters of golden brown hair approximately six to ten inches long. Although the hair found at the scene appeared to be lighter in color, it was microscopically similar to the victim's hair and could have come from her. In one of the locks of hair, an examiner found a pubic-type hair. This public-type hair was similar to Defendant's public hair samples. Long brown hair found on Defendant's jacket, shirt, and in his wallet were similar to the victim's hair and could have come from her. Investigators found hair similar to Defendant's on a sheet used to wrap the body, and hair found on the victim's T-shirt was similar to Defendant's. Hair on a blanket in the GMC was similar to the victim's, with a total of fifty-seven hairs in the GMC being similar to the victim's hair.\n\nSome of the hair found near the body, as well as the hair on Defendant's shirt and in his wallet, was cut on one side and torn on the other. The investigator had never before seen such a cut/tear pattern but was able to duplicate the pattern by using the knives Defendant possessed when arrested as well as other sharp knives. Twenty-one of the twenty-two hairs on Defendant's jacket had similar cut/tears.\n\nFibers found at Sheep Hill were identical to the GMC's seat covers, and similar to fibers from Defendant's jacket lining and the green blanket in the GMC. Fibers in the lock of hair containing the pubic-type hair were similar to fibers from Defendant's jacket. Fibers similar to those from the green blanket in the GMC were located in the branches covering the body. Microscopically, a green fiber on the sheet used to wrap the body was similar to fibers from the green blanket. A blue or purple fiber on the shoelace tying the victim's hands was similar to the lining in Defendant's jacket.\n\nInvestigators found blood on Defendant's shirt, pants, and boots. The spatter pattern on the shirt was consistent with beating force. Testing could not determine whether the blood on his boots was human but revealed that the blood on Defendant's shirt was human and PGM 2[+] subtype, the same subtype as the victim's blood. Less than three percent of the population has PGM 2[+] subtype. Because Defendant is PGM 1[+] subtype, the blood could not have been his. Testing performed by Cellmark Diagnostic Laboratories, Inc., showed that the deoxyribonucleic acid (\"DNA\") in the blood on Defendant's shirt and the victim's DNA were a \"match.\" Cellmark concluded that the chances were one in fourteen billion or, more conservatively, one in sixty\n\nmillion that the blood on Defendant's shirt was not the victim's.\n\nWhile still in jail for stealing the GMC, Defendant was charged with first degree murder, kidnapping, and molestation of a child under the age of fifteen. In April 1990, a jury convicted Defendant on all charges and Defendant was sentenced to death on the murder conviction. On appeal, Defendant raises a variety of issues which we consider in turn.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nDiscussion\n\nA. Defendant's right to a fair and impartial jury and a fair trial\n\n1. Whether the trial court erred in refusing to change venue\n\na. Background\n\nApproximately fifteen months before trial, Defendant filed his first motion to change the place of trial because of pretrial publicity. See Ariz.R.Crim.P. 10.3. This motion summarized dozens of news items from June 1988 to February 1989. These items state, inter alia, that Defendant committed other crimes, failed a polygraph test, and attempted to escape, and refer to other evidence deemed inadmissible at trial. The court denied this change of venue motion more than a year before trial. Defendant later moved to reconsider and the court heard argument the day before trial began. That motion was denied without prejudice to renew if it became obvious that a fair trial could not be had. Defendant did not renew the motion. On appeal, Defendant claims that the Judge erred in refusing to change venue.\n\nBecause of the extensive pretrial publicity and the size of Flagstaff and Coconino County (respective populations of approximately 45,000 and 100,000), nearly all potential jurors had some knowledge of the case. On February 26, 1990, 187 potential jurors completed written questionnaires. Of these 187, almost all had read or heard about the case, approximately two-thirds had discussed the case, and approximately one-half had an opinion about Defendant's guilt.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Of the jurors that heard the case, all had read or heard something about the case, more than half were familiar with state investigators, half had discussed the case, and two jurors had a \"qualified\" opinion as to guilt at the time they answered the jury questionnaire.\n\nb. Should prejudice be presumed?\n\nDefendant argues that \"outrageous\" pretrial publicity dictates that prejudice requiring a change of venue should be presumed -- making a showing of actual prejudice unnecessary. Juror exposure to information about an offense charged ordinarily does not raise a presumption that a defendant was denied a fair trial. Murphy v. Florida, 421 U.S. 794, 799, 95 S. Ct. 2031, 2036, 44 L. Ed. 2d 589 (1975). If, however, a defendant can show pretrial publicity so outrageous that it promises to turn the trial into a mockery of Justice or a mere formality, prejudice will be presumed without examining the publicity's actual influence on the jury. See, e.g., id.; Rideau v. Louisiana, 373 U.S. 723, 726-27, 83 S. Ct. 1417, 1419-20, 10 L. Ed. 2d 663 (1963); State v. Atwood, 171 Ariz. 576, 631, 832 P.2d 593, 648 (1992), cert. denied, U.S. , 113 S.Ct. 1058, 122 L.Ed.2d 364 (1993); State v. Befford, 157 Ariz. 37, 39, 754 P.2d 1141, 1143 (1988).\n\nClearly, there was extensive pretrial publicity; the record on appeal contains approximately 130 pretrial news stories. The frequency of these items, however, varied greatly. Approximately eighty-five items appeared from June to December 1988. From January 1989 to the beginning of trial (fourteen months) approximately\n\nfifty items appeared.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Thus, the frequency in 1988 was approximately three items per week while the frequency in 1989 and 1990 was less than one item per week.\n\nSome reports are duplicates, containing similar material published in different newspapers; some do not mention Defendant; and several state that Defendant was not a suspect or not a strong suspect. For the most part, the reports are factually based, and nearly all of the factual information reported in the articles was admitted at trial.\n\nSome items, however, discuss inadmissible evidence, are inaccurate, or approach the \"outrageous\" standard used in determining presumptive prejudice. For example, a June 10, 1988, article has the Sheriff stating that Defendant \"'flunked' a lie detector test.\" Defendant is described as a convicted \"child molester\" who committed \"child rape\" -- incorrect descriptions of his 1981 sexual assault conviction.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e A June 28, 1988, article reported a Phoenix-area legislator suggesting the death penalty for child molesters \"even if it means the execution 'of a few innocent people.'\" The article, however, added that the suggestion prompted protests, that the proposal was unconstitutional, and contained another legislator's response criticizing the suggestion as \"'an affront and outrageous'\" and not reflecting appropriate legislative \"'wisdom and leadership.'\" A January 28, 1990, article has an inmate stating that Defendant admitted involvement in the victim's abduction. The article adds, however, that the inmate recanted and repeatedly changed his story.\n\nThere are other articles that might have posed a serious threat to Defendant's fair trial rights. These items, however, were months apart and came months before trial began. Cf. Patton v. Yount, 467 U.S. 1025, 1034, 104 S.Ct. 2885, 2890, 81 L.Ed.2d 847 (1984) (\"That time soothes and erases is a perfectly natural phenomenon, familiar to all.\"). In addition, they are exceptions to the largely factual information in the great bulk of the news reports. See United States v. De La Vega, 913 F.2d 861, 865 (11th Cir.1990) (no presumed prejudice when jurors had knowledge of facts as 330 articles, with few exceptions, were largely factual), cert. denied, U.S. , 111 S.Ct. 2011, 114 L.Ed.2d 99 (1991); United States v. Angiulo, 897 F.2d 1169, 1181 (1st Cir.) (\"Although the news coverage was extensive, it largely was factual in nature, summarizing the charges against the defendants and the alleged conduct that underlay the indictment.\"), cert. denied, 498 U.S. 845, 111 S.Ct. 130, 112 L.Ed.2d 98 (1990).\n\nThe burden to show that pretrial publicity is presumptively prejudicial clearly rests with the defendant and is \"extremely heavy.\" Coleman v. Kemp, 778 F.2d 1487, 1537 (11th Cir.1985), cert. denied, 476 U.S. 1164, 106 S.Ct. 2289, 90 L.Ed.2d 730 (1986). In varying procedural contexts, appellate courts have found that the issue of presumed prejudice is a question of fact or a mixed question of law and fact resulting in standards of review including \"manifest error,\" \"clearly erroneous,\" and others. See id. at 1537 \u0026 nn. 17, 18 (citing cases). Even were we to review the trial court's ruling de novo, however, this record does not lead us to conclude that prejudice must be presumed.\n\nDue in large part to the findings required, courts rarely presume prejudice due to outrageous pretrial publicity. Nebraska\n\nPress Ass'n v. Stuart, 427 U.S. 539, 554, 96 S.Ct. 2791, 2800, 49 L.Ed.2d 683 (1976) (Burger, C.J., opinion of the Court). To presume prejudice, we must necessarily disregard the results of voir dire examination as well as the circumstances surrounding pretrial proceedings and reach our own Conclusion based on the totality of the circumstances from the entire record. See Pamplin v. Mason, 364 F.2d 1, 6 (5th Cir. 1966). We must also find that the defendant has shown \"inflammatory and prejudicial pretrial publicity that so pervaded the community as to render virtually impossible a fair trial before an impartial jury.\" Coleman, 778 F.2d at 1540. In short, to presume prejudice, we must necessarily decide that the publicity was so unfair, so prejudicial, and so pervasive that we cannot give any credibility to the jurors' answers during voir dire affirming their ability to decide the case fairly.\n\nThe circumstances in this case fall short of those rare and unusual cases where this difficult showing has been made. See, e.g., Rideau, 373 U.S. at 726-727, 83 S.Ct. at 1419-20 (televised \"confession\" seen by many potential jurors); Coleman, 778 F.2d at 1538-1543 (overwhelming publicity in county with population of 7000); Isaacs v. Kemp, 778 F.2d 1482, 1483-84 (11th Cir. 1985) (companion case to Coleman); United States v. Denno, 313 F.2d 364, 366-67, 372 (2d Cir.) (en banc) (6-3 decision) (extensive pretrial publicity including defendant's confession; \"[t]he publicity was in its nature highly inflammatory, in volume great, and accessibility universal.\"), cert. denied, 372 U.S. 978, 83 S.Ct. 1112, 10 L.Ed.2d 143 (1963); cf. Sheppard v. Maxwell, 384 U.S. 333, 86 S.Ct. 1507, 16 L.Ed.2d 600 (1966) (overwhelming pretrial publicity, coupled with publicity at trial and outrageous trial conduct, required reversal). These cases show more in the way of inaccurate as well as extremely prejudicial pretrial publicity than does the totality of the record in this case. These cases also demonstrate the media's successful and sometimes relentless attempt to whip up hysteria and passion in the community -- something the present case lacks. And at least Sheppard contains something else lacking in this case -- the media successfully influencing law enforcement officers and court personnel as well as the court itself. See Sheppard, 384 U.S. at 337, 354-58, 362, 86 S.Ct. at 1518-20, 1522.\n\nNor is the substance of the pretrial publicity in the present case comparable to that in Rideau, where a local television station thrice showed the defendant's confession.\n\n\"In Rideau the defendant had 'confessed' under police interrogation to the murder of which he stood convicted. A 20-minute film of his confession was broadcast three times by a television station in the community where the crime and the trial took place. In reversing, the Court did not examine the voir dire for evidence of actual prejudice because it considered the trial under review 'but a hollow formality' -- the real trial had occurred when tens of thousands of people, in a community of 150,000, had seen and heard the defendant admit his guilt before the cameras.\"\n\nAtwood, 171 Ariz. at 631, 832 P.2d at 648 (quoting Murphy, 421 U.S. at 799, 95 S.Ct. at 2035-36); see also Coleman, 778 F.2d at 1491-1537.\n\nOn this record, we cannot conclude that the trial was \"utterly corrupted\" by pretrial publicity, Murphy, 421 U.S. at 798, 95 S.Ct. at 2035, and therefore will not presume prejudice, see Atwood, 171 Ariz. at 631, 832 P.2d at 648; State v. LaGrand, 153 Ariz. 21, 34, 734 P.2d 563, 576, cert. denied, 484 U.S. 872, 108 S.Ct. 207, 98 L.Ed.2d 158 (1987); State v. Greenawalt, 128 Ariz. 150, 164, 624 P.2d 828, 842, cert. denied, 454 U.S. 882, 102 S.Ct. 364, 70 L.Ed.2d 191 (1981).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Accordingly, we turn\n\nto the issue of whether the record demonstrates actual prejudice.\n\nc. Does the record demonstrate that the pretrial publicity caused actual prejudice likely to have deprived Defendant of a fair trial?\n\nAbsent presumed prejudice, the focus is whether the potential jurors \"could not Judge impartially the guilt of the defendant.\" Yount, 467 U.S. at 1035, 104 S.Ct. at 2891. When a motion to change venue is based on actual prejudice resulting from pretrial publicity, the defendant must show that the \"prejudicial material will probably result in the [defendant] being deprived of a fair trial.\" Ariz.R.Crim.P. 10.3(b); see also LaGrand, 153 Ariz. at 34, 734 P.2d at 576. The purpose of this rule is to ensure an impartial jury as guaranteed by the United States and Arizona Constitutions. See U.S. Const. amend. VI, XIV; Ariz. Const. art. II, §§ 4, 24; Ross v. Oklahoma, 487 U.S. 81, 86, 108 S.Ct. 2273, 2277, 101 L.Ed.2d 80 (1988); Befford, 157 Ariz. at 39, 754 P.2d at 1143. Our review of this issue is for an abuse of discretion. See State v. Salazar, 173 Ariz. 399, 406, 844 P.2d 566, 573 (1992); cf. Mu'Min v. Virginia, U.S. , , 111 S.Ct. 1899, 1906, 114 L.Ed.2d 493 (1991) (deference to trial court's decision is particularly appropriate when objective trial Judge \"sits in the locale where the publicity is said to have had its effect, and brings to his evaluation of any such claim his own perception of the depth and extent of news stories that might influence a juror.\").\n\nAlthough almost all of the potential jurors had heard something about the case, the relevant inquiry is the effect of publicity on a juror's objectivity, not the mere fact of publicity. LaGrand, 153 Ariz. at 34, 734 P.2d at 576; see also State v. Smith, 160 Ariz. 507, 512, 774 P.2d 811, 816 (1989). After the court excused 111 potential jurors, less than twenty-five percent of the sixty-one member venire left had a qualified opinion regarding guilt and only two such individuals served on the trial jury, no member had an unqualified opinion, and all indicated that they could set aside their qualified opinions and decide the case based on evidence produced at trial. These responses undercut Defendant's prejudice claim. See Simmons v. Lockhart, 814 F.2d 504, 510 (8th Cir.1987), cert. denied, 485 U.S. 1015, 108 S.Ct. 1489, 99 L.Ed.2d 717 (1988). The trial took place nearly two years after the crime and the largely factual pretrial publicity abated during the year preceding trial, circumstances supporting the court's ruling. See Murphy, 421 U.S. at 802, 95 S.Ct. at 2037; Atwood, 171 Ariz. at 631, 832 P.2d at 648.\n\nIn the past, we also have relied on a fully developed oral voir dire record in deciding whether pretrial publicity actually prejudiced a jury. See, e.g., Atwood, 171 Ariz. at 632, 832 P.2d at 649; Befford, 157 Ariz. at 40, 754 P.2d at 1144; LaGrand, 153 Ariz. at 34, 734 P.2d at 576. In this case, as discussed more fully below, see infra § A(3)(a), oral voir dire was not extensive. This lack of extensive oral voir dire, however, cannot be equated with prejudice in this case.\n\nAlthough the court denied Defendant's request for individualized voir dire, defense counsel agreed with questions the court proposed to raise with the potential jurors in order to clarify the law, to rehabilitate, and to discover additional information. Defendant repeatedly had neither additions nor objections to the proposed questions. When the court indicated that it would not take much time to qualify the panel, the prosecutor stated \"[t]hat sounds appropriate,\" and defense counsel added \"I would ask the Court to follow that.\" After voir dire, Defendant passed the panel.\n\nThus, we do not have an extensive oral voir dire record. Defendant had the burden\n\nof establishing that pretrial publicity would likely deprive him of a fair and impartial jury. LaGrand, 153 Ariz. at 34, 734 P.2d at 576. Given the questionnaire answers and the record before us, Defendant has not shown actual prejudice. Accordingly, we reject his claim that pretrial publicity caused actual prejudice requiring a change in venue.\n\n2. Did the atmosphere at trial, coupled with the pretrial publicity, deprive Defendant of a fair trial?\n\nIn an argument closely related to his claim of presumed prejudice resulting from pretrial publicity, see supra § A(1)(b), Defendant argues that the conduct of his trial, coupled with the pretrial publicity, presumptively deprived him of a fair trial, thus violating his due process rights. News articles indicate that during trial the victim's parents and friends wore small pink bows in memory of the victim. Another article states that \"[s]everal of the 14 jurors hearing the case wept as both parents [of the victim] talked. Judge Richard K. Mangum also wept as he listened.\" The sheriff reportedly \"came close to weeping\" when testifying. Other articles detail an outburst by the victim's father. Defendant argues that these in-court occurrences, coupled with the pretrial publicity discussed above, created a circus or carnival atmosphere thereby denying him a fair trial.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nA fair trial is a fundamental liberty secured by the United States and Arizona Constitutions. See Ariz. Const. art. II, §§ 4, 24; Estelle v. Williams, 425 U.S. 501, 503, 96 S.Ct. 1691, 1692, 48 L.Ed.2d 126 (1976); Cox v. Louisiana, 379 U.S. 559, 562, 85 S.Ct. 476, 479-80, 13 L.Ed.2d 487 (1965); State v. Neil, 102 Ariz. 110, 112, 425 P.2d 842, 844 (1967). Included in this right is the guarantee that the jury determine guilt or innocence based solely on the evidence admitted at trial. Irvin v. Dowd, 366 U.S. 717, 722, 81 S.Ct. 1639, 1642, 6 L.Ed.2d 751 (1961).\n\nIn extremely limited and outrageous cases, prejudice is presumed when the record reveals that the trial \"lacked the solemnity and sobriety appropriate to a judicial proceeding.\" Greenawalt, 128 Ariz. at 164, 624 P.2d at 842. To presume prejudice, in-court proceedings must be \"'so inherently prejudicial as to pose an unacceptable threat to [defendant's] right to a fair trial.'\" Atwood, 171 Ariz. at 633, 832 P.2d at 650 (quoting Holbrook v. Flynn, 475 U.S. 560, 572, 106 S.Ct. 1340, 1347, 89 L.Ed.2d 525 (1986)). The court examines the pretrial publicity in combination with the conduct at trial, Sheppard, 384 U.S. at 354-55, 86 S.Ct. at 1518, to determine whether the trial was improperly held in a \"circus atmosphere,\" Murphy, 421 U.S. at 799, 95 S.Ct. at 2036, or \"carnival atmosphere,\" Sheppard, 384 U.S. at 358, 86 S.Ct. at 1520. Presuming prejudice in such cases reflects a fundamental and essential element of our criminal Justice system: \"that dignity, order, and decorum be the hallmarks of all court proceedings.\" Illinois v. Allen, 397 U.S. 337, 343, 90 S.Ct. 1057, 1061, 25 L.Ed.2d 353 (1970).\n\nAlthough many cases discuss the doctrine, very few cases have actually presumed prejudice due to a carnival or circus atmosphere at trial. The two most noted cases actually presuming prejudice are Sheppard and Estes v. Texas, 381 U.S. 532, 85 S.Ct. 1628, 14 L.Ed.2d 543 (1965):\n\n\"The trial in Estes had been conducted in a circus atmosphere, due in large part to the intrusions of the press, which was allowed to sit within the bar of the court and to overrun it with television equipment. Similarly, Sheppard arose from a trial infected not only by a background of extremely inflammatory publicity but also by a courthouse given over to accommodate the public appetite for carnival. The proceedings in these cases were\n\nentirely lacking in the solemnity and sobriety to which a defendant is entitled in a system that subscribes to any notion of fairness and rejects the verdict of a mob.\"\n\nAtwood, 171 Ariz. at 631, 832 P.2d at 648 (quoting Murphy, 421 U.S. at 799, 95 S.Ct. at 2036); see also Sheppard, 384 U.S. at 342-49, 86 S.Ct. at 1512-15 (describing defendant's trial). These cases reflect trials fundamentally different from the picture painted by the record here.\n\nUnlike Estes, there is no suggestion that the media took over the proceedings. And distinguishable from Sheppard, there is no indication that the court so accommodated the public that the proceedings were constitutionally unfair. Nor is this a case where any improper trial conduct, and any corresponding jury impact, accurately may be gleaned from the transcript. See Scala v. Greyhound Lines, Inc., 149 A.D.2d 327, 539 N.Y.S.2d 373, 374 (1989) (finding carnival-like atmosphere where transcript revealed language used at trial \"was so inflammatory and vituperative as to be more appropriate for a barroom than a court-room\").\n\nSome news articles of record describe disturbing events that, given an adequate showing of prejudice, might result in reversible error. In the abstract, however, they do not require that we presume prejudice. The mere fact, if it is a fact, that spectators wore ribbons to trial does not mandate reversal. See Atwood, 171 Ariz. at 634, 832 P.2d at 651. Absent a record, we cannot speculate that such conduct occurred or, if so, that it was so inherently prejudicial that despite the lack of objection it posed an unacceptable threat to Defendant's right to a fair trial. See Holbrook, 475 U.S. at 572, 106 S.Ct. at 1347-48; cf. Norris v. Risley, 918 F.2d 828, 831 (9th Cir.1990) (spectators wearing \"Women Against Rape\" buttons, which the record revealed jurors saw and read, impermissibly \"constituted a continuing reminder that various spectators believed [defendant's] guilt before it was proven\"). Similarly, on the record before us, the crying and the outburst by the victim's father do not mean that we must presume that Defendant did not receive a fair trial. See infra § L; see also State v. Naucke, 829 S.W.2d 445, 460 (Mo.), cert. denied, U.S. , 113 S.Ct. 427, 121 L.Ed.2d 348 (1992); State v. Grice, 109 N.J. 379, 537 A.2d 683, 687 (1988).\n\nThe information before us is essentially no more than a series of newspaper articles purporting to generally describe what happened in the courtroom. These articles do not permit us to reach any Conclusion about events that actually occurred in the court-room. Indeed, they do no more than establish that the articles were printed. We do not, and cannot, accept as conclusive any statement contained in the articles. The record does not show that the trial court failed to control the courtroom, and we will not speculate about what may have occurred. To establish what actually occurred in the courtroom, applicable procedural and evidentiary requirements must be met.\n\nIn both Estes and Sheppard, the convicted defendant submitted evidence of what had occurred at trial. The record in this case, however, contains no evidence establishing what happened in the courtroom or what jurors might have seen or understood. We cannot know or presume to know what was conveyed to the jurors from sources other than witnesses or what effect any of this might have had on the jurors. We cannot accept as fact descriptions contained in news articles. Trial counsel made no record about the court-room events through statements or affidavits by spectators, lawyers, or reporters -- save the news articles. On this record, or, to be more precise, in its absence, we entertain no presumption that Defendant was denied a fair trial. See Atwood, 171 Ariz. at 633-34, 832 P.2d at 650-51; State v. Tison, 129 Ariz. 526, 534-35, 633 P.2d 335, 343-44 (1981), cert. denied, 459 U.S. 882, 103 S.Ct. 180, 74 L.Ed.2d 147 (1982); Greenawalt, 128 Ariz. at 164, 624 P.2d at 842.\n\nOn the other hand, we cannot make any finding as to a lack of prejudice. Given the Judge's order forbidding the lawyers from\n\nspeaking to the jurors after trial,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e coupled with the lack of other evidence, we are left in the dark as to the events that actually took place. We must leave it to post-conviction relief proceedings to ascertain these events and their possible effect on the trial.\n\nBy rejecting Defendant's allegations, we do not signify our approval of the conduct alleged. A trial foreseeably engendering deep passions is no place for publicizing the emotions of the population. Trial Judges are to take measures to ensure that those who come to see the trial are spectators, not advocates, and that in the courthouse spectators carry no pamphlets, hold no signs, and do nothing to pressure, or stir the emotions of, the jurors. In our Justice system, the public has the right to watch the trial -- not participate in it or indicate a desired outcome. The trial Judge must do whatever is necessary to control the courthouse and protect the jury from emotional reactions by spectators or witnesses. The Judge should strictly forbid tactics that may influence the jury and, in the strongest manner possible, deal with those who attempt to do so. We hold only that, on this record, we cannot tell what happened or what effect any occurrence had. We refuse to speculate. Thus, on this record, we find no error.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n3. Did the trial court err in the manner in which voir dire was conducted?\n\nDefendant claims that voir dire should have been individualized and in camera; that oral voir dire was inadequate; and that his rights to be present and to counsel were violated during voir dire. We address these claims in turn.\n\na. Voir dire and jury selection methods used in this case\n\nMonths before trial, the parties suggested that voir dire initially be conducted by a written questionnaire. Defendant later argued that a questionnaire would be helpful. Defense counsel wrote the questionnaire and submitted it to the prosecutor and the court. The court ultimately used Defendant's questionnaire \"as submitted with no changes.\"\n\nThe questionnaire contained fifty-six questions with numerous subparts covering a total of thirty pages. The questions searched the potential jurors' knowledge of the case and the source of such information. Questions addressed the news media and perceptions of media accuracy, law enforcement, scientific testing, and the death penalty, as well as familiarity with Defendant and potential witnesses. The questionnaire also discussed the standard of proof and the jurors' frame of mind if they were to \"sit in judgment.\" Each potential juror filled out and signed their individual questionnaire under oath and in the court's presence.\n\nDefense counsel had \"no objection to the Judge deciding who should be removed for cause.\" After reviewing the completed questionnaires, the trial court, sua sponte, struck 106 of the 187 venire members for cause. On the parties' motions, the court struck several other venire members for cause. Fifteen additional venire members were excused for personal reasons or did not show up, leaving sixty-one individuals for jury selection.\n\nThe court ruled that, absent good cause, the court would conduct oral voir dire. Ariz.R.Crim.P. 18.5(d). Before oral voir dire, the Judge met with counsel to discuss the questions he proposed asking the potential jurors. Defense counsel did not object to the court's proposals. The court conducted a brief, general oral voir dire of the panel of sixty-one. A panel of thirty-four then was drawn. This panel answered the court's voir dire questions; both parties passed the panel and exercised their peremptory strikes. Selecting the panel of thirty-four, oral voir dire, and peremptory strikes took forty-six minutes. With this background, we address Defendant's arguments.\n\nb. Did the trial court err in not permitting individualized and in camera voir dire examination?\n\nDefendant requested individual, or small group, voir dire in camera. Voir dire examination of a juror or jurors apart from the others is designed to prevent panel contamination by inflammatory answers. Ariz.R.Crim.P. 18.5(d) comment; see also Mu'min, U.S. at , 111 S.Ct. at 1905; cf. State v. Clabourne, 142 Ariz. 335, 344, 690 P.2d 54, 63 (1984) (comment by potential juror that \"the entire defense was a lot of baloney\" did not impermissibly contaminate the panel). In camera voir dire, most useful in cases involving massive publicity or \"unusually sensitive subjects,\" is designed to encourage full disclosure \"when the prospective juror might be embarrassed to confess his true opinion before an audience.\" Ariz.R.Crim.P. 18.5(d) comment. Either procedure can be very useful in appropriate cases. Whether to conduct such voir dire, however, is left to the trial court's discretion. See Ariz. R.Crim.P. 18.5(d).\n\nIn this case, the written questionaire addressed many of the questions that might normally militate in favor of individualized, panel, or in camera voir dire. Defendant cites no \"contaminating\" comment made during oral voir dire, and we find none. Nor can we say that any other reason required in camera voir dire. Whatever the risk of the procedure used, the danger did not materialize. Thus, the trial court did not abuse its discretion in denying Defendant's request. See, e.g., Conner v. State, 580 N.E.2d 214, 217 (Ind.1991), cert. denied, U.S. , 112 S.Ct. 1501, 117 L.Ed.2d 640 (1992); Hansen v. State, 592 So.2d 114, 126 (Miss.1991), cert. denied, U.S. , 112 S.Ct. 1970, 118 L.Ed.2d 570 (1992); State v. Whitfield, 837 S.W.2d 503, 509 (Mo.1992).\n\nc. Was the scope of oral voir dire insufficient to help ensure an impartial jury?\n\nDefendant argues that the scope of oral voir dire was inadequate to secure an impartial jury. The questionnaire, the use of which was entirely appropriate in this case, constituted nearly all of the voir dire. The questionnaire not only revealed a great deal of relevant information from a large panel of prospective jurors but also enabled the trial Judge to avoid infecting jurors with answers that necessarily would have been given to the same questions if propounded during oral voir dire.\n\nGiven the nature of the case, including extensive pretrial publicity and a small population, it might have been appropriate to have a more extensive follow-up through oral voir dire. At trial, however, Defendant was content with the extent of the oral voir dire. Defendant had a full opportunity to submit voir dire questions and to discuss the court's proposed questions and statements. Defense counsel agreed with the trial court's proposed questions and statements and had no additional matters for the court to discuss with the panel. Defense counsel drafted and helped administer the questionnaire, had an opportunity to provide additional questions and statements for the panel, and passed the panel. On this record, Defendant is precluded from raising any claim regarding the scope of voir dire. See, e.g., State v. Walton, 159 Ariz. 571, 580-81, 769 P.2d 1017, 1026-27 (1989), aff'd, 497 U.S. 639, 110 S.Ct. 3047, 111 L.Ed.2d 511 (1990); State v. Ortiz, 131 Ariz. 195, 200, 639 P.2d 1020, 1025 (1981), cert. denied, 456 U.S. 984, 102 S.Ct. 2259,\n\n72 L.Ed. 2d 863 (1982); State v. Arnett, 119 Ariz. 38, 50, 579 P.2d 542, 554 (1978). To hold otherwise would eliminate our preclusion rule.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e There are important and valid reasons for such a rule. State v. Gendron, 168 Ariz. 153, 155, 812 P.2d 626, 628 (1991).\n\nd. Did the court deny Defendant his right to be personally present and his right to counsel during voir dire?\n\nDefendant was present during much of the time the prospective jurors filled out the questionnaire. However, after introductory statements by counsel, Defendant, his attorney, and the prosecutor left. After they left, the trial Judge answered prospective jurors' questions on the record. Defendant now alleges that the Judge should have advised him of the specific exchanges with the prospective jurors. Failing to do this, Defendant argues, violated his rights to be present and to counsel during voir dire and is reversible error.\n\nUnder the United States and Arizona Constitutions, a criminal defendant has a right to be present during voir dire. State v. Collins, 133 Ariz. 20, 22-23, 648 P.2d 135, 137-38 (Ct.App.1982); Ariz. R.Crim.P. 19.2. A defendant, however, may waive this right \"by voluntarily absenting himself\" from voir dire. Ariz. R.Crim.P. 9.1; accord Allen, 397 U.S. at 342-43, 90 S.Ct. at 1060-61; State v. Tudgay, 128 Ariz. 1, 2-3, 623 P.2d 360, 361-62 (1981). In this case, Defendant waived his right to be present during voir dire.\n\nWhen the jury questionnaire was being filled out, the court noted that the attorneys had discussed leaving and stated: \"I will stay here in case there are some questions, and that would be simply like what does this question mean.\" After answering some initial questions, the court stated \"[i]f counsel and the defendant want to leave at this time, you may. I will stay here in case there is another question of some kind.\" Defendant and all counsel then left.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Not surprisingly, after these individuals left, the trial court did answer some questions.\n\nDefendant could have remained. The Judge gave Defendant personal notice of the proceedings and told him he had a right to remain and that the proceedings would continue if he left. See State v. Perez, 115 Ariz. 30, 31, 563 P.2d 285, 286 (1977) (citing cases); State v. Armenta, 112 Ariz. 352, 353, 541 P.2d 1154, 1155 (1975) (citing authority). By voluntarily leaving, Defendant waived his right to be present. Ariz. R.Crim.P. 9.1; see also Allen, 397 U.S. at 342-43, 90 S.Ct. at 1060-61; Tudgay, 128 Ariz. at 2-3, 623 P.2d at 361-62. Thus, we reject the claim that Defendant was denied his right to be present during voir dire. For the same reasons, we reject Defendant's contention that he was denied his right to counsel when his attorney also left.\n\nWe similarly reject Defendant's claim that the trial court improperly communicated with the venire when the questionnaire was completed. True, it is improper for a trial Judge to communicate with the venire unless the defendant and defense counsel have been notified and are given the opportunity to be present. See State v. Koch, 138 Ariz. 99, 107, 673 P.2d 297, 305 (1983); State v. Mata, 125 Ariz. 233, 240-41, 609 P.2d 48, 55-56, cert. denied, 449 U.S. 938, 101 S.Ct. 338, 66 L.Ed.2d 161 (1980); see also Perkins v. Komarnyckyj, 172 Ariz. 115, 117-18, 834 P.2d 1260, 1262-63 (1992). As required by these cases, however, both Defendant and his attorney were notified and given an opportunity to be present when the questionnaires were completed. A trial Judge is\n\nnot required to issue a writ to keep a defendant and defense counsel from voluntarily leaving a proceeding. Nor does the record show any impropriety in the trial Judge's responses to the questions raised after Defendant and defense counsel left the room. Thus, we reject Defendant's claims.\n\ne. Did the voir dire procedures constitute fundamental error?\n\nAs discussed, Defendant did not object at trial to much of the claimed error surrounding voir dire. On appeal, however, Defendant argues that the claimed error was fundamental. Because Defendant claims fundamental error on many issues discussed in this opinion, we detail the basic fundamental error principles.\n\nAbsent fundamental error, a party usually cannot raise error on appeal unless a proper objection was made a trial. \"This principle also applies to constitutional error. Only fundamental error . . . may be raised for the first time on appeal.\" State v. Holder, 155 Ariz. 83, 85, 745 P.2d 141, 143 (1987) (citations omitted); see also Ariz. R.Evid. 103(d). Fundamental error is \"error going to the foundation of the case, error that takes from the defendant a right essential to his defense, and error of such magnitude that the defendant could not possibly have received a fair trial.\" State v. Hunter, 142 Ariz. 88, 90, 688 P.2d 980, 982 (1984). To be fundamental, the error \"must be clear, egregious, and curable only via a new trial.\" Gendron, 168 Ariz. at 155, 812 P.2d at 628.\n\nWe examine the prejudicial nature of unobjected-to error in light of the entire record. See State v. Schaaf, 169 Ariz. 323, 327, 819 P.2d 909, 913 (1991). Because this inquiry is fact intensive, the same error may be fundamental in one case but not in another. Cf. State v. Allen, 157 Ariz. 165, 171-72, 755 P.2d 1153, 1159-60 (1988). By definition, fundamental error cannot be harmless error. See State v. Thomas, 130 Ariz. 432, 436 n. 1, 636 P.2d 1214, 1218 n. 1 (1981); cf. State v. Amaya-Ruiz, 166 Ariz. 152, 170, 800 P.2d 1260, 1278 (1990), cert. denied, U.S. , 111 S.Ct. 2044, 114 L.Ed.2d 129 (1991).\n\nGiven the high profile of this case, the passions it stirred, and the pretrial publicity, if requested by Defendant, the court might well have conducted a more substantial oral voir dire. The record, however, does not show that any of the jurors seated demonstrated a closed mind; they all stated they could follow the court's instructions and decide the case on the evidence. While such statements are not always conclusive and are to be tested by voir dire, Irvin, 366 U.S. at 727-28, 81 S.Ct. at 1645, on this record rejecting these statements would require sheer speculation on our part.\n\nAlthough not lengthy, there was some oral response from each member of the panel of thirty-four, allowing the parties to briefly observe their demeanor. See State v. Cook, 170 Ariz. 40, 54, 821 P.2d 731, 745 (1991), cert. denied, U.S. , 113 S.Ct. 137, 121 L.Ed.2d 90 (1992). Although two jurors had qualified opinions regarding guilt, one was drawn as an alternate. The other juror, who actually decided the case, indicated she could set aside her qualified opinion and decide the case on the trial evidence. Nothing of evidentiary value in this record shows that error, if any, in voir dire deprived Defendant of a fair trial. We find no fundamental error. See, e.g., Cook, 170 Ariz. at 50, 821 P.2d at 741; Gendron, 168 Ariz. at 155, 812 P.2d at 628; State v. Valdez, 160 Ariz. 9, 14, 770 P.2d 313, 318 (1989).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n4. Did the trial Judge commit fundamental error in failing to strike certain trial jurors?\n\nDefendant argues that the trial Judge erroneously failed to sua sponte strike twelve of the fourteen trial jurors -- twelve jurors and two alternates -- for cause. At trial, Defendant did not object to or challenge any of these jurors for cause.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Thus, we apply the stringent standard of fundamental error. See supra § A(3)(e).\n\nDefendant's objections on appeal fall into a discrete number of categories. Two of the jurors had \"qualified\" opinions as to guilt, meaning that they could \"set aside that opinion and render a verdict based solely on the evidence presented in court.\" Similarly, several jurors indicated that, for one reason or another, they would find it difficult but not impossible to be fair and impartial. Each of these jurors, however, believed that they could set aside their feelings, keep an open mind, sit fairly and impartially, and base their verdict solely on the evidence presented at trial. Failure to strike these jurors was neither error nor fundamental error. See, e.g., Thomas, 130 Ariz. at 436, 636 P.2d at 1218; Tison, 129 Ariz. at 533, 633 P.2d at 342; State v. Narten, 99 Ariz. 116, 122, 407 P.2d 81, 85 (1965), cert. denied, 384 U.S. 1008, 86 S.Ct. 1985, 16 L.Ed.2d 1021 (1966).\n\nSeveral jurors were familiar with the area where the victim's body was found or with the prosecution team, the defense team, law enforcement personnel, witnesses, the trial Judge, or even the victim's family. This, without more, does not require disqualification, and failure to sua sponte strike these jurors was neither error nor fundamental error. See, e.g., State v. Hill, 174 Ariz. 313, 319-21, 848 P.2d 1375, 1381-83 (1993); State v. Woolery, 93 Ariz. 76, 82, 378 P.2d 751, 756 (1963); State v. Brosie, 24 Ariz. App. 517, 521, 540 P.2d 136, 140 (1975), aff'd on other grounds, 113 Ariz. 329, 553 P.2d 1203 (1976).\n\nThree jurors knew something about DNA testing with varying opinions as to reliability. Neither reason nor authority supports the proposition that mere knowledge about relevant scientific testing procedures disqualifies a potential juror, let alone constitutes fundamental error. Although one juror had been a juror in a murder case where a guilty verdict was returned, prior jury duty in a similar but unrelated case does not automatically disqualify a juror. See State v. Sorrell, 95 Ariz. 220, 223, 388 P.2d 429, 431 (1964); see also 47 Am.Jur.2d Jury § 309 (1969).\n\nFinally, in answering the questionaire, one juror indicated that he would not treat the testimony of police officers as he would other witnesses, did not understand that the State had the burden of proof for each element, and did not agree with the presumption of innocence. This juror, however, indicated that he could fairly and impartially listen to and weigh the evidence and render a verdict in accordance with the law. He also understood that the State had the burden of proof beyond a reasonable doubt. Furthermore, this juror expressed no disagreement with the presumption of innocence, the jury's duty to Judge credibility, or the State's burden to prove guilt beyond a reasonable doubt. Although follow-up oral inquiry of this juror would have been appropriate, we find no fundamental error in allowing this juror to sit. See, e.g., Cook, 170 Ariz. at 50, 821 P.2d at 741; Gendron, 168 Ariz. at 155, 812 P.2d at 628; Valdez, 160 Ariz. at 14, 770 P.2d at 318.\n\nIn sum, it might have been appropriate to have excused some of these jurors or at least questioned them further. Defendant\n\nasked for neither. From the record, we cannot say that it was either error or fundamental error for the Judge to have failed to sua sponte strike the twelve jurors for cause.\n\n5. Failure to sequester the jury\n\nDefendant claims error because the trial court did not sequester the jury. When trial began, defense counsel did not \"see any need for asking for sequestration of the jury.\" Nor did Defendant request sequestration during trial. Thus, we again review for fundamental error.\n\nSequestration is discretionary. Atwood, 171 Ariz. at 632, 832 P.2d at 649. Defendant does not allege juror misconduct. Accordingly, to prove error, Defendant must show, in addition to publicity, that the jurors did not follow the trial court's admonitions. Tison, 129 Ariz. at 551, 633 P.2d at 360.\n\nWhen trial began, the Judge admonished the jurors not to \"read, listen to, or observe\" any news reports of the trial. Nearly three weeks into trial, however, the court admonished the press by stating \"[o]ne of the jurors reports the jurors were recognizably seen in some footage that was aired.\" It may be that the juror saw the footage. It also may be that a friend or relative saw the footage and informed the juror. Because Defendant did not request that the juror be questioned, we do not know. Nor do we know the substance of the footage. We will not speculate; on the record before us, we find no error.\n\n6. Failure to have a juror drawn as an alternate\n\nDuring trial, witness Robert Emerick, an Arizona Department of Corrections counselor, stated in open court that he knew a juror. The court and defense counsel questioned that juror in open court, and the court found that the juror could continue to sit. Defendant later moved to have the juror drawn as an alternate. After finding that Mr. Emerick's testimony was unrebutted, that the juror disclosed his relationship with the witness in his jury questionnaire, and that the relationship would not influence the juror, the court denied the motion. This juror later became the jury foreman. Defendant appeals the denial of this motion.\n\nWe construe Defendant's motion as a challenge for cause. Ariz.R.Crim.P. 18.4(b). Such a challenge may be made after trial begins, provided the grounds for the challenge were not known earlier. Id.; see also Cook, 170 Ariz. at 53, 821 P.2d at 744. A ruling on a challenge for cause will be affirmed absent an abuse of discretion. Cook, 170 Ariz. at 54, 821 P.2d at 745.\n\nAlthough the juror's questionnaire disclosed that he knew many individuals (including law enforcement officers), it did not disclose his knowledge of Mr. Emerick. The court's error in finding that the juror made such a disclosure can be attributed, at least in part, to defense counsel's representation that the juror \"indicated on his original questionnaire that he did know Mr. Emerick.\" Although a juror's failure to disclose knowledge of a witness is a serious matter, it does not automatically require disqualification. See, e.g., State v. MacDonald, 110 Ariz. 152, 153-54, 515 P.2d 1172, 1173-74 (1973); State v. Garcia, 102 Ariz. 468, 469-71, 433 P.2d 18, 19-21 (1967); State v. Ortiz, 117 Ariz. 264, 267-68, 571 P.2d 1060, 1063-64 (Ct.App.1977). In deciding whether a juror may continue to sit in this situation, the court must consider the relationship between the witness and the juror, whether the juror will properly assess the testimony, the importance of the testimony, and whether the testimony is disputed. See MacDonald, 110 Ariz. at 153-54, 515 P.2d at 1173-74; Garcia, 102 Ariz. at 469-71, 433 P.2d at 19-21; Ortiz, 117 Ariz. at 267, 571 P.2d at 1063. The court must make a searching inquiry of the juror to apply these factors. MacDonald, 110 Ariz. at 154, 515 P.2d at 1174.\n\nDefense counsel conceded that the trial court conducted \"a rather in depth voir dire of the juror\" after the disclosure. Although friends in high school and for two years in college, the witness and the\n\njuror had not spent time together for at least five years before trial. The juror stated that he would assess Mr. Emerick's testimony as he would any other witness and that he had not discussed with Mr. Emerick anything relating to the case or Mr. Emerick's work. Although important, as the trial court found, Mr. Emerick's testimony was unrebutted and was not at the core of the State's case. In sum, although it would have been better to have selected the juror as an alternate, cf. Ariz. R.Crim.P. 18.5(h), on these facts, the court did not abuse its discretion in denying Defendant's motion, see MacDonald, 110 Ariz. at 154, 515 P.2d at 1174; Garcia, 102 Ariz. at 470-71, 433 P.2d at 20-21; Ortiz, 117 Ariz. at 268, 571 P.2d at 1064.\n\nB. Motion to exclude evidence of other crimes, wrongs, or acts\n\nDefendant moved to exclude evidence of his 1981 sexual assault and kidnapping convictions. Following a hearing, the court found the evidence admissible to show identity but not emotional propensity. The court admitted the evidence at trial, which consisted primarily of testimony by the victim of the 1981 incident, and gave a limiting jury instruction. Defendant appeals the denial of his motion.\n\nGenerally, evidence of other acts is inadmissible to prove the defendant's character. See State v. Roscoe, 145 Ariz. 212, 216, 700 P.2d 1312, 1316 (1984), cert. denied, 471 U.S. 1094, 105 S.Ct. 2169, 85 L.Ed.2d 525 (1985). Nor can such evidence be admitted \"to show action in conformity therewith.\" Ariz.R.Evid. 404(b). Other act evidence may be admissible, however, \"for other purposes, such as proof of . . . identity.\" Id.\n\nTo be admissible under the 404(b) identity exception, the state must show: (1) that the defendant committed the prior offense, and (2) that \"the prior offense was not too remote in time, was similar to the offense charged and was committed with a person similar to the prosecuting witness in the case being tried.\" Roscoe, 145 Ariz. at 217, 700 P.2d at 1317 (citing cases). Because the trial court is best able to evaluate these requirements and balance the probative value and prejudicial effect of such evidence, we review for an abuse of discretion. State v. Brown, 125 Ariz. 160, 161-62, 608 P.2d 299, 300-01 (1980).\n\nDefendant admits his 1981 sexual assault and kidnapping convictions. Accordingly, the first Roscoe requirement is satisfied. Although Defendant committed those offenses eight years before the victim's abduction, he served a seven-year sentence for the 1981 convictions. The instant crime occurred approximately one year after Defendant's release from prison. Thus, the prior offense was not too remote in time. See, e.g., Roscoe, 145 Ariz. at 217, 700 P.2d at 1317 (finding offense committed six months after release from serving six-month prison term not too remote); State v. Superior Court, 129 Ariz. 360, 361-62, 631 P.2d 142, 143-44 (Ct.App.1981) (finding offense committed eighteen months after release from serving twenty-seven month prison term not too remote).\n\nThe 1981 convictions and the 1988 abduction had numerous similarities, including:\n\n* both incidents occurred in the Sheep Hill area;\n\n* both incidents involved a vehicle;\n\n* both victims were Caucasian female minors;\n\n* both victims had their clothes removed;\n\n* both victims had their hands tied behind their backs;\n\n* both offenses occurred during daylight hours;\n\n* evidence of vodka consumption in both incidents; and\n\n* evidence of the use of a knife in both incidents.\n\nConcededly, differences between the crimes do exist. Defendant knew his 1981 victim, but apparently did not know the victim in this case. In addition, the 1981 incident involved a seventeen-year-old victim, while the victim in this case was nine years old. This difference, however, does not compel\n\nexclusion of the evidence. See Roscoe, 145 Ariz. at 218, 700 P.2d at 1318 (evidence properly admitted with seven-year-old victim when prior victim was seventeen years old).\n\n\"Absolute identity in every detail cannot be expected. Where an overwhelming number of significant similarities exist, the evidence of the prior act may be admitted.\" Roscoe, 145 Ariz. at 218, 700 P.2d at 1318. The term \"overwhelming\" does not require a mechanical count of the similarities but, rather, a qualitative evaluation. Are the two crimes so similar, unusual, and distinctive that the trial Judge could reasonably find that they bear the same signature? Id. at 217, 700 P.2d at 1317. If so, the evidence may be admissible and any dissimilarities go to its weight. Id. at 218, 700 P.2d at 1318.\n\nThe evidence in this case shows enough of an arguable \"signature\" to find that the trial Judge did not abuse his discretion in holding that the 1981 convictions were admissible to show identity under 404(b). Nor do we believe that the evidence was so unfairly prejudicial that trial court abused its discretion under Ariz.R.Evid. 403. See State v. Schurz, 176 Ariz. 46, 52, 859 P.2d 156, 162 (1993). Thus, we find no error in admitting evidence of Defendant's 1981 convictions.\n\nC. Admission of, and foundation for, DNA evidence\n\n1. The background of DNA testing\n\nArresting officers noticed blood on Defendant's shirt. During the next few months, Cellmark Diagnostic Laboratories, Inc. (\"Cellmark\") performed DNA testing on this blood as well as the victim's bone and muscle samples. Test results showed a match between the DNA in the blood on Defendant's shirt and the DNA in the victim's muscle sample. Further testing in 1990 showed that the DNA in the blood on the shirt did not match Defendant's DNA. The State moved for a Frye hearing to determine the admissibility of the DNA test results. See United States v. Frye, 293 F. 1013 (D.C.Cir.1923). After an extensive hearing, the trial court found that the DNA testing performed was generally accepted in the relevant scientific community and admitted the results at trial. Defendant challenges this finding.\n\nFor criminal cases, DNA testing is a very recent advent. In October 1988, an appellate court first considered the admissibility of DNA testing in the criminal context. See William C. Thompson \u0026 Simon Ford, DNA Typing: Acceptance and Weight of the New Genetic Identification Tests, 75 Va.L.Rev. 45, 46 n. 4 (1989) (\"Thompson \u0026 Ford, DNA Typing \") (citing Andrews v. State, 533 So.2d 841 (Fla.Ct.App.1988), review denied, 542 So.2d 1332 (Fla.1989)). In the years following Andrews, courts in more than forty states have considered DNA evidence in hundreds of cases. National Research Council, Summary, DNA Technology in Forensic Science 21-22 (1992) (\"NRC Summary, DNA Technology \").\n\nDNA contains the genetic code for all living organisms and is present in every cell containing a nucleus. Christopher G. Shank, Note, DNA Evidence in Criminal Trials: Modifying the Law's Approach to Protect the Accused from Prejudicial Genetic Evidence, 34 Ariz.L.Rev. 829, 829, 832 n. 27 (1992). DNA is composed of several component parts, including four different base pairs. See State v. Cauthron, 120 Wash.2d 879, 846 P.2d 502, 508 (1993). The precise sequence of these base pairs in certain DNA segments determines genetic traits. Id. The segments of DNA that determine these genetic traits are called alleles. State v. Pennell, 584 A.2d 513, 516 (Del.Sup.Ct.1989).\n\nThe basis for DNA identity testing is the well-accepted proposition that \"except for identical twins each individual has a unique overall genetic code.\" William C. Thompson \u0026 Simon Ford, DNA Testing: Debate Update, 28 Trial, Apr. 1992, at 52, 52 (\"Thompson \u0026 Ford, DNA Testing \"). Present technology, however, does not permit testing of the entire DNA sequence but only of discrete, very limited DNA segments. \"Because 99.9% of the DNA sequence in any two people is identical,\" D.H.\n\nKaye, The Admissibility of DNA Testing, 13 Cardozo L.Rev. 353, 354 (1991), accurate analysis is vital to determine whether there is a match of the remaining 0.1 percent of the DNA sequence from the samples compared.\n\nStated very simply,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e there are three general steps in DNA testing:\n\n1. Creating a DNA \"print\" or \"profile\" of a sample;\n\n2. Determining whether the prints or profiles of different samples match; and\n\n3. If samples match, computing the probability of a random match.\n\nNRC Summary, DNA Technology at 6, 8. Cellmark used restriction fragment length polymorphism (\"RFLP\") testing in this case.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Cellmark, Lifecodes Corporation, and the FBI are the three major laboratories currently performing RFLP DNA testing in the United States. Thompson \u0026 Ford, DNA Testing at 52. Testing protocols for these laboratories are not identical. NRC Summary, DNA Technology at 15; see also State v. Anderson, 853 P.2d 135, 142-43 (N.M.Ct.App.), cert. granted, 115 N.M. 145, 848 P.2d 531 (1993).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nDefendant does not challenge DNA testing in toto. Indeed, Defendant concedes general acceptance of the underlying theory of DNA testing and its research and diagnostic uses. Rather, Defendant makes three main challenges to the admission of the DNA test results in this case:\n\n1. The trial court erred by declining to determine before trial whether the tests were properly conducted and accurately recorded according to Cellmark's own protocol.\n\n2. There is no general acceptance in the relevant scientific community of the procedures used by Cellmark to declare a match.\n\n3. There is no general acceptance in the relevant scientific community of the procedures used by Cellmark to calculate the statistical probability of a random match and, thus, the court erred in admitting statistical probability opinion testimony.\n\nWe first turn to the question of what standard to apply in determining admissibility.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n2. The standard for admissibility of new scientific evidence\n\nBoth before and after the adoption of the Arizona Rules of Evidence, we have used the Frye test in determining whether to admit new scientific evidence. See, e.g., State v. Velasco, 165 Ariz. 480, 486, 799 P.2d 821, 827 (1990); State ex rel. Collins v. Superior Court, 132 Ariz. 180, 195-202, 644 P.2d 1266, 1281-88 (1982); State v. Valdez, 91 Ariz. 274, 277-80, 371 P.2d 894, 896-98 (1962). But see State v. Olivas, 77 Ariz. 118, 119, 267 P.2d 893, 894 (1954) (\"scientific disagreement [as to certain blood alcohol tests] affects only the weight and not the admissibility of evidence.\"). Frye helps us determine whether new scientific principles are ready for the courtroom and, conversely, whether the courtroom is ready for new scientific principles:\n\nJust when a scientific principle or discovery crosses the line between the experimental and demonstrable stages is difficult to define. Somewhere in this twilight zone the evidential force of the principle must be recognized, and while courts will go a long way in admitting expert testimony deduced from a well-recognized scientific principle or discovery, the thing from which the deduction is made must be sufficiently established to have gained general acceptance in the particular field in which it belongs.\n\nFrye, 293 F. at 1014. Under Frye, we conduct a de novo review to determine whether a scientific principle used as a basis for expert testimony is generally accepted in the relevant scientific community. See, e.g., People v. Barney, 8 Cal.App.4th 798, 10 Cal.Rptr.2d 731, 737 (1992); State v. Vandebogart, 616 A.2d 483, 491 (N.H. 1992); Cauthron, 846 P.2d at 505-06. The State argues that the Arizona Rules of Evidence effectively supersede the Frye test and asks that we reject Frye for a relevancy standard under Ariz.R.Evid. 401-03 and 702-06.\n\nIt is impossible for our system of Justice to ignore scientific and technological advances. Nevertheless, scientific evidence is \"a source of particular judicial caution.\" State v. Superior Court, 149 Ariz. 269, 276, 718 P.2d 171, 178 (1986). \"Because 'science' is often accepted in our society as synonymous with truth, there is a substantial risk of overweighting by the jury.\" Morris K. Udall, et al., Arizona Practice -- Law of Evidence § 102, at 212 (3d ed. 1991). Similarly, because neither Judge nor jury may be able to separate \"junk science\" from good science, Frye helps guarantee \"that reliability will be assessed by those in the best position to do so: members of the relevant scientific field who can dispassionately study and test the new theory.\" Superior Court, 149 Ariz. at 277, 718 P.2d at 179. Frye helps protect courts from unproven, and potentially erroneous and misleading, scientific theory \"until a pool of experts is available to evaluate it in court.\" 1 John W. Strong, et al., McCormick on Evidence § 203, at 873 (4th ed. 1992). Other benefits of Frye are uniformity of evidentiary rulings and avoiding complex evidentiary presentations in succeeding cases after a particular principle is judicially recognized. Id. When general acceptance is found, the scientific theory may be applied in other cases without further proof of acceptance.\n\nThe Frye test, however, has significant shortcomings. New discoveries are not immediately accepted in the scientific community. Rigid application of the general acceptance test would forbid judicial use of a new discovery even though there may be direct experimental or clinical support for the principle. Furthermore, history shows that generally accepted scientific theory is not always correct.\n\nDue in part to these concerns, a leading commentator writes that a \"drumbeat of criticism . . . provides the background music to the movement away from the general acceptance test.\" 1 McCormick on Evidence § 203, at 873. Although acknowledging Frye's worthwhile objectives, this commentator's further observations are worth repeating:\n\n[ Frye 's] objectives can be attained satisfactorily with less drastic constraints on the admissibility of scientific evidence. In particular, it has been suggested . . . that courts look directly to reliability or validity rather than to the extent of acceptance, . . . and that the traditional standards of relevancy and the need for expertise -- and nothing more -- should govern.\n\nThis traditional approach . . . permits general scientific opinion of both underlying principles and particular applications to be considered in evaluating the worth of the testimony . . . . Furthermore, unlike the general or the substantial acceptance standards, it is sensitive to the perceived degree of prejudice and unnecessary expense associated with the scientific technique in issue. Not every scrap of scientific evidence carries with it an aura of infallibility. Some methods, like bitemark identification and blood splatter analysis, are demonstrable in the courtroom. Where the methods involve principles and procedures that are comprehensible to a jury, the concerns over the evidence exerting undue influence and inducing a battle of the experts have less force. On the other hand, when the nature of the technique is more esoteric, as with some types of statistical analyses and serologic tests, or when the inferences from the scientific evidence sweep broadly or cut deeply into sensitive areas, a stronger showing of probative value should be required. . . . By attending to such considerations, the rigor of the requisite foundation can be adjusted to suit the nature of the evidence and the context in which it is offered.\n\n1 McCormick on Evidence § 203, at 873-76 (emphasis added and footnotes omitted); see generally Mark McCormick, Scientific Evidence: Defining a New Approach to Admissibility, 67 Iowa L.Rev. 879 (1982).\n\nFaced with similar arguments, the United States Supreme Court recently held that the Federal Rules of Evidence superseded Frye. See Daubert v. Merrell Dow Pharmaceuticals, Inc., U.S. , , 113 S.Ct. 2786, 2794, 125 L.Ed.2d 469 (1993). Daubert, however, did not open the courtroom door to all scientific evidence. The federal trial Judge still is the evidentiary gatekeeper. \"Proposed testimony must be supported by appropriate validation -- i.e., 'good grounds,' based on what is known. In short, the requirement that an expert's testimony pertain to 'scientific knowledge' establishes a standard of evidentiary reliability.\" Id. at , 113 S.Ct. at 2795. Noting that \"scientific validity for one purpose is not necessarily scientific validity for other, unrelated purposes,\" id., Daubert held that federal trial Judges must make \"a preliminary assessment of whether the reasoning or methodology underlying the testimony is scientifically valid and of whether that reasoning or methodology properly can be applied to the facts in issue,\" id. at , 113 S.Ct. at 2796. The Court then made some \"general observations,\" offering several factors bearing on that inquiry. Id. at - , 113 S.Ct. at 2796-98.\n\nDaubert 's general observations, for the most part, correspond with the factors discussed above in the quotation from McCormick on Evidence. Both provide persuasive reasons for rejecting or modifying Frye when applying the Arizona Rules of Evidence, which in relevant part are identical to the federal rules. The federal rules, however, are \"legislatively-enacted\"\n\nand interpreted by the United States Supreme Court \"as [it] would any statute.\" Daubert, U.S. at , 113 S.Ct. at 2793. Our rules, on the other hand, are court-enacted. See Ariz. Const. art. VI, § 5(5); Ariz.R.Sup.Ct. 28. While the United States Supreme Court considers congressional purpose, this court -- when construing a rule we have adopted -- must rely on text and our own intent in adopting or amending the rule in the first instance. See Ritchie v. Grand Canyon Scenic Rides, 165 Ariz. 460, 464-68, 799 P.2d 801, 805-09 (1990). Furthermore, we are not bound by the United States Supreme Court's non-constitutional construction of the Federal Rules of Evidence when we construe the Arizona Rules of Evidence.\n\nFinally, Daubert itself does not establish a regime based solely on the qualification of experts and relevance. See Fed.R.Evid. 702. The Daubert analysis includes a reliability requirement for \"[p]ertinent evidence based on scientifically valid principles.\" Daubert, U.S. at , 113 S.Ct. at 2799. The nature of this requirement is currently unknown, may vary from case to case, and is to be fashioned by trial Judges using an analytical framework as yet unspecified. In application, Daubert leaves many questions unanswered. See id. at , 113 S.Ct. at 2800 (Rehnquist, C.J., Concurring in part and Dissenting in part).\n\nWe conclude, therefore, that notwithstanding legitimate criticism of Frye, and our desire to preserve uniformity when possible, this is not the case to determine whether Arizona should follow Daubert. Although the argument has been raised by the State, it has not been extensively briefed or argued. More important, however, even were we to use Daubert 's reliability/scientific validity analysis, we would still be left with the problem posed by Frye: precisely when \"in [the] twilight zone the evidential force of the [scientific] principle must be recognized.\" Frye, 293 F. at 1014. Whether the Frye or Daubert standard is used, that line is hard to draw for DNA testing, a subject that fuels even greater scientific ferment and controversy than the legal controversy engendered by Frye.\n\nThe science in question makes line-drawing in this case particularly difficult. Not only are we in a complex scientific field, but the technology is still evolving. Furthermore, this is not an area in which the jury can easily penetrate the aura of infallibility, nor one in which the principles are easily demonstrable in the courtroom. See 1 McCormick on Evidence § 205, at 897-900. The trial testimony shows it is an area in which the scientists themselves have yet to settle on uniform testing techniques or protocols. Finally, as we discuss more fully below, see infra § C(5), the science in this area can have a direct and forceful dispositive effect. As one court put it, DNA testing \"is precisely the sort of scientific evidence which requires application of the Frye test.\" Fishback v. People, 851 P.2d 884, 890 (Colo.1993).\n\nIn short, the difficulties of addressing the technology used in this case may well promote an evidentiary rule not suitable for many other types of cases. The field of DNA testing is probably the worst subject to use to decide whether or how to refine, replace, or abolish Frye. Nor, as will be seen, is there a need to do so in this case. Thus, for the present at least, we resolve this case without significant change in existing evidentiary law. We leave Daubert for another day and, in accordance with Arizona precedent -- old and new -- apply Frye as we turn to Defendant's arguments.\n\n3. The scope of the Frye hearing and the foundation for DNA testing\n\nIf Frye is satisfied, scientific evidence is admissible \"subject to a foundational showing.\" State ex rel. Collins, 132 Ariz. at 196, 644 P.2d at 1282; see also NRC Summary, DNA Technology at 23 (\"The adequacy of the method used to acquire and analyze samples in a given case bears on the admissibility of the evidence and should, unless stipulated by opposing parties, be adjudicated case by case.\"). In this case, this foundational showing was made in the jury's presence at trial, and the court ruled that a proper foundation had been\n\nmade. Claiming this was error, Defendant argues that the foundational showing should have been made at the Frye hearing rather than in front of the jury.\n\nCase law is split on this issue. See People v. Castro, 144 Misc.2d 956, 545 N.Y.S.2d 985, 987 (Sup.Ct.1989) (citing authority). Some courts require an initial foundational showing outside of the presence of the jury and, if adequate, repeat that showing before the jury. Id. Other courts allow the foundational showing to be made solely before the jury. Id.\n\nThe foundation needed when Frye is satisfied relates to the expert's qualifications, proper application of testing techniques, and accurate recording of test results. See State ex rel. Collins, 132 Ariz. at 196, 644 P.2d at 1282. If the foundational showing is made in the jury's presence, and if the showing is inadequate, \"aside from valuable trial time wasted, the jury would be exposed to prejudicial proofs and left to speculate as to why the defendant opposed the ultimate result.\" United States v. Two Bulls, 918 F.2d 56, 60 (8th Cir.1990), vacated on other grounds, 925 F.2d 1127 (8th Cir.1991) (en banc). Mistrial or reversible error could occur if an inadequate foundational showing was made before the jury. Simply put, in a rare case -- where the scientific principle and necessary foundational showing are highly controversial and hotly contested -- allowing the foundational showing to be made in front of the jury means that the trial court works without a net.\n\nThe trial court, however, has discretion in deciding whether a foundational showing is to be made outside the jury's presence. See Ariz.R.Evid. 103(c), 104(c). Although acknowledging the potential for reversible error in using such a procedure, we hold that the trial court is not required to hold a foundational hearing outside the jury's presence. Furthermore, in this case the court did not err by allowing the foundation to be made before the jury.\n\nAt trial, the State made a proper foundational showing (as opposed to, and distinct from, the Frye finding discussed below) for the performance of the DNA testing. The laboratory personnel had adequate qualifications, the test used was that described by the Cellmark testing protocol, and the results were properly recorded. Although Defendant surmises that samples might have been switched, he cites to no compelling evidence supporting this hypothesis, and we have found none. Thus, in this case, no error resulted from allowing the foundational showing to be made in the presence of the jury. Therefore, we move to the substantive Frye issue.\n\n4. Is there general acceptance in the relevant scientific community of Cellmark's techniques and standards used to declare a match?\n\nA final product of DNA testing of a sample is an x-ray film called an autoradiograph or autorad. Cauthron, 846 P.2d at 509. An autorad contains several bands and looks like a bar code with the bands representing different polymorphic DNA segments. Id. at 509-10. To determine whether two samples match, Cellmark first visually compares the samples' banding patterns. If they visually match, Cellmark measures and compares the banding patterns of the two samples. A match is declared if each band varies in position less than one or two millimeters from the corresponding band in the other sample. In this case, all bands in the declared matches varied less than plus or minus one millimeter. Unlike Cellmark, after finding a visual match, the FBI and Lifecodes use a standard deviation or percent variation analysis to determine whether samples match. Defendant claims that Cellmark's match standard is not generally accepted in the relevant scientific community.\n\nThe accuracy of a match declaration is very important. A declared match means that the samples could have come from the same individual. Conversely, if samples do not match, they must have come from different individuals. See infra note 20. At least initially, declaring any match involves some subjectivity. Indeed, one court has stated that mere visual comparisons\n\nmight be generally accepted even without objective verification. See Perry v. State, 606 So.2d 224, 225 (Ala.Ct.Crim.App.1992). Cellmark's match criteria have objective verification, and other courts have found that these criteria comply with Frye. See Barney, 10 Cal.Rptr.2d at 738-40; People v. Axell, 235 Cal.App.3d 836, 1 Cal.Rptr.2d 411, 425-29 (1991); Fishback, 851 P.2d at 892-93; Pennell, 584 A.2d at 517-19; Polk v. State, 612 So.2d 381, 391-93 (Miss.1992); State v. Pierce, 64 Ohio St.3d 490, 597 N.E.2d 107, 113-14 (1992); see also Caldwell v. State, 260 Ga. 278, 393 S.E.2d 436, 443 (1990) (visual match, coupled with band shift test, admissible).\n\nDefendant advances no good argument that these cases were wrong when decided or that, because of scientific development, their analysis is now obsolete. Furthermore, our own independent research reveals no significant scientific controversy over Cellmark's method of declaring a match. Thus, we hold that Cellmark's match criteria are generally accepted in the relevant scientific community and comply with Frye.\n\n5. Population genetics -- general acceptance of Cellmark's statistical probability calculation of a random match\n\na. Background\n\nCellmark's Lisa Forman, Ph.D., testified that, given a match of the autorads from the blood on Defendant's shirt and the victim's tissue, the probability of a random match ranged from one in fourteen billion to, more conservatively, one in sixty million. The State tacitly attempted to argue that these probability figures could be equated with the probability that someone other than Defendant committed the crime.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Defendant contends that the court erred in admitting the Cellmark statistical probability evidence because it is not generally accepted by population geneticists -- the relevant scientific community.\n\nb. Calculating the random match probability\n\nAbsent laboratory error, a declared match means that only one of the following is true: (1) the samples came from the same individual; (2) the samples came from identical twins;\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e or (3) the samples came from different individuals but, by pure chance, the DNA segments examined match (although comparison of the entire DNA sequence from each individual would not match). It is the probability favoring a random match (the third of these three alternatives) that provides the telling and crucial bottom line of DNA evidence.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nCellmark uses the \"product rule\" -- sometimes called the \"multiplication rule\" -- to make its random match determination. This rule is described as follows:\n\nSuppose, for example, that a pair of DNA [samples] match on two bands, and that one band reflects an allele found in ten percent of the population and the\n\nother an allele found in fifty percent of the population. Applying the product rule, an analyst would conclude that the probability of a coincidental match on both alleles is 0.10 X 0.50 = 0.05, or a five percent probability.\n\nThompson \u0026 Ford, DNA Typing, 75 Va. L.Rev. at 81-82.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The 0.05 result in this example means that there was a one in twenty probability of a random match (leaving a nineteen in twenty chance that the samples came from the same person). The validity, and corresponding accuracy, of the product rule depends on the presence, or absence, of several factors.\n\nAs applied to this case, the individual frequencies -- the necessary components of the product rule (the 0.10 and 0.50 in the example quoted above) -- come from, and are based on frequencies in, Cellmark's database. That database apparently bases these frequencies on samples obtained from blood banks as well as paternity and forensic cases. See Pennell, 584 A.2d at 520. These frequency figures -- vital components of the product rule -- are valid and accurate only if they come from a truly random sample, and the database for the frequency figures must be large enough to be statistically significant. Cauthron, 846 P.2d at 513.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The nature of the product rule indicates that any errors, or shortcomings, in the database may have a profound and significant impact on the random match calculations. See Thompson \u0026 Ford, DNA Typing, 75 Va.L.Rev. at 81-82.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe product rule also is based on the assumption that each band on the autorad represents a DNA segment that is independent of the other bands on the autorad. For this assumption to be valid, the DNA segments tested must be in linkage equilibrium -- i.e. \"the probability of a match on each band is unaffected by the occurrence of a match on any other band.\" Id. at 81.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e If this assumption of independence is not correct, the results of the product rule may be incorrect by a substantial margin.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nA third relevant assumption upon which the product rule is based is a truly random mating population (where mating is random and the gene pool is evenly intermixed).\n\nCauthron, 846 P.2d at 514. Stated very simply, a large, randomly mating population, at least within a generation, is in Hardy-Weinberg equilibrium. See Thompson \u0026 Ford, DNA Typing, 75 Va.L.Rev. at 85. As with the other assumptions, if there is no Hardy-Weinberg equilibrium, the product rule results may be incorrect by a substantial margin. See id.\n\nc. Legal analysis\n\nDefense expert Lawrence Mueller, Ph.D., testified that Cellmark's statistical probability calculations were not generally accepted in the relevant scientific community. State expert Dr. Forman conceded that the 1988 Caucasian database used by Cellmark in this case was not in Hardy -- Weinberg equilibrium. But see Reporter's Transcript, Mar. 21, 1990, at 5 (contrary testimony by Daniel Garner, Ph.D.). The State argues, however, that Cellmark's calculations resulted in conservative probability figures and were properly admitted. We cannot agree.\n\nThe admissibility of DNA testing in criminal matters has been litigated for several years. \"The statistical calculation dispute, however, has not been judicially examined until quite recently.\" Barney, 10 Cal. Rptr.2d at 743. Many courts have questioned the propriety of DNA statistical probability calculations. See, e.g., Caldwell, 393 S.E.2d at 443; State v. Houser, 241 Neb. 525, 490 N.W.2d 168, 183-84 (1992); People v. Mohit, 153 Misc.2d 22, 579 N.Y.S.2d 990, 998 (Sup.Ct.1992). Although courts have found DNA testing admissible -- explicitly, or more frequently implicitly, finding the probability calculations acceptable -- three factors make most of these cases distinguishable.\n\nFirst, in many early cases, the defendant did not challenge the prosecution's evidence. Second, many cases used an admissibility standard less rigorous than Frye and arguably less rigorous than Daubert, basing admissibility on the qualification of experts and relevance. See Anderson, 853 P.2d at 142 (discussing so-called \"relevancy approach\" for determining admissibility of scientific evidence).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Third, many cases address probability calculations from laboratories other than Cellmark. These laboratories use different databases than Cellmark and, accordingly, these cases may be distinguished. See Anderson, 853 P.2d at 142. Notwithstanding the few remaining cases finding probability statistics admissible, recent developments -- scientific and judicial -- drastically alter the relevant analysis.\n\nWithin the last two years, controversy \"has erupted in the scientific community concerning the reliability of DNA evidence.\" People v. Atoigue, 1992 WL 245628, at *4 (D.Guam App.Div. Sept. 11, 1992) (emphasis added). A December 1991 edition of Science, a respected scientific journal with articles subject to peer review, contained two articles stating radically conflicting views of statistical probability calculations. Compare R.C. Lewontin \u0026 Daniel L. Hartl, Population Genetics in Forensic DNA Typing, 254 Science 1745, 1750 (Dec. 20, 1991) (calculations for \"the probability of a matching DNA profile . . . are unjustified and generally unreliable \") (emphasis added) with Ranajit Chakraborty \u0026 Kenneth K. Kidd, The Utility of DNA Typing in Forensic Work, 254 Science 1735, 1739 (Dec. 20, 1991) (method of calculating the probability of a matching DNA profile \"does not require 'fixing' for it to be used in courts\").\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e A companion article\n\nexclaims that a \"bitter debate is raging\" about the courtroom use of DNA testing. See generally Leslie Roberts, Fight Erupts Over DNA Fingerprinting, 254 Science 1721 (Dec. 20, 1991). This companion article describes Lewontin and Hartl as \"two of the leading lights of population genetics\" and discusses the pressure brought -- by scientists and prosecutors -- to include the Chakraborty/Kidd article in response to the Lewontin/Hartl article. Id.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e \"These two articles seem likely to reinforce the notion that the [scientific] community is indeed divided.\" Id. at 1721, 1723.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe impact of these articles is best demonstrated by California cases. The California Court of Appeal, in October 1991, rejected a challenge to Cellmark's probability calculations. See Axell, 1 Cal.Rptr.2d at 426-31. The December 1991 Science articles, however, changed this analysis. Just a few months later, the California Court of Appeal said:\n\nWhatever the merits of the prior decisions on the statistical calculation process -- including Axell -- the debate that erupted in Science in December 1991 changes the scientific landscape considerably, and demonstrates indisputably that there is no general acceptance of the current process. It has become irrelevant how Axell addressed this issue at the time of the decision's filing in October 1991.\n\nBarney, 10 Cal.Rptr.2d at 744; see also People v. Wallace, 14 Cal.App.4th 651, 17 Cal.Rptr.2d 721, 726-27 (1993) (following Barney). In Barney, the California Court of Appeal expressly rejected its own precedent and held that the probability analysis, and as a result all DNA identification testimony, was inadmissible. Barney, 10 Cal.Rptr.2d at 745. The California Supreme Court denied review, id. at 731, but expressly authorized publication of the Barney court's DNA Discussion, id. at 731 \u0026 n. *.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nOther recent cases confirm this lack of general acceptance of Cellmark's statistical probability calculations in the relevant scientific community of population geneticists. See, e.g., Atoigue, 1992 WL 245628, at *4; Commonwealth v. Lanigan, 413 Mass. 154, 596 N.E.2d 311, 316 (1992); Commonwealth v. Curnin, 409 Mass. 218, 565 N.E.2d 440, 444-45 (1991); State v. Schwartz, 447 N.W.2d 422, 428-29 (Minn. 1989); Vandebogart, 616 A.2d at 493-94; Cauthron, 846 P.2d at 514-17.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e After reviewing these decisions, as well as recent scientific literature, we agree that the Cellmark method of deriving the random match probability figures is not generally accepted in the relevant scientific community. For Frye purposes, these probability calculations are flawed in three ways: (1) they are impermissibly based on the disputed assumption of linkage equilibrium; (2) the database relied on is of disputed statistical\n\nvalidity; and (3) the database relied on is not in Hardy-Weinberg equilibrium.\n\nGiven this Conclusion, the application of the product rule and the resulting opinion of the odds against a random match were not derived by applying generally accepted scientific theory.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e We conclude, therefore, that the court erred\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e in admitting the probability testimony based on the product rule calculations. This finding requires us to address one more issue regarding DNA.\n\n6. The effect of the lack of general acceptance of the statistical probability of a random match\n\nAs the Barney court asked, \"must the absence of general scientific acceptance as\n\nto the current statistical calculation aspect of DNA analysis result in total exclusion of DNA evidence?\" Barney, 10 Cal.Rptr.2d at 744. Barney stated that, without a determination of the random match probability, a declared match \"means nothing.\" Id. at 742. Other courts have agreed. \"Without the probability assessment, the jury does not know what to make of the fact that the patterns match: the jury does not know whether the [matching] patterns are as common as pictures with two eyes, or as unique as the Mona Lisa.\" United States v. Yee, 134 F.R.D. 161, 181 (N.D.Ohio 1991), quoted in Anderson, 853 P.2d at 146-47; accord Atoigue, 1992 WL 245628, at *3; see also NRC Summary, DNA Technology at 9. Under ordinary evidentiary principles, these courts conclude that a lack of general acceptance of the random match calculations precludes admission of any DNA evidence.\n\nCauthron went even further. Rather than merely finding that testimony of a match without evidence of the probability of a random match was not helpful to the jury, that court also held that such testimony did not meet the Frye test. \"Testimony of a match in DNA samples, without the statistical background or probability estimates, is neither based on generally accepted scientific theory nor helpful to the trier of fact.\" Cauthron, 846 P.2d at 516. Thus, Cauthron found that ordinary evidentiary principles as well as Frye require that a lack of general acceptance for the random match calculations precludes admission of any DNA evidence.\n\nA different judicial approach is to \"uncouple\" evidence of a match from the random match probability calculations. For example, the court in Pennell found Cellmark's DNA testing and resulting match evidence generally accepted and admissible. Pennell, 584 A.2d at 522. The statistical probability evidence, however, was inadmissible because the state \"failed to demonstrate a degree of reliability necessary to admit such statistical probabilities.\" Id. Thus, the jury could hear evidence of the nature of DNA and that a match had been declared, but could not hear evidence of the random match probability. Id. Another approach is to allow expert testimony regarding frequency but not product rule expert testimony. See State v. Johnson, 498 N.W.2d 10, 14-15 (Minn.1993) (affirming expert testimony that the alleles tested were present in from three to twenty-seven percent of the samples in the FBI's database; the prosecutor's expert properly \"was not allowed to draw any Conclusions from such statistics, nor was he even allowed to speculate [by applying the product rule]\").\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nWe acknowledge these different approaches to the issue. We also acknowledge that, in this case, the testimony of a match -- independent of the probability testimony -- unquestionably has relevance to establish one fact: that the blood on Defendant's shirt could have come from the victim (but not that it necessarily and conclusively did come from the victim). This proposition, coupled with general acceptance of the underlying theory of DNA testing, may mean that evidence of a match, accompanied by evidence that a match means that it is possible or probable that the two samples came from the same individual, could be admissible. We need not and do not decide the propriety of such trial strategy because it is not before us. We cannot foresee what explanatory evidence might be available to militate in favor of admissibility of the match evidence independent of the probability calculations. Accordingly, we neither accept nor reject any of the positions taken by other courts on this point. The trial court admitted evidence as to both the declared match and the random match probabilities. We simply hold that statistical evidence of the random match probabilities was inadmissible and, thus, should not have been admitted. We go no further. Thus, we must now determine the effect of the error in admitting such evidence.\n\n7. Was the error in admitting the DNA probability calculations harmless?\n\nWhen an issue is raised but erroneously ruled on by the trial court, this court reviews for harmless error. See State v. McVay, 127 Ariz. 450, 453, 622 P.2d 9, 12 (1980). Absent \"structural defects,\" Arizona v. Fulminante, 499 U.S. 279, , 111 S.Ct. 1246, 1265, 113 L.Ed.2d 302 (1991), and other matters not subject to harmless error analysis, we use one test to determine whether error is harmless in criminal cases, State v. White, 168 Ariz. 500, 508, 815 P.2d 869, 877 (1991), cert. denied, U.S. , 112 S.Ct. 1199, 117 L.Ed.2d 439 (1992); State v. Lundstrom, 161 Ariz. 141, 150 n. 11, 776 P.2d 1067, 1076 n. 11 (1989); State v. Thomas, 133 Ariz. 533, 538, 652 P.2d 1380, 1385 (1982). Error, be it constitutional or otherwise, is harmless if we can say, beyond a reasonable doubt, that the error did not contribute to or affect the verdict. Lundstrom, 161 Ariz. at 150 \u0026 n. 11, 776 P.2d at 1076 \u0026 n. 11. \"The inquiry . . . is not whether, in a trial that occurred without the error, a guilty verdict would surely have been rendered, but whether the guilty verdict actually rendered in this trial was surely unattributable to the error.\" Sullivan v. Louisiana, U.S. , , 113 S.Ct. 2078, 2081, 124 L.Ed.2d 182 (1993); accord McVay, 127 Ariz. at 453, 622 P.2d at 14. We must be confident beyond a reasonable doubt that the error had no influence on the jury's judgment.\n\nThere is no bright line statement of what is and what is not harmless error. See Bush v. State, 19 Ariz. 195, 204, 168 P. 508, 512 (1917); see also Jack B. Weinstein \u0026 Margaret A. Berger, 1 Weinstein's Evidence para. 103[06], at 103-70 to 81 (1992) (listing factors courts examine in determining whether error was harmless). The State has the burden of convincing us that error is harmless, Chapman v. California, 386 U.S. 18, 24-26, 87 S.Ct. 824, 828-29, 17 L.Ed.2d 705 (1967), and we consider the error in light of all of the evidence, White, 168 Ariz. at 508, 815 P.2d at 877. Due to this case-specific factual inquiry, an error may be harmless in one case but require reversal in another. With these stringent concepts in mind, we assess the record evidence in light of the erroneous admission of the DNA probability calculations.\n\nWe first note that Defendant challenged the improperly admitted probability evidence at trial. The jury was not left with the impression that the probability calculations were acknowledged as reliable by all scientists. The issue was hard fought. Defense expert Dr. Mueller explained in detail to the jury the lack of Hardy-Weinberg equilibrium, linkage disequilibrium, the possible unreliability of the database, and the consequent misleading end result of the product rule. Dr. Mueller is as well-credentialed and as prominent as Dr. Forman, the prosecution's expert, who presented the opposite view. It is, of course, impossible to know what the jury made of all this, and we assume, as we must, that the jury gave credence to the prosecutor's evidence. Suffice it to say, however, that the picture presented to the jury did not have the aura of infallibility surrounding an unchallenged scientific theory. Rather, the picture portrayed a hotly disputed scientific controversy.\n\nIf the evidence against Defendant had been closely balanced, strong, or even very strong, we think it would be impossible to say beyond a reasonable doubt that the inadmissible DNA evidence did not affect the verdict. Evidence of odds even as \"low\" as one in sixty million that the blood on Defendant's shirt was not the victim's blood is, to say the least, powerful. Factually, however, this is a very unusual case. Given the testimony describing the dispute over the DNA evidence, that evidence was far from the most telling part of the State's case. The other evidence points with unerring consistency to one inarguable Conclusion: that Defendant killed the victim.\n\nBefore Defendant's arrest, the victim's mother described a vehicle matching the GMC that Defendant was driving and placed it where the victim was last seen alive. Her description of the driver was consistent with Defendant. Defendant admitted stealing the GMC before the abduction\n\nand was seen driving the vehicle both before and after the abduction. During the relevant time period, no one but Defendant was seen driving the vehicle.\n\nMany items connect Defendant and that GMC to the location where the body was found. The rubber bands in the GMC were the same as dozens of rubber bands found in the brush covering the body, near the victim's clothing, and in a tree containing the victim's panties. Before it was stolen, the GMC contained rubber band bags, a rubber band bag was found close to the victim's body, and no rubber band bags were found in the GMC after Defendant's arrest. Investigators found two empty Suntory vodka mini-bottles on Sheep Hill and a twenty mini-bottle container of Suntory vodka, with two bottles missing, in the GMC. The loose packets of hot chocolate in the GMC matched the empty ten-packet box found near the victim's body.\n\nThe three pieces of metal from the GMC's steering column -- one in the GMC, one where the GMC had been parked, and one near the body -- fit together like a jigsaw puzzle. A cigar found beside the body matched a cigar in the GMC. Both cigars had similar breaks and were from the same tobacco lot. Tobacco residue from Defendant's shirt was consistent with these cigars.\n\nNear the body, investigators found a pubic-type hair similar to Defendant's public hair samples. Hair on Defendant's jacket was similar to the victim's, and hair similar to Defendant's was on the victim's T-shirt and the sheet used to wrap the body. Dozens of hairs matching the victim's were located in the GMC, and investigators found hair similar to the victim's on a blanket in the vehicle. When arrested, Defendant possessed knives that, during testing, replicated cuts on the hair found near the body.\n\nFibers near the body were similar to fibers from the seat covers of the GMC, Defendant's jacket, and a blanket found in the GMC. A fiber on the shoelace used to tie the victim's hands was similar to fibers from Defendant's jacket. The blood spatter pattern on Defendant's shirt was consistent with beating force, and investigators found blood-matted grass near the body. Traditional blood testing, unchallenged on appeal, showed that the blood on Defendant's shirt was PGM 2 subtype -- the same subtype as the victim's blood. Less than three percent of the population has PGM 2 subtype, and Defendant could not be the source of this blood.\n\nIn sum, the properly admitted evidence in this case goes far beyond overwhelming evidence of guilt. It is not only inconsistent with any reasonable hypothesis of innocence, it refutes any hypothesis other than Defendant's guilt. It is simply inconceivable that anyone other than the person who had the GMC perpetrated the crime. Nothing else explains the rubber bands, rubber band bag, vodka bottles, hot chocolate packets and container, cigars, and metal pieces from the steering column. There is no question that Defendant possessed the vehicle and no evidence that anyone else possessed the GMC during the relevant time period. Even if one were inclined to speculate about who controlled the vehicle, there is the evidence -- fibers, hair, blood, and knives -- tying Defendant to the vehicle, to the victim, to the crime scene, and to the crime. Defendant advances no theory of how all this could be explained unless Defendant, and only Defendant, committed the crime.\n\nGiven this unequivocal evidence, independent of the hotly contested DNA probability evidence, we find beyond a reasonable doubt that the erroneous admission of the DNA evidence could have had \"no influence on the verdict of [this] jury.\" McVay, 127 Ariz. at 453, 622 P.2d at 14. Other courts have reached similar Conclusions with weaker, or at least comparably strong, evidence of guilt independent of the erroneous admission of DNA evidence. See, e.g., Barney, 10 Cal.Rptr.2d at 747-48 (upholding conviction where defendant's wallet found on bloodstained couch in victim's home, defendant's fingerprint found in room of victim's home, and non-DNA blood testing linked defendant to crime scene); State v. Nielsen, 467 N.W.2d 615, 619 (Minn.1991) (victim last seen alive with defendant,\n\nblood matching victim's found on defendant's shirt, untypable human blood found in defendant's car, defendant's blood type matched semen found on victim's body, defendant had black eye day after murder, and defendant left the area when told that the police were looking for him); cf. Wallace, 17 Cal.Rptr.2d at 726-27 (following Barney and upholding conviction where crimes were distinctive, one victim identified defendant, circumstantial evidence connected defendant to crimes, traditional blood typing eliminated all but two or three percent of the population, and defendant admitted committing offenses to fiancee); Atoigue, 1992 WL 245628, at *4 (upholding conviction where victim identified defendant). But see Houser, 490 N.W.2d at 184 (\"Reception of the DNA evidence cannot be said to be harmless error.\") (citing cases).\n\nAgain, we emphasize that we do not, and cannot, find harmless error based on our idea of guilt or innocence or whether there is sufficient proper evidence to convict. See, e.g., Sullivan, U.S. at - , 113 S.Ct. at 2081-82; McVay, 127 Ariz. at 453, 622 P.2d at 12. We cannot and do not speculate as to what a reasonable jury would have done. See Sullivan, U.S. at - , 113 S.Ct. at 2081-82. We are convinced beyond a reasonable doubt, however, that the guilty verdict in this case was unaffected by the improper admission of the DNA evidence. Thus, because the State has carried its heavy burden, we hold that the error in admitting the probability evidence was harmless.\n\n8. Summary regarding DNA evidence\n\nTo summarize, we hold that the principles and theory underlying DNA testing and Cellmark's match criteria are generally accepted in the relevant scientific community. General acceptance regarding these matters permits judicial notice of DNA theory and the techniques -- at least insofar as Cellmark is concerned -- for ascertaining and declaring a match. From this point foward, Arizona trial courts no longer need to hold Frye hearings regarding the general acceptance of DNA theory, the principles underlying DNA testing, or the Cellmark match criteria. We emphasize, however, what this means and what it does not mean. If testing shows that samples do not match, then the Conclusion is that they are from different individuals. If testing shows that the samples do match, the Conclusion is that they may be from the same individual.\n\nWe conclude that there is no general acceptance in the relevant scientific community for Cellmark's random match probability calculations. Because these calculations do not meet the Frye test, they are inadmissible. We reserve and expressly do not decide whether the inadmissibility of the random match probability calculations means that other DNA evidence, such as evidence of a match, is inadmissible. Finally, on the unique facts of this case, we hold that the admission of the inadmissible DNA probability evidence was harmless error.\n\nWe take a cautious, conservative approach. Not knowing what records in other cases will show, what issues those cases will raise, or what new technology will bring, we neither write in stone nor go farther than we must. For the moment, and at least with respect to DNA evidence, we leave Frye untouched. We make no final judgment on how far, if at all, the court may go in allowing a party to inform the jury about the declaration of a match and its meaning in any specific case. We hold only that statistical probability evidence based on Cellmark's database is not based on generally accepted scientific theory and is not admissible.\n\nD. Right to assistance of counsel at critical stages\n\n1. Right to counsel at the hearing on Defendant's motion to continue\n\nOn the eve of trial, Defendant filed a pro se motion to continue, alleging ineffective assistance of counsel. Although the trial court was not required to consider this pro se motion of a defendant represented by counsel, it did. At the hearing, Defendant called his attorneys as witnesses. He did not request additional counsel\n\nto represent him during the hearing and none was appointed. The trial court denied the motion. Relying on an alternative holding by the majority in United States v. Wadsworth, 830 F.2d 1500, 1510 (9th Cir. 1987) (2-1 decision), Defendant argues that he was denied his right to assistance of counsel.\n\nWadsworth is inapposite. In Wadsworth, at a hearing on a motion to change counsel, defense counsel took a position adverse to the defendant. In the present case, Defendant -- represented by counsel -- filed a pro se motion that the court actually considered. At the hearing on that motion, Mr. Phillips, one of Defendant's attorneys, appeared, represented Defendant's interests, protected Defendant's rights, and took no position adverse to Defendant. Thus, we find no error. See United States v. Weaver, 882 F.2d 1128, 1143 n. 9 (7th Cir.), cert. denied, 493 U.S. 968, 110 S.Ct. 415, 107 L.Ed.2d 380 (1989).\n\n2. Defendant's motion to substitute counsel\n\nClaiming a lack of trust and confidence, Defendant moved pro se to remove his lead attorney, making several claims of that attorney's purported inaction. The trial court denied the motion. On appeal, Defendant claims the denial was error.\n\nAlthough an indigent criminal defendant has a Sixth Amendment right to competent counsel, this right does not include counsel of choice. See State v. LaGrand, 152 Ariz. 483, 486, 733 P.2d 1066, 1069. Nor does this right guarantee a \"'meaningful relationship' between an accused and his counsel.\" Morris v. Slappy, 461 U.S. 1, 14, 103 S.Ct. 1610, 1617, 75 L.Ed.2d 610 (1983). Although irreconcilable conflict is not permitted, conflict between counsel and a criminal defendant is but one factor a court should consider in deciding whether to substitute counsel. See LaGrand, 152 Ariz. at 486-87, 733 P.2d at 1069-70. A mere allegation of lost confidence in counsel does not require appointing substitute counsel. See State v. Crane, 166 Ariz. 3, 11, 799 P.2d 1380, 1388 (Ct.App.1990). We review the trial court's decision for an abuse of discretion. LaGrand, 152 Ariz. at 487, 733 P.2d at 1070.\n\nThe record reveals disagreement among the defense team, particularly regarding whether to file a special action on the DNA issues. Defendant and his lead attorney also disagreed on some defense strategy. The trial court, however, found that virtually none of the relevant allegations in Defendant's pro se motion were supported. The record does not demonstrate an irreconcilable conflict between Defendant and his attorneys. As the trial court correctly summarized:\n\nWhat this all boils down to is that there is some disagreement as to tactics and strategy among the defendant and the investigator and counsel, maybe even some feelings of not getting along so well together.\n\nI look strictly at whether the defendant will have adequate representation of counsel in this case. My finding is that he will.\n\nThus, the record shows that the trial court did not abuse its discretion in denying Defendant's motion. LaGrand, 152 Ariz. at 487, 733 P.2d at 1070.\n\nE. Evidence of flight and concealment\n\nDefendant moved to preclude evidence of his flight and concealment immediately before his arrest. Following a hearing on the matter, the court denied the motion, admitted the evidence, and instructed the jury:\n\nRunning away or hiding after a crime has been committed does not itself prove guilt. You may consider any evidence of the defendant's running away or hiding, together with all the other evidence.\n\nConcealing evidence after a crime has been committed does not itself prove guilt. You may consider any evidence of the defendant's concealment of evidence, together with all the other evidence.\n\nDefendant argues that the evidence did not raise a reasonable inference of a consciousness of guilt of kidnapping, murder, or molestation, was unduly prejudicial, and that the jury instructions were erroneous.\n\nEvidence of flight from, or concealment of, a crime usually constitutes an admission by conduct. State v. Edwards, 136 Ariz. 177, 184, 665 P.2d 59, 66 (1983). Within reason, the fact that flight or concealment is remote in time from the crime goes to the weight, not the admissibility, of the evidence. See State v. Reid, 114 Ariz. 16, 30, 559 P.2d 136, 150 (1976), cert. denied, 431 U.S. 921, 97 S.Ct. 2191, 53 L.Ed.2d 234 (1977). To be admissible, however, \"there must be evidence of flight from which can be inferred a consciousness of guilt for the crime charged.\" Edwards, 136 Ariz. at 184, 665 P.2d at 66 (emphasis added). Merely because a defendant is wanted on another charge, however, does not make evidence of flight per se inadmissible. See State v. Jeffers, 135 Ariz. 404, 415, 661 P.2d 1105, 1116, cert. denied, 464 U.S. 865, 104 S.Ct. 199, 78 L.Ed.2d 174 (1983). Again, we review this evidentiary issue for an abuse of discretion. See State v. Robinson, 165 Ariz. 51, 56, 796 P.2d 853, 858 (1990), cert. denied, 498 U.S. 1110, 111 S.Ct. 1025, 112 L.Ed.2d 1107 (1991).\n\nDefendant was driving a stolen vehicle at the time of his flight and was wanted for stealing the GMC and for numerous other offenses. His knowledge of these then-pending charges is uncertain. As his attorney stated, because Defendant did not testify at the hearing, \"we will never know what was in Mr. Bible's mind at the time he fled.\"\n\nDefendant's flight and concealment showed substantial anxiety over apprehension (high speed chase, running from the vehicle when cornered, and camouflaging himself on a ledge with leaves). Nevertheless, approximately an hour after his arrest, Defendant confessed to stealing the GMC. These circumstances, including this prompt confession to the theft of the vehicle, could justify an inference that Defendant was fleeing from some other, more serious crime. See Edwards, 136 Ariz. at 184, 665 P.2d at 66; Tison, 129 Ariz. at 539-40, 633 P.2d at 348-49. In addition, because the evidence of the crimes charged in this case necessarily included the theft of the GMC, Defendant did not need to offer new, potentially damning evidence of the GMC's theft to argue that he was fleeing only from a theft charge and not from kidnapping, molestation, and murder charges. See State v. Hunter, 136 Ariz. 45, 49, 664 P.2d 195, 199 (1983) (quoting 2 J. Wigmore, Evidence in Trials at Common Law § 276, at 129-30 (J. Chadbourn rev. 1979)). Thus, under the facts of this case, we cannot say that the court abused its discretion in admitting the flight and concealment evidence. See Edwards, 136 Ariz. at 184, 665 P.2d at 66; Jeffers, 135 Ariz. at 415, 661 P.2d at 1116; Tison, 129 Ariz. at 539-40, 633 P.2d at 348-49; Ariz. R.Evid. 403. Nor can we say that the jury instruction constituted fundamental error. See Gendron, 168 Ariz. at 155, 812 P.2d at 628; Hunter, 142 Ariz. at 90, 688 P.2d at 982.\n\nF. Testimony about Defendant's prior statements\n\nDefendant unsuccessfully moved to exclude statements he made while incarcerated in 1984 or 1985 to Arizona Department of Corrections counselor robert Emerick. When asked whether Defendant showed any remorse for the 1981 sexual assault, Mr. Emerick stated \"[t]he only remorse that [Defendant] ever conveyed was that he had been caught and that there was somebody who was left behind to report him.\" When asked what specific language Defendant used, Mr. Emerick stated:\n\nTo the best of my recollection, we had [Defendant] roleplaying or giving us an account of how he had controlled his cousin, and he had described having a knife to her and then he described, 'I'll never make this mistake again,' and his pupils in his eyes were about this big around.\n\nI can just remember thinking, this, this man is very dangerous.\n\nMr. Emerick testified that interpreting Defendant's statement as showing remorse for the assault \"would have been completely out of character with all the other things [Defendant] had presented in group.\" During cross-examination, Mr. Emerick stated that he had worked with sex offenders\n\nfor nine years and could \"only recall people who have left memorable impressions about their sex deviance patterns, on about three people, Ricky Bible being one of them.\" The court admitted this testimony to show premeditation under Ariz. R.Evid. 803(3). Defendant argues that the statements were irrelevant, improper hearsay, and unduly prejudicial.\n\nIn this court, the State argues a theory of admissibility not pressed in the trial court. The State contends that the statements are not hearsay and were admissible under Ariz.R.Evid. 801(d)(2) We examine the propriety of admitting the evidence under Rule 803(3) -- the ground of admission advanced by the State and accepted by the trial court. We therefore assume -- as did the trial court and the proponent of the evidence -- that the statements were hearsay. But see Ariz.R.Evid. 801(d)(2).\n\nHearsay may be admissible if it is a \"statement of the declarant's then existing state of mind . . . (such as intent, plan, motive, design, mental feeling).\" Ariz. R.Evid. 803(3). An essential element of the murder charge was that Defendant committed the act with premeditation. See A.R.S. § 13-1105(A). Although Defendant's statements could be interpreted in more than one manner, they could reasonably be interpreted to mean that if Defendant again committed a sex crime, he would not leave the victim alive to testify against him. This tends to show Defendant's state of mind and is relevant to show both premeditation and motive to kill. See State v. Dickey, 125 Ariz. 163, 167, 608 P.2d 302, 306 (1980); State v. Mincey, 130 Ariz. 389, 404-05, 636 P.2d 637, 652-53 (1981), cert. denied, 455 U.S. 1003, 102 S.Ct. 1638, 71 L.Ed.2d 871 (1982); State v. Saiz, 103 Ariz. 567, 568-69, 447 P.2d 541, 542-42 (1968).\n\nContrary to Defendant's arguments, the statements did not have to refer to a specific victim and, within reason, temporal remoteness goes to weight, not admissibility. See Mincey, 130 Ariz. at 404-05, 636 P.2d at 652-53; State v. Moore, 111 Ariz. 355, 356, 529 P.2d 1172, 1173 (1974).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Although the statements are susceptible to varying interpretations, it was for the jury to decide their precise meaning in light of the circumstances and context. The court could have properly concluded that these statements fall within the hearsay exception of Ariz.R.Evid. 803(3).\n\nWhen the issue of undue prejudice is raised, we review determinations under Ariz.R.Evid. 403 for an abuse of discretion. See State v. Taylor, 169 Ariz. 121, 126, 817 P.2d 488, 493 (1991). The record indicates that the statements were made three or four years before the victim's abduction. This time lag and the fact that the statements were made about a broad group and were interpreted by Mr. Emerick all indicate that the statements' probative value was not overwhelming. The testimony also had the very real potential to be used improperly by the jury as character evidence. Ariz.R.Evid. 404(b). On the other hand, the State had available, but did not introduce, more explicit and damaging testimony from other individuals who heard Defendant make similar statements closer to the time of the victim's abduction. In sum, we cannot state that the court abused its discretion by finding that the probative value of the statements was not \"substantially outweighed by the danger of unfair prejudice.\" Ariz.R.Evid. 403. Thus, the court did not abuse its discretion in admitting Mr. Emerick's testimony.\n\nG. Destruction of evidence\n\nIn testing the blood found on Defendant's shirt, the State used approximately seventy percent of the available\n\nsample. Defendant moved to preclude the test results, claiming that the testing destroyed the usable sample and therefore violated his due process rights under the United States and Arizona Constitutions. Defendant claims that the court erred in denying this motion.\n\nUnder the United States Constitution, \"unless a criminal defendant can show bad faith on the part of the police, failure to preserve potentially useful evidence does not constitute a denial of due process of law.\" Arizona v. Youngblood, 488 U.S. 51, 58, 109 S.Ct. 333, 337, 102 L.Ed.2d 281 (1988). This court similarly construed the Arizona Constitution's due process clause. See State v. Youngblood, 173 Ariz. 502, 507-08, 844 P.2d 1152, 1157-58 (1993).\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Assuming that the blood found on Defendant's shirt was not preserved,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Defendant does not allege bad faith by the State -- a necessary element of a due process claim following the destruction of such evidence. See Youngblood, 488 U.S. at 58, 109 S.Ct. at 337; Youngblood, 173 Ariz. at 507-08, 844 P.2d at 1157-58. Indeed, the trial court found that \"a good faith effort . . . was made to take only so much as was needed for the State's tests and to try to leave something for the defendant.\" Furthermore, the fact that the State uses evidence that has been consumed through testing is not dispositive. See, e.g., United States v. Castro, 887 F.2d 988, 999 (9th Cir.1989); State v. Pearson, 234 Kan. 906, 678 P.2d 605, 615 (Kan.1984); John P. Ludington, Annotation, Consumption or Destruction of Physical Evidence Due to Testing or Analysis by Prosecution's Expert as Warranting Suppression of Evidence or Dismissal of Case Against Accused in State Court, 40 A.L.R.4th 594 § 5 (1985 \u0026 1992 Supp.). Thus, we reject Defendant's claim.\n\nH. The trial court's alleged bias\n\nDefendant argues that the trial Judge improperly expressed dislike for his attorneys. Defendant cites to instances where the Judge interrupted defense counsel's questioning or sua sponte objected to trial questioning.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Ultimately, Defendant objected to these interjections, requesting that future objections by the trial Judge be addressed at side bar and \"that the Court, absent an objection from the State, not interrupt my examination.\" The trial Judge responded that:\n\nI shall continue to control the proceedings in this court. Some other body will have to decide whether my actions are reasonable or not. I will not be intimidated by this presentation.\n\nIf you ask the same question over and over, I will stop it, and if you can't keep track of where you are in your questions, I will, and apparently you have learned nothing by this experience.\n\nIf you want to find fault with what I do as it occurs, you will have to take appropriate action on the spot.\n\nDefendant argues that the trial Judge's actions were improper and violated his due process rights.\n\nA trial Judge must control the courtroom to help ensure a fair trial. Ariz.R.Evid. 611. Trial Judges \"are not referees at prize-fights but functionaries of Justice.\" Johnson v. United States, 333 U.S. 46, 54, 68 S.Ct. 391, 395, 92 L.Ed. 468 (1948). Judges must be impartial, State v. Carver, 160 Ariz. 167, 172, 771 P.2d 1382, 1387 (1989), and avoid any appearance of partiality, State v. Brown, 124 Ariz. 97, 100, 602 P.2d 478, 481 (1979). A trial Judge also must refrain from taking any action calculated to influence the jury or likely to prejudice the defendant. See State v. Williams, 113 Ariz. 14, 16, 545 P.2d 938, 940 (1976).\n\nThere is no indication that the trial Judge's statements were either designed to prejudice or likely to do so. Many of the Judge's statements were calculated to prevent repetitive, irrelevant, or argumentative questioning. The trial Judge has discretion to do this even when the opponent does not object. See Ariz.R.Evid. 611; see also Johnson, 333 U.S. at 54, 68 S.Ct. at 395. Within reason, a Judge does not display bias or cause prejudice when acting sua sponte to control the courtroom and the trial. See Williams, 113 Ariz. at 16, 545 P.2d at 940.\n\nThe only troublesome point is a statement the trial Judge made to the attorney outside the presence of the jury while addressing a motion to continue. The Judge described another case in which that attorney had been denied a continuance and was forced to interview witnesses during recesses. The Judge then stated, \"I can tell you the Judges of this court thought that would teach you a lesson.\" Contrary to this statement, deciding whether to grant a continuance involves \"the interests of Justice.\" Ariz.R.Crim.P. 8.5(b). The stakes are high in criminal cases, and critical decisions should not rest, in whole or in part, on an attempt to somehow teach an attorney a lesson.\n\nThis statement, however, was made outside the presence of the jury and could not have prejudiced Defendant. Williams, 113 Ariz. at 16, 545 P.2d at 940. Furthermore, the record shows that the interjections made by the trial Judge in the jury's presence did not unfairly prejudice Defendant. See United States v. Eldred, 588 F.2d 746, 749-51 (9th Cir.1978); Williams, 113 Ariz. at 15-16, 545 P.2d at 939-40. Thus, we find no error.\n\nI. The child molestation conviction and the weight of the evidence\n\n1. Motion for judgment of acquittal\n\nDefendant claims that the trial court should have granted his motion for acquittal on the child molestation count made at the close of the State's case. He argues that the evidence on this count was inadequate to support all elements of the offense. See A.R.S. § 13-1410 (1989); State v. Noble, 152 Ariz. 284, 286, 731 P.2d 1228, 1230 (1987); State v. Roberts, 126 Ariz. 92, 95, 612 P.2d 1055, 1058 (1980). If reasonable minds could differ as to whether the properly admitted evidence, and the inferences therefrom, prove all elements of the offense, a motion for acquittal should not be granted. State v. Mathers, 165 Ariz. 64, 67, 796 P.2d 866, 869 (1990); Ariz.R.Crim.P. 20(a). We conduct a de novo review of the trial court's decision, viewing the evidence in a light most favorable to sustaining the verdict. State v. Landrigan, 176 Ariz. 1, 4, 859 P.2d 111, 114 (1993).\n\nViewing the evidence in that light, the facts are: the victim was nine years old and was abducted; her hands were bound, her clothes removed, her panties hung on a tree limb, and her body left nude; a pubic type hair similar to Defendant's was found near the body in a clump of hair that appeared to have been cut with Defendant's knife; and Defendant was not wearing underwear when arrested hours after the abduction. Although an autopsy revealed no sperm or semen, this was of little evidentiary value due to decomposition. The pathologist who performed the autopsy testified that the victim's \"body was completely unclothed, completely naked, and . . . her hands were bound . . . and I think that those two findings certainly would be\n\nindicative of some type of sexual molestation.\" While this is not expert evidence, or if objected to necessarily admissible as lay opinion, it states the common sense Conclusion that the evidence permits an inference of molestation. See Bond v. State, 273 Ind. 233, 403 N.E.2d 812, 817-18 (Ind.1980); see also People v. Enoch, 122 Ill.2d 176, 119 Ill.Dec. 265, 276, 522 N.E.2d 1124, 1135 (1988), cert. denied, 488 U.S. 917, 109 S.Ct. 274, 102 L.Ed.2d 263 (1988); Hines v. State, 58 Md.App. 637, 473 A.2d 1335, 1348-49 (1984), cert. denied, 300 Md. 794, 481 A.2d 239 (1984).\n\nOther evidence links Defendant to the victim and to the crime scene. From the evidence presented, the jury could infer that Defendant had the requisite state of mind. See Noble, 152 Ariz. at 286, 731 P.2d at 1230; Roberts, 126 Ariz. at 95, 612 P.2d at 1058. Although contrary inferences are possible, a reasonable jury could have concluded beyond a reasonable doubt that Defendant molested the victim. Indeed, this is the most logical explanation for the crime. There is substantial evidence to warrant conviction; nothing more is required. See Landrigan, 176 Ariz. at 4, 859 P.2d at 114. The trial court properly denied the motion for acquittal.\n\n2. Motion for new trial\n\nA new trial may be granted when \"[t]he verdict is contrary to . . . the weight of the evidence.\" Ariz.R.Crim.P. 24.1(c)(1). Defendant argues that the evidence does not support the molestation conviction and that the trial court abused its discretion in denying his motion for new trial. As noted above, there is substantial evidence to warrant conviction of child molestation. The trial Judge did not abuse his discretion in denying the motion for new trial. Landrigan, 176 Ariz. at 4, 859 P.2d at 114. Thus, we find no error.\n\nJ. Statements by the victim's mother\n\nThe trial court excluded the testimony of the victim's mother regarding her pre- and post-hypnotic description of the vehicles and drivers she saw the morning of the abduction. The court, however, allowed police officers and the victim's father to testify as to her pre-hypnotic statements. Defendant argues that the victim's mother became unavailable when the State failed to hypnotize her according to the requirements of State ex rel. Collins, 132 Ariz. at 210-11, 644 P.2d at 1296-97. Implicitly conceding that her pre-hypnotic statements were admissible under Ariz.R.Evid. 803(2), Defendant claims a denial of his Sixth Amendment right to confront the victim's mother.\n\nWhen hearsay testimony comes \"within a firmly rooted exception to the hearsay rule, the Confrontation Clause is satisfied.\" White v. Illinois, U.S. , , 112 S.Ct. 736, 743, 116 L.Ed.2d 848 (1992). Distraught and fearful because her daughter was missing, the victim's mother described the vehicles and their drivers to law enforcement officers shortly after she observed the passing vehicles. By so doing, she attempted to assist the officers in finding her daughter; she had every motive to be accurate and tell the truth and none at all to fabricate or alter her description. Clearly the victim's mother was speaking in a state of excitement likely to ensure spontaneity. Ariz.R.Evid. 803(2). Because the challenged testimony fit within the excited utterance hearsay exception, id., Defendant's confrontation rights were not violated. See, e.g., White, U.S. at - , 112 S.Ct. at 741-44; Arizona v. Lengyel, U.S. , 112 S.Ct. 960, 117 L.Ed.2d 127 (1992) (remanding for further consideration in light of White); Ohio v. Roberts, 448 U.S. 56, 65-66, 100 S.Ct. 2531, 2538-39, 65 L.Ed.2d 597 (1980); State v. Yslas, 139 Ariz. 60, 65, 676 P.2d 1118, 1123 (1984).\n\nK. Dog tracking testimony\n\nJames Weeks testified regarding the actions of his tracking dog, Bo, in searching for the victim and Defendant. He first scented Bo to search for the victim near the area where her bicycle was located. Later that day, Bo was used to track Defendant. Mr. Weeks testified that he scented the dog in the GMC when searching for Defendant.\n\nI brought [Bo] up to the [GMC] on the driver's side where the door was open. I immediately jumped my dog onto the floorboard of the driver's side and immediately he went to the, through the two seats in the front into the back seat. At this time I jerked my dog out of the back seat on the lead. I put him on the front seat, the driver's side. I made him sit. I scented him, told him to scent, and told him to find.\n\nThe prosecutor then asked whether Bo, when used to track Defendant, was tracking the victim's or Defendant's scent (implying that the dog may have smelled the victim's scent on Defendant). Mr. Weeks answered that there was a \"doubt in my mind that he was working either particular one at that time.\" Defendant argues that this testimony was irrelevant, that there was no proper foundation for the question, and that the testimony was unfairly prejudicial. Defense counsel did not make any relevancy objection or motion to strike at trial. Thus, absent fundamental error, this issue is precluded. Gendron, 168 Ariz. at 154-55, 812 P.2d at 627-28.\n\nThe question is relevant because it seeks testimony tending to connect Defendant with the victim. The answer may have had minimal relevancy, but even if it did not, we find no fundamental error. Defendant has not shown that the foundation for the tracking evidence was inadequate under Roscoe, 145 Ariz. at 220-21, 700 P.2d at 1320-21. Indeed, Mr. Weeks testified to the Roscoe foundational requirements without objection.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Nor do we see how Mr. Weeks' answer was unfairly prejudicial in light of the following unobjected-to foundational exchange:\n\nQ. [L]et's assume that your dog is scented to find one person and you are off searching for that person but that person is never found, in other words, your search is interrupted before the person is found. He's borrowed and then rescented on a new person. Does that cause a problem with the dog?\n\nA. Possibly there could be a problem of knowing which scent that he's actually following, yes, there could be, as far as knowing exactly which scent trial that he is following.\n\nThus, we reject Defendant's claims.\n\nL. Outburst by the victim's father\n\nDuring testimony about Defendant's 1981 sexual assault and kidnapping convictions, the victim's father ran out of the courtroom and, once outside, yelled \"[t]hat fucking asshole.\" The Judge, in front of the jury, stated:\n\nI think the record should reflect at this point that [the victim's father] went out of the courtroom obviously disturbed and yelled an obscenity which I'm sure the jury heard, as I did. I think it might be well to remind the jury what you are told at the beginning of the case . . . which is that you are not to base your decision in this case on emotion or prejudice or sympathy, . . . but to base it on the facts. You notice we don't tell you not to have emotion or not to have sympathy, just that you don't base your decision on that. You base it on the facts that are presented in court, so please disregard the outburst. I'm sure we can understand the feelings that were being vented, but that's not the way that decisions are made.\n\nAs an additional remedial measure, the trial court excluded the victim's father from the courtroom for the remainder of the trial.\n\nDefense counsel moved for a mistrial, arguing that the outburst \"completely undermined whatever defense that we had.\" The trial court denied the motion:\n\nI don't think it's really the substance for a mistrial. I don't think there is any doubt in the jury's mind about how [the\n\nvictim's father] feels about Mr. Bible. That's certainly been clear for days.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e It's just the venting of that in an inappropriate way that I think troubles us.\n\nI don't think the jury is going to make its decision based on what he said. I think they will base it on the evidence.\n\nDefendant argues that the trial court erred in denying his motion for mistrial.\n\nWhen a motion for mistrial is based on evidentiary concerns, we review for an abuse of discretion. Koch, 138 Ariz. at 101, 673 P.2d at 299 (citing cases). This deferential standard of review applies because the trial Judge is in the best position to evaluate \"the atmosphere of the trial, the manner in which the objectionable statement was made, and the possible effect it had on the jury and the trial.\" Id. (citing cases).\n\nThe cases relied on by Defendant are inapposite. In State v. Gallagher, 97 Ariz. 1, 396 P.2d 241 (1964), disapproved on other grounds by State v. Greenawalt, 128 Ariz. 388, 395, 626 P.2d 118, 125, cert. denied, 454 U.S. 848, 102 S.Ct. 167, 70 L.Ed.2d 136 (1981), we reversed a murder conviction on grounds independent of a spectator's \"hostile views.\" Gallagher, 97 Ariz. at 8, 396 P.2d at 245-46. In Taylor v. State, 55 Ariz. 29, 97 P.2d 927 (1940), serious prosecutorial misconduct may or may not have required reversal but, when coupled with the audience's applause after the prosecutor's closing argument, reversal was required. Id. at 40, 97 P.2d at 932. In this case, we are presented with a serious but isolated incident by a murder victim's father.\n\nThe court did not exclude the victim's father before the outburst, and the record suggests that some outburst may have been anticipated. Defendant, however, did not object to the presence of the victim's father during trial. Indeed, in a pretrial Discussion addressing the issue, trial counsel noted that the victim's father had \"become a little unglued\" in pretrial proceedings but that he had \"no problem\" with the victim's father remaining in the courtroom after he testified.\n\nSo far as this record shows, the victim's father had taken no action at trial warranting reprimand or comment prior to his outburst. The substance of his comment and its context make clear that strong emotion prompted the outburst. No information was conveyed other than the father's animosity toward Defendant, a feeling that could hardly have surprised the jurors. In light of the nature of the outburst, the prompt instruction given the jury, and the exclusion of the victim's father from the remainder of trial, we do not believe that the trial court abused its discretion in denying the motion for mistrial. See Messer v. Kemp, 760 F.2d 1080, 1086-88 (11th Cir. 1985) (affirming denial of mistrial after victim's father lunged at and threatened defendant, when jury admonished, jurors polled as to impact of incident, and outburst not calculated to influence jury), cert. denied, 474 U.S. 1088, 106 S.Ct. 864, 88 L.Ed.2d 902 (1986); see generally Jay M. Zitter, Annotation, Emotional Manifestations by Victim or Family of Victim During Criminal Trial as Ground for Reversal, New Trial, or Mistrial, 31 A.L.R.4th 229 (1984); Jay M. Zitter, Annotation, Disruptive Conduct of Spectators in Presence of Jury During Criminal Trial as Basis For Reversal, New Trial, or Mistrial, 29 A.L.R.4th 659 (1984).\n\nM. Fundamental error claims\n\nDefendant claims that the trial court committed several fundamental errors. As noted more fully above, see supra § A(3)(e), fundamental error is error that deprived a defendant of a fair trial. Hunter, 142 Ariz. at 90, 688 P.2d at 982. The doctrine applies in \"extremely limited circumstances\" where the error was \"clear, egregious, and curable only via a new trial.\" Gendron, 168 Ariz. at 155, 812 P.2d at 628.\n\n1. Evidence obtained from the seizure of Defendant's clothing\n\nDefendant argues that it was fundamental error to admit evidence obtained from\n\nclothing taken from him when arrested. Defendant does not argue that he was improperly arrested or that the State could not take his clothes during his incarceration. Rather, Defendant argues that the State improperly tested his clothes without a warrant in violation of his Fourth Amendment rights.\n\nGenerally, a warrant is required before a valid search or seizure can occur. See Katz v. United States, 389 U.S. 347, 356-57, 88 S.Ct. 507, 514, 19 L.Ed.2d 576 (1967); see also Ariz. Const. art. II, § 8. There are, of course, various exceptions to this rule. One exception is a search incident to a valid arrest. See generally United States v. Edwards, 415 U.S. 800, 94 S.Ct. 1234, 39 L.Ed.2d 771 (1974). In this case, the clothing was not seized as evidence of the crime for which Defendant was first jailed, and the testing was performed without probable cause days after seizure of the items. Thus, Edwards is at least factually distinguishable.\n\nArizona, however, is among the majority of courts finding that this type of warrantless seizure does not violate a defendant's Fourth Amendment rights. See 2 Wayne R. LaFave, Search and Seizure: A Treatise on the Fourth Amendment § 5.3(b), at 494 n. 79 (2d ed. 1987 \u0026 1993 Supp.) (citing cases). In the present case, the authorities merely tested that which had properly come into their possession. See, e.g., United States v. Johnson, 820 F.2d 1065, 1067-68, 1071-72 (9th Cir.1987) (currency properly admitted in bank robbery prosecution when defendant already in police custody on unrelated charge before becoming a suspect in bank robbery); State v. Carriger, 123 Ariz. 335, 338, 599 P.2d 788, 791 (1979) (keys properly admitted in robbery and murder case when removed from police property locked for testing, without a warrant, three months after arrest), cert. denied, 444 U.S. 1049, 100 S.Ct. 741, 62 L.Ed.2d 736 (1980); State v. Gonzales, 111 Ariz. 38, 44, 523 P.2d 66, 72 (1974) (clothing properly admitted in murder and rape case when defendant already in police custody on unrelated charge). There was no error in admitting the evidence and its fruits, and thus there can be no fundamental error.\n\n2. Blood stain evidence\n\nDefendant argues that it was fundamental error to admit testimony about human blood stains found on his pants and boots. Specifically, Defendant claims that he was not linked to these stains on the day of the victim's abduction. In making his argument, Defendant relies on distinguishable cases.\n\nIn State v. Routhier, 137 Ariz. 90, 98-99, 669 P.2d 68, 76-77 (1983), cert. denied, 464 U.S. 1073, 104 S.Ct. 985, 79 L.Ed.2d 221 (1984), for example, it was error to admit a bloody shirt found near the victim's body. No testimony linked that defendant to the shirt and, accordingly, lack of relevancy precluded admission. Id. at 99, 669 P.2d at 77. In this case, however, Defendant was wearing the pants and boots when apprehended hours after the victim's abduction. Similarly, the closeness in time between the abduction and Defendant's arrest raises an inference that he wore this clothing at the time the victim was killed. Thus, the evidence was relevant and admissible; there was no error and can be no fundamental error. For similar reasons, we also reject Defendant's argument that the court erred in admitting evidence of blood stains in and under the GMC because they could not be positively identified as human blood. See Carriger, 123 Ariz. at 339, 599 P.2d at 792.\n\n3. Child molestation jury instruction\n\nThe instruction given on the child molestation count reads as follows:\n\nThe crime of molestation of a child requires proof that the defendant knowingly touched directly or indirectly the private parts of a child under the age of 15 years, or caused a child under the age of 15 years to touch directly or indirectly the private parts of the defendant.\n\nDefendant claims that this instruction erroneously omitted a requirement that the act be motivated by an unnatural or abnormal sexual interest or intent. Defendant argues\n\nthat this is a necessary element of the offense. Without again addressing the issue, we will assume that it is. See In re Pima County Juvenile Appeal No. 74802-2, 164 Ariz. 25, 33, 790 P.2d 723, 731 (1990). But cf. In re Maricopa County Juvenile Action No. JV-121430, 172 Ariz. 604, 606-07, 838 P.2d 1365, 1367-68 (Ct.App.1992). Because Defendant did not object at trial, we must decide whether this omission was fundamental error.\n\n\"The failure to instruct on a necessary element of an offense is not fundamental error where there is no issue as to that element.\" State v. Avila, 147 Ariz. 330, 338, 710 P.2d 440, 448 (1985). Initially, we note that the asserted trial defense in this case did not raise the motivation issue. Although Defendant pleaded not guilty -- thus requiring the State to prove every element of the charge -- his defense at trial was that he did not commit the physical act charged. Defendant did not assert that his motivation for committing the act was natural and normal or that the act was somehow privileged.\n\nThe facts of this case -- both those found by the jury and those undisputed in the record -- show that Defendant's motivation was not in question. The guilty verdict on the kidnapping charge necessarily means that the jury found beyond a reasonable doubt that Defendant knowingly restrained the victim. The undisputed facts show that she was restrained by force -- her hands were bound. As to the molestation charge, considering the instruction given, the guilty verdict necessarily means that the jury found beyond a reasonable doubt that Defendant knowingly had sexual contact with the nine-year-old victim. Defendant was approximately twenty-six years old at the time. The age difference, the bound hands, the panties hung on a tree limb, and the nude body belie any suggestion that Defendant was motivated by anything other than an unnatural or abnormal sexual interest with respect to children. Cases with facts less compelling support this Conclusion.\n\nIn State v. Roberts, 126 Ariz. 92, 612 P.2d 1055 (1980), the defendant challenged the sufficiency of the evidence for his child molestation conviction. Testimony in that case showed that the defendant moved his hands inside the diaper of a seven-year-old emotionally and physically retarded girl. Id. at 93, 612 P.2d at 1056. We affirmed the conviction, stating that \"[t]hese acts, by their very nature, manifest that defendant was motivated by an unnatural or abnormal sexual interest or intent with respect to children.\" Id. at 95, 612 P.2d at 1058 (emphasis added); see also State v. Brooks, 120 Ariz. 458, 461, 586 P.2d 1270, 1273 (1978) (finding acts \"by their very nature manifest\" the required motivation); State v. Johnson, 120 Ariz. 21, 22, 583 P.2d 1341, 1342 (1978) (same). In light of Defendant's trial strategy, the facts necessarily found by the jury, and the undisputed facts of record, this case law amply demonstrates that the omission in the jury instruction was not fundamental error in this case. See Cook, 170 Ariz. at 50, 821 P.2d at 741.\n\nN. Prosecutorial misconduct\n\nDefendant claims that prosecutorial misconduct deprived him of his due process rights. Prosecutorial misconduct does not require reversal \"unless the defendant has been denied a fair trial as a result of the actions of counsel.\" State v. Dumaine, 162 Ariz. 392, 400, 783 P.2d 1184, 1192 (1989) (citing State v. Hallman, 137 Ariz. 31, 37, 668 P.2d 874, 880 (1983)); accord Darden v. Wainwright, 477 U.S. 168, 181, 106 S.Ct. 2464, 2471, 91 L.Ed.2d 144 (1986).\n\n[The prosecutor] is the representative not of an ordinary party to a controversy, but of a sovereignty whose obligation to govern impartially is as compelling as its obligation to govern at all; and whose interest, therefore, in a criminal prosecution is not that it shall win a case, but that Justice shall be done. . . . [W]hile he may strike hard blows, he is not at liberty to strike foul ones. It is as much his duty to refrain from improper methods calculated to produce a wrongful conviction as it is to use every legitimate means to bring about a just one.\n\nBerger v. United States, 295 U.S. 78, 88, 55 S.Ct. 629, 633, 79 L.Ed. 1314 (1935); accord Pool v. Superior Court, 139 Ariz. 98, 103, 677 P.2d 261, 266 (1984). With this standard in mind, because no objection was made, we again review for fundamental error.\n\n1. Comments about the jury questionnaire\n\nDuring voir dire, the prosecutor stated that some of the questions in the questionnaire \"may seem a little silly to you, and some of them are silly, as a matter of fact, but please be very honest when you fill out this form.\" Defense counsel told the venire that he wrote the questionnaire and took exception to its characterization as silly. While the prosecutor's comment was inappropriate, we believe that it falls far short of actionable misconduct. Furthermore, the trial court told the venire:\n\nI have gone through all of these proposed questions and approved them, so they are approved questions by the Court. Don't worry about what the attorneys think about them. I have approved them and they should all be answered by you truthfully.\n\nWe find no error and, accordingly, no fundamental error.\n\n2. Vouching for witnesses\n\nIt is black letter law that it is improper for a prosecutor to vouch for a witness. Dumaine, 162 Ariz. at 401, 783 P.2d at 1193.\n\nTwo forms of impermissible prosecutorial vouching exist: (1) when the prosecutor places the prestige of the government behind its witness, and (2) where the prosecutor suggests that information not presented to the jury supports the witness's testimony. In addition, a lawyer is prohibited from asserting personal knowledge of facts in issue before the tribunal unless he testifies as a witness.\n\nId. (citation omitted). The prosecutor in this case made the following declaration in opening statement:\n\nI promise you that I'm gonna be honest with you, that the witnesses that I call, there is a reason for them to be here. They have something important to tell you. I'm not gonna waste your time. If there is [sic] two or three people that did the same thing in this case, you will probably only hear from one of them. It's gonna be a straightforward, no nonsense case.\n\nBut as you know, we wouldn't be here unless what I'm about to tell you really happened.\n\nThis statement clearly includes both forms of improper vouching. Dumaine, 162 Ariz. at 401, 783 P.2d at 1193. If Defendant had objected, the court should have sustained the objection and instructed the jury to disregard the remark. Such judicial action would have been appropriate even absent an objection. Cf. Johnson, 333 U.S. at 54, 68 S.Ct. at 395. There was no objection, however, and we again review for fundamental error.\n\nIn determining whether a prosecutor's improper statement constitutes fundamental error, we examine, under the circumstances, whether the jurors were probably influenced and whether the statement probably denied Defendant a fair trial. See, e.g., Atwood, 171 Ariz. at 611, 832 P.2d at 628; Dumaine, 162 Ariz. at 401, 783 P.2d at 1193; Valdez, 160 Ariz. at 15, 770 P.2d at 319. The focus is on the fairness of the trial, not the culpability of the prosecutor. Atwood, 171 Ariz. at 608, 832 P.2d at 625; Valdez, 160 Ariz. at 15, 770 P.2d at 319. Given the entire record, we do not believe that the statement tipped the scales of Justice and denied Defendant a fair trial. Thus, the prosecutor's statement, although highly improper, did not constitute fundamental error in this case.\n\n3. Speculation that the victim was tortured\n\nIn opening statement, the prosecutor suggested that the victim was \"perhaps tortured.\" In closing argument, the prosecutor stated that, after the victim's hands were tied, she may have been \"forced into some sort of torment.\" Defendant claims\n\nthat these statements were unsupported by evidence and thus improper.\n\nThe comment during opening statement that the victim was \"perhaps tortured\" was improper. Opening statement is counsel's opportunity to tell the jury what evidence they intend to introduce. See Charles M. Smith, Arizona Practice -- Civil Trial Practice § 455, at 395 (1986). Opening statement is not a time to argue the inferences and Conclusions that may be drawn from evidence not yet admitted. Id. § 455, at 395; § 457, at 396. There was no direct evidence that the victim was tortured, and the record does not indicate that any such evidence was anticipated when opening statements were made. Accordingly, the reference to \"torture\" during opening statement was improper.\n\nThe comment during closing argument that the victim may have been tormented was proper. Unlike opening statements, during closing arguments counsel may summarize the evidence, make submittals to the jury, urge the jury to draw reasonable inferences from the evidence, and suggest ultimate Conclusions. Id. § 527, at 455-56; see also State v. Runningeagle, 176 Ariz. 59, 64, 859 P.2d 169, 174 (1993); Amaya-Ruiz, 166 Ariz. at 171, 800 P.2d at 1279. Given the evidence presented at trial, we find no impropriety in the prosecutor suggesting -- during closing argument -- that the victim had been tormented. The nine-year-old victim was abducted, taken to a remote area, her clothes removed and scattered, her hands tied, and her head beaten. Such evidence would permit a jury to infer that she had been subject to both physical and emotional torment.\n\nThus, we hold that the comment during opening statement was improper but find no reason to reverse. While, the comment during opening statement was improper at that point, it was a reasonable inference from evidence later introduced and would have been proper during closing argument. Therefore, under the facts of this case, the improper comment did not deprive Defendant of a fair trial. We find no fundamental error.\n\n4. Reference to the victim's rights\n\nIn opening statement, after mentioning that Defendant deserved a fair trial, the prosecutor added that\n\nyour goal is not necessarily just to give Ricky Bible a fair trial. Your goal in this case is going to be Justice.\n\nAnd Justice doesn't mean just giving Ricky Bible a fair trial. It means looking at the rights of other people, too, like [the victim], and those rights include those that are enumerated in the Declaration of Independence, life, liberty and the pursuit of happiness. And there won't be any of that for [the victim].\n\nRemarkably, during closing argument, the prosecutor made a more detailed reference to the victim's rights:\n\n[T]he defendant and all defendants have rights and a right to a fair trial.\n\nThere has been a fair trial.\n\nBut there are other rights. All of us have rights, including [the victim]. Perhaps the most succinct rights, the most succinct Discussion of the sort of rights that we all, including [the victim], have, were described in the Declaration of Independence in 1776.\n\n[The victim's] rights were terminated on June 6 of 1988. She has no right to life. That was terminated with blows to her head. There is no liberty for a nine-year-old girl who is taken off of her bike, tied up and taken away from her family. And there certainly is no pursuit of happiness from the grave. . . .\n\nYour duty is to protect the defendant's rights and also [the victim's] rights.\n\nDefendant challenges these statements.\n\nIt cannot be doubted that victims of crime, and their families, have certain rights. See Ariz. Const. art. II, § 2.1; A.R.S. §§ 13-4401 to 13-4437. It is equally clear, however, that these rights do not, and cannot, conflict with a defendant's right to a fair trial. U.S. Const. amend. VI,\n\nXIV; Ariz. Const. art. II, § 4; see generally State ex rel. Romley v. Superior Court, 172 Ariz. 232, 836 P.2d 445 (Ct.App.1992). The jury finds facts and applies the law through the Judge's instructions. A trial is \"fair\" when, according to legal principles and requirements, a jury's determination is based on the evidence admitted and the instructions given.\n\nAppeals to the jury's innate sense of fairness between a defendant and the victim may have surface appeal but cannot prevail. A jury in a criminal trial is not expected to strike some sort of balance between the victim's and the defendant's rights. The Judge, not the jury, balances conflicting rights; the jury must find the facts and apply the Judge's instructions. Accordingly, the clear weight of authority shows the impropriety of the prosecutor's statements. See, e.g., McNair v. State, 1992 WL 172200, at *17-*19, So.2d , - (Ala.Cr.App.Ct. July 24, 1992); Jennings v. State, 453 So.2d 1109, 1113-14 (Fla.1984), vacated on other grounds, 470 U.S. 1002, 105 S.Ct. 1351, 84 L.Ed.2d 374 (1985); People v. Henderson, 142 Ill.2d 258, 154 Ill.Dec. 785, 815-16, 568 N.E.2d 1234, 1264-65 (1990), cert. denied, U.S. , 112 S.Ct. 233, 116 L.Ed.2d 189 (1991); State v. Marshall, 123 N.J. 1, 586 A.2d 85, 171 (1991), cert. denied, U.S. , 113 S.Ct. 1306, 122 L.Ed.2d 694 (1993); Bell v. State, 724 S.W.2d 780, 802-03 (Tex.Cr.App.1986), cert. denied, 479 U.S. 1046, 107 S.Ct. 910, 93 L.Ed.2d 860 (1987). The statements encouraged the jury to decide the case on emotion and ignore the court's instructions. The statements should have been stricken and followed with corrective jury instructions. Because there were no objections, however, we again look for fundamental error.\n\nThe cases cited above, under their facts, found that improper references to victim's rights did not result in reversible error. See McNair, 1992 WL 172200, at *19, So.2d at ; Jennings, 453 So.2d at 1113-14; Henderson, 154 Ill.Dec. at 815-16, 568 N.E.2d at 1264-65; Marshall, 586 A.2d at 171; Bell, 724 S.W.2d at 803. In this case, the preliminary and final jury instructions focused the relevant inquiry and helped ensure that Defendant received a fair trial. These instructions, coupled with the strength of the evidence against Defendant, show that Defendant was not denied a fair trial. See State v. Slemmer, 170 Ariz. 174, 178, 823 P.2d 41, 45 (1991); Cook, 170 Ariz. at 50, 821 P.2d at 741. Thus, the victim's rights statements did not constitute fundamental error in this case.\n\nO. Death sentence issues\n\nIn sentencing Defendant on the murder conviction, the trial court found three aggravating circumstances: 1) that Defendant previously had been convicted of felonies involving the use or threat of violence; 2) that he committed the murder in an especially cruel manner; and 3) that he was an adult and the victim was less than fifteen years of age. Finding that no mitigating circumstances outweighed these aggravating circumstances, the court sentenced Defendant to death. Defendant makes several challenges to the imposition of the death penalty.\n\n\"[W]e must review carefully and with consistency death penalty cases and not engage in a 'cursory' or 'rubber stamp' type of review.\" State v. Watson, 129 Ariz. 60, 63, 628 P.2d 943, 946 (1981). We independently search the record to determine whether the death sentence is appropriate. See State v. Lopez, 174 Ariz. 131, 153, 847 P.2d 1078, 1090 (1992). In making our independent review, we obey the principle that the Eighth Amendment requires the State to \"'channel the sentencer's discretion by clear and objective standards that provide specific and detailed guidance, and that make rationally reviewable the process for imposing a sentence of death.'\" Arave v. Creech, U.S. , , 113 S.Ct. 1534, 1540, 123 L.Ed.2d 188 (1993) (quoting Lewis v. Jeffers, 497 U.S. 764, 774, 110 S.Ct. 3092, 3099, 111 L.Ed.2d 606 (1990)). We also bear in mind that Arizona's system of capital sentencing must perform a genuine, narrowing function. It is not enough that an aggravating circumstance is determinate; the sentencing\n\nscheme must \"'genuinely narrow the class of persons eligible for the death penalty.'\" Creech, U.S. at , 113 S.Ct. at 1542 (quoting Zant v. Stephens, 462 U.S. 862, 877, 103 S.Ct. 2733, 2742, 77 L.Ed.2d 235 (1983)). Thus, aggravating circumstances must enable our trial Judges \"to distinguish those who deserve capital punishment from those who do not . . . [and] must provide a principled basis for doing so.\" Creech, U.S. at , 113 S.Ct. at 1542.\n\n1. Aggravating circumstances\n\na. Prior violent felonies\n\nDefendant claims the court erred in finding that his 1981 convictions for kidnapping and sexual assault were felonies involving the use or threat of violence on another person. See A.R.S. § 13-703(F)(2). \"If, under the statutory definition of the crime, the defendant could commit or be convicted of the crime without the use or threat of violence, the prior conviction cannot qualify as a statutory aggravating circumstance.\" State v. Fierro, 166 Ariz. 539, 549, 804 P.2d 72, 82 (1990); accord Schaaf, 169 Ariz. at 333, 819 P.2d at 919.\n\nThe State initially asks that we overrule Fierro and Schaaf. We decline to do so and reaffirm their rule. See Schaaf, 169 Ariz. at 333, 819 P.2d at 919 (refusing similar request to overrule State v. Gillies, 135 Ariz. 500, 662 P.2d 1007 (1983), cert. denied, 470 U.S. 1059, 105 S.Ct. 1775, 84 L.Ed.2d 834 (1985)). The State concedes, and we find, that kidnapping under A.R.S. § 13-1304(A) may be committed without the use or threat of violence. See A.R.S. § 13-1301(2). Thus, we turn to the sexual assault conviction.\n\nIn 1981, sexual assault was defined as \"intentionally or knowingly engaging in sexual intercourse or oral sexual contact with any person not his or her spouse without consent of such person.\" A.R.S. § 13-1406(A). Although \"without consent\" included use or threats of force, A.R.S. § 13-1401(5)(a), it also included intentionally deceiving a victim, A.R.S. §§ 13-1401(5)(c), (d). Furthermore, a victim was incapable of valid consent \"by reason of mental disorder, drugs, alcohol, sleep or any other similar impairment.\" A.R.S. § 13-1401(5)(b). Thus, neither the use nor the threat of violence was a necessary element for sexual assault. As a result, the trial court erred by relying on the 1981 kidnapping and sexual assault convictions in finding an aggravating circumstance under A.R.S. § 13-703(F)(2).\n\nb. Especially Cruel\n\nDefendant argues that the prosecutor did not show that the murder was especially cruel. See A.R.S. § 13-703(F)(6).\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e To properly find cruelty, the State \"must prove beyond a reasonable doubt that the victim was conscious and suffered pain or distress at the time of the offense.\" State v. Jimenez, 165 Ariz. 444, 453, 799 P.2d 785, 794 (1990). The pain or distress may be mental or physical. See State v. Hinchey, 165 Ariz. 432, 438, 799 P.2d 352, 358 (1990), cert. denied, 499 U.S. 963, 111 S.Ct. 1589, 113 L.Ed.2d 653 (1991); State v. Libberton, 141 Ariz. 132, 139, 685 P.2d 1284, 1291 (1984). If the evidence of consciousness is inconclusive, no cruelty has been shown. See State v. Medrano, 173 Ariz. 393, 397, 844 P.2d 560, 564 (1992).\n\nThe trial court found that the victim suffered both physical and mental pain prior to death. The State's medical expert could not say that the victim was conscious during or after any of the blows to her head. Thus, this evidence cannot support a cruelty finding. See Jimenez, 165 Ariz. at 454, 799 P.2d at 795.\n\nOther facts do support the finding. The victim's clothes were removed intact, without being torn or cut, thus indicating her hands were tied after she was naked. The fact that her hands were bound indicates\n\nthat she was conscious and tied-up to prevent struggling. There would be no need to bind an unconscious victim. Her hands were bound tightly, leaving indentations on her wrists observable more than three weeks later. Reasonable inferences from this evidence are that the victim was alive, conscious, and stripped before she was bound and that she was conscious when bound.\n\nThis evidence strongly supports a finding that a conscious nine-year-old victim suffered physical and, even more, mental anguish before being killed. Obviously, the victim would have been terrified. Nor can it be argued that the mental and physical pain inflicted was unforeseen or fortuitous. Thus, we find that the killing was especially cruel. See Roscoe, 145 Ariz. at 226, 700 P.2d at 1326; cf. State v. Poland, 132 Ariz. 269, 285, 645 P.2d 784, 800 (1982) (\"There was no evidence of suffering by the guards. The autopsy revealed no evidence that they had been bound or injured prior to being placed in the water.\").\n\nc. Adult defendant and child victim\n\nThere is no question about the third aggravating circumstance. When the victim was killed, she was less than fifteen years old and Defendant was an adult. Thus, the A.R.S. § 13-703(F)(9) aggravating circumstance was present. See State v. Stanley, 167 Ariz. 519, 528, 809 P.2d 944, 953, cert. denied, U.S. , 112 S.Ct. 660, 116 L.Ed.2d 751 (1991).\n\n2. Mitigating circumstances\n\nDefendant argues that the trial court erred in considering mitigating evidence. Specifically, Defendant claims that the court improperly rejected four mitigating circumstances:\n\n1. Defendant's ability to appreciate the wrongfulness of his conduct or conform his conduct to the requirements of law was substantially impaired;\n\n2. Defendant was intoxicated and suffering from withdrawal symptoms at the time of the offense;\n\n3. Defendant's difficult family history; and\n\n4. Defendant's substantial family support.\n\nWe consider Defendant's claims in turn.\n\nThe trial court must consider the factors in A.R.S. § 13-703(G) as well as \"any aspect of the defendant's character or record and any circumstance of the offense relevant to determining whether a sentence less severe than death is appropriate.\" State v. Greenway, 170 Ariz. 155, 169, 823 P.2d 22, 36 (1992) (citing cases). Defendant must prove factors supporting mitigation by a preponderance of the evidence. State v. Brewer, 170 Ariz. 486, 504, 826 P.2d 783, 801, cert. denied, U.S. , 113 S.Ct. 206, 121 L.Ed.2d 147 (1992). We independently examine the mitigating evidence to determine whether the death sentence is justified. Fierro, 166 Ariz. at 551-52, 804 P.2d at 84-85.\n\nThe one statutory mitigating factor argued by Defendant is that his \"capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of law was significantly impaired, but not so impaired as to constitute a defense.\" A.R.S. § 13-703(G)(1). Defendant argues that his substance abuse contributed to the offense and is a mitigating circumstance. Defendant's medical expert indicated that absent drug consumption and withdrawal symptoms, it was less likely that Defendant would have killed and that addiction and withdrawal made it more difficult for him to conform to the requirements of law. Other testimony indicated that Defendant had a history of drug use and that, absent drug use, he is a caring person.\n\nDefendant's expert admitted that the drug history he relied on came largely from Defendant. This expert had reservations about Defendant's truthfulness regarding his criminal activities and admitted that nothing indicated Defendant was unable to appreciate the wrongfulness of his actions. Although Defendant claimed to have been deprived of alcohol and drugs for several days before the murder, his expert admitted that Defendant had been drinking during\n\nthat time period. Furthermore, when arrested, the GMC Defendant was driving contained eighteen full mini-bottles of vodka. There was no evidence Defendant was \"suffering\" from alcohol deprivation. Nor does the record support a claim that Defendant was intoxicated when the offense was committed; testimony indicated that he acted normally both before and after his arrest. There is no evidence that Defendant used drugs or, absent the two empty 50-milliliter vodka bottles, consumed alcohol the day of the murder.\n\nIn sum, there is little evidence supporting Defendant's mitigation claim under A.R.S. § 13-703(G)(1). On this record we find no substantial impairment of Defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law. See, e.g., Stanley, 167 Ariz. at 528-31, 809 P.2d at 953-56; State v. Wallace, 160 Ariz. 424, 426, 773 P.2d 983, 985 (1989), cert. denied, 494 U.S. 1047, 110 S.Ct. 1513, 108 L.Ed.2d 649 (1990); Greenawalt, 128 Ariz. at 172-73, 624 P.2d at 850-51. Thus, Defendant did not establish the A.R.S. § 13-703(G)(1) mitigating factor. We must now determine whether there is other mitigating evidence to weigh, even though it may not constitute an enumerated statutory mitigating factor. See State v. McMurtrey, 136 Ariz. 93, 101-02, 664 P.2d 637, 645-46, cert. denied, 464 U.S. 858, 104 S.Ct. 180, 78 L.Ed.2d 161 (1983).\n\nAs noted, there was no real evidence that Defendant was intoxicated at the time of the offense. The evidence addressing historical familial abuse was marginal and equivocal as to its causal connection with the murder. Defendant's mother did not indicate that Defendant was abused or neglected when he was growing up, and Defendant made no showing that any difficult family history had anything to do with the murder, see Wallace, 160 Ariz. at 427, 773 P.2d at 986. Although Defendant's support and love for and by family and friends might have some mitigating force, it does not require a finding of mitigation sufficient to call for leniency. See State v. Carriger, 143 Ariz. 142, 162, 692 P.2d 991, 1011 (1984), cert. denied, 471 U.S. 1111, 105 S.Ct. 2347, 85 L.Ed.2d 864 (1985). In sum, our independent review of the record shows no significant mitigating evidence. Cf. State v. Herrera, Jr. I, 176 Ariz. 21, 35, 859 P.2d 131, 145 (1993); Cook, 170 Ariz. at 64, 821 P.2d at 755.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nP. Should this court reweigh or remand for resentencing?\n\nHaving independently determined that one of the three aggravating circumstances found by the trial court does not exist, and that the trial court correctly characterized the lack of mitigating evidence, we must decide whether this court should reweigh to either affirm or reduce the death sentence or whether the case should be remanded to the trial court for resentencing. Our obligation is to independently decide whether the death sentence is appropriate. See Lopez, 174 Ariz. 131 at 153, 847 P.2d at 1090; Watson, 129 Ariz. at 62-63, 628 P.2d at 945-46. We do so to ensure that the death penalty will not be imposed arbitrarily or on an aberrant basis and is reserved for truly exceptional cases, setting the defendant apart from others guilty of first degree murder and making death the appropriate sanction. See Creech, U.S. at , 113 S.Ct. at 1542; Stephens, 462 U.S. at 877, 103 S.Ct. at 2742; State v. Richmond, 114 Ariz. 186, 195-96, 560 P.2d 41, 50-51 (1976).\n\nIn some cases, and this is one, we have found that the trial court erred in its Conclusions regarding aggravating circumstances. See, e.g., Hinchey, 165 Ariz. at 440, 799 P.2d at 360; State v. Lopez, 163 Ariz. 108, 116, 786 P.2d 959, 967 (1990); State v. Wallace, 151 Ariz. 362, 369, 728 P.2d 232, 239 (1986), cert. denied, 483 U.S. 1011, 107 S.Ct. 3243, 97 L.Ed.2d 748 (1987). In other cases, we have found that the trial court incorrectly evaluated or failed to recognize important mitigating evidence. See,\n\ne.g., State v. Marlow, 163 Ariz. 65, 71-72, 786 P.2d 395, 401-02 (1989); State v. Rockwell, 161 Ariz. 5, 15-16, 775 P.2d 1069, 1079-80 (1989); State v. Stevens, 158 Ariz. 595, 599, 764 P.2d 724, 728 (1988). In such cases, our response has been more consistent in theory than in practice. See Karen L. Hinse, Note, Appellate Review of Death Sentences: An Analysis of the Impact of Clemons v. Mississippi in Arizona, 34 Ariz. L.Rev. 141, 157 (1992) (\"Hinse, 34 Ariz. L.Rev.\").\n\nIn Clemons v. Mississippi, 494 U.S. 738, 110 S.Ct. 1441, 108 L.Ed.2d 725 (1990), the United States Supreme Court held that the Eighth and Fourteenth Amendments of the United States Constitution do not prevent a state supreme court, engaged in appellate review of a death sentence, from reweighing the evidence and affirming even though the court finds that the trial Judge erred in the sentencing process. Clemons, 494 U.S. at 748-49, 110 S.Ct. at 1448-49. Indeed, the United States Constitution allows state courts to weigh the aggravating and mitigating evidence at any stage of the proceeding. See Richmond v. Lewis, U.S. , 113 S.Ct. 528, 121 L.Ed.2d 411 (1992). Although Clemons and Richmond state that the United States Constitution allows us to reweigh at the appellate level, they do not compel us to do so. See Clemons, 494 U.S. at 754, 110 S.Ct. at 1451.\n\nBoth before and after Clemons, some states adopted a procedure of appellate reweighing for altered aggravation or mitigation findings. Compare Sellers v. Oklahoma, 809 P.2d 676, 691 (Okla.Crim.Ct.App.) (post- Clemons reweighing on appeal), cert. denied, U.S. , 112 S.Ct. 310, 116 L.Ed.2d 252 (1991) with Stouffer v. State, 742 P.2d 562, 564 (Okla.Crim.Ct.App.1987) (pre- Clemons reweighing on appeal), cert. denied, 484 U.S. 1036, 108 S.Ct. 763, 98 L.Ed.2d 779 (1988); State v. Otey, 236 Neb. 915, 464 N.W.2d 352, 361 (post- Clemons reweighing on appeal in post-conviction relief case), cert. denied, U.S. , 111 S.Ct. 2279, 115 L.Ed.2d 965 (1991) with State v. Peery, 199 Neb. 656, 261 N.W.2d 95, 102 (1977) (pre- Clemons reweighing on appeal), cert. denied, 439 U.S. 882, 99 S.Ct. 220, 58 L.Ed.2d 194 (1978). In Arizona, however, even after Clemons, we have continued to focus on whether the record compels a particular finding in light of the correct assessment of mitigating and aggravating factors. Compare Medrano, 173 Ariz. at 398, 844 P.2d at 565 (\"Because one of the two statutory aggravating circumstances found by the trial court must be set aside, and we can only speculate whether the court would have found mitigation sufficient to overcome the single remaining aggravating circumstance, we remand for another hearing and resentencing.\") with Robinson, 165 Ariz. at 60, 796 P.2d at 862 (\"[T]he elimination of one aggravating factor does not mandate a remand to the trial court for resentencing when the record compels a finding on the issue as a matter of law.\").\n\nThe State has urged this court to eliminate remands for resentencing and reweigh all cases as part of the review process. From an efficiency standpoint, this would be useful by saving time and expediting the process. Of more weight, perhaps, is the argument that remand for resentencing exposes survivors and members of the victim's family to additional emotional trauma. The State has argued that, if we find the trial court erred in sentencing, it would be better in some cases to reduce the sentence to life rather than remand for a new sentencing hearing. This may well be so, and we urge the State to be candid with this court when such issues arise in the future.\n\nMatters as important as life or death, however, cannot be decided by using efficiency and convenience as the best and only tests. Painstaking care and pursuit of accuracy and Justice are much more desirable. Notwithstanding the trauma to surviving family members, there are cases in which remand is unavoidable. When additional evidence is available or required, that evidence must be presented to the trial court. This court has neither facilities for, nor any custom of, taking evidence, and we cannot decide questions of fact affecting the imposition of sentence by means of\n\nevidentiary affidavits. Cf. State v. Rumsey, 136 Ariz. 166, 168-75, 665 P.2d 48, 50-57 (1983) (discussing similarity between capital sentencing hearing and trial and finding that double jeopardy clause applies to sentencing), aff'd, Arizona v. Rumsey, 467 U.S. 203, 104 S.Ct. 2305, 81 L.Ed.2d 164 (1984). In any capital case where additional evidence is to be received, remand is required. \"[W]e perform as an appellate court, not as a trial court,\" Rumsey, 136 Ariz. at 173, 665 P.2d at 55, and we have repeatedly rejected the State's arguments to the contrary, see, e.g., Fierro, 166 Ariz. at 555, 804 P.2d at 88; Hinchey, 165 Ariz. at 440, 799 P.2d at 360; Gillies, 135 Ariz. at 516, 662 P.2d at 1023.\n\nSome cases will not require the submission of additional evidence but only the reweighing and balancing of the evidence. Many of these cases will involve situations in which the trial Judge erred with respect to aggravating or mitigating circumstances and in which there is mitigating evidence of some weight. In these cases, too, remand for resentencing is the better rule. As the United States Supreme Court noted, we have an appellate task in reviewing death sentences and we have placed the sentencing authority in all criminal cases, and especially capital cases, with the trial Judge. Rumsey, 467 U.S. at 209-10, 104 S.Ct. at 2309. \"Law and policy would indicate that the trial Judge should again make the [sentencing] determination.\" Gillies, 135 Ariz. at 516, 662 P.2d at 1023. There are important reasons for this procedural rule.\n\nFirst, this court's jurisdiction is appellate. Rumsey, 136 Ariz. at 173, 665 P.2d at 55. We have very limited original jurisdiction. See Ariz. Const. art. VI, § 5, cls. 1-4. In capital cases on direct appeal, we review for error and to determine whether the penalty is appropriate. Even in those cases in which this court is the ultimate finder of fact, we proceed through a master, committee, or commission. See La Paz County v. Yuma County, 153 Ariz. 162, 163-64, 735 P.2d 772, 773-74 (1987); Ariz.R.Civ.P. 53; Ariz.R.Sup.Ct. 47, 48; Ariz.R.P.Comm.Jud.Conduct 11, 12.\n\nOn appeal, in many cases it is simply impossible to determine how the trial Judge -- who heard the evidence and saw the witnesses -- evaluated and weighed that evidence and testimony. Without these imperative determinations, the aggravating and mitigating factors cannot be balanced. See, e.g., Lopez, 174 Ariz. 146, 155-56, 847 P.2d 1093, 1092-93 (Feldman, C.J., specially Concurring). This is especially true because the trial Judge is required by statute to consider at sentencing all evidence admitted at trial. A.R.S. § 13-703(C). Furthermore, the process of weighing is not scientific but, rather, inherently subjective. There is no mathematical formula to apply and none is required. Cf. Creech, U.S. at , 113 S.Ct. at 1544. The weighing process conducted in sentencing contains no linear equation allowing us to determine, with much certainty, the effect an error may have had on the outcome.\n\nThe sentencing statute provides that, following a first degree murder conviction, \"the Judge who presided at the trial or before whom the guilty plea was entered . . . shall conduct [the] sentencing hearing.\" A.R.S. § 13-703(B) (emphasis added). The only exception to this mandate is when the trial Judge dies, resigns, or is incapacitated or disqualified. Id. This directive certainly reflects a legislative desire that, when possible, the same Judge who personally saw and heard all of the evidence must evaluate and weigh that evidence for sentencing.\n\nEven if this court could somehow recreate the many valuable intangibles accompanying live testimony, the practicalities of our docket do not allow us to do so. Although capital cases have a priority, the sheer volume of cases we must process each week, month, and year curtails our review process. The volume of other judicial work, as well as the voluminous nature of the record in capital cases (in this case more than 120 volumes of testimony and numerous exhibits and filings easily exceeding 15,000 pages) simply prevents each Justice of this court from making a personal, intensive, complete, and time-consuming study of the entire record of each case.\n\nThis is not to imply that the record goes unreviewed. The court and its staff review\n\nand read every word of the record in each capital case. The evaluation of the facts of a case, however, is in part based on staff review of the record. Thus, in a practical sense, the trial Judge is by far the best person to bear the responsibility for sentence imposition. Other than the defendant and the attorneys, the trial Judge -- the one individual who received every single exhibit and heard every word uttered in court -- is by far a better tool of Justice to determine the appropriate sentence.\n\nIn addition, part of the rationale on which Clemons relied was the fact that \"reviewing courts\" usually conduct proportionality reviews and are therefore capable of providing \"individualized and reliable sentences.\" Clemons, 494 U.S. at 748-50, 110 S.Ct. at 1449; see also Hinse, 34 Ariz. L.Rev. at 152. This court, however, has concluded that proportionality reviews no longer should be a part of appellate review in capital cases. See Salazar, 173 Ariz. at 416-17, 844 P.2d at 583-84.\n\nFinally, as is often said, the death sentence is different from any other criminal penalty. Solem v. Helm, 463 U.S. 277, 294, 103 S.Ct. 3001, 3012, 77 L.Ed.2d 637 (1983). No system based on human judgment is infallible. Thus, with the death penalty, we have taken, and should continue to take, the extra step -- indeed walk the extra mile -- to ensure fairness and accuracy in criminal cases. In light of the trial Judge's unique familiarity with the facts of the case, remand is an extra step that should be taken in all but the rarest cases.\n\nIn sum, we conclude that when new evidence must be received or reweighing and balancing of aggravating and mitigating factors and evidence are required, the best approach is our traditional method. The trial Judge is in the best position to evaluate credibility and accuracy, as well as draw inferences, weigh, and balance. This, after all, is the careful method that we follow in civil appeals and, we believe, is even more appropriate in capital cases. Therefore, in those cases in which the trial Judge has erred in the sentencing process and there is mitigating evidence of more than de minimis weight, we will remand unless the State concedes that sentence reduction is preferable to remand. With these principles in mind, we turn to the facts of the present case.\n\nThe trial Judge found three aggravating circumstances. We conclude that one of those was improperly found. Two aggravating circumstances, however, were correctly found. Furthermore, the trial Judge properly found nothing of value by way of mitigation. Although Defendant's two previous convictions do not qualify as an aggravating circumstance, they certainly do not constitute mitigating evidence. From our review of the record, nothing submitted to the trial court qualifies as more than de minimis evidence of mitigation. We do not believe that Defendant's habitual drug use is of any value as mitigation in this case, given the fact that there was no evidence it significantly impaired his capacity to control his conduct on the day in question. There is simply nothing to weigh or balance in this case. Thus, in light of the unusual facts of this case, we are able to affirm the imposition of the death sentence even though we have found that one of the three aggravating circumstances was inapplicable.\n\nQ. Other issues\n\nDefendant raises a number of other issues, all of which we have considered. The analysis applicable to these issues does not merit express Discussion in this long opinion. Thus, we reject these claims without express Discussion. See State v. Gillies, 142 Ariz. 564, 573, 691 P.2d 655, 664 (1984), cert. denied, 470 U.S. 1059, 105 S.Ct. 1775, 84 L.Ed.2d 834 (1985).\n\nDisposition\n\nWe have examined the record for fundamental error pursuant to A.R.S. § 13-4035 and have found none. Accordingly, we affirm Defendant's convictions and sentences.\n\n\u003cspan class=\"fn\"\u003e1. There is, of course, no distinction between the probative value of direct and circumstantial evidence. See, e.g., State v. Harrison, 111 Ariz. 508, 510, 533 P.2d 1143, 1145 (1975); State v. Green, 111 Ariz. 444, 446, 532 P.2d 506, 508 (1975); State v. Harvill, 106 Ariz. 386, 391, 476 P.2d 841, 846 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Defendant has withdrawn his ineffective assistance of counsel claim. Thus, we do not address that claim and nothing in this opinion should be construed as precluding any ineffective assistance of counsel claim Defendant may make in the future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Such opinions were either qualified or unqualified, with an unqualified opinion defined as fixed, settled, and unchangeable. A potential juror had a qualified opinion if he or she could \"set aside that opinion and render a verdict based solely on the evidence presented in court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The items from March 1989 to the time of trial were not presented to the trial court. They are, however, a part of the record on appeal. See Order, January 21, 1992. This order also refused to strike from the record articles published during trial. Because a motion to change venue due to pretrial publicity must be made before trial, Ariz.R.Crim.P. 10.3(c), events occurring during trial usually are not relevant in addressing the motion. Although such events may be relevant in determining whether a defendant received a fair trial, see infra § A(2), we do not consider the articles appearing during trial in assessing Defendant's motion to change venue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The significance of such errors, however, is uncertain. Indeed, defense counsel similarly erred when, at hearings in May and June 1989, he stated that Defendant's 1981 conviction involved \"rape\" and made reference to \"child rape\" and \"child rapist.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Nor is this a case where the voir dire record itself shows that pervasive pretrial publicity so tainted the venire that jurors' statements under oath regarding their ability to set aside preconceptions and render a verdict on the evidence must be rejected. Compare Irvin v. Dowd, 366 U.S. 717, 727-28, 81 S.Ct. 1639, 1645, 6 L.Ed.2d 751 (1961) (268 of 430, or 62 percent, of venire excused for cause due to fixed opinion of guilt caused court to presume bias and disregard statements made in voir dire) with Murphy, 421 U.S. at 802-03, 95 S.Ct. at 2037-38 (26 percent of venire excused for cause due to opinion of guilt did not provide reason to doubt remaining juror's assurances of impartiality) and Simmons v. Lockhart, 814 F.2d 504, 511-12 (8th Cir. 1987) (16 percent of venire excused for cause due to fixed opinion of guilt did not provide reason to doubt remaining juror's assurances of impartiality), cert. denied, 485 U.S. 1015, 108 S.Ct. 1489, 99 L.Ed.2d 717 (1988). In this case, 23 percent of the venire had a fixed, or unqualified, opinion of guilt and were excused for cause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Even with these purported occurrences, and with very few exceptions, defense counsel failed to object or make any record at trial. Thus, from the record before us, Defendant simply is unable to argue \"that actual prejudice resulted from the . . . actions at the trial,\" Atwood, 171 Ariz. at 633, 832 P.2d at 650, or that those actions had a demonstrable impact on the jury, Norris v. Risley, 918 F.2d 828, 831 (9th Cir. 1990). Thus, we cannot and do not decide whether the conduct of the trial actually prejudiced the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. On appeal, Defendant does not challenge the propriety or authority of that order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We reject the claim that Defendant and defense counsel were improperly intimidated and harassed. Although in extreme cases, intimidation and harassment can require a new trial, the record here does not support such a claim. Cf. State v. Bush, 148 Ariz. 325, 328-31, 714 P.2d 818, 821-24 (1986) (outrageous intimidation -- including assault of defendant, witness intimidation resulting in recantation, and threats against defense counsel -- coupled with ineffective assistance of counsel required new trial). We also find no error in the security measures taken. Defendant had been threatened and had attempted to escape. The added security consisted primarily of a metal detector used outside the courtroom. Because there was a reasonable basis for this added security, and the measures taken did not negate the presumption of innocence, we find no error. See, e.g., Greenawalt, 128 Ariz. at 164, 624 P.2d at 842; State v. Wilson, 113 Ariz. 363, 366, 555 P.2d 321, 324 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendant is not, of course, precluded from arguing fundamental error. See infra § A(3)(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. At least from defense counsel's perspective, there was a reason for this exodus. The day before the jury questionnaire was completed, the court discussed with the attorneys the procedure to be used, and explained that the procedure would take less than an hour, that the court would remain to answer questions, and that the parties were free to stay or go as they wished. Defendant's attorney stated he would remain if the prosecutor stayed, but that he did not want Defendant \"sitting there for an hour . . . because I think he's not gonna make a good impression sitting there for an hour. . . . I don't see any need for him to be there [after the introductory statements].\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. By failing to find fundamental error, we do not suggest that the oral voir dire in this case was a paradigm for cases where publicity, or any other factor, creates a significant danger of juror bias. Rather, we commend the approach used by the trial court in United States v. Maldonado-Rivera, 922 F.2d 934 (2d Cir. 1990), cert. denied, U.S. , 111 S.Ct. 2811, 115 L.Ed.2d 984 (1991): In conducting the voir dire here, the court prepared a written questionnaire consisting of 65 questions tailored to the facts of this case. The court then orally asked several general questions relating to pretrial publicity. The defendants were permitted to submit proposed supplemental questions, and the court gave each defense attorney 15 minutes to ask \"any legitimate question\" of individual prospective jurors. Maldonado-Rivera, 922 F.2d at 971. In cases where there is a heightened danger of juror prejudice or bias, relying almost entirely on a written questionnaire frequently may not be adequate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Before trial, Defendant moved to strike several venire members for cause. The trial court granted this motion in part and denied it in part. Defendant does not challenge that ruling on appeal. None of the venire members challenged in Defendant's motion ultimately served as jurors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We make no attempt to add to the extensive forensic or scientific literature on the subject. Our explanation of DNA theory, testing procedures, and statistical analysis is greatly over-simplified. We provide only a sketch of the technology insofar as it is relevant to the legal issues in this case and Conclusions we draw. For far more detailed descriptions, see Commonwealth v. Curnin, 409 Mass. 218, 565 N.E.2d 440, 445-48 (1991); State v. Vandebogart, 136 N.H. 365, 616 A.2d 483, 486-88 (1992); Cauthron, 846 P.2d at 508-10; John W. Strong, et al., 1 McCormick on Evidence § 205, at 896-902 (4th ed. 1992); Thompson \u0026 Ford, DNA Typing, 75 Va.L.Rev. at 64-76.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Polymerase chain reaction technology was not used in this case. Thus, we do not consider any additional or differing issues surrounding that technology.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Nor do testing laboratories have identical accuracy records. See Thompson \u0026 Ford, DNA Testing at 55 (discussing study where many matching samples, using the FBI's standards, did not match); Thompson \u0026 Ford, DNA Typing, 75 Va.L.Rev. at 107-08 (discussing Cellmark error \"in typing one of forty-nine samples during the only independently conducted blind proficiency test in which it has participated. The error was a serious one, of a type that might have falsely incriminated an innocent suspect.\"); see also United States v. Porter, 1991 WL 319015 (D.C.Super.Ct. Sept. 20, 1991), vacated, 618 A.2d 629 (D.C.1992): Referring to . . . a founder of Genetic Design, Inc., [a] New York Times article in pertinent part states: [T]he DNA method erred two percent of the time in paternity cases. He knew it was wrong in some cases, he said, because he sent samples to two DNA labs. One laboratory would say the putative father was definitely -- with astronomically high odds -- the father. The other laboratory would say that the father was definitely -- again, with astronomically high odds -- not the father. In one case, a laboratory said that not only was the father not the father but the mother was not the mother. When he told the laboratory that maternity was not an issue, the laboratory came back and said the mother was the mother and the father was the father. Porter, 1991 WL 319015, at *22-*23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We are not presented with, and do not determine, the admissibility of DNA evidence when DNA testing is used to determine paternity. In paternity cases, different DNA testing technology apparently is used. See Cobey v. State, 80 Md.App. 31, 559 A.2d 391, 397-98 \u0026 n. 14, cert. denied, 317 Md. 542, 565 A.2d 670 (1989). Thus, the analysis in this case is limited to criminal cases in which RFLP technology is used and a match is declared.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Any argument that the random match probability constitutes a \"guilt probability\" is, of course, incorrect and misleading. Indeed, as Dr. Forman testified, the DNA random match probability \"says nothing about guilt or innocence.\" The random match probability assesses the likelihood that DNA samples selected at random would match. Jonathan J. Koehler, DNA Matches and Statistics: Important Questions, Surprising Answers, 76 Judicature 222, 224 (Fed.-Mar. 1993). Guilt probability is \"[t]he probability that the suspect is guilty of the crime in question.\" Id. at 225. Although the random match probability may factor into the guilt probability calculation, the opposite is not true. Id. at 224-25. Nor are the formulae for determining the two different probabilities the same. Id. This court has never condoned jury use of guilt probability calculations, nor do we in this case. Cf. State v. Lindsey, 149 Ariz. 472, 474, 720 P.2d 73, 75 (1986) (behavioral evidence cannot tell the jury \"who is lying and who is truthful. . . . [We do not permit] expert evidence on the question of guilt or innocence.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. There is nothing in the record suggesting that Defendant has an identical twin. Accordingly, we do not address this alternative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. When no match is declared, no statistical probability determination is made and our concerns about statistical probability determinations are obviated. State v. Hammond, 221 Conn. 264, 604 A.2d 793, 800-01 (1992). \"All scientists agree that if [test results] are distinguishable, then [the samples] do not come from the same individual.\" Cauthron, 846 P.2d at 512.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. For other descriptions of the product rule, see Prater v. State, 307 Ark. 180, 820 S.W.2d 429, 438 (1991); Pennell, 584 A.2d at 517; Cauthron, 846 P.2d at 513.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. On rehearing in Pennell, Cellmark's Dr. Forman testified that the original Cellmark database had \"been discarded in favor of a smaller data base, approximately 250 individuals, selected primarily from blood bank samples.\" Pennell, 584 A.2d at 520. Dr. Forman's testimony indicates that the database used in the present case was the original database that was later discarded. The stated reason for discarding the original database \"included the elimination of mother-father combinations, the procurement of more information on the persons included, etc.\" Pennell, 584 A.2d at 520 n. 3. In light of our Discussion below we need not address whether a database selected from blood banks and/or paternity and forensic cases could be sufficiently representative of the population as a whole, or any relevant subpopulation, to be statistically valid. Similarly, we do not address the minimum size required for a database to be a statistically valid representation of the population as a whole or any relevant subpopulation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. A simplistic hypothetical illustrates this point. Using eight frequency figures, and assuming the frequency rate for each figure is 0.1 (or 1 in 10), the probability of a random match would be 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 or 0.1 or 1 in 100,000,000. Using the same formula, if the true and correct frequency rate for each frequency figure is 0.3 (or 3 in 10), the probability of a random match would be 0.3 X 0.3 X 0.3 X 0.3 X 0.3 X 0.3 X 0.3 X 0.3 or 0.3 or 1 in 15,242. On the other hand, and again using the same formula, if the true and correct frequency rate for each frequency figure is 0.05 (or 1 in 20), the probability of a random match would be 0.05 X 0.05 X 0.05 X 0.05 X 0.05 X 0.05 X 0.05 X 0.05 or 0.05 or 1 in 25,600,000,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Linkage disequilibrium may occur when DNA segments tested are in close physical proximity to each other. Id. at 85. Testing DNA segments that are physically remote from each other may diminish linkage disequilibrium. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Again, a simplistic hypothetical illustrates the point. As before, using eight frequency figures, and if the frequency rate used for each frequency figure is 0.1 (or 1 in 10), the probability of a random match still would be 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 or 0.1 or 1 in 100,000,000. If, however, band \"2\" and band \"3\" are always present when band \"1\" is present, the actual probability of a random match would be 1.0 X 1.0 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 X 0.1 (or 1.0 X 1.0 X 0.1) or 1 in 1,000,000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Relevancy of the subject matter -- a standard discussed in Daubert -- is not questioned in the present case. Reliability of application of the specific theory -- another standard discussed in Daubert -- is the core question surrounding the probability calculations disputed in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Additional literature indicates that the probabilities are not generally accepted. For example, in July 1991, a surveyor identified 30 academic scientists (not employed by forensic labs) with expertise in population genetics who had taken a position on the issue. By [the surveyor's] count, 11 support current forensic approaches, 19 do not. Moreover, the ratio of critics to supporters is higher among scientists whose work is better known in the field of population genetics. Thompson \u0026 Ford, DNA Testing at 58; see also Thompson \u0026 Ford, DNA Typing, 75 Va.L.Rev. at 84-85 (the assumption of independence of alleles \"is still controversial.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See also Leslie Roberts, Science in Court: A Culture Clash, 257 Science 732 (Aug. 7, 1992) (discussing strenuous prosecutorial efforts to discredit defense experts on statistical probabilities).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The report of the National Research Council Committee on DNA Technology in Forensic Science did not clarify the issue. The April 1992 report recommended that DNA analysis be used but that improvements are needed. The report acknowledges that the product rule \"has provoked considerable debate among population geneticists.\" NRC Summary, DNA Technology at 12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. A fact of some significance. See People v. Littleton, 7 Cal.App.4th 906, 9 Cal.Rptr.2d 288, 288 n. *, 290 (Ct.App.1992) (California Supreme Court refusing to certify publication of the court of appeal's Cellmark DNA testing Discussion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See also People v. Wardell, 230 Ill.App.3d 1093, 172 Ill.Dec. 478, 483-84 \u0026 n. 2, 595 N.E.2d 1148, 1153-54 \u0026 n. 2 (1992) (holding that trial court, in denying defendant's request for DNA testing, did not abuse its discretion \"in deciding that the DNA testing methodology had not yet been generally recognized in the scientific community in early 1988. . . . The admissibility and reliability of DNA testing continues today to be the subject of debate.\"); cf. Fishback, 851 P.2d at 894 (finding that, as of October 1989 -- the date the evidence was admitted at trial in that case -- the statistical probability calculations were generally accepted but conceding \"that considerable debate has emerged in the three years since the trial in this case concerning the acceptability of the statistical frequencies which accompany a declared match of DNA profiles.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. One basis for this holding is that a substantial body of scientific thought considers Cellmark's statistical calculations unreliable. In setting forth \"general observations,\" Daubert mentioned four factors to consider in determining both relevance and reliability. Daubert, U.S. at - , 113 S.Ct. at 2796-98. These are: 1. Whether the theory or technique \"can be (and has been) tested.\" Id. at , 113 S.Ct. at 2796. The validity of the probability calculations cannot be accurately tested without a valid database, and testimony in this case failed to establish the validity of the database used by Cellmark. 2. \"[W]hether the theory or technique has been subjected to peer review and publication.\" Id. The product rule in general -- the formula used to make the probability calculations -- has been published and subjected to peer review. As noted above, however, peer review and publication have produced disagreement regarding the validity of Cellmark's probability calculations. 3. \"[I]n the case of a particular scientific technique, the court ordinarily should consider the known or potential rate of error and the existence and maintenance of standards controlling the technique's operation.\" Id. at , 113 S.Ct. at 2797 (citations omitted). Even assuming no laboratory error in Cellmark's DNA testing, the potential magnitude of error of the probability calculations is great, depending on the inadequacies of the database and the validity of the assumptions underlying the product rule. In addition, trial testimony disputed Cellmark's compliance with guidelines promulgated by the Technical Working Group on DNA Analysis and Methods and the California Association of Crime Laboratory Directors. 4. General acceptance, which \"can yet have a bearing on the inquiry.\" Id. at , 113 S.Ct. at 2797. As set forth above, there is no general acceptance of Cellmark's statistical probability analysis. Given the requirements of Ariz.R.Evid. 403 -- the federal counterpart of which \"permits the exclusion of relevant evidence,\" id. at , 113 S.Ct. at 2797 -- and the great potential for prejudice resulting from the admission of the statistical calculations, we are not persuaded that even under the Daubert test the evidence would be admissible. We reach no Conclusion on that subject. Neither party has briefed, nor has this court been able to consider, all of the factors that might be applicable in applying a reliability test. Even Daubert did not attempt to provide a checklist but only \"general observations.\" Id. at , 113 S.Ct. at 2796. As Chief Justice Rehnquist wrote, Daubert 's observations are \"general,\" \"vague and abstract,\" id. at , 113 S.Ct. at 2799 (Rehnquist, C.J., Dissenting), and one could argue that it is better to allow the law to evolve and develop. In the present case, the evidence in question was not advanced under a reliability theory, and we do not know what the evidence might have been if such a theory had been advanced. We therefore come to no Conclusion as to either the adoption of such a test or the outcome in this or other cases if the test were to be applied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. It is somewhat incongruous to call the trial court's ruling \"error.\" Nearly all of the scientific literature and case law on which we rely was unavailable when the evidence was admitted at trial. This subsequent technological and legal explosion prompted one appellate court to base its Frye determination on the information available \"as of the date th[e] evidence was admitted at trial.\" Fishback, 851 P.2d at 894. For the following reasons, we reject this approach. First, neither logic nor authority supports confining ourselves to a snapshot, rather than viewing the motion picture, of technological advancement. If the result obtained is the product of invalid scientific theory, there is no good reason to accept it simply because we were fooled at the inception of the inquiry. Second, the Fishback approach, for no persuasive stated reason, rejects technology directly addressing general acceptance. Third, there are numerous, more persuasive cases adopting an approach contrary to Fishback. Barney, 10 Cal.Rptr.2d at 744; Atoigue, 1992 WL 245628, at *4; Cauthron, 846 P.2d at 514-17. Perhaps most important, new technology, evolving at such a pace that general acceptance changes from the time of trial to the time of appellate review, is at the core of what Frye is designed to scrutinize -- not the basis of an exception that ignores recent developments. The Fishback rule, in our view, ignores vital scientific evolution. Thus, in surveying all information available, we consider scientific literature published, as well as cases decided, after trial. On this basis, because there is now no general acceptance, at least in a technical sense, the trial Judge did err.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Defense expert Dr. Mueller advocated a similar approach if such testimony was based on a valid database.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. See also State v. Hobson, 234 Kan. 133, 671 P.2d 1365, 1382-84 (1983) (finding statements made by defendant nearly two months before victim's disappearance admissible in premeditated murder case); 2 Francis Wharton, Wharton's Criminal Evidence § 307, at 101 (13th ed. 1972). But cf. United States v. Crosby, 713 F.2d 1066, 1073 n. 7 (5th Cir.) (exculpatory journal entries written over course of ten years properly excluded because \"they in no way related\" to defendant's state of mind at time of crime), cert. denied, 464 U.S. 1001, 104 S.Ct. 506, 78 L.Ed.2d 696 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The author of this opinion Dissented in Youngblood but does not register any Dissent here. Even under the author's views, Defendant's due process rights were not violated in this case. See Youngblood, 173 Ariz. at 511-14, 844 P.2d at 1161-64 (Feldman, C.J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. We make no finding that the blood was not preserved. There is no conclusive proof that Defendant was unable to perform DNA testing using polymerase chain reaction technology. Thompson \u0026 Ford, DNA Typing, 75 Va.L.Rev. at 50 (polymerase chain reaction technology can be used to \"type' the DNA in a single hair.\"). Nor is there any indication that the DNA deteriorated to the extent that independent testing could not be performed. Charles L. Williams, DNA Fingerprinting: A Revolutionary Technique in Forensic Science and Its Probable Effects on Criminal Evidentiary Law, 37 Drake L.Rev. 1, 6 (1987-88) (indicating that DNA testing can be performed on samples at least five years old).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Defendant also challenges certain pretrial statements made by the trial Judge. Although these statements may have put Defendant on notice of any basis to challenge the Judge for cause, Ariz.R.Crim.P. 10.1, \"remarks made outside the hearing of the jurors, even if prejudicial to the appellant, could not keep the jury from exercising an impartial judgment on the merits, and do not warrant a reversal.\" State v. Williams, 113 Ariz. 14, 16, 545 P.2d 938, 940 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Defendant's real objection may be with Roscoe itself. Defendant seeks to graft onto Roscoe an additional requirement that a tracking dog cannot be taken off the scent and given a fresh start. We decline to revise the clear Roscoe requirements by relying, as does Defendant, on one of the many cases cited in a case distinguished in Roscoe. See State v. Storm, 125 Mont. 346, 238 P.2d 1161, 1176 (1952), cited in Terrell v. State, 3 Md.App. 340, 239 A.2d 128, 132-33 n. 3, 137 (1968), in turn cited in Roscoe, 145 Ariz. at 220, 700 P.2d at 1320.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Whatever made it clear at trial is not clear from the record on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The trial court found that the murder was heinous and depraved but that, when \"compared to other murder cases, the murder was not especially heinous and depraved within the legal meaning.\" But see Roscoe, 145 Ariz. at 226-27, 700 P.2d at 1326-27. Heinous conduct and depraved conduct are not before us. See State v. Richmond, 136 Ariz. 312, 320, 666 P.2d 57, 65, cert. denied, 464 U.S. 986, 104 S.Ct. 435, 78 L.Ed.2d 367 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Defendant argues that we should conduct an independent proportionality review of his death sentence. A majority of the court rejected this procedural mechanism to review the propriety of the death penalty. Salazar, 173 Ariz. at 416-17, 844 P.2d at 583-84.\u003c/span\u003e\n\n",
    "body_length": 207620,
    "citedas": [
      "858 P.2d 1152",
      "175 Ariz. 549"
    ],
    "attorneys": "Grant Woods, Atty. Gen. by Paul J. McMurdie, Barbara A. Jarrett, Phoenix, for appellee. Law Offices of Wendy F. White by Wendy F. White, Flagstaff, for appellant.",
    "category": [
      "36",
      "78"
    ],
    "judges": "En Banc. Feldman, Chief Justice. Moeller, Vice C.J., and Corcoran, Zlaket and Martone, JJ., concur.",
    "citation_count": 376
  }
}
