{
  "id": "rc_5YWYBTlTomsSBBELW",
  "document": {
    "title": "Roussalis v. Wyoming Medical Center",
    "full_title": "LOUIS J. ROUSSALIS, M.D. AND JERRY LEE YOUMANS, M.D. (PLAINTIFFS), V. WYOMING MEDICAL CENTER, INC., A WYOMING CORPORATION (DEFENDANT).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "2000-04-20T00:00:00.000Z",
    "docket": "No. 96-219",
    "body": "Appeal from the District Court of Natrona County Honorable Nancy J. Guthrie, Judge\n\nDr. Louis J. Roussalis and Dr. Jerry L. Youmans (the doctors) appeal from the district cour's summary judgment order in favor of the Wyoming Medical Center, Inc. (WMC) in the doctor' action for breach of contract, anticipatory repudiation, and tortious breach of the implied covenant of good faith and fair dealing arising from the failure of the partie' transaction in which the doctors would give their existing medical office buildings to WMC in exchange for a new medical office building to be constructed for them by WMC. We reverse and remand.\n\nHaving adopted a plan for improving, renovating, and updating Memorial Hospital of Natrona County in Casper, Wyoming, which it operates, WMC determined that a westward expansion of the hospital was appropriate. Key to that westward expansion was WM's acquisition of land west of the hospital, on which the doctor' medical office buildings were located. Following several months of negotiation and consideration of several draft documents, the parties signed a four-page written document entitled Letter of Intent Section 1031 Exchange Agreement prepared by WMC. Under the terms of this document, which the doctors contend was later orally modified in several respects, WMC promised to build and convey to the doctors a new medical office building to be located on land to the south of the hospital and the doctors promised to convey to WMC their existing medical office buildings and the land on which those buildings were located. The plan was for the new medical office building to be constructed first, then the doctors would move from their existing buildings into the new building, the existing buildings would be demolished, and the hospital expansion construction would encompass that land. Upon the strength of the partie' executed document, WMC secured approval of a $31.8 million revenue bond issue to finance the hospital expansion construction. Site preparation for the new medical office building began and was completed, and construction of that building began. Differences concerning the cost of and enhancements to that building later developed between the parties. After several months into the project, WMC halted construction. The parties discussed but were unable to resolve their differences. The doctors filed suit for specific performance and later amended their complaint by deleting that claim and asserting the money damages claims of breach of contract, anticipatory repudiation, and tortious breach of the implied covenant of good faith and fair dealing.\n\nFollowing discovery, WMC moved for summary judgment on all claims. With respect to the doctor' breach of contract claim, WM's primary ground for summary judgment was that a binding agreement had not been formed because the parties failed to achieve mutuality of assent on the projec's scope and cost. As a precaution, WMC also raised alternative summary judgment grounds should that primary ground fail. These alternative grounds were: (1) oral modifications to the alleged agreement, including an increase in the size of the building (from 9,500 square feet to 11,900 \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e square feet), the addition of numerous luxury features, and a nearly finished full basement instead of a roughed-in full basement, failed for lack of consideration; (2) the alleged modified agreement was not in writing and was, therefore, barred by the statute of frauds; (3) the alleged agreement was invalid for unconscionability because the doctor' interpretation of the alleged agreement imposed no practical restrictions on the cost of the new building and the high quality of the new buildin's features; (4) the parties rescinded the alleged agreement, but if rescission did not occur, then the elements of promissory estoppel in a rescission context were satisfied; and (5) the doctor' demands regarding the new buildin's design and high quality features constituted a prior material breach of the comparability provision in the agreement and of their duty of good faith and fair dealing arising from the alleged agreement.\n\nWith respect to the doctor' anticipatory repudiation claim, WM's ground for summary judgment was that WM's conduct did not evince a distinct, unequivocal and positive intention to refuse performance in the future. With respect to the doctor' tort claim for the breach of the implied covenant of good faith and fair dealing, WM's ground for summary judgment was that the tort claim has been recognized only in two contexts, long-term employment contracts and first-party insurance contracts, and should not be recognized here and the predicate special relationship of trust and reliance between the parties upon which the claim rests was missing.\n\nThe district court granted WM's summary judgment motion, ruling simply that there was no contract because A[t]here was no meeting of the minds as to the nature of the project, the cost of the project, or how the cost was to be determined.@ Because each of the doctor' claims was predicated on the existence of the agreement, the district cour's ruling that no agreement existed effectively disposed of all the claims.\n\nRecognizing that this Court can affirm a summary judgment upon any proper legal ground, even if different from the ground on which the district cour's judgment rests, the parties have discussed in their briefing and oral argument to this Court not only the primary ground but also each of the alternative grounds advanced by WMC below. Necessarily, therefore, we must consider each of the grounds briefed and argued in order to provide a complete review of this appeal.\n\nAs we begin our review, we remember that, in another summary judgment setting, a wise jurist not long ago observed:\n\nIt is difficult to decide, in Holme' phrase, where the axe should fall, because my brothers and I are expressing value judgments.\n\nWe are governed by beliefs about facts more than by abstract rules. We derive these beliefs more from practical standards and views about the allocation of competence between judge and jury than by logically determinable or empirically observable data. We are deciding, I suppose, what bubbles C intellectual, philosophical and jurisprudential C are at the moment most in need of pricking. Deepwater Investments v. Jackson Hole Ski Corp., 938 F.2d 1105, 1112 (10th Cir. 1991) (Aldisert, Circuit Judge, dissenting).\n\nBecause the question whether the parties intended an agreement is a factual one, not a legal one, and, except in the clearest cases, the question is for the finder of fact to resolve; because we review the evidence submitted in connection with a summary judgment disposition in the light most favorable to the non-moving party, here the doctors; and because we find the existence of genuine issues of material fact about the partie' intention and about the other matters relating to WM's alternative grounds for summary judgment, we determine that our proper course is to reverse the district cour's summary judgment and remand this case to that court for trial.\n\nISSUES\n\nThe doctors present this single issue:\n\nDo the materials submitted to the district court on Appelle's motion for summary judgment show the existence of any genuine issue of material fact as to the existence of a contract between the parties?\n\nWMC presents these issues for our review:\n\n1. Whether the district court erred in granting summary judgment for defendant-appellee Wyoming Medical Center, Inc. (AWMC@) on the grounds that there was no meeting of the minds of the parties.\n\n2. Whether the district cour's decision can be sustained on any of the alternative grounds for summary judgment presented to the district court, including:\n\na. Lack of consideration;\n\nb. Unconscionability;\n\nc. Rescission;\n\nd. Statute of Frauds;\n\ne. Defects in appellant' claims for breach of the duty of good faith and fair dealing, and anticipatory repudiation.\n\nf. Interference.\n\nFACTS\n\nWe believe that a detailed objective recitation of the facts in a chronological context is necessary to an understanding of our resolution of the issues. In their briefs to this Court, the parties have each included so-called statements of facts which we have found largely to be argumentative in nature and content, necessitating on the Cour's part a time-consuming, arduous, and detailed examination of the record. In their statements of facts, the parties in essence ask this Court to weigh the facts. It is worth remembering that this Court on summary judgment does not weigh facts; it determines only if genuine issues of material fact exist.\n\nAs required by our standard of review for summary judgment, we view the record, and the reasonable factual inferences drawn from it, in the light most favorable to the doctors as the non-moving party. We have arranged the facts into three separate phases: (1) Pre-Letter of Intent actions; (2) Letter of Intent; and (3) Post-Letter of Intent actions.\n\n1. Pre-Letter of Intent Actions.\n\nWMC is a non-profit corporation organized by the county to operate Memorial Hospital of Natrona County in Casper, Wyoming. WMC is run by a board of directors (Board) appointed by the medical staff, the community, and county commissioners. The Board is overseen by the Board of Trustees of Memorial Hospital of Natrona County (Trustees), a board appointed by the Board of County Commissioners of Natrona County. WMC leases the land, buildings and equipment of the hospital from the Trustees in accordance with an operating lease.\n\nIn 1986, the Board adopted a ten-year plan for improving, updating and renovating the hospital which required acquisition of only one parcel of land to the east of the hospital. In 1992, the Board hired Lin Carriger as its president and chief executive officer. Carriger envisioned transforming WMC into a regional medical center working in partnership with an integrated statewide network of physicians and persuaded the Board to build a $45 million acute care facility to be constructed on new land, adjacent to the existing hospital site. It was determined that the greatest cost savings would be realized by a westward expansion of the hospital which required the acquisition of several parcels of privately owned land. Bonds would finance the expansion. In order to secure approval for the bonds from the county and a top-rated underwriting firm, WMC had to secure contracts for the purchase of these properties as soon as possible. An additional financing concern was seizing an opportunity to save on interest costs by implementing construction within a certain time period. WMC decided to take advantage of the available interest costs savings and scheduled the expansion construction accordingly. The schedule could not begin, however, until WMC acquired the necessary properties. Two of these properties belonged to the doctors, each of whom had a medical office building on the properties which housed their separate medical practices.\n\nIn early November, 1994, Carriger and WMC counsel, Richard Williams, met with the doctors and their accountant to discuss concepts involving WM's acquisition of the doctor' properties and WM's providing comparable office space and other remuneration to the doctors in exchange. WMC offered to purchase the doctor' properties but the doctors did not want to sell because their current offices best served their particular circumstances. Dr. Youmans suffers from debilitating arthritis. The location of his offices permitted him to make his hospital rounds by just crossing the street. A move would have required his driving to the hospital and parking, activities which are difficult for him. Dr. Roussalis had built ten years earlier an expensive, state-of-the-art medical office building because he wanted to work in comfort and was able to rent out part of it and receive good income; both doctors planned to sell their buildings eventually to finance their retirement. Carriger convinced the doctors that they were standing in the way of what was best for the hospital and promised them that he would build them a replacement building which would not only be comparable to Dr. Roussali' offices, but would provide better facilities and access.\n\nOn December 21, 1994, WMC counsel Williams described in a letter to the doctors the various ideas discussed by the parties to that date about the possible exchange, the doctor' goals in that regard, and a six-point offer he was prepared to recommend that WMC make to them. On December 27, 1994, WMC counsel Williams, after a discussion with Dr. Youmans, wrote the doctors another letter in which he clarified several issues in his December 21 letter. Williams then drafted a succession of proposed letters of intent on February 8, 1995, and February 28, 1995, each of which contained WM's offer to the doctors. At WM's board meeting on February 8, the Board authorized its administration to enter into an exchange agreement with the doctors for a new 8,000 square foot office building with a cost cap of $150 per square foot. The doctors responded that, before they would agree to a cost cap, they wanted to see the final plans and specifications and design of the new office building so they could determine what they were agreeing to.\n\nCarriger reported the doctor' position on the cost cap to WM's board. In his February 28 memorandum to the doctors accompanying a revised draft of a letter of intent, WMC counsel Williams stated:\n\nAttached is the revised letter agreement . . . . I have struggled with some way to incorporate a maximum construction cost, which was a concern of the Board, but I do't see any way to do that at this point in time, so I need to proceed without that figure in the agreement.\n\nCarriger and Williams had discussed that potentially the final plans and specifications and design drawings of the doctor' new medical office building would not be ready for four to six months. Carriger did not want to wait that long. As explained by WMC counsel Williams, WMC was working on the revenue bonds and was Ain a political place where we were trying to--to gather the support of the medical staff for the new hospital, which was a sore political issue because of prior stops and starts.@ Moreover, WMC needed to have a written agreement or commitment of some type for the land on which the expansion would occur in order to be able to make its presentation to the rating agencies and bond insurers. The Abond people@ were putting time pressure on WMC. If WMC moved quickly it could save several million dollars on interest expense because of attractive interest rates. According to WMC counsel Williams, Awe talked at the board level about taking a leap of faith, if you will, to--that we could do the [doctor'] transaction without having that safety hook [of a cost cap].@ As Williams explained in October, 1995, in a prepared press release for WMC, A[WMC] took a good faith business risk in proceeding with the construction of the new office building prior to having the final cost determined, in order to facilitate the construction schedule of the new hospital and to take advantage of the favorable bond market.@ WMC decided to go forward with the agreement with the doctors without a cost cap. Williams would later explain:\n\nThe concept of the transaction has always been that the Areplacement@ building would be the type of building that Dr. Roussalis would build if he were building a building of the same type of state-of-the-art quality (technologically and aesthetically) which was included in his current office when he built it 10 years ago. Dr. Roussalis built a very nice, and very expensive, building ten years ago ($132/ft.). As you can see, this is somewhat of a different concept than a straight replacement building, where the limits are clear that only those features that are in the current building may be included in the new building. I appreciate that this is a very open-ended concept but I can tell you that this was the essence of our agreement, and was the critical factor in the physicians agreeing to relocate. That is the intent and spirit of the letter agreement.\n\n2. Letter of Intent.\n\nThe parties signed the document \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e from which this lawsuit arises on March 2 and 3, 1995. The opening and closing paragraphs of this document contain language which addresses the legal effect of the partie' signing the document. The opening paragraph reads:\n\nIn executive session on February 8, 1995, the Board of Directors of Wyoming Medical Center ( AWMC@ ) authorized the following offer to be extended to you for the exchange of your existing medical office buildings for a new office building, to be constructed by Wyoming Medical Center, which exchange would qualify under Section 1031 of the Internal Revenue Code. By signing this letter of intent, you are agreeing to a legally enforceable contract for this exchange upon successful and acceptable completion of all of Wyoming Medical Cente's obligations as described in this letter.\n\nThe closing paragraph reads:\n\nThis agreement is binding in all of its aspects upon WMC and Physicians and their respective heirs, successors and assigns. By the signature below, Wyoming Medical Center, Inc. intends to be legally bound by the terms and conditions set forth in this letter. If you agree to this exchange arrangement, please execute this letter of intent in the space provided below.\n\nVery truly yours,\n\nLindel L. Carriger President, Wyoming Medical Center\n\nWith respect to the inclusion of the first sentence of this closing paragraph which added the doctor' heirs, successors and assigns, WMC counsel Williams, who wrote the document, as well as the earlier drafts of the document, later explained:\n\n[A]s I was doing the last draft, it popped into my mind what would happen if Dr. Roussalis died halfway into the building or if Dr. Youmans died. I wanted it clear that we would't have half a building sitting there with a partial owner that never agreed to anything.\n\nUnder the heading New Medical Office Building, in numbered paragraphs 1, 2, 3, 4, 5 and 9 of the document, the parties described the nature of the building project:\n\n1. NEW MEDICAL OFFICE BUILDING\n\n1. WMC will contract with Michael Gurkin, d/b/a Gurkin Construction Co., to construct an approximately 9,500 square foot medical office building, with a full roughed-in basement, to be located on Lots 1,2,3 and 4, White's Addition to the City of Casper, and Lots 17,18,19 and 20, Natrona Heights Addition to the City of Casper, which lots comprise approximately 48,000 square feet. This building size represents an equivalent amount of square footage from your existing buildings, as adjusted for ADA compliance, space required for the pilot computer project, and additional stairway and related office requirements. This eight- block area is located on Third Street, between Washington and Melrose Streets. It is acknowledged that the City of Casper will require an alley to be located on the southernmost portion of this parcel, extending at least from Washington Street to the existing north/south alley.\n\n2. The floor plan of the new building, including the location of all suites, common areas and exam rooms, and the parking configuration for physicians, staff and patients, shall be at the discretion and direction of Drs. Roussalis and Youmans ( APhysicians@ ), and shall be based on architectural and/or engineering drawings which are approved by Physicians. It is anticipated that physician, and possibly staff, parking will be located in the rear of the new facility. All parking will have adequate lighting ( photo cell or comparable ) for safety and aesthetic purposes.\n\n3. The specific features which will be incorporated into the design and construction of this new medical office building are listed on Exhibit A to this letter of intent. It is the general intent of the parties that the new building will be of comparable quality to the building which is currently occupied by Dr. Roussalis, i.e. that the new building will be a replacement building of the same high quality and state-of-the-art which was built into the existing building owned by Dr. Roussalis. The list on Exhibit A is not meant to be exhaustive of all features of the new building, but is representative of the types of high quality features which the new facility will incorporate.\n\n4. The quality of the interior of the building shall be equal in quality to the quality of the interior space of Dr. Roussali' current building, including woodwork, cabinetry, carpet and general finish and interior furnishing. Tom Judy will direct the interior design, and Martin Sheldon or a similarly qualified finish expert will be in charge of the woodwork in the new building.\n\n5. The exterior design of the new building will be of comparable quality to Dr. Roussali' existing building, and the design for the exterior shall be acceptable to and approved by Physicians.\n\n9. As further consideration for this exchange, WMC agrees to incorporate into the design and construction of the new facility a state-of-the-art computer system, which will be networked into the new information system which WMC is in the process of purchasing. Physician' new facility shall serve as a pilot project for integrating physician' private practices into one information system. Included in this information support component will be all necessary hardware and software, including upgrades, and this support will be provided at no cost to Physicians until such time as the product is developed to the point of being commercially available to Casper physicians in general, at which time Physicians may be charged only for any additional upgrades of the system then in place.\n\nNumbered paragraph 6 of the document addressed aspects of coordinating the architectural design, WM's payment for all design work, and identification of contractor Gurkin as the doctor' representative in both the design and construction phases of the project. Numbered paragraph 7 addressed the partie' warranty deed transfers of their respective properties and closing matters which would occur upon completion and the doctor' written acceptance of the building. Numbered paragraph 8 of the document addressed WM's payment of the doctor' moving costs and reimbursement of the doctor' revenue loss attributable to the relocation of their practices. Although several other provisions of the document need not concern us, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e another provision that is pertinent was the Aguaranteed buy- back@ provision under which WMC agreed to purchase the new building from the doctors at any time during the first twenty years after the exchange for a purchase price equal to the greater of the actual cost of the new building, including the land, or $1.25 million.\n\nWe also note what the document does not contain. The document does not contain a limitation or cost cap on the buildin's cost; and the document does not contain a provision that the parties will agree in the future on a construction cost figure.\n\n3. Post-Letter of Intent Actions.\n\nAfter the doctors and WM's authorized representatives signed the document, WMC counsel Williams reported to the WMC board Athat signed contracts with [the doctors] have been secured. Demolition of the existing buildings [on the land south of the hospital] will begin in mid-April and construction of the new office building will begin in June.@\n\nThe partie' signing of the document in early March, 1995, triggered a number of events as the project moved forward. Looking at a construction period of about one year and a completion date of June, 1996, WM's Carriger on March 3, 1995, wrote Michael Gurkin informing him that WMC and the doctors had Acontractually agreed to exchange the properties . . . upon WMC completing construction of a new medical office building;@ WM's letter to Gurkin Arepresents [WM's] legally binding commitment to Gurkin Construction to enter into a contract or contracts for all of the construction work in connection with this project;@ A[u]pon completion of the necessary design and engineering work, [WMC] would anticipate signing a standard AIA Document A111 construction contract . . . which would contain Gurkin Constructio's guaranteed maximum price for the project;@ and WMC Aauthorizes Gurkin Construction to negotiate a contract with Anderson DeBartolo Pan for the design of the project, and to authorize that entity to begin the design work.@ WMC believed that the June 1996\n\ncompletion date Awas critical timing in the building schedule of the new hospital (in order to avoid building over two full winters).@ It is interesting to note that WMC had earlier hired Anderson DeBartolo Pan near the end of January, 1995, and that design firm had furnished WMC some preliminary drawings before Carriger wrote his letter to Gurkin. According to Williams, by March 3, Anderson De Bartolo Pan Awas working mightily.@\n\nWe note here that, from the record, and the reasonable inferences drawn therefrom, it is evident that this project proceeded differently from the way most construction projects proceed. According to Gurkin, Amost projects are--are drawn and built--or drawn and designed a year before they are bid. We were in a situation where it was all together.@ He talked to WMC about this, Aget the plans drawn, let me give you a price, and then build the building.@ According to Gurkin,\n\n[f]rom the beginning, WMC pushed for an early completion of the building. This meant expending substantial funds in design and construction costs before the final plans and specifications were prepared. On at least three occasions between January and July of 1995, I asked Dick Williams if it would't be better to delay actual construction of the building until the design and specifications were finalized, so that a cost estimate could be prepared. On each occasion, Dick Williams instructed me to proceed with the project so as to be completed as early as possible.\n\nSometime in March, 1995, Carriger approved an increase in the square footage of the medical office building from about 9,500 square feet to about 11,900 square feet. Several pieces of evidence bear this out and explain the increase. In his deposition, WM's Williams testified that Carriger Atold me that he had approved the addition of a connecting space in between . . . the doctor' . . . suites and the rental suites.@ In his deposition, Dr. Roussalis testified that Carriger had approved the size increase, explaining that a substantial amount of the increase, about 1,100 to 1,300 square feet, was the result of enclosing the connecting space and was driven by safety considerations. According to Dr. Roussalis, early in the design drawing phase the architects (Anderson De Bartolo Pan) and the doctors realized that the unenclosed connecting space would cause a wind tunnel effect which was considered dangerous. The solution arrived at was to enclose the space; that enclosed area became an atrium or walkway. The remaining amount of size increase was attributable to some necessary changes in the tenant area and the addition of a canopy. The site plan agreement between WMC and the City of Casper, dated July 18, 1995, references an 11,833 square foot building. Mr. Gurki's letter to WM's Williams dated July 19, 1995, references an 11,900 square foot building. Upon receiving WM's authorization to resume construction on July 19, 1995, Mr. Gurkin poured an 11,900 square foot foundation. In a letter to Williams dated August 25, 1995, Peter Trice, of the architectural firm Anderson DeBartolo Pan, explained the size increase in this way:\n\nProgram Issues\n\nIn our letter to Mike Gurkin dated February 23, 1995 (copy attached), we had reviewed the building program with respect to the tenant spaces. This document identifies the rationale for increasing the buildin's tenant spaces from 8,500 sf to 9,890 sf. During the design process, certain program elements were added such as:\n\nToilet, Mrs. Rousalli' Office 30 sf.\n\nExams Rooms Enlarged 80 sf.\n\nMrs. Youman' Office Enlarged 25 sf.\n\nOne Procedure Room Enlarged 30 sf.\n\nStaff Lounge Enlarged 25 sf.\n\nTotal 250 sf. x 1.35 337 sf.\n\nThe final build program for tenant spaces was therefore 10,227 sf. (9,890 + 337). The actual design required 10,188 sf to accommodate these services. This is less than .5% variance from the program.\n\nThe remaining square footage is for building circulation and support space.\n\nStairs 370 sf.\n\nElevator 60 sf.\n\nLobby 1,194 sf.\n\nTypically, multiple tenant medical office buildings require 20- 25% additional square footage to allow for building support space, circulation and mechanical spaces. For this clinic, the final design required an additional 1,624 sf. or about 16% (excluding the mechanical space located in the basement). When this number is added to the revised tenant space program, the gross building square footage equals 11,812 sf. extremely close to the final design amount of 11,800 sf.\n\nIn a prepared statement dated October 5, 1995, which WMC issued to media representatives, WMC explained the size increase:\n\nAs the design progressed, the size of the building was increased, to take into account the requirements of the Americans With Disabilities Act and a pilot computerization project, as well as increased common areas which arose as a result of combining medical offices. Additionally, WMC agreed to a full basement, since there appeared to be at that time a probability that WMC would in the future re-acquire the property, and that additional space would be useful. The final size of the building was 11,800 square feet, with a full basement.\n\nFinally, in his affidavit dated November 13, 1995, WM's counsel Williams stated, in relevant part:\n\nAfter signing the Letter of Intent, WMC cooperated with [the doctors] by, among other things, expanding the size of the New Building beyond the 9,500 square feet provided for in the Letter of Intent, to 11,900 square feet.\n\nNear the end of March or in early April, 1995, Williams participated in presentations to bond rating agencies and bond insurers in connection with the anticipated approval and issuance of revenue bonds to finance a substantial part of the hospital expansion project.\n\nOn April 17, 1995, WM's counsel Williams received Gurki's rough preliminary estimate of construction cost of the medical office building. The estimate was $2.1 million based upon a 9,850 square foot building, or about $215 per square foot, apparently not counting the full basement. On April 21, 1995, WMC signed a letter agreement with Gurkin which confirmed WM's obligation to pay the architectural and engineering costs of the medical office building and Gurki's associated costs, expenses and billing. On April 25, 1995, WMC held a press conference to announce the hospital expansion project and the doctor' new medical office building. At WM's request, Dr. Roussalis attended and spoke briefly.\n\nOn May 2, 1995, the county commissioners of Natrona County approved proceeding with the revenue bond issue for financing the hospital expansion. On May 10, 1995, WMC board members learned that the revenue bond issue matters were progressing well and the plans for the doctor' new medical office building were nearing completion. On May 16, 1995, the WMC board and the hospita's trustees approved a resolution authorizing the revenue bond issue. That evening, the county commissioners approved the revenue bonds. On May 22, 1995, WM's Williams signed a site application plan which was then submitted to the City of Casper, showing that WMC, as Aowner,@ was constructing a AMedical Office Building for Dr.=s Rousallis [sic] and Youmans@ on eight lots and listing Gurkin as Aowne's authorized representative.@ On May 26, 1995, Gurkin wrote to Williams informing him that the projected costs for architects and engineers to complete the design of the doctor' building were more than $225,000. On May 30, 1995, Williams signed a $346,262 work authorization for Gurkin to proceed with demolition of the houses located on the eight lots where the doctor' new building would sit.\n\nIn early June, 1995, the $31.8 million revenue bond issue was finalized, and the proceeds were received by Norwest Bank Casper, trustee of the bond funds. From March through the summer months, 1995, the doctors Awere putting in countless hours on the design of the new clinic.@ According to Gurkin, he had night meetings with the doctors at which they would go through every room and make sure that each room had in it what it was supposed to function as. Gurkin commented that A[t]he doctors were buried. They were to the point where they could't keep up with me, and I was loading them up.@ He emphasized A[a]nd we are loading them. When I say \u003eloading them,= I mean we are loading them.@ In the design phase and in the early stages, Gurkin met often with WM's Williams to keep him informed.\n\nIn early June, 1995, Gurkin proceeded with demolition work to clear the medical office building site. Excavation of the basement soon followed.\n\nOn June 26, 1995, Carriger died in a river rafting accident during a WMC executive retreat. Margo Bean, chairperson of the WMC board and a signatory of the March 2 document, assumed Carrige's responsibilities.\n\nWMC and the City of Casper signed a site plan agreement for the doctor' new building dated July 18, 1995, showing an 11,833 square foot building. On either July 18 or 19, 1995, Margo Bean and WMC counsel Williams discussed the need Ato get a handle on what the cost of the building was going to be.@ Bean directed Williams to ask Gurkin for an estimated cost of the building. Williams talked to Gurkin at the building site. Williams told Gurkin that he (Williams) was in a situation where Bean and the WMC board wanted to get a cost figure on the building. Gurkin told him that, although he did not have enough information to give him a cost figure because the final design and specifications were several weeks away, he would put something together based on what information he had. Gurkin also told Williams that he (Gurkin) needed to know how to proceed because he would be spending $100,000 in the next week; the foundation was going to be poured soon and substantial money would be going in the ground. Gurkin responded quickly to William' request for a cost figure with a letter to Williams dated July 19, 1995, referencing their meeting at 9:00 a.m. earlier that day. The full text of the letter reads:\n\nDear Mr. Williams,\n\nAfter I left our meeting today I went to see Gorder/South to see at what stage of development the plans were. Our target date has been and continues to be August 3 for the completion of plans for the medical building for Drs. Youmans and Roussalis. In our meeting this morning you had indicated to me that you need the best idea on cost at this time. If we receive plans on August 3, I anticipate that Gurkin Construction Co. can give you a firm price by August 21. At this time changes are being made and all approval in design, cabinetry, and interior finish have not been done. Our mechanical, electrical, interior design, and outside improvements are between 70% and 80% complete. Our interior layout is in the approval stage for Drs. Youmans and Roussalis to overview before final documents and drawings can be completed.\n\nIt would be very difficult at this time, if not impossible, for me to shoot from the hip with a price. I will give you the information I feel might best help you with the data on the medical buliding [sic] at this time. The building consists of approximately 11,900 square feet with two outside canopies. The downstairs basement is approximately 11,900 square feet also. The basement has a finished ceiling and finished interior walls with outside walls exposed. It has no flooring in the basement. The type of medical facility this is consists of fairly small offices and working areas and the cost per square foot has been increased due to the quality of each office, exam room, and work area. The electrical and plumbing has been increased substantially to accommodate [sic] the facility because of lab rooms, procedure rooms, and exam rooms throughout. The tenant' side is very basic but nice. It is state of the art. The building as it has been designed and developed to this point is of high quality throughout. It will not be inexpensive to build as the quality throughout is maintained on both the doctor' side and the tenant' side. My best guess at this time, with the plans still in progress, is to square-foot the project based on past projects built and interpolate costs as I see them. It is a reasonable guess that costs are as follows:\n\n11,900 S/F at $180.00 per S/F main floor - $2,142,000\n\n11,900 S/F at $45.00 per S/F basement - 535,500\n\n$2,677,500\n\nI feel that $2,677,500 is a reasonable guess at this time based on the quality and the large area with so many small exams, med labs, and offices. There are fifty-four substantial items of cost in this project. If each item of cost can be affected either in savings or upgrade, this project can flow either up or down $5,000 per item. At this time there is no way to pin down each ite's cost until the plan, all its changes and approvals are complete. It is always something to consider that a project this size can have and should have an override of 5% to 10% for changes as the projects develops. With a complete set of plans and no changes, Gurkin Construction Co. will build this project for the exact amount agreed upon.\n\nI hope this helps in some way to give you information you have asked for. If you can give the project a budget, I am willing to meet that budget but the approval for that would have to come through Drs. Youmans and Roussalis. I would be glad to meet with you or anyone on your staff to find ways to work with the hospital, while at the same time keeping the doctor' interest in meeting the requirements that they have placed on me. Please let me know if you have any further questions or if I can be of further assistance to get this project underway.\n\nAlthough it is unclear, Gurkin possibly met again with Williams that day before delivering the letter to him, and Gurkin orally gave Williams the $2,677,500 Areasonable guess.@ Williams asked him what the consequences would be of shutting down the project until the WMC board could meet. Gurkin replied that he might lose Ahis scheduling advantage, his place in the schedule for the various subcontractors, and that it could set him back as much as ten days.@ Williams directed Gurkin to shut down the project.\n\nAround 5:00 p.m. that afternoon, Williams and the WMC board held an emergency board meeting. Williams distributed copies of Gurki's letter to all of the board members. He informed the board members that he had shut down the project. A lengthy discussion followed. The board also reviewed the March 2 Letter of Intent. According to Williams, board member Dallas Laird spoke Aabout three quarters of the meeting,@ making comments to the effect that we knew that this was going to be an expensive building; that the Letter of Intent was very open-ended; that we had drafted the Letter of Intent, it would be construed against us; that until we got the final price and final specs and had someone--some outside source prepare [sic] [compare] what was in the final plans and specs with what was in the Letter of Intent, that we were't in the position to make a final decision. He also wanted to pursue getting an outside opinion on the inurement issues, because his argument was that we signed the Letter of Intent and should-- should comply with it. And unless we can say that there is something in the $2.6 million that does't comply with the Letter of Intent, we should go forward with the project.\n\nDr. Bailey and Dr. Maddy both talked about keeping our eye on the hospital expansion.\n\nAccording to Williams, A[t]he ultimate outcome of the meeting was that Dallas [Lair's] suggestions were accepted.@ The board told Williams to restart the project. According to Williams, the board did not discuss what amount of money it was prepared to spend on the project. Williams called Gurkin that night and told him to resume full operations on the project. Williams sent Gurkin a letter dated July 21, 1995, confirming his directions to resume operations and\n\n[WM's] commitment to you that all of the work which is being done, and which will be done, on the Roussalis/Youmans Clinic prior to the signing of a guaranteed maximum price contract will be paid for, as billed by you. This commitment includes payment for all subcontract work, as well as work and charges of Gurkin Construction Co., Inc.\n\nIn accordance with William' instructions, Gurkin poured the buildin's 11,900 square foot foundation.\n\nAt this point in our narrative of the facts, it is appropriate to return momentarily and briefly to the March, 1995, time period to review WMC conduct which affected the doctor' interests in the project but about which WMC did not inform the doctors until after WMC had received Gurki's final construction cost estimate in late August, 1995. At the time of the execution of the March 2 document, which identified the eight lots on which the doctor' new building would be located, title to those lots was in WM's name. At that time, the operating lease between WMC, on the one hand, and the hospital trustees and the board of county commissioners of Natrona County, on the other hand, did not contain a requirement that WMC convey any acquired properties to the county. WMC had never been asked to convey any of its acquired properties to the county.\n\nIn mid-March 1995, WMC and the county commissioners began discussions regarding changes to be made to the operating lease. Williams, on behalf of WMC, and the county attorney, on behalf of the county, began working on a draft of amendments to the lease. Among the proposed amendments was a provision that all property acquired by WMC became the count's property regardless of how the property was legally titled. In late April and early May, 1995, WMC and the county agreed that the amendment would require WMC to transfer title to its acquired properties to the county before the end of the fiscal year. On May 16, 1995, the amended operating lease was signed. By a warranty deed dated and filed on August 10, 1995, but made effective as of June 30, 1995, WMC transferred to the county all but one of its acquired properties, including the lots on which the doctor' building was being constructed. WMC did not tell the doctors about this conveyance until mid-September, 1995, after WMC became concerned about the projec's high cost. The one WMC property not included in this transfer to the county was a lot for which WMC had given an option to purchase to the Central Wyoming Cancer Treatment Center and Hospice. The expiration date for the option was June 1, 1998. After a discussion on August 2, 1995, between WMC and the Hospice, the latter exercised its option. By warranty deed dated August 14, 1995, WMC conveyed the lot to the Hospice. Although construction of the doctor' building was well under way by August, 1995, WMC did not exclude, as it had the Hospice option lot, the lots committed to the doctor' building from the August 10 deed to the county.\n\nReturning our narrative to the late July to mid-August, 1995, period, at the same time that WMC directed Gurkin to resume full operations on the doctor' building, WMC began exploring, without telling the doctors, the abandonment of the doctor' building project and the relocation of the hospita's westward expansion to the south which would, of course, engulf the lots on which the doctor' building was being constructed. WM's architect for the hospita's expansion project informed WMC that the relocated southward expansion would cost an estimated additional $2.6 million and result in a seven-month delay.\n\nIn early August, 1995, the doctor' building architects delivered the final design drawings, plans, and specifications, and Gurkin immediately distributed bid packages to various subcontractors. On August 21, 1995, having received the subcontractor' bids, Gurkin delivered to and discussed with Williams the long-awaited cost estimate for the doctor' building; it was $3,547,791. That evening Gurkin met with the doctors and they discussed the estimate and the possibility of cost-cutting. The doctors called Williams and arranged to meet the next morning. Gurkin, the doctors, and Williams met the next morning and discussed the estimate, William' concern about the high cost, William' concern about the guaranteed buy- back provision in the March 2 document, the possibility of cost-cutting to make the project work, and the possibility of WM's becoming an equity owner in the building. About a week later, Gurkin and Williams met and discussed the situation. Gurkin was going to develop a list of cuts to present to the doctors; Williams told Gurkin that his (William') read of the WMC board Awas that we were going to need to get the costs down, back around the 2.6 area, or we were going to have problems selling it to the board.@\n\nOn August 30, 1995, Williams and the WMC board met and discussed, among other things, Gurki's estimate, the reasons for the cost, the potential tax problems to WMC posed by the transaction, the cost of the relocation options, and problems concerning the March 2 documen's guaranteed buy-back provision which Williams wanted to renegotiate with the doctors. Williams told the board that the parties were looking for ways to reduce costs and the plans would be reviewed by outside architects to that end. On September 1, 1995, Williams called Robin Dermon of Health Futures Development Group, Englewood, Colorado, to request that fir's review of the doctor' building project. By letter dated September 5, 1995, to Dermon, Williams confirmed their earlier conversation, identified the reasons that the March 2 document was Avery open-ended,@ described the concept of the transaction as captured by the March 2 document, and explained what WMC wanted Dermo's firm to focus on. About the reasons that the March 2 document was Avery open-ended,@ Williams wrote:\n\nThe physicians would not sign any type of agreement with a dollar limitation in it until a complete set of plans and specifications were generated and approved. Because of WM's desire to proceed on the revenue bonding process prior to those plans being completed, and the necessity that the land be under contract prior to issuing the bonds (for rating and bond insurance purposes), the decision was made to leave the agreement open- ended.\n\nAbout the concept of the transaction, Williams wrote:\n\nThe concept of the transaction has always been that the Areplacement@ building would be the type of building that Dr. Roussalis would build if he were building a building of the same type of state-of-the-art quality (technologically and aesthetically) which was included in his current office when he built it 10 years ago. Dr. Roussalis built a very nice, and very expensive, building ten years ago ($132/ft.). As you can see, this is somewhat of a different concept than a straight replacement building, where the limits are clear that only those features that are in the current building may be included in the new building. I appreciate that this is a very open-ended concept, but I can tell you that this was the essence of our agreement, and was the critical factor in the physicians agreeing to re-locate. That is the intent and spirit of the letter agreement.\n\nAbout the focus of the review that WMC was requesting from Dermo's firm, Williams wrote:\n\nWe would like the primary focus to be to identify areas where the project cost might be decreased, while not substantially changing the design or concept of the building. We would like you to focus on the mechanical and electrical systems, and the basement area. Our overall goal is to assist Mike Gurkin and the physicians, in a collaborative effort, to reduce costs, but not quality. We are not in a position to become adversarial with the physicians or contractor. That is why I have asked you to not focus on a comparison of the current building with the proposed building. I can foresee creating only more battles, when what we need is cooperation.\n\nPrior to preparing or submitting any type of written report, please call me to discuss the scope and contents of the opinions you have developed. Obviously, if you [sic] consultants find design deficiencies, we need to know that immediately, even if the net result is an increase in cost of the project. We want the building to be a success in all aspects.\n\nFrom the last of August 1995 until around the second week of September 1995, Gurkin worked on proposed cuts in the estimate. His Aidea was to present this to the doctors. My idea was to get a magic number out of Dick Williams and then get to that number, to make the project go.@ Gurkin took his list of proposed cuts to the doctors. After reviewing Gurki's list, the doctors took the position they wanted to know WM's number before making the cuts. Next, Gurkin talked to Williams. He told Williams Athat the doctors were not willing to cut anything at this time. . . . It--it did't mean they were't going to cut. That was the answer at that time, . . . so he knew where we were at.@ Williams responded, AI told him at that point that I--I did't have anything else to say to him, and that the project was in deep trouble.@\n\nOn the evening of September 17, 1995, the doctors and their wives and the doctor' attorney met with Margo Bean, Williams, county commissioner Bill Brauer, and hospital trustee president Bob Miracle. They reviewed the building projec's problems, the perceived difficulties presented by WM's recently disclosed transfer to the county of ownership of the lots on which the building was being built, and the possibility of rescission of the March 2 document and WM's payment of money to Gurkin and the doctors in connection with that rescission, and finding comparable office space for two doctors who had agreed to be tenants in the new building. The next morning, September 18, 1995, the WMC board and Williams met to discuss the situation. The board authorized Williams to Anegotiate a recision [sic] of the Letter of Intent with the . . . Doctors, though the Board retains the authority to vote on the final transaction.@ The board also authorized Williams Ato negotiate the purchase at appraised value without further approval@ of three pieces of property south of the hospital which were Arequired if expansion to the south [was] considered.@ Following that board meeting, Williams shut down the doctor' building construction project. That same day, Williams wrote WM's $31.8 million revenue bond underwriter informing it that the doctor' building Atransaction, as currently designed and specified [with a $3.5 million cost, not including equipment, furniture, and information system costs], would not be legally supportable from WM's standpoint . . . and we are therefore negotiating the details of an agreement to mutually rescind our contract with the two physicians.@ Williams also wrote that A[i]n anticipation of this potential problem several months ago, we had requested our architects to develop contingency estimates and opinions@ on hospital expansion southward; the southward expansion Ais operationally a totally acceptable alternative;@ and Athere may be some minor delays attributable to this relocation decision.@\n\nThat same day, September 18, 1995, Gurki's attorney met with Williams, and in a letter to Williams dated September 20, 1995, memorialized their earlier conversation regarding William' order to stop construction and Gurki's foreseeable costs and damages claims arising from what Gurkin characterized as WM's breaches of Gurki's contract with WMC. Gurki's attorney also wrote that WMC\n\naccept this letter as a preliminary notification . . . of the damages sustained by Mr. Gurkin in the form of lost profits as well as all other expenses and costs incurred by other individuals or entities which have or were expecting to provide services or construction materials to the project. We are presently unable to fully state all damages suffered by Mr. Gurkin. We will, however, be submitting, as it becomes available to us, substantiation of the damage claim . . . .\n\nThe next day, September 19, 1995, the doctors wrote Williams that Anumerous sources@ were blaming the doctors for the projec's failure; that the doctors were not to blame; and\n\n[i]f there is any serious notion that reasonable cost cuts could be implemented which would still result in construction of the type and quality of building promised by our letter agreement, we would much prefer to go that route. We therefore will meet with anyone, at any time, to discuss any logical effort to carry the project to its successful conclusion.\n\nThe next day, September 20, 1995, Williams responded in a letter to the doctors, writing, among other things,\n\nIn response to the specific suggestion in your letter, WMC would reopen discussions about completing the project, but the cost figure that we would support would be a maximum of $2 million, which would include furniture and equipment. We believe that a building can be built, equipped and furnished for this amount which would comply in all respects with the Letter of Intent. We cannot guaranty that we can obtain County Commissioner approval for the project at this cost, but we will advocate for completion of the clinic at this cost. We would also like to restructure the buy-back provision, to tie the purchase price to some supportable value of your current buildings, or else use an appraised value.\n\nOne other issue that I might as well address at this point is the payments to you if the recision [sic] stands. Lin [Carriger] agreed to pay you for your lost medical practice time, and we will honor that agreement, based on reasonable time and billing rates. It was our understanding after the meeting on Sunday that that was what was going to be submitted. That was the specific question that was raised by Mr. Miracle, and there was no indication at that time that there was going to be a damage claim of any kind. Mark Gifford [the doctor' attorney] now indicates that there will be such a claim. My strong sense from the Board meeting on Monday is that the Board is not willing to pay anything other than the lost practice time. That ultimately will be a Board decision, but I just wanted to be up-front on where I think the Board is on that issue.\n\nObviously, we need to resolve these issues as soon as we can. We are currently actively working on design modifications to relocate the new hospital, and my guess is that word of the change will leak out in the next day or so. If you have interest in pursuing cutting the cost of the project as outlined in this letter and presenting the issue to the County Commissioners for approval, please let Mark know immediately. I have tried to reach both Bill Brauer and Bob Miracle to try to get a feel for where they would stand on this price. I have been unable to contact Mr. Miracle, and Mr. Brauer was unwilling to commit on what position the Commissioners would take. As I have indicated, WMC would strongly advocate for completing the project at that price.\n\nPlease let Mark know your thoughts at your earliest convenience.\n\nOn September 21, 1995, the doctors and their attorney met with Williams, Gurkin, and Gurki's attorney. When Williams was asked if $2 million was the number for which the building could be built, he said that he would have to go to his board. When asked what such a facility would look like, and where the cuts would be made, Williams could not answer those questions.\n\nDuring the month following this September 21 meeting, various WMC representatives made substantively varying settlement overtures to the doctors. Board member Laird made such an overture; hospital trustee president Miracle and county commissioner Brauer made such an overture. The doctors rejected these overtures and demanded completion of the building.\n\nOn October 4, 1995, at a WMC board meeting, Margo Bean told WMC board members that Anegotiations were still underway@ with the doctor' attorney. The board adopted a resolution under which WMC would indemnify any WMC board member or agent for any civil damages liability incurred while acting for WMC. On October 5, 1995, WMC issued to members of the media in a scheduled press conference a prepared statement by Williams. WM's statement included a historical overview of the hospita's expansion project and the doctor' building project; it recited that the WMC-doctor' agreement Ahas been cancelled@ and the hospital expansion would move southward; and it stated:\n\n[WMC] took a good faith business risk in proceeding with the construction of the [doctor'] new office building prior to having the final cost determined, in order to facilitate the construction schedule of the new hospital and to take advantage of the favorable bond market. The ultimate cost of the proposed clinic was too high to proceed, and the decision was made to take the loss associated with abandoning the property exchange, and instead alter the location of the new hospital.\n\nOn October 20, 1995, the doctors filed suit for specific performance of the alleged contract; in December, 1995, they amended their complaint by deleting that claim and asserting instead their several money damages claims as we described earlier. Following WM's answer and the partie' discovery activities, WMC moved for summary judgment, and the district court granted it, as we described earlier. The doctors have timely appealed that summary judgment.\n\nSTANDARD OF REVIEW\n\nSummary judgment is appropriate when Athe pleadings, depositions, answers to interrogatories, and admissions on file, together with the affidavits, if any, show that there is no genuine issue as to any material fact and that the moving party is entitled to a judgment as a matter of law.@ W.R.C.P. 56(c). AMateriality of a fact depends upon it having some legal significance so that it establishes or refutes some essential element of a cause of action or defense asserted by one of the parties.@ Matter of Estate of Roosa, 753 P.2d 1028, 1031 (Wyo. 1988). In any given case, Athe materiality of any facts is limited by the pertinent legal standard[s]@ for the asserted claim and for the corresponding defenses to that claim. Id. at 1032. On appeal, the law assigns to the moving party, here the defendant WMC, the burden to demonstrate clearly the absence of any genuine issue as to any material facts. Id.; Seay v. Vialpando, 567 P.2d 285, 287 (Wyo. 1977). WMC must demonstrate clearly the absence of any genuine issue as to any material facts by using only admissible evidence to support its motion. If WMC has made the requisite demonstration, then the doctors, as plaintiffs, and as the parties opposing WM's motion, cannot rely upon the allegations in their amended complaint; rather, they must, using the submitted materials, demonstrate the presence of material facts which pose genuine issues for trial. Estate of Roosa, 753 P.2d at 1031.\n\nIn reviewing a summary judgment, we do not accord any deference to the district cour's decisions on issues of law, and we examine de novo the entire recordCthe partie' submissions of evidenceCin the light most favorable to the parties who opposed the motion, here the doctors. Id. We give the doctors Athe benefit of every reasonable inference and every doubt,@ Fiscus v. Atlantic Richfield, 773 P.2d 158, 161 (Wyo. 1989), which may be drawn from the materials either supporting or opposing the motion. Estate of Roosa, 753 P.2d at 1031.\n\nLong ago, this Court described an inference to be Athe conclusion drawn on reason from premises established by proof. In a sense, it is the thing proved.@ Wright v. Conway, 34 Wyo. 42, 51, 242 P. 1107, 1110 (1926). In more recent times, we have approved the concept that A[a]n inference is a deduction of fact that may logically and reasonably be drawn from another fact or group of facts found or otherwise established in the action.@ Estate of Roosa, 753 P.2d at 1034. AA properly drawn inference, contrary to direct testimony, can serve to structure a genuine issue of material fact.@ Id. We also have adopted this language:\n\nA reasonable inference is as truly evidence as the matter on which it is based, and is not a mere presumption or guess; appropriate inferences from proved facts are not a low order of evidence, but are just as valid as evidence as statements of eye- witnesses and are to be weighed by the jury along with the other evidence before it and may be strong enough to outweigh positive and direct oral statements. Whether or not they should be permitted to overcome positive and direct testimony depends, in every case, on the relative strength of the one or the other. Id.\n\nIf, upon review of the record, doubt exists about the presence of issues of material fact, that doubt must be resolved against the party carrying the burden, here WMC. Kobielusz v. Wilson, 701 P.2d 559, 561 (Wyo. 1985). If there appears to be no great disagreement about the evidentiary facts, but the evidence is subject to conflicting interpretations or reasonable minds might differ as to its significance, summary judgment is improper. Weaver v. Blue Cross-Blue Shield, 609 P.2d 984, 987 (Wyo. 1980); Fegler v. Brodie, 574 P.2d 751, 753-55 (Wyo. 1978).\n\nDISCUSSION\n\n1. Whether the Parties Formed an Agreement.\n\nIn defense of the doctor' claim of breach of contract, WMC contends that the alleged agreement Awas flawed in its formation@ by the partie' failure to achieve mutuality of assent and definiteness on the scope and cost of the new medical office building. WMC summarizes its position in its brief:\n\nThe lack of a cost term, the absence of an objective standard by which cost could be determined, and the manifestly different understanding and expectations of the parties with respect to cost from the inception . . . illustrates that an enforceable contract never came into being at the inception, or most assuredly as sought here to be enforced.\n\nWMC claims that the cost of the new medical office building is a term essential to the formation of a contract, and the parties did not agree upon that cost, and that cost term was neither included in the Letter of Intent nor established by the partie' subsequent conduct. WMC asserts that the partie' omission of the cost term from the Letter of Intent renders that document Atoo indefinite to be enforced.@ Moreover, WMC relates this Aindefiniteness@ defense to the alleged absence from the Letter of Intent of an objective method for determining the cost of the new medical office building.\n\nFinally, with respect to the nature of the new medical office building, or Athe kind of building to be constructed,@ WMC maintains the parties failed to achieve mutuality of assent and definiteness because of the partie' different interpretations of those provisions of the Letter of Intent which relate to the quality of the buildin's exterior and interior and specific features to be incorporated into the design and construction of the building. According to WM's view, the doctors expected Aa building equivalent to an expensive custom home,@ but WMC expected Aa modern medical office building.@ In this regard, WMC contends that the doctor' interpretation of these Letter of Intent provisions is that cost did not matter, while WM's interpretation is that cost did matter. As evidence of this contention, WMC points to the doctor' bringing in an interior designer, Awhich you do't do if yo're concerned about cost.@\n\nClaiming that the above and foregoing facts are undisputed, WMC argues that whether a contract was formed (mutuality of assent and definiteness of terms) becomes a question of law, citing Robert W. Anderson Homewrecking and Excavating, Inc. v. Board of Trustees, 681 P.2d 1326, 1330 (Wyo. 1984). In other words, WMC argues, as it stated in oral argument, that reasonable minds could only come to the conclusion that no contract formation occurred.\n\nIn reply to WM's contentions, the doctors assert that genuine issues of material fact exist about whether the parties achieved mutuality of assent and definiteness of terms with respect to both the cost of the new medical office building and the kind of building to be constructed. In the doctor' view, the parties achieved mutuality of assent as evidenced by the negotiations preceding the execution of the Letter of Intent, the Letter of Intent itself, and the partie' subsequent conduct.\n\nAbout the cost of the new medical office building, the doctors remind us that the parties specifically negotiated for several weeks about the terms of the Letter of Intent document, especially the Acost@ term. WMC sought a cost cap; the doctors rejected a cost cap until the final designs, plans and specifications of the building were known. WMC did not want to take the time (four to six months) to develop the final designs, plans and specifications from which bids of building cost are calculated before it began construction because WMC was in a hurry to get the doctors committed in order to capture a favorable low interest rate on its construction bonds to finance the expansion project. Consequently, the parties negotiated for the exclusion of the Acost@ term and the inclusion of the doctor' commitment to the exchange of their properties. In other words, in the doctor' view, the parties agreed, purposely and deliberately, to exclude the Acost@ term desired by WMC. From these facts of negotiation and purposeful exclusion of a maximum cost or cost cap term from the subsequently signed Letter of Intent, the doctors argue that a juror could reasonably infer that Acost@ was not an essential term of the partie' contract.\n\nInstead of including a Acost@ term in the Letter of Intent, according to the doctors, the parties included provisions that, in effect, related Acost@ to the quality of the exterior and interior of the building. For example, in numbered paragraph 3 of the document, the parties agreed that their general intent is for the new building to be of comparable quality to Dr. Roussali' existing medical office building; the new building is to be Aof the same high quality and state-of-the-art@ as his existing building. The parties attached Exhibit A to their document which was a representative, but not exhaustive, list of the types of high- quality features which were to be incorporated into the design and construction of the new building. In numbered paragraph 4 of their document, the parties agreed that the quality of the interior of the new building Ashall be equal in quality to the quality of the interior space of Dr. Roussali' current building, including woodwork, cabinetry, carpet and general finish and interior furnishing.@ In this paragraph, WMC expressly agreed that an interior designer and a qualified woodwork finish expert would handle the interior of the new building. With respect to the quality of the exterior of the new building, the parties repeated the Acomparable quality@ standard applicable to the buildin's interior.\n\nIn addition to the evidence of their pre-agreement negotiations and the agreed-upon provisions of the Letter of Intent, the doctors support their position with the evidence of a letter written by WM's counsel which reads in pertinent part that the partie' Aconcept of the transaction@ and the Aintent and spirit of letter agreement@ were that the new building Awould be the type of building that Dr. Roussalis would build if he were building a building of the same type of state-of-the-art quality (technologically and aesthetically) which was included in his current office when he built it 10 years ago.@ According to WM's counsel, this Avery open-ended concept . . . was the essence of our agreement.@\n\nClaiming that the above and foregoing facts, and the reasonable inferences to be drawn from them, create genuine issues of material fact about mutuality of assent and definiteness of the agreement, the doctors maintain that under Wyoming law whether a contract has been formed depends on the partie' intent and is a question of fact. Burg v. Ruby Drilling Co., Inc., 783 P.2d 144, 153 (Wyo. 1989); Wyoming Sawmills, Inc. v. Morris, 756 P.2d 774, 775 (Wyo. 1988). The doctors urge us to apply the rule stated in Engle v. First National Bank of Chugwater, 590 P.2d 826, 831 (Wyo. 1979):\n\nWhile it is essential that the mutual assent of the parties to the terms of a contract must be sufficiently definite to enable the court to ascertain what they are, nevertheless it is not necessary that each term be spelled out in minute detail. It is only that the essentials of the contract must have been agreed upon and be ascertainable. * * * The law does not favor the destruction of contracts on the ground of indefiniteness, and if it be feasible the court will so construe the agreement so as to carry into effect the reasonable intention of the parties if that can be ascertained. Furthermore, it is a well-established principle of law that that which can be made certain is certain.\n\nIn addition, the doctors rely upon the legal principle that the partie' subsequent words, conduct or performance may remove uncertainties in a contract:\n\nA contract which is originally and inherently too indefinite may later acquire precision and become enforceable by virtue of subsequent acts, words, and conduct of the parties. In other words, an uncertain agreement may be so supplemented by subsequent acts, agreements or declarations of the parties as to make it certain and valid. The acts of practical construction placed upon a contract by the parties thereto are binding and may be resorted to relieve it from doubt and uncertainty. Thus, the objection of indefiniteness may be obviated by performance and acceptance of performance. 17A Am. Jur. 2d, Contracts ' 198, at 209 (1991) (footnotes omitted).\n\nFrom our careful consideration of the record, including the reasonable inferences which could be drawn in favor of the doctors, and of the principles of contract formation law, we conclude that genuine issues of material fact about contract formation exist which can only be resolved by trial.\n\nAs we begin our analysis, it is appropriate to keep in mind basic principles. In determining the intent of the parties in contract situations, whether in the context of formation as we have here or in the context of interpretation, we use an objective approach. We have explained:\n\nAn objective test is applied. A part's intention will be held to be what a reasonable man in the position of the other party would conclude his manifestations to mean. Shrum v. Zeltwanger, 559 P.2d 1384, 1387 (Wyo. 1977); accord, Wyoming Game and Fish Com'n v. Mills Co., 701 P.2d 819, 822 (Wyo. 1985).\n\nAs the doctors have correctly pointed out, we have embraced these principles:\n\nWhile it is essential that the mutual assent of the parties to the terms of a contract must be sufficiently definite to enable the court to ascertain what they are, nevertheless it is not necessary that each term be spelled out in minute detail. It is only that the essentials of the contract must have been agreed upon and be ascertainable. * * * The law does not favor the destruction of contracts on the ground of indefiniteness, and if it be feasible the court will so construe the agreement so as to carry into effect the reasonable intention of the parties if that can be ascertained. Engle, 590 P.2d at 831.\n\nWe also agree with this statement:\n\nThe question of what is an essential term is often a question of fact involving a determination of each part's intent to be bound, and thus must frequently be decided by a jury. Panzer v. Shields Development Co., 660 F. Supp. 56, 60 (D.Del. 1986) (reversing summary judgment, the court ruled that issues of fact requiring jury resolution existed on whether the parties formed a binding contract).\n\nWe also recognize that where the existence of a contract or the terms of it is the point in issue, as here, and the evidence is conflicting or admits of more than one inference, Ait is for the jury . . . to determine whether the contract did in fact exist . . . . So, . . . when the terms of the contract are a matter of controversy under the evidence, the question should be put to the trier of the facts as a matter for their determination, and it is not the province of the court to determine and to instruct the jury what the terms are.@ 17A C.J.S. Contracts ' 611, at 1225-28 (1963); accord, Robert W. Anderson Housewrecking and Excavating, Inc., 681 P.2d at 1330.\n\nIn determining whether a contract was formed, we may consider not only the alleged contract but also the conduct of the parties with reference to the alleged contract. Wheatland Irrigation Dist. v. Dodge, 387 P.2d 679, 682 (Wyo. 1963). Their conduct before and after making the alleged contract Amay shed light on their intent.@ I E. Allan Farnsworth, Farnsworth on Contracts ' 3.8, at 184 (1990). A[A] part's subsequent behavior, such as issuing a press release, may be persuasive, especially if inconsistent with the part's later contention.@ Id.\n\nWMC principally relies on the absence of a specific Acost@ figure from the alleged contract, the Letter of Intent document, as its evidence of the partie' failure to achieve mutuality of assent and definiteness on the cost of the new building, which WMC claims is an essential term of the alleged contract. In opposition, the doctors rely not only on the Letter of Intent document, but also on the partie' behavior before and after the signing of that document as evidence of the partie' achievement of mutuality of assent and definiteness on the nature of the new building, the cost of it, and the essential terms of the contract.\n\nThe first part of our earlier statement of the facts accurately described the partie' pre-Letter of Intent conduct. The highlights of the record are as follows:\n\nWMC was committed to its $45 million expansion project, at the heart of which was its westward construction. Because the doctor' properties lay west, WM's acquisition of them was a necessity. The doctors did not want to relocate for a number of legitimate reasons. To persuade them to move, WMC promoted the Astate-of-the-art@ replacement medical office building which would equal in quality what Dr. Roussalis had in his existing medical office building. The new building would represent WM's vision of the partnership achievable between a hospital and a doctor. If WMC moved quickly to secure the doctor' commitment, WMC could affect a $2.6 million saving in interest on its $31.8 million revenue bond. In order to obtain the revenue bond, WMC had to show a binding contract on the doctor' properties. WMC needed to begin construction as soon as possible. WMC approached the doctors and negotiations ensued. WMC desired a maximum construction cost term; it proposed a Acost cap@ of $150/sq. foot. The doctors rejected a maximum construction cost term or Acost cap@ until the design drawings, plans and specifications were developed and final because they wanted to know what the new building would look like. It would take four to six months to develop final design drawings, plans and specifications. WMC did not want to wait that amount of time because of the $2.6 million interest savings if it moved quickly. WMC and the doctors intentionally and deliberately deleted from the Letter of Intent the maximum construction cost or Acost cap@ term. They intentionally and deliberately included the terms which appear in that document. They knew the new medical building project would not be a Atypical@ project in any sense. According to Mike Gurkin, the general contractor, in a Atypical@ construction project, the design drawings, plans and specifications are developed and finalized first; then that package is distributed to the subcontractors who submit bids (construction costs) based on the drawings, plans, and specifications; when the bids are received, the cost of construction is determined, winning bids are accepted, construction contracts awarded, and construction begins. WM's new building project took on strange trappings. Because of WM's Afast track@ requirements, the doctor' new medical building would be literally designed and built Aon the run.@\n\nOur earlier statement of the facts accurately identifies the contents of the Letter of Intent which the parties signed in March, 1995, in culmination of their negotiations. It is true, as WMC argues, that this document does not contain a term stating the Acost@ of the new medical office building. However, as the doctors contend, a juror could reasonably infer that the parties did not intend that a specific Acost@ term be essential to the formation of their contract. This reasonable inference could be drawn from the partie' prior negotiations and the contents of the cover memorandum which WM's counsel Williams attached to WM's final draft of the Letter of Intent. In that memorandum, Williams wrote:\n\nAttached is the revised letter agreement . . . . I have struggled with some way to incorporate a maximum construction cost, which was a concern of the Board, but I do't see any way to do that at this point in time, so I need to proceed without that figure in the agreement.\n\nThe doctors also note that Williams testified, Awe talked at the board level about taking a leap of faith, if you will, to--that we could do the [doctor'] transaction without having that safety hook [of a cost cap].@ From this evidence, a juror could draw the reasonable inference that the parties achieved mutual assent that a Acost@ term was not an essential term of the contract.\n\nAs we read the partie' Letter of Intent, we are struck by the words of present contract formation. For example, in the opening paragraph we find the words Athe following offer,@ A[b]y signing this letter of intent, you are agreeing to a legally enforceable contract for this exchange upon successful and acceptable completion of all of [WM's] obligations as described in this letter.@ In the closing paragraph, we find similar contract formation language: A[t]his agreement is binding,@ and A[WMC] intends to be legally bound by the terms and conditions set forth in this letter.@ As WM's counsel Williams explained, WMC intentionally included in this closing paragraph language specifically binding not only the doctors, but also their heirs, successors and assigns so that they too would be bound in the event one or both doctors died Ahalfway into the building.@ In reviewing the results of other litigation about whether such letters of intent are binding, Professor Farnsworth informs us that A[i]n many cases courts have looked to the degree of formality and the use of legal terminology.@ I Farnsworth, supra, ' 3.8, n.3, at 179-80; and see ' 3.8b, at 193-94. See, e.g., Field v. Golden Triangle Broadcasting, 305 A.2d 689, 692-93 (Pa. 1973), cert. denied, 414 U.S. 1158 (1974) (Athe letter agreement itself, by its terms [describing it as an \u003eoffe'], formality and the extraordinary care in its execution, indicates that the signatories intended to bind themselves to an enforceable contract@); APCO Amusement Co. v. Wilkins Family Restaurant, 673 S.W.2d 523, 527-28 (Tenn. App. 1984) (Ainstrument speaks through words such as \u003eagrees,= \u003eacceptance,= and \u003eaccept' [and] has been dated and signed@); and Reynolds Aluminum Co. v. Multnomah County, 287 P.2d 921, 927 (Or. 1955), cert. denied, 350 U.S. 970 (1956) (Awe find words speaking in the present, not in futuro, such as \u003eseller hereby sell' and \u003epurchaser hereby buy'@).\n\nIn addition to the language used in these opening and closing paragraphs, and the formality and care taken by the parties in drafting and in executing the document, we note that the document neither contains language that the parties will agree in the future about a specific cost figure nor language that they will execute in the future a later writing. Professor Farnsworth notes:\n\nIn doubtful cases, courts have looked to many factors, but no single factor is likely to be decisive. Often the final decision is left to the trier of the facts. I Farnsworth, supra, ' 3.8, at 180-81.\n\nAgainst the argument that the failure to spell out usual terms shows that the parties did not intend to be bound, Professor Farnsworth replies, appropriately we think, Asuch an inference seems unjustified if there is no indication that those terms were to be the subject of further negotiations.@ Id. at 182. We would add the observation that the movant in a summary judgment setting, WMC here, does not enjoy the benefit of inferences; rather, only the non-movant, the doctors here, does. We agree with that said in Berg Agency v. Sleepworld-Willingboro, Inc., 346 A.2d 419, 424 (N.J. 1975):\n\nThe absence of some provisions in a document does not necessarily negate its viability as a binding agreement.\n\nThe key factor is not the absence of any contractual undertakings which may normally be included by contracting parties engaged in a similar transaction. It is rather the intent of the particular parties involved in the transaction at issue. And the presence or absence of essential contract provisions is but an element in the evidential panorama underlying a factual finding of intent and enforceability.\n\nIn our judgment, the contents of the Letter of Intent and the reasonable inferences which a jury may draw from them are evidence which may support a jur's conclusion of the intent of the parties to be bound.\n\nOther provisions of the Letter of Intent provide evidence from which a reasonable juror could conclude that the partie' intention was that the kind of building, not the cost of that building, was an essential term of their contract. From this evidence a reasonable juror could also conclude that the parties achieved mutuality of assent and definiteness about Athe kind of building to be constructed.@ Those provisions include numbered paragraphs one through five and nine of the document. Those provisions speak in terms of Aan approximately 9,500 square foot medical office building, with a full roughed-in basement@ which is Aan equivalent amount of square footage from [the doctor'] existing buildings, as adjusted for ADA compliance, space required for the pilot computer project, and additional stairway and related office requirements;@ A[t]he floor plan of the new building . . . shall be at the discretion and direction of [the doctors] . . ., and shall be based on architectural and/or engineering drawings which are approved by [the doctors].@ Exhibit A to the document is a representative, not exhaustive, list of the types of high quality specific features Awhich will be incorporated into the design and construction of this new medical office building.@ In the words of these parties, A[i]t is [their] general intent . . . that the new building will be of comparable quality to [Dr. Roussali' currently occupied building], i.e. that the new building will be a replacement building of the same high quality and state-of-the-art which was built into [Dr. Roussali' existing building].@ The quality of both the interior and exterior of the new building Ashall be equal in quality@ or Aof comparable quality@ to Dr. Roussali' existing building.\n\nWMC pointedly relies on that provision (paragraph four under the heading New Medical Office Building) which recites that ATom Judy will direct the interior design, and Martin Sheldon or a similarly qualified finish expert will be in charge of the woodwork in the new building@ to support an inference to be drawn in WM's favor that Ayou do not bring in an interior designer if yo're concerned about cost.@ Of course, on summary judgment, favorable inferences are drawn in favor of the non-movant, not the movant.\n\nWith respect to this Ainterior designer@ provision, it must be remembered that WMC drafted this document and agreed to its provisions, including this one. The favorable inference to be drawn in the doctor' favor from this particular provision, using WM's logic, is WMC was not concerned about cost either because it agreed to bring in the interior designer and qualified woodwork finish expert.\n\nKeeping in mind these particular provisions describing Athe kind of building to be constructed,@ we tie in to our analysis at this precise point what WM's counsel Williams wrote on September 5, 1995, shortly after WMC had received Mr. Gurki's estimate of the cost of the new building, when WMC was seeking a review of the new buildin's cost. Williams described the transaction in these words:\n\nThe concept of the transaction has always been that the Areplacement@ building would be the type of building that Dr. Roussalis would build if he were building a building of the same type of state-of-the-art quality (technologically and aesthetically) which was included in his current office when he built it 10 years ago. Dr. Roussalis built a very nice, and very expensive, building ten years ago ($132/ft.). As you can see, this is somewhat of a different concept than a straight replacement building, where the limits are clear that only features that are in the current building may be included in the new building. I appreciate that this is a very open-ended concept, but I can tell you that this was the essence of our agreement, and was the critical factor in the physicians agreeing to locate. That is the intent and spirit of the letter agreement. (Emphasis added.)\n\nThese words provide evidence from which a reasonable juror could conclude that the partie' intention, about what was or was not an essential term of the contract, was what kind of building was to be constructed. Moreover, William' closing words in this letter--to the effect that if the cost reviewer concludes that an increase in the project is in order, WMC needs to know and wants Athe building to be a success in all aspects@--are evidence from which a reasonable juror could conclude that cost was not an essential term of the contract, but that Athe type of building that Dr. Roussalis would build of state-of-the-art quality@ was.\n\nFrom the facts that the parties knowingly and purposely negotiated Aout@ a specific cost figure; WMC did not want to wait four to six months for final design drawings, plans and specifications from which a specific cost figure is typically determined, and the new building was literally being designed and built Aon the run;@ the parties, as evidenced by Exhibit A to their Letter of Intent, expressly contemplated that other high-quality features would be added to the new building as performance proceeded, which additional features would more likely than not increase the Acost@ of the building; a reasonable juror could draw the inference that the parties did not intend a specific cost figure to be an essential term of their contract. From the facts, including those provisions of the Letter of Intent particularly related to the quality of the new building, a reasonable juror could draw the inference that the parties intended a ADr. Roussalis-built@ building to be an essential term of their contract. As WM's Williams put it, that Avery open-ended concept . . . was the essence of our agreement . . . [and] the intent and spirit of the letter agreement.@\n\nWe now turn our attention to the partie' post-Letter of Intent actions as evidence of the partie' mutuality of assent and definiteness about their transaction. Of course, WM's William' September 5, 1995, letter to the Acost reviewer,@ just mentioned above, falls into this category, and will be taken into account, but need not be repeated here. Other post-Letter of Intent actions exist and are described earlier in the statement of facts. Rather than reiterate verbatim that evidence here, we shall briefly identify some of the highlights of that evidence.\n\nShortly after the doctors and WM's authorized representative signed the Letter of Intent, WMC counsel Williams reported to the WMC Board Athat signed contracts with [the doctors] have been secured. Demolition of the existing buildings [on the land south of the hospital] will begin in mid-April and construction of the new office building will begin in June.@ WM's Carriger informed general contractor Gurkin of the contractual agreement with the doctors and declared WM's Alegally binding commitment@ to Gurkin to enter into a construction contract for the project.\n\nWMC believed that a June 1996 completion date on the doctor' new building was critical timing in the building schedule of the new hospital. Mr. Gurkin asked WM's Williams if it would be better to delay actual construction of the doctor' new building until the design drawings, plans and specifications were finalized, so that a cost estimate could be prepared. Williams instructed Gurkin to proceed with construction in order to be completed as early as possible.\n\nIn late April, 1995, WMC held a press conference to announce the hospital expansion project and the doctor' new medical office building. At WM's request, Dr. Roussalis attended and spoke.\n\nIn May, 1995, the county commissioners of Natrona County approved proceeding with the revenue bond issue for financing the hospital expansion; the WMC Board and the hospital trustees approved a resolution authorizing the revenue bond issue; and the county commissioners approved the revenue bonds. Also in May, WM's Williams signed a site application plan which he submitted to the City of Casper, showing that WMC as Aowner@ was constructing a medical office building for the doctors. In early June, the $31.8 million revenue bond issue was finalized, and the Norwest Bank of Casper received the proceeds as trustee of the bond funds.\n\nFrom March through the summer months of 1995, the doctors spent countless hours on the design of the new building. Gurkin Aloaded them up.@ In June, Gurkin did the demolition work to clear the site on which the new medical office building would be constructed. Excavation of the basement occurred.\n\nIn mid-July, after Carrige's death, representatives of WMC and the City of Casper signed a site plan agreement for the doctor' new building. WM's Williams asked Gurkin to give him an estimate of the cost of the new building; Gurkin told Williams that he (Gurkin) had to know how to proceed because he was soon to pour the buildin's foundation, spending $100,000. Gurkin gave Williams a written Aguess@ of the cost of the new building (11,900 square feet main floor and 11,900 square feet basement) of $2,677,500. Gurkin told Williams that there were fifty-four substantial items of cost which Acan flow either up or down $5,000 per item.@ He cautioned that each ite's cost could not be pinned down until the plans, all of the changes and approvals, were complete; and a project of this size should have a 5% to 10% override for changes as the project develops. Thus, a reasonable juror could infer from this evidence that WMC knew or should have known at that time the cost might exceed $3 million. Williams directed Gurkin to shut down the project; Williams arranged an emergency meeting of the WMC Board. At that meeting the WMC Board read Gurki's cost Aguess@ letter, reviewed the Letter of Intent, and discussed what action to take. The Board did not discuss what amount of money it was prepared to spend on the project, but authorized Williams to restart construction. Williams told Gurkin to resume full operations. Gurkin poured the new buildin's 11,900 square foot foundation. From this evidence, a reasonable juror could infer that the partie' intention was that a specific cost figure was not an essential term of their contract, but that a new building of the type and high quality that Dr. Roussalis would build was.\n\nIn early August, 1995, the architects delivered the final design drawings, plans and specifications to Gurkin, who immediately distributed bid packages to various subcontractors. On August 21, based on the subcontractor' bids, Gurkin had a cost estimate of $3,547,791 for the new building. Gurkin gave this information to WM's Williams. Over the next several weeks these various parties met and discussed the estimate, cost-cutting, and other possible arrangements. In early September, Williams contacted the Acost reviewer@ as we earlier described.\n\nLate in September, the parties met and discussed rescission of the contract. The parties dispute the outcome of these discussions. But, from the fact that they discussed rescission, a reasonable juror could infer that the parties believed they had contracted earlier. Various WMC representatives made settlement overtures to the doctors after the rescission discussions.\n\nOn October 5, 1995, WMC held a press conference at which it issued a prepared statement which included the announcement that the partie' agreement Ahas been cancelled.@ It also stated:\n\n[WMC] took a good faith business risk in proceeding with the construction of the [doctor'] new office building prior to having the final cost determined, in order to facilitate the construction schedule of the new hospital and to take advantage of the favorable bond market. The ultimate cost of the proposed clinic was too high to proceed, and the decision was made to take the loss associated with abandoning the property exchange, and instead alter the location of the new hospital.\n\nSo, in lieu of westward expansion, WMC would expand southward, engulfing the site intended for the docto's new office building.\n\nFrom this post-Letter of Intent conduct, a reasonable juror could infer that the parties achieved mutual assent and definiteness in their exchange transaction, but WMC ultimately backed out because of the high cost. We find genuine issues of material fact for the trier of fact to resolve.\n\nIn addition to arguing that the partie' failure to include a Acost@ term in their alleged contract was fatal to their achieving mutual assent on the new buildin's cost, WMC argues there was not even mutual assent on an objective standard by which cost could be determined, or when or how cost was to be determined.\n\nWMC claims that the Letter of Intent Asimply states that the new building is to be \u003ecomparabl' to the Roussalis building. . . . This is no standard at all.@ According to WMC, the doctors Ainterpret the comparability provision to mean the new building was to be of the highest quality, without limitation, regardless of cost.@ WMC characterizes the doctor' approach with these words, Athey brought in an interior designer, which you do't do \u003eif yo're concerned about cost.=@ WMC also believes that the ASection 1031 exchange@ nature of the transaction provided some measure of protection against uncontrolled costs. WMC claims that the law treats as too indefinite for legal enforcement a term which gives one party to a contract an unlimited right to determine the nature and extent of performance. WMC claims that the Acomparability@ provision of the Letter of Intent, as interpreted by the doctors, is just such an indefinite term.\n\nAbout WM's argument that the Acomparability@ standard in the Letter of Intent is no standard at all, the doctors respond that WMC agreed to this subjective standard in order to induce the doctors to sign the Letter of Intent. In support of this response, the doctors point to WM's own words, as conveyed by its counsel Williams, to the Acost reviewer@ in early September, 1995, that the new building Awould be the type of building that Dr. Roussalis would build if he were building a building of the same type of state-of-the-art quality (technologically and aesthetically)@ as he built ten years earlier. Williams emphasized that this ADr. Roussalis transaction concept@ was Aa different concept than a straight replacement building, where the limits are clear that only those features that are in the current building may be included in the new building. . . . [T]his was the essence of our agreement.@ The doctor' legal authority in support of this subjective standard is Restatement (Second) of Contracts ' 34 (1981). \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e According to the doctors, the law allows the parties to a contract to give one of them a large choice of what performance that party may demand or must accept, and a term is not too indefinite that provides one part's performance must be satisfactory to the other party. 17A\n\nAm. Jur. 2d, Contracts ' 199, at 210; ' 648, at 655-56 (1991). The doctors also respond that WM's actions and words as design and construction of the new building proceeded through spring and summer of 1995 obviated any objection of indefiniteness. Id., ' 198 at 209.\n\nIn analyzing the partie' respective positions on this particular point, we have consulted several authorities. Corbin provides some guidance. For example, he counsels:\n\nThe courts must take cognizance of the fact that the argument that a particular agreement is too indefinite to constitute a contract frequently is an afterthought excuse for attacking an agreement that failed for reasons other than the indefiniteness. In such instances, the court should not be too fussy to determine how the gaps should have been filled. It is simply unnecessary.\n\n[T]hat the parties have left some matters to be determined in the future should not prevent enforcement, if some method of determination independent of a part's mere Awish, will and desire@ exists, either by virtue of the agreement itself or by commercial practice or other usage or custom. This may be the case, even though the determination is left to one of the contracting parties, if this party is required to make it Ain good faith@ in accordance with some existing standard or with facts capable of objective proof. 1 Joseph M. Perillo, Corbin on Contracts ' 4.1, at 535-37 (rev. ed. 1993).\n\nCorbin also comments on the effect of part performance of an indefinite contract:\n\nThat one of [the parties], with the knowledge and approval of the other, has begun performance is nearly always evidence that they regard the contract as consummated and intend to be bound thereby. It may also aid in the interpretation of their words with respect to the character of the performances to be rendered. In this way, the indefiniteness may be cured, or at least reduced. The fair and just solution may then be the enforcement of promises rather than a decision that no contract exists. Id. at 542; and see ' 4.7 at 606-13.\n\nAcknowledging that an agreement which provides that the performance to be rendered shall be left to the will or discretion of one of the parties has been held not enforceable, Corbin also observes Athat one of the parties reserves the power of fixing or varying the price or other performance is not fatal if the exercise of this power is subject to prescribed or implied limitations, as that the variation must be in proportion to some objectively determined base or must be reasonable or in good faith.@ Id., ' 4.4, at 586-87.\n\nProfessor Farnsworth counsels that, in deciding whether the requirement of definiteness has been met, a court would first interpret the language of the contract, and might next consider the partie' preliminary negotiations and references to external sources of terms, including trade and other standard terms. I Farnsworth, supra, ' 3.28, at 356. He also observes\n\n[a]n agreement may be fleshed out by usages to which the parties are subject, by a course of dealing between the parties prior to their agreement, or by a course of performance between them after their agreement. Indefiniteness may also be cured by the addition of such implied terms as will be supplied by law, including--at least as to minor items--the partie' implied obligations of good faith and fair dealing. Id. at 357.\n\nWe note here that, under Wyoming law, every contract is deemed to contain an implied term of good faith and fair dealing. See, Garner v. Hickman, 709 P.2d 407, 411 (Wyo. 1985), and cases cited therein; Kahn v. Trader' Insurance Co., 4 Wyo. 419, 471, 34 P. 1059, 1075 (1893). We see no reason why that would not be true in this case. Finally, Professor Farnsworth counsels, A[a] host of opinions can be found to support the proposition that less definiteness is required to support an award of damages than a decree of specific performance.@ I Farnsworth, supra, ' 3.28 at 361. In this case, the doctors seek an award of money damages, not a decree of specific performance.\n\nIn light of the above and foregoing authorities, we have concluded that WM's argument, that the parties failed to achieve mutuality of assent on an objective standard by which cost could be determined, must be tested by the trier of fact. A reasonable juror could find from the evidence that, just as the parties may have intended not to have a specific Acost@ term as an essential term of their agreement, they intended not to have an objective standard for determining specific cost. As the doctors point out, there is evidence from which a reasonable juror could infer that WMC expressly agreed to a subjective standard. WM's own words in its September 5 letter to its Acost reviewer@ are strong evidence of a ADr. Roussalis@ standard. The provisions in the Letter of Intent which speak of exterior and interior quality, of the doctor' approval of architectural and engineering drawings, of high quality features on the representative Exhibit A list, of a state-of-the- art computer system, and of WM's buy-back guarantee of the greater of $1.25 million or the actual cost of the new building are also evidence of an intentional subjective standard. That juror could also turn WM's own logic against it because WMC agreed to having interior design and woodworking experts in charge of and directing the interior quality. If one does not have such experts when there is concern about costs, WM's agreement to having them on the project speaks loudly against WM's litigative position. That juror may find evidentiary value in WM's actions upon receiving in mid- July Mr. Gurki's Aguess@ of a construction cost of $2.6 million. Rather than insisting on a need to establish and apply an objective standard for determining cost, WMC authorized Mr. Gurkin to resume construction, knowing that the doctors were working on the design drawings, plans and specifications as the Letter of Intent directed them to do.\n\nA reasonable juror may also determine that the doctor' legal obligation of good faith and fair dealing and the Section 1031 nature of the exchange serve to contain the doctor' exercise of discretion under the ADr. Roussalis@ standard within reason; we think those factors are worthy of the juro's consideration. We are satisfied that evidence exists from which a reasonable juror could find a sufficiently definite standard by which to measure the doctor' performance. For all of the above and foregoing reasons, we hold that genuine issues of material fact regarding contract formation exist in this record.\n\nII. Whether Alleged Oral Modifications to the Alleged Letter of Intent Agreement Fail for Lack of Consideration.\n\nWMC asserts that alleged oral modifications of the alleged agreement, namely, the expansion of the size of the building from 9,500 square feet to about 11,900 square feet and the addition of many special features beyond the list on Exhibit A attached to the Letter of Intent, fail for lack of consideration. Hopper v. All Pet Animal Clinic, Inc., 861 P.2d 531, 540 (Wyo. 1993); Willard Given \u0026 Assoc.=s, P.C. v. First Wyo. Bank, 706 P.2d 247, 251 (Wyo. 1985); Harvard v. Anderson, 524 P.2d 880, 883 (Wyo. 1974). WMC correctly states that this Court follows the Apre-existing duty rule,@ namely, an agreement to do what one is already bound to do cannot serve as consideration to support a modification. See Brodie v. General Chemical Corp., 934 P.2d 1263, 1268 (Wyo. 1997); Harvard, 524 P.2d at 883; Long v. Forbes, 58 Wyo. 533, 548-49, 136 P.2d 242, 246-47 (1943). WMC claims that the doctors provided no new consideration to support the square footage increase or the many special features they added after the parties signed the Letter of Intent. Without new consideration to support these modifications, WMC reasons, the modifications were invalid and fail.\n\nEarlier in this opinion, we stated the facts and circumstances surrounding the square footage increase of the building size and noted that in the Letter of Intent the parties expressly stated that the list of specific features shown on Exhibit A attached to the Letter of Intent was representative, but Anot meant to be exhaustive . . . of the types of high quality features which the new facility will incorporate.@ With these facts and circumstances in mind, we will analyze the partie' contentions concerning whether there was consideration to support these modifications.\n\nIn response to WM's claim that the addition of many special features beyond the representative list on Exhibit A attached to the Letter of Intent was not supported by new consideration, the doctors answer that, in the Letter of Intent, the parties specifically provided for the addition of special features as the design and construction of the building progressed. Implicit in this answer would seem to be the point that new consideration was unnecessary to support the addition of special features expressly anticipated or contemplated by the parties in the original agreement. In other words, the additional special features, provided for in the original agreement, are deemed supported by the consideration which supported the original agreement. We think that logically follows, and WMC offers no authority to the contrary. Moreover, the doctors maintain that the additional features were discussed with WM's representatives Carriger and Williams, who supported the additions because WMC (1) received the benefit of promoting the new state-of-the-art building for WM's organizing efforts with its visionary Wyoming Integrated Network, a state-wide association of hospitals and physicians, with WMC at its hub; and (2) would re-acquire the building in the future, pursuant to the buy-back provision in the Letter of Intent, and therefore would benefit from the additional special features.\n\nWith respect to WM's claim that the building size increase was also not supported by new consideration, the doctors maintain that WMC knew of and expressly approved the increase and received its benefits because of the probability that WMC would re-acquire the building in the future. In this regard, we recall the facts and circumstances of WM's knowledge of and involvement in this size increase, and in particular WM's October 5, 1995, prepared statement to media representatives in which WMC explained the size increase to the public and stated that the Aadditional space would be useful@ when WMC re-acquired the property. The doctors correctly observe that, of the many definitions given for consideration, one of them recognized by this Court is Aa benefit to the promisor or a detriment to the promisee.@ Laibly v. Halseth, 345 P.2d 796, 799 (Wyo. 1959); Moorcroft State Bank v. Morel, 701 P.2d 1159, 1162 (Wyo. 1985).\n\nWe are inclined to agree with the doctor' argument. With respect to the additional special features, we find that the parties contemplated and provided for them in the Letter of Intent; new consideration was unnecessary to support them. But even if new consideration were necessary, the benefits accruing to WMC from these additional special features constitute consideration. With respect to the building size increase, we hold that WMC received a benefit from this increase and that benefit constituted consideration.\n\nEven if the benefit received by WMC did not constitute consideration for the building size modification, we would find an appropriate and applicable exception to the Apre-existing duty rule@ in Restatement (Second) of Contracts ' 89, at 237 (1981). See Wilder v. Cody Country Chamber of Commerce, 868 P.2d 211, 219 (Wyo. 1994). That section states in pertinent part:\n\nA promise modifying a duty under a contract not fully performed on either side is binding (a) if the modification is fair and equitable in view of circumstances not anticipated by the parties when the contract was made. Restatement (Second) of Contracts ' 89, at 237.\n\nWhether a modification is fair and equitable goes beyond the absence of coercion and requires an objectively demonstrable reason for seeking a modification. Id. at ' 89 cmt. b, at 238. The reason for modification must rest in circumstances not anticipated when the contract was made. Id. When such a reason is present, the relative financial strength of the parties, the formality with which the modification is made, the extent to which it is performed or relied on, and other circumstances may be relevant to show or negate imposition or unfair surprise. Id. Recalling Dr. Roussali' testimony and architect Tric's letter to WMC explaining the reasons for the building size increase, we conclude that the facts and circumstances surrounding the size modification were not anticipated by the parties when they signed the Letter of Intent. Recalling from the relevant portion of the statement of facts that WMC approved of the size modification and cooperated with the doctors in making the modification, that WM's site plan agreement with the City of Casper called for an 11,833 square foot building, that WMC authorized Mr. Gurkin to pour an 11,900 square foot foundation, and that Mr. Gurkin in fact poured that foundation, we must conclude that the size modification was fair and equitable. All of the facts and circumstances surrounding this modification negate imposition or unfair surprise.\n\nIII. Whether Alleged Oral Modifications of the Alleged Letter of Intent Agreement are Barred by the Statute of Frauds.\n\nWMC contends there is no written agreement signed by it which (1) increases the size of the doctor' building from 9,500 square feet, as written in the Letter of Intent, to nearly 11,900 square feet, as now expected by the doctors; (2) changes the Afull roughed-in basement,@ as written in the Letter of Intent, to a full finished basement, as now expected by the doctors; and (3) adds numerous special features in the building, such as basement air conditioning, motion sensor lighting, a nurse call system, brick pavers, and car block heaters, to name only a few, as now expected by the doctors. Because these alleged modifications to the Letter of Intent were orally made, if at all, and not made in writings signed by WMC, WMC claims they are barred by the statute of frauds. Wyo. Stat. Ann. ' 1-23-105 (LEXIS 1999).\n\nWMC asserts that the May 22, 1995, site plan application and the July 18, 1995, site plan agreement which reference an 11,833 square foot building, are merely evidence of the terms of a subsequent parol modification of the Letter of Intent which evidence is inadmissible to prove a written modification of the Letter of Intent, citing North American Uranium, Inc. v. Johnston, 316 P.2d 325, 335 (Wyo. 1957) (citing 32 C.J.S. ' 1005, 1011). WMC also contends the doctor' Adocuments@ do not reference the numerous new features which the doctors have added to the building. WMC argues that William' July 21, 1995, letter to Gurkin, the doctor' representative, which instructed him to resume construction operations, Ais not written confirmation of the alleged oral agreement.@ According to WMC, that letter does not mention either increased building size or the additional special features. WMC argues that these alleged modifications of increased size, finished basement, and additional features must be in a writing signed by WMC because the alleged agreement was one for the transfer of real estate and one which could not be performed within one year of its making, the Letter of Intent being signed in March 1995 and Gurkin confirming he had fifteen months in which to build the building. Wyo. Stat. Ann. ' 1-23-105(a)(i) and (v) (LEXIS 1999). WMC maintains that the regrettable situation in which it and the doctors find themselves is the result of mistakes and misunderstandings, and the purpose of the statute of frauds is to guard against just such a situation.\n\nIn response to WM's argument, the doctors claim that the requirements of the statute of frauds have been satisfied to the extent the agreement sought to be enforced by them falls within the statute of frauds. Thus, they point out that, to the extent the agreement at issue is one for the sale or transfer of land, three particular writings signed by WM's authorized agent contain a sufficient description of the land involved. These writings are the Letter of Intent, WM's site plan application, and WM's site plan agreement with the City of Casper. The Letter of Intent contains legal descriptions of both properties to be exchanged. WM's site plan agreement contains a legal description of WM's property on which the proposed office building was to be built and describes an A11,833 square foot medical office complex on a land site of 38,594 square feet.@ Clearly, the alleged oral modifications do not purport to modify the land involved. They do purport to modify the size of the building to be built on that land, the nature of the finish of the full basement of that building, and the kind of special features to be included in that building.\n\nNeither party directs our attention to authority on the precise question which emerges from this situation, namely, whether these particular oral modifications are of such nature that they must be in writing signed by WMC. Our own research reveals the existence of a general rule that if an original agreement was required to comply with the statute of frauds, any material modification of that agreement must also conform to the statute of frauds. Allen v. Kingdon, 723 P.2d 394, 396-97 (Utah 1986). As to be expected, there are recognized exceptions to that general rule. One exception is\n\nwhere a party has changed position by performing an oral modification so that it would be inequitable to permit the other party to found a claim or defense on the original agreement as unmodified. Id. at 396. See also, Quirin v. Weinberg, 830 P.2d 537, 541 (Mont. 1992); Crandell v. Resley, 804 P.2d 272, 275 (Colo. App. 1990); Mikesell v. Newworld Dev. Corp., 840 P.2d 1090, 1095 (Idaho App. 1992); Siegner v. Interstate Prod. Credit As'n, 820 P.2d 20, 30 (Or. App. 1991); Kirk v. Tomulty, 831 P.2d 792, 796 (Wash. App. 1992). This particular exception seems appropriately applicable to the alleged oral modification of the size of the building from 9,500 square feet to 11,900 square feet.\n\nFrom our earlier statement of the facts, we recall that sometime in March, 1995, Carriger approved an increase in the square footage of the medical office building from about 9,500 square feet to about 11,900 square feet. Several pieces of evidence bear this out and explain the increase. In his deposition, WM's Williams testified that Carriger Atold me that he had approved the addition of a connecting space in between . . . the doctor' . . . suites and the rental suites.@ In his deposition, Dr. Roussalis testified that Carriger had approved the size increase, explaining that a substantial amount of the increase, about 1,100 to 1,300 square feet, was the result of enclosing the connecting space and was driven by safety considerations. According to Dr. Roussalis, early in the design drawing phase the architects (Anderson De Bartolo Pan) and the doctors realized that the unenclosed connecting space would cause a wind tunnel effect which was considered dangerous. The solution arrived at was to enclose the space; that enclosed area became an atrium or walkway. The remaining amount of size increase was attributable to some necessary changes in the tenant area and the addition of a canopy. The site plan agreement between WMC and the City of Casper, dated July 18, 1995, references an 11,833 square foot building. Mr. Gurki's letter to WM's Williams dated July 19, 1995, references an 11,900 square foot building. Upon receiving WM's authorization to resume construction on July 19, 1995, Mr. Gurkin poured an 11,900 square foot foundation. In a letter to Williams dated August 25, 1995, Peter Trice, of the architectural firm Anderson DeBartolo Pan, explained the size increase in this way:\n\nProgram Issues\n\nIn our letter to Mike Gurkin dated February 23, 1995 (copy attached), we had reviewed the building program with respect to the tenant spaces. This document identifies the rationale for increasing the buildin's tenant spaces from 8,500 sf to 9,890 sf. During the design process, certain program elements were added such as:\n\nToilet, Mrs. Rousalli' Office 30 sf.\n\nExams Rooms Enlarged 80 sf.\n\nMrs. Youman' Office Enlarged 25 sf.\n\nOne Procedure Room Enlarged 30 sf.\n\nStaff Lounge Enlarged 25 sf.\n\nTotal 250 sf. x 1.35 337 sf.\n\nThe final build program for tenant spaces was therefore 10,227 sf. (9,890 + 337). The actual design required 10,188 sf to accommodate these services. This is less than .5% variance from the program.\n\nThe remaining square footage is for building circulation and support space.\n\nStairs 370 sf.\n\nElevator 60 sf.\n\nLobby 1,194 sf.\n\nTypically, multiple tenant medical office buildings require 20-25% additional square footage to allow for building support space, circulation and mechanical spaces. For this clinic, the final design required an additional 1,624 sf. or about 16% (excluding the mechanical space located in the basement). When this number is added to the revised tenant space program, the gross building square footage equals 11,812 sf. extremely close to the final design amount of 11,800 sf.\n\nIn a prepared statement dated October 5, 1995, which WMC issued to media representatives, WMC explained the size increase:\n\nAs the design progressed, the size of the building was increased, to take into account the requirements of the Americans With Disabilities Act and a pilot computerization project, as well as increased common areas which arose as a result of combining medical offices. Additionally, WMC agreed to a full basement, since there appeared to be at that time a probability that WMC would in the future re-acquire the property, and that additional space would be useful. The final size of the building was 11,800 square feet, with a full basement.\n\nFinally, in his affidavit dated November 13, 1995, WM's Williams stated, in relevant part:\n\nAfter signing the Letter of Intent, WMC cooperated with [the doctors] by, among other things, expanding the size of the New Building beyond the 9,500 square feet provided for in the Letter of Intent, to 11,900 square feet.\n\nNot only are there writings signed by WMC which evidence that size increase, but there is evidence that WMC expressly authorized Gurkin, the doctor' agent, to pour an 11,900 square foot foundation. Indeed, that foundation was poured and existed in the ground. That performance exclusively referable to the alleged agreement must certainly be considered sufficient to exempt it from the effect of the statute of frauds. Ryon v. Earl, 618 P.2d 54, 56 (Utah 1980). The construction of an 11,900 square foot foundation alone and without the aid of words of agreement is extraordinary unless as an incident of agreement. See Burns v. McCormick, 135 N.E. 273 (N.Y. 1922). And see Restatement (Second) of Contracts ' 139 (1981). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In passing, we recall what we wrote in B \u0026 W Glass, Inc. v. Weather Shield Mfg., Inc., 829 P.2d 809, 819 (Wyo. 1992), in the course of holding that under Wyoming law an oral promise otherwise within the statute of frauds declared in Wyo. Stat. Ann. ' 34.1-2-201 (1991) (goods) and the Uniform Commercial Code may be enforceable on the basis of promissory estoppel. We said this Court Ahas accepted a role of leadership in invoking equitable principles to avoid injustice.@ Id. at 818. After touching on our precedent in this regard and quoting Restatement (Second) of Contracts ' 139 (1981), we noted our approval of the use of promissory estoppel, as phrased in the Restatement (Second), to avoid the general statute of frauds. Remilong v. Crolla, 576 P.2d 461, 465 (Wyo. 1978) (buyers of land could enforce an oral promise from the seller that all trailers would be removed from adjacent lands). Eschewing the concern of the 17 th Century English courts Athat a writing is the sole method to avoid undetected [perjury],@ we confidently asserted that A[o]ur judicial system is capable of discerning perjury and reaching a determination in an instance in which a litigant establishes promissory estoppel by appropriately assuming his burden.@ B \u0026 W Glass, Inc., 829 P.2d at 819. Our interest in invoking equitable principles to avoid injustice remains steadfast today.\n\nThere is evidence here which explains that construction problems unforeseen by the parties in March, 1995, before the design drawings, plans and specifications were prepared were responsible for the size increase. Although WMC raises some question whether Carriger agreed to the size modification, its own representative Williams testified that Carriger did. In any event, this is an issue which can be better resolved at trial.\n\nWith respect to the alleged oral modification of the buildin's special features, we must observe that the Letter of Intent expressly covered the topic of specific features to be incorporated into the design and construction of the building, listing them on Exhibit A to the Letter of Intent and stating that the list was representative, but not exhaustive of the types of high quality features to be incorporated into the building. We do not believe that the additional features which WMC wants to treat as an oral modification should be considered such in light of the express provision in the Letter of Intent. Rather, this subject is better left to be treated as a disputed issue of material fact, that is to say, what did the parties intend with respect to those additional features which might be incorporated into the building.\n\nWith respect to the alleged oral modification of the full roughed-in basement to a full finished basement, we believe that is a construction detail also better left to be treated as a disputed issue of material fact to be resolved at trial. Obviously, as we have noted earlier in this opinion, the nature of the partie' agreement was unique because, as Gurkin described it, the project was being designed and built simultaneously and on a fast track. Under such circumstances, it is foreseeable that design and construction details may change and such changes do not readily lend themselves to comply with the strict requirements of a writing. A similar situation arose in Petrie v. Spooner, 223 S.W. 383 (Ark. 1920), where in a written contract Spooner agreed to build and convey to Petrie a house on a lot owned by Spooner according to plans to be approved by Petrie, but later a dispute arose concerning numerous changes and additions made during construction which Spooner claimed Petrie had approved; in answer to Petri's contention that the oral modification violated the statute of frauds and he could not be held for the changes or additions to the plans, the court stated:\n\n[I]t may be said that the writing evidencing the contract to sell the land does not prescribe what the plans of the building shall be. Upon the contrary, it expressly recites the fact to be that the plans had not been then prepared, but were to be subsequently prepared and approved; so that this written contract cannot be conclusive of the plans according to which the building was to be constructed, and the statute of frauds does not apply to the building contract. It was not essential that there be a written contract approving the plans for the building, and it was therefore permissible for the parties to modify or alter these plans without evidencing that modification or alteration in writing. Id. at 385.\n\nUpon the record before us, we conclude that these alleged oral modifications are not within the statute of frauds. We also conclude that disputed issues of material fact as to these alleged oral modifications exist and must be resolved at trial.\n\nIV. Whether the Alleged Letter of Intent Agreement is Unconscionable.\n\nWM's assertion that the Letter of Intent was unconscionable at the time it was made and thereafter rests on the estimated construction cost of the new building, which Gurkin reported at $3,547,791 after receiving subcontractor' bids in late August, 1995, which estimate cost allegedly resulted from the combined oppressive effect of both the presence and absence of certain provisions in the Letter of Intent. Specifically, WMC points to the absence of a provision capping construction costs; the presence of open-ended provisions establishing a comparability standard for the new building and unchecked discretion in the doctors as to exterior and interior design, furnishings, and equipment; and the presence of a buy-back provision giving the doctors the opportunity, by running up costs, to increase the buy-back price WMC would pay. WMC claims that the resulting construction cost unfairly surprised WMC and made the contemplated property exchange grossly unequal, both of which are indices of unconscionability.\n\nAlthough WM's focus is on the oppressive nature of and the unfair surprise caused by these items, and not on unequal bargaining power, it asserts in passing that if unequal bargaining power were the issue, the doctors Ahad the upper hand@ because they knew that WMC needed their property for hospital expansion, refused a cost cap provision, and agreed to open-ended provisions which they later interpreted as giving them unlimited discretion over design and cost.\n\nWithout supporting authority, WMC asserts that who proposed the allegedly unconscionable provisions is beside the point. In closing, WMC candidly reminds us that the question of unconscionability is one of law for the court, but that the court should be cautious in holding an agreement unconscionable.\n\nResponding to WM's argument, the doctors refer us to our leading case of Matter of Estate of Frederick, 599 P.2d 550, 556 (Wyo. 1979), in which we discussed and applied, in the context of a filling station lease with an option to purchase, the relevant considerations in the identification of unconscionability. Based upon this, and similar authority, the doctors assert that a cursory review of the facts reveals the baseless nature of WM's argument. In this regard, the doctors note that it was WMC, not them, which proposed the buy-back provision; the doctors did not reject the cost cap concept, but made it clear to WMC that they wanted to see the new buildin's design before they would agree to a cost cap; WMC did not want to wait the four to six month period for design drawings to be prepared and freely chose to proceed without a cost figure, thus bearing the risk of a higher-than-expected construction cost and corresponding buy-back cost. The doctors characterize WM's argument as an allegation, which they deny, that they breached an obligation of good faith by Arunning up the cost@ of the building to benefit themselves on the buy-back obligation. They claim this allegation presents issues of fact best suited for a jury. Like WMC, the doctors close their argument by reminding us that judges have been cautious in applying the doctrine of unconscionability.\n\nWe hold, as a matter of law, for the reasons which follow, that WM's contention of unconscionability lacks merit. That we must exercise caution in our resolution of this issue is because we Arecognize the basic right of persons, real and artificial, to freely enter into contracts.@ Sinclair Oil Corp. v. Columbia Cas. Co., 682 P.2d 975, 978 (Wyo. 1984). Our reluctance to redraw or nullify the provisions of a contract made by competent parties draws strength from the eloquent statement from the United States Supreme Court which we favorably quoted in Sinclair Oil Corp.:\n\nAThe right of private contract is no small part of the liberty of the citizen, and that the usual and most important function of courts of justice is rather to maintain and enforce contracts, than to enable parties thereto to escape from their obligation on the pretext of public policy, unless it clearly appear that they contravene public right or the public welfare. It was well said by Sir George Jessel, M.R., in Printing \u0026 Co. v. Sampson, L.R. 19 Eq. 465: \u003eIt must not be forgotten that you are not to extend arbitrarily those rules which say that a given contract is void as being against public policy, because if there is one thing which more than another public policy requires it is that men of full age and competent understanding shall have the utmost liberty of contracting, and that their contracts, when entered into freely and voluntarily, shall be held sacred, and shall be enforced by courts of justice. Therefore, you have this paramount public policy to consider--that you are not lightly to interfere with this freedom of contract.=@ Id. at 978-79 (quoting Baltimore \u0026 Ohio Southwestern Railway Co. v. Voigt, 176 U.S. 498, 505, 20 S. Ct. 385, 387, 44 L.Ed. 560, 565 (1900)).\n\nOur cases admit of the difficulty of defining unconscionability. See, e.g., Svalina v. Split Rock Land and Cattle Co., 816 P.2d 878, 882 (Wyo. 1991). Our cases repeat the various judicial definitions which other courts have offered and which give only the most general guidance on the meaning of the term. See, e.g., Estate of Frederick, 599 P.2d at 556. Perhaps the better judgment is to confess, as the leading commentators have, that\n\n[i]t is not possible to define unconscionability. It is not a concept, but a determination to be made in light of a variety of factors not unifiable into a formula. 1 James J. White and Robert S. Summers, Uniform Commercial Code ' 4-3, at 213 (4 th ed. 1995). (Although the Uniform Commercial Code governs only transactions in goods, courts have applied its unconscionability provision, ' 2-302, to other contracts either by analogy or as an expression of a general doctrine. I Farnsworth, supra ' 4.28, at 497. See Wyo. Stat. Ann. ' 34.1-2-302 (LEXIS 1999)).\n\nOur leading case of Estate of Frederick, as well as Svalina which relied upon it, identified the approach and the various factors which we have considered in making a determination that an agreement is or is not unconscionable. These factors and others which we find appropriate have been identified by other courts and leading commentators. This Court, and most others, as well as leading commentators, test the contention Aas of the time the agreement is made and not in accordance with hindsight.@ Estate of Frederick, 599 P.2d at 556; and see, White and Summers, supra, ' 4- 3, at 211. We consider the characteristics of the parties including age, education, intelligence, business acumen and experience. Estate of Frederick, 599 P.2d at 556. A leading commentator reports, ACourts have generally been chary about using the doctrine . . . to protect merchants and similar professionals and have declined to apply the doctrine in favor of sophisticated corporations.@ I Farnsworth, supra, ' 4.28, at 505-06; and see White and Summers, supra, ' 4-9, at 237 (courts Ahave not generally been solicitous of business persons in the name of unconscionability@). For example, in Continental Airlines v. Goodyear Tire \u0026 Rubber Co., 819 F.2d 1519, 1527 (9 th Cir. 1987), in rejecting an airlin's claim of unconscionability in connection with a contract for the purchase of aircraft, that court said Ait makes little sense in the context of two large, legally sophisticated companies to invoke the . . . doctrine.@ See also, AT\u0026T v. New York City Human Resources Admin., 833 F.Supp. 962, 988-89 (S.D.N.Y. 1993) and cases cited therein. We consider whether the allegedly aggrieved party has enjoyed the advice of legal counsel. Estate of Frederick, 599 P.2d at 556. A[N]umerous courts have considered the presence and advice of counsel to constitute circumstantial, if not conclusive, evidence that a contract is not unconscionable.@ Resource Management Co. v. Weston Ranch, 706 P.2d 1028, 1045 (Utah 1985); and see, Cryogenic Equipment, Inc. v. Southern Nitrogen, Inc., 490 F.2d 696, 699 (8 th Cir. 1974) (negotiators included knowledgeable commercial lawyer with eighteen years experience and an engineer with twenty-four years in management and production). We consider which party proposed the allegedly unconscionable provisions. Estate of Frederick, 599 P.2d at 556; Svalina, 816 P.2d at 882. As a matter of common sense and fairness, which party proposed an allegedly unconscionable provision is of legitimate concern to a court asked to exercise its equitable power. Because a court focuses on the relative fairness of the obligations assumed and is determining the presence vel non of one-sided terms which oppress or unfairly surprise an innocent party, we find it difficult to accept the notion that a party who proposes an allegedly unconscionable term can be viewed as an innocent party who is oppressed or unfairly surprised by a provision of its own making. See, e.g., Osgood v. Medical, Inc., 415 N.W.2d 896, 901-02 (Minn. App. 1987) (terms not unconscionable where party asserting so provided them); Johnson v. Mobil Oil Corp., 415 F. Supp. 264, 268 (E. D. Mich. 1976) (one of the variety of factors is who drafted the agreement). We also find it appropriate to consider whether both absence of meaningful choice and presence of contract provisions unreasonably favorable to the other party must be found to satisfy a claim of unconscionability. Leading commentators report that most courts require a quantum of both and take a balancing approach in applying them. White and Summers, supra, ' 4-7, at 230-31; and see, Maxwell v. Fidelity Financial Services, Inc., 907 P.2d 51, 58 (Ariz. 1995) (AMany courts, perhaps a majority, have held that there must be some quantum of both procedural and substantive unconscionability to establish a claim, and take a balancing approach in applying them@); and White and Summers, supra, ' 4-9, at 242 (AIn general, then, in the absence of procedural unconscionability [bargaining naughtiness or absence of meaningful choice], courts will not invalidate commercial contracts in the name of unconscionability@). In Estate of Frederick, we identified and applied in our analysis factors falling under the rubric of this so-called procedural unconscionability: deprivation of meaningful choice as to whether to enter into the contract, compulsion to accept terms, opportunity for meaningful negotiation, such gross inequality of bargaining power that negotiations were not possible, characteristics of alleged aggrieved party (underprivileged, uneducated, illiterate, easily taken advantage of), and surprise by fine print or concealed terms. Estate of Frederick, 599 P.2d at 556.\n\nHaving carefully considered WM's argument in light of the record and the foregoing authority, we must reject its claim of unconscionability. The record does not support WM's contention that the doctors enjoyed superior bargaining power, the so-called Aupper hand.@ While it is true the doctors knew that WMC wanted their property for hospital expansion, it is also true that WMC, before giving them this knowledge, had explored its available options of expanding either westwardly in the doctor' direction or southwardly in the direction it ultimately selected when the deal with the doctors began to collapse. It was WMC that freely chose to approach the doctors, who initially did not want to sell their properties, and convinced them that they were standing in the way of what was best for WMC. WMC envisioned transforming itself into a regional medical center working in partnership with an integrated network of doctors. It proposed to build the doctors a state-of- the-art medical office building as a showcase for WM's integrated network vision. It was WMC that determined the greatest cost savings would be realized by westwardly expansion. It was WMC that pressed for negotiations with the doctors. At all times WMC was represented by its chief executive officer, informed board members, and experienced legal counsel. The record shows that that legal counsel in an early September, 1995, letter, explained about the absence of a cost cap provision:\n\nThe physicians would not sign any type of agreement with a dollar limitation in it until a complete set of plans and specifications were generated and approved. Because of WM'=s desire to proceed on the revenue bonding process prior to those plans being completed, and the necessity that the land be under contract prior to issuing the bonds (for rating and bond insurance purposes), the decision was made to leave the agreement open- ended. (Emphasis added).\n\nThe record further shows that WM's October, 1995, press release stated, A[WMC] took a good faith business risk in proceeding with the construction of the new office building prior to having the final cost determined, in order to facilitate the construction schedule of the new hospital and to take advantage of the favorable bond market.@ We are aware that there are elements of risk in any contract. Estate of Frederick, 599 P.2d at 556. It has been rightly said:\n\nThe policy underlying that rule [unconscionability cannot be demonstrated by hindsight] is that virtually all contracts involve the assessment of risks. How fast, if at all, will land values rise over the next ten years? Are interest rates likely to increase, decrease, or remain constant? Is a particular venture likely to be a wild success or an abysmal failure? . . . Assessment of such risk is intrinsic to the process of contracting and affects the terms on which contracts are entered into.\n\nTo judge the substantive fairness of contracts at a date subsequent to their making could nullify many contracts entailing a speculative element. Resource Management Co., 706 P.2d at 1043.\n\nThe record shows WMC is a sophisticated business entity and was represented by experienced negotiators, including experienced legal counsel, and that they negotiated with the doctors over many weeks. The record does not show WMC was compelled to accept provisions but rather enjoyed meaningful negotiation and freely proposed the provisions it would now challenge. We have no difficulty in concluding that WMC had the unfettered choice to either assent to the alleged agreement, negotiate modifications to its provisions, or simply walk away from the doctors as easily as it had first walked toward them in the early days of 1995.\n\nBecause we do not find that WMC was deprived of meaningful choice in any sense of that concept, we need not dwell long considering WM's contention that the combined effect of both the presence and absence of certain provisions resulted in an unfair, one-sided agreement which produced an excessive construction cost which unfairly surprised WMC and made the contemplated property exchange grossly unequal. White and Summers, supra, ' 4-7, at 230- 31; '4-9, at 242; Maxwell, 907 P.2d at 58. As we noted earlier, the record shows, as the doctors claim, that WMC both provided, and freely deleted, some of the provisions it would now challenge. It is, therefore, in a poor position to now claim it is an innocent party which is unfairly surprised. Although WMC complains of the excessive construction cost estimate which Gurkin calculated in August, 1995, after receiving subcontractor' bids based upon finally available design drawings, plans and specifications, the record shows it was reasonably foreseeable to WMC that the construction cost estimate would be high. It was, after all, WMC that insisted on the atypical way in which this construction project proceeded. WMC knew, as Gurkin discussed with it early on, that most projects are typically drawn and designed a year before they are bid. Gurkin said to WMC, Aget the plans drawn, let me give you a price, and then build the building.@ Gurkin asked WM's legal counsel, to no avail, Aif it would't be better to delay actual construction of the building until the design and specifications were finalized, so that a cost estimate could be prepared.@ But WMC pushed for a June, 1996, completion date because that date, in WM's judgment, Awas critical timing in the building schedule of the new hospital (in order to avoid building over two full winters).@ It is common knowledge that in major projects construction costs are difficult to manage. Surely, that difficulty must be exacerbated when the project is designed and built on the fly against a compressed time schedule as this one was. Moreover, the record shows that WMC knew that one of the doctors had built Aa very nice and very expensive@ ($132 per square foot) office building ten years earlier. Inflation is a commonly known element of risk in any contract. Estate of Frederick, 599 P.2d at 556. It was reasonably foreseeable to WMC that the new building would be more costly than the building constructed ten years earlier. By mid-April, 1995, a week before WMC at a press conference announced the hospital expansion project and the doctor' new medical office building project, WMC had in hand Gurki's rough preliminary estimate of a $2.1 million construction cost based upon a 9,850 square foot building, or about $215 per square foot, apparently not counting the full basement. At that time WMC also knew that the size of the building had increased from 9,850 square feet to 11,900 square feet because Carriger and the doctors had agreed to it in March. Knowing in mid-April, then, of a $215 per square foot estimate and of an 11,900 square foot building, WMC reasonably should have known that a rough estimate of the construction cost would be around $2.5 million, apparently not counting a full basement. If a construction cost of $45 per square foot were applied to an 11,900 square foot full basement (as Gurkin estimated in his July, 1995, letter to WMC), that results in an additional $500,000 roughly, for a total rough estimate of $3 million. Thus, in the early days after the agreement was made, it was reasonably foreseeable to WMC that construction costs were going to be high. This was brought to WM's attention again in mid- July, 1995, when Gurkin gave WMC his Aguesstimate@ of $2.6 million. He informed WMC that this Aguesstimate@ could grow another $500,000 roughly depending on increases of $5,000 each on fifty-four substantial items ($270,000) and an override of 5% to 10% for changes (10% of $2.8 million is $280,000; add that figure to $2.8 million estimate, for a total rough estimate of $3 million). Having this information in July, 1995, the WMC board heard its board member Dallas Laird comment to the effect that Awe knew that this was going to be an expensive building,@ and then WMC authorized Gurkin to pour an 11,900 square foot foundation and resume construction operations.\n\nIn analyzing this matter, it is also important to keep in mind that WMC reaped a substantial benefit almost immediately upon the partie' execution of the agreement. That execution of the agreement paved the way for WMC to secure its revenue bond financing at a favorable interest rate for the hospital expansion construction project. In May, in succession the county commissioners approved proceeding with the revenue bond issue, the WMC board and the hospita's trustees approved a resolution authorizing the bond issue, and the county commissioners approved the bonds. In early June, 1995, the $31.8 million revenue bond issue was finalized and the trustee of the bond funds received the proceeds. WM's actions of using the doctor' Letter of Intent agreement to secure this substantial benefit and later repudiating that same document runs dangerously close to violating the long- recognized principle that a party to a contract cannot rely upon part of the contract and repudiate the rest to the prejudice of another party to that contract. McKenzie v. Neale Const. Co., Inc., 75 Wyo. 175, 186, 294 P.2d 355, 359 (1956).\n\nHaving carefully considered WM's argument in light of the record and the foregoing factors, we must reject its claim that the alleged agreement is an unfair, one-sided agreement that produced an excessive construction cost which unfairly surprised WMC and made the contemplated property exchange grossly unequal.\n\nV. Whether the Parties Formed and Performed an Agreement of Rescission Canceling the Alleged Letter of Intent Agreement.\n\nWMC contends the record shows in mid-September, 1995, when the parties were at impasse over cuts to the $3.5 million cost estimate, the doctors orally offered to rescind the alleged Letter of Intent agreement if three conditions were satisfied by WMC; WMC accepted that offer; WMC shut down the project in reliance on the agreement of rescission; and WMC performed the three conditions contained in the doctor' offer. WMC asserts that a legally binding agreement of rescission resulted from these foregoing events.\n\nChallenging WM's assertion, the doctors contend the record shows that WMC never unconditionally assented to their oral offer; WMC did not unconditionally perform the three conditions of their offer; the doctors withdrew their offer before WMC accepted the offer and performed its conditions; and, in the days following the doctor' offer, WMC not only did not unconditionally perform the three conditions but it made, through various agents, several different settlement offers to the doctors, all of which belie WM's assertion that a legally binding agreement of rescission was formed.\n\nTo be sure, Wyoming law recognizes that if an executory contract is within the Statute of Frauds and is in writing, a subsequent oral agreement to rescind the contract is effectual if that oral agreement fulfills the requisites of a contract at common law. Gaido v. Tysdal, 68 Wyo. 490, 505, 235 P.2d 741, 746 (1951); and see 10 Richard A. Lord, Williston on Contracts ' 29:43, at 753 (4 th ed. 1999); Restatement (Second) of Contracts '' 148 and 283 (1981). AAn agreement of rescission is limited to the discharge of contract duties. . . . [C]onsideration is provided by each part's discharge of the othe's remaining duties . . . . The agreement may even be inferred from conduct--like an implied-in-fact contract--if it indicates mutual abandonment.@ I E. Allen Farnsworth, Farnsworth on Contract ' 4.24, at 526-27 (2d ed. 1998). We agree that\n\nthe validity of such an understanding to rescind is controlled by the same rules as in the case of other contracts. . . . [T]here must exist an offer by one party and an unconditional acceptance of that precise offer by the other, prior to withdrawal by the offeror, before a binding agreement is born. Lemlich v. Bd. of Trustees of Harford Comm. College, 385 A.2d 1185, 1189 (Md. 1978).\n\nOur case law identifies the requisites of a contract. AAn offer, acceptance, and consideration are the basic elements of a contract.@ Bouwens v. Centrilift, 974 P.2d 941, 946 (Wyo. 1999) (quoting Miller v. Miller, 664 P.2d 39, 40 (Wyo. 1983)). There must be mutual assent to the same terms. Bouwens, 974 P.2d at 946. The contracting process is usually straightforward. One party makes a manifestation of assent, called an offer, to another; the latter then makes a manifestation of assent, called an acceptance, to the former. Id. AWhether an oral contract exists, the terms and conditions of the oral contract and the intent of the parties are generally questions of fact.@ Wilder v. Cody Country Chamber of Commerce, 868 P.2d 211, 218 (Wyo. 1994). Only when the offer, the terms of the offer, and the unconditional acceptance of the offer are shown without any conflict in the evidence does the interpretation of the contract become a question of law for the court. Id.; Engle v. First Na'l Bank of Chugwater, 590 P.2d 826, 830 (Wyo. 1979). With these requisites in mind, we proceed to examine the record to determine whether there is conflict in the evidence relating to these requisites.\n\nOn the evening of September 17, 1995, the doctors (and their wives) and the doctor' attorney met with Margo Bean (chairperson of WM's board), WM's attorney Williams, County Commissioner Bill Brauer, and hospital trustee president Bob Miracle. They reviewed the building projec's problems, the perceived difficulties presented by WM's disclosure at that meeting to the doctors of WM's transfer to the county of ownership of the lots on which the building was being built, and the possibility of rescission of the Letter of Intent agreement based upon several conditions. According to the doctors, they offered to rescind the Letter of Intent agreement on three conditions: (1) WMC would pay Gurkin his full $250,000 contracto's fee; (2) WMC would make office space arrangements for Dr. Scaling and Dr. Cubin comparable to those they would have had as tenants of the ill-fated office building; and (3) WMC would compensate the doctors Afor [their] time and trouble, including, at a minimum, payment for [their] time spent away from [their] practices, receipt of the computer system promised in the [Letter of Intent agreement], as well as the equipment that had already been purchased for the new clinic.@ With respect to the condition that WMC would compensate the doctors for their time away from their practices, Mr. Miracle recalled:\n\n[W]e talked about the hours spent, the time spent. No one had a--their fingers on it at that moment, they would have to go check their records.\n\nI's my belief that everyone agreed that there was going to be a recision [sic] and that the amount of the cost was going to be the hours that these doctors had devoted to this project multiplied by some figure.\n\nMiracle Aheard a figure of $100 an hour; and then, I believe, before it got over with, we were up to $360 an hour.@ According to Dr. Roussalis, Margo Bean said A[the doctors] would probably be indemnified between two, three hundred thousand dollars@ over and above the payment for the doctor' lost time. With respect to the doctor' condition that Gurkin receive his full commission for the project, Mr. Miracle testified as follows:\n\n1. We discussed the contractor. And they wanted assurance that the contractor was going to be taken care of. We gave that assurance.\n\n17. What assurance did you give?\n\n1. That whatever had been expended by the contractor, he would be made whole, he and his suppliers, et cetera.\n\n17. Do't you recall [the doctors] indicating that they felt he should receive his full commission for the job?\n\n1. They may have said that.\n\n17. What do you recall about that?\n\n1. We said we will deal with the contractor, the hospital will deal with the contractor; he will be made whole as he sees it, the contractor sees it.\n\nIn conflict with the doctor' version of the facts about the three conditions of their offer to rescind, WM's counsel Williams testified at his deposition as follows:\n\n17. And is it true . . . that during that meeting there was [sic] some other items discussed with respect to rescinding the agreement?\n\n1. I do't understand your question.\n\n17. For instance, do you recall discussion about making things right with Mike Gurkin--\n\n1. Yes.\n\n17. --as a condition of the rescission?\n\n1. I--I do't know that I would state it as a condition of the rescission. It was an item that we talked about in the context of the rescission.\n\n17. Do you recall discussion about making things right with Dr. Scaling and Dr. Cubin as a condition of the rescission?\n\n1. I would have the same--I guess the same problem with Aas a condition of the rescission.@\n\n17. So was it your impression at the conclusion of that meeting that the doctors had unconditionally rescinded the agreement?\n\n1. It was my understanding that at the conclusion of that meeting that the agreement had been rescinded and that we had agreed to take care of the subcontractors and Mike Gurkin. We had agreed to work with Dr. Scaling and Dr. Cubin. And Dr. Roussalis and Dr. Youmans had agreed to submit to us their statements for lost practice time. And that we were to approach the board on the issue of couching the agreement in terms of a mutual rescission.\n\n17. What was your understanding of what was meant by Aworking with Dr. Scaling and Dr. Cubin?@\n\n1. To find out from them whether the arrangements they had made to vacate their existing space were irreversible and, if so, to talk to them about some substitute space.\n\nBut, in some conflict with his deposition testimony that making things right with Gurkin and Dr. Scaling and Dr. Cubin were not conditions of the rescission, WM's counsel Williams stated in his second affidavit in pertinent part:\n\nAt the meeting on September 17, 1995, plaintiffs [the doctors] offered to rescind the Letter of Intent with three conditions: (1) that WMC would pay them for their time spent on the project, (2) that WMC would settle up with Mike Gurkin and the subcontractors, and (3) that WMC would work with prospective tenants Drs. Cubin and Scaling to help them find alternative office space.\n\nMr. Miracl's take on the condition relating to Dr. Scalin's and Dr. Cubi's situation was slightly different. He testified as follows:\n\nI think we took the position, hey, we did't make the deal. [County Commissioner] Bill Brauer said it was't on the table until that day, that moment. It was the position that something could be worked out if it really was a crisis; that they had no alternatives; that they were forced to move; and this is where they had to go; that something could be worked out up there with other properties. He believed the cooperation would be extended in that effort to try to solve that matter.\n\nThere is also conflict in the evidence whether the Letter of Intent agreement had been rescinded at the conclusion of that September 17 meeting. In the deposition of WM's counsel Williams, quoted above, he offers the conclusory opinion that the agreement had been rescinded and Awe were to approach the board on the issue of couching the agreement in terms of a mutual rescission.@ There is no evidence that WMC had authorized those individuals attending the meeting to act on WM's behalf to accept an offer from the doctors. Instead, a reasonable inference from the evidence of record is to the contrary. Bill Brauer, county commissioner, who attended the meeting, has a recollection of the matter different from William' recollection. According to Mr. Brauer,\n\n1. I think [Mr. Miracle] and [Mr. Williams] both indicated to [the doctor' attorney] that they would call an immediate meeting of the--both the Board of Trustees and the Board of Directors and relay this information to them; and that this would be the best option, would be to rescind it, pay the doctors for their time.\n\n17. And that those were all the terms of this idea that we were kicking around for rescission of the contract?\n\n1. Yeah. I--I guess I thought it was more than kicking around.\n\n17. Okay.\n\n1. I mean, it seemed to me what I heard was an offer was made to rescind.\n\n17. Right.\n\n1. Wyoming--the [WMC] Board was't there.\n\nThey had entered into an agreement. And- -but that the--it was going to be recommended to that Board that they accept your offer to rescind, or the doctor' offer to rescind.\n\nMr. Miracle recalled that as the meeting ended he believed Athe doctors were going to go away and compute their hours. That was going to be submitted, and we were going to have a nice, friendly recision [sic] of this matter.@ According to the minutes of the meeting of the WMC board the next day, September 18, the WMC board and its counsel Williams met to discuss the situation, and the board authorized Williams Ato negotiate a recision [sic] of the Letter of Intent with the . . . Doctors, though the Board retains the authority to vote on the final transaction.@ That same day, Williams wrote WM's revenue bond underwriter of the hospital expansion project and said in pertinent part Awe are therefore negotiating the details of an agreement to mutually rescind our contract with the two physicians.@ Mr. Miracle recalled that he attended a WMC board meeting within the next week or two after the September 17 meeting and Aprobably at that time the question was asked, Where are we? Have we got the figures? And probably got a report that the thing had not been resolved.@ The foregoing evidence belies the conclusion that rescission was a fait accompli; rather, this evidence strongly argues that negotiations were ongoing and only the board had Athe authority to vote on the final transaction.@ Moreover, on this important point, there is no evidence in the record that Williams ever negotiated an agreement of rescission or that the WMC board ever voted on Athe final transaction.@ In this regard, the minutes of the WMC board meeting dated October 4, 1995, state in pertinent part, AMargo [Bean] noted that negotiations were still underway with [the doctor' attorney] . . . .@\n\nWith respect to the doctor' condition that WMC compensate them, there is also conflict in the evidence as to whether WMC unconditionally performed this condition. According to the doctor' affidavits,\n\nWMC arbitrarily deducted several thousand dollars from our bills for time spent on the project without even consulting us about it. Checks for a reduced amount were submitted by WMC, which [we] cashed only because [WM's new attorney] stated in writing that the checks were being tendered unconditionally.\n\nThere is additional evidence in the record that, in the days following the September 17 meeting to discuss rescission and the September 18 WMC board meeting at which the board authorized Williams Ato negotiate@ but retained Athe authority to vote on the final transaction,@ various WMC representatives made various and different settlement offers to the doctors, all of which activity conflicts with WM's assertion that it had unconditionally accepted and performed the conditions of the doctor' offer to rescind. Board member Dallas Laird had made such an offer because the board members Atalked [him] into it.@ Upon hearing of Mr. Lair's offer at a WMC board meeting, Mr. Miracle, accompanied by Mr. Brauer, visited Dr. Roussali' office and made a different offer. Mr. Miracle testified in pertinent part:\n\nMade him an offer of $100,000 to settle this thing. The $100,000 figure was a figure that I believed probably was going to represent the time that they had spent on this matter.\n\nMr. Miracle understood that by the time of his meeting with Dr. Roussalis the rescission option Ahad come apart.@ Dr. Roussalis rejected the offer.\n\nThe record also shows that on September 19 the doctors had written to WM's counsel Williams and offered to discuss completion of the building project. Although there were subsequent discussions on that subject, nothing substantive developed. In reply to the doctor' September 19 letter, Williams wrote them on September 20. In that letter he said, in pertinent part:\n\nOne other issue that I might as well address at this point is the payments to you if the recision [sic] stands. Lin [Carriger] agreed to pay you for your lost medical practice time, and we will honor that agreement, based on reasonable time and billing rates. It was our understanding after the meeting on Sunday that that was what was going to be submitted. That was the specific question that was raised by Mr. Miracle, and there was no indication at that time that there was going to be a damage claim of any kind. [Your attorney] now indicates that there will be such a claim. My strong sense from the Board meeting on Monday [September 18] is that the Board is not willing to pay anything other than the lost practice time. That ultimately will be a Board decision, but I just wanted to be up-front on where I think the Board is on that issue.\n\nObviously, we need to resolve these issues as soon as we can.\n\nIt would serve no useful purpose to continue referencing the summary judgment materials for the purpose of showing more of the obvious, namely, that conflicting evidence abounds concerning the proof of the elements of an agreement of rescission. On this record, we find summary judgment on this point inappropriate.\n\nVI. Whether Promissory Estoppel Applies with Respect to Rescission of the Letter of Intent Agreement.\n\nAs an alternative ground of defense in the event its defense of an agreement of rescission fails, WMC asserts that the record supports the application of promissory estoppel with respect to rescission of the Letter of Intent. WMC correctly states that the elements of promissory estoppel demand evidence that establishes (1) the existence of a clear and definite promise which the promisor should reasonably expect to induce action by the promisee; (2) proof that the promisee acted to its detriment in reasonable reliance on the promise; and (3) a finding that injustice can be avoided only if the court enforces the promise. Loghry v. Unicover Corp., 927 P.2d 706, 710 (Wyo. 1996); B \u0026 W Glass, 829 P.2d at 818. The first two elements present questions of fact and the third element requires judicial consideration. Loghry, 927 P.2d at 711; Inter-Mountain Threading, Inc. v. Baker Hughes Tubular Services, Inc., 812 P.2d 555, 560 (Wyo. 1991); Davis v. Davis, 855 P.2d 342, 348-49 (Wyo. 1993). AThe party who is asserting promissory estoppel is assigned the burden of establishing all of the elements of the doctrine with a standard of strict proof.@ B \u0026 W Glass, 829 P.2d at 819.\n\nCalling forth that same evidence in the record upon which it based its contention that the parties made an agreement of rescission in mid-September, 1995, WMC contends that same evidence establishes the requisite elements of promissory estoppel. The doctors counter that WM's promissory estoppel contention must fail for the same reasons that its agreement-of-rescission contention fails, namely, that the record fails to support the satisfaction of each of the elements of promissory estoppel.\n\nBased upon our careful examination of the record, we hold here, as we did on WM's agreement-on-rescission issue, that genuine issues of material fact exist with respect to the first two elements of promissory estoppel. Should the jury determine those issues in WM's favor, it would still remain with the trial judge to decide the third element of that doctrine.\n\nVII. Whether the Doctors Interfered with the Alleged Agreement and, if so, Whether WM'=s Performance under the Alleged Agreement was Excused Because of that Interference.\n\nAsserting that the partie' Letter of Intent agreement contained the implicit requirement for the utmost good faith and fair dealing between the parties, WMC contends that the doctor' demands regarding the new office buildin's design amounted to bad faith, and, thus, constituted a prior material breach of the doctor' duty of good faith and fair dealing and of the agreemen's Acomparability@ provision. WMC claims that this unwarranted breach excused WMC from performance of its obligations under the agreement. Williams v. Collins Communications, Inc., 720 P.2d 880, 891 (Wyo. 1986); Applied Genetics In'l, Inc. v. First Affiliated Securities, Inc., 912 F.2d 1238, 1244 (10 th Cir. 1990); see also, Stockton v. Sowerwine, 690 P.2d 1202, 1205 (Wyo. 1984).\n\nStating that they vigorously dispute WM's contention that they acted in bad faith, the doctors maintain that WM's contention is without support in the record. The doctors claim that the record shows that WM's agents Carriger and Williams were fully informed with respect to design matters and the project as it progressed; that, in his testimony, Tom Judy, the interior designer designated by WMC and the doctors in the agreement, explained in detail in what way the features in the new building were not as good as Dr. Roussalis had in his ten-year-old building; and that the Denver- based consultant hired by WMC conceded in her testimony that she prepared her report, which criticized the high cost of the new building, without any knowledge of the high-quality features of Dr. Roussali' ten-year-old building and that she could identify perhaps $500,000 to $600,000 in potential cuts from Gurki's $3.5 million estimates.\n\nHaving carefully examined the record, we have concluded that it is pregnant with genuine issues of material fact relating to the partie' respective performances under their agreement. Therefore, summary judgment is inappropriate.\n\nVIII. Whether the Doctor's Claim for Anticipatory Repudiation IS VALID.\n\nIn their pleadings, the doctors stated a claim against WMC for anticipatory repudiation in these allegations:\n\n55. By the following acts, WMC has evinced an intention to refuse performance of its contract with the doctors:\n\na. By failing to acquire all the land it promised the doctors under the March 2, 1995 Letter Agreement;\n\nb. By conveying away the land it once owned and promised the doctors under the March 2, 1995 Letter Agreement; and\n\nc. By abandoning the construction of the new medical office building required under the March 2, 1995 Letter Agreement.\n\n56. WM's refusal to perform its obligations under the contract is unequivocal and absolute.\n\n57. As a result of WM's anticipatory repudiation of its contract with the doctors, the doctors are entitled to recover their consequential and benefit- of-the-bargain damages in an amount to be proven at trial.\n\nAs the doctors correctly note, this Court in J. B. Service Court v. Wharton, 632 P.2d 943, 945 (Wyo. 1981), recognized that a part's repudiation of its duty before the time for performance has arrived is called an anticipatory breach or, more precisely, anticipatory repudiation. A[T]he doctrine . . . [has] gained widespread acceptance . . . [and] [c]courts have accepted the general rule that an anticipatory repudiation gives the injured party an immediate claim to damages for total breach, in addition to discharging that part's remaining duties of performance.@ II E. Allan Farnsworth, Farnsworth on Contracts ' 8.20, at 470 (1990). Professor Farnsworth has captured the elements of anticipatory repudiation:\n\nA repudiation is a manifestation by one party to the other that the first cannot or will not perform at least some of its obligations under the contract. For a repudiation to have legal effect, the threatened breach must be serious. According to the Restatement Second, it must be serious enough that the injured party could treat it as total if it occurred. A repudiation may be by words or other conduct.\n\nUsually a repudiation consists of a statement that the repudiating party cannot or will not perform. The statement must be sufficiently positive to be reasonably understood as meaning that the breach will actually occur. A part's expressions of doubt as to its willingness or ability to perform do not constitute a repudiation.\n\nAn especially troublesome situation arises when a part's statement results from an honest but mistaken understanding of its rights under the contract. The traditional view is that the part's good faith will not prevent the statement from amounting to a repudiation. A party therefore acts at its peril if that party, insisting on what it mistakenly believes to be its rights, refuses to perform its duty. As the commentary to the Uniform Commercial Code put its, Aa statement of the intention not to perform except on conditions which go beyond the contract@ is a repudiation. Furthermore, if a party wrongfully states that it will not perform unless the other party consents to a modification of the contract, the statement is a repudiation; although the concession that the first party seeks may be a minor one, the breach that it threatens in order to exact it is not. A proposal of or a demand for performance on terms that go beyond the contract is not a repudiation, however, unless it is coupled with a threat of nonperformance if those terms are not accepted.\n\nA party may repudiate by conduct as well as by words. A promiso's voluntary affirmative act that renders the promisor actually or apparently unable to perform without a breach is a repudiation. A vendor of land, by conveying the deed to a third person, may indicate as clearly as by words that the vendor cannot perform. Since the conduct must be an affirmative act, mere delay in performing is not a repudiation. Since the act must be voluntary, inability to perform due to incompetence or financial difficulties is not a repudiation. Furthermore, courts have required that the act make the promiso's performance impossible, so that conduct that indicates mere unwillingness is not enough. Id. at ' 8.21, 474-79.\n\nIn reply to this claim, WMC contends that its August, 1995, conveyance to the county of the lots on which the new office building was being constructed was required by the county under the terms of its amended operating lease with WMC which was negotiated and signed after the Letter of Intent agreement was signed. Further, WMC contends that these lots could have been conveyed to the doctors upon completion of the new office building when the formal property exchange was to have taken place. Moreover, WMC asserts that had the doctors dealt with WMC in good faith--had the doctors enhanced the new office building only up to the $2 million range or agreed to significant cuts to bring the cost down--the transaction would have been performed.\n\nSuffice it to say, because genuine issues of material fact exist concerning proof of the elements of anticipatory repudiation, summary judgment on this claim is inappropriate.\n\nIX. Whether the Doctor's Tort Claim for Breach of the Implied Covenant of Good Faith and Fair Dealing is Valid.\n\nIn their pleading, the doctors included a tort claim for breach of the implied covenant of good faith and fair dealing. In its summary judgment order, the district court did not independently rule on this claim, but, as we noted earlier, that cour's order effectively disposed of all claims including this one. In this appeal, the parties present the question whether this tort claim is legally cognizable under the facts and circumstances of this case. Because we are reversing and remanding, judicial economy will be served in this case if we answer that question now and, thus, give direction to the district court and the parties on this particular issue.\n\nSimply stated, the doctors urge this Court to extend the tort claim adopted in Wilder v. Cody Country Chamber of Commerce, 868 P.2d 211, 221 (Wyo. 1994), in the context of an employe's tortious conduct which arises out of a contractual relationship of employment in breach of the implied covenant of good faith and fair dealing, to cover the doctor' contractual relationship with WMC. The doctors correctly acknowledge that this particular breed of tort adopted in Wilder requires not only the presence of a duty created by law, as all torts do, but more, namely A[t]he kind of breach of duty that brings into play the bad faith tort arises only when there are special relationships between the tort-victim and the tort-feasor . . . .@ Id. Moreover, A[a] showing is required that a special relationship of trust and reliance exists between the particular employee seeking recovery and the employer.@ Id. According to the doctors, the elements of trust and reliance exist when the party seeking recovery has been placed in a position of having to specially rely upon a promise or commitment made by the party from whom recovery is sought.\n\nThe doctors find evidence of a special relationship of trust and reliance in their agreement with WMC in the following matters:\n\nC The new medical office building was an important part of Carrige's vision of a Wyoming Integrated Network, a statewide association of hospitals and doctors, with WMC at its center. The building would serve as a model of what hospitals and doctors, working together, could accomplish.\n\nC At the April 25, 1995, WMC press conference to announce the hospital expansion project, WMC persuaded Dr. Roussalis to speak about the doctor' partnership with WMC to realize the vision.\n\nC The doctors Aput their lives on hold@ for six months to accommodate WM's desire for early completion of the new medical office building which, in turn, would enable an earlier commencement of the hospital expansion project.\n\nC The doctors freely shared with WMC all information concerning the development of the design drawings, plans and specifications of the new medical office building.\n\nC WM's motive to gain the doctor' prompt commitment to transfer their property for the hospital expansion project was to secure promptly revenue bond financing at interest rates so favorable to WMC as to effect a savings of $2.6 million in interest expense for the hospital expansion project.\n\nWMC urges this Court to dismiss the doctor' tort claim because this type of tort claim has been previously adopted in Wyoming only in Arare and exceptional circumstances@ in the context of first- party insurance contractual relationships, McCullough v. Golden Rule Ins. Co., 789 P.2d 855 (Wyo. 1990), and employment contractual relationships involving a long-term employment period coupled with termination of employment on the eve of the vesting of benefits, Wilder, 868 P.2d at 221. WMC correctly observes that central to this Cour's adoption of this tort of bad faith in the context of first-party insurance in McCullough was the public service nature of the insurance business and the unequal bargaining relationship between insurer and insured. McCullough, 789 P.2d at 858-59. In Wilder, this Court relied on McCullough and concluded that Athe implied covenant, with appropriate limitations, serves to balance the inherently unequal relationship between an employer and an employee.@ Wilder, 868 P.2d at 221. WMC asserts that its relationship with the doctors under the construction/property exchange agreement bears none of the particular characteristics of either the first-party insurance contract or employment contract which drove this Cour's decisions in McCullough and Wilder. In particular, WMC contends that the doctors, not WMC, enjoyed the superior bargaining power. Of course, elsewhere in this opinion we have held that these parties possessed equal bargaining power.\n\nHaving carefully considered the arguments, we hold that the partie' contractual relationship is not within that class of contractual relationships out of which a tort duty arises as implied by law independently of the contractual duty of good faith and fair dealing. We have recognized an independent tort duty only in rare and exceptional circumstances, such as first-party insurance contracts and long-term employment contracts in which there is a legitimate expectation of forthcoming benefits. An important underlying rationale in those rare and exceptional contractual relationships is inequality of bargaining power. That driving rationale is absent from the contractual relationship between WMC and the doctors. Consequently, we dismiss the doctor' tort claim.\n\nThe doctors also urge this Court to allow it to expand its bad faith claim against WMC to include WM's litigation conduct, under authority of Restatement (Second) of Contracts '' 205, cmt. e, at 102 (1981), which states that A[t]he obligation of good faith and fair dealing extends to the assertion, settlement and litigation of contract claims and defense.@\n\nCountering the doctor' position, WMC invites this Court to consider authority from Montana, the Sixth Circuit, and California \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e to the effect that litigation conduct Ais rarely actionable in and of itself under the rubric of bad faith tort action.@ Randy Papetti, Note, The Insure's Duty of Good Faith in the Context of Litigation, 60 Geo. Wash. L. Rev. 1931, 1969 (1992). We agree with that said by the Montana Supreme Court:\n\nThe Rules of Civil Procedure control the litigation process and, in most instances, provide adequate remedies for improper conduct during the litigation process. Once the parties have assumed adversarial roles, it is generally for the judge in the underlying case and not a jury to determine whether a party should be penalized for bad faith tactics. Ted Stevens Honda, 238 Cal.Rptr. 363, 369 (citing White, 221 Cal. Rptr. [509] at 525, 710 P.2d [309] at 325 [(1985)] (Lucas, J., concurring and dissenting)).\n\nAn attorney in litigation is ethically bound to represent the client zealously within the framework provided by statutes and the Rules of Civil Procedure. These procedural rules define clear boundaries of litigation conduct. If a defense attorney exceeds the boundaries, the judge can strike the answer and enter judgment for the plaintiff, enter summary judgment for the plaintiff, or impose sanctions on the attorney. See White, 221 Cal.Rptr. at 525, 710 P.2d at 325 (Lucas, J., concurring and dissenting). Palmer by Diacon v. Farmer' Ins. Exchange, 861 P.2d 895, 914 (Mont. 1993). We dismiss the docto's bad faith claim in its entirety.\n\nCONCLUSION\n\nThe district court erred in granting summary judgment to WMC on the principal issue of contract formation in relation to the Letter of Intent agreement because genuine issues of material fact exist with respect to that issue. Genuine issues of material fact also exist with respect to (1) the alleged oral modifications of the Letter of Intent agreement; (2) the alleged formation and performance of an agreement of rescission relating to the Letter of Intent agreement; (3) the application of promissory estoppel to the alleged rescission of the Letter of Intent agreement; (4) the doctor' anticipatory repudiation claim; and (5) WM's defense that the doctors interfered with the Letter of Intent agreement and that interference excused WM's performance of the Letter of Intent agreement.\n\nWe have held as a matter of law that (1) the alleged oral modifications of the Letter of Intent agreement, if they were in fact made, do not fail for lack of consideration and are not barred by the statute of frauds; (2) the Letter of Intent agreement, if it was in fact formed, was not unconscionable; and (3) the doctor' tort claim for breach of the implied covenant of good faith and fair dealing is not actionable.\n\nWe reverse and remand for further proceedings not inconsistent with this opinion.\n\nAPPENDIX\n\nMarch 2, 1995\n\nLouis J. Roussalis, M.D. Jerry Lee Youmans, M.D. 1129 East Second Street Casper, WY 82601\n\nRe: Letter of Intent--Section 1031 Exchange Agreement\n\nDear Dr. Roussalis and Dr. Youmans:\n\nIn executive session on February 8, 1995, the Board of Directors of Wyoming Medical Center ( \"WMC\" ) authorized the following offer to be extended to you for the exchange of your existing medical office buildings for a new office building, to be constructed by Wyoming Medical Center, which exchange would qualify under Section 1031 of the Internal Revenue Code. By signing this letter of intent, you are agreeing to a legally enforceable contract for this exchange upon successful and acceptable completion of all of Wyoming Medical Center's obligations as described in this letter.\n\n1. NEW MEDICAL OFFICE BUILDING\n\n1. WMC will contract with Michael Gurkin, d/b/a Gurkin Construction Co., to construct an approximately 9,500 square foot medical office building, with a full roughed-in basement, to be located on Lots 1,2,3 and 4, White's Addition to the City of Casper, and Lots 17,18,19 and 20, Natrona Heights Addition to the City of Casper, which lots comprise approximately 48,000 square feet. This building size represents an equivalent amount of square footage from your existing buildings, as adjusted for ADA compliance, space required for the pilot computer project, and additional stairway and related office requirements. This eight-block area is located on Third Street, between Washington and Melrose Streets. It is acknowledged that the City of Casper will require an alley to be located on the southernmost portion of this parcel, extending at least from Washington Street to the existing north/south alley.\n\n2. The floor plan of the new building, including the location of all suites, common areas and exam rooms, and the parking configuration for physicians, staff and patients, shall be at the discretion and direction of Drs. Roussalis and Youmans ( APhysicians@ ), and shall be based on architectural and/or engineering drawings which are approved by Physicians. It is anticipated that physician, and possibly staff, parking will be located in the rear of the new facility. All parking will have adequate lighting ( photo cell or comparable ) for safety and aesthetic purposes.\n\n3. The specific features which will be incorporated into the design and construction of this new medical office building are listed on Exhibit A to this letter of intent. It is the general intent of the parties that the new building will be of comparable quality to the building which is currently occupied by Dr. Roussalis, i.e. that the new building will be a replacement building of the same high quality and state-of-the-art which was built into the existing building owned by Dr. Roussalis. The list on Exhibit A is not meant to be exhaustive of all features of the new building, but is representative of the types of high quality features which the new facility will incorporate.\n\n4. The quality of the interior of the building shall be equal in quality to the quality of the interior space of Dr. Roussalis' current building, including woodwork, cabinetry, carpet and general finish and interior furnishing. Tom Judy will direct the interior design, and Martin Sheldon or a similarly qualified finish expert will be in charge of the woodwork in the new building.\n\n5. The exterior design of the new building will be of comparable quality to Dr. Roussalis' existing building, and the design for the exterior shall be acceptable to and approved by Physicians.\n\n6. It is anticipated that the architectural design will be coordinated between Physicians, WMC, Mr. Gurkin and several architectural and engineering firms, with Anderson DeBartolo Pan from Tuscon [sic], Arizona being the lead design firm. All outside design firms will be accepted by Physicians. It is also anticipated that Mr. Gurkin will act as Physician's representative in both the design and construction phases of this project. WMC will pay for all design work for this new building.\n\n7. Upon completion of the new building, and written acceptance of the building by Physicians, WMC will transfer the above described eight lots by warranty deed to Physicians. Exact legal ownership of the new building will be as determined between Dr. Roussalis and Dr. Youmans. The transfer shall include a standard owner's title insurance policy, insuring the title to the new building in Physicians. WMC shall pay all closing costs, including title insurance. At the time of closing, Physicians agree to transfer to WMC by warranty deed their existing office properties, unencumbered, which property is described as Lot 2, the western part of Lot 3, and the North 50 feet of Lot 9, Block 48, Whit's Addition to the City of Casper. In addition, WMC agrees to locate acceptable substitute rental space for the Central Wyoming Counseling Center, and to move that entity into the substitute space with minimal disruption to the operations of the Counseling Center.\n\n8. WMC will pay all moving costs to relocate the practices of Physicians into the new facility immediately upon closing, in order to minimize or eliminate any disruption to Physicians' practice. In addition, WMC will reimburse Physicians for any loss of revenue which can be demonstrated which occurs as a result of the relocation of Physicians' practice.\n\n9. As further consideration for this exchange, WMC agrees to incorporate into the design and construction of the new facility a state-of-the-art computer system, which will be networked into the new information system which WMC is in the process of purchasing. Physicians' new facility shall serve as a pilot project for integrating physicians' private practices into one information system. Included in this information support component will be all necessary hardware and software, including upgrades, and this support will be provided at no cost to Physicians until such time as the product is developed to the point of being commercially available to Casper physicians in general, at which time Physicians may be charged only for any additional upgrades of the system then in place.\n\n10. As further consideration for this exchange, WMC and Physicians specifically agree to the environmental indemnity provisions which are set forth in detail on Exhibit B, attached hereto, and made a part of this agreement by this reference.\n\n2. LEASE GUARANTY\n\n1. It is anticipated that the new facility will contain three suites which will be leased to other physicians. Also, it is possible that the space which will initially be occupied by Dr. Roussalis or Dr. Youmans may also in the future, for various reasons, be leased to other physicians. As a part of this exchange agreement, WMC agrees, for a period of twenty years from the date of exchange, to guaranty that all vacant space in the new building, including the space originally occupied by Dr. Roussalis and Dr. Youmans, would be leased at the then highest average per-square-foot lease rate for medical office space in the Casper area, with a minimum rental rate of $15.50 per square foot. WMC would have the option of subleasing any space it leases, or using it for its own purposes, with any sub-tenant being subject to prior approval.\n\n3. GUARANTEED BUY-BACK PROVISION\n\n1. WMC agrees to purchase the new building at any time during the first twenty years after the exchange for a purchase price equal to the greater of the following:\n\n(a) the actual cost of the new building, including the land; or (b) $1.25 million.\n\n2. This agreement is only a right of first refusal, subject to a prior right of first refusal in each of the owners to purchase the other owner's interest, if the market value of the property and building appreciates above the price set in Section 1 immediately above. In the event a bona fide offer is received, which is in excess of the buy-back price set in Section 1 above, WMC only has the right to match that offer.\n\n3. The obligation to purchase the building for the set purchase price is applicable to each physician's interest, subject to an agreed upon proration of the purchase price.\n\n4. For purposes of valuing the land, the per-square-foot value will be determined as if the building was located on Second Street, which our preliminary research indicates is $8 per square foot.\n\nThis agreement is binding in all of its aspects upon WMC and Physicians and their respective heirs, successors and assigns. By the signature below, Wyoming Medical Center, Inc. intends to be legally bound by the terms and conditions set forth in this letter. If you agree to this exchange arrangement, please execute this letter of intent in the space provided below.\n\nVery truly yours,\n\nLindel L. Carriger President, Wyoming Medical Center\n\nThis Letter of Intent is hereby accepted and agreed to by Wyoming Medical Center this 2 day of March, 1995.\n\nMargo Bean, Chairperson Wyoming Medical Center Board of Directors\n\nThis Letter of Intent is hereby accepted and agreed to this 3 day of March, 1995.\n\nLouis J. Roussalis, M.D.\n\nThis Letter of Intent is hereby accepted and agreed to this 2 day of March, 1995.\n\nJerry Lee Youmans, M.D.\n\nEXHIBIT A\n\nGENERAL BUILDING FEATURES:\n\n1. 2X6 construction, with brick and glass, as determined by architect and Physicians\n\n2. All windows -- 2 or three panes, with tint and no maintenance requirements (e.g. paint)\n\n3. Maximum quality insulation\n\n4. Soundproofing throughout the building\n\n5. Large, quality skylights throughout the building\n\n6. Complete alarm system throughout the building\n\n7. Modern audio ( radio, cassette and CD ) system throughout the building\n\n8. Bathroom in waiting area\n\n9. Bathroom in each physician office\n\n10. Employee bathroom on main level\n\n11. Shared bathroom for each exam room\n\n12. Maximum outdoor drainage design, per architect recommendations\n\n13. Drinking fountains in waiting rooms\n\n14. Double entry way into waiting area\n\n15. No maintenance roof, per architect design and Physician approval\n\n16. Potential bay windows, per architect design\n\n17. Heated outside walk\n\n18. Pressure or in-line hot water\n\n19. Wood work will be oak, cherry walnut or comparable throughout the building\n\n20. Cable TV and computer wiring throughout building\n\n21. Complete telephone/paging system throughout building\n\n22. Secure/protected garbage bin system\n\n23. Built-in display areas in waiting room\n\n24. Appropriate landscaping, per architect and Physician direction\n\n25. Water softener\n\nBASEMENT FEATURES\n\n1. Full basement\n\n2. Bathroom, including shower area\n\n3. Partitioned utility/furnace room ( including soft water, suction equipment, etc.)\n\n4. Plumbed for washer and dryer\n\n5. Partitioned for five secured spaces, corresponding to main floor footages, with heat and lights for each space\n\n6. Finished dry wall ( texture and painted ), with locking doors for security and confidentiality\n\n7. Shelving ( adjustable ) for file storage\n\nFURNISHING/DECORATING FEATURES\n\n1. Tile bathrooms and entryway ( Lavin Tile )\n\n2. Paint and wall paper, per Physician choice\n\n3. Floor coverings to be hardwood or quality, longwearing carpet, per Physician choice\n\n4. Bathroom sinks and toilets to match color scheme\n\n5. Two trash compactors and two refrigerators\n\n6. Garbage disposal and dishwasher\n\n7. New signage\n\n8. Built-in desk/computer terminal in physician office, if requested\n\n9. Patient file system, if existing systems not adaptable\n\n10. Waiting room furniture and decor ( magazine racks, etc. )\n\n11. Fully equipped exam rooms ( exam tables, furniture, portable exam lights, wall mount o \u0026 o/opthalmo-scopes, electric thermometers, supply carts, etc. )\n\n12. Physician chair for office\n\n13. Color TV/VCR units for offices and exam rooms for educational purposes\n\n14. Appropriate furniture\n\nMISCELLANEOUS\n\n1. WMC to provide snow removal services\n\n2. WMC to provide access to transcription services as a pilot project for PHO\n\n3. Any additional cost attributable to the relocation, including stationery, checks, bills, etc. ( to include additional printing costs and reimbursement for unused stationery items )\n\nEXHIBIT B\n\nWM's Environmental Indemnity Agreement. In further consideration of the exchange set forth in the letter of intent, WMC agrees as follows:\n\nDefinitions. For purposes of this Exhibit B:\n\n1. The AProperty@ means both the real property and improvements located at 1129 E. Second St. and 230 South Washington, and the property upon which the replacement building will be constructed, as more particularly described as Lots 1, 2, 3, and 4, Whit's Addition to the City of Casper, and Lots 17, 18, 19, and 20, Natrona Heights Addition to the City of Casper, Natrona County, Wyoming.\n\n2. AHazardous Materials@ means (1) hazardous wastes, hazardous substances, hazardous constituents, toxic substances or related materials, whether solids, liquids or gases, including but not limited to substances defined as Ahazardous wastes,@ Ahazardous substances,@ Atoxic substance,@ Apollutants,@ Acontaminants,@ Aradioactive materials,@ or other similar designations in, or otherwise subject to regulation under, the Comprehensive Environmental Response, Compensation and Liability Act of 1980, as amended, 42 U.S.C. ' 9601 et seq.; the Toxic Substance Control Act, 15, U.S.C. ' 2601 et seq.; the Hazardous Materials Transportation Act, 49 U.S.C. ' 1802; the Resource Conservation and Recovery Act, 42 U.S.C. ' 9601 et seq.; the Clean Water Act, 33 U.S.C. ' 1251 et seq.; the Safe Drinking Water Act, 42 U.S.C. ' 300f et seq.; the Clean Air Act, 42 U.S.C. ' 7401 et seq.; and in any permits, licenses, approvals, plans, rules, regulations or ordinances adopted, or other criteria and guidelines promulgated pursuant to the preceding laws or other similar federal, state or local laws, regulations, rules or ordinance now or hereafter in effect relating to environmental matters (collectively the AEnvironmental Laws@); and (2) any other substances, constituents or wastes subject to any applicable federal, state or local law, regulation or ordinance, including any Environmental Law, now or hereafter in effect, including but not limited to (A) petroleum, (B) refined petroleum products, (C) waste oil, (D) waste aviation or motor vehicle fuel and (E) asbestos.\n\n3. AEnvironmental Conditions@ means conditions of the environment, including the ocean, natural resources (including flora and fauna), soil, surface water, ground water, any present or potential drinking water supply, subsurface strata or the ambient air, relating to or arising out of the use, handling, storage, treatment, recycling, generation, transportation, release, spilling, leaking, pumping, pouring, emptying, discharging, injecting, escaping, leaching, disposal, dumping or threatened release of Hazardous Materials. With respect to claims by employees, Environmental Conditions also includes the exposure of persons to Hazardous Materials within the workplace.\n\n4. AEnvironmental Noncompliance@ means, but is not limited to: (1) the release or threatened release of any Hazardous Materials into the environment, any storm drain, sewer, septic system or publicly owned treatment works, in violation of any effluent or emission limitations, standards or other criteria or guidelines established by any Environmental Law; (2) any noncompliance of physical structure, equipment, process or premises with the requirements of building or fire codes, zoning or land use regulations or ordinances, conditional use permits and the like; (3) any noncompliance with federal, state or local requirements governing occupational safety and health; (4) any premises operations procedures, designs, and the like which do not conform to the statutory or regulatory requirements of the Environmental Laws (including land use regulations and ordinances) intended to protect public health, welfare, and the environment; (5) the failure to have obtained permits, licenses, variances or other governmental authorizations necessary for the legal operation of any equipment, process, premise or any other activity; (6) the operation of any premise or equipment in violation of any permit condition, schedule of compliance, administrative or court order and the like.\n\n5. AClaims@ shall include, without limitation, claims, demands, suits, causes of action for personal injury or property damage (including any depreciation of property values, lost use of property, consequential damages arising directly or indirectly out of Environmental Conditions); actual or threatened damages to natural resources; claims for the recovery of response costs, or administrative or judicial orders directing the performance of investigations, response or remedial actions under the Environmental Laws; a requirement to implement Acorrective action@ pursuant to any order or permit issued pursuant to any Environmental Law; claims for restitution, contribution or equitable indemnity from third parties or any governmental agency; fines, penalties, liens against property; claims for injunctive relief or other orders or notices of violation from federal, state or local agencies or courts; and, with regard to any present or former employees, exposure to or injury from Environmental Conditions.\n\n6. AExpenses@ shall include any liability, loss, cost or expense including, without limitation, costs of investigation, cleanup, remedial or response action, the costs associated with posting financial assurances for the completion of response, remedial or corrective actions, the preparation of any closure of other necessary or required plans or analyses (including but not limited to spill prevention, control and countermeasure plans), or other reports or analyses submitted to or prepared by regulating agencies, including the costs of health assessments, epidemiological studies and the like, retention of engineers and other expert consultants, legal counsel, capital improvements, operations and maintenance testing and monitoring costs, power and utility costs and pumping taxes or fees, and administrative costs incurred by governmental agencies.\n\nWM's Environmental Release. WMC hereby releases and forever discharges Physicians from any and all Claims, damages (including, without limitation, diminution in value), losses, liabilities and Expenses, lawsuits, deficiencies, interest, penalties and attorney' fees, whether or not arising out of third-party claims, in connection with any Environmental Conditions or the remediation of any Environmental Conditions (whether now known or herafter discovered), or any Environmental Noncompliance, including without limitation any Claims, Expenses, losses, liabilities, and the like resulting from the alleged exposure of any person or property to Environmental Conditions, EXCEPT any such Claims which are determined by a court or Environmental Agency having jurisdiction over such matters by final, unappealable order to have been caused by the actions or operations of Physicians or their employees or agents during the time Physicians owned the Property.\n\nWM's Environmental Indemnification. WMC hereby agrees to indemnify, defend and hold harmless Physicians from and against and in respect of any and all Claims, damages (including, without limitation, diminution in value), losses, liabilities and Expenses, lawsuits, deficiencies, interest penalties, attorney' fees and all amounts paid in defense or settlement of the foregoing whether or not arising out of third-party claims, which may be imposed upon or incurred by Physicians or asserted against Physicians by any other party or parties (including any governmental entities), in connection with any Environmental Conditions or the remediation of any environmental Conditions (whether now known or hereafter discovered), or any Environmental Noncompliance, including without limitation any Claims, Expenses, losses, liabilities, and the like resulting for the alleged exposure of any person or property to Environmental Conditions, EXCEPT to the extent that such costs or liability arise as a result of the actions or operations of Physicians, their employees, agents or tenants during the time Physicians owned the property, as determined by a Court or Environmental Agency by final appealable order. The duty to defend and pay all expenses and costs therefore shall continue until such final order. WMC shall have the right to recover all such costs and expenses of defense if it is ultimately determined by such final order that the Claim was due to the actions or operations of Physicians. WM's obligations pursuant to this section shall exist regardless of whether Physicians are alleged or held to be strictly or jointly and severally liable.\n\nPhysician Representations. Physicians represent that they are aware of no Environmental Noncompliance or Environmental Condition with respect to the Property which would result in a Claim, and that the actions or operations of Physicians during the time they owned the Property complied with all Environmental Laws. Physicians acknowledge that this representation is material in WMC executing this environmental indemnity provision.\n\n\u003cspan class=\"fn\"\u003e1. Throughout the record in this case, the increase in square footage is referred to in varying amounts, i.e., 11,800, 11,833, and 11,900. For purposes of this opinion, we will use 11,900.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The document is reproduced in the appendix to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Numbered paragraph 10 addressed environmental indemnification; another provision addressed WM's 20-year guaranty of the lease of vacant space in the building.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 34 of Restatement (Second) of Contracts reads: (1) The terms of a contract may be reasonably certain even though it empowers one or both parties to make a selection of terms in the course of performance. (2) Part performance under an agreement may remove uncertainty and establish that a contract enforceable as a bargain has been formed. (3) Action in reliance on an agreement may make a contractual remedy appropriate even though uncertainty is not removed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. 139. Enforcement by Virtue of Action in Reliance (1) A promise which the promisor should reasonably expect to induce action or forbearance on the part of the promisee or a third person and which does induce the action or forbearance is enforceable notwithstanding the Statute of Frauds if injustice can be avoided only by enforcement of the promise. The remedy granted for breach is to be limited as justice requires. (2) In determining whether injustice can be avoided only by enforcement of the promise, the following circumstances are significant: (a) the availability and adequacy of other remedies, particularly cancellation and restitution; (b) the definite and substantial character of the action or forbearance in relation to the remedy sought; (c) the extent to which the action or forbearance corroborates evidence of the making and terms of the promise, or the making and terms are otherwise established by clear and convincing evidence; (d) the reasonableness of the action or forbearance; (e) the extent to which the action or forbearance was foreseeable by the promisor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Palmer by Diacon v. Farmer' Ins. Exchange, 861 P.2d 895, 914 (Mont. 1993); see e.g., FDIC v. Aetna Cas. and Sur. Co., 903 F.2d 1073, 1080 (6 th Cir. 1990) (Apressing a legitimate contractual defense . . . can certainly not be a basis for a bad faith claim@); California Physicians Service v. Superior Court, 12 Cal.Rptr.2d 95, 100 (Cal. Ct. App. 1992); Nies v. Na'l Auto Cas. Ins. Co., 245 Cal.Rptr. 518, 524 (Cal. Ct. App. 1988).\u003c/span\u003e\n\n",
    "body_length": 202084,
    "citedas": [
      "4 P.3d 209"
    ],
    "attorneys": "Representing Appellants:Mark W. Gifford of Gifford \u0026 Bonner, Casper, Wyoming.Representing Appellee:Michael J. Sullivan of Brown, Drew, Massey \u0026 Sullivan, Casper, Wyoming;and Raymond B. Hunkins of Jones, Jones, Vines \u0026 Hunkins, Wheatland,Wyoming.",
    "category": [
      "124",
      "252",
      "213"
    ],
    "judges": "Before Lehman, C.J., and Thomas, Macy, Golden and Taylor,* JJ.* Chief Justice at time of oral argument; retired November 2, 1998.",
    "citation_count": 65
  }
}
