{
  "id": "EoOdPmYBTlTomsSBhsUG",
  "document": {
    "title": "Pettway v. American Cast Iron Pipe Co.",
    "full_title": "RUSH PETTWAY ET AL. v. AMERICAN CAST IRON PIPE COMPANY, A CORPORATION",
    "jurisdiction": "Fifth Circuit",
    "date": "1978-07-24T00:00:00.000Z",
    "docket": "No. 75-4219",
    "body": "GOLDBERG, Circuit Judge:\n\nThis complex class action employment discrimination suit, now before us for the fourth time, illustrates the difficulties inherent in judicial efforts to remedy violations of Title VII of the Civil Rights Act of 1964, 42 U.S.C. ยง 2000e et seq., by undoing the effects of past racial discrimination in employment. Complaints alleging racial discrimination in employment were first filed with the Equal Employment Opportunity Commission on November 22, 1965.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Suit was brought on May 13, 1966 under Title VII and 42 U.S.C. ยง 1981, and the class was certified pursuant to Federal Rules of Civil Procedure 23(b)(2).\n\nThe complaint was dismissed by the district court on March 10, 1967 on the ground that the EEOC had failed to attempt conciliation prior to initiation of the court action. On appeal with several other actions, we reversed. Dent v. St. Louis-San Francisco Railway Co., 406 F.2d 399 (5th Cir. 1969). During the pendency of that first appeal, the defendant, American Cast Iron Pipe Company (hereinafter \"ACIPCO\") discharged one of the named plaintiffs. That plaintiff then sought and was denied relief in the district court. We again reversed, directing reinstatement and back pay. Pettway and Wrenn v. American Cast Iron Pipe Co., 411 F.2d 998 (5th Cir. 1969).\n\nThe district court then addressed itself to the plaintiffs' substantive charges. In 1970 the court examined the racial composition of the Board of Operatives, an advisory board composed of non-supervisory personnel elected by employees of the company. In 1922 the founder of ACIPCO, John J. Eagan, had bequeathed all the outstanding common stock of the company to the members of Board of Operatives and the Board of Management, a body composed of corporate officials elected by the Board of Directors to conduct the day to day business of the company, and their successors in office. The Boards acted as trustees for the benefit of the present and future employees of the company. From 1922 until January, 1970 the membership of the Board of Operatives was explicitly limited to \"white\" employees. Blacks were relegated to the Auxiliary Board, which was created to advise the other two boards on matters affecting the interests of black employees. Pettway v. American Cast Iron Pipe Co., 494 F.2d 211 (5th Cir. 1974). In 1970 the district court ordered the integration of the Board of Operatives and the abolition of the all-black Auxiliary Board. Pettway v. American Cast Iron Pipe Co., 332 F. Supp. 811 (N.D.Ala.1970), aff'd 494 F.2d 211, 264-67 (5th Cir. 1974).\n\nThe employee discrimination charges were tried in October 1971. The district court found that certain testing conducted by the company had an adverse impact on the employment opportunities of black employees and did not pass muster under Griggs v. Duke Power Co., 401 U.S. 424, 91 S. Ct. 849, 28 L. Ed. 2d 158 (1971). Nevertheless, the court denied all requested relief except attorneys' fees and costs. On appeal, we again reversed the district court, and to guide the court on remand, we examined the governing law in a lengthy and detailed opinion. We instructed the court to order back pay to compensate class members for wages lost due to past discrimination and to formulate injunctive relief particularized to the circumstances of the case but as broad in scope as necessary to ensure black employees the opportunity to reach positions in the company previously denied to them by discriminatory practices. Pettway v. American Cast Iron Pipe Co., 494 F.2d 211 (5th Cir. 1974) (hereinafter cited as \" Pettway III \").\n\nOn remand the district court encouraged the litigants to engage in settlement negotiations directed toward the fashioning of a decree to carry out the mandate of Pettway III. The district judge played an active role in the extensive negotiations which followed. It remains unclear precisely what was resolved during these negotiations. In any event, on May 14, 1975 the court, over the plaintiffs' objections, issued a decree ordering injunctive relief and back pay. On June 12, 1975, after further negotiations concentrating primarily on the issue of back pay, the court issued its final judgment awarding one million dollars to a subclass composed of 841 members (the \"back pay subclass\")\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e of the 2242 person class.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The June 12 judgment also effected a few minor modifications in some of the injunctive provisions of the May 14 decree.\n\nOn June 13, 1975 the active named plaintiffs\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and a number of other class members requested that class attorney Oscar W. Adams, Jr. appeal the decree and judgment. Mr. Adams informed these class members that he did not intend to appeal. Robert L. Wiggins, Jr., then was retained to file objections to the decree and to prosecute an appeal. On September 5, 1975, the district court denied a motion by appellants to substitute Mr. Wiggins as class counsel and on November 20, entered its final order overruling all motions by the dissatisfied class members. This appeal followed.\n\nThe length of litigation in complex Title VII class actions often rivals that of even the most notorious antitrust cases. In the instant case, we encounter another judicial paleolithic museum piece. Last year this court, speaking in retrospect but proving to be prophetic as well, cited Pettway III as an example of the time and expense which must be incurred \"before the dust of combat has finally settled\" in employment discrimination class actions. Cotton v. Hinton, 559 F.2d 1326, 1331 (5th Cir. 1977). Little did we then realize that we were dealing with atomic fallout rather than mere dust. At the beginning of our 57 page opinion in Pettway III we stated, perhaps naively, that\n\nAlthough the path of this law suit is strewn with the corpses of intermediate decisions, the posture of the present case on appeal will hopefully allow final resolution. In order to accomplish this the opinion must unfortunately be long and complex.\n\n494 F.2d at 216 (footnote omitted). As is now evident, the fallout continues to radiate, and our earlier optimism regarding the disposition of this case has mutated to less hopeful emotions. Nonetheless, we are undaunted by the crushing weight of accumulated record and remain mindful that the Court must not diverge from the direction charted for us by the Title VII compass, no matter how long and difficult the journey. We, thus, address ourselves to the fourth appearance of this case, determined to ensure that the victims of illegal racial discrimination receive the full measure of relief which the law accords them.\n\nOur burden is eased considerably by the thorough and scholarly opinion written by Judge Tuttle in the prior appeal. Except where subsequent cases further elucidate our prior holding or provide necessary qualifications, we have been able to adopt the factual and legal conclusions reached in Pettway III without the need for an extensive review of previously considered authorities. Even so, our task will require an opinion of a magnitude similar to Judge Tuttle's opus.\n\nThis case presents a multitude of issues. On the one hand, we are asked to address fundamental questions at the heart of class action jurisprudence, such as the appealability of class action judgments by dissatisfied class members, the standards for settlement approval in the face of widespread dissent from the class, and the choice of the appropriate decision-maker to act on behalf of the class. We are also asked to resolve highly technical questions concerning specific affirmative modifications of present plant operating practices. Appellants' primary contentions on appeal are that the injunctive relieve portions of the judgment below are inadequate to effectuate our mandate in Pettway III, that the district court erred in denying back pay to over 1400 class members, and that the back pay settlement on behalf of the subclass was inadequate and improperly approved by the court. Before reaching these issues, however, we must consider defendant's contention that appellants lack \"standing\" to appeal the district court's decree. Because our analysis of both appealability and the substantive issues depends in part on whether the decree should be considered a settlement or the court's own judgment, a question upon which there is vehement disagreement, we turn first to an examination of the proceedings below which culminated in the district court's November 20, 1975 final order.\n\nI. Settlement or the Court's Own Judgment - Entering the Twilight Zone\n\nThe role of an appellate court in reviewing a decree in a class action suit varies greatly depending on whether the decree was reached through a settlement by the litigants or whether the decree represents the judgment of the court. Compare Cotton v. Hinton, 559 F.2d 1326, 1330-31 (5th Cir. 1977) (settlement); Flinn v. FMC Corp., 528 F.2d 1169 (4th Cir. 1975), cert. denied, 424 U.S. 967, 96 S. Ct. 1462, 47 L. Ed. 2d 734 (1976) (settlement); United States v. Allegheny-Ludlum Industries, Inc., 517 F.2d 826, 846-51 (5th Cir. 1975), cert. denied, 425 U.S. 944, 96 S. Ct. 1684, 48 L. Ed. 2d 187 (1976) (settlement); and Newman v. Stein, 464 F.2d 689, 692-93 (2d Cir. 1972) (Friendly, J.) (settlement); with Albemarle Paper Co. v. Moody, 422 U.S. 405, 95 S. Ct. 2362, 45 L. Ed. 2d 280 (1975) (judgment); Watkins v. Scott Paper Co., 530 F.2d 1159 (5th Cir. 1976) (judgment); United States v. United States Steel Corp., 520 F.2d 1043 (5th Cir. 1975) (judgment); Rogers v. International Paper Co., 510 F.2d 1340 (8th Cir. 1975), vacated on other grounds, 423 U.S. 809, 96 S. Ct. 19, 46 L. Ed. 2d 29 (1975) (judgment) and Head v. Timken Roller Bearing Co., 486 F.2d 870, 875-77 (6th Cir. 1973) (judgment). These differing modes of review reflect a recognition of the different character of the two types of judicial resolution. The standard of review appropriate to a court judgment is premised on the requirement that the trial judge, following adversary presentation of the facts and law, exercise his independent judgment on each of the issues presented for decision. His ruling must be based on findings of fact supported by evidence in the record and on conclusions of law. The role of the trial court in arriving at an independent judgment closely parallels its more traditional role in the non-class action context. Consequently, review of class action judgments is patterned after the conventional modes of review. The appellate court can review the trial court's findings of fact to ensure that they are supported by the record and are not clearly erroneous, while giving appropriate deference to the trial judge's superior ability to assess demeanor and credibility. The reviewing court is also particularly well suited to make an independent assessment of the law as applied to the facts, again giving deference to the lower court where the law affords some measure of latitude and discretion.\n\nDifferent problems are posed by class action settlements. Lacking a fully developed evidentiary record, both the trial court and the appellate court would be incapable of making the independent assessment of the facts and law required in the adjudicatory context. Moreover, a definitive judicial determination of the facts and law would be inappropriate because compromise of legal rights is intrinsic to the settlement process. Because of the limited control exercised by any particular class member over the decision to engage in these compromises, however, the settlement process is more susceptible than adversarial adjudications to certain types of abuse. The interests of lawyer and class may diverge, as may the interest of different members of the class, and certain interests may be wrongfully compromised, betrayed, or \"sold out\" without drawing the attention of the court. For this reason, in addition to requiring that the trial court evaluate whether a class action settlement is \"fair, adequate and reasonable and is not the product of collusion between the parties\", Cotton v. Hinton, supra, 559 F.2d at 1330, the law accords special protections, primarily procedural in nature, to individual class members whose interests may be compromised in the settlement process. These protections include notice, ensuring that class members know when their rights are being compromised, and an opportunity to voice objections to the settlement.\n\nWe recognize that this neat dichotomy is in some respects over-simple. In the class action context, some of the abuses generally associated with settlements may insinuate themselves into litigation resulting in the court's own judgment. For example, in framing litigation strategy in a complex suit the class attorney and named plaintiffs might concentrate on relief for certain members of the class while ignoring the interests of others. Nevertheless, because the potential for abuse is much greater when class actions are resolved through a settlement, the procedural protections applicable to settlements are not utilized in the judgment context.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nCourts have not often been required to examine the nuances of the distinction between a settlement and a court's own judgment. The nature of the lower court's decree is usually obvious as a factual matter and not subject to dispute by the parties. That is decidedly not the case here. The litigants before us dispute almost every factual or quasi-legal element in the case, and the classification of the district court's order as a settlement or judgment is no exception. We are thus faced with the novel issue of determining whether the lower court's order, as it relates to injunctive relief, the scope of the back pay subclass, and the size of the back pay award, constitutes a consent decree or the judgment of the district court.\n\nAppellants maintain that both the injunctive relief and back pay awards resulted from a settlement between ACIPCO and Mr. Adams, the original class attorney. If this characterization is accepted, appellants could then argue that the procedures prerequisite to acceptance of the settlement by the district court were not followed below and that the district court therefore abused its discretion in approving the consent decree.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The district court's order could then be reversed on this \"procedural\" ground without necessitating a review of the substantive elements of the order.\n\nThe defendant, on the other hand, argues that the entire order of the district court constitutes the court's own judgment, in which event appellants were not entitled to the procedural safeguards prerequisite to judicial acceptance of a class action settlement. The court's order then could be reversed only if the district court applied an improper legal standard or misapplied the correct standards.\n\nOur careful examination of the record reveals that the district court's order is not susceptible to easy or uniform characterization. Settlements and court judgments are distinguished not by different platonic essences, but by the processes of their creation. Thus in order to resolve the dilemma posed by the litigants, it is necessary to consider the process by which the district court reached its final order of November 20, 1975.\n\nA. Brief History\n\nFollowing remand from this court's decision in Pettway III, the district judge met with counsel in chambers on July 11, 1974 and directed the parties to fashion an appropriate decree. On August 19, 1974 the defendant submitted to both Mr. Adams and the court a proposed decree covering both back pay and injunctive relief. The plaintiffs filed objections to the proposed injunctive order and submitted a counter-proposal for back pay. After negotiations between the parties, the defendant filed a revised proposal, including an augmented back pay offer of $560,000 to the back pay subclass. The plaintiffs did not accept either the proffered injunctive relief or back pay settlement offer. Further negotiations failed to resolve this impasse, and on May 14, 1975 the court entered its May decree. This decree substantially adopted defendant's revised proposal as to injunctive relief but, in an apparent attempt to satisfy the plaintiffs' objections to the back pay award, ordered the company to utilize a modified method of calculation to compute the award for the back pay subclass.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e This method of calculation resulted in a total back pay award of $907,222.18, to be divided among members of the subclass according to a distribution formula.\n\nOn May 23, 1975 the plaintiffs filed a motion for reconsideration, objecting to the injunctive relief provisions of the decree, the exclusion from the back pay subclass of 1400 class members, and the amount of the back pay award. After an in-chambers conference with the parties, the district court overruled plaintiffs' objections to the affirmative relief provisions of the decree and to the court's exclusion of 1400 employees from the back pay subclass, but revised both the back pay distribution formula and the method for determining the size of the back pay award. A few minor changes were also made in some of the departmental lines of progression previously adopted by the court.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e All of these changes were embodied in a judgment dated June 12, 1975. Calculations based on the June 12 judgment resulted in a total back pay award of $1,000,000. The court also awarded plaintiffs' counsel $220,000 in attorney's fees.\n\nThe court's final order and modified judgment of November 20, 1975 essentially restated the provisions of the June 12 judgment with the addition of findings of fact and conclusions of law. The November 20 final order also provided dissenting subclass members with the opportunity to opt-out of the back pay award. See footnote 2 supra.\n\nB. Injunctive Relief\n\nOur review of the record and this procedural history compels the conclusion that the injunctive relief provisions of the decree constituted the court's own judgment. The district judge indicated his own view concerning the proper characterization of this portion of the decree during a hearing held on October 30, 1975.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In the course of that hearing, Judge Lynne stated:\n\nThe judgment of this Court entered on May the 14th granting the affirmative relief mandated by the Fifth Circuit was my judgment. I was aided in its formulation by the arguments, extensive arguments of counsel, but that is my final judgment implementing the decree of the Fifth Circuit. (emphasis supplied).\n\nThe record fully supports this characterization by Judge Lynne. Mr. Adams repeatedly objected to the injunctive relief provisions of the order and at no time consented to defendant's proposed decree on injunctive relief. Nor did the district court modify any of the injunctive provisions in response to plaintiffs' objections. See footnote 8 supra. Appellants and the EEOC argue that Mr. Adams concentrated on back pay in his negotiations with the company and that as a practical matter the injunctive provisions were based on compromise and settlement. We find nothing in the record that supports this conclusion. Moreover, it can hardly be inferred from the fact that Mr. Adams concentrated on back pay during the negotiations that he consented to the injunctive relief provisions.\n\nOur conclusion is not changed by anything found in a stipulation entered into by Mr. Adams and counsel for the defendant.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The stipulation relates an off-the-record statement made by Mr. Adams to the court to the effect that while the May decree and the June final judgment did not contain every provision sought by the plaintiffs, they \"constituted a good decree . . . and the judgment should be given an opportunity to work . . . .\" Mr. Adams therefore concluded that he would not appeal from the decree. The EEOC argues that this stipulation reveals that the injunctive relief provisions resulted from compromise between the parties. We cannot agree. We perceive a significant distinction between an after-the-fact conclusion that a court's judgment is essentially satisfactory and, all things considered, does not justify an appeal, and a before-the-fact consent to the precise terms of defendant's proposed decree. Nothing in the stipulation indicates that Mr. Adams did more than acquiesce in the court's final order after it became apparent that the court would not consider further objections. In the context of this litigation, this may more aptly be characterized as resignation to the inevitable then consent to a settlement. While the arguments of appellants and the EEOC may indicate the potential dangers of less than avid advocacy even in the context of a court judgment, they do not shake our firm conclusion that the injunctive relief portions of the decree represent the court's own judgment, rather than a settlement between the parties, and must be treated accordingly.\n\nC. Defining the Back Pay Subclass\n\nThe district court's May 14 decree excluded all blacks hired by ACIPCO subsequent to July 2, 1965 from the back pay subclass. As a result, 1400 of the 2241 employees in the class were precluded from receiving any award of back pay. See note 3 supra. Despite repeated objections by Mr. Adams to the exclusion of class members from the back pay subclass, the court refused to reconsider its decision. We find no suggestion in the record that Mr. Adams ever agreed to the exclusion of 1400 class members from a share of the back pay award. In the November 20 final order, the court acknowledged that the definition of the subclass was the court's own judgment:\n\nThe Court finds from the evidence and concludes that no black employee employed subsequent to July 2, 1965 has suffered any economic loss due to the Company's testing and educational requirements or from any other alleged discriminatory practice. (A 415)\n\nWe therefore conclude that the exclusion of 1400 class members from the back pay subclass was the court's own judgment and not part of any settlement by the litigants.\n\nD. The Amount of the Back Pay Award\n\nThe district court's final order of November 20, 1975 provided for the distribution of $1,000,000 to the members of the back pay subclass. If the injunctive relief and subclass determinations resisted facile classification, the manner in which the back pay determination was made defies virtually any traditional characterization. Typically, class action settlements are reached by the parties, who draft a consent decree which is submitted to the trial judge for approval. The court's role is generally limited to mediating disputes and offering suggestions. Indeed, we have recently stated that while the court in reviewing a settlement may make suggestions for modifications of the proposed decree, it may not unilaterally change the decree. Approval of the parties' settlement must be either given or withheld. See Cotton v. Hinton, supra, 559 F.2d at 1331. See also Flinn v. FMC Corp., supra, 528 F.2d at 1173-74.\n\nThe events leading to the final back pay award in this case do not conform to this model. An examination limited to the court's May decree and June judgment might suggest that the award was the court's own judgment. While changes in the back pay formula resulting in increases in the total amount of the award were made in response to plaintiffs' objections to both the defendants' back pay offer and the courts' May decree, it was the trial judge, rather than the defendant, who determined the amount of the June award. As the court stated in its June judgment when describing its role in resolving the back pay issue:\n\nThe Court has carefully examined the varying contentions of the parties, has adopted some elements of each, and has determined therefrom that . . . . [the court then described the final back pay judgment] (A 183)\n\nThus it is clear that the court did not merely accept or reject a proposed settlement.\n\nNonetheless, the record reveals that the size of the back pay award was determined in a process of negotiation and that the final award was determined with the consent of plaintiffs counsel. The impression that the back pay award was the court's own judgment results in part because there exists no record of the numerous conferences held between the parties and Judge Lynne on the back pay issue. Judge Lynne's own pronouncements on the question reveal that the final $1,000,000 back pay figure in the November order was arrived at through some sort of agreement by the parties. For example, at the September 5 hearing on substitution of counsel Judge Lynne stated:\n\nA study was made by the company which indicated to my satisfaction that there were at least three hundred employees who were not entitled to anything.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e We went over that study very carefully. The obligation of the company for back pay as disclosed by a very careful analysis was in the neighborhood of $650,000 or $680,000, somewhere along that line . . . . After many conferences in which I expressed the opinion that a formula should be devised so that every black employee in the class would get some back-pay award, eventually we came to the amount involved of a million dollars. (A 989) (emphasis supplied).\n\nAt the October 30 hearing, which was held for the purpose of receiving evidence on the process by which the May and June judgments were formulated, the court reiterated this view. After stating that injunctive relief constituted the court's own judgment, Judge Lynne noted:\n\nThe matter stands somewhat differently with respect to the back pay award. Back pay award resulted from continuous negotiations. (A 1043)\n\nI am aware of the fact, of course, that there are members of the class who are dissatisfied with every aspect of this final judgment. That's almost inescapable where human beings are involved, and particularly with the award of back pay at which the Court arrived with the agreement of counsel. (A 1044). (emphasis supplied).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nFinally, the district judge in his November 20 final order concluded that \"the individual back pay awards were arrived at through negotiations between the parties at the urging of the Court and are in the nature of a consent settlement. . . .\" (A 417) (emphasis supplied).\n\nWe are thus faced with a situation in which the events leading to the back pay award do not coincide with the paradigmatic class action settlement, yet plaintiffs' counsel did in fact agree to the amount of the final award. In this context it is virtually impossible to distinguish meaningfully between a process in which each party finally acceded to a figure chosen by the trial judge\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and one in which the parties themselves came to an agreement which was then adopted by the court in its final order. Any such distinction is especially tenuous where, as here, the trial judge has been authorized to participate in the settlement negotiations. See Pettway III, supra, 494 F.2d at 258.\n\nIn these circumstances, the trial court's characterization of its back pay decree as \"in the nature of\" a consent settlement marks the extent of the progress we can achieve in our definitional inquiry with any sense of confidence. Recognizing the hybrid nature of the decree, we find it necessary to abandon any further attempt to pigeonhole or classify it, and look instead to the functional considerations underlying the distinctive treatment of settlements and judgments. Under this functional approach, the question becomes whether this decree is more appropriately treated, for purposes of judicial review, as a settlement, requiring certain procedural protections for members of the class, or as the court's own judgment, in which case our evaluation must focus not on the procedural protections, but on the factual and legal bases for the award. We look for guidance to those factors counselling in favor of procedural protections for class members in traditional settlements and counselling against a paradigmatic judgment.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nExamining the decree in the context of this appeal by members of the back pay subclass, it becomes clear that we must treat Judge Lynne's order as a consent decree. First, we note that each of Judge Lynne's orders represented an attempt to satisfy specific objections advanced by Mr. Adams with respect to prior formulations for determining the size of the back pay award. The trial judge, in essence, was negotiating with the class. These negotiations culminated, prior to the June 12 judgment, in Mr. Adams' consent to the $1,000,000 proposal. At least from the viewpoint of the class, the decree was in fact reached by agreement. Such an agreement, which perhaps embodied compromises of class rights, calls for the procedural protections normally associated with class action settlements. To allow a class attorney to compromise the rights of class members without providing these protections would be inconsistent with the policies of Rule 23(e).\n\nEqually important, the statements of the trial judge quoted above reveal that Judge Lynne viewed the order as a consent decree reached through a process of negotiation. The record does not indicate that the final back pay award resulted from the district court's own valuation of the economic loss to the back pay subclass resulting from the defendants' discriminatory practices as measured by the standards set out in Pettway III. To the contrary, Judge Lynne's own pronouncements demonstrate that the award was viewed by the court as a compromise between the parties.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Thus the substantive protections normally present in an adjudicated judgment, including the judge's independent determination of facts and law, were not present here. The district court in framing an adjudicated judgment must determine the full measure of damages to which the class is entitled as a matter of law. Under these circumstances in which the district court did not purport to make such a determination, we cannot treat the award as the court's judgment, and must instead treat it as a consent decree vis-a-vis the class.\n\nIn sum, we have determined that the injunctive relief portions of the decree and the denial of back pay to class members employed subsequent to July 2, 1965 must be considered as the court's own judgment. The back pay award to the subclass shall be treated as a consent settlement.\n\nII. Appealability\n\nThe company argues vigorously that appellants are procedurally disqualified from raising each of their points of error on this appeal. First, ACIPCO alleges that Mr. Wiggins has never been certified as class counsel and thus may not appeal on behalf of the class the injunctive portions of the decree or the decision to exclude 1400 class members from the subclass. The company also alleges that each of the individual appellants either lacks standing to challenge the back pay settlement on appeal or has yet to receive an appealable final judgment as to back pay. Before addressing these contentions, however, it is necessary to outline briefly the chronology of events leading to this appeal.\n\nA. Background\n\nOn June 13, 1975, the day after the court entered its June judgment, the three active named class representatives and at least twenty-eight of the thirty elected representatives of the Committee for Equal Job Opportunity\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e met with the class counsel, Mr. Adams, and requested that he appeal the court's judgment. Mr. Adams stated his intention not to appeal the judgment,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e but indicated that the individual plaintiffs were free to consult other counsel for purposes of retaining separate representation and prosecuting an appeal. On June 20, 1975, 661 class members filed objections to the decree, and on June 22 these plaintiffs retained Mr. Wiggins as counsel. On September 5 the district court denied appellants' motion to substitute Mr. Wiggins as class counsel; motions requesting discovery and further evidentiary hearings were denied in the court's November 20 final order. This appeal followed.\n\nB. Injunctive Relief and Exclusion from the Back Pay Subclass\n\nWe consider first the appealability of the district court's judgment as to both injunctive relief and the denial of back pay to 1400 class members. The defendant argues that appellants may not upset the court's judgment binding the class because they are appealing solely in their individual capacities and not as a class.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Appellants respond that Mr. Adams ceased to adequately represent the class when he refused to appeal those portions of the order which we have concluded were the court's own judgment. They urge this court to find that the district court abused its discretion in denying appellants' motion to substitute class counsel for purposes of this appeal, that appellants' counsel, Mr. Wiggins, serves as attorney for the class on this appeal, and that this appeal on behalf of the class is therefore properly before the court.\n\nWe are not aware of any cases in which the named class representatives and a large portion of the class desired to prosecute an appeal of a district court's judgment, yet the class attorney refused to do so. The issue before us is thus one of first impression, raising difficult and perplexing questions regarding the appropriate decision-maker on behalf of the class. While the \"class\" itself clearly has standing to appeal a judgment of the district court, see, e.g., Pettway III, supra; James v. Stockham Valves \u0026 Fittings Co., 559 F.2d 310 (5th Cir. 1977), it is far from clear who may make the final determination of whether the \"class\" should appeal when the desirability of an appeal is at issue. In the instant case the class attorney, Mr. Adams, concluded that an appeal would not be in the best interests of the class. Mr. Adams stated on the record that he believed the decree to be a fair one and that an appeal would only delay implementation of the rights already obtained by the plaintiffs. On the other hand, the three active class representatives, the Committee for Equal Job Opportunity, and a sizable portion of the class itself believed that the decree did not adequately vindicate the interests of the class and that an appeal was warranted.\n\nIn the context of individual-plaintiff litigation the roles of the attorney and the client are well defined. The A.B.A. Code of Professional Responsibility envisions the attorney as an advocate of the interests of the client. American Bar Ass'n, Code of Professional Responsibility, EC 7-1 [hereinafter cited as ABA Code]. Although the lawyer has some freedom to make tactical choices during litigation without consulting his client, the lawyer is expected to defer to the client's wishes on major litigation decisions. See ABA Code EC 7-1, EC 7-7, EC 7-9. Unfortunately, it remains unclear whether this model can be carried over to the class action context, as no clear concept of the allocation of decision-making responsibility between the attorney and the class members has yet emerged. See generally Developements in the Law - Class Actions, 89 Harv.L.Rev. 1318, 1578 (1976). Certainly it is inappropriate to import the traditional understanding of the attorney-client relationship into the class action context by simply substituting the named plaintiffs as the client. The interests of the named plaintiffs and those of other class members may diverge, and a core requirement for preventing abuse of the class action device is some means of ensuring that the interests and rights of each class member receive consideration by the court. Were the class attorney to treat the named plaintiff as the exclusive client, the interests of other class members might go unnoticed and unrepresented. See Gonzales v. Cassidy, 474 F.2d 67, 69-71, 76 (5th Cir. 1973); Developments in the Law, Class Actions, 89 Harv.L.Rev. 1318, 1592-95 (1976). Thus, when a potential conflict arises between the named plaintiffs and the rest of the class, the class attorney must not allow decisions on behalf of the class to rest exclusively with the named plaintiffs. In such a situation, the attorney's duty to the class requires him to point out conflicts to the court so that the court may take appropriate steps to protect the interests of absentee class members.\n\nThis does not mean, however, that the class attorney may ignore the wishes of the class representatives in making fundamental litigation decisions. As one court has stated, \"An attorney who prosecutes a class action with unfettered discretion becomes, in fact, the representative of the class. This is an unacceptable situation because of the possible conflicts of interest involved.\" Leib v. 20th Century Corp., 61 F.R.D. 592 (M.D.Pa. 1974). In the context of a shareholders' derivative action, Saylor v. Lindsley, 456 F.2d 896 (2nd Cir. 1972), Judge Friendly has stressed that courts should not \"accept the view that the attorney for the plaintiff is the dominus litis and the plaintiff only a key to the courthouse door dispensable once entry has been effected\":\n\nThere can be no blinking at the fact that the interests of the plaintiff in a stockholder's derivative suit and of his attorney are by no means congruent. While, in a general sense, both are interested in maximizing the recovery this is only a half-truth. Even apart from special considerations which . . . may cause divergence of interest in cases where extremely large amounts are at stake, there is a difference in every case. The plaintiff's financial interest is in his share of the total recovery less what may be awarded to counsel, simpliciter; counsel's financial interest is in the amount of the award to him less the time and effort needed to produce it. A relatively small settlement may well produce an allowance bearing a higher ratio to the cost of the work than a much larger recovery obtained only after extensive discovery, a long trial and appeal. We say this not in criticism but in simple recognition of the facts of class action life.\n\n456 F.2d at 900-01. The same considerations may cause a class attorney who has been awarded a substantial fee by the court to conclude that an appeal of the court's judgment might result in personally unremunerative litigation or a substantial and undesirable delay in the receipt of the fee award. When the possibility that counsel's own fervor may have been exhausted by an apparently endless legal battle is added to the equation, the potential conflict between the interests of the class and those of its attorney in an appeal cannot be ignored.\n\nIt is, therefore, clear that the decision to appeal cannot rest entirely with either the named plaintiffs or with class counsel. Nonetheless, the Rule 23(a)(4) requirement that the trial court determine whether \"the representative parties will fairly and adequately protect the interests of the class\" contemplates that the named plaintiffs will undertake a major role in the prosecution of a class action. The requirement also provides an important guarantee of a coincidence of interest between the named plaintiffs and the class.\n\nWe considered the scope of Rule 23(a)(4) and the proper role of the class representatives in deciding whether to appeal from a class action judgment in Gonzales v. Cassidy, 474 F.2d 67 (5th Cir. 1973). Gonzales was a class member in a prior class action in which only the class representative, Gaytan, was awarded both retrospective monetary relief and prospective injunctive relief. The other members of the class, including Gonzales, were granted only prospective relief. No appeal was taken. Gonzales subsequently brought a second class action raising identical issues against the same defendant, who sought to raise res judicata as a bar to relief. We rejected the defendant's res judicata defense, finding that Gaytan's failure to appeal the earlier judgment constituted inadequate representation of the class. We stressed throughout the Gonzales opinion that it was the class representative's duty to appeal the lower court's judgment and thus it was the class representative who inadequately represented the class. Implicit in our discussion and holding in Gonzales was the conviction that, at least under the circumstances of that case, the class plaintiff and not the class attorney, was responsible for deciding whether to appeal.\n\nThe foregoing considerations convince us that, at least as an initial matter, the decision to appeal a class action judgment must rest with the class plaintiffs. If in making that decision the class plaintiffs arguably fail to adequately represent the interests of the class, the class attorney should point out potential inadequacies or conflicts of interest to the trial judge. Where the named plaintiffs wish to appeal, but the class attorney concludes that an appeal is not in the best interest of the class, the district court must exercise its discretion in deciding whether to substitute class counsel to allow the named plaintiffs to maintain the appeal on behalf of the class.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The proper exercise of the district court's discretion will depend on the facts and circumstances of each case. Among the factors that should be considered by the court are (1) the adequacy of representation of the named plaintiffs, including any apparent or potential conflicts of interest they might have with the remainder of the class, (2) the extent to which other class members support or oppose the appeal, and the extent to which an appeal may be necessary to protect the interests of absent class members, (3) the adequacy of representation provided by the class attorney and any conflicts of interest between the class attorney and the class, and (4) the reasonableness of the decision to appeal, including an assessment of the possibility of success on the merits.\n\nApplying these principles to the instant case, we conclude that the class representatives should have been allowed to prosecute this appeal on behalf of the class. The trial court abused its discretion in denying appellants' motion to substitute class counsel for purposes of appealing the court's judgment.\n\nFirst, we note that the class representatives have provided excellent representation on behalf of the class during the ten years of this litigation. The named plaintiffs, through the representative Committee for Equal Job Opportunity, have held monthly meetings and distributed news letters to keep the class informed of the progress of the case. There is undisputed testimony in the record that at an early stage of the settlement negotiations, the named plaintiffs rejected offers of special back pay compensation to the most active class members, themselves included, and demanded equal consideration for all members of the class. (A 1163-65). Throughout the entire course of this litigation, including the post-judgment period, not a single class member has objected to the representation provided by the named plaintiffs. Nor has any class member objected to the prosecution of this appeal. The only potential conflict between the interests of the class representatives and those of other class members arose when all three class representatives were awarded relatively sizeable shares of the back pay award, while many class members received no back pay. This potential conflict disappeared, however, when all three active named plaintiffs rejected their back pay award and chose to prosecute this appeal.\n\nWe also find noteworthy the extent to which individual class members have demonstrated their interest in, and support for, this appeal. We reiterate that the sentiment of the class is but one factor in our analysis of the appealability question. Insofar as relevant, this is a factual question for which we necessarily must draw inferences from the sparse information contained in the record. Nonetheless, we find that the record clearly indicates a deep-seated and widespread dissatisfaction with the injunctive provisions of the decree. Among the 841 members of the subclass awarded back pay, 511 signed the June 20, 1975 objections to the decree and notice of intent to appeal. These objections focused on the injunctive portions of the decree in great detail. An additional 78 members of the subclass refused to accept the back pay award.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Thus 589 members of the 841 person subclass indicated dissatisfaction with the court's judgment. See footnote 3 supra.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e While only 150 of the 1400 class members who were excluded from the back pay subclass explicitly objected to the injunctive portions of the decree by signing the June 20 objections, the record indicates that many individuals in this group received no notification of the judgment and had no opportunity to object either to their exclusion from the subclass or to the injunctive provisions of the decree.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Moreover, Acording to appellants' figures which are not contested by ACIPCO, over 1000 of the 2242 class members were no longer employed by ACIPCO in 1975. These members of the class did not have a personal stake in the injunctive provisions of the decree and could not be expected to object to allegedly inadequate injunctive relief. When due consideration is given to these factors, along with the widespread objections to the injunctive portions of the decree raised by the subclass members and the failure of a single class member to object to the representation provided by the named plaintiffs or their decision to prosecute this appeal, we find that a substantial portion of the class supported this appeal on the issue of injunctive relief.\n\nFurthermore, there can be no doubt that an appeal from the denial of back pay is in the best interests of the 1400 class members who were excluded from the subclass. Gonzales v. Cassidy, supra, compels the conclusion that the class plaintiffs, in order to satisfy their duty to adequately represent the class, must appeal this portion of the court's order. As we noted in Gonzales :\n\nGaytan [the class representative], through his attorney, vigorously represented the class until he obtained individual relief [for himself only]. The problem is that he was representing approximately 150,000 persons, who, although having had their licenses and registration receipts suspended without due process, were denied any relief by the three-judge court's prospective only application of its decision. So long as an appeal from this decision could not be characterized as patently meritless or frivolous, Gaytan should have prosecuted an appeal. Otherwise, it cannot be said that he vigorously and tenaciously protected the interests of the class he was purporting to represent, or that all members of the class had been afforded due process of law by having a full day in court. It is axiomatic that an appeal is a significant element in the judicial process. Gaytan's failure to prosecute an appeal deprived the members of his class, whose rights were not vindicated by the three-judge court's decision, of full participation in this process.\n\n474 F.2d at 76 (emphasis supplied). Likewise, the class members excluded from the subclass were denied any back pay relief to compensate for past discrimination by the company. As our discussion in section IV infra reveals, an appeal from this decision could hardly be characterized as patently meritless or frivolous.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e On the basis of Gonzales alone the district court should have granted the motion to substitute counsel for the purpose of appealing this portion of the decree.\n\nFinally, we note that an appeal on the issue of injunctive relief can hardly be deemed frivolous. The trial judge was well aware of the complexity of the legal and factual issues involved and the prior history of this litigation.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIn conclusion, we hold that under the circumstances of this case the trial judge abused his discretion by not granting appellants' motion to substitute class counsel for purposes of appealing the court's judgment. The decision to appeal rested as an initial matter with the named plaintiffs. These representatives chose to appeal, and an analysis of the factors considered above demonstrates that their choice should have been honored. The named plaintiffs have provided excellent representation in the past, and there is no indication in the record that their decision to appeal was based on any considerations other than the interests of the class. The decision received widespread support among the class. With regard to those who were denied back pay, there can be no doubt that an appeal is necessary to effectuate their legal rights. While we do not question the sincerity of Mr. Adams' belief that an appeal of the injunctive decree is not in the class' interest, nothing in the record convinces us that the named plaintiffs' conclusion on this question was unreasonable. See section III infra. Finally, the issues raised on appeal are neither frivolous nor insubstantial. We therefore shall treat this appeal of the injunctive relief and denial of back pay portions of the district court's decree as an appeal on behalf of the class.\n\nC. Back Pay Award to the Subclass: Appealability of the Settlement\n\nIn subsection I(D) supra we determined that the award of back pay to the subclass must be treated as a settlement. It is well settled that dissenters to a class action settlement may retain new counsel to appeal the district court's approval of a consent decree. See Cotton v. Hinton, 559 F.2d 1326, 1329 (5th Cir. 1977); Flinn v. FMC Corp., 528 F.2d 1169, 1174 (4th Cir. 1975), cert. denied, 424 U.S. 967, 96 S. Ct. 1462, 47 L. Ed. 2d 734 (1976). The company poses the rather ingenious argument that notwithstanding this general rule, none of the appellants in this case has \"standing\" to appeal the back pay settlement. First, the company argues that those members of the back pay subclass who failed to cash their back pay checks may not appeal the district court's approval of the settlement because under the terms of the court's November 20 final order, they have opted out of the subclass and have yet to receive an appealable final judgment as to back pay. The company then argues that those appellants who accepted their back pay award by cashing the company's check did so under the express condition that acceptance of back pay constituted a release of any claims of discrimination,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and those appellants therefore have waived their right to maintain this appeal. Finally, the company maintains that those appellants who were excluded from the back pay subclass have no standing to contest on appeal the adequacy of the back pay award received by others. Therefore, according to the company, individual appellants either lack standing to appeal, have waived their right to appeal, or are not the subjects of an appealable final back pay judgment.\n\nWe agree with the defendant that appellants who were excluded from the subclass and denied back pay lack standing to contest the adequacy of the awards received by other class members. However, we conclude that the decree does constitute an appealable final judgment for those awardees who opted out of the settlement by refusing to cash their back pay checks. We also find that awardees who cashed their checks pursuant to the district court's opt-in, opt-out scheme did not waive their right to appeal the back pay settlement.\n\nIt is clear that the district court's November 20 final order constitutes a final decision within the meaning of 28 U.S.C. ยง 1291.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The order was intended to end the litigation on the merits and leave nothing for the court to do but execute judgment. Catlin v. United States, 324 U.S. 229, 65 S. Ct. 631, 633, 89 L. Ed. 911 (1945). See Eisen v. Carlisle \u0026 Jacquelin, 417 U.S. 156, 94 S. Ct. 2140, 40 L. Ed. 2d 732 (1974).\n\nACIPCO incorrectly asserts that the district court's order does not constitute a final judgment because the order provided subclass members who opted out of the subclass an opportunity to pursue individual damage claims in this lawsuit. We read the order to require subclass members who opted out of the subclass to pursue their damage claims in separate, independent lawsuits. In Pettway III we stated that the district court could allow claimants who were dissatisfied with their pro rata share of a class-wide back pay award to opt-out of the back pay subclass and demonstrate that they were entitled to a larger award. 494 F.2d at 263 and n. 154. The district court properly attempted to utilize this opt-out device. In the notice to all subclass members who had not yet cashed their back pay checks, mailed by the company at the court's direction on November 21, 1975, the court advised that back pay awards would become \"null and void\" as to all awardees who failed to cash their check prior to December 15, 1975. See November 20 Final Order and Modified Judgment, A. 418. The court's notice continued:\n\n\"You will have the right thereafter to bring an independent action against the Company . . . and the Company will have the right to assert . . . [defenses] as if there had never been the entry of the back pay in your favor in the Pettway case.\" (A 418) (emphasis supplied).\n\nIn the November 20 final order the court explained that a claimant who opted out of the settlement would have the right to pursue an independent action \"free of the defense of res judicata or collateral estoppel insofar as his individual back pay claim is concerned.\" (A 417) (emphasis supplied). This language, together with the fact that the court did not afford awardees who declined to cash their back pay checks any opportunity to prove their individual damages in the proceedings of this suit, convinces us that the district court contemplated that its November final order would be the final adjudication in this suit of the rights of dissatisfied subclass members. Consequently, the court's order represents a final decision within the meaning of 28 U.S.C. ยง 1291.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nWe also find that those claimants who cashed their back pay checks may appeal from the lower court's approval of the settlement notwithstanding the fact that the waiver form they signed in cashing their checks could be construed as a waiver of their right to appeal.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Rule 23 recognizes that many small claimants frequently have no litigable claim unless aggregated in a class suit. Because of the cost and difficulty of proving individual damages, see Pettway III, supra, 494 F.2d at 258-63, even the opportunity to prove individual damages in the same litigation often will not be an adequate substitute for participation in an acceptable settlement. Without the right to appeal approval of a settlement prior to the expiration of the option period, dissatisfied claimants could be faced with the equally unpalatable alternatives of opting into a settlement which should not have been approved or undertaking the burdens of individual actions. See Ace Heating \u0026 Plumbing Co., 453 F.2d 30, at 32-33 (3rd Cir. 1971). Requiring claimants to opt into a back pay subclass before they have an opportunity to seek appellate review of the settlement would be inconsistent with design of Rule 23(e), which bounds the court's discretion in approving proposed settlements. Subclass members have an interest in ensuring that a settlement is reviewed by the district court in conformity with settled legal standards, and we will not allow subversion of the protections afforded by Rule 23(e) by requiring claimants to opt-out of a settlement in order to obtain appellate review.\n\nTo protect the rights of claimants to participate in a valid settlement, we conclude that the option of subclass members to opt into a back pay settlement may not be cut off before a final determination of the propriety of that settlement is made. See subsection V(B)(2) infra; cf. Ace Heating \u0026 Plumbing Co. v. Crane Co., supra. Because the district court improperly terminated the option to opt into the settlement before this appeal could be completed, thereby imposing upon the subclass members the impermissible choice of opting into what may be an unacceptable settlement or opting out of the subclass and undertaking the burdens of proving individual claims, we conclude that any waiver of appellate rights by those claimants who opted into the subclass is invalid.\n\nThus each of the appellants who were members of the back pay subclass may appeal from the district court's approval of the back pay settlement. Having already held that the appeal of the injunctive relief and denial of back pay portions of the district court's judgment has been brought on behalf of the class, we conclude that each of the substantive issues raised by appellants is properly before us. With both a sense of relief for having finally resolved the thorny procedural issues in the case and apprehension at what lurks ahead, we now turn to appellants' substantive claims.\n\nIII. Injunctive Relief\n\nHaving concluded in section I, supra, that the injunctive relief portions of the district court's decree constituted the court's own judgment, we now reach appellants' contention that Judge Lynne failed to follow our mandate in Pettway III in devising affirmative relief for class members. Our discussion is unavoidably complex, and we find it necessary to reverse the district court on a number of points. Underlying many of our determinations with respect to the injunctive portions of the decree are the complex and technical problems inherent in judicial attempts to remedy past employment discrimination by restructuring the multi-faceted employment practices of a large industrial concern. To a large extent, our own difficulties with the decree stem from the method by which Judge Lynne attempted to resolve these problems. We do not criticize Judge Lynne for attempting to utilize informal techniques of conciliation. We know from long experience the limitations and frustrations inherent in grappling with these problems using traditional litigative methods. We are not so bold or naive as to suggest that these complexities would dissolve if remedial responsibilities in the employment discrimination area were entrusted to an alternative institutional decision-making body, and recognize in any case that Congress has placed on the courts a responsibility to give effect to its policies of equal and non-discriminatory treatment for minorities in the employment area, as in other phases of our national life. In carrying out our responsibilities, we must and do remain alert to the possibility of utilizing innovative techniques of conciliation and problem solving. Many of our recent opinions in the Title VII area recognize the desirability of encouraging settlement among the contesting parties, particularly with respect to required modifications of plant employment and promotion practices. See, e.g., Cotton v. Hinton, 559 F.2d 1326, 1331 (5th Cir. 1977); United States v. Allegheny-Ludlum Industries, Inc., 517 F.2d 826, 846 (5th Cir. 1975), cert. denied, 425 U.S. 944, 96 S. Ct. 1684, 48 L. Ed. 2d 187 (1976). We further recognize that the courts can sometimes best facilitate these conciliation efforts by utilizing informal techniques. We do not suggest here that conciliation efforts be forced into a Procrustean bed of on-the-record hearings.\n\nSometimes, however, settlement efforts do not achieve fruition. In these instances the trial court must alter its role and adjudicate the dispute among the parties. Such an adjudication, particularly in the context of class action litigation, presents a series of conundrums for both trial and appellate courts. Much of the information and evidence necessary to frame an adjudicated decree may be known to the district court through its participation in settlement negotiations, but will not be reflected on the record. Thus, the evidentiary support for the district court's ultimate decision will not be apparent to a reviewing court unless steps are taken to develop a satisfactory record. Evidentiary hearings and the submission of exhibits into the record may sometimes appear redundant and inefficient from the perspectives of the parties and the district court, but they are indispensable for purposes of conscientious appellate review. This court cannot properly review a district court's findings and conclusions without examining the supporting evidence. Tasby v. Estes, 572 F.2d 1010 (5th Cir. 1978).\n\nThe fundamental problem facing us in our task today is the absence of an adequately developed factual record. Following our remand in Pettway III, the district court encouraged settlement negotiations in informal proceedings held off the record. No trial or evidentiary hearing was held. As a result, almost no evidence was added to the record subsequent to our decision in Pettway III. We do not criticize the district court's attempt to resolve this dispute through informal procedures. When it became clear, however, that settlement negotiations would not bear fruit, it was incumbent on the court to base its conclusions on evidence in the record. Instead, numerous conclusions of the district court rest on factual predicates without evidentiary support in the record. ACIPCO represents that the district court considered evidence in chambers which supported these findings and conclusions, but we have no way of judging whether this is correct or whether the \"evidence\" which may have been examined by the district court actually supports its conclusions. The learned and experienced judge who tried this case may conscientiously, logically, and intelligently have come to the conclusion that his judgment was correct. There may have been rivers of evidence coursing through the chambers of the district judge. But without that evidence available to us on the record, we are unable to gauge the depth of those rivers or assess its navigability as a route to the district judge's conclusions. Other conclusions of the district court rest on evidence already assessed in our prior opinion and found insufficient to support some of the legal conclusions now drawn therefrom. In light of our clear mandate in Pettway III, this evidence standing alone simply cannot be the basis for legal conclusions already rejected by our prior opinion.\n\nThe company's failure to present evidence on the record in support of its position may be due in part to the failure of all the parties to distinguish clearly those portions of the decree which were resolved by settlement from those which were adjudicated by the court. It is likely that some portions of the injunctive decree actually were reached through the agreement of both ACIPCO and attorney Adams. Nevertheless, the decree represents the court's own judgment. See subsection I(B) supra. If it were clear precisely which portions of the injunctive decree were reached through agreement of counsel, we could treat those sections of the decree as a settlement and require the Rule 23 procedural safeguards discussed in subsection V(A), infra. As has been the case with regard to most of the factual issues raised by this appeal, however, the record is silent on this question. In any event, the district court did not draw such a distinction among portions of the injunctive decree or provide class members the requisite procedural safeguards with regard to those sections, if any, which it considered the parties to have accepted. Under the circumstances, we must require full evidentiary support for each element in the injunctive decree. Otherwise, the participants to the negotiations could compromise the legal rights of the class members free from both the procedural strictures of Rule 23 and the appellate court's review of the substantive legal requirements for framing injunctive relief.\n\nIn summary, we must reverse the district court where it misapprehended the purport of our prior mandate or where its conclusions are not supported by evidence in the record. This appeal presents multiple manifestations of ACIPCO's failure to supplement the record and of the district court's failure to base its conclusions on evidence in the record. That the errors below may flow from a single source does not, however, relieve us of the responsibility to consider and address each legal issue properly raised by appellants.\n\nA. Two Decades of ACIPCO History\n\nOur extensive opinion in Pettway III discusses at length the organization of the company, 494 F.2d at 217-18, its employment practices through 1974, id. at 218-222, and the present discriminatory effect of these practices necessitating affirmative relief. Id. at 222-43. While we need not repeat that discussion here, it is necessary at the outset to summarize briefly the factual and legal conclusions relevant to our disposition of the issues raised on this appeal. We shall then examine the standards outlined in Pettway III for framing affirmative relief, the district court's injunctive decree on remand, and appellants' allegations that the decree does not comply with our prior mandate.\n\n1. Prologue: Company Organization\n\nThe company's operations are organized into various departments. The five primary production departments include the monocast department, the fittings foundry, the steel foundry, the melting department, and the steel pipe foundry. The machine shop performs some additional labor on items produced by the production departments and provides replacement maintenance on all machinery. The company also has seven service departments consisting of the general yards, central stores, shipping, electrical, maintenance, inspection, and construction departments. The responsibilities of these departments include the receipt of raw materials, the shipment of finished products, and the performance of various maintenance functions. The company's highly-skilled craft positions are concentrated in the electrical, maintenance, and inspection departments and in the machine shop. These four craft departments and the steel pipe foundry have historically contained very low percentages of black employees.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nPrior to our 1974 decision in Pettway III, the method of advancement within all of ACIPCO's departments involved a wage progression schedule consisting of 15 pay groups. As of the date of the 1971 trial below, over 95% of the company's black employees worked in pay groups 1-8. Only 30% of ACIPCO's white employees held these lower paying positions. Advancement up the pay group ladder was based on departmental seniority. Until 1971 the company did not have a systematic written procedure for filling vacancies. Promotions within a department went to the senior department employee in the pay group immediately below the vacancy, with advancement within pay groups 9-15 subject to illegal testing requirements. The company discouraged transfers between different departments. Id. at 223 n. 27. In 1971 the company adopted a new procedure for filling vacancies in positions above pay group 3. First job vacancies were posted for three days within the department. If qualified bids were received, a selection was made on the basis of departmental seniority and ability. If no qualified bids were received from within the department, vacancies were posted plant wide and filled on the basis of plant-wide seniority. An employee transferring from another department did not carry over any of his accumulated seniority for purposes of seniority within the new department. Id. at 223.\n\n2. Our Evaluation of ACIPCO's Employment Practices in Pettway III\n\nUntil 1961 ACIPCO maintained a formal policy of segregating employees by race. While this policy was discontinued after the promulgation of Presidential Executive Order No. 10925 in 1961, the resulting segregated employment profile was maintained at least through 1964, when the company instituted testing and educational requirements for hiring, interdepartmental transfer, and intradepartmental promotion. These testing and educational requirements, which were held to be illegal in Pettway III, remained in effect until as late as 1971. Pettway III, supra, 494 F.2d at 219-20, 222, 258. As a result, in 1971 only 25% of the 232 jobs in the plant were integrated. 494 F.2d at 230.\n\nBased on these findings we concluded that \"black employees have been derogated to the lower paying, non-skill departments and to the lower paying positions in all departments because of these past discriminatory employment practices.\" Id. at 236. We then determined that the departmental seniority system acted to maintain and effectuate the stratification of black employees in the less desirable departments and in the lower paying, non-skilled jobs within all departments. The seniority system locked black employees into their present departments because a black desiring to transfer to a department with better promotional opportunities would have to forfeit seniority and often endure a wage cut in order to transfer. An employee who did transfer would be handicapped by being unable to compete equally for promotion based on departmental seniority with a white employee situated in the department at the time of the transfer. This would be true even if the white employee had less plant seniority than the black transferee. Id. at 223-24, 235-36. Furthermore, in many cases the requirement that initial consideration be given to persons within the department perpetuated the historical stratification of black employees by preventing the majority of class members from even applying for jobs in the higher paying, predominantly white departments. After reviewing the relevant case law, we concluded that affirmative relief was required. Id. at 236.\n\n3. Pettway III Guidelines for Relief: Promotion and Transfer Procedures\n\nIn Pettway III we followed the well-established principle that on remand a remedy must be fashioned within the framework of the \"rightful place\" theory. 494 F.2d at 243. Under this theory, blacks must be \"assured the first opportunity to move into the next vacancies in positions which they would have occupied but for the wrongful discrimination and which they are qualified to fill.\" Id., quoting United States v. Georgia Power Co., 474 F.2d 906, 927 (5th Cir. 1973). We therefore ordered the district court to issue an injunction requiring: \"(1) the posting of all vacancies plant-wide; (2) the selection of 'qualified' personnel for the vacancies on the basis of plant-wide seniority; (3) transferring members of the class shall retain their plant-wide seniority for all purposes including promotion, lay-off, reduction-in-force, and recall; (4) advance entry into jobs for which an employee in the class is 'qualified' or for which no specific training is necessary; (5) red circling of members of the class . . . .\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Id. at 248 (footnotes omitted).\n\nWe tempered this holding by allowing the company to demonstrate a \"business necessity\" for maintaining departmental lines of progression in which experience in one position is required for advancement to a higher position in the line. We stressed, however, the \"heavy nature of the defendant's burden\" to justify a seniority system which perpetuated past discrimination. Id. at 245. Quoting from United States v. Jacksonville Terminal Co., 451 F.2d 418, 451 (5th Cir. 1971), we stated that \"the 'business necessity' doctrine must mean more than that transfer and seniority policy serve legitimate management functions. . . . Necessity connotes an irresistible demand. To be preserved, the seniority and transfer system must not only directly foster safety and efficiency of a plant, but also be essential to those goals.\" Id. Thus business necessity justifies existing seniority and promotion systems only where the district court finds that each position in the line of progression within a department provides necessary training for the next higher job and that there are no acceptable alternatives for accomplishing the company's safety and efficiency goals. Id. at 245-46.\n\nWe then remanded the case to the district court to frame an injunctive order which would effectuate our mandate.\n\n4. Relief on Remand\n\nOn remand the district court entered an order which effected the following changes in the company's seniority and transfer policies. Plant seniority was substituted for departmental seniority for purposes of future promotions, demotions, layoffs, and recalls, subject to a one year residency requirement for transferees to a new line of progression.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The court's order also prescribes a two step procedure for filling vacancies within the newly established lines of progression. Permanent vacancies are to be filled by incumbent employees working in, or laid off from, the position immediately below the vacancy in the line of progression, with bidding based on plant seniority as modified by the residence requirement. Each resulting vacancy is to be filled from within the line in the same manner, until an entry level job remains which cannot be filled from within the line of progression. At this point the second step of the bidding procedure is reached, and the entry level position is posted plantwide, with bids considered according to plant seniority. Employees bidding for a position in a new line of progression must have at least six months seniority, and the company retains the right to refuse to promote or to transfer any employee it determines is unqualified to fill a position. Furthermore, the company may return any transferring employee to his prior position at the end of a 30 day trial period, without loss of seniority, if he cannot meet the requirements for the new job.\n\nThe district court, in its attempt to reconcile the rightful place requirement with the business necessity exception to plant-wide bidding for every position in the plant, also made three general revisions in the company's lines of progression.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nFirst, the court's order created \" pre-entry level\" positions, consisting of unskilled jobs in the lower pay groups which do not provide experience necessary for the successful performance of the next higher-rated position. These jobs were removed from the departmental lines of progression, with the result that potential transferees can now skip over these positions and bid immediately into the higher \"entry level\" positions. Second, the court \"boxed\" together certain jobs requiring similar skills and providing roughly equivalent experience for preparing employees for the next higher position on the line. The employee with the greatest plant seniority on any job within the box would have the first opportunity to bid on the next higher-rated position. This boxing mechanism affords employees an opportunity to bypass other jobs in the box, thus hastening the rise of plant-senior class members to their rightful place within the lines of progression.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Finally, the court designated eight positions as \"advanced entry jobs.\" These are higher-rated positions within certain departments, for which the requisite training can be obtained through successful performance on similar jobs in other departments without any necessity for prior departmental experience.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Vacancies in advanced entry jobs are to be filled through plant-wide bidding based on plant seniority.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\n5. The Present Appeal\n\nAppellants maintain on appeal that the promotion and transfer procedure outlined above is deficient in numerous respects and does not comport with our mandate in Pettway III. Before evaluating appellants' contentions, however, we must first examine the case law subsequent to Pettway III, and particularly the Supreme Court's decision in International Brotherhood of Teamsters v. United States, 431 U.S. 324, 97 S. Ct. 1843, 52 L. Ed. 2d 396 (1977), to determine whether the standards enunciated in our prior decision are still applicable for purposes of this appeal.\n\nB. The Effect of Teamsters on Our Prior Mandate\n\nIn Pettway III we concluded that the \"neutral practices of the departmental seniority system and the posting and bidding procedure carry forward into the present the stratification of black employees into lower paying, non-skill departments and jobs resulting from past discrimination.\" 494 F.2d at 236. After reviewing the relevant authorities, we ordered specific affirmative relief. See subsection III(A)(3) supra.\n\nThe recent Supreme Court decision in United States v. International Brotherhood of Teamsters, 431 U.S. 324, 97 S. Ct. 1843, 52 L. Ed. 2d 396 (1977), casts doubt upon the validity of our prior mandate insofar as it required plant-wide seniority to be calculated from the date of employment with ACIPCO. See also United Airlines, Inc. v. Evans, 431 U.S. 553, 97 S. Ct. 1885, 52 L. Ed. 2d 571 (1977); Trans World Airlines, Inc. v. Hardison, 432 U.S. 63, 97 S. Ct. 2264, 53 L. Ed. 2d 113 (1977). In Teamsters the Supreme Court admitted that under the rationale of Griggs v. Duke Power Co., 401 U.S. 424, 91 S. Ct. 849, 28 L. Ed. 2d 158 (1971), a seniority system, not justified by business necessity, whose operation served to freeze the status quo of prior discriminatory employment practices, \"would seem\" to be unlawful. 97 S. Ct. at 1862. Nevertheless, the Court concluded that such a system would be legally valid under section 703(h) of Title VII,\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e 42 U.S.C. ยง 2000e-2(h), if it were a bona fide seniority system within the meaning of that section. That is to say, a bona fide system is not itself illegal merely because it perpetuates the effects of pre-Act or post-Act discrimination. 97 S. Ct. at 1843 n.30. See James v. Stockham Valves \u0026 Fittings Co., 559 F.2d 310, 351-53 (5th Cir. 1977), for a discussion of the criteria for determining whether a seniority system is bona fide under Teamsters.\n\nThe Court's determination that such seniority systems are not intrinsically illegal was not meant to insulate all such systems from modifications necessary to accord relief for past discrimination. With regard to relief, the Court differentiated between pre- and post-Act discriminatory practices, holding that\n\npost-Act discriminatees . . . may obtain full \"make whole\" relief, including retroactive seniority . . . without attacking the legality of the seniority system as applied to them.\n\n97 S. Ct. at 1860. As we elaborated in James v. Stockham Valves \u0026 Fittings Co., supra, after considering the effect of Teamsters on the district court's decree:\n\nSeniority relief is mandatory in this case even if the district court finds the system bona fide. See Teamsters, 431 U.S. at 348, 97 S. Ct. 1843, 52 L. Ed. 2d 396. The federal courts are empowered to fashion such retroactive seniority as the particular circumstances of a case may require to make whole, insofar as possible, the victims of racial discrimination in job assignments, transfers, and promotions.\n\n559 F.2d at 355. Thus, the Court still permits seniority modifications necessary to remedy other illegal acts, so long as those other acts are independently actionable. Teamsters does, however, limit the scope of permissible relief. With regard to bona fide seniority systems, discrimination after the effective date of Title VII can no longer engender a remedy involving retroactive seniority which antedates the Act. If a seniority system \"did not have its genesis in racial discrimination . . . [and] was negotiated and has been maintained free from any illegal purpose\", those \"employees who suffered only pre-Act discrimination are not entitled to relief, and no person may be given retroactive seniority to a date earlier than the effective date of the Act.\" 97 S. Ct. at 1865.\n\nIn the case at bar, the plaintiffs filed their complaint with the EEOC on November 22, 1965, attacking both pre-Act and post-Act discrimination. It is clear that the testing and educational requirements which illegally discriminated against black employees remained in effect after the original complaint was filed. 494 F.2d at 219-20, 222-23, 236. The utilization of plant-wide seniority from the effective date of Title VII is necessary to remedy these actionable post-Act discriminatory practices, and therefore is consistent with the Teamsters decision. In Pettway III, however, we provided plant-wide seniority to all employees from the date of their original employment by ACIPCO. For some employees, this seniority will antedate the effective date of Title VII. If the departmental seniority system in effect at ACIPCO prior to our decision in Pettway III was bona fide, this portion of the relief ordered in Pettway III would be inconsistent with the Supreme Court's holding in Teamsters. If, on the other hand, the departmental seniority system was not bona fide, it would not be protected under Section 703(h), and our prior substitution of a plant-wide seniority system for the illegally maintained departmental seniority system would be consistent with the Teamsters holding.\n\nAppellants urge this court to refrain from reexamining our prior holding in light of Teamsters. They correctly argue that under well-settled principles of law, a decision by this court at an earlier stage of the same litigation represents the law of the case. See Carpa, Inc. v. Ward Foods, Inc., 567 F.2d 1316 (5th Cir. 1978); Lehrman v. Gulf Oil Corp., 500 F.2d 659 (5th Cir. 1974), cert. denied, 420 U.S. 929, 95 S. Ct. 1128, 43 L. Ed. 2d 400 (1975); Terrell v. Household Goods Carriers' Bureau, 494 F.2d 16 (5th Cir.), cert. denied, 419 U.S. 987, 95 S. Ct. 246, 42 L. Ed. 2d 260 (1974). As such, the earlier decision generally precludes reconsideration of any legal question that has already been decided. We recently observed that\n\nthe \"law of the case\" rule is based on the salutary and sound public policy that litigation should come to an end. It is predicated on the premise that . . . it would be impossible for an appellate court to perform its duties satisfactorily and efficiently and expeditiously if a question, once considered and decided by it were to be litigated anew in the same case upon any and every subsequent appeal Thereof\n\nCarpa, Inc. v. Ward Foods, Inc., supra, at 1319-20, quoting White v. Murtha, 377 F.2d 428, 431 (5th Cir. 1967).\n\nThe doctrine, while not a limitation on the court's power to reconsider its prior holding, is nevertheless an expression of good sense and wise judicial practice, Terrell v. Household Goods Carriers' Bureau, supra, 494 F.2d at 19, waived \"only for the most cogent of reasons and to avoid manifest injustice.\" Id. at 19-20. Perhaps the most cogent reason possible for not following a previous decision in the same litigation is an intervening decision by the Supreme Court. Id. at 19. Indeed, this court has previously reconsidered its prior holdings on a subsequent appeal of the same case when intervening Supreme Court decisions cast doubt on the validity of the original decision. See Jennings v. Patterson, 488 F.2d 436, 441 (5th Cir. 1974); McComb v. Crane, 174 F.2d 646 (5th Cir. 1949). In McComb the judgment appealed from was rendered pursuant to a prior Fifth Circuit opinion holding that the Fair Labor Standards Act of 1938, 29 U.S.C. ยง 201 et seq., did not permit the Administrator to collect wage deficiencies by injunction and civil contempt proceedings. Subsequently, the Supreme Court held that the Administrator could bring civil contempt proceedings. We stated that under the circumstances, \"we are compelled to disavow our previous decision as the law of this case and to reverse the judgment appealed from.\" 174 F.2d at 647.\n\nWe find ourselves bound by our decisions in Jennings v. Patterson and McComb v. Crane and therefore must reconsider the seniority determination in our prior mandate in light of the Supreme Court's pronouncements in Teamsters. We do so mindful that Teamsters is an extraordinary case from the standpoint of stare decisis. See EEOC v. United Air Lines, supra, 560 F.2d at 235-36. In the words of Justice Marshall's dissent:\n\nAs the Court also concedes, with a touch of understatement, \"the view that ยง 703(h) does not immunize seniority systems that perpetuate the effects of prior discrimination has much support.\" Ante, at 1860, n. 28. Without a single dissent, six courts of appeals have so held in over 30 cases, and two other courts of appeals have indicated their agreement, also without dissent. In an unbroken line of cases, the EEOC has reached the same conclusion. And the overwhelming weight of scholarly opinion is in accord.\n\n97 S. Ct. at 1876 (footnotes omitted). See also Myers v. Gilman Paper Corp., 556 F.2d 758 (5th Cir. 1977) (on petition for rehearing). We also recognize that this result is inconsistent with the policies of finality in an ongoing lawsuit. As the Second Circuit eloquently stated in affirming the district court's application of Teamsters in a somewhat similar procedural setting:\n\nWe are troubled with the result in this case . . . . It would seem to make a nullity of judicial determinations valid when they were made, and intended to have permanent effect. Litigation of issues like those raised in the instant case can take years to accomplish - years during which governing precedents can change, sometimes substantially. When such changes occur early in the course of litigation little judicial effort is wasted. But when, as here, changes come after factual determinations have been made, the relevant law has been stated, the majority of relief has been granted, and an appeal has been taken and dismissed by this court, the judicial system is necessarily faced with momentous waste of time and industry if virtual relitigation of the issue is required. In those substantive legal areas in which litigation is necessarily protracted, and legal development swift, the dangers of neverending litigation portrayed so vividly in Dickens' Bleak House become an ever-present possibility.\n\nAcha v. Beame, 570 F.2d 57, 64 n.8 (2nd Cir. 1978).\n\nNevertheless, the Supreme Court's decision still discloses the controlling law, which we are bound to apply. In James v. Stockham Valves \u0026 Fittings Co., supra, we considered for the first time the effect of Teamsters on our prior case law and concluded that post -Act discriminatees may receive seniority relief under Teamsters without attacking the legality of the seniority system as applied to them. Judge Wisdom, writing for the court, underscored the importance of the distinction between pre-and post-Act discriminatees:\n\nIn this case the plaintiffs have proved that Stockham engaged in post-Act discriminatory employment practices in job allocation, testing, craft training and selection, and promotion. Any black injured by these practices is entitled to relief, including retroactive seniority. The issue whether the seniority system at Stockham is bona fide under section 703(h) of Title VII is relevant to this case only if the district court concludes that the class . . . consists of some blacks who suffered only pre-Act discrimination.\n\n559 F.2d at 351. As in James, the plaintiffs here have proved that the company maintained illegal testing and educational requirements and subjective selection criteria which relegated black employees to less desirable departments and to lower paying positions in all departments during the post-Act period between 1965 and 1971. They are entitled to relief from the effects of these practices, including retroactive seniority. Moreover, unlike the situation in James, there is no question here that every member of the class has been subjected to the illegal post-Act practices. As the class consists only of persons employed as of or subsequent to the effective date of Title VII, no class member suffered only from pre-Act discrimination. Every member of the class is a post-Act discriminatee. Thus every class member before us is entitled to seniority relief.\n\nIn Teamsters, however, the Court restricted the scope of permissible seniority relief for post-Act discriminatees operating under bona fide seniority system. The court stated that on remand \"no person may be given retroactive seniority to a date earlier than the effective date of the Act.\" 97 S. Ct. at 1865. A panel of the Seventh Circuit recently concluded that the seniority system at issue was bona fide under Teamsters and accordingly modified a district court's plant-wide seniority order by redefining \"company seniority\" to mean \"either total tenure with the company after July 2, 1965 (the effective date of the Civil Rights Act of 1964), or total departmental seniority whichever is greater.\" E.E.O.C. v. United Air Lines, 560 F.2d 224, 234 (7th Cir. 1977). Thus, if the departmental seniority system at ACIPCO is bona fide, plant seniority may not antedate the effective date of Title VII.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe issue of whether the departmental seniority system at ACIPCO is bona fide was not legally relevant when this case originally was tried. Consequently, there have been no factual determinations on this question. On remand the district court should allow the parties to present evidence on the bona fides of the departmental seniority system. In evaluating this evidence, the Court should be guided by our recent decision in James v. Stockham Valves \u0026 Fittings Co., supra, 559 F.2d at 350-53, which discusses the factors relevant to the court's determination. We add only that the court should consider, in addition to those factors outlined in James, whether the departmental seniority rights of ACIPCO's employees arising from employment prior to 1965 vested subsequent to the filing of this lawsuit. A finding that employees' rights under the departmental seniority system did not vest until 1971, as maintained by appellants, would indicate that the seniority system was designed to perpetuate the effects of the company's illegal post-Act practices and thus that the system had its genesis in racial discrimination.\n\nThe district court should make detailed findings concerning this factor and each of the criteria outlined in James. If, based on these findings, the court concludes that the departmental seniority system was not bona fide, the plant-wide seniority provisions mandated in Pettway III should be retained. If the court finds that the departmental seniority system was bona fide, it should modify its decree by redefining \"plant seniority\" to mean either total tenure with the company after July 2, 1975 or total departmental seniority, whichever is greater. In either case, the remaining requirements for affirmative relief mandated in Pettway III retain their validity. We therefore shall proceed with our examination of the injunctive provisions of the decree fashioned below. Throughout our discussion we will refer to the term \"plant seniority,\" although its precise definition must await the outcome of the district court's examination of whether the departmental seniority system in effect in 1971 was bona fide.\n\nC. Adequacy of the Promotion and Transfer Procedures Adopted Below\n\nAppellants allege that the promotion and transfer procedures adopted by the district court, see subsection III(A)(4) supra, are insufficient to guarantee class members their rightful place within the company and do not comport with our mandate in Pettway III. To evaluate this contention, we must first determine whether the district court's order ensures that class members reach their rightful place within the company at the first available opportunity. See Pettway III, supra, 494 F.2d at 243. If the procedures adopted by the district court do not fully effectuate this goal, we must then consider whether the impediments to the achievement by class members of their rightful place are justified by business necessity.\n\n1. Rightful Place\n\nTo recapitulate briefly our discussion in subsection III(A) supra, class members generally are concentrated in the less desirable departments and tend to have relatively low departmental seniority and position within the lines of progression when compared to their plant seniority. In Pettway III we found that this phenomenon resulted from ACIPCO's past discriminatory practices and ordered the district court to frame an injunctive decree which utilized plant seniority as a mechanism for ensuring class members the opportunity to reach their rightful place within the company. Although the procedures adopted by the district court improve the opportunities of class members for both intradepartmental promotion and interdepartmental transfer, our careful examination of the record convinces us that the remedy fashioned below falls short of the rightful place goal. With regard to interdepartmental transfer, the new procedures do allow for entry into the new department at a higher level than was formally possible by removing from the former lines of progression some 61 pre-entry level jobs. Consequently, transferees now have the opportunity to enter a new department in a position which is higher up the line of progression than the previous entry level jobs.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e However, the advantage held by workers already in the department over blacks desiring to transfer remains substantially the same. All job vacancies are offered first to employees within the department in the position below the vacancy. Even vacancies in entry level positions are not posted plantwide until workers within the line of progression, or laid-off from it, decline the position. Thus, while lines of progression within the departments have been substituted for departmental pay scale units, the initial preference given to employees within the department remains.\n\nOther deterrents to interdepartmental transfer which we criticized in Pettway III are also not entirely eliminated by the court's order. Previously, a black employee was deterred from transferring to a department with greater promotional opportunities because he would lose his accumulated seniority and suffer a cut in pay.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Since departmental seniority was the criterion for promotion, a transferee would be unable to compete effectively for future vacancies once he transferred. Under the district court's decree the transferee retains his plant seniority, but seniority is relevant only if a job immediately above the entry position in the line of progression becomes available. The boxing of many jobs in both entry level and advances positions is a positive step, permitting job skipping which substantially reduces the number of steps in each line of progression and accelerates advancement up the line. Nonetheless, the key requisite for promotion is position within the line rather than plant-wide seniority, and an employee desiring to transfer must forfeit his position in the former line of progression and move to what will generally be a lower position in a new line. This loss of position within the line of progression will have a similar effect in deterring transfers as did loss of seniority under the former system.\n\nThe district court's plan also fails to rectify fully the effects of past discrimination with regard to intradepartmental promotion. Although departmental seniority is no longer determinative of intradepartmental promotion, the bidding advantage of class members with superior plant seniority is decisive only with respect to white employees at the same level on the line of progression; class members, even if plant senior, may not bid against employees occupying a higher position on the line. The competitive position of class members with relatively high plant seniority is improved by the elimination of departmental seniority as a criterion for promotion, and to the extent that positions in the line of progression open up fairly frequently, the use of plant seniority should greatly accelerate the advancement of these class members. However, under the new system position in the line is even more important than plant seniority in determining who may bid on a vacancy, and as we concluded in Pettway III, position is precisely what class members lack. 494 F.2d at 218 n.9. The superior position of white employees vis-a-vis blacks is a direct result of the earlier opportunities for whites in the more desirable departments and of the illegal testing and education requirements for promotion. The new promotion system in some respects perpetuates the effect of these discriminatory practices. We have already noted that employees with superior departmental seniority have been able to outbid these class members when even higher positions in the line become vacant. In some circumstances the new promotion system actually will advantage whites over class members with superior plant and departmental seniority. Until May 1975, vacancies were filled by the bidder with the greatest departmental seniority, who also was qualified for the position. While the illegal testing and education requirements were in effect, departmentally junior whites were permitted to advance beyond \"unqualified\" but senior, blacks. Once the illegal testing and education requirements were lifted, however, a black worker theoretically could compete with departmentally junior white workers who had advanced to superior pay group jobs. Now, however, black workers are in an inferior bidding position to these departmentally junior whites who gained superior positions in the line as a result of the testing and education impediments to the advancement of class members.\n\nIn sum, past discriminatory practices have allowed many plant junior white employees to gain superior position within the lines of progression vis-a-vis class members. Position has now become the threshold qualification for bidding on vacancies. Thus despite the use of plant seniority to distinguish between bidders on the same level in the line, the requirement that jobs be held in a sequential order in any line of progression tends to \"lock in\" formerly victimized blacks, thereby perpetuating the effects of past discrimination and prolonging the journey of class members to their rightful place within the company. As we discussed above, the same is also true of the interdepartmental transfer procedure. To justify the new promotion and transfer system, the company thus bears the \"heavy burden\" of demonstrating that each position in a line of progression provides necessary training for the next higher position. We now turn to the crucial question of whether the new lines of progression are supported by the requisite showing of business necessity.\n\n2. Business Necessity\n\na. Lines of Progression\n\nIn subsection III(A)(3) supra we noted the well-established principle that a promotion and transfer system which impedes the attainment by formerly discriminated-against class members of their rightful place within the company must be justified by business necessity. We have recently had several occasions to reiterate the heavy burden that the law places on a defendant seeking to prove that such structural impediments are essential to goals of plant safety and efficiency. See, e.g., James v. Stockham Valves \u0026 Fittings Co., 559 F.2d 310, 350 (5th Cir. 1977); Watkins v. Scott Paper Co., 530 F.2d 1159, 1183 (5th Cir. 1976).\n\nTo ensure that the decree framed on remand would effectuate the remedial purposes of Title VII, while at the same time give due regard to the company's interests in efficiency and safety, this court in Pettway III instructed the district court as follows:\n\nThe appellants ask that the district court be directed to require that vacancies be posted initially for plant-wide bidding and filled by a qualified employee with the greatest plant-wide seniority. . . . Under the \"rightful place theory\" we agree . . . . Therefore, the district court should issue an injunction requiring: (1) posting of vancancies plant-wide; (2) the selection of \"qualified\" personnel for the vacancies on the basis of plant-wide seniority; (3) transferring members of the class shall retain their plant-wide seniority for all purposes including promotion, lay-off reduction-in-force, and recall; (4) advance entry into jobs for which an employee in the class is \"qualified\" or for which no specific training is necessary; (5) red circling of members of the class; (6) establishment of specific residency periods in lines of progression where the company has established prerequisite training as a \"business necessity.\"\n\n494 F.2d at 248-49 (footnotes omitted) (emphasis in original). The clear import of this instruction was that as a prima facie matter every position within the company should be open to plant-wide bidding, with vacancies to be filled by the bidder with the most plant seniority who was \"qualified\" for the job. Only where the company clearly demonstrated on the record the existence of business necessity for particular prerequisite jobs within a line of progression could bidding be based solely on position within the line. Even then, however, we required that the line be carefully structured and that advanced entry and job skipping be allowed where requisite experience could be achieved outside the line or in lower level positions within the line itself.\n\nOur examination of the record and the lines of progression fashioned below convinces us that the district court did not follow this mandate. In general, the district judge made only the most perfunctory and conclusory findings to support the injunctive portions of its decree.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e No new hearings were held and no additional evidence was introduced into the record. Instead, explicit reliance was placed upon a record which this Court had already determined to be wholly inadequate to support a finding of business necessity on most of the issues on remand. With regard to the specific issues of business necessity to support the lines of progression fashioned below, the district court's findings of fact merely states in conclusory terms\n\nThat business necessity had been shown and established for the basic principles involved in the line of progression concept used in and governing the structure of the Company's various lines of progression . . . . [and] for the Company's revised promotion, transfer, layoff, recall and other employment practices . . . .\n\nNot only is the record bare of factual support for these findings with regard to lines of progression in many of the departments, but the record indicates that the district court failed to follow our instructions in evaluating business necessity.\n\nIn Pettway III we acknowledged that not every class member should be considered for every position within the company. \"In an industry involving sophisticated machining processes such as many of the operations of this company, training of employees for skilled positions is a necessary function for the continued economic life of the business.\" 494 F.2d at 246. We found, however, that although \"the company has evidence in the record that significant portions of its operations require skillful craftsmenship,\" \"it has failed to demonstrate that every position at the plant is so complex or specialized as to require, without exception, step by step progression within each department.\" Id. More specifically, we concluded after careful examining the trial record that\n\nThe record discloses no proof by the company that positions in other than craft or technical lines of progression are functionally related. The plaintiffs themselves admit that craft positions require specific prerequisite training and experience. But we read the district court's findings and the record as providing no showing by the company that other lines of progression are functionally related.\n\n494 F.2d at 246-47 (emphasis supplied) (footnote omitted). \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nDespite this seemingly clear statement that the previous record did not support a conclusion that positions within the non-craft lines of progression were functionally related, Judge Lynne candidly remarked at the October 31 hearing that\n\nI feel . . . that with the exception of the back pay award . . . I would have entered the [affirmative relief] judgment which I did enter on May the 12th without any evidentiary hearing whatsoever on the basis of the previous record.\n\n(A!168)\n\nThat Judge Lynne muct have relied on the 1971 trial record to support his finding of business necessity in the non-craft positions is made clear by the total absence of evidence in the record on remand concerning business necessity. This reliance by Judge Lynne on the prior record is in direct contravention of our holding in Pettway III.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nWe reiterate that evidence adduced at the 1971 trial is insufficient to support a finding of business necessity in the noncraft departments. Neither can this finding be supported by evidence entered on the record subsequent to our remand in Pettway III. Indeed, the record on remand is totally devoid of competent evidence of business necessity. The company argues that the court's decree was reached through \"informal processes\" suggested by this court in Pettway III and that a formal trial is not a necessary prerequisite to the entry of the injunctive order.We cannot agree. As we explained in the introduction to this section, the injunctive portions of the decree were entered as the court's own judgment, and as such, must be supported by evidence in the record.\n\nWe therefore conclude that Judge Lynne's finding that the lines of progression in the non-craft departments\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e are functionally related based on the doctrine business necessity is unsupported by the record and must be reversed.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nThe situation is somewhat different with regard to the craft and technical departments.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e In Pettway III we found that evidence from the 1971 trial supported the conclusion that the lines of progression within these departments were functionally related. 494 F.2d at 246-47. Our examination of that record and the modified lines of progression adopted below convinces us that the district court's finding of business necessity for lines of progression in the craft and technical departments is fully supported by the record. We therefore affirm that portion of the court's injunctive decree.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nb. Transfer Procedures\n\nWe have already determined that the evidence does not support the district court's finding that the lines of progression in non-craft departments are functionally related. It necessarily follows that the evidence does not support the court's finding of business necessity for limiting interdepartmental transfer into the non-craft departments to entry level and advanced entry positions. Where it has not been demonstrated that experience in the entry level positions is necessary for successful performance in the next higher-rated positions, the company may not preclude potential transferees from bidding on the more advanced positions. Accordingly, this portion of the injunctive order must be reversed.\n\nThe district court's order also provided that employees within a department shall have an opportunity to bid on vacancies in entry level positions before those jobs are posted plant-wide. If a position is designated as entry level, experience in the line is by definition unnecessary. Under the circumstances, we do not understand how business necessity could possibly justify providing incumbent employees in a department the first opportunity to bid on an entry level vacancy. Therefore, this portion of the decree must also be reversed for both the craft and non-craft departments. The procedures for transfer into craft and technical departments are in all other respects affirmed.\n\n3. Remedy\n\nACIPCO has now had two opportunities to demonstrate business necessity for lines of progression in the non-craft departments. It has failed both times to satisfy its burden of submitting competent evidence on the record that these lines of progression are functionally related. We cannot allow the vindication of the statutory rights of black employees to await yet another proceeding below and a possible third appeal to this court. The time has come for definite, if preliminary, action. Therefore, we direct that on remand the district court modify its injunction to require that all vacancies in the non-craft departments be posted plant-wide for bidding based on plant seniority. Vacancies shall be filled by the senior-most bidder who is deemed \"qualified\" for the position. We reiterate our statement in Pettway III that\n\n\"By the term'qualified' we mean ability which is not to be determined solely by reference to experience in the line of progression of a department . . . .\"\n\n494 F.2d at 249. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e On remand the district court should direct the company to devise objective standards for measuring qualifications.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Class members who are dissatisfied with a determination by the company that they are unqualified to fill a particular vacancy may submit a complaint through the grievance procedure provided in the May decree.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nThe decree should also be modified to provide that vacancies in all entry level positions, including those in the craft and technical departments, be posted plant-wide from the outset. Employees working in a line of progression should not be given the first opportunity to bid on such vacancies.\n\nFinally, nothing in this opinion should be construed to mean that the company must place anyone in a job for which he is not qualified. We recognize that some positions in the non-craft departments may be functionally related to other positions in the same line of progression. The provision in the decree that vacancies be given to the senior-most bidder only if he or she is \"qualified\" should adequately protect the company's interests in safety and efficiency in such situations. While on remand the district court shall first issue a modified injunction requiring plant-wide bidding based on plant-wide seniority for each vacancy in the non-craft departments, the court may, at its discretion, retain jurisdiction and commence further proceedings to give the defendant a final opportunity to prove business necessity for making experience in certain jobs a prerequisite for bidding on other positions in the non-craft lines of progression and for establishing residency periods consistent with our mandate in Pettway III. 494 F.2d at 249 and n.106.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Where the court concludes that new evidence entered into the record by ACIPCO demonstrates the existence of a functional relationship between positions within a line of progression, it may further modify its injunction. in the event that this occurs, however, the court should make detailed findings, based on the new proceedings, concerning the interrelationship of the positions and the possibility of advanced entry and job skipping. Watkins v. Scott Paper Co., supra, 530 F.2d at 1183, Stevenson v. International Paper Co., 516 F.2d 103, 114-15 (5th Cir. 1975).\n\nTo reiterate, the district court shall put into immediate effect an injunctive decree providing for plant-wide bidding on vacancies in non-craft lines of progression, limited only by objective qualifications as defined above. Determinations by the company that a class member lacks the requisite qualifications for serving in a particular position must be made on an individual basis and may not be based solely on failure to have served in the line of progression in which the vacancy occurs. Once this system is in effect, the court may, at its discretion, afford the company one final opportunity to demonstrate, by non-conclusory evidence on the record, the existence of particular functional relationships within the non-craft lines of progression. If the court is satisfied that company has met its heavy burden of demonstrating the business necessity of a particular line of progression, it shall make detailed findings to that effect and may make such modifications to the injunctive decree as are justified by the evidence in the record.\n\nD. Red Circling\n\nA class member wishing to transfer to a department with greater promotional opportunities might be deterred from doing so if the initial entry position in the new department paid a lower salary than his current job. The red circling remedy allows a transferee to retain his old wage rate until he has had an opportunity to learn the necessary skills to progress in the new department to a salary equal to his old departmental wage rate. See footnote 30 supra. It thereby eradicates \"the obvious impediment of lowered wages to transfer to a new department.\" Swint v. Pullman-Standard, 539 F.2d 77, 101 (5th Cir. 1976). See Watkins v. Scott Paper Co., supra, 530 F.2d at 1173-74; Stevenson v. International Paper Co., 516 F.2d 103, 112-13 (5th Cir. 1975). In Pettway III we concluded that the red circling remedy was necessary to effectuate the rights of black employees at ACIPCO:\n\nwhere a job from which the black employee transfers pays more than the new job in a department where the top pay grade is greater than the rate of the old job, a member of the class shall be paid the wage rate of the old job until he advances to a position paying more than that rate or until he voluntarily freezes himself in at the new job.\n\n494 F.2d at 249 (emphasis supplied).\n\nThe district court's decree on remand provided for red circling. Appellants now argue on appeal that certain limitations placed on the red circling remedy by the district court are inconsistent with the remedial purposes of Title VII and with our mandate in Pettway III. We consider these in turn, noting initially that any restriction on the availability of the red circling remedy must be justified by business necessity if it impedes the movement of former discriminatees to their rightful place. Stevenson v. International Paper Co., 516 F.2d 103, 112-13 (5th Cir. 1975).\n\nAppellants first object to the provision in the decree which limits the red circling remedy to class members employed at ACIPCO prior to February 18, 1968, the date that the company eliminated its illegal testing requirements for promotion within the first eight pay groups. The company attempts to justify this provision by arguing that employees hired after that date could not have been harmed by the testing requirements then in effect for pay groups 9 and above. Such requirements were eliminated in March, 1971. As the company points out, the then-current rate progression schedule imposed a six-month residency requirement at each pay group level. Accordingly, no employee hired after February 18, 1968 could have been eligible for a pay group 9 job by March 1971. Appellants respond that the interdepartmental transfer procedures, one source of the discriminatory barrier which red circling was designed to correct, continued at least until the date of the decree. Appellants' argument, however, assumes that the interdepartmental transfer procedures and departmental seniority provisions are themselves illegal. We carefully pointed out in Pettway III that these procedures should be enjoined, not because they are illegal, but because they \"carry forward into the present the stratification of black employees into lower paying, non-skill departments and jobs resulting from past discrimination.\" 494 F.2d at 236. We accept the company's statement that employees hired subsequent to February 18, 1968 could not have been harmed by discriminatory testing or educational requirements. Plaintiffs have not demonstrated on the record that employees hired after that date were discriminatorily placed in the traditionally non-white departments.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e The record thus supports the conclusion that employees hired after February 18, 1968 were not harmed by discriminatory testing and education requirements for promotions. This portion of the district court's order is therefore affirmed.\n\nAppellants also complain that the district court's decree sets a maximum red circle retention rate equal to the pay group 8 wage rate.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e The company attempts to justify this limitation by arguing that positions above pay group 8 generally consist of skilled jobs, and transfers into lower-paying jobs in new departments would result in a less efficient utilization of existing skill and training. According to the company, it would be \"unwise\" in terms of operating efficiency to encourage movement out of better-paying skilled jobs into unskilled or semi-skilled positions.\n\nWhile we are sympathetic to the company's position, we cannot ignore the effect of the wage rate limitation on black employees who have reached pay groups 9 and 10 in the limited opportunity departments and now desire to transfer to a higher opportunity promotional unit from which they had previously been excluded by discriminatory practices. In Watkins v. Scott Paper Co., supra, we recently invalidated a $3 per hour wage retention limitation. Citing Pettway III we stated:\n\nNeither Pettway, nor any other of the red circling cases that have come to our attention, suggests that a limitation on red circling is justifiable. Instead, the cases make clear that red circling is to be complete. Any limitation on red circling requires an affected class member to pay a price for an opportunity provided by Title VII.\n\n530 F.2d at 1174. Therefore, the reduction in wage for those transferees whose present wage rate exceeds the wage retention limitation \"constitutes a term or condition of employment that discriminates against the affected class members on the basis of race.\" Id. Full red circle rate retention must be provided where the class is able to show that limitations present a practical impediment to the transfer of any affected class member. Swint v. Pullman-Standard, supra, 539 F.2d at 100-01, citing Stevenson v. International Paper Co., 516 F.2d 103, 113 (5th Cir. 1975); Watkins v. Scott Paper Co. supra, 530 F.2d at 1174. Although the district court, writing without the benefit of our opinion in Stevenson, made no findings on this question, as in Watkins, \"it is inconceivable\" here that some affected class members currently earning above the pay group 8 wage rate\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e and now wishing to transfer would not be deterred by the limitation. 530 F.2d at 1174. Accordingly, on remand the district court's order should be modified to provide full red circle rate retention for eligible class members.\n\nAppellants third contention is that the district court improperly limited the use of red circling rights to transfers made within three years of the decree. We disagree. In Stevenson v. International Paper Co., supra, we stated that a\n\n\"time limitation to take advantage of red circling is . . . not per se unlawful. This Court has frequently recognized that the employer has an interest in reestablishing stability to his work environment and that reasonable time limitations on the extraordinary system created to provide relief for prior discriminatees is permissible.\"\n\n516 F.2d at 113 (emphasis supplied). Appellants have not demonstrated that the three year time limitation is unreasonable or constitutes an abuse of discretion by the district court. However, because of the possibility that some discriminatees have been dissuaded by the invalid portions of the red circling provisions from exercising their transfer rights, on remand the district court should extend the permissible time for exercise of red circle rights for a reasonable period beyond the date on which its modified decree becomes effective. See Stevenson, supra, 516 F.2d at 112-113.\n\nFinally, appellants argue that the provisions in the decree which terminate the retained rate where the employee \"fails to progress\" or \"declines to progress\" in the new line or where \"104 weeks have elapsed since his transfer\" are inconsistent with our mandate in Pettway III and not justified by business necessity.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e The company responds that these limitations are necessary to prevent discriminatees from relaxing their efforts to reach their rightful place by \"retiring\" to easy jobs at retained pay rates. The 104 week limitation is said to be generally consistent with the period required for advancement to pay group 8 from most entry level jobs.\n\nIn Pettway III we stated that a transferee \"shall be paid\" his old wage rate until he advances to a higher paying position or \"until he voluntarily freezes himself in at the new job.\" 494 F.2d at 249 (emphasis supplied). We read the provisions in the decree terminating the retained rate where the discriminatee \"fails to progress\" or \"declines to progress\" as consistent with our prior mandate. Appellants' apprehensions that such determinations will be made unfairly by the predominantly white supervisory staff are not compelling in light of the grievance procedure provided by the decree.\n\nThe 104 week limitation, however, must be reversed. First, the district court made no findings that this period is sufficient to allow a reasonably diligent and capable employee to advance to pay group 8 from most entry level jobs in most departments. In any event, the company does not point to sufficient evidence in the record to support such a finding. More importantly, the 104 week limitation necessarily was based on the district court's erroneous view that red circle rate retention could be limited to the pay group 8 wage rate. In light of our holding that full rate retention must be provided even to class members earning above the pay group 8 wage rate, the court on remand must reconsider the length of time following a transfer in which the red circle wage rate must remain in effect. The period adopted must be sufficient to provide a reasonably industrious and capable class member the opportunity to reach his present pay level in the more desirable departments.\n\nWe recognize that it may take longer for an employee in, say, pay group 9 to reach this pay level in a new department than for an employee in pay group 5 to reach a pay group 5 position in a new line of progression. The court is free to consider this possibility and apply a different time limitation for each pay level. We also recognize that the same employee may not advance with equal speed in every department. The court need not take account of every possible permutation and combination of transfers which might be available to class members. The court's time limitation, however, must be long enough to allow reasonably diligent and capable class members a fair and reasonable opportunity to reach their present pay group level in the departments from which blacks have traditionally been excluded.\n\nE. Supervisory Positions\n\nPrior to 1971 the company's supervisory personnel were selected by department superintendents, all of whom were white. The selection criteria included performance on illegal objective tests and the subjective judgment of the superintendents. The testing was discontinued in 1971. In Pettway III we stated that the fact that only one of approximately one hundred supervisory positions was held by a black employee, when considered in conjunction with the use of illegal testing and the application of subjective standards by all-white superintendents, would normally present a conclusive showing of present discrimination. 494 F.2d at 240-41. However, because the company had terminated its testing requirements, we remanded the issue for a determination of \"whether selection on the basis of subjective judgment of all-white superintendents operates independently of the testing to discriminate and helped produce this disparity.\" Id. at 241. We cautioned the court that in examining the evidence it should consider the possibility that a cessation of discriminatory treatment following termination of the illegal testing might indicate, not that the tests were the sole cause of the discriminatory barrier, but that the company had become aware of the possibility of legal sanctions and was building a record for purposes of this lawsuit. Accordingly, we instructed the court to examine on remand three indicia of discriminatory selection:\n\nFirst, as to whether there are more examples of black employees who were able to hurdle the illegal testing barriers to these supervisory positions, but then were disqualified under the subjective criteria utilized by the department superintendents.Secondly, the court should note whether less qualified white employees have been appointed leadmen or foremen both prior to March, 1971 and since that time. Finally, the court should obtain evidence of the operation of this subjective standard applied by white supervisors since the trial.\n\n\u003cspan class=\"fn\"\u003e1. The Equal Employment Opportunity Commission, the agency established by Congress to administer, interpret, and enforce Title VII, filed a brief as amicus curiae in support of the plaintiffs-appellants. The Commission stated in its brief that \"the issues of procedural safeguards to class members and the scope of relief necessary to eliminate employment discrimination are of general importance in the interpretation and administration of [Title VII].\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The June 12 final judgment provided that the one million dollar award be divided among the subclass members according to an allocation formula. Following that judgment, the company mailed a back pay check to each individual awardee. The court's November 20 final order provided a mechanism for subclass members to opt into or out of the settlement. Those desiring to opt into the settlement could do so by cashing their checks prior to December 15, 1975. Claimants who were dissatisfied with their award and chose not to cash their checks by that date were considered to have opted out. Their awards were deemed \"null and void,\" and these claimants were relegated by the court's final order to independent back pay actions. For a detailed discussion of the court's opt-in, opt-out procedure, see subsection V(B) infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The present class comprises 2242 members. Of these, 841 (the \"awardees\") are also members of the back pay subclass and were sent checks following the June judgment. See footnote 2 supra. 399 members of the subclass cashed the proffered checks, while 442 declined to do so. The remaining 1401 members of the class were denied any back pay award under the terms of the district courts' May 14 decree. The parties are in agreement that 661 members of the class (the \"objectors\") filed objections to the June judgment by signing the June 20, 1975 motion for reconsideration which indicated intent to appeal all aspects of the court's order. The litigants also agree that 147 of these objectors were awardees who cashed the proffered back pay checks. The parties disagree as to the composition of the remainder of the objector group. Appellants and the EEOC urge that all the objectors are members of the back pay subclass; the company maintains that 150 of the remaining objectors were excluded from the back pay subclass. We do not view this dispute as decisive of any issue in this appeal and are content, in light of our resolution of the case, to accept the company's statistics. Accordingly, we find that a total of 511 of the objectors (661-150) are members of the back pay subclass, 147 of whom cashed their back pay checks and 364 (511-147) of whom did not. In addition to these 511 subclass members who objected to the court's decree by signing the notice of appeal, another 78 (442-364) subclass members, while not signing the notice of appeal, manifested their dissatisfaction with at least the back pay award by refusing to cash their back pay checks. Thus, a total of 589 (511 + 78) members of the 841 person subclass expressed their dissatisfaction with the back pay award either in writing or by opting out of the subclass. The figures are set forth below in schematic form: []\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. This class action was originally brought by four named individual plaintiffs - Rush Pettway, Davis Jordan, Alex Fitts, and Peter Wrenn. Three of these class representatives attended the June 13 meeting and later signed the notice of appeal. The fourth, Peter Wrenn, is no longer employed by the defendant and has not been active in the case for several years. The terms \"class representatives\" and \"named plaintiffs\" will be used throughout the opinion to refer to Pettway, Jordan, and Fitts, the three active named plaintiffs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This is not to say, however, that courts should not be conscious of the possibility of similar abuses in the judgment context. See discussion in the introduction of section III, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The procedural requirements for approving a settlement and the scope of the district court's discretion in this area are major issues in this litigation and are discussed at length in section V infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The district court's decree adopted the company's position limiting the back pay subclass to black employees hired prior to July 2, 1965 (the effective date of the Act) who were presently employed by the company or who left the company subsequent to July 2, 1965 with at least one year of company service. This order excluded 1400 class members from consideration for a back pay award and established a back pay subclass consisting of 841 individuals, including a number of persons no longer employed by the company.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. These modifications in the lines of progression were made at the request of ACIPCO, which argued that they were necessary \"in order to reflect certain changes in job titles and in operations and to afford additional promotional opportunities consistent with the efficiency and safety of the operations.\" (A 1042). The record does not indicate that attorney Adams ever agreed to these changes. In fact, they were accepted by the court on June 12, 1975, the same day that the plaintiffs' May 23 motion for reconsideration was overruled. The modifications were not made in response to objections by the class, and, in any event, relevant to only a small portion of the injunctive provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. On September 5, 1975 the court held a hearing in chambers on appellants' motion to substitute counsel. The court denied this motion, but allowed attorney Wiggins \"to represent the disaffected employees as amicus curiae.\" (A 430) The court also stated its intention to conduct \"an evidentiary hearing which will disclose the manner in which the final decree of this court was arrived at.\" (A 430) The October 30 hearing was held for this purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Between the September 5 hearing in chambers and the October 30 evidentiary hearing, Judge Lynne instructed Mr. Adams and counsel for the company to prepare a stipulation setting forth the events leading up to the May decree and the June judgment. The court admitted the stipulation into the record during the October 30 hearing, stating that it \"accurately summarized\" the events culminating in the final order by the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In fact, the district court's order provided that 1400 class members were not entitled to back pay.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Judge Lynne further stated on October 31 that: Taking into consideration all of the factors involved, I felt like that every black employee of ACIPCO should receive something, and that is how the negotiations proceeded to final solution by negotiation. If I didn't think that the back pay award was all that could be gotten through negotiations, and I must say that I spent many, many hours in an effort to promote the negotiations . . . and we inched up from $300,000 to the ultimate figure beyond which ACIPCO was not willing to go on the basis of its calculations, and that's the way things came out. These things, negotiations of that nature to arrive at a lump sum figure cannot obviously be conducted in a courtroom. (A 1188). (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The stipulation by Mr. Adams and defendant states that before the June judgment was entered \"counsel for both parties indicated to the Court that while the proposed back pay award did not conform to their respective initial proposals, the award as directed by the Court was deemed fair and reasonable under all the circumstances and that therefore neither counsel would take an appeal therefrom.\" (A 417)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We note that at least one of our sister circuits has gone behind the traditional labels to examine the realities of a settlement-judgment dispute. As the Seventh Circuit recognized in EEOC v. United Air Lines, 560 F.2d 224 (7th Cir. 1977), situations may arise in which a decree is properly treated as an adjudicated judgment with respect to one party and as a consent decree with respect to another party. In that case, after a proposed consent agreement was submitted to the trial judge one of the union defendants objected to a seniority provision in the decree. The district court nonetheless entered the decree, but crossed out the word \"consent\" on the first page. The Seventh Circuit commented: Judge Will's decision with respect to the Union was an adjudicated decision on the merits and not a mere consent decree. However, the decision remains a consent decree vis-a-vis United. 560 F.2d at 229 n.7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The court's findings of fact and conclusions of law incorporated in the November 20 final order further illustrate the court's treatment of the back pay award as a settlement. Conspicuously absent from the court's findings are any factual or legal conclusions necessary to support an independent back pay judgment. Instead, the court couched its findings in language more appropriate to evaluating a settlement. For example, the court concluded that awardees \" may have suffered some economic loss due to alleged discriminatory practices of the company.\" (emphasis supplied). The total back pay award was deemed \"a reasonable approximation\" of the aggregate economic loss \"which may have been suffered\" by the subclass, and the individual back pay awards were deemed \"to be fair, equitable and adequate.\" (emphasis supplied) (A 416). This language closely parallels the legal requirement that in approving a settlement, the trial court must evaluate whether the compromise is \"fair, adequate and reasonable.\" See Cotton v. Hinton, supra, 559 F.2d at 1330; Young v. Katz, 447 F.2d 431, 432-33 (5th Cir. 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The Committee for Equal Job Opportunity is an organization of black employees at ACIPCO which was formed to represent minority employees in litigation against the company. We noted in Pettway III that this \"intense organization of black employees\" was formed by the majority of the affected class in 1965. Pettway III, supra, 494 F.2d at 233 and n.53. The Committee is the designated representative of the majority of the class for purposes of this litigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Later, in a letter to all class members dated July 22, 1975, Mr. Adams explained: Our position has been, and remains, that we have obtained for you the best Decree possible under all the circumstances involved in your case - one that can be used to end discrimination and can be adjusted to deal with the problems as they arise. We will not appeal, because an appeal may delay rights already obtained and could cause a loss of some of the back pay you have obtained . . . To win the appeal would only send it back to the District Court, where we are now.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In view of our conclusion that appellants properly bring this appeal on behalf of the class, we need not consider what appellate rights would accrue to a member of the class appealing the court's judgment in his individual capacity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Distinctive problems may be presented where the named plaintiffs refuse to undertake an appeal which the class attorney believes to be in the best interests of the class or where both the named plaintiffs and the class attorney decide not to appeal. If no appeal is taken and the failure to pursue an appeal constitutes inadequate representation, other members of the class may certainly pursue relief in a collateral proceeding. Gonzales v. Cassidy, supra. Whether, and how, a direct appeal may be taken absent the participation of the original named plaintiffs, or the participation of both the named plaintiffs and the class attorney, are issues we need not resolve for purposes of this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The district court presumably was aware of the fact that a substantial portion of the subclass had not cashed their back pay check at the time of the October 30 hearing, because its November 20 final order extended the deadline for opting into the subclass until December 15, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We recognize that some of the subclass members who refused to cash their back pay check may have objected only to the back pay award and not to the injunctive portions of the decree. However, all 511 awardees who signed the June 20 notice indicating an intent to appeal explicitly objected to the injunction portions of the decree. The record indicates that many awardees who refused to cash their back pay check did so in part because they feared that opting into the settlement would preclude appellate review of the injunctive provisions of the decree as well. Under the circumstances, it is clear that a substantial majority of the subclass favored this appeal of the injunctive portions of the decree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. On May 21, 1975 a copy of the May decree and an explanatory letter were mailed by the company to all class members then employed by ACIPCO. According to figures proffered by appellants, over 1000 class members were no longer employed by ACIPCO in 1975 and thus did not receive this information. This letter constitutes the only notification of the court's decree sent by ACIPCO to those class members who were excluded from the subclass. While no Rule 23(e) \"notice\" is required for those portions of the decree which constitute the court's own judgment, and thus as a procedural matter we are not concerned with the \"notice\" received by those excluded from the subclass, the familiarity of this portion of the class with the injunctive portions of the court's May decree and June judgment is highly relevant in assessing the class' support for this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Throughout the period between the May and November orders Mr. Adams repeatedly objected to the exclusion of 1400 class members from the back pay subclass. We must assume, therefore, that he believed that there was some merit to the contention that these class members were entitled to back pay.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Nothing that we have said thus far is meant to criticize the representation of Mr. Adams during the ten years in which he vigorously litigated the plaintiffs' claims. We have previously had occasion to remark upon Mr. Adams' experience in representing plaintiffs in class action suits, Cotton v. Hinton, 559 F.2d 1326, 1332 and n.3 (5th Cir. 1977), and have no reason to discredit the sincerity of his belief that an appeal was not in the best interests of the class. Whether this belief was sincere or insincere, however, is not at issue here. The real question is whether, under the circumstances of this case, the district court should have let Mr. Adams' decision prevent appellants from appealing on behalf of the class by denying permission to substitute counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The portion of the decree pertaining to this release is reproduced in footnote 78 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Section 1291 provides that \"the court of appeals shall have jurisdiction of appeals from all final decisions of the district courts of the United States . . . except where a direct review may be had in the Supreme Court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The instant class suit was originally certified as a Rule 23(b)(2) action. As we demonstrate in subsection V(B)(1) infra, in Rule 23(b)(2) class actions the district court may not require members of the back pay subclass to either accept their award or opt-out of the class suit altogether. At most, awardees may be permitted to opt-out of a subclass, while remaining in the class to pursue their individual claims in the same suit. See Sagers v. Yellow Freight System, Inc., 529 F.2d 721, 736 (5th Cir. 1976); United States v. United States Steel Corp., 520 F.2d 1043, 1057 (5th Cir. 1975); La Chapelle v. Owens-Illinois, Inc., 513 F.2d 286, 288 n. 7 (5th Cir. 1975). This is precisely the result we intended in Pettway III. See subsection V(B)(1) infra. Thus the district court's order should have allowed awardees who opted out of the subclass to pursue their damage claims in further proceedings in this suit. This fact, however, does not make the court's order any less a final judgment. Indeed, in Cotton v. Hinton, supra, this court reviewed a settlement which included back pay provisions even though individual back pay awards were yet to be determined. See also Eisen v. Carlisle \u0026 Jacquelin, 417 U.S. 156, 94 S. Ct. 2140, 40 L. Ed. 2d 732 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See footnote 78 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In 1971 36% of the ACIPCO's 2514 employees were black, yet only 9% of the employees in the maintenance department, 11% in the machine shop, 5% in the electrical department, and 3% in the inspection and the steel pipe departments were black.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In Pettway III we described the red circling remedy as follows: Red circling is a standard remedy for eliminating past discrimination which prevented employees from reaching higher jobs and is recognized as necessary since otherwise employees could not afford to take training jobs paying lower wages. Where the job from which the employee transfers pays more than the new job, where the new job is in a department where the top wage rate is greater than the rate of the old job, the employee is paid the wage rate of the old job, until he advances to a job paying more than that rate or until he voluntarily freezes himself in at the new job. 494 F.2d at 248 n.99. Red circling is discussed in greater detail in subsection III(D) infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. During this residency period, the transferee's departmental seniority in the new department is used for promotional purposes. Plant seniority is retained for all other purposes during the employee's first year in the new line of progression. After the expiration of this residency period, the employee's plant seniority is utilized for all purposes, including promotion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The following diagram illustrates the revised line of progression for the steel pipe foundry. []\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The diagram of the steel pipe department lines of progression, reproduced in footnote 32 supra, illustrates this boxing mechanism. In this line of progression the \"hydrostatic tester,\" \"sample cut off,\" and \"end facer operator\" positions are boxed together. An employee in any of the entry level positions may bid into any of those boxed positions. Likewise, an employee in any of these boxed positions may bid for the \"preliminary inspector\" position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. For example, in the steel pipe department, illustrated in footnote 32 supra, the \"toolman position\" is designated as an advanced entry job. A machinist in the machine shop may bid for a vacancy in the toolman position without having prior experience in the steel pipe department.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. In response to our mandate in Pettway III the court's order also provided for red circling, modified the company's reduction in work force and recall procedures, revised the qualifications for the apprenticeship program, supervisory positions, and on the job training, and established a grievance procedure and an implementation committee. Appellants' objections to these portions of the order are discussed in subsections III (D) - (G) infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Section 703(h) provides in part: Notwithstanding any other provision of this subchapter, it shall not be an unlawful employment practice for an employer to apply different standards of compensation, or different terms, conditions, or privileges of employment pursuant to a bona fide seniority or merit system . . . provided that such differences are not the result of an intention to discriminate because of race . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. We note here that in our prior opinion we specifically stated that \"our holdings and the relief directed are granted both under Title VII and section 1981 unless otherwise stated.\" 494 F.2d at 217 n. 6 (emphasis supplied). Later we commented that \"discrimination prior to the effective date of Title VII, July 2, 1965, can be considered under two theories. Since the appellant's allegations are also made under 42 U.S.C.A. ยง 1981, employment practices prior to 1965 may be examined. [We then explained the relevance of pre-Act conduct under Title VII.]\" 494 F.2d at 218 n. 10. Appellants maintain that Teamsters does not affect our prior holding to the extent that it was grounded in 42 U.S.C. ยง 1981. Two of our sister circuits have recently split on this issue, the Fourth Circuit holding that bona fide seniority systems which are protected by section 703(h) of Title VII are not violative of section 1981 and the Third Circuit reaching a contrary conclusion that section 703(h) does not affect the remedial powers of the federal courts under section 1981. Johnson v. Ryder Truck Lines, Inc., 575 F.2d 471 (4th Cir. 1978), cert. denied, 440 U.S. 979, 99 S. Ct. 1785, 60 L. Ed. 2d 239 (1979); Bolden v. Pennsylvania State Police, 578 F.2d 912 (3rd Cir. 1978). Assuming, as we must, that Congress intended section 703(h) to accord absolute protection to pre-Act seniority rights which accrued under bona fide seniority systems, Congress could not have intended such seniority rights to remain subject to revision under section 1981. The same protections should apply whether the seniority system is challenged under Title VII or section 1981. We therefore agree with the Fourth Circuit's holding in Johnson that the protection accorded bona fide seniority systems by section 703(h) apply whether suit is brought under Title VII or section 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The company argues that the eight \"advanced entry\" positions, which are posted plantwide with bids based on plant seniority, also provide an opportunity for interdepartmental transfer into advanced positions. These advanced entry positions, however, appear unlikely to benefit class members significantly in the near future. First, only eight out of some 230 jobs in the plant are designated as advanced entry positions. Moreover, between 1965 and 1971 six of these jobs never became vacant. More importantly, the prerequisite job experience in other departments will, for the most part, preclude black applicants from bidding on advanced entry positions. For example, qualifications for the \"machinist\" advanced entry position in the electrical department requires the transferring black worker to have occupied the machinist \"A\" position in the machine shop. The record indicates that not a single black employee occupies one of over 60 machinist \"A\" positions. For many of the other seven advanced entry positions, the inability of class members to meet the requisite qualifications renders the advanced transfer opportunity equally illusory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The red circling remedies in the court's order which were designed to ameliorate the wage deterrent to transfers are discussed in subsection III(D) infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. We reproduce the district court's findings and conclusions in support of the injunctive portions of its decree in their entirety: The Court finds and concludes from all the evidence: (a) That business necessity had been shown and established for the basic principles involved in the line of progression concept used in and governing the structure of the Company's various lines of progression, charts of which are attached as Appendices to the Decree of May 14, 1975 and the Judgment of June 12, 1975; (b) That business necessity has been shown and established for the Company's revised promotion, transfer, layoff, recall and other employment practices collectively referred to as Seniority Rules and Regulations attached as Appendix B to and approved in the Decree of May 14, 1975; (c) That the one year waiting period before plant age may be used by a new entrant into a line of progression for promotional purposes is necessarily required to insure a minimum period of training and experience before rising to more responsible positions in the line of progression and thereby avoiding a significant hazard to personnel and equipment and a substantial adverse effect upon the efficiency of the operation conducted by the line of progression; (d) That the removal of pre-entry group jobs from the Company's lines of progression and the identification of advanced entry jobs together with the provision for filling vacancies in entry level jobs and advanced entry jobs through plantwide bidding using plant seniority properly and adequately afford promotional and transfer opportunities to eliminate any continuing effect of past discrimination consistent with business necessity of the Company; (e) That the rate retention provision set out in paragraph 7 of the Court's Decree of May 14, 1975 properly and adequately encourages and protects the earnings of any black employee who takes opportunity to transfer to a new line of progression in another department from which he may have been inhibited or restricted by the Company's test and educational requirements existing prior to February 18, 1968 but at the same time protects the Company against loss of efficiency and needless waste of training time and cost which would result if black employees occupying and enjoying the pay of the semi-skilled and skilled jobs in pay groups above pay group 8 were encouraged to transfer out of those jobs by unrealistically high rate retention; (f) That business necessity has been shown and established for the basic principles incorporated in the Company's apprenticeship program and in its on-the-job training program as modified by paragraphs 8 and 9 of the Decree of May 14, 1975; (g) That business necessity has been shown and established for selecting personnel for promotion to supervisory positions from those incumbents on the one or two top jobs in a line of progression in order to obtain a supervisor with requisite skills and technical knowledge needed to supervise and direct the work under such personnel's supervision and that qualified black employees are being selected for supervisory positions without regard to race, the Company having fourteen black foremen and leadmen as of January 1, 1975 as compared to only two in 1971.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. We later reiterated this conclusion: Only to those jobs in lines of progression shown by the company to be functionally related does this finding of business necessity attach. The record thus far clearly reveals that only the craft positions are functionally related. Id. n.96.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The defendant would have this court reconsider its finding that the 1971 trial record discloses no proof that positions in non-craft lines of progression are functionally related. Indeed, the defendant states in its reply brief that The record before this Court in the last appeal was quite voluminous and did in fact contain substantial proof of such functional relationship, consisting mostly of unrebutted testimony, which must have been inadvertently overlooked or misinterpreted by this Court. (emphasis supplied). While we readily admit that we are capable of making mistakes, the three examples of trial testimony quoted in the defendant's reply brief which purport to demonstrate the functional relationship of jobs in the non-craft lines fail to convince us that a mistake has been made here. The company first quotes the following testimony from the superintendent of the steel foundry department: Q. Mr. McCauley . . . I will ask you to look at the sheet marked Steel Foundry, normal lines of progression. Are you familiar with the lines of progression set out on the chart? A. Yes. . . . . Q. I will ask you in your experience are those in your opinion, those lines of progression functionally related? (sic) A. We think they are very sound. This is the type thing we have followed for many years and it has served a very good purpose. (A. 905-906) (Emphasis added). Next, the following testimony from the Melting Superintendent, Mr. Carlson, is reproduced: Q. I will ask you whether or not [the Melting Department LOP's] are functionally related in your opinion? A. Yes, these would be the normal lines of progression. Q. Do jobs in the lower pay group furnish experience and training towards the higher rated jobs? A. Right. Finally, defendant's reply brief quotes the following colloquy between the court and an ACIPCO Vice President: THE COURT: Mr. Coupland, is it your opinion that the lines of progression in which have been followed by American Cast Iron Pipe Company in the past and which are represented by the graph I have seen or the diagrams, is it your opinion they are functionally related to the performance of the plant as a whole? A. Yes, sir, we think so. This not so astonishing response by an ACIPCO official and the general conclusory statements by Mr. McCauley and Mr. Carlson simply do not support a finding of business necessity. To paraphrase a recent Eighth Circuit opinion, this testimony does not constitute \"evidence that each job was an essential prerequisite to the next higher job in every line of progression. Some general evidence only was presented about general structures of lines of progression and their business convenience. But that evidence was not specific enough to meet the test of business necessity.\" Rogers v. International Paper Co., 510 F.2d 1340 (8th Cir.), vacated on other grounds, 423 U.S. 809, 96 S. Ct. 19, 46 L. Ed. 2d 29 (1975). In Pettway III we required that functional relationships to support a finding of business necessity be demonstrated for each position. The testimony quoted above fails to demonstrate such a relationship either position by position, line by line, or verse by verse. Likewise, our examination of those portions of the 1971 trial record cited in the defendant's reply brief reaffirms our conclusion in Pettway III that the record is insufficient to support a finding that positions in the non-craft lines of progression are functionally related. Finally, we note that this appeal is not the proper vehicle for presenting defendant's disagreement with this court's holding in Pettway III. Alleged errors in a prior decision are properly raised in petitions for rehearing or by writ of certiorari to the Supreme Court. The \"law of the case\" doctrine, discussed in subsection III(B) supra, precludes reconsideration of decided questions on a subsequent appeal, absent the most cogent reasons such as the avoidance of manifest injustice. Terrell v. Household Goods Carriers' Bureau, 494 F.2d 16, 19-20 (5th Cir.), cert. denied, 419 U.S. 987, 95 S. Ct. 246, 42 L. Ed. 2d 260 (1974). See also Carpa, Inc. v. Ward Foods, Inc., 567 F.2d 1316 (5th Cir. 1978). No such reasons are present here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. We refer to the monocast, fittings foundry, steel foundry, melting, steel pipe foundry, general yards, central stores, shipping, and construction departments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Similarly, the one year residency requirement established for the non-craft departments must be reversed. The district court's order provided that departmental seniority, rather than plant seniority, shall be utilized for promotional purposes during the first year of an employee's transfer to a new department. After the expiration of this one year residency period, plant seniority is fully restored. See footnote 31 supra. The court recognized that this residency period would impede the rise of class members to their rightful place in the company, but found that an across-the-board residency requirement was necessary to familiarize each transferee with his new line of progression and was thus necessitated by business necessity. See footnote 40 supra. Given our determination that the company has not established a functional relationship between positions in the non-craft lines of progression, a one year loss of plant seniority which impedes progress to the next position in the line of progression cannot be supported by reference to such a relationship. The requirement that bidders for a higher position in the line of progression be \"qualified\" to fill the vacancy fully protects the company's interest in plant safety and efficiency. We therefore vacate the one year residency requirement for the non-craft departments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. This category consists of the machine shop, electrical, maintenance, and inspection departments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Similarly, we find that the one year residency period established in the craft positions is supported in the record by a showing of business necessity and consistent with our mandate in Pettway III, see 494 F.2d at 249 and n.106.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. For example, we stated in Pettway III that a forklift operator in the mono-cast department should be able to transfer to a forklift operator position in some other department. 494 F.2d at 249. Despite the company's attacks on the \"academic character\" of this example, we adhere to the position that the company may not preclude advanced entry into lines of progression solely because the transferee is unfamiliar with the production process in the line. The company's argument if accepted, would justify never allowing advanced entry into any line of progression.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The court's decree incorporates by reference the company's \"Policies, Rules, and Procedures\" governing seniority, promotions, and bidding. This policy statement provides that Qualifications considered in promotion are: A. Skill, knowledge, training, and efficiency B. Physical fitness C. Length of service Where factors A and B [are] relatively equal, employees with the greatest length of plant continuous service will be given preference. Insofar as this definition of \"qualifications\" allows the company to fill vacancies on the basis of comparative skill, knowledge, and training before seniority is considered, it is inconsistent with our mandate in Pettway III. If accepted, this definition would allow the company in almost every case to place an incumbent in the line because he was \" more qualified\" than a transferee, even though the transferee may be fully qualified and have superior plant seniority. On remand the court must provide that bidding be based initially on plant seniority. The company may then reject the senior-most bidder only if he fails to meet a threshold level of skill, knowledge, and training necessary to perform that job adequately.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The life of the implementation committee, designated by the court to monitor compliance with the May 1975 decree, should be extended for a reasonable time after the district court issues a modified order in compliance with this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. ACIPCO has now had two opportunities to show business necessity justifying its proffered lines of progression. Ordinarily, we would be reluctant to provide ACIPCO yet a third opportunity to do so. We recognize, however, that ACIPCO's failure to supplement the record following our remand in Pettway III may have been due in part to the unusual nature of the proceedings below. Defendant represents that the district court considered arguments and evidence in chambers which supported its findings of business necessity. We have no way of evaluating this contention or of allocating responsibility for defendant's failure to enter this \"evidence\" in the record once settlement negotiations broke down.The district court is in a far better position to judge the equities of the situation. Accordingly, we leave the question of whether ACIPCO should be provided a third opportunity to prove business necessity to the discretion of the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Indeed, the statistics relied on in Pettway III to support our conclusion that black workers were excluded from higher paying, traditionally white departments by discriminatory practices persisting at least until January 1971 are at best equivocal on the issue of discriminatory hiring subsequent to 1968. See Pettway III, supra, 494 F.2d at 227 (Chart B), 228-32, 236.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Actually, the decree provides that the retained rate shall not exceed the lower of (1) the standard hourly wage rate in effect for jobs in pay group 8 on the date of the employee's transfer or (2) the standard hourly wage rate of the highest job in the line of progression to which the employee is transferring. This second qualification prevents an employee from abusing the red circling remedy by transferring into a line of progression in which the highest paying job pays less than the employee's present salary. In such a case the employee could have no hope of ultimately improving his wage rate by the transfer, and rate retention, therefore, would unfairly penalize the company. This provision is not challenged on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. As of August 15, 1971 there were 41 black employees in pay groups 9-12. Pettway III, supra, 494 F.2d at 227 (Chart C).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The decree also terminates rate retention where the employee progresses in his new line \"to a job of equivalent rate to his retained rate\" or where, after the first transfer, \"he bids to another line of progression or department.\" These provisions are not challenged on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The court in its November 20, 1975 final order concluded: That business necessity has been shown and established for selecting personnel for promotion to supervisory positions from those incumbents on the one or two top jobs in the line of progression in order to obtain a supervisor with requisite skills and technical knowledge needed to supervise and direct the work under such personnel's supervision and that qualified black employees are being selected for supervisory positions without regard to race, the Company having fourteen black foremen and leadmen as of January 1, 1975 as compared to only two in 1971.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. Indeed, we have recently commented that \"actions taken in the face of litigation are equivocal in purpose, motive and permanence.\" James v. Stockham Valves \u0026 Fittings Co., supra, 559 F.2d at 325 n. 18, quoting Jenkins v. United Gas Corp., 400 F.2d 28, 33 (5th Cir. 1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Paragraph 2(a) of the May decree provides that: Plant continuous service (hereinafter plant service) shall be used. . . for all purposes in which a measure of continuous service is presently being utilized . . . . All future promotions, step-ups, demotions, layoffs, recalls and other practices affected by seniority shall be in accordance with plant service provided that, (1) demotions, layoffs, and other reductions in force shall be made in descending job sequence order in each line of progression starting with the highest affected job and with the employee on such job having the least length of plant service, (2) the sequence on a recall shall be made in the reverse order so that the same people shall return to their jobs in the same positions relative to each other that existed prior to the reductions, and (3) where economic conditions necessitate an overall reduction in the plant-wide work force, employees with the lesser plant service shall, subject, however, to the Company's right to retain in its active service such employees with craft, critical job and other specialized skills as may be reasonably required for the continued efficient and safe operation of the Company, be laid off from active service with the Company prior to those employees with greater plant service, and the laid-off employees shall be recalled to active service in the reverse order of their layoff. (A. 63-64).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. See paragraph 2(a)(2) of the May decree, reproduced in footnote 57 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Paragraph six of the company's \"Rules for Upgrading and Changing Wage Rate Jobs,\" adopted by the court in its May decree, is invalid for similar reasons. This rule provides that If a certain high level job is eliminated from a department due to changing business trends or a deep reduction in force in that department and an opening for that job skill occurs in another department, the opening will be filled with the employee with the displaced skill before opening the job for bids, or moving up a less qualified employee in the progression line. Placement of employees with displaced skills will be done with approval of the Seniority Committee. This provision perpetuates the effects of past discrimination by giving preference for high level jobs to predominantly white employees in similar jobs in other departments over those blacks who could successfully bid on the jobs based on plant seniority and qualifications but for this preference. It has not been justified by business necessity. See Hayes, supra, 456 F.2d at 118.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. The parties, of course, are free to negotiate a settlement on this or any of the issues remaining on remand. We reiterate our comment in the introduction to Section III that any portion of the decree entered on remand which represents the agreement of the parties must be clearly denominated as such. The settlement should be accepted by the court only after Rule 23 procedural requirements have been fully satisfied. See subsection V(A) infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. In subsection III(D) supra we required the district court to provide full red circle wage rate retention to all eligible employees. This modification in the red circle provisions of the court's decree is one example of a revision that can be effected without further evidentiary proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. For example, in subsection III(E) supra, we ordered the district court to reconsider whether the subjective judgment of all-white superintendents operates to discriminate against black employees in the selection of supervisors. Evidentiary hearings may be necessary to comply with our mandate on this and similar issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. The printout classifies each company employee by department, and provides the following information: name, employment date, salary as of February 20, 1975, sex, and race. Apparently, only persons currently employed as of February 20, 1975 were included in the printout, and thus the printout provides no information on those class members no longer employed with the company on that date.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. In considering these groups within the class, the court is free to create subclasses to aid its determination. See United States Steel Corp., supra, 520 F.2d at 1054, 1056.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. The company argues that because of its time progression interval requirement for advancement within pay groups 1-8, employees hired after July 1965 could not have suffered economic loss prior to the March 1971 elimination of all testing and educational requirements for promotion to pay groups 9-16 and for admission to apprentice and on-the-job training positions. The company further alleges that many of the 1400 class members who were denied back pay left the company after an insufficient period of service to have suffered any economic loss. The briefs of appellants and the EEOC purport to refute these arguments. Given the present state of the record, consideration of these points is best left to the district court on remand. Our own review on a subsequent appeal would then benefit from the district court's development of the record and articulation of reasons for its conclusions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. We recognize that this \"bifurcated approach\" might be more appropriately denominated in terms of three or more stages. However characterized, Stage I permits an initial presumption of entitlement which the company may rebut and the class may reinforce by evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. If Stage II is reached on remand, and the court chooses to proceed on an individual-by-individual basis rather than utilize one of the class-wide approaches suggested in Pettway III, 494 F.2d at 261-63, notice to class members explaining this obligation to provide information to the court would be appropriate. See Fed.R.Civ.P. 23(d)(2). Judge Wisdom's concurring opinion in Robinson v. Union Carbide Corp., 544 F.2d 1258, 1261 (5th Cir. 1977) discusses standards for Rule 23(d)(2) notice in a similar context. The same standards are applicable here. See id. at 1265. Such notice is important in this Rule 23(b)(2) class action because class members who do not supply the requested information would be precluded from relief in this action, but would be bound by the judgment and precluded from pursuing individual relief in another suit. See subsection V(B)(1) infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. We also stressed in Pettway III that \"the ingredients of back pay should include more than straight salary. Interest, overtime, shift differentials, and fringe benefits such as vacation and sick pay are among the items which should be included in back pay.\" 494 F.2d at 263.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. In determining the fairness, adequacy, and reasonableness of a proposed settlement, neither the trial court nor the appellate court on review should reach ultimate conclusions on the issues of fact and law underlying the dispute. See Cotton v. Hinton, supra, 559 F.2d at 1330. While the trial court must \"undertake an analysis of the facts and law relevant to the proposed compromise, [focusing his inquiry] upon the terms of the settlement,\" id., compromise is the essence of a settlement, and the settlement need not accord the plaintiff class every benefit that might have been gained after full trial. Because a settlement may compromise the rights and interests of class members, the procedural requirements for approving a settlement and the substantive rules governing the exercise of a trial judge's discretion are of crucial importance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Under the terms of the district court's opt-in opt-out procedure, 52% of the subclass ultimately opted out by refusing to cash their checks. 511 subclass members, or 61% of the subclass, objected to the settlement by signing the June 20 objections. This figure, augmented by the 78 subclass members who opted out by refusing to cash their checks but did not sign the June 20 objections to the decree, results in the 70% figure which we consider the most appropriate measure of subclass disapproval in the peculiar circumstances of this case. See footnote 3 supra. We deem it appropriate to consider the 78 subclass members as dissenters whose dissatisfaction with the back pay award should have been considered by the district court for two reasons. First, the district court was aware that a substantial portion of the subclass had not cashed their back pay check at the time of the October 30 hearing, because its November 20 final order extended the deadline for opting into the subclass until December 15, 1975. Equally important, subclass members received no notice that the back pay decree had been reached by settlement or that each subclass member had a right to object to the proposed settlement. Such notice is required by Rule 23(e). See Mandujano v. Basic Vegetable Products, Inc., 541 F.2d 832, 835 (9th Cir. 1976). Thus the district court also should have been aware of the possibility that subclass members other than the 511 who signed the June 20 objections might have expressed dissatisfaction with the decree if, as required by Rule 23, they had been given the opportunity to do so. ACIPCO asserts that the May 21, 1975 letter from the company to all class members then employed by ACIPCO constitutes sufficient Rule 23(e) notice to subclass members of the proposed back pay settlement. The letter, which summarized the May 14 decree, was accompanied by a copy of that degree. The company points to paragraph 15(c) of the May decree, which provides: The Court reserves for later determination the question of whether objections and exceptions [to the back pay award] shall be heard and decided by the Court or shall be referred to a Special Master. (A 78) This sentence, hidden in the middle of a lengthy and complicated decree, does not constitute adequate Rule 23(e) notice. First, the May 21 letter was sent only to class members presently employed by ACIPCO. Thus subclass members who had left the company prior to May 21, 1975 did not receive this notice. Furthermore, the fact that the company's letter was accompanied by a copy of the May decree makes clear that no settlement could have been contemplated, since the settlement at issue was embodied only in the subsequent June 12 judgment. It thus is not surprising that the sentence relied on by ACIPCO utterly fails to inform the subclass of their rights to raise objections to the settlement or of the options that are open to them in connection with the settlement approval proceedings. See Grunin v. International House of Pancakes, 513 F.2d 114 (8th Cir. 1975); Mandujano v. Basic Vegetable Products, Inc., supra, 541 F.2d 835. We stress the failure of subclass members to receive notice of any opportunity to object to the settlement because this fact should have influenced the district judge's perception concerning the degree of dissatisfaction within the subclass. The district judge should have realized that many back pay awardees, particularly those no longer employed by ACIPCO on May 21, 1975, lacked realistic opportunity to sign the June 20 objections to the decree because of the company's failure to send adequate notice. Under the circumstances, we deem it appropriate to treat the 78 subclass members who did not sign the June 20 objections but who later refused to cash their back pay checks as having voiced their objections to the court. We note in passing that even this 70% figure may understate the actual level of dissatisfaction by failing to consider those members of the subclass no longer employed by ACIPCO who received no notification of the appeal and cashed their checks, despite possible dissatisfaction, because they were unaware of any opportunity to voice their dissatisfaction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Here appellants allege that such a conflict of interest in fact did arise when Mr. Adams negotiated his fee simultaneously with his settlement negotiations. Such a course of action, if it indeed occurred, would weigh heavily against the district court's decision to accept the settlement, particularly in light of the widespread disapproval of the settlement among the class. The record, however, does not indicate that such simultaneous negotiations actually took place. The appellants correctly point out that they attempted to question Mr. Adams during the October 1975 hearing concerning the events leading up to the decree. The trial court refused to allow such questioning. In other circumstances, the trial judge's failure to develop a record or make findings of fact on the question of simultaneous negotiations might require a remand for a factual determination. See Cotton v. Hinton, supra, 559 F.2d at 1331; Mandujano v. Basic Vegetable Products, Inc., supra, 541 F.2d at 835-36. In light of our resolution of the other back pay issues, however, we need not rely on the presence or absence of such simultaneous negotiations. Accordingly, such a remand is unnecessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. The class in Cotton was composed of all present and former black employees at the defendant's plant. The court's opinion does not indicate what percentage of this class objected to the consent decree. At one point the court noted that counsel for the objectors purported to represent 187 then-employed black employees. 559 F.2d at 1329. Later the Court observed that counsel \"purported to represent a class comprised of almost 50% of the active employees at U.S. Pipe.\" Id. at 1333. Because the opinion reveals neither the percentage of blacks among the active employees nor the size of the class, we are unable to arrive at any meaningful percentage figure indicating the degree of class dissatisfaction in that case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. We also note that in Cotton there was no allegation that the named plaintiffs objected to the settlement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Our use of this 70% figure as the appropriate measure of dissatisfaction with the settlement among the members of the subclass in no way implies that our result would be different if dissent were measured solely in terms of the 61% of the subclass which formally objected to the settlement by signing the June 20 objections to the decree. We leave open the question of whether, under similar circumstances, the objections of 61% of a back pay subclass would be sufficient to invalidate a settlement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Rule 23(e) provides that notice of a \"proposed dismissal or compromise shall be given to all members of the class in such manner as the court directs.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. We hope that the parties will be able to settle their differences on remand. In their briefs appellants remark that perhaps an agreeable settlement could be worked out if they were given the opportunity to develop the facts through discovery. The district court on remand should consider this possibility for resolving the dispute. Of course, the scope of the discovery to be conducted in each case rests with the sound discretion of the trial judge. Cotton v. Hinton, supra, 559 F.2d at 1333. If the parties are able to reach an agreement on the back pay issue, the district court should provide full Rule 23(e) notice to all subclass members still eligible for back pay whether or not they are presently employed by the defendant. See, e.g., Mandujano v. Basic Vegetable Products, Inc., supra, 541 F.2d at 835-36.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Appellants maintain that the October 30 hearing was called solely for the purpose of developing a record of the proceedings leading to the entry of the court's final order, and that the issue of objections by the class was not to be considered until a second hearing. This second hearing was cancelled by the court after the October 30 hearing was concluded. We will assume for purposes of this discussion that appellants were given a sufficient opportunity to develop objections at the October 30 hearing, although the record is at best equivocal on this point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. The June 12, 1975 final judgment provides that The Court approves as complying with Section 15-D of the Decree dated May 14, 1975, the Company imprinting on the back of its checks used in paying the back pay awarded by this Judgment the words, \"I understand that my endorsement of this check constitutes a release of liability in the form specified in Paragraph 15-D of the Decree dated May 14, 1975,\" and such endorsement shall for all purposes bind the endorser the same as if the endorser had executed a written release containing the terms and provisions expressly set out in said Paragraph 15-D of the Decree of May 14, 1975. Paragraph 15-D of the May 14, 1975 decree states D. It shall be a condition to the receipt of any back pay that the recipient execute a release, in a form to be approved by the Court, of any claims against or liability of the Company, its officers, directors, agents, employees, successors and assigns, resulting from any violation or alleged violation based on race or color, occurring on or before the date of the entry of this Decree, of any equal employment opportunity laws, ordinances, regulations, or orders, including but not limited to Title VII of the Civil Rights Act of 1964 as amended, 42 USC ยง 2000e et seq. the Civil Rights Act of 1866, 42 USC ยง 1981 et seq., and any other applicable federal, state, or local constitutional or statutory provisions, orders or regulations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Footnote 154 followed our discussion of the use of a comparability formula for determining a gross back pay award for the class. We reproduce the footnote in full: In other words, the total award for the entire class would be determined. At that point, individual claims would be calculated on pro rata shares for those workers of similar ability and seniority claiming the same position, possibly eliminating the necessity of deciding which one of many employees would have obtained the position but for the discrimination. Claimants dissatisfied with their portion of the award could be allowed to opt out in order to prove that they were entitled to a larger portion. Cf. Fed.R.Civ.P. 23(d)(2); Protective Committee v. Anderson, 390 U.S. 414, 435, n. 17, 88 S. Ct. 1157, 20 L. Ed. 2d 1 (1968). 494 F.2d at 263 n. 154.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. This requirement is consistent with the policies of Rule 23. When individual claims are asserted in the same action, the class attorney, who is familiar with the facts and the progress of the litigation, will be able to present the claimant's case. If relegated to a new suit, the individual might be unable to obtain counsel to prosecute his action when the amount of individual damages is relatively small. The requirement also conserves judicial resources by ensuring that the same judge who is already familiar with the case will rule on the merits of the individual claim. By obviating the need to bring a new lawsuit, the expense of litigating the new individual claim is reduced. This procedure also commends itself because the individual claim generally will be resolved more quickly. But see Pettway III and IV.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. In Ace Heating \u0026 Plumbing Co. v. Crane Co., 453 F.2d 30 (3rd Cir. 1971), the court read an ambiguous opt-in provision \"to mean that disbursement of the settlement fund would await a final judgment which could not be appealed.\" The court commented that \"[a] serious public policy question would be presented if the notice were construed to require a waiver of the right to appeal as a condition to opting in.\" 453 F.2d at 32. Consent decrees approved in this circuit have also provided that back pay shall become available to eligible employees only upon exhaustion of all appellate proceedings. See, e.g., United States v. United States Steel Corp., 520 F.2d 1043, 1056-57 (5th Cir. 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. We recognize that some or all subclass members might receive a smaller back pay award on remand than their present share of the settlement. The district court is free to consider any reasonable alternative for ensuring that the company is able to collect from awardees who disaffirm their awards the difference between their present award and the amount which may be awarded after further proceedings. For example, awardees could be required to post a bond, in form, substance, and with surety or sureties as required and approved by the court, in order to disaffirm their present award. Of course, each of the 399 awardees who opted into the settlement should be provided notice of their right to disaffirm their award and participate in further back pay proceedings.This notice should fully explain the awardee's rights and the proper procedures for exercising them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. It is, however, within the court's discretion to withhold all payments until a non-appealable order exists. In some situations the defendant may not wish to distribute settlement funds while an appeal is pending. See United States v. United States Steel Corp., supra; Ace Heating \u0026 Plumbing Co. v. Crane Co., supra. Such a provision in the settlement agreement is permissible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. We recognize that where claimants are given the opportunity to opt into a settlement before an appeal can be prosecuted and most of the subclass members choose to do so, the few dissenters who appeal can receive only limited relief even if their appeal succeeds. For example, if 95 members of a 100 member subclass opted into a settlement, the 5 appellants would, as a practical matter, be relegated to individual claims on remand even if they were successful in overturning the settlement on appeal. Where the district court has already provided for the examination of these individual claims through the opt-out device recommended in footnote 154 of Pettway III, the few individual dissenters would be well advised to pursue this remedy before considering an appeal, since the probable result of even a successful appeal would be to require such individual determinations in any event. On the other hand, where the district court does not provide an opt-out device for dissenters, even when the number of dissenters is small the right to appeal is essential. An appellate court which determined that the settlement illegally compromised the rights of the dissenters and was therefore invalid could then remand the case for further proceedings to establish appellants' individual damages. The situation with regard to the viability of appeal changes dramatically, however, when a sizable portion of the class does not opt into the settlement.In such circumstances, if the back pay settlement is held invalid on appeal, a classwide remedy remains a viable alternative on remand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. These subclass members would be entitled to proceed to Stage II if this alternative were utilized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. J. H. Rutter Manufacturing Co. v. NLRB, 473 F.2d 223, 243 (5th Cir. 1973).\u003c/span\u003e\n\n",
    "body_length": 186904,
    "citedas": [
      "576 F.2d 1157"
    ],
    "attorneys": "Robert L. Wiggins, Birmingham, Alabama, for Apellant. Margaret C. Poles, EEOC, Washington, District of Columbia, Lutz A. Prager, Washington, District of Columbia, Amicus Curiae. James R. Forman, Jr., Birmingham, Alabama, for Appellee.",
    "category": [
      "128",
      "243",
      "27",
      "36"
    ],
    "judges": "Goldberg, Ainsworth and Fay, Circuit Judges.",
    "citation_count": 174
  }
}
