{
  "id": "HLhyTmYBTlTomsSBcMV7",
  "document": {
    "title": "State v. DiFrisco",
    "full_title": "STATE OF NEW JERSEY v. ANTHONY DIFRISCO .",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1995-07-26T00:00:00.000Z",
    "docket": "No. A-72 September Term 1994",
    "body": "(This syllabus is not part of the opinion of the Court. It has been prepared by the Office of the Clerk for the convenience of the reader. It has been neither reviewed nor approved by the Supreme Court. Please note that, in the interests of brevity, portions of any opinion may not have been Summarized).\n\nSTATE V. ANTHONY DIFRISCO (A-72-94)\n\nArgued March 28, 1995 -- Decided July 26, 1995\n\nGARIBALDI, J., writing for a majority of the Court.\n\nA jury convicted Anthony DiFrisco of the murder of Edward Potcher, owner of Jack's Pizzeria in Maplewood. Potcher was shot at close range four times in the back of his head and once in the body. DiFrisco confessed to the murder, stating that a man named Anthony Franciotti had paid him $2,500 and had canceled his $500 drug debt for the killing.\n\nIn DiFrisco I, the Supreme Court affirmed DiFrisco's conviction but vacated the death sentence. At the second penalty-phase proceeding, the jury returned a death penalty verdict, finding the aggravating factor of committing murder for pecuniary gain to outweigh the mitigating factors of rendering assistance to the State and the \"catchall\" factor. The Supreme Court affirmed DiFrisco's death sentence on July 27, 1994 (DiFrisco II), deferring proportionality review. This decision addresses the issue whether the imposition of the death sentence on DiFrisco was disproportional.\n\nHELD: DiFrisco has not demonstrated any aberration in the result of his penalty trial. His death sentence is not disproportionate, and accordingly is affirmed.\n\n1. A capital sentence is disproportionate if other defendants with characteristics similar to those of the defendant under review generally receive sentences other than death for committing factually-similar crimes. Proportionality review seeks to ensure that a substantial distinction exists between capitally-sentenced and life-sentenced defendants; to limit capital sentencing to those cases that are most aggravated and in which death sentencing is the expected result; and to promote a rational, consistent, and fair application of the death sentence. The defendant bears the burden of showing disproportionality because the statute speaks in terms of proving that the sentence is disproportionate, not that it is proportionate. (pp. 7-11)\n\n2. The first step in proportionality review is to identify the universe of cases to which the Court compares DiFrisco's case. In 1992, the Legislature amended the statute to limit the proportionality universe to those cases in which a death sentence has actually been imposed. DiFrisco's first conviction, which occurred long before the statute was amended, serves as the genesis of this proceeding. The Court therefore declines to apply the statute as amended to defendant's proportionality review. The Court continues to include within the death-sentenced pool those cases where the defendant's death sentence was reversed on appeal and where the prosecutor chose not to proceed capitally on remand. It also considers the data both including and excluding DiFrisco. (pp. 11-14)\n\n3. The next step is to group the cases according to their comparative levels of blameworthiness. The Court uses two methods to evaluate a defendant's blameworthiness: frequency analysis, in which the Court performs three different statistical tests to gauge a defendant's relative criminal culpability; and the precedent-seeking approach, where the Court engages in traditional case-by-case review comparing similar death-eligible cases. The Court declines the requests of the parties to make various adjustments to the categorization of cases performed by the Administrative Office of the Courts (AOC), and defers generally to the AOC's expertise. (pp. 14-21)\n\n4. Because frequency analysis is statistically based, and because the small sample sizes may undermine statistical reliability. the Court continues to place greater emphasis on the results of the precedent-seeking review. Nevertheless, the results under the frequency analysis show no randomness or aberration in DiFrisco's sentence. (pp. 21-38)\n\n5. The primary inquiry in precedent-seeking review is whether the death sentence is justified in comparison to other similar life-sentenced and death-sentenced defendants. The Court reviews criminal culpability based on defendant's moral blameworthiness, the degree of victimization, and the character of the defendant. In comparing DiFrisco's case to those of other pecuniary motive killers, defendant's culpability is high, and his death sentence is not disproportionate. (pp. 38-71)\n\nDiFrisco's death sentence is not disproportionate, and accordingly is affirmed.\n\nJustice O'HERN, Dissenting, in which JUSTICE HANDLER joins, is of the view that precedent-seeking review discloses that in contract killings, the hirer is usually considered more death-worthy than the hired killer. He does not believe that anything sets DiFrisco's case apart from those where hired killers either were not prosecuted capitally or did not receive a sentence of death.\n\nJUSTICE HANDLER, Dissenting, is of the view that the reasoning by which the Court reaches its result is strained by the fundamental infinities of capital murder jurisprudence generally and proportionality jurisprudence specifically. The defects of the Court's proportionality methodology include: the coding of reversed death sentences as death sentences for purposes of proportionality review; the refusal of the Court to hint at what level of statistical infrequency of imposition of a death sentence might justify a finding of disproportionality under frequency review; and the pervasive ambiguity of precedent-seeking review. He identifies what he considers to be other serious problems with proporionality review as conducted by the court and brought to light by the circumstances of this case.\n\nCHIEF JUSTICE WILENTZ and JUSTICES POLLOCK, STEIN and COLEMAN join in JUSTICE GARIBALDI'S opinion. JUSTICE HANDLER has flied a separate Dissenting opinion. JUSTICE O'HERN has flied a separate Dissenting opinion in which JUSTICE HANDLER joins.\n\nThe opinion of the Court was delivered by GARIBALDI, J.\n\nI\n\nFACTS\n\nThe facts are set forth in detail in DiFrisco I, supra, 118 N.J. at 255-60, and DiFrisco II, supra, 137 N.J. at 448-51. We repeat here only those facts relevant to our proportionality review.\n\nOn August 12, 1986, Edward Potcher, owner of Jack's Pizzeria in Maplewood, was shot at close range four times in the back of his head and once in the body. His unknown assailant escaped undetected, leaving police with no leads in this cold-blooded, execution-style killing.\n\nSeveral months later, on April 1, 1987, New York City police arrested defendant for various traffic violations, car theft, and reckless endangerment. Detective Harry Kukk testified that defendant fled the scene, so that Kukk was unable to overtake him. Later on the same day, acting on a tip, Detective Kukk went to defendant's apartment. He did not arrest DiFrisco that day, but told DiFrisco to turn himself in the next day. DiFrisco did not do so. In the following week, however, DiFrisco kept a scheduled appointment with his probation officer, and it was there that Detective Kukk arrested him. Defendant did not want to go back to jail. Accordingly, he asked Detective Kukk whether he could \"do or say anything that . . . could get [him] out of this situation.\" The detective suggested that it might help his case if he could give some information about a serious crime. Some time later, as recounted by Detective Kukk, DiFrisco asked him:\n\n\"Harry, who is more guilty, the guy who shoots a guy or the guy who pays him to shoot the guy?\n\nI said, \"I have no problem. A guy who pays a guy to shoot the guy.\n\nHe said, \"Are you serious?\"\n\nI said, \"Sure.\"\n\n\"The guy who killed the guy is only an intermediate, only a pawn.\"\n\nHe said, \"Harry, I don't know whether to trust you or not. If I tell you something, you are not going to ram it down me.\"\n\n[DiFrisco I, supra, 118 N.J. at 257.]\n\nThe defendant's confession of murder followed. As part of his confession, defendant told police that a man named Anthony Franciotti had paid him $2,500 and had canceled his $500 drug debt to kill a pizzeria owner in New Jersey.\n\nAt first incredulous of the defendant's story, the New York police officer asked defendant for details. Defendant did not know where the crime had taken place, nor even the name of the victim. He did know that it involved a pizzeria in New Jersey. He said that Franciotti had paid him to do the killing because the pizza-shop owner was about to inform on Franciotti. He said that Franciotti drove him there on the day of the murder. DiFrisco stated that he entered the pizzeria alone and Franciotti waited in the car while the crime took place.\n\nBit by bit, the New York police closed in on the case. They called New Jersey authorities. They found an unsolved murder in Maplewood, Essex County, fitting the description of the murder in respect of time and place. The last links were the details furnished by the defendant that there were five shots from a .32 caliber automatic gun, that a silencer was used, and that the store sold only whole pizza pies, not slices.\n\nWithin hours, the Maplewood Police and Essex County homicide officers arrived at the precinct house in the Bronx. Defendant repeated the story to them and signed a confession to the murder implicating Franciotti. Several days later, while in police custody in New Jersey, defendant was to call Franciotti to link him to the murder. The police intended to tape that conversation. Defendant had consulted with a public defender, who advised him to make the call. At the last moment, defendant refused to call Franciotti. He said that his father counseled against further cooperation with the police without the advice of paid counsel.\n\n[DiFrisco I, supra, 118 N.J. at 258-59.]\n\nDefendant was indicted in Essex County and charged with the capital murder of Edward Potcher. The State served notice of three statutory aggravating factors: \"outrageously or wantonly vile\" murder, N.J.S.A. 2C:11-3c(4)(c); murder for hire, N.J.S.A. 2C:11-3c(4) (d); and murder to escape the detection of another crime, N.J.S.A. 2C:11-3c(4) (f). Defendant pled guilty to capital murder on January 11, 1988, and essentially repeated his confession. Defendant was fully informed by the court of the consequences of such a plea. When asked by the court, \"Was it your intention to kill him [Potcher] at that time?\", defendant replied, \"Yes.\"\n\nDefendant waived his right to a jury trial for the penalty phase, pursuant to N.J.S.A. 2C:11-3c(1). The trial court found two aggravating factors: that defendant had killed for hire, N.J.S.A. 2C:11-3c(4) (d); and that the victim was killed to avoid the detection of another, N.J.S.A. 2C:11-3c(4) (f). The court also found one mitigating factor, that \"defendant rendered substantial assistance to the state in the prosecution of another person for the crime of murder, N.J.S.A. 2C:11-3c(5) (g) Finding that the aggravating factors outweighed the mitigating factors beyond a reasonable doubt, the trial court sentenced defendant to death. On direct appeal, we affirmed defendant's guilt-phase conviction, but reversed his death sentence for lack of any independent corroboration of his testimony, and remanded for a new penalty-phase proceeding. DiFrisco I, supra, 118 N.J. 283.\n\nOn remand, defendant chose to be tried before a jury. After denying his motion for a directed life verdict, the court commenced the penalty-phase trial. The State alleged the same aggravating factors which the prior court had found, that defendant had committed murder for hire and to escape detection for another crime. Defendant alleged several factors in mitigation.\n\nThe jury unanimously found as an aggravating factor that defendant had committed the murder for payment, but only eleven jurors found the second aggravating factor, that defendant had committed the murder to avoid detection for another crime. Hence, the jury rejected that factor. At least one juror found thirteen of the mitigating factors presented. The jury concluded that the unanimously-found aggravating factor outweighed all the mitigating factors beyond a reasonable doubt. In conformance with the jury verdict, the trial court sentenced defendant to death. Two weeks later, the trial court denied defendant's motion to set aside the death sentence in favor of a life sentence.\n\n[DiFrisco II, supra, 137 N.J. at 451.]\n\nWe affirmed defendant's death sentence and acknowledged his request for proportionality review. Id. at 508. We now review his death sentence, and find it not disproportionate.\n\nII\n\nPROPORTIONALITY REVIEW\n\nIn State v. Martini, 139 N.J. 3, 651 A.2d 949 (1994) (Martini II), we reviewed the fundamental principles of proportionality review. In that case, we found that Martini's sentence was not disproportionate. Little has changed in our proportionality review jurisprudence since we decided Martini in December 1994. We therefore simply recapitulate our Discussion regarding the purpose of proportionality review.\n\nProportionality review's principal goal is to determine whether a particular defendant's death sentence is disproportionate. See N.J.S.A. 2C:11-3e. \"A capital sentence is excessive and thus disproportionate if other defendants with characteristics similar to those of the defendant under review generally receive sentences other than death for committing factually-similar crimes in the same jurisdiction. Martini II, supra, 139 N.J. at 20 (citing State v. Bey, 137 N.J. 334, 343, 645 A.2d 685 (1994) (Bey IV) and State v. Marshall, 130 N.J. 109, 131, 613 A.2d 1059 (1992) (Marshall II)); see also Tichnell v. State, 297 Md. 432 n.18, 468 A.2d 1 (1983) (\" death sentence is comparatively excessive if other defendants with similar characteristics generally receive sentences other than death for committing factually similar offenses in the same jurisdiction.\"). We have declined to set a numerical standard to determine at what point defendants \"generally\" receive the death penalty, because such a determination would introduce undesirable arbitrariness into proportionality review. Martini II, supra, 139 N.J. at 20.\n\nThere are two aspects to proportionality review: \"substantive,\" or \"offense-oriented,\" review; and \"procedural,\" or \"offender-oriented,\" review. Marshall II, supra, 130 N.J. at 126. Substantive or offense-oriented review engages traditional Eighth Amendment considerations and looks at the offense to determine whether the punishment imposed is excessive in relation to the crime itself. Martini II, supra, 139 N.J. at 20 (citing Coker v. Georgia, 433 U.S. 584, 592, 97 S. Ct. 2861, 2866, 53 L. Ed. 2d 982, 989 (1977)). To pass constitutional muster on substantive review, \"the magnitude of the punishment imposed must be related to the degree of harm inflicted on the victim.\" Marshall II, supra, 130 N.J. at 129. As we have previously noted, the sentence\n\nmay not be \"grossly out of proportion\" to the degree of harm imposed. Gregg v. Georgia, 428 U.S. 153, 173, 96 S. Ct. 2909, 2925, 49 L. Ed. 2d 859, 875 (1976) (finding that death sentence does not per se violate Eighth Amendment); accord Coker, supra, 433 U.S. at 592, 97 S. Ct. at 2866, 53 L. Ed. 2d at 989 (concluding that death sentence is grossly disproportional and excessive for crime of rape); Marshall II, supra, 130 N.J. at 129 (tracing U.S. Supreme Court's development of substantive review); see Enmund v. Florida, 458 U.S. 782, 787, 801, 102 S. Ct. 3368, 3376, 3378-79, 73 L. Ed. 2d 1140, 1151, 1154 (1982) (finding that Eighth Amendment prohibits capital sentence for defendant who aids and abets felony in course of which murder is committed by others but who does not himself kill, attempt to kill, or intend that killing or use of lethal force take place).\n\n[Martini II, supra, 139 N.J. at 21.]\n\nConversely, procedural or offender-oriented review focuses on the defendant, and not on the crime committed; it presumes that the death penalty is proportional to the offense. Martini II, (supra) , 139 N.J. at 20 (citing Marshall II, supra, 130 N.J. at 126-27; Pulley v. Harris, 465 U.S. 37, 43, 104 S. Ct. 871, 876, 79 L. Ed. 2d 29, 36 (1994)). In such review, the question is \"whether the 'punishment fits the criminal.'\" Marshall II, supra, 130 N.J. at 129. \"This sort of proportionality review. purports to inquire instead whether the [death] penalty is nonetheless unacceptable in a particular case because [it is] disproportionate to the punishment imposed on others convicted of the same crime.\" Pulley, supra, 465 U.S. at 43, 104 S. Ct. at , 79 L. Ed. 2d at 36.\n\nProportionality review is a response to the United States Supreme Court's decision in Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972), which reversed three death sentences, one for murder and two for rape. As Justice Stewart noted, the decision whether to sentence a defendant capitally, if left to the unfettered discretion of a jury, violates the Eighth Amendment because the sentence can be \"wantonly and . . . freakishly imposed.\" Id. at 408 U.S. at 310, 92 S. Ct. at 2762-63, 33 L. Ed. 2d at 390 (Stewart, J. Concurring). Proportionality review, though neither required by the United States Constitution nor the only means capable of rendering capital-punishment schemes constitutional, nevertheless allows this Court to monitor the results of jury discretion and prevent the arbitrary and inconsistent application of the death penalty. Martini II, supra, 139 N.J. at 21 (citing Pulley, supra, 465 U.S. at 43-46, 104 S. Ct. at 876-77, 70 L. Ed. 2d at 36-37).\n\nProcedural proportionality review seeks to \"ensure that a substantial distinction exists between capitally-sentenced and life-sentenced defendants; to limit capital sentencing to those cases that are most aggravated and in which death sentencing is the expected result; and to promote a rational, consistent, and fair application of the death sentence.\" Martini II, supra, 139 N.J. at 22 (citing Marshall II, supra, 130 N.J. at 131). The defendant bears the burden to show disproportionality by establishing that similar defendants who commit factually similar offenses generally receive sentences other than death. Bey IV, supra, 137 N.J. at 343. That burden is imposed on the defendant, rather than the State, because the Act, N.J.S.A. 2C:11-3e, speaks in terms of proving that the sentence is disproportionate, not proportionate. Id. at 349.\n\nWe emphasize, as we did in Martini II, that proportionality review\n\nis not a \"system of death-sentence validation,\" post at 81, but is instead a vehicle to ensure that the penalty-phase jury's decision is not insupportable. That purpose stems from the mandate of the statutory language itself: \"the Supreme Court * * * shall determine whether the sentence is disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" N.J.S.A. 2C:11-3e. Thus, our search is not for proportionality, but rather one in which our goal is to determine whether the jury's decision to sentence a defendant to death is comparable to decisions reached in the appropriate capital cases in our universe of cases. The question is whether other defendants with similar characteristics generally receive sentences other than death.\n\n[Martini II, supra, 139 N.J. at 22 (citing Marshall II, supra, 130 N.J. at 153).]\n\nA. The Universe of Cases\n\nThe first step in proportionality review is to identify the universe of cases to which we compare defendant's case. In 1992, the Legislature amended N.J.S.A. 2C:11-3e to limit the proportionality universe to only those cases in which a death sentence has actually been imposed. L. 1992 c 5, ยง 1. The Legislature did not state whether the amendment was intended to apply to pending appeals. In Martini II, Bey IV, and Marshall II, we declined to apply that amendment to those appeals, primarily, though not exclusively, because those defendants' appeals were pending before the Legislature enacted the amendment. Likewise, we decline to apply that amendment to this case. DiFrisco's death sentence was first imposed in 1988, two years prior to Martini's sentence; following his direct appeal and this Court's remand for retrial of the penalty-phase, DiFrisco was again sentenced to death in February 1993. Thus, the genesis of this proceeding was defendant's first conviction, which occurred long before the statute was amended. We therefore decline to apply N.J.S.A. 2C:11-3e as amended to defendant's proportionality review.\n\nThe Administrative Office of the Courts (AOC) maintains the data base of homicide cases that this Court uses for proportionality review. The AOC developed its statistics based on the procedure created by Professor David Baldus, the Special Master this Court appointed to develop a model for proportionality review, and on modifications this Court has made through previous proportionality reviews. See, Marshall II, supra, 130 N.J. at 216-18. The universe of cases that we use in this review is compiled in the DiFrisco Report, prepared by the AOC. The report includes cases collected from the effective date of the death-penalty statute in 1983 through August 1994. It contains 309 death-eligible cases, 128 of which went to penalty trial, a rate of forty-one percent. DiFrisco Report, tbl. 3. Of the 128 penalty-trial cases, thirty-eight, or thirty percent, resulted in a death sentence. DiFrisco Report, tbl. 2. The overall death-sentencing rate is twelve percent (38/309). DiFrisco Report, tbl. 1.\n\nB. Method of Classifying Cases\n\nOnce the universe of comparison cases is established, we must sort them in a data base. As we have done in Martini II, Bey IV, and Marshall II, we use two approaches: an a priori approach and an empirical method. In the a priori procedure, we analyze cases based on those factors that experience has shown influenced the decision whether to sentence capitally. Martini II, (supra) , 139 N.J. at 24; Bey IV, supra, 137 N.J. at 345; Marshall II, supra, 130 N.J. at 141-42. In the empirical method we review life-sentenced and death-sentenced cases to identify those characteristics that determine the patterns of life sentencing versus death sentencing. Martini II, supra, 139 N.J. at 24; Marshall II, supra, 130 N.J. at 142-44. The empirical method reveals those factors that prosecutors and juries find determinative. Martini II, supra, 139 N.J. at 24; Bey IV, Supra, 137 N.J. at 345.\n\nWe have previously noted the difficulty and danger inherent in \"any attempt to define in advance all characteristics of a murder case [to] capture the critical facts of a defendant's case\" because that \"would fail to distinguish between individual defendants.\" Martini II, supra, 139 N.J. at 24 (citation omitted). Every murder case is unique. It is that very uniqueness that requires us to engage in this endeavor, in order to afford capital defendants the full review to which they are entitled. See id. at 25.\n\nIn our earlier proportionality reviews, we determined that the death-sentenced pool will include those cases where the defendant's death sentence was reversed on appeal--due mostly to burden-of-proof errors or Gerald \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e issues--and those cases where the prosecutor chose not to proceed capitally on remand. See Martini II, supra, 139 N.J. at 25-26; Bey IV, supra, 137 N.J. at 345-47; Marshall II, supra, 130 N.J. at 194 n.10. Burden-of-proof and Gerald errors \"affect the procedural fairness of the trial, not the substance of the crime, [and] 'do not necessarily bear on the jury's determination of deathworthiness.'\" Martini II, supra, 139 N.J. at 26 (quoting Bey IV, supra, 137 N.J. at 347); accord Marshall II, supra, 130 N.J. at 169 n.5, 194 n.10. Furthermore, the \"State's decision not to reprosecute a defendant capitally is not necessarily a reflection of that defendant's lack of deathworthiness.\" Id. at 27. For those reasons and the reasons detailed in our earlier opinions, we continue to include such cases in the category of death sentence cases.\n\nAdditionally, we continue to present the data both including and excluding defendant. \"Using two sets of data, one including defendant's case and one excluding it, will give us the broadest picture of societal standards while alerting us to the bias produced by including defendant's case.\" Martini II, supra, 139 N.J. at 28.\n\nIII\n\nCOMPARISON OF CASES\n\nThus far, we have established that the universe of cases on which we will rely are those contained in the DiFrisco Report, and that we will adhere to our prior criteria for coding those cases as either death sentenced or life sentenced. Now we must group those cases according to their comparative levels of blameworthiness. Martini II, supra, 139 N.J. at 28; Bey IV, supra, 137 N.J. at 350. We have previously measured blameworthiness by relying on statutory mitigating and aggravating factors \"as well as nonstatutory factors based on 'objectively verified measures of blameworthiness.'\" Bey IV, supra, 137 N.J. at 350 (quoting Marshall II, supra, 130 N.J. at 152); accord Martini II, supra 139 N.J. at 38.\n\nWe use two methods to evaluate a defendant's blameworthiness: frequency analysis and precedentseeking review. Through both, we determine whether defendant's death sentence is disproportionate compared to similar cases. Marshall II, (supra) , 130 N.J. at 148; Martini II, supra, 139 N.J. at 28. \"Proportionality review seeks to determine only whether a particular death sentence is aberrational, not whether it compares perfectly with other sentences.\" Bey IV, supra, 137 N.J. at 352 (citing Marshall II, supra, 130 N.J. at 131).\n\nIn frequency analysis, we determine the rate of death sentencing in similar cases. This helps to reveal how jurors and prosecutors treat similar cases. Precedent-seeking review engages familiar judicial case-by-case analysis, wherein we compare defendant's case to factually similar cases in order to discern whether defendant is deathworthy vis-a-vis other similarly situated defendants. We then compare the results of the two analyses to determine whether imposition of the death sentence in this instance is disproportionate.\n\nA. Adjustments in Comparison Group\n\nThe AOC, which maintains the data base on which we build our proportionality-review universe, breaks the list of death-eligible defendants into various categories and sub-categories. See DiFrisco Report, tbl. 7. These categories are based on the Special Master's report, which we adopted. See David C. Baldus, Death Penalty Proportionality Review Project, Final Report to the New Jersey Supreme Court (Sept. 24, 1991) (Final Report). There are thirteen basic categories, each of which contains two to seven sub-categories \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe parties to this action have proposed various adjustments to the AOC's categorization, suggesting additions or deletions from defendant's comparison group. We defer generally to the AOC's expertise, and particularly to its unique assignment of defendants to only one comparison category: each case in the universe is assigned to only one comparison category, and within that category, to only one sub-category. Final Report at 81. The AOC has placed DiFrisco in the pecuniary-motive category, contract-killer sub-category. The pecuniary-motive category consists of three sub-categories: contract killers, contract principals, and other pecuniary-motive killers. The pecuniary motive category currently contains fourteen cases for comparison with DiFrisco. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDefendant presented a list of persons whom he would like added to his comparison group. Five of them--Anthony Accetturo, Louis Auricchio, Thomas Ricciardi, Michael Perna, and Michael Taccetta--were convicted of crimes that entailed procuring or carrying out murders on behalf of organized crime families. Some of the organized-crime defendants were convicted of lesser offenses such as conspiracy. We did not include that group for several reasons. First, to be death eligible, a defendant must have committed the murder by his or her own conduct, or, as an accomplice, procured the murder by payment of anything of pecuniary value. N.J.S.A. 2C:11-3c. Three of the five--Michael Taccetta, Anthony Accetturo and Michael Perna--do not satisfy that criteria.\n\nSecond, there appears to be no basis for an allegation that any of those defendants were either paid to commit murder or that they paid another to do so, despite the Dissent's assertions to the contrary. Post at (Handler slip op. at 10-14). The Dissent notes that Ricciardi has been tentatively included in the proportionality universe. Post at (Handler slip op. at 12). We emphasize the word tentatively and note that the AOC has not included Ricciardi in DiFrisco's comparison group. We again defer to the AOC's expertise in this area. Moreover, aggravating factor c(4) (d) is on its face designed to reach only those murders intended to produce a direct financial gain. Murders committed to advance the goals of organized crime families, though to some degree motivated by pecuniary gain, are not the equivalent of murder-for-hire contemplated by the Special Master.\n\nOur final reason for excluding the organized-crime defendants is that, in screening the cases, Special Master Baldus initially excluded all defendants who pled to an offense less serious than aggravated manslaughter, such as conspiracy. Final Report at 3. Also for that reason, we do not include Lazaro Trimino, whose case was excluded from the death-eligible universe, because he pled to a crime less than aggravated manslaughter. Those killers were allowed to plead to lesser offenses because the State lacked sufficient evidence to go forward with murder prosecutions. Cases presenting problems of proof do not, by their life sentences, necessarily establish a determination of lack of deathworthiness. Accordingly, the AOC properly excluded those cases from the proportionality universe.\n\nDefendant sought the exclusion from his comparison group of James Clausell's reversed death sentence. As we observed earlier, (supra) at (slip op. at 13-14), we continue to include such cases because they evidence the jury's determination of deathworthiness. Defendant also sought the inclusion in his comparison group of life-sentenced killers Daniel Nicini and Patrick Lanzel. Because we adhere to the AOC's \"unique assignment\" of each case to a specific category, (supra) at (slip op. at 15-16), we reject that request. The AOC places Nicini in category (E) (2), robbery with particular violence/terror, and Lanzel in category (A) (1), multiple victims. Their motive for killing was not pecuniary; therefore, their comparison with defendant is inappropriate.\n\nDefendant has again raised the issue of intra-case disproportionality, based on the fact that the man he asserts hired him, Anthony Franciotti, has not himself been prosecuted. Justice O'Hern, in his Dissent, likewise voices this objection. Post at (O'Hern slip op. at 9-10). We discussed and dealt with this issue in defendant's two direct appeals. See DiFrisco I, (supra) , 118 N.J. at 260-69 and DiFrisco II, supra, 137 N.J. at 504-05.\n\nEssentially, defendant argues, and Justice O'Hern opines, that it is unfair to prosecute and convict him capitally if his alleged hirer has not even been indicted, let alone tried or convicted. We observed then and reiterate now that the decision not to prosecute Franciotti was an evidentiary one, and does not constitute a determination of Franciotti's deathworthiness. DiFrisco I, supra, 118 N.J. at 269. The only \"evidence\" of Franciotti's involvement in the crime was defendant's confession; the only fact corroborative of defendant's association with Franciotti was that they met while confined to the New York Downstate Correctional Facility in 1984; the record did not \"disclose any further contact between the two after they had been released.\" Id. at 268. The prosecutor probably could have obtained an indictment against Franciotti on the basis of defendant's confession, id. at 262, but that confession could not be used against Franciotti at trial, as it amounted to hearsay. Id. at 264-65. Given that defendant had earlier reneged on his agreement to call Franciotti to obtain incriminating evidence, it appears that the prosecutor was justifiably loath to bargain away DiFrisco's capital sentence in exchange for defendant's \"promise\" to testify against Franciotti. Id. at 269. As we concluded in DiFrisco I:\n\nWe cannot say that it would be arbitrary for a prosecutor to refuse such a bargain in a case like this. In many cases there is much more evidence that links the higher-up to the crime, such as a motive to kill or a known relationship gone bad. None of that was present here.\n\n[Ibid.]\n\nSimply because the co-defendant hirer might have gotten away does not mean that the defendant hit-man in custody should not be prosecuted and punished.\n\nThe State, through the Essex County prosecutor and the Attorney General, opposed five members of defendant's AOC-determined comparison group; opposed defendant's suggested additions; and proposed one addition of its own. We agree with the State on one change: Walter Williams should be deleted from defendant's comparison group. Williams's exclusion is justified on the grounds that the jury rejected the pecuniary-motive aggravating factor at his penalty trial. The State argues that John Martini, whose case is more fully reported in Martini II, supra, 139 N.J. 3, should be included in defendant's comparison group because we included DiFrisco in Martini's comparison group. The AOC has coded Martini's case as (H) (2), kidnapping/abduction with particular violence or terror. DiFrisco Report, tbl. 7. We included DiFrisco in Martini's comparison group because of the exceedingly small number of cases in the (H) (2) category and because of our concern that Martini's crime did not fit squarely within the parameters of the kidnapping/abduction category as a whole. Martini II, supra, 139 N.J. at 34. Because the same dilemma does not confront us here, and because we adhere to the AOC's unique assignment of each case, (supra) at (slip op. at 15-16), we reject the State's request to include Martini in DiFrisco's comparison group. As we have previously commented, a \"capital defendant is not entitled to a perfect universe of identical cases, but instead only the best that we can achieve.\" Martini II, supra, 139 N.J. at 31 (citing Bey IV, supra, 137 N.J. at 352, 362). Defendant's comparison group consists of thirteen cases. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nB. The Frequency Approach\n\nFrequency analysis is divided into three different statistical tests to gauge a defendant's relative criminal culpability: the salient-factors test, the numerical-preponderance-of-aggravating-and-mitigating-factors test, and the index-of-outcomes test. Martini II, supra, 139 N.J. at 29-30; Bey IV, supra, 137 N.J. at 350-51; Marshall II, supra, 130 N.J. at 154. The principal inquiry here is whether the degree of blameworthiness in the present case \"reasonably supports an expectation that such a case will generally result in a death sentence.\" Martini II, supra, 139 N.J. at 30. Frequency analysis helps us to determine whether defendant is in a category that renders him or her more likely than other killers to receive the death penalty. Ibid.\n\nThe sample size of the pools used in frequency analysis remains small. Consequently, because frequency analysis is statistically based, and because the small sample sizes may undermine statistical reliability, we continue to place greater emphasis on the results of the precedent-seeking review. See Martini II, supra, 139 N.J. at 29; Bey IV, supra, 137 N.J. at 351. Nevertheless, that limitation does not diminish the utility of this exercise: frequency analysis is but one tool in our review process. Until such time as the pools available for use in frequency review increase, we will continue to rely more heavily on precedent-seeking review.\n\nA further caveat emerges from our prior proportionality cases. Defendant's predicted frequencies of receiving a death sentence are likely to be low. As we noted above, (supra) at (slip op. at 7-8), we decline to set a level at which defendants \"generally\" receive the death penalty. Frequency analysis values are predictors: they are not answers, but guidelines. Martini II, supra, 139 N.J. at 29. A low predicted value does not mean, ipso facto, that the imposition of the death penalty is disproportionate; it simply means that we must more carefully scrutinize the other aspects of proportionality review. See Marshall II, supra, 130 N.J. at 153-54, 159.\n\nA more complete explanation of the statistical techniques used in the frequency analysis portion of our review appears in Martini II, supra, 139 N.J. at 31-32. We continue to abide by the earlier Conclusion that because the results of our regression analyses are of uncertain reliability, we will use them for comparison and guidance, but \"do not accord them final or determinative weight.\" Ibid. As we stated in Martini II, supra:\n\nEven with the foregoing problems, however, the statistical approach receives our attention because it permits us to distinguish cases by culpability; because it allows us to determine a community consensus, in contrast to the individual assessment of the case-by-case approach; and because it creates a basis for evaluating the fairness of the entire sentencing system. Unlike the precedent-seeking approach, the statistical method provides a means for deciding whether the cases used for comparison are themselves disproportional. Therefore, we use both approaches as complementary techniques.\n\n[139 N.J. at 32.]\n\n1. The Salient-Factors Test\n\nIn the salient-factors test, we compare defendant's sentence to sentences in factually-similar cases in order to measure the relative frequency of defendant's sentence. If the death sentence is imposed often enough in a category of comparable cases, then we feel confident that there exists a societal consensus that death is the appropriate punishment. We base comparability first on the statutory aggravating factors, and then further subdivide the group \"according to circumstances that serve either to aggravate or to mitigate the blameworthiness of the defendants in those cases.\" Martini II, supra, 139 N.J. at 33. Because the salient-factors test compares sentences in cases which are factually similar, we find it the most persuasive of the frequency tests. Bey IV, supra, 137 N.J. at 353; accord Martini II, supra, 139 N.J. at 33; Marshall II, supra, 130 N.J. at 168.\n\nDiFrisco is categorized as a pecuniary gain killer, contract killer sub-category. DiFrisco Report, tbl. 7, group 1(1). Of the nine death-eligible cases in that group, six went to penalty trial, and of those penalty-trial cases, three resulted in death sentences, including defendant's cases. Thus, the death-sentencing rate for all death-eligible contract killers is thirty-three percent, but for those advancing to penalty trial, it is fifty percent. Those figures are significantly higher than the overall death-sentencing rates of twelve percent for all death-eligible killers and thirty percent for all penalty-phase cases, lending further support to our earlier observation that the sub-category of contract-killers is viewed by society as \"significantly blameworthy.\" Marshall II, supra, 130 N.J. at 185.\n\nPlacing this information in tabular form assists in its understanding:\n\nDeath Sentencing Rates for I(1) Contract Killers\n\n[SEE TABLE IN ORIGINAL]\n\n[DiFrisco Report, tbl. 7, group I(1)]\n\nRemoving defendant's case from the group lowers the rates somewhat, but still places the figures within the general overall range of twelve percent for all death-eligible cases and thirty percent for penalty-trial cases.\n\nLooking at the entire pecuniary gain category, as we adjusted it above, (supra) at (slip op. at 15-21), reveals the following rates:\n\nDeath Sentencing Rates for All Pecuniary-Motive Killers\n\n[SEE TABLE IN ORIGINAL]\n\n[DiFrisco Report, tbl. 7, groups I(1), (2), (3), (as adjusted)]\n\nOnce again, those rates equal or exceed the overall rates for all death-eligible and all penalty-phase cases.\n\nBased on the foregoing, we find that the death penalty is imposed on a more frequent basis in the pecuniary-motive killings group, and similarly in the contract-killer subgroup, than in the general death-eligible and penalty-phase universes. Although we decline to set a numerical standard at which defendants generally receive the death penalty, a review of the data in this salient-factors analysis reveals that a significant proportion of defendants in the pecuniary-motive category, and particularly those in the contract-killers sub-category, have received the death penalty.\n\nAccordingly, we conclude that the salient-factors test, the most persuasive of the statistical measures, supports a finding of no disproportionality. As we previously observed, \"contract killers show an extremely high frequency of receiving a death sentence.\" Martini II, supra, 139 N.J. at 35. Nonetheless, the small sample sizes of the groups in this salient-factors test preclude us from investing great weight in those results. They do, however, serve as a check against our findings under the other statistical tests and under the precedent-seeking approach. Ibid. at 38.\n\n2. The Numerical-Preponderance-of-Aggravating-and-Mitigating-Factors Test\n\nIn this test, we compare DiFrisco's case to other cases having the same number of aggravating and mitigating factors. The purpose of this test is to overcome the shortcomings of the salient-factors test, particularly the small sample pools. Yet this test, too, is fraught with uncertainty, a fact that we have recognized in labelling this test \"more problematic\" than the other two statistical methods. See Martini II, supra, 139 N.J. at 38; Marshall II, supra, 130 N.J. at 171. The difficulty with this test is that it assumes that juries weigh each of the aggravating and mitigating factors equally, an assumption that fails to account for the qualitative nature of jury deliberations. In an effort to alleviate that problem, the numerical-preponderance test attempts to weight the statutory factors to account for qualitative determinations.\n\nDefendant's jury found one aggravating factor, c(4) (d), pecuniary gain, and two mitigating factors, c(5) (g), defendant rendered substantial assistance to the State in the prosecution of another person for murder, and c(5) (h), the catchall\" factor. The jury rejected mitigating factors c(5) (a), extreme mental or emotional disturbance, and c(5) (d), impaired as a result of mental disease or defect or intoxication. In frequency analysis we consider only those objective mitigating factors that the jury found. Martini II, supra, 139 N.J. at 38; Bey IV, supra, 137 N.J. at 361. To do otherwise would require that we rework and reweigh all the cases in the universe. Of twenty penalty-trial cases in which the defendant had one aggravating factor and two mitigating factors, four have resulted in death sentences, a rate of twenty percent. DiFrisco Report, tbl. 8. The AOC reports sixty-nine cases in the overall death-eligible universe where one aggravating and two mitigating factors were found, and of those, four resulted in death sentences, a rate of six percent. The figures are as follows:\n\nCases with One Aggravating Factor\n\nand Two Mitigating Factors\n\n[SEE TABLE IN ORIGINAL]\n\n[DiFrisco Report, tbls. 8, 9]\n\nLooking at all cases which had just one aggravating factor, regardless of the mitigating factors, presents the following:\n\nAll Cases with One Aggravating Factor\n\n(regardless of mitigating factors)\n\n[SEE TABLE IN ORIGINAL]\n\n[DiFrisco Report, tbls. 8, 9]\n\nThose figures reveal that the death penalty is imposed less frequently than the overall average when there are one mitigating and two aggravating factors, as well as when there is only one aggravating factor, regardless of the number of mitigating factors. The figures without defendant are slightly lower.\n\nOf those cases in which aggravating factor c(4) (d) (pecuniary motive) was present and which contain one aggravating and two mitigating factors, the death-sentencing rate in all death-eligible cases is twenty percent (1/5) with defendant, but zero percent (0/4) without him. Of those cases going to penalty trial, the capital sentencing rate is thirty-three percent (1/3) with defendant, but zero percent (0/2) without him. Defendant argues that this leads inexorably to the Conclusion that his death sentence is disproportional.\n\nTo this argument, we have two responses. First, the sample size here is extremely small, which, once again, strongly cautions against giving those results much weight. Second, and more important, to defendant's argument that he is the first, or only, defendant with solely the c(4) (d) aggravating factor and two mitigating factors sentenced to death, we state again that \"being the first murderer in a category [to receive a death sentence] does not support a Conclusion of disproportionality.\" Martini II, supra, 139 N.J. at 34; accord Bey IV, supra, 137 N.J. at 349-50; Marshall II, supra, 130 N.J. at 166. Furthermore, defendant's sentencing rate is comparable to the death sentencing rates for other contract killers and other pecuniary gain killers, as demonstrated above in ยง III (B) (1), (supra) at (slip op. at 23-26).\n\nFinally, we present a factor-by-factor analysis of defendant's aggravating and mitigating factors, which confirms the determination that, though some of defendant's figures may be low, his death sentence is not disproportionate.\n\nDeath Sentencing Rates by Aggravating and Mitigating Factors\n\n[SEE TABLE IN ORIGINAL]\n\n[DiFrisco Report, tbl. 10]\n\nThose low figures make us very cautious in determining the disproportionality of defendant's death sentence. The relatively small sample sizes, and the inability of this test, more so than the other statistical tests, \"to account for the qualitative character of jury deliberations,\" Martini II, supra, 139 N.J. at 38, reenforces our determination that we should rely more heavily on the results of the precedent-seeking review.\n\nMoreover, defendant's aggravating-factor-death-sentencing rates of sixty percent at penalty trial and thirty-three percent among all death-eligible cases compares favorably to the recent proportionality review we undertook in Martini. In that case, we found that Martini's aggravating-factor-death-sentencing rates were thirty-seven percent at penalty trial and twenty-three percent for all death-eligible cases exhibiting the c(4) (f) escaping-detection factor. Martini II, supra, 139 N.J. at 40. For the c(4) (g) kidnapping aggravating factor, Martini's rates were thirty-two percent at penalty trial and twelve percent for all death-eligible cases. Ibid. DiFrisco's rates are clearly in line with the Martini proportionality review.\n\n3. Index-of-Outcomes Test\n\nIn order to determine a pattern of capital sentencing, in this approach, we attempt to identify those characteristics that establish the degree of a defendant's blameworthiness. We organize the cases \"according to statistically-relevant measures of culpability, such as the infliction of severe pain or mental suffering on the victim, a contemporaneous sexual assault or robbery, and the commission of prior murder.\" Bey IV, supra, 137 N.J. at 362. This method is an attempted improvement on the numerical-preponderance test, because we try to weight the various statutory and non-statutory factors according to the influence each carries with prosecutors and jurors. The AOC calculates the weight of the factors by performing a multiple-regression analysis on the cases in the proportionality universe. In the index-of-outcomes test, we attempt \"to account for the different weights that juries give the various factors\" in order to \"compare cases that are factually dissimilar but that are nevertheless comparable from the perspective of the defendants' blameworthiness.\" Martini II, supra, 139 N.J. at 42.\n\nIn the DiFrisco Report, the AOC has prepared tables listing the death-sentencing rates measuring a defendant's culpability based on those characteristics that seem important to prosecutors and juries. DiFrisco Report, Technical App. 9 at 1. The tables then break the cases down into five levels of culpability, based on predicted probabilities of a return of a death sentence. Those culpability levels are: level one, less than a twenty percent likelihood of a death sentence being returned; level two, twenty to less-than-forty percent; level three, forty to less-than-sixty percent; level four, sixty to less-than-eighty percent; level five, eighty to one hundred percent. We group the cases to ensure that the groups contain only cases involving similar levels of blameworthiness. Martini II, supra, 139 N.J. at 42-43. From those groups, we derive the actual probabilities of death sentencing for cases in the various levels of culpability. Ibid. As it has in the past, the AOC again urges caution in relying on the results of those regression analyses, given \" the combination of a small number of cases, especially actual death cases, and the relatively large number of factors assessed.\" AOC Memorandum of John McCarthy, Jr., to Stephen W. Townsend re DiFrisco Proportionality Review, at 2 (contained in DiFrisco Report). Therefore, once again, \"we treat the index-of-outcomes findings accordingly.\" Martini II, supra, 139 N.J. at 43. (For ease of understanding, we have placed the figures from this test in tabular form in the attached appendix.)\n\nConsidering both statutory and non-statutory factors in penalty-trial cases, defendant has a predicted probability of receiving a death sentence of seventy-four percent, with a probability range containing a lower limit of twenty-nine percent and an upper limit of ninety-five percent. DiFrisco Report, tbl. 12. (The probability range, or more appropriately, the confidence interval, is delineated by upper and lower limits and is established by a ninety-five percent confidence level. That means that we are ninety-five percent certain that all defendants with characteristics similar to DiFrisco will have a predicted probability of receiving a death sentence between twenty-nine and ninety-five percent; the smaller the confidence interval, the more reliable the predicted probability.)\n\nThe predicted probability of seventy-four percent places DiFrisco in culpability level four. Ibid. The penalty-trial death sentencing rate at that culpability level is fifty-seven percent (4/7). DiFrisco Report, tbl. 11. Cases with predicted rates in the top two culpability levels account for seventy-one percent (27/38) of all death sentences imposed in that category. Ibid.\n\nUnder the same circumstances, Bey's predicted probability of death sentence was eighty-two percent, with a range of thirty-seven percent to ninety-eight percent, placing him in culpability level five, which had a death sentencing rate of eighty-eight percent (23/26). DiFrisco Report, tbls. 11, 12. Similarly, Martini's predicted probability of death was eighty-seven percent, with a range from twenty-eight percent to ninety-nine percent, also placing him in culpability level five, with a death sentencing rate of eighty-eight percent (23/26). Ibid. Marshall's predicted probability of death was sixteen percent, with a range from zero to one hundred percent, putting him in culpability level one, and a death sentencing rate of six percent (4/71). Ibid. DiFrisco's rates are comparable to those of Bey and Martini, and are far higher than Marshall's. Those figures do not demonstrate disproportionality.\n\nConsidering again both statutory and non-statutory factors, but expanding the universe to all death-eligible cases, defendant has a predicted probability of eleven percent, with a range of zero percent at the lower limit and eighty-six percent at the upper limit. DiFrisco Report, tbl. 14. That places defendant in culpability level one. Ibid. The death-sentencing rate in that category is four percent (11/260). DiFrisco Report, tbl. 13. While only four percent of defendants in culpability level one have received the death penalty, it is important to remember that the overall death-sentencing rate is just twelve percent (38/309). Ibid.\n\nAgain, comparing DiFrisco to our previous proportionality candidates, under the same circumstances, his numbers are acceptable. Looking at statutory and non-statutory factors in the death-eligible universe, Bey's predicted probability of death sentence was thirty-eight percent, with a range of seven percent to eighty-four percent, placing him in culpability level two, with a forty-seven percent (8/17) death-sentencing rate. DiFrisco Report, tbls. 13, 14. Martini had a predicted probability of death sentence of six percent, with a range from one percent to thirty-four percent, placing him in culpability level one, with a death-sentencing rate of four percent (11/260). Ibid. Similarly, Marshall's predicted probability of death sentence was seven percent, within a range from zero to ninety-seven percent, placing him in culpability level one with a four percent (11/260) death-sentencing rate. Ibid. While Bey's figures are higher than defendant's, defendant's rates exceed those of Marshall and Martini. Consequently, this analysis does not support a finding of disproportionality.\n\nConsidering only the statutory aggravating and mitigating factors, and limiting ourselves solely to the penalty-trial universe, yields for defendant a predicted probability of death of forty-three percent, with a range from nine percent to eighty-seven percent. DiFrisco Report, tbl. 16. That places defendant in culpability level three, ibid., which has a death-sentencing rate of sixty-one percent (11/18). DiFrisco Report, tbl. 15.\n\nUnder the same circumstances, Bey had a predicted probability of death sentence of fifty-nine percent, within a range from fifteen to ninety-three percent, also putting him in culpability level three. DiFrisco Report, tbls. 15, 16. Martini's probability of death sentence under those conditions is fifteen percent, with a range from three percent to forty-eight percent, while Marshall's probability of death sentence would be ten percent, ranging from zero to one hundred percent. Ibid. This places Marshall and Martini in culpability level one, with a nine percent (6/64) death-sentencing rate. DiFrisco Report, tbl. 15. DiFrisco's probabilities are equal to or greater than the others, not leading us to find any disproportionality.\n\nFinally, we look at defendant's case examining only the statutory factors, but in light of the entire death-eligible universe. DiFrisco had a predicted probability of death of twenty-three percent, with a lower bound of three percent and an upper bound of seventy-six percent. DiFrisco Report, tbl. 17. That places defendant in culpability level two, which has a death-sentencing rate of fifty-two percent (11/21). DiFrisco Report, tbl. 15.\n\nUsing the same parameters, Bey's predicted probability of death sentence is twenty-two percent, with a lower limit of six percent and an upper limit of fifty-seven percent. DiFrisco Report, tbl. 17. Bey would be in culpability level two, like defendant, with a fifty-two percent capital sentence rate. DiFrisco Report, tbl. 15. Martini's predicted probability of death sentence is seven percent, ranging from two to twenty-six percent, thus placing him in culpability level one, which has a death-sentencing rate of five percent (13/264). DiFrisco Report, tbls. 15, 17. Likewise, Marshall's predicted probability of death sentence is fourteen percent, with a range from zero to ninety-three percent, also placing him in culpability level one. Ibid. Under those circumstances, DiFrisco's numbers are all higher than those of Bey, Martini, and Marshall, again undermining any claims of disproportionality.\n\nWe are satisfied that the index-of-outcomes test indicates no disproportionality. As in the previous proportionality review cases, the small sample size of cases with similar levels of blameworthiness and the great ranges in the confidence intervals precludes us from giving great weight to those findings. See Martini II, supra, 139 N.J. at 44-45; Bey IV, supra, 137 N.J. at 364; Marshall II, supra, 130 N.J. at 173-74. Though defendant's predicted probability of death sentence was low under some of the scenarios, they do not evidence disproportionality or any aberration in DiFrisco's case; it simply reminds us that given the present constraints in frequency analysis, we must place greater emphasis on precedent-seeking review.\n\n4. Frequency-Approach Conclusion\n\nCompared to other penalty-trial cases, DiFrisco's case shows predicted probabilities of receiving a death sentence of fourty-four percent under the salient-factors test; twenty percent under the numerical-preponderance test; and, under the index-of-outcomes test, sixty-one percent considering only statutory factors and fifty-seven percent considering statutory and nonstatutory factors. DiFrisco Report, tbl. 19. In comparison to all death-eligible cases, DiFrisco's predicted salient-factors probability is thirty-one percent; his numerical-preponderance predicted probability is six percent; and his index-of-outcomes probability is fifty-two percent considering only statutory factors, and four percent considering both statutory and nonstatutory factors. DiFrisco Report, tbl. 20. Except for the numerical-preponderance test, DiFrisco showed greater predicted probabilities of receiving the death sentence than Martini. Martini II, supra, 139 N.J. 45. Like Martini, DiFrisco's \"results produce no showing of randomness or aberration. Defendant has failed to offer reliable evidence of disproportionality, and we do not find that for cases such as his a sentence other than death is generally imposed.\" Id. at 46 (citing Bey IV, supra, 137 N.J. at 365; Marshall II, supra, 130 N.J. at 174).\n\nC. The Precedent-Seeking Approach\n\nThe second part of proportionality review is the precedent-seeking approach, also called coparative-culpability review. Martini II, supra, 139 N.J. at 46. Here we engage in traditional case-by-case review in which we compare similar death-eligible cases, considering the cases individually. Bey IV, supra, 137 N.J. at 366. As we have previously stated, the lower the overall rates and the reliability of our frequency analysis, the greater the need for precedent-seeking review. See supra at (slip op. at 22); Martini II, supra, 139 N.J. at 46. In that way, precedent-seeking review complements frequency analysis. Bey IV, supra, 137 N.J. at 366.\n\nThis is the Court's fourth proportionality-review case. As we did in the prior three cases, we rely here more heavily on precedent-seeking review than on frequency analysis. Martini II, supra, 139 N.J. at 28-29; Bey IV, supra, 137 N.J. at 350; Marshall II, supra, 130 N.J. at 159. That does not mean we have rendered precedent-seeking review our primary means of proportionality review; it remains a complement to frequency analysis. Yet because we refuse to set an arbitrary numerical standard at which defendants \"generally\" receive the death penalty, (supra) at (slip op. at 7-8), we must give each defendant his or her constitutional due by engaging in an individualized precedent-seeking review. See Marshall II, supra, 130 N.J. at 152-53. We cannot rely exclusively on the results of our frequency analysis. Ibid.\n\nIn precedent-seeking review, we examine defendant's criminal culpability to determine whether it exceeds that of similar life-sentenced defendants and whether it equals or exceeds that of other death-sentenced defendants. Our primary inquiry is whether the death sentence is justified in comparison to other similar life-sentenced and death-sentenced defendants. However, \"statutory proportionality does not require identical verdicts even in closely-similar cases. . . . It merely requires that the defendant was not singled out unfairly for capital punishment.\" Martini II, supra, 139 N.J. at 47 (citing Marshall II, supra, 130 N.J. at 159, 181).\n\n1. Relevant Factors\n\nIn conducting precedent-seeking review, we identify in the comparison group all relevant aggravating and mitigating factors, both statutory and non-statutory, that are \"rooted in traditional sentencing guidelines.\" Marshall II, supra, 130 N.J. at 159 (citing N.J.S.A. 2C:44-1). We divide criminal culpability into three main categories: the first category is defendant's moral blameworthiness; the second category is the degree of victimization; and the third category is the character of the defendant. Martini II, supra, 139 N.J. at 48-49; accord Bey IV, supra, 137 N.J. at 366; Marshall II, supra, 130 N.J. at 155.\n\nWe limit the universe in precedent-seeking review to those cases which we used in frequency analysis. We do this so that the two prongs of proportionality review, frequency analysis and precedent-seeking review, are complementary, and may thus be profitably compared. See Martini II, supra, 139 N.J. at 49; Bey IV, supra, 137 N.J. at 366-67. \"If the case universe varies, the two analyses cannot confirm each other.\" Bey IV, supra, 137 N.J. at 367.\n\nComparison cases are selected from the death-eligible universe based on the aggravating factors present in defendant's case. Martini II, supra, 139 N.J. at 49. We examine both statutory and non-statutory aggravating factors \"to encompass all of the characteristics that affect the blameworthiness or deathworthiness of persons who commit murders.\" Marshall II, supra, 130 N.J. at 158. As in the prior proportionality cases, we evaluate the comparison group based only on objective criteria presented to the jury. Martini II, supra, 139 N.J. at 50; accord Bey IV, supra, 137 N.J. at 368. We consider as well those nonstatutory factors that \"are objective, rooted in traditional sentencing guidelines, were clearly presented to the sentencing jury, and are likely to influence a jury's sentencing decision. Bey IV, supra, 137 N.J. at 368. We again recognize that in finding the catchall mitigating factor, the jury may have been influenced by evidence presented in support of a specific statutory mitigating factor that the jury ultimately rejected. See ibid.\n\nThe relevant factor for determining the proportionality of DiFrisco's death sentence is the statutory factor that he committed the murder for a pecuniary motive. We will therefore consider those cases in the DiFrisco Report in which the defendant committed murder for a pecuniary motive. We will then determine whether DiFrisco's culpability is more akin to that of the life-sentenced defendants or the death-sentenced defendants. As in the past, we will consider \"objective factors that are clearly present in the record and that reflect blameworthiness, victimization, and defendant's character.\" Martini II, supra, 139 N.J. at 50 (citing Bey IV, supra, 137 N.J. at 368-69).\n\n2. Application of Precedent-Seeking Approach\n\nWe begin by identifying the cases which we will use to compare with defendant's case. They consist of those cases that appear in the AOC's tables in which pecuniary motive was the principal aggravating factor. DiFrisco Report, tbl. 7, groups I(1), I(2), I(3). We adjust that group as we did above, (supra) at (slip op. at 15-21), which produces a comparison group of thirteen cases. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e We will compare DiFrisco to those other thirteen defendants \"in the traditional manner of review\" in order to determine if defendant's sentence is aberrational. Martini II, supra, 139 N.J. at 51 (citing Bey IV, supra, 137 N.J. at 369). Nonetheless, \"even closely-similar cases do not require identical verdicts to be proportionate, in light of the different defendants, juries, facts, and legal issues involved.\" Ibid. Different cases, though factually-similar, can have differing results and yet not be disproportionate.\n\nPrecedent-seeking review reveals no disproportionality in DiFrisco's sentence.\n\na. Summaries of Similar Cases\n\nWe base our summaries on published opinions or, if unpublished, on the Discussions of those cases found in the AOC's Detailed Narrative Summaries.\n\ni. Contract Killers\n\nRANDY BURROUGHS\n\nIn 1988, Francis Brand began importuning Randy Burroughs, Brand's long-time high-school friend, to kill Brand's brother Arthur. Arthur was selling drugs out of the family home and was abusing his family. He also sold drugs to another brother, Joey.\n\nBrand promised Burroughs ever-increasing amounts of money for the murder, and also asked at least two other persons to commit the killing. In October 1988, Burroughs agreed to kill Arthur, but was unable to carry out the murder. Later, on July 4, 1989, Burroughs attempted to break up a fight between Arthur and Joey, in the course of which Burroughs and Arthur fought. The next week, on July 11, 1989, at 3:00 a.m., Burroughs, carrying a shotgun, entered the Brands' house through an unlocked door and went into the bedroom where Arthur slept. As Arthur began to rise, Burroughs said, \"You got to stop hurting people,\" and \"you're done.\" He then shot Arthur twice.\n\nBurroughs and Brand met later without discussing payment. That night Burroughs returned to the Brands' home. He told the police, who were present at the crime scene, that he had stopped by only to pick up a hat that he had left there the previous day. Questioned by police the following day, Burroughs admitted to the killing, told police that the shotgun was in his attic, and implicated Brand.\n\nBurroughs was charged with conspiracy, murder, felony murder, burglary, and possession of a weapon for unlawful purposes. He pleaded guilty to murder, and the other charges were dismissed. The court sentenced Burroughs to a thirty-year prison term with thirty years of parole ineligibility.\n\nRandy Burroughs was a high-school graduate, having taken special-education classes. He had held several jobs, but none of them for longer than six months. He was single and had three children by three different women. He had no history of drug abuse, and his record reveals one conviction for terroristic threats, which resulted in a fine.\n\nJAMES D. CLAUSELL\n\nThis case is reported in part as State v. Clausell, 121 N.J. 298, 580 A.2d 221 (1990). The victim, Edward Atwood, filed a complaint in municipal court against his neighbor, Roland Bartlett, for intentional cruelty in failing to provide his dog with water and for leaving excrement in the dog's kennel for excessive periods of time. Bartlett was acquitted of the intentional-cruelty charge, but was fined for failing to keep the dog's kennel clean.\n\nOn August 12, 1984, Atwood was at a basketball game with his grandparents when two men arrived at the door of his house looking for him at 10:45 p.m. Atwood's wife did not recognize the men, and when she told them that Atwood was not at home, they left. Atwood returned with his grandparents shortly after midnight, whereupon the men returned and knocked on the door. When Atwood opened the door, his wife, grandparents, and daughter were close by; his son was sitting at the top of the stairs. The first man, Dwayne Wright, asked for \"Ed,\" to which Atwood replied that they had the wrong guy. \" As Atwood tried to close the door, Wright stepped out of the way and Clausell fired two shots at Atwood from his .357 Magnum handgun. The first shot killed Atwood; the second shot narrowly missed his daughter.\n\nAn anonymous tip identified Clausell and Wright as the killers and Jennifer Schall as the driver of the getaway car. Clausell and Wright were tried together for own-conduct knowing and purposeful murder, conspiracy to commit murder, five counts of aggravated assault, possession of a weapon for an unlawful purpose, and possession of a handgun without a permit. Paul Grant, a friend of Wright, testified that Roland Bartlett's son, Anthony, had approached him about killing someone for $5000. He also testified that Clausell had received a phone call, had stated that they were going to receive $2000 apiece for murdering someone that evening, and had armed himself with a .357 magnum.\n\nSchall, testifying under a grant of immunity, stated that Clausell and Wright had embarked upon an attempt to collect some drug money and perhaps to beat up the debtor. She also testified that she had heard two gunshots, after which the two men had run back to the car and they drove off. She dropped them off at a club allegedly owned by Bartlett, where they expected to be paid.\n\nThe trial court dismissed the conspiracy charge. The jury convicted Clausell of purposeful or knowing murder, finding that he had fired the gun, and also convicted him of three of the five aggravated-assault charges and the two weapons charges. The jury found Wright guilty of the same charges, but because it did not find that he had fired the gun, he was not exposed to capital punishment. Wright received a life term with a thirty-year parole bar for the murder, plus consecutive terms totaling six years and three months on the other charges.\n\nAt the penalty trial for Clausell, the jury found aggravating factor c(4) (b), that Clausell had knowingly or purposely subjected someone other than his victim to a grave risk of death, and c(4) (d), commission of murder for payment. It found mitigating factors c(5) (c), age; c(5) (f), no prior record; and c(5) (h), the catchall factor. It also found that each aggravating factor outweighed the mitigating factors beyond a reasonable doubt. The court sentenced Clausell to death, and also imposed a custodial term for the other convictions.\n\nWe reversed Clausell's death sentence, 121 N.J. 298 (1990), because of a Gerald error. See Gerald, supra, 113 N.J. 40. On remand, defendant was not sentenced capitally.\n\nRoland Bartlett was convicted and sentenced to a life term with a thirty-year parole bar.\n\nJames Clausell was a tenth-grade dropout and daily user of cocaine. After Atwood's murder, but before Clausell's arrest for that murder, Clausell had been arrested for shooting another man in the leg three times. Clausell had suffered a head injury as a child, resulting in severe headaches.\n\nDANNY HARRIS\n\nHarris was prosecuted for his role in the slaying of Rondell Germany. On November 23, 1991, police received a report of a shooting. Upon their arrival, they were directed to a third-floor apartment, where they noticed that the door frame had been damaged. Police entered the apartment and found Georgia Wooten standing in the kitchen. Wooten led the police to a front bedroom, where the victim was lying face down on the floor. Wooten identified the victim as the father of her sister's children. The unconscious victim was transported to the hospital, where he died later that day. The autopsy revealed that the victim died as a result of a penetrating gunshot wound to the chest, with injuries to the lungs and heart.\n\nPolice interviewed Wooten, who told them that Germany had stopped by and asked if he could come upstairs and speak to her sister. As Germany had assaulted her sister a few days earlier, Wooten refused to let him speak to her. According to Wooten, Germany became angry and said, \"I'm not going to kill her, I'm just going to bust up her shit.\" He and Wooten then argued for approximately forty minutes.\n\nEventually, another resident left the building and allowed Germany to enter. Wooten met Germany on the second floor landing, and they spoke for about fifteen minutes more. According to Wooten, she then noticed a man with a handgun standing on the second floor landing. Wooten yelled \"Don't shoot me!\" and fled. Just before she entered her apartment, she heard a gunshot. Moments later, she heard Germany yelling for her to let him into the apartment. He then forcibly entered the apartment, where he collapsed on the front bedroom floor.\n\nPolice also spoke to a witness who said he could identify the person who had shot Germany. This witness told police that he had heard the doorbell ring, so he went downstairs to see who was there. When he opened the door, a male wearing a gray hooded sweatshirt asked for Germany. The witness told the man that Germany was upstairs. As the man went upstairs, the witness called out to Germany and told him that the man in the sweatshirt was looking for him. Germany looked down and then returned to his conversation with Wooten. The male then pulled out a long-barrelled handgun and pointed it at Germany, who said \"What's up?\" The male then shot Germany and fled.\n\nDuring the ensuing investigation, police obtained a tape recording in which a male and a female were talking about Germany's murder and about how much money would be supplied to the shooter to get him out of town. Wooten's sister identified the female voice as that of Wooten and the male voice as that of her nephew, Walter Wilson. Police read Wooten her rights, and she immediately implicated Wilson as also being involved in Germany's death.\n\nOn November 25, 1991, a witness reported to the police station. He told police that on the day of the incident he had spoken to Danny Harris, who also went by the name of Tarique, at a local barbershop. Harris told the witness that he was being paid to shoot someone that day. Later that day, the witness learned that Germany had been shot and killed and that Harris was the person who had shot him. The witness identified a photo of Harris as being that of the person who had claimed that he was being paid to shoot someone on November 23, 1991. A bench warrant was issued for Harris's arrest, and he was apprehended on December 27, 1991.\n\nHarris was charged with conspiracy to commit murder, capital murder, unlawful possession of a weapon, and possession of a weapon for an unlawful purpose. The State served a notice of factors, alleging that the c(4) (d) aggravating factor, murder for payment, was present. Harris alleged mitigating factors c(5) (a), extreme mental or emotional disturbance; c(5) (b), the victim solicited, participated in, or consented to the conduct which resulted in his death; c(5) (d), mental disease or defect or intoxication; c(5) (h), the catchall factor, under which Harris asserted thirteen separate factors, including that he suffers from organic brain damage, has learning disabilities and developmental disorders, and had a history of alcohol and drug abuse. On October 28, 1993, the jury convicted defendant of all charges. At the penalty phase, the jury found aggravating factor c(4) (d) and mitigating factors c(5) (d) and c(5) (h). The jury found that the aggravating factor did not outweigh the mitigating factors beyond a reasonable doubt. Consequently, the trial court sentenced Harris to thirty years without parole, with a concurrent four-year term for unlawful possession of a weapon. The other convictions were merged for sentencing purposes.\n\nAt the time of the offense, Harris was thirty-one years old and lived with his mother. He was divorced and the father of four children by three different women. Harris dropped out of high school after completing tenth grade. He was self-employed as a home repairman and had also worked as a welder in the past. Harris takes medication daily for headaches resulting from a 1981 motorcycle accident. He admits abusing alcohol in the past and claims that he was intoxicated at the time of the offense. Harris denies the use of narcotics. He has a prior conviction for possession of controlled dangerous substances.\n\nRICHARD IRIZARRY\n\nThis case is reported at State v. Irizarry, 271 N.J. Super. 577, 639 A.2d 305 (App. Div. 1994). Irizarry was charged with capital murder and other lesser offenses for his part in the February 7, 1990, killing of Angel Laboy. On March 2, 1990, Irizarry provided a statement to police, in which he asserted that on February 7, 1990, he was approached by Julius Boeglin, who told Irizarry that he wanted Laboy killed because Laboy was talking too much about Boeglin's drug business, and because he owed Boeglin $1,800. Boeglin offered defendant $1,000 to perform the killing.\n\nBoeglin, his girlfriend, and Irizarry drove to a pizzeria where, while they were sitting in the car, Boeglin pointed Laboy out to Irizarry. Boeglin gave Irizarry a gun and told him to \"get him now.\" Irizarry stated that, before he hesitantly got out of the car, Boeglin, with another gun in his hand, told Irizarry that he would be watching him. Irizarry asserted: \"The way [Boeglin] told me, he made me feel like he was gonna shoot me.\"\n\nIrizarry got out of the car and called out Laboy's name. Laboy turned and, when he saw what Irizarry was about to do, told Irizarry that Boeglin would kill him as well. At that point, Irizarry stated that he pulled the gun out from his coat pocket and shot Laboy five or six times.\n\nShortly thereafter, the police received a call concerning a homicide. Upon their arrival, they observed Laboy, a twenty-eight year old male, lying on the sidewalk, covered with blood. Taken to a local hospital, Laboy died from a massive internal hemorrhage resulting from four gunshot wounds to the chest.\n\nDuring the ensuing investigation, police learned that Laboy had been dealing drugs for Boeglin, and that he owed Boeglin approximately $1,800. The police also learned that on January 12, 1990, Boeglin had been arrested at his place of business for possession of controlled dangerous substance. Boeglin suspected that Laboy had set him up and, consequently, had threatened to kill Laboy. In addition, about two weeks prior to his death, Laboy had been attacked by three men and was cut on his throat.\n\nOn February 27, 1990, a witness contacted the police, stating that he had information about Laboy's murder and that his life was in danger. The witness turned informant and, on March 1 and 2, 1990, secretly recorded his conversations with Irizarry, Boeglin, and another witness. The tapes of those conversations were later ruled inadmissible. Nevertheless, on March 2, 1990, police obtained arrest warrants for Irizarry and Boeglin. Police arrested Irizarry at his home. They also picked up a second witness, who admitted to \"getting rid of a gun\" for Irizarry by throwing it in a river. The second witness also told police where they could find Boeglin. Police later arrested Boeglin and his girlfriend at Boeglin's apartment. Police also towed Boeglin's girlfriend's car, because it matched the description of the car used in Laboy's murder.\n\nIrizarry was charged with conspiracy to commit murder, capital murder, retaliation against a witness, unlawful possession of a weapon, and possession of a weapon for an unlawful purpose. Irizarry volunteered to testify against Boeglin. The State reiterated its intention to prosecute Irizarry capitally, but agreed that his testifying against Boeglin could be used to establish mitigating factor c(5) (g), assistance to the State, should Irizarry be convicted of capital murder. Boeglin was convicted of non-capital murder.\n\nAfter Boeglin's trial, Irizarry's counsel sought to negotiate a plea on Irizarry's behalf based upon his cooperation with the State. The negotiations were unsuccessful, and as a result a dispute arose over whether the prosecutor's office had improperly used Irizarry's immunized testimony against Boeglin in its preparations for Irizarry's trial. The Appellate Division determined that the prosecutor's office would not be disqualified in toto because some of its members were familiar with the Boeglin trial and were potential defense witnesses in a penalty-phase hearing. Irizarry, supra, 271 N.J. Super. 577 Twenty-two days later, on March 22, 1994, Irizarry pled guilty to aggravated manslaughter, and was sentenced to a term of forty years imprisonment, with a twenty-year parole bar.\n\nAt the time of the offense, Irizarry was twenty-six years old and lived with his mother. He was divorced from his wife and was the father of two children. Irizarry dropped out of school in the tenth grade, and at the time of the offense was employed as a cabinet maker. Irizarry claims to have been addicted to \"hits\" since the age of twelve. He apparently attended Alcoholics and Narcotics Anonymous meetings while incarcerated in the past. Irizarry has prior convictions for robbery, resisting arrest, possession of stolen property, criminal trespass, and unlawful use of a vehicle. He was on parole at the time of the offense.\n\nMIGUEL MELENDEZ\n\nMelendez came to the United States from Cuba in 1980, fleeing criminal convictions and military service there. He lived for a time with Lazaro Trimino. Trimino had contacts with Pedro Gerome, who offered Trimino $5,000 and a vacation in Miami if Trimino killed or hired someone to kill a certain person in Jersey City. Trimino hired someone, and Gerome gave that person a gun, but the person was arrested for possessing the gun before the plan could be carried out. Trimino then asked Melendez, who agreed to perform the killing as proof of his friendship with Trimino. Trimino instructed Melendez to wait in the victim's apartment building and, to confirm the victim's identity, to inquire about a car that the victim was selling.\n\nAs the victim returned from shopping with his ten-year-old daughter, Melendez approached him and asked in Spanish about the car. The victim replied that he had already sold the car. Melendez then asked him for money. Replying that he had none, the victim walked away. The daughter then heard two shots and turned to see her father fall to the ground. He was later pronounced dead. When police arrived at the scene, the daughter gave them a description of Melendez. A former political prisoner in Cuba and the head of a club of such former prisoners, the victim was survived by his wife and two daughters.\n\nThrough information provided by an informant, police were able to tape a telephone conversation in which Melendez admitted having been paid for killing someone in Jersey City. When arrested, Melendez waived his rights and gave a statement in which he acknowledged that he had committed the killing, after which he and Trimino had fled to Puerto Rico. Melendez and Trimino were charged with conspiracy to commit murder, purposeful and unlawful murder, possession of a handgun for unlawful purposes, and unlawful possession of a handgun. A jury convicted Melendez on all counts. At the penalty trial, the jury found aggravating factor c(4) (d), murder for pecuniary gain. Though the defendant asserted mitigating factors c (5) (a), extreme mental or emotional disturbance; c(5) (d), mental disease, defect or intoxication; c (5) (g), assistance to the State; and c (5) (h), the catchall factor, the jury only found c(5) (g) and c(5) (h).\n\nThe jury was unable to agree on the weighing of the aggravating and mitigating factors; consequently, the trial court sentenced Melendez to life imprisonment with a thirty-year parole bar. The court merged the conspiracy conviction into the murder conviction, gave Melendez a consecutive ten-year sentence with a three-and-one-half-year disqualifier for possession of a weapon for an unlawful purpose, and merged the unlawful-possession conviction into the possession-for-an-unlawful-purpose conviction.\n\nMICHAEL ROSE\n\nMichael Rose met Zoran Cveticanin, who wanted his stepmother, Kathryn, killed to prevent her from inheriting the estate of her husband, Zoran's father, Vlado. Zoran also convinced fifteen-year-old Edwin Quinton to take part in the scheme. Quinton lived next door to the Glassboro store operated by Vlado and Kathryn. Zoran had talked about having Kathryn killed since the day he and Quinton had met a couple of months before.\n\nAbout a month before the murder, Zoran gave Quinton keys to the store and told Quinton that Rose was going to kill Kathryn. He asked Quinton to lock the door behind Rose and to act as a lookout. On the morning of July 20, 1983, Zoran gave Quinton sixty dollars and told him that the murder was to take place that day. Around noon, Zoran called Quinton from Philadelphia to say that Rose would arrive around 2:00 p.m. Rose met Quinton, told him that he would probably strangle Kathryn, and asked Quinton to enter the store to see if she was alone. Quinton did so, returned, and reported that Kathryn was indeed alone, after which Rose waited about five minutes and then entered the store. Quinton then went home.\n\nInside the store, Rose used two knives, a tackhammer, a stick, a hacksaw, and a sump pump to kill the pregnant Kathryn. He stabbed her eighty-three times and inflicted several blunt-force wounds. When Quinton returned to the store later, he saw the body lying in blood. Thereafter he returned the keys to Zoran. Several days later, Zoran and his sister gave Rose $540 of the promised $1000 and directed him to dispose of his bloodstained clothes.\n\nRose was arrested and charged with purposeful and knowing murder and with conspiracy to commit murder. At trial, he testified in his defense that he had gone to the store only to warn Kathryn that Zoran was going to kill her, whereupon she attacked Rose with a knife. Rose claimed to have killed the victim in self-defense during the course of the ensuing struggle. The State's expert testified that the bloodstains established that when struck, the victim had been backing away from her assailant and that thirty-six to thirty-eight of the eighty-three stab wounds were defensive wounds. A jury convicted Rose on both charges.\n\nAt the penalty trial, the State sought to prove aggravating factors c(4) (c), outrageously wanton or vile murder, and c(4) (d) murder for pecuniary gain. The defense urged mitigating factors c (5) (d), diminished capacity to appreciate wrongfulness; c(5) (e), duress; c(5) (f), no significant prior criminal record; c(5) (g), substantial assistance; and c(5) (h), the catchall factor. The penalty jury found aggravating factor c(4) (c) and mitigating factors c(5) (e), c(5) (f), c(5) (g), and c(5) (h). The verdict sheet wrongly required unanimity of mitigating factors. However, the jury was unable to reach a decision in the weighing process, so the trial court sentenced Rose to life with a thirty-year parole disqualifier for the murder conviction and a consecutive ten-year term with a five-year parole-ineligibility period for the conspiracy conviction.\n\nDefendant, who has an I.Q. of sixty-eight, dropped out of school at the tenth grade to start working. At the time of the murder, he was collecting workers' compensation. He is separated from his common-law wife and has two children. He was a member of his church's choir. He claims to have developed memory loss due to alcohol and cocaine abuse. He also reports physical problems such as dizziness and nosebleeds from being assaulted in prison.\n\nZoran Cveticanin fled with his sister to the former Yugoslavia, where he was convicted of murder and sentenced to thirty years hard labor.\n\nii. Contract Principals\n\nFRANCIS BRAND\n\nFrancis Brand hired Randy Burroughs, whose case is more fully detailed above, (supra) at (slip op. at 42-43). Brand denied any involvement in the killing of his brother, expressed remorse over his death, and claimed that Burroughs had acted solely out of anger over the fight on July 4. A jury convicted Brand of murder and conspiracy to commit murder. The case was not presented as a capital case, although the State could have asserted aggravating factor c(4) (e), procuring murder for payment, and Francis could have presented mitigating factors c(5) (a), extreme mental or emotional disturbance; c(5) (f), no prior record; and c(5) (h), the catchall factor.\n\nBrand had no criminal record. Although he dropped out of high school in the twelfth grade, he later received his diploma. Unemployed at the time of his arrest, he had previously worked sporadically as a janitor. He is single, has no children, no history of drug abuse, and denies any mental illness.\n\nHERBERT AND WILLIAM ENGEL\n\nThis case is reported as State v. Engel, 249 N.J. Super. 336, 592 A.2d 572, (App. Div. 1991), certif. denied, 130 N.J. 393 (1992). The State tried the defendants together, seeking the death penalty. William, married to the victim, Xiomara Engel, suspected his wife of infidelity. He hired a private investigator, who found no evidence of infidelity, but that finding did not overcome William's jealousy. He often confronted his wife with his groundless suspicions, abusing her both verbally and physically.\n\nXiomara's aunt and mother witnessed two beatings, during which William claimed that Xiomara deserved to be killed. The marriage ended in an annulment, but William continued to harass Xiomara and sought to prevent her from obtaining employment to ensure that she did not meet other men. He also began calling Andres Diaz, for whom Xiomara had worked as a secretary and with whom Xiomara had developed a relationship, to pose unwarranted and insinuating questions.\n\nOn December 13, 1984, Xiomara agreed to meet William at his office preparatory to a shopping trip for their daughter's Christmas presents. Dropping off her children and her grandfather at her apartment, she explained to her grandfather, who was to babysit for the children, that she was on her way to meet with William. That evening, William called twice to tell the grandfather that Xiomara had failed to keep the appointment.\n\nAt 8:00 that night, police responded to a burglar alarm at William's place of business. They saw Herbert Engel's car in the parking lot. William Engel responded to the officers' knocks, assured them that everything was in order, and quickly closed the door. Suspicious, the officers remained at the scene. When William reappeared, the officers ordered him to open the door. William, appearing nervous, came outside and shut the door. He answered the officers' questions in an evasive manner, but because the policemen recognized William as the owner of the building, they did not detain him or otherwise pursue the matter.\n\nThe next day, Xiomara's oldest daughter told Xiomara's mother that the victim had never returned, and later that morning William called to say that Xiomara had failed to appear for their shopping trip. When the mother said that she was going to call the police, William suggested that she wait until he could accompany her to the police station that afternoon. When by 11:00 p.m. William had failed to arrive, the mother, accompanied by Diaz, went to the police without William.\n\nAs part of their search for Xiomara, police interviewed William at his home, during which he chain-smoked and appeared very nervous. He repeated his claim that he had not seen the victim on the night of December 13.\n\nOn December 14 South Carolina police discovered a body in a burned station wagon. The license plates had been removed, but police were able to trace the car's ownership to Xiomara and to identify her body through her dental records.\n\nFor reasons not stated in the record, police arrested James McFadden. In return for the State's promise to waive capital prosecution and to recommend that sentences run concurrently, McFadden revealed that Xiomara had been murdered, explained his role in the killing, and implicated both William and Herbert.\n\nIn early December 1984, McFadden had been hired by Herbert as a salesman, although they had never agreed on a salary. Shortly after hiring McFadden, Herbert invited McFadden to meet him at a restaurant, where he introduced William to McFadden as his \"cousin\" and told McFadden that William had a girlfriend who was harassing him. When Herbert said that William would pay $25,000 to have her killed, McFadden did not respond. At Herbert's request, they met again several days later. Herbert repeated the offer, and McFadden agreed to commit the murder. They were to meet at William's warehouse the following Thursday. McFadden arrived, carrying a briefcase in which he had placed a wire cord that he had removed from the back of a refrigerator. When Herbert learned that McFadden was not carrying a gun, he opened his own briefcase to reveal a revolver.\n\nHerbert directed McFadden to strangle the victim when she arrived with William, who was to pretend to turn on the light, after which McFadden was to transport the body to the Engels' grandparents' home in South Carolina. McFadden was told to place the body in a hole and cover it with acid, and to have the car crushed. For purposes of disposing of the body in acid, Herbert gave McFadden a pair of elbow-length, thick rubber gloves. He then gave McFadden $1300 in cash and told him to hide in the bathroom.\n\nWilliam entered with Xiomara. He fumbled with the light switch, claimed that it did not work, and walked past the bathroom to get a flashlight. As Xiomara followed, McFadden jumped out and pulled the cord around her neck. When she fell to the floor, McFadden strangled her. During the four-minute-long ordeal, William watched, smoked a cigarette, and called his former wife a \"bitch.\"\n\nAfter Xiomara expired, McFadden backed her station-wagon into the garage and with William's help threw the body into the car. William went outside while McFadden covered the body. When he returned to the garage, William was nervous and said that the police were outside. After William dealt with the police, McFadden left, driving Xiomara's station-wagon. After picking up an acquaintance, Lewis \"Pee Wee\" Wright, he drove with Wright to South Carolina. Wright, uninformed of the drive's purpose, discovered the body during the trip. On arrival in South Carolina, Wright burned the car, after which the two men celebrated the occasion at a bar.\n\nOn their return to New Jersey, Herbert gave McFadden $5000. When Herbert later discovered that Wright had accompanied McFadden on the trip, he instructed McFadden to kill Wright, paying him another $1000.\n\nAt trial, William and Herbert were convicted of murder and conspiracy to commit murder. The jury found that the defendants had paid to have the murder committed. At the penalty phase, the jury did not find that the aggravating factor c(4) (e), hiring a killer, outweighed mitigating factors c(5) (a), extreme mental or emotional distress, c(5) (e), duress, c(5) (f), no prior criminal record, and c(5) (h), the catchall factor, wherefore the court sentenced them to a life term with a thirty-year period of parole ineligibility.\n\nROBERT MARSHALL\n\nReported as State v. Marshall, supra, 123 N.J. 1 (1991) (Marshall I), proportionality aff'd, 130 N.J. 109 (1992) (Marshall II). Marshall, a fifty-four-year-old insurance agent, began having an extra-marital affair with Sarann Krausharr in June 1983. As early as the following December, the defendant mentioned to Krausharr the prospect of killing his wife, Maria. Although Marshall was wealthy, he lived beyond his means and was indebted to the extent of more than $168,000. He increased the amount of insurance on Maria's life to about $1,400,000, while neglecting his own policies.\n\nMarshall also paid Billy Wayne McKinnon, a former Louisiana sheriff's officer, $5000 to meet him in New Jersey. When they met in Atlantic City on June 18, 1984, Marshall offered McKinnon $65,000 to kill Maria. He promised McKinnon $10,000 in advance and $50,000 from the insurance proceeds. He gave McKinnon $7000 and a picture of Maria, assuring him that he, Marshall, would not be suspected because he was an outstanding citizen. He instructed McKinnon to kill Maria that evening.\n\nMcKinnon did not make an attempt to carry out the murder, but instead returned to Louisiana. After a second meeting on July 19, 1984, ended without an attempt on Maria's life, Marshall offered McKinnon an extra $15,000 if McKinnon would kill Maria before Labor Day. On September 6, 1984, they met again, selected a spot on the Garden State Parkway at which McKinnon would kill Maria, and made plans to make the murder look like a robbery. After spending that evening at Atlantic City with Maria, Marshall drove his car to the Parkway's Oyster Creek picnic area as planned. While Maria lay sleeping in the car, Marshall got out on the pretext of fixing a flat tire. He then allowed himself to be hit on the head as part of the staged robbery. Maria was shot twice in the back and died instantly.\n\nMarshall's telephone records led police to McKinnon, who turned State's evidence. McKinnon identified Larry Thompson, a Louisiana man, as the gunman. The police investigation also disclosed Marshall's financial straits and the life insurance policies that he had taken out on Maria. A jury convicted Marshall of conspiracy to commit murder and of murder by hire. At his penalty trial, the jury found aggravating factor c(4) (e), procuring murder by payment, and mitigating factors c(5) (f), no prior record, and c(5) (h), the catchall factor. Based on the jury's finding that the aggravating factors outweighed the mitigating factors, the trial court sentenced Marshall to death. We affirmed both his conviction and the proportionality of his sentence.\n\nb. Analysis of Defendant's Culpability\n\nAs discussed above, (supra) , at (slip op. at 39), in evaluating a defendant's culpability, we consider a three-part model of criminal culpability that examines first, defendant's moral blameworthiness, second, the degree of victimization, and third, defendant's character. See Martini II, supra, 139 N.J. at 74-75; Bey IV, supra, 137 N.J. at 366; Marshall II, supra, 130 N.J. at 155. We weigh the elements according to the chart set out in Marshall II, supra, 130 N.J. at 155. The Marshall chart's moral blameworthiness elements include motive; premeditation; justification or excuse; mental disease or defect; knowledge of helplessness of victim; knowledge of effects of crime on non-decedent victims; defendant's age or maturity; and defendant's involvement in planning the murder. Ibid.\n\nBased on our comparison, we find DiFrisco's moral blameworthiness fairly high. His motive was purely pecuniary. Defendant lacks any justification or excuse for his crime, such as passion or provocation. He committed the murder simply to earn $2,500 and to cancel a $500 drug debt. The callousness with which he killed another human being, without even thinking twice, weighs strongly against him. While it was DiFrisco's hirer who did the planning, DiFrisco knew of Franciotti's request to kill someone weeks in advance of the actual crime; he had sufficient time to back out. Moreover, though he did not plan out his crime meticulously over a period of days or weeks, he did carefully affix tape to his fingertips while in the pizzeria's bathroom in order to avoid leaving fingerprints.\n\nThe jury unanimously rejected defendant's claims of extreme mental or emotional disturbance, the c(5) (a) factor, as well as his claim that he was unable to appreciate the wrongfulness of his conduct due to significant impairment as the result of mental disease or defect or intoxication, the c(5) (d) factor. Only six jurors found that defendant rendered substantial assistance to the State in the prosecution of another for the crime of murder, the c(5) (g) factor. The jury did, however, within the catchall factor, unanimously find that defendant had a troubled upbringing; that his emotional development was stunted due to early drug use; that he suffered from his father's lack of love, recognition, and attention; that his mother was unable to provide him with the discipline and guidance he needed while growing up; that he could not turn to his two older brothers for guidance and support because they were drug abusers; that he never developed any self-esteem; that he was vulnerable and susceptible to the older Franciotti because he looked up to him as a father figure; that he allowed himself to be manipulated by Franciotti; and that the crime would have remained unsolved if he had not confessed.\n\nFour jurors agreed that his excessive drug use interfered with his ability to make sound judgments; one juror found that defendant was dependent on Franciotti for drugs; and one juror found that defendant was remorseful about killing Potcher. The jury, however, unanimously rejected as a mitigating factor that defendant's motivation in confessing to the murder was remorse.\n\nAlthough initially the AOC had assumed that DiFrisco had committed the murder to enhance his professional reputation with members of organized crime, the record contains no evidence of that fact; we therefore reject that prior characterization and do not consider that a factor in this proportionality review. DiFrisco was twenty-six years old at the time of the offense. Although a young man, he was an adult who should have conformed to the norms of society. As discussed earlier, DiFrisco's role in the planning of the murder was quite limited, but that is the job of a contract killer. As for defendant's knowledge of the helplessness of his victim or the effect of his crime on non-decedent victims, DiFrisco did not know his victim, his victim's name, or even the town in which he killed him. The cold-blooded, perfunctory manner with which DiFrisco murdered Potcher establishes defendant's high moral blameworthiness.\n\nThe second category for consideration is the degree of victimization. The Marshall chart measures this by the level of violence and brutality of the murder and injury to non-decedent victims. DiFrisco's victim was shot four times in the head, nearly ensuring a quick death with minimal suffering. Defendant points out that his victim was shot as he turned away, thus suffering no fear before the killing, but also no possibility of defending himself. The record further reveals that DiFrisco stalled for time, so that the delivery boy could leave the pizzeria, prior to killing Potcher. He argues that this spared the boy the shock of witnessing the murder. Yet we view that fact as sparing DiFrisco from having a witness to the killing. As a killer for hire, defendant's contract was to kill only Potcher. While the degree of victimization is not great, at the end of the day there is still a victim, a man who was murdered in a cold-blooded, execution-style killing.\n\nThe final group of factors in the Marshall chart deals with defendant's character. In this category we look at defendant's prior record; other unrelated acts of violence; cooperation with authorities; remorse; and capacity for rehabilitation. Before his arrest for Potcher's murder, DiFrisco had two adult convictions for burglary and criminal trespass for which he had spent time in prison. Defendant was arrested for this crime while meeting with his probation officer. At the time of his confession, he was under arrest for \"routine street crimes, car theft and reckless endangerment. DiFrisco I, supra, 118 N.J. at 257. Six members of his jury found the c(5) (g) mitigating factor that DiFrisco's confession did provide assistance to the State in solving a previously unsolved murder. However, DiFrisco provided such assistance in an unusual fashion by telling the authorities of the murder to avoid going to jail for car theft and related crimes. In sum, he confessed to help himself. He did not, however, cooperate with the authorities with respect to their investigation of Franciotti. Supra at (slip op. at 19-20).\n\nFor the first time defendant asserts, in this appeal, that his confession was motivated by his remorse over the killing. That assertion is completely at odds with the evidence that DiFrisco confessed to the Potcher murder to avoid going to jail. DiFrisco did not turn himself in after his arrest for car theft. He was arrested a week later when he kept a scheduled appointment with his probation officer. Supra at (slip op. at 3). In support of his argument that he confessed because of remorse, he points to the illogic of confessing to capital murder' to beat reckless endangerment and car theft charges. We, too, are at a loss to explain defendant's thinking when he confessed to the killing of Edward Potcher, yet we are convinced that his confession was not the product of a remorseful conscience but of his failure to appreciate the severity of taking another's life. Similarly convinced was the jury, which unanimously rejected his proffered mitigating circumstance that his confession was motivated by remorse.\n\nFinally, there is little evidence in the record regarding defendant's capacity for rehabilitation. At the time of his crime, DiFrisco was neither the oldest nor the youngest killer whose proportionality we have affirmed, nor was his criminal past extraordinarily greater or lesser than that of other death-sentenced murderers. Overall, we find defendant's character comparable to that of other death-sentenced defendants.\n\nc. Comparison of Similar Cases to Defendant's Case\n\nIn comparing defendant's case to those of the other killers in his comparison group, we find that, overall, defendant's criminal culpability is high, and that his death sentence is not disproportionate. Defendant argues that his case is far more similar to the life-sentenced cases in his comparison group than to the death-sentenced cases, but we reject today that appeal.\n\nWe compare first the contract killers. Like DiFrisco, James Clausell killed his victim for money. Both faced a minor obstacle in the path of their criminal plans: DiFrisco had to wait for the delivery boy to leave, Clausell waited for his victim to return from a basketball game. Neither killer allowed this fact to deter him from the ultimate commission of his crime. Clausell's first jury returned a death verdict despite the fact that he had no prior criminal record. DiFrisco's prior record, though not extensive, demonstrates an inability to conform his actions to society's dictates. DiFrisco is at least as culpable as Clausell, who was initially sentenced to death.\n\nDiFrisco attempts to liken himself to Randy Burroughs, life-sentenced, based on the fact that Burroughs committed murder to assist, and at the behest of, his friend Brand. DiFrisco asserts that he, too, killed in order to help a friend. Burroughs's motive for the killing was not solely pecuniary, but was primarily a desire to rid the family of an abusive and destructive brother. DiFrisco killed a person whom he did not know, \"helping\" his friend eliminate a potential witness to a crime. These motives are not moral equivalents. Moreover, Burroughs aided the police, had no prior record, and committed his crime following months of importuning from his friend Brand, as well as after a fight with his eventual victim.\n\nDanny Harris's jury found that he was suffering from mental disease or defect impairing his mental capacity. Harris presented evidence regarding his organic brain disorder, as well as his learning disabilities and his drug and alcohol abuse. Those considerations distinguish DiFrisco from Harris, particularly because DiFrisco's jury rejected many of the same mitigating factors, and found that the pecuniary gain factor outweighed the mitigating factors beyond a reasonable doubt. Moreover, the evidence indicated that Harris may have been hired simply to \"rough up\" his victim, not to kill him, but that he went too far because of his victim's abusive conduct.\n\nRichard Irizarry was not prosecuted capitally; rather, he volunteered to testify against his hirer, without any promise from the State not to prosecute him capitally. Only after Irizarry testified did the State enter into a non-capital plea agreement. Factually, Irizarry's case presents some evidence of duress, as his hirer had a gun trained on him as he shot his victim. There was evidence of mental disease as well. DiFrisco was neither under duress nor suffering from any mental disease or defect. Moreover, when given an opportunity to implicate his hirer, DiFrisco backed out; his later \"offers\" to cooperate were not made unconditionally, as were Irizarry's, but rather were offered as a quid pro quo for dismissal of the capital charge.\n\nComparison with Melendez is also not helpful to DiFrisco. While Melendez's jury also found the pecuniary-motive aggravating factor and the assistance-to-State and catchall mitigating factors, it did not impose the death penalty. Melendez presented evidence that he was mildly retarded, was abandoned as a child and taken in by Trimino, suffered from organic brain disease, and had been in and out of institutions all his life. Those factors, which were surely prominent in the jurors' minds, clearly distinguish Melendez from DiFrisco.\n\nMichael Rose, whose crime was violent and brutal, was capitally prosecuted, but did not receive the death penalty. Rose's jury rejected the pecuniary-motive aggravating factor, unanimously finding only the wantonly-vile-murder factor. Moreover, the jury found four mitigating factors, including that Rose acted under duress, lacked a prior criminal record, provided substantial assistance to the State, and the catchall factor. Though certainly deathworthy, and probably motivated to some degree by financial reward, the absence of the pecuniary-motive aggravating factor and the presence of the other mitigating factors is sufficient to distinguish Rose's sentencing from DiFrisco's.\n\nTurning to the contract principals, Brand was not capitally prosecuted. He had no pecuniary motive for killing his brother, but only a desire to get rid of a destructive family member. The Engels brothers, though capitally prosecuted as and found to be contract principals, were spared death sentences. In addition to the catchall mitigating factor, their jury found several other mitigating factors: c(5) (a), extreme emotional or mental disturbance; c(5) (e), unusual and substantial duress; and c(5) (f), no prior criminal record. The Engels brothers's crime was not motivated by pecuniary gain. DiFrisco's crime was motivated by money, plain and simple.\n\nMarshall, too, clearly killed his wife for monetary gain. DiFrisco's victim's suffering appears equal to that of Marshall's victim. Both Edward Potcher and Maria Marshall were shot from behind, Potcher in the head, Marshall in the back; each had little or no warning of their impending deaths. It is difficult to determine who is more deserving of the death penalty: Marshall, who killed his wife for money and so he could live with his paramour, or DiFrisco, who killed a total stranger solely for money. Suffice it to say that while Marshall may be more deathworthy than DiFrisco, that does not establish that DiFrisco's sentence is disproportionate.\n\n3. Other Cases\n\nFor the reasons given above, (supra) at (slip op. 15-21), we do not adopt defendant's suggested comparison cases. Nor do we agree with Justice O'Hern's Dissent. Post at (O'Hern slip op.). A close examination of Justice O'Hern's comparison group, which differs from the comparison group we have used, readily discloses \"[w]hat sets DiFrisco's case apart from those hired killers.\" Id. at (O'Hern slip op. at 7). As recognized by the Dissent, id. at (O'Hern slip op. at 3-7), most of those hired killers, unlike DiFrisco, exhibited some form of organic brain disease or mental disorder: Burroughs was mildly retarded; Harris suffered from organic brain damage, learning disabilities, and developmental disorders; Melendez was at least mildly retarded and suffered from organic brain damage; Rose was mildly retarded. Additionally, and significantly, Richard Irizarry, James McFadden, and Billy Wayne McKinnon turned State's evidence and provided substantial assistance in the prosecution and conviction of their hirers. Consequently, we find that in the comparison of defendant's case to similar cases, his death sentence is not disproportionate.\n\nIV\n\nOTHER ARGUMENTS\n\nDefendant argues that New Jersey courts continue to impose the death penalty in a racially discriminatory manner, thus violating his rights under the Eighth and Fourteenth Amendments to the United States Constitution; that because death sentences are not generally imposed for the crime of capital murder, imposing the death penalty upon him violates the Eighth and Fourteenth Amendments to the United States Constitution and Article I, Paragraphs 1 and 12 of the New Jersey Constitution; and that the geographic distribution of capital charging and sentencing decisions reveals that the death penalty is being applied inconsistently, unfairly, and arbitrarily, again in violation of the aforementioned federal and state constitutional provisions. We have previously considered and rejected those arguments, and continue to do so here. See Martini II, supra, 139 N.J. at 79-80; Bey IV, supra, 137 N.J. at 388-96; Marshall II, supra, 130 N.J. at 188-215.\n\nV\n\nConclusion\n\nAs we have noted in the previous proportionality review cases, we recognize that we labor under limitations imposed by the small universe of cases available. Nevertheless, both frequency-analysis and precedent-seeking review support a finding of no disproportionality. Defendant, who bears the burden of proving disproportionality, has not demonstrated any aberration in the result of his penalty trial. Defendant's death sentence is not disproportionate, and accordingly is affirmed.\n\nCHIEF JUSTICE WILENTZ and JUSTICES POLLOCK, STEIN and COLEMAN join in JUSTICE GARIBALDI'S opinion. JUSTICE HANDLER has filed a separate Dissenting opinion. JUSTICE O'HERN has filed a separate Dissenting opinion in which JUSTICE HANDLER joins.\n\nHANDLER, J., Dissenting.\n\nToday, for the fourth time, the Court finds no disproportionality in the death sentence of a capital defendant. The reasoning by which the Court reaches its result is strained, and inevitably so, by the fundamental infirmities of our capital murder jurisprudence generally and our proportionality jurisprudence specifically. I have previously discussed many of the persistent defects of the Court's proportionality methodology. Those defects include the coding of reversed death sentences as death sentences for the purposes of proportionality review, State v. Martini, 139 N.J. 3, 82-90, 651 A.2d 949 (1994) (Martini II) (Handler, J., Dissenting), the refusal of the Court to hint at what level of statistical infrequency of imposition of a death sentence might justify a finding of disproportionality under frequency review, id. at 90-91, and the pervasive ambiguity of precedent-seeking review, id. at 98-106.\n\nThe circumstances of this case bring to light other serious methodological problems with proportionality review as conducted by the Court. One problem concerns the principles by which cases are admitted to, or excluded from, the proportionality universe of cases. A second problem involves the principles governing the selection of cases from the universe for inclusion in a particular defendant's comparison group. Other defects relate to specific techniques the Court employs in its evaluation of the proportionality of death sentences. Taken together, those problems further substantially undermine the reliability of the proportionality review conducted in this case.\n\nThe Court's unsound proportionality review conceals an ultimate judgment that responds simply to considerations that \"are moral and hopelessly subjective and value-laden\" in nature. State v. Marshall, 130 N.J. 109, 265, 613 A.2d 1059 (1992) (Marshall II) (Handler, J., Dissenting). On that subjective, moral level, I find the Court's reasoning unconvincing. The Court gives no satisfactory answer to the arguments advanced by Justice O'Hern in his Dissent, which I therefore join. Because I believe that the proportionality review conducted by the Court suffers from several structural flaws, I write separately in Dissent.\n\nI\n\nWhile in prison in New York, defendant Anthony DiFrisco met Anthony Franciotti, an inmate who became, for defendant, a kind of father-figure. After both men were paroled, defendant renewed his acquaintance with Franciotti, who became a source of drugs as well as a mentor. In July 1986, Franciotti asked defendant if he would be willing to kill somebody. Defendant replied that he would think about it, and in August, when Franciotti raised the subject again, defendant agreed. Franciotti told defendant that the person to be killed was the owner of a pizza parlor in New Jersey who was \"ratting on\" Franciotti and his friends.\n\nOn August 12, 1986, Franciotti drove defendant to Edward Potcher's pizza parlor in Maplewood. Defendant entered the store, ordered a pizza and used the bathroom while waiting for a delivery boy to leave, and then killed Potcher by firing several bullets into the back of his head when Potcher turned away to get defendant a drink. Franciotti paid defendant $2,500 for the killing, and also forgave defendant's $500 drug debt.\n\nIn the six months immediately following the murder, the police discovered no promising leads. Such eyewitnesses as existed were unable to identify the suspect, no likely motive was known, and no fingerprints were found at the scene.\n\nThus the situation remained until April 1, 1987, when defendant was arrested in New York on charges of auto theft and reckless endangerment. Upon being arrested, defendant showed some apprehension about returning to prison. Accordingly, he asked the arresting officer whether he could do or say anything that...could get [himself] out of this situation.\" The officer suggested that defendant give information about a serious crime. Some time later, defendant asked \"who's more guilty or responsible, a guy who does the shooting or a guy who gets paid for shooting?\" Upon being assured that the principal in such situations is the more culpable, defendant confessed to the murder of Potcher. Defendant now claims that it was primarily remorse that moved him to confess, and in support of this he observes that a person who genuinely sought to escape incarceration for car theft could hardly hope to do so by confessing to capital murder.\n\nAfter confessing to the New York police and again to the Maplewood police, defendant was asked to obtain evidence against Franciotti by calling him and engaging him in a taped conversation about the murders. Defendant initially agreed to do so but then changed his mind, allegedly after hearing his father express concern for the safety of the family if defendant should thus further incriminate Franciotti.\n\nAlthough mitigating evidence is as surely relevant to the assessment of proportionality as aggravating evidence, the Court today neglects even to summarize much of the mitigating evidence offered by defendant. At the penalty hearing, defendant presented several different varieties of mitigating evidence.\n\nFirst, he suggested that the circumstances of his confession established his remorse for the crime. The Court declares itself \"convinced that his confession was not the product of a remorseful conscience,\" ante at (slip op. at 67-68), and asserts that defendant made no allegation of remorse until his proportionality review. In fact, as Justice O'Hern notes, post at (slip op. at 9-10), the record does contain evidence of an expression of remorse made at the time of defendant's 1987 confession. The Court also, and admittedly, ante at (slip op. at 67), can give no explanation for why a defendant motivated entirely by self-interest would confess to capital murder to escape six months of imprisonment for car theft. In any case, it is certainly true that defendant's voluntary confession solved for the police a crime that would not probably have been solved without that confession.\n\nSecond, defendant advanced as mitigation the fact that Anthony Franciotti has never been prosecuted for his part in Potcher's murder. Justice O'Hern rightly emphasizes the significance of that fact as tending to establish an intra-case disproportionality. Post at (slip op. at 9-10).\n\nThird, defendant introduced evidence of his family background. Defendant's father was a convicted robber who left the family home for another woman while defendant was still quite young. Thereafter, the family became increasingly dysfunctional and occasionally violent. Both of defendant's older brothers were for many years drug addicts; one of them has since recovered and the other died of an overdose. There were drugs in the house from the time defendant was very young, and he himself first used marijuana at the age of 12 or 13. At about that age, he also dropped out of school. Defendant was addicted to heroin by the age of 17 or 18, and developed a habit that sometimes cost as much as $300 a day. Defendant also claims to have used drugs on the night of the murder, immediately before leaving New York to drive to Maplewood.\n\nThe case was first called to trial in January 1988. At that time, defendant pled guilty to murder and waived his right to a sentencing jury. With the agreement of the prosecution and the court, defendant submitted the issue of sentence to the court, sitting without a jury. Finding two aggravating factors, c(4) (d) and c(4) (f), and only one mitigating factor, c(5) (g), the court sentenced defendant to death. Defendant appealed, and this Court reversed the sentence on the ground of a lack of sufficient extrinsic evidence corroborating defendant's confession. State v. DiFrisco, 118 N.J. 253, 571 A.2d 914 (1990) (DiFrisco I).\n\nThe question of sentence was retried to a jury in February 1993. The jury unanimously found the c(4) (d) (pecuniary gain) aggravating factor, but could not unanimously agree on the existence of the c(4) (f) (murder for the purpose of escaping detection) aggravating factor, as one juror held out against that factor. The jury found two mitigating factors. The c(5) (g) (rendered substantial assistance to the State in the prosecution of another person for murder) mitigating factor was found by six jurors. The c(5) (h) (catchall) mitigating factor was found unanimously. Under the catchall factor, the jury found the following circumstances to be mitigating: defendant's childhood and upbringing (unanimously); defendant suffered from his father's lack of love, recognition, and attention (unanimously); defendant's mother was unable to provide him with the discipline and guidance he needed while growing up (unanimously); defendant could not turn to his two older brothers for guidance and support because they were drug abusers (unanimously); defendant never developed any self-esteem (unanimously); defendant's emotional maturity level was stunted due to his early addiction to drugs (unanimously); defendant's excessive drug abuse affected his ability to make sound judgments (four jurors); defendant was vulnerable and susceptible to the older Franciotti because he looked up to him as a father figure (unanimously); defendant was dependant on Franciotti for drugs (one juror); defendant allowed himself to be manipulated by Franciotti (unanimously); defendant remains remorseful about the crime (one juror); and the crime would have remained unsolved if defendant had not confessed (unanimously).\n\nNevertheless, finding the aggravating factor to outweigh the mitigating factors, the jury sentenced defendant to death. Over the Dissent of Justices Clifford, Handler and Stein, a divided Court affirmed this second sentence. State v. DiFrisco, 137 N.J. 434, 645 A.2d 734 (1994) (DiFrisco II)\n\nII\n\nThe first principle of comparative proportionality review is that it is offender-oriented, and not offense-oriented. State v. Marshall, 130 N.J. 109, 126-27, 613 A.2d 1059 (1992) (Marshall II). Offender-oriented review considers whether, \"when compared to factually similar cases involving the same offense, a defendant's death sentence is excessive.\" Id. at 127. The purpose of comparative proportionality review is \"to ensure that the death penalty is being administered in a rational, non-arbitrary, and evenhanded manner, fairly and with reasonable consistency.\" Id. at 131.\n\nThe touchstone of consistency is founded upon this State's constitutional commitment to prevent the infliction of cruel and unusual punishments, to ensure due process and equal protection of the laws, and to protect the right of enjoying life. N.J. Const., Art. I, paras. 1, 5, 12. \"Any failure to assure evenhandedness and consistency in the sentencing of all capital defendants and any failure to assure comparative proportionality of individual death sentences violates those constitutional principles, and, indeed, fails to honor the constitutional values placed on individual dignity and human life.\" Marshall II, (supra) , 130 N.J. at 235 (Handler, J., Dissenting). If proportionality review is to have any hope of assuring consistency, it must not be made blind to relevant and comparable cases. By endorsing the exclusion of certain cases from the proportionality universe, the Court today undermines whatever capacity a rational proportionality review might have for blocking the encroachment of arbitrariness.\n\nThe first step in the performance of comparative proportionality review thus requires the identification of the relevant universe of comparison cases. Marshall II, (supra) , 130 N.J. at 131. In the previous proportionality reviews, and again today, the Court has employed a universe consisting of death-eligible homicides occurring since the effective date of Capital Murder Act. Id. at 137-41. The Court has so far declined to apply the 1992 amendment by which the Legislature narrowed the universe to contain only death-sentenced cases. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe proportionality review universe, as presently defined, includes every defendant about whom it can fairly be said that his or her sentence reflects a determination of deathworthiness or non-deathworthiness. See Marshall II, (supra) , 130 N.J. at 135 (noting that proportionality review ought reflect both jury and prosecutorial decisions about deathworthiness). Thus, the universe includes only defendants whose crimes render them eligible for the death penalty, and equally it includes among all defendants who committed death-eligible crimes only those whose ultimate sentence did not turn on such extra-culpability considerations as the weakness of the evidence. David C. Baldus, Death Penalty Proportionality Review Project: Final Report to the New Jersey Supreme Court, 6-9 (1991) (hereinafter Final Report).\n\nOnce the universe is defined, the Court proceeds to draw from the universe a comparison group of cases. Marshall II, (supra) , 130 N.J. at 141. The Court applies to the comparison group two varieties of review: the salient-factors method of frequency review, and precedent-seeking review. Id. at 144. The Court further uses two other methods of frequency review that draw not simply on the comparison group, but rather on the proportionality universe as a whole: the preponderance-of-aggravating-and-mitigating-factors test, and the index-of-outcomes test.\n\nToday, defendant seeks to add to the proportionality universe several cases not previously included. Five of these cases belong in what defendant calls the \"executions to further the goals of organized crime\" category. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Two of the defendants in the category, Thomas Ricciardi and Louis Auricchio, killed to advance the ends of the organized crime factions to which they belonged. Michael Taccetta, Michael Perna, and Anthony Accetturo pled guilty to, or were convicted of, charges specifying among other things that they directed Ricciardi to kill his victim.\n\nThe Court cites three reasons for refusing to include any of those defendants in the proportionality universe. Ante at (slip op. at 17-18). The first two reasons advanced both assert a lack of evidence that any of the defendants committed a death-eligible offense. Underlying these objections appears to be a concern that there exists no evidence that the homicides in question were procured by the promise of money. The third reason begins with the observation that \"in screening the cases, Special Master Baldus initially excluded all defendants who pled to an offense less serious than aggravated manslaughter, such as conspiracy.\" Ante at (slip op. at 18). The Court adopts the Special Master's decision to exclude all such cases on the grounds that a prosecutorial decision to accept a plea to a lesser offense demonstrates only problems with the State's evidence, and does not establish the non-deathworthiness of the crime.\n\nUnder the circumstances, I disagree with the Court's reasoning, and therefore would admit the five defendants to the proportionality universe, at least for the purposes of DiFrisco's proportionality review. I believe that the organized-crime defendants are covered by a narrow interpretation of the pecuniary motive and procurement aggravating factors. I further believe that compelling circumstances peculiar to defendant's case warrant the admission of the organized-crime defendants, notwithstanding that some of them were convicted of such non-homicide crimes as racketeering.\n\nAll five of the defendants participated in organized crime. Indictments of the defendants speak of their participation in racketeering enterprises, and allege that the enterprises existed for the purpose of enriching the defendants. Evidence also exists showing that Ricciardi and Auricchio were directed by their respective bosses to commit the killings, and that the killings were ordered to further the goals of the racketeering enterprises. There is some evidence that Ricciardi understood that he was to receive a share in a specific business enterprise as consideration for his crime. Apparently in reliance on that evidence, the Administrative Office of the Courts (AOC) has tentatively included Ricciardi in the proportionality universe. DiFrisco Report, Alternate Tbl. 20. I believe that the pecuniary motive and procurement aggravating factors cover a killing committed by a member of a racketeering enterprise where the enterprise exists for the purpose of enriching its members, the member who commits the killing is ordered to do so by a supervisory member or members, and the killing is in furtherance of the enterprise's activities. I would not, in short, draw a distinction between murders committed by the \"salaried\" operatives of criminal enterprises, and murders committed by independent contractors.\n\nThe Court's second objection to the inclusion of the organized-crime defendants in the proportionality universe relates to the state of the evidence against those defendants. The objection does not apply to Ricciardi and Auricchio, who were convicted of murder and aggravated manslaughter respectively, but does apply to Perna, Taccetta and Accetturo, who were convicted of racketeering and other non-homicide offenses. The record does suggest that the State confronted significant problems of proof in those cases.\n\nI agree that the logic of proportionality review generally requires the exclusion of such cases from the universe, because the non-death sentences imposed in such cases may not reflect considerations of deathworthiness so much as the need to secure a plea bargain or the difficulty of proving a murder in a case where the State's evidence is relatively weak. See Final Report at 3-4 n.3 (recommending that even convictions for crimes less serious than aggravated manslaughter should be admitted to proportionality universe in particular cases if basis of decision is deathworthiness rather than evidentiary considerations). In the organized-crime cases, the weaknesses in the State's evidence existed in part because the defendants either never confessed, or did so only at a plea hearing, after securing a favorable plea bargain.\n\nIn the present case, however, defendant did confess his crime, and did so without first taking care to obtain a favorable plea bargain. In giving the confession, therefore, defendant displayed a lack of sophistication in dealing with the criminal Justice system that distinguishes him from the organized-crime defendants. Moreover, defendant's confession here contributed more to the State's case than merely one more piece of evidence. Indeed, by confessing, defendant solved a crime that his sentencing jury unanimously agreed would not probably ever have been solved if defendant had not confessed.\n\nUnder the circumstances outlined above, I am compelled to reach the following Conclusions. First, Perna, Taccetta, and Accetturo were convicted of non-homicide crimes, and therefore were excluded from the proportionality universe, only because of the weakness of the State's evidence against them. Second, aside from defendant's confession, the State's evidence was, if anything, initially weaker in defendant's case than in the cases of those organized-crime defendants. Third, the State ultimately obtained evidence sufficiently strong to proceed with a capital prosecution of defendant only because defendant confessed, and did so without demanding beforehand any favorable sentencing consideration. Fourth, the fact that defendant offered an unbargained-for confession which solved a murder is, properly viewed, a mitigating circumstance. Certainly, his jury unanimously found it to be such. Fifth, and finally, to exclude the organized-crime defendants from the proportionality universe in these circumstances is to penalize this defendant for actions which, properly viewed, should only serve as mitigating factors.\n\nI therefore cannot join the Court in its decision to exclude the five organized-crime defendants. Finding inadequate both of the Court's reasons for excluding the organized-crime defendants from the proportionality universe, I would admit them for the purpose of this defendant's proportionality review.\n\nIII\n\nOnce the universe of cases is defined, comparative proportionality review next requires the identification of those cases in the universe sufficiently similar to defendant's to warrant inclusion in his comparison group. Martini II, (supra) , 139 N.J. at 24. This step is crucial, because it is on the comparison group that the salient-factors method of frequency review is performed, and on the same comparison group that precedent-seeking review operates. Id. at 49. The preponderance-of-aggravating-and-mitigating-facts test and the index-of-outcomes test, however, do not operate on the comparison group, but rather on the death-eligible universe as a whole.\n\nIn initially constructing the comparison groups, the Court applied both a priori reasoning and empirical analysis to identify the factors sufficiently important and distinctive to merit use in the definition of the comparison groups. Id. at 24. Reasoning from intuition and experience, the Court selects \"features that it determines probably influenced the life/death decision.\" Marshall II, (supra) , 130 N.J. at 141. From the empirical evidence, the Court discovers \"the distinguishing characteristics that appear to present a pattern of life/death decisions. Id. at 144. Using those methods, the Special Master constructed, and the Court adopted, thirteen basic comparison groups, each of which contains between two and seven subcategories. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e DiFrisco is assigned to the comparison group identified as \"Pecuniary Motive without A-H above.\" DiFrisco Report, Tbl. 7A. That comparison group contains three subcategories: contract killers, contract principals, and other pecuniary advantage killers. DiFrisco Report, Tbl. 7. Defendant's case is listed in the contract killer subcategory. The Administrative Office of the Courts (AOC) places a total of 14 cases in the pecuniary motive group. Nine of the fourteen cases are assigned to the contract killer subcategory.\n\nCertain features of the comparison group scheme are distinctive. Mitigating factors, obviously, play no role in the organization of the comparison groups. Also, the groups are constructed in part by reference to the relative aggravating force of the various aggravating factors. Final Report at 81. Thus, \"the order of ranking of the principal salient factors in table 7 was informed in part by the aggravation level of the cases. . . .\" Ibid. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Further, each case in the universe is assigned only to one comparison group, and within that group, to only one subcategory. Final Report at 81. This \"unique assignment\" feature exists by operation of the \"without\" clause which qualifies every comparison group but the first. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe Court today reaffirms the principle of unique assignment. Ante at (slip op. at 16). The Court does so by refusing to add John Martini, Patrick Lanzel, or Daniel Nicini to defendant's comparison group. Ante at (slip op. at 18-19, 21). I join the Court in its refusal to admit Martini to defendant's comparison group. I believe, however, that the Court errs in refusing to admit Lanzel and Nicini. I am convinced that, as applied to exclude those life-sentenced defendants, the principle of unique assignment fatally warps proportionality review, and so cannot be sustained.\n\nIn the Court's scheme of proportionality review, the question of how to form comparison groups is crucial. Precedent-seeking review, on which the Court now relies more heavily than frequency review, ante at (slip op. at 22), operates on the selected comparison group, rather than on the proportionality universe as a whole. Also, the salient-factors method of frequency review, preferred by the Court as the \"most persuasive of the frequency tests,\" ante at (slip op. at 24), operates only on the comparison group. Only the two less-favored methods of frequency review do not draw exclusively from the comparison group.\n\nThe principles applied in the construction of comparison groups determine which cases are collected in a defendant's comparison group. Applying different principles to the problem of constructing a comparison group, thus, a court could collect different cases. Inevitably, because the outcome of his proportionality review depends on who else is included in this defendant's comparison group, both he and the State suggest modifications to the comparison group. In order to reduce the salient-factors test's assessment of the frequency of imposition of death sentences in the comparison group, defendant seeks to add life-sentenced cases to the group, and remove death-sentenced cases. Applying the same logic but with the opposite motivation, the State seeks to add death-sentenced cases such as Martini's to the comparison group, and extract life-sentenced cases. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe facts of Martini's case are reported in State v. Martini, 131 N.J. 176, 619 A.2d 1208 (1993) (Martini I), and again in State v. Martini, 139 N.J. 3, 651 A.2d 949 (1994) (Martini II). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Justice O'Hern, post at (slip op. at 4-5), describes the essential facts of Lanzel's crime. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The facts of Daniel Nicini's crime are summarized in Appendix D of the DiFrisco Retort, and in greater detail in the proportionality review narrative summary. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e All three cases share with DiFrisco one common aggravating circumstance: pecuniary motive. All three cases further contain other aggravating circumstances not present in DiFrisco's case and sufficient to warrant the inclusion of the three defendants in comparison groups higher on the list than defendant's comparison group. Under the unique assignment principle, none therefore belongs in DiFrisco's comparison group. The three cases differ from each other, for the purposes of admission to defendant's comparison group, only in that Martini received a death sentence, while Lanzel and Nicini received life sentences.\n\nThe Court today admits none of the three into defendant's comparison group. Ante at (slip op. at 18-19, 21). The Court excludes each simply because the AOC assigns them to a different comparison group. Ante at (slip op. at 18-19). The Court, however, misconceives the basis of the AOC's exclusion. The AOC does not exclude Lanzel and Nicini because they had no pecuniary motive. Ante at (slip op. at 19). The AOC excludes them despite the fact that they did have a pecuniary motive, simply because they also had other aggravating factors higher on the comparison group list than pecuniary motive. Both defendants for that reason fail the \"without A-H above\" condition on admission to defendant's comparison group, Lanzel because he killed more than one person, and Nicini because his pecuniary motive was expressed through a violent robbery.\n\nUnder the unique assignment principle, all three defendants should be excluded, and no distinction between them is drawn according to the sentence each received. Such exclusions, however, remove from defendant's comparison group cases which share in common with defendant's case the pecuniary motive circumstance. The purpose of a comparison group is to compile cases containing \"similarities relevant to the determination of deathworthiness.\" State v. Bey, 137 N.J. 334, 350, 645 A.2d 685 (1994) (Bey IV). Consequently, the removal from defendant's comparison group of any case containing a similarity as important as pecuniary motive would seem unnecessarily to diminish the reliability of our determination of the deathworthiness of the pecuniary motive circumstance. Certainly, the exclusion of the cases prevents us from learning from the decisions of the jurors or prosecutors who were, in those cases, called upon to assess the deathworthiness of a defendant whose case contained the pecuniary motive circumstance.\n\nIn defense of the unique assignment principle, it may be argued that we can in fact learn little about the deathworthiness of the pecuniary motive circumstance from cases containing, in addition to pecuniary motive, such other significant aggravating circumstances as multiple murder, kidnapping, or extreme violence. In those cases, so the argument goes, the other aggravating circumstances overshadow the pecuniary motive circumstance such that no reliable inference may be drawn about juror or prosecutorial determinations of the deathworthiness of the pecuniary motive circumstance.\n\nThe argument has force in the context of death-sentenced cases such as Martini's. In sentencing Martini to death, his jury had before it evidence of kidnapping and extreme violence or terror, in addition to evidence of pecuniary motive. Would Martini have been sentenced to death if he had not kidnapped nor inflicted extreme violence or terror, and had only had, as an aggravating circumstance, his pecuniary motive? The question cannot be answered, as it may have been the unshared aggravating circumstances that swayed Martini's jury toward the death penalty. Thus, we cannot know what Martini's jury thought about the deathworthiness of the pecuniary motive circumstance standing alone. Therefore, I conclude that the principle of unique assignment is sound insofar as it is applied to keep death-sentenced defendants with surplus aggravating circumstances out of defendant's comparison group.\n\nThe same logic of exclusion justifying the use of the \"unique assignment\" principle does not apply, though, with respect to life-sentenced defendants in more aggravated classifications. In those cases, despite the existence of surplus aggravating circumstances, we do know beyond all doubt what judgment a jury or prosecutor made about the deathworthiness of the pecuniary motive circumstance. Specifically, we know that, in the circumstances of that case, the jury or prosecutor found the pecuniary motive circumstance not to make the case deathworthy.\n\nThe point becomes clear by applying it to the case of Lanzel or Nicini. In Lanzel's case, a determination of non-deathworthiness was made despite the existence of the multiple-murder circumstance, the extreme violence circumstance, and the pecuniary motive circumstance. If a determination of non-deathworthiness was made despite the existence of all three aggravating circumstances, it necessarily follows that a determination of non-deathworthiness attaches to each aggravating circumstance standing alone. In other words, when defendants like Lanzel get a life sentence despite having DiFrisco's aggravating circumstance and despite having additional aggravating circumstances, it follows that the jury (or prosecutor) considered the shared aggravating circumstance to be insufficient to warrant the death penalty in that case. Therefore, to delete Lanzel from DiFrisco's comparison group is to prevent DiFrisco from applying an unmistakable and relevant jury's (or prosecutor's) judgment of the weight of the pecuniary motive circumstance. To treat the life-sentenced Lanzel as incomparable to DiFrisco simply because of Lanzel's extra aggravating factors, therefore, is arbitrary.\n\nIt is no answer to the argument thus far advanced to suggest that Lanzel's and Nicini's life sentences rest on the existence of substantial mitigating circumstances present in their cases and not present in defendant's. That may well in fact be true. But the issue here is only whether Lanzel and Nicini belong in defendant's comparison group, and, as noted above, mitigating factors have no role at all in the formation of the comparison groups. (supra) at (slip op. at 16). The State may invoke any mitigating factors present in Lanzel's and Nicini's case only when, in the course of precedent-seeking review conducted on the cases in defendant's comparison group, the parties debate whether\n\ndefendant's criminal culpability exceeds that of similar life-sentenced defendants and whether it is equal to or greater than that of other death-sentenced defendants, such that the defendant's culpability justifies the capital sentence; or whether [] defendant's culpability is more like that of similar life-sentenced defendants and less than that of death-sentenced defendants, such that the defendant's culpability requires a reduction of sentence to a life term.\n\n[Martini II, (supra) , 139 N.J. at 47.]\n\nI concede that there is a certain lack of symmetry in the determination that life-sentenced cases should be admitted to defendant's comparison group in circumstances in which death-sentenced cases must be excluded. That lack of symmetry is commanded, however, by the logical application of this Court's proportionality-review principles. To admit a death-sentenced defendant such as Martini is to add to the comparison group a case which can provide no useful instruction, because perhaps only the dissimilarities (the kidnapping and infliction of extreme terror) accounted for Martini's death sentence. No inference about the deathworthiness of the similarity, the pecuniary motive, can safely be drawn.\n\nTo exclude a life-sentenced defendant such as Lanzel or Nicini is to commit the opposite error. In such cases, there exists a similarity (pecuniary motive) about which the jury or prosecutor made a determination of an indisputable nature. Because those cases ended in life sentences, a determination of non-deathworthiness attaches to each aggravating circumstance in the case. By putting Lanzel in category A(1) (\"multiple victims with particular violence or terror\"), and by adhering here to the unique assignment principle, the Court bars defendants who share the pecuniary motive circumstance from referencing an incontestable and relevant similarity.\n\nThe effect of the Court's rule is absurd. It allows that death-sentenced defendants whose crimes were not terrible enough to get them into Lanzel's comparison group, but who share with Lanzel a common aggravating circumstance, nevertheless cannot invoke Lanzel's life sentence in support of the disproportionality of their own death sentences. If there were a life-sentenced defendant whose crime was like DiFrisco's in every respect except that the hypothetical defendant killed the delivery boy in addition to the proprietor, the AOC would assign that defendant to the multiple victims comparison group. Under the majority's rule, DiFrisco could not reference such a case in support of the disproportionality of his own death sentence, but surely the life sentence of another defendant distinguishable only by some extra aggravating factor constitutes powerful evidence of inconsistency in the administration of capital punishment, and of the disproportionality of defendant's death sentence.\n\nFor the reasons given above, I conclude that the only fully justifiable Disposition allows the inclusion in defendant's comparison group of life-sentenced defendants such as Nicini and Lanzel, and bars the inclusion of death-sentenced defendants such as Martini. The Court's strict adherence to the unique assignment principle excludes both the life- and death-sentenced cases, at the cost of irrationality in the exclusion of the life-sentenced cases.\n\nIV\n\nOnce the universe of cases and the relevant comparison group are established, the Court proceeds to perform two kinds of review: frequency review and precedent-seeking review. Frequency review aims, by statistical techniques, to discover the frequency with which defendants similar to the defendant in question are sentenced to death. Precedent-seeking review avoids the numerical analysis of frequency review, and instead requires the Court to engage in a \"more traditional case-by-case comparison of similar death-eligible cases.\" Bey IV, (supra) , 137 N.J. at 366. In conducting precedent-seeking review, the Court looks both at statutory aggravating and mitigating factors, and at such nonstatutory aggravating and mitigating factors as reflect \"objective criteria rooted in traditional sentencing guidelines.\" Marshall II, (supra) , 130 N.J. at 159. By these objective factors, the Court searches for evidence of the presence or absence of three elements of criminal culpability: the defendant's moral blameworthiness, the degree of victimization, and the character of the defendant. See, e.g., Bey IV, (supra) , 137 N.J. at 366.\n\nA.\n\nThe first of the three frequency tests, the salient-factors test, operates only on a defendant's comparison group, and not on the proportionality universe as a whole. Supra at (slip op. at 15). The salient-factors test functions by comparing the number of death-sentenced defendants in a comparison group to the number of life-sentenced defendants. In the present case, for the reasons expressed above, (supra) at (slip op. at 8-26), I would add to the pecuniary motive comparison group as defined by the AOC the five organized-crime defendants, Lanzel, and Nicini.\n\nThe pecuniary motive comparison group contains three subcategories: contract killers, contract principals, and other pecuniary advantage killers. DiFrisco's own subcategory contains contract killers. The AOC includes 9 cases in the contract killer subcategory. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e DiFrisco Report, Tbl. 7. Adding Lanzel and the two organized-crime triggermen, I calculate a death sentencing rate of .25 (3/12) including defendant's cases, and .10 (1/10) excluding defendant's own death sentences.\n\nConsidering all three subcategories in the pecuniary motive comparison group, I find that the rate of imposition of death sentences falls. Adding the three organized-crime principals to the four cases assigned by the AOC to the contract principal subcategory yields a total of seven cases. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The third subcategory contains \"other pecuniary advantage\" killers. As modified, the subcategory contains two cases: Walter Williams and Daniel Nicini. The death sentencing rate for the comparison group as a whole is .19 (4/21). Excluding defendant's cases, the rate falls to .11 (2/19).\n\nThe Court today reiterates its view that the salient-factors method is the \"most persuasive\" of the three frequency-review tests. Ante at (slip op. at 24). I cannot join the Court in reposing such confidence in the salient-factors measure, for several reasons. First, I find unjustifiable the practice of coding reversed death sentences as death sentences for the purposes of proportionality review. See, e.g., Martini II, (supra) , 139 N.J. at 82-90 (Handler, J., Dissenting); Marshall II, (supra) , 130 N.J. at 253-57 (Handler, J., Dissenting). In this case, defendant's comparison group contains James Clausell's reversed death sentence, as well as defendant's own reversed death sentence. Second, in the absence of any hint as to what degree of infrequency of imposition of death sentences would support a determination of disproportionality, I find the numbers themselves unedifying. See, e.g., Martini II, (supra) , 139 N.J. at 90-91 (Handler, J., Dissenting).\n\nFinally, I question the Court's preference for a test that takes absolutely no account of mitigating circumstances. As shown above, the comparison groups on which the salient-factors test operates are formed without reference to mitigating circumstances. Supra at (slip op. at 15-16). Some of the comparison groups at least contain subcategories distinguished on the basis of mitigating factors, but defendant's does not. See, e.g., DiFrisco Report, Tbl. 7 (dividing multiple victim comparison group into subcategories according to number of mitigating factors). A consequence of the singular focus on aggravating factors is that every defendant in the comparison group will have, at any given time, an identical salient-factors result, regardless of variations in mitigating circumstances among the cases.\n\nThe salient-factors test, therefore, would fail to recognize, and account for, the existence of any uniquely significant mitigating factor. Thus, a death-sentenced defendant with a mitigating circumstance so powerful that no other defendant with that circumstance had ever been sentenced to death could not, through the salient-factors test, bring the fact to the Court's attention. In the instant case, defendant does have such a compelling mitigating factor. DiFrisco is the only defendant ever sentenced to death in this or any comparison group notwithstanding the existence of the mitigating factor recognizing substantial assistance to the state in the prosecution of another for murder. The salient-factors test operates in this case as a device for concealing that significant mitigating factor. I do not, therefore, find the salient-factors test to be very persuasive.\n\nSome measure of the extent to which the salient-factors test conceals important information becomes apparent upon applying the index-of-outcomes method to the cases in defendant's comparison group. As noted below, (infra) at (slip op. at 35-37), the index-of-outcomes test suffers very significant defects of its own, owing to the small size of the sample on which it conducts its multiple-regression analysis. The index-of-outcomes test does, though, at least attempt to ascertain the weight of various mitigating factors and include its estimation of their weight in the overall assessment of culpability. Defendant's predicted probability of death sentence under the index-of-outcomes methodology is lower than that of most of the other defendants in his subcategory, taking into account both statutory and nonstatutory factors. DiFrisco's predicted probability of death is .11, equal to Burroughs', higher than Rose's (.07) and Irizarry's (.05), but lower than Harris' (.19), Melendez's (.22), Clausell's (.46), and Lanzel's (.87). DiFrisco Retort, Appendix F.\n\nThe second method of frequency review assesses the proportionality of a defendant's case by comparing the number of aggravating and mitigating factors found. Because of the inability of this measure to account for the varied weight individual aggravating and mitigating factors carry, the Court has regarded this as the least persuasive of the frequency methods. Marshall II, (supra) , 130 N.J. at 171. The method, however, has at least the advantage of making some accommodation of both aggravating and mitigating factors.\n\nIn the present case, DiFrisco's jury found one aggravating factor, c(4) (d) (pecuniary gain), and two mitigating factors, c(5) (g) (defendant rendered substantial assistance to the State in the prosecution of another person for murder) and c(5) (h) (catchall). Under the catchall factor, at least one member of the jury found twelve distinct circumstances to mitigate the offense, and seven of these were found unanimously.\n\nThe DiFrisco Report finds that of the twenty penalty-trial cases in which a defendant had two mitigating factors and one aggravating factor, only four produced death sentences. The penalty-trial death sentencing rate, therefore, is .20 (4/20). DiFrisco Report, Table 8. Excluding DiFrisco's own case, the rate drops to .16 (3/19). The AOC finds 69 cases in the death-eligible universe containing one aggravating factor and two mitigating factors. The death-sentencing rate in the death-eligible universe, therefore, is .06 (4/69), or .04 (3/68) excluding DiFrisco's own case. DiFrisco Report, Tbl. 9.\n\nWithin the one aggravator/two mitigator class of defendants, there are three cases involving the c(4) (d) (pecuniary motive) aggravating factor. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Of these, only defendant was sentenced to death, producing a death-sentencing rate of .33 (1/3) with defendant, and of .00 (0/2) excluding defendant. Ignoring the number of mitigating factors, one finds five cases in which the c(4) (d) factor was the sole aggravating factor. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Again, of these only defendant was sentenced to death, producing a death-sentencing rate of .20 (1/5), or .00 (0/4) excluding defendant's own case.\n\nThe overall penalty-trial death sentencing rate for cases with only one aggravating factor is .11 (7/62), and .10 (6/61) excluding DiFrisco. DiFrisco Report, Tbl. 8. In the larger death-eligible universe, the death-sentencing rate for cases with only one aggravating factor is .04 (7/183). DiFrisco Retort, Tbl. 9.\n\nDespite its weaknesses, I conclude that the preponderance-of-aggravating-and-mitigating-circumstances test suggests that defendant's death sentence is disproportional. Only four of the sixty-nine defendants in the death-eligible universe having one aggravating factor and two mitigating factors were sentenced to death. No other defendant has been sentenced to death on the basis of the c(4) (d) pecuniary motive aggravating factor alone. No other defendant has been sentenced to death notwithstanding a finding of the c(5) (g) substantial assistance mitigating factor.\n\nThe third method of frequency review, the index-of-outcomes test, attempts to gauge a defendant's overall criminal culpability by measuring the aggravating and mitigating weight of the various circumstances present in the case. The actual weight of statutory and non-statutory aggravating and mitigating factors is determined by the results of a multiple-regression analysis performed either on all the cases in the proportionality universe, or on the cases in the penalty-trial universe only. Final Report at 92-93. By the index-of-outcomes test, therefore, the Court \"compares cases that are factually dissimilar but that are nevertheless comparable from the perspective of the defendants' blameworthiness.\" Martini II, (supra) , 139 N.J. at 42.\n\nEach case emerges from the analysis with a number expressing its degree of culpability. The cases having a predicted probability of death between .00 and .20 are assigned to \"culpability level 1,\" the cases having a predicted probability of death between .21 and .40 are assigned to \"culpability level 2,\" and so forth. The AOC reminds us that, as in the previous proportionality reviews, \"the combination of a small number of cases, especially actual death cases, and the relatively large number of factors assessed, led to difficulties in estimation of the logistic regression equations.\" AOC Memorandum of John McCarthy, Jr., at 2. Accordingly, the AOC recommends that \"little substantive reliance should be given to this statistic at this time.\" Ibid.\n\nDefendant's standing on the index-of-outcomes measure varies greatly depending on whether one considers the penalty-trial universe or the larger death-eligible universe. In the penalty-trial universe, considering both statutory and non-statutory factors, defendant has a predicted probability of death sentence of .74, with a probability range containing a lower limit of .29 and an upper limit of .95. DiFrisco Report, Tbl. 12. This result places defendant in culpability level 4.\n\nStill considering both statutory and non-statutory factors, but expanding the universe to include all death-eligible cases, one finds that defendant has a predicted death-sentence probability of .11, with an lower limit of .00 and an upper limit of .86. DiFrisco Report, Tbl. 14. This result places him in culpability level 1.\n\nWhen non-statutory factors are excluded from the indexing process, so that only statutory aggravating and mitigating factors remain, defendant falls into two new culpability levels depending on whether one uses the penalty-trial universe or the death-eligible universe. Considering only penalty-trial cases, DiFrisco has a predicted probability of death sentence of .43, with a lower limit of .09 and an upper limit of .87. DiFrisco Report, Tbl. 16. This puts him in culpability level 3.\n\nContinuing only to consider statutory aggravating and mitigating factors, but now expanding the universe to include all death-eligible cases, one finds the following result. Defendant has a predicted probability of death sentence of .23, with a lower limit of .01 and an upper limit of .76. DiFrisco Retort, Tbl. 17. This puts him in culpability level 2.\n\nSeveral significant defects in the index-of-outcomes test preclude me from investing any confidence in it. First, in this case, there exists an extreme variability in the test's result. Defendant belongs anywhere from culpability level 1 to culpability level 4, depending on the parameters of the analysis.\n\nSecond, as the AOC points out, small sample sizes prevent any multi-variate analysis from announcing a statistically reliable result. The problem of statistical unreliability is particularly acute in the penalty-trial universe, because that universe contains fewer than half the number of cases in the already too small death-eligible universe. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThird, I am skeptical of the capacity of any statistical analysis to do Justice to some mitigating factors. Defendant asserts that the AOC's coding system inadequately accounts for the weight of evidence of his childhood neglect. He argues that, owing to the inadequacy of the coding system, if he were the only defendant to be sentenced to death despite compelling evidence of neglect, the AOC coding system and statistics would not bring out that fact.\n\nThe problem lies deeper than the AOC's informationgathering apparatus, however. Much non-statutory mitigating evidence tends to be very idiosyncratic, and so if one defendant presents compelling but unique mitigating evidence, the lack of any record of how juries in other cases have treated such evidence bars the index-of-outcomes test from assessing its weight.\n\nMoreover, even mitigating evidence capable of categorization under such broad rubrics as \"childhood neglect\" may yet prove uncongenial to analysis by the index-of-outcomes test, because the quality of evidence of childhood neglect will vary significantly in different cases. That fact highlights one unresolvable contradiction of our capital-murder jurisprudence. Federal constitutional law requires that a sentencer \"not be precluded from considering as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Lockett v. Ohio, 438 U.S. 586, 604, 98 S. Ct. 2954, 2964, 57 L. Ed. 2d 973, 990 (1978) (emphasis in original). As a result of the rule, courts in capital cases admit such a diversity in quality and type of mitigating evidence as to beggar any attempt, by multi-variate statistical techniques, to discover the weight some kind of mitigating evidence carries with sentencers generally.\n\nFor all these reasons, I have no confidence in the index-of-outcomes test as a tool for the evaluation of the proportionality of defendant's death sentence. Furthermore, insofar as the Court has affirmed the death sentence on proportionality review of a defendant, Robert Marshall, who now falls in culpability level 1 under all four sets of assumptions, and of a defendant, John Martini, who falls in culpability level 1 under three of the four sets of assumptions, it appears that the index-of-outcomes test has not gained the Court's regard in the past. I see no reason why, given its continuing flaws, the test should be relied on in this case.\n\nB.\n\nIn precedent-seeking review, the Court undertakes a \"more traditional case-by-case comparison of similar death-eligible cases.\" Bey IV, (supra) , 137 N.J. at 366. The precise nature of the relationship between precedent-seeking review and frequency review remains mysterious to me, and I find unhelpful the Court's statement that although we rely more heavily on precedent-seeking review, that review is not \"primary,\" but rather remains a \"complement to frequency analysis.\" Ante at (slip op. at 38). In any event, in order to make a case in precedent-seeking review for the disproportionality of a death sentence, a defendant must convince the Court that his or her criminal culpability \"is more like that of similar life-sentenced defendants and less than that of death-sentenced defendants, such that the defendant's culpability requires a reduction of sentence to a life term. \" Martini II, (supra) , 139 N.J. at 47.\n\nThe theory of precedent-seeking review requires the Court first to identify \"all relevant aggravating and mitigating factors, both statutory and non-statutory, that are 'rooted in traditional sentencing guidelines.'\" Id. at 48 (quoting Marshall II, (supra) , 130 N.J. at 159). Three different criteria of criminal culpability exist. First, the Court examines a defendant's moral blameworthiness,\n\nwhich includes elements such as motive; premeditation; justification or excuse, such as provocation; evidence of mental disease, defect, or disturbance; knowledge of the helplessness of the victim; knowledge of the murder's effects on any non-decedent victims; defendant's age and maturity; and defendant's involvement in planning the murder.\n\n[Martini II, (supra) , 139 N.J. at 48-49.]\n\nSecond, the Court considers the \"degree of victimization, which includes the violence and brutality of the murder, and the existence of injury to non-decedent victims.\" Id. at 49. In Bey IV, the Court additionally referred to this criterion as encompassing \"the extent of mutilation of the victim.\" 137 N.J. at 366. Finally, the Court examines \"the character of the defendant, which includes the defendant's prior record and other acts of violence, cooperation with authorities, remorse, and capacity for rehabilitation.\" Ibid.\n\nLooking no farther than the statement of the principles governing precedent-seeking review, one might suppose that the Court has developed a tool that introduces a measure of objectivity and reliability into proportionality review. Today, it becomes apparent once again that the promise is a chimera. See, e.g., Martini II, (supra) , 139 N.J. at 103 (Handler, J., Dissenting) (noting that \"despite its effort at objectivity, the Court's reasoning and Conclusion expose the pervasive subjectivity of its precedent-seeking analysis\"). In the exercise of its own moral sensibility, the Court latches on to the worst aspects of defendant's case and finds in them assurance that his death sentence is not disproportional. Justice O'Hern, in Dissent, identifies other circumstances that tend to show that defendant is no worse than many life-sentenced murderers. I am more persuaded by Justice O'Hern's reasoning than by the majority's.\n\nIn focusing on such facts as defendant's pecuniary motive and his age, the Court is able to state uncontroversial moral principles. See, e.g., ante at (slip op. at 65) (stating that \"although a young man, he was an adult who should have conformed to the norms of society\"); ante at (slip op. at 66) (\"the cold-blooded, perfunctory manner with which DiFrisco murdered Potcher establishes defendant's high moral blameworthiness\"); ante at (slip op. at 66) (\"while the degree of victimization is not great, at the end of the day there is still a victim, a man who was murdered in a cold-blooded, execution-style killing\"). The truistic quality of these statements, in turn, gives a patina of objectivity and certainty to the Court's precedent-seeking review. The problem, though, is that such statements of basic moral principle cannot assist in the task at hand. The Court is correct in stating that defendant should have conformed to the norms of society, and correct also in regarding his crime as cold-blooded. But the same can be said of the crimes of every pecuniary-motive killer in the universe. And proportionality review, if it is to have any purpose, must help us to discern a principled distinction between the defendants who are sentenced to death and the defendants who are not. Thus, in trying to assess the proportionality of a death sentence in light of other sentences imposed on perpetrators of death-eligible murders, we confront not a simple problem of distinguishing right from wrong, but rather the \"insoluble moral conundrums\" attendant upon an effort to distinguish fine degrees of wrong. Marshall II, (supra) , 130 N.J. at 274 (Handler, J., Dissenting).\n\nTo the extent that there is a solution to the moral conundrums raised by a comparison of the cases in defendant's comparison group, that solution calls for a finding of the disproportionality of defendant's death sentence. An examination of a few of the circumstances of this case demonstrates that defendant's culpability is \"more like that of similar life-sentenced defendants and less than that of death-sentenced defendants.\" Martini II, (supra) , 139 N.J. at 47.\n\nOne element of moral blameworthiness focuses on the degree of planning and premeditation shown by the defendant. The State admits, as surely it must, that DiFrisco was not the \"prime mover\" of his crime. The State would diminish the fact, though, with the observation that hitmen in contract-murder cases are never prime movers. In fact, however, the extent of planning undertaken by DiFrisco is less even than that customarily performed by hitmen.\n\nIt is uncontested that Franciotti planned the crime down to the details of choosing the time and arranging for the transportation of defendant to and from the scene. Indeed, when defendant confessed to the police, he was unable to name the town in which the crime had happened or to give the name of the victim. As for premeditation, defendant first learned that Franciotti wanted him to commit a murder a few weeks before the event. And defendant was not told of the specific time of the crime until the day before the event. Among the mitigating circumstances found by the jury relevant to this issue were the facts, found unanimously, that DiFrisco looked up to Franciotti as a father-figure and that DiFrisco allowed himself to be manipulated by Franciotti.\n\nThe death-sentenced defendants in the comparison group displayed considerably greater degrees of planning and premeditation. Marshall busied himself arranging his wife's murder between December 1983 and September 1984. His plan required many and protracted Discussions with the intermediaries who supplied the hitman, and required him to acquire additional insurance policies on his wife's life. See Marshall II, (supra) , 130 N.J. at 121-24. At least two months before the murder, people associated with Clausell were offered money in order to kill the victim. State v. Clausell, 121 N.J. 298, 309, 580 A.2d 221 (1990). And a couple of days before the murder, Clausell arranged his own transportation from Philadelphia to the victim's residence in Willingboro. Id. at 309-10. Upon their arrival, Clausell and his accomplices knocked on the victim's door and discovered that he was not home. They then waited an hour for the victim to arrive. Id. at 307.\n\nMany of the life-sentenced cases also involve more extensive planning and premeditation than is evident in defendant's case. Brand and Burroughs first attempted to kill their victim in October 1988, but did not finally succeed until July 1989. See Martini II, (supra) , 139 N.J. at 59. The Engel brothers thoroughly planned the murder of their victim, down to the detail of disposing the body in South Carolina. Id. at 60-63. Rose knew of the plan to kill his victim at least a month beforehand, id. at 71, and Williams purchased the poison with which he killed his wife six months before she died. Id. at 72-73.\n\nAnother factor assessed in the course of precedent-seeking review involves the degree of victimization inflicted by a defendant. The degree of victimization element of criminal culpability relates to the extent of mutilation, the infliction of suffering on non-decedent victims, and in general, the brutality of the murder. Id. at 49.\n\nDefendant inflicted less victimization than anybody else in the comparison group, and indeed, as little victimization as it is possible for any murderer to cause. The victim was shot as he turned away from defendant, and thus suffered no fear before the killing. The manner of the killing, gunshots to the head, was calculated to cause immediate death, and so it is unlikely that the victim suffered any prolonged pain. The evidence also shows that DiFrisco stalled for time while the delivery boy was present, and only committed the crime after he had left. The stalling thus saved the delivery boy the shock of witnessing the murder of his employer.\n\nThe Court, oddly in my view, discounts defendant's stalling for time as merely sparing DiFrisco from having a witness to the killing.\" Ante at (slip op. at 66). If defendant had truly desired to spare himself the threat of a witness, he would have killed the delivery boy. Indeed, by stalling and allowing the delivery boy to leave, defendant spared the life of a witness who did in fact testify against defendant at his trial.\n\nA fairer reading of the facts establishes that DiFrisco inflicted a degree of victimization no greater than that inflicted by any life-sentenced defendant, and less than that of every death-sentenced defendant. Thus, Clausell, who received first a death sentence and then on remand a life sentence, shot his victim to death in the presence of several members of the victim's family. Clausell, supra, 121 N.J. at 307-08. Marshall arranged to kill his own wife, thus producing a \"shattering impact\" on his three sons and the other surviving members of his family. Marshall II, (supra) , 130 N.J. at 181.\n\nMost, if not all, of the life-sentenced defendants in the comparison group similarly inflicted greater suffering on their victims. For example, the strangulation of the victim of the Engel brothers took some four minutes to complete, and as in Marshall's case, the principal and the victim had had children together. See Martini IT, (supra) , 139 N.J. at 62-63. Melendez shot his victim to death in the presence of the victim's ten-year-old daughter, id. at 69-70, while Rose \"used two knives, a tackhammer, a stick, a hacksaw, and a sump pump\" to kill his pregnant victim. Ante at (slip op. at 55). The facts of Nicini's case, described above, evince a terrible degree of victimization, (supra) at (slip op. at 20).\n\nMoreover, the death-sentenced defendants already affirmed on proportionality review all inflicted substantially greater victimization. The Court characterized as \"substantial\" Martini's degree of victimization, given his terrorization of his kidnapping victim's wife. Martini II, (supra) , 139 N.J. at 75. The Court found Bey's degree of victimization also great, given that Bey \"sexually assaulted, beat, strangled, and stomped on his victim.\" Bey IV, (supra) , 137 N.J. at 383. Marshall's victim, like DiFrisco's, was not aware of her impending death, being asleep at the time she was shot. In Marshall's proportionality review, though, the Court took notice of the \"shattering impact\" on Marshall's children of the fact that their father had arranged to kill their mother. 130 N.J. at 181.\n\nDefendant's degree of victimization is less than that of any death-sentenced defendant in his comparison group, less than that of most if not all of the life-sentenced defendants in the comparison group, and less than that of all of the defendants already affirmed on proportionality review. I therefore find in the comparatively minimal degree of victimization inflicted by defendant a strong suggestion of the disproportionality of his death sentence.\n\nI conclude, in light of the facts presented above and in light of the other considerations emphasized in Justice O'Hern's Dissent, that the most coherent application of precedent-seeking review strongly suggests that defendant's death sentence is disproportionate. Adding to the precedent-seeking review such Conclusions as frequency review allows, I find that defendant is significantly distinguished from the other defendants in his comparison group only by a mitigating factor: the provision of substantial assistance to the State. To the extent, therefore, that any principled distinction can be drawn between the life-sentenced murderers and the death-sentenced murderers in defendant's comparison group, defendant belongs among the life-sentenced murderers.\n\nV\n\nProportionality review bears a great responsibility in the administration of capital punishment. It operates \"'as a check against the random and arbitrary imposition of the death penalty' by an aberrant jury.\" State v. Ramseur, 106 N.J. 123, 327, 524 A.2d 188 (1987) (quoting Gregg v. Georgia, 428 U.S. 153, 206, 96 S. Ct. 2909, 2940, 49 L. Ed. 2d 859, 893 (1976)). Beyond the prevention of arbitrariness, proportionality review also \"is a means through which to monitor the imposition of death sentences and thereby to prevent any impermissible discrimination in imposing the death penalty\" on such bases as race, sex, or other suspect classification. Ramseur, supra, 106 N.J. at 327.\n\nI am skeptical of the capacity of any method of proportionality review so greatly to restrain arbitrariness and invidious discrimination as to save capital punishment from its profound contradictions. See Marshall II, (supra) , 130 N.J. at 245-46 (Handler, J., Dissenting). I am convinced, though, that the deeply flawed proportionality review conducted by the Court in this and in previous cases cannot begin to remedy the defects of the death penalty. Irrationalities afflict almost every aspect of the methodology presently employed. Problems exist in the definition of the proportionality universe, in the construction of comparison groups, in each of the three methods of frequency review, in the endlessly debatable conundrums of precedent-seeking review, and in the ambiguity of the relationship between the two methods of review. The consequence of those problems is a method of proportionality review that leads us nowhere, and so leaves the Court free, in the application of its subjective moral evaluations, to go anywhere.\n\nO'HERN, J., Dissenting.\n\nIn Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972), the Supreme Court held that the systems of capital punishment then in existence in Georgia and Texas were incompatible with the Eighth and Fourteenth Amendments. In his Concurring opinion, Justice Stewart stated that the schemes inevitably resulted in death sentences that were \"wantonly and * * * freakishly imposed,\" and \"cruel and unusual in the same way that being struck by lightning is cruel and unusual.\" 408 U.S. at 309-10, 92 S. Ct. at 2762-63, 33 L. Ed. 2d at 390.\n\nFour years after Furman, the Supreme Court upheld a Georgia capital-sentencing statute that promised to eliminate the constitutional defects found in Furman. That scheme had features that would channel the exercise of sentencing discretion. Georgia established a bifurcated procedure setting forth the factors that the State deemed relevant in the sentencing process, which provided for \"the further safeguard of meaningful appellate review\" of every death sentence. Gregg v. Georgia, 428 U.S. 153, 195, 96 S. Ct. 2909, 2935, 49 L. Ed. 2d 859, 886-87 (1976).\n\nIn the exercise of the \"meaningful appellate review\" that is a necessary concomitant to a capital-sentencing scheme, we should hold that the sentence of death in this case is disproportionate because offenders such as defendant, Anthony DiFrisco, usually receive life sentences.\n\nI\n\nAs the Court notes in its opinion, \"we rely here more heavily on the precedent-seeking review than on frequency analysis in considering the proportionality of the death sentence. Ante at (slip op. at 38). Review of precedent reveals that in a contract killing the pliable tools of masterminds have rarely been sentenced to death. It is usually the hirer who is prosecuted for the capital offense. For example, in State v. Marshall, 130 N.J. 109, 613 A.2d 1059 (1992) (Marshall II), the State allowed the contract killer to plead to a reduced sentence to strengthen the prosecution of the hirer, Robert Marshall. An exception, in which the death penalty was sought for both the hirer and the contract killer, arose in the case of James Clausell. State v. Clausell, 121 N.J. 298, 580 A.2d 221 (1990) Clausell was anything but a tool. He was an entrenched member of the contract hirer's criminal organization. Id. at 309. Clausell executed the victim because the victim's dog bothered the hirer. He fired randomly through a door, endangering the intended victim as well as his family. Id. at 308. An examination of other cases under the precedent-seeking approach discloses that the manipulative hirer is usually considered more death-worthy than the contract killer.\n\nRANDY BURROUGHS\n\nBurroughs, who was mildly mentally retarded, killed Arthur Brand for promised money from the contract principal, Francis Brand, the victim's younger brother. Burroughs opened Arthur's bedroom door and shot him twice with a shotgun. Arthur died instantly. Burroughs had tried to resist Brand's earlier attempts to convince him to commit the murder of his allegedly abusive brother but was unsuccessful. Burroughs received a thirty-year prison term with thirty years of parole ineligibility.\n\nDANNY HARRIS\n\nGeorgia Wooten and Walter Wilson paid Harris to kill the father of Wooten's sister's children. Harris shot the victim in the chest. Prior to the shooting, Harris had told a friend that he was being paid to shoot someone. Evidence suggested that Harris suffered from organic brain damage, learning disabilities, and developmental disorders. Harris was found guilty of capital murder and at the penalty phase the jurors found that the mitigating factors outweighed the aggravating factors. He was sentenced to thirty years without parole, with a concurrent four-year term for unlawful possession of a weapon.\n\nRICHARD IRIZARRY\n\nJulius Boeglin paid Trizarry $1,000 to kill a drug dealer who owed Boeglin $1,800. Boeglin furnished Irizarry with a gun and drove him to a location where he pointed out the victim to Irizarry and told him to \"get him now.\" Irizarry got out of the car and called the victim's name. When the victim realized what Irizarry was about to do, Irizarry shot him four times in the chest.\n\nThe Essex County Prosecutor's Office gave Irizarry use immunity in exchange for his testimony at trial against Boeglin. Boeglin was convicted of non-capital murder. Irizarry pled to aggravated manslaughter and was sentenced to a term of forty years imprisonment with a parole ineligibility period of twenty years.\n\nPATRICK LANZEL\n\nLanzel conspired with his cousin, Laura Kaldawy, to kill Laura's father, with the expectation that Laura would inherit a large amount of money and share it with Lanzel. They first attempted to doctor the father's coffee with an excessive dose of medication, but he refused to drink it because it tasted bitter. As the father brewed another pot of coffee, Lanzel went to his car and returned with a package of rat poison, which he poured into the coffee. His uncle saw this and a fight erupted. Lanzel went back to his car again, this time returning with a two-foot-long metal rod. Lanzel then beat his uncle to death with the rod.\n\nNext, Lanzel went upstairs and bludgeoned his aunt with the rod. He returned to her room a number of times and at one point found that the door was locked. After breaking down the door, Lanzel was surprised to find that his aunt was still conscious. He beat her again with the metal rod, and choked her to death.\n\nLaura Kaldawy's nine-year-old brother witnessed the attack upon his mother, so Lanzel beat him with the metal rod. He, however, survived the attack.\n\nThe State did not seek the death penalty. Lanzel's case involved the carefully planned and premeditated \"for hire\" murder of two family members for pecuniary gain. Lanzel was sentenced to an aggregate term of 120 years in prison, sixty years to be served without parole. Laura Kaldawy received an aggregate sentence of thirty years in prison with no parole disqualifier.\n\nMIQUEL MELENDEZ\n\nMelendez shot his victim twice in the head, killing him in the presence of his daughter. Lazaro Trimino paid Melendez $2,500 to do so. Melendez had no role in planning the murder. Evidence suggested that Melendez was at least mildly mentally retarded and suffered from organic brain damage. He had been abandoned by his father as a child and institutionalized in state hospitals for most of his childhood. Melendez cooperated with the police and admitted that Trimino hired him to commit the murder. At trial he expressed remorse for his part in the murder. Melendez was sentenced to an aggregate term of life plus ten years imprisonment, with a parole disqualifier of thirty-three-and-a-half years.\n\nJAMES MC FADDEN\n\nMcFadden was a contract killer who was not prosecuted for capital murder.\n\nWilliam Engel was apparently obsessed with his former wife. He and his brother, Herbert, therefore, arranged for her murder. William delegated to Herbert the task of hiring a contract killer. Herbert pressured McFadden, an employee of his, into agreeing to commit the murder by plying him with liquor and promising him money.\n\nWilliam stood over his ex-wife and watched, smoking a cigarette, while McFadden strangled her to death. At one point during the four-minute ordeal, William called her a \"bitch.\" The two men then loaded her body into a waiting car and McFadden, with a cohort, transported the body to South Carolina where he burned it beyond recognition.\n\nBILLY WAYNE MC KINNON\n\nMcKinnon confessed to conspiracy to murder Maria Marshall, the wife of Robert Marshall, a Toms River businessman. Marshall agreed to pay McKinnon $65,000 to kill Maria. Marshall brought Maria to a rest stop on the Garden State Parkway late at night. She was shot to death as she lay sleeping in the car. McKinnon identified Larry Thompson as the triggerman. A jury acquitted Thompson. McKinnon was given a five-year sentence. Marshall II, supra, 130 N.J. at 272. Marshall, the hirer, was sentenced to death.\n\nMICHAEL ROSE\n\nRose was paid $540 to murder Kathryn Cveticanin. The principal, Zoran Cveticanin, hired Rose to kill his step-mother to prevent her from inheriting his father's estate. Rose, who was mildly mentally retarded, carried out the task in a vicious fashion -- he stabbed his pregnant victim eighty-three times and beat her over the head with a blunt object. When the victim became too weak to defend herself, Rose smoked a cigarette and then proceeded to beat her head and neck with a sump pump. Rose received a sentence of life imprisonment with thirty years of parole ineligibility.\n\nII\n\nWhat sets DiFrisco's case apart from those hired killers? He was, by the State's theory of the case, the pawn of Anthony Franciotti. Franciotti supplied him with drugs, chose the time and place of the murder, and hired him for the sum of $2,500 and cancellation of a $500 drug debt, just as Randy Burroughs, Danny Harris, Richard Irizarry, Miquel Melendez, James McFadden, Billy Wayne McKinnon, and Michael Rose were hired for similar sums. Similarly, although Patrick Lanzel was not hired for a specified sum of money, he murdered his aunt and uncle with the expectation of sharing in an inheritance. The only apparent difference is the stereotyping of DiFrisco as a mob hitman without any evidence to support that contention. I am one of those who accepted that stereotype, having joined our opinion in Marshall II, supra, 130 N.J. at 183, in which we said that \"by his own account, [DiFrisco] committed the contract murder to earn himself a professional reputation with a crime syndicate.\"\n\nDiFrisco had never been involved in organized criminal activity either before the crime or in the year or so after the crime. In the first penalty-phase proceeding the prosecution characterized him as \"mak[ing] his bones,\" which was described as signif[ying] a would-be killer's first kill in order [for] the individual [to] become trusted among the criminal element.\" In addition, he was accused of keeping \"the code of silence.\" State v. DiFrisco, 118 N.J. 253, 268, 571 A.2d 914 (1990) (DiFrisco I). Both are veiled allusions to participation in syndicated criminal activity. See Charles E. Silberman, Criminal Violence. Criminal Justice 84 (1978) (explaining that \"The Code\" means \"never squeal\").\n\nDefendant and his family did not observe the code of silence when they gave evidence in open court that the contract principal was Anthony Franciotti. Much is made of the fact that DiFrisco had his chance to cooperate with the police and refused. All that occurred was that his father suggested to him that he first consult with a private attorney before making a taped telephone call to Franciotti. Nothing in the record indicates or suggests that DiFrisco was or is unwilling to cooperate with the State in the prosecution of Franciotti.\n\nWhat also sets this case apart from those other cases is that the State has not conducted an investigation of the higher-up, Franciotti. The Public Defender observes that the State has treated this case as though it were a contract killing with \"only one party to the contract.' An investigator for the Essex County Prosecutor's Office described the extent of his investigation: \"I personally called up an associate of mine in the Queens Special Narcotics Task Force.\" Despite DiFrisco's reference to the car as a rental car, no effort was made to check such records or to check telephone records that would connect DiFrisco to Franciotti in the days before the murder. See State v. Marshall, 123 N.J. 1, 36, 586 A.2d 85 (1991) (Marshall I) (describing State's use of telephone toll records to locate contract killers). (There was a dispute at trial about how long toll records were kept.) We are told that it would be unfair to bring to trial one who hired a gunman to kill an innocent citizen of New Jersey without more evidence than DiFrisco's statement, the same statement that is sufficient to put DiFrisco to death.\n\nThe Court questions DiFrisco's remorse, ante at (slip op. at 67-68), but it is not Anthony DiFrisco who tries to paint himself as remorseful; rather, an investigating police officer's testimony that during the 1987 confession in New York \"DiFrisco apparently felt remorse on killing and decided to tell New York [City] detectives.\" That officer's report noted that DiFrisco's conscience \"had been bothering him since the * * * murder and he could no longer sleep.\" The officer also testified that DiFrisco wanted to \"clean the slate.\" In the mythology of crime no one lets \"personal feelings get in the way of business.\" Moreover, no one in the mob business would admit to a murder to beat a car-theft rap.\n\nThe reality is that DiFrisco was used by his drug dealer to do the drug dealer's business. The State's theory of the case is that Franciotti picked out the victim, chose the time and place for the killing, and drove DiFrisco to and from the crime scene. In DiFrisco I, we anticipated that the State would complete its investigation in this case and either \"establish the groundwork for a case against Franciotti\" or disprove that \"Franciotti could have been in New Jersey on the date of the murder.\" 118 N.J. at 283. \"In either event, Justice [would be] done.\" Ibid.\n\nThe inscrutable paradox in this case is that when the State executes DiFrisco, it also executes the only witness who can implicate the higher-up in this cold-blooded killing. It thereby grants permanent immunity to and asylum for the higher-up and guarantees that a murderer will remain at large, free to kill again.\n\nJustice Handler joins in this opinion.\n\n\u003cspan class=\"fn\"\u003e1. A Gerald error is one in which the capital sentence followed a conviction for purposely or knowingly causing serious bodily injury resulting in death, rather than purposely or knowingly causing death. See State v. Gerald, 113 N.J. 40, 69, 549 A.2d 792 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The thirteen basic categories are:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(A) Multiple victims;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(B) Prior Murder Conviction without A above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(C) Sexual Assault without A-B above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(D) Victim a Public Servant without A-C above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(E) Robbery without A-D above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(F) Arson without A-E above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(G) Burglary without A-E [sic] above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(H) Kidnapping without A-G above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(I) Pecuniary Motive without A-H above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(J) Torture/aggravated assault without A-I above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(K) Depravity of Mind without A-J above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(L) Grave risk of death as primary statutory aggravating circumstance without A-K above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(M) Escape Detection, etc., as sole factor without A-L above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[DiFrisco Report, tbl. 7.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. They are: Francis Brand, Randy Burroughs, James Clausell (2 cases), Anthony DiFrisco (2 cases), Herbert Engel, William Engel, Danny Harris, Richard Irizarry, Robert Marshall, Miguel Melendez, Michael Rose, and Walter Williams.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. They are: Brand, Burroughs, Clausell (2 cases), DiFrisco (2 cases), Engel (Herbert), Engel (William), Harris, Irizarry, Marshall, Melendez, Rose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. They are: Brand, Burroughs, Clausell (2 cases), DiFrisco (2 cases), Engel (Herbert), Engel (William), Harris, Irizarry, Marshall, Melendez, Rose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. I have previously expressed, and continue to have, serious doubts about the constitutionality of the 1992 amendment. See Martini II, (supra) , 139 N.J. at 83, n.1 (Handler, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Anthony Accetturo, Louis Auricchio, Thomas Ricciardi, Michael Perna, and Michael Taccetta.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The thirteen basic comparison groups are the following:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(A) Multiple Victims;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(B) Prior Murder Conviction without A above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(C) Sexual Assault without A-B above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(D) Victim a Public Servant without A-C above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(E) Robbery without A-D above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(F) Arson without A-E above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(G) Burglary without A-E [sic] above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(H) Kidnapping without A-G above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(I) Pecuniary Motive without A-H above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(J) Torture/aggravated assault without A-I above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(K) Depravity of Mind without A-J above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(L) Grave risk of death as primary statutory aggravating circumstance without A-K above;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(M) Escape Detection, etc., as sole factor without A-L above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[DiFrisco Report, Tbl. 7.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The level or degree of aggravation was thus explained:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBecause multiple-victim and prior-murder cases involve more than one life, they are listed first on a priori grounds. Categories C (sexual assault) and D (public servant) appear next because of the above-average rate at which either prosecutors seek or jurors impose the death sentence in these cases. Categories E (robbery) through H (kidnapping) reflect no judgment concerning the relative aggravation level of the cases involved. Among the remaining statutory aggravating circumstances which are based on more subjective case characteristics, pecuniary motive (4d and 4e) is listed first because of the uncommonly high rate at which prosecutors seek death sentences in these cases. The remaining categories, J through M, reflect no judgment of relative culpability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[Final Report at 81-82.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. For example, if in the course of a capital murder by arson a defendant kills more than one person, the defendant does not join both comparison group (F) (arson) and comparison group (A) (multiple victims). Such a defendant joins group (A) only, for failure to satisfy the \"without A-E\" clause of the arson comparison group. Table 7A of the DiFrisco Report lists, for each of the 309 cases in the proportionality universe, the single comparison group and subcategory to which each case is assigned.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Among their suggestions for additions to defendant's comparison group, both the State and defendant have offered cases which transgress the principle of unique assignment. The State, as noted, suggests the addition of Martini. Defendant suggests the addition of Patrick Lanzel and Daniel Nicini. If admitted to defendant's comparison group, all three cases would violate the principal of unique assignment in a similar way. In all three cases, as in DiFrisco's case, there is substantial evidence that the defendant's crime was motivated at least in part by considerations of pecuniary gain. But in all three cases, there exists evidence of at least one aggravating circumstance not present in DiFrisco's case and of a sort to cause the case to fail the \"without A-H above\" condition for admission to defendant's comparison group. Accordingly, all three cases have been assigned to some comparison group higher on the list than defendant's comparison group. To add the cases to defendant's comparison group, thus, is to allow that each can be used in more than one comparison group: its own, and defendant's.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Reduced to their bare essentials, the facts show that Martini kidnapped his victim and held him for ransom while terrorizing the victim's wife with threats of violence to herself and her husband. Martini's crime thus contains the aggravating circumstances of pecuniary motive, kidnapping, and the infliction of extreme violence or terror. The AOC accordingly assigned the case to comparison group (H) (\"kidnapping without A-G above\"), subcategory (2) (\"abduction with particular violence/terror and other victim\"). DiFrisco Retort, Tbls. 7 \u0026 7A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In summary, the evidence suggests that Lanzel, after unsuccessfully attempting to poison one of his victims, beat two people to death, and a third almost to death, for money. Lanzel's crime thus contains the aggravating circumstances of multiple victims, pecuniary motive, and extreme violence or terror. Accordingly, the AOC assigned the case to comparison group (A) (\"multiple victims\"), subcategory (1) (\"with sexual assault or particular violence/terror\"). DiFrisco Retort, Tbls. 7 \u0026 7A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. To accomplish a robbery, Nicini lured the victim, a homosexual man in his 60's known to co-defendant Felmey, to a remote area with the promise of sexual favors. According to the plan, Nicini bound the victim and put him in the trunk of the car, after robbing him. When the victim recognized Felmey, Nicini and Felmey decided to kill him. After a prolonged period of extreme abuse, Nicini killed the victim by tying the victim's neck to the car's bumper, and then dragging the victim at high speed. After the victim's death, Nicini and Felmey burglarized his home. Nicini was not prosecuted capitally. Nicini's crime contains the features of pecuniary motive and particular violence or terror. The AOC accordingly assigned Nicini to comparison group (E) (\"robbery without A-D above\"), subcategory (2) (\"[no residential forced entry but] with particular violence/terror\"). DiFrisco Report, Tbls. 7 \u0026 7A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Randy Burroughs, James Clausell (2 cases), Anthony DiFrisco (2 cases), Danny Harris, Richard Irizarry, Miguel Melendez, and Michael Rose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Francis Brand, Herbert Engel, William Engel, Robert Marshall, Michael Taccetta, Michael Perna, and Anthony Accetturo.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Danny Harris and Miguel Melendez are the others.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Danny Harris, Miguel Melendez, Randy Burroughs, and Richard Irizarry are the others.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The death-sentenced universe contains 38 cases, the penalty-trial universe contains 128, and the death-eligible universe, 309. DiFrisco Report, Tbl. 15.\u003c/span\u003e\n\n",
    "body_length": 201400,
    "citedas": [
      "142 N.J. 148",
      "662 A.2d 442"
    ],
    "attorneys": "M. Virginia Barta, Assistant Deputy Public Defender, and Paul M. Klein, Deputy Public Defender II, argued the cause for appellant (Susan L. Reisner, Public Defender, attorney; Ms. Barta, Mr. Klein, and Claudia Van Wyk, Deputy Public Defender, on the briefs). Hilary Brunell, Assistant Prosecutor, argued the cause for respondent (Clifford J. Minor, Essex County Prosecutor, attorney). Lawrence S. Lustberg argued the cause for amicus curiae Association of Criminal Defense Lawyers of New Jersey (Crummy, Del Deo, Dolan, Griffinger \u0026 Vecchione, attorneys; Mr. Lustberg and Lenora M. Lapidus, on the brief). Catherine A. Foddai, Deputy Attorney General, argued the cause for amicus curiae Attorney General of New Jersey (Deborah T. Poritz, Attorney General, attorney).",
    "category": [
      "243",
      "78",
      "75"
    ],
    "judges": "Chief Justice Wilentz and Justices Pollock, Stein and Coleman join in Justice Garibaldi's opinion. Justice Handler has filed a separate Dissenting opinion. Justice O'hern has filed a separate Dissenting opinion in which Justice Handler joins.",
    "citation_count": 20
  }
}
