{
  "id": "dLhpTmYBTlTomsSBjLBx",
  "document": {
    "title": "State v. Pitts",
    "full_title": "STATE OF NEW JERSEY v. DARRYL PITTS",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1989-06-21T00:00:00.000Z",
    "docket": "No. A-29",
    "body": "Defendant, Darryl Pitts, was tried and convicted by a Camden County jury of the murders of Paul Reynolds and Stacey Elizardo. He was also convicted of several offenses based on events that occurred two days prior to the murders. Defendant was sentenced to death for the murder of Stacey Elizardo; he was sentenced to life imprisonment with thirty-years parole ineligibility for the murder of Paul Reynolds. Defendant appeals directly to this Court as of right. R. 2:2-1(a)(3). We affirm his convictions for murder and the related offenses.\n\nThe Attorney General acknowledges that defendant's death sentence must be reversed because the trial court's instructions to the jury on the balancing of aggravating and mitigating factors did not comply with the standards established in State\n\nv. Biegenwald, 106 N.J. 13, 53-67 (1987). We therefore set aside the death sentence and remand the matter to the trial court for a new sentencing proceeding.\n\nI.\n\nFacts and Procedural History\n\nThe twelve-count indictment returned against the defendant included six counts charging offenses relating to the murders of Paul Reynolds and Stacey Elizardo on March 22, 1984, in Reynolds' apartment. In the remaining six counts, defendant was charged with various crimes allegedly committed on March 20, 1984, at Elizardo's townhouse in Lindenwold, New Jersey. Accordingly, the factual background essential to an understanding of the legal issues in this case commences with the events that occurred during the evening of March 20, 1984. The evidence produced at trial fully supports the following account of the material facts.\n\nOn March 20, 1984, defendant, an unemployed Vietnam War veteran, was in Elizardo's townhouse. At her request, defendant was watching one of Elizardo's two children while she and Paul Reynolds took her other child to the hospital. According to defendant, he and Elizardo had dated many times. They had been sexually intimate. Defendant acknowledged his deep affection for Elizardo.\n\nIn the course of the evening two other male friends of Elizardo visited her townhouse. The first was Paul Pencock, who had lived with Elizardo earlier that winter. He had come by to see her, and defendant invited him to stay and await her return. He testified that defendant expressed anger because Elizardo was out late with Reynolds.\n\nSoon after Pencock's arrival, Vincent Della Polla, another friend of Elizardo, called to speak to Brian Gallo who shared the townhouse with Elizardo and her children. Pitts, representing\n\nhimself to be Gallo, invited Della Pollo to the apartment. He arrived soon afterwards.\n\nThe three men discussed their feelings toward Elizardo while awaiting her return. Defendant stated that he loved her very much and questioned the other two about the depth of their affection for her. Pencock acknowledged that he also loved and cared about her; Della Polla told defendant that he cared for her but did not love her. Defendant's response to Della Polla was that he \"shouldn't be here.\"\n\nAs time passed defendant became increasingly angry at Elizardo's failure to return home. Pitts blamed Reynolds for keeping her out late and said that he would \"get\" Reynolds. When Elizardo and Reynolds returned about 11:00 p.m., Pitts called her a \"tramp\" and demanded to know where she had been. Reynolds intervened and invited defendant into the living room to discuss his concerns, but defendant, glaring at Reynolds, did not leave the kitchen.\n\nDefendant also made threatening statements to Elizardo, commenting that \"it's getting closer to midnight.\" Elizardo told Della Polla that she interpreted defendant's words to mean that she would die at twelve o'clock. Elizardo then demanded that everyone leave the apartment. Suddenly, defendant grabbed a kitchen knife and held it against Della Polla's neck. He threatened to slit his throat, accusing Della Polla of having infected Elizardo with a venereal disease that she had subsequently transmitted to defendant. Della Polla pushed defendant away. Defendant then left the apartment with Pencock, who had offered to drive him home. Reynolds left at the same time, leaving Elizardo with Della Polla.\n\nPencock drove Pitts home and returned to Elizardo's apartment. According to Della Polla, Pitts telephoned Elizardo several times and made threatening remarks. This prompted Della Polla to offer to take Elizardo to his house. She refused, stating that \"nobody is going to throw me out of my own house.\"\n\nShortly thereafter, defendant returned to the apartment and sat down at the kitchen table with Elizardo, Pencock, and Della Polla. Pitts was carrying a rifle with a pistol-type handle which he pointed at Della Polla saying, \"We are going to talk.\" Pencock then told Della Polla to leave, and Della Polla walked out of the apartment. Pitts followed him out, as did Pencock. Pitts, holding the gun with his finger on the trigger, said he was going to shoot Della Polla. Pencock intervened, standing between Pitts and Della Polla, who then got into his car and drove away.\n\nPitts returned to the apartment waving the rifle, and directed his anger at Elizardo, calling her a \"tramp\" and a \"whore.\" When Pencock attempted to take the rifle from defendant, it fell to the ground and discharged. Pencock picked up the weapon, removed the clip, which he placed in his pocket, and hid the rifle under the cushion of a couch. Subsequently, at defendant's insistence, Pencock returned the rifle to him without the clip.\n\nDefendant, Pencock, and Elizardo remained in the apartment until about 5:00 a.m., when Pencock awakened her and told her that he had to leave. Elizardo assured Pencock that she would be safe in the apartment with defendant. Defendant left Elizardo's apartment the next morning. Pencock returned to Elizardo's apartment late in the afternoon of March 21, bringing with him the gun clip that defendant had asked Elizardo to retrieve for him. Pencock stayed at the apartment overnight. On Thursday morning, March 22, Paul Reynolds arrived, and he and Elizardo left the apartment together.\n\nThat same morning Pitts asked James Gibbs, his downstairs neighbor, to drive him on a few errands. Defendant offered to pay for gasoline and assured Gibbs they would return within forty-five minutes. They first drove to the apartment of Patricia Woods, defendant's former wife, but defendant observed that her car was not in the parking lot. They proceeded to a liquor store where Pitts purchased a six-pack of beer. Pitts\n\ndrank half of a bottle of beer as they drove to Paul Reynolds' apartment. Gibbs parked the car and waited while Pitts proceeded to Reynolds' apartment. Outside the apartment door Pitts encountered Michael Sarich who was visiting Reynolds to repay a debt. According to Sarich, a woman's shoes and coat were in plain view in Reynolds' living room. Sarich departed, leaving Reynolds and Pitts together in the apartment. The two quickly became engaged in a heated argument. Pitts, the only survivor of the ensuing encounter, has offered several different accounts of the events that followed.\n\nIn his first statement to police officers following his arrest, defendant attributed the murders of Reynolds and Elizardo to an unidentified male who was waiting at Reynolds' apartment door when Pitts arrived for the purpose of buying some marijuana. According to Pitts, the assailant \"freaked,\" pulled out a knife, and stabbed Reynolds. He then stabbed Elizardo as she attempted to run from the apartment. Pitts said that his hands were smeared with blood when he attempted to render first aid. He denied responsibility for either homicide.\n\nDefendant gave a second statement to the police at 2:10 a.m. on March 23, approximately an hour after he completed his first statement. In the second statement, Pitts acknowledged responsibility for both homicides. Pitts said that he and Reynolds argued about seven hundred dollars that Reynolds owed him.\n\nThey owed me. At that time they owed me seven hundred dollars and Paul's been holding and holding and holding and he's been bullshitting me * * *.\n\nAccording to defendant, he then pulled out a black Army \"survival\" knife and cut Reynolds' throat:\n\nHe was cut but it wasn't severe enough but you can cut a human being and usually they'll stay alive three minutes. That's a known fact. According to you gentlemen, he was stabbed. All this is going on fast. This couldn't have taken no more than ten, 15 seconds. When [Stacey] came out of the room, what the fuck you doing, jerkoff, and on and on and on. I said because my fucking money is not in my hand and it went on. That's when I, you know, attacked her. * * *\n\n[After Reynolds had fallen against the wall, Stacey] went into hysterics. And when the hysterics went down, that's when I fucked up * * *.\n\nI guess originally it started as a struggle because I grabbed her and I tried to cut her throat. I told you before, you can use [the combat knife for] cutting someone's throat.\n\nDefendant indicated that he twice attempted to cut Elizardo's throat, but did not recall stabbing any other part of her body. He stated that he \"took the pulse\" of both victims, and determined that both were dead.\n\nBoth of defendant's statements to the police were read to the jury during the guilt phase of the trial. When defendant testified at trial, he repudiated the explanation offered in his second statement to police that an argument over an unpaid debt provoked the homicides. Pitts testified at trial that he had gone to Reynolds' apartment to buy marijuana. He saw Elizardo's shoes and coat and asked to see her. Reynolds said that she was asleep, and indicated that she would not want to see Pitts. Pitts testified that he then accused Reynolds of encouraging Elizardo to engage in prostitution in order to earn money to pay for drugs that she purchased from Reynolds. According to Pitts, an argument erupted, the two shoved each other, and Reynolds demanded that Pitts leave. When he refused, Reynolds turned toward the bedroom and said that he was going to get a gun. Pitts then pulled out his knife and stabbed Reynolds. He described the assault as an \"instantaneous like reflex.\" While occupied with Reynolds, and in a \"frenzied-type state of mind,\" Pitts perceived an \"image\" behind him. According to Pitts' trial testimony:\n\n[W]hereas, that now which I know Stacy was behind me, it was just an image at that time that I wheeled around and I sliced Stacy with the knife at the time * * *.\n\nPitts also testified that he loved Elizardo and was jealous of her relationships with other men. He explained that his second\n\nstatement to the police, in which he falsely attributed the murders to an unpaid debt, was prompted by a reluctance to admit to the police that he killed Reynolds because of his feelings for Elizardo. During cross-examination, Pitts said that he had the combat knife with him in order to take it to his mother's house, so that his son would not find it when he visited Pitts.\n\nDr. Gerald Cooke, a clinical and forensic psychiatrist who tested and evaluated the defendant, gave trial testimony that was corroborative of Pitts's trial version of the homicides. He testified that although Pitts was not psychotic or out of touch with reality,\n\nhe has some tendency towards loss of control or increased emotional stimulation. * * * [He] has more of a tendency to lose control than the average person when he is stressed, particularly if those stresses fit into these particular dynamics I have mentioned, such as rejection by women, things of that nature.\n\nDr. Cooke also testified that Pitts \"showed a continuing preoccupation with Vietnam.\" Dr. Cooke reviewed his discussions with Pitts concerning his Vietnam service:\n\nHe was in combat in Vietnam and was wounded in combat. We talked about Vietnam. * * * He says that he felt that he accomplished more in one afternoon in Vietnam in a combat situation than he has done in his entire life since then, and I got a real sense that he feels like much of his life has been useless and without purpose since that time.\n\nDr. Cooke diagnosed defendant as having\n\na cyclothymic personality disorder. What that means is that he is an individual whose moods vary significantly over a time to a point where it disrupts his day-to-day functioning and at times he is maybe depressed significantly, and to[o] he may be hyperactive, manic.\n\nThis is a similar type of disorder, though [it] is not as severe as what people have referred to as manic depressive psychosis or manic depressive illness. He does not go to extremes as a manic depressive does, he does not lose day-to-day, at any rate, any kind of contact with reality the way a manic depressant might. But he has the same pattern in his behavior of having periods of days, weeks, months of depression and other periods where he is hyperactive, outgoing and shows his more impulsive and manicy sorts of behavior.\n\nI also indicated that along with the cyclothymic personality disorder, superimposed on it he has a chronic anxiety disorder, and above-average level of anxiety on a chronic basis.\n\nAt trial, Dr. Cooke recounted the result of his interrogation of defendant concerning the homicides:\n\n[He] doesn't remember, he says, reaching for the knife; he remembers having a knife in his hand, but he doesn't actually remember stabbing. He says he remembers wheeling around with somewhat of a slashing motion and does not remember any specific stabs after that. He says he does remember seeing blood and things of that nature.\n\nHe also then tells me that out of the corner of his eye he saw what at some times he described as an image, as a person, didn't know who it was, he says, didn't know if it was a male or female but had a feeling very much like the feeling that he had when he was in Vietnam, \"I have to win, I have to survive, I am under attack,\" things of that nature.\n\nI went into this with him in great detail; this is not a flashback into any specific incident, this is not like he is reliving a specific incident in Vietnam. I am not saying that. What I am saying, he had the general feeling under this stressful situation that he had had at times in Vietnam in just having to win, having to survive, having to strike out until there was no more motion around him. He said that he only afterwards realized that that was Stacy.\n\nHe told me he wheeled around and slashed at her, but then again not knowing it was her at that point and then again does not remember the stabbing itself. He does, he said something like he had a feeling he was hitting the person and he realized later that he must have been stabbing her.\n\nHe then said the next thing he knew, he saw her on the floor, knew it was her, there was blood everywhere. He said he experienced at that point, and this is a quote, \"Like a stillness like in Vietnam after a firefight.\" He said at that point he began to realize what he had done.\n\nBased on this evaluation of defendant and the defendant's account of the homicides, Dr. Cooke related his opinion about the defendant's state of mind at the time of the murders:\n\n[U]nder that situation he experienced some of that feeling from Vietnam, not a specific flashback, but a feeling in which he perceives himself to be in danger, perceives himself as having to strike out to protect himself in part.\n\nBut even more important, that he had an emotional response there, an impulsive emotional response, not a response where he stopped and thought and decided, \"I will do this, I will do that,\" but, rather, a loss of control under the influence of extreme emotions and what I would say, combining all that data, a rage reaction, a reaction in which his anger reached the point of rage, which I would define as an anger that goes out of control and an anger which interferes with the cognitive ability a person has, planning, judgment, recognizing consequences, deliberating, that in my opinion, he experiences such a loss of control.\n\nDr. Robert Segal, the Camden County Medical Examiner, testified that the deaths of both victims resulted from multiple stab wounds inflicted by a heavy-bladed knife with a single sharp edge and a square or blunted opposite edge, and that the Ka-Bar type knife offered into evidence by the State could have caused the wounds observed on the victims. Dr. Segal identified the following knife wounds on Reynolds' body: (1) left eye and cheek; (2) under the neck and extending towards the left ear; (3) base of the neck; (4) left front of the chest near the left nipple; (5) left side of the back; (6) inner left forearm; (7) right side of the head above the ear, which penetrated through the scalp, skull, and brain to strike the bone at the bottom of the skull. Dr. Segal testified that wound (4), which cut the right lung and the aorta, was if \"[u]ntreated * * * a uniformly fatal wound[;]\" he adjudged this wound, however, to be \"part of the cause of death,\" which cause he identified as \"multiple stab wounds of the head, neck, and trunk.\" In addition, Dr. Segal found abrasions, or scrapes, \"on the chest, on the right eye-brow and on the left shoulder area.\"\n\nFrom his examination of Elizardo's body, Dr. Segal observed \"multiple stab wounds and multiple scrap[e]s o[r] abrasions over practically all portions of the body. The major portion of the right leg is spared, most of the back is spared.\" Specifically, the stab and slashing wounds were inflicted on: (1) the left cheek, continuing upwards to split the ear in half; (2) the throat, extending towards the ear; (3) the throat, also extending towards the ear; (4-6) three cuts on the left side of the head in the skull, two of which penetrated through the skull into the brain; (7-9) three stab wounds on the left side of the chest beginning beneath the left breast and extending to the side and downward; (10) back of the left shoulder; (11), (12) back of [left] arm; (13) [left] elbow; (14) back of [left] forearm; (15) index finger of left hand; (16) junction of left buttock and thigh; (17) lower left leg; (18) front of right arm; (19) above right elbow; (20) [right] forearm; (21) [right] hand; (22) and (23) midline of back of neck; (24) back of right shoulder.\n\nInternal examination revealed a fractured third left rib and right humerus, a cut aorta, a cut esophagus, cut lungs, and blood in her lungs.\n\nDr. Segal also testified that he could recall \"no specific description of any of the wounds [on the bodies] that would indicate clear and unequivocal evidence that [it had been inflicted] postmortem.\"\n\nDefendant's neighbor James Gibbs, who had driven Pitts to Reynolds' apartment, gave testimony concerning the events that occurred after the homicides. He stated that he had heard screams from inside the apartment building. When Pitts returned to the car, he had blood on his hands and a knife concealed in his coat. He told Gibbs that Reynolds had \"pulled a shotgun on him\" and that he had killed Reynolds and Elizardo. According to Gibbs, Pitts said, \"I cut her throat, you don't have to worry about her.\" When Gibbs questioned Pitts further about why the killings occurred, Pitts told Gibbs that \"they owed me money.\" Gibbs testified that Pitts grinned and said, \"[s]ee what I mean about paybacks is a bitch.\" Gibbs also noted that Pitts asked him if he would \"stand up to these people if they question you and all.\"\n\nGibbs then drove Pitts to his mother's house in Hammonton. On the way, Pitts used beer to wash his hands of blood and threw some bloodstained papers out the car window. Pitts told Gibbs that he was going to bury his clothes and dispose of the knife. As he got out of Gibbs' car, Pitts told Gibbs \"[t]here will be a couple of thousand in this for you when it's all over.\"\n\nLater that day, Gibbs went to the Pemberton police headquarters and gave a statement implicating defendant in the homicides. Defendant was apprehended by police at his apartment later that evening.\n\nAs noted above, supra at 586, defendant was named in a twelve-count indictment returned by a Camden County Grand Jury. Six counts related to the murder of Paul Reynolds and\n\nStacey Elizardo and six counts concerned the events that occurred two days earlier at Elizardo's townhouse.\n\nAt the conclusion of the guilt-phase of the trial, the trial court charged the jury on passion/provocation manslaughter, N.J.S.A. 2C:11-4b(2), as a lesser-included offense of murder. See State v. Grunow, 102 N.J. 133 (1986). Defendant requested an instruction on imperfect self-defense, contending that his belief that his safety was endangered was relevant to the jury's consideration of a passion/provocation manslaughter verdict. The trial court refused to charge the jury on imperfect self-defense.\n\nDefendant was convicted on all counts of the indictment, including the murder of Paul Reynolds (N.J.S.A. 2C:11-3(a)(2) and N.J.S.A. 2C:11-3(c)); the murder of Stacey Elizardo (N.J.S.A. 2C:11-3(a)(2) and N.J.S.A. 2C:11-3(c)); hindering apprehension or prosecution (N.J.S.A. 2C:29-3(b)(1)); two counts of possession of a weapon, a knife, for an unlawful purpose (N.J.S.A. 2C:39-4(d)); false swearing (N.J.S.A. 28:2-2(a)); two counts of possession of a weapon, a handgun, for an unlawful purpose (N.J.S.A. 2C:39-4(a)); tampering with a witness (N.J.S.A. 2C:28-5(a)(2)); terroristic threats (N.J.S.A. 2C:12-3); aggravated assault by pointing a firearm (N.J.S.A. 2C:12-1(b)(4)); and unlawful possession of a handgun (N.J.S.A. 2C:39-5(b)).\n\nIn the penalty phase, the jury determined with respect to both homicides that the State had proved the existence of aggravating factor N.J.S.A. 2C:11-3c(4)(c), that \"[t]he murder was outrageously or wantonly vile, horrible or inhuman in that it involved torture, depravity of mind, or an aggravated battery to the victim[.]\" The jury found that the State had not established the existence of a second aggravating factor in connection with the Reynolds murder, that \"the defendant purposely or knowingly created a grave risk of death to another person in addition to the victim[.]\" N.J.S.A. 2C:11-3c(4)(b). With regard to the murder of Elizardo, the jury found that the State had not established the existence of a second aggravating factor, in\n\nconnection with the Reynolds murder, that \"[t]he murder was committed for the purpose of escaping detection, apprehension, trial, punishment, or confinement for another offense * * *.\" N.J.S.A. 2C:11-3c(4)(f).\n\nWith respect to the murder of Paul Reynolds, the jury determined that the following mitigating factors existed:\n\n(a) The defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution; [ N.J.S.A. 2C:11-3c(5)(a).]\n\n(b) The victim solicited, participated in or consented to the conduct which resulted in his death; [ N.J.S.A. 2C:11-3c(5)(b).]\n\n(f) The defendant has no significant history of prior criminal activity; [ N.J.S.A. 2C:11-3c(5)(f).]\n\n(h) Any other factor which is relevant to the defendant's character or record or to the circumstances of the offense. [ N.J.S.A. 2C:11-3c(5)(h).]\n\nThe jury rejected defendant's proof of mitigating factor 2C:11-3c(5)(d) that \"[t]he defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of mental disease or defect or intoxication, but not to a degree sufficient to constitute a defense to prosecution.\" The jury determined that the single aggravating factor was outweighed by the mitigating factors.\n\nWith regard to the murder of Elizardo, the jury found the following mitigating factors were established:\n\n(a) The defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution; [ N.J.S.A. 2C:11-3c(5)(a).]\n\n(f) The defendant has no significant history of prior criminal activity; [ N.J.S.A. 2C:11-3c(5)(f).]\n\n(h) Any other factor which is relevant to the defendant's character or record or to the circumstances of the offense; [ N.J.S.A. 2C:11-3c(5)(h).]\n\nThe jury determined that defendant had not established the existence of mitigating factor 2C:11-3c(5)(b) (\"[t]he victim solicited, participated in or consented to the conduct which resulted in his death\"), or 2C:11-3c(5)(d) (\"[t]he defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of mental disease or defect or intoxication,\n\nbut not to a degree sufficient to constitute a defense to prosecution.\"). The jury concluded that the aggravating factor was not outweighed by the mitigating factors. Accordingly, the trial court sentenced defendant to death for the murder of Stacey Elizardo.\n\nDefendant was also sentenced to life imprisonment with thirty-years parole ineligibility for the murder of Paul Reynolds. In addition, defendant received concurrent sentences for the remaining, unmerged counts of the indictment: seven years for possession of a firearm for an unlawful purpose (N.J.S.A. 2C:39-4(a)); concurrent terms of four years each on count three, hindering apprehension (N.J.S.A. 2C:29-3(b)(1)), count seven, tampering with a witness (N.J.S.A. 2C:28-5(a)(2)), and count eight, terroristic threats (N.J.S.A. 2C:12-3), and concurrent terms of eighteen months each on count five, false swearing (N.J.S.A. 28:2-2(a)), and count nine, aggravated assault (N.J.S.A. 2C:12-1(b)(4)).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nDefendant challenges his convictions and death sentence on numerous grounds. We now consider each of defendant's contentions.\n\nII.\n\nConstitutional Issues\n\nDefendant contends that New Jersey's capital punishment act, N.J.S.A. 2C:11-3c to g, infringes on rights afforded him by the New Jersey Constitution. We addressed this contention in State v. Biegenwald, supra, 106 N.J. 13, 25-26 (1987), and State v. Ramseur, 106 N.J. 123, 166-97 (1987). We adhere to our conclusion that the death penalty statute does not violate\n\neither federal or state constitutional prohibitions against cruel and unusual punishment. U.S. Const. amends. VIII, XIV; N.J. Const. of 1947 art. I, para. 12. We also reject as meritless defendant's assertion that the statute infringes on the rights guaranteed by Article I, paragraph 1 of the State Constitution.\n\nDefendant also contends that the capital punishment act is unconstitutional because it does not authorize the jury to disregard the balancing of aggravating and mitigating factors mandated by the act and return a non-death verdict based on considerations of mercy. We considered and rejected a similar contention in State v. Ramseur, supra, where we held that an instruction that the jury \"should decide the case on the evidence without any bias, prejudice or sympathy * * *\" did not violate a defendant's constitutional rights, 106 N.J. 123, 296-99, citing California v. Brown, 479 U.S. 538, 107 S. Ct. 837, 93 L. Ed. 2d 934 (1987). We also observed in Ramseur that the trial court's charge \"did not preclude the jury from considering all possible mitigating circumstances and such sympathy as those circumstances might inspire.\" Ramseur, 106 N.J. at 299.\n\nIn this case, the trial court's penalty-phase charge did not mention mercy or sympathy. As in Ramseur, the jury was free to consider and weigh any of the mitigating factors established by the defendant, in the context of any feelings of compassion, mercy or sympathy engendered by those mitigating factors. See State v. Rose, 112 N.J. 454, 544-45 (1988) (\"The Court's instruction * * * did not inhibit the jury from considering sympathy to the extent it may have been engendered by mitigating factors proved by defendant.\").\n\nDefendant asserts that the jury must be free to render a verdict prompted by feelings of mercy unrelated to any mitigating factor recognized by the Act and unconstrained by the jury's balancing of aggravating and mitigating factors. We reject that contention and conclude that the jury's authority under the Capital Punishment Act to consider, in pronouncing sentence, feelings of mercy and sympathy inspired only by\n\nmitigating factors established by the evidence does not violate defendant's constitutional rights.\n\nIII.\n\nGuilt-Phase Issues\n\nA. Defendant's Severance Motion.\n\nDefendant moved before trial to sever from the indictment all counts that were based on events that occurred at Stacey Elizardo's residence on March 20, 1984, two days prior to the homicides. Defendant argued that it would be highly prejudicial for the capital murder offenses to be tried together with unrelated charges based on the events of March 20, asserting that the only connection between the homicide and pre-homicide counts was that the latter took place at the apartment of one of the victims. The State argued that the events of March 20, whether or not included as separate counts of the indictment, were relevant to prove defendant's love for Stacey, his jealousy of other men she dated, and, particularly, his animosity toward the victim, Paul Reynolds. The trial court denied defendant's motion to sever the challenged counts from the indictment, observing that it was\n\nsatisfied that the facts surrounding the two dates of March 20 culminating * * * with the homicides of March 22, are so interlocked, so part of the mosaic, as the prosecutor called it, that it would not be possible to tailor that evidence in such a way as to bring out statements and not bring out acts, and especially considering that the acts themselves are part and parcel of the State's total case with intent to prove motive on the part of this defendant, and especially because it seems to me this is a series of events, a series of facts that begins on the 20th, is continued uninterrupted until it results in the homicides, that the chances are * * * that all facts of the March 20 episodes * * * are more than likely going to be coming into evidence in the homicide trials anyway.\n\nWe first look to Rule 3:7-6 to determine whether the challenged counts could properly be joined in the same indictment with the counts relating to the homicides. That Rule provides:\n\nTwo or more offenses may be charged in the same indictment or accusation in a separate count for each offense if the offenses charged are of the same or similar character or are based on the same act or transaction or on 2 or more\n\nacts or transactions connected together or constituting parts of a common scheme or plan. Relief from prejudicial joinder shall be afforded as provided by R. 3:15-2.\n\nIn this context, the critical phrase in Rule 3:7-6 is \"if the offenses charged are * * * based on * * * 2 or more acts or transactions connected together * * *.\" The Rule's phraseology is hardly self-explanatory. See 8 J. Moore, W. Taggart \u0026 J. Wicker, Moore's Federal Practice, para. 8.05[3] (2d ed. 1988) (\"[C]ourts have sometimes found it as difficult to determine when acts are 'connected' as when they are 'the same.'\"). In this case, however, the connection between the events of March 20 and the homicides is readily apparent. The testimony about the events of March 20 included references to a threat by defendant to \"get\" Reynolds for keeping Stacey out late, and to threats by defendant that were directed at Stacey. In addition, defendant threatened Stacey's friend Della Polla by holding a knife to his throat, and later in the evening threatened his life with a sawed-off shotgun. The evidence of defendant's jealousy and threats of violence toward other male friends of Stacey was clearly relevant to the issue of defendant's intent and state of mind at the time of the homicides, and also was material to the State's effort to establish defendant's motive for the murders on March 22. The State's entitlement to offer proof of motive is well settled. State v. Carter, 91 N.J. 86, 102 (1982). In our view, there clearly existed a connection between the events of March 20 and those of March 22 sufficient to authorize joinder of counts relating to both dates in a single indictment, in accordance with Rule 3:7-6. See State v. Briley, 53 N.J. 498, 503 (1969); State v. Begyn, 34 N.J. 35, 56-57 (1961); State v. Manney, 26 N.J. 362, 366 (1958); State v. Cole, 154 N.J. Super. 138, 142-43 (App.Div.1977), certif. denied, 78 N.J. 415 (1978).\n\nDefendant also argues that the trial court abused its discretion in denying defendant's severance motion, alleging significant potential for prejudice because of the consolidation of multiple offenses involving alleged acts of violence in a\n\nsingle indictment. Although joinder of offenses may be permissible under Rule 3:7-6, severance is authorized in the trial court's discretion if joinder is likely to result in prejudice to the defendant. Rule 3:15-2(b) provides:\n\nIf for any other reason it appears that a defendant or the State is prejudiced by a permissible or mandatory joinder of offenses or of defendants in an indictment or accusation the court may order an election or separate trials of counts, grant a severance of defendants, or direct other appropriate relief.\n\nDefendant claims substantial prejudice from joinder of the March 20 counts with the homicide counts. He asserts primarily that the very exposure of the jury to evidence of violent acts allegedly committed by defendant two days prior to the homicides necessarily created in the jurors' minds an unfavorable impression of defendant. Defendant argues that joinder under these circumstances inevitably affected the jury's ability to afford him a fair and impartial trial. Defendant's contentions merit careful evaluation, particularly in a death-penalty prosecution. The potential for prejudice from joinder of multiple offenses in a single criminal trial was illuminated nearly fifty years ago by Judge Learned Hand:\n\nThere is indeed always a danger when several crimes are tried together, that the jury may use the evidence cumulatively; that is, that, although so much as would be admissible upon any one of the charges might not have persuaded them of the accused's guilt, the sum of it will convince them as to all. This possibility violates the doctrine that only direct evidence of the transaction charged will ordinarily be accepted, and that the accused is not to be convicted because of his criminal disposition. Yet in the ordinary affairs of life such a disposition is a convincing factor, and its exclusion is rather because the issue is practically unmanageable than because it is not rationally relevant. When the accused's conduct on several separate occasions can properly be examined in detail, the objection disappears, and the only consideration is whether the trial as a whole may not become too confused for the jury. [ United States v. Lotsch, 102 F.2d 35, 36 (2d Cir.), cert. denied, 307 U.S. 622, 59 S. Ct. 793, 83 L. Ed. 1500 (1939).]\n\nA trial court must be accorded ample discretion in determining whether to grant relief from joinder of offenses because of the potential for prejudice. State v. Briley, supra, 53 N.J. at 503; State v. Manney, supra, 26 N.J. at 368. A critical inquiry is whether, assuming the charges were tried\n\nseparately, evidence of the offenses sought to be severed would be admissible under Evidence Rule 55 in the trial of the remaining charges. State v. Moore, 113 N.J. 239, 274 (1988); State v. Kent, 173 N.J. Super. 215, 220 (App.Div.1980); accord Drew v. United States, 331 F.2d 85, 90 (D.C.Cir.1964). Rule 55 precludes the admissibility of evidence of other crimes to prove defendant's propensity toward criminal conduct, State v. Kociolek, 23 N.J. 400, 419 (1957), but the Rule expressly permits such evidence to prove other facts genuinely in issue, such as motive or intent. Evid.R. 55; State v. Stevens, 115 N.J. 289, 300 (1989); State v. Garfole, 76 N.J. 445, 450 (1978), appeal after remand, 80 N.J. 350 (1979).\n\nWhether the March 20 counts were tried separately or consolidated for trial with the homicide counts, evidence concerning the critical events of March 20 would have been admissible in the trial of the murder charges. Evidence of defendant's jealousy and hostility toward the victim, Paul Reynolds, and toward Della Polla, as well as evidence that defendant threatened to harm Della Polla with a knife and shotgun would have been admissible in the homicide prosecution to prove defendant's state of mind and motive, see State v. Breakiron, 210 N.J. Super. 442, 460-61 (App.Div.1986), rev'd on other grounds, 108 N.J. 591 (1987); State v. Slocum, 130 N.J. Super. 358, 362-63 (App.Div.1974), issues that were sharply contested at trial. Cf. State v. Stevens, supra, 115 N.J. at 301 (Other-crime evidence can be admitted to prove any fact genuinely in issue.). Hence, the prejudice to defendant resulting from joinder of the March 20 counts in the homicide indictment is lessened by the recognition that even if those counts were severed, the homicide jury would have been exposed to evidence recounting the events of March 20. See State v. Coruzzi, 189 N.J. Super. 273, 299 (App.Div.), certif. denied, 94 N.J. 531 (1983) (\"[A] defendant will not suffer any more prejudice in a joint trial than he would in separate trials, because the evidence of the other alleged crimes would be admissible in any event under Evid.R. 55.\").\n\nWe also note that the potential for prejudice created by the joinder of counts in this case was lessened because defendant did not contest his commission of the homicides, focusing his defense on the contention that he was guilty of manslaughter rather than murder. In addition, the trial court, in its instruction, cautioned the jurors to deliberate separately on each of the twelve counts, and to return a judgment of conviction only if convinced that each element of the individual counts had been proved beyond a reasonable doubt. Although the instruction was adequate, it would have been preferable, particularly in a capital case and generally when multiple counts are joined in a single indictment, for the trial court to have emphasized to the jury its duty to avoid any negative or prejudicial impressions that might otherwise be created by the joinder of several criminal charges in a single indictment.\n\nBased on our review of the record, we hold that the trial court's denial of defendant's motion to sever was not an abuse of discretion, and that defendant was not significantly prejudiced by the joinder of the March 20 counts with the homicide counts in the guilt phase of the proceedings. We observe, however, that the trial court did not instruct the jury in the penalty phase, as it was obliged to do, that the evidence relating to the non-homicide counts of the indictment were not to be considered as aggravating factors in the penalty-phase weighing process. State v. Moore, supra, 113 N.J. at 276-77; accord State v. Rose, supra, 112 N.J. at 505-06.\n\nB. Should the Trial Court Have Charged the Jury on Aggravated Manslaughter?\n\n1. Imperfect Self-Defense-Aggravated Manslaughter.\n\nDefendant's counsel acknowledged in his opening statement that defendant had killed Paul Reynolds and Stacey Elizardo, but asserted that the homicides had occurred in the heat of passion provoked by reasonable provocation. According to defense counsel's review of the evidence in summation, the\n\nprovocation consisted of Reynolds' making insulting and mocking remarks to Pitts, Reynolds' suggesting that Stacey was engaging in prostitution to earn money for drugs, an exchange of pushes and shoves, and, finally, Reynolds' telling Pitts that he was going to his bedroom to get a gun. As requested, the trial court charged the jury on passion/provocation manslaughter as a lesser-included offense of murder. N.J.S.A. 2C:11-4b(2).\n\nDefendant did not request a charge of aggravated manslaughter, but did request the trial court to instruct the jury on the doctrine of imperfect self-defense. The argument advanced was that defendant's honest, but not necessarily reasonable, belief that Reynolds' threat to get a gun endangered defendant's safety constituted sufficient provocation to support a verdict of passion/provocation manslaughter. The trial court denied the requested instruction. Before this Court, defendant renews his contention that the trial court erred in refusing to instruct the jury on the doctrine of imperfect self-defense. Alternatively, defendant contends that our decision in State v. Bowens, 108 N.J. 622 (1987), filed after trial but before argument of defendant's appeal, requires a trial court to charge aggravated manslaughter whenever evidence offered to prove imperfect self-defense is material to the state of mind required to prove murder.\n\nIn State v. Bowens, supra, we reviewed the sequence of events leading to adoption of the provisions of the Code of Criminal Justice (the Code) relating to self-defense. Id. at 629. We noted that the legislature expressly rejected a subjective test for self-defense, adopting instead a standard of objective reasonableness to determine when a decision to use force for self-protection was justifiable under the Code. Ibid.; see N.J.S.A. 2C:3-4(a). In Bowens, we also concluded that an honest but unreasonable belief in the need to use force for self-protection, insufficient under the Code to justify an otherwise unlawful homicide, could not of itself constitute a basis for mitigating\n\nhomicide to an unspecified form of manslaughter. Id. at 630-31.\n\nNevertheless, we observed in Bowens that evidence of facts sufficient to establish \"imperfect self-defense\" may in certain cases \"bear directly on the question of whether the homicide was knowing or purposeful, and would be admissible to counter these essential elements of the offense of murder.\" Id. at 632. We noted examples of circumstances in which an unreasonable but honest belief in the need to use force could be pertinent to the elements of Code offenses:\n\nAn example given by the Attorney General of the multi-faceted nature of the defense includes the overreaction in self-defense to aggressive or threatening conduct, e.g., shooting to kill an unarmed attacker who has fallen to the ground. He noted that to the extent the victim's conduct constitutes \"reasonable provocation\" the offense may be mitigated to become the Legislature's special homicide offense, passion-provocation manslaughter. N.J.S.A. 2C:11-4(b)(2). Evidence of imperfect self-defense does not justify the conduct, it mitigates the offense. Another example given is the reckless use of mortal force in self-defense, as when one seeking to repel an attacker disregards a risk that pushing the aggressor down a cliff will result in death. That person may not have committed murder purposely or knowingly but may be guilty of one of the forms of manslaughter: either reckless homicide under N.J.S.A. 2C:11-4(b)(1) or reckless homicide manifesting extreme indifference to human life under N.J.S.A. 2C:11-4(a). The evidence bears on the essential elements of a Code offense. [ Id. at 633.]\n\nAccordingly, we held in Bowens that although imperfect self-defense was not recognized by the Code as a justification for otherwise unlawful conduct,\n\nin many cases the issues of the reasonableness of the defendant's conduct presented to the jury in defense of the substantive crimes charged will have relevance to the essential elements of the homicidal act: whether it was the actor's conscious object to inflict deadly force, whether death was almost certain to follow, or whether the act was done recklessly or with reasonable provocation. [ Id. at 634.]\n\nDefendant contends that our holding in Bowens compels the conclusion that the trial court committed reversible error in failing, sua sponte, to charge aggravated manslaughter on the basis of the evidence that defendant killed Reynolds because of an honest but unreasonable fear for his own safety. However, as we explained in Bowens, not every claim of imperfect self-defense leads to an aggravated manslaughter charge. The predicate for such an instruction, when it is based on evidence of imperfect self-defense, is that such evidence either negates the mental state required for murder, or demonstrates acts of provocation on the part of the victim to an extent sufficient to afford the jury a rational basis for convicting the defendant of one of the Code's forms of manslaughter. N.J.S.A. 2C:11-4a and 4b; see id. at 633. In this case, defendant testified that Reynolds \"made a move to one of the bedrooms * * * to get this gun,\" and it was \"at that time * * * that I pulled the knife out from the back of me and assaulting [ sic ] Paul with that knife.\" Defendant described the assault as \"almost an instantaneous like reflex,\" committed in a \"frenzied type state of mind.\" We construe defendant's testimony relating the Reynolds murder to Reynolds' threat to \"get this gun\" as relevant to the crime of passion/provocation manslaughter, N.J.S.A. 2C:11-4b(2), on which the trial court charged the jury. However, defendant's version of the Reynolds' homicide does not present facts that negate the state of mind indispensable for a conviction of murder, N.J.S.A. 2C:11-3a(1) and (2), or afford the jury a rational basis on which to convict defendant of either aggravated or reckless manslaughter. N.J.S.A. 2C:11-4a or 4b(1). No aspect of defendant's testimony suggested that his state of mind was \"reckless.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Accordingly, we find no error in the trial court's failure to charge aggravated or reckless manslaughter on its own initiative based on defendant's\n\ntestimony offered to prove \"imperfect self-defense\" in connection with the Reynolds homicide.\n\n2. Diminished Capacity -- Aggravated Manslaughter.\n\nExpert psychiatric testimony offered on defendant's behalf included a diagnosis of defendant's mental and emotional condition as well as an opinion concerning defendant's state of mind at the time of the homicides. See supra at 591-592. Although defendant did not argue before us the defense of diminished capacity, N.J.S.A. 2C:4-2; see State v. Breakiron, supra, 108 N.J. 591, nor assert that the testimony of defendant's psychiatric expert supported a charge of aggravated manslaughter, we requested supplemental briefs on these questions. In response to that request, defendant now contends that the testimony of Dr. Cooke concerning defendant's cyclothymic personality disorder, supra at 591, combined with that expert's opinion of defendant's state of mind when he stabbed the victims, supra at 592, compelled the trial court, sua sponte, to instruct the jury on diminished capacity and aggravated manslaughter. The State disagrees sharply, arguing that defendant's psychiatric expert did not establish any connection between defendant's \"personality disorder\" and his state of mind when the homicides were committed. Moreover, the State asserts that throughout the trial defendant conceded that he killed the victims \"knowingly,\" infra at 612-613, but based his entire defense on the theory that the homicides occurred in the heat of passion, induced by reasonable provocation. Finally, the State contends that since defendant did not request instructions on either diminished capacity or aggravated manslaughter, the trial court had no duty \"meticulously [to] sift through the entire record\" to determine if some combination of facts and inferences might support such jury charges. See State v. Choice, 98 N.J. 295, 299 (1985).\n\nIn State v. Breakiron, supra, 108 N.J. 591, we considered the diminished capacity defense and concluded that\n\n[it] was designed by the Legislature not as a justification or an excuse, nor as a matter of diminished or partial responsibility, but as a factor bearing on the presence or absence of an essential element of the crime as designated by the Code. The Legislature contemplated that all are not born with equal mental capacity, and it would want a jury to consider whether a mentally defective person would be as practically certain as would another that death would result from the infliction of a serious blow. [ Id. at 608.]\n\nWe also observed that\n\nthe mere presence of mental disease or defect does not perforce reduce murder to an unspecified degree of manslaughter. For the purpose of determining criminal guilt, diminished capacity either negates the state of mind required for a particular offense, if successful, or it does not. [ Id. at 609.]\n\nAlthough the discussion in Breakiron does not amplify the meaning of the phrase \"mental disease or defect,\" as it is used in N.J.S.A. 2C:4-2, we adverted to the difficulties inherent in attempting to correlate mental diseases with the categories of criminal culpability contained in the Code:\n\nNot every mental disease or defect has relevance to the mental states prescribed by the Code. The variety and forms of mental disease are legion. They range from paranoia and schizophrenia to affective disorders and psychopathy. Some, such as depression or anti-social disorders, have little or no relevance to knowledge. Others, such as schizophrenia, are clearly relevant. Some states have attempted to define the relevant mental diseases or defects. Our Code does not. But \"[b]oth jurists and mental health professionals recognize that there is no perfect correlation between legal standards of 'insanity' and psychiatric classifications of mental disorder.\" [108 N.J. 618-19 n. 10 (citations omitted).]\n\nDefendant's psychiatric expert Dr. Cooke diagnosed defendant as having a \"cyclothymic personality disorder,\" a condition classified as a mental disorder by the American Psychiatric Association. APA, DSM III-R: Diagnostic and Statistical Manual of Psychiatric Disorders (DSM III-R) 226-28 (3d ed. Rev.1987). Dr. Cooke described the condition as a mood disorder that at times causes significant depression, but does not cause one to lose \"contact with reality the way a manic depressant might.\" In addition, Dr. Cooke testified that defendant had a \"chronic anxiety disorder, and above-average level of anxiety on a chronic basis,\" a condition also recognized by the American Psychiatric Association, DSM III-R at 251, and characterized\n\nby unrealistic or excessive anxiety manifested by tension and hyperactivity. Ibid.\n\nAfter testifying to his diagnosis of defendant's mental condition, Dr. Cooke was asked his opinion of defendant's state of mind at the time of the homicides. He explained that that opinion was based on diagnostic tests of defendant, physical evidence at the crime scene, and defendant's statements to him. Although quoted above, supra at 592, the relevance of Dr. Cooke's opinion to the issues under consideration warrants its restatement:\n\n[U]nder that situation he experienced some of that feeling from Vietnam, not a specific flashback, but a feeling in which he perceives himself to be in danger, perceives himself as having to strike out to protect himself in part.\n\nBut even more important, that he had an emotional response there, an impulsive emotional response, not a response where he stopped and thought and decided, \"I will do this, I will do that,\" but, rather, a loss of control under the influence of extreme emotions and what I would say, combining all that data, a rage reaction, a reaction in which his anger reached the point of rage, which I would define as an anger that goes out of control and an anger which interferes with the cognitive ability a person has, planning, judgment, recognizing consequences, deliberating, that in my opinion, he experiences such a loss of control.\n\nDr. Cooke did not expressly connect his opinion of defendant's state of mind to his diagnosis of defendant's mental condition, but observed that his \"testing\" revealed defendant's potential for \"loss of control.\"\n\nOn this record, we cannot conclude that it was plain error for the trial court to have failed to instruct the jury, sua sponte, on diminished capacity and aggravated manslaughter on the hypothesis that defendant's mental condition was the cause of the loss of cognitive ability described in Dr. Cooke's testimony. As Justice O'Hern noted in Breakiron, supra: \"Not every mental disease or defect has relevance to the mental states prescribed by the Code.\" 108 N.J. at 618 n. 10. We also observed in Breakiron that the only evidence of mental disease that should be admitted in respect of diminished capacity \"is that relevant to the question of whether defendant had the requisite mental state to commit the crime.\" Id. at 618. Dr. Cooke did not testify that defendant's state of mind when\n\nhe stabbed the victims was caused by his mental disorders; rather, he based his opinion on what defendant had told him about the homicides and on the physical evidence, as well as on his testing of defendant. Nor did Dr. Cooke testify that defendant's particular mental disorders were generally acknowledged among psychiatrists to be capable of affecting one's ability to possess the state of mind required by the Code for murder. Rather, the thrust of Dr. Cooke's testimony was that defendant committed the homicides in a state of rage, provoked by his emotional reaction to the encounter with Reynolds. Inasmuch as defense counsel did not request a diminished capacity charge, and the evidence offered did not significantly relate defendant's mental disorder to the state of mind described by defendant's psychiatric expert, we hold that it was not plain error for the trial court to have failed, sua sponte, to instruct the jury on diminished capacity and aggravated manslaughter on the theory that defendant's mental condition afforded the jury a rational basis for convicting defendant of the lesser charge. See State v. Choice, supra, 98 N.J. at 299; cf. State v. Juinta, 224 N.J. Super. 711 (App.Div.1988) (plain error for trial court to fail to charge diminished capacity in murder prosecution where principal issue at trial concerned insanity defense).\n\n3. Aggravated Manslaughter -- State-of-Mind Testimony.\n\nAlthough not raised by counsel at trial or before us, the testimony of defendant's expert concerning defendant's state of mind when he stabbed the victims warrants our consideration of the appropriateness of an aggravated manslaughter charge based solely on the expert's state-of-mind testimony. We address this issue independently of defendant's contentions concerning imperfect self-defense and diminished capacity. \"[W]here the death penalty is involved, it is the duty of this Court to examine the record for any errors affecting the substantial rights of the accused, even though not made a ground of appeal.\" State v. Gerald, 113 N.J. 40, 69 (1988)\n\n(quoting State v. Taylor, 213 S.C. 330, 330, 49 S.E. 2d 289, 289 (1948)).\n\nWe focus particularly on Dr. Cooke's statement that defendant experienced \"a loss of control under the influence of extreme emotions * * * a rage reaction, * * * which I would define as an anger that goes out of control and * * * which interferes with the cognitive ability a person has, planning, judgment, recognizing consequences, deliberating * * *.\" Unquestionably, this testimony by Dr. Cooke provided support for the court's instruction to the jury, specifically requested by defense counsel, on passion/provocation manslaughter. As we noted in State v. Bonano, 59 N.J. 515 (1971):\n\nVoluntary manslaughter * * * is an intentional homicide done in sudden passion or heat of blood, without malice aforethought. [ Id. at 523.]\n\nIn State v. Guido, 40 N.J. 191 (1963), we described passion/provocation manslaughter as follows:\n\nVoluntary manslaughter is a slaying committed in a transport of passion or heat of blood induced by an adequate provocation, provided the killing occurs before the passage of time sufficient for an ordinary person in like circumstances to cool off. The common law deemed such circumstances to negate the malice required for murder. Involved is a concession to the frailty of man, a recognition that the average person can understandably react violently to a sufficient wrong and hence some lesser punishment is appropriate. [Id. at 209-10 (citations omitted).]\n\nThus, our cases recognize that evidence sufficient to support a finding that a homicide was committed by one in a state of rage, induced by reasonable provocation, ordinarily would warrant a charge of passion/provocation manslaughter. See State v. Powell, 84 N.J. 305, 319-24 (1980); State v. Bishop, 225 N.J. Super. 596, 605 (App.Div.1988); State v. Washington, 223 N.J. Super. 367, 377 (App.Div.), certif. denied, 111 N.J. 612 (1988).\n\nAlthough Dr. Cooke testified that defendant's \"anger\" interfered with his cognitive ability, the expert did not conclude that defendant lacked the state of mind required for purposeful or knowing murder. Under the Code, conduct is \"purposeful,\" with respect to a result, if it is the person's \"conscious object\"\n\nto cause such a result, N.J.S.A. 2C:2-2b(1); conduct is \"knowing\" if the person is \"aware that it is practically certain that his conduct will cause such a result.\" N.J.S.A. 2C:2-2b(2). The testimony that defendant's anger \"interfered with [his] cognitive ability [for] planning, judgment, recognizing consequences\" was consistent with the concept that the passion sufficient to sustain a passion/provocation manslaughter verdict must disturb a defendant's reason:\n\n[T]o reduce the crime from murder to manslaughter it must appear that the killing occurred during the heat of a passion resulting from a reasonable provocation, a passion which effectively deprived the killer of the mastery of his understanding, a passion which was acted upon before a time sufficient to permit reason to resume its sway had passed. [ State v. King, 37 N.J. 285, 300 (1962).]\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThus the expert's testimony supported a passion/provocation manslaughter theory, but did not describe defendant's state of mind in a manner inconsistent with responsibility for knowing murder. Defense counsel conceded as much in his colloquy with the trial court concerning his request for a charge on imperfect self-defense:\n\nTHE COURT: In terms of the manner in which the case has been tried to this jury we don't have self-defense, we have at best manslaughter, heat of passion, reasonable provocation; if I perceive your defense, that is the way the case has been tried to the jury.\n\nMR. GOLDSTEIN: That is absolutely correct.\n\nTHE COURT: And the knowing aspect of the killing you admit in your opening statement and the defendant testified to it and that is not in issue really:\n\nMR. GOLDSTEIN: That is not in issue that he killed -- that when he was doing what he was doing he was doing it knowingly. That is not in issue. But he was doing it knowingly because he may have in the words of Dr. Cooke \"temporarily misperceived the situation as one in which he had to defend himself and act impulsively and emotionally at the time.\" That is what Dr. Cooke said.\n\nI don't think that means he didn't do it knowingly. In fact, if he has the honest belief that in the need to use deadly force to defend himself, that would be consistent with knowingly because he makes that decision at that time that he must use deadly force to defend himself. What I am saying is that decision is unreasonable under all the facts and circumstances, but it should constitute what was known under 2A as the imperfect self-defense * * *.\n\nMoreover, Dr. Cooke offered no testimony suggesting that defendant's state of mind when he stabbed the victims was reckless rather than purposeful or knowing. See N.J.S.A. 2C:2-2b(3) (\"A person acts recklessly with respect to a material element of an offense when he consciously disregards a substantial and unjustifiable risk that the material element exists or will result from his conduct.\"). Thus, we do not find in Dr. Cooke's expert testimony a rational basis on which the jury could have convicted defendant of any other lesser-included offense of murder, except for passion/provocation manslaughter. See State v. Crisantos (Arriagas), 102 N.J. 265, 276 (1986). Hence, we conclude, based on our review of Dr. Cooke's opinion testimony concerning defendant's state of mind at the time of the homicides, that the trial court properly charged the jury on passion/provocation manslaughter and did not err in omitting to instruct the jury on any other lesser-included offense of murder.\n\nTo recapitulate, we hold that it was not plain error for the trial court to have omitted to charge the jury on aggravated manslaughter -- whether in connection with the proofs offered by defendant bearing on imperfect self-defense, diminished capacity, or state of mind. Examined in the context of the entire trial, defendant's proofs attempted to persuade the jury\n\nthat the homicides, although committed deliberately, were the product of impassioned impulse, provoked by circumstances that caused defendant to lose control of his emotions. The thrust of defendant's proofs was that his actions were uncontrollable, not that his conduct was reckless in the sense of consciously disregarding a known risk. We are satisfied that the jury, charged on passion/provocation manslaughter, was thereby afforded the opportunity to consider that alternate verdict to murder to which defendant's proofs were essentially directed. Thus, although we hold that defendant was not entitled to a charge on aggravated manslaughter, we are also satisfied that its submission to the jury would have had no effect on the verdict.\n\nC. Effect of State v. Gerald.\n\nSubsequent to the trial and argument of the appeal in this case, we held in State v. Gerald, 113 N.J. 40 (1988), that a defendant\n\nwho is convicted of purposely or knowingly causing 'serious bodily injury resulting in death' under N.J.S.A. 2C:11-3(a)(1) and (2), or either of them -- as opposed to one who is convicted of purposely or knowingly causing death under those same provisions -- may not be subjected to the death penalty. [ Id. at 69.]\n\nThe jury in Gerald was instructed, consistent with the literal language of the Capital Punishment Act, N.J.S.A. 2C:11-3a(1) and (2), that a conviction for capital murder could be sustained if it found either that the defendant purposely or knowingly caused death, or that the defendant purposely or knowingly caused serious bodily injury resulting in death. Because we concluded that the evidence in the record was susceptible to either finding, we reversed defendant's capital murder conviction and remanded the matter for a new trial. Id. at 91-92. In our opinion in Gerald we acknowledged, although in a somewhat different context, that the evidence in some capital murder cases was so compelling that there could be \"no question that [the defendant] intended the death of his victim.\" Id. at 79-80 (citing State v. Ramseur, supra, 106 N.J. 123, and State v. Biegenwald, supra, 106 N.J. 13).\n\nThe trial court in this case, without having the benefit of our holding in Gerald, charged the jury in accordance with the statute. Its instruction did not require the jury to determine specifically, as required by Gerald, whether defendant purposely or knowingly caused the death of the victims, or whether defendant purposely or knowingly caused serious bodily injury that resulted in death. The trial court's omission to charge the jury as contemplated by Gerald is of no material significance with respect to defendant's conviction for the murder of Paul Reynolds because the jury did not impose the death penalty. Thus, defendant was exposed to the same sentence that could have been imposed were he to have been convicted of non-capital murder. See State v. Gerald, supra, 113 N.J. at 91.\n\nHowever, because defendant was sentenced to death for the murder of Stacey Elizardo, we must determine whether the trial court's omission of the Gerald charge requires reversal of defendant's murder conviction. We are satisfied that on this record the evidence was minimally adequate to meet the \"rational basis\" standard established in State v. Crisantos (Arriagas), 102 N.J. 265, 278 (1986), which we characterized as imposing a low threshold for a lesser-included-offense charge. Defendant's testimony that Stacey \"was just an image at that time\" and that \"he didn't have the intentional thought to harm these people\" would have warranted the trial court in charging the jury on non-capital murder if Gerald had been decided before the trial of this case. Because we conclude that the Gerald charge would have been appropriate, we consider whether its omission was clearly capable of affecting the verdict. Hence, we evaluate the evidence in the record to ascertain whether the jury's verdict effectively constituted a determination that defendant purposely or knowingly caused the victim's death. Cf. State v. Zola, 112 N.J. 384, 406-07 (1988) (Although trial court's positioning of diminished-capacity instruction had potential for confusing jury about availability of manslaughter verdicts independent of finding of diminished capacity, jury\n\nknew manslaughter was available verdict but concluded that proper verdict was murder.).\n\nBecause the Gerald issue was not raised by the parties, we requested supplemental briefs after argument concerning Gerald 's effect on defendant's conviction for the Elizardo murder. Defendant argues that our holding in Gerald mandates reversal of his conviction for the murder of Elizardo, contending that it was possible for the jury to have determined that he intended only to cause her serious bodily injury and not death. Defendant relies primarily on his own testimony at trial, and that of Dr. Cooke, as a basis for a jury determination that he did not intend to kill Elizardo. On direct examination defendant stated:\n\nAt the time it was a moment that through the month I went past, I can recall now the circumstances. The actual assault was like almost an instantaneous like reflex for me to have assaulted him. I assaulted Paul with the knife; while I was doing so, from back of me was, it was like a frenzied-type state of mind, whereas, that now which I know Stacey was behind me, it was just an image at that time that I wheeled around and I sliced Stacey with the knife at the time.\n\nThe following exchange occurred during defendant's cross-examination:\n\nQ. And you believe it's the macho thing to tell this jury that you killed her because she was prostituting herself and that Reynolds was pimping her, is that what you want this jury to believe?\n\nA. I want the jury to believe that I didn't have the intentional thought to harm these people.\n\nQ. My question, sir, do you really want this jury to believe, not only that you killed her, but you killed her because Paul Reynolds was pimping her as a prostitute, is that what you want this jury to believe?\n\nA. I don't want them to believe anything like that about Stacey.\n\nDr. Cooke testified that defendant told him he was initially unaware that he was assaulting Stacey Elizardo:\n\nHe [defendant, Pitts] also then tells me that out of the corner of his eye he saw what at some times [sic] he described as an image, as a person, didn't know who it was, he says, didn't know if it was a male or female, but had a feeling very much like the feeling that he had when he was in Vietnam, I have to win, I have to survive, I am under attack, things of that nature.\n\nI went into this with him in great detail; this is not a flashback into any specific incident, that is not like he is reliving a specific incident in Vietnam. I am not saying that. What I am saying, he had the general feeling under this stressful situation that he had had at times in Vietnam in just having to win,\n\nhaving to survive, having to strike out until there was no more motion around him. He said that he only afterwards realized that that was Stacey.\n\nDefendant also relies on Dr. Cooke's \"state of mind\" testimony in which he expressed the opinion that defendant killed Reynolds and Elizardo in the heat of a rage reaction, which he described as\n\nan anger that goes out of control and an anger which interferes with the cognitive ability a person has, planning, judgment, recognizing consequences, deliberating, that in my opinion, he experiences such a loss of control.\n\nThe State concedes that the trial court did not charge the jury as required by Gerald, but contends that the evidence leaves \"no doubt\" that defendant purposely or knowingly killed Stacey Elizardo. The State relies in part on defense counsel's opening statement to the jury:\n\nNow, I am going to tell you that the evidence will indeed show that on March 22nd, 1984 Darryl Pitts did stab Paul Reynolds and Stacy Elizardo to death. It is not in this trial so much a question of what happened on that day as it is in fact a question of why it happened.\n\n[I]t's our position that the evidence will show that Darryl was a sane, capable man who was provoked into a rage which literally compelled him to take part in this Vietnam style killing.\n\nThe State also refers to defendant's threat to kill Elizardo on March 20, 1984, and to defendant's concession on cross-examination that \"you use a combat knife when you want to kill somebody.\"\n\nThe State relies primarily on the testimony of the medical examiner to demonstrate that the wounds defendant inflicted on Elizardo were so numerous and penetrating that it would be \"inconceivable\" and \"irrational\" for the jury to have found that defendant meant to cause serious bodily injury but not death. The State notes that Elizardo's throat was cut twice, and that \"defendant drove the knife so deep into her chest three different times that it penetrated the chest and severed the vital aorta artery, esophogus [sic], and lungs, and fractured her third rib.\" The State refers to several stab wounds that penetrated through the skull and into the brain. The State also relies on an\n\nautopsy report that revealed twenty-five to thirty separate stab wounds, the deepest of which penetrated six inches into the victim's body.\n\nThe State observes that after the homicides defendant took the pulse of both victims and determined that they were dead. Moreover, according to James Gibbs who was waiting in the car when defendant returned, he told Gibbs \"I cut her throat, you don't have to worry about her.\" Gibbs stated that Pitts explained that the victims owed him money and said \"[s]ee what I mean about paybacks is a bitch.\"\n\nThe State also contends that the evidence of intent to kill is\n\nat least as powerful, if not more powerful, in this case than it was in Ramseur. The manner of killings here -- multiple stabbings -- is similar to that in Ramseur as is the prior threats of death. However, here there is the peculiarly compelling evidence of intent to kill, as previously set forth, not present in Ramseur, which unquestionably reveals defendant's conscious object to cause the death of Paul Reynolds and Stacy Elizardo. (Footnote omitted.)\n\nIt is evident that the proofs before the jury overwhelmingly established that defendant's assault of Elizardo was so violent that death was inevitable. The medical examiner described the wounds as \"deep, penetrating injuries.\" Defendant does not dispute the severity of the wounds inflicted during his assault of Elizardo. Rather, defendant contends that on the basis of his testimony that he assaulted an \"image,\" in a \"frenzied-type state of mind,\" the jury could have concluded that his intent was to inflict serious bodily injury rather than death.\n\nWe first observe that the arguments advanced by defendant in respect of the Gerald issue were those submitted to the jury to support the contention that defendant was guilty only of passion/provocation manslaughter. The jury heard defendant testify that he assaulted an \"image,\" not knowing it was Stacey Elizardo. Defense counsel, in summation, told the jury that when Reynolds told defendant\n\nStacey has been sleeping with other men * * * to get money for drugs * * * this so enrages and so provokes Darryl that he falls into what Dr. Cooke called a raged reaction and he falls back on his training and his instincts from Vietnam and you have the fatal results that we have in this case.\n\nThe jury was instructed on passion/provocation manslaughter. Its verdict was a rejection of defendant's contention that he killed in the heat of rage, or passion, brought on by reasonable provocation.\n\nWe also note that defendant's testimony that he assaulted an \"image,\" not knowing it was Stacey Elizardo, was contradicted by defendant's second statement to the police, which was read to the jury during the State's case:\n\nHe was cut but it wasn't severe enough but you can cut a human being and usually they'll stay alive three minutes. That's a known fact. According to you gentlemen, he was stabbed. All this is going on fast. This couldn't have taken no more than ten, 15 seconds. When [Stacy] came out of the room, what the fuck you doing, jerkoff, and on and on and on. I said because my fucking money is not in my hand and it went on. That's when I, you know, attacked her. * * *\n\n[After Reynolds had fallen against the wall, Stacy] went into hysterics. And when the hysterics went down, that's when I fucked up\n\nI guess originally it started as a struggle because I grabbed her and I tried to cut her throat. I told you before, you can use [the combat knife for] cutting someone's throat. [Emphasis added.]\n\nIn addition, defendant's direct testimony confirmed that he knew Elizardo was in the apartment because he saw her shoes and coat, and Reynolds said she was asleep. Supra at 590. Thus, the jury had ample basis in the record to reject defendant's assertion that because of his \"rage,\" he was unaware until it was too late that Elizardo was the victim of his second assault.\n\nBut on the question that is decisive of the Gerald issue, whether the assault had as its objective serious bodily injury or death, the evidence consists almost entirely of testimony demonstrating either defendant's purpose to kill or his knowledge that death was practically certain to occur. The medical examiner's description of the wounds on Elizardo's body incontrovertibly portrayed an assault that would take the victim's life. In defendant's second statement to the police he admitted that he attempted twice to cut Elizardo's throat. Defendant's pausing to take the pulse of the victims to verify their death and his\n\nincriminating statements to James Gibbs supplement the evidence demonstrating that defendant's objective was death and not serious bodily injury.\n\nIf the jury in this case also had been charged in accordance with Gerald, it would have been required to determine whether defendant intended to kill Elizardo, or, alternatively, intended to cause her serious bodily injury. We concur with the State's conclusion that on this record it would be virtually \"inconceivable\" that a jury could have concluded that defendant intended to cause serious bodily injury to Elizardo, but not death.\n\nWe expressed in State v. Bey, 112 N.J. 45 (1988), our belief that\n\nin death penalty cases an appellate court must subject the record to intense scrutiny. The stark fact that a litigant's life is at stake intensifies the obligation of judicial review. [ Id. at 92-93.]\n\nWe also set forth in Bey the standard for assessing the effect of error in capital cases:\n\nThus, in assessing the impact of error in either the guilt or penalty phase of a capital case, we shall continue to determine reversibility on the basis of a qualitative determination that considers, in the context of the entire case, whether the error was clearly capable of affecting either the verdict or the sentence. * * * We are satisfied that its application in capital cases is sufficiently flexible to accommodate our heightened concerns and responsibilities in reviewing death-penalty prosecutions. [ Id. at 94-95.]\n\nAfter a meticulous review of the record in this case, we are convinced that the jury's verdict was a determination that defendant purposely or knowingly caused the death of Stacey Elizardo. We are fully satisfied that the trial court's omission of the charge required by Gerald was not capable of affecting the jury's verdict. Moreover, we are convinced that \"there was no realistic likelihood of prejudice\" resulting from such omission, a standard of review proposed by our concurring colleague in Bey. 112 N.J. at 116 (Handler, J., concurring). No matter how indulgently this record is read, we cannot conceive that the jury, charged in accordance with Gerald, would have concluded that defendant intended to cause Elizardo serious bodily injury, but not death.\n\nIV.\n\nGuilt and Penalty Phase Issues\n\nAdmissibility of Psychiatric Expert Testimony Based on Sodium Amytal Interview of Defendant\n\nDuring the guilt phase of the trial, defendant proffered the expert testimony of Dr. Robert Sadoff, a highly qualified forensic psychiatrist, concerning defendant's state of mind at the time of the homicides. Defense counsel advised the trial court that Dr. Sadoff's testimony was based in part on an interview while defendant was under the influence of an intravenously-administered barbiturate known as sodium amytal. The trial court conducted an extensive hearing pursuant to Evidence Rule 8 to determine the admissibility of the expert testimony. The Rule 8 hearing included testimony from Dr. Sadoff and two other highly qualified psychiatrists, Dr. Martin Orne for the State and Dr. Joseph DiGiacomo for the defendant. Following the hearing, the trial court ruled that Dr. Sadoff would not be permitted to give expert testimony in the guilt phase that was based on factual conclusions derived from defendant's statements during the sodium-amytal interview. However, the court ruled that Dr. Sadoff's opinion would be admissible if based on hypothetical facts consistent with evidence in the record. See Evid. R. 58.\n\nDuring the penalty phase of the case, defense counsel again sought to elicit Dr. Sadoff's expert testimony to support the existence of mitigating factors. The trial court ruled, as it did in the guilt phase, that Dr. Sadoff's expert testimony was also inadmissible in the penalty phase if based on facts gleaned from defendant's sodium-amytal interview. Although the trial court suggested that Dr. Sadoff could base his expert testimony in the penalty phase on facts already in evidence by virtue of defendant's guilt phase testimony, defense counsel advised the trial court that Dr. Sadoff would not testify because of the limitations imposed by the trial court's ruling. Defendant contends before us that the trial court's rulings in both the\n\nguilt and penalty phases were erroneous, requiring reversal of defendant's convictions for murder as well as reversal of his death sentence.\n\nThe general principles that determine the admissibility of scientific-type evidence were recently summarized in Romano v. Kimmelman, 96 N.J. 66 (1984):\n\nIn New Jersey, the results of scientific tests are admissible at a criminal trial only when they are shown to have \"sufficient scientific basis to produce uniform and reasonably reliable results and will contribute materially to the ascertainment of the truth.\" State v. Hurd, 86 N.J. 525, 536 (1981) (quoting State v. Cary, 49 N.J. 343, 352 (1967)). Scientific acceptability need not be predicated upon a unanimous belief or universal agreement in the total or absolute infallibility of the techniques, methodology or procedures that underlie the scientific evidence. * * * Reliability of such evidence must be demonstrated by showing that the scientific technique has gained general acceptance within the scientific community. State v. Johnson, 42 N.J. 146, 170-71 (1964). The fact that a possibility of error exists does not preclude a conclusion that a scientific device is reliable. This Court in Johnson noted: \"Practically every new scientific discovery has its detractors and unbelievers, but neither unanimity of opinion nor universal infallibility is required for judicial acceptance of generally recognized matters.\" Id. at 171 Once the showing of general acceptability has been made, courts will take judicial notice of the given instrument's reliability and will admit in evidence the results of tests from the instrument without requiring further proof. [Id. at 80.]\n\nThus, in determining the admissibility of evidence derived from scientific procedures, a court must first ascertain the extent to which the reliability of such procedures has attained general acceptance within the relevant scientific community. See Windmere, Inc. v. International Ins. Co., 105 N.J. 373, 377-79 (1987). Testimony by qualified experts is an acknowledged method for proving general acceptance of a scientific procedure. Id. at 379-82.\n\nThe testimony at the Rule 8 hearing revealed substantial agreement among the three experts concerning the scientifically acceptable uses of testimony induced by sodium amytal. The witnesses agreed that sodium-amytal-induced interviews are not considered scientifically reliable for the purpose of ascertaining \"truth.\" See also State v. Sinnott, 24 N.J. 408, 421 (1957) (\"The general consensus appears to be that while the 'truth\n\nsera' are valuable as a diagnostic aid because they tend to diminish the inhibitions of the subject being interviewed, they do not in any wise provoke a certainty of truth-telling on his part.\"). See generally Dession, Freedman, Donnelly \u0026 Redlich, Drug-Induced Revelation and Criminal Investigation, 62 Yale L.J. 315 (1953) (hereafter Dession, Drug-Induced Revelation) (\"Thus the bare results of an interview under the influence of drugs should not, standing alone, be considered a valid and reliable indicator of the facts.\"). Id. at 342.\n\nThe experts also expressed general agreement that sodium-amytal-induced interviews, conducted by trained psychiatrists, may be useful diagnostically as a component of a comprehensive psychiatric evaluation. See, e.g., Dession, Drug-Induced Revelation, supra, 62 Yale L.J. at 342. However, the expert witnesses had somewhat different views concerning the use of an interview induced by sodium amytal to determine a suspect's state of mind when committing a criminal act. Dr. Orne, the State's expert, expressed significant reservations about the use of sodium amytal to determine state of mind. Although Dr. Orne agreed that sodium-amytal interviews could be useful diagnostically and therapeutically, he testified that the drug was not appropriate for use in a forensic setting to determine state of mind: \"To the extent that the state of mind on an historical event involves making judgments between two or three different statements that the patient has made and you don't know which is true [sic]. You are using it as a truth-telling device and there is no use for that.\" Dr. Orne expressed the opinion, based on Dr. Sadoff's reports and a videotape of the sodium-amytal interview, that Dr. Sadoff relied on the interview to ascertain which of the defendant's versions of the homicides was truthful. Dr. Orne also noted that Dr. Sadoff's questioning of defendant during the amytal interview was leading and suggestive.\n\nDr. DiGiacomo, defendant's expert, testified that a sodium-amytal interview could be useful in assessing state of mind, and observed that a trained psychiatrist could use theinterview\n\ndiagnostically to determine if a suspect was psychotic or suffered from a traumatic neurosis. Dr. DiGiacomo testified that his review of the videotaped interview caused him to believe that defendant was not \"totally in control\" when he killed Stacey, and also helped him to rule out psychosis or neurosis as a reason for the homicides. During questioning by the court, Dr. DiGiacomo conceded that he found \"troublesome\" that portion of Dr. Sadoff's report suggesting reliance on the amytal interview to determine the \"veracity and reliability\" of defendant's statements.\n\nDr. Sadoff testified that he had interviewed defendant twice before conducting the interrogation with sodium amytal, the first time to determine competency to stand trial and the second time at the specific request of defendant's trial counsel. He explained that the significant differences between defendant's versions of the homicides on these two occasions, as well as defendant's accounts of his Vietnam combat experiences, prompted him to recommend an interview using sodium amytal. Dr. Sadoff testified that defendant's responses to leading questions about Vietnam during the amytal-induced interview persuaded him that defendant had not experienced a \"Vietnam flashback\" when he committed the homicides and enabled him to rule out post-Vietnam stress syndrome as an explanation for defendant's actions. Dr. Sadoff further testified to his conclusion, based on the amytal interview, that at the time of the homicides Pitts believed that Reynolds was causing Elizardo to engage in prostitution, and, enraged by that belief, defendant killed both Reynolds and Elizardo. Dr. Sadoff acknowledged that he had no opinion about whether Reynolds actually had enticed Elizardo into prostitution, but concluded, based on Pitts's statements while under the influence of sodium amytal, that Pitts's belief that that had occurred was truthful and caused him to commit the homicides. During questioning by the trial court, Dr. Sadoff acknowledged that he derived from the sodium-amytal interview the opinion that Pitts killed the victims in a state of rage because of Pitts's belief that Reynolds\n\nwas \"pimping\" Stacey, but denied that he had used the amytal interview to ascertain the truth of any facts other than what Pitts believed at the time of the homicides. Dr. Sadoff also acknowledged, during questioning by the trial court, that he could render an opinion on defendant's state of mind without reliance on the amytal interview if the critical facts concerning defendant's belief were included in a hypothetical question propounded by counsel.\n\nAt the conclusion of the Rule 8 hearing, the trial court held that Dr. Sadoff would not be permitted to rely on the sodium-amytal interview in expressing an opinion about defendant's state of mind when he killed Paul Reynolds and Stacey Elizardo. The court concluded that Dr. Sadoff had \"relied on sodium amytal to determine the truth or veracity of what the defendant believed.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Acknowledging agreement among the three expert witnesses that sodium-amytal interviews are not scientifically reliable for ascertaining truth, the trial court concluded that Dr.\n\nSadoff's proposed use of the amytal interview was unreliable and therefore impermissible. The court specifically noted, however, that Dr. Sadoff would be permitted to render his expert opinion about defendant's state of mind if based on a hypothetical question consistent with the evidence in the case. Nevertheless, defendant's counsel made no further attempt to elicit Dr. Sadoff's testimony during the guilt phase of the case.\n\n9\n\nIn the guilt phase the trial court did not specifically decide the question whether defendant's expert could use the sodium-amytal interview diagnostically, as a basis for an expert opinion concerning defendant's state of mind at the time of the homicides:\n\nThe distinction from this case is that there is an attempt on Dr. Sadoff's part to use it as a so-called diagnostic tool of some sort and on the basis of that to give an opinion to the jury concerning the state of mind of the defendant at the time these offenses were committed. So that raises a sub-issue as to whether or not the test is reliable enough to a psychiatrist using it to enable or allow him to give an opinion to a jury which is based upon the employment of that test. And I think this case doesn't even require this Court to make that determination in any broad or general terms, because the very limited question involved here is the use of the test by Dr. Sadoff and whether he used it to ascertain truth or whether he used it as some sort of a diagnostic tool having no relationship to truth or falsity, because it does appear in those situations where it is allowed, it is allowed because the expert psychiatrist who employs it does not employ it to determine the truth and his opinion as a result of its use is not based upon the truth or falsity of what was ascertained because it makes no difference to the opinion given.\n\nIn this case, my very strong impression is Dr. Sadoff used it * * * for the purpose of ascertaining the belief of the defendant which is a fact and based upon that fact he has formulated his opinion, which is to say that he has relied on sodium amytal to decide the truth or veracity of what the defendant believed.\n\nHowever, the clear implication of the trial court's ruling was that a sodium-amytal interview could be used diagnostically as a basis for an expert's opinion, as our dissenting colleague suggests, post at 666, provided the content of the interview is not offered to prove the truth of the declarant's statements.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e As noted above, supra at 621, at the conclusion of the penalty phase defense counsel again sought to elicit Dr. Sadoff's expert testimony on defendant's state of mind to support the mitigating factor set forth in N.J.S.A. 2C:11-3c(5)(a): \"The defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution.\" The trial court ruled, as it did in the guilt phase, that Dr. Sadoff could not rely on the sodium-amytal interview to express an opinion about defendant's state of mind based on defendant's beliefs at the time of the homicides. The court observed, however, that defendant had testified in the guilt phase about the very same \"beliefs\" that Dr. Sadoff learned of during the amytal interview. Hence, the court emphasized that Dr. Sadoff could testify about defendant's state of mind in the penalty phase on the basis of defendant's direct testimony, but could not base his opinion on the truthfulness of statements made by defendant during the sodium-amytal interview. The trial court was asked specifically by defense counsel if his ruling precluded defendant's expert from offering any state-of-mind opinion 2 based on the sodium-amytal interview. In response, the trial court acknowledged the diagnostic value of sodium-amytal interviews but declined to rule \"in a vacuum\" on\n\nthe admissibility of such testimony.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Defense counsel did not call Dr. Sadoff to testify in the penalty phase of the case.\n\nWe are fully in accord with the trial court's holding that precluded Dr. Sadoff from using the sodium-amytal-induced interview of defendant to provide expert opinion testimony on defendant's state of mind in the guilt phase of the trial. We find the trial court's assessment of Dr. Sadoff's Rule 8 testimony to be perceptive and accurate. Although Dr. Sadoff may have used defendant's amytal interview diagnostically to some extent, it is uncontrovertible that he relied on the interview\n\nto ascertain the truth of defendant's beliefs about the reasons he had committed the homicides. Thus, state-of-mind testimony by Dr. Sadoff, based on defendant's \"beliefs\" expressed during the amytal interview, would have exposed the jury to an expert opinion derived at least in part from a scientific procedure that has not attained general acceptance in the scientific community.\n\nOn the two occasions that this Court has considered the question, we have concluded, based on the then-existing state of scientific knowledge, that testimony derived from a sodium-amytal-induced interview is inadmissible to prove the truth of the facts asserted. See State v. Levitt, 36 N.J. 266, 275 (1961); State v. Sinnott, supra, 24 N.J. at 421-23. Our rule is consistent with the views expressed by other courts that have addressed the issue. See United States v. Solomon, 753 F.2d 1522, 1525-26 (9th Cir.1985); United States v. Swanson, 572 F.2d 523, 527-28 (5th Cir.), cert. denied, 439 U.S. 849, 99 S. Ct. 152, 58 L. Ed. 2d 152 (1978); Chapa v. Chapa, 491 So. 2d 969, 970-71 (Ala.Civ.App.1986); State v. Thomas, 79 Ariz. 158, 285 P. 2d 612, 613-14 (Sup.Ct.1955), cert. denied, 350 U.S. 950, 76 S. Ct. 326, 100 L. Ed. 828 (1956); Fetters v. State, 436 A.2d 796, 800 (Sup.Ct.Del.1981); Harper v. State, 249 Ga. 519, 292 S.E. 2d 389, 395-96 (Sup.Ct.Ga.1982); State v. Linn, 93 Idaho 430, 462 P. 2d 729, 732 (Sup.Ct.1969); State v. Rosencrantz, 110 Idaho 124, 714 P. 2d 93, 99 (Idaho App.1986); State v. Foerstel, 674 S.W. 2d 583, 593-94 (Mo.App.1984); State v. Delk, 692 S.W. 2d 431, 439 (Tenn.Cr.App.1985); Cain v. State, 549 S.W. 2d 707, 711-12 (Texas Cr.App.), cert. denied, 434 U.S. 845, 98 S. Ct. 149, 54 L. Ed. 2d 111 (1977). The expert testimony adduced at the Rule 8 hearing indicated that the scientific community continues to view testimony induced by sodium amytal as unreliable to ascertain truth. Thus, the trial court's ruling excluding Dr. Sadoff's testimony in the guilt phase was consistent with our precedents, with the weight of authority throughout the country, and also with contemporary scientific knowledge as reflected by the expert testimony. Moreover, the trial court\n\nproperly acknowledged that Dr. Sadoff could furnish expert testimony based on a hypothetical question, supported by other evidence in the record, that set forth the facts revealed to Dr. Sadoff during the sodium-amytal interview. We find no error in the trial court's disposition of this issue.\n\nNor do we find error in the trial court's ruling that precluded Dr. Sadoff from furnishing expert testimony in the penalty phase that relied on factual conclusions derived from the sodium-amytal interview. In this connection, we first observe that the jury determined that the mitigating factor to which Dr. Sadoff's testimony was directed, N.J.S.A. 2C:11-3c(5)(a),\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e existed with respect to both homicides. We acknowledge, of course, that the weight the jury ascribed to that mitigating factor may have been affected by the exclusion of Dr. Sadoff's testimony.\n\nDefendant contends that the trial court's ruling concerning Dr. Sadoff's testimony in the penalty phase was error. Defendant relies on State v. Davis, 96 N.J. 611 (1984), and State v. Timmons, 192 N.J. Super. 141 (Law Div.1983), in support of his assertion that a much less stringent standard should be applied to evidence proffered by a defendant in the penalty phase of a capital case than that which governs admissibility during the guilt phase.\n\nWe note that since the trial of this case the legislature has dealt with the essence of defendant's contention, although not its specific application in this case, by amending the Capital Punishment Act to prescribe a more tolerant standard of admissibility for evidence offered by a defendant to support one or more mitigating factors. N.J.S.A. 2C:11-3(c)(2)(b) now provides:\n\n(b) The admissibility of evidence offered by the State to establish any of the aggravating factors shall be governed by the rules governing the admission of evidence at criminal trials. The defendant may offer, without regard to the rules governing the admission of evidence at criminal trials, reliable evidence relevant to any of the mitigating factors. If the defendant produces evidence in mitigation which would not be admissible under the rules governing the admission of evidence at criminal trials, the State may rebut that evidence without regard to the rules governing the admission of evidence at criminal trials. [ L. 1985, c. 178 (approved and effective June 10, 1985).]\n\nAlthough we need not literally apply the provisions of N.J.S.A. 2C:11-3(c)(2)(b) to the issue before us,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the thrust of that amendatory provision was foreshadowed by our holding in State v. Davis, supra, 96 N.J. 611. In that case defendant pled guilty to murder and sought to offer in the penalty phase of the proceeding expert testimony from a professor of sociology, based on statistical data, that a person sharing defendant's statistical profile would be unlikely to commit further crimes if released from prison after serving the mandatory minimum thirty-year term. Although expressly declining to rule on the admissibility of the proposed testimony in respects other than relevancy, we held that the proffered expert testimony \"generally satisfies broad standards of relevancy\" and hence was admissible to establish a mitigating factor in the penalty phase. Id. at 621. In reaching that conclusion, we \"ascribe[d] to the Legislature full appreciation of the singular nature of the penalty phase of a capital proceeding and the ineluctable conclusion that doubts must be resolved in favor of admission when evidence of a mitigating factor is offered by the defendant.\" Id. at 620. We specifically noted that our determination\n\nwas \"consistent with Senate Bill 950, the proposed amendment to N.J.S.A. 2C:11-3 * * *.\" Id. at 621 n. 1.\n\nOur opinion in Davis also set forth broad guidelines for determining the admissibility of evidence to establish mitigating factors in the penalty phase of a capital case:\n\nWe stress, however, that the conventional standards of competency, relating to both the expert's qualifications and the scientific reliability of the subject matter, are not to be strictly applied in this context -- the penalty phase of a capital proceeding -- in which the choice before the jury is between life and death.\n\nWe have recognized that standards of proof may vary depending upon the litigational context. Evidential rules or standards of admissibility in the sense of the authenticity or competency of evidence may likewise be varied depending upon the purpose to be served by the evidence. With respect to the sentencing of a convicted criminal, as noted, we have been extraordinarily tolerant as to the subject and form of evidence to be considered in this most delicate kind of determination. * * *\n\nA lowered threshold of admissibility for evidence proffered in mitigation of the death penalty in the sentencing phase of a criminal proceeding is consistent with this recognition. In this setting, it would be incorrect for the court to apply the evidential prerequisites with the same strictness that is required in the guilt phase of the trial. When guilt is not the determinative issue, greater flexibility and latitude may be accorded a factfinder in his or her use of expert testimony.\n\nTo the extent that evidence of the type sought to be proffered in the case at bar arguably may suffer shortcomings when measured by strict rules of evidential relevance and competence, such deficits will go to the weight of the testimony, properly relegating to the adversarial process the task of \"separating the wheat from the chaff.\"\n\nHowever, relaxed standards for admissibility are not to be equated with automatic admissibility. Judicial tolerance is not judicial license. For example, in this case the court may, upon a persuasive showing, consider the report, or any of its component parts, incomplete and therefore unhelpful. Arguably, the report could, upon countervailing proofs presented by the prosecutor through cross-examination or rebuttal evidence, be considered untrustworthy because of its failure to consider the educational background, employment history, familial status, criminal record, or some other important demographic factor relating to the potential for rehabilitation. It might also be considered flawed because of its use of, or its undifferentiated emphasis upon, statistical data based upon race, gender, or some other suspect characteristic. The court must retain discretion to exclude the evidence, in whole or in part, if its probative value is substantially outweighed by its unfounded or speculative character and the risk of confusion of the essential issues. [ Id. at 621-24 (citations and footnote omitted).]\n\nApplication of the principles enunciated in Davis does not produce a simplistic resolution of the issue before us. As noted above, supra at 585-586, defendant's death sentence must be reversed on other grounds. Thus, the admissibility of Dr. Sadoff's penalty phase testimony is not of critical consequence to our disposition of this appeal. Nevertheless, its resolution is desirable here since the issue may present itself again on remand and may also recur in other capital proceedings.\n\nWe consider two factors to be particularly decisive in our conclusion that the trial court properly excluded the proffered testimony of Dr. Sadoff. First, we read the record of the Rule 8 hearing as demonstrating a concession by Dr. Sadoff that he used the sodium-amytal interview to establish the truth of defendant's belief about the reason he murdered the victims, a use that appears to conflict with the prevailing opinions in the scientific community concerning the reliable uses of sodium-amytal-induced testimony. Second, the trial court offered defense counsel the opportunity to elicit Dr. Sadoff's expert opinion in the penalty phase on the basis of defendant's direct testimony in the guilt phase that was virtually identical to the statements elicited by Dr. Sadoff from defendant during the sodium-amytal interview. Although we acknowledge that Dr. Sadoff's opinion based on the defendant's statements during the amytal interview, corroborated by defendant's direct testimony, might have had a greater impact on the jury, we cannot criticize the trial court for balancing the potential impact of the proposed testimony against its apparent unreliability. We read the trial court's ruling as acknowledging Dr. Sadoff's right to testify to his expert opinion of defendant's state of mind based in part on the sodium-amytal interview, relying on defendant's trial testimony, rather than his statements during the amytal interview, to establish defendant's belief about why he killed Reynolds and Elizardo. In our view, the trial court's disposition of this issue was pragmatic, balanced, and thoroughly consistent with the relaxed standards of admissibility endorsed\n\nby our opinion in Davis. Hence, we find no error in the trial court's ruling.\n\nHad the state of the record not permitted the trial court to offer Dr. Sadoff the opportunity to testify based on defendant's guilt-phase testimony, application of the principles set forth in Davis would have suggested that Dr. Sadoff be permitted to testify about his opinion based on defendant's beliefs expressed in the amytal interview. In that event, the trial court would have been compelled to charge the jury concerning the unreliability of facts learned from a subject testifying under the influence of sodium amytal, and Dr. Sadoff's opinion could have been challenged on cross-examination and by rebuttal testimony. Total exclusion of penalty-phase evidence to support a mitigating factor should occur only in those circumstances in which a trial court is convinced that its admission, taking into account the balancing effects of cross-examination, rebuttal testimony, and curative instructions, would frustrate rather than advance society's interest in according a fair trial to a capital defendant.\n\nV.\n\nPenalty Phase Issues\n\nA. Aggravating Factor 2C:11-3c(4)(c).\n\nSince the trial of this case occurred before our decisions in State v. Ramseur, supra, 106 N.J. 123, and State v. Biegenwald, supra, 106 N.J. 13, the trial court, in charging the jury concerning aggravating factor c(4)(c),\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e did not have the benefit\n\nof our narrowing construction of that aggravating factor. See State v. Ramseur, supra, 106 N.J. at 198-211. We noted in Ramseur that the introductory language of factor c(4)(c) (\"[t]he murder was outrageously or wantonly vile, horrible or inhuman\"), \"is indefinite beyond anyone's ability to remedy * * *.\" Id. at 199. Thus, we determined that in the application of this aggravating factor \"the first part of the provision is rendered nugatory. The resultant construction is that the aggravating factor exists when the murder 'involved torture, depravity of mind, or an aggravated battery to the victim.'\" Ibid. We also adopted in Ramseur a narrowing construction of c(4)(c) in order to satisfy constitutional standards, and we concluded that the defendant's state of mind was the critical element:\n\nWe are convinced that the essence of the legislative concern is the defendant's state of mind. We do not believe that the Legislature intended to distinguish between two murderers each of whom intended to inflict immediate death upon the victim without any additional suffering whatsoever, when one victim dies immediately and the other lives for a long period of time and experiences excruciating pain. That capricious event alone would be perceived as an insufficient basis on which to inflict death on that defendant while imposing imprisonment on the other. Our system of criminal laws is predicated usually on the imposition of punishment based on the defendant's intent. Indeed, our Code's ranking of crimes by degree places those crimes committed with intentional conduct as the highest degree of crime, for which the defendant is most severely punished. Society's concern, the community's concern, the Legislature's concern, is to punish most harshly those who intend to inflict pain, harm, and suffering -- in addition to intending death. [106 N.J. at 207-08.]\n\nWe also set forth in Ramseur the essential elements of a proper charge to a jury on factor c(4)(c):\n\nTherefore, depending on the facts, the jury should be charged -- without quoting the statute -- that this aggravating factor exists if the murder involved torture, depravity of mind, or an aggravated battery to the victim. Torture or aggravated battery to the victim shall be found if the defendant intended to cause, and did in fact cause, severe physical or psychological pain or suffering to the victim prior to the victim's death, \"severity\" measured either by the\n\nintensity of the pain, or the duration of the pain, or a combination of both. Where the murder was not the product of greed, envy, revenge, or another of those emotions ordinarily associated with murder, and served no purpose for the defendant beyond his pleasure of killing, the court shall instruct the jury on the meaning of depravity in this specific context. For the defendant who killed for the enjoyment of it, because the victim just happened to be in the area, or for no reason at all, just to kill, society must be able to reserve its most extreme sanction. [106 N.J. at 211 (footnotes omitted).]\n\nAccordingly, defendant contends that the trial court's c(4)(c) charge was error, and the State acknowledges, as indeed it must, that the charge did not conform to our holding in Ramseur. This constitutes an additional ground for reversal of defendant's death sentence.\n\nAlthough at oral argument defense counsel agreed with the State's assertion that aggravating factor c(4)(c) could be submitted to the jury in the event, on remand, the State again sought to impose the death penalty, we would caution the trial court that on an issue of that magnitude counsel's concession could not relieve the trial court of its responsibilities. Thus, if the issue is presented on remand, the trial court must independently assess the State's proofs, in the context of our holding in Ramseur, in order to determine whether the State has adduced sufficient evidence that defendant intended to and did inflict severe physical or psychological pain on Elizardo before her death to support a jury finding that this factor exists.\n\nB. Admissibility of Crime Scene and Autopsy Photographs in Penalty Phase.\n\nDuring the guilt phase of the trial, three photographs were admitted in evidence without objection. The photographs depicted the interior of Reynolds' apartment, the stairwell outside the apartment, and the location of the victims' bodies. On defense counsel's objection, the trial court excluded three other photographs of the victims under Evidence Rule 4, and also excluded on the same ground a series of autopsy photographs of the victims.\n\nDuring the penalty phase of the case, the State sought again to introduce in evidence the crime scene and autopsy photographs that had been excluded in the guilt phase. Defense counsel objected, contending that the close-up color photographs of the bloodstained victims and the close-up autopsy photographs depicting the location of the stab wounds were highly inflammatory and so potentially prejudicial as to out-weigh any relevance of the photographs to any issue in the penalty phase. The trial court, applying as noted above, supra at 635, a pre- Ramseur interpretation of aggravating factor c(4)(c), ruled the photographs to be admissible:\n\nFirst with respect to the three already marked, S-11, 12 and 16, and generally with respect to all of them, it seems to me where the burden of the State is to prove that the killing was outrageously or wantonly vile, horrible or inhuman, involving an aggravated battery to the victim or torture, that it would be foolhardy to say that the pictures which demonstrate graphically the extent of the wounds -- especially with respect to the autopsy pictures demonstrate the extent of the wounds, the nature of the wounds and on what parts of the body they were inflicted, the pictures indicating the crime scene which again demonstrate, inferentially at least, the violence which must have been involved to give rise to that particular scene are all very relevant, highly probative in the penalty portion.\n\nI have looked at them with a view to determining whether or not that probative value is overcome by any potential to invoke passion on the part of the jury or prejudice on the part of the jury as a result of that passion, and I don't think they do.\n\nAs noted, the interpretation of factor c(4)(c) adopted in State v. Ramseur, supra, 106 N.J. 123, filed after the trial in this case, focuses on the defendant's intention to inflict severe physical or psychological pain prior to death, supra at 635-637, an issue concerning which crime scene and autopsy photographs would have only limited, if any, relevance. Moreover, the extent to which the victims endured pain before death would be a subject more appropriately addressed by expert medical testimony than by photographs. Although as a general rule the admissibility of photographs of a crime victim rests in the trial court's discretion, State v. Thompson, 59 N.J. 396, 420 (1971), the need to balance the ostensible relevance of such\n\nevidence against the likelihood of jury prejudice is especially critical in the penalty phase of a capital case. It is evident that the photographs were inadmissible in the penalty phase for the purposes stated by the trial court. In the event, on remand, some or all of these photographs are offered to support aggravating factor c(4)(c) as interpreted in Ramseur,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e the trial court should carefully evaluate their admissibility in the context of the State's burden of proof, other evidence adduced by the State, and the provisions of Evidence Rule 4.\n\nC. Weighing of Aggravating and Mitigating Factors.\n\nAs noted above, supra at 585-586, the trial court's charge to the jury did not comply with our holding in State v. Biegenwald, supra, 106 N.J. at 67, that the jury must find that the aggravating factors outweigh the mitigating factors beyond a reasonable doubt in order for the trial court to impose the death sentence. Consistent with the statutory provisions then in effect, the trial court instructed the jury that unless each aggravating factor proved is outweighed by the mitigating factors, the sentence will be death. Similarly, the jury verdict sheet relating to the murder of Stacey Elizardo reflected the jury's determination that the sole aggravating factor was not outweighed by the mitigating factors. The State concedes that the jury charge and the lack of a specific finding that the aggravating factor outweighs the mitigating factors beyond a reasonable doubt requires that the death sentence be vacated.\n\nVI.\n\nThe judgments of conviction are affirmed. Defendant's sentence to death for the murder of Stacey Elizardo is reversed and the matter is remanded to the Law Division for resentencing. Defendant's sentence to life imprisonment with thirty-years\n\nparole ineligibility for the murder of Paul Reynolds is affirmed, as are the concurrent sentences for the remaining unmerged counts of the indictment.\n\nHANDLER, J., dissenting.\n\nDefendant, Darryl Pitts, was prosecuted under the capital murder-death penalty statute for the murders of Paul Reynolds and Stacey Elizardo. Defendant was convicted of both murders and sentenced to death for the murder of Stacey Elizardo; he was sentenced to life imprisonment with thirty-years parole ineligibility for the murder of Paul Reynolds. He was also tried and convicted of several other related offenses. The Court affirms his convictions for murder and the related offenses, while reversing the death sentence and remanding the matter to the trial court for a new sentencing proceeding. I would reverse defendant's murder convictions, and, therefore, dissent from the Court's judgment.\n\nI note initially my continuing belief that our capital murder-death penalty statute as enacted, interpreted, and applied violates state-constitutional and fundamental-fairness doctrines. I adhere to this position in light of the continuing development of capital-murder jurisprudence, and because, as I see it, the flaws in our state's statute are too severe to be ignored. However, it is not necessary here either to reiterate or further explain these grounds for disagreement. See, e.g., State v. Hunt, 115 N.J. 330, 390 (1989) (Handler, J., dissenting).\n\nNevertheless, in this case, I am in profound disagreement with the resolution of two issues by the Court. One issue involves the conceded failure of the trial court to give the jury an instruction concerning the non-capital offense of serious-bodily-injury murder, that is, murder involving serious bodily injury inflicted without homicidal intent or knowledge. Indisputably, this charge is supported by a rational basis in the evidence and is clearly mandated by State v. Gerald, 113 N.J. 40, 69-91 (1988). The other issue arises from the exclusion by the trial\n\ncourt of important and competent expert testimony concerning the defendant's state of mind, an exclusionary ruling that is affirmed by this Court not only with respect to the guilt phase of the trial but also the penalty phase, a ruling that, presumably, will apply in the defendant's retrial to impose the death penalty.\n\nI note, in addition, the Court also rejects defendant's contention that, particularly in light of the later-decided case of State v. Bowens, 108 N.J. 622 (1987), he was entitled to a charge of aggravated manslaughter. Ante at 603-614. I am of the view that defendant is entitled to a charge of aggravated manslaughter with respect to the murder of Stacey Elizardo. The line between knowing murder, serious-bodily-injury murder, and aggravated manslaughter is simply too fine and fragile to justify withholding from a jury the choice among these several offenses in light of evidence that would support any one of them. I reach this conclusion -- that defendant is entitled to an aggravated manslaughter charge -- particularly in light of evidence that provides a rational basis to support a charge for serious-bodily-injury murder under our Gerald decision as well as the evidence in support of defendant's claim of imperfect self-defense and diminished capacity. See discussion infra at 641-650. My reasons for these conclusions are expressed substantially in my dissent in State v. Rose, 112 N.J. 454, 552-67 (1988), as well as my later dissent in State v. Hunt, supra, 115 N.J. at 403-411, and will not be reiterated here.\n\nI.\n\nThis case was tried before we rendered our decision in State v. Gerald. Hence, no one involved in this prosecution anticipated the significance of the evidence that the defendant may have committed a homicide intending to inflict serious bodily injury that resulted in death but without the intent or certain\n\nknowledge that death would in fact occur. Gerald explains the significance of such evidence. We there held that a defendant\n\nwho is convicted of purposely or knowingly causing \"serious bodily injury resulting in death\" under N.J.S.A. 2C:11-3(a)(1) and (2), or either of them -- as opposed to one who is convicted of purposely or knowingly causing death under those same provisions -- may not be subjected to the death penalty. [113 N.J. at 69.]\n\nIn charging the jury in this case without having the benefit of our holding in Gerald, the trial court did not require the jury to determine specifically whether defendant purposely or knowingly caused the death of the victims, or, alternatively, whether defendant purposely or knowingly caused serious bodily injury that happened to result in their deaths.\n\nThe Court now rules that the trial court's omission to charge the jury as mandated by Gerald is of no consequence with respect to defendant's conviction for the murder of Paul Reynolds because the jury did not impose the death penalty. Ante at 615. Hence, it concludes that defendant was exposed to the same sentence that could have been imposed were he to have been convicted of non-capital murder. Ibid. I disagree with this determination essentially for the reasons expressed in my dissenting opinion in State v. Hunt, supra, 115 N.J. at 389.\n\nThe Court deals more pointedly with the conviction for the murder of Stacey Elizardo, for which defendant was sentenced to death. The Court poses the issue as follows: whether the evidence in the record concerning that homicide so clearly established that defendant purposely or knowingly caused her death that the trial court's omission of the Gerald charge was not capable of affecting the jury's verdict, ante at 615; and \"whether the jury's verdict effectively constituted a determination that defendant purposely or knowingly caused the victim's death.\" Ante at 615. The Court then finds that the record clearly established and the verdict of the jury \"effectively constituted a determination that defendant purposely or knowingly caused the death of Stacey Elizardo.\" Ante at 619-620. It concludes, accordingly, that the omission of the Gerald\n\ncharge \"was not capable of affecting the jury's verdict.\" Ante at 620. I disagree with this reasoning and conclusion.\n\nIn Gerald, we posited the standard for determining when the infliction of serious bodily injury must result in an alternative charge to intentional murder:\n\nBecause the jury in this case did not specify which of the foregoing offenses (capital murder or non-capital murder) defendant was convicted of, and because it is possible, on this record, that the jury could have determined that the defendant had the purpose or knowledge to cause only serious bodily injury but not death, we conclude that the judgment of conviction . . . must be reversed and the cause remanded for retrial. [113 N.J. at 69-70.]\n\nThe Court grudgingly follows this standard. Nevertheless, while it acknowledges that the Gerald charge, encompassing as it does a lesser-included murder offense,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e need be supported only by a rational basis in the evidence, State v. Crisantos, 102 N.J. 265, 276 (1986), it ignores the essential teachings of Gerald, as well as Crisantos. It hypothesizes the weight a jury would have ascribed to the evidence supporting serious-bodily-injury murder relative to the evidence supporting purposeful or knowing murder. The Court's conclusion then is dictated by its own comparative assessment of the weight of the evidence it ascribes respectively to the alternative offenses. Such an approach is not only contrary to our holding in Gerald, but essentially usurps the function of the jury. Hunt, 115 N.J. at 405 (Handler, J., dissenting).\n\nIn State v. Rose, supra, 112 N.J. 454, the defendant was convicted of capital murder and sentenced to death for the fatal shooting of a police officer. On appeal, the defendant alleged as reversible error the trial court's refusal to charge the jury on aggravated manslaughter. There was evidence that the defendant shot the officer in the stomach from very close range with a sawed-off shotgun; the shooting was witnessed, and defendant\n\nhad confessed to it. A majority of this Court relied on the weight of this evidence to conclude that defendant's firing of the shotgun was intentional rather than accidental, and thus found no rational basis for allowing the jury to consider aggravated manslaughter as a possible verdict. Id. at 482-83.\n\nTwo members of the Court disagreed with this position because there was also evidence in the record that could allow a jury to conclude that the defendant had shot the officer reflexively out of panic. In their view, this could implicate the requisite state of mind for aggravated manslaughter: recklessness manifesting extreme indifference to human life. Id. at 550 (Wilentz, C.J., concurring in part and dissenting in part); id. at 556-60 (Handler, J., dissenting). Thus, both concluded that the jury should have been permitted to decide whether defendant's panic caused him to act recklessly.\n\nSubject to particular dispute in Rose was the Court's novel approach to the question of whether a rational basis existed for charging the lesser-included offense of aggravated manslaughter. As I pointed out in dissent, the Court's approach constituted a new formulation of the law, according to which a \"rational basis is not established unless a defendant has not only pointed to evidence that could support a conviction on the lesser charge, but also, and quite apart from this, explained why the jury should have credited that evidence by assailing the strength of the evidence of the greater charge.\" Id. at 560; Hunt, 115 N.J. at 405 (Handler, J., dissenting). Never before had we required a defendant to establish a rational basis for an instruction on a lesser offense by disproving the case for the greater charge in order to increase the weight a jury would give to the lesser charge. Nor have we required courts to hypothesize the weight a jury would have ascribed to the evidence supporting conviction of the lesser charge. Because the degree to which a jury will believe and weigh evidence is essentially inscrutable, the question of what weight to afford evidence supporting a lesser charge had previously been left exclusively to the jury. Id. 112 N.J. at 560; Hunt, 115 N.J. at 405 (Handler, J., dissenting). I therefore concluded in Rose that to the extent\n\nthe majority's approach required courts to assess the weight of the evidence of the lesser offense as against the weight of the greater in order to determine whether a rational basis exists to charge the lesser offense, \"it departs from all precedent, imposes an unrealistic standard, and usurps the function of the jury.\" Id. 112 N.J. at 560; Hunt, 115 N.J. at 405 (Handler, J., dissenting).\n\nSo too in this case has the Court engaged in a process of review that requires a court to hypothesize the weight a jury would have ascribed to the evidence supporting the conviction of the lesser charge if, indeed, that charge had been given. The Court's approach essentially compares the weight of the evidence supporting the lesser crime, serious-bodily-injury murder, to that of the greater offense, purposeful or knowing murder, in order to determine which was the jury's most probable verdict. Hunt, 115 N.J. at 405-406 (Handler, J., dissenting). But the standard in Gerald is whether \" it is possible \" the jury could have determined that the defendant's intention was merely to cause serious bodily injury and not death.\n\nThe Court does not deal with the evidence in terms of possibilities. Rather it assesses the weight of the evidence, and, in determining its weight, it simply accepts the State's view of the evidence, thus leaving it, not surprisingly, with \"no doubt\" that defendant purposely or knowingly killed Stacey Elizardo. Ante at 617. Illustrative of this approach is the Court's reference to the testimony of the medical examiner concerning the number and depth of the wounds defendant inflicted on Elizardo, from which it concludes that it would be \"inconceivable\" for the jury to have found that defendant meant to cause serious bodily injury but not death. Ante at 620. It must be assumed that by this conclusion the Court has found, as it must to satisfy Gerald, that \"it is [not] possible\"\n\nfor the jury to have determined from any evidence that defendant meant to cause serious bodily injury but not death.\n\nDefendant does not dispute the severity of the wounds inflicted during his assault of Elizardo; or that there is evidence, indeed abundant evidence, sufficient to prove murder. The point is that defendant is not obligated to disprove or overcome that evidence. Rather, it suffices to identify other evidence and to show that this evidence itself renders it \"possible\" for the jury to have concluded that the defendant intended to inflict serious bodily injury, not death.\n\nAnd there was other evidence. Thus, on direct examination defendant stated:\n\nThe actual assault was like almost an instantaneous like reflex for me to have assaulted him. I assaulted Paul with the knife; while I was doing so, from back of me was, it was like a frenzied-type state of mind, . . . it was just an image at that time. . . .\n\nFurther, on cross-examination defendant stated:\n\nI want the jury to believe that I didn't have the intentional thought to harm these people.\n\nMoreover, Dr. Cooke testified that defendant told him he was initially unaware that he was assaulting Stacey Elizardo:\n\nHe [defendant, Pitts] also then tells me that out of the corner of his eye he saw what at some times [sic] he described as an image, as a person, didn't know who it was, he says, didn't know if it was a male or female, but had a feeling very much like the feeling that he had when he was in Vietnam, I have to win, I have to survive, I am under attack, things of that nature.\n\nI went into this with him in great detail; this is not a flashback into any specific incident, that is not like he is reliving a specific incident in Vietnam. I am not saying that. What I am saying, he had the general feeling under this stressful situation that he had had at times in Vietnam in just having to win, having to survive, having to strike out until there was no more motion around him. He said that he only afterwards realized that that was Stacey.\n\nContrary to the conclusion reached by the Court, in the absence of a correct Gerald charge, one cannot be totally convinced that the jury verdict convicting Pitts of the murder of Stacey Elizardo necessarily reflected a determination by the jury that the defendant only purposely or knowingly caused death and did not merely intend to cause serious bodily injury that resulted in death. Although the weight of the evidence\n\nthat defendant purposely or knowingly caused the death of Stacey Elizardo was great, it did not extinguish evidence to the contrary, namely, evidence suggesting that defendant struck out blindly at an \"image\" in a \"frenzied-type state of mind\" intending only generalized harm. It is thus conceivable that a properly charged jury would have convicted defendant of noncapital murder.\n\nThe Court, as it did to some extent in Rose, seems to buttress its own evaluation of the record by referring to defendant's trial strategy to support its conclusions. The Court relies in part on defense counsel's opening statement to the jury concerning defendant's state of mind as involving rage; it also notes that defense counsel made comparable statements in summation. Further, it emphasizes that the jury was instructed on passion/provocation manslaughter. The Court thus seems to suggest that defendant's trial strategy itself somehow engenders an estoppel or waiver of a Gerald argument or, because his manslaughter strategy is consistent with an intentional killing, it can be seen, by hindsight, as a kind of clairvoyant acquiescence in the fortuitous omission of non-capital murder from the case. However, defense counsel was not prescient; the Court unfairly ignores the fact that prior to Gerald, non-capital murder was not available to the defendant as the basis for a plausible alternative theory to present to the jury and that his trial strategy was devised when it was impossible to know that the Gerald principle existed or could be applicable to the case.\n\nThe Court also concludes that the jury's verdict of murder, rather than manslaughter, was a rejection of defendant's contention that he killed in the heat of rage or passion brought on by reasonable provocation. Ante at 618-619. Because the Court urges that the rejection of manslaughter by the jury is inconsistent with a view of the evidence that would support serious-bodily-injury murder, implicit in the Court's reasoning is the belief that this verdict -- the rejection of manslaughter -- must have included specifically the rejection of any evidence of\n\n\"rage.\" The Court seems also then to assume that the rejection of \"rage\" serves to negate a state of mind that would constitute an intent only to harm by inflicting serious bodily injury. However, the consideration of manslaughter by the jury did not invite it to differentiate and consider discretely the evidence of rage apart from that of provocation. Hence, the rejection of manslaughter does not signify necessarily its disbelief of the evidence of rage. Moreover, the jury's verdict rejecting manslaughter was predicated on an unfair choice: that between intentional murder and manslaughter; the choice was not augmented by another alternative, namely, non-capital murder. Thus, the jury's verdict rejecting manslaughter may not be inconsistent with the theory -- not presented to the jury -- that defendant killed in a \"frenzied-type state of mind\" that could under a correct charge reduce the homicide to non-intentional murder.\n\nIn State v. Bey (I), 112 N.J. 45, 93-95 (1988), we indicated that \"in assessing the impact of error in either the guilt or penalty phase of a capital case, we shall continue to determine reversibility on the basis of a qualitative determination that considers, in the context of the entire case, whether the error was clearly capable of affecting either the verdict or the sentence.\" Applying this standard, the Court professes to have made a meticulous review of the record in this case, convincing itself that the jury's verdict was a determination that defendant purposely or knowingly caused the death of Stacey Elizardo. It thus appears that in the view of the Court, the trial court's omission of the charge required by our decision in Gerald was not capable of affecting the jury's verdict. The Court also concludes, under an alternative enhanced standard of review, that \"there was no realistic likelihood of prejudice\" resulting from such omission. State v. Bey (I), 112 N.J. at 116 (Handler, J., concurring).\n\nFor purposes of appellate review, the Court in effect defines the decisive question as a factual one: whether the assault had as its objective serious bodily injury or death. Ante at 619.\n\nThat, I suggest, is the decisive question that the jury should consider and determine. It is not, however, the decisive question for this Court. Rather that question is whether there was a rational basis in the evidence to establish such an offense and whether it was possible for the jury to make such a determination. Hence, the Court's own recapitulation of the evidence and its own factual determination, consisting entirely of the evidence demonstrating either defendant's purpose to kill or his knowledge that death was practically certain to occur, cannot be dispositive of defendant's entitlement to the ordinary-murder charge. Hunt, 115 N.J. at 405-407 (Handler, J., dissenting).\n\nThe Court may be saying that it is truly unimportant that the jury in this case did not consider the full range of charges relating to offenses available under the evidence, including ordinary murder. Such an approach trivializes the jury role. We have held that at the very core of the guarantee of a fair trial in a criminal case is the judicial obligation to assure that the jury's impartial deliberations are based solely on the evidence and in accordance with proper and adequate instructions. State v. Simon, 79 N.J. 191, 206 (1979). When a lesser-included offense charge is requested by a defendant, the trial court is obligated to determine if there exists a rational basis in the evidence that could support the included offense. State v. Crisantos, supra, 102 N.J. at 278. Indeed, \"so paramount is the duty to insure a fair trial that a jury must deliberate in accordance with correct instructions even when such instructions are not requested by counsel.\" State v. Grunow, 102 N.J. 133, 148 (1986); see State v. Moore, 113 N.J. 239, 288 (1988) (trial court's failure to charge jury on diminished capacity constitutes reversible error although charge was never requested by defense counsel). The court has an obligation to see to it that the jury, as the representative of the public, is given all of the facts and all of the possible offenses that might reasonably be found from such facts.\" State v. Choice, 98 N.J. 295, 298-99 (1985).\n\nWhat the Court has done, simply, is to act as a thirteenth juror, weighing the evidence with its own thumb on the scale. The Court, from its appellate promontory, has effectively coopted the jury. Its recapitulation of the evidence reads like the prosecutor's summation; its conclusion, a jury verdict. What is missing from this exercise in judicial review is a genuine and cogent rebuttal to the irrefutable facts: there was a rational basis in the evidence for the jury to find non-capital murder, it was possible for the jury to credit that evidence, the Gerald charge was not given, and the jury had no opportunity to consider such evidence in terms of such a charge.\n\nMeasured by these omissions, not by whether the jury's ultimate determination would or would not have been the same, sound appellate review must record the fundamental prejudice that affected the jury's deliberations. The jury was denied the opportunity to engage in full deliberations involving all the evidence in accordance with complete instructions. This cannot be passed off as harmless error in a capital-murder prosecution.\n\nII.\n\nThe Court concludes that the trial court properly excluded expert testimony based in part on the results of a sodium amytal examination of the defendant. The trial court, and now this Court, misunderstand the nature and purpose of the evidence offered, misperceive the issue posed by this critical evidence, and misapply relevant standards governing the admissibility of expert 4 evidence. This evidence, in my view, should have been held admissible in the guilt phase of this prosecution. More importantly, its exclusion from the penalty phase of defendant's trial is particularly indefensible in light of the unique and portentous significance that a sentencing trial holds in death-penalty prosecutions.\n\nThe subject of the trial court's exclusionary ruling was the testimony consisting of the expert opinion of Dr. Robert Sadoff relating to his examination of the defendant with the use of\n\nsodium amytal. This substance is a barbiturate with some utility as a relaxant that blocks anxiety and allows psychiatrists engaging in narcoanalysis to call forth repressed or suppressed memories or feelings that are otherwise difficult to reach. From this examination, Dr. Sadoff elicited information concerning defendant's state of mind at the time of the murders indicating that defendant believed that Paul Reynolds was causing Stacy Elizardo to engage in prostitution. Dr. Sadoff formed the opinion that this belief of the defendant engendered a state of rage in which he murdered his victims.\n\nThis evidence was excluded by the trial court. The Court now predicates its approval of the trial court's exclusion of this evidence on two factors: the use of the sodium amytal interview as a means to ascertain the \"truth\" of defendant's belief or motive for killing the victim, and the trial court's offer to allow expert opinion testimony from Dr. Sadoff so long as it was based on a hypothetical question consistent with the evidence in the case exclusive of any information gleaned from the sodium amytal interview.\n\nThis evidence, relating as it does to the defendant's state of mind, goes to the very core of both the prosecution and the defense of this case. In my opinion, if its exclusion is error, then the error, inescapably, was gravely prejudicial. For this reason, assessment of the court's exclusionary ruling entails an extended analysis involving (a) a review of the actual testimony concerning the reliability of the sodium amytal methodology as an aspect of psychiatric evidence, (b) the actual use of this methodology by the expert in this case, (c) the standards that should govern the admissibility of its use, (d) a review of the trial court's ruling, and (e) the prejudicial effect of the exclusionary ruling. Finally, and most importantly, theconclusions drawn from this analysis must be reconsidered in the context of the trial court's exclusion of this evidence from the sentencing phase of the trial.\n\nA.\n\nBecause of its potency as a means of investigating a patient's mind, all of the testifying experts agreed on the legitimacy of using sodium amytal for diagnostic purposes. There was agreement also that sodium amytal could assist patients in reliving repressed events or helping them to \"get to\" memories or feelings that they are otherwise unable to articulate. Further, two of the three experts felt that the information gleaned from such interviews, in conjunction with other available information, could serve to provide a reliable basis for determining a historical state of mind.\n\nThe experts further concurred that the results of a sodium amytal interview are not considered scientifically reliable for the purpose of ascertaining truth as such. Nevertheless, the results of sodium amytal are useful. Dr. DiGiacomo, a defense expert, stated that even if an amytal interviewee was withholding some truth, the manner in which the interviewee defended information would provide insight about the interviewee's psychological defense mechanisms. Such clues could inform the interviewer of what issues are highly charged or emotionally difficult for the interviewee; thus, although such interviews might not yield \"truth\" per se, they could provide insight regarding an interviewee's \"style of being in the world.\" Dr. DiGiacomo further stated that if asked to give an opinion regarding a defendant's historical state of mind, he would use a sodium amytal interview to ascertain whether a traumatic neurosis is present or to learn more about what was going on inside the interviewee's mind by evaluating, among other things, the interviewee's manner of response to particular topics as well as the substance of any statements made under the influence of the drug. He concluded that the results of a sodium amytal interview, in conjunction with the results of other interviews and psychological tests, would allow him to offer a psychiatric opinion regarding defendant's historical state of mind. Dr. Sadoff stressed the acceptability throughout the profession of sodium amytal examination as a procedure\n\nused to allow patients to overcome psychological blocking of traumatic events or emotions. He also stated that sodium amytal could serve as a \"face-saving\" device, providing in effect a pretext or \"permission\" for interviewees to talk about topics that they could not otherwise address openly. The State's witness, Dr. Orne, testified that for treatment purposes, the emotional significance of an interviewee's recollection is more important than historical accuracy.\n\nEach of the experts also agreed that the likelihood of truthfulness during a sodium amytal interview was greatest when the subject experiences abreaction, a state in which the individual appears to relive past events. The experts differed, however, with regard to the reliability of an abreaction and the relative reliability of other states that fall short of outright abreaction. Dr. DiGiacomo expressed confidence in the utility of non-abreactive interviews, stating that even in the absence of abreaction, psychiatrists could still gain valuable material about a subject's defense mechanisms. Dr. Sadoff also expressed the belief that results achieved during abreaction would be relatively reliable, but further stated that statements made during a non-abreactive state while under sodium amytal would still be more reliable than statements made without any sodium amytal at all. Dr. Orne maintained that a subject could be untruthful or inaccurate even during an abreaction, and that during a state of non-abreaction, the potential for inaccuracy or untruthfulness was significant due to increased ego control.\n\nEach of the experts also agreed that the use of leading questions during sodium amytal interviews is problematic. While they agreed that rejection of a topic suggested by a leading question would generally indicate irrelevance to a subject's preoccupations, they also cited the problem of suggestibility. Dr. DiGiacomo testified that the effect of leading questions would vary with the personality of the interviewee; either the question will have a suggestive effect, or will goad a rebellious interviewee into going the opposite way. Dr. Sadoff also acknowledged that leading questions were not ideal, but\n\ntestified that if abreaction is not reached, then such questions must be used carefully in trying to push an interviewee along. Dr. Orne stated that leading questions not only invite suggestibility, but also foreclose the possibility that an interviewee will spontaneously provide new paths of inquiry.\n\nB.\n\nThe problem, however, is that these experts fell into two camps with regard to the ultimate purpose or usefulness of the sodium amytal interview in this case. Dr. Orne stated that this sodium amytal interview was used solely as a truth-telling device to identify which of defendant's versions of his state of mind during the murders was the truth, and that sodium amytal is unreliable for this purpose. The other experts, however, each testified that even though sodium amytal cannot be relied on to ascertain the truth of a matter, other significant insights are attained through interviews such as this one, which in combination with other evidence can form a basis for determining state of mind.\n\nIn this case, Dr. Sadoff had conducted previous examinations of the defendant. Indeed, in formulating his final report on defendant's state of mind, Dr. Sadoff drew on two interviews in addition to the one conducted with sodium amytal, background material supplied by defense counsel that included witness statements, and a report by Dr. Gerald Cooke, who had conducted a number of standard psychological tests with defendant. Dr. Sadoff found in his second interview of the defendant, which preceded the examination under sodium amytal, that defendant was \"much more open . . . and much more honest.\" At that time, defendant indicated his involvement in the murders, but also supplied information pertaining to his combat duty in Vietnam that suggested a relationship between the circumstances of the murders and the possibility that defendant suffered from post-Vietnam delayed stress syndrome. In order to diagnose defendant and investigate whether his actions\n\nresulted from this syndrome, Dr. Sadoff undertook the sodium amytal interview.\n\nDuring the sodium amytal examination defendant did not have an \"abreaction,\" a reliving of his Vietnam experience that would indicate the existence of Vietnam stress syndrome. Further, defendant did not affiliate with leading questions intended to draw out a Vietnam flashback. Dr. Sadoff thus concluded, and none of the other testifying experts disagreed, that delayed stress syndrome did not trigger defendant's actions. However, during this interview, defendant did provide information that greatly impressed Dr. Sadoff:\n\nwithout [my] leading, asking him what was going on at the time, what turned out was that he gave a motivation or a reason that I had never heard before, that wasn't written down any place before and that he elaborated upon under the influence of sodium amytal to a degree that indicated to me that is what he perceived to be what was happening at the time in his own mind, at the time of the killing.\n\nEach of the experts had seen a videotape of defendant's interview and agreed that no abreaction had occurred. Assessment of the conduct of this interview focused on the extent to which defendant retained conscious control over his responses, and the effect of leading questions. At the Rule 8 hearing, Dr. Sadoff was vigorously cross-examined with regard to his use of leading questions. The prosecutor challenged his choice of leading questions as indicative of a failure to investigate certain possibilities, including other motives consistent with defendant's prior stories of killing in revenge for non-payment of debts. Moreover, cross-examination revealed that defendant spontaneously brought up the issue of Reynolds' attempt to turn Elizardo into a prostitute, and did so in a contradictory way by following his initial thought with the statement \"nah, no way. Women don't need that,\" prompting Dr. Sadoff's follow-up that introduced the word \"pimping\" and related this term to the argument between defendant and Reynolds. Further, Dr. Sadoff conceded that defendant possessed some measure of self-control during the latter portion of the interview,\n\nbut nevertheless felt that this segment of the interview yielded valuable results.\n\nDr. DiGiacomo was of the view that the interview was well done, but conceded that defendant's apparent ego control during the second half of the interview was problematic. However, Dr. DiGiacomo interpreted the altered nature of the second half of the interview as partially a function of defendant \"shutting down\" after the topic of Stacy Elizardo was introduced, and stated that this represented a form of defense that in itself inclined him to believe that defendant had experienced a loss of control or state of rage when he killed his victim. In contrast, Dr. Orne opined that the amytal interview did not \"even have the quality of a meaningful amytal interview,\" and referred to numerous indicies of defendant's self-consciousness, ego control and awareness of his environment. He also testified that extensive use of leading questions further compromised this interview by raising the spectre of suggestibility, and by imposing a structure that both prevented a free flow of information and also raised defendant's level of ego control through increased interaction with Dr. Sadoff.\n\nDr. Sadoff acknowledged that the substantive statements yielded in an amytal interview might not be true. He also stated that without the amytal interview, he would not be able to give an opinion about defendant's state of mind because he otherwise had an inadequate sense of defendant's motive. Nevertheless, he stressed that defendant's feelings about the relationship between Reynolds and Elizardo emerged in the context of psychological blocking and in such a way as to suggest that this belief was extremely meaningful to defendant. On this basis, and in the absence of any other significant motive sufficient to trigger a state of rage, Dr. Sadoff felt that the amytal examination, in conjunction with knowledge acquired through other examinations, reports, and test results, justified a finding that defendant's perception of \"prostitution\" and \"pimping\" triggered a state of rage.\n\nObviously, there was a difference of opinion among theexperts concerning the reliability of the results of the defendant's sodium amytal interview. The difference of opinion implicates the standards for determining the admissibility of these results.\n\nC.\n\nReliability is one of the conditions for the test of admissibility of expert evidence. This condition requires that the state of the art or methodology in the field is developed to the extent that the information that it yields is sufficiently reliable. State v. Kelly, 97 N.J. 178, 208 (1984); Romano v. Kimmelman, 96 N.J. 66 (1984). Reliability can be established through expert testimony about general acceptance of the scientific knowledge in the given field of science and through acceptance of such knowledge reflected in authoritative scientific publications and other writings. State v. Cavallo, 88 N.J. 508 (1982). A third way of establishing the reliability of expert evidence, in a sense a derivative of the others, is by judicial opinions that have recognized its reliability. Windmere, Inc. v. International Ins. Co., 105 N.J. 373, 377-79 (1987).\n\nIn this case, expert testimony presented at trial confirms the scientifically-accepted use of the results of properly conducted sodium amytal examinations. The issue of the reliability and admissibility of sodium amytal methodology has been the subject of considerable litigation, particularly in California. As the majority points out, other jurisdictions reject the admissibility of such information when offered literally only for the purposes of establishing the truth of the matter. Ante at 630. Although the California courts agree that statements emanating from a sodium amytal test are not reliable for truth per se, it is clear that expert opinions relying on sodium amytal results are admissible. This body of case law provides no exhaustive exegesis of the principles underlying such admissibility, but examination of these cases is nonetheless most instructive.\n\nIn the seminal case of People v. Jones, 52 Cal. 2d 636, 343 P. 2d 577 (1959), cert. den., Jones v. California, 361 U.S. 926, 80 S. Ct. 364, 4 L. Ed. 2d 350 (1960), a defendant accused of murder offered to repeat his assertions of innocence while under the influence of \"truth serum.\" The California Supreme Court unequivocally held that the results of a sodium amytal test \"are not such as to be admissible for or against the defendant because of a lack of scientific certainty about the results.\" Id. 52 Cal. 2d at 653-654, 343 P. 2d at 588. This principle has not been overruled. See, e.g., People v. Johnson, 32 Cal.App. 3d 988, 109 Cal.Rptr. 118 (1973). Nevertheless, expert opinion testimony derived in part from sodium amytal interviews has been determined to be reliable and admissible in evidence. In the recent capital-murder case of People v. Milner, 45 Cal. 3d 227, 753 P. 2d 669, 246 Cal.Rptr. 713 (1988), the California Supreme Court did not challenge the admission of expert opinion testimony that relied on the defendant's statements during a sodium amytal interview as a basis for the conclusion that at the time of the murder, defendant suffered from an acute panic and anxiety reaction, and was further unable to form the specific intent to rob. Id. at 235, 753 P. 2d at 674, 246 Cal.Rptr. at 718.\n\nInformation derived from sodium amytal interviews often contributes toward an expert assessment of a person's capacity to formulate a particular culpability state. In re Nevil, 39 Cal. 3d 729, 704 P. 2d 1332, 217 Cal.Rptr. 841 (1985) (forensic psychiatrist used sodium amytal in conjunction with other techniques to conclude that \"mixed personality disorder\" contributed to inability to handle stress and incapacity to intend to kill). Such testimony has also been allowed to enable the fact-finder to assess whether a defendant's inability to remember a killing resulted from trauma or repression. People v. Hogan, 31 Cal. 3d 815, 647 P. 2d 93, 183 Cal.Rptr. 817 (1982). This information was also used as probative of the ultimate issue of guilt, as the expert testified that defendant's inability to recall the incident while under the influence of sodium amytal indicated a\n\nlack of repression and consequent innocence. Id. at 833-34, 647 P. 2d at 103, 183 Cal.Rptr. at 827. Such expert testimony has also been admitted for assessment of a historical state of mind, with videotape and transcripts of the sodium amytal interview additionally admitted into evidence. People v. Theriot, 252 Cal.App. 2d 222, 60 Cal.Rptr. 279 (1967).\n\nIn admitting such opinion testimony, the California courts are not under some misapprehension regarding the potential ability of sodium amytal interviewees to lie while under the influence of the drug. Hogan, supra, 31 Cal. 3d at 833, 647 P. 2d at 103, 183 Cal.Rptr. at 827; Johnson, supra, 32 Cal.App. 3d at 1001, 109 Cal.Rptr. at 126. Rather, it appears that they recognize that the utility of sodium amytal examinations is not solely a function of the truth of a person's utterances, and that expert opinion testimony, derived from such examinations in conjunction with other information obtained that does not depend wholly or primarily on the \"truth\" as such, can be accepted as reliable in accordance with relevant professional standards.\n\nThis experience is paralleled to some extent by our own. In State v. Hurd, 86 N.J. 525 (1981), we recognized the admissibility of hypnotically-induced evidence when hypnosis is used as a means of overcoming amnesia and restoring the memory of a witness. Although we acknowledged the numerous reasons for which hypnosis is not necessarily a procedure that yields accurate recall, reasons that are remarkably similar to those that compromise the reliability of sodium amytal, we nonetheless found that \"hypnosis can be considered reasonably reliable if it is able to yield recollections as accurate as those of an ordinary witness, which likewise are often historically inaccurate.\" Id. at 538.\n\nIn addition, our Rules of Evidence invite reasonable leeway in enabling an expert to express the basis of his opinion. Evidence Rule 56(2) states that:\n\nA witness qualified pursuant to Rule 19 as an expert by knowledge, skill, experience, training or education may testify in the form of opinions or otherwise as to matters requiring scientific, technical or other specialized\n\nknowledge if such testimony will assist the trier of fact to understand the evidence or determine a fact in issue. The facts or data in the particular case upon which an expert bases an opinion or inference may be those perceived by or made known to him at or before the hearing. If of a type reasonably relied upon by experts in the particular field in forming opinions or inferences upon the subject, the facts or data need not be admissible in evidence.\n\nThis formulation of the rule was intended to \"allow more latitude in the admission of expert opinion testimony\" without being inconsistent with the \"spirit\" of the old rule. See Biunno, Current N.J. Rules of Evidence, Comment to Evid.R. 56(2). The rule makes it clear that an expert opinion may be based on \"data relied upon by the expert which is not necessarily admissible in evidence but which is the type of data normally relied upon by experts in forming opinions on the same subject.\" Ibid. The relative breadth of this standard in comparison with the prior limitation of expert opinions to those that the trial court found to be \"based primarily on facts, data or other expert opinion established by evidence at the trial\" demonstrates a marked shift in the underlying assumptions that the Court should bring to bear on the admissibility problem presented in this case. Reflecting this change in attitude, courts are admonished to accord some weight and deference to the experience and professional integrity of the expert whose opinion is being offered, particularly with respect to psychiatric opinion that necessarily is derived from the examination and statements of patients. See, e.g., State v. D.R., 109 N.J. 348 (1988); Saunderlin v. E.I. DuPont Co., 102 N.J. 402 (1986).\n\nIn sum, several considerations are relevant in applying the standards governing the reliability of expert testimony in this case. There is general acceptance of the scientific knowledge within the scientific community as reflected in the opinion of experts. There is considerable decisional law that confirms the acceptability and use of such knowledge in the scientific community in both practice and for evidentiary purposes in litigated cases. Our basic evidentiary rule governing the admissibility of expert opinion counsels admissibility of the results of professionally acceptable procedures that form the basis of an expert's\n\nopinion. Our own judicial precedent involving psychiatric opinion testimony has endorsed the scientific acceptability of knowledge acquired through comparable techniques and its reliability for evidentiary purposes.\n\nD.\n\nIt is important to note that in ruling that Dr. Sadoff's proffered opinion evidence was inadmissible, the trial court squarely predicated exclusion on the apparent unreliability of this particular examination as well as the general unreliability of sodium amytal procedures. It clearly erred to the extent it allowed itself to be influenced by the perception of the general unreliability of such testing, appearing to have been influenced by the uncritical application of State v. Sinnott, 24 N.J. 408 (1957), to the facts of this case.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Here, however, all of the experts expressed the view that such examinations and the results of those examinations were generally accepted within the scientific community for particular kinds of psychiatric evaluations.\n\nThe trial court's evaluation of this sodium amytal test was rooted in the assumption that the sole purpose and only result of this examination was to gather statements intended to stand for the truth of the matter asserted. The trial court, however, clearly undervalued Dr. Sadoff's experience and misperceived both the purpose of Dr. Sadoff in conducting the amytal examination\n\nand his use of other sources of information in arriving at his expert opinion concerning defendant's state of mind.\n\nAlthough Dr. Orne described Dr. Sadoff's purpose as an attempt to ascertain the veracity of competing versions of defendant's motive, an ascription accepted by both the trial court and now the majority, Dr. Sadoff actually used sodium amytal as a diagnostic tool in determining whether defendant's actions arose from Vietnam delayed stress syndrome, although he also was open to the possibility that defendant might further disclose his motives or state of mind at the time of the crime.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Further, Dr. Sadoff's opinion was based on analysis of other sources of information in addition to the sodium amytal interview.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Finally, as indicated by the expert testimony adduced at the Rule 8 hearing, the substantive comments elicited from an interviewee are not the only resources drawn on; an interviewee's manner, style, or inability to respond to particular topics are among the useful clues that a psychiatrist can draw on in coming to an opinion about an interviewee's condition or state\n\nof mind.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In coming to their conclusions, psychiatrists take this information in conjunction with other sources, including additional interviews and tests, and apply their analytic expertise to the entire range of materials. Thus, as indicated by testimony elicited at the Rule 8 hearing, sodium amytal interviews in general, and this one in particular, can yield data that is useful in ways entirely independent of the literal truthfulness of what the interviewee actually says. It is thus clear that Dr. Sadoff reached his judgment incrementally, basing it on defendant's statements as analyzed in conjunction with other information derived from the amytal examination and sources of information entirely independent of the examination.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe inability to recognize the independent value of this expert process of interpretation and analysis is shown by the trial court's \"but for\" analysis of Dr. Sadoff's testimony. Because Dr. Sadoff testified that prior to ordering the sodium amytal interview he did not feel that his access to defendant and other test results gave him enough information to arrive at an opinion on defendant's state of mind, the trial court determined that Dr. Sadoff's proffered testimony was flawed due to the \"but for\" character of the amytal evidence. This analysis\n\nimplies that the amytal interview is the sole source of Dr. Sadoff's opinion, and that he is in effect parroting defendant's statement.\n\nSuch analysis, however, undervalues both the role of Dr. Sadoff's expertise and his use of other sources of information, in addition to the literal meaning of defendant's statement, in arriving at his expert opinion. Dr. Sadoff made his judgment based on defendant's statement as analyzed in conjunction with other information derived from the amytal interview and sources of information entirely independent of the interview. It is therefore incorrect to postulate that Dr. Sadoff's unwillingness to state an expert opinion without the sodium amytal data is the same as making a judgment on the sole basis of the sodium amytal interview. This latter principle would be exemplified by a situation in which an expert proffers an opinion based only on a defendant's statement of guilt or innocence given while under the influence of sodium amytal. It is this kind of usage of sodium amytal, redolent of discredited notions of \"truth serum,\" that is unacceptable. This example, however, bears little resemblance to the situation presented in defendant's case.\n\nIn its acceptance of the trial court's analysis and determination of this issue, the Court thus neglects to consider the extent to which the knowledge derived from professionally-conducted sodium amytal examinations is accepted for purposes of diagnosis and treatment and is acknowledged to be scientifically reliable. These considerations conform to our standards for admissibility of such knowledge by experts in the field. Here, defendant does not argue that the knowledge derived from his examination is to be admitted for a purpose that is inconsistent with its accepted use in practice; he does not contend that the substantive 9 utterance of his motive is inherently true through the magic of sodium amytal. Rather, defendant's expert witnesses have stated that the knowledge gleaned from the examination is probative of defendant's state of mind in the context in which sodium amytal interviews are generally used; they are\n\na useful diagnostic device because they provide a tremendous amount of information about an interviewee's subconscious mind.\n\nA brief review of relevant evidence confirms that Dr. Sadoff's proffered opinion should have been understood in this context. Throughout the guilt phase, defendant maintained that the killing was committed in a state of rage. In turn, the State argued that the evidence demonstrated that defendant had a monetary motive for the killing, indicating that defendant's actions were premeditated. It is therefore fully understandable that Dr. Sadoff resorted to sodium amytal to clarify and determine defendant's probable state of mind. He was primarily interested in whether defendant might abreact or otherwise affiliate with his Vietnam experiences; a positive diagnosis of delayed stress syndrome would have increased the likelihood that post-Vietnam delayed stress 0 syndrome provided the reason or motive for his actions and insight into his state of mind. Defendant's failure to enlarge in any way on his Vietnam experiences during the amytal interview was highly significant. Dr. Sadoff used this result to rule out the role of a Vietnam flashback, and even Dr. Orne stated that this made it \"more likely\" than not that Vietnam delayed stress syndrome was not responsible for triggering defendant's actions.\n\nThis elimination of delayed stress syndrome exemplifies the legitimate professional diagnostic use of sodium amytal, but the elimination of delayed stress syndrome left unanswered the question of defendant's state of mind; premeditation and a monetary motive could not explain the frenzied type of rage that accompanied the killings. As already shown, this rage was attributable to sexual anger and jealousy, a conclusion derived incrementally from a number of sources, including -- importantly and perhaps necessarily, but not exclusively -- the amytal examination. It is unfair and inaccurate to conclude, as did the trial court, that Dr. Sadoff was of the opinion that the defendant acted with the belief that Stacey was engaged in prostitution simply 1 because the defendant said this during the sodium\n\namytal interview. Rather, it seems in light of the entire record that Dr. Sadoff's opinion that defendant acted in a rage involving sexual jealousy was based on the fact that a monetary motive was insubstantial, that evidence of delayed stress was equivocal, that defendant had continuing strong sexual feelings for Stacey, and that he ineffectively attempted to deny feelings of jealousy and used the explanation of prostitution as an excuse or reason for his anger. Thus, what was significant to Dr. Sadoff was not defendant's belief that Stacey was engaged in prostitution or whether defendant truly believed this, but rather the fact of defendant's rage actuated by feelings of sexual attraction and jealousy.\n\nMoreover, the reliability and probative worth of this information was indirectly corroborated. Dr. Cooke concluded that defendant had significant potential for rage or \"loss of control\" due to a cyclothymic personality disorder. He relied on physical evidence at the scene of the crime, defendant's statements to him, and the results of diagnostic tests. Ante at 608-609. Dr. Sadoff also relied on eyewitness reports, non-sodium amytal examinations, and the results of Dr. Cooke's testing; he also used the sodium amytal examination. The court's rejection of Dr. Sadoff's evaluation of defendant's state of mind seems hypertechnical in light of its acceptance of Dr. Cooke's evaluation, particularly inasmuch as Dr. Sadoff was provided with and used Dr. Cooke's reports and test results, and even went one step further by turning to sodium amytal as an additional diagnostic tool.\n\nThe result reached by the Court cannot be easily reconciled with our approach and decision in State v. Hurd, in which Dr. Orne coincidentally testified as the proponent of hypnotically-induced statements of a witness. He expressed the opinion that hypnosis would often be reasonably reliable in reviving normal recall in cases of traumatic neurosis. He also acknowledged that the likelihood of accuracy diminished when hypnosis is used to \"refresh a witness' memory concerning details when there may be no recollection at all, to 'verify' one of several\n\nconflicting accounts given by a witness,\" or when a witness had \"a discernible motivation for not remembering or for 'recalling' a particular version of the events.\" Hurd, supra, 86 N.J. at 544. This testimony parallels many of the points made by Dr. Orne in the Rule 8 hearing regarding defendant's sodium amytal examination. Further, Dr. Orne explicitly equated the effects of hypnosis with those of sodium amytal; he even stated at one point that \"[a]mytal is not any more than hypnosis going to tell you the answer to what is true.\" Nonetheless, we ruled in Hurd that an utterance similarly derived through hypnosis, an alternative form of narcoanalysis, can be presented to the jury for evaluation of credibility.\n\nIn sum, there was sufficient basis in the record to require the trial court to admit expert testimony relating to the results of the sodium-amytal examination of the defendant. While evaluation and probative worth of that testimony might be the subject of differences of opinion, such differences did not impugn the admissibility of evidence that should have been presented for the jury's consideration and assessment of the weight and credit to be accorded to it. This applies as well to the asserted deficiencies in the specific amytal examination identified in the Rule 8 hearing, such as the use of leading questions and the significance, if any, of the fact that defendant apparently did not experience an abreaction during the interview. Each of these considerations would bear on the credibility of the defendant and the reliability of any assertion of truth within the interview.\n\nThe presentation of such evidence subject to full cross-examination and rebuttal, along with a general jury charge concerning the jury's overall responsibility for determining credibility and the assessment and application of expert testimony, and a specific charge concerning the possible unreliability of facts learned by an expert from a subject testifying under the influence of sodium amytal, would properly serve the need to balance probativeness against prejudice. These considerations\n\nstrongly dictate the admissibility of the expert's opinion during the guilt phase of this case.\n\nE.\n\nThe exclusion of Dr. Sadoff's testimony was highly prejudicial. As noted, defendant's state of mind at the time of the murders was a major issue that confronted the jury in determining defendant's guilt. Accordingly, each side devoted substantial attention to the issue of defendant's underlying motive. The prosecutor stressed the theme of premeditation and the monetary motive which had been expressed by defendant several times, particularly during the early stages of the investigation. In turn, the defense presented the theme of defendant's sexual jealousy.\n\nThe ability of the defense to present this case to the jury was compromised, however, by the different accounts of the killing that defendant gave over the course of the investigation and the trial. During the initial police interview, defendant claimed that the killer was a mysterious third party. During a subsequent interview, defendant confessed to the killing and cited an overdue debt as his motive; defendant also adhered to this line during an interview with a parole officer. In his initial interview with Dr. Cooke, defendant introduced the theme of the Vietnam flashback. Finally, from the time of the sodium amytal interview, defendant introduced elements of the theme of sexual jealousy. This theme, however, was never presented in a coherent or complete manner, even during defendant's own testimony at trial.\n\nThis theme would have become much clearer and coherent if Dr. Sadoff had been allowed to testify concerning his opinion of defendant's state of mind based in part on the results of the sodium amytal examination. This opinion was significant not only for its probative worth as a plausible version of what was going on inside defendant's head at the time of the killing; in addition, Dr. Sadoff's expert testimony would have provided\n\ninsight into the reasons for defendant's presentation of conflicting stories. This case presents a classic example of a situation in which there is an acute need for the knowledge of an expert to assist a jury in its search for the truth. See State v. Kelly, supra, 97 N.J. 178.\n\nChronological examination of evidence presented to the jury at trial shows the potential of this testimony as a guide for the jury. First, the theme of intense emotional preoccupation with Elizardo's sexual life surfaces during defendant's second statement to the police; his statements at that time reflect a curious mixture of bravado and pain.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nDuring a subsequent interview with Dr. Cooke, defendant gave an account of the incident at Elizardo's house prior to the killing that sounded this same theme, including the feelings of being insulted and misused.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nDefendant's next major statement was made to Dr. Sadoff during the sodium amytal examination. The jury, however, never heard of defendant's first explicit and illuminating statement of his perception of the Elizardo-Reynolds relationship or of Dr. Sadoff's explanation for the meaning of that statement within the context of defendant's psyche.\n\nShortly before trial, Dr. Cooke again interviewed defendant, who characterized Elizardo's sexual acts as \"prostitution.\" According to Dr. Cooke, this appeared to be a rationale by defendant to mask his strong feelings of jealousy, feelings which he perceived as an indication of weakness.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFinally, at trial, defendant elaborated on the theme of his affection for Elizardo and consequent dislike for Reynolds. However, this presentation was never coherent; it is clear that defendant's own feelings toward Elizardo were still highly charged and unresolved. For example, in his sodium amytal examination, defendant articulated his belief that Reynolds was pimping Elizardo in exchange for money and drugs. The jury was presented with toxicology reports indicating that while Reynolds was drug-free, Elizardo tested positive for amphetamine and methamphetamine. Nevertheless, defendant rather emphatically refused to say anything that he considered derogatory about Stacy.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIt is thus apparent that defendant's feelings may have been mixed or confused, and his expression of these feelings may often have exhibited a bizarre ambivalence, but it is nonetheless clear that these feelings were very intense, perhaps enough so to trigger the state of rage that was at issue.\n\nHowever, by being denied access to Dr. Sadoff's expert testimony or knowledge of defendant's crucial first statements regarding his perception of the Elizardo-Reynolds relationship, the jury was deprived of evidence that could help to explain these inconsistencies and unify the disparate elements of defendant's stories. The phenomena of blocking and repression, recognized by all of the experts as surmountable or approachable through the professional use of sodium amytal and further elaborated on by Drs. Sadoff and DiGiacomo in the context of\n\ndefendant's examination, were probative of an understanding of defendant's multiple accounts of his motivation and state of mind and on issues of credibility. Defendant's credibility could only profit from revelation of an expert opinion that could serve to explain defendant's actions, both during and after the killings, in light of his psychological 1 problems. Further, had the jury been alerted to the timing of the sodium amytal examination relative to defendant's other statements, the presentation of sexual jealousy and rage as defendant's motive would have been much more coherent.\n\nThis context for the potential role of Dr. Sadoff's expert testimony thus demonstrates the substantial probative worth of the evidence that he sought to offer. The deprivation to the defense by the erroneous exclusion of this evidence was gravely prejudicial and clearly requires reversal of defendant's murder convictions.\n\nIII.\n\nDr. Sadoff's proffered opinion testimony should unquestionably have been admitted during the penalty phase. This conclusion is compelled not only by the ultimate purpose of the penalty phase and the spirit that animates both our capital-punishment statutory scheme and our decision in State v. Davis, 96 N.J. 611 (1984), but also by the special probative worth of such testimony in determining the ultimate issue in the sentencing trial of Daryl Pitts -- whether he should live or die.\n\nOur capital-punishment sentencing scheme contemplates that a defendant convicted of murder and eligible for a death sentence will be able to present evidence and argument commensurate with the sanction sought by the State. Accordingly, the statute provides standards for the admissibility of evidence presented by defendant in support of mitigating factors that are less stringent than those applied in other criminal proceedings. N.J.S.A. 2C:11-3c(2)(b). Further, defendants face a burden of proof in establishing mitigating factors that is less\n\ndemanding than the burden faced by the State in establishing aggravating factors. N.J.S.A. 2C:11-3c(2)(a). We insist that for a sentence of death to issue, the fact-finder must determine beyond a reasonable doubt that any aggravating factors found to exist outweigh any mitigating factors. State v. Biegenwald, 106 N.J. 13, 53 (1987). This structure is intended to give defendants the fullest opportunity to argue for their lives.\n\nConsistent with this policy is our determination that fact-finders not be denied access to information that would have a mitigating effect through the elicitation of mercy or sympathy. State v. Ramseur, supra, 106 N.J. at 299. Indeed, the Court does not allow a defendant to prevent his attorneys from presenting mitigating evidence because such action would \"withhold[ ] from the trier of fact potentially crucial information\" that has important implications for the constitutionality of our death penalty statute. State v. Koedatich, 112 N.J. 225, 331-32 (citation omitted), cert. den., Koedatich v. New Jersey, U.S. , 109 S. Ct. 813, 102 L. Ed. 2d 803 (1989). Although the Court does not find any constitutional right to have a jury evaluate evidence in light of an independent charge mandating consideration of mercy or sympathy, it perhaps does so with confidence that the scheme of mitigating factors will serve as an appropriate vehicle for the inspiration of such feelings. Ante at 598. In the exercise of our supervisory jurisdiction over criminal trials, we permit defendants to exercise the common-law right of allocution, allowing them to express directly to the jury that they are individuals \"capable of feeling and expressing remorse and of demonstrating some measure of hope for the future.\" State v. Zola, 112 N.J. 384, 430 (1988) (citation omitted). These characteristics exemplify the Court's acknowledgment of the \"highly discretionary nature of the jury's duty to balance the statutory aggravating and mitigating factors\" in the sentencing phase of a capital case. State v. Bey (I), 112 N.J. 45, 95 (1988).\n\nExamination of the sentencing philosophy and methodology of our capital-murder statute reveals that the defendant's motive\n\nis the critical and salient consideration in choosing between life imprisonment or the ultimate sanction of death. This emphasis on motive as an index of appropriate punishment is reflected by many of the statute's aggravating factors. Murders committed in exchange for the receipt of anything of pecuniary value, N.J.S.A. 2C:11-3c(4)(d), committed for the purpose of escaping detection or confinement, N.J.S.A. 2C:11-3c(4)(f), while engaged in other criminal activities, N.J.S.A. 2C:11-3c(4)(g), or because of the victim's status as a public servant, N.J.S.A. 2C:11-3(c)(4)(h), are considered so reprehensible as to justify the death penalty because society is particularly repulsed by the idea that such motives can lead to murder. Further, our interpretation of aggravating factor N.J.S.A. 2C:11-3c(4)(c) essentially defines \"depravity\" as a murder committed with the absence of motive. Gerald, 113 N.J. at 66; Ramseur, supra, 106 N.J. at 211.\n\nThe importance of motive is also discernible throughout the range of mitigating factors. N.J.S.A. 2C:11-3c(5)(a), (b), and (e) consider whether the defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution; whether the victim solicited, participated in, or consented to conduct resulting in death; and whether the defendant was under unusual and substantial duress insufficient to constitute a defense to prosecution. Further, the \"catch-all\" mitigating factor, c(5)(h), could certainly accommodate any motive that might demonstrate an ameliorative quality. In short, the penalty phase of a capital case is a wide-ranging investigation not only of a defendant's character, but also of his or her motives. Thus, the determination of a defendant's motive for murder, a determination that lies close beneath the surface of a guilt phase proceeding but is never directly addressed as an element of murder, is at the heart of a penalty phase proceeding in a capital case.\n\nThe central role of motive in the penalty phase has significant ramifications for the admissibility question posed in this case. In its extensive quotation of our decision in Davis and acknowledgement\n\nof N.J.S.A. 2C:11-3c(2)(b), the Court is cognizant of, and indeed endorses, the principle of broad admissibility of evidence offered to establish the existence of mitigating factors. Ante at 619-22. The sticking point, however, is that although the Court recognizes that Davis effectively relaxes the standards of penalty-phase admissibility, the Court maintains that the unreliability of a sodium amytal test result, because it arguably could be used to establish the truth of a defendant's belief, is a substantial enough consideration in this case to preclude admission of the testimony proffered by Dr. Sadoff. Ante at 631-34.\n\nI strenuously disagree. It is virtually undeniable that admission of this evidence is not only consistent with the policy goals that underlie Davis, but also with the actual language of that decision. In Davis, the Court stated that a trial court \"must retain discretion to exclude . . . evidence, in whole or in part, if its probative value is substantially outweighed by its unfounded or speculative character and the risk of confusion of the substantial issues.\" Davis, supra, 96 N.J. at 623-24. Here, since resolution of defendant's motive is the central issue to be decided in this penalty phase, the essential test to be applied is the balance between the probativeness and the speculativeness or groundlessness of the proffered evidence.\n\nThe case of Barefoot v. Estelle, 463 U.S. 880, 103 S. Ct. 3383, 77 L. Ed. 2d 1090 (1983), provides a benchmark for the permissible limits of speculative expert psychological evidence in the penalty phase of a capital case. In Barefoot, the Supreme Court upheld the admissibility of psychiatric testimony concerning a capital defendant's future dangerousness offered pursuant to specific provision in the Texas death-penalty statute that treated future dangerousness as an aggravating factor. Although the psychiatrists had not even conducted a personal interview with the defendant, the Court stated that this evidence should be presented to the jury where the benefits of cross-examination and submission of contrary evidence by the opposing party would justify trust in the ability of the adversary\n\nprocess \"to sort out the reliable from the unreliable evidence and opinion about future dangerousness.\" Id. at 901, 103 S. Ct. at 3398, 77 L. Ed. 2d at 1109.\n\nIt is evident that Dr. Sadoff's testimony does not engender this degree of speculativeness. Nor can his testimony be dismissed as unfounded. Even if the substance of defendant's statement was not taken at face value, it cannot be ignored that Dr. Sadoff's opinion relied on other sources of information derived from and in addition to the sodium amytal interview.\n\nIn comparison, the probative value of this material is obvious. \"Probative value\" has been described as \"the tendency of evidence to establish the proposition that it is offered to prove.\" McCormick, Evidence  185 at 541 (E. Cleary 3d ed. 1984). Here, the probativeness of Dr. Sadoff's testimony is demonstrated not only by the extent to which it provides an answer to the immediate and central question of defendant's motive, but its power to explain why defendant obscured any understanding of his situation through his initial furnishing of other motives. Indeed, by demonstrating defendant's own inability to come to grips with his intense feelings for Stacy Elizardo, Dr. Sadoff's expert testimony inclusive of the amytal examination provides exactly the sort of clue to defendant's character and motives that our statutory scheme is designed to place before a penalty-phase jury.\n\nThe Court nevertheless holds that this evidence was properly excluded. In doing so, it suggests that any harm to defendant's cause was self-inflicted inasmuch as defendant was presented with the opportunity to have Dr. Sadoff testify on the basis of evidence already in the record, particularly defendant's own trial testimony that his accusation of Reynolds as pimping for Elizardo precipitated a shoving match that escalated into the fatal attacks. Ante at 634. This conclusion, however, is fundamentally flawed in that such an offer had the effect of eviscerating defendant's evidence. The essence of Dr. Sadoff's particular insight in this case arises from the application\n\nof his expertise to the information he personally gleaned from the defendant, including, of course, all of the non-literal sources that support his testimony. If the defendant miscalculated in terms of a trial tactic, namely, the withdrawal of Dr. Sadoff's testimony, such tactical error was necessitated by the trial court's own erroneous ruling. The difficulty of this issue, perhaps indicated by the length of this Court's discussion, might explain, if not justify, the trial court's exclusion of this evidence at the guilt phase. However, the trial court clearly erred when it extended this exclusion to the penalty phase; indeed, the trial court's statement that \"it doesn't make any difference whether its the penalty phase or the guilt phase\" is most disturbing. It demonstrates a failure to understand those sensitive and unique aspects peculiar to penalty phase deliberations that are established by statute and recognized by our case law. In this light, it is disingenuous to attribute the compromise of defendant's presentation solely to his own strategic trial decisions.\n\nFinally, we must consider the delicate balancing process that juries engage in during a capital-penalty proceeding. Juries are charged not only with the duty to determine the existence of statutory factors, but also to assign a quantum of weight for balancing purposes. It follows that every shred of relevant evidence is precious to a defendant seeking to save his or her life. In light of this balancing requirement, one is confounded by the suggestion of the Court that admission of this evidence is unnecessary because the jury found that the defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution, a mitigating factor under c(5)(a). One is further perplexed by the Court's cryptic acknowledgement that the exclusion of Dr. Sadoff's testimony \"may\" have affected the balancing of statutory factors. Ante at 631. Recent legal scholarship has begun to focus on the limited utility of \"reliability\" analysis in assessing capital sentencing decisions that primarily involve the weighing of values rather than the determination of facts. See, e.g.,\n\nBerger, The Supreme Court and Defense Counsel: Old Roads, New Paths -- A Dead End ?, 86 Colum.L.Rev. 9, nn. 443, 470 (1986); Goodpaster, The Adversary System, Advocacy, and Effective Assistance of Counsel in Criminal Cases, 14 N.Y.U. Rev. of L. and Social Change 59, 83-85 (1986); Note, Ineffective Assistance of Counsel at Capital Sentencing, 39 Stan.L.Rev. 461 (1987); cf. Ake v. Oklahoma, 470 U.S. 68, 87, 105 S. Ct. 1087, 1098, 84 L. Ed. 2d 53, 68-69 (1985) (Burger, C.J., concurring) (finality of sentence in capital cases warrants protections that may or may not be required in other cases). In a context where the nature, quantum and quality of subjective evidence is exceedingly critical, it is untenable to believe that additional evidence that could increase the weight of mitigating circumstances is \"unnecessary\" to a defendant seeking to have a jury spare his life.\n\nAccordingly, given the broad policy dictates implicit in the statute and explicit in our case law, I cannot agree with the Court's decision to exclude the expert testimony proffered by Dr. Sadoff from consideration by the jury during the penalty phase of this case. Because of these policies and in light of the ultimate gravity of the decision faced by a penalty-phase jury, each of the arguments and considerations that may point toward the admission of evidence during the guilt phase applies with irresistible force to the penalty phase. The Court's determination to the contrary is, in my opinion, untenable and unjust.\n\nIV.\n\nIn conclusion, the defendant's murder convictions must be reversed. He was denied the right to have the jury consider the evidence in light of a charge based on non-capital or ordinary murder, as clearly mandated by our Gerald decision.\n\nThe defendant was, moreover, critically prejudiced by the exclusion of the expert opinion of Dr. Sadoff concerning defendant's state of mind and motive, which opinion was derived from a scientifically acceptable procedure widely used within\n\nthe scientific community and undertaken in accordance with professional standards by an eminently qualified expert. In light of the admittedly different standards applicable to penalty-phase admissibility, the exclusion of this evidence from consideration by the sentencing jury is indefensible. The error of exclusion becomes even less defensible with the realization that all aspects of the facts underlying the proffered opinion, as well as ultimate conclusions, would be subject to complete cross-examination and rebuttal, serving to enhance the jury's ability to evaluate evidence and assess credibility.\n\nThe prejudicial exclusion of this evidence warrants reversal of defendant's murder convictions, impugns the imposition of the death sentence, and assuredly should not be duplicated in any resentencing trial.\n\nAccordingly, I dissent.\n\n\u003cspan class=\"fn\"\u003e1. The trial court merged count four, possession of a knife for an unlawful purpose (N.J.S.A. 2C:39-4(d)), with the two counts of murder. Count twelve, unlawful possession of a knife (N.J.S.A. 2C:39-5(d)) was merged with count eleven, and count ten, possession of a sawed-off shotgun (N.J.S.A. 2C:39-5(b)), was merged with count six.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. N.J.S.A. 2C:2-2b(3) provides: A person acts recklessly with respect to a material element of an offense when he consciously disregards a substantial and unjustifiable risk that the material element exists or will result from his conduct. The risk must be of such a nature and degree that, considering the nature and purpose of the actor's conduct and the circumstances known to him, its disregard involves a gross deviation from the standard of conduct that a reasonable person would observe in the actor's situation. \"Recklessness,\" \"with recklessness\" or equivalent terms have the same meaning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Model Penal Code's rationale for punishing passion/provocation manslaughter less severely than murder is somewhat different from that emphasized at common law: A sudden rage, however engendered, does not necessarily or even probably negate an intent to kill. More likely it reinforces the firmness of the actor's resolve to take the life of another. At most, therefore, provocation affects the quality of the actor's state of mind as an indicator of moral blameworthiness. Provocation is thus properly regarded as a recognition by the law that inquiry into the reasons for the actor's formulation of an intent to kill will sometimes reveal factors that should have significance in grading. It is a concession to human weakness and perhaps to non-deterability, a recognition of the fact that one who kills in response to certain provoking events should be regarded as demonstrating a significantly different character deficiency than one who kills in their absence. [American Law Institute, Part II, Model Penal Code and Commentaries  210.3, comment at 54-55 (1980).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Our dissenting colleague argues that \"[i]t is unfair and inaccurate to conclude, as did the trial court, that Dr. Sadoff was of the opinion that the defendant acted with the belief that Stacey was engaged in prostitution simply because the defendant said this during the sodium-amytal interview.\" Post at 665-666. However, at several stages of the Rule 8 hearing Dr. Sadoff appeared to acknowledge that it was only during the sodium-amytal interview that defendant expressed his belief that he killed Stacey Elizardo in a state of rage: THE COURT: Well, let me share with you my dilemma. I have the impression that you, Dr. Orne, and Dr. DiGiacomo would all agree that as a fact-determining drug sodium amythal [sic] is totally ineffective. THE WITNESS: I would agree. THE COURT: And it would appear that this state of the law that as such, the results of such a test are inadmissible in the courts of law of this state. THE WITNESS: Yes. THE COURT: I have the further impression that there are many areas of diagnosis and/or treatment where it is a useful tool to a trained psychiatrist. THE WITNESS: Yes. THE COURT: I have listened to your testimony and I have the impression you are saying you have concluded that the defendant was in a state of rage when he committed the offenses? THE WITNESS: Yes. THE COURT: And that that rage was because of his belief that Stacy was being pimped by Paul Reynolds? THE WITNESS: Yes. THE COURT: Is that accurate? THE WITNESS: Yes. THE COURT: And the only place the fact of that pimping which is the basis for your opinion comes from are the sodium amythal [sic] testing * * * so that anyone who puts it on any kind of scale, it seems to me, would say this was the least reliable part of a totally unreliable test, but the doctor has learned the facts as a result of it; how do I deal with that and resolve that in terms of it is not reliable to ascertain the truth? Have you used it to ascertain the truth of what was in his mind on that date? THE WITNESS: Have I? THE COURT: Pitts. Yes. THE WITNESS: I have not, no. THE COURT: You have not? THE WITNESS: I have not. I would not allege in any way or fashion that the information about pimping or about Stacy being a prostitute has any factual basis at all. I don't know if it's the truth. What I believe is from my testing, that Darryl Pitts believed at least under sodium amytal that that was the reason he killed her. THE COURT: And related to you under the least reliable part of the test? THE WITNESS: All right. Yes. Also, during cross-examination Dr. Sadoff indicates that his testimony about defendant's rage was based on the sodium-amytal interview. BY MR. KASSELMAN: Q. Well, how does -- well, before the test, Doctor, you indicated that you weren't able to give an opinion in this case, isn't that correct? A. I said -- Q. You didn't feel comfortable giving an opinion? A. I didn't feel that I could give one within a reasonable medical certainty. Q. Right. Exactly. A. An opinion about the Vietnam stress syndrome, and I had no other understanding as to why these two people were killed, and I said if we do the sodium amythal [sic] we can either confirm the Viet Nam stress syndrome idea or maybe something else will emerge. And what came out was this story that I had not had before which seemed to me to be consistent with the type of rage that would be necessary for homicide under those circumstances. Q. So that based upon the sodium amytal test you received some information which led you to eliminate Vietnam and to substitute in its place another scenario for the killing, is that correct? A. I guess that is a way to put it, yeah.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. At the conclusion of the Rule 8 hearing the trial court observed: That does not mean to say that the defense is foreclosed from getting Dr. Sadoff's opinion in evidence, and I believe that it would be very appropriate one, to give Dr. Sadoff the hypothetical state of facts, assuming it's based on evidence, and let him give his opinion based on those facts. Now, in that case if the jury believes the facts they can evaluate his opinion and if they disbelieve the facts which are the basis of his opinion, then they are in position to give it what weight or credibility they believe it deserves. On the other hand, if the defendant should decide to testify and decide to tell the jury and everyone else what the basis of his thinking was at the time, then of course, Dr. Sadoff would be at liberty to take that information in the form of underlying facts and give an opinion. The jury then is able to evaluate the underlying facts, as jurors are able to do, without being asked to evaluate a sodium amytal testing procedure which apparently even the experts can't agree on evaluating.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The colloquy on this point follows: My ruling now is sodium amytal is unreliable as a truth ascertaining device. The psychiatric profession said it unanimously and the courts have said it unanimously, and it doesn't make any difference whether it's the penalty phase or guilt phase, it is still unreliable and it is its unreliability which makes it inadmissible. Beyond that, I rule nothing. Dr. Sadoff may come in and say whatever he wants to, and if you want his opinion, it seems to me all you have to do is feed him the information that he got under the sodium amytal because now your client has testified to it in this Court and it would be a very proper basis for Dr. Sadoff's opinion. Have I left anything unclear? MR. GOLDSTEIN: The only thing I am the least bit unclear about, and maybe, it's been a long day, maybe I am being somewhat obtuse, but the only thing I am a little bit unclear about, are you indicating that Dr. Sadoff may not tell the jury on direct that he believes him under the sodium amytal because of the sodium amytal, but he may in fact tell the jury that he gave him a sodium amytal interview without expressing his opinion? THE COURT: What probative value would that have? MR. GOLDSTEIN: Well, the same thing when you say, \"Did you give him the Minnesota Multiphasic Personality Test?\" THE COURT: The Minnesota Multiphasic Personality is a well recognized and accepted psychiatric test. MR. GOLDSTEIN: So then I am correct that Dr. Sadoff would not be allowed to mention the sodium amytal? THE COURT: No, I am not saying that because I don't know in what context he would want to say it. It does have some diagnostic aid to psychiatrists; we heard two days of what they are. I don't know whether any of them are relevant in this case and I am not going to make rulings in a vacuum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The mitigating factor set forth in N.J.S.A. 2C:11-3c(5)(a) is as follows: \"The defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Senate Judiciary Committee's Statement to Senate Bill No. 950 (L. 1985, c. 178) includes the following explanatory comment: \"In enacting the amendments contained in this bill, the intent of the Legislature is to effect only prospective changes. The amendments are not intended to apply retrospectively or to affect cases now on appeal.\" But cf. State v. Biegenwald, supra, 106 N.J. 13, 65-67 (1987) (holding that provision in Chapter 178, Laws of 1985 requiring jury to find beyond a reasonable doubt that aggravating factors substantially outweigh mitigating factors would be applied retroactively to defendant based on fundamental fairness).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The trial court's charge to the jury on aggravating factor c(4)(c) was as follows: Insofar as the first aggravating factor which I have just mentioned in connection with each of the murders, although every murder may be viewed as vile, horrible or inhuman, this does not mean that there is an automatic aggravating factor in every case of murder. What is necessary is that the State prove that the attack by the defendant Pitts on the victim that you are considering involved either torture or conduct indicating a depraved mind or that the attack was so savagely brutal or outrageously cruel and violent that the adjectives wantonly vile or horrible or inhuman are justified. You must be satisfied that such conduct was present and you must be satisfied beyond a reasonable doubt.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We intimate no view on whether the evidence in the first trial, or on remand, was or will be sufficient to submit factor c(4)(c) to the jury in the event of a retrial of the penalty phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The crime of serious-bodily-injury murder, committed either purposefully or knowingly, is a lesser-included offense of purposeful/knowing capital murder because it differs from the latter only in that the defendant contemplated a less serious result or harm than death. N.J.S.A. 2C:1-8(d)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In Sinnott, and in the successor case of State v. Levitt, 36 N.J. 266 (1961), the underlying issue was the admissibility of expert evidence, based on a sodium amytal interview, that was intended to show that defendant did not have a propensity or deviational trait indicative of a tendency to commit various sex-related offenses. In excluding such evidence, the Sinnott Court was greatly influenced by the purpose of the proffer. The Court focused not only on case law prohibiting the admission of testimony elicited from a person while under the influence of sodium amytal, but also analogized the proffered testimony to evidence of good character intended to prove that defendant did not commit the crime. Sinnott, supra, 24 N.J. at 420-21. In the present case, however, the evidence is proffered not to establish that defendant did not kill, but to demonstrate his state of mind at the time of the killing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. At the Rule 8 hearing, Dr. Sadoff testified as follows: I had no understanding as to why he killed Paul because he wasn't able to tell me. He said they got into an altercation, but he didn't say about what. It was never very clear to me about what would have stimulated in Darryl Pitts sufficient rage to kill this man, and the reasons given seem superficial to me and were not sufficient for that type of rage. I had an opinion about the Viet Nam stress syndrome, and I had no other understanding as to why these two people were killed, and I said if we do the sodium amythal [sic] we can either confirm the Viet Nam stress syndrome idea or maybe something else will emerge. And what came out was this story that I had not had before which seemed to me to be consistent with the type of rage that would be necessary for homicide under those circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. During the Rule 8 hearing, Dr. Sadoff stated explicitly that the \"sodium amytal report is not just based on sodium amytal, it's based on everything. I don't just base any reports on just sodium amytal, it's [sic] based on all the other information that I have.\" Here, the extent of such additional sources was substantial. Supra at 654.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. As Dr. Sadoff testified at the Rule 8 hearing: [M]y interpretation of the test and the reliability of that test [of defendant] under those conditions at that time, and my interpretation is that it came after a period of blocking or resistance that indicates that it's something that happened dredged up from the bottom and had been suppressed or repressed there and was meaningful to him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The trial court, moreover, was not justified in placing such dominant reliance on Dr. Orne's testimony concerning the usefulness of this examination; the record clearly reflects that although his credentials as a psychiatrist were impeccable, he was much less experienced in the use of sodium amytal than Drs. Sadoff and DiGiacomo. Dr. Sadoff testified that over the course of his career he had administered about 150 sodium amytal interviews; Dr. DiGiacomo stated that he had administered approximately 4,000. Dr. Orne, however, claimed to have conducted \"maybe 20\". It appears from Dr. Orne's testimony that one of the primary bases for his expert opinion is analogy to his expertise in the use of hypnosis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This exchange occurred: Q [H]ave you ever been intimate with [Stacy]? A Have I? Q Yes. A Yeah. Q Do you recall on how many occasions? A Not that often because she gets laid as much as she wants and I guess it's her -- she didn't need to get laid that much or she wants to get laid by the person she wants to. I don't know, really. Q Well, when you went to the apartment, now it's the 23rd, on the 22nd which was yesterday, did you have any jealousy of the fact that she was with another man? A No. Because I became accustomed to that because I've been over there so many times, men come and go out of there. I figure she was running a fucking whorehouse.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Dr. Cooke testified: What he told me really starts two days before the offense itself. And on that day there was a situation in which he was at Paul's [actually, Stacy's] house, Stacy was there, and he preceived [sic] himself as having helped Paul and Stacy in that situation by helping to get someone [Vincent Della Polla] out of the apartment that they did not want there. So the important thing that I felt from a psychological point of view about that incident was that he indicated a feeling that he had helped Stacy and Paul, which is important because it ties in with his feeling and the personality dynamics. He is not very good at getting these feelings out and you have to pull and talk about it, but that he felt that because of the incident two days before where he had helped he felt at that point he was being used, that Stacy didn't want to come out and talk to him, Paul was arguing with him, that he had served his purpose for them and they were just using him and dumping him, so he was upset about that. He also indicated . . . that Paul was belittling him, mocking him and insulting him. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Dr. Cooke testified that: [Defendant] indicated that Paul implied, did not say so in so many words, but implied that Stacy was engaging in sexual relations in order to get drugs and he said, he used the term \"prostitution.\" He said that that was the first he had heard or recognized that possibility. I questioned him specifically about why he told the police that he went to the apartment because he owed money and also why he came up with [such] a specific figure as $700.00. He indicated to me that [Reynolds] did not owe him money, that the $700.00 figure was, had something to do with what his wife told him she needed to pay some bills and that he told the police that for two reasons. One, that he did not want to seem involved with drugs, the other, and as we went over this, this seemed to emerge as the primary reason, he used the term, \"emotional cripple.\" He did not want the police to think of him as somebody who couldn't control himself and killed two people because of emotional problems, but, rather, wanted to give them an explanation that didn't label himself that way, an explanation that he went there because they owed him money. [Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The following exchange occurred during cross-examination of defendant: Q And you believe it's the macho thing to tell this jury that you killed her because she was prostituting herself and that Reynolds was pimping her, is that what you want this jury to believe? A I want the jury to believe that I didn't have the intentional thought to harm these people. Q My question, sir, do you really want this jury to believe, not only that you killed her, but you killed her because Paul Reynolds was pimping her as a prostitute, is that what you want this jury to believe? A I don't want them to believe anything like that about Stacy.\u003c/span\u003e\n\n",
    "body_length": 207708,
    "citedas": [
      "562 A.2d 1320",
      "116 N.J. 580"
    ],
    "attorneys": "Benjamin Goldstein argued the cause for appellant (Maressa, Goldstein, Birsner, Patterson \u0026 Drinkwater, attorneys). Janet Flanagan, Deputy Attorney General, argued the cause for respondent (W. Cary Edwards, Attorney General of New Jersey, attorney; Olivia Belfatto, Deputy Attorney General, of counsel; Janet Flanagan and Olivia Belfatto, on the briefs).",
    "category": [
      "36",
      "78"
    ],
    "judges": "For affirmance in part and reversal in part -- Chief Justice Wilentz and Justices Stein, Clifford, Pollock, O'Hern, and Garibaldi. Dissenting -- Justice Handler. The opinion of the Court was delivered by Stein, J. Handler, J., dissenting.",
    "citation_count": 96
  }
}
