{
  "id": "wLg_TmYBTlTomsSBnnqT",
  "document": {
    "title": "State v. Vela",
    "full_title": "STATE OF NEBRASKA v. ERICK FERNANDO VELA .",
    "jurisdiction": "Nebraska Supreme Court",
    "date": "2010-01-08T00:00:00.000Z",
    "docket": "No. S-07-138",
    "body": "Wright, Connolly, Gerrard, Stephan, Mccormack, and Miller-Lerman, JJ., and Irwin, Judge.\n\nI. Introduction .................................................................... 98\n\nII. Aggravation Hearing ...................................................... 100\n\n1. Background ............................................................... 100\n\n(a) Bank Murders ...................................................... 101\n\n(b) Lundell Murder ................................................... 103\n\n(c) Discovery Requests ............................................. 105\n\n2. Assignments of Error ................................................ 106\n\n3. Standard of Review ................................................... 107\n\n4. Analysis and Resolution ........................................... 107\n\n(a) Ex Post Facto Claim ........................................... 107\n\n(b) Notice of Aggravating Circumstance (1)(a) ........ 111\n\n(c) Jury Instruction: Malice ...................................... 115\n\n(d) Jury Instruction: Lesser-Included offenses ......... 118\n\n(e) Jury Instruction: \"Other Crime\" ......................... 119\n\n(f) Jury Instruction: Aiding and Abetting ................. 120\n\n(g) Motion for Discovery .......................................... 125\n\nIII. Mental Retardation Proceedings .................................... 126\n\n1. Background ............................................................... 126\n\n(a) Legal Context ...................................................... 126\n\n(b) Motions ............................................................... 127\n\n(c) Mental Retardation Hearing ................................ 129\n\n(d) Order ................................................................... 137\n\n2. Assignments of Error ................................................ 138\n\nTable of Contents\n\n3. Standard of Review ................................................... 138\n\n4. Analysis and Resolution ........................................... 139\n\n(a) Access to Department of Correctional Services' Records ................................................ 139\n\n(b) Independent Evaluation ....................................... 141\n\n(c) Presumption of Mental Retardation .................... 145\n\n(d) Finding that Vela Is not person With Mental Retardation ..................................... 146\n\n(i) Intellectual Functioning ................................ 146\n\n(ii) Adaptive Behavior ........................................ 147\n\nIV. Sentencing Proceedings ................................................. 153\n\n1. Background ............................................................... 153\n\n(a) Vela's Evidence ................................................... 153\n\n(b) State's Evidence .................................................. 155\n\n(i) Rebuttal ......................................................... 155\n\n(ii) Victim Impact Testimony .............................. 157\n\n(c) Sentencing Order................................................. 157\n\n2. Assignments of Error ................................................ 160\n\n3. Standard of Review ................................................... 160\n\n4. Analysis and Resolution ........................................... 160\n\n(a) Victim Impact Testimony .................................... 160\n\n(b) Mitigator (2)(b) ................................................... 163\n\n(c) Mitigator (2)(e) ................................................... 164\n\n(d) Proportionality Review by Sentencing Panel ...... 164\n\n(e) De Novo Proportionality Review ........................ 165\n\n(f) Method of Execution ........................................... 167\n\nV. Conclusion ..................................................................... 167\n\nI. Introduction\n\nOn september 26, 2002, erick Fernando Vela and two other armed men walked into a bank in norfolk, Nebraska. In less than a minute, they shot and killed four bank employees and one customer. Vela was apprehended and eventually pled guilty to five counts of first degree murder and five counts of use of a weapon to commit a felony. the district court for Madison County accepted his pleas and found him guilty of all 10 offenses. because the state sought the death penalty, an aggravation hearing was conducted before a jury to determine whether one or more of the alleged aggravating circumstances existed. the jury determined that five statutory aggravating circumstances existed for each of the murders. Vela moved to have electrocution as a means of execution declared unconstitutional. His motion was overruled. Vela then filed motions to preclude the imposition of the death penalty under a Nebraska statute which provides that \"the death penalty shall not be imposed upon any person with mental retardation.\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe district court granted the state's motion to have Vela examined by its chosen expert with respect to his allegation that he was a person with mental retardation. Vela filed an interlocutory appeal which, on March 23, 2005, in case no. s-04-1324, we summarily dismissed based upon our determination that the order was not final and appealable. Following remand, the district court conducted an evidentiary hearing and determined that Vela had not proved that he was a person with mental retardation as defined by applicable Nebraska statutes and overruled his motion to preclude imposition of the death penalty. We dismissed Vela's interlocutory appeal from that order.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e a sentencing hearing was conducted before a three-judge panel. after receiving evidence, the panel found that the aggravating circumstances outweighed the mitigating circumstances and sentenced Vela to death for each of the five counts of first degree murder. the cause before us is Vela's automatic direct appeal from the sentencing order.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Vela has assigned numerous errors by the district court. We shall address them in three separate groups, corresponding to the stage of district court proceedings to which they relate: the aggravation hearing, the mental retardation hearing, and the sentencing proceedings. additional facts will be set forth where pertinent to our discussion and analysis.\n\nII. Aggravation Hearing\n\n1. Background\n\nThe original information filed against Vela on october 31, 2002, charged five counts of first degree murder and five counts of use of a weapon to commit a felony, but did not include notice of aggravating circumstances. the third amended information filed on June 9, 2003, charged the same offenses and included a notice of aggravating circumstances with respect to each murder count.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e each notice used the statutory language defining the aggravating circumstance\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e but did not include more specific factual allegations. In particular, the notices did not specifically allege that the state intended to establish a \"substantial prior history of serious assaultive or terrorizing criminal activity\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e by proving that Vela, prior to the bank murders, committed the first degree murder of travis Lundell. Vela pled guilty to the charges in the third amended information.\n\nUpon accepting Vela's guilty pleas, the trial court scheduled a hearing before a jury to determine whether any of the aggravating circumstances alleged by the state existed. at the time Vela committed the murders in september 2002, Nebraska's capital sentencing statutes provided that the sentencing judge or panel would determine the existence of any aggravating circumstances which could warrant imposition of the death penalty.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e but in november 2002, the Nebraska Legislature, meeting in special session, enacted L.B. 1,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e which amended Nebraska's capital sentencing statutes. L.B. 1 was enacted in response to the holding of the U.S. supreme Court in Ring v. Arizona,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e decided on June 24, 2002. In Ring, the supreme Courtheld that, other than the finding of a prior conviction, the determination of aggravating circumstances in a capital case must be made by a jury unless waived by the defendant. the amendments made by L.B. 1 became effective on november 23, 2002,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e approximately 7 months before Vela entered his guilty pleas. prior to the scheduled aggravation hearing, Vela filed a motion alleging that the death sentence could not constitutionally apply to him because L.B. 1 was ex post facto legislation. Vela also filed a motion which sought, inter alia,to prohibit the submission of aggravating circumstance (1)(a) to the jury on the ground that the information had not alleged the specific acts upon which the state based the existence of this aggravating circumstance. the district court overruled both motions. at the commencement of the aggravation hearing, the parties stipulated that Vela shot and killed Lisa bryant; that Jorge Galindo shot and killed Lola elwood; and that Jose sandoval shot and killed Jo Mausbach, evonne tuttle, and samuel sun. throughout the aggravation trial, Vela objected to evidence and testimony concerning the actions of sandoval and Galindo. He argued that such evidence was irrelevant because aggravating circumstances could not be based on aiding and abetting liability. the district court overruled the objections.\n\n(a) Bank Murders\n\nMuch of what transpired on the morning of september 26, 2002, was photographed by the bank's surveillance cameras. recorded video and several time-stamped still-frame photographs from the surveillance system were received into evidence during the aggravation hearing. the photographic evidence showed that at 8:44:56 a.m., Galindo, followed by Vela and then sandoval, entered the bank through its front door. sandoval walked straight ahead to the teller counter, where he shot bank employees sun and Mausbach and bank customer tuttle at close range. tuttle sustained a penetrating gunshot wound to the head and another gunshot wound which entered the back of her left hand. sun sustained two penetrating gunshot wounds to his head and another which entered his neck and passed through his chest. blood from the wounds filled sun's air passages, causing his death by asphyxiation, described by the pathologist who performed the autopsy as a \"horrible-type of death\" occurring over a period of several minutes. Mausbach sustained a gunshot wound to the head. Like sun, she died from asphyxiation resulting from blood filling her air passages over a period of several minutes.\n\nAfter entering the bank, Galindo immediately approached the private office of elwood, which was located off the bank lobby to his left as he entered the building. bank employees Cheryl Cahoy and susan staehr were seated in the office, meeting with elwood. as Galindo approached the office, Cahoy heard a gunshot and an unidentified male voice ask if the alarm had been pulled. Cahoy heard more gunshots and ducked her head. as she did so, she heard elwood scream. When she looked up, she saw elwood slumped over in her chair. elwood sustained two gunshot wounds which penetrated her lungs and heart, and a third gunshot wound to the right side of her abdomen. neither Cahoy nor staehr was injured. after entering the bank, Vela immediately proceeded to bryant's private office, located off the bank lobby to Vela's right as he entered the building. surveillance photographs show that he entered bryant's office by 8:45:06 a.m. and exited the office at 8:45:27 a.m. bryant's body was found lying behind her desk. she was shot at close range; one bullet penetrated her left hand as it was held up and then entered her neck. another bullet fractured her right femur and lodged in her thigh. bryant died from asphyxiation caused by blood from the neck wound entering her air passages, causing her to struggle for air over a period of several minutes. bank customer Micki koepke arrived at the bank at approximately 8:45 a.m. as she entered the building, she saw sandoval at the teller counter. at 8:45:29 a.m., Galindo fired at koepke from where he stood in the doorway of elwood's office. the bullet entered and exited koepke's upper right shoulder, and she ran to her vehicle and called the 911 emergency dispatch service. the shots Galindo fired at koepke also struck a fast-food restaurant across the street from the bank.\n\nVela, sandoval, and Galindo left the bank about 45 seconds after they entered. a witness who observed Vela shortly after he left the bank testified that he was smiling. the three men forcibly entered an occupied home near the bank. Vela put a gun to the head of one resident, and the men demanded and received car keys belonging to another resident. they obtained the keys and escaped in the stolen vehicle without injuring any of the occupants of the home. they were apprehended and taken into custody shortly thereafter. Vela pled guilty to burglary, robbery, and use of a firearm to commit a felony in connection with this incident. sandoval and Galindo were tried, convicted, and sentenced to death on each of five counts of first degree murder and related weapons charges; we recently affirmed Galindo's convictions and sentences,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and sandoval's direct appeal is pending by this court. Gabriel rodriguez, who participated in the attempted bank robbery but was not in the bank when the shots were fired, was convicted of five counts of first degree murder and related weapons charges and sentenced to life imprisonment.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n(b) Lundell Murder\n\nLundell was reported missing on august 20, 2002. by letter dated January 21, 2003, the prosecutor notified Vela's counsel that if \"Vela wishes to discuss the disappearance and strangulation murder of . . . Lundell, we are available to listen to whatever he wishes to disclose.\" In a second letter dated March 11, 2003, the prosecutor advised Vela's counsel that he intended to use the Lundell murder at the \"aggravation stage\" of Vela's trial. on March 17, Galindo led investigators to a rural area of Madison County, Nebraska, where the body of Lundell was recovered from a shallow grave. at the aggravation hearing held in september 2003, the state presented evidence, over Vela's continuing objection, of his involvement in the death of Lundell, in order to establish the aggravating circumstance that Vela had a \"substantial prior history of serious assaultive or terrorizing criminal activity.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nLundell's severely decomposed body was found wrapped in a comforter held together by strapping tape beneath approximately 3 feet of earth. a bandana scarf was tied around the mouth and knotted in the back of the neck. the feet were bound together by a fabric strap and string. a forensic pathologist who performed an autopsy testified that the state of decomposition was consistent with burial in a moist grave since august 2002. Due to the extent of internal and external decomposition, the cause of death could not be determined.\n\nLundell's mother testified that in august 2002, he had been living in a norfolk apartment with sandoval and two other persons. He normally contacted her at least once every 2 weeks, but she last heard from him on august 15. at that time, he was 19 years old. Lundell regularly wore a watch which he had purchased in about May 2002, but it was not found on his body or at the site of the exhumation, and his mother did not find it among his personal belongings at his apartment. Vela was wearing a watch at the time of his arrest on september 26; it was taken by law enforcement personnel and stored with his personal property. Lundell's mother identified this watch as belonging to Lundell. several persons who had been incarcerated with Vela after his arrest for the bank murders testified that he admitted his involvement in the killing of Lundell. one witness testified that after seeing a television news account of the discovery of Lundell's body, Vela told him that he strangled Lundell because he had stolen marijuana from sandoval and was giving information to the police. Vela also told this witness that the killing was a test to determine if he had the courage required to kill people in the bank. Vela told this witness that sandoval and another person were involved with him in the Lundell murder and that they wrapped Lundell's body in a blanket and took it away in the trunk of a vehicle. another former cellmate testified that Vela told him about a \"boy\" whom he, Galindo, and sandoval had killed and buried. the witness testified that Vela told him that he strangled the boy with a wire while Galindo was holding his legs. according to this witness, Vela told him they killed the boy because he owed money to Vela and sandoval. Vela also told the witness that he had taken a watch from the boy \"because he liked it.\" Vela described the watch as silver with a blue face. another person who was acquainted with Vela both in and out of jail testified that he admitted involvement in the Lundell murder but did not \"end it.\" also received in evidence at the aggravation trial was a letter which Vela wrote to his family while in jail, but did not send. In the letter, Vela stated that he was involved in Lundell's death and that he was sorry about it, but that \"if I wouldn't do it they would of kill[ed] me and I couldn't escape from them and I was ashame[d] to ask [for] help.\" at the conclusion of the aggravation hearing, the district court instructed the jury on five aggravating circumstances.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe instructions generally followed the nJI2d Crim. 10.1 model instruction for jury aggravation proceedings. With respect to aggravating circumstance (1)(a), the \"substantial prior history of serious assaultive or terrorizing criminal activity,\" the court gave an instruction which included all the elements of the first degree murder of Lundell. the instructions defined premeditation, but did not define \"malice.\" the court did not instruct on the lesser-included offenses of first degree murder as part of the aggravator. the jury returned a verdict finding all five aggravators existed for each of the five murders. the district court overruled Vela's motion for new trial.\n\n(c) Discovery Requests\n\nIn May 2006, more than 21/2 years after the jury's determination of aggravating circumstances, Vela filed a motion requesting leave to take the depositions of five persons who had been convicted in federal criminal proceedings. Vela argued that the depositions were needed to determine whether the discretion of the lead prosecutor in his case had been \"burdened by a conflict of interest created by [the prosecutor's] alleged involvement\" in a criminal conspiracy involving some of the convicted felons.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Vela's motion alleged that two of the witnesses who testified for the state at his aggravation hearing were linked to the alleged conspiracy. the district court denied the motion to take the depositions, determining that there had been no showing that the proposed depositions would be relevant or material to the proceedings involving Vela.\n\n2. Assignments of Error\n\nVela assigns, restated and renumbered, that the district court erred in the following:\n\n1. Denying his motion to prohibit any jury aggravation trial because L.B. 1 is ex post facto legislation, in violation of article I, § 10, of the U.S. Constitution and article I, § 16, of the Nebraska Constitution.\n\n2. receiving evidence at the aggravation trial concerning the Lundell homicide and submitting aggravator (1)(a) to the jury, in violation of his right to notice under the 6th and 14th amendments to the U.S. Constitution and article I, § 11, of the Nebraska Constitution, and in denying his motion for new trial on these grounds.\n\n3. Failing to define the term \"malice\" in its jury instruction on aggravator (1)(a), in violation of the Due process Clause of the 14th amendment to the U.S. Constitution and article I, § 3, of the Nebraska Constitution.\n\n4. Failing to instruct on the lesser-included offenses of first degree murder in its jury instruction on aggravator (1)(a), in violation of neb. rev. stat. § 29-2027 (reissue 2008), the 8th and 14th amendments to the U.S. Constitution, and article I, §§ 3 and 9, of the Nebraska Constitution.\n\n5. Failing to identify and define the crime for which Vela was allegedly trying to conceal the identity of the perpetrator with regard to aggravating circumstance (1)(b), in violation of the Due process Clause of the 14th amendment to the U.S. Constitution and article I, § 3, of the Nebraska Constitution.\n\n6. receiving evidence concerning the actions of Vela's codefendants and by instructing the jury that the alleged aggravating circumstances could be based upon liability as an aider and abettor, in violation of the 8th and 14th amendments to the U.S. Constitution; article I, § 9, of the Nebraska Constitution; and the language of § 29-2523.\n\n7. Failing to grant his motion to take additional depositions and recuse the Madison County attorney, in violation of neb. rev. stat. §§ 25-1233 and 29-1917 (reissue 2008) and the 6th and 14th amendments to the U.S. Constitution.\n\n3. Standard of Review\n\n[1] the constitutionality of a statute is a question of law, regarding which the supreme Court is obligated to reach a conclusion independent of the determination reached by the trial court.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n[2] Whether a jury instruction is correct is a question of law, regarding which an appellate court is obligated to reach a conclusion independent of the determination reached by the trial court.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n[3] the trial court has broad discretion in granting discovery requests and errs only when it abuses its discretion.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n4. Analysis and Resolution\n\n(a) Ex Post Facto Claim\n\n[4,5] Both U.S. Const. art. I, § 10, and neb. Const. art. I, § 16, provide that no ex post facto law may be passed. a law which purports to apply to events that occurred before the law's enactment, and which disadvantages a defendant by creating or enhancing penalties that did not exist when the offense was committed, is an ex post facto law and will not be endorsed by the courts.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e this court ordinarily construes Nebraska's ex post facto clause to provide no greater protections than those guaranteed by the federal Constitution.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nAs noted above, L.B. 1 changed the procedure by which the existence of aggravating circumstances is determined in a first degree murder case. prior to its passage, the existence of statutory aggravating circumstances necessary to warrant imposition of the death penalty was determined by the sentencing judge or three-judge panel.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e L.B. 1 changed prior law by requiring that a jury determine the existence of aggravating circumstances, unless a jury is waived by the defendant.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nWe have previously rejected claims that L.B. 1 constituted ex post facto legislation with respect to the imposition of the death penalty for first degree murders committed before its enactment. State v. Gales (Gales I)\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e was an appeal from two death sentences imposed in 2001 for first degree murders committed in 2000. It was pending before this court at the time of the Ring decision and the Legislature's subsequent enactment of L.B. 1. the defendant in Gales I objected to the state's request that the matter be remanded for sentencing pursuant to L.B. 1, arguing that L.B. 1 constituted a substantive change in the law which could not be applied retroactively without violating the constitutional prohibition of ex post facto legislation. We held that the change which required a jury instead of a judge or panel of judges to determine the existence of aggravating circumstances was procedural in nature and remanded the cause to the district court for resentencing. on remand, in State v. Gales (Gales II),\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e the defendant was again sentenced to death after a jury determined the existence of multiple aggravating circumstances, and this court affirmed those sentences on direct appeal.\n\nSubsequently, in State v. Mata (Mata I),\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e we rejected a similar claim. as in Gales I, the defendant in Mata I committed first degree murder and was sentenced to death before the Ring decision and the enactment of L.B. 1. on direct appeal, we affirmed the conviction, but pursuant to our holding in Gales I, we vacated the death sentence and remanded the cause for resentencing on the charge of first degree murder. on remand, in State v. Mata (Mata II),\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e the defendant was once again sentenced to death after a jury determined the existence of aggravating circumstances. In deciding his appeal from that sentence, we rejected a claim that L.B. 1 constituted ex post facto legislation, because Ring rendered unconstitutional the death penalty statutes which were in effect at the time of the murder. relying upon the reasoning of Dobbert v. Florida,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e we concluded that \"mere procedural changes to comply with new constitutional rules do not disadvantage a defendant or impose additional punishment even if the procedures in effect when the defendant committed the offense are later declared unconstitutional.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nVela argues that his case is distinguishable from Gales II, Mata II, and Dobbert, because he committed first degree murder after the decision in Ring and before the enactment of L.B. 1. He contends that Ring \"effectively invalidated Nebraska's death penalty scheme\" and that his crimes were committed \"during the period in which Nebraska had no effective death penalty.\"\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nVela's factual premise is correct, but his legal conclusion is not. as we recently noted in State v. Galindo,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e the death penalty did not disappear from Nebraska law during the approximately 5-month period between the decision in Ring and the enactment of L.B. 1. before, during, and after that period, Nebraska statutes provided that the maximum penalty for first degree murder was death.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e before he entered the bank on the morning of september 26, 2002, the existence of those statutes gave Vela fair warning of the penalty which the state of Nebraska would seek to impose on him if he were convicted of first degree murder.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\n[6] L.B. 1 did not aggravate the crime of first degree murder or change the quantum of punishment for its commission. as we have written in Gales I, Mata I, and Galindo, L.B. 1 changed only the procedures for determining whether the death penalty is to be imposed in an individual case. L.B. 1 simply reassigned the responsibility for determining the existence of aggravating circumstances from judges to juries in order to comply with the new constitutional rule announced in Ring. We specifically held in Gales I and reaffirmed in Mata I and Galindo that the change was procedural, not substantive.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\n\"Even though it may work to the disadvantage of a defendant, a procedural change is not ex post facto.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn this case, as in Dobbert, \"not only was the change in the law procedural, it was ameliorative\"\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e both in its intent\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e and operation. L.B. 1 guaranteed a defendant's sixth amendment right, recognized for the first time in Ring, to have a jury determine whether there were aggravating circumstances which would warrant imposition of the death penalty. It also specifically recognized a defendant's right to waive a jury determination of the alleged aggravating circumstances and have that determination made instead by a panel of three judges.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nNor do we find merit in Vela's argument that L.B. 1 specifically targeted him and others involved in the norfolk bank murders and was, therefore, ex post facto legislation. While individual senators and witnesses made references to the norfolk bank cases during Judiciary Committee hearings on L.B. 1, the Introducer's statement of Intent clearly stated that the bill was introduced to \"set[] forth procedural modifications to Nebraska's existing statutory first degree murder sentencing process in response to the U.S. supreme Court decision in Ring v. Arizona.\"\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e this legislative intent was specifically codified in § 29-2519(2)(e), which also states that it is the Legislature's intent that the provisions of L.B. 1 \"shall apply to any murder in the first degree sentencing proceeding commencing on or after november 23, 2002.\" (emphasis supplied.) the language of the statute itself plainly expresses the Legislature's intent that it should apply broadly to all capital sentencing proceedings after the date of enactment, and we will not consider isolated comments made during a committee hearing to narrow this intent.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\n(b) Notice of Aggravating Circumstance (1)(a)\n\nL.B. 1 did not alter the substantive nature of the statutory aggravating circumstances, one or more of which must be proved by the state beyond a reasonable doubt before the death penalty may be considered for a defendant found guilty of first degree murder.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e but it did establish a new procedure requiring the state to include a \"notice of aggravation\" in any information charging first degree murder in which the death penalty was sought: any information charging a violation of section 28-303 and in which the death penalty is sought shall contain a notice of aggravation which alleges one or more aggravating circumstances, as such aggravating circumstances are provided in section 29-2523. . . . It shall constitute sufficient notice to describe the alleged aggravating circumstances in the language provided in section 29-2523.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nVela pled guilty to the five counts of first degree murder alleged in the third amended information, each of which included a notice of aggravation alleging six aggravating circumstances, including that specified in § 29-2523(1)(a): \"[t]he offender was previously convicted of another murder or a crime involving the use or threat of violence to the person, or has a substantial prior history of serious assaultive or terrorizing criminal activity.\" Vela now argues that he was denied due process, because the state did not specifically allege that it intended to prove his involvement in the Lundell murder in order to establish a \"substantial prior history of serious assaultive or terrorizing criminal activity.\" our pre-Ring/L.B. 1 jurisprudence clearly held that \"[t]he state is not constitutionally required to provide the defendant with notice as to which particular aggravating circumstance or circumstances the state will rely upon in pursuing the death penalty,\"\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e because the specific delineation of the aggravating circumstances in the statutes constitutes sufficient notice to a defendant charged with first degree murder. In State v. Palmer,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e we reaffirmed our prior holdings that notice of aggravating circumstances was not constitutionally required, because at the sentencing phase of a first degree murder trial, \"the then-convicted defendant is not entitled to all of the same rights accorded one merely accused of a crime but not yet convicted.\" these decisions are squarely in line with those of other jurisdictions, including cases decided after Ring. For example, in State v. Hunt,\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e the supreme Court of north Carolina held that the statute defining 11 aggravating circumstances which could support a capital sentence provided constructive notice sufficient to satisfy due process. It held that in the absence of a statute requiring the state to allege specific aggravating circumstances in the indictment, \"due process does not require that short-form murder indictments state the aggravators or even allude to the statutory provision in which they are enumerated.\"\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e In reaching this conclusion, the court specifically noted that \"Ring does not require that aggravating circumstances be alleged in state-court indictments.\"\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e similarly, in State v. Steele,\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e the supreme Court of Florida held that Ring did not require modification of its prior holdings that the state was not required to provide notice to the defendants of the statutory aggravating factors it intended to prove. It concluded that \"[w]hether to require the state to provide notice of alleged aggravators is within the trial court's discretion.\"\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Likewise, in Thacker v. State,\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e the oklahoma Court of Criminal appeals held that even after Ring, statutory aggravating circumstances need not be included in an indictment or information in a capital murder prosecution, because constitutionally sufficient notice was provided by the statute which specified the aggravating circumstances which could be considered in the sentencing process. Vela relies heavily upon Goodloe v. Parratt\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e in support of his argument that his due process rights were violated when the state did not specifically allege his involvement in the Lundell murder as the basis for the existence of the aggravating circumstance defined by § 29-2523(1)(a). Goodloe is a federal habeas corpus case in which a defendant challenged his conviction in a Nebraska state court for operation of a motor vehicle to avoid arrest. the eighth Circuit Court of appeals held that the defendant's due process right to reasonable notice of the charge against him was violated because (1) the information did not allege the specific offense for which he allegedly fled arrest, which the court considered an essential element of the flight charge, and (2) while the defendant was initially given actual notice of the underlying offense, the prosecutor changed his theory midtrial and argued that the defendant had fled to avoid arrest for another offense, without giving prior notice to the defendant. the court reasoned that under these circumstances, the defendant \"was not given fair and reasonable notice of the offense charged and the case against which he had to prepare a defense; the result was a fundamentally unfair trial that requires the conviction be set aside.\"\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nGoodloe does not support Vela's notice argument for several reasons. First, it addresses the requirement of notice in the context of the original criminal charge, not a sentence aggravator which comes into play only if the defendant is convicted of the charged offense. also, Goodloe involved a failure to notify the defendant of an essential element of an offense, but aggravating circumstances as set forth in Nebraska's capital sentencing scheme are not \"essential elements\" of first degree murder.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e and, as noted in Goodloe, actual notice can satisfy any due process deficiency in a charging document. We conclude that the notice of aggravation included in the third amended information in this case was sufficient, because it described the alleged aggravating circumstances in the language provided in § 29-2523(1)(a).\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e We further note that months before the aggravation hearing in this case, the prosecutor gave Vela and his counsel written notice that he would use Vela's involvement in the Lundell murder to prove aggravating circumstances, and he subsequently provided Vela's counsel with police reports and other investigative materials pertaining to that crime.\n\nFor completeness, we note that the comment to the nJI2d Crim. 10.1 model instruction states, without citation of authority, that \"[t]he state should . . . be required to specify in advance which crimes it is relying on to prove that the defendant has a substantial prior history of serious assaultive or terrorizing criminal activity.\" While this may be viewed as good practice, we do not hold on the facts of this case that it was constitutionally required. and, as noted above, the prosecutor did inform Vela's counsel in advance that he intended to use Vela's involvement in the Lundell murder as proof of an aggravating circumstance.\n\nIn summary, we conclude that the district court did not err in receiving evidence of Vela's involvement in the Lundell murder as proof of the aggravating circumstance defined by § 29-2523(1)(a) or in denying Vela's motion for new trial insofar as it was based on an allegation that the state had failed to provide adequate notice with respect to this aggravating circumstance.\n\n(c) Jury Instruction: Malice\n\nAt the close of the evidentiary phase of the aggravation hearing, the district court instructed the jury that in order to find the \"substantial prior history of serious assault or terrorizing criminal activity\" aggravating circumstance, it must find beyond a reasonable doubt that Vela \"did in fact commit the offense of Murder in the First Degree of . . . Lundel[l].\" the court instructed the jury that the elements of this offense were that Vela killed Lundell, that he did so \"purposely and with deliberate and premeditated malice,\" and that he \"did so on or after august 15, 2002, in Madison County, Nebraska.\" In a separate instruction entitled \"Definitions applicable to First Degree Murder,\" the court defined the terms \"Deliberate,\" \"premeditation,\" and \"Intent,\" but did not define \"malice.\" although Vela submitted written objections to the jury instructions, he did not object on the ground that they did not include a definition of malice, and he did not request an instruction including this definition. Vela contends on appeal that the failure of the district court to instruct the jury on the definition of malice constitutes plain error.\n\n[7-10] Plain error will be noted only where an error is evident from the record, prejudicially affects a substantial right of a litigant, and is of such a nature that to leave it uncorrected would cause a miscarriage of justice or result in damage to the integrity, reputation, and fairness of the judicial process.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nIn the absence of plain error, when an issue is raised for the first time in an appellate court, the issue will be disregarded inasmuch as the trial court cannot commit error regarding an issue never presented and submitted for disposition in the trial court.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e absent plain error indicative of a probable miscarriage of justice, the failure to object to a jury instruction after it has been submitted for review precludes raising an objection on appeal.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Consideration of plain error occurs at the discretion of an appellate court.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nVela relies on State v. Myers\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e in support of his contention that the failure to define \"malice\" in the jury instructions constituted plain error. In that case, this court held that failure to define a legal term of art used in a jury instruction can constitute plain error. Vela argues that \"malice\" is a legal term of art meaning \"'that condition of the mind which is manifested by the intentional doing of a wrongful act without just cause or excuse.'\"\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nIn the years since Myers was decided, the U.S. supreme Court has held that even a failure to submit an entire element of a criminal offense or a sentencing factor to a jury is not structural error automatically requiring reversal, but can be subject to a harmless error analysis. In Neder v. United States,\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e the Court held that \"an instruction that omits an element of the offense does not necessarily render a criminal trial fundamentally unfair or an unreliable vehicle for determining guilt or innocence.\" then, in Washington v. Recuenco,\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e the Court held that \"[f]ailure to submit a sentencing factor to the jury, like failure to submit an element to the jury, is not structural error.\" based upon Recuenco, we recently held that the standard for determining whether failure to submit a sentencing factor to a jury constitutes harmless error is whether the record demonstrates beyond a reasonable doubt that a rational jury would have found the existence of a sentencing factor.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nUnlike Myers, in this case, the jury instructions alleged to constitute plain error were not given in the guilt phase of a murder trial, but, rather, were given after a hearing to determine the existence of aggravating circumstances which would permit the imposition of the death penalty for the five murders for which Vela had already been convicted. thus, the issue was not whether Vela should be convicted and punished for the murder of Lundell, but, rather, whether his involvement in the Lundell murder established a \"substantial prior history of serious assaultive or terrorizing criminal activity.\"\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e and the alleged deficiency in the jury instruction did not involve the failure to submit an entire element of the uncharged Lundell murder by which the state sought to prove the aggravating circumstance described in § 29-2523(1)(a), but, rather, the deficiency was a failure to define a single word used in one of the elements. and, contrary to Vela's argument, we find no evidence in the record suggesting the absence of malice in the form of legal justification or excuse for the Lundell killing. We conclude that any error in not defining the term \"malice\" in the jury instructions would not be of a \"nature that to leave it uncorrected would cause a miscarriage of justice or result in damage to the integrity, reputation, and fairness of the judicial process\" so as to constitute plain error.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e accordingly, we do not reach the merits of the claimed deficiency in the jury instruction to which no exception was taken in the district court.\n\n(d) Jury Instruction: Lesser-Included Offenses\n\nVela argues that the district court erred in not instructing the jury on lesser-included offenses of first degree murder. He relies in part on § 29-2027, which provides that \"[i]n all trials for murder,\" the jury shall ascertain whether the verdict is \"murder in the first or second degree or manslaughter.\" as we have noted, Vela was not on trial for the murder of Lundell. Vela's involvement in the Lundell murder was simply the evidence by which the state sought to prove aggravating circumstance § 29-2523(1)(a), a \"substantial prior history of serious assaultive or terrorizing criminal activity\" prior to the five murders for which he had been convicted. While lesser degrees of homicide or other offenses against the person might well establish the existence of this aggravating circumstance, in this case, the state elected to prove that Vela had committed a prior, uncharged first degree murder. Had the state not met its burden of proof for first degree murder, it would have failed to prove this aggravating circumstance.\n\n[11] In an appeal based on a claim of an erroneous jury instruction, the appellant has the burden to show that the questioned instruction was prejudicial or otherwise adversely affected a substantial right of the appellant.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Vela could hardly have been prejudiced by the failure of the court to give an instruction which would have effectively lightened the state's burden by allowing the jury to find the existence of the aggravating circumstance on the basis of \"lesser\" crimes than first degree murder.\n\n(e) Jury Instruction: \"Other Crime\"\n\nThe state alleged the aggravating circumstance defined by § 29-2523(1)(b): \"the murder was committed in an effort to conceal . . . the identity of the perpetrator of such crime.\" Vela contends that his due process rights were violated because in instructing the jury, the district court did not identify the \"crime\" for which Vela was allegedly trying to conceal the identity of the perpetrator.\n\n[12] Jury instructions must be read as a whole, and if they fairly present the law so that the jury could not be misled, there is no prejudicial error.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e In a preliminary instruction given at the beginning of the aggravation hearing, the district court instructed the jury as follows: nature of the case. this is a criminal case in which the defendant, . . . Vela, has pled guilty to five counts of murder in the first degree and thereupon found guilty. You must now determine if one or more of the following aggravating circumstances are true or not true as to . . . Vela for each count, to wit:\n\nTwo, the murder was committed in an effort to conceal the commission of a crime, or to conceal the identity of the perpetrator of such crime.\n\nIn instruction no. 3, given at the close of the aggravation hearing, entitled \"burden of proof,\" the jury was instructed that it was to determine if one or more of the five listed aggravating circumstances \"are true or not true as to . . . Vela for each count of murder.\" the facts necessary to establish the aggravating circumstance defined by § 29-2523(1)(a) were listed first and made specific reference to Vela's alleged involvement in the Lundell murder. the facts necessary to establish the aggravating circumstance defined by § 29-2523(1)(b) were listed second and included no reference to the Lundell murder. the jury completed five verdict forms, one for each count of first degree murder. reading the jury instructions and verdicts together, we conclude that they clearly refer to the bank murders, and not to the Lundell murder, as Vela suggests in his brief. We find no merit in this assignment of error.\n\n(f) Jury Instruction: Aiding and Abetting\n\nDuring the aggravation proceeding, Vela repeatedly objected to evidence regarding the acts committed by Galindo and sandoval. He argued that their actions could not be imputed to him for the purpose of applying the aggravating circumstances. Vela also objected to the following jury instruction given at the close of the aggravation hearing:\n\n[Vela] can be guilty of an aggravator even though he personally did not commit the act involved in the crime so long as he aided someone else to commit it. [Vela] aided someone else if:\n\n(1) [Vela] intentionally encouraged or intentionally helped another person to commit the aggravator; and\n\n(2) [Vela] intended that an aggravator be committed; or [Vela] knew that the other person intended to commit, expected the other person to commit the aggravator; and\n\n(3) The aggravator in fact was committed by that other person.\n\nAlthough Vela concedes that an aiding and abetting theory could properly be used to prove the aggravating circumstance involving the Lundell murder, he argues that its use with respect to the other aggravating circumstances which involved the bank murders deprived him of individualized consideration for the death penalty and therefore violated his rights under the 8th and 14th amendments to the U.S. Constitution; article I, § 9, of the Nebraska Constitution; and § 29-2523. the only authority cited by Vela in support of this argument is Lockett v. Ohio.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e In that case, the U.S. supreme Court addressed the concept of individualized consideration for the death penalty in the context of mitigating circumstances. the Court held that \"in all but the rarest kind of capital case,\" the 8th and 14th amendments require that the sentencer \"not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\"\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e the court further recognized \"the need for individualized consideration as a constitutional requirement in imposing the death sentence.\"\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e applying these principles, the Court held ohio's death penalty statute to be unconstitutional, because it required imposition of the death penalty unless at least one of three specific statutory mitigating circumstances existed and did not permit consideration of a defendant's comparatively minor role in the offense. Lockett did not address the concept of aider/abettor liability in the context of aggravating circumstances used to determine eligibility for the death penalty.\n\nTwo U.S. supreme Court cases decided subsequent to Lockett bear more directly on this issue. In Enmund v. Florida,\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e the defendant had driven the getaway car from the scene of a robbery gone awry, in which two persons were killed. He was convicted of felony murder and sentenced to death. the question addressed by the supreme Court was \"whether death is a valid penalty under the eighth and Fourteenth amendments for one who neither took life, attempted to take life, nor intended to take life.\"\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e the Court noted that the focus in imposing the death penalty must be on the defendant's culpability, \"not on that of those who committed the robbery and shot the victims, for we insist on 'individualized consideration as a constitutional requirement in imposing the death sentence.'\"\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e the Court remanded the cause for further proceedings to determine whether the defendant \"intended or contemplated that life would be taken.\"\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\n\nThe Enmund holding was expanded in Tison v. Arizona.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e In that case, the defendants had participated in a prison breakout and a kidnapping. the codefendants had brutally murdered the kidnapped family. the question addressed by the Court was whether the defendants, after being convicted of felony murder, could be constitutionally sentenced to death under the eighth amendment based on their conduct \"leading up to and following\" the murders.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e Under a sentencing scheme substantially similar to Nebraska's, the sentencing judge found statutory aggravators, including that the murders were committed for pecuniary gain and were especially heinous. the sentencing judge specifically found that the statutory mitigator of relatively minor participation was not met. noting that the defendants' conduct was more directly linked to the murders than was that of the getaway driver in Enmund, the Court held:\n\n[r]eckless disregard for human life implicit in knowingly engaging in criminal activities known to carry a grave risk of death represents a highly culpable mental state, a mental state that may be taken into account in making a capital sentencing judgment when that conduct causes its natural, though also not inevitable, lethal result.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\n\nThus, the Court held that the culpability requirement of Enmund is satisfied where there is \"major participation in the felony committed, combined with reckless indifference to human life.\"\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nRelying on the reasoning of Tison, the supreme Court of Connecticut concluded in State v. Peeler\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e that the eighth amendment does not forbid the use of accessorial liability to prove aggravating factors which are a prerequisite to the imposition of the death penalty. the court wrote that \"[b]y explicitly recognizing the trial court's finding of aggravating factors established through principles of accessorial liability, and thereafter concluding that an accessory could be sentenced to death, the supreme Court in Tison implicitly concluded that the [e]ighth [a]mendment permitted the use of accessorial liability to prove aggravating factors.\"\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e the Peeler court also noted that \"we can conceive of no reason why a statutory scheme that requires a jury to evaluate aggravating factors need face a more stringent requirement under the [e]ighth [a]mendment when principles of accessorial liability are being used to prove those aggravating factors rather than the commission of the crime itself.\"\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\n\nThe court concluded that any eighth amendment concern was sufficiently addressed by the sentencing body's ability to give effect to mitigating circumstances, which presumably included minimal participation in the crime. tennessee and oklahoma courts have reached similar conclusions. the tennessee case\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e involved a woman who hired another to kill her husband. the husband was brutally murdered with a tire iron. she argued that the exceptionally heinous nature of the crime could not be imputed to her as an aggravator, as she had no involvement in the actual act and did not dictate the method of the killing. the court noted that the Enmund-Tison holdings addressed only whether a nontriggerman could be sentenced to death and did not expressly address whether the conduct of a triggerman could be used to aggravate the sentence of the nontriggerman. examining the plain language of the tennessee aggravation statute, the court concluded that the language of the aggravator related to the heinous nature of the murder itself, not the defendant's action, and thus applied to the defendant. In affirming the death sentence, the court implicitly held that the eighth amendment did not prohibit the use of vicarious criminal liability principles in proving the existence of aggravating circumstances. similarly, the Court of Criminal appeals of oklahoma has held, \"If criminal liability can attach for a codefendant's act that a defendant has aided and abetted, liability for an aggravating circumstance can also attach for a codefendant's act that a defendant has aided and abetted.\"\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\n\n[13] Under Nebraska law, \"[a] person who aids, abets, procures, or causes another to commit any offense may be prosecuted and punished as if he were the principal offender.\"\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\n\nAiding and abetting requires some participation in a criminal act and must be evidenced by some word, act, or deed.\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e\n\nNo particular acts are necessary, nor is it necessary that the defendant take physical part in the commission of the crime or that there was an express agreement to commit the crime.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e\n\nMere encouragement or assistance is sufficient.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e Nebraska's capital sentencing statutes account for the teaching of Enmund and the wide range of conduct that can constitute aiding and abetting by specifying, as a mitigating circumstance, that the defendant \"was an accomplice in the crime committed by another person and his or her participation was relatively minor.\"\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e but as one of three armed men who entered the bank and began shooting, Vela clearly exhibited the degree of moral culpability required by Tison,in that he was a major participant in all five of the bank murders and exhibited a reckless indifference to human life. We conclude that the district court did not err in receiving evidence of the actions of Galindo and sandoval and in instructing the jury that those actions could be considered in its determination of the existence of aggravating circumstances which would make Vela eligible to receive the death penalty.\n\n(g) Motion for Discovery\n\nVela assigns error in the denial of his motion to take the depositions of various individuals purportedly involved in a federal criminal investigation, including two witnesses who testified at his aggravation hearing. Discovery in a criminal case is, in the absence of a constitutional requirement, controlled by either a statute or a court rule.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e section 29-1917(1) provides that except under circumstances not pertinent to this case, \"the prosecuting attorney or the defendant may request the court to allow the taking of a deposition of any person other than the defendant who may be a witness in the trial of the offense.\" section 29-1917(1) further provides that the court \"may order the taking of the deposition when it finds the testimony of the witness: (a) [m]ay be material or relevant to the issue to be determined at the trial of the offense; or (b) [m]ay be of assistance to the parties in the preparation of their respective cases.\" a criminal defendant is not entitled, as a matter of right, to a deposition pursuant to this statute.\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e the party seeking the deposition \"must make a factual showing to the court that the deponent's testimony alternatively satisfies the statutory conditions.\"\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e If the requisite showing is made, a deposition taken pursuant to this statute \"may be used at the trial by any party solely for the purpose of contradicting or impeaching the testimony of the deponent as a witness.\"\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\n\nWe agree with the district court that Vela did not make the factual showing required by § 29-1917. In addition, Vela's motion to take depositions was filed long after the aggravation hearing had been concluded. thus, depositions of the two persons who had testified at the aggravation hearing could not have been used to contradict or impeach their testimony, because that testimony was long concluded when the motion seeking depositions was filed. and we note that at least one of those witnesses was cross-examined about his pending criminal cases and the favorable treatment he had received from the prosecutor in exchange for his testimony. For all of these reasons, we conclude that the district court did not abuse its discretion in denying Vela's posttrial motion to take depositions.\n\nIII. Mental Retardaton Proceedings\n\n1. Background\n\n(a) Legal Context\n\nIn 1989, the U.S. supreme Court held in Penry v. Lynaugh\u003cspan class=\"fnref\"\u003e92\u003c/span\u003e that while mental retardation was a factor which may lessen a defendant's culpability for a capital offense, the execution of persons with mental retardation was not categorically precluded by the eighth amendment's prohibition of cruel and unusual punishment. thirteen years later, in Atkins v. Virginia,\u003cspan class=\"fnref\"\u003e93\u003c/span\u003e the Court abrogated its prior holding. It concluded that on the basis of \"'evolving standards of decency,'\" the eighth amendment prohibited the execution of persons with mental retardation.\u003cspan class=\"fnref\"\u003e94\u003c/span\u003e\n\nIn reaching this conclusion, the Court specifically noted that in the 13-year period since its Penry decision, several states, including Nebraska, had adopted legislation prohibiting the execution of persons with mental retardation. the Nebraska legislation enacted in 1998 provides: \"notwithstanding any other provision of law, the death penalty shall not be imposed upon any person with mental retardation.\"\u003cspan class=\"fnref\"\u003e95\u003c/span\u003e the statute further provides that as used therein, \"mental retardation means significantly subaverage general intellectual functioning existing concurrently with deficits in adaptive behavior. an intelligence quotient of seventy or below on a reliably administered intelligence quotient test shall be presumptive evidence of mental retardation.\"\u003cspan class=\"fnref\"\u003e96\u003c/span\u003e after a finding that aggravating circumstances exist, a defendant may file a verified motion requesting a ruling that the death penalty be precluded because of mental retardation.\u003cspan class=\"fnref\"\u003e97\u003c/span\u003e the court is then required to conduct an evidentiary hearing, and if it finds \"by a preponderance of the evidence, that the defendant is a person with mental retardation, the death sentence shall not be imposed.\"\u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\n\n(b) Motions\n\nAfter the jury returned its verdict finding the existence of five aggravating circumstances on each count of first degree murder and the court denied Vela's motion to declare electrocution to be an unconstitutional method of execution, Vela filed a verified motion and an amended motion to preclude imposition of the death sentence on the ground that he was a person with mental retardation. In response, the state filed a motion to require Vela to submit to an evaluation and testing by the state's expert for the purpose of addressing issues raised by his allegation that he is a person with mental retardation. Vela objected to the motion on the ground that such an evaluation is not specifically authorized by any statute. the district court granted the state's motion and overruled Vela's objections, reasoning that it had inherent discretionary power to order the evaluation after Vela placed the question of mental retardation at issue. the order permitted the state's expert to \"personally assess the defendant and perform certain tests on the defendant in order to determine whether the testing completed by [Vela's expert] was reliably administered.\" after Vela's interlocutory appeal from this order was summarily dismissed by this court for lack of a final, appealable order, he filed written objections and moved for reconsideration of the district court's prior order permitting the evaluation. the district court overruled this motion.\n\nAfter the aggravation hearing but before Vela filed his motion to preclude imposition of the death penalty on the ground of mental retardation, the prosecutor filed a motion seeking access to confidential records pertaining to Vela which were in the possession of the Nebraska Department of Correctional services. the motion was filed pursuant to neb. rev. stat. § 83-178 (reissue 2008), which provides in part that confidential records \"shall not be subject to public inspection except by court order for good cause shown.\" In the motion, the prosecutor represented that the records were believed to contain information relevant to the scheduled mitigation hearing. Vela objected to the release of any medical and psychological records and indicated that he was not waiving any privilege. the district court granted the motion and ordered the state to provide Vela with copies of the records obtained pursuant to the motion. approximately 1 year later, the prosecutor filed a second motion to obtain prison records pursuant to § 83-178. In this motion, the prosecutor sought various records, including \"medical, psychiatric and psychological records since october 1, 2004\" on the ground that the records were \"believed to contain relevant information to the issue of rebuttal evidence at the mental retardation hearing . . . and to the issue of rebuttal evidence at any future mitigation hearing, pending the determination on the mental retardation issue.\" Vela filed written objections to this motion, asserting that the records were privileged and that the state had not shown good cause for their release. after conducting a hearing, the district court entered an order permitting the state to obtain some of the requested records. However, the court determined that § 83-178 did not authorize the release of a prisoner's \"personal medical, psychiatric and psychological\" records maintained by the Department of Correctional services and denied the motion as to such records. apparently, some medical records were obtained by the prosecutor and reviewed by two of the state's experts after entry of the initial order but before entry of the second order. the district court overruled Vela's objection to one expert's testimony regarding the records he reviewed.\n\n(c) Mental Retardation Hearing\n\nWe are aware that a social stigma exists with respect to the phrase \"mental retardation.\" expert testimony in the record before us acknowledged this, but further established that it remains an appropriate and professionally accepted designation of a specific clinical diagnosis. We use the phrase in this clinical sense. there are two generally accepted \"clinical models\" for mental retardation. one is stated in a reference entitled \"Diagnostic and statistical Manual of Mental Disorders,\" published by the american psychiatric association.\u003cspan class=\"fnref\"\u003e99\u003c/span\u003e We will refer to this model as the \"DsM-Iv-tr.\" the other model is contained in a reference entitled \"Mental retardation: Definition, Classification, and systems of supports,\" published by the american association on Mental retardation.\u003cspan class=\"fnref\"\u003e100\u003c/span\u003e We will refer to this model as the \"aaMr.\" at the mental retardation hearing, Vela's counsel offered into evidence the 4th edition of the DsM-Iv-tr and the 10th edition of the aaMr \"for the legal purposes of statutory interpretation.\" Vela's counsel noted that § 28-105.01 utilized \"definitions of mental retardation that do not have ordinary, common meaning. they are vague, ambiguous in that way.\" the court received both volumes in evidence. the DsM-Iv-tr lists the diagnostic criteria for mental retardation as \"[s]ignificantly subaverage intellectual functioning: an IQ of approximately 70 or below on an individually administered IQ test\" and \"[c]oncurrent deficits or impairments in present adaptive functioning\" in at least two of the areas of \"communication, self-care, home living, social/interpersonal skills, use of community resources, self-direction, functional academic skills, work, leisure, health, and safety.\"\u003cspan class=\"fnref\"\u003e101\u003c/span\u003e adaptive functioning is defined by the DsM-Iv-tr as \"the person's effectiveness in meeting the standards expected for his or her age by his or her cultural group.\"\u003cspan class=\"fnref\"\u003e102\u003c/span\u003e the DsM-Iv-tr also requires the onset of both prongs of mental retardation before 18 years of age. the aaMr defines mental retardation in substantially the same manner. according to its publication, mental retardation is \"a disability characterized by significant limitations both in intellectual functioning and in adaptive behavior as expressed in conceptual, social, and practical adaptive skills. this disability originates before age 18.\"\u003cspan class=\"fnref\"\u003e103\u003c/span\u003e\n\nTwo common tests for measuring intelligence quotient (IQ) are the Wechsler adult Intelligence scale, third edition, for adults (WaIs-III) and the stanford-binet. While both are generally accepted as reliable for assessing IQ, the WaIs-III is used more frequently. In addition, Wechsler's abbreviated scale of Intelligence (WasI) is a generally accepted screening instrument for intelligence, but it is not accepted as a comprehensive evaluation of intelligence. the WasI is capable of determining whether or not there is a probability that a person has mental retardation, but it is not used to determine the degree or classification of mental retardation. three IQ tests were administered to Vela at the request of his counsel. James Cole, ph.D., a clinical forensic psychologist, administered the WasI on July 13, 2003, for the purpose of determining \"[w]hether or not there was any probability\" that Vela was a person with mental retardation. on the WasI, Vela had a full-scale IQ score of 87, with a confidence interval of 84 to 91. His performance IQ score was 95, with a confidence interval of 90 to 100; and his verbal IQ score was 82, with a confidence interval of 78 to 87. based on these results, Cole testified that he could conclude with a high degree of psychological certainty that Vela's IQ was not less than 75 and that he was not a person with mental retardation. Cole did not test for malingering, because he concluded that Vela \"clearly would not have been faking or exaggerating symptoms of mental retardation in order to provide the performance that would result in a full-scale IQ of 87.\" Cole concluded with a reasonable degree of psychological certainty that Vela's IQ score fell within \"the average or low average range.\" When he interviewed Vela for approximately 1 hour 15 minutes prior to administering the WasI, Cole detected no history of serious mental or emotional problems. the second IQ test was administered by psychologist anne Jocelyn Rritchie, ph.D. and J.D., at the request of Vela's counsel. Rritchie evaluated Vela on november 14 and December 7, 2003, and administered the WaIs-III. Vela obtained a verbal score of 75, with a confidence level of 71 to 81; a performance score of 78, with a confidence level of 73 to 86; and a full-scale IQ score of 75, with a confidence level of 71 to 80, meaning that with 95-percent confidence, Vela's full-scale IQ fell between 71 and 80. Rritchie was not able to administer one subtest of the WaIs-III because Vela could not reliably sequence the alphabet, but she testified that otherwise, the test was administered according to the publisher's protocol. prior to administering the WaIs-III, Rritchie administered symptom validity tests to Vela. these tests generally measure whether the subject is putting forth his or her best effort on the test. based upon these tests and her administration of the WaIs-III, Rritchie did not regard Vela's effort on the test as inadequate. Rritchie testified that Vela's full-scale score of 75 on the WaIs-III was an accurate measure of his intellectual functioning on the day the test was given. she agreed that mental retardation could be diagnosed in a person with an IQ as high as 75 if there were sufficient limitations in adaptive behavior, but she was not requested by Vela's counsel to conduct tests for adaptive behavior deficits and did not do so.\n\nWayne C. Piersel, ph.D., a psychologist trained in school psychology, was retained by Vela's counsel for the purpose of determining whether or not Vela was a person with mental retardation. Piersel examined Vela on July 9 and 10, 2004. prior to the examination, Piersel was provided with copies of Cole's evaluation, Rritchie's evaluation, Vela's school transcripts, and reports of interviews of persons who were acquainted with Vela. Piersel administered the fifth edition of the stanfordbinet IQ test. Vela attained a score of 56 on the verbal portion of the test, a score of 79 on the nonverbal portion, and a full-scale score of 66. Piersel testified that there are no symptom validity tests designed for the purpose of detecting malingering on an IQ test. He stated that nothing in the aaMr, the DsM-Iv-tr, the stanford-binet, the WasI, or the WaIs-III requires symptom validity testing. Piersel noted, however, that he had no reason to suspect that Vela was not cooperating or giving his best effort. Piersel administered other tests to Vela, including the \"vineland adaptive behavior scales,\" which the clinical models consider an appropriate test for measuring a subject's adaptive behaviors. Piersel used Vela's older sister as his \"informant\" for this test. based on the information Vela's sister provided, Piersel opined that Vela had significant impairment in the adaptive behavior areas of communication, home living, social/interpersonal skills, self-direction, and functional academic skills. It was Piersel's opinion to a reasonable degree of certainty that Vela was a person\n\nWith mild mental retardation. on cross-examination, Piersel testified that he had no reason to question the administration of the WasI by Cole or the WaIs-III by Rritchie. He admitted that it was statistically improbable that Vela's true scores on the WasI or the WaIs-III would fall below 70. He further admitted that it would be \"unlikely\" for Vela to obtain a valid IQ score of 70 or below on the stanford-binet after scoring a 75 on the WaIs-III and that the probability of a random variance between the WaIs-III score of 75 and the stanford-binet score of 66 was less than 5 percent. Piersel further acknowledged the significance of the variance between Vela's score of 56 on the verbal portion of the stanford-binet and his score of 79 on the nonverbal portion, and he agreed that there was only a \"one in a thousand\" chance that such a variance could occur randomly. the publisher's manual for the stanford-binet states that when a significant variance between the two scores occurs, \"'examiners should be cautious'\" of using the full-scale score to measure IQ and that where the \"'examinee's background is influenced by factors such as communication disorders, learning disabilities, autism or non-english background, the [nonverbal score] may be the better indicator of global cognitive potential.'\" the manual further states that users of the stanford-binet should be \"'cautious in interpreting low full-scale IQ scores that may reflect conditions other than low intellectual ability. Low scores may be due to cultural and language differences, high anxiety or depression, extreme distractibility, or refusal to relate to the examiner and testing situation.'\" nevertheless, Piersel insisted that Vela's full-scale score of 66 on the stanford-binet was a \"representative score.\"\n\nChad buckendahl, ph.D., an expert in psychometrics, testified for the state. He explained that psychometrics is the integration of cognitive measurement and statistics and involves the interpretation of test scores and ensuring the validity of such interpretations. He explained two concepts used in psychometrics: \"standard error of measurement\" and \"standard error of estimate.\" the standard error of measurement is used in comparing an individual's scores on the same test. the standard error of estimate is used when comparing an individual's score on one test to the same individual's score on another test. the manuals for the administration of the stanford-binet and the WaIs-III tests contain the relevant standard errors of measurement and estimate calculations. based on these calculations, buckendahl testified that the statistical probability of Vela's scoring an 87 on the WasI but having his true score be 70 or below is about 1 in 500 million. buckendahl acknowledged, however, that the WasI is a screening instrument which is not intended for use as a substitute for more comprehensive measures of intelligence, such as the WaIs-III. but with respect to Vela's full-scale score of 75 on the WaIs-III, buckendahl opined that on the basis of the published calculations, there is only a 1.7 percent chance that Vela's true full-scale score could be 70 or lower. buckendahl further testified that Vela's verbal test results generally declined from the first test administration to the most recent test administration, a phenomenon which he viewed as \"unlikely.\" Vela's nonverbal scores, however, showed an initial slight decline and then remained fairly stable above 70.\n\nLeland Zlomke, ph.D., a clinical psychologist with specialized training in forensic psychology, also testified for the state.\n\nHe had been requested by the state to conduct an evaluation of Vela in mid-2004, at which time he reviewed the reports of Cole, Rritchie, and Piersel. He also reviewed writings and drawings produced by Vela while in prison and spoke with jail personnel about him. based upon the medicolegal context of the determination of Vela's claimed mental retardation and what Zlomke perceived as a discrepancy between Vela's most recent test results and the level at which he appeared to actually function, Zlomke concluded that a comprehensive forensic evaluation was indicated. Zlomke testified that a primary goal of forensic psychological assessment is the detection of symptom invalidity, which includes malingering.\n\nZlomke met with Vela and Vela's attorneys on two occasions. the attorneys denied Zlomke's request to administer a test designed to measure adaptive behavior. Zlomke testified that the WasI administered by Cole was an appropriate screening assessment for mental retardation and testified that based on Vela's full-scale score of 87 on the WasI, it would be \"extremely unlikely, if not virtually impossible, for . . . another score without confounding variables to fall below 75 or 70 to 75.\" Zlomke identified malingering as one form of a \"confounding variable.\"\n\nZlomke deemed significant the variance between Vela's scores on the verbal and nonverbal portions of the stanfordbinet, as well as the variances between the stanford-binet scores and Vela's previous IQ test scores. In his opinion, the differences between Vela's scores on the WasI, the WaIs-III, and the stanford-binet \"far exceed\" clinical expectations and required a determination of confounding variables which could account for the variances. Zlomke was able to rule out medical incidents or injury and drug use as possible confounding variables.\n\nZlomke also considered malingering as a potential confounding variable which could explain the variance in Vela's test scores. He testified that the DsM-Iv-tr lists four diagnostic predicates to consider when determining if malingering exists in a testing situation. these include a medicolegal context of presentation, a marked discrepancy between the person's claimed stress or disability and the objective findings, a lack of cooperation during the diagnostic evaluation and in complying with the prescribed treatment regimen, and the presence of antisocial personality disorder. Zlomke testified that with a reasonable degree of certainty, he found all four predicates were met with respect to Vela. Zlomke further opined that Vela did not meet the criteria for mental retardation and that it is a \"virtual certainty\" that Vela's IQ is greater than 75. ari Kalechstein, ph.D., a neuropsychologist with forensic experience, also testified as a witness for the state. In preparation for his testimony, he reviewed the reports of Cole, Rritchie, and Piersel, as well as other materials, including police reports. Kalechstein also was present to hear the testimony of witnesses who preceded him at the mental retardation hearing.\n\nKalechstein was asked by the state to determine whether Vela was a person with mental retardation and to provide an explanation for the variances in Vela's IQ test scores. Kalechstein testified that clinicians generally utilize criteria published in DsM-Iv-tr in diagnosing mental retardation. In the process of conducting a differential diagnosis, he concluded that there was only a 1-in-500 chance that the downward shift in Vela's IQ scores in the tests administered by Cole, Rritchie, and Piersel occurred by chance. In his opinion, the decline in IQ scores was caused by either malingering, a learning disability, or depression. Kalechstein opined that Piersel did not adequately consider the issue of malingering. He concluded that all four factual predicates for malingering, as stated in the DsM-Iv-tr, existed with respect to Vela and that Vela met the diagnostic criteria for malingering. Kalechstein opined with a reasonable degree of psychological certainty that Vela did not meet the diagnostic criteria for mental retardation as stated in the DsM-Iv-tr. both parties submitted evidence related to Vela's adaptive behaviors. Vela's father and sister testified that he was developmentally delayed in many activities. Vela's mother left the family home when he was approximately 2 years old, and his older sister raised him as though he were her son. Vela needed assistance bathing until he was approximately 10 years old. He needed help dressing until after age 12, and was older than 12 before he could tie his own shoes. He learned to ride a bike at age 10, and he never learned to tell time. Vela never learned to drive a car, never had a checking or savings account, and never learned to budget money. as a teenager, he could not buy his own clothes or food, and had no chores in the household because he was incapable of performing them. Vela attended public schools in California. He was walked to elementary school every day. In the 10th grade, he was able to take a bus to high school, but otherwise never used public transportation. one of Vela's elementary school teachers testified that he was \"special,\" \"very sweet,\" and \"needy.\" His academic performance was very low compared to other students, and even in fourth grade, he continued to have incontinence issues at school. His elementary school teachers gave him extra help and modified his work, as he could not do the work expected of his classmates. one teacher described him as obedient, \"always smiling,\" and \"a follower.\" He did not interact with other children and had no friends.\n\nWhile attending public schools, Vela received services under a California special education program known as the resource special program (rsp). silvia Deruvo, a special education resource specialist and president of the \"California association of resource specialists and special education teachers,\" testified that rsp is the first level of special education in California and involves less than 50 percent of a student's class time. Deruvo described the assessment process, including IQ testing, by which students are placed in rsp. students who are determined to have a learning disability are eligible for rsp. Deruvo defined a learning disability as an average IQ of 89 to 110, accompanied by a discrepancy between ability and achievement. Deruvo testified that special education assessment records are destroyed after 5 years, so the records pertaining to Vela's periodic assessments were no longer in existence. However, from other available school records, Deruvo determined that Vela had had several assessments and was found to have a learning disability. accordingly, he received rsp services in several subjects at various times during his school attendance, beginning in the sixth or seventh grade. Deruvo testified that it is the practice of California public schools to provide students with the level of support and learning opportunity which is appropriate for their individual needs and that rsp would not provide sufficient support for a child with mental retardation. Piersel tested Vela for adaptive behavior issues based on information he received from Vela's sister. the vineland adaptive behavior scales test performed by Piersel indicated that Vela had limitations in adaptive behavior in the areas of communication, home living, social/interpersonal skills, self-direction, and functional academics. Utilizing two third-party informants who were acquainted with Vela for 2 to 3 months prior to his arrest, Zlomke administered a standardized test known as scales of Independent behavior-revised to assess Vela's adaptive behavior. as a result of this testing, Zlomke concluded that while Vela had limitations in certain adaptive skill areas, his overall adaptive behavior was appropriate for his age. the state presented evidence of Vela's ability to adapt to procedures and conditions within the prison system.\n\n(d) Order\n\nIn an order filed on May 3, 2006, the district court overruled Vela's motion to preclude imposition of the death penalty because of mental retardation. the court found that Vela failed to prove that Piersel reliably administered the test which resulted in a full-scale IQ of 66, and it thus concluded that Vela was not entitled to the statutory presumption of mental retardation. the district court found that Vela's score of 75 on the WaIs-III, considered in light of the standard error of measurement, could be considered as subaverage general intellectual functioning for purposes of diagnosing mental retardation. However, it found that the evidence did not establish at least two significant limitations in adaptive behavior by a preponderance of the evidence. the district court thus concluded that Vela was not a person with mental retardation. this court dismissed Vela's interlocutory appeal, based upon our determination that the disposition of Vela's motion to preclude the death penalty was not a final, appealable order.\u003cspan class=\"fnref\"\u003e104\u003c/span\u003e\n\n2. Assignments of Error\n\nVela assigns, restated and renumbered in part, that the district court erred in the following:\n\n1. Granting the state's motion to obtain Vela's medical and psychological records maintained by the Nebraska Department of Correctional services and by allowing testimony based upon such records.\n\n2. Granting the state's motion for an independent evaluation and testing and by receiving testimony and evidence derived from such evaluation and testing, in violation of the 5th and 14th amendments to the U.S. Constitution and article I, § 12, of the Nebraska Constitution.\n\n3. Finding that Vela failed by a preponderance of the evidence to establish that the full-scale IQ score of 66 obtained on the stanford-binet test administered by Piersel was not entitled to the statutory presumption of mental retardation.\n\n4. not basing its finding that Vela had significant subaverage general intellectual functioning at least in part on the stanfordbinet test administered by Piersel.\n\n5. requiring Vela to prove he had significant limitations in adaptive functioning rather than deficits in adaptive behavior, in violation of § 28-105.01(3) and the distribution of powers provision of article II, § 1, of the Nebraska Constitution.\n\n6. Failing to find that Vela had deficits in adaptive behavior.\n\n7. Finding that the imposition of the death penalty was not precluded because of mental retardation, in violation of § 28-105.01(2), the eighth amendment to the U.S. Constitution, and article I, § 9, of the Nebraska Constitution.\n\n3. Standard of Review\n\n[14] statutory interpretation presents a question of law, for which an appellate court has an obligation to reach an independent conclusion irrespective of the determination made by the court below.\u003cspan class=\"fnref\"\u003e105\u003c/span\u003e\n\n[15] In proceedings where the Nebraska evidence rules apply, the admissibility of evidence is controlled by the Nebraska evidence rules; judicial discretion is involved only when the rules make discretion a factor in determining admissibility.\u003cspan class=\"fnref\"\u003e106\u003c/span\u003e\n\n[16] In making the determination as to factual questions, an appellate court does not reweigh the evidence or resolve conflicts in the evidence, but, rather, recognizes the trial court as the finder of fact and takes into consideration that it observed the witnesses.\u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\n\nThe trial court has broad discretion in granting discovery requests and errs only when it abuses its discretion.\u003cspan class=\"fnref\"\u003e108\u003c/span\u003e\n\n4. Analysis and Resolution\n\n(a) Access to Department of Correctional Services' Records\n\nVela argues that the district court erred in initially granting, without limitation, the prosecutor's motion for access to his medical file maintained by the Nebraska Department of Correctional services. His two-pronged argument is (1) that no statute permits this form of discovery in a criminal action and (2) that such records are privileged pursuant to neb. rev. stat. § 27-504 (reissue 1995). Vela bases the first prong of his argument on State v. Kinney,\u003cspan class=\"fnref\"\u003e109\u003c/span\u003e where we recognized that discovery in a criminal case is generally controlled by either a statute or court rule and that \"'[i]n Nebraska, the prosecution has not been granted a right of discovery except as permitted by the court, with limitations clearly defined by statute.'\" We held in Kinney that based upon these principles, the trial court erred in requiring a defendant to produce his trial exhibits and disclose his potential out-of-state witnesses to the state before trial. the discovery issue arises in this case in a markedly different context. Vela's guilt had been determined by the acceptance of his guilty pleas, and the only remaining issue was whether he would be sentenced to life imprisonment or death for his crimes. that determination depended in part upon the resolution of Vela's assertion that he was a person with mental retardation and therefore could not be executed pursuant to § 28-105.01(2). While the statutory proceeding in which this determination is made is a part of the criminal action,\u003cspan class=\"fnref\"\u003e110\u003c/span\u003e it is decidedly civil in nature. the defendant must file a verified motion \"requesting a ruling that the penalty of death be precluded\" on the basis of mental retardation, and bears the burden of proving the existence of mental retardation by a preponderance of the evidence.\u003cspan class=\"fnref\"\u003e111\u003c/span\u003e In this unique circumstance, we conclude that general principles applicable to discovery in the guilt phase of a criminal case are not controlling.\n\nContrary to Vela's claim, his medical and mental health records maintained by the Department of Correctional services were not privileged after he filed his verified motion to preclude the death penalty based upon mental retardation. there is no physician-patient privilege as to \"communications relevant to an issue of the physical, mental, or emotional condition of the patient in any proceeding in which he or she relies upon the condition as an element of his or her claim or defense.\"\u003cspan class=\"fnref\"\u003e112\u003c/span\u003e\n\nA substantially similar rule applies to communications between psychologists and their patients.\u003cspan class=\"fnref\"\u003e113\u003c/span\u003e\n\n[17] the state's motion for access to medical and psychological records maintained by the Department of Correctional services was filed pursuant to § 83-178, which governs access to confidential inmate records. the statute clearly contemplates that medical records are included in its scope.\u003cspan class=\"fnref\"\u003e114\u003c/span\u003e the statute provides that confidential records \"shall not be subject to public inspection except by court order for good cause shown.\"\u003cspan class=\"fnref\"\u003e115\u003c/span\u003e\n\nWe hold that when a defendant in a capital sentencing proceeding places his or her mental health at issue either by asserting mental retardation as a basis for precluding the death penalty pursuant to § 28-105.01(2) or by asserting mental illness as a mitigating circumstance pursuant to § 29-2523(2)(g), there is good cause under § 83-178(2) for the prosecution to obtain access to the defendant's mental health records in the possession of the Department of Correctional services. accordingly, the district court did not err in permitting access to such records in this case and in overruling Vela's objection to testimony of the state's expert based in part upon his review of those records.\n\n(b) Independent Evaluation\n\nVela correctly notes that there is no specific statutory authority for the independent medical examination ordered by the district court and conducted by Zlomke. the question before us is whether the district court erred in concluding that it had inherent discretionary authority to order the examination. In reaching its conclusion, the district court reasoned by analogy from our opinion in State v. Simants,\u003cspan class=\"fnref\"\u003e116\u003c/span\u003e in which we held that a district court had inherent authority to grant the state's motion for an independent medical evaluation of a person who had been found not guilty by reason of insanity on six counts of first degree murder. the state requested the examination in preparation for an annual review to determine whether continued confinement was warranted. the applicable statute\u003cspan class=\"fnref\"\u003e117\u003c/span\u003e specified that the court was to conduct an evidentiary hearing as a part of the review but did not specifically authorize an independent medical evaluation at the request of the state. We concluded that \"[t]he means for determining the acquittee's sanity, as in determining a defendant's competency to stand trial, should be discretionary with the court.\"\u003cspan class=\"fnref\"\u003e118\u003c/span\u003e\n\nWe reasoned in part that because the statute contemplated an evidentiary hearing on the question of the acquittee's mental status, the record should not be limited to the evidence offered on behalf of the acquittee and \"[t]he state should be allowed to submit additional evidence since the court, as trier of fact, is not required to take the opinion of an expert as binding.\"\u003cspan class=\"fnref\"\u003e119\u003c/span\u003e\n\nWe wrote: as stated in Ake v. Oklahoma, 470 U.S. 68, 81, 105 S.Ct. 1087, 84 L.Ed. 2d 53 (1985): \"psychiatry is not . . . an exact science, and psychiatrists disagree widely and frequently on what constitutes mental illness, on the appropriate diagnosis to be attached to given behavior and symptoms, on cure and treatment, and on likelihood of future dangerousness.\" If necessary, the factfinder must resolve differences in opinion within the psychiatric profession on the basis of all the evidence offered by each party.\u003cspan class=\"fnref\"\u003e120\u003c/span\u003e\n\nVela argues that Simants is inapposite because it involved a civil commitment proceeding in which the primary concern was protection of the public. He contends that State v. Woods\u003cspan class=\"fnref\"\u003e121\u003c/span\u003e provides a closer analogy. In that case, we held that the district court lacked authority to order a defendant to make a pretrial disclosure of her alibi witnesses because Nebraska's notice-of-alibi statute\u003cspan class=\"fnref\"\u003e122\u003c/span\u003e did not impose this requirement. because Woods involved a question of pretrial discovery in a noncapital case, we do not find it to be controlling on the issue presented here. other jurisdictions have recognized the inherent authority of a trial court to order an independent examination at the request of the government when a defendant in capital sentencing proceedings has placed his or her mental health at issue. For example, in State v. Reid,\u003cspan class=\"fnref\"\u003e123\u003c/span\u003e the supreme Court of tennessee held that such authority existed even in the absence of a specific statute or rule, because an independent psychiatric examination was essential to afford the state the right to rebut expert psychiatric evidence offered by the defendant as a mitigating factor to be weighed against imposition of the death penalty. arizona courts have held that \"'once a defendant notifies the state that he intends to place his mental condition at issue during the penalty phase of a capital trial, a trial judge has discretion to order the defendant to submit to a mental examination by an expert chosen by the state or the court.'\"\u003cspan class=\"fnref\"\u003e124\u003c/span\u003e In U.S. v. Allen,\u003cspan class=\"fnref\"\u003e125\u003c/span\u003e the eighth Circuit Court of appeals stated: there is no doubt that a district court has the authority to order a defendant who states that he will use evidence from his own psychiatric examination in the penalty phase of a trial to undergo a psychiatric examination by a government-selected psychiatrist before the start of the penalty phase.\n\nWe have found only one case, People v. Lee,\u003cspan class=\"fnref\"\u003e126\u003c/span\u003e which holds that a trial court may not order an independent evaluation in these circumstances in the absence of specific authority conferred by statute or court rule.\n\n[18] We extend the reasoning of Simants to the issue before us here and hold that when a defendant files a verified motion to preclude imposition of the death penalty on the basis of mental retardation pursuant to § 28-105.01(4), the trial court has inherent authority to grant a motion by the state to have the defendant evaluated by a mental health professional of the state's choosing. by providing for an evidentiary hearing on the issue of mental retardation and requiring the defendant to prove the diagnosis by a preponderance of the evidence, the Legislature clearly contemplated adversarial testing of any such claim. our recognition in Simants that mental health professionals can reach conflicting opinions regarding a diagnosis is clearly illustrated by the record in this case. the identification of mental retardation is a diagnosis requiring the exercise of clinical judgment, and as Vela's own expert acknowledged, it is sometimes difficult for even mental health professionals to distinguish a person with mild mental retardation from one who does not have the condition. Piersel explained that because the identification of mental retardation requires the exercise of clinical judgment, \"on occasion, two people can take the same information, especially when the individual is very close to a particular line or particular cutoff, and reach different opinions.\" Given the significance of the diagnosis of mental retardation in the context of capital sentencing, the importance of meaningful adversarial testing cannot be overstated.\n\nMoreover, the state's interest in an independent evaluation goes beyond the adversarial testing of a capital defendant's claim of mental retardation. Under the unequivocal language of § 28-105.01(2) and the constitutional rule established by Atkins v. Virginia,\u003cspan class=\"fnref\"\u003e127\u003c/span\u003e the state is prohibited from executing a person with mental retardation. It follows that the state must have a means of independently confirming a capital defendant's assertion that he or she is such a person. We conclude that a district court has inherent authority to provide that means in the form of an independent evaluation when requested by the state. relying upon Estelle v. Smith,\u003cspan class=\"fnref\"\u003e128\u003c/span\u003e Vela argues that the independent examination ordered by the district court violated his privilege against compulsory self-incrimination guaranteed by the federal and state Constitutions. In Estelle, the U.S. supreme Court held that \"[a] criminal defendant, who neither initiates a psychiatric evaluation nor attempts to introduce any psychiatric evidence, may not be compelled to respond to a psychiatrist if his statements can be used against him in a capital sentencing proceeding.\"\u003cspan class=\"fnref\"\u003e129\u003c/span\u003e However, this court and others have indicated that when a criminal defendant places his or her mental condition at issue, the state may use the results of a court-ordered evaluation at trial without violating the defendant's constitutional privilege against self-incrimination.\u003cspan class=\"fnref\"\u003e130\u003c/span\u003e Vela's constitutional claim is without merit.\n\nFor these reasons, we conclude that the district court did not err in granting the state's motion for an independent evaluation of Vela and in receiving the testimony of Zlomke with respect to that examination at the mental retardation hearing.\n\n(c) Presumption of Mental Retardation\n\nSection 28-105.01(3) provides in part: \"an intelligence quotient of seventy or below on a reliably administered intelligence quotient test shall be presumptive evidence of mental retardation.\" Vela contends that the district court erred in determining that because the stanford-binet was not reliably administered by Piersel, the full-scale IQ score of 66 did not meet the statutory presumption. the district court found that the stanford-binet score of 66 was not obtained on a reliably administered test for three reasons. First, it concluded that the statistical probability of Vela's validly obtaining the score after the scores he obtained on the prior IQ tests was \"remote.\" the testimony of multiple experts supports this finding. second, the court concluded that Piersel did not address the issue of malingering in a meaningful manner. again, substantial evidence supports this, as at least two experts testified to the evidence of malingering and Piersel's ineffective evaluation of this issue. third, the court concluded that Piersel failed to follow the published stanford-binet protocol, because he reported the full-scale score even though there was significant variation between the verbal and nonverbal scores. again, several experts testified that this was not proper protocol. overall, there is substantial evidence in the record to support the district court's finding that the stanford-binet score of 66 was not obtained on a \"reliably administered\" test, and there is no clear error in the court's finding on this issue.\n\n(d) Finding that Vela Is not person With Mental Retardation\n\nVela argues that the district court erred in finding that because he is not a person with mental retardation, the death penalty is not precluded. He contends that this finding violates both his statutory rights under § 28-105.01(2) and his constitutional right not to be subjected to cruel and unusual punishment under the 8th and 14th amendments to the U.S. Constitution and article I, § 9, of the Nebraska Constitution.\n\n(i) Intellectual Functioning\n\nBoth § 28-105.01(3) and the clinical models which are referenced in Atkins\u003cspan class=\"fnref\"\u003e131\u003c/span\u003e and included in this record identify significant limitations in intellectual functioning as a component of mental retardation. the district court considered only Vela's full-scale IQ scores on the WaIs-III and the stanford-binet in determining whether his level of intellectual functioning was \"significantly subaverage.\"\u003cspan class=\"fnref\"\u003e132\u003c/span\u003e as discussed above, the district court disregarded the stanford-binet score after finding that the test was not reliably administered by Piersel. However, the court found that Vela's full-scale score of 75 on the WaIs-III should be considered, in light of the standard error of measurement, to include a \"range between 75 and 70.\" the court determined that based on the WaIs-III score, the diagnostic criterion of \"significantly subaverage general intellectual functioning\" had been established. both parties take issue with the court's reasoning on this point. Vela argues that the court also should have taken into account his score on the stanford-binet in reaching this conclusion. but as we have noted, the record supports the finding of the district court that the stanford-binet was not reliably administered. the state argues that although the district court properly \"relied upon an unchallenged IQ score of 75, which is the highest possible score professionally considered to possibly raise a question of mental retardation,\"\u003cspan class=\"fnref\"\u003e133\u003c/span\u003e it should not have considered the range of scores produced by the standard error of measurement when determining whether Vela had established that he had significantly subaverage general intellectual functioning. because, as explained below, we agree with the district court that Vela failed to show deficits in his adaptive behavior and thus is not a person with mental retardation, we decline to address the state's argument.\n\n(ii) Adaptive\n\nBehavior the second component of Nebraska's statutory definition of mental retardation in the context of capital sentencing is \"deficits in adaptive behavior\" which exist concurrently with the significantly subaverage intellectual functioning.\u003cspan class=\"fnref\"\u003e134\u003c/span\u003e the clinical models use similar but not identical definitional language when referencing this component of the test. the aaMr states: \"Mental retardation is a disability characterized by significant limitations both in intellectual functioning and in adaptive behavior as expressed in conceptual, social, and practical adaptive skills.\"\u003cspan class=\"fnref\"\u003e135\u003c/span\u003e the DsM-Iv-tr states:\n\nThe essential feature of Mental retardation is significantly subaverage general intellectual functioning (Criterion a) that is accompanied by significant limitations in adaptive functioning in at least two of the following skill areas: communication, self-care, home living, social/interpersonal skills, use of community resources, self-direction, functional academic skills, work, leisure, health, and safety (Criterion b).\u003cspan class=\"fnref\"\u003e136\u003c/span\u003e\n\nFor completeness, we note that both clinical models include as a third component that onset must occur before the age of 18. this component is not included in Nebraska's statutory definition.\u003cspan class=\"fnref\"\u003e137\u003c/span\u003e Piersel testified that trauma to the head can produce symptoms of mental retardation and that if the injury occurs before the age of 18, a diagnosis of mental retardation is appropriate. However, if the individual is older than 18 when the injury occurs, the condition would not be diagnosed as mental retardation, but, rather, \"in terms of some organic damage to [the] central nervous system.\" the district court concluded that Vela \"did not by [a] preponderance of the evidence establish at least two significant limitations in adaptive functioning as set out in Criterion b of the definition of mental retardation as found in [the DsM-Iv-tr].\" Vela argues that § 28-105.01(3) does not use the adjective \"significant\" with respect to \"adaptive behavior\" and that therefore, \"the district court impermissibly and in violation of its constitutional authority modified the statutory [definition] and increased . . . Vela's burden by requiring him to prove that his limitations or deficits in adaptive behavior were significant.\"\u003cspan class=\"fnref\"\u003e138\u003c/span\u003e\n\nThis argument stands in sharp contrast to Vela's position with respect to the clinical models at the mental retardation hearing. In offering the aaMr in evidence and arguing for its admissibility, Vela's counsel argued that it was a \"learned treatise\" which he would refer to in the examination of his expert witnesses. Counsel continued: but another reason why I want to offer [the aaMr] is because you, and perhaps our appellate courts, are going to have to interpret our statutes. there are terms of art in our statutes, [§] 28-105.01, with regard to the definitions of mental retardation that do not have ordinary, common meaning. they are vague, ambiguous in that way. I think in order for you, and perhaps an appellate court, to understand and interpret the statutes, you need authority to do that.\n\n. . . [the aaMr] is dedicated to the definitions, classifications of mental retardation. so I want you to have [the aaMr] for that purpose. shortly thereafter, counsel stated that he was offering the DsM-Iv-tr and the aaMr \"to the court for the legal purposes of statutory interpretation.\" both volumes were received in evidence. In his closing argument, counsel stated that because the \"two elements\" of mental retardation were not defined by § 28-105.01, it was appropriate for the court to use the aaMr and the DsM-Iv-tr clinical models \"to give meaning to our statutory elements.\"\n\nIn its order, the district court determined that the phrases \"'subaverage intellectual functioning'\" and \"'limitations in adaptive behavior'\" used in § 28-105.01(3) were not \"plain, direct, and unambiguous.\" accordingly, the court concluded that it could look to the clinical models for definitions of these terms. thus, having first offered the clinical models as authoritative source references for interpreting and applying Nebraska's statutory definition of mental retardation, which he claimed to be ambiguous, Vela assigns error to the fact that the district court did precisely as he requested. this bears the earmarks of the doctrine of \"invited error,\" which holds that a defendant in a criminal case may not take advantage of an alleged error which the defendant invited the trial court to commit.\u003cspan class=\"fnref\"\u003e139\u003c/span\u003e but given that this is a capital appeal, we choose not to apply the doctrine here, and we proceed to the question of whether § 28-105.01(3) requires consideration of deficits in adaptive behavior in a manner which differs from current clinical models.\n\nMental retardation is a clinical diagnosis. the U.S. supreme Court noted in Atkins v. Virginia\u003cspan class=\"fnref\"\u003e140\u003c/span\u003e that while definitions of mental retardation in state laws prohibiting the execution of mentally retarded persons are not identical, they generally conform to the clinical definitions set forth in the DsM-Iv-tr and the aaMr. the Nebraska statute uses but does not define two key diagnostic criteria of mental retardation: \"significantly subaverage general intellectual functioning\" and \"deficits in adaptive behavior.\"\u003cspan class=\"fnref\"\u003e141\u003c/span\u003e to understand what these terms mean, how they are measured, and how they are to be considered in diagnosing mental retardation, clinical expertise is not only helpful, but essential. supplied with nothing more than the language of the statute, it would be impossible for a lay finder of fact to reach any meaningful determination of whether a convicted defendant with an IQ in the low 70's is a person with mental retardation. Vela presented the clinical models and the expert testimony of Piersel to help the fact finder in this case. Piersel testified that the DsM-Iv-tr was a generally accepted model of the definitions and diagnostic criteria for mental disorders, including mental retardation. He testified directly from the DsM-Iv-tr in describing the various classifications of mental retardation characterized by IQ scores deemed to be \"'subaverage.'\" He testified that the DsM-Iv-tr established the cutoff points for the various classifications and established 75 as the highest IQ score which could support a diagnosis of mental retardation. reading directly from the DsM-Iv-tr, Piersel testified that \"'it is possible to diagnose mental retardation in individuals with IQs between 70 and 75 who exhibit significant deficits in adaptive behavior.'\" Piersel also testified that the DsM-Iv-tr specified the various skills which should be identified and evaluated in the assessment of adaptive behavior and stated that he considered those skills in his evaluation of Vela's adaptive behavior. based upon that evaluation, he expressed his opinion that Vela had \"significant\" limitations or impairments in 5 of the 10 skills listed in the DsM-Iv-tr. the district court found otherwise. Vela now argues that under § 28-105.01(3), deficits in adaptive behavior need not be clinically significant in order to be diagnostic of mental retardation. at least one court has interpreted similar statutory language differently. In Phillips v. State,\u003cspan class=\"fnref\"\u003e142\u003c/span\u003e the supreme Court of Florida interpreted a statute that exempted persons with mental retardation from execution. Like Nebraska's, the Florida statute defined \"mental retardation\" as \"significantly subaverage general intellectual functioning existing concurrently with deficits in adaptive behavior.\"\u003cspan class=\"fnref\"\u003e143\u003c/span\u003e the court affirmed the trial court's finding that the defendant failed to prove the second prong of this definition, concluding that a defendant must fit within the clinical diagnosis of \"'significant limitations in adaptive functioning in at least two . . . skill areas'\" in order to meet the statutory requirement of \"deficits in adaptive behavior.\"\u003cspan class=\"fnref\"\u003e144\u003c/span\u003e\n\n[19] When considering a statute's meaning, it is appropriate for a court to consider the evil and mischief attempted to be remedied, the objects sought to be accomplished, and the scope of the remedy to which its terms apply and to give the statute such an interpretation as appears best calculated to effectuate the design of the legislative provisions.\u003cspan class=\"fnref\"\u003e145\u003c/span\u003e\n\nAs we noted in Vela's prior appeal, both § 28-105.01(2) and the eighth amendment prohibit the execution of persons with mental retardation \"because of what the U.S. supreme Court describes as a 'widespread judgment about the relative culpability of mentally retarded offenders, and the relationship between mental retardation and the penological purposes served by the death penalty.'\"\u003cspan class=\"fnref\"\u003e146\u003c/span\u003e Given this purpose, we can understand why the Legislature chose to omit age of onset from the definition of mental retardation in § 28-105.01(3). For example, if a defendant has clinically significant subaverage intellectual functioning and deficits in adaptive behavior as a result of a traumatic brain injury, the age of onset would have no relevance to the question of relative culpability for a crime committed after the injury. but we can conceive of no reason why the Legislature would have intended to preclude the death penalty for persons with clinically insignificant deficits in adaptive behavior. We conclude that the district court did not err in construing § 28-105.01(3) in a manner consistent with the clinical models to require a showing of significant deficits in adaptive behavior in order to establish that Vela was a person with mental retardation. the district court's finding that Vela failed to prove significant deficits in adaptive behavior is supported by substantial evidence. the vineland adaptive behavior scales test administered by Piersel was based on information Piersel received from Vela's sister. although the results showed deficits in five adaptive behaviors, the accuracy of the information provided by Vela's sister was significantly challenged during the cross-examination of Piersel, and he acknowledged the possibility that the sister's reliability as a reporter could be affected because she had the same motivation for secondary gain as Vela himself. Zlomke administered a modified adaptive behavior test based on interviews with Vela's acquaintances and concluded that Vela fell within the average range of adaptive functioning.\n\nIn addition to the conflicting results from the adaptive behavior tests, there was also evidence that Vela had demonstrated normal adaptive behavior in several areas. Vela's middle school records reflect mostly grades of C, with a's and b's in some subjects and D's and F's in others. testimony established that he was thought to have a learning disability and received special education services for that diagnosis, but he was never placed in an academic program designed for students with mental retardation. there was evidence that Vela had been employed by a trucker to assist in finding addresses for pickups and deliveries, and that while so employed, he was well-liked, responsive, hard-working, friendly, and talkative. While so employed, Vela was responsible in part for planning the routes and the order of deliveries or pickups, and when problems occurred, he would communicate with the trucking company's dispatcher to get an address correction or additional instructions.\n\nCorrectional employees testified regarding Vela's behaviors in prison. Vela selected books from the prison book cart and subscribed to other publications. He followed football and subscribed to a boxing magazine. He kept his living area clean and communicated clearly with correctional officers and other prisoners. a case manager testified that Vela submitted numerous written communications, known as kites, to prison officials, requesting such services as haircuts, library privileges, law library visits, and telephone calls. the case manager testified that for a brief period, Vela stopped communicating through kites on the advice of his lawyers and that in one of the conversations she had had with Vela, he told her that \"he wasn't the smartest or the quickest, but he wasn't mentally retarded.\" another correctional officer testified that he heard Vela say that he wanted to be labeled as mentally retarded \"so he could be with his family for a long time.\" the district court did not err in concluding that Vela failed to prove clinically significant deficits in adaptive behavior which would support a diagnosis of mental retardation.\n\niv. Sentencing Proceedings\n\n1. Background\n\nAfter the jury returned its verdict finding the existence of aggravating circumstances and before filing his motion to preclude the death penalty on the ground of mental retardation, Vela filed a motion to declare electrocution as a means of execution unconstitutional. the district court conducted an evidentiary hearing and overruled the motion. after the district court denied Vela's motion to preclude imposition of the death penalty on the ground of mental retardation, a panel of three district judges designated by this court pursuant to § 29-2521(1)(a) convened a hearing to receive evidence relevant to sentencing and to determine the sentences to be imposed.\n\n(a) Vela's Evidence\n\nVela was born in California on october 10, 1980, the youngest of three children. He grew up in a neighborhood where violent crime, gang activity, and drug trafficking were commonplace. Vela's mother left the family home when he was approximately 2 years old. as a child, Vela was cared for by his father but primarily by his sister, the oldest of the three children. When Vela's mother left the home, an uncle who was a drug dealer came to live with the family. When Vela was a teenager, he reestablished communication with his mother. Vela's sister was approximately 7 years old when her mother left the home. When she was 14, she moved out of the family home to a residence about two blocks away, but she maintained daily contact with her family, including Vela. Later, Vela's sister moved back to the family home with a man she later married. on two occasions during his teenage years, Vela lived in Mexico, first with his grandparents and later with his sister and her family. Vela left school during the ninth grade and did not receive any further education. For approximately 3 years, he worked as a trucker's helper, as noted above. When Vela was in his late teens, his sister learned that he was drinking alcohol and using drugs. Concerned by this, Vela's sister decided that he should move to Madison, Nebraska, to live with his father, who had recently moved there from California to take a job at a meat-packing plant. Vela arrived in Madison in July 2002.\n\nFamily members described Vela as a \"good kid\" and as a simple, nonviolent person with a childlike personality. one described him as a \"big, little kid.\" Family members stated that Vela was quiet and respectful, but that he was a \"follower\" who was always looking for approval and was easily influenced by others. Family members stated that the bank murders were completely inconsistent with Vela's character and personality. two persons who worked with Vela in California gave similar statements. there was evidence that Vela had been beaten by sandoval and others after he had disclosed plans to rob the bank to another person. Vela offered and the court received an affidavit and deposition of Galindo, who stated that he became acquainted with Vela in the summer of 2002 and introduced him to sandoval, rodriguez, and others. In the affidavit, Galindo stated that Vela was \"slow\" and \"a follower\" and that he always did what others told him to do. Galindo stated that it was sandoval's idea to rob the bank and that Galindo asked Vela to participate. He stated that Vela was scared and did not want to rob the bank but that sandoval told him he was obligated. the court also received portions of statements and testimony given by sandoval in which he described Vela's involvement in the crimes in a similar fashion. sandoval was described by one of his former teachers and a former school principal as a student with a \"charismatic personality\" who \"always had a following\" and was a \"natural-born leader.\"\n\nAfter his arrest for the bank murders, Vela told members of his family to look for a letter he had left for them in his father's apartment. the letter was found and turned over to the Madison County sheriff's office. It was in an envelope on which Vela had written the date \"9/22/02\" and an instruction that it was not to be opened until october 10, 2003. the letter states in part, \"I dont know when but my death will come because I got in something real bad! Im sorry Dad it was just [a] bad choice to come to Nebraska.\" the letter further instructed Vela's family members that if they wished to avenge his death, they should come to a bar in Madison and ask for Galindo, \"baby Joe,\" and \"smiley.\" the parties stipulated that \"baby Joe\" was sandoval and that \"smiley\" was rodriguez. Vela reoffered and the court received certain evidence which had been received during the mental retardation hearing. He also offered certified copies of sentencing orders in two unrelated first degree murder cases from another district court, in support of his argument that the notice of aggravating circumstances in his case was inadequate and for the purposes of proportionality review. the presiding judge sustained the state's relevance objections to both exhibits.\n\n(b) State's Evidence\n\n(i) Rebuttal\n\nThe state presented evidence to rebut Vela's mitigation evidence. this included affidavits from several correctional officers who had observed Vela during his incarceration. they stated that Vela was able to communicate clearly, that he did not appear to be a follower, and that he was fully capable of making his own decisions. one described him as \"out spoken\" and \"able to influence other inmates.\" another described him as \"a very good manipulator.\" a case manager at the Lincoln Correctional Center who for a period of time had daily contact with Vela stated that based upon her observations, \"while I do not feel that he is a leader, nor do I think that he is a blind follower. I do not see him as being conscripted into making decisions. I have never seen him taken advantage of.\" the state presented letters which Vela had written from prison. In a letter to a female friend, he mentioned that when he was 12 years old, he and his 15-year-old brother were involved with a gang in California. there was evidence that while in custody following his arrest for the bank murders, Vela asked a cellmate to tattoo a five-pointed crown on his left breast, and the cellmate did so with a staple, a pencil, and ink. sandoval and Galindo also had five-pointed crowns tattooed on their chests. there was also evidence that prison officials confiscated a pair of Vela's shoes on which the five-pointed crown had been drawn and that he kissed the crown prior to surrendering the shoes. a Nebraska correctional officer who is involved in tracking gang members within correctional institutions testified that the five-pointed crown is a symbol of a gang known as the Latin kings and that the symbol is an \"immediate identifier\" which identifies the person displaying it as a member of the Latin kings. a person who was incarcerated with Vela in Madison gave a sworn statement in which he said that Vela told him that when he came to Nebraska from California, he got involved with sandoval, rodriguez, and others who were Latin kings because he \"liked the way they were doing things.\" there was other evidence linking Vela to street gangs in California and the Latin kings in Nebraska. persons fluent in the spanish language who reviewed recorded telephone conversations between Vela and members of his family after the bank murders stated in affidavits that they did not hear Vela express remorse for the victims or their families in any of the conversations. a cellmate told law enforcement officers that Vela had an autographed newspaper photograph of himself sent to the cellmate's wife and that Vela told him that Vela's face was the last thing that bryant, the woman whom he shot, ever saw.\n\nOn september 19, 2002, 7 days before the bank murders, Vela and sandoval were stopped and questioned by a Nebraska state patrol trooper as they walked along a road south of norfolk. the trooper did a pat-down search which revealed a loaded 9-mm handgun in the waistband of the jeans Vela was wearing. Vela identified himself as \"Fernando Vela\" and claimed that he found the weapon and intended to sell it. the weapon was seized, and Vela was charged with false reporting and carrying a concealed weapon. He was transported to the Madison County jail and released within days; sandoval was not held. there is evidence that the weapon which Vela was carrying at the time of his arrest was one of several which had been stolen by sandoval and Galindo in a burglary. Law enforcement officers did not know this at the time of Vela's arrest and subsequent release prior to the bank murders. other weapons stolen in the burglary were used in the bank murders. Kalechstein, the neuropsychologist who testified for the state at the mental retardation hearing, was recalled and testified during the sentencing hearing. He reiterated his opinion that Vela is not a person with mental retardation and does not have a cognitive disorder. the state offered certain portions of the record from the aggravation hearing for the purpose of rebutting Vela's mitigation evidence, and it was received for that purpose.\n\n(ii) Victim Impact Testimony\n\nPrior to this hearing, Vela had filed a motion seeking to preclude the sentencing panel from considering \"victim impact statements\" submitted by family members of the murder victims which were included in the presentence investigation report. by order of the presiding judge, these statements were placed in a sealed envelope. When the state announced at the sentencing hearing that it would present testimony of family members for the purpose of establishing victim impact, Vela objected and argued that such testimony was not permitted at a capital sentencing hearing. the presiding judge overruled the objection but cautioned the prosecutor to confine the examination to personal attributes of the decedents and the effect of the deaths on the families.\n\nFive family members of the murder victims testified over Vela's continuing objection. Vela moved to strike one response to a question on direct examination because it was not within the restrictions established by the court. With the state's concurrence, that response was stricken.\n\n(c) Sentencing Order\n\nIn its sentencing order, the panel noted that it had not reviewed the sealed victim impact statements which were included in the presentence investigation report and that it disregarded any portion of the victim impact testimony \"which may have included characterizations and opinions about the crimes of [Vela] and what the appropriate sentence should be.\" the sentencing panel found that no statutory mitigating circumstances applied to Vela. It specifically found that Vela was not the \"master planner . . . or in fact the leader\" of the attempted bank robbery and that sandoval was in fact the leader. but the panel further found that Vela \"willingly and knowingly participated in the attempted robbery resulting in five murders.\" accordingly, the panel concluded that the mitigating circumstance described in § 29-2523(2)(b) did not exist, because Vela's \"willingness to follow the lead of . . . sandoval does not constitute a finding that he submitted to unusual pressure or influence or that he was under the domination of another person.\" the panel found that the mitigating circumstance described in § 29-2523(2)(e), that the \"offender was an accomplice in the crime committed by another person and his . . . participation was relatively minor,\" did not exist, reasoning that Vela \"entered the bank at the same time as the other two co-defendants with a loaded handgun, fully knowing the plan, prepared to shoot and materially participated in the execution of these crimes.\" Likewise, the panel found that the evidence did not establish the existence of the statutory mitigating circumstances described in § 29-2523(2)(a), (c), (d), (f), and (g). the panel determined that four nonstatutory mitigating factors were established: Vela pled guilty, he had a disadvantaged upbringing, his intellectual functioning is borderline, and he was a follower of a charismatic leader. the panel concluded that the evidence did not establish remorse as a mitigating factor.\n\nIn its comparative analysis of aggravating and mitigating circumstances pursuant to § 29-2522, the panel first noted that because its members did not agree as to the weight which should be given to the jury's determination that each murder \"'was especially heinous, atrocious, cruel, or manifested exceptional depravity by ordinary standards of morality and intelligence,'\" it would exclude this aggravating circumstance from its weighing analysis. In considering the remaining aggravating and mitigating circumstances, the panel gave the greatest weight to the jury's finding that Vela had a \"substantial prior history of serious assaultive or terrorizing criminal activity\" as shown by his involvement in the murder of Lundell, stating that this factor \"is of such a magnitude . . . it alone is dispositive and outweighs all of the non-statutory mitigating circumstances.\" the panel gave great weight to the aggravating circumstance specified in § 29-2523(1)(f), that Vela \"knowingly created a great risk of death to at least several persons.\" the panel gave some weight to the aggravating circumstance specified in § 29-2523(1)(b), that \"[t]he murder was committed in an effort to conceal the commission of a crime, or to conceal the identity of the perpetrator of such crime,\" and some weight to § 29-2523(1)(e), that \"[a]t the time the murder was committed, the offender also committed another murder.\" the panel concluded beyond a reasonable doubt that the four nonstatutory mitigating circumstances it found to exist did not approach or exceed the weight which the panel gave to the four aggravating circumstances considered in its analysis.\n\nPursuant to § 29-2522(3), the sentencing panel then considered whether a sentence of death would be \"excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" It first sustained the state's objection to Vela's offer of sentencing orders from two other cases. after reviewing an array consisting of opinions of this court in cases where a death sentence was imposed, the panel concluded that sentencing Vela to death would not be excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant. the panel sentenced Vela to the penalty of death on each of his five convictions for first degree murder and to 48 to 50 years' incarceration on four of the five related convictions for use of a firearm to commit a felony. He was sentenced to 50 to 50 years' incarceration on the firearm conviction related to bryant. all the firearm sentences were to be served consecutively.\n\n2. Assignments of Error\n\nVela assigns, restated and renumbered in part, that the presiding judge and the sentencing panel erred in the following:\n\n1. allowing victim impact testimony at the sentencing determination hearing, in violation of § 29-2521(3) and neb. rev. stat. § 29-2261(1) (reissue 2008).\n\n2. refusing his offer of cases for proportionality review.\n\n3. Finding that mitigating circumstance (2)(b) did not apply, in violation of the 8th and 14th amendments to the U.S. Constitution and article I, § 9, of the Nebraska Constitution.\n\n4. Finding that mitigating circumstance (2)(e) did not apply, in violation of the eighth amendment to the U.S. Constitution and article I, § 9, of the Nebraska Constitution.\n\n5. Denying his amended motion to declare electrocution as a method of administering the death penalty unconstitutional, in violation of the 8th and 14th amendments to the U.S. Constitution and article I, § 9, of the Nebraska Constitution.\n\n3. Standard of Review\n\n[20] In a capital sentencing proceeding, the Nebraska supreme Court conducts an independent review of the record to determine if the evidence is sufficient to support imposition of the death penalty.\u003cspan class=\"fnref\"\u003e147\u003c/span\u003e\n\n[21] In challenges to the constitutionality of a method of execution, the Nebraska supreme Court determines whether the trial court's conclusions are supported by substantial evidence.\u003cspan class=\"fnref\"\u003e148\u003c/span\u003e\n\n4. Analysis and Resolution\n\n(a) Victim Impact Testimony\n\nVela contends that he was prejudiced by both the sealing of the victim impact statements included in the presentence investigation report and the panel's decision not to review those statements but to allow live victim impact testimony. this argument is based upon the interplay between several Nebraska statutes. presentence investigations are governed by § 29-2261. this statute contains a specific provision stating that presentence investigation reports shall include any written statements submitted to the county attorney and the probation officer by a victim of the crime.\u003cspan class=\"fnref\"\u003e149\u003c/span\u003e this provision stems from the Nebraska Crime victims reparations act,\u003cspan class=\"fnref\"\u003e150\u003c/span\u003e which at the time Vela was sentenced, conferred certain rights upon crime victims, including a \"right to make a written or oral impact statement to be used in the probation officer's preparation of a presentence investigation report concerning the defendant\" and the right \"to submit a written impact statement at the sentencing proceeding or to read his or her impact statement submitted pursuant to subdivision 1(d)(iv).\"\u003cspan class=\"fnref\"\u003e151\u003c/span\u003e section 29-2261(1) provides that in a capital sentencing proceeding where aggravating circumstances have been found to exist, the court shall not commence the sentencing proceeding \"without first ordering a presentence investigation of the offender and according due consideration to a written report of such investigation.\" section 29-2261(6) provides that a \"court may permit inspection of the [presentence investigation] report or examination of parts thereof by the offender or his or her attorney . . . whenever the court finds it is in the best interest of a particular offender.\" section 29-2521 governs sentencing proceedings in first degree murder cases where one or more aggravating circumstances have been found to exist. this statute provides that after receipt of the presentence investigation report ordered pursuant to § 29-2261, the court shall \"hold a hearing to receive evidence of mitigation and sentence excessiveness or disproportionality.\"\u003cspan class=\"fnref\"\u003e152\u003c/span\u003e at this hearing, \"[e]vidence may be presented as to any matter that the presiding judge deems relevant to (a) mitigation . . . and (b) sentence excessiveness or disproportionality.\"\u003cspan class=\"fnref\"\u003e153\u003c/span\u003e\n\nVela contends that by sealing the victim impact statements contained in the presentence investigation report, the district court deprived him of a statutory right to review such statements and that the error was compounded by the court's receipt of victim impact testimony which, Vela argues, was not permissible under § 29-2521. the state responds that this argument places form over substance and that there was no prejudicial error.\n\nWe cannot discern from the record why the sentencing panel employed the procedure that it did. to the extent that it may have been concerned about whether its consideration of written victim impact statementswould violate Vela's sixth amendment right to confrontation, that issue was resolved by our recent decision in State v. Galindo,\u003cspan class=\"fnref\"\u003e154\u003c/span\u003e in which we concluded that the decision of the U.S. supreme Court in Crawford v. Washington\u003cspan class=\"fnref\"\u003e155\u003c/span\u003e did not change the established principle that sixth amendment rights are inapplicable to a sentencing proceeding.\n\n[22] Despite the procedural irregularity with respect to victim impact information received by the sentencing panel in this case, we conclude that there was no prejudicial error. It is undisputed that victim impact information may be considered in sentencing a convicted murderer, because \"'just as the murderer should be considered as an individual, so too the victim is an individual whose death represents a unique loss to society and in particular to his family.'\"\u003cspan class=\"fnref\"\u003e156\u003c/span\u003e the capital sentencing statutes authorize the sentencing panel to consider \"[a]ny evidence at the sentencing determination proceeding which the presiding judge deems to have probative value . . . .\"\u003cspan class=\"fnref\"\u003e157\u003c/span\u003e We recently held in Galindo that victim impact statements are admissible in evidentiary hearings conducted pursuant to § 29-2521(3) notwithstanding the fact that the statute does not make specific reference to them.\u003cspan class=\"fnref\"\u003e158\u003c/span\u003e\n\n[23] there is a substantive limitation on the admissibility of victim impact information: victim family members' characterizations and opinions about the crime, the defendant, or the appropriate sentence may not be received in evidence.\u003cspan class=\"fnref\"\u003e159\u003c/span\u003e Vela makes no argument that such information was received in this case. It is clear from the record that he was made aware of the properly considered victim impact information before he was sentenced, and he even had an opportunity to cross-examine the witnesses who presented the information, notwithstanding the fact that he had no constitutional right do so. accordingly, we find no reversible error in the manner in which the sentencing panel received the victim impact information.\n\n(b) Mitigator (2)(b)\n\nVela argues that the sentencing panel erred in not finding the existence of the mitigating circumstance described by § 29-2523(2)(b), that \"[t]he offender acted under unusual pressures or influences or under the domination of another person.\" He contends that this error violated his rights under the eighth amendment.\n\n[24] there is no burden of proof with regard to mitigating circumstances.\u003cspan class=\"fnref\"\u003e160\u003c/span\u003e However, because the capital sentencing statutes do not require the state to disprove the existence of mitigating circumstances, the risk of nonproduction and non-persuasion is on the defendant.\u003cspan class=\"fnref\"\u003e161\u003c/span\u003e In this case, the sentencing panel accepted Vela's argument to the extent that it found that Vela was \"not the master planner of this attempted robbery or in fact the leader.\" but based upon other evidence in the record, the panel found that Vela \"willingly and knowingly participated in the attempted robbery resulting in five murders.\" this evidence included the fact that Vela had several opportunities to separate himself from the plan to rob the bank, yet did not do so, and that he acted alone in shooting bryant. the panel also noted that Vela \"has demonstrated his ability to think and act independently in communications he has made since his arrest, as well as in his guilty pleas over the objections of his counsel.\" these findings are supported by the record, and the sentencing panel therefore did not err in concluding that the mitigating circumstance described in § 29-2523(2)(b) did not exist.\n\n(c) Mitigator (2)(e)\n\nVela also assigns that the sentencing panel erred in not finding the existence of the mitigating circumstance described in § 29-2523(2)(e): \"[t]he offender was an accomplice in the crime committed by another person and his or her participation was relatively minor.\" Vela concedes that this mitigating circumstance would not apply to the murder of bryant, but argues it should have been applied with respect to the victims shot and killed by sandoval and Galindo. the sentencing panel found that \"Vela entered the bank at the same time as [sandoval and Galindo] with a loaded handgun, fully knowing the plan, prepared to shoot and materially participated in the execution of these crimes.\" the record fully supports this conclusion and would not support a characterization of Vela's role in the death of each victim as \"relatively minor.\" the sentencing panel did not err in concluding that this mitigating circumstance did not exist.\n\n(d) Proportionality Review by Sentencing Panel\n\nOne of the factors which the sentencing panel was required by statute to consider in determining Vela's sentence was \"[w]hether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\"\u003cspan class=\"fnref\"\u003e162\u003c/span\u003e Vela assigns error to the refusal of the sentencing panel to consider sentencing orders in two cases in which the defendants received life sentences, and in considering only cases in which the death sentence was imposed for purposes of proportionality review.\n\nWe rejected a similar argument in State v. Galindo,\u003cspan class=\"fnref\"\u003e163\u003c/span\u003e reaf- firming our prior cases\u003cspan class=\"fnref\"\u003e164\u003c/span\u003e holding that proportionality review by the sentencing body entails consideration only of other cases in which the death penalty has been imposed. We reach the same conclusion here.\n\n(e) De Novo Proportionality Review\n\n[25] Under neb. rev. stat. § 29-2521.03 (reissue 2008), this court is required, upon appeal, to determine the propriety of a death sentence by conducting a proportionality review.\u003cspan class=\"fnref\"\u003e165\u003c/span\u003e this review requires us to compare the aggravating and mitigating circumstances with those present in other cases in which a district court imposed the death penalty.\u003cspan class=\"fnref\"\u003e166\u003c/span\u003e the purpose of such review is to ensure that the sentences imposed in the present appeal are no greater than those imposed in other cases with the same or similar circumstances.\u003cspan class=\"fnref\"\u003e167\u003c/span\u003e In conducting our de novo proportionality review, we have considered relevant cases in which the death penalty was imposed, including those cited in our proportionality review in Gales II,\u003cspan class=\"fnref\"\u003e168\u003c/span\u003e and cases decided since that opinion, including State v. Hessler,\u003cspan class=\"fnref\"\u003e169\u003c/span\u003e Mata II,\u003cspan class=\"fnref\"\u003e170\u003c/span\u003e and State v. Galindo.\u003cspan class=\"fnref\"\u003e171\u003c/span\u003e of this array, we affirmed death sentences in nine cases involving multiple murder victims,\u003cspan class=\"fnref\"\u003e172\u003c/span\u003e four cases involving murders committed in connection with a robbery,\u003cspan class=\"fnref\"\u003e173\u003c/span\u003e and two cases in which the defendants had committed previous homicides.\u003cspan class=\"fnref\"\u003e174\u003c/span\u003e all three of these factors are present in this case.\n\nObviously, Galindo is the most comparable of these cases. In Galindo, as in this case, a jury found the existence of five aggravating circumstances, including § 29-2523(1)(a). the jury's finding of that aggravating circumstance was based on Galindo's involvement in the prior murder of Lundell, in which Vela was also involved. this case differs from Galindo in that Vela's sentencing panel did not consider the exceptional depravity aggravator found by the jury because it disagreed as to the amount of weight it should be given. also, the sentencing panel in this case found three nonstatutory mitigating factors which were not found in Galindo. but in our view, these differences are not so substantial as to require that Vela receive lesser sentences than Galindo. based upon our de novo review, we conclude that the four aggravating circumstances considered by the sentencing panel far outweigh the mitigating circumstances and that the imposition of the death penalty on each of the five counts of first degree murder for which Vela was convicted is not disproportionate or excessive when compared with previous cases involving the same or similar circumstances.\n\n(f) Method of Execution\n\nVela assigns error to the order of the district court denying his motion to declare electrocution as a method of implementing the death penalty unconstitutional. the order was entered prior to our opinion in Mata II.\u003cspan class=\"fnref\"\u003e175\u003c/span\u003e In accordance with our opinion therein, we find merit in this assignment of error.\n\nV. Conclusion\n\nFor the foregoing reasons, we find no merit in any of Vela's assignments of error except the assignment challenging electrocution as the method of execution. but for the reasons discussed in Mata II,\u003cspan class=\"fnref\"\u003e176\u003c/span\u003e the constitutional infirmity in this method of execution does not require that we disturb the death sentences imposed in this case. because we find no error in the imposition of those sentences and further conclude on de novo review that they are not disproportionate or excessive, we affirm.\n\nHeavican, C.J., not participating.\n\nAffirmed.\n\nConnolly, J., dissenting.\n\nI dissent from the majority's opinion that adds the words \"significant limitations\" to the adaptive behavior component of the statutory definition of mental retardation. Why quibble over two words? because by adding these words to the statutory definition, the majority opinion has imposed a higher burden of proving mental retardation than the Legislature's standard. this is the first time that we have had the opportunity to interpret neb. rev. stat. § 28-105.01(3) (reissue 2008). the majority characterizes mental retardation as a clinical diagnosis and concludes that we should incorporate standard diagnostic criteria into § 28-105.01(3). that may be appropriate in other circumstances-but not here. the U.S. supreme Court has left to the states \"'the task of developing appropriate ways to enforce the constitutional restriction upon [their] execution'\" of mentally retarded criminals.\u003cspan class=\"fnref\"\u003e177\u003c/span\u003e Clearly, mental retardation as defined in § 28-105.01(3) is Nebraska's legal standard for that purpose, not a clinical diagnosis. I believe that the issue is one of statutory interpretation and that the majority's interpretation ignores the Legislature's intent.\n\nI understand the majority's concern that the standard is difficult to apply unless it is tied to a clinical definition. but I do not believe it is our role to second-guess the Legislature's decision to enact a definition of mental retardation that is broader than a clinical definition. the Legislature had valid reasons to do so, as will be discussed later. nor do I believe that the statutory standard is impossible to apply. thus, I conclude that the trial court erred in judicially imposing a higher standard than the Legislature's, by adding the \"significant limitations\" standard that the Legislature specifically rejected.\n\nIt is for the Legislature to declare what is the law and public policy.\u003cspan class=\"fnref\"\u003e178\u003c/span\u003e If a statute's language is clear, the words of such statute are the end of any judicial inquiry regarding its meaning.\u003cspan class=\"fnref\"\u003e179\u003c/span\u003e It is not within a court's province to read a meaning into the statute that is not there.\u003cspan class=\"fnref\"\u003e180\u003c/span\u003e\n\nThe majority opinion has done that. section 28-105.01(3) clearly does not impose the \"signifi-cant limitations\" standard. It provides that \"mental retardation means significantly subaverage general intellectual functioning existing concurrently with deficits in adaptive behavior.\" (emphasis supplied.) nothing in this statute allows the state to execute a person who has subaverage intellectual functioning but fails to show significant limitations in adaptive behavior. I agree that a judge could apply neither the intellectual function standard nor the adaptive behavior standard without the aid of clinical expertise. but that would be true regardless of whether the Legislature had chosen to require a showing of \"significant limitations\" or \"deficits\" in adaptive behavior. and the Legislature's decision to deviate from the clinical definition in promulgating a legal standard of mental retardation was not dependent upon whether clinical expertise would be needed for these determinations.\n\nThe majority opinion, however, states that \"we can conceive of no reason why the Legislature would have intended to preclude the death penalty for persons with clinically insignificant deficits in adaptive behavior.\" the majority is implicitly concluding that it must construe the statute as incorporating the clinical criteria because the plain language of the statute would lead to an absurd result otherwise. but the statute's plain language does not lead to an absurd result. It does not follow that because the Legislature has not required \"significant limitations\" in adaptive behavior, persons with insignificant deficits would evade the death penalty. In short, there is a range of diminished adaptive behavior between \"significant limitations\" and \"deficits\" that does not include \"insignificant deficits.\" Further, I believe the majority's framing of the issue obscures valid concerns that support the Legislature's definition. the majority concedes that the Legislature has deviated from the clinical definition of mental retardation by omitting another important diagnostic criterion: § 28-105.01(3) omits the clinical requirement that the onset of mental retardation must have occurred before the age of 18. but the majority concludes that this deviation-removing the age of onset-is justified because the Legislature's legal standard would include criminals who may have less culpability for their crimes because they sustained a traumatic brain injury after age 18. While I disagree with the majority's implicit substitution of its judgment for the Legislature's, I would point out that by omitting the requirement of \"significant limitations\" in adaptive behavior, the Legislature's legal standard similarly ensures that persons who are less culpable for their crimes because they have mild mental retardation are not executed. the majority concludes that the district court did not err in construing § 28-105.01(3) in a manner consistent with clinical models. In other words, the majority affirms the court's incorporation of the \"significant limitations\" standard from the Diagnostic and statistical Manual of Mental Disorders (DsM-Iv-tr).\u003cspan class=\"fnref\"\u003e181\u003c/span\u003e the DsM-Iv-tr describes persons with mild mental retardation, who account for 85 percent of all persons with mental retardation.\u003cspan class=\"fnref\"\u003e182\u003c/span\u003e It provides that the IQ level of these persons ranges from 50 to about 70,\u003cspan class=\"fnref\"\u003e183\u003c/span\u003e and states that persons in this range used to be referred to as \"educable\":\n\nAs a group, people with this level of Mental retardation typically develop social and communication skills during the preschool years (ages 0-5 years), have minimal impairment in sensorimotor areas, and often are not distinguishable from children without Mental retardation until a later age. by their late teens, they can acquire academic skills up to approximately the sixth-grade level. During their adult years, they usually achieve social and vocational skills adequate for minimum self-support, but may need supervision, guidance, and assistance, especially when under unusual social or economic stress. With appropriate supports, individuals with Mild Mental retardation can usually live successfully in the community, either independently or in supervised settings.\u003cspan class=\"fnref\"\u003e184\u003c/span\u003e this description clearly would not preclude a mental retardation diagnosis just because a person possesses some academic or vocational skills or because a person can live independently. neither are low skills inconsistent with the U.S. supreme Court's description of persons who are less culpable and less deterrable than the \"average murderer\" for ensuring that only the most deserving of execution are put to death:\n\nMentally retarded persons frequently know the difference between right and wrong and are competent to stand trial. because of their impairments, however, by definition they have diminished capacities to understand and process information, to communicate, to abstract from mistakes and learn from experience, to engage in logical reasoning, to control impulses, and to understand the reactions of others. there is no evidence that they are more likely to engage in criminal conduct than others, but there is abundant evidence that they often act on impulse rather than pursuant to a premeditated plan, and that in group settings they are followers rather than leaders. their deficiencies do not warrant an exemption from criminal sanctions, but they do diminish their personal culpability.\u003cspan class=\"fnref\"\u003e185\u003c/span\u003e the Court concluded that\n\n[i]f the culpability of the average murderer is insufficient to justify the most extreme sanction available to the state, the lesser culpability of the mentally retarded offender surely does not merit that form of retribution. thus, pursuant to our narrowing jurisprudence, which seeks to ensure that only the most deserving of execution are put to death, an exclusion for the mentally retarded is appropriate.\u003cspan class=\"fnref\"\u003e186\u003c/span\u003e\n\nFor similar reasons, the Court has determined that juveniles cannot be classified among the worst offenders and that their \"culpability or blameworthiness is diminished, to a substantial degree, by reason of youth and immaturity.\"\u003cspan class=\"fnref\"\u003e187\u003c/span\u003e thus, even if some persons with mild mental retardation can function on the level of a teenager with about sixth-grade academic skills, as the DsM-Iv-tr description indicates, that would not mean that their culpability warrants the death penalty.\n\nI believe these descriptions of mild mental retardation and diminished culpability refute the majority's implicit conclusion that the Legislature intended a court to use the \"signifi-cant limitations\" standard for evaluating diminished adaptive behavior despite the Legislature's omitting that standard from the statute. Given these descriptions, the Legislature could have reasonably concluded that the \"significant limitations\" standard could be interpreted in a way that would exclude criminals with mild mental retardation from § 28-105.01's ambit because they had low-level functioning. Here, for example, under its significant limitations standard, the district court rejected Piersel's conclusion that Vela had mild-to-moderate mental retardation because Vela had the ability to write a message and read, had not been placed in a program for grade school students with mental retardation, was able to hold a low-skill job, and was able to function in a penitentiary environment. but none of the court's factual findings were necessarily inconsistent with the DsM-Iv-tr description of mild mental retardation.\n\nFurther, the Legislature obviously was not concerned about matching diagnostic criteria point for point. For example, the majority points out that under the DsM-Iv-tr, \"it is possible to diagnose Mental retardation in individuals with IQs between 70 and 75 who exhibit significant deficits in adaptive behavior.\"\u003cspan class=\"fnref\"\u003e188\u003c/span\u003e and the DsM-Iv-tr also provides, \"Mental retardation would not be diagnosed in an individual with an IQ lower than 70 if there are no significant deficits or impairments in adaptive functioning.\"\u003cspan class=\"fnref\"\u003e189\u003c/span\u003e Yet, I assume the majority would not conclude that these clinical diagnostic statements demonstrate that the Legislature has incorrectly enacted a presumption of mental retardation for persons with an IQ below 70. It appears to me that the Legislature's presumption of mental retardation for a person with an IQ under 70 shows that it did not intend § 28-105.01(3) to mirror the DsM-Iv-tr. one more point, and I am done. to the extent there is any ambiguity about the Legislature's intent-and the trial court found that there was-the legislative history shows that the omission of a \"significant limitations\" standard was intentional. the Legislature enacted § 28-105.01 in 1998. at the Judiciary Committee hearing, a witness informed the committee that it was relying on an older definition of mental retardation and asked the committee to consider the newer 1992 definition from the american association on Mental retardation.\u003cspan class=\"fnref\"\u003e190\u003c/span\u003e that definition included the term \"substantial limitations.\" It provided:\n\n\"Mental retardation means substantial limitations in present functioning. It is characterized by significantly sub-average intellectual functioning (an IQ of approximately 70-75 or below) existing concurrently with related limitations in two or more of the following applicable adaptive skill areas: communication, self-care, home living, social skills, community use, self direction, health and safety, functional academics, leisure and work. Mental retardation manifests before age 18.\"\u003cspan class=\"fnref\"\u003e191\u003c/span\u003e\n\nAnother witness informed the Judiciary Committee that its definition was inconsistent with other federal and state definitions.\u003cspan class=\"fnref\"\u003e192\u003c/span\u003e For example, for determining whether an applicant is entitled to residential care, neb. rev. stat. § 83-381(1) (reissue 2008) provides that a \"[p]erson with mental retardation means any person of subaverage general intellectual functioning which is associated with a significant impairment in adaptive behavior.\" (emphasis supplied.) but there was also evidence that supported the committee's decision to reject the clinical definition. exhibits presented showed that persons with mental retardation attempt to hide their disability.\u003cspan class=\"fnref\"\u003e193\u003c/span\u003e and much of the testimony emphasized that the persons with mental retardation had been executed even in states that included \"mental defect\" as a mitigating circumstance in death penalty cases, as Nebraska does.\u003cspan class=\"fnref\"\u003e194\u003c/span\u003e\n\nThe 1998 Judiciary Committee hearing and exhibits show that the Legislature was aware that its stated definition was different from the 1992 definition from the american association on Mental retardation and other state and federal definitions. Yet, it clearly rejected the standard used in other contexts and intentionally adopted a less stringent test for the \"adaptive skills\" component of the definition for determining whether to put a person to death.\n\nI believe that the district court's adoption of the \"signifi-cant limitations\" standard for adaptive behavior impermissibly increased Vela's burden of proving mental retardation under § 28-105.01(3). the court's alteration of the statutory standard was inconsistent with both the plain language of the statute and its legislative history, and invaded the Legislature's prerogative to set policy and declare the law. I would reverse the district court's order that found Vela was not mentally retarded and remand the cause for a determination from the present record whether Vela was mentally retarded under the standard set forth in § 28-105.01(3).\n\n\u003cspan class=\"fn\"\u003e1. see neb. rev. stat. § 28-105.01(2) (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. State v. Vela, 272 neb. 287, 721 n.W.2d 631 (2006).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. see neb. rev. stat. § 29-2525 (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. see neb. rev. stat. § 29-1603(2) (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. see neb. rev. stat. § 29-2523 (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. see § 29-2523(1)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. see neb. rev. stat. §§ 29-2519 to 29-2546 (reissue 1995 \u0026 Cum. supp. 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. 2002 neb. Laws, L.b. 1, third spec. sess.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Ring v. Arizona, 536 U.s. 584, 122 S.Ct. 2428, 153 L.Ed. 2d 556 (2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. § 29-2519(2)(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. see State v. Galindo, 278 neb. 599, 774 n.W.2d 190 (2009).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. State v. Rodriguez,272 neb. 930, 726 n.W.2d 157 (2007).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. see § 29-2523(1)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. § 29-2523(1)(a), (b), (d), (e), and (f).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. brief for appellant at 53.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. State v. Gales, 269 neb. 443, 694 n.W.2d 124 (2005); State v. Diaz, 266 neb. 966, 670 n.W.2d 794 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. State v. Schmidt, 276 neb. 723, 757 n.W.2d 291 (2008); State v. Moore, 276 neb. 1, 751 n.W.2d 631 (2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. State v. Jackson, 275 neb. 434, 747 n.W.2d 418 (2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. State v. Worm, 268 neb. 74, 680 n.W.2d 151 (2004); State v. Gales, 265 neb. 598, 658 n.W.2d 604 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. State v. Worm, supra note 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. § 29-2522.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. L.b. 1, § 11 (presently codified at § 29-2520(2) (reissue 2008)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Gales I, supra note 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Gales II, supra note 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. State v. Mata, 266 neb. 668, 668 n.W.2d 448 (2003), abrogated on other grounds, State v. Rogers, 277 neb. 37, 760 n.W.2d 35 (2009).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. State v. Mata, 275 neb. 1, 745 n.W.2d 229 (2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Dobbert v. Florida, 432 U.s. 282, 97 S.Ct. 2290, 53 L.Ed. 2d 344 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Mata II, supra note 26, 275 neb. at 16-17, 745 n.W.2d at 246.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. brief for appellant at 72.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. neb. rev. stat. §§ 28-105 and 28-303 (reissues 1998 \u0026 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. see Dobbert v. Florida, supra note 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Gales I, supra note 19; Mata I, supra note 25; and State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Dobbert v. Florida, supra note 27, 432 U.s. at 293.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Id., 432 U.s. at 294.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. see § 29-2519(2)(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. see § 29-2520(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. 97th Leg., 3d spec. sess. (nov. 12, 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. see, Omaha Pub. Power Dist. v. Nebraska Dept. of Revenue, 248 neb. 518, 537 n.W.2d 312 (1995) (Caporale, J., concurring); Nuzum v. Board of Ed. of Sch. Dist. of Arnold, 227 neb. 387, 417 n.W.2d 779 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. see Gales I, supra note 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. § 29-1603(2)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. State v. Reeves, 234 neb. 711, 742, 453 n.W.2d 359, 379 (1990), vacated and remanded on other grounds 498 U.s. 964, 111 S.Ct. 425, 112 L.Ed. 2d 409. see, also, State v. Bjorklund, 258 neb. 432, 604 n.W.2d 169 (2000), abrogated on other grounds, Mata II, supra note 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. State v. Palmer, 224 neb. 282, 306, 399 n.W.2d 706, 724 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. State v. Hunt, 357 n.C. 257, 582 s.e.2d 593 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Id.at 277, 582 s.e.2d at 606.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Id.at 274, 582 s.e.2d at 604.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. State v. Steele, 921 so. 2d 538 (Fla. 2005).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Id.at 543.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Thacker v. State, 100 p.3d 1052 (okla. Crim. app. 2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Goodloe v. Parratt, 605 F.2d 1041 (8th Cir. 1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Id. at 1047.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. see Mata II, supra note 26. see, also, Schriro v. Summerlin, 542 U.s. 348, 124 S.Ct. 2519, 159 L.Ed. 2d 442 (2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. see § 29-1603(2)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. State v. Molina, 271 neb. 488, 713 n.W.2d 412 (2006); Mata I, supra note 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. State v. Greer, 257 neb. 208, 596 n.W.2d 296 (1999); State v. Flye, 245 neb. 495, 513 n.W.2d 526 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. State v. Archie, 273 neb. 612, 733 n.W.2d 513 (2007).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. State v. Myers, 244 neb. 905, 510 n.W.2d 58 (1994), overruled on other grounds, State v. Burlison, 255 neb. 190, 583 n.W.2d 31 (1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. brief for appellant at 80, quoting State v. Marks, 248 neb. 592, 537 n.W.2d 339 (1995). accord State v. Lyle, 245 neb. 354, 513 n.W.2d 293 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Neder v. United States, 527 U.s. 1, 9, 119 S.Ct. 1827, 144 L.Ed. 2d 35 (1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Washington v. Recuenco, 548 U.s. 212, 222, 126 S.Ct. 2546, 165 L.Ed. 2d 466 (2006).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. State v. Payan, 277 neb. 663, 765 n.W.2d 192 (2009).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. see § 29-2523(1)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. see State v. Molina, supra note 54, 271 neb. at 528, 713 n.W.2d at 447.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. State v. Welch, 275 neb. 517, 747 n.W.2d 613 (2008); State v. Gutierrez, 272 neb. 995, 726 n.W.2d 542 (2007).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. State v. Fischer, 272 neb. 963, 726 n.W.2d 176 (2007); State v. Iromuanya, 272 neb. 178, 719 n.W.2d 263 (2006).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Lockett v. Ohio, 438 U.s. 586, 98 S.Ct. 2954, 57 L.Ed. 2d 973 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Id., 438 U.S. at 604 (emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Id.,438 U.S. at 605.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Enmund v. Florida, 458 U.S. 782, 102 S.Ct. 3368, 73 L.Ed. 2d 1140 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Id., 458 U.S. at 787.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. Id., 458 U.S. at 798, quoting Lockett v. Ohio, supra note 67.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Id., 458 U.S. at 801.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Tison v. Arizona, 481 U.S. 137, 107 S.Ct. 1676, 95 L.Ed. 2d 127 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Id., 481 U.S. at 138.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Id., 481 U.S.at 157-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Id., 481 U.S. at 158.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. State v. Peeler, 271 Conn. 338, 857 a.2d 808 (2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Id. at 444, 857 a.2d at 876.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. Id. at 445, 857 a.2d at 876.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. Owens v. State, 13 s.W.3d 742 (tenn. Crim. app. 1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. Selsor v. State, 2 p.3d 344, 353 (okla. Crim. app. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. neb. rev. stat. § 28-206 (reissue 2008) (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. State v. Barfield, 272 neb. 502, 723 n.W.2d 303 (2006), disapproved on other grounds, State v. McCulloch, 274 neb. 636, 724 n.W.2d 727 (2007); State v. McPherson, 266 neb. 715, 668 n.W.2d 488 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. § 29-2523(2)(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. State v. Pieper, 274 neb. 768, 743 n.W.2d 360 (2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. State v. Tuttle, 238 neb. 827, 472 n.W.2d 712 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. Id. at 836, 472 n.W.2d at 718.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. § 29-1917(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. Penry v. Lynaugh, 492 U.S. 302, 109 S.Ct. 2934, 106 L.Ed. 2d 256 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. Atkins v. Virginia, 536 U.S. 304, 122 S.Ct. 2242, 153 L.Ed. 2d 335 (2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. Id., 536 U.S. at 313, quoting Trop v. Dulles, 356 U.S. 86, 78 S.Ct. 590, 2 L.Ed. 2d 630 (1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. § 28-105.01(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. § 28-105.01(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. § 28-105.01(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. american psychiatric association, Diagnostic and statistical Manual of Mental Disorders (4th ed. text rev. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. american association on Mental retardation: Definition, Classification, and systems of supports (10th ed. 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. DsM-Iv-tr, supra note 99 at 49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. aaMr, supra note 100 at 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. State v. Vela, supra note 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. State v. Moore, 277 neb. 111, 759 n.W.2d 698 (2009); State v. Nelson, 276 neb. 997, 759 n.W.2d 260 (2009).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. State v. Draganescu, 276 neb. 448, 755 n.W.2d 57 (2008); State v. Kuehn, 273 neb. 219, 728 n.W.2d 589 (2007).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. State v. Davidson, 260 neb. 417, 618 n.W.2d 418 (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. State v. Jackson, supra note 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. State v. Kinney, 262 neb. 812, 816, 635 n.W.2d 449, 452 (2001), quoting State v. Woods, 255 neb. 755, 587 n.W.2d 122 (1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. State v. Vela, supra note 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. § 28-105.01(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. § 27-504(4)(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. see neb. rev. stat. § 38-3131(3)(f) (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. see § 83-178(2) and (6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. § 83-178(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. State v. Simants, 245 neb. 925, 517 n.W.2d 361 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. neb. rev. stat. § 29-3703(1) (reissue 1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. State v. Simants, supra note 116, 245 neb. at 930, 517 n.W.2d at 364.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. Id. at 931, 517 n.W.2d at 365.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. State v. Woods, supra note 109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. see neb. rev. stat. § 29-1927 (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. State v. Reid, 981 s.W.2d 166 (tenn. 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. State v. Carreon, 210 ariz. 54, 68-69, 107 p.3d 900, 914-15 (2005), quoting Phillips v. Araneta, 208 ariz. 280, 93 p.3d 480 (2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. U.S. v. Allen, 247 F.3d 741, 773 (8th Cir. 2001), vacated on other grounds 536 U.S. 953, 122 S.Ct. 2653, 153 L.Ed. 2d 830 (2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. People v. Lee, 196 Ill. 2d 368, 752 n.e.2d 1017, 256 Ill. Dec. 775 (2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. Atkins v. Virginia, supra note 93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. Estelle v. Smith, 451 U.S. 454, 101 S.Ct. 1866, 68 L.Ed. 2d 359 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. Id.,451 U.S. at 468.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. see, State v. McCracken, 260 neb. 234, 615 n.W.2d 902 (2000), abrogated on other grounds, State v. Thomas, 262 neb. 985, 637 n.W.2d 632 (2002); State v. Vosler, 216 neb. 461, 345 n.W.2d 806 (1984); State v. Carreon, supra note 124; Centeno v. Superior Court, 117 Cal. app. 4th 30, 11 Cal. rptr. 3d 533 (2004); State v. Reid, supra note 123.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. Atkins v. Virginia, supra note 93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. see § 28-105.01(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. brief for appellee at 38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134. § 28-105.01(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135. aaMr, supra note 100 at 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136. DsM-Iv-tr, supra note 99 at 41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137. see § 28-105.01.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138. brief for appellant at 103.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139. see, e.g., State v. Molina, supra note 54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140. Atkins v. Virginia, supra note 93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141. § 28-105.01(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142. Phillips v. State, 984 so. 2d 503 (Fla. 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143. Fla. stat. ann. § 921.137(1) (West 2006).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144. Phillips v. State, supra note 142, 984 so. 2d at 511.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145. State v. Portsche, 261 neb. 160, 622 n.W.2d 582 (2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146. State v. Vela, supra note 2, 272 neb. at 292, 721 n.W.2d at 636, quoting Atkins v. Virginia, supra note 93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e147. Gales II, supra note 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e148. Mata II, supra note 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e149. § 29-2261(3)(a) and (b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e150. neb. rev. stat. § 81-1801 et seq. (reissue 2008).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e151. neb. rev. stat. § 81-1848(1)(d)(iv) and (vii) (reissue 2008). see, also, State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e152. § 29-2521(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e153. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e154. State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e155. Crawford v. Washington, 541 U.S. 36, 124 S.Ct. 1354, 158 L.Ed. 2d 177 (2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e156. Payne v. Tennessee, 501 U.S. 808, 825, 111 S.Ct. 2597, 115 L.Ed. 2d 720 (1991), quoting Booth v. Maryland, 482 U.S. 496, 107 S.Ct. 2529, 96 L.Ed. 2d 440 (1987) (White, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e157. § 29-2521(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e158. State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e159. see State v. Bjorklund, supra note 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e160. State v. Victor, 235 neb. 770, 457 n.W.2d 431 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e161. Id.; State v. Reeves, supra note 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e162. see § 29-2522(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e163. State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e164. State v. Bjorklund, supra note 42; State v. Lotter, 255 neb. 456, 586 n.W.2d 591 (1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e165. see, Mata II, supra note 26; State v. Hessler, 274 neb. 478, 741 n.W.2d 406 (2007).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e166. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e167. see id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e168. Gales II, supra note 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e169. State v. Hessler, supra note165.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e170. Mata II, supra note 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e171. State v. Galindo, supra note 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e172. Id.; Gales II, supra note 16; State v. Lotter, supra note 164; State v. Moore, 250 neb. 805, 553 n.W.2d 120 (1996), disapproved on other grounds, State v. Reeves, 258 neb. 511, 604 n.W.2d 151 (2000); State v. Joubert, 224 neb. 411, 399 n.W.2d 237 (1986); State v. Reeves, 216 neb. 206, 344 n.W.2d 433 (1984); State v. Harper, 208 neb. 568, 304 n.W.2d 663 (1981); State v. Williams, 205 neb. 56, 287 n.W.2d 18 (1979); State v. Simants, 197 neb. 549, 250 n.W.2d 881 (1977), disapproved on other grounds, State v. Reeves, supra note 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e173. State v. Palmer, supra note 43; State v. Peery, 199 neb. 656, 261 n.W.2d 95 (1977); State v. Holtan, 197 neb. 544, 250 n.W.2d 876 (1977), disapproved on other grounds, State v. Palmer, supra note 43; State v. Rust, 197 neb. 528, 250 n.W.2d 867 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e174. State v. Dunster, 262 neb. 329, 631 n.W.2d 879 (2001); State v. Victor, supra note 160.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e175. Mata II, supra note 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e176. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e177. Atkins v. Virginia, 536 U.S. 304, 317, 122 S.Ct. 2242, 153 L.Ed. 2d 335 (2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e178. see State v. Barranco, 278 neb. 165, 769 n.W.2d 343 (2009).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e179. see State ex rel. Lanman v. Board of Cty. Commissioners, 277 neb. 492, 763 n.W.2d 392 (2009).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e180. see, State ex rel. Wagner v. Gilbane Bldg. Co., 276 neb. 686, 757 n.W.2d 194 (2008); Ottaco Acceptance, Inc. v. Larkin, 273 neb. 765, 733 n.W.2d 539 (2007).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e181. american psychiatric association, Diagnostic and statistical Manual of Mental Disorders (4th ed. text rev. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e182. Id. at 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e183. see id. at 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e184. Id. at 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e185. Atkins, supra note 1, 536 U.S. at 318.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e186. Id., 536 U.S. at 319.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e187. Roper v. Simmons, 543 U.S. 551, 571, 125 S.Ct. 1183, 161 L.Ed. 2d 1 (2005).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e188. see DsM-Iv-tr, supra note 5 at 41-42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e189. Id. at 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e190. see Judiciary Committee Hearing, 95th Leg., 2d sess. 85, 93 (Feb. 13, 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e191. see id., exhibit 23 (emphasis supplied). accord Atkins, supra note 1 (quoting definition).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e192. see Judiciary Committee Hearing, supra note 14 at 90.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e193. see id., exhibits 1 \u0026 23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e194. Judiciary Committee Hearing, supra note 14 at 86, 88.\u003c/span\u003e\n\n",
    "body_length": 174179,
    "citedas": [
      "279 Neb. 94"
    ],
    "attorneys": "James R. Mowbray, Jeffery A. Pickens, and Jerry L. Soucie, of Nebraska Commission on public advocacy, and Mark D. Albin, of Albin Law office, for appellant. Jon Bruning, Attorney General, and J. Kirk Brown for appellee.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Wright, Connolly, Gerrard, Stephan, Mccormack, and Miller-Lerman, JJ., and Irwin, Judge.",
    "citation_count": 15
  }
}
