{
  "id": "9bVjTWYBTlTomsSBEtFw",
  "document": {
    "title": "11/01/88 BETTY L. ELAM v. ALCOLAC",
    "full_title": "BETTY L. ELAM, CLARENCE ELAM AND LINDA LOU SANDERS, ETHEL M. BERRY, CARL C.*AND JACQUELINE BERRY, VIRGIL AND DOROTHY BRADLEY, EDWARD AND MALVA GEHLKEN, DAINIE AND MARY LUCETTA LANDON, *GWENDOLYN AND JOHN C. LAWRENCE, GLEN A. AND BERNICE MILLER CHARLOTTE A. AND JOHN PHILLIPS, DANIEL CHARLES AND JOYCE PRYOR AND AMBER CROSS, ARNOLD L., JOY R., JOYCE AND TAMMY SOMMERS, JAMES R., KAY D., WILLIAM LANCE, LISA AND LYLE TURLEY, GENEVIEVE AND RALPH H. WITHERS -APPELLANTS, v. ALCOLAC, INC. -RESPONDENT [PART 2 OF 3]",
    "jurisdiction": "Missouri Court of Appeals",
    "date": "1988-11-01T00:00:00.000Z",
    "docket": "No. WD 38,105 (Consolidated)",
    "body": "HETHEL BERRY, AGE 73, LIFE EXPECTANCY 13.78 YEARS,\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by\n\nthe Alcolac toxic chemicals with damage to multi-\n\nple organ systems, including\n\n1) recurrent conjunctivitis\n\n2) bilateral hearing loss with probable neuro-\n\nsensory 8th cranial nerve damage\n\n3) chronic rhinitis and pharyngitis\n\n4) chronic chemical bronchitis\n\n5) arteriosclerotic heart disease with angina,\n\nchronic insufficiency and hypertension\n\n6) liver dysfunction including\n\na. chemical hepatitis\n\nb. abnormal lipid metabolism\n\nc. porphyria\n\nd. abnormal protein metabolism\n\n7) chronic obstructive uropathy with hyper-\n\ncalcemia\n\n8) depression\n\n9) peripheral neuropathy\n\n10) immune system dysfunction with suppression\n\n11) recurrent chemical contact dermatitis\n\n12) hyperglycemia with early diabetes\n\nPROGNOSIS: Very guarded to poor.\n\nThe diagnosis entered by Dr. Carnow as to Ethel Berry - Chronic Systemic Chemical Intoxication caused by the Alcolac toxic chemicals with damage to multiple organ systems - was that determined for each of the thirty-one litigants, although by distinctive manifestations. The witness then explained - in terms of the symptoms, physical findings, laboratory results and environmental history of the litigant - how, as a medical exercise, the subelements of diagnosis were derived:\n\n1) Recurrent conjunctivitis rests on symptoms and history of acute problems with the eyes which recurred every time she was exposed to the Alcolac chemical emissions: redness of the eyes, burning, itching. Although the evaluator considered it more probable that there was residual damage to the eye and so the diagnosis was likely chronic conjunctivitis, the residual damage to the eye was not palpable, therefore, recurrent and not chronic conjunctivitis was attributed.\n\n2) Bilateral hearing loss with probable neurosensory 8th cranial nerve damage rests on the abnormal audiometric tests at the upper frequencies, a sign of bilateral nerve damage to the 8th cranial nerve by the Alcolac chemicals.\n\n3) Chronic rhinitis and pharyngitis rests on physical findings of swollen nose with exudate material within. Rhinitis describes the chronic inflammation of the mucous membrane of the nose. It was a chronic, rather than a recurrent condition, because the swelling and residue were evident even when there was no exposure.\n\n4) Chronic chemical bronchitis rests on findings that the bronchial tubes were chronically inflamed. In response to cross-examination, the expert acknowledged the work history of Ethel Berry - that she worked for 23 years in a broom factory, a very dusty occupation and developed a low grade abnormality from that exposure. It was an abnormality different from the bronchitis and is in the nature of chronic restrictive pulmonary disease, rather than bronchial disease. The restrictive pulmonary disease caused by the dust involves the lung tissue itself. The chronic chemical bronchitis involves the bronchial tubes irritated by the toxic chemicals. The bronchitis was diagnosed from the inflamed bronchia from recurrent episodes of inhalations of obnoxious Alcolac odors, which sometimes burn and irritate and induce nausea. The odors also induce productive coughs. The diagnosis was limited to bronchitis and did not include the restrictive pulmonary disease to the lung tissue because it was attributable to occupation, and not to the Alcolac chemicals.\n\n5) Arteriosclerotic heart disease with angina, chronic insufficiency and hypertension rests on findings of pain on exertion from chronic want of sufficient blood supply to the heart, with the consequence of recently developed high blood pressure. It included the diagnosis that the blood vessels of the heart have been adversely affected by the abnormal fats in the blood developed from the intoxication of the liver. The diagnosis took into account her prior medical episode of hypertension, since for several years Ethel Berry has been free from any such disease. It also took into account that several of her brothers died of heart disease, but discounted that information since heart disease of that kind is not of genetic significance.\n\n6) Liver dysfunction manifested by chemical hepatitis, abnormal lipid metabolism, porphyria and abnormal protein metabolism rests on the abnormal laboratory test results as to porphyrins, enzymes and lipids. The tests for the enzymes GGTP, SGOT and SGPT show abnormal elevations, indications that the liver is acutely inflamed - a condition of hepatitis attributed to the toxic chemicals. In addition the alkaline phosphatase was also abnormal. The lipid metabolism function of the liver was also diseased. The cholesterol was abnormally high at 291, and in addition the lipoportein phentotype was abnormal and the triglycerides were extremely high at the 407 level [normal, 150]. The inflammation of the liver and the impairment of the liver function is due to the destruction of cells - a direct action of such toxic chemicals as epichlorohydrin, and the intoxication of the systems of liver metabolism by others. The very abnormal fats in her blood demonstrated by the lipid metabolism tests show very abnormal fats in the blood, developed from the chemical intoxication of the liver. The porphryn metabolism was also diseased. The tests show abnormal heptacarboxylic porphyrins and an abnormal coporporphyrin ratio. The abnormal porphyrins means that the porphyrin factory and the enzymes which depend on the heme production of the porphyrins are not functioning normally. The abnormal protein metabolism means that the body tissues, the end product of the protein metabolism, are not being properly produced.\n\n7) Chronic obstructive uropathy with hypercalcemia rests on the test result of abnormal levels of calcium in her blood which inflames the genitourinary system and renders urination difficult. It represents an abnormal function of the kidney in this case.\n\n8) Depression rests on not only the Beck depression inventory test, but also on the symptoms, findings and history. It represents a mild abnormality, but nonetheless attributed to the Alcolac chemical activity. There may be some psychogenic overlay but that is the kind of depression manifested by people exposed to toxic agents of the kind emitted. She had some difficulty with some other tests - such as the visual-spatial perception, but the clinical significance of that result was discounted. The expert acknowledged to the cross-examiner that her condition of poor circulation to the brain as well as domestic stress may have combined with the toxic agents to cause the depression. He acknowledged that the Beck inventory was not as definitive as a CAT scan or other such procedures.\n\n9) Peripheral neuropathy rests on the absence of ankle reflex, decreased sensation to pinpricks in sited of the nerves on the left hand, as well as the symptoms of tingling limbs, pains, cramps and physical findings of swelling in the legs.\n\n10) Immune system dysfunction with suppression rests on the \"whole host of abnormalities\" the 1984 Bioscience and the 1985 Midwest/Wheeler immune panel results disclose. These test abnormalities show that \" whole T cell immune system is depressed,\" and a \"severe depression of her system.\"\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: slightly abnormal gamma M at 79\n\n[normal, 80 to 310]\n\nMitogen Challenge: abnormal PHA stimulation net CPM\n\nat 41,800 [normal, over 62,000]\n\n92 [normal, over 130]\n\nabnormal CON A stimulation index at\n\n10,334 [normal, over 12,000]\n\nabnormal CON A stimulation index\n\nat 24 [normal, over 40]\n\n[Midwest Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormal elevation of mature B\n\ncells at 629 [normal, 50 to 570]\n\nabnormal B cell percentage at\n\n30.3% [normal, 5 to 15%]\n\nabnormal depression of natural\n\nkiller T cells at 5.4 [normal 8\n\nto 22]\n\nHematologic system: abnormal ring of distribution\n\nof red blood cells\n\nabnormal increase in mean plate-\n\nlet volume\n\nabnormal size of red blood cells\n\nabnormal lack of red color\n\n11) Recurrent chemical contact dermatitis rests on symptoms of burning of the skin and abnormal pigmentation of the skin related to the incidents of exposure to the Alcolac emissions.\n\n12) Hyperglycemia with early diabetes rests on the test result of increased sugar in the blood. Her prior medical history and records indicate a normal level of blood sugar and that she was free of the stigmata of diabetes. A condition of diabetes could account for some elevation of the lipids, but no such condition was suggested from her history.\n\nPROGNOSIS: Very guarded to poor.\n\nThe evaluations of the symptoms, physical findings and laboratory results of the other patient plaintiffs, as well as the diagnoses and prognoses derived from them were rendered by Dr. Carnow, in turn. The diagnosis and prognosis of each is rescripted, as well as the summary of the symptoms, physical findings, laboratory results and other data on which they rest.\n\nCARL C. BERRY AGE 54 LIFE EXPECTANCY 25.51 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) bilateral chronic conjunctivitis\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic rhinitis and pharyngitis\n\n4) liver dysfunction including\n\na. abnormal lipid metabolism\n\nb. abnormal porphyrins with coproporphyinuria and\n\nabnormal porpobilinogen\n\n5) reproductive system damage\n\n6) cardiac dysfunction with:\n\na. tachycardia\n\nb. chest pain\n\nc. shortness of breath\n\n7) central nervous system dysfunction with depression\n\n8) severe immune system dysfunction with suppression\n\n9) abnormal muscle metabolism with abnormal CPK\n\nPROGNOSIS: Very guarded to poor.\n\nThe witness then explained the data on which the sub-elements of diagnosis rest:\n\n1) Bilateral chronic conjunctivitis rests on the symptoms of burned and watery eyes with redness related to the exposure of the vapors, smoke and fumes from Alcolac, as well as on the inflammation of the eyes found on physical examination. These manifestations followed the presence of odors with the smell of lacquer [which the witness identified as the methacrylates] as well as the vapors, smoke and fumes from Alcolac. The conjunctivae are the delicate membranes which cover the eyes. The witness distinguished between recurrent conjunctivitis and chronic conjunctivitis - one condition or the other manifested by every patient-plaintiff. The condition is recurrent when red eyes result upon the repeated exposures but are not present at the time of physical examination. The condition is chronic when the eyes exhibit inflammation upon examination even absent recent exposure, or when there is a history of redness of the eyes \"all the time,\" or when the eyes are matted in the morning, or gritty.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on the abnormal results from the audiometric tests. They show bilateral neurosensory hearing loss from the 3000 to the 6000 frequency ranges. Normal hearing apprehends speech between the 500 and 3000 frequency ranges, and sound up to the 6000 frequency. Those toxic chemicals which attack the central nervous system characteristically first cause damage to the 8th cranial nerve at the upper ranges. It was for that reason that the tests were for the 3000 to 6000 frequency ranges. The tests administered to Carl Berry at those ranges gave abnormal results throughout. At the 3000 frequency range, for instance, normal hearing apprehends sound at no higher than 25 decibels. Carl Berry could hear that sound only at 50 decibels. Hearing loss was also evident at 4000 and 6000 cycles. The results demonstrated damage to both 8th cranial nerves - a bilateral neurosensory hearing loss from the Alcolac toxic chemicals.\n\nIt is damage which does not regenerate, and it irreversible. Hearing loss at those frequency levels may also be the result of occupational noise. Carl Berry was a heavy equipment operator, but never experienced any hearing loss from the practice of that occupation. He was also a signal officer on an aircraft carrier, but he wore ear covers which excluded the noise. His tests for hearing were satisfactory before release from the service. The witness acknowledged also that presbycusis - hearing loss due to age - is a condition that may affect hearing at all frequencies. The loss of hearing due to presbycusis, however, does not \"notch,\" but increases as the frequency increases. Hearing losses due to chemicals or noise, on the other hand, do \"notch.\" That was demonstrated in the tests administered to Carl Berry which show that he heard at the 4000 range at 50 decibels and at the 6000 range at 45 decibels - a slight improvement at the higher frequency. The full history and other clinical data led the expert to the Conclusion that the hearing loss was not from occupational noise, but from the intoxication caused by the Alcolac emissions. It also excluded prebycusis as a relevant factor in the subdiagnosis of the manifested bilateral hearing loss both on the pattern of \"notched\" hearing loss, uncharacteristic to presbycusis, but also on the basis of studies which attribute the disease to noisy industrial environments. Carl Berry, rather, lived in the rural environs of Sedalia.\n\n3) Chronic rhinitis and pharyngitis rests on symptoms of irritation to the nose and soreness to the throat from the Alcolac odors and emissions. There was also the physical finding of mucous membrane irritation of the nose. The irritation of the mucous membrane, when chronic, impairs the production of tears, and also renders the person more susceptible to infection. In terms of diagnosis, the irritations are markers of a direct relationship between the discerned vapors, smoke and smells from Alcolac and the manifested symptoms and conditions.\n\n4) Liver dysfunction including abnormal lipid metabolism, abnormal porphyrins with coproporphyrinuria and abnormal porphobilinogen rests on the normal results of the laboratory tests. The abnormal lipid metabolism dysfunction of the liver was shown by the result of 28 in the HDL cholesterol test with a normal reference range of 29 to 77. The studies show, the witness explained, that although the reference range extends from 29 to 77, a test value below 45 means that the person is \"at increasing risk\" - therefore, a person at 29 is \"at high risk\" of cardiac disease. The reference range used by Smith-Kline, the laboratory which conducted the HDL cholesterol test, is based on the Framingham epidemiologic study which concludes that an HDL value of 45 in a male and below 55 in a female means the person is \"at increasing risk\" of heart disease. The test result for Carl Berry demonstrated abnormal metabolism of the fats. The expert acknowledged that the discontinuation of smoking will improve the HDL count, but Berry had not smoked since 1969, and so that earlier life habit was not significant to the causation of the manifestation. The porphyrin metabolism function of the liver also tested abnormally. It demonstrated a condition of porphyria, coproporpyrinuria and porphobilinogenuria.\n\n5) Reproductive system damage rests on the abnormal results of the fertility analysis tests. The normal range of count for fertility is between 60 to 200 million sperm per specimen. That represents the Conclusions of the recent Wharton study which was the standard Dr. Carnow adopted as authoritative in his evaluations. [The witness, himself, conducted some work for the World Health Organization on the subject.] The sperm count Carl Berry produced was above the 60,000,000 level, but there were abnormalities in the morphology and motility of the sperm. The witness explained that there was \"good evidence, from the animal data, that there is suppression of sperm production and destruction of testicular tissue by epichlorohydrin and allyl alcohol,\" among the compounds used in the Alcolac operation.\n\n6) Cardiac dysfunction with tachycardia, chest pain and shortness of breath rests on symptoms and physical findings of abnormal pulse, pain in the chest and, particularly pain in the chest upon walking fast or exertion, and shortness of breath. Those together constitute a syndrome of dysfunction. They suggest that the blood supply to the heart is not sufficient. They suggest a heart which does not compensate well, and a coronary insufficiency.\n\n7) Central nervous system dysfunction with depression rests on the abnormal result of the Beck inventory test of 19 [normal, 0 to 10], as well as on the abnormal digital vigilance test result.\n\n8) Severe immune system dysfunction with depression rests on the abnormal results from both the 1984 Bioscience and the 1985 Midwest/Wheeler tests.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormal gamma M at 50\n\n[normal, 80 to 310]\n\nMitogen challenge: abnormally decreased PHA stimulation\n\nnet CPM\n\nabnormally decreased CON A stimula-\n\ntion net CPM\n\nabnormally decreased CON A stimula-\n\ntion index\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nLymphocytes: abnormal OKT-10 cells at 32.9 [normal,\n\n0 to 15] [OKT-10 are immature,\n\nunprogrammed lympocytes, prob-\n\nably preleukemic cells]\n\nabnormally elevated NKH-1\n\n[natural killer] cells at 19.7\n\n[normal, 3.8 to 9.6]\n\nHematologic system: abnormally shaped red blood cells\n\nabnormal sizes\n\nabnormal color\n\n9) Abnormal muscle metabolism with abnormal CPK rests on the symptoms of soreness and tingling in the left elbow which weakens the grip on objects and the abnormal CPK test result of the related musculoskeletal system. The symptoms signify both sensory and motor abnormalities of the ulnar nerve. That nerve comes down from the shoulder into the elbow, and the ingestion of metabolic poisons may cause it to swell. That results in pain and loss of the muscular function of the arm. CPK [creatine phosphokinase] is the enzyme which appears in abnormal quantity when there is muscle injury. The test for CPK yielded an abnormal result, which signifies an abnormal muscle metabolism from exposure to the Alcolac chemicals.\n\nJACQUELINE BERRY AGE 55 LIFE EXPECTANCY 28.61 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) recurrent conjunctivitis\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic rhinitis and pharyngitis\n\n4) liver dysfunction including:\n\na. abnormal LDH - possible chemical hepatitis\n\nb. abnormal porphyrin ratio with borderline\n\ncoproporphyrinuria\n\nc. abnormal protein metabolism\n\n5) central nervous system dysfunction including\n\na. brain damage\n\nb. depression\n\n6) peripheral polyneuropathy\n\n7) abnormal muscle metabolism\n\n8) recurrent contact dermatitis with probable\n\nhypersensitivity state\n\n9) immune system dysfunction with suppression\n\n10) abnormal electrolytes with probable renal\n\ndysfunction\n\nThe witness then explained the data on which the subelements of diagnosis rest:\n\n1) Recurrent conjunctivitis rests on symptoms and history of irritation, redness and watering of the eyes with blurred vision from exposure to the odors, smoke, haze and other emissions from Alcolac.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on abnormal audiometry results of the upper frequencies with borderline abnormalities in the lower frequencies. It is a characteristic phenomenon that damage to the 8th cranial nerve from toxic chemicals starts at the high frequencies and spreads to the lower frequencies. The hearing loss to Jacqueline Berry was to both 8th cranial nerves, a bilateral neurosensory hearing loss.\n\n3) Chronic rhinitis and pharyngitis rests on the irritation to the nose and burning in the throat from the Alcolac odors and emissions. Chronic rhinitis rests also on the physical finding of swollen mucous membrane.\n\n4) Liver dysfunction including abnormal LDH [possible chemical hepatitis], abnormal porphyrin ratio with borderline coproporphyrinuria and abnormal protein metabolism rests on the abnormal results of the laboratory tests of the protein and porphyrin metabolism functions of the liver. The LDG enzyme tested at 141, elevated from the 62 to 131 normal. That represents a possible inflammation of the liver, and hence a possible hepatitis. In addition, another liver function, the coproporphyrin to uroporphyrin ratio, usually 2 to 1 to 6 to 1, was elevated to 7 to 1. Although the other enzymes - the GGTP, SGOT and SGPT - were normal, the other abnormalities found in the liver, the abnormal protein metabolism, as well as the known action of these toxic agents suggest that the abnormal LDH may represent tissue damage as well as alteration of the tissue function. That is why the evaluator termed the manifestation a \"possible chemical hepatitis.\"\n\nThe abnormal protein metabolism was manifested by a T3 uptake deficiency, which, although a part of the endocrine system, did not represent a thyroid deficiency, but an abnormality of the thyroid binding globulin - a protein manufactured in the liver.\n\nThe abnormality of the coproporphyrins was termed \"borderline\" because her coproporphyrins were at 56 on a scale of 3 to 56. Although, strictly speaking, the count was within the normal range, since it rests precisely at the two standard deviations and about 25 from the mean, the evaluator described the finding as \"borderline.\" That evaluation was reinforced, moreover, by the phenomenon of the multiple incidences of porphyrin abnormality among those tested, as well as by the known ability of these Alcolac chemicals to cause abnormal porphyrins. The witness was confident in the integrity of the test results as a basis for subdiagnosis because the high power liquid chromatography process used by the Mayo Clinic for that purpose not only measures fractionates and the porphyrins precisely, but also conducts the test on a reliable sample of urine collected during the bodily 24 hour diurnal cycle, and then repeats abnormals.\n\n5) Central nervous system dysfunction including brain dysfunction and depression rests on a neurobehavioral battery abnormality as well as on an abnormal Beck depression inventory test, and physical findings of abnormality to the 7th and 8th cranial nerves. The history taken by the CCA examiner, Dr. Garron, notes that Jacqueline Berry used Indural, a drug which on rare occasions causes some depression. It was a datum not clinically significant, however, since the tests administered by Dr. Garron resulted in several central nervous system abnormalities: the digital learning test, the digital vigilance test, as well as other areas. That represents diffuse brain damage. There was also damage to the cerebellum, the back brain which controls balance and other critical functions. It was the opinion of the evaluator that, given the nature of the toxic chemicals to which she was exposed, as well as the found abnormalities of the 7th and 8th cranial nerves and the neurobehavioral test results, the depression was part of her syndrome.\n\n6) Peripheral neuropathy rests on symptoms of sensory abnormalities - muscle cramps, numbness in the hands, aches in the arms, and charley horses in the calves of her legs. The EMG test result [a nerve conduction velocity test] was normal. The witness explained that it would be expected that a person with neuropathy would manifest abnormal reflexes, abnormal pin stick, abnormal EMG and abnormal symptoms. That, however, is usual when the pathology is far advanced. The normal EMG does not rule out abnormalities, but shows only that the EMG test gave a normal result. Multiple tests are done and multiple parameters considered. In this case, the subdiagnosis rests on the symptoms of peripheral neuropathy.\n\n7) Abnormal muscle metabolism rests on symptoms and findings of abnormal muscle function as well as on the test which shows the presence of the CPK [creative phophokinase], the enzyme which shows abnormally when there is pervasive muscle injury.\n\n8) Recurrent contact dermatitis with probable hypersensitivity rests on symptoms of itching, skin rashes and what is known of the Alcolac toxic chemicals to which the patient plaintiff was exposed. The acrylates and methacrylates not only cause severe skin damage on contact, but they also sensitize the skin even in the absence of actual contact. Contact dermatitis relates to the severity of the toxicity of the given chemical according to the degree of contact. When the skin has become hypersensitive a small exposure can cause severe reactions.\n\n9) Immune system dysfunction with suppression rests on the abnormal tests results administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nMitogen challenge: abnormal PHA stimulation net CPM at\n\n44,288 [normal, over 62,000]\n\nabnormal PHA stimulation index at\n\n118 [normal, over 130]\n\nWhite blood cells: abnormally depressed total count at\n\n4100 [normal, 4500 to 11,000]\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormal OKT-4 cells\n\nabnormal depression of NKH-1\n\n[natural killer] cells\n\nHematologic System: abnormally increased mean corpuscu-\n\nlar hemoglobin\n\nabnormally increased random distri-\n\nbution width\n\nabnormally increased mean platelet\n\nvolume\n\n10) Abnormal electrolytes with probable renal dysfunction rests on the abnormal genitourinary test results. The electrolytes - the potassium, sodium and chlorides - were abnormal and signified kidney damage. It is the function of the kidney to control the electrolytes, elements critical to life, in a delicate balance. If the electrolytes are too high or too low, the body function becomes imperilled. Some medications - such as high blood pressure pills - can depress the potassium. In her case, however, the potassium as well as the chlorides are abnormally high. These abnormalities represent the abnormal handling of these electrolytes by the kidney, induced by the attack made on that organ by a number of the toxic chemicals generated and emitted by Alcolac.\n\nPROGNOSIS: Very guarded.\n\nVIRGIL BRADLEY AGE 75 LIFE EXPECTANCY 10.67 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemicals Intoxication caused by the\n\nAlcolac toxic chemicals with damage with multiple organ\n\nsystems, including:\n\n1) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n2) chronic conjuctivitis\n\n3) chronic rhinitis and pharyngitis\n\n4) chronic chemical bronchitis - in remission\n\n5) liver dysfunction including:\n\na. abnormal lipid metabolism\n\nb. abnormal iron metabolism\n\nc. abnormal porphyrin metabolism\n\n6) reproductive system dysfunction\n\n7) diffuse brain damage with dementia\n\n8) peripheral polyneuropathy\n\n9) polyarthralgia and polymyalgia\n\n10) hyerglycemia - rule out diabetes\n\n11) immune system dysfunction\n\n12) renal insufficiency with mild uremia\n\n13) hypertension\n\n14) recurrent chemical dermatitis with probable\n\nhypersensitivity component\n\nthe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Bilateral nuerosensory hearing loss with 8th cranial nerve damage rests on the abnormal audiometric test results throughout the 500 to 6000 frequency ranges - very severe at the higher frequencies and less so at the low frequencies. This represents a course of nerve damage, still spreading. The hearing loss is bilateral and extensive: a 95 decibel loss at the 600 cycle, a 70 to 75% at 4000 cycle, a 65% loss at the 3000 cycle, and a 30 to 35% loss at the 500 cycle.\n\n2) Chronic conjunctivitis rests on symptoms of irritation, redness and watering of the eyes following exposures to the Alcolac odors and emissions. The inflammation of the eyes remains palpable even without exposure.\n\n3) Chronic rhinitis and pharyngitis rest on the symptoms and findings of an irritated and swollen mucous membrane, sore and swollen throat. These conditions followed exposures to the Alcolac toxic odors and emissions and continued absent exposure.\n\n4) Chronic chemical bronchitis - in remission rests on symptoms and extensive history of severe coughs following exposure to the Alcolac chemical emissions. The symptoms were in remission at the time of physical examination. The coughs were productive of mucus. The witness discounted that the former occupation of the patient plaintiff as a meatpacker bore on that element of diagnosis.\n\n5) Liver dysfunction including abnormal lipid metabolism, abnormal iron metabolism, abnormal porphyrin metabolism rests on the abnormal results of the tests for those functions of the liver. The test of the lipid metabolism function shows triglycerides of 155 with a reference range of 30 to 150. The uroporphyrins of the porphyrin metabolism are at 4 with a reference range of 8 to 44. The iron metabolism was abnormally low. The low serum iron suggests some disturbances of the iron-porphyrin cycle. The condition of low uroporphyrins is not as serious as if it were high, but it signifies an abnormality in porphyrin metabolism nonetheless.\n\n6) Reproductive system dysfunction rests on the abnormal results of the fertility analysis. Virgil Bradley was then 75 years of age, but although age is a significant factor as to impotency, it is not as to fertility. The results show a range of abnormalities: the sperm count was abnormally low at 36 million [normal, over 60 million], contained 5% of primitives - a pathological abnormality - only 25% of the sperm were alive after 30 minutes [rather than the normal 80%] and only 15% were alive after 4 hours [rather than the normal 60%].\n\n7) Diffuse brain damage with dementia rests on the abnormal results of the neurobehavioral battery. Dementia in the context of the subdiagnosis means diffuse brain damage. It represents a \"very significant loss of thinking power\" - a condition \"more serious than diffuse dysfunction.\"\n\n8) Peripheral polyneuropathy rests on symptoms of sensory abnormalities, physical findings of absence of deep tendon reflexes and an abnormal result on the PNVC [nerve conduction] test to the upper left extremity.\n\n9) Polyarthralgia and polymyalgia rests on acute and chronic symptoms of joint stiffness or crepitance, joint aches and muscular pains and cramps following exposure to the Alcolac emissions. Arthralgia describes a condition of pain in the joints. Arthritis describes inflammation or swelling in the joints. The subdiagnosis was valid, the expert witness Carnow explained, because there was no evidence of degenerative joint disease, nor of deformity, nor of osteoarthritis. He discounted a medical record of Virgil Bradley, dated March 26, 1982 - from some unidentified source which diagnoses degenerative arthritis - since there was no arthritis present at the time of the examination at CCA.\n\n10) Hyperglycemia - rule out diabetes rests on an abnormal glucose in the endocrine system. The result of that test was 141, with a normal reference range of 70 to 110. The medical history discloses a glucose elevation of 192, with a normal reference range of 80 to 120 used by that laboratory, for that test conducted in 1971. That was the only incidence of abnormal blood sugar in the previous medical record, however, and since there was no indication that it was a fasting blood test, Dr. Carnow could not attribute any significance to that record of abnormality. If that represented a condition of diabetes, the witness observed, Virgil Bradley would be \"in very serious trouble by now without any treatment.\" The test was never repeated, so the witness concluded it was specious. The abnormally-elevated glucose, the witness determined, demonstrated not diabetes, but suggested a pancreatic abnormality or deficiency.\n\n11) Immune system dysfunction rests on the abnormal results of the Bioscience tests in 1984 and of the Midwest/Wheeler tests in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormal globulin A\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormal elevation in OKT-8\n\n[suppressor cells]\n\nabnormal elevation in OKT-10 cells\n\nabnormally depressed T-4/T-8 ratio\n\n[an excess of suppressor to\n\nhelper cells]\n\nabnormally elevated B-1 [mature B]\n\ncells at 18.4 [normal, 5 to 15]\n\nabnormally elevated natural killer\n\ncells at 32 [normal, 8 to 22]\n\nabnormally elevated NKH-1 [killer\n\nsupressor] cells at 15.3\n\n[normal, 3.8 to 9.6]\n\nHematologic system: abnormally elevated mean corpuscu-\n\nlar volume\n\nabnormally elevated mean corpuscu-\n\nlar hemoglobin\n\nabnormally elevated random distri-\n\nbution\n\nabnormal sizes\n\nThe witness concluded that the test results of six immune system abnormalities in 1985 contrasted to one such abnormality in 1984 suggests a deterioration of the Virgil Bradley immune system. The 1985 test results from Midwest/Wheeler represent \"gross abnormalities of the kinds of lymphocytes and the ratios of lymphocytes in the blood\" and shows \"a profound disturbance of the system.\" The mitogen challenge tests which yielded no abnormal result in the 1984 Bioscience tests, however, were not repeated, therefore the current state of that element of the immune system is not known.\n\n12) Renal insufficiency with mild uremia results on the abnormal results of the creatinine and uric acid tests of the genitourinary system, as well as on symptoms of nocturia and difficulty in urination. The creatinine and uric acid tests were both abnormally elevated. An elevation in creatinine is a sign of early kidney failure. The renal insufficiency subdiagnosis means that the kidneys are not getting rid of the poisons as they should. The mild uremia signifies that, although not great at present, the abnormality means a \"buildup of poisons in the body.\"\n\n13) Hypertension rests on the physical examination at CCA. The prior medical history confirmed to the witness that the hypertension was a condition which emerged in the 1980s.\n\n14) Recurrent chemical dermatitis with probable hypertensivity component rests on symptoms of skin rash, itching and burning and skin lesions consequent upon the inhalation of odors and other Alcolac emissions.\n\nPROGNOSIS: POOR.\n\nDOROTHY BRADLEY AGE 74 LIFE EXPECTANCY 13.05 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) conjunctive damage with hemorrhage\n\n2) bilateral hearing loss with 8th cranial nerve\n\ndamage\n\n3) chronic rhinitis\n\n4) liver dysfunction including:\n\na. abnormal LDH\n\nb. abnormal iron metabolism\n\nc. abnormal porphyrin metabolism\n\n5) early renal insufficiency\n\n6) central nervous system dysfunction including:\n\na. cerebellar damage\n\nb. diffuse cerebral damage\n\n7) peripheral nervous system dysfunction\n\n8) immune system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Conjunctival damage with hemorrhage rests on symptoms of irritation of the eyes and soreness in the eyeballs following the exposure to and inhalation of the odors and other Alcolac emissions. That subdiagnosis rests also on the findings at the time of physical examination.\n\n2) Bilateral hearing loss with 8th cranial nerve damage rests on the symptom of loss of hearing acuity as well as on the audiometric test results of loss of hearing throughout the 500 to 6000 range of frequency cycles. The abnormal results represent a neurosensory hearing loss, most severely at the high frequencies with a spread to the lower frequencies.\n\n3) Chronic rhinitis rests on physical findings of mucous membrane irritation following exposure to the Alcolac odors and emissions.\n\n4) Liver dysfunction including abnormal LDH, abnormal iron metabolism, abnormal porphyrin metabolism, rests on abnormal results of the tests of these functions of the liver. The heptacarboxylic porphyrin [the cascade at the seventh level of porphrin metabolism] was abnormal, and the coproporphyrin to uroporphyrin ratio was slightly abnormal. The LDH enzyme was abnormally elevated, and suggests liver damage. The serum iron was also abnormal. Since the prophyrins use iron in the production of their chemical and in turn produce an enzyme system, an abnormality in serum iron reflects the abnormal porphyrins and the enzyme system they produce.\n\n5) Early renal insufficiency rests on abnormal laboratory test results. The electrolyte potassium was abnormally low, her uric acid and BUN [blood urea nitrogen] were both elevated. Those conditions represent kidney damage - \"the inability of the kidney to get rid of the poisons.\" They did not represent uremia, but azotemia, a condition short of uremic poisoning.\n\n6) Central nervous system dysfunction including cerebellar damage, diffuse cerebral damage rests on physical findings of increased deep tendon reflexes and the abnormal results of the laboratory tests. A decrease or absence of the deep tendon reflexes are indications of peripheral nerve damage but increased reflexes indicates damage to the central nervous system. [Persons afflicted by stroke, for instance, show increased, rather than decreased, reflexes.] Thus, the increased deep tendon reflexes represent some evidence of damage to the central nervous system - the brain. There were also findings of cerebellar damage. The cerebellum relates to balance and other important bodily functions. The tests included the tandem walk, the Romberg, and other procedures to test the balance. The performance of Dorothy Bradley was abnormal. The toxic chemicals emitted by Alcolac, and already identified, affect the central nervous system and the cerebellar function. The neurobehavioral battery administered by Dr. Garron also established abnormality of function and central nervous system dysfunction. The damage is diffuse and affected attention, memory and other components.\n\nThe witness, Dr. Carnow, discounted the significance to this subdiagnosis of the prior medical history of a skeletal imaging study on January 4, 1978 at the local hospital of the right parietal bone to explore for possible metastasis. There was concern that there was a tumor, but it was determined, rather, that there was simply a thickening of the parietal bone without pathology. The range of abnormalities found by Dr. Garron - problems in attention, expressive and receptive language, manual dexterity, memory - have nothing to do with the parietal bone, nor do the cerebellar abnormalities found of poor balance and poor taxia. The brain damage was attributed to the effect of the Alcolac emissions.\n\n7) Peripheral nervous system dysfunction rests on findings of weakness in the left leg nerve. The evidence of neuropathy was a decreased vibration in the left ankle and an abnormal response to pain in the left upper leg - the peroneal area. The subdiagnosis was not related to any condition of degenerative joint disease attributable to age because it was the nerve which was found to be abnormal, and not the joint. The degenerative lesion in the left wrist found on physical examination might be a reflection of age, but neither that nor any other musculoskeletal abnormality was diagnosed as related to her exposure to Alcolac.\n\n8) Immune system dysfunction rests on the abnormal test results of the 1984 Bioscience immune panel and of the 1985 Midwest/Wheeler immune panel.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune System:\n\nWhite Blood Cells: slight abnormality of basophils\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune System:\n\nLymphocytes: abnormal OKT-4 cells\n\nabnormally elevated OKT-10\n\ncells at 28.3 [normal, 0 to 15]\n\nabnormally elevated T-4/T-8 ratio\n\n[helper to suppressor cells out\n\nof balance] at 4.04 [normal,\n\n1.1 to 2.5]\n\nHematologic System: abnormal cell size\n\nabnormal cell shapes\n\nThese abnormalities of red blood cell production reflect the abnormal porphyrin metabolism which produces the heme for the red blood cells as well as the abnormal serum iron metabolism, also involved in the production of the red blood cells in the body.\n\nPROGNOSIS: Very guarded.\n\nAMBER CROSS AGE 11 LIFE EXPECTANCY 71.06 YEARS\n\nDIAGNOSIS Chronic Systemic Intoxication caused by the Alcolac\n\ntoxic chemicals with damage to multiple organ systems\n\nincluding:\n\n1) chronic bilateral conjunctivitis\n\n2) chronic rhinitis and sinusitis\n\n3) chronic bronchitis\n\n4) liver dysfunction including:\n\na. abnormal porphyrin metabolism\n\nb. probable chemical hepatitis\n\n5) gastrointestinal dysfunction [possible\n\nporphyria crisis]\n\n6) chronic genitourinary disease\n\n7) immune system dysfunction\n\n8) central nervous system dysfunction\n\n9) chronic recurrent dermatisis from probable\n\nchemical contact with possible hypersensi-\n\ntivity or allergic components\n\nThe witness than explained the data on which the sub-elements of diagnosis rest:\n\n1) Chronic bilateral conjunctivitis rests on red, irritated eyes and blurred vision following exposure to the Alcolac odors and emissions and evident on physical examination.\n\n2) Chronic rhinitis and sinusitis rests on symptoms of dry, burning nose over a long period of time and findings of nose irritation and swelling and inflamed sore throats.\n\n3) Chronic bronchitis rests on symptoms of a productive cough, hemoptysis [coughing up blood] from exposure to the Alcolac chemicals and induced by inhalation of the odors and emissions.\n\n4) Liver dysfunction including abnormal porphyrin metabolism, probable chemical hepatatis rests on abnormal results from the porphyrin, enzyme and prothrombin time tests of the liver functions. It rests also on the physical finding of tenderness over the right upper quadrant, the site of the liver, which suggested a swollen liver. The coproporphyrin, heptacarboxylic porphyrins and prophobilinogens were abnormal. Two live enzymes were abnormal - the alkaline phosphatase and the LDH. In a growing person, such as eleven year old Amber Cross, the alkaline phosphatase can be somewhat elevated, but her count was twice that of normal. The chemical exposures accounted for that abnormality. A young person, such as Amber Cross, on the threshold of womanhood and menstruation, who has been exposed to the kind of toxic chemicals which affect the P450 enzymes [as do the Alcolac chemicals already identified] is subject to serious crises. The prothrombin time function of the liver also tested abnormally, 44 as to a normal of in excess of 70. It was retested, once again with abnormal result.\n\n5) Gastrointestinal dysfunction [possible porphyria crisis] rests on symptoms of recurrent vomiting, constipation, stomach inflammation and other abdominal and stomach problems characteristic of porphyria crises which occur when porphyrins \"go out of whack.\" The subdiagnosis was qualified as \"possible\" because some of these symptoms and manifestations are effects of the nervous system not attributed to the Alcolac emissions. The exposure to the toxic chemicals, however, is the dominant causal factor in her organ dysfunctions.\n\n6) Chronic genitourinary disease rests on the urinalysis result of pus cells in the urine - a manifestation of urinary tract infection. That condition was consistent with the depression of her immune system which renders her more susceptible to viral infection. The prior medical history taken of Amber Cross notes an entry dated February 24, 1978, of dysuria - the difficult or painful discharge of urine. In response to the cross-examination inquiry as to whether that indicated a condition which pre-existed the Alcolac activity, the witness agreed that if Alcolac had emitted no chemical compounds before that date that the genitourinary disease would have to be considered nonattributable to Alcolac. It was the clear evidence, however, that Alcolac undertook test runs as early as 1977 to ensure proper reactor and equipment function when regular production commenced in May of 1978. The medical history of many of the patient plaintiffs [Dr. Carnow observed] disclosed \"an abrupt onset of symptoms, some of them early in 1978.\" The witness concluded that the chronic genitourinary disease was not \"a pre-existing lesion\" but rather was caused by the toxic chemicals identified and known to target the human kidneys.\n\n7) Immune system dysfunction rests on the abnormal results of the immune panels administered by Bioscience in 1984 and by Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nWhite blood cells: abnormally elevated total lymph-\n\nocytes\n\nabnormally depressed segs [an\n\nabnormal ratio since the segs\n\nare usually higher than the\n\nlymphocytes]\n\nHematologic System: abnormally elevated platelet\n\ncount at 485,000\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormal white blood cell count\n\nabnormally elevated OKT-8 [sup-\n\npressor] cells at 1492\n\n[normal, 140 to 1444]\n\nabnormal - slightly depressed -\n\nOKT-4 cells at 31\n\n[normal 32 to 55]\n\nvery abnormal OKT-10 cells at\n\n35.2 [normal, 0 to 15]\n\nabnormal T-4 to T-8\n\n[helper to\n\nsupressor] ratio\n\nabnormal elevation in natural\n\nkiller cells\n\nHematologic system: abnormally elevated platelet\n\ncount anisocytosis\n\nabnormal random distribution\n\nThe abnormalities in the immune system had progressed from two in 1984 to six in 1985. Also the abnormality in the platelet count of the red blood system continued and two other abnormalities were tested.\n\n8) Central nervous system dysfunction rests on the abnormal results of the neurobehavioral battery administered to her by Dr. Garron. In that report the examiner rendered the evaluation that the \"intellectual and cognitive functioning\" of Amber Cross was \"unremarkable except for erratic concentration,\" a \"mild impairment in concentration suggests impulsivity, often associated with delinquency and conduct disorders.\" The examiner commented that these \"general characteristics seem to reflect familial instability in Amber's background.\" In response to the inquiry of the cross-examiner as to whether the subdiagnosis of central nervous dysfunction rests on the neuropsychological report of Dr. Garron, the witness explained that the tester merely conducts the examination and enters a report, but only he - Dr. Carnow - evaluates the report, as he does all others [laboratory, history, and other data as to each of the patient plaintiffs]. Dr. Carnow amplified that neuropsychological tests report other abnormalities: a moderately poor digit span test, and erratic reaction time test, unusual errors of commission on the coding and underlining test. The entire history of the child, her physical symptoms of vomiting and inflammation of the stomach and defections in other organs following exposure to the Alcolac chemicals, her academic decline from a superior student to a below average student - abnormalities and data Dr. Garron could not have known since he did not have the history information known to Dr. Carnow - require the Conclusion that the stress imposed by exposure to the toxic chemicals from Alcolac account for the central nervous system damage found in Amber Cross. That subdiagnosis remains valid, Dr. Carnow explained, albeit the personal disorders exhibited by Joyce Pryor, the mother of Amber Cross may have induced emotional stress in the child.\n\n9) Chronic recurrent dermatitis from probable chemical contact with possible hypersensitivity or allergic components rests on symptoms and episodes of skin irritations and rashes which develop quickly after exposure to the Alcolac odors, vapors and emissions and then spread over her arms, legs, chest and back.\n\nThe evaluator concluded that because of her youth, and because of exposure to Alcolac toxic carcinogens, and given the abnormal immune system dysfunction and the abnormal porphyrin metabolism, the probability that Amber Cross would die from some disease of the organ other than cancer is unlikely.\n\nPROGNOSIS : Very guarded to poor.\n\nCLARENCE ELAM AGE 64 LIFE EXPECTANCY 17.89 YEARS\n\nDIAGNOSIS: Chronic systemic Chemical Intoxication caused by\n\nAlcolac toxic chemicals with damage to multiple\n\norgan systems, including:\n\n1) chronic chemical conjunctivitis\n\n2) bilateral neurosensory hearing loss with\n\n8th cranial nerve damage\n\n3) chronic rhinitis and sinusitis\n\n4) abnormal liver metabolism with abnormal porphyrins\n\n5) peripheral neuropathy\n\n6) musculoskeletal dysfunction\n\n7) probable renal insufficiency\n\n8) severe immune dysfunction with suppression\n\n9) possible central nervous system damage\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic chemical conjunctivitis rests on symptoms of reddened, burning and watery eyes following exposure to the Alcolac odors and emissions, with matting of the eyes during sleep at night.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on symptoms of tinnitus and decreased acuity and on the abnormal results of the audiometric test. The right and left ears had a 70 decibel loss at the 300 frequency cycle and a 50 decibel loss at both the 4000 and 6000 frequency cycles. The neurosensory loss was evaluated as \"moderately severe\" and very significant.\n\n3) Chronic rhinitis and sinusitis rests on symptoms and findings of mucous membrane irritation and sore throat from the Alcolac odors and emissions.\n\n4) Abnormal liver metabolism with abnormal porphyrins rests on test results of the liver metabolism which disclosed three abnormalities: the coproporphyrins were very elevated at 171 [normal, 10 to 109], the porphobilinogen was abnormal, and the pentacarboxylic [the fifth cascade of porphyrin metabolism] was abnormally high at 7 [normal, 0 to 4]. These represented \"a gross disturbance of porphyrins is very worrisome,\" and amounts to a severe breakdown of a major organ.\n\n5) peripheral neuropathy rests on symptoms of weakness in both arms and the result in the PNVC sensory test which showed an abnormal nerve conduction in the right arm.\n\n6) Musculoskeletal dysfunction rests on symptoms of joint stiffness, leg weakness and joint aches.\n\n7) Probable renal insufficiency rests on symptoms of nocturia and pain in urination and on the abnormally elevated BUN [blood urea nitrogen] and abnormally depressed potassium test results. The BUN, the evaluator explained, is the amount of nitrogeneous waste in the body, and when that begins to elevate, it means the body is not getting rid of the waste through the kidneys. It may be a sign of early kidney insufficiency. On cross-examination, the witness was asked to explain the medical history related by Clarence Elam to the examiners under the KU protocol that he has had urgency since childhood due to a small bladder. Dr. Carnow responded that he was given no such history, and in any event, a small bladder might account for urgency, but not nocturia - the abnormal need to empty the bladder. The reason some people have frequency of urination, he explained, is not because the bladder is small or large, but because they do not empty it. Cross-examination noted also a medical record from January of 1971 which indicated a BUN of 21%, with the normal range of 8 to 20%. Dr. Carnow acknowledged that the finding indicated a mildly elevated BUN at that time, but that since the BUN is now 27%, not 21%, the present condition represents a probable renal insufficiency. Dr. Carnow acknowledged that the creatinine was normal when tested, but that means that the kidney is going into failure - a more serious damage than renal insufficiency, the damage the BUN insufficiency connotes. Insufficiency, the witness explained, means the organ does not function as it should, note that \"it is in failure or that he is going to die from it.\"\n\n8) Severe immune dysfunction rests on the abnormal results of the immune panel tests conducted by Bioscience laboratory in 1984 and the Midwest/Wheeler laboratory in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormally depressed at gamma M\n\n61 [normal 80 to 310]\n\nMitogen challenge: abnormal PHA stimulation net CPM\n\nabnormal PHA stimulation index\n\nabnormal CON A stimulation net\n\nCPM\n\nabnormal CON A stimulation index\n\nabnormal PWM stimulation net CPM\n\nabnormal PWM stimulation index\n\nWhite blood cells: abnormally increased segs\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormality\n\nHematologic system: abnormal sizes\n\nabnormal random distribution\n\nwidth\n\nabnormal mean corpuscular hemo-\n\nglobin\n\nThese composite tests show that all of the mitogens were abnormal. In addition, the gamma M was quite abnormally depressed. Dr. Carnow concluded that the immune system was \"zapped.\" The results indicate that an abnormal number of the T cells were not programmed to attack an enemy - and so were useless, \"just hanging around.\" He attributed that abnormality to damage to the lymphatic tissue caused by the toxic chemicals from Alcolac which are metabolic poisons. He explained that since the memory T cells live for fifteen or twenty years, when they are poorly programmed and have not been educated to recognize an enemy, they remain useless and contribute to the depression of the immune system. The immune system, Dr. Carnow iterated, was \"wiped out.\"\n\n9) Possible central nervous system damage rests on symptoms of headache, tremor, dizziness and decreased concentration or memory loss.\n\nIt was the medical opinion of the expert evaluator that the two severe breakdowns in two major organ systems - porphyrins and the immune system - render Clarence Elam susceptible to pneumonia and many other more serious diseases.\n\nPROGNOSIS: Poor.\n\nBETTY ELAM AGE 59 LIFE EXPECTANCY 25.10\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic bilateral conjunctivitis with probable\n\niritis\n\n2) chronic rhinitis\n\n3) neurosensory hearing loss - mild, with 8th cranial\n\nnerve damage\n\n4) chronic chemical bronchitis with obstruction and\n\nbronchospasm\n\n5) vascular insufficiency\n\n6) liver dysfunction including:\n\na. abnormal lipid metabolism\n\nb. abnormal protein metabolism - in remission\n\nc. abnormal prothrombin time - in remission\n\nd. abnormal iron metabolism\n\n7) genitourinary dysfunction including\n\na. possible neurologic deficit\n\nb. abnormal electrolytes\n\n8) central nervous system dysfunction including\n\na. cerebellar dysfunction\n\nb. severe anxiety (aggravated)\n\nc. possible cerebral dysfunction\n\n9) peripheral polyneuropathy with progression\n\n10) polymagia and polyarthralgia\n\n11) immune system dysfunction\n\n12) chronic contact dermatitis with probable hyper-\n\nsensitivity component\n\n13) chronic gastrointestinal dysfunction with neuro-\n\ngenic component\n\n14) hematologic dysfunction, possibly secondary to\n\npulmonary insufficiency\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic bilateral conjunctivitis with probable iritis rests on symptoms of red, irritated eyes with blurred vision following exposure to the Alcolac odors and emissions.\n\n2) Chronic rhinitis rests on symptoms of nasal congestion, nosebleeds and irritations of the nose following exposure to Alcolac odors and emissions, and also on the physical finding of an irritated mucous membrane.\n\n3) Neurosensory hearing loss - mild, with 8th cranial nerve damage rests on the abnormal audiometric test results which show a hearing loss at the 4000 and 6000 frequencies. This suggests an early hearing loss with some 8th cranial nerve damage.\n\n4) Chronic chemical bronchitis with obstruction and bronchospasm rests on physical findings of hyperresonance [over-inflation] of the lungs - an abnormal difficulty in the expulsion of air from the lungs. The subdiagnosis rests also on symptoms of shortness of breath and hemoptysis [coughing up blood]. The diagnosis of chronic obstructive pulmonary disease from chemical toxicity was entered in the medical records of the Suburban Medical Center in Overland Park, Kansas on September 4, 1981. Dr. Carnow agreed with that diagnosis and attributed that evaluation as well as his own to the inhalation of Alcolac emissions. The prior history shows that Betty Elam has smoked a package of cigarettes a day since she was 18 years of age. Although such a personal regimen could contribute to such a condition of obstruction, Betty Elam does not display the symptoms of such an etiology. Chronic smokers are subject to a class sequence of events, symptoms and stigmata. They begin to cough in the morning, usually in the winter months. Then they cough all year round in the morning, and they bring up phlegm. Then they begin to get serial infections, where they bring up yellow matter. Then they develop obstruction. Betty Elam rarely coughs, and then only when she smells the Alcolac fumes.\n\nNor does her condition represent emphysema - which is a pathologic diagnosis and means the destruction of lung tissue. The x-ray of the lung was normal. Chronic obstructive lung disease, on the other hand, means that the person has difficulty expelling air from the lungs - it is obstructed for some reason. The obstruction can result from irritant chemicals- such as epichlorohydrin, the acrylates, the hydrogen sulfide, among the others. The body tries to reject the irritant chemicals, \"by closing down.\" It may cause a spasm of the air passages or swelling of the air passages. In any event, when the body rejects the chemical irritants, it also rejects oxygen - which is very deleterious to the body functions.\n\n5) Vascular insufficiency rests on physical findings of pallor and diminished peripheral pulses in the lower extremities, her feet. These indicate that the blood vessels were narrowed and that the circulation and blood supply into her legs and feet were abnormal. The designation of the Alcolac chemicals as cause for this vascular insufficiency is interrelated to and explained by the phenomenon that these chemicals interfere with the lipid metabolism and may increase the fats in the body very significantly, and so affect the blood vessels of the body. The laboratory tests of the lipid metabolism, in fact, were abnormal.\n\n6) Liver dysfunction including abnormal lipid metabolism, abnormal protein metabolism [in remission], abnormal prothrombin time [in remission] abnormal iron metabolism rests on the abnormal test results for each of these metabolism functions of the liver. There was an abnormal increase in the heptacarboxylic prophyrins and an abnormal ratio between the coproporphyrins and the uroporphyrins. The abnormal ratio may represent a very early abnormality of the level of the prophyrins, thus the disturbance of ratio is significant even in the absence of an abnormal level of one of the porphyrins. The laboratory test disclosed an abnormally depressed iron metabolism, a dysfunction of the enzyme system in which the porphyrins and iron are involved. The prothrombin time was not successfully taken on the first test, and was not repeated on Betty Elam. The lipid metabolism tested abnormally high for cholesterol at 308 [normal, 140 to 270]. She also had an abnormally elevated LDL [low density lipoprotein, that cholesterol which disfavors health, as contradistinct from HDL, high density lipoprotein, that cholesterol which favors health]. The LDL result was at 243 [normal, 62 to 185], so as to put Betty Elam at \"very high risk to coronary artery disease.\" Her abnormal protein metabolism [presumably inferred from the other results of the liver metabolism functions] was not evident as such and was deemed in remission.\n\n7) Genitourinary dysfunction including possible neurologic deficit, abnormal electrolytes rests on symptoms of difficulty in urination and on the abnormal laboratory test results. There was bacteria in the urine, her creatinine was depressed, as was the potassium.\n\n8) Central nervous system dysfunction including cerebellar dysfunction, severe anxiety , possible cerebral dysfunction rests on symptoms of dizziness, decreased concentration or memory loss, depression, nervousness, ataxia [poor balance] and headaches on physical findings of poor balance, and on a test result of 54 on the Zung anxiety scale on a normal of 0 to 44.\n\n9) Peripheral polyneuropathy with progression rests on symptoms of weakness and sensory abnormalities of the limbs and on abnormal test results. The PNVC disclosed an abnormal nerve conduction in the lower extremity [which signifies damage to the sheath of the nerve], and the abnormal EMG signifies axonal degeneration - the actual death of the nerve fiber.\n\n10) Polymalgia and polyarthralgia rests on symptoms of joint stiffness and crepitance, joint aches and muscular pains and cramps.\n\n11) Immune system dysfunction rests on the abnormal results of the immune panels administered by Bioscience laboratory in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulins: abnormally increased gamma M at\n\n367 [normal, 80 to 310]\n\nMitogen challenge: abnormally depressed CON A stim-\n\nulation index\n\nabnormally decreased CON A net\n\nCPM\n\nWhite blood cells abnormally depressed eosinophils\n\nat 0 [normal, 1 to 5]\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: no abnormality shown\n\nHematologic system: abnormally increased mean cor-\n\npuscular hemoglobin\n\nabnormally increased mean plate-\n\nlet volume\n\nabnormal cell sizes [aniso-\n\ncytosis]\n\n12) Chronic contact dermatitis with probable hypersensitivity component rests on symptoms of rash, itching, bullae and other skin lesions. The other skin lesions were blisters which means that the chemicals - a number of them alkylating agents, and hence \"severe grabbers\" - were in such concentration that they literally burned her skin.\n\n13) Chronic gastrointestinal dysfunction with neurogenic component rests on symptoms and history of vomiting, nausea and anorexia.\n\n14) Hematologic dysfunction, possibly secondary to pulmonary insufficiency rests on the symptoms and findings of pulmonary difficulty and lung abnormality and means that some of the changes in her blood supply may be due to the lack of supply of oxygen.\n\nPROGNOSIS: Very guarded to poor.\n\nMALVA GEHLKEN AGE 65 LIFE EXPECTANCY 20.10 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis and pharyngitis\n\n2) liver dysfunction including:\n\na. enlarged, tender liver with probable hepatitis\n\nb. abnormal lipid metabolism\n\nc. abnormal iron metabolism\n\nd. abnormal porphyrin metabolism\n\ne. abnormal protein metabolism\n\n3) central nervous system damage including\n\na. cranial nerve VII damage\n\nb. cerebellar dysfunction\n\n4) peripheral polyneuropathy\n\n5) immune system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis and pharyngitis rests on symptoms of mucuous membrane irritation, swollen nose, soreness and dryness to the throat following exposure to Alcolac vapors and emissions. The chronic pharyngitis rests also on the physical finding of redness to the throat.\n\n2) Liver dysfunction including enlarged, tender liver with probable hepatitis, abnormal lipid metabolism, abnormal iron metabolism, abnormal porphyrin metabolism, abnormal protein metabolism rests on the physical finding of a tender and enlarged liver as well as on the abnormal results of the tests for the several liver metabolism functions. The porphyrin metabolism was abnormal: the coproporphyrins were at 104 [normal, 3 to 56], the porphobilinogen was abnormal, and the coproporphyrin to uroporphyrin ratio was abnormal. The iron metabolism was very low at 47 [normal, 65 to 175]. The cholesterol was abnormally elevated as was the low density lipoprotein . The subdiagnosis of abnormal protein metabolism rests on tests of the thyroid which show a depressed T3 uptake and an abnormally depressed free thyroxin index. These abnormalities, although of the thyroid, indicated not a hypothryoidism - but that \"something was happening in the liver.\" It signified an abnormality of thyroid binding globulin, a deficiency in the protein metabolism function of the liver.\n\nThe examiner, CCA, suggested to Malva Gehlken that the tests be followed up and, in fact, a month later the thyroid panel was tested again by a pathology laboratory in Columbia, Missouri [under whose auspices is not shown]. The results of the successive tests of the thyroid panel were reported as normal. The witness could not explain the disparate results except to observe that exacerbations and remissions are common with chronic diseases. The witness remarked that the Bioscience Laboratory in Chicago, which conducted the first set of tests, \"is one of the best labs in the world, and they found these abnormalities.\" Bioscience, he emphasized, \"repeats every test that they do, and I don't know why there is a difference between these two tests.\" He reaffirmed the subdiagnosis that the tests show that the protein metabolism function of the liver was abnormal.\n\n3) Central nervous system damage including cranial nerve VII damage, cerebellar dysfunction rests on results of the physical examination. The neurobehavioral test results were normal, but the physical findings of the cerebellar function were grossly abnormal: her tandem walk, gait, Rhomberg response, and the other tests of movement and balance were all abnormal. There were also abnormalities of the muscles of the face, indications of damage to the seventh cranial nerve.\n\n4) Peripheral neuropathy rests on the physical finding of decreased deep tendon reflexes, symptoms of sensory loss in the limbs and the laboratory test of abnormal sensory conduction involving multiple nerves.\n\n5) Immune system dysfunction rests on the abnormal results of the immune panel tests administered by Bioscience laboratory in 1984 and Midwest/Wheeler laboratory in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nWhite blood cells: abnormally elevated total\n\nlymphocytes\n\nabnormally elevated monocytes\n\nabnormally elevated basophils\n\nabnormally depressed segs\n\nabnormally depressed total\n\nwhite cells\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nWhite blood cells: abnormally depressed total white\n\ncells\n\nLymphocytes: abnormally elevated OKT-8 [sup-\n\npressor] cells\n\nabnormal T/4 to T/8\n\nratio\n\nHematologic system: slightly abnormal red cell re-\n\nduction\n\nabnormally elevated hemoglobin\n\nabnormal cell sizes [anisocy-\n\ntosis]\n\nThese test results of depressed white cell counts, elevated lymphocytes and depressed segs signify a suppression of the immune system. The diseased liver, the severe disturbance of the porphyrin system, and the suppression of the immune system - particularly - rendered her survival questionable.\n\nPROGNOSIS: Poor.\n\nDAINIE LANDON AGE 74 LIFE EXPECTANCY 11.26 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystem, including:\n\n1) chronic rhinitis and laryngitis with nasal hemor-\n\nrhage\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic asthmatic bronchitis with\n\nchemical component\n\n4) liver dysfunction including:\n\na. abnormal iron metabolism\n\nb. abnormal porphyrin metabolism\n\n5) genitourinary dysfunction including:\n\na. abnormal phosphorous metabolism\n\nb. hyperuricemia\n\n6) central nervous system dysfunction\n\n7) peripheral polyneuropathy\n\n8) reproductive system dysfunction\n\n9) immune system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis and laryngitis with nasal hemorhage rests on symptoms and findings of mucous membrane irritation and swelling to the nose, soreness and burning of the throat following exposure to odors and other Alcolac emissions, and recurrent nosebleeds with spurts of blood.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on the abnormal audiometric test results which show bilateral hearing loss at the 3000, 4000 and 6000 cycle frequencies. These findings are characteristic of damage to the 8th cranial nerve.\n\n3) Chronic asthmatic bronchitis with chemical component rests on symptoms of shortness of breath and cough and on abnormal test results of the pulmonary function. The forced vital capacity test result was abnormal at 63% of the total instead of the normal, between 70% and 75%. The medical history shows a diagnosis in 1973 for an emphysematous bleb in the upper right lobs. The witness gave opinion, nevertheless, that the diagnosis could not have been accurate since the present x-ray discloses no such irregularity. An emphysemous bleb means destruction of the lung tissue - a condition which does not \"go away.\" The examination and tests reveal no condition of emphysema at the present time.\n\n4) Liver dysfunction including abnormal iron metabolism, abnormal porphyrin metabolism rest on the abnormal test results of these functions of the liver. There were two porphyrin abnormalities: the coproporphyrins were quite elevated at 124 [normal, 10 to 109] and the porphobilinogen was quite elevated at 2.3 [normal, 0 to 1.5]. The iron metabolism was depressed. That abnormality interrelated with the abnormal porphyrin metabolism as well as with the abnormal hematologic findings.\n\n5) Genitourinary dysfunction including abnormal phosphorous metabolism, hyperuricemia [excess uric acid] rest on symptoms of nocturia and abnormal test results. The urinalysis was abnormal, the uric acid was elevated at 9.1 [normal, 4 to 8.5] and the phosphorous was depressed.\n\n6) Central nervous system dysfunction rests on findings of the neurologic examination which indicate damage to the 7th cranial nerve, the nerve which controls the muscles of the face and expression - in his case, a left central facial weakness. There was also an intention tremor, an abnormal neurologic condition. The past history of a \"lazy left eye,\" Dr. Carnow explained, did not impinge on the subdiagnosis that the central nervous system dysfunctions found were caused by exposure to the Alcolac chemicals. The eyes are controlled by the second, third, fourth and sixth cranial nerves. The seventh controls the expressions of the face, and that is the cranial nerve the neurologic examination found damaged.\n\n7) Peripheral neuropathy rests on symptoms of weakness in the limbs, and findings of sensory abnormalities and decreased deep tendon reflexes on physical examination.\n\n8) Reproductive system dysfunction is not explained. The patient plaintiff Dainie Landon could not produce a specimen for fertility analysis, and so there is no basis in the evidence for subelement 8 the DIAGNOSIS delineates.\n\n9) Immune system dysfunction rests on the abnormal results of the immune panels administered by Bioscience Laboratory in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results,, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormally elevated gamma A glob-\n\nulins\n\nabnormally depressed gamma M\n\nglobulins\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated OKT-10 [im-\n\nmature lymphocyte] cells\n\nabnormal T/4 to T/8\n\ncells\n\nvery abnormally elevated [HNM-1\n\nnatural killer] cells at 19%\n\n[normal, 3.8% to 9.6%]\n\nHematologic system: decreased cell pigment [hypo-\n\nchromasia]\n\nmoderately abnormal sizes\n\nabnormally elevated mean cor-\n\npuscular hemoglobin\n\nThe abnormal increase in the OKT-10 cells signifies immature lymphocytes which have not been properly programmed.\n\nPROGNOSIS: Very guarded to poor.\n\nMARY LANDON AGE 71 LIFE EXPECTANCY 15.30 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) recurrent cojunctivitis with possible iritis\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic chemical bronchitis [asthma by history]\n\n4) cardiac dysfunction\n\n5) abdominal cancer\n\n6) liver damage including:\n\na. abnormal protein metabolism\n\nb. chemical hepatitis\n\nc. abnormal porphyrin metabolism\n\n7) chronic genitourinary dysfunction with recurrent\n\ninfection\n\n8) central nervous system damage with cerebral\n\ndysfunction\n\n9) peripheral neuropathy\n\n10) recurrent skin damage with acute chemical burns\n\n11) severe immune suppression [aggravated by radia-\n\ntion therapy]\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Recurrent conjunctivitis with possible iritis rests on symptoms of blurred vision and red, irritated eyes following exposure to the Alcolac odors and emissions.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on the abnormal results on the audiometric tests at virtually every cycle, increased at the high frequencies. The hearing loss was to both ears. On the right, there was a 55 decibel loss at the 6000 cycle, a 40 decibel loss at the 4000 cycle, a 40 decibel loss at the 3000 cycle, and a 30 decibel loss at the 1000 cycle. On the left, the loss at each frequency was comparable and extended to the 500 cycle where there was a 35 decibel loss.\n\n3) Chronic chemical bronchitis [asthma by history] rests on symptoms of chest heaviness and cough productive of phlegm and blood. The [asthma by history] presumably alludes to a datum from the narrative given by the patient plaintiff during the pre-examination interview, but that parenthesis is not explained.\n\n4) Cardiac dysfunction rests on symptoms of chest pain, arrhythemia and on the physical finding of an abnormal pulse rate.\n\n5) Abdominal cancer rests on a diagnosis of colon cancer on February 15, 1984, and the surgical removal of that malignancy at the Bothwell Memorial Hospital in Sedalia, followed by a regimen of cobalt therapy. The diagnosis and surgery were accomplished when Mary Landon presented herself at the Sedalia hospital with complaints of stomach pain and blood in the stool and changed bowel habits over the past two years. It was the opinion of Dr. Carnow, to a reasonable medical certainty, that the exposure to the Alcolac toxicants caused the cancer in Mary Landon. That opinion rests on the carcinogenic qualities of a number of chemical compounds emitted by Alcolac, the past personal, occupational and environmental history of Mary Landon, and the concentration and duration of the exposures to those toxic substances.\n\nMary Landon and her husband Dainie lived on a tract immediately west and directly across the road from the entrance to Alcolac. They commenced to notice odors and fumes in the summer of 1978 which gave off the scent of rotten eggs and sulphur. These odors and emissions were from Alcolac and came regularly. They caused her headaches, stomach upsets, coughs with blood in the sputum, chest aches, a fast heart beat, and a congeries of other immediate physical symptoms and discomforts. They began to keep a diary of the Alcolac emissions with descriptions of the symptoms they induced. They maintained the history until they removed to a mobile home on May 8, 1984, to escape the odors and emissions. They record episodes of foam storms from Alcolac which came onto their property and caused her swelling and blisters upon touch. In April of 1981, she consulted a physician in Columbia for recurrent episodes of nausea, nervousness, and dizziness from which she passed out. He discontinued her numerous medications, except for thyroid, but her symptoms continued and worsened. Many of them were directly related to bad odors. She improved on days when there were no odors from Alcolac. Twice after 1978 she was hospitalized when she passed out.\n\nHer pre-Alcolac medical history included a hospitalization for anemia in 1942. Her spleen was removed and the anemia did not recur. Her father had anemia and an enlarged spleen all his life. Thirteen other members of the family had the spleen removed. It was her understanding, Mary London testified on cross-examination, that the anemia represented a condition of pre-leukemia, and that was the reason the spleen was removed. The medical records show, rather -- as Dr. Carnow explained -- that the anemia was a spherocytosis, a genetic abnormality of the red blood cell whereby the cells become damaged as they pass through the spleen. The remedy is to remove the spleen. It was from that congenital anomaly that the condition of anemia was caused, and it was to allay that anomaly that the spleen was removed from Mary Landon -- and the other family members, and not to allay leukemia. The cogenital anemia, therefore, no more than that two brothers died of cancer, Dr. Carnow explained, could be deemed a contributing cause to the cancer to Mary Landon by the Alcolac carcinogens.\n\nThe cancer found and excised in 1984 was in the gastrointestinal tract. A series of x-rays of the lower tract was done in 1981, and no abnormality or cancer was found. The examination in 1984 did disclose a villous adenoma -- a noncancerous lesion. It was not known how long that was present or whether that also developed from the exposure to the Alcolac chemicals, or whether the chemicals converted that benign condition into a cancer. The subdiagnosis of abdominal cancer caused by the Alcolac toxic chemicals did not rest on any such surmise. It rests rather on the carcinogenic properties of epichlorohydrin, glycidyl ether and dimethyl sulfate -- toxic compounds used and emitted by Alcolac throughout the period of operations since May of 1978.\n\n6) Liver damage including abnormal protein metabolism, chemical hepatitis, abnormal porphyrin metabolism rests on the abnormal results of laboratory tests of these functions of liver metabolism. The porphyrins were abnormal -- a uroporphyria [advanced disease] and coproporphyrin also quite elevated at 98 [normal up to 56]. The enzymes were abnormally elevated -- the SGOT, LDH and alkaline phosphatase. These are enzymes seen when the liver in inflamed and damaged. The abnormal increase in the alkaline phosphatase means that the liver damage is more chronic. The condition represents a chemical type of hepatitis. The abnormality in the protein metabolism was manifested by an elevated gamma globulin.\n\nIn response to cross-examination, Dr. Carnow acknowledged that the alkaline phosphatase and SGOT values from the laboratory tests of February 21, 1984 conducted at the time of the abdominal cancer surgery were within normal limits. He acknowledged also that the radiation therapy following the surgery \"may well have contributed to the enzyme abnormalities,\" although not to the other abnormalities of the liver. He concluded, nevertheless, \"since the radiation was secondary to a cancer which I feel was caused by exposure to cancer-producing chemicals,\" the enzyme abnormalities were a consequence causally related to the exposure.\n\n7) Chronic genitourinary dysfunction with recurrent infection rests on prolonged symptoms of pain on urination, frequency of urination, nocturia, and on the laboratory test results of depressed sodium, depressed potassium and abnormal urinalysis. The symptoms alone suggested renal dysfunction. The witness acknowledged, as before, that the post-operative radiation could account for the abnormal test results, since the pre-radiation laboratory tests of these genitourinary elements were normal. He asserted once again that since the cancer was caused by the Alcolac chemicals, and since the radiation was secondary to that cause, the genitourinary dysfunction -- as manifested by the laboratory tests -- was a direct consequence of the exposure. He iterated, that the test results apart, the recurrent and prolonged symptoms alone suggested renal dysfunction.\n\n8) Central nervous system damage with cerebral dysfunction rests on symptoms of dizziness, decreased concentration, nervousness, sleep disorders, tremor and headache, on the physical finding of increased deep tendon reflexes and on the abnormal results of the neurobehavioral battery. The neuropsychological tests disclosed a mild deficit in recent memory -- a suggestion of mild, diffuse brain dysfunction.\n\n9) Peripheral neuropathy rests on abnormal results in the PNVC, Motor and PNVC, Sensory tests. They demonstrated a slowing of the motor and sensory nerves in the lower left extremity -- the limb measured.\n\n10) Recurrent skin damage with acute chemical burns rests on symptoms of itching, burning to the skin, bullae and skin infections following exposure to the Alcolac odors and emissions.\n\n11) Severe immune suppression [aggravated by radiation therapy] rests on the abnormal results of the immune panel tests conducted by Bioscience laboratory in 1984.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormal G globulin\n\nMitogen challenge: grossly abnormal PHA stimulation\n\nnet CPM\n\ngrossly abnormal PHA stimulation\n\nindex\n\ngrossly abnormal CON A stimulation\n\nnet CPM\n\ngrossly abnormal CON A stimulation\n\nindex\n\ngrossly abnormal PWM stimulation\n\nnet CPM\n\ngrossly abnormal PWM stimulation\n\nindex\n\nWhite blood cells: abnormal increase in total\n\nlymphocytes\n\nThe immune panel test at Bioscience was conducted about six months after Mary Landon concluded the regimen of 40 cobalt treatments post surgery. The results demonstrated grossly abnormal mitogens, as well as the other abnormalities -- and manifested as a \"very severely depressed\" immune system. Dr. Carnow deemed it \"impossible to say\" how much of that manifestation was from exposure to the Alcolac chemicals and how much from the secondary radiation. It was his opinion from the full history, symptoms and test results that exposure to the multiple Alcolac carcinogens depressed the immune function, eventuated in the cancer, and that the radiation further depressed the immune system. Thus, the effects of the radiation are in the sequence of causation. He rendered opinion that given the cancer cells -- still subsistent -- the chemical hepatitis, abnormal porphyrin metabolism, and a very severely depressed immune system, \"her longevity will be very limited.\"\n\nPROGNOSIS: Negative.\n\nMary Landon died in May of 1986 while the appeal pended.\n\nJOHN LAWRENCE AGE 62 LIFE EXPECTANCY 19.34 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic conjunctivitis\n\n2) severe bilateral neurosensory hearing loss with\n\n8th cranial nerve damage\n\n3) chronic rhinitis\n\n4) cardiac dysfunction\n\n5) liver dysfunction including:\n\na. abnormal lipid metabolism\n\nb. abnormal protein metabolism\n\nc. abnormal porphyrin metabolism\n\nd. abnormal iron metabolism\n\n6) reproductive system dysfunction with abnormal\n\nsperm analysis\n\n7) peripheral polyneuropathy\n\n8) polyarthralgia\n\n9) severe immune system depression\n\n10) chronic chemical dermatitis with probable hyper-\n\nsensitivity state\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic conjunctivitis rests on symptoms of red, irritated, blurred and watery eyes following exposure to the Alcolac odors and emissions.\n\n2) Severe bilateral neurosensory hearing loss with 8th cranial nerve damage rests on the abnormal results of the audiometric tests. He was almost totally deaf at a number of frequencies. On the right ear was a 85 decibel loss at 3000 cycles, a 40 decibel loss at 2000 cycles, a 30 decibel loss at 1000 cycles and a 30 decibel loss at 500 cycles. On the left ear, the decibel loss was comparable at each frequency cycle. The findings signify destruction of the 8th cranial nerves, a condition not meliorated by a hearing aid. The hearing loss pattern was characteristic of chemical intoxication of the 8th cranial nerves, and uncharacteristic of loss of hearing due to age .\n\n3) Chronic rhinitis rests on symptoms of irritated nose and sneezing following exposure to the Alcolac odors and emissions and on the physical finding of mucous membrane irritation.\n\n4) Cardiac dysfunction rests on the physical finding of diminished peripheral pulse and an abnormal conduction on an EKG tracing.\n\n5) Liver dysfunction including abnormal lipid metabolism, abnormal protein metabolism, abnormal porphyrin metabolism, abnormal iron metabolism rest on the abnormal results of the tests of these functions of liver metabolism. The lipid metabolism showed an abnormally elevated triglycerides and an abnormal phenotype [hyperprebeta lipoproteinemia, an abnormal pattern of body fats]. The iron metabolism was depressed -- which represents an abnormality in the enzyme system.\n\nThere was no explanation, by test rest or other diagnostic basis, for the abnormal protein metabolism or abnormal porphyrin metabolism components of the subdiagnosis -- and we assume that entry of those manifestations within the Chronic Systemic Chemical Intoxication diagnosis rendered for John Lawrence was mistaken.\n\n6) Reproduction system dysfuction with abnormal sperm analysis rests on the results of the fertility test. John Lawrence and Gwendolyn Lawrence, along with Betty Elam and Charlotte Phillips were the four among the patient plaintiffs who were examined and tested twice at CCA, once in 1983 and then in 1984. On the 1983 occasion, John Lawrence was not able to produce a specimen, so there was no fertility analysis. On the 1984 occasion, the specimen produced showed a markedly depressed count -- a total count of 14.8 million [normal, above 60 million]. Thirty-five percent of the sperm were abnormal, a percentage higher than is normally found. The very low overall count as well as the very high count in abnormal morphology unquestionably constitutes a reproductive system dysfunction, the evaluator concluded. It represents as well, Dr. Carnow explained, damage to the testicular function. That derangement of function was explained as the action of epichlorohydrin and some of the other Alcolac toxic chemicals on the P450 enzyme system. That enzyme system is particularly active in the functions of high energy systems such as the brain, kidney and formation of the sperm. The abnormality of function caused to the P450 enzyme system by these chemicals affects the reproductive function. In addition, chemicals such as epichlorohydrin are alkylating agents which grab tissue -- protein -- and destroy the cells. Dr. Carnow testified that testicular atrophy from these chemicals has been demonstrated in animal studies.\n\nThe witness responded to cross-examination that the medical record of July 12, 1977 of a benign prostatic hypertrophy merely indicates an enlarged prostate and has no significance for the reproductive system. The only function of the prostate in reproduction is to secrete an alkaline fluid to nurture the sperm for the three days it takes for the journey to fertilize the egg. The production of the sperm takes place in the testicle, not in the prostate, thus an enlarged prostate does not bear on the subdiagnosis of reproductive system dysfunction.\n\n7) Peripheral polyneuropathy rests on the symptoms of leg cramps and other sensory abnormality as well as on the finding of abnormally decreased deep tendon reflexes upon the second physical examination in 1984. The first examination of the deep tendon reflexes in 1983 was normal, as were the nerve conduction velocity tests . The second EMG was also normal, but on the second physical examination, the deep tendon reflexes at both biceps, both triceps and both wrists were abnormal. That suggested that John Lawrence had developed these peripheral neuropathic findings. That the two tests were conducted by two different examiners, the first by an occupational medicine physician and the second by a neurologist, does not bear on the validity of each finding, although different, where the examiners -- as here -- are both skilled.\n\n8) Polyarthralgia rests on symptoms of recurrent muscle pains after exposure to the Alcolac odors and emissions.\n\n9) Severe immune system depression rests on the abnormal results of the immune panel tests conducted by Bioscience laboratory in 1984 and Midwest/Wheeler laboratory in 1985.\n\n[Bioscience Laboratory Test Results 1984]\n\nImmune system:\n\nImmunoglobulin: abnormal gamma M at 76 [normal,\n\n80 to 310]\n\nMitogen challenge: abnormal PHA stimulation index at\n\n102 [normal, over 130]\n\nabnormal PHA stimulation net CPM\n\nat 25,000 [normal, over 62,000]\n\nabnormal CON A stimulation index\n\nat 37 [normal, over 40]\n\nabnormal CON A stimulation net\n\nCPM at 9000 [normal, over\n\n12,000]\n\nabnormal PWM stimulation index at\n\n18 [normal, over 20]\n\nabnormal PWM stimulation net CPM\n\nat 4400 [normal, over 8000]\n\nWhite blood cells: abnormal basophils, slightly in-\n\nincreased\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormal increase of NKH-1\n\n[natural killer] cells\n\nHematologic system: abnormal increase in platelet\n\nvolume\n\nThe first examination at CCA revealed an immune system only \"slightly abnormal.\" The second examination a year later found the immune system \"completely zapped.\" The mitogen challenges were all abnormal, the immunoglobulin was abnormal, and additionally, the subsequent Midwest/Wheeler results in 1985 [which tested a different function] disclosed the additional result of an abnormal increase in the natural killer cells of the immune system. That system Dr. Carnow described as effectively \"wiped out.\" The destruction of the immune systems of both John Lawrence and Gwendolyn Lawrence [as we soon note] is explained by the heavy exposure over the period of years to the Alcolac toxic chemicals by persons in the near vicinity.\n\n10) Chronic chemical dermatitis with probable hypersensitivity state rests on symptoms of rash, itch, hives , skin infections and other skin lesions following exposure to the Alcolac odors and emissions.\n\nThe evaluator concluded that the damage to the liver, extensive peripheral neuropathy and severe immune system depression suggest continued deterioration and result in a considerably shortened life.\n\nPROGNOSIS: Poor.\n\nGWENDOLYN LAWRENCE AGE 64 LIFE EXPECTANCY 20.92 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) mucous membrane irritation of the eyes, nose and\n\nthroat\n\n2) chronic chemical bronchitis\n\n3) cardiac dysfunction with arrythmias\n\n4) chronic gastroenteritis (central nervous system\n\ncomponent)\n\n5) Liver dysfunction including\n\na. possible chemical hepatitis with abnormally\n\nelevated LDH\n\nb. abnormal iron metabolism\n\nc. probable abnormal porphyrin metabolism\n\n6) possible obstructive uropathy with episodic\n\nbleeding\n\n7) central nervous system dysfunction including:\n\na. cerebellar damage\n\nb. cerebral damage with deterioration\n\nc. severe anxiety\n\n8) peripheral polyneuropathy\n\n9) hypothryoidism\n\n10) musculoskeletal dysfunction with myositis\n\n11) severe suppression with marked deterioration\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Mucous membrane irritation of the eyes, nose and throat rests on symptoms of red, irritated eyes with blurred vision, irritated nose and nosebleeds with soreness of the nose, burning and irritation of the throat following exposure to the Alcolac odors and emissions.\n\n2) Chronic chemical bronchitis rests on symptoms of shortness of breath, constant hacking cough which produces sputum streaked with blood. As is characteristic of a chronic disease, the intensity of the symptoms as well as of the discharge varied from time to time.\n\n3) Cardiac dysfunction with arrythmia rests on symptoms of chest pain and arrythmia following exposure to the Alcolac odors. It rests also on the physical finding of abnormal heart rhythm, a condition of heart muscle irritation induced by the Alcolac toxic agents.\n\n4) Chronic gastroenteritis [central nervous system component] rests on symptoms of vomiting and nausea which started in late 1978, became most intense in 1982, and then less frequent during that year. The symptoms followed after the inhalation of the Alcolac odors for several days. That manifestation of gastroenteritis was related -- Dr. Carnow concluded -- to an automatic nervous system component which caused her to vomit. In response to the cross-examination that a medical record of 1974 suggests a subsistent hiatal hernia, the witness responded that a vomiting upon the inhalation of a toxic chemical is \"a very common reaction when the central nervous system is assaulted by a toxic agent.\" It is not a symptom of hiatal hernia, which simulates an ulcer after a person who has one ingests food. It relates neither to smell nor to severe vomiting -- the symptoms Gwendolyn Lawrence experienced and described.\n\n5) Liver dysfunction including possible chemical hepatitis with abnormally elevated LDH,.abnormal iron metabolism, probable abnormal porphyrin metabolism rests on the abnormal laboratory test results of these functions of the liver. There was one abnormal porphyrin: the heptacarboxylic was depressed at 1 [normal, 3 to 9]. The enzyme LDH was abnormally elevated. The iron metabolism was quite depressed at 38 [normal, 65 to 175].\n\n6) Possible obstructive uropathy with episodic bleeding rests on symptoms of frequent urination in nocturia, foul urine smell and on the abnormal urinalysis.\n\n7) Central nervous system dysfunction including cerebellar damage, cerebral damage with deterioration, severe anxiety rests on symptoms of dizziness, sleep disorders, poor balance , and headache and on findings of physical examination and on the abnormal results of the Zung anxiety scale. Gwendolyn Lawrence was among those examined at CCA in 1983. The neurological tests on that occasion disclosed abnormal tandem walk and position sense -- cerebellar dysfunctions. The subsequent test in 1984 was normal for those functions, but her symptoms continued. She still staggered when she walked and could no longer ride a bicycle because of imbalance. Her Zung anxiety scale was moderately high at 53 [normal, 0 to 43].\n\n8) Peripheral polyneuropathy rests on symptoms of sensory abnormalities of tingling, numbness, pins and needles in the hands and of weakness, on the finding on physical examination in 1984 at CCA of weakness in the hand, and abnormal nerve conduction tests, both motor and sensory on the lower left [PNVC, motor, PNVC, sensory]. These demonstrated depressed nerve function at the lower extremity. The examinations, symptoms and tests conducted in 1984 demonstrated \"a very considerable deterioration of her peripheral nervous system\" since the 1983 evaluation.\n\n9) Hypothyroidism rests on abnormal T3 uptake and FT index tests of the thyroid component of the endocrine system. This manifestation represented both a thyroid binding globulin abnormality, but also some hyperthyroidism -- as the physical finding of a slightly enlarged thyroid suggests.\n\n10) Musculoskeletal dysfunction with myosis rests on the symptoms of muscular cramps, joint stiffness and aches following exposure to the Alcolac odors as well as on an abnormal CPK test result. CPK is an enzyme which becomes abnormal when acute inflammation of the muscle is present. Her CPK was abnormally elevated at 99 [normal, up to 60].\n\n11) Severe immune suppression with marked deterioration rests on the abnormal results from three series of tests, Bioscience laboratory in 1983, Bioscience laboratory in 1984, Midwest/Wheeler in 1985:\n\n[Bioscience Laboratory Test Results, 1983]\n\nMitogen challenge: abnormally low PHA stimulation\n\nnet CPM at 30,785 [normal, over\n\n62,000]\n\nabnormally low PHA stimulation\n\nindex at 71 [normal, over 130]\n\nabnormally low CON A stimulation\n\nnet CPM at 8532 [normal, over\n\n12,000]\n\nabnormally low CON A stimulation\n\nindex at 20 [normal, over 40]\n\nabnormally low PWM stimulation\n\nnet CPM at 7504 [normal over\n\n8000]\n\nabnormally low PWM stimulation\n\nindex at 18 [normal, over 20]\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nMitogen challenge: abnormally low PHA stimulation\n\nnet CPM at 1200\n\nabnormally low PHA stimulation\n\nindex at 6\n\nabnormally low CON A stimulation\n\nnet CPM at 144\n\nabnormally low CON A stimulation\n\nindex at 2\n\nabnormally low PWM stimulation\n\nnet CPM at 359\n\nabnormally low PWM stimulation\n\nindex at 2\n\nWhite blood cells: abnormally low total lymphocytes\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nHematologic system: abnormally depressed mean corpus-\n\ncular hemoglobin\n\nabnormally elevated platelet\n\nvolume\n\nanisocytosis [abnormal shapes]\n\nhypochromasia [abnormal color]\n\nDr. Carnow interpreted these laboratory results as an immune system in progressive and \"terrible\" deterioration, a system in \"total suppression\" -- even worse than that of Mary Landon after the course of radiation for her cancer. The antigens introduced to the immune system cells on the mitogen challenges, Dr. Carnow explained, are expected to be seen as enemies and attacked. The PHA antigen is one that the killer cells attack -- so the PHA count suggests a virtually nonexistent killer cell population [at 1200 with the normal over 62,000]. The poke weed mitogen tests the B lymphocytes, and the count of the response to that antigen suggests a lack of function of those cells. CON A generally relates to the helper cells function, and the stimulation net at 144 [normal over 12,000] and stimulation index at 2 [normal, over 40] demonstrates that the entire immune system is irreparably suppressed.\n\nPROGNOSIS: Poor.\n\nGLENN MILLER AGE 54 LIFE EXPECTANCY 25.51 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic bilateral conjunctivitis\n\n2) chronic rhinitis\n\n3) liver dysfunction including:\n\na. abnormal lipid metabolism\n\nb. abnormal porphyrin metabolism including\n\ncoproporphyrin and porphobilinogen\n\n4) genitourinary system dysfunction with infection\n\n5) reproductive system dysfunction\n\n6) central nervous system damage with diffuse brain\n\ndysfunction\n\n7) peripheral neuropathy\n\n8) immune system dysfunction with suppression\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic bilateral conjunctivitis rests on recurrent symptoms of red, irritated eyes following exposure to the odors and fumes from Alcolac, and on reddened conjunctiva on physical examination. The physical findings are indications that the chronic assault of these toxic substances has undermined the power of the body to repair the damage.\n\n2) Chronic rhinitis rests on symptoms of nosebleed and on the findings of reddened, swollen mucosa and of exudate in the nose upon physical examination.\n\n3) Liver dysfunction including abnormal lipid metabolism, abnormal porphyrin metabolism, including coproporphyrin and porphobilinogen rests on abnormal results of laboratory tests of those liver metabolism functions. There were two abnormal porphyrins: the coproporphyrin was quite high at 130 [normal, up to 110], and the porpobilinogen was increased to 2.3. The triglycerides test was high and represents an increase in abnormal lipid metabolism.\n\n4) Genitourinary system dysfunction with infection rests on a urinalysis which disclosed pus cells. The test was repeated by a private physician, which also disclosed infection, and Glenn Miller was bedridden and tested.\n\n5) Reproductive system dysfunction rests on the fertility analysis results of multiple abnormalities in sperm count, percent activity and morphology. The activity of the sperm after 30 minutes was slightly decreased from 80% to 75%. The count at 39.6 million was low even as compared with the marginal minimum count of 60 million. Also, 45% of the sperm were abnormal -- an unduly large count.\n\n6) Central nervous system damage with diffuse brain dysfunction rests on abnormal results of the neurobehavioral battery. It is characteristic of toxic depression of the brain function [although toxic agents can induce a focal lesion] that the damage is not localized. The pattern disclosed by the neurobehavioral battery is of perceptional deficits, attentional deficits, perceptual motor function and problem solving -- clinically significant indicia of diffuse brain malfunction.\n\n7) Peripheral neuropathy rests on symptoms of weakness of the limbs and sensory abnormalities -- tingling and numbness and on the findings of physical examination of absent deep tendon reflexes and sensory abnormalities.\n\n8) Immune system dysfunction with suppression rests on the abnormal results of the tests conducted by Bioscience laboratory in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results,1984]\n\nImmune system:\n\nMitogen challenge: an abnormal PHA stimulation net\n\nCPM at 59,000 [normal, over\n\n62,000]\n\nWhite blood cells: abnormally depressed eosingophil\n\nat 0\n\nabnormally depressed white cell\n\ncount at 4300 [normal, 4500 to\n\n11,000]\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated OKT-10 cells\n\nat 27 [normal, 0 to 15]\n\nabnormally elevated NKH-1 cells\n\nat 14.9 [normal, up to 9.6]\n\nHematologic system: abnormally elevated mean corpus-\n\ncular hemoglobin\n\nabnormally elevated mean platelet\n\nvolume\n\nThe evaluator explained that NKH-1 cells, killer cells, also measure other suppressor cells, as does the OKT-10, both show marked elevation, and hence present a \"very abnormal\" immune dysfunction. The patient plaintiff, Glenn Miller, was advised by CCA to avoid further exposure to chemicals, take care about exposure to viral or fungal infections since the low T-lymphocyte function the tests disclosed make him more susceptible to such disease. He was also warned to avoid certain drugs which might precipitate a porphyria attack.\n\nIt was elicited on cross-examination that in November of 1980 the patient plaintiff Glenn Miller was received at the Bothwell Memorial Hospital in Sedalia with complaints of headache and nausea from the use of bug spray at the school where he worked. A later entry in the medical record book indicated that his sense of well-being was restored when the exposure ceased. Dr. Carnow was asked whether the occupational exposure to he bug spray explained or impinged on any of the problems diagnosed for Glenn Miller. The response was that the symptoms described in the hospital records were those from an episode of acute exposure and subsided when the exposure ceased. The bug sprays in the schools serviced by Glenn Miller use pyrethrums or other such substances which, although they may cause headache, are not very toxic. However, the organ damage and disease diagnosed for Glenn Miller -- Dr. Carnow explained -- are not from a single exposure nor from a chemical agent of only mild toxicity. They are from chronic exposures over many nights and for very long periods of time and by agents of severe toxicity -- such as epichlorohydrin. The exposure to the school spray -- even for a year and a half, as the medical record indicates -- could not account for the multiple organ damage found in Glenn Miller. That is so even if the actual spray chemical and the extent of the exposure was known. His medical history and complaints indicate that Glenn Miller has felt no better even after the exposure to the bug spray ceased. He continues to lack energy and vitality that he enjoyed before the Alcolac emissions, and he continues to relate these and other symptoms to the exposure to the Alcolac toxic agents.\n\nPROGNOSIS: Very guarded.\n\nBERNICE MILLER AGE 54 LIFE EXPECTANCY 29.51 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic bilateral conjunctivitis\n\n2) bilateral hearing loss with probable neurosensory\n\ncomponent\n\n3) chronic rhinitis and pharyngitis\n\n4) liver dysfunction including:\n\na. abnormal porphyrin metabolism including uropor-\n\nphyrin, coproporphyrin and porphobilinogen\n\n5) peripheral neuropathy\n\n6) immune system dysfunction\n\n7) hypertension -- mild\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic bilateral conjunctivitis rests on symptoms of red, irritated and blurred eyes following exposure to the Alcolac odors and the physical finding of edematous conjunctiva.\n\n2) Bilateral hearing loss with probable neurosensory component rests upon the audiometric test results which were abnormal at very frequency for both ears -- except at the 2000 frequency, where the hearing at the right ear was abnormal, but normal at the left ear. The neurosensory loss ranges at 45 decibels at the 3,000, 4,000 and 6,000 cycle frequencies, and a 35 decibel loss at the 500, 1,000 and 2,000 cycle frequencies. The results represent neurosensory loss extended to the lower frequencies -- an 8th cranial nerve damage.\n\n3) Chronic rhinitis and pharyngitis rests on symptoms of nose irritations and soreness in the throat following exposure to the Alcolac odors. The chronic rhinitis rests also on the findings upon physical examination of irritated, reddened and swollen mucous membrane with exudate material.\n\n4) Liver dysfunction including abnormal porphyrin metabolism including uroporphyrin, corpoporphyrin and porphobilinogen rests on the multiple abnormal test results of that function of the liver. They show a uroporphyrin at 33 [normal, 4 to 22], a coproporphyrin at 135 [normal, 3 to 56], and a porphobilinogen at 3 [normal, 0 to 1.5] -- three abnormalities along the porphyrin cascade. The uroporphyria signifies a disease somewhat advanced. The iron metabolism, a phenomenon related to the porphyrin abnormalities, was quite depressed at 52 [normal, more than 65].\n\n5) Polyneuropathy rests on symptoms of numbness in both hands and weakness, and on the finding on physical examination of an absent deep tendon reflex in the left ankle.\n\n6) Immune system dysfunction rests on the abnormal results of the tests conducted by Bioscience laboratory in 1984 and Midwest/Wheeler laboratory in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormal globulin A\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally depressed OKT-11\n\n[total T] cells\n\nabnormally increased OKT-10\n\n[unprogrammed lymphocyte]\n\ncells\n\nabnormally increased [natural\n\nkiller] cells\n\nHematologic system: abnormally increased mean plate-\n\nlet volume\n\nIt was the opinion of the evaluator that the test results of abnormal depression of total T cells and abnormally increased natural killer cells signify a suppression of the helper cells, and hence an imbalance between the helpers and suppressors.\n\n7) Hypertension - mild is a subdiagnosis neither evaluated by the witness nor otherwise explained in the evidence, and -- we assume --- was mistakenly entered as a diagnosis.\n\nPROGNOSIS: Very guarded to poor.\n\nJOHN PHILLIPS AGE 58 LIFE EXPECTANCY 22.35 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) bilateral cataracts with recurrent acute conjunc-\n\ntivitis\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic chemical bronchitis with obstruction\n\n4) liver dysfunction including:\n\na. abnormal porphyrin metabolism\n\n5) central nervous system dysfunction with:\n\na. damaged cranial nerves\n\nb. cerebellar damage\n\nc. depression\n\nd. anxiety\n\ne. cerebral damage with particular involvement of\n\nthe right side of the brain\n\n6) severe far-advanced polyneuropathy\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Bilateral cataracts with recurrent acute conjunctivitis rests on symptoms of blurred vision, red, irritated eyes following exposure to the Alcolac odors and emissions. The cataracts were diagnosed from the neurobehavioral tests which detected that John Phillips tended to neglect the left side of his visual space and displayed a mild deficit in visual perception. A workup the year before disclosed retrolental opacities not amenable to treatment.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on the abnormal results of the audiometric tests of both ears at the 3000, 4000 and 6000 cycle frequencies. On the right, there is a 65 decibel loss at 3000 cycles, 75 decibel loss at 4000 cycles and 70 decibel loss at 6000 cycles. On the left, there is a 60 decibel loss at 3000 cycles, 80 decibel loss at 4000 cycles and 70 decibel loss at 6000 cycles. The bilateral loss of hearing is quite severe.\n\n3) Chronic chemical bronchitis with obstruction rests on symptoms of shortness of breath upon inhalation of the Alcolac odors and emissions, on findings of wheezing upon physical examination, and on the abnormal result of the pulmonary FEV[1]/FVC test. The result of that test was a vital capacity of 51% of the total -- which is a marked diminution from the normal and signifies a pulmonary obstruction.\n\nIn the attribution of cause of the chronic bronchitis with obstruction to the Alcolac chemicals, the evaluator took into account that John Phillips had smoked a pack of cigarettes a day since he was about 16 years of age, but gave up the practice when a physician diagnosed his condition as \"bronchial obstructive disease with reversible bronchial irritation.\" He has since smoked a pipe infrequently during the day. The earlier diagnosis describes a difficulty in exhalation because of the spasm caused to the lungs by the irritant material [cigarette smoke]. In fact, as the evaluator acknowledged, John Phillips \"does give a classic history of an individual who has chronic bronchitis from cigarettes.\" It does not, however, show a history of a bronchitis developed into obstructive disease. There was no sputum, no wet coughs, no recurrent infections which mark that progression. He was progressing well until two years of exposure to the Alcolac chemicals, and suddenly is beset with chest problems. The evaluator concluded that although the cigarette use may have contributed to the obstruction, it was not a major factor in the etiology of that disease.\n\nThe medical history also reported a complaint to the Veterans Administration Hospital in Columbia on April 24, 1977 of \"some shortness of breath on admission.\" The occasion for the hospital visit was a complaint of dizziness, weakness and \"spinning around.\" Dr. Carnow surmised that it involved \"some kind of an acute problem . . . some kind of a Meniere's syndrome.\" Examination, however, found the lungs completely normal -- and hence, whatever that episode meant, it did not involve the lung function and hence does not impinge on the subdiagnosis that the pulmonary obstruction was caused by the Alcolac chemicals.\n\n4) Liver dysfunction including abnormal porphyrin metabolism rests on the abnormal results of the tests of that function of the liver. The coproporphyrins were abnormally elevated at 127 [normal, 10 to 109] and the porphobilinogen is elevated at 1.7 [normal 0 to 1.5]. The liver dysfunction [although not marked on the DIAGNOSIS chart prepared by Dr. Carnow prior to testimony] also included a manifestation of abnormal protein metabolism. The globulins were abnormally depressed.\n\n5) Central nervous system dysfunction with damaged cranial nerves, cerebellar damage, depression, anxiety, cerebral damage with particular involvement of the right side of the brain rests on multiple symptoms, physical findings and abnormal test results. The symptoms which aided subdiagnosis were dizziness, loss of appetite, inability to sleep and headaches. The findings on physical examination were abnormality of the 12th cranial nerve and of the 8th cranial nerve as well as of the cerebellar functions of balance and tandem walk. The Zung anxiety scale was very high at 64 and the Beck depression inventory was also quite severe at 31 [normal, 14-16] -- a state of agitated depression. The neurobehavioral battery -- a series of 20 procedures which test visual/spatial perceptions and other brain functions -- yielded virtually all abnormal results. The neurologist examiner concluded [and Dr. Carnow agreed] that the test results suggest \"right hemisphere brain dysfunction.\" Dr. Carnow commented that the condition of organ depression exhibited by John Phillips [anxiety due to damage to the brain] renders function as to ordinary matters all the more difficult. That tends to explain the persistent marital discord from the insistence by Mrs. Phillips that they move away from the Alcolac disruptions and his refusal to leave the family homestead.\n\nDr. Carnow discounted any prior medical history to explain the etiology of the central nervous system dysfunction and attributed that manifestation of subdiagnosis entirely to exposure to the Alcolac emissions. The cyst suggested by a VA Hospital CAT scan in 1977 -- for instance -- was on the left side of the brain, and so is unrelated to the damage diagnosed to the right side of the brain from the toxic emissions.\n\n6) severe far-advanced polyneuropathy rests on symptoms of weakness, tingling and cramps in the limbs, on physical findings of sensory abnormalities and on the abnormal results of the EMG, PNVC, motor and PNVC, sensory tests. The upper right extremity and the contralateral lower left extremity were tested. Every nerve tested in those limbs was abnormal. The results showed not only damage to all the nerves, but axonal degeneration -- complete destruction of the nerves.\n\nThe immune system also tested abnormally, both on the immune panel administered by Bioscience in 1984 and by Midwest/Wheeler in 1985. Thus, the Bioscience results show a depressed immunoglobulin M at 71 [normal, 80 to 310], elevated white blood cell monocytes and elevated basophils. The Midwest/Wheeler 1985 immune panel shows both an abnormal increase in B cells and an abnormal percent of B cells. These abnormalities were not rendered into a subdiagnosis on the DIAGNOSIS chart. It was the opinion of Dr. Zahalsky, immunology expert that all of the thirty-one plaintiffs [John Phillips included] suffer from a \"progressive chemical intoxication of the immune system.\" That condition of intoxication, he gave as opinion, will subject them to \"a variety of diseases, including, but not exclusively neoplastic disease.\" The formal DIAGNOSIS chart, for whatever reason, does not enter such a diagnosis for John Phillips.\n\nPROGNOSIS: Poor.\n\nCHARLOTTE PHILLIPS AGE 52 LIFE EXPECTANCY 31.34 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic conjunctivitis\n\n2) borderline hearing loss\n\n3) chronic pharyngitis and bronchitis\n\n4) chronic gastritis -- severe\n\n5) liver dysfunction including:\n\na. abnormal LDH\n\nb. lipid abnormality -- aggravated\n\nc. abnormal porphyrins\n\nd. abnormal protein metabolism -- possible\n\nhypothyroidism\n\n6) chronic esophagitis\n\n7) hypertensive cardiovascular disease with chronic\n\ncoronary insufficiency\n\n8) genital urinary dysfunction with chronic urinary\n\ntract difficulty\n\n9) central nervous system dysfunction with severe\n\nanxiety and depression\n\n10) peripheral neuropathy\n\n11) immune system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic conjunctivitis rests on symptoms of redness, irritation and itchiness of the eyes following exposure to the Alcolac odors and emissions.\n\n2) Borderline hearing loss rests on the abnormal results of the audiometric test administered to Charlotte Phillips by CCA in 1984. [She was one of the four who were examined successfully by CCA in 1983 and 1984.] The results were slightly abnormal -- a 30 decibel loss -- at the 3000, 4000 and 6000 frequency cycles. They nevertheless indicate neurologic damage. In 1983, no audiometry was conducted, but a history of noisy employment was noted. There was some indication of hearing loss at the lower frequencies on that occasion. The eardrums were scarred, which indicated a conduction rather than a nerve defect. The cause of the hearing loss noted in 1984, a borderline effect, was attributed to the chemicals because she had made no previous complaint of hearing loss, had not been tested previously by audiometry and the toxic chemicals emitted by Alcolac do damage the 8th cranial nerve. Neurosensory hearing loss may either be noise or chemical induced, but the probability of nerve damage to one exposed to job noise is markedly increased by exposure to chemicals.\n\n3) Chronic pharyngitis and bronchitis rests on symptoms of burning, sore throat, shortness of breath and cough and on the physical finding of cough. The symptoms followed exposure to the Alcolac odors and emissions.\n\n4) Chronic gastritis -- severe rests on prolonged symptoms of stomach cramps with the distress of burning sensations and nausea from the odors and emissions.\n\nShe was advised by a physician that these symptoms of gastrointestinal disease were attributed to a hiatal hernia diagnosed in 1979. Also, her gallbladder was removed in 1974, but the problems related to the malady did not recur thereafter. The medical records contained the history of these conditions.\n\nThe medical history of Charlotte Phillips discloses that in 1974 her gallbladder was removed and in 1979, her symptoms of gastrointestinal distress -- also nausea and burning sensations in the stomach area -- signified a hiatal hernia. The symptoms relating to the gallbladder did not recur after the surgery, and although a hiatal hernia may explain the subsequent gastrointestinal symptoms Charlotte Phillips described, after the removal of the gallbladder in 1974 there were no significant symptoms until after exposure to the Alcolac chemicals in 1978. The significant array of problems Charlotte Phillips described -- epigastric pain, gastroenteritis, nausea, diarrhea, colitis -- all began in 1978 after Alcolac commenced to generate the toxic chemicals to which she was exposed. It was also after 1978 that she relates similar reactions from her domestic animals -- such as vomiting. It was the opinion of Dr. Carnow, based upon this medical and environmental history, that the distresses already described -- epigastric pain and the others -- that she did not before the Alcolac operation in 1978 were attributable to the exposure to those odors and emissions. Dr. Carnow acknowledged that the hiatal hernia itself was not an effect of the Alcolac chemicals.\n\n5) Liver dysfunction including abnormal LDH, lipid abnormality -- aggravated, abnormal porphyrins, abnormal protein metabolism -- possible hypothyroidism rests on the laboratory test of these liver functions. The liver enzyme LDH was somewhat elevated at 133 [normal, 62 to 131] and signified some inflammation of the liver. The lipid metabolism was abnormal: the lipoprotein phenotype was abnormal; the tryglycerides were greatly elevated at 301 [normal, 30 to 135]. Two porphyrins were abnormal: the uroporphyrins were elevated at 35 [normal, 4 to 22] and the coproporphyrin to uroporphyrin ratio was abnormal. These abnormalities signify a condition of uroporphyrinuria. The abnormal protein metabolism was demonstrated by the results of the thyroid tests of the endocrine system. The T3 uptake was depressed as was the FT index. Dr. Carnow concluded that those results may represent a low thyroid , but that the underlying pathology nevertheless was the abnormal protein metabolism.\n\n6) Chronic esophagitis rests on the symptoms of inflammation of the esophagus from the recurrent vomiting. This condition was attributed to the effect of the Alcolac odors and emissions and not to the previous condition of hiatal hernia for the same reasons ascribed for the causation of the chronic gastritis subdiagnosis component.\n\n7) Hypertensive cardiovascular disease with chronic coronary insufficiency rests on symptoms of pain in the midchest which radiate to the sides of the chest, and on physical findings of abnormal pulse rate and diminished peripheral pulse.\n\n8) Genitourinary system dysfunction with chronic urinary tract difficulty rests on an abnormal urinanalysis, with elevated pus cells and bacteria and recurrent urinary infection.\n\n9) Central nervous system dysfunction with severe anxiety and depression rests on symptoms of dizziness, depression and headache and on the abnormal results of the Zung anxiety scale, neurobehavioral battery and Beck depression inventory. On the neurological tests, she displayed a mildly unreliable concentration, a mildly slow digit vigilance response and a mildly slow bilateral finger-tapping. The anxiety was moderate at 26, on a Beck scale of 0 to 10. The depression was high at 63, on a Zung scale of 0 to 44. These abnormalities, the evaluator interpreted to be manifestations of organic origin interrelated with the chemical component. The hyperexcitability at the high level of anxiety combined with the state of depression found in Charlotte Phillips was particularly ominous to a restoration of a healthy state.\n\n10) Peripheral neuropathy rests on symptoms of sensory abnormalities as well as cramps and tingling in the limbs, and on the physical finding of the decreased or absent deep tendon reflexes.\n\n11) Immune system dysfunction rests on the abnormal results of the immune panels administered by Bioscience laboratory in 1984 and Midwest/Wheeler laboratory in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormally increased globulin G\n\nat 1510 [normal, 700 to 1500]\n\nWhite blood cells: abnormally elevated monocytes\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally depressed white blood\n\ncell count\n\nHematologic system: abnormally increased mean plate-\n\nlet volume\n\nPROGNOSIS: Very guarded to poor.\n\nDANIEL PRYOR AGE 35 LIFE EXPECTANCY 42.63 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis and conjunctivitis\n\n2) chronic chemical bronchitis with restrictive and\n\nobstructive defects; and recurrent hemorrhage\n\n3) chronic gastritis\n\n4) liver dysfunction with:\n\na. abnormal lipid metabolism\n\nb. abnormal protein dysfunction\n\n5) reproductive system dysfunction\n\n6) central nervous system dysfunction, including:\n\na. cerebral dysfunction\n\nb. depression\n\nc. anxiety\n\nd. possible 8th cranial nerve damage\n\n7) probable peripheral neuropathy\n\n8) immune system dysfunction with suppression\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis and conjunctivitis rests on symptoms of recurrent nasal congestion and on physical findings of mucous membrane irritation and symptoms of red, irritated, burning and watering eyes. Daniel Pryor relates these symptoms and conditions to the Alcolac odors and emissions.\n\n2) Chronic chemical bronchitis with restrictive and obstructive defects and recurrent hemorrhage rests on symptoms of shortness of breath, wheeze, chest heaviness, cough productive of phlegm flecked with blood. The subdiagnosis rests also on physical findings of lung abnormalities of prolonged expiration and wheezing. The subdiagnosis rests also on the laboratory tests for FVC and FEC[1]/FVC which are both abnormally low. There is also decreased volume of the lung and scarring of the lungs -- restrictive defects -- as well as an obstructive defect, of the kind usual with spasm or inflammation of the air passages. The evaluator attributed these conditions of disease and dysfunction as the chronic effects to the exposure to the Alcolac emissions.\n\nThe personal history given by Daniel Pryor related that he became a regular cigarette smoker at age 18 and continued until age 24 and consumed one and one-half pack per day. He discontinued the habit for ten years, but resumed once again at the same pace about four months prior to examination at CCA. Dr. Carnow ruled out the cigarette consumption as a cause of the chronic chemical bronchitis and pulmonary dysfunction and subdiagnosis because Daniel Pryor was free of symptoms when he gave up smoking ten years before the complaints of wheeziness, chest heaviness and shortness of breath began two years ago -- before the resumption of the cigarette habit. The productive coughs and the occasional flecks of blood in that sputum commenced about a year ago -- and so also predated the resumption of smoking, six months before examination at CCA. His symptoms, rather, all commenced after the onset of the Alcolac productions and the emission of the pollutants. The temporal relationship of the symptoms, therefore, is not to cigarettes but to exposure to the chemicals. Daniel Pryor not only exhibits these many symptoms, however but also manifests \"a lot of wheezing in his lungs, which means that the air passages were swollen and narrowed, all over his lungs.\" The lung tests demonstrate a force vital capacity of only 71 percent which means \"e had trouble getting air out of his lungs.\" These bronchial conditions, he noted, are rather severe, and the cigarettes were \"at most, a minimal aggravating factor.\"\n\n3) Chronic gastritis rests on symptoms of gastrointestinal distress, nausea, rectal bleeding, anorexia and weight loss.\n\n4) Liver dysfunction with abnormal lipid metabolism and abnormal protein metabolism rests on abnormal test results of those liver functions. The depressed cholesterol and LDL cholesterol represent liver damage. The FT [free thyroxin] index was abnormally low and represents a dysfunction of the protein metabolism function of the liver.\n\n5) Reproductive system dysfunction rests on the fertility analysis which was abnormal through he range of tests. The percent activity showed a 45% of the sperm active at 30 minutes [normal, over 70%], and only 30% active at four hours [normal, over 60%]. Thus, at the end of four hours, only 30% of the sperm remained alive. The grade of motion and type of motion were also abnormal: the sperm were not moving rapidly and were not moving in the same direction. The total sperm count was very low at 29 million [normal, above 60 million]. Also, 23% of the sperm were abnormal. The result, the evaluator concluded, \"represents a pretty bad profile.\"\n\n6) Central nervous system dysfunction, including cerebral dysfunction, depression, anxiety, possible 8th cranial nerve damage, rests on symptoms of dizziness, decreased concentration and loss of memory, sleep disorders and headache. The subdiagnosis and their components rest also on the results of the neurobehavioral battery, the Zung anxiety scale and the Beck depression inventory. The neuropsychological examination disclosed a mild attentional deficit and depression, and raised a question as to a somatosensory deficit in the left side of the brain. The severe depression found, however, may impinge to explain that apparent dysfunction. It was unclear to the neurologist whether that manifested a problem of the peripheral nervous system [damage to the nerves out of the cord] or of the central nervous system [damage to the nerves out of the brain]. The Beck depression inventory was 21 [normal, 0 to 10]. The Zung anxiety scale result was 53 [normal, 0 to 44]. Thus, in addition to the test results of a severe depression and abnormal anxiety, the tests demonstrated a nervous system deficit, whether as damage in the brain or in the peripheral nerves.\n\n7) Probable peripheral neuropathy rests on symptoms of numbness in the hands and arms, tingling, and weakness in the legs and grip. The numbness has become recurrent with longer-lasting episodes.\n\n8) Immune system dysfunction with suppression rests on the abnormal results of the immune panels administered by Bioscience Laboratory in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nWhite Blood Cells: abnormal depression of the T\n\nlymphocytes at 64 [normal, 70\n\nto 84]\n\nabnormal depression of the segs\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated OKT-10\n\n[natural killer] cells\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nThe medical history of Daniel Pryor recorded occasional use of drugs: speed, LSD, downers, but not a present use. Those isolated occasions, in 1976, the evaluator commented, do not impinge on any of the symptoms, findings, laboratory results or subdiagnoses entered for Daniel Pryor. The drug experimentation was occasional only. A chronic drug use, he commented, could explain a liver pathology such as hepatitis, but there was no such condition found. In fact, Daniel Pryor was one of the few among the patient plaintiffs who had no condition of abnormal porphyrin metabolism. The damage found to the lungs, to the immune system and to the central nervous system, are not related or explainable by that occasional use those years ago.\n\nPROGNOSIS: Very guarded.\n\nJOYCE PRYOR AGE 33 LIFE EXPECTANCY 49.45 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic conjunctivitis\n\n2) chronic rhinitis and pharyngitis\n\n3) vascular insufficiency\n\n4) chronic gastroenteritis (possible porphyrin crisis)\n\n5) liver dysfunction, including:\n\na. abnormal lipid metabolism\n\nb. abnormal protein metabolism\n\nc. abnormal porphyrin metabolism\n\n6) genitourinary system dysfunction, including:\n\na. infection with bleeding\n\nb. electrolyte unbalance with hyperchloremia and\n\nhyperphosphatemia\n\n7) central nervous system dysfunction with cerebellar,\n\nincluding:\n\na. cerebellar damage\n\nb. severe depression\n\nc. severe anxiety\n\n8) mild peripheral neuropathy\n\n9) musculoskeletal dysfunction\n\n10) immune system dysfunction\n\n11) chronic chemical dermatitis\n\n12) endocrine dysfunction\n\n13) reproductive system dysfunction with dysmenorrhea\n\nand memorrhagia\n\n14) hematologic system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic conjunctivitis rests on symptoms of red, irritated eyes with a swollen feeling following exposure to the Alcolac odors and emissions. It rests also on findings of reddened conjunctiva on physical examination.\n\n2) Chronic rhinitis and pharyngitis rests on symptoms of nose irritation and congestion such as soreness of the throat. It rests also on the finding on physical examination of swollen and irritated mucous membrane with exudate on physical examination.\n\n3) Vascular insufficiency rests on symtpoms of chest pain and on physical findings of peripheral abnormalities of an abnormally red color of the legs [rubeosis - which signifies a circulatory deficiency], and diminished peripheral pulse at the feet.\n\n4) Chronic gastroenteritis [possible porphyrin cirses] rests on frequent episodes of vomiting accompanied by diarrhea, symptoms of indigestion and gastrointestinal distress, nausea and hemorrhoids. The subdiagnosis rests also on the abnormal porphyrin metabolism test results.\n\n5) Liver dysfunction, including abnormal lipid metabolism, abnormal protein metabolism abnormal porphyrin metabolism, rests on the results of the tests of those functions of the liver. Her triglycerides were abnormally high at 165 [normal, 30 to 150] in a woman of only 33 years. The abnormally - low FT [free thyroxin] index level of the thyroid signified an abnormal protein metabolism of that function of the liver. The abnormalities of the porphyrin metabolism function of the liver were also marked, with both a uroporphyria and a coproporphyrinuria. The uroporphyrins were at 33 [normal, 4 to 22] and the coproporphyrins were at 88 [normal 3 to 56].\n\n6) Genitourinary system dysfunction, including infection with bleeding, electrolyte unbalance with hyperchloremia and hyperphosphatemia, rests on history of recurrent bladder infections and on abnormal laboratory test results. The urinalysis was very abnormal - more than 200 clumps of pus cells and blood in the urine. The chlorides and potassium were both abnormally elevated. The electrolytes tolerate only a narrow range within which the body can live, and so the body regulates the electrolytes with great care. The changes found, Dr. Carnow explained, were \"very significant.\"\n\n7) Central nervous system dysfunction with cerebellar, including cerebellar damage, severe depression, severe anxiety, rests on symptoms of dizziness, nervousness, sleep disorders and headache. They rest also on the findings on physical examination of cerebellar dysfunction and that of the 8th cranial nerve. The result of the 30 [normal 0 to 10] manifested an abnormal depression on the Beck inventory and the 57 [normal, 0 to 44] was an abnormal value on the Zung anxiety scale.\n\nThe medical history of Joyce Pryor records an entry by Dr. Allcorn, a local Sedalia physician, that she becomes very upset before the monthly menstrual period. The cross-examiner posed to Dr. Carnow whether the premenstrual syndrome was related to the central nervous system manifestations attributed to the Alcolac chemicals. The evaluator acknowledged that the records show a history of nervousness in the early 1970's for which she consulted a physician, and for which she was given medication. That condition nevertheless exacerbated so that by 1981 it was much worse. The condition of nervousness, in fact, became very severe before her menstrual periods, but Dr. Carnow concluded that the condition was related to her absorption of the chemicals. He suggested also that the condition of the nervousness was related to the changes in her porphyrin metabolism. Joyce Pryor was on a regimen of birth control pills, and the ingestion of estrogens exacerbates porphyria. Thus, the estrogens taken before the menstruations may have been a factor in the attendant nervousness - and intensified the intoxication from the alcolac chemicals acting on her porphyrins.\n\nThe neuropsychological findings entered by Dr. William Wilson, neurological examiner for CCA, conclude with the summary: \"The results of Mrs. Pryor's neuropsychological examination suggest a mild to moderate level of depression and distress in an individual with long-standing characterological problems.\" The longstanding characterological problems alluded to a history of family abuse, precocious sexual play, early pregnancy at age 16, four marriages, and a pattern of possessiveness and demands for attention from the husband. The records note also episodes of drug use fifteen years before, which included \"uppers, downers and heroin,\" and the indifference of the husband to that indulgence.\n\nIt was posed to Dr. Carnow on cross-examination - in light of these examination reports and incidents of prior history - to explain how he arrived at the subdiagnosis that the severe depression was a disease caused by the Alcolac chemicals. Dr. Carnow responded that he relied on the finding of Dr. Wilson of a mild to moderate level of depression, that the occasional drug use was fifteen years before, that the drug episode was prompted by marital discord with her then husband, that she thereafter undertook to repair her life through church activity, but that the chronic exposure to the Alcolac chemicals over the years, superimposed on her tendency to nervousness and depression, made her become progressively more irritable so that by 1984, after a period of domestic discord [this time with husband Daniel Pryor] that marriage ended in dissolution. Dr. Carnow acknowledged that the \"characterological disorder\" and the episode of drug use were \"significant components in her depression.\" He insisted, however, that a person with her susceptibility to stress is more easily affected by a superimposed stress, such as toxic chemicals. He explained also that her condition of severe porphyria also impinges on central nervous system dysfunction. \"It makes people extraordinarily irritable.\" In view of the \"tremendous amount of evidence that she has been poisoned by the chemicals\" as to other organ functions, that intoxication must be deemed to be a component of her depression - \"a contributing cause, certainly not the sole cause.\"\n\n8) Mild peripheral neuropathy rests on symptoms of tingling of the fingers and limbs, intermittent shooting pains and other sensory abnormalities following exposure to the Alcolac odors and emissions.\n\n9) Musculoskeletal dysfunction rests on muscular pains, cramps and joint pains following exposure to the Alcolac odors and emissions, and on symptoms of weakness in the limbs.\n\n10) Immune system dysfunction rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nWhite blood cells: total abnormally elevated at\n\n12,300\n\nT lymphocytes abnormally depressed\n\nat 68\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: white blood cells total abnormal-\n\nly elevated at 13,300\n\nabnormal increase in OKT-10\n\n[immature lymphocyte] cells\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nabnormal mean platelet volume\n\nabnormal shape\n\nabnormal color\n\nfrom want of sufficient\n\nhemoglobin\n\nThe evaluator noted the progression in the elevation of the total white blood cells from 12,300 in 1984 to 13,300 in 1985, and recommended - as in the case of the others with found immune system abnormalities -successive, periodic tests. A continued elevated total at the range or beyond would cause concern for an eventual condition of leukemia.\n\n11) Chronic chemical dermatitis rests on symptoms of skin rashes and lesions and progressive increase of facial blemishes and dry splotches on her arms and scalp following exposure to the Alcolac chemicals.\n\n12) Endocrine dysfunction rests on the abnormal FT [free thyroxin] index test result.\n\n13) Reproductive system dysfunction with dysmenorrhea and menorrhagia rests on symptoms of abnormally prolonged menstrual periods, episodes of bleeding, marked by painful discharges and issues of large blood clots.\n\n14) Hematologic system dysfunction rests on the abnormal results of the tests of the hematologic system administered by Midwest/Wheeler.\n\nPROGNOSIS: Very guarded to poor.\n\nLINDA SANDERS AGE 23 LIFE EXPECTANCY 59.23 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiply organ\n\nsystems, including:\n\n1) recurrent conjunctivitis\n\n2) possible mild hearing loss\n\n3) chronic rhinitis and laryngitis\n\n4) chronic chemical bronchitis\n\n5) liver dysfunction, including:\n\na. abnormal enzyme, possible low-grade hepatitis\n\nb. abnormal porphyrin metabolism with porphyria\n\n6) central nervous system dysfunction with depression\n\n7) chronic chemical dermatitis\n\n8) immune system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Recurrent conjunctivitis rests on symptoms of irritation and burning of the eyes following exposure to the Alcolac odors and emissions.\n\n2) Possible mild hearing loss rests on symptoms of ear discomfort and the results of the audiometric tests which show a 30 decibel loss bilaterally at the 6000 cycle frequency.\n\n3) Chronic rhinitis and laryngitis rests on symptoms of nose and throat irritation, burning in the nose and throat and recurrent infections of the throat.\n\n4) Chronic chemical bronchitis rests on symptoms of shortness of breath, cough and chest heaviness.\n\n5) Liver dysfunction, including abnormal enzyme, possible low-grade hepatitis, abnormal porphyrin metabolism with porphyria rests on the results of the laboratory tests of those liver functions. The heptacarboxylic porphyrins were depressed and the coproporphyrins were elevated, both abnormalities. The alkaline phophatase enzyme was abnormally elevated. That may represent a problem with the liver -- a low-grade hepatitis. The globulins were also depressed. She was prescribed drugs to prevent prophyrin crisis.\n\n6) Central nervous system dysfunction with depression rests on symptoms of depression and headache and on the abnormal Beck depression inventory, a 13 on a scale of 0 to 10. The neuropsychological findings conclude, in summary, that the examination results \"are within normal limits with the exception of a mild depression whose clinical significance is uncertain given the recent birth of her child.\" Dr. Carnow explained that the comments of the neurologist notwithstanding, the examiner was not a clinician and the history does not suggest that Linda Sanders suffered any port-partum depression. The depression, rather, she related to the Alcolar fumes and odors. In view of her youth, he commented, there was no other explainable basis for her depression.\n\n7) Chronic chemical dermatitis rests on symptoms of skin rash following exposure to the Alcolac emissions in 1978. Her prior history notes an episode of allergic dermatitis to detergents at her work. In April of 1977, one episode of rash over her entire body was diagnosed as viral dermatitis. Another entry for that month also notes a rash over the entire body. In November of 1978, she suffered another rash over the body, and the record notes \"soap at work.\" It was diagnosed by one physician as scabies and by another as contact dermatitis. There was no diagnosis made, however, that the cause was \"soap at work.\" The rash was recurrent. Dr. Carnow entered the diagnosis, on the basis of the history of exposure to the Alcolar chemicals on the medical history, as a chronic chemical dermatitis.\n\n8) Immune system dysfunction rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormally depressed gamma M at\n\n75 [normal, 80 to 310]\n\nabnormally depressed globulins\n\nWhite blood cells: abnormally elevated total lympho-\n\ncytes at 43 [normal, 20 to 40]\n\nabnormally depressed eosinophils\n\nat 0\n\nabnormally elevated monocytes\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated OKT-10\n\n[immature lymphocyte] cells\n\nThe evaluator concluded that the test results show multiple derangement in various areas of the immune system. Linda Sanders married in 1980 and moved to Texas. Thus, her exposure to the Alcolac chemicals was for a period of one year and nine months. After marriage, she gave birth to three children, all of them healthy. It was the opinion of Dr. Carnow that the state of the health of the children notwithstanding, Linda Sanders, because of her youth \"may have more problems than other people.\" To cross-examination, Dr. Carnow responded that recurrent infections were not necessarily the eventual consequences of an immune system dysfunction as she manifests. Recurrent infection is the consequence of B cell abnormality, since the B system is that arm of the immune mechanism which relates to infections. Her abnormality, as with most of the Alcolac plaintiffs, was to the T cells -- and they tend to relate \"to very specific types of infections, like tuberculosis and things like that, and they relate more to destroying cancer cells.\"\n\nPROGNOSIS: Very guarded to poor.\n\nARNOLD SUMMERS AGE 42 LIFE EXPECTANCY 36.02 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic conjunctivitis\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic rhinitis and pharyngitis with nasal\n\nhemorrhage\n\n4) chronic chemical bronchitis\n\n5) acute recurrent gastritis [possible porphyrin\n\ncrisis]\n\n6) liver dysfunction, including:\n\na. severe chemical hepatitis\n\nb. abnormal lipid metabolism\n\nc. abnormal porphyrin metabolism\n\n7) genitourinary tract dysfunction with probable\n\nrenal insufficiency\n\n8) central nervous system dysfunction, including:\n\na. cerebral damage\n\nb. probable cerebellar damage\n\n9) peripheral polyneuropathy\n\n10) musculoskeletal dysfunction\n\n11) immune system dysfunction\n\n12) hematologic system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic conjunctivitis rests on symptoms of recurrent eye irritation, itchiness, matting, watering and redness following exposure to the Alcolac odors and emissions. It rests also on finding injected conjunctiva on physical examination.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on audiometric test results of \"classic neurosensory loss.\" On the right there was a 45 decibel loss at 4000 frequencies and a 55 decibel loss at 6000 frequencies. On the left there was a 45 decibel loss at 3000 frequencies, a 45 decibel loss at 4000 frequencies and a 60 decibel loss at 6000 frequencies.\n\n3) Chronic rhinitis and pharyngitis with nasal hemorrhage rests on symptoms of nasal irritation with gushing nosebleeds and irritation and soreness of throat following exposure to the Alcolac odors and emissions. They rest also on physical findings of reddened throat and reddened and swollen mucosa in the nose.\n\n4) Chronic chemical bronchitis rests on symptoms of shortness of breath and productive cough continuously during the past months. The examiner discounted a chest x-ray finding of granuloma -- a residue of a primary tuberculosis endemic to those in this area of the country. It represents a tiny calcification end-result of the healing process. In this case it is \"ancient\" and of no diagnostic significance. Arnold Sommers was a smoker for 28 years, but denied any symptoms until exposure to the Alcolac emissions both from the plant and from the plant run-off into Little Shaver Creek which ran behind his home. The odors from these sources induce his coughs, which have become increasingly frequent and severe. This temporal relationship of the symptoms to the exposure events render the inhalations of these pollutants \"the overwhelming cause of this bronchitis,\" Dr. Carnow concluded.\n\n5) Acute recurrent gastritis [possible porphyria crises] rests on symptoms of nausea, from the Alcolac odors. These effects last for two to three days and then diminish until the next exposure. The medical history shows a diagnosed ulcer of the pylorus in 1976. That condition reacts to the chemical inhalations and he takes medication for the discomfort. It was the opinion of Dr. Carnow that the underlying ulcer may have healed, but in any event it was symptomatic only after exposure to the chemicals. When the exposure ceases the symptoms also cease, so even if \"some low grade underlying ulcer exists, the symptoms are of a recurrent gastritis.\" Dr. Carnow noted also that the laboratory test results show porphyria and the symptoms Sommers manifests of severe gastrointestinal pain and disturbance are those common to porphyria.\n\n6) Liver dysfunction, including severe chemical hepatitis, abnormal lipid metabolism, abnormal porphyrin metabolism rests on the abnormal results of the tests of those liver functions. The coproporphyrins were abnormally elevated at 159 [normal, 10 to 109]. The porphobilinogen is 1.6 [normal 0 to 1.5] and the coporporphyrin-uroporphyrin index is abnormal at 6.6 times the copro to the uro. The liver enzymes, GGTP, SCOT, SPGT, alkaline phosphatase and LDH were all abnormal -- a sign of severe chemical hepatitis caused by the Alcolac emissions. This pattern of enzyme abnormality shows the full effect of a chronic chemical inflammation of the liver. It is also characteristic of the true state of the others afflicted by liver dysfunction from the chronic exposure to the Alcolac chemicals, even though they did not all manifest the full spectrum of enzyme test abnormalities. Dr. Carnow explained that such is the nature of the enzyme system: \"Certain enzymes go up and they go down, and then they may go up again, and then they go into a chronic damage phase, so it depends on when you catch them. [Arnold Sommers] shows evidence of acute damage, and of course, at this point in time, that is a serious problem.\" It could cause death. The lipid metabolism was also disturbed. The LDL cholesterol was high at 229 [normal upper limit, 185], the triglycerides were very high at 359 [normal upper limit, 150], and he has an abnormal phenotype.\n\nDr. Carnow discounted as explanation for these multiple liver functions the personal history that Arnold Sommers consumed two six-packs of beer per week. They neither acted synergistically with the Alcolac chemicals to bring about the abnormalities nor were they otherwise significant to diagnosis.\n\n7) Genitourinary tract dysfunction with probable renal insufficiency rests on the test result of an elevated creatinine, which signifies kidney dysfunction -- a matter of some concern in a person of only 42 years of age.\n\n8) Central nervous system dysfunction, including cerebral damage, probable cerebellar damage rests on symptoms of dizziness, nervousness, tremor and headache, on physical findings of cerebellar abnormality and 8th cranial nerve damage, and on the results of the neurobehavioral battery. The neurological tests disclosed an attentional deficit -- difficulty in concentration -- and other abnormalities from which the neurologist derived the diagnosis: \"mild diffuse brain dysfunction.\" Arnold Sommers described constant and intense headaches from the onset of the Alcolac operations, irritation and loss of temper. He described an episode of rage which induced him to hit his horse between the eyes with such force as to break his hand. Those responses, Dr. Carnow explained, are characteristic of chemical intoxication.\n\n9) Peripheral neuropathy rests on symptoms of sensory abnormalities -- such as tingling and numbness of the limbs and members, more pronounced on the left side. The subdiagnosis rests also on findings on physical examination of hand tremors present for more than a year, on continued headaches more severe than before, and on the decreased sensation found over the entire left leg. The subdiagnosis rests also on the results of the EMG, PNVC/motor and PNVC/sensory laboratory tests. There was abnormal motor conduction on the lower left, abnormal sensory conduction on the lower left, and abnormal EMG on the lower left -- all of which shows axonal degeneration, total destruction of those nerves.\n\nThe prior history notes a condition of polio in 1954 and vehicular accidents in 1952, when he fractured the left leg. There was a recovery from the polio, Dr. Carnow concluded, because there was no evidence of a residual paralysis and consequent atrophy of the limb. It was conceivable, Dr. Carnow explained, that the leg fracture may have injured a nerve, but given the development of numbness and tingling of the toes, hands and feet -- so severe that they awaken him from sleep -- it is not likely that the 1952 event is related to the conditions of peripheral neuropathy found. In any event, there is nerve damage to the right as well as to the left, so that even if the 1952 event could be said to impinge on the neuropathy to the left, it could not be related to the other damage.\n\n10) Musculoskeletal dysfunction rests on the symptoms and findings of muscular pains and cramps and is interrelated with the symptoms, findings and laboratory results of the peripheral neuropathy manifestation.\n\n11) Immune system dysfunction rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nWhite blood cells: abnormally depressed eosinophils\n\nat 0\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormal OKT-3 [mature T] cells\n\nabnormally elevated NKH-1\n\n[natural killer] cells\n\nHematologic system: abnormal mean corpuscular volume\n\nabnormal corpuscular hemoglobin\n\nabnormal mean platelet volume\n\nabnormal sizes\n\n[12] Hematologic system dysfunction rests on the four abnormal findings in that blood system noted in the 1985 Midwest/Wheeler laboratory test results.\n\nPROGNOSIS: Poor to very guarded [that is, closer to poor than very guarded ].\n\nJOYCE SOMMERS AGE 38 LIFE EXPECTANCY 44.60 YEARS\n\nDIAGNOSIS: Chronic Systematic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nSystems, including:\n\n1) chronic conjunctivitis\n\n2) chronic rhinitis and pharyngitis\n\n3) liver dysfunction including:\n\na. abnormal enzyme\n\nb. abnormal protein metabolism\n\nc. abnormal porphyrin metabolism\n\n4) genitourinary system dysfunction\n\n5) central nervous system dysfunction including:\n\na. depression\n\nb. anxiety\n\n6) abnormal muscle metabolism\n\n7) immune system dysfunction with suppression\n\n8) recurrent chemical dermatitis\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic conjunctivitis rests on symptoms of reddened, irritated eyes and on the finding of reddened conjunctiva upon physical examination. These conditions follow upon exposure to the Alcolac odors and emission.\n\n2) Chronic rhinitis and pharyngitis rests on symptoms of nasal congestion, nosebleeds and soreness of the throat following exposure to the Alcolac odors and emissions. Chronic rhinitis rests also on the findings on physical examination of reddened and swollen mucosa with exudate.\n\n3) Liver dysfunction including abnormal enzyme , abnormal protein metabolism, abnormal porphyrin metabolism rests on the results of the laboratory tests of those liver functions. The LDH enzyme is abnormally elevated and may be evidence of inflammatory changes. The porphyrins are abnormal: the uroporphyrins are at 33 [normal, 4 to 22]; the pentacarboxylic is at 4 [normal, 0 to 3]; the coproporphyrins are at 171 [normal, 3 to 56]. This represents a gross porphyria.\n\n4) Genitourinary system dysfunction rests on laboratory tests of abnormally elevated chlorides with pus infection.\n\n5) Central nervous system dysfunction including depression, anxiety rests on symptoms of headache and dizziness following exposure to the Alcolac odors and emissions, from the findings on physical examination of dizziness and headaches and from the values on the Zung anxiety scale and the Beck depression inventory. The neurologist examiner found Joyce Sommers \"mildly depressed and mildly anxious.\" The neurologist noted also a deviation of the tongue to the left, a manifestation of damage to the XIIth cranial nerve.\n\n6) Abnormal muscle metabolism rests on symptoms of pains in the legs and thighs, knotted up legs, muscle twitches and weakness in the knees. This condition has come on within the six months prior to the August, 1984 examination at CCA.\n\nThe evaluator considered the medical history that Joyce Sommers in January of 1971 suffered injuries in a vehicular collision, among them dislocation of the hip and multi-fractures of the jaw, which confined her to a wheelchair for a time. The complaints upon which the subdiagnosis of abnormal muscle metabolism rests, however, appeared for the first time in 1984 and do not appear related to the trauma of 1971. In any event, a person with an organ already damaged is more susceptible to exacerbation from toxic chemicals. Moreover, Joyce Sommers made no complaint of the muscular disability during the interval between 1971 and 1984.\n\n7) Immune system dysfunction with suppression rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1985]\n\nImmune system:\n\nMitogen challenge: abnormal PHA stimulation net CPM\n\nat 30,580 [normal, over 62,000]\n\nabnormal PHA stimulation index at\n\n115 [normal, over 130]\n\nabnormal PWM stimulation net CPM\n\nat 6700 [normal, over 6700]\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes abnormally elevated OKT-10\n\ncells\n\nHematologic system: abnormal mean platelet volume\n\nabnormal mean corpuscular hemo-\n\nglobin\n\n8) Recurrent chemical dermatitis rests on symptoms of skin rash and itch from the Alcolac foam, odors and emissions.\n\nPROGNOSIS: Very guarded to poor.\n\nJOY SOMMERS AGE 15 LIFE EXPECTANCY 67.11 YEARS\n\nDIAGNOSIS: Chronic Systematic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis with severe nosebleeds\n\n2) liver dysfunction including:\n\na. abnormal lipid metabolism\n\nb. abnormal porphyrin metabolism\n\n3) peripheral polyneuropathy\n\n4) immune system dysfunction\n\n5) hematologic system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis with severe nosebleeds rests on symptoms of nose irritation and recurrent nosebleeds following intense odors and emissions from Alcolac. 2) Liver dysfunction including abnormal lipid metabolism and abnormal prophyrin metabolism rests on the results of the laboratory tests of those liver functions. The abnormal lipid metabolism manifestation rests on the very low triglycerides the test results show [16 on a normal of 30 to 150] and signifies that the liver \"is not handling fats normally.\" That represents a dysfunction, and whether liver disease will result depends on future tests and symptoms. A finding of high triglycerides , the witness explained, indicates a different kind of disease than low triglycerides . The first indicates \"abnormal handling of lipids,\" the second an \"inappropriate handling of lipids.\"\n\nThe test results show also an abnormality in the porphyrin metabolism function of the liver: a low heptacarboxylic porphyrin. What that abnormality represents in terms of disease the evaluator could not presently say, but it was a condition found in 8 of the 31 patients examined -- a \"very unusual\" phenomenon. It does not alter the diagnosis of toxic chemical causation because the test result was abnormally low rather than abnormally high. The abnormality of the porphyrin count -- whether high or low -- depends upon the stage of the porphyria and where the cascade of the stream of porphyrin metabolism is blocked. The porphyria found in Joy Sommers, the evaluator intimated, is in the incipient stage, and calls for a careful watch because of her youth -- 15 years of age.\n\n3) Peripheral polyneuropathy rests on the finding on physical examination of decreased or absent deep tendon reflexes.\n\n4) Immune system dysfunction rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\nPROGNOSIS: Very guarded.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nMitogen challenge: abnormal PHA stimulation net CPM\n\nat 60,700 [normal, over 62,000]\n\nWhite blood cells: abnormally depressed globulins\n\nabnormally depressed eosinophil\n\nat 0\n\nabnormally elevated total lympho-\n\ncytes at 2540 [normal, 620 to\n\n2410]\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated OKT-10\n\ncells\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nabnormally elevated mean platelet\n\nvolume\n\n5) Hematologic system dysfunction rests on the abnormal results of the hematologic system tests administered by Midwest/Wheeler in 1985.\n\nTAMMY SOMMERS AGE 19 LIFE EXPECTANCY 63.16 YEARS\n\nDIAGNOSIS: Chronic Systematic Chemical Intoxication caused by\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis with nasal hemorrhage\n\n2) chronic chemical bronchitis\n\n3) chronic gastroenteritis [possible porphyria crisis]\n\n4) liver dysfunction including:\n\na. abnormal lipid metabolism\n\nb. abnormal protein metabolism\n\nc. abnormal porphyrin metabolism\n\n5) probable central nervous system dysfunction with\n\ndepression\n\n6) immune system dysfunction\n\n7) hematologic system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis with nasal hemorrhage rests on symptoms of nosebleeds and nasal congestion following exposure to the Alcolac odors and emissions. It rests also on the findings on physical examination of reddened and swollen mucosa with exudate.\n\n2) Chronic chemical bronchitis rests on symptoms of recurrent cough productive of mucus.\n\n3) Chronic gastroenteritis [possible porphyria crisis] rests on symptoms of diarrhea, anorexia and gastrointestinal distress and on the laboratory test results of abnormal porphyrin metabolism.\n\n4) Liver dysfunction including abnormal lipid metabolism, abnormal protein metabolism, abnormal porphyrin metabolism rests on the results of the laboratory tests of those liver functions. Tammy Sommers at the time of examination and tests was 19 years of age, five feet three inches in height, and weighed 170 pounds. The triglycerides were elevated at 254 [30 to 154], a very high value for a young woman in the fertile period. The lipoprotein phenotype, another test for lipid metabolism, was also abnormal. These two abnormalities, when coupled together, represent a \"grossly abnormal\" metabolism of the lipids \"almost never seen.\" Her condition of overweight, Dr. Carnow commented, might cause some elevation of the triglycerides, but not to the value of 254 as found. The test of the protein metabolism disclosed an abnormal alpha[2] globulin and signifies a dysfunction of protein metabolism. The coproporphyrins at 59 [normal, 3 to 56] represents a dysfunction of the porphyrin metabolism function of the liver and a coproporphinuria in a person so young. These findings of abnormal lipid, protein and porphyrin metabolisms, the evaluator concluded, represent \"a very significant abnormality of liver function.\"\n\nThese multiple findings of dysfunction were explained as the action of the direct toxic agents, such as epichlorohydrin, which come to the liver to be detoxified but are so destructive that they kill liver cells. The liver [as the witness earlier explained] is the organ system with \"the most responsibility for working with the P450 enzymes.\" These particular enzymes are manufactured in the protein strands of the liver cells called endoplasmic reticulum. When chemicals such as epichlorohydrin [and some of the others emitted by Alcolac] \"turn on this endoplasmic reticulum,\" they induce an abnormal production of enzymes and the derangements of the protein, lipid, iron and porphyrin metabolism systems are induced. That is because the production of these enzymes needs proteins and iron and involves the system of porphyrin metabolism. The prophyrins, the witness explained, \"have a very delicate feedback system\" and the unusual demand on that system engendered from the action of the Alcolac toxic chemicals on the endoplasmic reticulum causes the porphyrins to \"just go out of whack.\" That derangement may affect the enzymes, lipids and proteins. In the case of Tammy Sommers, that derangement was extensive.\n\n5) Probable central nervous system dysfunction with depression rests on symptoms of recurrent and prolonged headaches, on the Beck depression inventory score of \"mildly depressed\" and on a deficit in neurological function -- episodic lapses in attention. The report noted that the depression \"seems to reflect situational difficulties\" -- the divorce of her parents when she was young, an unhappy childhood and uncertainty as to her future. Dr. Carnow concluded that from a clinical point of view, the abnormal depression inventory at 18 [normal, 0 to 10] was significantly abnormal. The episodes of unhappy personal history, he gave as opinion, contributed to her depression, but the temporal relationship between the chemical exposures and her headaches demonstrate that the exposures were an additive to the effect of depression. The two components are not separable as causes of the manifestation of depression.\n\n6) Immune system dysfunction rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobin: abnormally depressed gamma A at\n\n80 [normal, 90 to 340]\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally depressed OKT-11 cells\n\nat 847 [normal, 1000 to 3800]\n\nabnormally elevated OKT-10\n\ncells at 27.7\n\n[normal, 0 to 15]\n\nabnormally depressed NKH-1\n\n[natural killer] cells at\n\n6.7 [normal, 8 to 22]\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nabnormal mean platelet volume\n\nanisocytosis\n\npoikilocytosis\n\n7) Hematologic system dysfunction rests on the abnormal results of the hematologic system tests administered by Midwest/Wheeler in 1985.\n\nPROGNOSIS: Very guarded to poor.\n\nJAMES TURLEY AGE 52 LIFE EXPECTANCY 26.15 YEARS\n\nDIAGNOSIS Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic conjunctivitis\n\n2) bilateral neurosensory hearing loss with 8th\n\ncranial nerve damage\n\n3) chronic rhinitis with hemorrhage [chemical and\n\nallergic]\n\n4) chronic pharyngitis\n\n5) gastrointestinal dysfunction\n\n6) cardiac dysfunction with possible early congestive\n\nheart failure\n\n7) liver dysfunction with abnormal protein metabolism\n\n8) genitourinary dysfunction with obstruction\n\n9) central nervous system dysfunction with depression\n\n10) peripheral polyneuropathy with axonal degener-\n\nation\n\n11) musculoskeletal dysfunction with arthralgia and\n\nmyalgia\n\n12) severe immune dysfunction with suppression\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1 Chronic conjunctivitis rests on symptoms of redness and irritation of the eyes following exposure to the Alcolac emissions.\n\n2) Bilateral neurosensory hearing loss with 8th cranial nerve damage rests on the results of the audiometry tests. They show a neurosensory hearing loss on the right 55 decibels at the 4000 frequency and 85 decibels at the 6000 frequency. There was also a 40 decibel loss at the 3000 frequency, a 70 decibel loss at the 4000 frequency and a 90 decibel loss at the 6000 frequency. The hearing loss was evaluated as \"moderately severe.\"\n\n3) Chronic rhinitis with hemorrhage [chemical and allergic] rests on symptoms of irritated, congested nose, recurrent sneezing and clots of blood from the nose following exposure to the Alcolac odors.\n\nThe medical history of James Turley notes a fracture of the nose when a youth and a hospital episode in 1976 to reduce the blockage from that early fracture. A hospital record of April 9, 1979 indicates a complaint of chronic nasal congestion since the fracture reduction of 1976. In response to cross-examination Dr. Carnow construed the entries as an attempt to explain the cause of the continued nasal congestion. The records describe, he concluded, a severe allergic rhinitis in the past year. The manifestation of chronic rhinitis with hemorrhage entered as a subdiagnosis for James Turley, the witness explained, rests on the temporal relationship between the exposure to the odors and fumes as well as on the entry of the medical records. The effects to the nose -- irritation, burning, congestion and flow of blood clots -- followed upon the exposures. The medical records show that the surgery to reduce the prior nose fracture left only \"a minor deviation of the septum to the right\" -- a condition not significant to the congestion found. The evaluator thus concluded that the prior injury and repair may have left the nose more sensitive than would be normal, but the congestion and nasal bleeding were caused by the exposure to the Alcolac chemicals.\n\nThe witness explained the medical significance of chronic rhinitis -- a condition of chronic inflammation of the mucous membrane of the nose. The membrane is a film which covers the fissures of the nose and maintains those passages clean. Thus, it functions to prevent infection. When that film becomes irritated [as from toxic agents], it dries and becomes more susceptible to infection. In cases of chronic exposure to toxic agents, the swelling of the mucous membrane becomes permanent, so that bacteria may more easily invade and infection result.\n\n4) Chronic pharyngitis rests on symptoms of soreness of the throat following exposure to the Alcolac odors and emissions.\n\n5) Gastrointestinal dysfunction rests on symptoms of gastrointestinal distress and constipation.\n\n6) Cardiac dysfunction with possible early congestive heart failure rests on symptoms of arrhythmia and peripheral vascular abnormality. It rests also on the finding on physical examination of a heart \"gallop.\"\n\n7) Liver dysfunction with abnormal protein metabolism rests on the test results of that liver function. The total protein and total protein and albumin/globulin tests were all abnormally depressed.\n\n8) Genitourinary dysfunction with obstruction rests on symptoms of poor control and frequency of urination and nocturia. It rests also on the laboratory test result of elevated chlorides.\n\n9) Central nervous system dysfunction with depression rests on symptoms of tremor and loss of concentration and memory of recent events. It rests also on the Beck depression inventory result of 21 on a scale of 0 to 10. That inventory, Dr. Carnow concluded, \"shows a moderately severe depression.\"\n\n10) Peripheral polyneuropathy with axonal degeneration rests on findings on physical examination of decreased or absent deep tendon reflexes and on the laboratory tests. The EMC, PNVC/motor and PNVC/sensory results were all abnormal. The motor nerves in the lower left extremity were abnormally slowed. The sensory conduction in that extremity was also abnormal, as was the EMG in that area.\n\n11) Musculoskeletal dysfunction with arthralgia and myalgia rests on symptoms of crepitance, stiffness, ache, swelling and pains in the knee joints. It rests also on findings on the physical examination of pain and tenderness at the knee joints on deep palpation.\n\n12) Severe immune dysfunction with suppression rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: abnormally depressed gamma A\n\nMitogen challenge: abnormally depressed PHA stimu-\n\nlation net CPM\n\nabnormally depressed CON A stimu-\n\nlation index\n\nWhite blood cells: abnormally depressed total white\n\ncells\n\nabnormally depressed T lympho-\n\ncytes\n\nabnormally depressed segs\n\nabnormally depressed eosinophil\n\n[Midwest/Wheeler Laboratory Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally depressed OKT-11\n\ncells\n\nabnormally elevated NKH-1\n\n[natural killer] cells\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nThe Turley family -- James with wife Kay, and children Lisa, Lyle and Lance -- were prompted by the odors, fumes and other Alcolac emissions and by the effects of those pollutants on their physical well-being, to remove to Texas at the end of May, 1981.\n\nPROGNOSIS: Poor.\n\nKAY TURLEY AGE 44 LIFE EXPECTANCY 38.85 YEARS\n\nDIAGNOSIS Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic conjunctivitis\n\n2) chronic rhinitis and pharngitis\n\n3) chemical bronchitis [in remission]\n\n4) liver dysfunction including:\n\na. chemical hepatitis\n\nb. abnormal proteiin metabolism\n\nc. abnormal lipid metabolism\n\nd. abnormal iron metabolism\n\ne. abnormal porphyrin metabolism\n\n5) central nervous system dysfunction with depression\n\n6) peripheral polyneuropathy with axonal degeneration\n\n7) possible abnormal red blood cell metabolism\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic conjunctivitis rests on symptoms of irritation, redness and itching of the eyes following exposure to the Alcolac odors and emissions.\n\n2) Chronic rhinitis and pharyngitis rests on symptoms of nasal congestion and irritation and sore throat. It rests also on the finding on physical examination of swollen mucosa. The family moved away from the Alcolac discomfort in May of 1981, and her history notes that since that removal the irritations of the eyes, nose and throat have not returned. The physical examination at CCA in 1984, some three years later, found her nose quite swollen. That signified, Dr. Carnow explained, that the conditions are merely in remission, but Kay Turley remains more sensitive than others to exposures of any irritant to the mucous membrane. It is the manner of chronic disease to be in occasional remission, cut it never fully heals itself, the evaluator explained.\n\n3) Chemical bronchitis [in remission] rests on symptoms of shortness of breath.\n\n4) Liver dysfunction including chemical hepatitis, abnormal protein metabolism, abnormal lipid metabolism, abnormal iron metabolism, abnormal porphyrin metabolism, rests on the results of the laboratory tests of those liver functions. The porphyrins were abnormal: the coproporphyrins at 92 [normal, 3 to 56] signifies a coproporphyrinuria; the porphobilinogen at 1.7 [normal, 0 to 1.5] was abnormally elevated. The iron metabolism was quite low at 43 [normal, 65 to 175]. The enzyme SPGT was abnormally elevated -- an indication of liver inflammation and chemical hepatitis. The lipid metabolism was also abnormal. The cholesterol was very high at 298 [normal, 140 to 270, although \"you don't see a lot of women at 270\"]. The LDL cholesterol was also abnormally elevated at 212 [normal, up to 185].\n\nThe danger of porphyria, the expert repeated, is that the person \"can go into a porphyrin crisis at any time which can be life threatening.\" The disease can result in extreme agitation of the person and \"very serious personality deficits,\" even psychotic behavior. It can manifest as very severe abdominal pain. A porphyrin crisis can also cause residual brain damage. He concluded: \"There are no good treatments for this .\"\n\n5) Central nervous system dysfunction with depression rests on symptoms of depression and a Beck depression inventory at 12 [normal, 0 to 10]. The subdiagnosis was \"mild depression.\"\n\n6) Peripheral polyneuropathy with axonal depression rests on the results of the EMG, PNVC/Motor and PNVC/Sensory test. They all show abnormal motor and sensory nerve conduction in the lower left extremities and EMG changes that represent nerve fiber destruction.\n\n7) Possible abnormal red blood cell metabolism rests on the results of the tests administered by Midwest/Wheeler laboratory in 1985. The count of the red blood cells was depressed. The mean corpuscular hemoglobin was abnormally elevated, as was the mean platelet volume. The immune panel administered by Bioscience in 1984 disclosed two white blood cell abnormalities: somewhat elevated segs and 0 eosinophils. The immune panel administered by Midwest/Wheeler laboratory in 1985 found no irregularity in the immune system. The chart for DIAGNOSIS of Kay Turley enters no subdiagnosis of immune system dysfunction or suppression.\n\nPROGNOSIS: Very guarded/poor.\n\nLISA TURLEY AGE 21 LIFE EXPECTANCY 61.19 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis and pharyngitis\n\n2) chemical bronchitis\n\n3) liver dysfunction, including:\n\na. abnormal protein metabolism\n\nb. abnormal iron metabolism\n\nc. abnormal porphyrin metabolism\n\n4) cardiac dysfunction\n\n5) possible central nervous system damage with\n\ndepression\n\n6) peripheral polyneuropathy\n\n7) musculoskeletal dysfunction with polyarthralgia\n\nand polymyalgia\n\n8) probable chemical contact dermatitis\n\n9) immune system dysfunction\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis and pharyngitis rests on symptoms of frequent nasal congestion and discharge and wheezing following exposure to the Alcolac odors and emissions. There was also symptom of sore throat. The subdiagnosis rests also on the finding of swollen mucosa on physical examination.\n\n2) Chemical bronchitis rests on symptoms of cough and wheeze and upper respiratory irritation. Her episodes of cough lasted over more than a day.\n\n3) Liver dysfunction, including abnormal protein metabolism, abnormal iron metabolism, abnormal porphyrin metabolism, rests on the results of the laboratory tests of those liver functions. The FT [free thyroxin] index was 5.7 [normal, 5.8 to 10.6] and represents an abnormality of protein metabolism. The iron metabolism was abnormal, as was the prophyrin metabolism. The uroporphyrins were abnormally elevated at 30 [normal, 4 to 22] and represented \"a very serious porphyria.\" The coproporphyrins were 92 [normal, 3 to 56], and the porphobilinogen was elevated at 1.8 [normal, 0 to 1.5]. That condition of liver damage and dysfunction for a person that young [21 years of age] was \"just very bad,\" the evaluator concluded.\n\n4) Cardiac dysfunction rests on symptoms of chest pain and on the finding on physical examination of abnormal heart rhythm -- a \"gallop.\"\n\n5) Possible central nervous system damage with depression rests on symptoms of headache, recurrent biweekly and about six hours in duration. The headaches continue to persist even though the family has been gone from the Alcolac environs in May of 1981, and are now accompanied by swelling of the head. The subdiagnosis rests also on the Beck depression inventory of 16 [normal, 0 to 10]. The neurologist examiner described her condition as that of \"mild depression.\"\n\n6) Peripheral neuropathy rests on symptoms of painful hands related to her joints and also on the finding of decreased or absent deep tendon reflexes on the physical examination. All of the reflexes were abnormal: at the biceps, the knee, the ankles, the triceps and wrist. The evaluator concluded: \"That is evidence of a diffuse polyneuropathy.\"\n\nThe history of Lisa Turley shows that Lisa Turley was a competitive swimmer and incurred an injury to the shoulder during her high school attendance in Sedalia. An arthrogram was administered and she reacted to the dye. In response to the cross-examination as to whether that episode caused or contributed \"to any part\" of the peripheral polyneuropathy and musculoskeletal dysfunction diagnosed for Lisa Turley, the evaluator responded that the shoulder injury was the consequence of the attempt by a person with polyneuropathy and with muscles which have been metabolically poisoned \"to try to use the muscles and joints the way other people do.\" She cannot, however because the nerves have been damaged by the chemical poisons, and so are not attached to the joint as would be normal. In consequence, \"they don't pull right,\" and attempted use in a normal manner -- as by competitive sport -- traumatizes both the muscles and the joint.\n\n7) Musculoskeletal dysfunction with polyarthralgia and polymyalgia rests on symptoms of joint stiffness, pain and aches. The pain symptoms pervaded all of her joints and were almost continuous and unremitting. The pain persists even though the family has been removed from Sedalia since May of 1981.\n\n8) Probable chemical contact dermatitis rests on symptoms of intermittent skin rash. The medical history contains an entry from a Texas hospital record in 1983 which diagnoses the condition as chloracne from pool chlorination. Dr. Carnow concluded that the entry was a misdiagnosis. He explained that chloracne is an acne caused by metabolic disturbance brought about by chlorinated hydrocarbons, such as the dioxins, but not by the chlorine from chlorinated water. It is a condition that does not go away easily. The dermatitis Lisa Turley exhibits, on the other hand, is from exposure to such Alcolac chemicals as the acrylates and methacrylate. That dermatitis does not cling, as does chloracne, but comes and goes. It is not a metabolic disturbance, but a contact disturbance. The hospital diagnosis of the skin condition as chloracne was mistaken.\n\nThe evaluator discounted that her work as graphics designer was related to any of the dermatitis symptoms Lisa Turley exhibited. She gave no history of exposure to heavy solvents sometimes used in graphic design. Lisa Turley was interviewed on that aspect of her personal history by Dr. Conibear [a CCA partner], a physician with special competence in that area, and her interview discovered no such exposure.\n\n9) Immune system dysfunction rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nMitogen challenge: abnormal PHA stimulation net CPM\n\nWhite blood cells: abnormally elevated total lymphyo-\n\ncytes\n\nabnormally depressed total white\n\ncells\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally depressed T/4 to T/8\n\n[suppressor to helper] ratio\n\nHematologic system: abnormally elevated mean platelet\n\nvolume\n\nPROGNOSIS: Very guarded to poor.\n\nWILLIAM LANCE TURLEY AGE 22 LIFE EXPECTANCY 55.16 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic bilateral conjunctivitis\n\n2) chronic rhinitis and pharyngitis with recurrent\n\nbleeding\n\n3) liver dysfunction including:\n\n4) reproductive system dysfunction\n\n5) chronic chemical dermatitis with probable hyper-\n\nsensitivity component\n\n6) immune system dysfunction with depression\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic bilateral conjunctivitis rests on symptoms and physical finding of watering of the eyes following exposure to the Alcolac odors and emissions.\n\n2) Chronic rhinitis and pharyngitis with recurrent bleeding rests on symptoms of nose irritation, congestion and discharges of blood and on the physical finding reddened mucosa on examination. He was seen by a physician in 1980 for the nasal congestion and nosebleeds, was tested for allergy, but none was found. The diagnosis was irritation. The pharyngitis component rests on symptoms of throat soreness which recur.\n\n3) Liver dysfunction including abnormal porphyrin metabolism, abnormal prothrombin time, rests on the results of the tests of those functions of the liver. The coproporphyrin was elevated at 114 [normal, 10 to 109]. The prothrombin time was less than 60%, an abnormal value. These abnormalities both signify liver dysfunction.\n\n4) Reproductive system dysfunction rests on the results of the fertility analysis. The total sperm count was depressed at 52,000,000. The 42% abnormal count was low. The motion and grade were also abnormal. The activity percent was also abnormally low: 60% of the sperm were still alive at 30 minutes, and 45% active at 4 hours. Dr. Carnow concluded from these results: \"e would have difficulty in fathering a child, but he probably could if he tried long enough.\"\n\nIn response to cross-examination, Dr. Carnow responded that a prior diagnosis of recurrent prostitis entered on a medical record of December 14, 1977, does not bear on the subdiagnosis of reproductive systemic function as an effect of the Alcolac chemicals. The prostate, the witness explained, has nothing to do with the production of sperm, and hence does not impinge on the reproductive dysfunction diagnosed. Rather, the prostate functions only to secrete a fluid which keeps the sperm alive until they reach the egg.\n\n5) Chronic chemical dermatitis with probable hypersensitivity component rests on symptoms of skin rash, itch and bullae following exposure to the Alcolac odors and emissions.\n\n6) Immune system dysfunction with depression rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nImmunoglobulin: depressed gamma M at 69 [normal,\n\n80 to 310]\n\nWhite blood cells: abnormally depressed total white\n\ncells\n\nabnormally depressed segs\n\nabnormally elevated total lympho-\n\ncytes\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated NKH-1\n\n[natural killer] cells\n\nHematologic system: abnormally elevated mean corpuscu-\n\nlar hemoglobin] [two other un-\n\nspecified abnormalities]\n\nPROGNOSIS: Very guarded.\n\nLYLE TURLEY AGE 9 LIFE EXPECTANCY 67.81 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) left otitis media with residual scarring\n\n2) recurrent chemical bronchitis\n\n3) liver dysfunction, including:\n\na. abnormal protein metabolism\n\nb. possible abnormal porphyrin metabolism with\n\nabnormal coproporphyrin/uroporphyrin ratio\n\n4) immune system dysfunction with suppression\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Left otitis media with residual scarring rests on history of chronic ear infections and finding of inflammation of the middle ear on physical examination.\n\n2) Recurrent chemical bronchitis rests on symptoms of persistent hacking cough following exposure to the Alcolac odors and emissions. It was a continuous symptom from 1978 until May of 1981, when the Turley family moved to Texas. There was an occasion of early broncho-pheumonia during the Sedalia period. That infection was cured, but the cough persisted. The treating physician ordered an immunoglobulin panel, since the recurrent and insistent coughs caused him concern that there might be something amiss with the immune system of the boy, Lyle Turley. The IgG -- which protects against infection -- was abnormal.\n\nIn March of 1983, two years after the move away from the Sedalia environs, Lyle Turley was diagnosed in a Texas Air Force hospital for cough and sore throat. Dr. Carnow considered that symptom a continuation of the manifestations from exposure to the Alcolac chemicals. It was merely one in a progression of infections that Lyle experienced: Infection of the eye, infection of the ear, a purulent conjuctivitis, otitis media, and the bronchial cough. Those recurrent infections were the consequence of the abnormal immune system the laboratory tests also found -- an abnormality caused by the Alcolac chemicals.\n\n3) Liver dysfunction, including abnormal protein metabolism, possible abnormal porphyrin metabolism with abnormal coproporphyrin/uroporophyrin ratio rests on the results of the laboratory tests of those liver functions. The ratio of the copro to the uro was abnormally increased. The alkaline phosphatase enzyme was abnormally high at 240 [normal for that child 30 to 95], and may represent liver damage, particularly in view of the calcium abnormality disclosed by the genitourinary laboratory tests. The prothrombin time and lipid metabolism tests of the liver function were not administered, because of the inability to extract a sufficient quantity of blood from the youth for that purpose.\n\n4) Immune system dysfunction with suppression rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune system:\n\nMitogen challenge: abnormally depressed CON A stimu-\n\nlation index\n\nWhite blood cells: abnormally elevated total lympho-\n\ncytes\n\nabnormally decreased T lympho-\n\ncytes\n\nabnormally decreased segs\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune System:\n\nLymphocytes: abnormally elevated OKT-10\n\ncells\n\nabnormally elevated OKT-3\n\n[mature T] cells\n\nabnormally depressed OKT-11\n\n[total T] cells\n\nPROGNOSIS: Very guarded.\n\nRALPH WITHERS AGE 54 LIFE EXPECTANCY 25.51 YEARS\n\nDIAGNOSIS:\n\nChronic\n\nSystemic\n\nChemical\n\nIntoxication\n\ncaused by the\n\nAlcolac toxic chemical with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis\n\n2) chronic obstructive pulmonary disease\n\n3) cardiac dysfunction with coronary artery\n\ninsufficiency\n\n4) liver dysfunction, including:\n\na. abnormal protein metabolism\n\nb. abnormal porphyrin metabolism\n\n5) reproductive system dysfunction\n\n6) immune system dysfunction with suppression\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis rests on symptoms of nasal congestion and on findings of reddened mucosa and exudate on physical examination.\n\nThe medial history discloses that Ralph Winters has experienced a sinus problem intermittently the past ten years with a residual mucosal thickening. That, however, does not relate to the rhinitis attributed to the Alcolac chemicals -- which relates to the tissues of the nose -- Dr. Carnow explained, but to the tissues around the opening of the sinus.\n\n2) Chronic obstructive pulmonary disease rests on symptoms of cough and on the abnormal results of the FEV[1]/FVC pulmonary test. He had the ability to get only 58% of the air out of his lungs in one second, rather than the normal 70% to 75%. That was evidence of a moderate obstructive defect.\n\n3) Cardiac dysfunction with coronary artery insufficiency rests on the EKG. It shows that the heart is not getting enough blood, a condition diagnosed as coronary insufficiency.\n\n4) Liver dysfunction, including abnormal protein metabolism, abnormal porphyrin metabolism, rests on the results of the tests for those liver functions. There were three abnormal prophyrins: the pentacarboxylic was elevated at 5 [normal, 0 to 4]; the coporoporphyrin was elevated at 131 [normal, 10 to 109]; the porphobilinogen was elevated at 1.9 [normal, up to 1.5]. The protein metabolism was also abnormal: the gamma globulin A was elevated.\n\n5) Reproductive system dysfunction rests on the fertility analysis. The total sperm count was normal, but the activity was abnormal [only 60% live sperm after 30 minutes [normal, greater than 80%], and there was an abnormal morphology [40% of the live sperm was abnormal].\n\n6) Immune system dysfunction with suppression rests on the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmunoglobulin: abnormal elevation of gamma G at\n\n1510 [normal, 700 to 1500]\n\nMitogen challenge: abnormal PHA stimulation net CPM\n\nat 24,555 [normal, over 62,000]\n\nabnormal PHA stimulation index at\n\n89 [normal, over 130]\n\nabnormal CON A stimulation net\n\nCPM at 4800 [normal, over\n\n12,000]\n\nabnormal CON A stimulation index\n\nat 18 [normal, over 40]\n\nabnormal PWM stimulation net CPM\n\nat 6994 [normal, over 8000]\n\n[Midwest/Wheeler Laboratory Test results, 1985]\n\nImmune system:\n\nLymphocytes: abnormally elevated NKH-1\n\n[natural killer] cells at 29.4%\n\n[normal, 8 to 22%]\n\nabnormally elevated total NKH-1\n\n[natural killer] cells\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nabnormal mean platelet volume\n\nabnormal random distribution\n\nPROGNOSIS: Very guarded to poor.\n\nGENEVIEVE WITHERS AGE 54 LIFE EXPECTANCY 29.51 YEARS\n\nDIAGNOSIS: Chronic Systemic Chemical Intoxication caused by the\n\nAlcolac toxic chemicals with damage to multiple organ\n\nsystems, including:\n\n1) chronic rhinitis\n\n2) early vascular insufficiency\n\n3) liver dysfunction, including:\n\na. abnormal porphyrin metabolism\n\nb. abnormal lipid metabolism\n\n4) central nervous system damage, including:\n\na. cerebellar dysfunction\n\n5) mild peripheral neuropathy\n\n6) immune system dysfunction with suppression\n\n7) polyarthralgia and polymyalgia\n\nThe witness then explained the data on which these components of subdiagnosis rest.\n\n1) Chronic rhinitis rests on symptoms of nasal congestion and sneezing following exposure to the Alcolac odors and emissions and on the findings of reddened mucosa and exudate on physical examination.\n\n2) Early vascular insufficiency rests on the finding on physical examination of diminished peripheral pulse and on the abnormal triglycerides result of the protein metabolism test. To cross-examination inquiry whether the diagnosis of diabetes in 1980 caused or contributed to cause the early vascular insufficiency manifestation, Dr. Carnow responded that it did not. He explained that the modus operandi of chemical sand of the diabetes condition differ as a cause of vascular insufficiency. The chemicals work through the nervous system to narrow the blood vessels to bring on that condition. The physical examination of her peripheral nervous system disclosed diminished pulses in the lower extremities of Genevieve Withers. The diabetes, on the other hand, \"work through a slow process of hardening of the artery and laying down of cholesterol and narrowing the artery would happen over many years.\" The diabetes of 1980 could not have caused the early vascular insufficiency, but it is possible it could have contributed.\n\n3) Liver dysfunction, including abnormal porphyrin metabolism, abnormal lipid metabolism rests on the results of the laboratory tests of those liver functions. The heptacarboxylic porphyrin was depressed. The lipid metabolism was extremely disturbed: the triglycerides were very high at 600 [normal, to 150], which indicated that \"er blood vessels were being coated with cholesterol.\" The phenotype was also abnormal. Dr. Carnow described the condition as \"very dangerous.\"\n\nIn response to cross-examination whether the 1980 condition of diabetes caused or contributed to cause the abnormal lipid metabolism manifestation, Dr. Carnow responded that \"her lipids were probably aggravated by the development of the diabetes.\" He noted a prior history of occasional episodes of high blood sugar in 1966 and 1968. Also, in 1976, her triglycerides were at about 440, already considerably above normal. Her uric acid was also elevated. There was never any sugar in the urine until 1980, however, and the earlier occasions of elevated sugar were not diabetes. Thus, there was a tendency to diabetes, but the condition itself did not appear until 1980. Her lipids may have been aggravated by the diabetes, but at 600 they were even much higher than one would expect in a diabetic.\n\n4) Central nervous system damage, including cerebellar function, possible cerebral dysfunction, rests on symptoms of decreased concentration and recent memory loss, sleep disorders and headache, and on the finding of swaying on physical examination.\n\n5) Mild peripheral neuropathy rests on symptoms of cramps, pain, tingling and numbness in the hands and feet.\n\n6) Immune system dysfunction with suppression rests on the results of the immune panels administered by Bioscience in 1984 and Midwest/Wheeler in 1985.\n\n[Bioscience Laboratory Test Results, 1984]\n\nImmune systems:\n\nImmunoglobulin: abnormally elevated gamma A\n\nabnormally decreased gamma M\n\nWhite blood cells abnormally elevated total lymph-\n\nocytes\n\nabnormally elevated T lymphocytes\n\nabnormally depressed segs\n\n[Midwest/Wheeler Laboratory Test Results, 1985]\n\nImmune system:\n\nLymphocytes: depressed NKH-1 [natural killer]\n\ncells\n\nHematologic system: abnormal mean corpuscular hemo-\n\nglobin\n\nabnormal random distribution\n\nPROGNOSIS: Very guarded to poor.\n\nThe PROGNOSIS was the final entry on the DIAGNOSIS chart of each of the patient plaintiffs. The prognosis, as Dr. Carnow explained, constituted the forecast as to \"what can this patient expect as a result of the exposure, the absorption and the damage that was done.\" The prognosis was determined by \"what we know about what these chemicals can do\" in terms of the personal profile of the patient and the extent and kind of damage already done to the person. The prognosis good means that after a brief discomfiture, the patient almost certainly will recover. The prognosis guarded means there is some irreversible damage and impairment of the quality of life, and some life shortening. It means the condition will probably not worsen much. Very guarded means that the person has been damaged, there is life shortening and the condition will deteriorate over time. It is characteristic of chronic disease, \"that people go down sort of stepwise\" -- the body deteriorates, attempts to recover, but is never restored to the condition before injury. Poor means the condition is life shortening and will deteriorate rapidly, and survival over a period of time is questionable. Negative means that the person probably will not stabilize and will not survive more than months or a few years.\n\nThe prognoses actually entered as to the several plaintiffs ranged from very guarded to negative. That means that the forecast as to every plaintiff was for a life shortening and a condition of organ and function damage certain to deteriorate over time. In the case of Mary Landon, the negative prognosis forecast that she would not survive more than months or a few years. She died in May of 1986 while appeal pended. In addition to the discrete prognosis entered for each, Dr. Carnow forecast as a reasonable medical certainty that 11 of the plaintiffs are \"at extraordinary risk to cancer,\" and attributed two reasons. First, they have been exposed over a long time to a number of Alcolac carcinogens: epichlorohydrin, glycidyl ether, and ethyl acrylate. Among them, epichlorohydrin is a direct carcinogen and needs no metabolic activation to start cancer other than the chemical itself. Epichlorohydrin also attacks the chromosomes. There are also mutagens among the Alcolac toxicants: epichlorohydrin, methylene chloride, ethyl acrylate, dimethyl sulfate. Their effect is to alter DNA and the way a cell reproduces itself, and so may induce a line of deformed and even neoplastic cells. Second, the immune system, the major defense against cancer, has been severEly damaged in most plaintiffs. The effect of chronic exposure to epichlorohydrin, dimethyl sulfate and toluene is to toxify the cells and suppress the immune system. Thus, these same chemicals which alter DNA also alter the immune system so that they cannot fight the cell pathology engendered by the chemical alteration of DNA. It was the opinion of immunologist Zahalsky that all thirty-one plaintiffs suffer from \"systematic, progressive chemical intoxication\" of the immune system and are subject increasingly to a variety of diseases, \"including, but not exclusively, neoplastic disease .\"\n\nThe forecast of an increased risk of cancer was articulated by Dr. Carnow in these terms: \"f these people live long enough, they will die from a malignancy.\" That prognosis, he explained, was qualified by a competing risk. Since the plaintiffs in one degree or another all suffer from systemic poisoning, and since the latency period for cancer extends to some twenty years, it may well be that some of them may die from another organ disease caused by the exposure to the Alcolac chemicals -- such as porphyria or liver disease -- before the cancer. The prognosis of increased risk of cancer rested on a reasonable medical certainty, and could not be quantified further. He explained: \"There is not enough information in science to do that.\"\n\nThe environmental medicine expert came to the determination that the manifestations diagnosed as chronic system intoxication were the result of exposure to the Alcolac toxicants only after other alternative causes of the source of injury and of the biological disease found were eliminated.\n\nThat expert opinion was a Conclusion drawn from these assumed facts already in evidence: A cluster of plants operated in the industrial area a short distance southwest of Alcolac -- DeLong was a welding operation, Quality Fiberglass manufactured TV satellite dishes, Missouri Pressed Metals manufactured bearings and bushings, and the Missouri Pacific Railroad yards maintained railroad equipment. Two of these plants, Missouri Pressed Metals and Missouri Pacific Railroad, used chemicals of some toxicityin their operations.\n\nThe evidence was that Missouri Pressed Metals commenced manufacture several years before Alcolac did in 1978. In the production process, Missouri Pressed Metals used a solution of trichloroethane mixed with animal fat to remove grease from the bearings and bushings. Trichloroethane evaporates very quickly and gives off the odor of alcohol. It has a very low toxicity but causes irritation to the eyes and irritation to the skin -- symptoms many of the pLaintiffs exhibited. The trichloroethane vapors were vented into the air during the dipping process. The sludge residue of the dipping mixture was accumulated in a 55 gallon drum and took about one year to fill. It was formerly spread around the plant acreage as a weed-killer for disposal. It is now transported away. The advisory data from Dow Chemical Company, the manufacturer, states that small amounts of the chemical can be placed on the ground and allowed to evaporate safely. These methods of venting of the vapors and occasional disposal of the liquid residue have never been cited by OSHA, which periodically inspects the plant, or by the Missouri Department of Natural Resources. There is no evidence that anyone has ever experienced any alcohol odor from any source, Missouri Pressed Metals included.\n\nThere was evidence that the Missouri Pacific Railroad car repair yard was registered with the EPA as a hazardous waste generator in 1980. That facility operates not only a repair shop but a sign shop. The signs are made by a silk screen process which uses a Dupont thinner composed of 66 percent toluene, among other chemical compounds. The spray paint guns used in the car repair shop are cleaned with the same Dupont thinner used in the sign silk screen process. The thinner was identified as a potentially hazardous waste by the DNR, \"probably toxic due to its toluene content.\" The thinner waste liquid is generated at the rate of about 100 gallons per month and has been disposed of on-site for at least eight or nine years in a series of pits on the edge of the property. A transposition of gallons into pounds of toluene of 100 gallons of liquid 66% toluene equals 66 gallons of toluene. That reduced to 528 pounds per month, or 6336 pounds per year, or about one-third of the annual use by Alcolac.\n\nIt was the virtual unanimous evidence form the plaintiff and nonplaintiff residents of the environs that there was no annoyance for the odors or emissions from these and the other industrial sources, but only from Alcolac. Some among the witnesses described an odor of lacquer from Quality Fiberglass on occasion, but fleeting and without physical consequences. A number of the witnesses resided close by these plants for some years, but they were never the cause of annoyance, complaint or symptom. The public official witnesses agreed that there had been no citizen complaints of odors or emissions or physical complaints from the operation of the other plants in the vicinity -- but only as to Alcolac. It was not until Alcolac began operations in May of 1978 that any odors or other emissions were palpable, and not until then were any ill effects to their persons felt. This, the environmental medicine expert Carnow testified, was already known to him from the interviews of the patient plaintiffs.\n\nThese facts assumed, Dr. Carnow gave the opinion that none of the manifestations of the diagnoses of the plaintiffs could be attributable to any of these industrial sources as the cause of their bodily diseases, except only Alcolac. In summary, the determination by the expert that Alcolac only was the point source for the bodily manifestations of disease diagnosed in every plaintiff derived from (1) the effect of the evidence that those who lived in the environs, plaintiff and nonplaintiff alike, identified Alcolac as the source of the odors and emissions which caused them symptoms and discomfort (2) on the miniscule quantity of toxic matter generated by Missouri Pressed Metals and Missouri Pacific Railroad compared with the hundreds of thousands of pounds of epichlorohydrin and other toxic compounds used by Alcolac every year (3) on the systems used by the other industrial operations to dispose of their toxic waste -- Missouri Pacific deposited the toluene mixture into covered pits -- and Missouri Pressed Metals vented them in a manner not objectionable to the DNR (4) on the \"tremendous amount\" of toxic pollutants emitted into the atmosphere from thousands of pyrolsis products generated from the malfunctioning liquid incinerator and from the regular discharge of monomer waste, still toxic and contaminated, into the bioponds, and (5) on the known effects of many of these toxic wastes emitted by Alcolac as metabolic poisons to the entire body system.\n\nThe determination by the environmental medicine expert that the bodily diseases found in each plaintiff were the result of exposure to the Alcolac toxic emissions, in turn, was through the process of differential diagnosis. It is a diagnosis of disease derived only after other recognized alternative causes have been eliminated. In that exercise, Dr. Carnow took into account the personal and medical history of each of the patient plaintiffs, the impingement of the work occupations, the age, gender and other idiosyncratic factors. Thus, a preexistent diabetes impinges on the protein metabolism function of the liver -- and was taken into account to eliminate the Alcolac chemicals as the cause of a manifestation of disease based on an abnormal test result of that function. Thus, also, a symptom of blurred vision -- a common complaint among all the plaintiffs -- can be caused by cataract as well as by a swollen cornea with iritis, a condition expected from exposure to a number of the Alcolac chemicals. The manifestations as finally entered on the DIAGNOSIS chart of each plaintiff was as finally defined by the interview history of each,the findings on physical examination, the results of the laboratory tests, the testimony of the plaintiff at the trial, and reexamined by the testimony of the plaintiff at the trial, and reexamined by the testimony and cross-examination of Dr. Carnow. The manifestations were then expressed as caused by the Alcolac toxic emissions, aggravated by them, or in some cases, reconsidered and deleted from diagnosis. The diagnosis itself was in each case the generic determination: chronic systemic chemical intoxication caused by the Alcolac toxic chemical. There is, however, no differential diagnosis to explain the chemical systemic intoxication except \"another systemic poison\" -- and there was no evidence that \"all of these people\" had been poisoned in some other way. Environmental medicine, he explained, deals with probability, and in circumstances such as plaintiffs present of common symptoms, physical findings and abnormal test results as to multiple organ systems, the cause of the systemic chemical intoxication was Alcolac.\n\n\u003cspan class=\"fn\"\u003e* Died during pendency of appeal and the spouse was substituted as party by order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49 It was the evidence that all thirty-one plaintiffs presented themselves to immune panels administered by the Bioscience Laboratory in Chicago in August of 1984 as arranged by CCA. All five of the Turley family -- James, Kay, Lance, Lisa and Lyle -- were included. The second immune panels were administered by KU Medical Center in December of 1984 under a protocol defined by the Alcolac experts. That protocol excluded ten of the plaintiffs -- Kay Turley and Lyle Turley among them. The third regimen of immune panels were administered by the Midwest/Wheeler Laboratory in Kansas City in July of 1985 and was arranged by plaintiff immunologist Zahalsky and plaintiff expert Carnow. It included all thirty-one plaintiffs, but was administered to twenty-six of the plaintiffs at the time scheduled. Mary Landon was by that time under a regimen of cobalt for the treatment of abdominal cancer -- itself a cause of immune system suppression -- so an a definitive result as to whether any dysfunction or suppression of the immune system then found was attributable to exposure to the Alcolac chemicals. The Turley family had removed from Sedalia to Texas in May of 1981 and were not available for examination at the Midwest/Wheeler Laboratory in July of 1985.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eImmunologist Zahalsky was presented by the plaintiffs to evaluate the state and function of the immune system of each of the plaintiffs based upon the immune panel results then available to him -- from Bioscience for all thirty-one of the plaintiffs, from K.U. Medical Center for twenty of the plaintiffs selected by the Alcolac protocol for that procedure, and from the Midwest/Wheeler panels. It was the testimony of Dr. Zahalsky that the five Turley family members did not present themselves to Midwest/Wheeler, and therefore his evaluation of the function and regulation of their immune systems rested on the Bioscience Laboratory results [which included all the Turleys] and on the K.U. Medical Center reports [which excluded Kay and Lyle of the Turley family].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe diagnoses entered by Dr. Carnow on each of the Turley family members and the manifestations of organ disease and dysfunctions of the immune system these diagnoses encompass, however, rest not only on the results of the Bioscience Laboratory immune panels, but also the results from a Midwest/Wheeler procedure.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn the case of James Turley the immune system subdiagnosis entered by Dr. Carnow was severe immune dysfunction with suppression. For Kay Turley, no immune dysfunction was diagnosed, but possible abnormal red blood cell metabolism was entered -- presumably on the basis of a laboratory test of the hematologic system. For Lisa Turley, immune system dysfunction was diagnosed, once again expressly on results from both Bioscience and Midwest/Wheeler. For Lance Turley, immune system dysfunction with depression was diagnosed form the test results of those laboratories, and for Lyle Turley, immune system dysfunction with suppression was also diagnosed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is to be noted, that this evidence of subdiagnoses entered by Dr. Carnow for the Turley family members which rested on immune panel results from both Bioscience and Midwest/Wheeler [in apparent contradiction of the testimony of immunologist Zahalsky that the Turley family members did not present themselves for the Midwest/Wheeler regimen conducted in July of 1985] came in without objection, and hence with presumptive validity. We assume therefore, that the contradiction between the Carnow and Zahalsky testimony is only apparent. The immunologist Zahalsky gave his narrative to the court and jury on September 9, 1985. Dr. Carnow entered his immune system subdiagnoses as to the Turley family members on October 15, 1985. We assume that in that interim between the testimony by Dr. Zahalsky and Dr. Carnow, the Turley family members presented themselves in Kansas City of or the immune panel regimen earlier administered to the other plaintiffs.\u003c/span\u003e\n\n",
    "body_length": 210598,
    "citedas": [
      "765 S.W.2d 42"
    ],
    "attorneys": "Lantz Welch \u0026 Timothy L. Brake, Charles Fairchild \u0026 J. R. Hobbs, Linde Thomson Fairchild Langworthy, Kohn, for Appellant Alvin D. Shapiro \u0026 Martha A. Fagg, Patrick A. Woodley, for Respondent",
    "category": [],
    "judges": "Before Shangler, P.j., Manford and Nugent, JJ.",
    "citation_count": 0
  }
}
