{
  "id": "i6J4R2YBTlTomsSBelhm",
  "document": {
    "title": "People v. Memro",
    "full_title": "THE PEOPLE AND v. HAROLD RAY MEMRO AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1995-11-30T00:00:00.000Z",
    "docket": "No. S004770",
    "body": "MOSK, J.:\n\nIn People v. Memro (1985) 38 Cal. 3d 658, 214 Cal. Rptr. 832, 700 P.2d 446 (Memro I), we reversed a judgment imposing a death sentence under the 1977 death penalty statute. The district attorney filed a new information in Los Angeles County Superior Court on May 13, 1986, charging defendant with the murders of Scott Fowler and Ralph Chavez, Jr., in July 1976, and of Carl Carter, Jr., in October 1978. The information also contained a multiple-murder special-circumstance allegation.\n\nA jury heard the evidence and found defendant guilty of the first degree murders of Carter and Chavez and of the second degree murder of Fowler. It found the special circumstance true. After a penalty trial, it returned a verdict of death and judgment was entered accordingly. This appeal proceeds automatically.\n\nFor reasons that will appear, we affirm the judgment.\n\nFACTS\n\nA jogger found the bodies of Scott Fowler and Ralph Chavez, Jr., sprawled 178 feet apart near a pond in John Anson Ford Park in Bell Gardens early on the morning of July 26, 1976. Fowler was 12 years old, Chavez 10. Each victim's throat had been cut with a sharp instrument. Witnesses testified that the boys had been fishing for hours the day before, staying well into the evening. They were placing their catch in a plastic gallon-size milk jug with the top excised so as to keep the handle intact. The police found the jug nearby, along with bologna wrappers, which were evidence of the boys' picnic. A trail of blood suggested that Chavez had tried to run after the attack. The medical examiner fixed the time of death at about midnight.\n\nCarl Carter, Jr., was reported missing in South Gate on October 22, 1978. He was seven years old. His body was found some five days later amidst dense scrub alongside a road. He had been strangled to death-a cord was still bound around his neck. An enzyme found in his anal area suggested an attempt at sodomy.\n\nI. GUILT PHASE\n\nA. The Prosecution's Case\n\nThe prosecution's case was based almost entirely on defendant's confession, which he gave during the last of three interrogations at the South Gate city jail.\n\nThe police became aware of defendant when they were interviewing individuals who might have information regarding Carter's whereabouts. They went to his apartment, and he introduced himself by saying, in the words of Officer William Sims, \"I knew you were coming. I've been to Atascadero State Prison.\" At the time, there was wide awareness in South Gate that Carter was missing.\n\nAt the apartment, defendant and the police discussed Carter's disappearance. Defendant either said nothing about Carter at all or provided no useful information. The police returned to the Carter residence, and while they were there, defendant came over to drop off a part for his Volkswagen with Carl Carter, Sr., an occasional automobile repairer. Officer Sims testified that he asked him where he had been and what he might have seen on the night he dropped off his car. Officer Sims testified that he told him, \"'I remember now . . . . I took-I came to the Sizzler for dinner.' . . . He said it was just before dark, and he had come up to the Carter residence . . . to talk to Carl Carter, Sr., about working on his Volkswagen. [P] Stated that when he got to the rear of the house that Carl Carter, Jr., was at the rear and they had a short conversation, and he . . . had taken him for a Coke.\"\n\nOfficer Sims then arrested defendant for kidnapping.\n\nThere followed the three interrogations that evening at the jail. At the third, four officers were present: Sims, Lloyd Carter, Louie Gluhak, and Dennis Greene. Officer Sims treated defendant severely and Officer Carter more kindly. If this was a psychological tactic, it evidently worked, for Officer Carter, an experienced police investigator, won defendant's confidence. Officer Carter took notes of his confession, but it was not transcribed or taped-in fact defendant requested that all policemen except Officer Carter leave the room so that he could check it for bugs before making a statement.\n\nAfter they returned, defendant told his story. Officer Carter testified that he \"stated that he had known Carl Carter, Jr.'s, father for quite some time, that he was a personal friend of his, [and] that he was a mechanic . . . .\n\n\"He decided it would be a good time to stop and talk to him about repairing his Volkswagen. That he pulled in the back of Carl [Carter], Sr.'s, house and was preparing to exit his car when little Carl, Jr., rode up on his bicycle. . . .\" Carter said he wanted a soft drink and defendant invited him into his car and drove him to his apartment. \"He said the reason he wanted to take him over to his apartment was-that he liked to take pictures of little boys in the nude and he was hoping to take some pictures of Carl, Jr., in the nude. He said he went into his apartment and took him into his bedroom, and he turned on these real fancy strobe lights. And these lights began flashing on and on and he said that Carl, Jr., seemed to be fascinated with these lights.\"\n\nShortly thereafter Carter said he wanted to leave. This made defendant angry. He \"grabbed the clothesline that he had on the nightstand there and put it around Carl, Jr.'s, neck and choked him. He says he then threw him on the bed and that he took off his clothes and that Carl-then he took off Carl, Jr.'s, clothes, all except his T-shirt, and he said that sometime he taped his hands behind his back with masking tape that he had on the nightstand.\" He then tried to engage in anal intercourse with Carter's dead body.\n\nAfter this, he knew that he needed an alibi, and he decided to use the victim's father for the purpose. \"He knew that he had to get his Volkswagen fixed so he tried to call Carl, Sr., to see if he could get his Volkswagen fixed and Carl said that he could.\"\n\nDefendant arranged to have a friend drive with him to the Carter home. Before the friend arrived, a neighbor boy stopped by and with \"Carl, Jr., . . . still laying in on the bed, [defendant] conversed with [the neighbor boy] for quite sometime, and started showing [him] slide pictures of naked girls.\" The boy left after helping him jump-start his Volkswagen.\n\nHe drove the car over to the Carter residence and dropped it off. He returned to his apartment, \"wrapped Carl, Jr.'s, body in an army-type green blanket and rolled him up in it with his clothes. He said at this point he forgot to put the boy's shoes and socks in the blanket, but the rest of the clothing was in the blanket.\" He \"dumped the body and the blanket over the side of\" a rural road. The next morning, after a troubled sleep, he went to work. He \"had heard about Carl missing because it had been in the newspapers. . . .\"\n\nOfficer Carter testified that defendant told him he had tied a square knot to strangle Carter, and that he had enclosed his shoes in a red suitcase in his garage and put it under a work bench.\n\nOfficer Carter further testified that he invited defendant to confess to any other crimes he might have committed.\n\nDefendant then told Officer Carter that about two years before he had visited John Anson Ford Park in Bell Gardens on a red Yamaha motorcycle to take pictures of young boys. At about dusk he saw two young boys walking toward a pond with fishing poles and what he believed to be a sack lunch. \"He started conversing with them and taking pictures . . . . He says one of the boys was named Scott, and he was a male, white about 13 and blond-headed and good-looking. The other boy was a Mexican boy named Ralph that was a little younger, about 12[;] he said he was fat and ugly.\"\n\nDefendant explained that they had a lunch of bologna sandwiches and that Fowler offered him one. As he lingered with them \"he was thinking about sucking Scott's dick because he liked blonds and just had a thing for young blonds. He says that it finally got real late and Ralph fell asleep on the bank while they were fishing.\" Defendant persuaded Fowler to walk to the other side of the pond. When they got there, he \"just got real smart and said something about fucking faggots. He said this pissed him off, and he grabbed his 2 1/2-inch Barlow knife out of his pocket and bent Scott backwards and slit his throat and put his knee in his back.\n\n\"He says this caused quite a commotion and apparently it woke up Ralph who was asleep over on the other side of the pond. He says Ralph started [waking] up and screaming, that he ran around to where Ralph was and chased him and grabbed him from behind and he says he slit his throat and ran on-and was running across the grassy area to get on his motorcycle.\n\n\"And he says as he was getting on his motorcycle he looked back and Ralph . . . had gotten up from where he had slit his throat and left him and was trying to walk. He said this scared him quite a bit and really made him sick, and he rode his motorcycle on home. . . .\" He discarded his knife at work the next day.\n\nOfficer Carter testified that defendant then \"started crying and sobbing, and he said, 'Let's go find Carl, Jr.'s, body.'\" The police escorted him to the area he had described and found the decomposing body, clad in underwear. A cord was still bound around the neck. Although defendant agreed to take the police to the site, he begged them not to make him look at the scene.\n\nOfficer Carter, accompanied by other members of the South Gate police department, then went to defendant's apartment. There was testimony that he had given them permission to search it. They recovered a pair of boy's shoes and socks in a red suitcase stored partly underneath a workbench. They also found boy's clothing in the suitcase and a length of clothesline that resembled the cord tied around Carter's neck In addition, they found sexually explicit magazines featuring young men and boys, and a wealth of photographs of young boys, \"literally hundreds\" of which showed them unclothed. Some of the photographs were of neighborhood children.\n\nThe next day defendant confessed to Officer Donald Barclift of the Bell Gardens police. In essence he repeated his confession to Fowler's and Chavez's murders. He told Officer Barclift how he had cut the milk jug (see ante, p. __ [typed maj. opn., ante, p. 2]), and chided the police for failing to recover any evidence from it given that \"he had his fingerprints all over it.\" Officer Barclift testified that only the killer could have known precisely how the milk jug was cut so as to leave the handle intact.\n\nThe prosecution's case essentially rested on the foregoing testimony and evidence consistent with it.\n\nThe coroner's representative, Dr. Joseph Choi, testified that the cause of death of both Fowler and Chavez was a cutting wound to the neck, and that Carter was strangled by a rope. Dr. Choi testified that an examination on Carter with an anal swab was \"negative for . . . spermatozoa and two plus for acid phosphatase.\" The positive result for that enzyme revealed the presence of seminal fluid that came from the prostate gland of someone other than Carter.\n\nThe prosecution's theory of the case departed from the confessions as described by Officers Carter and Barclift only in that the prosecutor asserted that defendant either tried to or did have sex with Carter before killing him, rather than making an attempt on his dead body as he described.\n\nB. The Defense's Case\n\nDefendant did not take the stand. He did, however, present a defense.\n\nWith regard to the Fowler and Chavez murders, the defense was alibi. Defendant maintained that his confession was a fabrication based on secondhand knowledge of the killings, which were widely publicized. He theorized that one or both of two men seen near or talking to the children killed them. Certain witnesses recalled seeing two men. Alfie Feliciano remembered a man on a motorcycle and another with a long knife strapped to his belt or his leg. The latter was wearing a green Army jacket. He had no camera, and he talked to Alfie for about an hour.\n\nJose Feliciano, Alfie's brother, told a police officer immediately after the killings that he saw two men near Fowler and Chavez. One of them wore a green Army jacket and had a long hunting knife strapped to his leg. That individual spoke to a man on a yellow offroad motorcycle with a green gasoline tank. In his confession, it will be recalled, defendant said that his motorcycle was red.\n\nScott Bushea, a witness for the prosecution, accompanied Josi Feliciano to the park that evening. He testified that two men were with Fowler and Chavez. Shown in court a picture of defendant taken immediately after his arrest, he testified that the photograph did not depict either of the people he saw at the park. The police prepared a composite sketch of one of the men.\n\nDefendant argued that he could have learned all the details of the killings from media accounts notwithstanding the testimony that only the killer would know how the milk jug was cut. And he asserted that in significant respects his confession failed to match the evidence found at the crime scene or the most plausible inferences to be drawn from that evidence. For example, the person in the composite drawing did not resemble him, and the motorcycle that the witnesses described did not match his.\n\nDefendant conceded that he killed Carter. However, he argued that the killing did not amount to first degree murder: the prosecution's account of his confession showed that he killed Carter in a rage and without reflection.\n\nII. PENALTY PHASE\n\nA. The Prosecution's Case\n\nThe prosecution introduced evidence of prior violent conduct. In May 1972 David Schroeder, the child of neighbors, was nine years old. Defendant beat him and left him bleeding from the face, ears, nose, and the back of the head. The attack was severe enough that the police officer who arrested defendant said he asked whether he had killed him. Schroeder spent the night in the hospital and was left with a nine-inch scar on his scalp. On cross-examination, the jury learned that the police perceived defendant to be distraught and that he told them he did not know why he assaulted Schroeder.\n\nB. The Defense's Case\n\nOver defendant's objection, the defense summoned one witness: Kathy Klabunde, his sister. She testified that their father, an alcoholic, verbally abused the children. Defendant, the eldest, would care for the others. He had migraine headaches \"on and off for years.\" His headaches would cause him to \"get very angry easily. I remember a period where he stayed downstairs for a couple of days where it was dark and cool to stay out of the light because his head hurt.\"\n\nAs stated, defendant sought to bar his sister's testimony-he objected to a specific question at one point and called her a liar from his chair at another. After the jury retired, he asked to reopen the case so that he could testify, and the court acceded to his request. He stated to the jury, \"I just have a short statement I'd like to read to the jury. [P] While I do not concede the truth, accuracy or correctness of the jury's verdicts, I do feel that since the jury has returned the verdicts of guilt in the maximum degree possible on all counts and the special circumstance, that they should also now return with a verdict of death as the appropriate penalty. Thank you.\"\n\nAt closing argument, counsel emphasized defendant's mental problems, his cooperation with the police, lingering doubt regarding the special circumstance in light of his alibi defense to the killings of Fowler and Chavez, the grimness of life imprisonment, his lack of a prior felony conviction, the likelihood that he would not be dangerous in prison, and positive aspects of his background and character, including his remorse when he was discovered.\n\nCONTENTIONS ON APPEAL\n\nI. JURY SELECTION CLAIMS\n\nA. Court's Failure to Conduct Further Voir Dire\n\nAt voir dire the court asked Elva Cazares, a member of the venire, whether she would refuse to vote to return a verdict of first degree murder \"so that you wouldn't even have to get to the death penalty?\" She replied, \"Yes, I think I would.\" It then asked her if she would vote to find the special circumstance allegation false in order to stop a capital penalty phase. She replied, \"Well, it's kind of confusing in that term. But just to sum it all up, I don't believe in the death penalty.\"\n\nThe court asked Julietta Lopez, also a member of the venire, \"If the prosecution proves that the defendant's guilty of first degree murder, . . . would you refuse to vote for that because you know by voting for something other than first degree murder there wouldn't be a death penalty?\" She replied, \"I would.\"\n\nDefendant contends that the court erred in failing to inquire more fully about the basis for the two potential jurors' opposition to the death penalty. The result, in his view, was a violation of a right he asserts to an impartial jury under the Sixth and Fourteenth Amendments.\n\nPotential jurors \"must be excused if their views on capital punishment would prevent or substantially impair the performance of their duties in accordance with the instructions and their oath.\" ( People v. Mayfield (1993) 5 Cal. 4th 142, 169, 852 P.2d 331.) The court's determination resolves \"what is essentially a question of fact or, perhaps more accurately, a mixed question that is essentially factual.\" ( People v. Gordon (1990) 50 Cal. 3d 1223, 1262, 270 Cal. Rptr. 451, 792 P.2d 251.) Accordingly, our review is deferential: we determine whether substantial evidence supported the rulings. (Ibid.)\n\nThe court implicitly ruled that the ability of the two potential jurors in question to follow their oaths was substantially impaired. These determinations were supported by substantial evidence.\n\nFirst, we note that the court excluded the potential jurors on its own motion after eliciting their views on the death penalty, and that counsel failed to object. It continues to be the rule that \"the failure to object does not waive the right to raise the issue on appeal [citation] . . . .\" ( People v. Cox (1991) 53 Cal. 3d 618, 648, fn. 4, 280 Cal. Rptr. 692, 809 P.2d 351.) But the failure to object to the rulings \"does suggest defense counsel's concurrence in the court's assessment of each venireperson's firm and sincere expression of his or her inability to impose the death penalty.\" (Ibid.)\n\nSubstantial evidence supported the court's implicit determination that the ability of the potential jurors to follow the law at the guilt phase was, at a minimum, substantially impaired. Defendant does not persuade us that any constitutional right was violated.\n\nB. Counsel's Failure to Conduct Further Voir Dire\n\nDefendant contends that counsel were ineffective for failing to question sufficiently or at all nine potential jurors, including Cazares and Lopez, who were excused for cause-specifically, for what he terms \"a general opposition to the death penalty.\"\n\nIt is fundamental that \"a defendant claiming ineffective assistance of counsel must show both deficient performance under an objective standard of professional reasonableness and prejudice under a test of reasonable probability of a different outcome.\" ( People v. Davis (1995) 10 Cal. 4th 463, 529, 896 P.2d 119, citing Strickland v. Washington (1984) 466 U.S. 668, 688, 694, 80 L. Ed. 2d 674, 104 S. Ct. 2052; People v. Ledesma (1987) 43 Cal. 3d 171, 215-218, 233 Cal. Rptr. 404, 729 P.2d 839.) Counsel were not ineffective.\n\nTo be sure, \"part of the guarantee of a defendant's right to an impartial jury is an adequate voir dire to identify unqualified jurors. [Citations.]\" ( Morgan v. Illinois (1992) 504 U.S. 719, 729 [119 L. Ed. 2d 492, 503, 112 S. Ct. 2222].)\n\nBut each venireperson to whom defendant refers us either made clear that he or she would never vote for death, or gave slightly more ambiguous answers from which the court and counsel could reasonably conclude that his or her ability to follow the law was, at a minimum, substantially impaired. We have already described the testimony of Cazares and Lopez. (See ante, p. __ [typed opn., ante, p. 10].) To provide other examples, Josefina Docuyanan flatly testified, \"I will never vote for a verdict of death,\" and in answer to the question, \"Would you automatically vote for a verdict other than first degree [murder] in order to avoid having to worry about the death penalty?\" Pamela Elofson testified, \"Yes. Yes, I would.\"\n\nHence, \"nothing in the record indicates that counsel lacked a plausible, tactical reason for asking these individuals few or no follow-up questions. [Citation.] Indeed, counsel might have determined from the demeanor of these prospective jurors that additional questioning would be futile. Counsel might also have reasonably concluded that any ambiguity in the answers they had already given would be beneficial and would promote retention of pro-life jurors. No constitutional deficiency in counsel's performance on voir dire has been shown.\" ( People v. Tuilaepa (1992) 4 Cal. 4th 569, 587, fns. omitted, 842 P.2d 1142, affd. sub nom. Tuilaepa v. California (1994) 512 U.S. [129 L. Ed. 2d 750, 114 S. Ct. 2630].) In the case of many of the venirepersons to whose examination defendant alludes, questioning by counsel for either party would have been superfluous, for the court effectively elicited the venireperson's opinion. At other times, it was defense counsel who confirmed what was already apparent: the potential juror was opposed to the death penalty and could not vote for it. Thus, even if counsel were deficient for not questioning each potential juror-an unlikely prospect-we cannot conclude that defendant was prejudiced. There is no reasonable probability that the court's rulings would have differed, and hence that the result might have differed, if counsel had questioned the potential jurors at length.\n\nDefendant also asserts that the potential jurors were excused solely because they opposed the death penalty. He contends that \"the exclusion from the guilt phase of jurors categorically opposed to the death penalty deprived him of a jury composed of a representative cross-section of the community, in violation of his Sixth and Fourteenth Amendment rights. We have rejected such claims [citation], as has the United States Supreme Court . . . .\" ( People v. Kaurish (1990) 52 Cal. 3d 648, 674, 802 P.2d 278, 276 Cal. Rptr. 788.)\n\nII. GUILT PHASE ISSUES\n\nDefendant asserts that errors in deciding his guilt or the truthfulness of the special circumstance allegation occurred. As will appear, his claims lack merit.\n\nA. Double Jeopardy and Collateral Estoppel Issues\n\nAt the prior trial, the court found defendant guilty of first degree murder for Carter's killing, and found true a special circumstance of multiple murder under the 1977 death penalty statute, but found not true a special circumstance of felony murder under the same law.\n\nTo find true the felony-murder special circumstance under the 1977 death penalty law, the court had to determine that Carter's murder was \"willful, deliberate, and premeditated and was committed during the commission or attempted commission of\" \"a lewd or lascivious act upon the person of a child under the age of 14 years in violation of Section 288.\" (Stats. 1977, ch. 316, § 9, subd. (c)(3), p. 1258.) By finding the special circumstance not true, the court may have decided that there was no premeditation, or that there was no attempted or completed lewd act-we do not know. It could not have decided that both theories failed, however, because at the same time, by finding defendant guilty of first degree murder, it determined either that defendant killed Carter with premeditation and deliberation, or while committing or attempting to commit a violation of section 288. (Pen. Code, § 189; unlabeled statutory references are to this code.)\n\nThe prosecution did not reallege the felony-murder special circumstance, but did try the case under a theory that defendant was guilty of first degree murder by reason of felony murder or premeditation and deliberation, or both. The jury was instructed on both theories.\n\nThe jury found defendant guilty of first degree murder for killing Carter. He asked that the jury be polled to discover the legal basis for each vote. The court denied the motion.\n\nDefendant first contends that the double jeopardy clause of the Fifth Amendment to the United States Constitution, as applied to the states through the due process clause of the Fourteenth Amendment, and that of article I, section 15, of the California Constitution, barred his retrial on charges that he murdered Carter under theories of felony murder or premeditated and deliberate murder. He premises this contention on an argument that the court must have rejected one of those theories when it found the felony-murder special circumstance not true, and therefore he should not have been retried on either theory.\n\nWe disagree. Preliminarily, we note that among the pleas that defendant might have entered are \"[a] former judgment of conviction or acquittal of the offense charged\" ( § 1016, subd. 4) and \"once in jeopardy\" (id., subd. 5; see also § 1023). Not only may former jeopardy be affirmatively pleaded, but it must be, or any claim on that ground is not preserved for review. ( People v. Belcher (1974) 11 Cal. 3d 91, 96, 113 Cal. Rptr. 1, 520 P.2d 385.) Defendant did not enter a plea of former jeopardy. Rather, when he was arraigned on the amended information, he refused to enter a plea at all, demanding instead to be returned to San Quentin prison. The court entered a plea of not guilty on his behalf.\n\nAt oral argument defendant contended that if we decide the double jeopardy question adversely to him on the ground that he did not enter the proper plea on retrial, he did not receive the effective assistance of counsel. Without agreeing that any such claim would persuade, we do agree that we should decide the issue on the merits.\n\nThe double jeopardy clause of the Fifth Amendment to the United States Constitution provides that no person shall \"be subject for the same offence to be twice put in jeopardy of life or limb . . . .\" Defendant was convicted of Carter's murder at his first trial. Retrying him on a charge of murder did not place him twice in jeopardy for that offense. \"'It has long been settled . . . that the Double Jeopardy Clause's general prohibition against successive prosecutions does not prevent the government from retrying a defendant who succeeds in getting his first conviction set aside, through direct appeal or collateral attack, because of some error in the proceedings leading to conviction.' [Citations.] 'To require a criminal defendant to stand trial again after he has successfully invoked a statutory right of appeal to upset his first conviction is not an act of governmental oppression of the sort against which the Double Jeopardy Clause was intended to protect.' [Citation.]\" ( People v. Santamaria (1994) 8 Cal. 4th 903, 910-911, 884 P.2d 81.)\n\nDefendant next contends that collateral estoppel bars relitigation of the killing of Carter on a first degree murder theory. In his view, when the court at the prior trial found not true the felony-murder special circumstance, it necessarily determined either that there was no felony murder or that there was no premeditated and deliberate murder, and therefore retrial of the murder on either theory was barred by collateral estoppel.\n\nIt is questionable whether the doctrine of collateral estoppel even applies to further proceedings in the same litigation. ( People v. Santamaria, supra, 8 Cal. 4th at pp. 913-916.) Even if it does, at most it would bar retrial of the felony-murder special circumstance, which was not realleged. (See id. at p. 914 [collateral estoppel would, at most, bar retrial of an enhancement allegation, not an offense of which the defendant was found guilty].) We are not persuaded by defendant's contention, advanced at oral argument, that Santamaria is distinguishable because the prior trial therein was by jury, whereas the prior trial herein was by the court.\n\nTherefore defendant's collateral estoppel contention must be rejected. So must his ancillary contention that this court's remand of his case without \"delimiting the proper scope of charges for which appellant could be retried\" violated rights he discerns in the Fifth, Sixth, Eighth, and Fourteenth Amendments to the United States Constitution.\n\nThis assertion rests on a view that a combination of errors requires the reversal of his conviction for the murder of Carter. The asserted errors are that we declined, in Memro I, supra, 38 Cal. 3d 658, to decide the adequacy of the evidence to prove a premeditated and deliberate murder, leaving open the theories on which he could be retried, and that the court failed to preclude the prosecution from proceeding on at least one theory of first degree murder or to require that the jury identify the theory on which it found him guilty of that crime.\n\nDefendant did not seek rehearing or modification of our decision in Memro I, supra, 38 Cal. 3d 658, on the ground complained of. We find his assertion unavailing. The court's ruling on the felony-murder special-circumstance allegation required at most that the special circumstance not be realleged at the second trial. It was not. Nothing more could have been required. There was no violation of any constitutional right in retrying defendant on a charge that he murdered Carter on a theory of first degree murder.\n\nB. Claims of Error Regarding the Voluntariness of Defendant's Confession and Discovery of Interrogators' Personnel Records\n\n1. Denying Motion to Suppress Confession\n\na. Statement of Facts\n\nDefendant's pretrial litigation strategy focused mainly on an in limine motion, brought under Evidence Code section 402, to suppress his confession because coerced by threats and inducements following invocation of his rights to counsel and to silence.\n\nDefendant testified on his own behalf for purposes of the motion to suppress. He testified that during the interrogations at the South Gate jail Officer Carter made clear that he would get answers to his questions, pointed to the muscular Officer Greene, asked him whether he thought he could beat Officer Greene in a fight, and told him if a fight began Officer Greene \"literally would kill me if somebody didn't stop him.\" He also testified that the police showed him a depression in a wall of the interrogation room that could have been made by the impact of a human head and suggested that his head might used to enlarge it if he failed to reveal what he knew about Carter's disappearance. In sum, he was \"terrified of Greene and the situation . . . .\" Moreover, he testified, the police told him that if he should be imprisoned for the murders he would be unlikely to survive.\n\nDefendant introduced the testimony of his own counsel, Michael C. Carney, that when he was a prosecutor he learned the police had received a letter complaint that Officer Greene had used excessive force during a drunk-driving arrest. At the time, Officer Greene also told Carney that he had broken a citizen's jaw and received a restrictive-duty assignment as a result. There was also evidence that a letter complaint might be treated by the police as minor and never be placed in a personnel record for the officer later to discover. Indeed, after Carney's testimony, Officer Greene testified that his file contained no complaint.\n\nDefendant also called his counsel from the prior trial, Peter L. Williams, who testified that another client, Angelina Nasca, told him that Officer Greene forced her to confess to a trumped-up charge of burglary because he \"took her in the interview room in the South Gate jail and hit her, driving her tooth through her cheek, and threatened to put her head through a hole in the wall of the interview room of the South Gate jail.\" Williams also testified that defendant told the public defender's office about the wall on \"the morning after his arrest.\"\n\nThe court considered Nasca's testimony from the prior trial, as well as that of Michael Bridges. Both claimed to have been bullied and beaten by Officer Greene while under arrest. Nasca said that Officer Greene threatened to \"push my head through that hole\" in the interrogation-room wall \"the same way he did someone else's.\" Bridges also testified that Officer Greene threatened him with a shotgun. When Bridges was in the South Gate jail's interrogation room, he filled out a card indicating that he wanted a lawyer and did not want to talk. Another member of the police department tore it up and Officer Greene beat him again. Bridges denied knowing defendant.\n\nLouis Moreno testified that he was roughed up by the South Gate police in October or November of 1978 when they arrested him on a fugitive warrant for armed robbery. The court found that his description of the assertedly offending police officers did not match those who had testified in the hearing.\n\nThere was testimony that for three or four years the local public defender had not received a single request to appear at the South Gate jail in response to an invocation of the right to counsel.\n\nAs stated, defendant also testified that the police offered him an inducement to confess. It \"was my understanding that [Officer Carter] was promising that if I cooperated with him and told him whatever it was he wanted to hear that he would send me back to Atascadero . . ., that there wouldn't be any charges filed . . . . That was in the form of a promise.\"\n\nDefendant further testified that he was never read his Miranda rights ( Miranda v. Arizona (1966) 384 U.S. 436, 16 L. Ed. 2d 694, 86 S. Ct. 1602) and that when he demanded to see a lawyer Officer Carter refused, responding \"did I want to talk to him or did I want to fight, something to that effect.\" \"Nobody told me why I wasn't read my rights. I was told . . . something to the effect that they had already done a number of things improperly and that he [Officer Carter] probably couldn't make a case hold up in court anyway.\"\n\nIn answer to defendant's presentation, the prosecution produced numerous witnesses to support its assertion that his confessions were made voluntarily.\n\nOfficer Sims testified that defendant was neither threatened nor offered an inducement for his statements: he responded freely and voluntarily and his demeanor was \"somewhat nervous, but was also relaxed . . . .\" Officer Carter, who conducted the key interrogation, also testified that defendant's demeanor was \"normal, maybe a little emotionally upset\"; neither Officer Carter nor any other member of the South Gate police department threatened him or offered any inducement or benefit other than coffee and cigarettes. Officer Greene was not flexing his muscles or making threatening gestures; rather, he \"was very quiet that evening and seemed to be real remorseful if anything.\" Indeed, when \"Mr. Memro started telling us about picking up the boy and what he had done to the boy, . . . Greene became quite emotional and appeared as though he couldn't take it and he went over and sat in the corner.\"\n\nAfter an hour of general conversation to make defendant feel comfortable, Officer Carter testified, he confessed to the Carter murder. \"At that time he became extremely emotionally upset and . . . seemed to be very remorseful. He started crying very heavily . . . .\" Officer Carter gave him a few minutes to calm down and then invited him to unburden himself of any other criminal activity. Defendant told him that the murders of Fowler and Chavez had weighed on his mind for a long time, and he confessed to them.\n\nOfficer Carter agreed that there was a slight, six- to eight-inch-wide impression in one plaster wall of the interrogation room.\n\nAnthony Cornejo, a fellow jail inmate, testified that defendant told him that he had lied about his confession being coerced. \"He admitted making the statements freely to the police. And he said-the quote was, 'That was the only thing I had going for me on my appeal was to say that I was beat up and coerced and had the statements beat out of me.'\"\n\nOn cross-examination, Cornejo was impeached as a notorious jailhouse informant who had repeatedly testified about fellow inmates' statements in jail for the prosecution in state and federal court. Cornejo was a convicted murderer, robber and burglar who, the cross-examination suggested, would hope for lenity from the parole board. And another informer had written Cornejo about defendant's case. Defendant also called Theodore Frank-presumably the defendant in People v. Frank (1985) 38 Cal. 3d 711, 214 Cal. Rptr. 801, 700 P.2d 415, following retrial People v. Frank (1990) 51 Cal. 3d 718, 274 Cal. Rptr. 372, 798 P.2d 1215-who testified that defendant was very reticent about his case: he would never answer questions or volunteer any information about it.\n\nSouth Gate Police Officer Walter R. Carter drove defendant back to the police station from the site where Carter's body was recovered. He testified that Lloyd Carter told him not to bother to handcuff him, but that he (Walter Carter) insisted that he should be restrained. On the way to the station, defendant told him that \"he didn't understand how anyone could treat him so fairly and so nice when he had done such a terrible thing.\"\n\nDefendant conceded that he was never physically harmed, that he had studied karate in 1972, that he was attending judo classes before his arrest, that he was in good physical condition, and that he had wrestled in school-evidently high school-and also played football there.\n\nThe court also heard evidence that while in jail defendant was fed and was allowed to make two phone calls. He called Linda Brundige, a reserve deputy sheriff who knew him because, as she testified at trial after the court had ruled the confession voluntary, he \"was one of my assistant instructors in a judo class I taught for the city of Huntington Park.\" Brundige also explained that defendant \"had been trained by somebody that was good with martial arts\" and that \"he was good within his skill level\" in a form of karate.\n\nThe court denied the motion to suppress the confession. \"Based upon the totality of the evidence,\" it declared, \"the court finds beyond a reasonable doubt the confession was free and voluntary.\" It further declared that \"the totality of the circumstances clearly point to the credibility of the prosecution witnesses and against the credibility of the defense witnesses, and I find the statement to be free and voluntary.\"\n\nb. Discussion\n\nDefendant contends that the court erred in finding beyond a reasonable doubt that his confession was given voluntarily and that his witnesses were not credible. He asserts that this ruling was inherently implausible and is unsupported by substantial evidence given his testimony regarding his interrogation and that of witnesses who testified that the South Gate police department behaved brutally toward arrestees, particularly while interrogating them. He is wrong: substantial evidence supported the ruling.\n\nThe parties agree on the applicable burden of proof regarding the claim of involuntary confession. Because the crimes charged occurred before the adoption of article I, section 28, subdivision (d) of the California Constitution in 1982, state law required the prosecution to show beyond a reasonable doubt that defendant's statements were made voluntarily. ( People v. Anderson (1990) 52 Cal. 3d 453, 470, 276 Cal. Rptr. 356, 801 P.2d 1107.) Federal law requires the prosecution to make the same showing by a preponderance of the evidence. ( People v. Morris (1991) 53 Cal. 3d 152, 200, 279 Cal. Rptr. 720, 807 P.2d 949.) \"On appeal, the determination of a trial court as to the ultimate issue of the voluntariness of a confession is reviewed independently in light of the record in its entirety, including 'all the surrounding circumstances-both the characteristics of the accused and the details of the interrogation' [citations] . . . . [P] The trial court's determinations concerning whether coercive police activity was present, whether certain conduct constituted a promise and, if so, whether it operated as an inducement, are apparently subject to independent review as well.\" ( People v. Benson (1990) 52 Cal. 3d 754, 779, 276 Cal. Rptr. 827, 802 P.2d 330.) However, \"the trial court's findings as to the circumstances surrounding the confession-including 'the characteristics of the accused and the details of the interrogation' [citation]-are clearly subject to review for substantial evidence. The underlying questions are factual; such questions are examined under the deferential substantial-evidence standard [citation] . . . .\" (Ibid.)\n\nApplying the foregoing law to the record before us, we conclude that the confession was voluntary.\n\nWhat the Constitution permits to be admitted in evidence is \"the product of an essentially free and unconstrained choice . . .\" to confess. ( Schneckloth v. Bustamonte (1973) 412 U.S. 218, 225, 36 L. Ed. 2d 854, 93 S. Ct. 2041 (lead opn.); accord, id. at p. 249 (conc. opn. of Blackmun, J.) \u0026 id. at p. 250 (conc. opn. of Powell, J.).) The question is whether defendant's choice to confess was not \"essentially free\" because his will was overborne. (412 U.S. at pp. 225-226.) The inquiry is essentially factual. \"In determining whether a defendant's will was overborne in a particular case, the Court has assessed the totality of all the surrounding circumstances-both the characteristics of the accused and the details of the interrogation.\" ( Id. at p. 226.)\n\nThe police testified that defendant was not threatened, was offered no inducement, and waived his rights to counsel and to remain silent. There was thus substantial evidence before the court that the interrogation was free of any taint that might make it involuntary. The court believed the testimony of the police and rejected that of defendant's witnesses. We must accept its evaluation of the facts when substantial evidence supports it, as the testimony does. ( People v. Benson, supra, 52 Cal. 3d at p. 779.) Doing so, independently resolving the legal question whether the confession was voluntary is a simple task: it was.\n\n2. Refusing to Exclude Cornejo's Testimony\n\nBefore trial defendant moved to exclude the testimony of Anthony Cornejo. He argued that it would be substantially more prejudicial than probative (Evid. Code, § 352) and that introducing it would violate constitutional rights he asserted to a reliable guilt and penalty determination, to due process, and to the right to counsel. Just before Cornejo testified in limine, defendant also added the ground of objection that if the court had granted him as speedy a trial as he desired he would never have encountered Cornejo and his testimony would not now be heard.\n\nTo recapitulate, Cornejo testified that defendant told him his statements to the police were voluntary. On cross-examination, he was thoroughly impeached as a notorious jailhouse informant.\n\nDefendant argues that the government used Cornejo as an agent to elicit his purported statement about the circumstances surrounding his confession. This, he asserts, violated his Sixth Amendment rights, because, as we stated in People v. Pensinger (1991) 52 Cal. 3d 1210, 1249, 278 Cal. Rptr. 640, 805 P.2d 899, \"it is a denial of the Sixth Amendment right to counsel to admit evidence of an indicted defendant's incriminating statements deliberately elicited from the defendant by a government agent. ( Massiah v. United States (1964) 377 U.S. 201, 12 L. Ed. 2d 246, 84 S. Ct. 1199; see also United States v. Henry (1980) 447 U.S. 264, 65 L. Ed. 2d 115, 100 S. Ct. 2183.)\" A government agent includes a jailhouse informant whom the state has hired to obtain incriminating statements, even if they are made voluntarily and without solicitation. ( Maine v. Moulton (1985) 474 U.S. 159, 173, 88 L. Ed. 2d 481, 106 S. Ct. 477.)\n\nThe court's ruling allowing a jailhouse informant's testimony to be introduced presents an essentially factual question, and we review it on a deferential standard. There was no abuse of discretion (Evid. Code, § 352; People v. Clair (1992) 2 Cal. 4th 629, 660, 828 P.2d 705) in admitting Cornejo's testimony. We disagree with defendant's perception of Cornejo's role. The record does not at all compel the Conclusion that Cornejo was acting at the government's behest. Pointing to Cornejo's history of testifying for the government, defendant naturally disagrees, but such a history does not automatically make an informant a state agent. (See In re Williams (1994) 7 Cal. 4th 572, 597-598, 870 P.2d 1072.) In our view, no constitutional question arises unless the informant is an agent of the state at the time he or she elicited the statements that would be the subject of later testimony. (See U.S. v. Sanchez (11th Cir. 1993) 992 F.2d 1143, 1159-1160, modified 3 F.3d 366.) It is clear that Cornejo testified to further selfish goals, and it appears that he instigated his conversation with defendant, if that is what happened, for the same ends, even though he declared that he was testifying \"out of a moral consciousness of the things that I believe that are involved in this.\" His goal may have been lenience from the parole board-he was awaiting or was on trial for murder when he first testified in this case in December 1986-but he testified that he was promised nothing except safe housing when incarcerated and there is nothing in the record to the contrary. The record supports our Conclusion that this promise was made after he obtained defendant's statements against interest.\n\nIn sum, the record supports the Conclusion of the trial court that Cornejo was gathering information on his own initiative, not that of the state. As such, he was not a government agent. ( In re Williams, supra, 7 Cal. 4th at p. 598; People v. Williams (1988) 44 Cal. 3d 1127, 1141, 245 Cal. Rptr. 635, 751 P.2d 901.) We find no abuse of discretion in admitting the testimony and no constitutional violation.\n\n3. Denying Motion to Dismiss for Loss of Police Personnel Records\n\na. Statement of Facts\n\nTo aid his assertion of coercion, defendant also moved, as he did before his prior trial, to discover the personnel records of various South Gate police officers under authority of Pitchess v. Superior Court (1974) 11 Cal. 3d 531, 537-538, 113 Cal. Rptr. 897, 522 P.2d 305. We discern from the record that he renewed the motion made at his prior trial. That motion sought \"information regarding complaints against South Gate Police Department officers-including the four officers who had participated in [defendant's] postarrest interrogation. His motion requested the identity of individuals who had filed complaints 'relating to unnecessary acts of aggressive behavior, . . . violence, and/or attempted violence, and . . . excessive force and/or attempted excessive force' against 16 officers in the department. [Defendant] also sought discovery of investigative reports based on these complaints, including statements of witnesses interviewed, information concerning the officers' use of excessive force or violence contained in personnel files, statements of psychiatrists, psychologists, or other officers contained in such files, and findings of disciplinary actions taken against any officers as a result of their use of force and violence. The purpose of such information, it was alleged, was to enable appellant to bolster his claim that his confession had been coerced.\" ( Memro I, supra, 38 Cal. 3d 658, 674.) In Memro I, we reversed the judgment because the court denied this motion.\n\nThe court granted the motion to discover the personnel records of Officers Carter, Gluhak, Greene, and Sims-defendant's four interrogators. (Defendant later moved to discover the personnel records of four other members of the South Gate Police Department-the partners of defendant's interrogators. That motion was denied because the court found there was \"no showing of need\" and no \"nexus or connection between conduct complained of . . . and those officers.\") The prosecution informed the court and defendant that the officers' personnel files had been purged according to the terms of the department's document-destruction policy, governed by Government Code section 34090, which permits, and has permitted since 1975, that records two years old or older may be purged if \"no longer required . . . .\" The policy was to purge material from personnel files that was more than five years old.\n\nDefendant then asserted that the records were destroyed to conceal information relevant to his claim of coercion. He moved to dismiss the information, in essence as a proper sanction for their loss. He argued that the police knew a major issue on the appeal from the original judgment was denial of the motion to discover police personnel records and that the department destroyed the records notwithstanding the possibility of a reversal on that ground.\n\nIn response, the prosecution introduced evidence of the procedure whereby the records were purged, and, to aid the court in ruling on the motion to suppress, secondary evidence of their contents.\n\nThe South Gate Police Department's records custodian testified that police officers would be alerted to any citizen complaints placed in their personnel record. Each officer testified that his personnel file contained no such complaints at the times for which the information was sought, except for Officer Sims, who described one \"unfounded\" complaint in 1978 involving asserted use of excessive force during an arrest.\n\nThe custodian also testified that the records were destroyed in accordance with the requirements of Government Code section 34090: he believed the police chief asked of and received from the city attorney permission to purge \"the ones that were at least five years old.\" However, records relevant to unresolved civil lawsuits were kept longer, and the department did not ask the district attorney or Attorney General to ascertain whether records might be needed for pending criminal cases.\n\nThe court denied the motion for a sanction for destroying the records. It rejected the argument that the records were destroyed to conceal information relevant to defendant's assertion of coercion. It first ruled that defendant bore the burden of showing that the records were destroyed for a nefarious purpose. It then found that the only evidence of such a purpose was that oral argument in Memro I, supra, 38 Cal. 3d 658, took place on May 7, 1984, and that permission to destroy the records was granted on July 3, 1984. It found this evidence insufficient to show that the records were destroyed in bad faith. Rather, it found that they were destroyed in good faith according to established procedure.\n\nb. Discussion\n\nPreliminarily, we note that we review the court's decision to consider secondary evidence of the records' contents on a deferential standard. ( Mayo v. Mayo (1935) 3 Cal. 2d 51, 57, 43 P.2d 535, overruled on other grounds in Stitt v. Stitt (1937) 8 Cal. 2d 450, 453, 65 P.2d 1297.) There was no abuse of discretion: the court did not exceed the bounds of reason when it decided to hear testimonial evidence of the contents of the police officers' files.\n\nDefendant contends that due process was violated because evidence material to his defense was withheld. We agree with the People, however, that the question instead regards the failure to preserve evidence. Defendant also contends that the court erred in failing to impose a sanction for the records' destruction.\n\ni. Failure to Preserve Evidence\n\nIn Arizona v. Youngblood (1988) 488 U.S. 51, 58, 102 L. Ed. 2d 281, 109 S. Ct. 333, the federal high court held that \"unless a criminal defendant can show bad faith on the part of the police, failure to preserve potentially useful evidence does not constitute a denial of due process of law.\" Moreover, a trial court's inquiry whether evidence was destroyed in good faith or bad faith is essentially factual: therefore the proper standard of review is substantial evidence. (See U.S. v. Stevens (3d Cir. 1991) 935 F.2d 1380, 1387-1388 [applying clearly erroneous standard].)\n\nUnder the holdings of Youngblood and Stevens, we conclude that substantial evidence supported the court's ruling. The burden was on defendant to show bad faith, and he did not meet his burden. Even if the records were potentially useful, the failure to preserve them did not violate due process.\n\nii. Denying Motion to Impose Sanction for Failure to Preserve Evidence\n\n\"It is settled that trial courts 'enjoy a large measure of discretion in determining the appropriate sanction that should be imposed' because of the failure to preserve or destruction of material evidence. [Citations.]\" ( People v. Sixto (1993) 17 Cal. App. 4th 374, 399; see also People v. Zapien (1993) 4 Cal. 4th 929, 964, 846 P.2d 704.) We find no abuse of discretion. Although defendant calls the circumstances surrounding the records' destruction suspicious because the court's denial of the motion to discover them was a major focus of his appeal from the original judgment and the records were destroyed two months after oral argument in that appeal, the court could reasonably conclude that (1) the evidence showed the records were destroyed according to the provisions of the Government Code-indeed, they were kept for three years beyond the two-year period after which Government Code section 34090, subdivision (d), permitted their destruction-and (2) the department, unschooled in the nuances of appellate procedure, did not realize that the records might be needed after the court in defendant's prior trial denied the motion to discover them. Nor, the court could reasonably conclude, was there a nefarious purpose behind the policy to keep personnel records relevant to civil cases while not attempting to determine whether criminal cases might still be unresolved: criminal cases rarely remain active after five years. We find no abuse of discretion and no violation of due process in the refusal to impose a sanction.\n\n4. Denying Motion to Discover Other Officers' Personnel Records\n\nAs described, the court denied defendant's motion to discover the records of four other police officers, not present at his interrogation. It found no \"nexus or connection\" between those officers and his claim of involuntary confession that would justify discovering their personnel records.\n\nDefendant contends that the court erred in so finding. He asserts that he showed the officers trained with his interrogators, and that in Memro I, supra, 38 Cal. 3d 658, 686, we held that the records of those who \"trained or otherwise had substantial contacts with any of the four interrogating officers\" would be discoverable.\n\nTrial courts are granted wide discretion when ruling on a motion to discover such records. ( People v. Breaux (1991) 1 Cal. 4th 281, 311, 821 P.2d 585, quoting Pitchess v. Superior Court, supra, 11 Cal. 3d 531, 535.) Here the court found that there was no sufficient connection between training sessions or other activities in which the officers had mutually participated and the circumstances surrounding the interrogation. There is nothing in the record to contradict that finding. Plainly the court did not abuse its discretion.\n\nC. Asserted Failure to Obtain Knowing and Intelligent Waiver of Miranda Rights\n\nIt will be recalled that the court found beyond a reasonable doubt that defendant confessed freely and voluntarily. (Ante, p. __ [typed opn., ante, p. 21].) Officer Carter testified, however, that just before defendant confessed, he asked to sweep the room for concealed electronic recording devices with his help and with the other police out of the room, and that Officer Carter obliged him. He also testified that defendant said he wanted to talk to him alone because he trusted him and did not trust the other interrogators. He explained to defendant that the other officers were just doing their job, and they came back into the room, evidently without his objecting to their renewed presence. Then, some time later and with all interrogators present, he confessed.\n\nDefendant contends the fact he wanted to speak \"off the record,\" so to speak, as shown by his asking to sweep the room for recording devices, showed that he did not realize his confession could be used against him. Thus, he reasons, he did not knowingly and intelligently waive his right to remain silent and to counsel. He cites People v. Braeseke (1979) 25 Cal. 3d 691, 159 Cal. Rptr. 684, 602 P.2d 384, vacated and remanded sub nomine California v. Braeseke (1980) 446 U.S. 932, 64 L. Ed. 2d 784, 100 S. Ct. 2147, reiterated People v. Braeseke (1980) 28 Cal. 3d 86, 168 Cal. Rptr. 603, 618 P.2d 149.\n\n\"Under the familiar requirements of Miranda [v. Arizona, supra, 384 U.S. 436], designed to assure protection of the federal Constitution's Fifth Amendment privilege against self-incrimination under 'inherently coercive' circumstances, a suspect may not be subjected to custodial interrogation unless he or she knowingly and intelligently has waived the right to remain silent, to the presence of an attorney, and to appointed counsel in the event the suspect is indigent. (384 U.S. at pp. 444-445, 473-474 [16 L. Ed. 2d at pp. 706-707, 722-724]; People v. Boyer (1989) 48 Cal. 3d 247, 271 [256 Cal. Rptr. 96, 768 P.2d 610].) Once having invoked these rights, the accused 'is not subject to further interrogation by the authorities until counsel has been made available to him, unless the accused himself initiates further communication, exchanges, or conversations with the police.' ( Edwards v. Arizona (1981) 451 U.S. 477, 484-485 [68 L. Ed. 2d 378, 385-386, 101 S. Ct. 1880].) The initiation of further dialogue by the accused, however, does not in itself justify reinterrogation. ( Oregon v. Bradshaw (1983) 462 U.S. 1039, 1044 [77 L. Ed. 2d 405, 411-412, 103 S. Ct. 2830].) 'Even if a conversation taking place after the accused has \"expressed his desire to deal with the police only through counsel,\" is initiated by the accused, where reinterrogation follows, the burden remains upon the prosecution to show that subsequent events indicated a waiver of the Fifth Amendment right to have counsel present during the interrogation.' (Ibid.)\" ( People v. Sims (1993) 5 Cal. 4th 405, 440, 853 P.2d 992.)\n\nWe have already explained that the court accepted the police version of the circumstances surrounding the confession. (Ante, p. __ [typed opn., ante, p. 23].) Implicitly it accepted Officer Carter's description of the search of the room for recording devices, and we are bound by that acceptance.\n\nDefendant did not raise the issue before the court the issue he presents to us. Hence he has failed to preserve it for review. ( People v. Wader (1993) 5 Cal. 4th 610, 635-636, 854 P.2d 80.) Defendant contends that if we draw that Conclusion, counsel were ineffective because there could be no tactical reason not to raise the issue with the court, and therefore we must address the point on the merits. ( Id. at p. 636.)\n\nAs stated, it is fundamental that \"a defendant claiming ineffective assistance of counsel must show both deficient performance under an objective standard of professional reasonableness and prejudice under a test of reasonable probability of a different outcome.\" ( People v. Davis, supra, 10 Cal. 4th 463, 529.)\n\nEven if defendant's request to sweep the room for bugs can be construed as evidence of his preparing to act on a mistaken belief that he could talk privately to Officer Carter without his statements being used against him-a state of affairs the record does not support (see People v. Johnson (1993) 6 Cal. 4th 1, 26, 859 P.2d 673)-he abandoned any such hypothetical course of action when he acceded to Officer Carter's indication that the other police officers would have to return so that the interrogation could resume. He could have halted his statements then by asking for counsel, and did not. Previously the police had read him his rights under Miranda v. Arizona, supra, 384 U.S. 436, from a card they used for that purpose. The police warned him twice that he had the rights to remain silent and to counsel, and that \"anything you say can and will be used against you in a court of law.\" Defendant said on both occasions that he understood the consequences of speaking, and elected to proceed. We cannot conclude that his waiver was made unknowingly or unintelligently.\n\nThus counsel could not have been ineffective for failing to raise this issue before the trial court. The Sixth Amendment does not require counsel \"'to waste the court's time with futile or frivolous motions'\" ( U.S. v. Hart (1st Cir. 1991) 933 F.2d 80, 83). Although we hesitate to characterize the motion that might have been made as frivolous, it would probably have been futile, given the testimony adduced on the circumstances surrounding defendant's waiver of his rights to silence and to counsel.\n\nWe turn to defendant's second confession. Officer Barclift testified that the day after defendant confessed to South Gate police, he repeated his confession to the 1976 murders to the Bell Gardens police. Without explaining the legal basis for his contention, defendant contends rather summarily that his confession must be suppressed because it was tainted by the first confession, which was improperly obtained.\n\nThis claim also was not preserved for appeal-defendant did not raise it below. Nor, for the reasons given above, were counsel ineffective for not asserting it.\n\nIn any event, were the premise of an ignorant waiver of rights true, the result defendant urges might be valid. ( People v. Williams (1988) 45 Cal. 3d 1268, 1299, 248 Cal. Rptr. 834, 756 P.2d 221 [discussing Fourth Amendment requirements].) However, we have found no violation of state or federal law in the eliciting of his initial confession to the South Gate police. \"Because the tree was not poisonous, its fruit was not tainted.\" ( People v. Mickey (1991) 54 Cal. 3d 612, 652, 286 Cal. Rptr. 801, 818 P.2d 84.)\n\nD. Denying Motion to Dismiss for Seizure of Papers\n\nDefendant contends that the court erred in failing to grant his motion to dismiss the information for the seizure and scrutiny of certain papers and the seizure and loss of others. (Apparently he made his motion under authority of section 1385, but the record is unclear on the point.) The ruling, in defendant's view, caused a violation of a Sixth Amendment right to counsel. He seeks reversal of his conviction or a remand for a hearing to determine whether any Sixth Amendment rights were violated.\n\nOn the day that it imposed the sentence of death on defendant, the court at the prior trial directed the sheriff to \"confiscate from the defendant all copies of the Reporter's Transcripts of the proceedings [forthwith] . . . and return them to Department SE L . . . .\" Rather than let the parties call witnesses, the court herein accepted various offers of proof and found that 14 pages of defendant's trial notes, as well as the annotated transcripts of the prior trial, were taken from him by the court order and then lost, and also that his legal papers were briefly seized in prison in 1982, scrutinized, and returned to him. Defendant objected to the hearing procedure-he preferred to present witnesses.\n\nAt argument on the motion, counsel asserted that defendant could not recall from the prior trial conversations with counsel about his arrest and questioning, matters of strategy, the demeanor of witnesses, or the names or location of witnesses and locations where evidence favorable to him might be found.\n\nIn reply, the prosecutor said that he could not \"imagine what witnesses Mr. Memro might be talking about.\"\n\nThe court found that under the standard set forth in United States v. Morrison (1981) 449 U.S. 361, 66 L. Ed. 2d 564, 101 S. Ct. 665, there was no \"demonstrable prejudice, or substantial threat thereof\" ( id. at p. 365) that would justify \"imposing a remedy in this particular instance\" even if the state intentionally interfered with defendant's right to counsel. It denied the motion to dismiss the information.\n\nAssuming, as appears likely, that the court denied a motion to dismiss the information brought under section 1385, we review it for an abuse of discretion. ( People v. Superior Court (Howard) (1968) 69 Cal. 2d 491, 502, 72 Cal. Rptr. 330, 446 P.2d 138.) And we review the underlying basis for the ruling-a decision that the facts do or do not support a claim of state interference with the right to counsel-for substantial evidence. (Cf. U.S. v. Leisure (8th Cir. 1988) 844 F.2d 1347, 1359-1360 [applying clearly erroneous standard].) Here, the court decided that even if there was intentional interference with that right, defendant had been able to show no prejudice.\n\nThe ruling was sound. The case against defendant centered on his detailed confessions to the crimes. The court could reasonably refuse to believe that he would forget about a witness who could cast doubt on their authenticity. And it could also reasonably conclude that the other reasons he advanced in pressing his motion to dismiss the information were unpersuasive. Moreover, nothing in the record suggests that attorney-client communications were revealed, and the prosecutor stated in his offer of proof that no information from the materials was known to, received by, or used to benefit the prosecution or the police.\n\nDefendant also contends that certain Fifth, Sixth, Eighth and Fourteenth Amendment rights were violated when the court accepted offers of proof in ruling on his motion rather than hearing witnesses' testimony. But, asked by the court what specific constitutional ground or grounds would justify not considering offers of proof favorable to the defense rather than live testimony, he was unable to offer any. It appears that there were no disputed material issues of fact. Unless the court is alerted to the presence of such issues, it is difficult to perceive what would be gained by a hearing with live witnesses. (See People v. Hedgecock (1990) 51 Cal. 3d 395, 415, 272 Cal. Rptr. 803, 795 P.2d 1260.) Moreover, it is difficult to imagine what they could have added that would have favored defendant more than the state of the record the court adopted: it ruled that the record would reflect an offer of proof that when defendant's papers were seized in prison in 1982, as related by his counsel, \"two deputies went through Mr. Memro's legal folder and read portions of every document that they picked up . . .\" and when it was returned \"the documents had been gone through, that they were not in the same order they had been in before they were confiscated.\" It also ruled that the papers seized in jail immediately following the prior trial were mislaid and were never recovered.\n\nE. Denying Motion to Dismiss for Failure to Produce Police Records\n\nOn December 27, 1978, at his prior trial, defendant broadly sought discovery of any information that might bear on the case. In January 1979 the motion was granted with regard to the crime report, reports written by police investigating the crime, and the names and addresses of all other persons arrested as suspects. But some hundreds of pages of investigative material in the hands of the Bell Gardens police, who had investigated the killings of Fowler and Chavez, was not turned over until October 1986. The prosecutor represented that he learned of the material only then and gave it to defendant forthwith. He also averred that counsel for both parties at the prior trial told him that they did not know about the documents. Officer Barclift of the Bell Gardens police testified that for the prior trial he gave the prosecution reports he thought relevant to the case, but did not turn over all those that the police possessed. This procedure had the prosecutor's approval. Peter L. Williams, defendant's counsel at the prior trial, reviewed the complete file and testified that he did not recall having been given arrest reports on other suspects in the 1976 Bell Gardens murders. He also testified, however, that he could not be sure that knowing about the withheld information would have affected his trial strategy.\n\nDefendant moved to dismiss the information, strike the special circumstance allegation, or preclude the possibility of a death sentence as sanctions for the failure to disclose the complete file before 1986. On appeal he asserts that the denial of this motion deprived him of due process of law.\n\nThe People assert that the record bespeaks only an inadvertent failure to timely comply with the court's 1979 discovery order. We need not decide that question, however. Assuming, as defendant asserts, citing U.S. v. Bryan (9th Cir. 1989) 868 F.2d 1032, 1036, that the prosecution's duty to disclose evidence requested in discovery motions encompasses evidence held by the police who investigated the crimes charged, and also accepting solely for purposes of argument defendant's assertion that the police intentionally withheld the material, \"such hypotheses do not rise to the level of constitutional cognizability [under the due process clause]. United States v. Bagley [(1985)] 473 U.S. 667, 87 L. Ed. 2d 481, 105 S. Ct. 3375, sets forth the standard of review applicable to defendant's claims of constitutional violations for failure to disclose favorable . . . information. 'The holding in Brady v. Maryland [(1963) 373 U.S. 83, 87, 10 L. Ed. 2d 215, 83 S. Ct. 1194] requires disclosure only of evidence that is both favorable to the accused and \"material either to guilt or to punishment.\"' (473 U.S. at p. 674.) 'The evidence is material only if there is a reasonable probability that, had the evidence been disclosed to the defense, the result of the proceeding would have been different. A \"reasonable probability\" is a probability sufficient to undermine confidence in the outcome.' (473 U.S. at p. 682 (lead opn. of Blackmun, J.); accord, 473 U.S. at p. 685 (conc. opn. of White, J.).)\" ( People v. Roberts (1992) 2 Cal. 4th 271, 330-331, 826 P.2d 274.)\n\nUnder this standard, no violation of the due process clause appears. As stated, the case was centered on defendant's detailed, elaborate confessions. Even if the undisclosed materials had pointed to others who might once have been suspected of the Fowler and Chavez murders, we do not discern any reasonable probability that the outcome would have differed.\n\nDefendant also asserts perfunctorily that the failure to provide discovery violated rights he discerns in the Eighth Amendment to a reliable fact determination in a capital case and to avoid an arbitrary death sentence. We are unpersuaded.\n\nF. Denying Motion to Exclude Evidence Stemming from Arrest\n\nPursuant to section 1538.5, defendant moved at his prior trial to exclude all evidence of his guilt stemming from his arrest as the product of an arrest made without probable cause and hence unlawful. The court denied the motion, stating in a minute order, \"The court finds there was probable cause for the arrest of the Defendant.\"\n\nDefendant sought to renew his motion at the trial before us, also under section 1538.5. In response, the prosecution filed papers citing authority for the proposition that such a motion ordinarily may not be relitigated. The court denied the motion and it was not reheard.\n\nDefendant contends that (1) there was no probable cause to arrest him, (2) certain witnesses should have been excluded during the motion hearing, and (3) the court erred by denying his application to renew his motion. Because the court herein left intact the ruling from the prior trial, we address all of these contentions on the merits, including the first and second. To do otherwise would be to unfairly deny defendant a determination of the matter on the merits.\n\n1. Probable Cause to Make Arrest\n\nDefendant urges that because his crimes predate Proposition 8 (Cal. Const., art. I, § 28), we must inquire whether the police actually suspected that he committed a crime, and if we conclude that they did, we must then ask whether the facts known to them gave them adequate cause to arrest on an objective standard. ( People v. Miller (1972) 7 Cal. 3d 219, 226, 101 Cal. Rptr. 860, 496 P.2d 1228.) For purposes of this opinion only we will accept this contention, without deciding whether it is correct. In the first step of our inquiry we apply the deferential standard of substantial evidence; in the second, we exercise our own judgment. (See People v. Leyba (1981) 29 Cal. 3d 591, 596-597, 174 Cal. Rptr. 867, 629 P.2d 961.)\n\na. Facts.\n\nIn this case, the police and defendant told the court almost entirely conflicting stories of the events leading to defendant's arrest. Preliminarily, we note two facts that were essentially undisputed. There was undisputed if implicit evidence that Carter's mysterious disappearance had generated substantial news coverage in local media, and explicit evidence that defendant was aware of the news stories although he had not read them. And there was no necessary indication of foul play: Carter had simply vanished.\n\nThe police version of the events preceding defendant's arrest provided overwhelming evidence of probable cause for his arrest. They related the facts as follows:\n\nAccording to Officer Sims, by Friday, October 27, 1978, five days after Carter's disappearance, he and Officer Gluhak had exhausted all leads. There was implicit evidence that the police were desperate, because they had resorted to the paranormal in their investigation: they obtained an artist's sketch based on a psychic's vision of a person Carter might have been with.\n\nArmed with that sketch, they went back to the Carter residence. Carter's parents each said the sketch looked like defendant. Officers Sims and Gluhak decided to interview him. They knocked on defendant's door and, Officer Sims testified, he virtually blurted out, \"'I knew you were coming sooner or later. I['ve] been in Atascadero for molestation of a nine-year-old boy in the city of Huntington Park.'\" Soon thereafter-this first pre-arrest interview lasted 15 minutes-as the police were copying down information from defendant's driver's license, he also volunteered, in Officer Sims's words, \"'You are going to find out,' or he stated to me, 'You are going to find out anyway.' He said, 'When I was arrested in Huntington Park in '72 it was because I went into a fit of rage and beat the shit out of a nine-year-old boy.' He said he was sent to Atascadero for that reason.\"\n\nIn the interim, defendant had invited Officers Sims and Gluhak into the living room of his apartment. The police did not go into any other part of the house. The living room, said Officer Sims, was littered with \"literally hundreds of pictures of young boys, both clothed and partially clothed. I also observed lying on the floor and living room furniture of the apartment numerous books, pornographic material.\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe police explained to defendant that they were investigating Carter's disappearance, an event that, as stated, had generated major news coverage. He replied that he had seen nothing unusual at the Carters' house the night of Carter's disappearance.\n\nThe police left defendant's residence to return to the Carters' house.\n\nDefendant left his residence separately to bring a car part to the Carters' house-it will be recalled that Carter's father was repairing defendant's Volkswagen and that defendant had dropped it off the day of Carter's disappearance. When he saw defendant at the Carters' house, Officer Sims asked him again whether he might have seen anything when he dropped off his car on the Sunday that Carter disappeared. In Officer Sims's words, defendant \"stated to me, 'Oh, yeah. I remember now. I was going to the Sizzler to get some dinner, but the line was too long.' [P] He said it was about 6:00 . . . in the evening. He said he decided to go over to Carl Carter, Sr.'s, house to talk to him about working on his car. He stated that when he got to the rear door, Carl Carter [Jr.] was there and he asked him if he wanted to go and have a Coke.\" This occurred around the time that Carter was last seen.\n\nOfficer Sims then arrested defendant on suspicion of kidnapping. He arrested him because of \"the seriousness of the crime, the fact that a seven-year-old boy had been missing for a week, that Defendant Memro did not give me any of those statements at his apartment, the fact that he had told me he had taken the boy but he didn't do anything to him[,] led me to believe that he was possibly involved in the missing boy's disappearance.\" He added that he believed defendant was also the last person to see Carter before he was reported missing.\n\nOn cross-examination, the testimony was impeached in several important respects. Although Officer Sims testified that the police had not ventured beyond defendant's living room, he also testified that he arrested him because of the urgency of the case, including \"an urgency about the boy's safety at that point.\" When defendant asked him to reconcile this perceived urgency with his own testimony that the police did not search his entire apartment until after he had confessed later that night, he could not do so-he offered no explanation except that he did not know why he had not searched the dwelling.\n\nOfficer Sims also had testified that the police turned to defendant because they had no other leads, but conceded that they had not interviewed registered sex offenders in South Gate, nor had they learned the name of the individual who helped Carter's father repair cars.\n\nAs stated, defendant's version almost entirely contradicted that of the police.\n\nDefendant testified in great detail about the events surrounding his arrest. The police asked to talk to him as he was preparing to drive away. He agreed. They asked whether he had ever been arrested, and he stated that he had served time at Atascadero for a violation of section 273d (child abuse; see Stats. 1965, ch. 1271, § 4, p. 3146). They asked when he had last seen Carter, and he replied that it was the Saturday before he vanished. They asked to search his apartment, and when he asked if it would do any good to refuse, they said no, so on that basis he consented. The police looked at the bedroom, kitchen, bathroom, and closets as well as the living room. Defendant, an amateur photographer, had a stack of photographic proof sheets on the living room coffee table, which the police examined. A good many of them were of males under 20 years old, as were those on the living room walls. None of them, it can be inferred, were sexually explicit. The police then asked to view the trunk of his car and asked him about a sleeping bag in it. Again being told he could not refuse, he consented.\n\nDefendant also described the second encounter, at the Carter residence, in different terms. The police, seeing him there, said they had more questions. \"He wanted to know again when the last time I seen Carl was. And I told him-Carl, Jr., that is-I told him that was on the previous Saturday; that he had been playing up and down the block with the neighbor kids when I stopped over to see Mrs. Carter.\" He said nothing about seeing Carl the day he vanished.\n\nThe police then asked defendant to take a polygraph test. He refused initially, but eventually agreed to it. The police told him he could choose to take the test or be arrested for kidnapping. He went to the station with them.\n\nOn cross-examination, defendant adhered to his story.\n\nCarter's father, Carl Berlin Carter, testified that he could not recall the police mentioning that they had seen any unusual photographs in defendant's apartment when they interviewed Carter just after their initial contact with defendant, and just before defendant's return to the Carter residence.\n\nDuring argument on the hearing on the section 1538.5 motion, defendant pointed out what he viewed as serious inconsistencies in the testimony of the police regarding his arrest. He pointed out the oddity of claiming to fear for Carter's safety and yet failing to search his apartment for hours. Given testimony that the police found photographs of male youths in plain sight on their initial visit to the apartment, defendant emphasized the curiousness of the police officers' failure to ask Carter's father whether he might know anything about defendant's choice of photography subjects. He maintained that there was no probable cause for his arrest, the police knew it, and therefore they had at times manufactured their testimony to justify it.\n\nCiting People v. Rios (1956) 46 Cal. 2d 297, 294 P.2d 39, the court found that \"there was probable cause for the arrest of the defendant; that the arrest occurred in the alley behind the Carter residence in the afternoon of the 27th of October.\n\n\" .............................................\n\n\"The Court finds that the use of the psychic in this case was merely an investigative tool and cannot be relied upon by the officers in connection with justifying their arrest. However, it may be used to follow up additional leads.\n\n\"The comments, the testimony that was presented and the identification by Mr. Carter, then the admission by the defendant at the home that he had been at Atascadero for assaulting another young boy, then his position that he hadn't seen the boy on the day the boy was missing, the information to the officers that he was there the day the boy was missing and then after the officers talked to the defendant and see him again at the Carter residence, the inconsistent statements of the defendant to the officers that he actually was the last person with the individual, in this Court's evaluation is sufficient evidence to justify an arrest for a homicide. . . .\n\n\"The Court finds there was a legal arrest of the defendant.\"\n\nb. Discussion\n\nAs stated, we defer to the trial court's findings regarding the officers' suspicion that defendant had committed a crime and then decide, based on the facts known to them, whether probable cause objectively existed to make an arrest. The trial court in essence entirely accepted the police officers' testimony regarding defendant's arrest. We are bound by that acceptance.\n\nUnder the version of defendant's interviews the police described, substantial evidence supports the court's implicit Conclusion that the police suspected defendant of committing the crime of kidnapping. It would have been extraordinary for the police not to have such a suspicion.\n\nThe case had dominated public discourse in South Gate for a week, and defendant knew the Carter family, yet when the police asked him whether he had seen anything unusual the day Carter vanished, he first said no. He later suddenly recalled that he had invited Carter out for a soft drink at around the time that he disappeared. He had various materials in his living room in plain sight showing a morbid sexual interest in young boys. And he had a record for physical abuse of a nine-year-old.\n\nThe foregoing facts, accepted by the court, supplied ample \"reasonable cause\" under state law (former § 836, subd. 3), and ample probable cause under the federal Constitution-the standards are identical ( People v. Talley (1967) 65 Cal. 2d 830, 835, 56 Cal. Rptr. 492, 423 P.2d 564)-to believe that defendant had committed a crime and thereby justify a warrantless arrest ( Dunaway v. New York (1979) 442 U.S. 200, 208, 213-214, 60 L. Ed. 2d 824, 99 S. Ct. 2248 (plur. opn.); see also 442 U.S. at pp. 215-216 [requiring probable cause to effect arrest made for investigative purposes]).\n\nThe police officers' awareness that defendant had made conflicting statements for which there could be no innocent explanation and that he admitted being in Carter's company at about the time he vanished are particularly significant. (See People v. Kaurish, 52 Cal. 3d at p. 676 [police knew suspect had left apartment in same building shortly before murder committed]; People v. Wright (1990) 52 Cal. 3d 367, 392, 276 Cal. Rptr. 731, 802 P.2d 221 [police knew suspect seen near victim's residence shortly before her death]; People v. Davis (1981) 29 Cal. 3d 814, 823, 176 Cal. Rptr. 521, 633 P.2d 186 [suspect admitted he was with victim at approximate time of death]; People v. Galceran (1960) 178 Cal. App. 2d 312, 313, 316-317, 2 Cal. Rptr. 901 [irreconcilably conflicting statements regarding ownership of vehicle, inter alia, furnished sufficient cause to search], cited with approval in People v. Superior Court (Simon) (1972) 7 Cal. 3d 186, 197, 101 Cal. Rptr. 837, 496 P.2d 1205 [conflicting answers \"constitute . . . a further suspicious circumstance sufficient to support a belief that the vehicle is stolen\"]; People v. Garcia (1981) 121 Cal. App. 3d 239, 246, 175 Cal. Rptr. 296 [conflicting statements that television set belonged to \"the 'black man' and also to Madrid,\" inter alia, provided probable cause to arrest]; In re Collins (1969) 271 Cal. App. 2d 195, 197, 203-204, 76 Cal. Rptr. 622 [suspect first said articles belonged to sister, then that he found them under a bridge; probable cause to believe crime had occurred].) By themselves, defendant's patently inconsistent statements on such a vital matter as the whereabouts of Carter near the time he vanished had \"no discernible innocent meaning\" and strongly indicated consciousness of guilt. ( People v. Superior Court (Simon), supra, 7 Cal. 3d at p. 197.) There is no question that the police had probable cause to arrest defendant.\n\n2. Excluding Witnesses During Hearing\n\nDefendant maintains that the court erred when it denied his motion to exclude witnesses during the hearing to suppress evidence because there was no probable cause for his arrest. He asserts in a conclusory manner that \"by permitting all of the officers to remain, the court irreparably prejudiced appellant's opportunity to cross-examine the officers effectively and to prove the invalidity of the arrest.\" He does not state that the court violated any statute. His claim is purely speculative and lacks merit. (See State v. Seel (Utah Ct.App. 1992) 827 P.2d 954, 959.)\n\n3. Denying Application to Renew Motion\n\nAs stated, at defendant's second trial, the court denied an application to hear his motion to suppress evidence under section 1538.5 de novo. The motion was made in a manner the court called \"Conclusionary\"; defendant did not explain what new evidence might justify a rehearing. Nevertheless, he argued at the motion hearing that the matter should be relitigated because there was \"more [evidence] on the credibility of the officers that were involved in the [prior section 1538.5] motions.\" The purported new evidence consisted of the possibility that two other witnesses would testify they \"never saw nude pictures\" in plain sight in defendant's apartment. The court rejected that offer of proof immediately, saying that defendant could have told counsel about any such witnesses before the prior litigation.\n\nDefendant also suggested vaguely that prior counsel may have exercised poor judgment in not pursuing the possibility that Carter had been seen in another individual's company after defendant admitted having been with him.\n\nThe court found that \"defendant has not established through any evidence whatsoever that [he] lacked an opportunity for a full determination of the merits of his motion as originally made and noticed at the previous hearing and the request for a 1538.5 de novo is denied.\"\n\nDefendant now contends that the court erred in denying a new hearing on his section 1538.5 motion because counsel at the first trial was ineffective for not impeaching the arresting officers with purported evidence, contained in a police report that they possessed, that Carter was seen by his brother near their house an hour after defendant saw him. He contends that the denial of his application violated rights he finds in the Sixth, Eighth and Fourteenth Amendments to due process, to counsel, and to a reliable factfinding process in a capital case.\n\nIn People v. Superior Court (Corona) (1981) 30 Cal. 3d 193, 199-200, 178 Cal. Rptr. 334, 636 P.2d 23, we suggested that if counsel's ineffectiveness at a section 1538.5 suppression hearing denied a defendant an opportunity for a \"full determination\" of the motion's merits, in some circumstances the defendant should receive a new hearing. But we believe that the question whether there was an opportunity for a full determination of the motion's merits at the prior trial is essentially factual and we review for substantial evidence the court's implicit ruling that there was such an opportunity. Substantial evidence supports the ruling: on this record, we conclude that the court could reasonably find that defendant failed to show he was denied the opportunity to present all the available evidence at the time of the original hearing. This record is similar to that before the Court of Appeal in People v. Dorsey (1973) 34 Cal. App. 3d 70, 109 Cal. Rptr. 712, overruled on another ground in Bunnell v. Superior Court (1975) 13 Cal. 3d 592, 602, 119 Cal. Rptr. 302, 531 P.2d 1086: \"The reversal of defendant's conviction returned him to the position he occupied prior to his conviction, i.e., facing trial after the denial of his motions to set aside the information and suppress the evidence. Defendant made no showing of any change of circumstance necessitating renewal of these motions at the second trial. The opportunity of renewing such motions for a second time is within the discretion of the trial court Judge upon retrial. [Citation.] We find no abuse of discretion here.\" (34 Cal. App. 3d at p. 73.) Neither do we.\n\nAnticipating we might reach this Conclusion, defendant contends briefly that any failure to raise the point adequately constituted ineffective assistance of counsel. Presumably he refers to the fact that defendant's motion papers did not mention the purported exculpatory police report and that he only alluded to it vaguely at the hearing.\n\nWe doubt that the contents of any such report, if admissible in evidence and accepted by the court, would have altered its ruling denying a new hearing, for it is also doubtful that the court at the prior trial would have ruled differently if it had learned of the report and received it in evidence. It is unlikely that the purported one-hour discrepancy to which defendant alludes would have changed the officers' assessment of his possible guilt of crime, assuming for purposes of argument that they were aware of it. Although Officer Sims listed his perception that defendant was the last person known to have seen Carter as a factor in arresting him, it is clear that his inconsistent statements alone provoked strong suspicion that he had committed an offense. On this record, we reject the ineffective-assistance contention: there is no reasonable probability that, if defendant had better briefed the motion with supporting argument or furnished a police report of the type he describes, the outcome would have differed.\n\nG. Denying Motion at Prior Trial to Exclude Evidence for Lack of Consent to Police Search of Apartment\n\nAt the prior trial, defendant moved to exclude physical evidence obtained following his statements to the police. He testified at that trial that he did not consent to a search of his apartment after his arrest and confession. The court at that trial denied the motion to exclude the evidence resulting from the search. On this appeal, he contends that the search was unlawful because it was made without his effective consent.\n\nDefendant did not litigate the matter in the proceeding before us. In answer to an anticipated Conclusion that there was no action of the court for us to review, he argues that the court made plain, by denying his application to relitigate his motion to suppress or exclude evidence under section 1538.5, that it would not entertain any request to reconsider the prior ruling, and therefore it would have been pointless to try. He contends that under these circumstances to deny review on the merits of his claim would violate the Eighth Amendment. Without necessarily agreeing with him, we will, in an abundance of caution, evaluate his contention on the merits.\n\nProsecution witnesses from the South Gate and Bell Gardens Police Departments testified that defendant consented, from his jail cell, to let them search his apartment for physical evidence relating to the murders. Defendant testified that he could tell that the police had already searched his apartment before his second in-jail interrogation, at which time he had not consented to any further search of his premises, because they showed him items they had recovered from it.\n\nThe parties dispute not only whether defendant consented to the search, but also whether any consent was effective given that it was sought, according to Officer Carter, at about 4:00 a.m.\n\nWhen reviewing a ruling on an unsuccessful motion to exclude evidence, we defer to the trial court's factual findings, upholding them if they are supported by substantial evidence, but we then independently review the court's determination that the search did not violate the Fourth Amendment. ( People v. Loewen (1983) 35 Cal. 3d 117, 123, 672 P.2d 436, 196 Cal. Rptr. 846.)\n\n\"The fourth amendment generally prohibits the warrantless entry of a person's home, either to make an arrest or to conduct a search. Payton v. New York, 445 U.S. 573, 586, 100 S. Ct. 1371, 1380, 63 L. Ed. 2d 639 (1980); Johnson v. United States, 333 U.S. 10, 14, 68 S. Ct. 367, 369, 92 L. Ed. 436 (1948). An exception to this general proscription arises, however, when voluntary consent to search has been given . . . by the individual whose property is searched, Schneckloth v. Bustamonte, 412 U.S. 218, 219, 93 S. Ct. 2041, 2043, 36 L. Ed. 2d 854 (1973) . . . .\" ( U.S. v. Towns (7th Cir. 1990) 913 F.2d 434, 442.)\n\nWhen the court denied defendant's motion, we must assume that it found he consented to the search. We are bound by that implicit determination. But defendant contends that even under the testimony favoring the prosecution, his consent to the search would have been ineffective because the hour was late and he was exhausted, hungry, and distraught.\n\nHowever, we need \"not now decide whether [any] consent was valid or whether the . . . searches were lawful. Even if the searches were unlawful and the evidence should not have been admitted against [defendant], the other evidence of his guilt was so overwhelming that the alleged error was harmless beyond a reasonable doubt.\" ( United States v. Murray (9th Cir. 1976) 530 F.2d 856, 857.) His confessions amounted to almost the whole of the prosecution's guilt and penalty case. The record strongly suggests that his remorse prompted him to confess, not the fear or the realization that incriminating evidence might be found, or had been found, in his apartment. Although the physical evidence recovered from the apartment served to confirm certain details of his confession to Carter's murder, he confessed in detail and led the police to the body. The state proved by overwhelming evidence that he killed Carter. It has met its burden of showing that \"any possible error admitting the contested evidence was harmless beyond a reasonable doubt. (See Chapman v. California (1967) 386 U.S. 18, 24 [17 L. Ed. 2d 705, 710, 87 S. Ct. 824, 24 A.L.R.3d 1065].)\" ( People v. Perry (1972) 7 Cal. 3d 756, 776, 103 Cal. Rptr. 161, 499 P.2d 129; cf. U.S. v. Towns, supra, 913 F.2d at pp. 446-447.)\n\nH. Denying Motions to Sever Counts Charging Fowler and Chavez Murders from Count Charging Carter Murder\n\nOn March 19, 1986, defendant filed a motion to sever trial on counts I and II of the information-the counts alleging the 1976 murders of Fowler and Chavez-from count III, which alleged the 1978 Carter murder.\n\nRelying on Williams v. Superior Court (1984) 36 Cal. 3d 441, 452-454, 204 Cal. Rptr. 700, 683 P.2d 699, defendant argued that all the factors that case listed as favoring severance applied to him. Specifically, he maintained that the evidence would generally not be cross-admissible if presented in separate trials because the facts relating to the Carter killing were quite different-e.g., the method was different and it occurred years later-and hence the facts of the killings did not show a particular modus operandi. He also argued that presenting evidence of the killing of three children to one jury would be inflammatory-at the hearing he contended that \"extreme prejudice\" would result from the fact that the victims in the 1976 killings were 10 and 12 years old but the victim in the 1978 killing was only 7. He maintained that the case against him for the 1976 murders was weaker because there was \"no evidence to connect [him] to these crimes,\" and he also observed that count III made him potentially death-eligible whereas counts I and II did not.\n\nIn reply, the prosecution argued that defendant killed Fowler and Carter for sexual reasons and Chavez because he witnessed Fowler's killing. It also argued that the cases were of equal strength because in each he \"confessed to information that only the killer would know.\" It asserted that no killing was more inflammatory than the others. And it maintained that defendant would present a psychiatric defense as he had at his prior trial, raising the issue of intent and requiring litigation of his mental state when he killed all his victims.\n\nThe prosecution conceded that one of the charges carried the potential for the death penalty, but argued that the fact would not prejudice defendant. It also argued that judicial economy favored conducting one trial.\n\nAfter hearing argument at length, the court denied the motion without comment.\n\nOn October 31, 1986, defendant filed papers asking the court to reconsider its ruling in light of People v. Smallwood (1986) 42 Cal. 3d 415, 228 Cal. Rptr. 913, 722 P.2d 197.\n\nThere were two different hearings on the motion to reconsider. At the first, held February 27, 1987, defendant asked the court to hold an in camera hearing so that he could present an offer of proof of possible inconsistent defenses. He asserted, and the court agreed, that presenting inconsistent defenses was a factor to consider in favor of severance. But it refused to hold an in camera hearing, saying it would deny the People due process of law by forcing their absence at a critical stage in the proceedings. It postponed a ruling on the motion because it was unsure whether it had jurisdiction to decide it.\n\nThe second hearing occurred March 18, 1987. On that date, the court initially said it would deny the motion on procedural grounds. It ruled that \"Smallwood does not state any new law . . . .\"\n\nDefendant nonetheless urged the court to reconsider its ruling in light of the new evidence he had wanted to present in the in camera hearing almost three weeks before. When the court reminded him that it would not hold an in camera hearing, he declared that request no longer mattered because in the interim the prosecutor had seen the new evidence. He explained that the new evidence consisted of other \"suspects that were identified by people in the first two murders\" and therefore identity was at issue.\n\nAfter defendant raised this argument the court elected to hear the motion to reconsider on the merits. It ruled that under Evidence Code section 1101, subdivision (b), evidence of each crime was cross-admissible because \"it seems [the prosecution is saying it can show evidence of] motive, intent, plan,\" otherwise adopted the arguments the prosecution set forth, and denied the motion for severance. It emphasized that the People did not have to present their entire case to defeat a motion for severance; their offer of proof was enough. It ruled that there was no issue of identity, notwithstanding defendant's offer of proof. It did agree that inconsistent defenses to the 1976 and 1978 murder charges-a possibility defendant broached during the hearing on the motion-might conceivably justify severance, but it pointed out that his moving papers never raised the possibility that he might present inconsistent defenses, and for that reason it refused to consider such a scenario in making its ruling. \"That [point] is not in any of your moving papers filed at any time that I am aware of. All that you have really talked about is the prejudice . . . .\"\n\nAt trial, defendant presented no psychiatric defense to any charge.\n\nThe governing statute is section 954, which provides in relevant part: \"An accusatory pleading may charge . . . two or more different offenses of the same class of crimes or offenses, under separate counts, . . . . provided, that the court in which a case is triable, in the interests of Justice and for good cause shown, may in its discretion order that the different offenses or counts set forth in the accusatory pleading be tried separately or divided into two or more groups and each of said groups tried separately. . . .\"\n\n\"The statutory requirements for joinder were met here because both incidents involved the same class of crimes-murder. Since the requirements for joinder were satisfied, defendant can predicate error only on a clear showing of potential prejudice. [Citation.] 'The burden is on the party seeking severance to clearly establish that there is a substantial danger of prejudice requiring that the charges be separately tried.' [Citation.]\n\n\"'The determination of prejudice is necessarily dependent on the particular circumstances of each individual case, but certain criteria have emerged to provide guidance in ruling upon and reviewing a motion to sever trial.' [Citation.] Refusal to sever may be an abuse of discretion where: (1) evidence on the crimes to be jointly tried would not be cross-admissible in separate trials; (2) certain of the charges are unusually likely to inflame the jury against the defendant; (3) a 'weak' case has been joined with a 'strong' case, or with another 'weak' case, so that the 'spillover' effect of aggregate evidence on several charges might well alter the outcome of some or all of the charges; and (4) any one of the charges carries the death penalty or joinder of them turns the matter into a capital case. [Citations.]\" ( People v. Sandoval (1992) 4 Cal. 4th 155, 172-173, 841 P.2d 862, affirmed in Victor v. Nebraska (1994) 511 U.S. __ [ 127 L. Ed. 2d 583, 114 S. Ct. 1239].)\n\nThe criteria listed in Sandoval should not be misunderstood as being equally significant, however. \"The first step in assessing whether a combined trial [would have been] prejudicial is to determine whether evidence on each of the joined charges would have been admissible, under Evidence Code section 1101, in separate trials on the others. If so, any inference of prejudice is dispelled.\" ( People v. Balderas (1985) 41 Cal. 3d 144, 171-172, 222 Cal. Rptr. 184, 711 P.2d 480; see People v. Mason (1991) 52 Cal. 3d 909, 934, 277 Cal. Rptr. 166, 802 P.2d 950.)\n\nCross-admissibility suffices to negate prejudice, but it is not needed for that purpose. Although \"'we have held that cross-admissibility ordinarily dispels any inference of prejudice, we have never held that the absence of cross-admissibility, by itself, sufficed to demonstrate prejudice.'\" ( People v. Sandoval, supra, 4 Cal. 4th at p. 173; see also § 954.1, enacted June 5, 1990 [codifying rule].)\n\nWe review the court's ruling for an abuse of discretion. (See People v. Cummings (1993) 4 Cal. 4th 1233, 1284, 850 P.2d 1.) A court abuses its discretion when its ruling \"falls outside the bounds of reason.\" ( People v. DeSantis (1992) 2 Cal. 4th 1198, 1226, 831 P.2d 1210.) The ruling was reasonable.\n\nThe court had before it the prosecution's statement that in the prior trial defendant had relied on a psychiatric defense. It could reasonably conclude that evidence of the killing of Chavez, who the prosecution believed was murdered because he was a witness, would be introduced to challenge an available psychiatric defense ( People v. Mickey, supra, 54 Cal. 3d at p. 639, fn. 1) that defendant lacked the mental capacity to premeditate, deliberate, or conform his behavior to the law's requirements because a personality disorder existing since childhood caused him to fly into rages in certain sexual situations. ( People v. Gay (1972) 28 Cal. App. 3d 661, 667-668, 670, 104 Cal. Rptr. 812.) That was the defense at the prior trial. ( Memro I, supra, 38 Cal. 3d at pp. 693-694.) Defendant did not say that he would not rely on that defense.\n\nAnd the court had before it the prosecution's theory that defendant's modus operandi was to seek out boys to fulfill his sexual desires. Given its discretion to decide severance questions, the court's Conclusion that intent, motive, or plan was at issue was reasonable. (Evid. Code, § 1101, subd. (b).) It properly rejected defendant's surmise that he might offer inconsistent defenses as not having been raised in a timely fashion-he mentioned the matter too late for the court to consider it as possibly weighing in favor of severance.\n\nIn sum, then, the court did not abuse its discretion in finding no cross-admissibility consideration that might favor severance. For that reason, its ruling ordinarily must be sustained. (See Frank v. Superior Court (1989) 48 Cal. 3d 632, 639, 257 Cal. Rptr. 550, 770 P.2d 1119.) An exception might apply if the joinder was so grossly unfair as to deny defendant due process. ( People v. Sandoval, supra, 4 Cal. 4th at p. 174.) No such gross unfairness appears. The crimes were of a similar class: murder. If one was inflammatory, all were.\n\nDefendant also contends that the court erred by not holding an in camera hearing on an offer of proof regarding inconsistent defenses. (He does not point us to anything in the record, however, that shows that the court would have understood his request as pertaining to an offer of proof regarding inconsistent defenses, if indeed it would have so pertained.) Citing Simmons v. United States (1968) 390 U.S. 377, 19 L. Ed. 2d 1247, 88 S. Ct. 967, he maintains that he was unconstitutionally forced to waive one constitutional right to invoke another. He asserts that he had to \"diminish his right to due process of law in presenting his basis for severance of the charges\" in order to \"protect the invasion of his right to counsel under the Sixth Amendment and his right against self-incrimination under the Fifth Amendment . . . .\"\n\nDefendant waived any claim of error, however, when, at the resumed session almost three weeks after the court's initial hearing on the motion to reconsider, he stated that because the prosecution already had the relevant materials he no longer required a closed hearing.\n\nI. Denying Motion Challenging Jury-selection Process\n\nDefendant was tried in the Southeast Judicial District (Norwalk) of the Los Angeles County Superior Court. He implicitly moved to challenge the jury-selection process on the basis that jurors would not be drawn from a representative cross-section of the community. The court implicitly denied the motion. The parties stipulated that the challenge to the jury-selection process that we rejected in People v. Mattson (1990) 50 Cal. 3d 826, 842-844, 268 Cal. Rptr. 802, 789 P.2d 983, was raised on the same record as exists in this case. Mattson was also tried in the Norwalk district. Defendant argues that we should reconsider our holding in Mattson, in which we held that because \"the record does not demonstrate a disparity when the population of this community is used for comparison purposes, defendant has not established a prima facie violation of the cross-section guaranty\" of the state and federal constitutions. ( Id. at p. 844.) We decline to reconsider our Conclusion.\n\nJ. Denying Motion to Dismiss for Failure to Bring the Case Speedily to Trial\n\nDefendant contends that the court erroneously denied a motion to dismiss the charges for failure to bring the case to trial speedily. He maintains that the judgment must therefore be reversed on state law grounds.\n\nWe issued the remittitur in Memro I, supra, 38 Cal. 3d 658, on August 1, 1985, and defendant was returned to superior court for retrial on August 21. He waived his right to a speedy trial. Counsel moved for continuances for various purposes and the case was set for trial on November 3, 1986.\n\nOn June 18, 1986, defendant, acting in propria persona, moved that his case be dismissed for failure to bring it to trial within 60 days \"in contravention of my guaranteed right to a speedy trial.\" The court implicitly denied the motion when it referred his letter to counsel for \"appropriate action\" and continued to grant counsel continuances. The cause was called to trial on April 1, 1987.\n\nAt the time of the motion, section 1382 provided that the court, \"unless good cause to the contrary is shown, must order the action to be dismissed in the following cases: [P] . . . [P] 2. When a defendant is not brought to trial in a superior court within 60 days after the . . . filing of the remittitur in the trial court . . . .\" (See also § 1050, subd. (a) [cases should be tried as soon as possible].)\n\nWe review a decision to grant continuances under section 1382 for an abuse of discretion. ( People v. Johnson (1980) 26 Cal. 3d 557, 569-570, 162 Cal. Rptr. 431, 606 P.2d 738 (plur. opn.).) \"A continuance granted at the request of counsel normally constitutes . . . good cause [citation], at least in the absence of evidence showing incompetency of counsel [citation] or circumstances where counsel's request for a continuance is prompted only by the need to [serve] other clients and the defendant himself objects to the delay. [Citation.]\" ( People v. Wright, supra, 52 Cal. 3d 367, 389.)\n\nThe court plainly did not abuse its discretion in granting continuances rather than dismissing the charges. Defendant's life was at stake. Given the gravity of the charged crimes, the court and counsel could have believed that a rush to try the case would be a rush to death, and there is evidence that the court did so believe-it told defendant that it \"cannot permit you, in effect, to commit suicide by insisting upon going to trial within the 60-day period . . . .\"\n\nThere is nothing whatever in the record to show that counsel's requests for continuances were prompted solely by the need to serve other clients. To try to show that this was the case, defendant relies on the declarations of Peter Larkin, his lawyer, that he spent 42 hours preparing for the case from August-November 1985, and 89 1/2 hours from June-December 1986. This, however, is not enough purely by itself to show a lack of diligence as a matter of law, much less to establish a claim that he was motivated solely \"by the need to [serve] other clients.\" ( People v. Wright, supra, 52 Cal. 3d at p. 389.) Nor is there anything in the record to hint at counsel's incompetence. Rather, our review of the record shows that they were diligent and presented an able defense. They brought important pretrial motions, some of which potentially had significant merit and, if granted, might have benefitted defendant more than anything they could have achieved at trial. In particular, the motion to suppress the confession was crucial, and it was well litigated.\n\nAccordingly, the court did not abuse its discretion in implicitly denying the motion to dismiss the charges by continuing to grant continuances.\n\nDefendant also contends that the Sixth Amendment required that independent counsel be appointed for the hearings on his motions to dismiss the charges and to remove counsel, and that the guaranty was violated when the court refused to grant either motion. He cites no authority for this proposition save the constitutional provision itself. We are not persuaded.\n\nK. Denying Motions to Substitute Counsel\n\nLarkin was appointed to represent defendant August 21, 1985, and on November 14, 1985, Carney was also appointed to represent him. Four times defendant moved to replace them. The court denied each motion.\n\nOn May 9, 1986, defendant complained in court about \"the lax and unconscientious performance of my attorneys . . . .\" A few minutes later he asked that \"a competent attorney be assigned. I feel both these attorneys are incompetent. They haven't been doing their job.\" The court called his request \"ludicrous . . . . They are both competent attorneys.\" Before the hearing concluded, he also complained that his counsel \"hasn't had the time to come down and see me, even. . . . I haven't gotten copies of motions, I haven't gotten copies of the discovery material. He hasn't interviewed witnesses I've requested for seven and eight months, now.\"\n\nOn May 20, 1986, defendant evidently wrote to the court about counsel, and on June 6 it decided to consider his motion to appoint new counsel pursuant to People v. Marsden (1970) 2 Cal. 3d 118, 84 Cal. Rptr. 156, 465 P.2d 44 (Marsden). Defendant asked that counsel be appointed for the Marsden hearing. The court refused.\n\nDefendant declared that his lawyers had failed to give him copies of all discovery materials, discuss and allow him to veto trial strategies, give and explain to him pretrial motions before filing them, keep him informed about the case, investigate avenues that might lead to new evidence, adequately communicate with him, and promptly file a motion in which he was particularly interested. He appeared to be especially concerned about counsel's failure to interview new potential witnesses, some \"90 to 100\" of whom were \"relevant to the pretrial motions and defense in this case . . . .\"\n\nIn response, Carney, Larkin's assistant, acknowledged that he had lost a page of notes defendant had given him. Aside from that minor error, Carney said he had been almost excessively meticulous in preparing pretrial motions, a task on which he had spent many hours. He had tried four capital cases and in effect said that he was aware of the gravity of a capital trial and of the need for a diligent defense \"more than Mr. Memro appears to realize.\" He said that he would never allow defendant, or any defendant, to have the final say on strategy. He would ordinarily tell a client so. Carney explained aspects of the defense's plans and indicated that the defense would not pursue some avenues defendant had demanded, as they were \"just straw issues . . . not of significant consequence [as] to whether or not he is going to get a fair trial, or with respect to pretrial motions.\" Defendant was uncooperative when Carney asked for family-background information that might help at a possible penalty phase. (See ante, p. __ [typed opn., ante, p. 9].)\n\nLarkin also responded in detail to each allegation. Defendant had free access to call his office and did so several times a week, at Larkin's expense. He had visited him in jail at least 15 times. He tried to be responsive to his requests and complaints and to keep him informed. He discussed the case strategy with him. He filed some motions to which defendant was opposed because in his judgment they were necessary. He had an investigator working on the case. There were difficulties because the crimes had occurred so long ago, but the defense was trying to surmount them. Larkin stated that defendant did not want any defense at the penalty trial if one were to occur, but that he would be afforded one anyway.\n\nBoth counsel denied that the relationship with their client was steadily deteriorating-his Marsden motion was a surprise to Larkin. While Carney would not characterize defendant as \"a malingerer or an obstreperous individual,\" he warned that he might refuse to cooperate with future counsel if \"his whims are not answered\" and \"they don't go down and hold his hand . . . .\"\n\nIn response, defendant said that counsel were not being diligent or keeping him informed and that Larkin had promised him \"the final say in strategy.\"\n\nThe court ruled against defendant. It pronounced itself \"satisfied that the attorneys are doing everything they can for you; that they are both qualified and competent . . . .\" The court urged him to cooperate with them for his own sake.\n\nDefendant responded by asking to be removed from the courtroom.\n\nOn November 3 and November 5, 1986, another Marsden hearing was held before temporary Judge John A. Torribio, who had replaced Judge Eugene J. Long in presiding over the trial. Defendant indicated initially that his complaints were no different from those he had brought before Judge Long-\"the problem is that it is continuing.\" He inaccurately told Judge Torribio, who did not have a transcript of the prior hearing, that Judge Long had told his lawyers they did not have to speak with him or show him discovery materials-in sum, \"they can do whatever they want to, and they are going to defend this case however they want to.\" He again complained that his lawyers were refusing to interview witnesses who he thought might be helpful.\n\nThe court decided not to obtain a copy of the transcript of the hearing before Judge Long. It reasoned that it would take too long and would impair defendant's right to a speedy trial, which he had been insisting on for some time. It stated that there would not \"be any continuances[,] because I respect your right to have a speedy trial . . . .\" Instead it went through defendant's list of complaints with him and his counsel to determine which were new and which not. Those raising issues that Judge Long had decided the court declined to hear.\n\nThe court reviewed counsel's performance on the remaining issues. In essence, it asked them whether they were keeping defendant informed and were investigating information that might lead to new evidence. Thereafter it denied the motion without explanation. Defendant immediately asked, \"Why does the court seem to be so concerned about my rights to a speedy trial but so unconcerned about my rights to a fair trial?\"\n\nThe next day, the court granted counsel a continuance to February 18, 1987. The defense used this time to file, on February 6, 1987, motions to strike a prior felony conviction as an aggravating factor; to discover certain information from the South Gate Police Department interrogating officers' personnel files; to dismiss the charges for nonpreservation of evidence, for failure to comply with a 1979 discovery order, and for failure to preserve the officers' records; to exclude the testimony of jailhouse informants; to exclude psychiatric testimony; to suppress certain evidence under section 1538.5; and to waive a jury at the penalty phase, if any. On February 6, 1987, a continuance until March 25, 1987, was granted, and on March 18, 1987, the court ordered jury selection to begin April 1.\n\nOn March 25, 1987, there was another Marsden hearing, at which defendant again complained that counsel had failed to locate witnesses and were unwilling to demand the personnel records of other South Gate police officers, and that he did not want counsel to admit that he was guilty of second degree murder for Carter's killing. Calling Larkin \"a respected and capable attorney,\" the court denied the Marsden motion.\n\nOn June 3, 1987, just before the penalty trial began, defendant made his final Marsden motion. He wanted counsel either to be relieved or to be ordered not to mount a penalty defense. To him, the \"death penalty would be preferable [to] life without parole.\" He declared that counsel would not tell him their plans for the defense. Counsel acknowledged that defendant would not be told the names of specific witnesses for him, but explained that he was trying to get witnesses not to cooperate when he learned of their identity. The court implicitly denied the motion.\n\nDefendant contends that the court erred each time it denied his motion to appoint new counsel. He maintains that there was a \"complete and utter breakdown of the attorney client relationship\" occasioned by counsel's failure to \"contact material witnesses regarding the pre-trial motions\" and to prepare his case in a timely manner.\n\nWe review the court's rulings for an abuse of discretion. ( People v. Berryman (1993) 6 Cal. 4th at p. 1070.) We shall explain that none occurred.\n\nA defendant \"may be entitled to an order substituting appointed counsel if he shows that, in its absence, his Sixth Amendment right to the assistance of counsel would be denied or substantially impaired.\" ( People v. Berryman, 6 Cal. 4th at p. 1070, citing Marsden, supra, 2 Cal. 3d 118.) The law governing a Marsden motion \"is well settled. 'When a defendant seeks to discharge his appointed counsel and substitute another attorney, and asserts inadequate representation, the trial court must permit the defendant to explain the basis of his contention and to relate specific instances of the attorney's inadequate performance. [Citation.] A defendant is entitled to relief if the record clearly shows that the first appointed attorney is not providing adequate representation [citation] or that defendant and counsel have become embroiled in such an irreconcilable conflict that ineffective representation is likely to result [citations].' [Citations.]\" ( People v. Fierro (1991) 1 Cal. 4th 173, 204, 821 P.2d 1302.)\n\nThe court's rulings were reasonable. The record makes plain that counsel were representing defendant diligently and well. The great substance and weight of his appeal to this court, which contains 46 claims of error, was made possible by tenacious litigation of his cause before, during and after trial. The record also reveals that the court \"carefully inquired into defendant's reasons for requesting substitution of counsel, which proved to be either groundless or patently insufficient to demonstrate 'such an irreconcilable conflict that ineffective representation [was] likely to result.'\" ( People v. Fierro, supra, 1 Cal. 4th at p. 206.)\n\nTo be sure, defendant made plain that he did not like his lawyers and did not think highly of them. That, however, \"was not enough [to show a conflict of interest]. 'If a defendant's claimed lack of trust in, or inability to get along with, an appointed attorney were sufficient to compel appointment of substitute counsel, defendants effectively would have a veto power over any appointment and by a process of elimination could obtain appointment of their preferred attorneys, which is certainly not the law.'\" ( People v. Berryman, 6 Cal. 4th at p. 1070.)\n\nDefendant also asserts that, over his objection, counsel implicitly entered a plea of guilty to Carter's murder when they conceded at closing argument that he killed him. He implicitly argues that doing so over his objection reveals an irreconcilable conflict.\n\nCounsel did not, however, plead defendant guilty to any offense. At closing argument, he conceded the obvious: that defendant had killed Carter. At one point his tongue slipped and he called Carter's killing a \"murder,\" but he then argued, \"In looking at the charges you have to again, as I stated, look at the malice instructions to determine whether malice has even been shown, number one. Because if there's no malice, no malice aforethought, it's not a murder. It could be a manslaughter.\" The jury had just been instructed on voluntary manslaughter. We think that counsel's concession, read as a whole, was only that defendant had killed Carter, not that he had murdered him. To acknowledge that fact was not to enter a plea of guilty on his behalf. As Judge Posner explained in a case with a similar posture, \"the lawyer was trying to enhance his credibility with the jury by conceding his client's guilt of the offense of which the evidence was overwhelming, and to focus his efforts on the weakest link in the state's case, the charge that [defendant] had attempted to have sex with his victim, an essential element . . . . [P] . . . The lawyer did not plead Underwood guilty; he merely acknowledged the weight of the evidence of criminal confinement in order to contrast it with the lack of direct evidence of an intent . . . to have intercourse with the victim.\" ( Underwood v. Clark (7th Cir. 1991) 939 F.2d 473, 474; see also People v. Jones (1991) 53 Cal. 3d 1115, 1139-1140, 282 Cal. Rptr. 465, 811 P.2d 757.)\n\nDefendant next contends that the court erred in failing to admonish him and obtain his waiver of his rights to confrontation, to a jury trial, and against self-incrimination (see Boykin v. Alabama (1969) 395 U.S. 238, 243, 23 L. Ed. 2d 274, 89 S. Ct. 1709; In re Tahl (1969) 1 Cal. 3d 122, 132-133, 81 Cal. Rptr. 577, 460 P.2d 449) before counsel entered a plea of guilty to Carter's murder. As stated, however, counsel entered no such plea.\n\nIf defendant is arguing that counsel's concession caused an irreconcilable conflict, we disagree. He may not have welcomed their approach, but he was not entitled to claim that an irreconcilable conflict had arisen merely because he could not veto their reasonable tactical decisions. ( People v. Douglas (1990) 50 Cal. 3d 468, 520, 268 Cal. Rptr. 126, 788 P.2d 640.) This was a reasonable tactical decision (see Underwood v. Clark, supra, 939 F.2d at p. 474): defendant's confession would have made any argument that he did not kill Carter wholly unpersuasive, and counsel were wise to maintain credibility with the jury by acknowledging the obvious. (See People v. Jackson (1980) 28 Cal. 3d 264, 292-293, 168 Cal. Rptr. 603, 618 P.2d 149 (plur. opn.).)\n\nDefendant also contends that by denying his motion to appoint counsel for him to help him prosecute his Marsden claims the court deprived him of rights he asserts to due process of law and to the effective assistance of counsel. We acknowledge that some courts have appointed independent counsel to press a Marsden claim. ( People v. Hardy (1992) 2 Cal. 4th 86, 132, 825 P.2d 781, 5 Cal. Rptr. 2d 796.) However, defendant cites no authority requiring such an appointment, and indeed the rule is to the contrary. ( People v. Douglas, supra, 50 Cal. 3d at p. 521.) What our decisions have consistently required is that the court listen to and evaluate a defendant's claim that counsel are failing to perform adequately. The court did so, and defendant was entitled to no more.\n\nDefendant further maintains that the court deprived him of due process of law when it \"used his assertion of [his] speedy trial rights as a pretext to deny him the opportunity to prepare fully for the Marsden hearings.\" It will be recalled that the court ruled that because it would interfere with the case proceeding to trial, no transcript of the first hearing could be prepared, yet the next day it granted counsel a continuance. Even assuming that there was some inconsistency in those rulings, we are unpersuaded that there was a violation of any possible right to due process of law. Defendant, counsel, and the court went through defendant's list of complaints and determined jointly which ones had already been adjudicated before Judge Long. We discern no denial of due process in this procedure.\n\nFinally, defendant contends that when the court denied his Marsden motion between the guilt and penalty trials it failed to apply the proper standard to such a motion, at least to the extent of appointing new counsel to investigate its basis. In his view, the standard following the verdict of guilt was less burdensome to him than that articulated in Marsden's progeny, which require that \"'the record clearly show[] that the first appointed attorney is not providing adequate representation [citation] or that defendant and counsel have become embroiled in such an irreconcilable conflict that ineffective representation is likely to result . . . .'\" ( People v. Fierro, supra, 1 Cal. 4th 173, 204.) Rather, he asserts that after the guilt trial he need have presented only a \"colorable claim that he was ineffectively represented at trial\" ( People v. Stewart (1985) 171 Cal. App. 3d 388, 397, 217 Cal. Rptr. 306) to have the court appoint independent counsel to investigate and bring the motion. However, after he filed his opening brief we held that the standard actually articulated in Stewart is the Marsden standard. ( People v. Smith (1993) 6 Cal. 4th 684, 693-694, 863 P.2d 192, 25 Cal. Rptr. 2d 122.) Under that standard, as we have already concluded, no abuse of discretion appears in denying the motion. Defendant wanted to be put to death; his lawyers desired a different outcome for him; their choice cannot be faulted, nor that of the court in refusing to relieve them.\n\nL. Failing to Preserve Photographic Evidence\n\nAt trial, defendant learned that the Bell Gardens police had recently lost photographs of individuals whom Josi Feliciano identified in 1976 as being the two men taking turns riding the motorcycle. Defendant asserted that one of the missing photographs was taken of someone else who matched the composite sketch exactly.\n\nThe court ordered the parties to search for the missing photographs and agreed that if they could not be found the jury would have to be told they showed persons other than defendant. Defendant moved to also instruct the jury that one of the photographs precisely matched the composite sketch, but the court tentatively denied the motion on grounds of cumulativeness. It put aside a definitive ruling on the question of the photograph's resemblance to the composite sketch pending the prosecution's effort to try to locate the photographs.\n\nThe prosecution was unable to do so, and the parties stipulated before the jury that on July 28, 1976, Josi Feliciano was shown six color photographs similar to the composite sketch of the individual seen at Ford Park, and that he identified a photograph of a person other than defendant-apparently the man with the knife he had seen near Fowler and Chavez. The parties also stipulated that Feliciano later viewed photographic lineups and identified individuals other than defendant as possibly being the man on the motorcycle and the man wearing the green Army jacket.\n\nDefendant does not attack the tentative ruling or the stipulation, but maintains that failing to preserve the photographs undermined rights he asserts to a fundamentally fair trial and to a reliable guilt and penalty determination. The claim lacks merit. The parties resolved the problem by providing the jury with evidence by stipulation of the photographs' content and significance. Defendant apparently was satisfied with the stipulation, and he may not now complain about it-he has not preserved the point for appeal. ( People v. Fierro, supra, 1 Cal. 4th 173, 215; cf. People v. Bacigalupo (1991) 1 Cal. 4th 103, 138-139, 820 P.2d 559, vacated and remanded on other grounds sub nom. Bacigalupo v. California (1992) U.S. [121 L. Ed. 2d 5, 113 S. Ct. 32]) [when stipulation made only to control form in which evidence would be introduced following adverse ruling, point preserved for appeal].)\n\nDefendant also may be understood to contend that to enter into the stipulation constituted ineffective assistance of counsel. We do not agree. It was professionally reasonable to stipulate in effect that Josi Feliciano identified individuals other than defendant as having been at Ford Park with Fowler and Chavez on the night they were killed.\n\nM. Claims of Insufficient Evidence for First Degree Murder Convictions\n\nDefendant challenges the sufficiency of the evidence of the first degree murder convictions for the Carter and Chavez killings.\n\n1. Sufficiency of Evidence of Felony Murder of Carter\n\nDefendant contends that the jury had insufficient evidence of a violation or attempted violation of section 288 to convict him of first degree murder under a felony-murder theory for the Carter killing. He asserts that the resulting conviction violated his rights under state law and the due process clause of the federal Constitution.\n\n\"To determine [the validity of a claim of insufficient] evidence, we must inquire whether a rational trier of fact could find defendant guilty beyond a reasonable doubt. In this process we must view the evidence in the light most favorable to the judgment and presume in favor of the judgment the existence of every fact the trier of fact could reasonably deduce from the evidence. To be sufficient, evidence of each of the essential elements of the crime must be substantial and we must resolve the question of sufficiency in light of the record as a whole. [Citations.]\" ( People v. Johnson, supra, 6 Cal. 4th 1, 38.) If we determine that a rational trier of fact could find the essential elements of the crime proven beyond a reasonable doubt, the due process clause of the United States Constitution is satisfied ( Jackson v. Virginia (1979) 443 U.S. 307, 318-319, 61 L. Ed. 2d 560, 99 S. Ct. 2781), as is the due process clause of article I, section 15 of the California Constitution ( People v. Berryman, 6 Cal. 4th at p. 1083).\n\nWe have held that a violation of section 288 occurs whenever, to gratify the child's or the actor's sexual desires, an actor touches a child under 14. ( People v. Raley (1992) 2 Cal. 4th 870, 907, 830 P.2d 712; but cf. People v. Scott (1994) 9 Cal. 4th 331, 344, fn. 7, 885 P.2d 1040 [declining to decide whether the act must be \"patently 'sexual' in nature as well as [in] intent . . . .\"].)\n\nIn his confession, defendant said he lured Carter to his apartment to photograph him in the nude. Once there he turned on some strobe lights, which seemed to mesmerize the young boy. After a few minutes Carter said he wanted to leave, which angered defendant who then choked him and tried to have sex with his body.\n\nThe jury also received evidence of defendant's sexual interest in youths. These included pornographic magazines and photographs featuring young boys in the nude.\n\nIn Memro I, supra, 38 Cal. 3d 658, we rejected a claim that there was insufficient evidence to satisfy defendant's felony-murder conviction for Carter's killing. He urges a different Conclusion now, but on the record here as on that of the prior trial, \"there is little doubt that [he] possessed the requisite lewd intent\" (38 Cal. 3d at p. 697) to commit a lewd or lascivious act with Carter, and that \"the 'arrangement' of lights, pornographic materials and other paraphernalia in [his] apartment would suggest sufficient planning to enable [him] to commit lewd conduct once a willing participant came along.\" (38 Cal. 3d at p. 699.)\n\nIn addition to the assortment of magazines and photographs suggesting defendant's sexual interest in youths, the jury also had before it the confession in which he described wanting to photograph Carter and wanting to have sex with 12-year-old Scott Fowler before killing him in 1976. From this evidence, a rational jury could infer that he planned to act on his sexual interest in young boys by performing a lewd or lascivious act with Carter. That the jury did not hear the psychiatric testimony presented at the prior trial regarding defendant's sexual motivation to bring Carter to his apartment ( Memro I, supra, 38 Cal. 3d at pp. 693-694) altered the quantum of evidence, to be sure, but did not, in our view make the evidence insufficient as a matter of law. Even if, as he asserts, taking a photograph of a nude child was not a crime at the time (see § 311.3, enacted by Stats. 1981, ch. 1056, § 1, p. 4080), a rational trier of fact could infer that he intended to touch Carter with lewd or lascivious intent while alive, and took a direct if possibly ineffectual step toward that goal-in other words, he attempted to violate section 288. ( Memro I, supra, 38 Cal. 3d at pp. 697-698; see also § 21a, enacted by Stats. 1986, ch. 519, § 1, p. 1859 [later codifying rule].) Indeed, the trier of fact could infer from the evidence that defendant disrobed Carter while alive with lewd or lascivious intent. Such conduct and mental state would complete a violation of section 288. (See post, p. __ [typed opn., post, p. 81].) In sum, the evidence sufficed for a rational trier of fact to conclude that he attempted to violate, or did violate, section 288. The law required no more for a conviction of first degree murder on a felony-murder theory. ( § 189.)\n\n2. Sufficiency of Evidence of Premeditation and Deliberation in the Chavez and Carter Killings\n\nFirst degree murder may be found when the prosecution proves beyond a reasonable doubt that the actor killed with malice aforethought, intent to kill, premeditation, and deliberation. ( §§ 187, 189.) Defendant contends that there was insufficient evidence that Carter and Chavez were killed with premeditation and deliberation. He is unpersuasive.\n\nWe have defined \"deliberate\" as \"'formed or arrived at or determined upon as a result of careful thought and weighing of considerations for and against the proposed course of action.'\" ( People v. Perez (1992) 2 Cal. 4th 1117, 1123, 831 P.2d 1159.) We have defined \"premeditated\" as \"'considered beforehand.'\" (Ibid.) Premeditation and deliberation can occur in a brief interval. \"The test is not time, but reflection. 'Thoughts may follow each other with great rapidity and cold, calculated judgment may be arrived at quickly.'\" ( People v. Bloyd (1987) 43 Cal. 3d 333, 348, 233 Cal. Rptr. 368, 729 P.2d 802.)\n\nThe jury heard evidence that the bodies of Fowler and Chavez were found 178 feet apart. They also heard defendant's confession that he had no sexual interest in Chavez, whom he found \"fat and ugly\"; he killed him because he started screaming after Fowler was knifed.\n\nThere was sufficient evidence of premeditation and deliberation for a rational trier of fact to conclude that defendant's actions satisfied those elements of first degree murder. The jury could reasonably have concluded that defendant decided he had to kill Chavez to prevent him from identifying him as Fowler's killer, a motive it could reasonably conclude was imbued with deliberation and premeditation. ( People v. Perez, supra, 2 Cal. 4th at p. 1126.) Moreover, he had to run from Fowler's position to Chavez's. He then cut Chavez's throat from behind. A rational jury could conclude that he intended death and no other result, and that he considered his options as he ran toward Chavez.\n\nA rational jury could also have found Carter's killing premeditated and deliberate. It could have concluded that defendant used masking tape to tie Carter's hands behind his back and then strangled him. It could have concluded that these deeds required reflection and consumed some time. It could also have determined that Carter was killed to prevent him from later identifying defendant as his captor and sexual exploiter, a motive requiring calculation and reflection.\n\nDefendant relies on People v. Anderson (1968) 70 Cal. 2d 15, 26-27, 73 Cal. Rptr. 550, 447 P.2d 942, which, to sustain a verdict of premeditated and deliberate murder, required (1) extremely strong evidence of planning, (2) evidence of motive in conjunction with evidence of planning or of a calculated manner of killing, or (3) evidence of all three indicia of premeditation and deliberation. But Anderson's \"guidelines are descriptive, not normative\" ( People v. Perez, supra, 2 Cal. 4th at p. 1125); its \"factors, while helpful . . ., are not a sine qua non to finding first degree premeditated murder, nor are they exclusive.\" (Ibid.) For example, notwithstanding Anderson, supra, 70 Cal. 2d at pages 26-27, the method of killing alone can sometimes support a Conclusion that the evidence sufficed for a finding of premeditated, deliberate murder. ( People v. Hawkins (1995) 10 Cal. 4th 920, 956-957, 897 P.2d 574.)\n\nN. Denying Motion to Exclude Photographs and Magazines Portraying Youths\n\nOver an objection made on grounds of irrelevance and undue prejudice, and also implicitly made under Evidence Code section 1101, the court ordered certain magazines and photographs depicting clothed and unclothed youths admitted under Evidence Code section 1101, subdivision (b), as evidence of motive and intent to perform a lewd or lascivious act on Carter in violation of section 288. The court admonished the jury not to consider the items as evidence that defendant was evil or was disposed to commit certain types of crimes.\n\nWe review the admission of evidence under Evidence Code section 1101 for an abuse of discretion. ( People v. Daniels (1991) 52 Cal. 3d 815, 856, 277 Cal. Rptr. 122, 802 P.2d 906 [evidence of other offenses].)\n\nCharacter evidence is admissible in this state unless barred by a particular statute. (Evid. Code, § 1100.) Evidence Code section 1101, subdivision (a), creates an exception to that rule. It generally forbids introducing character evidence to \"prove . . . conduct on a specified occasion.\" Subdivision (b) of Evidence Code section 1101 in turn creates an exception to subdivision (a): evidence of conduct may be admitted to prove motive or intent, although it may not be admitted to show a Disposition to do the type of conduct shown by the evidence.\n\nWe have examined the magazines and photographs in question. They contain sexually explicit stories, photographs and drawings of males ranging in age from prepubescent to young adult. Some of the photographs are of similar character. Others depict youths in a manner that is not sexually suggestive.\n\nThe court did not abuse its discretion by ruling the magazines admissible under Evidence Code section 1101, subdivision (b), to show intent. We believe the photographs were admissible to show defendant's intent to molest a young boy in violation of section 288.\n\nDefendant's intent to violate section 288 was put at issue when he pleaded not guilty to the crimes charged. ( People v. Balcom (1994) 7 Cal. 4th 414, 422-423, 867 P.2d 777; see also People v. Robbins (1988) 45 Cal. 3d 867, 879, 248 Cal. Rptr. 172, 755 P.2d 355.) Although not all sexually explicit in the abstract, the photographs, presented in the context of defendant's possession of them, yielded evidence from which the jury could infer that he had a sexual attraction to young boys and intended to act on that attraction. (See People v. Bales (1961) 189 Cal. App. 2d 694, 701, 11 Cal. Rptr. 639 [photograph of molestation victim in the nude admissible to show \"lewd intent.\"].) The photographs of young boys were admissible as probative of defendant's intent to do a lewd or lascivious act with Carter.\n\nDefendant also contends that the items were substantially more prejudicial to the jury than they were probative. Hence, in his view, their introduction was barred by Evidence Code section 352. We find no abuse of discretion in admitting the magazines or the photographs. To be sure, some of this material showed young boys in sexually graphic poses. It would undoubtedly be disturbing to most people. But we cannot say that it was substantially more prejudicial than probative, for its value in establishing defendant's intent to violate section 288 was substantial. The court balanced the items' evidentiary worth against their potential to cause prejudice and determined that the former substantially outweighed the latter. Its decision was reasonable.\n\nCiting Dawson v. Delaware (1992) 503 U.S. 159, 117 L. Ed. 2d 309, 112 S. Ct. 1093, a capital sentencing case, defendant also contends that his First Amendment rights were violated when materials he was constitutionally entitled to possess were used against him. He did not raise a claim of error on this ground below, and he has not preserved it for review.\n\nO. Denying Motion to Exclude Photographs of Murder Victims\n\nOver defendant's objection on grounds of prejudicial impact substantially exceeding probative value and cumulativeness (Evid. Code, § 352), the court admitted post mortem photographs of each victim. Some of them showed the victims at the murder scenes, while others were taken in the coroner's office. The court ordered certain photographs cropped before admission to minimize any unduly prejudicial effect, and excluded others entirely as cumulative.\n\nDefendant contends that the admitted photographs lacked any probative value because the cause of death was never disputed, he offered to stipulate to certain details regarding the cause of death, and the coroner's testimony was sufficient to explain the cause of death in any event. In sum, he argues that the photographs were gruesome and that after seeing them, \"the jury no doubt felt compelled to convict someone.\"\n\nThe People respond in effect that all the photographs were probative of malice-i.e., they show an intent to kill and therefore express malice-and, because a clothesline was used to strangle Carter, photographs of his body, which show a cord wrapped around his neck, are probative of deliberation and premeditation. (See, e.g., People v. Garceau (1993) 6 Cal. 4th 140, 180-181, 862 P.2d 664 [photographs showing bodies' condition when found relevant to issue of malice]); People v. Raley, supra, 2 Cal. 4th at pp. 896-897 [same].)\n\nThe court had broad discretion in deciding whether to admit such evidence. ( People v. Raley, supra, 2 Cal. 4th at p. 896.)\n\n1. Undue Prejudice\n\nWe agree with defendant that some of the photographs the jurors saw must have been extremely disturbing to them. They were of children who were killed in a ghastly manner. The jury knew these grim facts in the abstract, to be sure, but the photographs made them horribly concrete. It would surprise us if the jurors were able to view them without being sickened, disgusted, or shocked.\n\nBut the question before us is whether the court's ruling that the photographs could be admitted was within reason. It was. The photographs were clearly probative of the prosecution's theory that defendant killed with malice, and they corroborated other evidence of the circumstances surrounding the murders. Before returning its verdict, the jury was instructed \"not [to] be influenced by pity for a defendant or by prejudice against him,\" and \"not [to] be swayed by mere sentiment, conjecture, sympathy, passion, [or] prejudice . . . .\" We assume that the jurors followed that instruction ( People v. Mickey, supra, 54 Cal. 3d 612, 689, fn. 17) and considered the photographs for their evidentiary value alone.\n\nSome of the photographs of defendant's victims clearly depict them as they were found, whereas others may conceivably reflect the authorities' examining procedures. To be sure, a risk of prejudice may arise should \"'photographs taken during an autopsy . . . . depict the corpse as it is left, not by its assailant, but by the probing instruments and procedures of the medical examiner.'\" ( State v. Iverson (N.D. 1971) 187 N.W.2d 1, 38, quoting People v. Turner (1969) 17 Mich. App. 123, 132 [169 N.W.2d 330, 335]; see also People v. Burns (1952) 109 Cal. App. 2d 524, 541, 241 P.2d 308; People v. Allen (1986) 42 Cal. 3d 1222, 1258, 232 Cal. Rptr. 849, 729 P.2d 115 (lead opn.).) In the case of autopsy photographs as with any other, however, the court enjoys broad discretion in deciding whether prejudice substantially outweighs probative value. ( People v. Steger (1976) 16 Cal. 3d 539, 552-553, 128 Cal. Rptr. 161, 546 P.2d 665.) Often their probative value can be considerable. ( People v. Carter (1957) 48 Cal. 2d 737, 751, 312 P.2d 665 (lead opn.).) We find no abuse of discretion.\n\n2. Cumulativeness\n\nAs stated, defendant also argued that many of the photographs were prejudicial because they were cumulative. The court agreed: it excluded some on that ground. We find no abuse of discretion in the court's culling procedure, for each photograph showed different aspects of the killings; none gratuitously duplicated any other.\n\n3. Constitutional Contentions\n\nDefendant also contends that admitting the photographs violated a right he asserts to a fundamentally fair trial under the Fourteenth Amendment and to a reliable determination of guilt under the Eighth Amendment. He did not raise these bases for exclusion with the court, and did not preserve the claim on appeal. In any event, we do we see how either constitutional provision was implicated by the photographs' admission. The contention lacks merit. (See People v. Price (1991) 1 Cal. 4th 324, 440-441, 821 P.2d 610.)\n\nP. Sustaining Objection on Relevance Grounds to Cross-examination\n\nThe prosecution called Fowler's mother, Mary Ella Fowler, to identify her son and Chavez from photographs, and also to explain that the two concocted a story for their respective parents that they were going to spend the night at the other's house to avoid detection as going to the park. The direct examination contained 10 questions.\n\nCross-examination was equally brief. Defendant elicited from Mrs. Fowler that Fowler was precocious: \"He had a lot of older friends.\" Defendant wanted to know how much older those friends were. The prosecutor objected that the answer would be irrelevant. The court sustained the objection.\n\nDefendant contends that ending this line of questioning infringed on rights he asserts to cross-examine witnesses under the confrontation clause of the federal Constitution's Sixth Amendment. He argues that \"if counsel had been permitted to question Mrs. Fowler, and she had revealed that most of Scott's older friends were sixteen, then doubt would be cast on the proposition that Fowler spoke with [him]. Furthermore, probing into this area [might] have revealed other persons who[ ] Fowler may have met on the night of the murders.\"\n\n\"The claim lacks merit. On this record, the trial court's ruling, even if erroneous, could not have prejudiced defendant because any favorable inference he sought to draw from the proposed impeachment was purely speculative.\" ( People v. Davis, 11 Cal. 4th 137a.)\n\nIn any event, we discern no constitutional violation. \"The confrontation clause allows 'trial Judges . . . wide latitude . . . to impose reasonable limits on . . . cross-examination based on concerns about, among other things, harassment, prejudice, confusion of the issues, the witness' safety, or interrogation that is repetitive or only marginally relevant.' ( Delaware v. Van Arsdall [(1986) 475 U.S. 673, 679, 89 L. Ed. 2d 674, 106 S. Ct. 1431,] [8 L. Ed. 2d 674,] 683] [speaking specifically of cross-examination on bias, but without limitation thereto].) The court here did no more than it was permitted.\" ( People v. Clair, supra, 2 Cal. 4th 629, 656, fn. 3.) It stayed well within the bounds of the \"wide latitude\" the Constitution affords it.\n\nQ. Denying Request to Instruct With a Version of CALJIC No. 2.91\n\nDefendant asked the court to instruct the jury with a version of CALJIC No. 2.91 (4th ed. 1987 supp.). We quote in relevant part the language he requested: \"You must be satisfied beyond a reasonable doubt of the accuracy of the identification of defendant as the person who committed the offense before you may convict him.\"\n\nThe court refused to give the instruction as inapplicable, saying, \"There has been nobody identifying the defendant as the person who committed the crime . . . .\"\n\nDefendant contends that the failure to give the instruction violated state law and also \"created an impermissible risk that the conviction and sentence of death were arbitrary and unreliable in violation of appellant's rights under the Fifth, Sixth and Fourteenth Amendments to the United States Constitution.\"\n\nWe disagree. The court was correct: no witness identified defendant as the killer. He concedes this, but argues that there was testimony and other evidence suggesting he might have been the killer, and that the prosecution emphasized that testimony at closing argument.\n\nWhether or not we agree with defendant's description of the prosecution's case, it did not require the court to give his version of CALJIC No. 2.91. A party is not entitled to an instruction on a theory for which there is no supporting evidence. ( People v. Roberts, supra, 2 Cal. 4th 271, 313.) No witness identified defendant as the killer.\n\nDefendant's constitutional claims must also fail. We cannot discern any reason that the Constitution would require giving an instruction when no evidence to support it was adduced.\n\nR. Adequacy of Notice of Intent to Seek Felony-murder Conviction\n\nThe prosecutor requested a felony-murder instruction on the basis that defendant killed Carter while violating or attempting to violate section 288. Defendant objected on the ground that the felony-murder theory was unavailable to the People because the felony-murder special circumstance was found not true in his prior trial. As noted, however, his position is unpersuasive. (See ante, at pp. __-__ [typed opn., ante, pp. 13-16].)\n\nDefendant contends that the prosecution surprised him when it sought the instruction on a felony-murder theory for Carter's killing, thereby violating rights he finds in the Sixth and Eighth Amendments to the United States Constitution to adequate notice of the charges against him.\n\nIf the prosecution's felony-murder theory surprised defendant, he could have moved to reopen the taking of evidence so as to present a defense against it. (See People v. Murtishaw (1981) 29 Cal. 3d 733, 751, fn. 11, 175 Cal. Rptr. 738, 631 P.2d 446.) He did not do so. He has waived any claim of error.\n\nDefendant urges that if we reach that Conclusion, counsel were ineffective for failing to raise the matter at trial. We disagree. Counsel were not deficient in failing to move to reopen the case, for it was plain to the parties that the prosecution was proceeding on a theory of felony murder. In Memro I, supra, 38 Cal. 3d 658, 695, we declared that \"substantial evidence supports the verdict on a felony-murder (attempted lewd or lascivious conduct ( § 288)) theory\" and therefore the case could be retried on that theory (see 38 Cal. 3d at pp. 690, 699-700). The retrial proceeded accordingly.\n\nS. Failure to Instruct Sua Sponte That Jurors Must Agree Which Act Constituted Underlying Felony for Purpose of Felony Murder\n\nDefendant contends that the court should have instructed the jurors on its own motion that they must unanimously agree on the nature of the lewd or lascivious act he committed or attempted to find him guilty of felony murder. He contends that its failure to do so created a risk that the guilt judgment was arrived at arbitrarily and capriciously, in violation of a right he discerns in the Eighth Amendment.\n\nWe disagree, for reasons we gave in People v. Pride (1992) 3 Cal. 4th 195, 833 P.2d 643. We held that the defendant in that case \"was not entitled to a unanimous verdict as to the particular manner in which any such felony murder occurred.\" ( Id. at p. 250.) Although it appears that the defendant in Pride did not specify the constitutional basis for his claim as clearly as defendant does in this case, we believe that Pride's reasoning applies with equal force to the claim presented here.\n\nWe reach that Conclusion notwithstanding defendant's argument, in his reply brief, that Pride is distinguishable because this case was retried following a court finding that a felony-murder special-circumstance allegation was not true. (Ante, p. __ [typed opn., ante, p. 13].) He asserts that \"the jury instructions and verdict had to be precisely drawn to avoid violation of the double jeopardy clause.\"\n\nIn Memro I, supra, 38 Cal. 3d at pages 690, 695, 699-700, we held that there was sufficient evidence that Carter was killed in an attempt to violate section 288 that retrial for his killing could constitutionally proceed on a felony-murder theory. We have already observed there was no double jeopardy violation in retrying defendant on a felony-murder theory. We conclude that the holding of People v. Pride, supra, 3 Cal. 4th at pages 249-250, applies fully to this case.\n\nT. Failure to Instruct on Other Offenses Involving Children\n\nDefendant contends with regard to his conviction of Carter's murder-which, if decided on a theory of felony murder, required a Conclusion that he violated or attempted to violate section 288-that the court erred in failing to instruct sua sponte on what he calls \"lesser included offenses\" of section 288, namely \"misdemeanor child molest\" under former section 647a and \"contributing to the delinquency of a minor under Penal Code section 272.\" He maintains that the error deprived him of a right he asserts to a reliable guilt determination under the Eighth Amendment to the United States Constitution.\n\nWhen defendant killed Carter, former section 647a provided in relevant part: \"Every person who annoys or molests any child under the age of 18 is a vagrant and is punishable upon first conviction by a fine not exceeding five hundred dollars ($500) or by imprisonment in the county jail for not exceeding six months or by both . . . .\" (See Stats. 1976, ch. 1139, § 262, p. 5136; see now § 647.6.) Defendant argues in essence that the jury might have found he intended only to annoy Carter by photographing him.\n\nIt has been held that misdemeanor child molestation under former section 647a was a lesser included offense of section 288. ( People v. Poon (1981) 125 Cal. App. 3d 55, 80, 178 Cal. Rptr. 375.) Even if that is so, and even if defendant was entitled to an instruction on a lesser included offense in the felony-murder context, in which the rationale for instructing on lesser included offenses may not be implicated (cf. People v. Geiger (1984) 35 Cal. 3d 510, 518-520, 199 Cal. Rptr. 45, 674 P.2d 1303)-issues we do not decide-we disagree that he was entitled to an instruction on that offense.\n\nA criminal defendant is entitled to an instruction on a lesser included offense only if (see People v. Morrison (1964) 228 Cal. App. 2d 707, 712-713, 39 Cal. Rptr. 874) \"there is evidence which, if accepted by the trier of fact, would absolve [the] defendant from guilt of the greater offense\" ( id. at p. 712) but not the lesser. (Accord, People v. Green (1971) 15 Cal. App. 3d 524, 529, 93 Cal. Rptr. 84; see also People v. Berry (1976) 18 Cal. 3d 509, 518-519, 134 Cal. Rptr. 415, 556 P.2d 777; People v. McCoy (1944) 25 Cal. 2d 177, 187-188, 153 P.2d 315; People v. Lesnick (1987) 189 Cal. App. 3d 637, 642-643, 234 Cal. Rptr. 491; People v. Chambers (1982) 136 Cal. App. 3d 444, 455-456, 186 Cal. Rptr. 306; People v. Ellers (1980) 108 Cal. App. 3d 943, 954, 166 Cal. Rptr. 888; People v. Salas (1978) 77 Cal. App. 3d 600, 607-608, 143 Cal. Rptr. 755.)\n\nIn this case, there was no evidence that, if accepted by the trier of fact, would absolve defendant of having violated section 288 but would not absolve him of having violated former section 647a.\n\nSpecifically, defendant was not entitled to an instruction based on section 647a if there was no evidence that one or more of the elements peculiar to a violation of section 288 was absent but that all of the elements required to establish a violation of former section 647a were present. Assuming that former section 647a is a lesser included offense of section 288, it must be so because it lacks the element of a lewd touching. \"The primary distinction between section 288, subdivision (a), and section 647.6 is that the former requires that a touching or constructive touching occur, and that the touching is lewd. It is this type of overt contact, or intrusion upon the body of the child done with lewd intent, that distinguishes a section 288, subdivision (a), offense from the less serious offense defined by section 647.6.\" ( People v. Levesque (1995) 35 Cal. App. 4th 530, 539.) That primary distinction was also true of section 647a, the predecessor of section 647.6. ( People v. La Fontaine (1978) 79 Cal. App. 3d 176, 185, 144 Cal. Rptr. 729 [discussing version identical as relevant here to that in effect when defendant killed Carter; see Stats. 1967, ch. 154, § 1, p. 1241; Stats. 1976, ch. 1139, § 262, p. 5136].)\n\nThere was evidence from which a rational trier of fact could conclude that a violation of section 288 occurred. It will be recalled that defendant confessed that brought Carter to his apartment intending to take nude pictures of him. He admitted disrobing him, although he stated that he did so after death. But the jury could conclude, notwithstanding that part of defendant's confession, that he disrobed Carter while alive, either at his command or by an actual touching, with lewd or lascivious intent, and then, as the prosecutor argued, sodomized or attempted to sodomize him while alive. \"The jury may believe a part and reject the remainder of a confession [citations].\" ( People v. Garcia (1935) 2 Cal. 2d 673, 679, 42 P.2d 1013; cf. People v. Ramirez (1990) 50 Cal. 3d 1158, 1176, 270 Cal. Rptr. 286, 791 P.2d 965 [jury could find sexual acts took place while victim was alive \"in the absence of any evidence\" of intent \"to have sexual conduct with a corpse\"]; accord, People v. Cain (1995) 10 Cal. 4th 1, 46, 892 P.2d 1224.) The disrobing while alive, actual or constructive, if accepted by the trier of fact, establishes a violation of section 288. ( People v. Mickle (1991) 54 Cal. 3d 140, 176, 284 Cal. Rptr. 511, 814 P.2d 290.) What was missing, however, was any evidence that a lewd touching was absent but that all of the elements of a violation of section 647a-i.e., lewd conduct without a lewd touching-were present. Defendant interpreted the evidence as not establishing any criminally lewd act or act of criminal annoyance at all: indeed, on appeal he maintains that the evidence showed only that he brought Carter to his home to photograph him, Carter wanted to leave, and he impulsively strangled him. His closing argument proceeded along similar lines. For its part, the prosecution relied on evidence that he violated or attempted to violate section 288. Under these circumstances, he was not entitled to an instruction based on former section 647a.\n\nWe turn to the other offense to which defendant refers. When he killed Carter, section 272 provided in relevant part, \"Every person who commits any act or omits the performance of any duty, which act or omission causes or tends to cause or encourage any person under the age of 18 years to come within the provisions of Sections 600, 601, or 602 of the Welfare and Institutions Code or which act or omission contributes thereto, or any person who, by any act or omission, or by threats, commands, or persuasion, induces or endeavors to induce any person under the age of 18 years or any ward or dependent child of the juvenile court to fail or refuse to conform to a lawful order of the juvenile court, or to do or to perform any act or to follow any course of conduct or to so live as would cause or manifestly tend to cause any such person to become or remain a person within the provisions of Sections 600, 601, or 602 of the Welfare and Institutions Code, is guilty of a misdemeanor . . . .\" (See Stats. 1976, ch. 1125, § 16, p. 5037.)\n\nIt has been held that contributing to a minor's delinquency under section 272 is not a lesser included offense to performing a lewd or lascivious act with a child under 14 as proscribed by section 288, subdivision (a). (See People v. Vincze (1992) 8 Cal. App. 4th 1159, 1162-1164.) Accordingly, we find defendant's contention unpersuasive.\n\nIn sum, there was no error. Nor was there any violation of the Eighth Amendment. ( People v. Berryman, supra, 6 Cal. 4th at p. 1081, fn. 9.)\n\nU. Prosecutor's Remark Purportedly on Defendant's Failure to Testify\n\nDefendant maintains that the prosecutor engaged in misconduct at closing argument when he purportedly commented on defendant's failure to testify. He contends that the misconduct violated the Fifth, Sixth, Eighth, and Fourteenth Amendments.\n\nDiscussing Fowler's and Chavez's killings, the prosecutor dwelt on the alibi defense: defendant was elsewhere, read about the killings in the newspapers, and falsely confessed. He pointed out discrepancies in the newspaper accounts and the confession. For the most part, he emphasized that defendant could not have given his detailed description of the facts solely from having read newspaper accounts of the crimes.\n\nThe prosecutor proceeded. \"Now, the theory-I assume the defense theory is that for some reason he wanted to falsely confess to this crime and he wanted to do it properly. He didn't want to be caught in any lies or anything for some reason, otherwise who would be prosecuting him for these murders which he apparently wanted? And if there's a reason for that, perhaps we'll hear it from the defense. I don't know what it is.\n\n\"Why doesn't he tell us about his friend that the police are looking for? Now, according to most of these articles, very prominent in the whole thing is that there were these two people at this park. Now why doesn't he tell us about his pal who presumably got away?\n\n\"How is it that 27 months later he could remember the sort of detail that he has if he didn't do it?\"\n\nDefendant complains that the remark \"Why doesn't he tell us\" was a comment on his failure to take the witness stand. To be sure, the federal Constitution has been deemed to prohibit a prosecutor's comment on a defendant's failure to testify. ( People v. Mayfield, supra, 5 Cal. 4th 142, 178, citing Griffin v. California (1965) 380 U.S. 609, 615, 14 L. Ed. 2d 106, 85 S. Ct. 1229.) But defendant did not assign misconduct to the remark when the prosecutor made it, and there is no reason to believe any harm could not have been cured. Defendant's point must therefore be rejected on procedural grounds. (See People v. Benson, supra, 52 Cal. 3d 754, 794.)\n\nMoreover, counsel cannot be faulted for not interposing an assignment of misconduct. Such an action would have been without merit, for it is manifest that the prosecutor did not comment on the failure to testify.\n\nWe examine whether there is a reasonable likelihood that the jury would have understood the remark to be a comment on defendant's failure to testify. ( People v. Clair, supra, 2 Cal. 4th 629, 663.)\n\nThere is no such likelihood. The remark's context shows that the prosecutor was ridiculing the possibility that defendant wanted to confess falsely to two homicides on the basis of newspaper stories. He first stated that such an idea was inherently implausible. He then added that it was unlikely in fact: if defendant were confessing solely on the basis of newspaper accounts, he would, in his confession, have mentioned an accomplice because the stories mentioned the presence of two men at John Anson Ford Park.\n\nSo this was not a comment on defendant's failure to testify, but rather on discrepancies between newspaper accounts of the Bell Gardens killings and the confession. It was \"a fair comment on the state of the evidence that falls outside the purview of Griffin . . . .\" ( People v. Mayfield, supra, 5 Cal. 4th at p. 178.) There was no misconduct, and no constitutional violation.\n\nIII.PENALTY PHASE ISSUES\n\nDefendant contends that various errors bearing on penalty occurred in this case. As will appear, none of his claims has merit.\n\nA. Constitutionality of the 1977 Death Penalty Statute\n\nDefendant contends that California's 1977 death penalty statute (Stats. 1977, ch. 316, pp. 1256-1266) is facially unconstitutional, in essence because it is unconstitutionally vague and gives the trier of fact too much discretion to decide his fate. For those asserted reasons he urges that it violates the federal Constitution's Eighth Amendment. It does not. (Tuilaepa v. California, 512 U.S. __ [ 129 L. Ed. 2d 750, 114 S. Ct. 2630] [considering the 1978 death penalty statute]; Pulley v. Harris (1984) 465 U.S. 37, 51-54, 79 L. Ed. 2d 29, 104 S. Ct. 871 [considering the 1977 statute]; People v. Jackson, supra, 28 Cal. 3d 264, 315-316 (plur. opn.); accord, 28 Cal. 3d at p. 318 (conc. opn. of Newman, J.).)\n\nB. Denying Motion to Waive Jury for Penalty Trial\n\nAfter his motion to sever counts was denied, defendant asked the court to hear the penalty trial itself in lieu of the jury. The court refused, stating that the prosecution was entitled to a jury trial and wanted one. Citing Singer v. United States (1965) 380 U.S. 24, 13 L. Ed. 2d 630, 85 S. Ct. 783, defendant maintains that the ruling violated the due process clause and a right he claims to a reliable sentence under the Eighth Amendment because there were compelling reasons to have the court, rather than the jury, decide his fate.\n\nWe have held that there is no state law right to waive a penalty trial by jury over the prosecution's objection. ( People v. King (1970) 1 Cal. 3d 791, 795, 83 Cal. Rptr. 401, 463 P.2d 753.) The court could not constitutionally have granted defendant's request over the prosecutor's opposition. (Cal. Const., art. I, § 16.) Thus his claim that former section 190.4, subdivision (c), did not require prosecutorial approval for a jury waiver must fail. The state Constitution would have trumped any such implicit statutory rule. ( People v. Roberts, supra, 2 Cal. 4th 271, 336, fn. 18.)\n\nThe United States Constitution is not offended: it is proper to require the prosecution and the court to agree to a defendant's request for a court trial. ( Singer v. United States, supra, 380 U.S. at pp. 26, 36.) Defendant does not dispute this, but urges us to conclude that his case falls under Singer's dictum that \"there might be some circumstances where a defendant's reasons for wanting to be tried by a Judge alone are so compelling that the Government's insistence on trial by jury would result in the denial to a defendant of an impartial trial.\" (380 U.S. at p. 37.) He asserts that there were such circumstances here because two noncapital murder charges were joined with a capital murder charge, and the evidence relating to the three killings would be \"highly inflammatory,\" and would reveal inconsistent defenses to the killings.\n\nWe agree with the People that this argument does little more than restate defendant's unsuccessful contention that the court wrongly denied his motion to sever the counts for the 1976 murders from that for the 1978 murder. (Ante, at pp. __-__ [typed opn., ante, pp. 50-55].) We disagree that there were any circumstances that might possibly have entitled him to a court trial under Singer.\n\nC. Failing to Order Counsel to Tell Defendant the Defense Strategy\n\nAs described ante, page __ [typed opn., ante, p. 61], before the penalty phase began, defendant moved that counsel either be relieved or not present a penalty defense. He complained that they would not tell him the defense strategy. Counsel acknowledged that defendant would not be told the names of specific witnesses, but explained that defendant was trying to get witnesses not to cooperate when he learned of their identity.\n\nFrom the beginning of pretrial proceedings, the record reveals that defendant wanted no meaningful penalty defense. His refusal to mount a penalty defense continued throughout the trial. It culminated in his statement to the jury urging his execution. (Ante, p. __ [typed opn., ante, p. 9].) Just before the penalty phase began, his counsel told the court, \"Mr. Memro would rather we not proceed with presenting evidence at a penalty phase. He has informed us that if we were to call some of these people or tell him that we are going to call them that he would make sure that they wouldn't appear.\" Defendant replied, \"I believe I have a right to know what is going to be done at the penalty phase or what isn't going to be done.\" The court ruled, \"I am not going to tell [counsel] to do anything.\"\n\nThe court also refused to appoint new counsel who might tell defendant what witnesses would be called at the penalty phase.\n\nDefendant contends in effect that the court's refusal either to compel counsel to adequately confer with him regarding penalty phase strategy or to relieve them for refusing to do so denied him the assistance of counsel in violation of the state and federal constitutions.\n\nThe Sixth and Fourteenth Amendments to the United States Constitution and article I, section 15, of the California Constitution conferred a right to the assistance of counsel on defendant. ( Maine v. Moulton, supra, 474 U.S. 159, 168; People v. Bonin (1988) 46 Cal. 3d 659, 694, 250 Cal. Rptr. 687, 758 P.2d 1217.) But we have concluded that the right \"is not infringed when 'the opportunity [of the defense] to participate fully and fairly in the adversary factfinding process' [citation] is not significantly limited.\" (46 Cal. 3d at p. 695, first bracketed material added in Bonin.)\n\nNo such limitation occurred here. Rather, it was defendant who was trying to thwart the ability of the defense to participate fully in the factfinding process, and counsel who were trying to present a defense as fully as possible. At the time of the retrial, counsel was obligated to present evidence in mitigation even over defendant's objection. ( People v. Deere (1991) 53 Cal. 3d 705, 712, 716-717, 280 Cal. Rptr. 424, 808 P.2d 1181.) Neither the right to counsel nor any right to a reliable penalty determination was violated by the court's refusal to accede, in effect, to defendant's desire to prevent his counsel from presenting evidence in mitigation. Nor do we discern any other federal constitutional violation.\n\nDefendant also asserts that the state Constitution's guaranty of the right to be \"personally present with counsel\" (art. I, § 15) would be \"illusory if counsel were allowed to keep secret from [their] client [their] plans for trial.\" We disagree with the premise, however. Counsel obviously told him that they would introduce evidence in mitigation. They did refuse to reveal who the witnesses might be after he told them he would try to stop them from testifying. We do not see how the right to be personally present with counsel was violated by counsel's refusal to aid him in that quest.\n\nD. Sufficiency of Notice of Aggravating Evidence\n\nDefendant contends that the prosecution erred in failing to give him proper notice of evidence introduced in aggravation. He asserts that this failure violated state law and a right he discerns to a fundamentally fair penalty determination under the Fifth, Sixth, Eighth, and Fourteenth Amendments. As will appear, his claim is not preserved for review, for he failed to move to have the evidence excluded.\n\nThe cause was called to trial April 1, 1987. Months before, on December 30, 1986, the prosecution filed a notice of intention to introduce evidence in aggravation. In court the prosecutor handed defense counsel a photocopy of \"essentially the entire district attorney's file\" of the Schroeder incident.\n\nOn February 6, 1987, defendant moved to have evidence of his prior conviction barred from any penalty trial. The court agreed, ruling that no evidence of the prior conviction could be introduced. At trial the prosecution elicited other evidence that defendant assaulted Schroeder in 1972 when he was nine years old. His conviction of that crime was not introduced in evidence.\n\nSection 190.3 provided in relevant part, \"Except for evidence in proof of the offense or special circumstances which subject a defendant to the death penalty, no evidence may be presented by the prosecution in aggravation unless notice of the evidence to be introduced has been given to the defendant within a reasonable period of time, as determined by the court, prior to trial. Evidence may be introduced without such notice in rebuttal to evidence introduced by the defendant in mitigation.\"\n\n\"The purpose of this provision 'is to advise an accused of the evidence against him so that he may have a reasonable opportunity to prepare a defense at the penalty trial. [Citation.]'\" ( People v. Rodrigues (1994) 8 Cal. 4th 1060, 1152, 885 P.2d 1.) \"We have construed the phrase 'prior to trial' to mean before the cause is called to trial.\" ( People v. Mitcham (1992) 1 Cal. 4th 1027, 1070, 824 P.2d 1277.)\n\nBut defendant did not move, before or during trial, to exclude evidence of the attack itself. He has failed to preserve his claim on appeal. In any event, a motion to exclude the evidence would have been unavailing. The prosecution had given ample notice of its intention to rely on the incident involving Schroeder, and defendant could not reasonably have believed that by having caused proof of the prior conviction to be barred, he had thwarted the prosecution's ability to show the circumstances of the crime against the victim by other evidence.\n\nE. Allowing Defendant to Testify In Favor of Death\n\nDefendant testified before the jury that he wanted a verdict of death. (Ante, p. __ [typed opn., ante, p. 9].) He contends that \"the effect of [his] testimony was to compel the death penalty,\" and that it \"likely relieved the jury of its full responsibility to fix the penalty based upon the proper statutory factors.\" He asserts that the evidence was irrelevant (Evid. Code, § 350), and that its introduction made the verdict unreliable and thereby violated rights he finds in the Fifth, Sixth, Eighth, and Fourteenth Amendments.\n\nDefendant invited any error when he testified. Moreover, he offered no objection at trial on the grounds he now raises. He has failed to preserve his claims for review.\n\nF. Propriety of Questions Put to Defendant\n\nAfter defendant testified that he desired death, he was cross-examined. He was asked whether he planned to appeal his conviction-he denied that he did-and whether he felt he would \"get quicker and more direct access to the Supreme Court if you're given the death penalty . . . .\" Defendant did not object to these questions.\n\nDefendant asserts that the cross-examination improperly focused the jury on the role of the appellate process, thereby relieving the jury of the need to be aware that it was responsible for determining his fate. He contends that this procedure violated the federal Constitution.\n\nTo be sure, \"arguably the mere mention of appeal is improper, since it rarely serves any constructive purpose and may lead the jury on its own to infer that [its] responsibility for penalty determination is diluted. But when the context does not suggest appellate correction of an erroneous death verdict, the danger that a jury will feel a lesser sense of responsibility for its verdict is minimal.\" ( People v. Bittaker (1989) 48 Cal. 3d 1046, 1106, 259 Cal. Rptr. 630, 774 P.2d 659.) As was true in Bittaker, there was no suggestion of appellate correction of an erroneous verdict. (Cf. Caldwell v. Mississippi (1985) 472 U.S. 320, 325-326, 328-329, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (plur. opn.); id. at p. 341 (opn. of O'Connor, J., conc. in part \u0026 in judg.).) Therefore \"defense counsel's failure to object is fatal to his contention.\" ( People v. Bittaker, supra, 48 Cal. 3d at p. 1106.)\n\nG. Propriety of Prosecutor's Closing Argument\n\nDefendant contends that the prosecutor committed misconduct when he argued to the jury that life imprisonment without possibility of parole was \"legally not worse\" than death, and again when he argued that \"if you think that by sentencing him to life without possibility of parole that you're going to cause him to sit around and contemplate this for the rest of your life, the rest of his life, I think you're going to make a big mistake.\"\n\nDefendant did not assign misconduct to either statement. He maintains here that the prosecutor's first comment misstated the law, and that the second hinted to the jury that defendant might not spend the rest of his life in prison if not sentenced to death. The result, in his view, was to deprive him of a right he asserts to a fair, reliable, and individualized sentence under the Sixth, Eighth, and Fourteenth Amendments.\n\nBecause defendant did not assign misconduct to either statement, and there is no reason to believe that an admonition would not have cured any harm, his claims are not preserved on appeal. ( People v. Davis, supra, 10 Cal. 4th 463, 537.)\n\nDefendant urges that if we so conclude, the failure to assign misconduct to the prosecutor's statements amounts to ineffective assistance of counsel. We disagree.\n\nFirst, the prosecutor's comment that life imprisonment without possibility of parole was \"legally not worse\" than death was accurate as a legal matter, whatever philosophical feelings individuals might have on the subject ( People v. Bloom (1989) 48 Cal. 3d 1194, 1223, fn. 7, 259 Cal. Rptr. 669, 774 P.2d 698), for indeed death is the worse punishment. At the time the jury decides the penalty for a death-eligible individual that person will already have been convicted of first degree murder and one or more special circumstances will have been found true, meaning that a minimum penalty of life imprisonment without possibility of parole must be imposed, or the accused will have been convicted of another offense imposing a sentence either of death or of life imprisonment without possibility of parole (e.g., Mil. \u0026 Vet. Code, § 1672, subd. (a); Pen. Code, § 128). Thus, the law's command to the trier of fact to weigh aggravating and mitigating circumstances at that time can only mean to consider the possibility of a worse punishment than what the individual was already automatically subject to. ( §§ 190.2, subd. (a), 190.3.) The 1977 statute was no different. Moreover, section 190.4, subdivision (b), provides that if a jury twice cannot decide the penalty, the court may order a third jury impaneled or may sentence the defendant to prison. It is unlikely, in our view, that the Legislature would have allowed a court to prescribe the legally worse penalty if the community could not agree that the defendant should receive it. (The 1977 statute's different penalty retrial scheme, see post, p. __ [typed opn., post, p. 95], does not compel a different Conclusion.)\n\nAnd the prosecutor's reference to defendant's lack of future reflection was a comment that because he would not spend the rest of his life racked by regret over his murders of Fowler, Chavez, and Carter, imprisonment was an insufficient punishment. He was not arguing that defendant would spend less than the rest of his life in prison if sentenced to that fate.\n\nH. Instructing Jurors on Penalty Factors to Which Defendant Objected\n\nDefendant requested that the court not instruct the jury with language derived from factors (e) and (j) of section 190.3 in the penalty instructions. It refused.\n\nThe instructions directed the jury to consider whether or not the victims consented to \"the homicidal acts\" or were \"participants in the defendant's homicidal conduct,\" and whether \"the defendant was an accomplice to the offenses and his participation . . . relatively minor.\"\n\nDefendant contends that giving instructions he views as listing inapplicable mitigating factors violated the Fifth, Eighth, and Fourteenth Amendments to the United States Constitution. We have rejected similar claims ( People v. Danielson (1992) 3 Cal. 4th 691, 718, 838 P.2d 729 [construing 1978 death penalty statute]) and do so here as well.\n\nI. Failing to Instruct on Elements of Crime Constituting Prior Violent Conduct or to Instruct on Assault\n\nAt the penalty phase, the prosecution introduced evidence of prior violent criminal conduct. The court instructed the jury that the evidence was introduced to show that defendant violated section 273d, which the court defined as \"cruel or inhuman bodily injury on a child which involved the express use of force.\" As the parties were discussing the language of this instruction, defendant said he'd \"just as soon have the 245\"-i.e., have the jury instructed on assault with force likely to produce great bodily injury ( § 245, subd. (a)(1)). But the court found section 273d to be a better fit and did not instruct on assault. Defendant did not ask the court to instruct the jury on the elements of section 273d.\n\nHe contends that the court erred-he does not specify under what statutory or constitutional regime-in failing to define the elements of section 273d sua sponte. As he concedes, we have rejected that claim ( People v. Johnson, supra, 6 Cal. 4th 1, 48-49), and we continue to do so.\n\nHe also contends that the court should have instructed the jury in the language of assault rather than \"cruel or inhuman bodily injury on a child . . . .\" He argues that the latter definition was inflammatory and violated the Eighth Amendment because it created a risk that the penalty would be arbitrarily decided.\n\nThe parties point us to no case in which this question has previously been raised, and we have been unable to locate any. Assuming that defendant's comment registered an objection, there was no error, because there was substantial evidence that defendant violated section 273d and, as a matter of law, simply providing the definition of an offense supported by substantial evidence cannot unduly inflame a trier of fact.\n\nJ. Failing to Instruct Jury to Consider Defendant's Background\n\nThe jury was instructed to take into account \"any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse of the crime[,] and any sympathetic or other aspect of the defendant's character or record as a basis for a sentence less than death . . . .\" Some of the testimony of defendant's sister, offered in mitigation, described aspects of his background. He contends that the court violated the Eighth Amendment by tilting the jury's determination in favor of death when it failed to instruct sua sponte that the jury must also consider background as well as \"character or record . . . .\"\n\nIn People v. Webb (1993) 6 Cal. 4th 494, 534, 862 P.2d 779, we stated that giving an instruction containing language very similar to that quoted hereabove left \"no possibility the jury misunderstood its obligation to consider defendant's character and background evidence . . . .\" Webb is dispositive. There was no error, and no violation of any constitutional right.\n\nK. Failing to Instruct Jury on Consequences of a Deadlock\n\nThe jury was instructed that \"in order to make a determination as to the penalty, all twelve jurors must agree.\" Defendant contends that the court's failure to inform the jury sua sponte of the consequence of a deadlock violated the Fifth, Sixth, Eighth, and Fourteenth Amendments.\n\nUnder the 1977 death penalty statute, if the jury could not agree on the penalty, the court was required to impose a punishment of life imprisonment without possibility of parole. (Former § 190.4, subd. (b).) People v. Bell (1989) 49 Cal. 3d 502, 262 Cal. Rptr. 1, 778 P.2d 129, held that it was not error to refuse to tell the jury, in response to an inquiry about the legal effect of a penalty deadlock, that if a single juror would not vote for death the penalty would be set at life imprisonment under the 1977 version of section 190.4, subdivision (b). The opinion stated, \"the instruction given-that a penalty verdict must be unanimous-correctly stated the law, and defendant did not complain when the court refused to educate the jury on the legal conse-quences of a possible deadlock. That refusal was not error. [Citations.]\" ( Id. at pp. 552-553 (plur. opn.); see also People v. Wader, supra, 5 Cal. 4th 610, 664 [construing 1978 law; no duty to instruct jury a deadlock on penalty may occur].)\n\nIn People v. Haskett (1990) 52 Cal. 3d 210, 276 Cal. Rptr. 80, 801 P.2d 323, also litigated under the 1977 death penalty statute, the jury asked the court about the effect of a deadlock, and it replied that it would declare a mistrial and dismiss the jury. It did not explain that the defendant would then have been sentenced to imprisonment by operation of law. ( Id. at p. 240.) We rejected a contention that the court had misinformed the jury. As in Bell, we explained that it is not required to \"educate the jury on the legal consequences of a possible deadlock\"-to do so might tempt a \"'juror inclined against a finding that death was the appropriate penalty'\" to exercise \"'a veto power over the verdict'\" \"'simply by refusing to participate in good faith in the deliberations.'\" (Ibid.)\n\nBecause a court is not required to educate the jury about the legal consequences of a deadlock in response to a request to do so, a fortiori it is not required to do so sua sponte. Citing Mak v. Blodgett (9th Cir. 1992) 970 F.2d 614, and Kubat v. Thieret (7th Cir. 1989) 867 F.2d 351, defendant urges a contrary Conclusion. We decline to rely on those cases. Federal circuit court opinions do not bind us. ( People v. Santamaria, supra, 8 Cal. 4th 903, 923.) They may serve as persuasive authority, of course, but only when they are just that-persuasive. Having carefully considered the reasoning of both opinions, we find that neither one is so.\n\nL. Denying Motion to Give Lingering Doubt Instruction\n\nWhile discussing possible instructions with the prosecution and the court, defendant moved for an instruction on lingering doubt regarding his guilt as a factor in mitigation. The prosecutor objected on the ground that it was unfair to request the instruction so late in the proceeding. The court, without explanation, denied the request.\n\nDefendant contends that the court violated rights he finds in state law (see People v. Terry (1964) 61 Cal. 2d 137, 145-147, 37 Cal. Rptr. 605, 390 P.2d 381) and in the Fifth, Sixth, Eighth, and Fourteenth Amendments when it denied his motion.\n\nWe have held that neither the federal nor the state Constitution entitles a defendant to an instruction on lingering doubt. ( People v. Johnson (1992) 3 Cal. 4th 1183, 1251-1252, 842 P.2d 1.) But \"this is not to say that the jury's consideration of any such doubt is improper; defendant may urge his possible innocence to the jury as a factor in mitigation.\" ( Id. at p. 1252.) An instruction of the type given here (ante, p. [typed opn., ante, p. 94]), derived from factor (k) of section 190.3, adequately supports a defendant's presentation of evidence or argument that lingering doubt militates against a verdict of death. ( People v. Johnson, supra, 3 Cal. 4th at pp. 1251, 1252.) There was no error.\n\nM. Denying Motion to Modify the Verdict\n\nDefendant contends that the court erred when it denied his motion to reduce the sentence under former section 190.4, subdivision (e). He argues that the court considered matters it should have not and failed to adequately consider matters it should have. The result, he urges, violated state law and requires a remand. He also contends implicitly, by citing United States Supreme Court cases, that the result violated the federal Constitution.\n\nFormer section 190.4, subdivision (e), provided as relevant here: \"In every case in which the trier of fact has returned a verdict or finding imposing the death penalty, the defendant shall be deemed to have made an application for modification of such verdict or finding pursuant to subdivision (7) of Section 1181. In ruling on the application the Judge shall review the evidence, consider, take into account, and be guided by the aggravating and mitigating circumstances referred to in Section 190.3, and shall make an independent determination as to whether the weight of the evidence supports the jury's findings and verdicts. He shall state on the record the reason for his findings.\" The quoted statute is identical in meaning to the current version of section 190.4, subdivision (e). ( People v. Frierson (1991) 53 Cal. 3d 730, 751, 280 Cal. Rptr. 440, 808 P.2d 1197.)\n\n\"In ruling on the application, the trial Judge must independently reweigh the evidence of aggravating and mitigating circumstances and determine whether, in the Judge's independent judgment, the weight of the evidence supports the jury verdict. [Citation.] The Judge must also state on the record the reasons for the ruling. [Citation.]\" ( People v. Mincey (1992) 2 Cal. 4th 408, 477, 827 P.2d 388.) \"'On appeal, we subject [the] ruling . . . to independent review.' [Citation.] 'Of course, when we conduct such scrutiny, we simply review the trial court's determination after independently considering the record; we do not make a de novo determination of penalty.'\" ( People v. Berryman, 6 Cal. 4th 1048, 1106, 864 P.2d 40, 25 Cal. Rptr. 2d 867.)\n\nThe court began its Discussion of the motion by acknowledging that it \"must make an independent review of the evidence to determine whether or not the weight of the evidence supports the jury's findings and verdicts.\"\n\nIt then stated, \"the evidence clearly supports the verdict of the People for the following reasons.\n\n\"The three victims were particularly vulnerable. I believe the oldest child was ten if I am not mistaken. Two of the children were at a public park[;] admittedly they did not have permission to be out that night, but they were at a public park fishing.\n\n\"One of the children, and I think [this is] probably the most aggravating circumstance of all in this case, was the son of a family friend so that you had not only the violation of the particular vulnerability of children, but you had the compounding aggravation-it was proper [sic] to me the ultimate horror-a family friend tricks and cajoles a vulnerable child of tender years to come into the home, total trust implicit there, and then for little or no provocation, the child is strangled.\n\n\"That fact alone to me I find particularly abhorrent.\n\n\"In addition, the court has not seen any evidence of remorse on the part of Mr. Memro. In fact, I have seen the contrary, as indicated by his statement at the penalty phase. He remains as obdurate as he has ever been, and any remorse that he may have felt when he was in custody that evening has long since disappeared into the wind. He remains a truculent, defiant and particularly insensitive individual.\n\n\"There are admittedly factors in mitigation. He has apparently been a[] model prisoner. There is nothing to indicate in the record that he has been other than that.\n\n\"He clearly did cooperate with the police.\n\n\"Those are the only two factors in mitigation the court can find. The others listed by the defense are various ways of saying the same thing over and over again[:] . . . remorse of the crimes, confession, admission, cooperation with the police, aiding the police . . . .\n\n\" .....................................\n\n\"In this case, the court feels that the factors in aggravation are overwhelmingly against Mr. Memro[], and the court therefore adopts and approves the verdict of the jury for the reasons I have stated herein, and the court . . . affirms and ratifies the verdict of the jury that the commitment should be death.\"\n\nDefendant contends that the court erred in considering in aggravation his \"obdurate,\" \"truculent, defiant and particularly insensitive\" personality and his lack of remorse. These comments, he urges, violated state law, for they are not factors the trier of fact could have considered in aggravation (former § 190.3); hence neither could the court have done so (former § 190.4, subd. (e)).\n\nWe disagree. Defendant presented evidence that he was remorseful when apprehended for his crimes against the four boys whom he assaulted, and he argued that his regret should be considered in mitigation. The trier of fact, and hence the court, was entitled to infer from his demeanor as he testified at the penalty phase that any remorse was short lived-his usual mien, as inferable from the circumstances of the crimes and from his testimony, was wanting in remorse. That is the sole Conclusion the court drew.\n\nDefendant also maintains that the court failed to consider all possible evidence pointing to factors in mitigation, including evidence of background, character, and lack of a prior felony conviction, and lack of future dangerousness. That is not so. It stated that it could only find in mitigation that he had cooperated with the police and had been a model prisoner. It also stated that \"the evidence clearly supports the verdict of the People . . . .\" The court need not orally recite all possible mitigating evidence (see People v. Berryman, 6 Cal. 4th at p. 1107); \"'there is no indication in the record that the court ignored or overlooked such evidence.'\" (Ibid.) Finally, there was no evidence presented on lack of future dangerousness-the only reference to it came in closing argument.\n\nDefendant implicitly predicates his claims of federal constitutional error on the putative violation of former section 190.4. Because there was no violation of that statute, there can be no basis for his constitutional claims.\n\nN. Claim of Error for Considering Probation Report\n\nDefendant also asserts that the court improperly relied on the probation report in ruling on his motion to modify the verdict. The result, in his view, violated state law and the Fifth Amendment's privilege against self-incrimination, presumably as applied to the states under the Fourteenth Amendment.\n\nThe court erred when, as it apparently did, it considered the report. ( People v. Wader, supra, 5 Cal. 4th 610, 665-666.) But even if it did so, \"it is apparent from the record that [the report] played no role whatsoever in the court's decision\" ( People v. Fierro, supra, 1 Cal. 4th at p. 253)-\"'we must assume that the court was not improperly influenced' thereby\" ( People v. Berryman, 6 Cal. 4th at p. 1106). Defendant argues otherwise, mentioning the court's comment about his habitual obduracy, but he does not cite any part of the report that might support his assertion. There was no prejudicial violation of state law or of the Fifth or Fourteenth Amendments. (Ibid.)\n\nO. Miscellaneous Claims of Error\n\nDefendant contends in summary fashion that certain rights he finds in the federal Constitution or under state law were violated during the penalty trial under the 1977 statute. He acknowledges that we have rejected each such claim, but urges us to reconsider our views. We decline to undertake the reevaluations he urges, and we cite authority for our current view after each contention we list.\n\nDefendant's contentions are: (1) the court and the statute failed to designate which statutory factors are aggravating and which are mitigating ( People v. Espinoza (1992) 3 Cal. 4th 806, 827, 838 P.2d 204 [construing 1978 statute]); (2) the court failed to instruct the jury that it must find death the proper sentence beyond a reasonable doubt ( People v. Marshall (1990) 50 Cal. 3d 907, 934-935, 269 Cal. Rptr. 269, 790 P.2d 676 [construing 1978 statute]); (3) the court failed to instruct the jury that it must find the aggravating circumstances outweighed those in mitigation beyond a reasonable doubt (ibid.), and that the aggravating circumstances were true beyond a reasonable doubt ( People v. Gordon, supra, 50 Cal. 3d 1223, 1273-1274 [construing 1978 statute]); (4) the statute is unconstitutional because it does not require (a) written findings as to the aggravating factors the jury found ( People v. Montiel (1994) 5 Cal. 4th 877, 943, 855 P.2d 1277 [construing 1978 statute]), (b) jury unanimity on aggravating factors (ibid.), or (c) a procedure to enable this court to evaluate the sentencer's decision-by which we understand defendant to mean to undertake proportionality review ( People v. Frierson (1979) 25 Cal. 3d 142, 180-184, 158 Cal. Rptr. 281, 599 P.2d 587 (plur. opn.)); (5) the court failed to instruct that a sentence of life imprisonment without possibility of parole means just that ( People v. Gordon, supra, 50 Cal. 3d at pp. 1277-1278); (6) the court failed to instruct the jury to consider affirmatively all evidence in mitigation and that it could show mercy (see People v. Caro (1988) 46 Cal. 3d 1035, 1067, 251 Cal. Rptr. 757, 761 P.2d 680 [construing 1978 statute]); (7) the use of a felony to qualify defendant both for a first degree murder conviction under a felony-murder theory and for a death sentence was impermissible ( People v. Marshall, supra, 50 Cal. 3d at pp. 945-946); (8) the court failed to instruct the jury sua sponte that an instruction given at the guilt phase to disregard sympathy (ante, p. __ [typed opn., ante, p. 74]) did not apply at the penalty phase ( People v. Adcox (1988) 47 Cal. 3d 207, 265, 253 Cal. Rptr. 55, 763 P.2d 906 [construing 1978 statute]); (9) an instruction's reference to extreme mental disturbance violated a right to have the jury consider less severe mental disturbances in mitigation ( People v. Turner (1994) 8 Cal. 4th 137, 208, 878 P.2d 521 [construing 1978 statute]); (10) the statute deprived him of the benefits of determinate sentencing ( People v. Montiel, supra, 5 Cal. 4th at p. 943); (11) the instruction to the jury to consider \"whether or not\" defendant committed the crime while \"under the influence of extreme mental or emotional disturbance\" and \"whether or not\" mental illness or defect may have impaired his reasoning or his ability to behave lawfully could have led the jury to consider the absence of these mitigating factors in aggravation ( People v. McPeters (1992) 2 Cal. 4th 1148, 1191, 832 P.2d 146 [construing 1978 statute; discussing § 190.3, factor (d)]); (12) it was unconstitutional to introduce prior-crimes evidence ( People v. Montiel, supra, 5 Cal. 4th at p. 943); (13) it was impermissible to fail to charge the offense underlying the felony-murder theory-i.e., the violation of section 288 ( People v. Morris (1988) 46 Cal. 3d 1, 14-18, 249 Cal. Rptr. 119, 756 P.2d 843, disapproved on other points in In re Sassounian (1995) 9 Cal. 4th 535, 543-544, fn. 5, 545, fn. 6, 887 P.2d 527); (14) the court failed to let him address the jury without being subject to cross-examination ( People v. Gallego (1990) 52 Cal. 3d 115, 203, 276 Cal. Rptr. 679, 802 P.2d 169); (15) his constitutional rights were violated when the court failed to have him present during an instruction conference ( People v. Morris, supra, 53 Cal. 3d 152, 210; see also People v. Freeman (1994) 8 Cal. 4th 450, 511, 882 P.2d 249); (16) instructing the jury with CALJIC No. 2.90 (4th ed. 1979 bound vol.), defining reasonable doubt, deprived him of rights he finds in the federal and state Constitutions to due process and a fair trial ( Victor v. Nebraska, supra, 511 U.S. [127 L. Ed. 2d 583, 591-597, 114 S. Ct. 1239] [federal Constitution]). With regard to the California constitutional prong of this last claim, we cannot agree that any error arose in instructing the jury in this case with CALJIC No. 2.90, and therefore we do not reach defendant's claim that the California Constitution was violated. \"When we consider a claim of this sort, the question we ask is whether there is a reasonable likelihood that the jury construed or applied the challenged instruction in an objectionable fashion. ( People v. Clair, supra, 2 Cal. 4th at p. 663.) [P] On this record-and notwithstanding any asserted infirmity in the underlying standard instruction itself [citation] the answer is negative. There is no reasonable likelihood that the jury misconstrued or misapplied the\n\ninstruction in question as defendant argues.\" ( People v. Berryman,6 Cal. 4th at pp. 1073-1074, fn. 3.)\n\nConclusion\n\nThe judgment is affirmed.\n\nLUCAS, C.J., ARABIAN, J., BAXTER, J. and GEORGE, J., Concurring.\n\nWERDEGAR, J., Concurring.\n\nDisposition\n\nThe judgment is affirmed.\n\nKENNARD, J., Concurring and Dissenting:\n\nI concur in the judgment and, except as to one issue, I concur also in the majority opinion.\n\nThe issue on which I part company with the majority concerns defendant's contention that, in connection with the killing of 7-year-old Carl Carter, Jr., the trial court erred in not instructing the jury on former section 647a (now section 647.6) of the Penal Code (annoying or molesting a child under the age of 18; hereafter former section 647a) as a lesser included offense of Penal Code section 288 (lewd and lascivious act on a child under the age of 14; hereafter section 288). The majority rejects this contention. (Maj. opn., ante, at p. 82.) I agree that it should be rejected, but not for the reason that the majority gives.\n\nThe majority concludes that an instruction on former section 647a was not required because the evidence received at trial would not support a Conclusion that defendant did not violate section 288 but did violate former section 647a. (Maj. opn., ante, at pp. 80-83.) Although this characterization of the evidence may well be correct, the majority's reasoning implies that if the state of the evidence had been otherwise, the trial court would have been obligated to instruct on former section 647a. I disagree.\n\nThe majority's reasoning ignores the fact that defendant was not charged with a violation of section 288. Rather, the crime defined in that section was relevant only as the predicate felony to support the charge of first degree murder on a theory of felony murder. The majority cites no authority for the proposition that a trial court is required to instruct the jury on lesser included offenses of uncharged offenses relevant only as predicate felonies under the doctrine of felony murder.\n\nThe rationale underlying a trial court's obligation to instruct on lesser included offenses has been explained this way: \"The state has no interest in a defendant obtaining an acquittal where he is innocent of the primary offense charged but guilty of a necessarily included offense. Nor has the state any legitimate interest in obtaining a conviction of the offense charged where the jury entertains a reasonable doubt of guilt of the charged offense but returns a verdict of guilty of that offense solely because the jury is unwilling to acquit where it is satisfied that the defendant has been guilty of wrongful conduct constituting a necessarily included offense. Likewise, a defendant has no legitimate interest in compelling the jury to adopt an all or nothing approach to the issue of guilt. Our courts are not gambling halls but forums for the discovery of truth.\" ( People v. St. Martin (1970) 1 Cal. 3d 524, 533, 83 Cal. Rptr. 166, 463 P.2d 390.)\n\nThis rationale applies only to offenses with which the defendant has been charged; it does not apply to uncharged offenses that are relevant only to support a theory of felony murder. In this context, the defendant's guilt of an uncharged predicate felony becomes an element of the charged offense of murder; thus, the jury's doubts that the defendant committed the predicate felony may cause it to reject the felony-murder theory. But whether the acceptance or rejection of the felony-murder theory presents the jury with an all-or-nothing choice will depend on whether the jury has been given alternative theories or other verdict options relating to the charged offense of murder. It will not depend on whether the jury has been instructed on offenses that are necessarily included within the uncharged predicate felony.\n\nTo be sure, an offense that is a lesser included offense of an uncharged predicate felony might also qualify as a lesser related offense of the charged offense of murder. In such a case, the defendant may be entitled, on request, to instructions on that offense. (See People v. Geiger (1984) 35 Cal. 3d 510, 199 Cal. Rptr. 45, 674 P.2d 1303.) But this is not such a case. Defendant did not request that the trial court instruct the jury on former section 647a as a lesser related offense of murder, nor has he argued in this court that former section 647a is a lesser related offense of murder. Indeed, I do not understand defendant to be arguing that the jury should have been given the option of convicting defendant of former section 647a, but only that the trial court should have explained former section 647a to the jury so that it could somehow better understand the uncharged predicate felony, section 288.\n\nBecause defendant was not charged with a violation of section 288, and because former section 647a is not an offense necessarily included within the charged offense of murder, the trial court did not err in failing, on its own initiative, to instruct on former section 647a. In this case, an instruction on former section 647a as a lesser included offense of section 288 would have served no useful purpose and could well have confused the jury.\n\n\u003cspan class=\"fn\"\u003e1. Although the transcript shows that Officer Sims testified that the boys were \"clothed and partially clothed,\" a reported statement we repeated in Memro I, supra, 38 Cal. 3d 658 at page 667, the record suggests that he meant to say unclothed. At the second trial, Officer Carter testified that the police found photographs, including some of nude boys, on the living room coffee table in a manila file folder. Other witnesses at the first trial were asked whether they had ever seen nude photos of boys in plain sight. And at argument on the motion, defendant's counsel referred to testimony that the police had found photographs of \"young males, nude males\" in plain sight on their first visit to the apartment. (See also post, p. [typed opn., post, p. 45].)\u003c/span\u003e\n\n",
    "body_length": 208602,
    "citedas": [
      "11 Cal.4th 786",
      "12 Cal.4th 783D",
      "905 P.2d 1305",
      "47 Cal.Rptr.2d 219"
    ],
    "attorneys": "Thomas J. Nolan, under appointment by the Supreme Court, and Andrew Parnes for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Carol Wendelin Pollack, Assistant Attorney General, Marc E. Turchin, Robert S. Henry and Edward T. Fogel, Jr., Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Mosk, J.; Lucas, C.J., Arabian, J., Baxter, J. and George, J., Concurring. Kennard, J., Concurring and Dissenting separately; Werdegar, J., Concurring.",
    "citation_count": 1073
  }
}
