{
  "id": "L4lbQGYBTlTomsSBidom",
  "document": {
    "title": "Oklahoma v. Environmental Protection Agency",
    "full_title": "THE STATE OF OKLAHOMA, OKLAHOMA SCENIC RIVERS COMMISSION AND POLLUTION CONTROL COORDINATING BOARD; SAVE THE ILLINOIS RIVER (STIR), A NON-PROFIT CORPORATION OF THE STATE OF OKLAHOMA; CITY OF FAYETTEVILLE, ARKANSAS; THE BEAVER WATER DISTRICT; STATE OF ARKANSAS; ARKANSAS DEPARTMENT OF POLLUTION CONTROL AND ECOLOGY v. ENVIRONMENTAL PROTECTION AGENCY OKLAHOMA WILDLIFE FEDERATION, INTERVENOR",
    "jurisdiction": "Tenth Circuit",
    "date": "1990-07-11T00:00:00.000Z",
    "docket": "Nos. 89-9503, 89-9507, 89-9516",
    "body": "BRORBY, Circuit Judge.\n\nIn these consolidated appeals, appellants challenge certain actions of the U.S. Environmental Protection Agency (EPA) in issuing a discharge permit pursuant to the National Pollutant Discharge Elimination System (NPDES) of the Clean Water Act, 33 U.S.C. § 1342. We review EPA's action pursuant to our authority under 33 U.S.C. § 1369(b)(1) and reverse.\n\nOVERVIEW\n\nThe city of Fayetteville, Arkansas, applied to EPA for an NPDES permit for a new municipal wastewater treatment plant. Fayetteville proposed to discharge treated wastewater via a split flow into the White River in Arkansas and into Mud Creek, a tributary of the Illinois River, an Arkansas-Oklahoma interstate stream. The State of Oklahoma and a nonprofit group, Save The Illinois River (STIR), requested denial of the permit. The State of Arkansas and the Oklahoma parties requested an evidentiary hearing on EPA's issuance of the permit. A hearing request was granted in part and denied in part by an Administrative Law Judge (ALJ), and the partial denial was upheld by the EPA Administrator acting through his Chief Judicial Officer (CJO). After the evidentiary hearing, the ALJ determined that the permit would not have an undue impact on water quality or violate Oklahoma's water quality standards (WQS). This initial decision was appealed by both Arkansas and Oklahoma. On appeal, the ALJ's decision was affirmed in part and reversed in part and remanded for a determination whether the record showed by a preponderance of the evidence that the permitted discharge would not cause an actual, detectable violation of WQS. On remand the ALJ reviewed the record and made detailed findings. He concluded that the permit could issue as written, finding that it would not result in any measurable violations of Oklahoma's WQS. The ALJ's decision on remand was appealed to the CJO who upheld it in a decision dated December 22, 1988. These petitions for review followed.\n\nAppellants the State of Oklahoma, Oklahoma Scenic Rivers Commission, Oklahoma Pollution Control Coordinating Board, and STIR (the \"Oklahoma parties,\" or Oklahoma) set forth ten issues in their joint brief-in-chief. Essentially they contend that EPA erred in concluding that the permit would not violate Oklahoma's WQS; that EPA did not properly consider the Wild and Scenic Rivers Act, 16 U.S.C. §§ 1271-1287 (WSRA), as it applies to the upstream portions of the Illinois River; and that EPA erred in denying review of certain issues and in refusing to reopen the evidentiary hearing. The State of Arkansas, Arkansas Department of Pollution Control Ecology, City of Fayetteville, and Beaver Water District (the \"Arkansas parties,\" or Arkansas) challenge EPA's authority to require an Arkansas discharger to comply with Oklahoma water quality standards.\n\nBACKGROUND\n\nThe cornerstone of the Clean Water Act, 33 U.S.C. §§ 1251-1387, is its prohibition of any discharge of pollutants to navigable waters except as permitted by the Act. 33 U.S.C. § 1311(a). Section 101 of the Act, 33 U.S.C. § 1251(a)(1), states that \"it is the national goal that the discharge of pollutants into navigable waters be eliminated by 1985.\" \"Discharge of a pollutant\" is defined expansively as \"any addition of any pollutant to navigable waters from any point source.\" § 1362(12)(A). \"Pollutant\" is also broadly defined; it includes \"dredged spoil, solid waste, . . . sewage, garbage, sewage sludge, . . . chemical wastes, . . . rock, sand, . . . and industrial, municipal, and agricultural waste.\" § 1362(6). \"Point source\" encompasses \"any discernible, confined and discrete conveyance, including . . . any pipe, ditch, channel, tunnel, [or] conduit . . . from which pollutants are or may be discharged.\" § 1362(14). \"Navigable waters\" means \"the waters of the United States.\" § 1362(7).\n\nDischarges of pollutants must comply with limitations established in and pursuant to the Act. \"Effluent limitations,\" i.e., limits on \"quantities, rates, and concentrations of chemical, physical, biological, and other constituents which are discharged from point sources,\" § 1362(11), may be water quality-based, §§ 1312, 1313, or technology-based, §§ 1311(b), 1314(b). EPA is required to establish water-quality based restrictions whenever technology-based limits are inadequate to protect a particular body of water. § 1312(a). The CWA sets minimum requirements for water pollution control; states may devise more stringent measures. § 1370. State standards, once approved by EPA, become the water quality standards for the applicable waters of the State. § 1313.\n\nFederal and state effluent limitations and water quality standards are transformed into individual point source obligations through NPDES discharge permits. § 1342; EPA v. California ex rel. State Water Resources Control Bd., 426 U.S. 200, 205, 48 L. Ed. 2d 578, 96 S. Ct. 2022 (1976). Permits may be issued if the discharge will meet all applicable requirements under the Act. § 1342 (a)(1). EPA is responsible for issuing permits, id., but may delegate that authority to qualified states, § 1342(b). In those states, however, it retains oversight authority with respect to individual permits and the permitting programs in general. § 1342(c), (d).\n\nEPA issued Fayetteville's NPDES permit because at the time this proceeding commenced Arkansas had not yet been delegated permitting authority pursuant to § 1342(b). The permit was issued on November 5, 1985, and finally approved on December 22, 1988, following the administrative appeals described above. The treatment plant has been in operation since December 1988.\n\nThe permit (NPDES Permit No. AR0020010) specifies that half of the city's treated wastewater will be discharged to the White River in Arkansas (this portion of the discharge is not in contention here), and half will be discharged to the Illinois River basin. Specifically, this latter effluent will be discharged to an unnamed stream in northwestern Arkansas, which flows approximately two miles before joining Mud Creek. Mud Creek flows three miles from that point to its confluence with Clear Creek, thirteen miles upstream from the Illinois River in Arkansas. Twenty-two miles downstream from Clear Creek -- and thirty-nine miles from the Fayetteville plant -- the Illinois River crosses the state line into northeastern Oklahoma and almost immediately flows into Lake Frances. A segment of the Illinois River (including Lake Frances) from the Oklahoma-Arkansas state line to Tenkiller Ferry Reservoir has been designated an Oklahoma state scenic river and was proposed for study as a potential addition to the National Wild and Scenic Rivers System when the WSRA was enacted in 1970. 16 U.S.C. § 1276(40). To date, this segment, which is approximately sixty miles long, has not been designated a component of the national system. See 16 U.S.C. § 1273.\n\nThe Fayetteville permit sets limits on the amounts of certain pollutants that may be discharged and establishes maximum or minimum effluent concentrations of those pollutants and other chemical parameters. Permit, EPA Supp. Addendum at 12-30. The permit prohibits the discharge of any incompletely treated effluent to Mud Creek. Id. at 27. It also includes, inter alia, a provision for modifying the permit to incorporate more stringent limitations if an ongoing study of the Illinois River demonstrates such limitations are needed to ensure compliance with water quality standards. Id.\n\nANALYSIS\n\nI. Standard of Review\n\nReview of the EPA rulings on appeal here is governed by the Administrative Procedure Act, 5 U.S.C. §§ 701-706. We must uphold the agency's actions, findings, and conclusions unless they are outside the agency's statutory authority, are not supported by substantial evidence, or are arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with law. 5 U.S.C. § 706(2)(A), (C), and (E). We may not substitute our judgment for that of the agency. Motor Vehicle Mfrs. Ass'n v. State Farm Mut. Auto. Ins . Co., 463 U.S. 29, 43, 77 L. Ed. 2d 443, 103 S. Ct. 2856 (1983).\n\nNevertheless, the agency must examine the relevant data and articulate a satisfactory explanation for its action including a \"rational connection between the facts found and the choice made.\" In reviewing that explanation, we must \"consider whether the decision was based on a consideration of the relevant factors and whether there has been a clear error of judgment.\" Normally, an agency rule would be arbitrary and capricious if the agency has relied on factors which Congress has not intended it to consider, entirely failed to consider an important aspect of the problem, offered an explanation for its decision that runs counter to the evidence before the agency, or is so implausible that it could not be ascribed to a difference in view or the product of agency expertise.\n\nId. at 43 (citations omitted).\n\nDetermining the extent of EPA's authority under the Clean Water Act is a question of law that we review de novo. \"Our first inquiry is whether 'Congress has directly spoken to the precise question at issue. If the intent of Congress is clear that is the end of the matter; for the court, as well as the agency, must give effect to the unambiguously expressed intent of Congress.'\" Martin Exploration Management Co. v. FERC, 813 F.2d 1059, 1065 (10th Cir. 1987) (quoting Chevron, U.S.A., Inc. v. NRDC, 467 U.S. 837, 842-43, 104 S. Ct. 2778, 81 L. Ed. 2d 694 (1984), rev'd on other grounds, 486 U.S. 204, 108 S. Ct. 1765, 100 L. Ed. 2d 238 (1988)). However, where the statute is ambiguous, EPA's construction, as that of the agency charged with administering the state,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e is entitled to substantal deference. Chevron, U.S.A., Inc. v. NRDC, 67 U.S. 837, 844 (1984). If EPA's interpretation of the Clean Water Act is reasonable, we should not disturb it unless it \"is contrary to the policies Congress sought to implement in enacting the statute.\" 813 F.2d at 1065; see also 467 U.S. at 845.\n\nII. Preliminary Procedural Matters\n\nAs an initial matter we address EPA's argument that Arkansas lacks standing to challenge EPA's interpretation of the Clean Water Act. EPA reasons that\n\nArkansas, by not challenging any of the terms of the Fayetteville permit, has failed to state a justiciable case or controversy. . . . Arkansas' claim is purely hypothetical and would not be redressed by a favorable decision of this Court, just as its allegations as to future permit conditions are purely speculative.\n\nEPA Brief at 13-14. EPA also rejects Arkansas's argument that it may be collaterally estopped in subsequent proceedings if it does not pursue this argument now by assuring Arkansas that EPA would not contest the justiciability of the claim if raised in the context of future permit decisions. EPA Brief at 14; see Arkansas Reply Brief at 11 n. 18.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nSection 509 of the Clean Water Act provides that \"review of [EPA's] action . . . in [, inter alia,] issuing or denying any permit under section 1342 of this title . . . may be had by any interested person.\" 33 U.S.C. § 1369(b) (emphasis added). The legislative history corroborates what the language itself suggests -- that the Act intended liberal review of EPA's actions in issuing permits and promulgating rules and standards. The Senate Public Works Committee explained section 509's judicial review provision as follows:\n\nAny person has standing in court to challenge administratively developed standards, rules and regulations under the Act. The courts are increasingly adapting this test to what administrative actions are reviewable. . . . The Courts have granted this review to those being regulated and to those who seek \"to protect the public interest in the proper administration of a regulatory system enacted for their benefit.\" Since precluding review does not appear to be warranted or desirable, the bill would specifically provide for such review within controlled time periods. . .\n\nS. Rep. No. 414, 92d Cong. 2d Sess., reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3750-51 (emphasis added; citation omitted); see also Conf. Rep. No. 1236, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3776, 3825. The Supreme Court reiterated the expansive language of the Senate Report in Middlesex County Sewerage Auth. v. National Sea Clammers Ass'n, 453 U.S. 1, 14, 69 L. Ed. 2d 435, 101 S. Ct. 2615 n. 23 (1981) (\"review provisions of § 509 are open to 'any person,' S. Rep. No. 92-414, p. 85 (1971)\"); cf. Montgomery Envtl. Coalition v. Costle, 207 U.S. App. D.C. 233, 646 F.2d 568, 576-78 (D.C. Cir. 1981) (§ 509 \"incorporate[s] the injury in fact rule for standing set out in Sierra Club v. Morton,\" 405 U.S. 727, 92 S. Ct. 1361, 31 L. Ed. 2d 636 (1972)).\n\nIt would strain the meaning of \"any interested person\" to exclude from those eligible to obtain review of an EPA permit action the state in which the publicly owned treatment works seeking the permit is located, which partially financed the facility's construction, and which, among other entities, has review and approval authority over the facility's construction and operation. We conclude Arkansas does have standing to challenge EPA's determination that Oklahoma water quality standards apply to the plant.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nBefore undertaking a discussion of the merits, we must consider a second procedural issue -- whether Arkansas has exhausted its administrative remedies. EPA's regulations provide that a petition \"for review of any initial decision . . . is, under 5 U.S.C. 704, a prerequisite to the seeking of judicial review of the final decision of the Agency.\" 40 C.F.R. § 124.91(e). The rule requires EPA to \"issue an order either granting or denying the petition for review\" within a reasonable time after the petition is filed. § 124.91(c)(1). \"Final Agency action\" for purposes of judicial review occurs \"upon completion of the remanded proceeding, including any appeals to the [EPA] Administrator from the results of the remanded proceeding.\" § 124.91(f)(3).\n\nAlthough the parties do not raise this issue, we have detected two arguable procedural deficiencies in Arkansas's appeal in light of § 124.91. First, the Arkansas parties may have failed to comply with the technical requirements of subsection (e). Although they filed a petition for review of the ALJ's decision on remand, R., B-155, it appears they did not file a petition for review of the ALJ's initial decision as required by the rule, but merely filed a response to the Oklahoma parties' petitions for review of that decision. Compare Order on Petitions for Review, R., A-28, at 1, with EPA Brief at 8. Although \"the Arkansas parties raised [the statutory interpretation] issue in numerous pleadings filed with EPA,\" Arkansas Brief at 32 n. 24, Arkansas's argument that Oklahoma WQS should not apply to a discharge located in Arkansas was first asserted to (and rejected by) the ALJ after remand by the CJO.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nSecondly, EPA's action in this case was arguably not \"complete\" with respect to the Arkansas parties because the CJO failed to \"issue an order either granting or denying [Arkansas's] petition for review.\" § 124.91(c)(1). Although all parties petitioned EPA for review of the ALJ's decision on remand, R., B-155-59, the CJO's second order ruled only on the petitions filed by EPA-Region VI and the Oklahoma parties. The order failed even to acknowledge Arkansas's petition. See Second Order on Petitions for Review, R., A-37, at 1-2.\n\nNevertheless, under the circumstances of this case, we do not view these shortcomings as fatal to Arkansas's appeal. EPA's position on the basic issue raised by the Arkansas parties -- whether the Fayetteville discharge must comply with Oklahoma WQS -- has been clear since the ALJ's initial decision and is directly at odds with Arkansas's position. In his second and final opinion the CJO clearly affirmed his June 1988 ruling that Oklahoma WQS are applicable to the Fayetteville discharge. In so doing, he implicitly, if not expressly, denied Arkansas's petition for review of the ALJ's decision on remand. Thus, it would be fruitless to remand to the agency for mere technical compliance with subsection (c)(1)'s requirement for \"an order . . . denying review.\" Cf. Mathews v. Eldridge, 424 U.S. 319, 47 L. Ed. 2d 18, 96 S. Ct. 893 (1976); Koerpel v. Heckler, 797 F.2d 858, 862 (10th Cir. 1986); Clonce v. Presley, 640 F.2d 271, 273 (10th Cir. 1981) (citing Lewis v. New Mexico, 423 F.2d 1048, 1049 (10th Cir. 1970)).\n\nMoreover, no objection to Arkansas's failure to seek review of EPA's initial decision should now be allowed, given that Arkansas participated in the review of the initial decision (by responding to Oklahoma's petition) and the CJO expressly provided that the \" parties will have the opportunity to petition for review of the ALJ's decision on remand.\" Order on Petitions for Review, R., A-28, at 17 (emphasis added). Accordingly, the Arkansas parties' appeal is ripe for our review, and we proceed with our discussion of the merits.\n\nIII. Statement of Issues\n\nArkansas poses the fundamental question in this case: Does the Clean Water Act require a point source of pollution to comply with the water quality standards of all affected downstream states? Oklahoma assumes such a requirement in that it challenges EPA's determination that the Fayetteville permit would not result in violations of Oklahoma's water quality standards and argues accordingly that no discharge to Oklahoma's Illinois River system should be allowed.\n\nOklahoma formulates the issues on appeal as \"whether the Chief Judicial Officer erred in denying review\" of various ALJ rulings and whether the CJO and ALJ \"erred in [refusing] to reopen the evidentiary hearing.\" Despite this formulation, it seems clear that the Oklahoma parties' chief concerns relate to the substantive issues underlying these procedural questions. The substantive issues are: (1) the adequacy of the treatment technology employed by the Fayetteville plant and the possible superiority of land application methods; (2) the propriety of considering evidence concerning future reductions in the discharges of other Arkansas cities; (3) the propriety of relying on \"protective language\" in the permit athorizing more stringent discharge limitations if shown to be necessary by an ongoing study of the Illinis River; (4) the correctness of EPA's interpretation and application of Oklahoma's beneficial use limitation, nutrient standard, and anti-degradation policy; (5) the relevance of new information concerning overflows at the old treatment plant; and (6) whether Fayetteville met its burden of proof in showing that a permit should be issued for its treatment plant. Our review of the record convinces us that we need not resolve many of the issues raised by the Oklahoma parties. In the following pages we address first the statutory interpretation question posited by Arkansas and then a significant issue not raised by any party -- the sigificance of evidence of existing degradation of Illinois River water quality.\n\nA. Construction of the Clean Water Act\n\n1. The Opposing Views\n\nThe full ramifications of Arkansas's formulation of the Clean Water Act issue are exposed once it is realized that an upstream state has the ability (if not the legal right) largely to control the quality of certain of the waters of a downstream state. It can accomplish this simply by setting and enforcing its own water quality standards and releasing water of that quality to the downstream state. If the upstream state's water quality standards are lower than those considered desirable by the downstream state, so will be the actual quality of the interstate waters in the downstream state. In other words, the lowest common denominator will prevail. The ultimate question posed to this court is whose water quality standards take precedence under the Clean Water Act -- the upstream state's, the downstream state's, the federal government's, or nobody's. We conclude that no state \"imposes\" its standards on another state, but rather that the Clean Water Act mandates compliance with federal law, including the federally approved water quality standards of affected states.\n\nSpecifically, Arkansas alleges an affected downstream state \"may advise and make recommendations, but nowhere in the Clean Water Act did Congress authorize affected states such as Oklahoma to impose their water quality standards upon a discharger in another state.\" Arkansas's Brief at 39. We treat this, the principal issue of this case, as whether the Clean Water Act requires that any discharge permitted under 33 U.S.C. § 1342 comply with all applicable water quality standards, including the EPA-approved regulations of any affected downstream state.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e This is an issue of first impression in the circuit courts.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nEPA's Chief Judicial Officer, in his first order in this case dated June 28, 1988, stated the law and applied it as follows:\n\nThe CWA requires an NPDES permit to impose any effluent limitations necessary to comply with applicable state water quality standards. . . . The meaning of [33 U.S.C. § 1311(b)(1)(C)] is plain and straightforward. It requires unequivocal compliance with applicable water quality standards, and does not make any exceptions for cost or technological feasibility. . . .\n\nOrder on Petitions for Review, R., A-28, at 11-13. The CJO explained that in an interstate dispute the \"only applicable water quality standards are those that have been approved by EPA under the CWA.\" Order on Petitions for Review at 11 n. 13 (citing Illinois v. City of Milwaukee, 731 F.2d 403, 413-14 (7th Cir. 1984), cert. denied, 469 U.S. 1196, 105 S. Ct. 979, 83 L. Ed. 2d 981 (1985)). In noninterstate disputes, however, \"the source state may impose more stringent non-EPA-approved water quality standards in NPDES permits under 33 U.S.C.A. § 1370.\" Order on Petitions for Review at 12 n. 13.\n\nOn remand, the ALJ expressed similar views:\n\nIt is clear that an out-of-state source must meet the W.Q.S. of another downriver state. See § 401(a)(2) of the CWA [33 U.S.C. § 1341(a)(2)]; 40 C.F.R. §§ 122.4(D) and 122.44(d)(4); International Paper Co. v. Ouellette, 479 U.S. 481, 93 L. Ed. 2d 883, 107 S. Ct. 805 (1987). Therefore the Fayetteville discharge must meet Oklahoma's W.Q.S. as they exist at the border of the two states. . . .\n\nDecision on Remand, R., A-33, at 4-5. The ALJ's interpretations of Oklahoma's WQS, including the Beneficial Use Limitations, were ultimately affirmed by the CJO. The CJO also reiterated the mandate of his first order -- that \"'the permit should be upheld if . . . the authorized discharges would not cause . . . [a] violation of Oklahoma's water quality standards,'\" -- and accepted the ALJ's conclusion that no violation would occur. Second Order on Petitions for Review, R., A-37, at 7-8.\n\nThe Arkansas parties contend we need look no farther than theClean Water Act to decide this issue because \"Congress has clearly manifested its intent [in the CWA] that affected states cannot impose thei water quality standards upon dischargers in other states.\" Arkansas Brief at 42; see id at 33-40. Alternatively, if we decide congressional intent is ambiguous, they urge us to reject EPA's interpretation as unreasonable. Id. at 42. EPA also claims the CWA is \"clear that the terms of an NPDES permit must include compliance with state water quality standards -- regardless of the source of a discharge.\" EPA Brief at 15-16. Therefore, EPA maintains, resort to the legislative histoy -- which EPA contends corroborates EPA's interpretation -- is unnecessary. Id. at 20 (citing United States v. Oregon, 366 U.S. 643, 648, 6 L. Ed. 2d 575, 81 S. Ct. 1278 (1961)). In the event we conclude congressional intent is ambiguous, EPA alternatively defends the reasonableness of its interpretation of the CWA and argues that, under Chevron, 467 U.S. at 844-45, it must therefore be upheld. EPA Brief at 13, 15.\n\nWe do not find the Clean Water Act, on its face, quite as clear a manifestation of congressional intent on this issue as any of the parties suggests. Significantly, however, EPA's interpretation is not one the agency adopted only, or in the first instance, in the context of this permit proceeding. Rather, EPA's position herein is consistent with its CWA-implementing regulations. For example, 40 C.F.R. § 122.4(d) expressly provides: \"No permit may be issued: . . . (d) When the imposition of conditions cannot ensure compliance with the applicable water quality requirements of all affected States.\" (Emphasis added.) Concomitantly, EPA's rules require permits to include, where applicable, \"any requirements . . . necessary to . . . conform to applicable water quality requirements . . . when the discharge affects a state other than the certifying State [i.e., the state in which the discharge will be located].\" § 122.44(d)(4). See also 40 C.F.R. § 131.10(b) (state \"shall ensure that its water quality standards provide for the attainment and maintenance of the water quality standards of downstream waters\"). We accord deference to the consistent interpretation of a statute by the agency entrusted with its administration. See 33 U.S.C. § 1251(d); Federal Election Comm'n v. Democratic Senatorial Campaign Comm., 454 U.S. 27, 37, 70 L. Ed. 2d 23, 102 S. Ct. 38 (1981); cf. E.I. Du Pont de Nemours \u0026 Co. v. Train, 430 U.S. 112, 135, 51 L. Ed. 2d 204, 97 S. Ct. 965 n.25 (1977) (EPA interpretation entitled to deference, even if not contemporaneous with enactment of CWA, in light of technical nature of statute, agency's expertise, and ambiguous statutory language). After considering the Act as a whole and its legislative history, we conclude EPA's interpretation is reasonable and consistent with Congress's purposes in enacting the CWA.\n\n2. The Parties' Statutory Arguments\n\nIn defending its construction of the CWA the EPA relies principally on § 301(b)(1)(C) of the Act, 33 U.S.C. § 1311(b)(1)(C), which provides:\n\nIn order to carry out the objective of this chapter [i.e., to \"restore and maintain the chemical, physical, and biological integrity of the Nation's waters,\" 33 U.S.C. § 1251] there shall be achieved . . . not later than July 1, 1977, any more stringent limitation, including those necessary to meet water quality standards, . . . established pursuant to any State law or regulations (under authority preserved by section 1370 of this title) . . . or required to implement any applicable water quality standard established pursuant to this chapter.\n\n(Emphasis added.) Section 402(a)(2) and (b)(1)(A) of the CWA, 33 U.S.C. § 1342(a)(2), (b)(1)(A), in turn mandates that any NPDES permit issued under the Act contain terms adequate to insure compliance with § 301 above. See EPA Brief at 16.\n\nEPA rejects Arkansas's argument that these sections are \"mere timing provisions.\" Id. (citing Arkansas Brief at 34-35). On the contrary, EPA argues, these sections establish fundamental requirements of the Act. Moreover, EPA contends that Congress, by making no distinction between the water quality standards of source and affected states in these requirements, \"indicated the uniform applicability of such standards.\" EPA Brief at 16-17.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nArkansas counters that § 1311 does not explain whether the \"more stringent limitations\" must be achieved by dischargers in other states, but that section 510, 33 U.S.C. § 1370 limits the \"reach\" of any stricter standards to discharges originating within the state imposing those standards. Arkansas Brief at 35.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e This argument relies largely on language in § 1370 preserving \"any right or jurisdiction of the States with respect to the waters . . . of such States.\" The argument suffers from at least three flaws, however.\n\nFirst, § 1370 is a savings clause that merely preserves the preexisting right of the states \"to set more restrictive standards than those imposed by [the CWA].\" S. Rep. No. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3751. See also International Paper Co. v. Ouellette, 479 U.S. 481, 493, 93 L. Ed. 2d 883, 107 S. Ct. 805 (1987) (§ 1370 savings clause \"preserves the authority of a State,\" but \"does not preclude pre-emption\" of state law); Milwaukee v. Illinois, 451 U.S. 304, 327-28, 68 L. Ed. 2d 114, 101 S. Ct. 1784 (1981). Accordingly, there is no basis for believing that Congress intended § 1370 to limit or define the scope of one of the CWA's crucial provisions. The cases Arkansas cites to the contrary are unavailing for that purpose. See Arkansas Brief at 35-36 n. 28.\n\nSecond, the \"waters . . . of such States\" language, which Arkansas deems significant, occurs in and applies only to the second of two principal provisions of § 1370. That provision (subparagraph (2)) refers broadly to \"any right or jurisdiction of the States.\" In contrast, the first provision (subparagraph (1)) specifically addresses the rights of states and their subdivisions to regulate pollution. Subparagraph (1) says nothing about the boundaries within which such rights may be exercised. Thus, \"waters . . . of such states\" cannot be construed as a limitation on the rights to regulate pollution preserved in the first part of this section.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThird, thoughtful consideration of the language of § 1311(b)(1)(C) --\n\nthere shall be achieved. . . any more stringent limitation, including those necessary to meet water quality standards . . . established pursuant to any State law or regulations . . . or required to implement any applicable water quality standard established pursuant to this chapter\n\n(emphasis added) -- exposes the irrationality of Arkansas's argument. In order to ensure that the EPA-approved water quality standards in all states are \"met\" or \"implemented,\" it is \"necessary\" to require dischargers to meet the applicable requirements of other affected states as well as those of the source state. There could be no assurance of achieving a state's more stringent WQS if an upstream, out-of-state discharger were not required to comply with those standards.\n\nEPA concludes and we agree that Arkansas's construction of the Act would make achieving downstream water quality standards \"impossible in many circumstances or . . . possible . . . only by imposing a disproportionate burden on dischargers located in the downstream state.\" EPA Brief at 21.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Moreover, rewarding sources for locating in states with less stringent water quality requirements (by relieving them from complying with more stringent downstream WQS) would also result in \"pollution shopping,\" contrary to Congress's intent in passing the 1972 CWA amendments.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nArkansas counters that EPA's construction of the Act would have \"chaotic\" consequences because any downstream state could impose its requirements on proposed sources in any upstream state. Arkansas Brief at 46-47. Thus, Arkansas hypothesizes, a permit authorizing a discharge to the Mississippi River in Minnesota would be subject to challenge based on the water quality standards of each of the nine downstream states. Id. at 46 (citing Ouellette, 479 U.S. at 496 n. 17). Arkansas's purported concern is that this would undercut the CWA's \"orderly regulatory scheme,\" making it \"'virtually impossible to predict the standard for a lawful discharge into an interstate body of water.'\" Arkansas Brief at 47 (quoting Illinois v. Milwaukee, 731 F.2d at 414).\n\nWe find little practical merit in Arkansas's argument. The ability, as well as the authority, to require compliance with the WQS of downstream states is necessarily limited by the ability to measure a source's impact on the water quality of the receiving waters. At some point downstream, the impact on water quality of a particular pollution source becomes so attenuated as to be undetectable. Assuming the quality of the receiving waters currently meets or exceeds standards, there can be no violation of standards if the impact of the proposed source on the water quality could not be measured.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Nor is it \"impossible to predict the standard[s]\" applicable to a new discharge, as Arkansas claims. First, EPA approval of state WQS determines the potentially applicable rules. Furthermore, the permitting system established in the 1972 and 1977 amendments to the CWA clearly provides for consultation with and input by states that may be affected. Finally, computer modeling (such as that performed for the Fayetteville plant) can predict the extent of a new source's potential impact, thus demonstrating which states' WQS must be met.\n\n3. Illinois v. Milwaukee and Ouellette\n\nArkansas cites International Paper Co. v. Ouellette and Illinois v. Milwaukee in support of its statutory construction argument, but that reliance is misplaced. In each of those cases an affected state was seeking to enjoin an ongoing discharge in another state by resort to its own state law nuisance remedies. 479 U.S. at 483; 731 F.2d at 404. In contrast, this case is a permitting, rather than an enforcement, action wherein Oklahoma seeks to ensure compliance with federal law, i.e., its EPA-approved WQS. The Seventh Circuit in Illinois v. Milwaukee recognized this distinction when it pointed out that\n\nIllinois' basic grievance is that the permits issued to Milwaukee pursuant to the [CWA] do not impose stringent enough controls on the discharges. Nevertheless, Illinois failed to participate in the permit issuing process when the Milwaukee permits were issued. . . . That process seems now to be the appropriate federal forum for adjusting the competing claims of states in the environmental quality of interstate waters.\n\n731 F.2d at 412-13 n. 5. The court found that Illinois had \"not sought to enforce an effluent limitation under Wisconsin [law] nor sought to enforce federal limitations as provided for under the 1972 [CWA]\" and concluded that the CWA \"preclude[s] the type of application of state law sought by Illinois.\" 731 F.2d at 414.\n\nThe Supreme Court's decision in Ouellette is somewhat more problematic, even though, like Illinois v. Milwaukee, it is not factually or procedurally similar to this case. The specific issue in Ouellette was whether the CWA preempted a common law nuisance suit filed in a Vermont court under Vermont law against a New York discharger, which was the source of the alleged injury in Vermont. The Court concluded that \"Vermont nuisance law is inapplicable to a New York point source,\" 479 U.S. at 497; however, it chose to express its holding more broadly. The Court stated: \"We hold that when a court considers a state-law claim concerning interstate water pollution that is subject to the CWA, the court must apply the law of the State in which the point source is located,\" id. at 487, and \"we conclude that the CWA precludes a court from applying the law of an affected State against an out-of-state source,\" id. at 494. The Ouellette Court's discussion of the CWA includes statements that Arkansas concedes \"may be dicta.\" Arkansas Reply Brief at 18. But it is these statements concerning the regulatory framework of the CWA and the relative roles of source and affected states which Arkansas embraces. In particular, Arkansas asks us to give weight to the following discussion:\n\nWhile source States have a strong voice in regulating their own pollution, the CWA contemplates a much lesser role for States that share an interstate waterway with the source (the affected States). Even though it may be harmed by the discharges, an affected State only has an advisory role in regulating pollution that originates beyond its borders. . . . Significantly, however, an affected State does not have the authority to block the issuance of the permit if it is dissatisfied with the proposed standards. An affected State's only recourse is to apply to the EPA Administrator, who then has the discretion to disapprove the permit if he concludes that the discharges will have an undue impact on interstate waters.\n\nOuellette, 479 U.S. at 490-91, quoted in Arkansas Brief at 41.\n\nWhile we agree these statements seem to undercut EPA's position, it is beyond dispute that they are dicta and not controlling here. Ouellette was an enforcement action in which the issue was the availability of a nuisance remedy under the common law of an affected state against an out-of-state discharger. Even the Court's broadly stated holdings were expressed in terms of \"a state-law claim concerning interstate water pollution,\" 479 U.S. at 487 (emphasis added), and \"applying the law of an affected State,\" id. at 494 (emphasis added). In contrast, the case before us poses the question of the applicability of the federally approved water quality standards of an affected downstream state in permitting a discharge in an upstream state.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nMoreover, Ouellette contains other dicta that mitigate the apparent impact of the language quoted above. For instance, the Court noted that nothing in its decision affected the plaintiffs' right to \"pursue remedies that may be provided by the Act.\" 479 U.S. at 498 n. 18. The Court pointed out, as examples, that the plaintiffs had the opportunity to protect their interests before permit issuance by commenting on and objecting to the proposed permit conditions, and that they still were entitled to bring a citizen suit to compel compliance with the permit. Id.\n\nOuellette also suggested that what the plaintiffs there sought to do was akin to establishing a second permit system, which the Court held is disallowed by 33 U.S.C. § 1342(b). See id. at 491, 496-97. That § 1342(b) limits a state's permit issuing authority to \"discharges . . . within its jurisdiction\" is beyond dispute. But this provision must not be construed to imply anything concerning the applicability of an affected state's EPA-approved WQS to the process of permitting a discharge in an upstream state. The Act contains several provisions for considering and protecting the water quality of downstream states (including provisions authorizing the actions taken by EPA here). Those provisions are not inconsistent with the Act's implicit prohibition of dual permitting systems. Indeed, if properly implemented, they negate any need for separate permits issued by source and affected states.\n\nThe Court's opinion in Ouellette corroborates this reasoning. As the Court observed:\n\nNothing in the Act gives each affected State this power to regulate discharges. The CWA carefully defines the role of both the source and affected States, and specifically provides for a process whereby their interests will be considered and balanced by the source State and the EPA. This delineation of authority represents Congress' considered judgment as to the best method of serving the public interest and reconciling the often competing concerns of those affected by the pollution. It would be extraordinary for Congress, after devising an elaborate permit system that sets clear standards, to tolerate common-law suits that have the potential to undermine this regulatory structure.\n\n479 U.S. at 497. Plainly, Ouellette was concerned not with the CWA's provisions for incorporating a downstream's water quality criteria in the permitting process, but with preventing a downstream state from circumventing or superseding that process by imposing on an already-permitted source additional requirements based on its own state law. So viewed, Ouellette is entirely consistent with EPA's interpretation of the applicability of Oklahoma's WQS. Cf. Champion, 652 F. Supp. at 1400 (concluding that nothing in Ouellette required a modification of the decision at 648 F. Supp. 1390 that a North Carolina discharge permit must require compliance with an applicable Tennessee WQS).\n\n4. The Statutory and Reulatory Framework\n\nThe erroneous interpretation of Ouellette, which Arkansas advocates, runs aground when the Clean Water Act is considered as a whole. The Act contains several mechanisms for ensuring that miimum water quality and pollution criteria will apply to all navigable waters of the United States; for example, prohibiting the discharge of pollutants except pursuant to a permit, 33 U.S.C. §§ 1311, 1342; requiring EPA to establish effluent limitations for point source discharges, §§ 1311-1312; providing for EPA's approval of water quality standards, § 1313, and state permit programs, § 1342(b); and establishing minimum procedural requirements for state permit programs, § 1314(i). As discussed above, however, states are not precluded from imposing pollution limitations more stringent than those promulgated by EPA. 33 U.S.C. § 1370; 40 C.F.R. § 122.1(f); Milwaukee v. Illinois, 451 U.S. at 327-28. Moreover, the CWA requires the application of best available control technology or best practicable treatment to discharges of pollutants, 33 U.S.C. § 1311, and the Act's legislative history reveals that Congress intended the CWA to be \"technology-forcing.\" S. Rep. No. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3709 (Act contains a \"mandate to press technology and economics\" to achieve practicable and attainable levels of effluent reduction; thus, \"increasingly tougher controls on industry\" will be required); see also Natural Resources Defense Council, Inc. v. EPA, 261 U.S. App. D.C. 372, 822 F.2d 104, 123-24 (D.C. Cir. 1987). Any standard or limitation adopted by a state and approved by EPA becomes the \"water quality standard for the applicable waters of that State,\" and thus is federally enforceable. 33 U.S.C. § 1313(c)(3). See also §§ 1319, 1342; S. Rep. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News, 3668, 3672; Order on Petitions for Review, R., A-28, at 11-12 n. 13.\n\na. 33 U.S.C. § 1341\n\nEPA finds support for its action here in certain of the foregoing sections. In addition, we consider 33 U.S.C. § 1341 particularly persuasive. It provides that no NPDES permit may be granted until a \"certification\" is obtained from the state in which the discharge originates (or from EPA where no state agency possesses such authority, § 1341(a)(1); 40 C.F.R. § 121.21(b)), stating that the discharge will comply with, among other things, § 1311 water quality requirements. Section 1341(a)(2) provides:\n\nWhenever such a discharge may affect, as determined by the [EPA] Administrator, the quality of the waters of any other State, the Administrator . . . shall so notify such other State. . . . If . . . such other State determines that such discharge will affect the quality of its waters so as to violate any water quality requirement in such State, and . . . notifies the Administrator . . . and requests a public hearing . . ., the licensing or permitting agency shall hold such a hearing. . . . [The licensing or permitting] agency, based upon the recommendations of such State, . . . shall condition such license or permit in such manner as may be necessary to insure compliance with applicable water quality requirements. If the imposition of conditions cannot insure such compliance such agency shall not issue such license or permit.\n\n\"'The purpose of the [§ 1341(a)(2)] notice requirement is to enable a state whose water qualities may be affected by the proposed federal activity an opportunity to insure that its standards will be complied with.'\" EPA Brief at 17-18 (emphasis added) (quoting Lake Erie Alliance for the Protection of the Coastal Corridor v. U.S. Army Corps of Eng'rs, 526 F. Supp. 1063, 1075 (W.D. Pa. 1981), aff'd without opinion, 707 F.2d 1392 (3d Cir.), cert. denied, 464 U.S. 915, 104 S. Ct. 277, 78 L. Ed. 2d 257 (1983)). EPA's regulations reaffirm this view, see 40 C.F.R. §§ 121.1-.30,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e as does the limited case law, see, e.g., United States v. Commonwealth of Puerto Rico, 721 F.2d 832, 833-34 (1st Cir. 1983) (certification is a \"condition precedent to the EPA's issuance of a NPDES permit\"; \"state decision denying certification, or one imposing conditions or restrictions, is not reviewable administratively by the EPA\" and is \"exempt from review in federal court\").\n\nArkansas disputes that \"applicable water quality requirements\" in § 1341(a)(2) refers to the WQS of the affected state.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Based on its plain language, however, we agree with EPA that the purpose of this provision must be to enable affected states to ensure that their water quality will not be jeopardized by a discharge in another state. Only a strained interpretation of the statute could produce the result Arkansas seeks -- that \"applicable water quality requirements\" refers to the WQS of only the source state. Moreover, there would be no reason for § (a)(2) to refer to the effect on the quality of the affected state's waters in terms of \"violat[ing] any water quality requirement in such State\" if the affected state's water quality requirements were irrelevant in the permitting process. Given that this subsection of the statute deals expressly with effects on states other than the source state, it is much more likely that \"applicable\" refers simply to those federally approved water quality requirements of affected states that would be violated if the permit were not appropriately conditioned. We reject Arkansas's argument to the contrary.\n\nThe legislative history of the certification statute sheds additional light on this matter. In 1977 Congress amended the statute\n\nto add section 303 [33 U.S.C. § 1313, \"water quality standards and implementation plans\"] to the list of the act's provisions for which a State must certify compliance. . . . This means that a federally licensed or permitted activity, including a discharge permit under section 402, must be certified to comply with State water quality standards adopted under section 303.\n\nS. Rep. No. 370, at 72, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News 4326, 4397; H. Conf. Rep. No. 830, at 96, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News, 4424, 4471.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e According to the committees, the amendment was not meant to change the law but to follow and clarify the original congressional intent that \"State water quality standards would be imposed through Section 301, and thus certification by the State would include consideration of water quality standards.\" 1977 U.S. Code Cong. \u0026 Admin. News at 4397. The conference committee added that \"section 303 is always included by reference where section 301 is listed.\" H. Conf. Rep. No. 830, at 96, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News, 4424, 4471. The Senate committee offered this further explanation of the amendment:\n\nAll States have approved water quality standards. Thus, it is reasonable to require that Federal permits and licenses should take into account State water quality plans, standards and requirements adopted under section 303 to assure maintenance of water quality in the respective States.\n\nId. at 4398. Neither the statute as amended nor the committee reports concerning the bills distinguish between source and affected states. Thus, EPA's view that sources subject to NPDES permits must comply with all approved state water quality standards is a reasonable interpretation in light of this history.\n\nb. 33 U.S.C. § 1342\n\nAlso germane to EPA's construction of the CWA is the fact that, in those states authorized to issue NPDES permits, the EPA Administrator retains authority to veto any proposed permit if he objects to its issuance. 33 U.S.C. § 1342(d)(2).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e EPA may object on the basis of either of two grounds: (1) that a permitting state failed to accept recommendations from another state whose waters may be affected by permit issuance; or (2) that the permit is \"'outside [i.e., inconsistent with] the guidelines and requirements' of the Act.\" EPA Brief at 18-19 (quoting 33 U.S.C. § 1342(d)(2)).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The statute mandates that \"no permit shall issue\" if EPA objects for either reason. § 1342(d)(2). If the source state does not revise the proposed permit to satisfy EPA's objection, EPA may issue a discharge permit, § 1342(d)(4), but it may not issue a permit less stringent than that required by any state's effluent limitations and water quality criteria. H.R. Conf. Rep. No. 830, 95th Cong., 1st Sess. 97, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News 4424, 4472. Given that a permit program administered by EPA is subject to the same requirements as apply to an approved state program, § 1342(a)(3), no reasonable argument would justify invalidating a state-issued permit that fails to account for the WQS of another state, yet allowing EPA to issue a permit objectionable on the same ground.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nAlthough several of the CWA terms discussed in the foregoing paragraphs have no direct application to the permit in this case (because EPA, not Arkansas, is the permitting agency), they reflect the objectives and policies behind the Act and the statutory framework established for implementing them. Because nothing in the Act suggests that permits issued by states are subject to more stringent requirements than those issued by EPA -- indeed, § 1342(a)(3) mandates that permits issued by EPA and the states \"shall be subject to the same terms, conditions and requirements\" -- any term of the Act directed to state permitting agencies is instructive as to EPA's permitting responsibilities and authority as well.\n\nThe Arkansas parties construct a similar argument (based on the relation between EPA's and the states' permitting responsibilities) to urge an opposite result, however. They contend:\n\nSection 1342(b)(5) very clearly indicates that an affected state can only be an advisor to the source state in the permitting process when that process has been delegated to a state to administer. . . . Thus, it makes little sense to suggest . . . that a source state discharger must comply with affected state water quality standards when the permitting authority is the EPA rather than a delegated state.\n\nArkansas Brief at 38-39.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Arkansas correctly suggests it would make \"little sense\" if the applicability of a downstream state's water quality standards depended on what entity (EPA or the source state) issues the permit. However, Arkansas's argument that affected states are limited to an advisory role contains several fatal flaws.\n\nFirst, in arguing, in effect, \"an affected state may not require a source state to comply with the former's WQS; therefore, EPA may not require such compliance,\" Arkansas's fundamental premise is faulty. The fact that an affected state may have only an \"advisory role\" under § 1342(b)(5) does not mean compliance with that state's approved water quality standards is discretionary. Moreover, § 1342(b)(5) merely describes part of the procedures a state permit program must provide for insuring communications among the source state, an affected state, and EPA concerning the permitting of a new discharge in the source (permitting) state. See also § (b)(3)-(4). Standing alone, the subsection says nothing about whether compliance with affected states' WQS is optional or obligatory.\n\nSecond, Arkansas's argument focuses on one paragraph in isolation, rather than in the context of the entire Act, or even in the context of § 1342 as a whole. Section 1342(b) provides that the EPA Administrator shall approve any program submitted by a state desiring to administer its own permit program unless he determines, essentially, that the state proposal does not ensure adequate authority to administer the NPDES permit program properly. Subsection (b)(5), upon which Arkansas relies, is only one of nine specific grounds upon which EPA may refuse permitting authority to a state. § 1342(b)(1)-(9). Subsection (b)(1)(A), for example, requires adequate state authority to \"issue permits which . . . apply, and insure compliance with, any applicable requirements of sections 1311, 1312, 1316, 1317, and 1343 of this title.\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e § 1342(b)(1)(A).\n\nArkansas's argument also overlooks the fact that § 1342(b)(5) derives from § 1341, the certification statute. As discussed earlier in this opinion, § 1341 not only provides for notice to potentially affected states, it requires that permits be conditioned so as to insure compliance with all applicable water quality requirements, and it prohibits issuing any permit that cannot insure such compliance. § 1341(a)(2).\n\nFinally, Arkansas's argument must fail in the face of other CWA provisions heretofore discussed -- in particular, EPA's authority to veto permits and to suspend state programs if they do not meet the requirements of the Act, § 1342(c)-(d), and the proviso that state and EPA permit programs be subject to the same terms and conditions, § 1342(a)(3).\n\nc. EPA's \"Upset\" Regulation\n\nWe find still further support for EPA's construction of the CWA in the views the agency expressed in an earlier rulemaking proceeding. In the course of promulgating final regulations providing dischargers with a defense to violating effluent limits during unavoidable source \"upset\" conditions, EPA stated that \"the CWA requires strict compliance with water quality standards\"; thus, \"water quality standards are . . . legally required to be met at all times.\" 49 Fed. Reg. 37,998, 38,038 (1984), quoted in Sierra Club v. Union Oil Co., 813 F.2d 1480, 1489 (9th Cir. 1987), judgment vacated, 485 U.S. 931, 108 S. Ct. 1102, 99 L. Ed. 2d 264 (1988); see 40 C.F.R. §§ 122.41(n), -.4(d).\n\nThe final \"upset\" rule provides that in certain narrowly defined circumstances technology-based effluent limitations may be exceeded (i.e., failure of pollution controls may be allowed). 40 C.F.R. § 122.41(n). Significantly, an industry-proposed defense for violation of water quality-based permit limits\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e was deleted in the final rule. EPA reasoned that, because water quality standards must be met at all times, even during \"upset\" conditions, \"permittees would need to do continuous monitoring on all stream segments that may be affected \" to ensure that water quality standards were not violated in order to establish the defense. 49 Fed. Reg. at 38,038 (emphasis added). The impracticality of such a requirement led EPA to reject the industry proposal. 49 Fed. Reg. at 38,038. Id.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThis view that all potentially affected stream segments would have to be monitored reflects EPA's conviction that an upstream source whose effluent might affect the water quality of downstream states must comply with the WQS of those states. It is also consistent with EPA's belief that \"strict compliance\" with water quality standards is required by the CWA, because such compliance would be impossible if sources could disregard the WQS of states other than the source state.\n\nAccording to EPA, the requirement of strict compliance with WQS derives from 33 U.S.C. § 1311(b)(1)(C), which mandates that \"there shall be achieved . . . not later than July, 1, 1977, any more stringent limitation . . . necessary to meet water quality standards.\" (Recall that all NPDES permits must ensure compliance with § 1311. § 1342(a)(1), (b)(1).) The legislative history of the section bears out EPA's interpretation. See S. Rep. No. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3710 (EPA \"is under a specific obligation to require that level of effluent control which is needed to implement existing water quality standards without regard to the limits of practicability\"). Even in 1977 when Congress \"relaxed\" the best available technology requirements in certain circumstances, the amended statute and the legislative history leave no doubt that water quality standards still must be maintained.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e In explaining the amendment the Senate committee cautioned:\n\nThe gains made as a result of the 1977 requirements could evaporate in the middle of the next decade if only the 1977 [effluent limitations] and new source performance standards are applied. Thus, for many riverways . . ., pressure must be maintained to assure improved water quality and to avoid slipping back.\n\nThe Committee intends that current effluent limitations . . . should represent a \"floor\" or minimum requirement of the modifications authorized by this section. Current levels of discharge must not be relaxed by this provision because that would imply additional treatment requirements on other point or nonpoint source dischargers.\n\nId. at 42, 44, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News at 4367, 4369 (emphasis added).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The Committee also stated: \"There is nothing in these new provisions which in any way preempts the rights of States to have more stringent water quality standards or associated effluent limitations . . . .\" Id. at 43, U.S. Code Cong. \u0026 Admin. News at 4368.\n\nd. 33 U.S.C. § 1365\n\nOne final provision of the CWA deserves mention in our discussion of the statutory interpretation issue. Section 505(h), 33 U.S.C. § 1365(h), authorizes the governor of a state to sue EPA to enforce an \"effluent standard or limitation under this chapter,\" the violation of which is occurring in another state and is \"causing a violation of any water quality requirement in his state.\" Subsection (f) defines \"effluent limitation or standard under this chapter\" as including, for purposes of this section, certification under § 1341 and permits or conditions thereof issued under § 1342.\n\nClearly, the injury sustained by a state for which § 1365 provides a remedy is the impact on that state's water quality, not the violation of the \"effluent standard or limitation\" per se. This interpretation is dictated by common sense and congressional intent. See S. Rep. No. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3675 (\"The basis of pollution prevention and elimination will be the application of effluent limitations. Water quality will be a measure of program effectiveness and performance.\"). Arkansas's view that discharge permits are not required to ensure compliance with the applicable WQS of all affected states cannot be reconciled with § 1365(h)'s express remedy for the violation of \"any water quality requirement\" in one state, which results from the violation of an \"effluent limitation\" (defined to include a permit condition) in another state.\n\nSection 1365 reminds us that, under the CWA, effluent limitations are not an end in themselves, but simply a means to an end -- the desired water quality. The plainest evidence of this can be found in 33 U.S.C. § 1311(b)(1)(C) (discussed at pages 20-21 of this opinion) and in § 1312, each of which reveals that the purpose of effluent limitations is to achieve a desired level of water quality. Section 1312, \"Water quality related effluent limitations,\" provides:\n\nWhenever, in the judgment of the [EPA] Administrator, discharges of pollutants from a point source or a group of point sources, with the application of effluent limitations required under section 1311(b)(2) of this title, would interfere with the attainment or maintenance of that water quality in a specific portion of the navigable waters which shall assure protection of public water supplies, agricultural and industrial uses, and the protection and propagation of a balanced population of shellfish, fish and wildlife, and allow recreational activities in and on the water, effluent limitations (including alternative effluent control strategies) for such point source or sources shall be established which can reasonably be expected to contribute to the attainment or maintenance of such water quality.\n\n33 U.S.C. § 1312(a) (emphasis added). In other words, effluent limits more stringent than those required by 33 U.S.C. § 1311(b)(2) must, if feasible, be established by EPA and imposed on any sources responsible for interfering with the desired water quality in a specific stream segment.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e In the words of the Senate committee:\n\nThe limitations necessary to achieve a given level of water quality in one reach of a waterway may require more control of effluents than that attainable through application of the best available technology. Where that is desirable to implement the policies of the Act, and feasible, [this section] provides the authority to impose controls based on water quality.\n\nThe concept of \"alternative effluent control strategies\" is necessary to account for [certain] difficulties in simply setting more stringent effluent limitations. . . . Further reduction of the level of effluent entering the affected waters may not be possible through control technology, yet essential to water quality. Alternative effluent control strategies, such as the transportation of effluents to other less affected waters or the control of in-plant processes would have to be developed.\n\nS. Rep. No. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3712-13 (emphasis added).\n\nThis section and its legislative history reveal the preeminent importance of water quality -- actual and desired -- in the framework of the CWA. Significantly, they lack evidence of any intent to limit the scope of § 1312 to the intrastate water quality effects of discharges. Indeed, the statute's use of the term \"specific portion of the navigable waters\" (like the Senate report's use of \"one reach of a waterway\" and \"affected waters\"), rather than language specifying waters of the source or permitting state, suggests that the section contemplates regulation of water quality without regard to state boundaries. Vesting authority in EPA, instead of in individual states, arguably suggests a similar intent.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nConsidered together, all of the provisions of the CWA discussed above (§§ 1311, 1312, 1313, 1314, 1341, 1342, 1365, and 1370), as well as the legislative history and EPA's implementing regulations, evidence the reasonableness of EPA's interpretation of the Act. Accordingly, we hold that no discharge to a navigable water, such as the Illinois River, may be permitted unless compliance with all applicable water quality requirements, including the federally approved standards of affected downstream states, is assured.\n\nB. Significance of Existing Violations of Illinois River Water Quality Standards\n\nThere is substantial evidence in the record of ongoing violations of Illinois River water quality standards, yet neither of the EPA judicial officers nor any of the parties addresses whether, or how, this is relevant to Fayetteville's application to discharge to the Illinois River. We believe this situation poses an issue of critical importance -- whether a new discharge may be permitted when the applicable water quality standards are already being violated.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Guided by the Supreme Court's pronouncement that an agency decision is arbitrary and capricious if the agency \"entirely failed to consider an important aspect of the problem [or] offered an explanation for its decision that runs counter to the evidence before the agency,\" Motor Vehicle Mfrs., 463 U.S. at 43, we conclude EPA's decision to issue the Fayetteville permit was arbitrary and capricious. The agency's decision is also flawed by misinterpretation and misapplication of two important Oklahoma water quality regulations and by arbitrary disregard for certain expert testimony. For these reasons, discussed more fully below, we hold that the Clean Water Act prohibits granting an NPDES permit under the circumstances of this case (i.e., where applicable water quality standards have already been violated) and reverse EPA's decision to permit Fayetteville to discharge any part of its effluent to the Illinois River Basin.\n\n1. Law Applicable to Oklahoma Scenic Rivers\n\nThe Upper Illinois River, including Lake Frances, from the Arkansas state line down to the 650-foot elevation level of Tenkiller Ferry Reservoir, is designated an Oklahoma state scenic river. Okla. Stat. tit. 82, § 1452(b)(1) (1990). s such, certain water quality standards apply to these waters. See Oklahoma Water Quality Standards (OWQS) § 4 \u0026 App. A (1982).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Water quality standards consist of two parts: a designated use or uses for the identified waters and water quality criteria for uch waters based on those uses. 40 C.F.R. § 130.2(c); Okla. Stat. tit. 82 § 904(f); OWQS § 4. Of greatest interest for purposes of this discussion are the Illinois River's \"fish and wildlife propagation\" (primary warmwter fishery), \"aesthetics,\" and \"smallmouth bass\" designated \"beneficial uses.\" Within the latter two use categories, the following water quality criteria are particularly significant: turbidity (OWQS § 4.10(b)), nutrients (OWQS § 4.10(c)), and dissolved oxygen (OWQS § 4.11(a)). The occurrence of phosphorus and nitrogen in Fayetteville's effluent necessitates the consideration of these criteria.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nAs a preliminary matter, Oklahoma contends and we agree that EPA's judicial officers erred in concluding that Oklahoma's nutrients standard, § 4.10(c), applies only to lakes, not to streams. Decision on Remand, R., A-33, at 6; Second Order on Petitions for Review, R., A-37, at 8. Section 4.10(c) provides: \"The total phosphorus concentration and the nitrogen/phosphorus concentration ratio shall not be increased to levels which result in man-induced eutrophication problems.\" The source of the agency's confusion is the definition of \"eutrophication (natural)\" (included in Appendix C of the OWQS), which refers only to lakes.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e An Oklahoma witness at the administrative hearing explained that the definitions in the appendix are \"scientific definitions,\" provided merely for clarification purposes, and that \"the state does apply the eutrophication principle . . . to rivers.\" Tr. at 578. Apparently no one scrutinized the OWQS carefully enough to discover that the regulations themselves define the scope of the nutrient standard's application. Section 4, \"Standards for Water Quality,\" unequivocally states: \"Narrative standards [[including] Section . . . 4.10(c) . . .] shall be maintained at all times and apply to all perennial and intermittent streams.\" (Emphasis added.) In addition, the preface to Appendix A of the OWQS states that § 4.10(c) applies even to those stream segments not listed in the appendix (i.e., stream segments for which beneficial uses have not been designated). Accordingly, we reject EPA's ruling that the nutrients standard applies only to Lake Frances and Tenkiller Reservoir and hold that it applies to the entire reach of the Illinois River in Oklahoma.\n\nIn addition to the nutrients standard, Oklahoma's \"Anti-Degradation Policy,\" OWQS § 3, and \"Beneficial Use Limitations,\" id. § 5, also protect the Upper Illinois River.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e The Oklahoma parties assert that EPA also misinterpreted and misapplied these regulations. Their argument is rather unfocused, but they basically claim that \"any increase in any 'wastes' . . . which may pollute or tend to pollute \" the waters of a scenic river violates these rules. Oklahoma Brief at 32 (emphasis in original); see generally id. at 30-38.\n\nThe Beneficial Use Limitations regulation provides that scenic rivers \"are protected by prohibition of any new point source discharge of wastes . . . except under conditions described in Section 3 [the Anti-Degradation Policy].\" OWQS § 5. The relevant provision of § 3 states: \"No degradation shall be allowed in high quality waters . . . includ[ing] water bodies . . . designated 'Scenic Rivers.'\" The Oklahoma courts apparently have not interpreted these provisions.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Nevertheless, we believe the plain language of the regulations manifests a clear intent to allow no degradation of the water quality of scenic rivers. More specifically, the regulations disallow any additional discharge of pollution (either a new point source or an increase from an existing source) to a scenic river if its water quality has been degraded or if the new source would degrade it.\n\nCloser examination of the language and structure of the Anti-Degradation Policy, guided by the minimum requirements for such policies set forth in EPA's regulation, confirms our plain language construction.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The Oklahoma regulation allows \"no degradation\" of water quality in designated scenic rivers. \"Limited degradation\" is permitted limited only in other \"high quality waters\" where the existing water quality \"exceeds those levels necessary to support propagation of fish, shellfish, wildlife, and recreation.\" OWQS § 3, para. 2. Even if the Upper Illinois were not a scenic river, it would not be eligible for the limited degradation exception because its waters in their present condition do not qualify as such \"high quality waters.\" See infra part B.2. Clearly, then, the Oklahoma Anti-Degradation Policy prohibits any further degradation of the Illinois scenic river.\n\nWe conclude the requirements of the Beneficial Use Limitations/Anti-Degradation Policy are violated when the water quality of a scenic river undergoes any human-caused, detectable change. By \"detectable change\" we mean any detectable change in a water quality parameter such as turbidity or phosphorus (with the perhaps unnecessary qualification that an improvement in waterquality is excepted). We do not mean a detectable change that violates a numeric criterion for that parameter (e.g., 25 NTUs for turbidity), which criterion would otherwise apply if the Beneficial Use Limitations were not applicable (i.e., if the receiving waters were not designated as a sceni river or otherwise as \"(a)\" in Appendix A).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e The Beneficial Use Limitations/Anti-Degradation Policy are designed to provide additional protection beyond that conferred by the numeric limits of other water quality standards. Interpreting these regulations as merely prohibiting violations of otherwise applicable WQS would render them a nullity because, as we have seen, WQS may not be contravened in any waters, regardless of whether these additional regulations apply.\n\nThe ALJ, on remand, did not explicitly address the Anti-Degradation Policy but did construe the Beneficial Use Limitations. The 1985 version of the Beneficial Use Limitations, which the ALJ deemed applicable, provides: \"'All streams and bodies of water designated as (a) . . . are protected by prohibition of any new point source discharge which increases pollutant loading or increased load from an existing point source.'\" Decision on Remand, R., A-33, at 4. Construing this regulation in light of the OWQS definition of \"pollution,\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e he concluded: \"The Oklahoma parties must show by substantial evidence that the City's discharge will create a nuisance or render the Illinois River in Oklahoma harmful, detremental [sic] or injurious to any beneficial use of the river.\" Decision on Remand, R., A-33, at 5. The CJO upheld this interpretation with minimal discussion. Second Order on Petitions for Review, R., A-37, at 8. He excused the ALJ's failure to discuss the Anti-Degradation Policy by explaining that the ALJ \"implicitly addressed the policy in his detailed analysis of the discharge's potential impact on all relevant water quality parameters.\" Id. at 9; see id. at 10 (if ALJ erred in this regard, it was \"harmless error\"). The CJO reasoned that \"if the Fayetteville discharge will not cause a detectible change in any of the relevant water quality parameters [as the ALJ found], it logically follows that there will not be a 'quality degradation.'\" Id. at 9-10.\n\nWe have considerable difficulty with the agency's treatment of these crucial Oklahoma regulations. First, and most importantly, the ALJ's interpretation defies the plain language of the Beneficial Use Limitations and the Anti-Degradation Policy that it references.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Secondly, the CJO ruled that the ALJ erred in applying the 1985, rather that [Sic] the 1982, OWQS. Second Order on Petitions for Review, R., A-37, at 5-6. The CJO deemed this error harmless, but we disagree.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The 1985 version of the Beneficial Use Limitations, which the ALJ improperly applied, states: \"All streams . . . designated as (a) in Appendix A are protected by prohibition of any new point source discharge which increases pollutant loading. . . .\" OWQS § 7.11 (1985) (emphasis added), quoted in Decision on Remand, R., A-33, at 4. Finding no definition of \"pollutant loading\" in the 1985 rule, the ALJ consulted the statutory definition of \"pollution,\" Okla. Stat. tit. 82 § 926.1.1., to construct his interpretation of the regulation. The applicable 1982 rule, however, prohibits simply \"any new point source discharge of wastes \" (emphasis added). Oklahoma law defines \"wastes\" as \"industrial waste and all other liquid, gaseous or solid substances which may pollute or tend to pollute any waters of the state.\" § 926.1.2. We do not know whether Oklahoma intended to significantly change the import of the Beneficial Use Limitation by this minor language revision, but we cannot approve a construction of the regulation based on the definition of a term (\"pollution\") not even contained in the applicable rule.\n\nFinally, the agency's construction of the Beneficial Use Limitation is further flawed by the ALJ's imposition of the burden on Oklahoma to prove that the discharge would \"create a nuisance\" or \"render the Illinois River . . . harmful . . . or injurious to any beneficial use.\" Decision on Remand at 5. Granted, the opponent of a permit has the \"burden of going forward to present an affirmative case at the conclusion of the Agency case on the challenged requirement.\" 40 C.F.R. § 124.85(a)(3)(ii). However, the \"Agency has the burden of going forward to present an affirmative case in support of any challenged condition of a final permit,\" id. § (a)(2), and more importantly, the \"permit applicant always bears the burden of persuading the Agency that a permit . . . should be issued and not denied,\" id. § (a)(1). By requiring Oklahoma to \"show by substantial evidence that the City's discharge will create a nuisance,\" the ALJ improperly transformed Fayetteville's burden of showing the permit should be issued into a burden on Oklahoma to show that it should be denied.\n\nAs for the Anti-Degradation Policy, the CJO concluded there could be no violation of the policy if there would be no detectable change in water quality. However, it is not clear whether the CJO interpreted the policy as requiring that there be no detectable change in water quality, or whether he was merely reporting the legal significance of the facts found by the ALJ. Although the CJO determined in his first order that the applicable legal standard is \"whether [Fayetteville's] discharges under the permit will result in a detectable violation of the applicable water quality standards,\" Order on Petitions for Review, R. A-28, at 2, 12-13, his subsequent affirmation of the ALJ's erroneous construction of the Beneficial Use Limitations casts doubt on whether he intended the \"no detectable change\" test to apply to violations of the Beneficial Use Limitations/Anti-Degradation Policy as well. Because of this ambiguity and the errors in interpreting the Beneficial Use Limitations, we agree with the Oklahoma parties that the agency incorrectly construed and applied both Oklahoma regulations.\n\n2. Existing Degradation of Illinois Scenic River\n\nUnder other circumstances, the errors described above might necessitate remanding to the agency with instructions to apply Oklahoma law as we have construed it. However, given the facts in this record, even proper interpretation and application of Oklahoma water quality standards cannot save this permit. The record contains substantial evidence from which the ALJ could have found that the water quality of the Illinois scenic river has been degraded and that water quality standards were being violated prior to the onset of Fayetteville's discharge to the river (see subpart a. below). We believe that, where a proposed source would discharge effluents that would contribute to conditions currently constituting a violation of applicable water quality standards, such proposed source may not be permitted.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e The ALJ and the CJO erred in failing to consider whether or how the river's existing degraded condition is relevant to the decision whether to permit a nw source discharge.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nThree factual subissues are essential to our determination that the Fayetteville discharge to the Illinois River may not be permitted: (1) whether the Illinois scenic river is already degraded (i.e., whether its quality has deteriorated since the river's designation in 1970); (2) whether Fayetteville's effluent will reach the scenic river; and (3) whether and how the components of Fayetteville's discharge would contribute to conditions in the Illinois River. Although it is difficult to summarize a record that consists of five boxes and four years of briefs, orders, transcripts, prepared testimony, correspondence, technical reports and miscellaneous other documents, in the following few pages we attempt to capsulize the evidence relevant to these three issues.\n\na. Evidence of existing degradation. First, we address the subject of the degradation of the Illinois scenic river's historically pristine water quality. Our review of the record before the ALJ revealed ample evidence from which the ALJ could have concluded that the river's condition has deteriorated since its designation as a scenic river and that water quality standards are being violated. Examples of this evidence follow.\n\nMyron Knudson, Director of the Water Management Division, EPA-Region 6, testified at the administrative hearing: \"There has [sic] been many conversations as related to what could be done in order to clean up the Illinois River.\" Tr. at 221. The Attorney General of Oklahoma Robert Henry, in a prepared statement delivered at the hearing, described the Illinois River as \"degraded,\" Tr. at 232, and stated that \"the river cannot handle the existing load\" of municipal wastewater treatment plant discharges, Tr. at 233. Dr. Stephen Threlkeld, witness for the Oklahoma Wildlife Federation and author of the EPA-funded \"Clean Lakes\" report on Lake Frances,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e summarized the results of the \"Clean Lakes\" study, stating: \"Water quality violations of the Oklahoma Water Quality Standards in Lake Frances . . . are in terms of bacteria and in terms of turbidity. . . .\" Tr. at 356. He explained that EPA funded the study \"because they wanted to know what the problems were in Lake Frances.\" Tr. at 359; see id. at 374.\n\nMike Schornick, Oklahoma witness and principal of Schornick/Roberts \u0026 Associates, consulting engineers, testified that significant degradation trends are and have been occurring in the Illinois scenic river, including Lake Frances. Tr. at 398-400 (citing prefiled testimony, R., OK-2, at 3-4). He stated that certain figures in his prefiled testimony, which reflect data obtained from regular water quality monitoring conducted by Oklahoma at several points along the Illinois River, illustrate the degradation trends. Tr. at 414, 439. He claimed dissolved oxygen concentrations are reaching levels that violate OWQS. OK-2 at 4. He also stated that Arkansas and Oklahoma monitor phosphorus in their regular 305(b) trend analysis reports\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e to EPA, Tr. at 486, and that all of those reports (1976-81 and 1984) show increasing phosphorus concentrations, Tr. at 489-90. Accounting for the addition of Fayetteville's effluent, Schornick said phosphorus loading and concentrations in Lake Frances will have increased by 106 percent and 76 percent, respectively, over 1974-75 background levels. Tr. at 454-56 (citing prefiled testimony, OK-2, at 4).\n\nLawrence Edmison, Director, Oklahoma Department of Pollution Control, testified that his department has received \"many complaints about odor problems and color problems on the river.\" Tr. at 542. He also discussed the algae problem on the river in relation to the increasing phosphorus concentrations and decreasing nitrogen concentrations in the water. Tr. at 533-34 (citing prefiled testimony, OK-4, at 3). Based on his years of personal observation of the river and experience handling citizen complaints and looking at trends documented in 305(b) reports and other reports, Tr. at 546-48, he stated, \"I know how bad the river is now; I anticipate that any increased load will only make it worse.\" Tr. at 548. He testified that the 305(b) reports for both 1984 and 1986 related an \"apparent increasing trend\" in phosphorus concentrations at all four Illinois River sampling sites, an \"apparent decreasing trend\" in dissolved oxygen at the same sites (with the exception of the Baron Fork site in 1986), and an \"apparent decreasing trend\" in nitrogen levels at all four sites (with the exception of Tahlequah in 1986). OK-4, at 2-3. Decreasing nitrogen and increasing phosphorus, he claimed, are \"indicative of the algae problem on the river.\" OK-4, at 2-3.\n\nOklahoma witness and consultant Dr. William Walker reported that algae concentrations in Lake Frances already reach 90 parts per billion, which is three times the level typically considered indicative of severe nuisance conditions. Tr. at 609-10. Lake Frances is already \"supersaturated with nutrients,\" Tr. at 691; for example, existing concentrations of phosphorus in Lake Frances are more than ten times levels considered typical of eutrophic lakes, or where algae problems start to develop, Tr. at 701. According to Dr. Walker, a \"plume [of] degraded water\" exists in the river downstream from Lake Frances. Tr. at 701.\n\nJimmie Pigg, part-time ichthyologist with the Oklahoma Water Quality Division and science coordinator for an Oklahoma school district, Tr. at 65, narrated a slide presentation at the administrative hearing showing changes in the condition of the Upper Illinois River since 1972. In response to an objection concerning the relevance of part of the testimony, counsel for the State of Oklahoma stated that the evidence was offered for the purposes of \"show[ing] that the Illinois River is already in a degraded state and cannot assimilate any more effluent\" and that \"the Illinois River has already exceeded [its] assimilative capacity.\" Tr. at 72, 76.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Mr. Pigg said Lake Frances \"is really a sewage lagoon,\" which \"catch[es] and hold[s] the material from Arkansas.\" Tr. at 73.\n\nThe Gakstatter study reported that \"dense phytoplankton populations develop in Lake Frances and also adversely affect water clarity in the Illinois River for several miles downstream,\" and that this growth is \"stimulated by excessively high phosphorus levels originating from [the sewage treatment plants at] Springdale and Rogers [in Arkansas].\" Report at 5.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e The Gakstatter Report also provides brief summaries of the results of several other studies. For example, the U.S. Geological Survey (USGS) in 1984 reported the Illinois River did not meet water quality standards for dissolved oxygen, phosphorus, and fecal coliform bacteria; Threlkeld (1983) described Lake Frances as \"very eutrophic\" due to phosphorus from Springdale and Rogers; the Oklahoma State Water Quality Laboratory (1977) reported Lake Frances was in the \"late stages of eutrophication,\" due partially to \"elevated Illinois River nutrients\"; and two EPA (1977) studies classified as eutrophic both Lake Frances and, to a lesser extent, Tenkiller Reservoir. Gakstatter Report at 7-9.\n\nThe evidence before the ALJ also included the record of a hearing conducted by the Arkansas-Oklahoma Arkansas River Compact Commission on June 3-4, 1985. See R., C-1, Tr. at 307. The subject of the Compact Commission hearing was the Illinois River situation and the (at that time) proposed Fayetteville permit. The Commission issued an order (also included in the administrative hearing record) containing several findings concerning the degraded condition of the river. Findings of Fact, Conclusions of Law, and Commission Order (\"Compact Commission Order\"), R., OK-5. The Commission began by observing that, historically, the Illinois River \"has been recognized by Oklahomans as a watercourse of unique natural scenic beauty and high quality . . . spring-fed waters [that] ran clear and plentiful.\" para. 16. But, the Commission continued, the \"Upper Illinois River System in Oklahoma has, in recent years, undergone a process of degradation in water quality, and the process appears to be on an escalating trend.\" para. 32.\n\nOther findings by the Commission include: \"[The] Illinois River has degraded substantially over the past decade . . . [including] radical changes in the river's water color and turbidity, and the existence of increased alga growth [and] offensive odors. . . .\" para. 33. Violations of the dissolved oxygen standard have been documented by the Oklahoma Department of Health immediately below Lake Frances. para. 35. Degradation of dissolved oxygen is also occurring farther downstream from Lake Frances. para. 36. A 1984 USGS study (presumably the one cited in the Gakstatter Report) showed violations of Arkansas WQS in the Arkansas portion of the river. para. 38. Phosphorus concentrations are continuing to increase in \"significant and undesirable amounts.\" para. 40. The \"Arkansas guideline for maximum phosphorus concentration to prevent eutrophication has already been greatly exceeded in certain Arkansas and Oklahoma river segments.\" para. 40. The \"trend of phosphorus degradation of the Upper Illinois River appears to be occurring at all locations.\" para. 41. Lake Frances is in \"an obvious state of eutrophication, marked by putrid smells and dark brown turbid waters.\" para. 45. Based on Oklahoma's 305(b) report for 1978-83, \"degradation trends also appear to be occurring with reference to levels of potassium, calcium, sodium, copper and hardness.\" para. 46. The Commission acknowledged Arkansas's \"exceptions\" to certain of Oklahoma's sampling methods and conclusions, paras. 47-48, but decided Oklahoma's methods were generally accepted in the scientific community and sanctioned by EPA, para. 49. The Compact Commission concluded: \"Man-made pollution (degradation) of the waters of the Upper Illinois River in both Arkansas and Oklahoma . . . as defined by the compact, [has] occurred and said pollution continues to occur at increasing and alarming rates. . . . Further, said pollution is of grave interstate magnitude and significance.\" Conclusions of Law para. 9.\n\nThe record before the agency also included the Fayetteville 201 Facilities Plan, prepared by Fayetteville in conjunction with its application for an EPA construction grant for its new treatment plant. See 40 C.F.R. § 35.2030(b)(3) (specifying the requirements for such plans). The plan states that \"nutrient loadings from nonpoint sources and existing discharges do adversely impact the Illinois under present conditions.\" CH2M Hill \u0026 McClelland Consulting Engrs., Inc., 201 Facilities Plan Environmental Information Document for City of Fayetteville, Arkansas (Jan. 1984), R., ARK-6, at 2-20. The plan also states that the \"net impact of point and nonpoint sources is to increase nutrient loading, with consequent increases in algal growth and increased turbidity.\" Id. at 2-22. The plan described the biological community in the reach of the river near and below Lake Frances as \"slightly degraded.\" Id. at 2-24. The Illinois River Assessment Report, also in evidence, declares as one of its \"alarming\" conclusions: \"Overwhelming existing documentation demonstrates that significant degradation of the Upper Illinois River has already occurred.\" Roberts/Schornick \u0026 Assocs., Illinois River Assessment Report (Dec. 1984), R., ARK-6, at ii.\n\nAt this juncture we note that the absence of any evidence in the record that enforcement efforts have been undertaken to remedy the pollution problems in the Illinois River does not undermine our conclusion that water quality violations have occurred and no doubt continue to occur. Enforcement actions are not necessary to document water quality degradation; it is only necessary that there be reliable evidence that water quality criteria have been exceeded.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e See 33 U.S.C. § 1319(a)(1) (\"Whenever, on the basis of any information available to him, the Administrator finds that any person is in violation of any condition . . . in a permit . . . he shall [commence enforcement proceedings]\" (emphasis added)). Such evidence may be found in the dischargers' own monitoring reports, see 40 C.F.R. § 122.41(j); the states' obligatory 305(b) or 205(j) (33 U.S.C. § 1285(j)) reports; or other studies or surveys conducted according to accepted methods.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nSimilarly, a history of lax enforcement with respect to existing sources does not justify allowing a new source of pollution. Water quality standards prescribe the desired condition of surface waters to be met at all applicable times; they do not serve merely as a yardstick for enforcement efforts when enforcement personnel may be available to ascertain compliance.\n\nClearly then, the record before the ALJ contains substantial evidence from which it can be concluded that water quality in the Upper Illinois River is degraded and that Oklahoma water quality standards for nutrients, dissolved oxygen, and/or aesthetics have been and probably continue to be violated. The decisions of EPA's judicial officers ignore the bulk of this evidence. To our consternation, however, the ALJ believed some of the relevant testimony chronicled above, yet remained oblivious to its ramifications. In his Decision on Remand, for example, the ALJ stated that \"dissolved oxygen violations in Oklahoma are occurring without [Fayetteville's] discharge.\" R., A-33, at 19 (emphasis added). It also appears he accepted the testimony that nutrients, turbidity, and solids standards were being violated, although he disputed the conclusion that Fayetteville \"would increase the spatial and temporal . . . frequencies\" of those violations. Id. at 14-15 (citing Dr. Walker's and Dr. Gakstatter's testimony). Significantly, no witness refuted the testimony concerning the river's currently degraded condition, nor did the ALJ discredit (or even comment on) any of that testimony. He simply failed to recognize the signiicance of this testimony with respect to the permitting decision at hand.\n\nb. Downstream transport of pollution from Fayetteville. Next, we address the question of the downstream migration of Fayetteville's effluent. Our review of the transcript revealed that no person involved in the administrative hearing seriously disputed that pollution from Fayetteville would reach the state line; instead, the parties debated how much would reach Oklahoma and what effect, if any, it would have. Indeed, in his final opinion, the ALJ recites evidence that twenty to twenty-five percent of the nutrients (specifically, phosphorus) in Fayetteville's effluent would be \"bio-available\" at the Oklahoma state line. Decision on Remand, R., A-33, at 8. The evidence supporting downstream transport includes:\n\nAccording to EPA witness and employee Garrett Bondy, the Waste Load Allocation Study performed by Arkansas predicts a six-percent increase in the phosphorous load to Lake Frances due to Fayetteville. Tr. at 147. Fayetteville witness Dr. Cliff Thompson testified to a 2.4-percent increase, based on a discharge of 35 lb. phosphorus per day. Tr. at 280-81. (Fayetteville's permit allows it to discharge 54 lb. phosphorus daily.) Thompson, whose firm CH2M Hill prepared the 201 Facilities Plan for the Fayetteville plant, said: \"We recognized that we would be adding discharge to the Illinois River.\" Tr. at 266-67. Dr. Robert Blanz, former deputy director of the Arkansas Department of Pollution Control and Ecology, testified that Fayetteville's waste could reach Lake Frances, the Illinois River below the lake, and Tenkiller Reservoir. Tr. at 308-11, 321-22. He \"guessed\" twenty to twenty-five percent of the phosphorus from the plant would be cycled through the Upper Illinois River system rather than taken out of it. Tr. at 311-12; cf. Decision on Remand at 8.\n\nMike Schornick, testifying for Oklahoma, suggested that sixty percent of Fayetteville's phosphorus discharge would reach Lake Frances (based on his review of existing data). Tr. at 454-56 (citing prefiled testimony, R., OK-2, at 4). He stated that treatment plant operation would result in measurable changes in Lake Frances during low flow conditions. Tr. at 461-62. Another Oklahoma witness, Dr. Walker, testified that Fayetteville would increase the phosphorus load to Lake Frances by 4.69 percent in an average flow year. Tr. at 610-11 (referring to amended Table 5 in his prefiled testimony, R., OK-9).\n\nThe Arkansas River Compact Commission found that Lake Frances no longer acts as a \"nutrient trap\"; thus, the \"addition of any new waste effluent discharge into the Illinois River from above Lake Frances . . . will be transmitted downstream below Lake Frances into the Illinois River in Oklahoma.\" Compact Commission Order, R., OK-5, Findings para. 44. The Commission further stated that \"the potential for or threat of an increased phosphorus loading . . . from [Fayetteville's] discharge to the Illinois River in Oklahoma clearly exists.\" Id. para. 73.\n\nFinally, the 201 Facilities Plan reports \"considerable downstream transport of enriched organic matter\" in the Upper Illinois River. R., ARK-6, at 2-22. Citing the Oklahoma State Department of Health's conclusion that \"nearly 60 percent of the nitrogen and 74.4 percent of the phosphorus load measured in the Illinois River at Tahlequah, Oklahoma was [sic] contributed by sources above Lake Frances,\" the report concludes the \"data clearly show that point and nonpoint sources in Arkansas are a major source of nutrients in the Illinois River of Oklahoma.\" Id. at 2-24. The report states that additional nutrients introduced to Lake Frances \"may be passed through [the lake] to downstream reaches of the Illinois,\" id., and that \"transport of dissolved and suspended nutrients from Arkansas sections of the Illinois basin may have some effects on Tenkiller Reservoir in Oklahoma,\" id. at 2-28. \"Fayetteville's treated effluent,\" the report claims, \"would increase downstream nutrient concentrations by . . . perhaps 10-15 percent . . . during low-flow conditions.\" Id. at 4-13.\n\nBased on the foregoing, which is just a sample of the record evidence pertaining to the downstream transport of Fayetteville's effluent, we conclude there was substantial evidence before the ALJ to support a finding that Fayetteville's effluent would reach the Illinois scenic river.\n\nc. Significance of Fayetteville effluent to existing conditions. Lastly, we recite some of the evidence relevant to the third important subissue -- whether and how the components of Fayetteville's discharge can be expected to contribute to water quality conditions in the Illinois River. Although this is more a scientific question than it is a legal one, the inquiry helps to tie together the conclusions drawn from the first and second subissues discussed above. The evidence includes:\n\nMike Schornick asserted that Fayetteville's effluent will result in increased algae in Lake Frances. Tr. at 434-35 (citing prefiled testimony, OK-2, at 15). He discussed the relation between phosphorus and nutrient loading and dissolved oxygen levels, Tr. at 436, offering a brief explanation of how algae can increase and decrease the concentration of oxygen in water, Tr. at 438.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e He noted that increased algae can result in many aesthetic problems, including taste, odor, and the appearance of a river. Tr. at 477-78. He reported that the decreasing dissolved oxygen trends in the Upper Illinois have paralleled increases in phosphorus and other nutrients, calling this \"strong evidence that there is a definite relationship between the two phenomena,\" as well as a logical consequence of increased biological activity. OK-2, at 4. In his opinion, the Fayetteville discharge will \"precipitate lower dissolved oxygen concentrations and more frequent violations of the dissolved oxygen standards.\" Id. at 5. He also contends Fayetteville will cause violations of the copper standard. Id.\n\nRobert Blanz, testifying for Arkansas, stated that \"scouring\" (the action of high stream flows moving sediment on the stream bottom and along its banks) resuspends sedimented material, including algae, thus increasing turbidity. Tr. at 322. EPA official Garrett Bondy testified that the Fayetteville discharge \"may raise\" sediment oxygen demand, thus potentially contributing to reduced dissolved oxygen concentrations in the river. Tr. at 129; see also id. at 133, 135. Dr. Threlkeld stated that \"algal growth and resuspension of sediments are a part of turbidity [in Lake Frances].\" Tr. at 356.\n\nDr. Walker agreed that one cause of water clarity problems in Lake Frances is algae. (The other is inorganic turbidity.) Tr. at 680-81 (citing Gakstatter Report; see id. at 78). He believes the increase in nitrogen pollution of the Illinois River attributable to Fayetteville's discharge might increase the amounts of periphyton (surface algae) in backwater areas and under low flow conditions. Tr. at 693. He further believes these impacts would become more significant as the phosphorus discharges from other upstream sources decrease. Tr. at 694, 716-18.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e In Dr. Walker's opinion, an increased growth of periphyton (i.e., more floating algal \"mats and scums\" on the river) would violate Oklahoma's aesthetics standard. Tr. at 705. He further asserted that Fayetteville's discharge would increase turbidity in Tenkiller Reservoir. Tr. at 711.\n\nLawrence Edmison, director of the Oklahoma Department of Pollution Control, testified that algae degrades the river and violates the aesthetics and coloration standards. OK-4, at 3. He related the algae problem in the river to increasing phosphorus and decreasing nitrogen concentrations in the water. Tr. at 533-34 (citing prefiled testimony, OK-4, at 3). The record also includes a memorandum to Lawrence Edmison from Quang Pham, an Oklahoma State Department of Health employee, which references a recent EPA study \"on eutrophication of the Illinois River [that] indicated that phosphorus plays a major role in the stimulation of algae growth in the river.\" Addendum to OK-4, at 2. Gakstatter and Katko concluded tentatively that \"controlling algal growth in Lake Frances will result in a marked improvement in water clarity in the reservoir and in the Illinois River reach below the dam.\" Gakstatter Report at 76. Finally, the 201 Facilities Plan reports that the \"high productivity of the Illinois [River] waters causes considerable downstream transport of enriched organic matter\" and the \"net impact of point and nonpoint sources [such as Fayetteville] is to increase nutrient loading, with consequent increases in algae growth and increased turbidity.\" ARK-6, at 2-22.\n\nWe conclude from the foregoing three-part review of the record that there is substantial evidence that degraded water quality conditions currently exist in the Illinois River in Oklahoma and that these conditions have been caused at least in part by pollutants that are constituents of Fayetteville's effluent. There is also substantial evidence that Fayetteville's effluent will be transported downstream to Oklahoma; thus, the plant can be expected to contribute to the ongoing deterioration of the scenic river and possibly Tenkiller Reservoir as well. It is our inescapable conclusion, given this evidence and the requisites of federal-Oklahoma state water pollution control laws, that the Fayetteville discharge to the Illinois River may not be permitted.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nIV. Discussion and Conclusions\n\nAs explained in part I. of this opinion (Standard of Review), we normally give considerable deference to an agency's interpretation of its obligations and authority under a statute it administers. Here, EPA's view that no discharge to a navigable water may be permitted unless it will comply with the federally approved standards of all affected downstream states is consistent with the statutory language and EPA's implementing regulations, supported by the legislative history, and reasonable on its face; therefore, it is entitled to substantial deference. See Chevron, 467 U.S. at 844-45. As we discussed in part III.A. supra, we adopt the agency's view on this question of statutory interpretation as our first holding in this case.\n\nThe balance of the agency's actions, however, do not warrant similar respect. In part III.B. we have identified several errors or deficiencies in EPA's interpretation of the applicable Oklahoma regulations, in the agency's factual findings, and in its application of the law to the relevant facts. We believe the most serious of these errors is the failure to attribute any significance to the existing WQS violations. In this section we discuss the errors on which we found our conclusion that the Fayetteville permit decision must be set aside as \"arbitrary, capricious, . . . or otherwise not in accordane with law.\" 5 U.S.C. § 706(2)(A).\n\nAs a preliminary matter, EPA undermined our usual deference to its special expertise by the failure of its presidng officer o consider an important scientific principle, the oxygen-reducing effects of algae respiration and decay, and by his incomplete understanding of phosphorus assimilation.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e \"EPA's failure to base its position on scientific or policy considerations . . . [is] cause for reduced deference.\" National Wildlife Fed'n v. Gorsuch, 224 U.S. App. D.C. 41, 693 F.2d 156, 169 (D.C. Cir. 1982). Similarly, a lack of thoroughness on the part of the agency warrants reduced deference. Id. at 166 (\"'thoroughness . . . of an agency's reasoning' bears on the proper degree of deference\" (quoting Federal Election Comm'n v. Democratic Senatorial Campaign Comm., 454 U.S. 27, 37, 70 L. Ed. 2d 23, 102 S. Ct. 38 (1981)). In light of other errors in the agency's reasoning, however, we need not decide whether these flaws alone constitute reversible error.\n\nEPA also misinterpreted and misapplied the Oklahoma nutrients standard and the Beneficial Use Limitations/Anti-Degradation Policy. In these respects the permit decision is flawed as a matter of law and must be set aside. 5 U.S.C. § 706(2)(A).\n\nFurthermore, the agency's judicial officers believed expert testimony that nutrients in Fayetteville's discharge would be transported downstream to Oklahoma, but they inexplicably rejected or discounted testimony concerning the probable eutrophying effects of these nutrients. This error may have resulted in part from the officers' faulty understanding of eutrophication processes and/or their erroneou interpretation of the nutrients standard. In any event, the net result is that the agency's decision to permit the Fayetteville discharge to the Illinois River \"runs counter to the evidence before the agency\" and lacks a \"satisfactory explanation . . . including a 'rational connection between the facts found and the choice made.'\" Motor Vehicle Mfrs. Ass'n, 463 U.S. at 43 (citation omitted). As such, it is arbitrary and capricious and must be set aside. Id.\n\nFinally, we hold that EPA's decision is arbitrary and capricious on one significant, additional ground. We believe that EPA, in failing to consider the significance of the evidence of ongoing WQS violations, has not only rendered a decision that \"runs counter to the evidence,\" but has \"entirely failed to consider an important aspect of the problem.\" Id. We consider this the principal flaw in the agency's decision-making rationale.\n\nIt cannot be doubted that ongoing violations of federally approved water quality standards constitute \"an important aspect\" of the decision whether to permit an additional source of pollution on a waterway. Adherence to EPA's treatment of the facts and law of this case would fatally undermine the federal water pollution control strategy engineered by the Clean Water Act and enhanced by Oklahoma law. As we have seen, the \"first principle of the [CWA] is . . . that it is unlawful to pollute at all. . . . The foremost national goal enunciated by Congress is the complete elimination of the discharge of pollutants.\" Natural Resources Defense Council v. EPA, 261 U.S. App. D.C. 372, 822 F.2d 104, 123 (D.C. Cir. 1987) (referring to 33 U.S.C. § 1251(a)(1); see also § 1251(a)(6)).\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nThe CWA further declares that it is the \"primary responsibilit[y] . . . of States to prevent, reduce and eliminate pollution.\" § 1251(b). In at least one court's opinion, the \"language of the Act indicates that striving for the utter abolition of pollution is an acceptable approach for states to take.\" Union Oil Co., 813 F.2d at 1487 n. 6. Oklahoma dutifully heeds the Act's mandate. Its water pollution control policies and requirements call for: \"protect[ing], maintain[ing] and improv[ing] the quality\" of the waters of the state, Okla. Stat. tit. 82, § 926.2; employing the permitting system \"to prevent, control or abate pollution,\" id. § 926.3.10; classifying state waters \"for the purpose of progressively improving the[ir] quality\" and \"upgrading them from time to time by reclassifying them,\" id. § 926.6.A.; and allowing \"no degradation\" of the state's scenic rivers, OWQS § 3. Common sense dictates that a pollution control strategy designed to prevent, abate, and eliminate pollution would be subverted by allowing a new source of pollution on a currently polluted watercourse.\n\nThis judgment is corroborated by the Supreme Court's pronouncements concerning the legislative purposes behind the CWA. After painstaking review of the Act's legislative history, the Court declared that \"Congress' intent . . . was clearly to establish an all-encompassing program of water pollution regulation,\" and that the \"'major purpose' of the [CWA] Amendments was 'to establish a comprehensive long-range policy for the elimination of water pollution.'\" Milwaukee v. Illinois, 451 U.S. at 318 (citation omitted; emphasis in original); see also Ouellette, 479 U.S. at 489. The Court explained that before it was amended in 1972 and 1977 the Clean Water Act relied solely on water quality standards to control and reduce pollution. But that system \"proved ineffective. The problems stemmed from the character of the standards themselves, which focused on the tolerable effects rather than the preventable causes of water pollution . . . .\" State Water Resources Control Bd., 426 U.S. at 202 (emphasis added). The Court described the effect of the amendments:\n\n[The 1972] Amendments introduced two major changes . . . . First, the Amendments are aimed at achieving maximum \"effluent limitations\" on \"point sources,\" as well as achieving acceptable water quality standards. . . .\n\nSecond, the Amendments establish the National Pollutant Discharge Elimination System (NPDES) as a means of achieving and enforcing the effluent limitations. . . .\n\nWater quality standards are retained [in the amended Act] as a supplementary basis for effluent limitations . . . so that numerous point sources, despite individual compliance with effluent limitations, may be further regulated to prevent water quality from falling below acceptable levels. . . .\n\nId. at 204-05 \u0026 n. 12 (emphasis added).\n\nWater quality standards could still be said to \"focus on the tolerable effects of water pollution,\" but the focus of the NPDES program clearly is the \"preventable causes\" of pollution. As the passage quoted above reveals, even licensed polluters in compliance with their permit limitations may be further regulated if necessary to ensure that water quality standards are achieved and maintained. This authority to regulate, along with the absence of any right to pollute, necessarily subsumes the authority to deny a requested permit. These powers are essential to the ability to prevent pollution and thereby accomplish the Act's ultimate goal of eliminating pollutant discharges to water.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nEPA and the Arkansas parties urge that the Fayetteville discharge should be permitted because its individual impact on Illinois River water quality will not be detectable. While this may prove true (and we pass no judgment thereon), we reject the argument because of its unavoidable result.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e If we were to accept this logic, once water quality standards in a stream were violated, additional new discharges might be permitted indefinitely so long as each one would have an unmeasurable individual impact. The absurdity of such a policy is manifest.\n\nCongress cannot reasonably be presumed to have intended to exclude from the CWA's \"all-encompassing program,\" 451 U.S. at 318, a permitting decision arising in circumstances such as those of this case. It is even more unfathomable that Congress fashioned a \" comprehensive. . . policy for the elimination of water pollution,\" id., which sanctions continued pollution once minimum water quality standards have been transgressed.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e More likely, Congress simply never contemplated that EPA or a state would consider it permissible to authorize further pollution under such circumstances.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e We will not ascribe t the Act either the gaping loophole or the irrational purpose necessary to uphold EPA's action in this case.\n\nWe agree there must be an initial, detectable change in the water quality of a particular body of water for that water to qualify as \"degraded.\"\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e However, in circumstances such as those extant here, we reject any notion that, once water quality standards have been violated (i.e., the quality of the receiving waters has been degraded), the incremental impact of a proposed additional discharge must itself be detectable. Nor is it necessary to demonstrate that the proposed discharge would necessarily increase the frequency of violations. Contra Decision on Remand, R., A-33, at 19 (\"no credible evidence to suggest that the frequency of [dissolved oxygen] violations would increase due solely to [Fayetteville's] discharge\"). Rather, if a body of water is experiencing WQS violations and a proposed new source would discharge the same pollutants to which those standards apply, that source may not be permitted if its effluent will reach the degr0aded waters. Here, Fayetteville's effluent contains phosphorus and nitrogen, each of which impacts several Illinois River water quality criteria -- nutrients, turbidity, dissolved oxygen, aesthetics. Violations of at least two of these criteria are already occurring. See supra part III.B.2.a. Fayetteville's effluent will be carried downstream to the scenic river. At worst, it will increase the frequency and severity of ongoig violations; at best, it will thwart efforts to bring the river back into compliance with the applicable standards. These factors are sufficient to deny the permit.\n\nWe find additional support for our holding in a remedy provided by the Act, which is specific to violations of the permit conditions of publicly owned treatment works such as Fayetteville's plant. Section § 402(h) of the CWA, 33 U.S.C. § 1342(h), provides for \"restrict[ing] or prohibit[ing] the introduction of any pollutant into [a publicly owned treatment works that has violated a condition of its discharge permit] by a source not utilizing such treatment works prior to the finding that such condition was violated.\" According to the D.C. Circuit, this provision authorizes the imposition of a \"prospective [sewer] hook-up moratorium.\" Montgomery Envtl. Coalition, 646 F.2d at 587-88. If EPA and the courts have power to establish a moratorium on additional sewer hook-ups to an existing plant in order to clean up the plant's receiving waters, surely the power exists to deny a new permit in order to accomplish the same result. The \"great reliance Congress has placed on the permit process as the means of finally achieving water quality standards,\" id. at 588, would indeed be misplaced if the Act were construed to limit the permitting agency to protecting water quality via permit conditions only, and not by denying a permit altogether.\n\nThe burdensome consequences of denying a permit under these circumstances do not alter our conclusion. Congress recognized and accepted that there would be economic hardships as a result of requiring compliance with the 1972 and 1977 CWA amendments. See EPA v. National Crushed Stone Ass'n, 449 U.S. 64, 79-83, 101 S. Ct. 295, 66 L. Ed. 2d 268 (1980); Chemical Mfrs. Ass'n v. EPA, 870 F.2d 177, 252 (5th Cir. 1989) (it is \"Congress' judgment that society must bear such costs [e.g., plant closings and job losses] as the price of achieving the long-term benefits of eliminating pollutants from our nation's waters\"). Thus, while it is arguably unfair to \"punish\" Fayetteville for preexisting dischargers' past failure to comply with WQS -- and for enforcement agencies' failure to take action against those dischargers -- such a result is not foreclosed by the Act. Indeed, there is no statutory justification for limiting EPA in these circumstances to taking action against the past violators. See United States v. Earth Sciences, Inc., 599 F.2d 368, 376 (10th Cir. 1979) (\"It is plainly inconsistent with the strong enforcement policy of the Act to declare the EPA must choose between prevention of future pollution discharges and punishment of past violations. . . . [EPA] needs both sanctions.\").\n\nRecognizing EPA's \"heavy responsibility in the permit issuing process,\" the D.C. Circuit has advised the agency that a \"watchful role . . . is more appropriate than a timid disinclination to impose any technical requirement that lacks an explicit imprimatur in the statutory language.\" Montgomery Envtl. Coalition, 646 F.2d at 587; cf. 1972 U.S. Code Cong. \u0026 Admin. News at 3737 (\"Federal Government as the custodian of the navigable waters has the responsibility to control affirmatively any discharges of pollutants into the navigable waters\" (emphasis added)). We concur with that view. Here, the only aspect of exercising EPA's authority to deny an NPDES permit that \"lacks an explicit imprimatur\" in the CWA is the relevance of existing WQS violations.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e But if EPA is to serve a \"watchful role,\" as we believe it must, surely it is obligated to deny any additional pollution under circumstances such as these. We conclude EPA's express powers and obligations under the CWA necessarily subsume the power to prohibit any new discharge of pollution, regardless of the magnitude of its impact, where the existing quality of the receiving waters does not meet required standards.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nFor all the foregoing reasons, we conclude that EPA's failure to exercise its authority to deny the Fayetteville permit is arbitrary and capricious or otherwise not in accordance with law. Particularly in light of the existing pollution of the Illinois scenic river, the agency's decision is inconsistent with the language of the Clean Water Act, as interpreted in light of the legislative history, and frustrates the policy that Congress sought to implement. See National Wildlife Federation v. Gorsuch, 693 F.2d at 171 (citing Democratic Senatorial Campaign Comm., 454 U.S. at 32). Accordingly, \"no amount of deference can save\" it. Id. Given this conclusion, we do not reach the remaining issues raised by the parties.\n\nWe are not unmindful that our opinion may lead the parties to this permit action to consider what recourse may be available to them. We note, first of all, that our opinion in no way affects Fayetteville's right to discharge treated effluent, in accordance with the terms of its permit, to the White River in Arkansas. Beyond that, we note that the Clean Water Act provides a wide array of enforcement options, one or more of which may be available in these circumstances to force improvement of Illinois River water quality and enable compliance with Oklahoma's standards. See, e.g., 33 U.S.C. §§ 1319, 1365. Moreover, as the parties debated in their briefs and at the administrative hearing, technological alternatives to the Illinois River discharge do exist. Having said this, however, we offer no judgment as to the availability, applicability, or efficacy of any of these potential remedies or approaches.\n\nIn conclusion, we hold that the Clean Water Act requires point sources to comply with the federally approved water quality standards of affected downstream states. We further hold that where water quality standards violations are already occurring in the receiving waters, no additional point source discharge to those waters may be permitted if it would contribute to the conditions that produced the violations. Accordingly, we REVERSE EPA's decision authorizing Fayetteville's municipal treatment plant to discharge a portion of its effluent to the Illinois River basin pursuant to the terms of Permit No. AR0020010.\n\nAPPENDIX\n\nWQS § 5, Beneficial Use Limitations, provides in full:\n\nAll streams and bodies of water designated as (a) are protected by prohibition of any new point source discharge of wastes or increased load from an existing point source except under conditions described in Section 3.\n\nAll streams designated by the State as \"scenic river areas,\" and such tributaries of those streams as may be apprpriae will be so designated. Best management practices for control of nonpoint source discharges should be initiated when feasible.\n\nOWQS § 3, Anti-Degradation Policy, provides in full:\n\nThe intent of the Anti-degradation Policy is to protect all waters of the State from quality degradation. Existing instream water uses shall be maintained and protected. No further water quality degradation which would interfere with or become injurious to existing instream water uses shall be allowed. Oklahoma's waters constitute a valuable State resource and shall be protected, maintained and improved for the benefit of all the citizens.\n\nIt is recognized that certain waters of the State possess an existing water quality which exceeds those levels necessary to support propagation of fish, shellfish, wildlife, and recreation in and on the water. These high quality waters shall be maintained and protected unless the State decides, after full satisfaction of the intergovernmental coordination, and public participation provisions of the State's continuing planning process, to allow lower water quality as a result of necessary and justifiable economic or social development. Furthermore, where limited degradation is justified, the State shall require that any new point source of pollution or increased load from an existing point source, protect all existing and attainable beneficial uses through the highest statutory and regulatory requirements, and feasible management or regulatory programs pursuant to Section 208 of Public Law 92-500 as amended by PL 95-217 for nonpoint sources.\n\nNo degradation shall be allowed in high quality waters which constitute an outstanding resource or in waters of exceptional recreational or ecological significance. These include water bodies located in National and State parks, Wildlife Refuges, and those designated \"Scenic Rivers\" in Appendix A.\n\nAs the quality of Oklahoma waters improves, o degradation of such improved waters shall be allowed. When the yearly mean standard for a specific parameter decreases to the point where the goals listed in Appendix E become attainable, degradation will be prohibited by incorporating the goal as a standard.\n\nIn those cases where potential water quality impairment associated with a thermal discharge is involved, the anti-degradation policy and implementation method shall be consistent with Section 316 of Public Law 92-500 as amended by PL 95-217.\n\n\u003cspan class=\"fn\"\u003e* The Honorable Frank G. Theis, Senior United States District Judge for the District of Kansas, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. 33 U.S.C. § 1251(d) provides: \"Except as otherwise expressly provided in this chapter, the Administrator of the Environmental Protection Agency . . . shall administer this chapter.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Arkansas also attempted to raise the Clean Water Act interpretation issue in another forum. In September 1988 it moved for leave to file a complaint against Oklahoma in the Supreme Court, invoking the Court's original jurisdiction under Article III, section 2, of the Constitution. The United States opposed the motion, arguing (according to Arkansas) that the statutory question could more appropriately be resolved in the context of judicial review of the issuance of Fayetteville's permit. Arkansas Reply Brief at 11 n. 18; EPA Brief at 10. The Supreme Court denied Arkansas's motion. Arkansas v. Oklahoma, 488 U.S. 1000, 109 S. Ct. 776, 102 L. Ed. 2d 769 (1989). Arkansas now argues that \"it cannot rely to its detriment on such 'assurances' from the EPA in this case for the same reason it could not rely on the United States' 'assurances' in [ Arkansas v. Oklahoma ].\" Arkansas Reply Brief at 11 n. 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Moreover, we could reach the statutory construction issue -- a legal question -- even if we were to decide Arkansas lacked standing to raise it. Whether EPA acted within its statutory authority is subject to our review under 5 U.S.C. § 706(2)(A). Thus, we reject any suggestion by EPA that, if Arkansas lacks standing, this court lacks jurisdiction to decide the statutory issue on the merits. See EPA Brief at 14 n. 8, 15. For similar reasons we reject EPA's a rgument that Arkansas's claim is not ripe for review. EPA Brief at 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Moreover, Arkansas presented inconsistent arguments in the remand proceeding, claiming first that the 1982, not the 1985, Oklahoma WQS should apply, but then arguing that Oklahoma's Beneficial Use Limitations specifically cannot apply to a discharge located in Arkansas. See Decision on Remand, R, A-33, at 2-3; Supplemental Joint Briefs submitted by Arkansas Parties, R., B-144 at 7-8, 25-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We reformulate the issue to reflect more accurately the facts and legal context of this case. Section 303 of the CWA, 33 U.S.C. § 1313, requires periodic review by states of their WQS and provides for EPA approval of any modified WQS as long as such standard \"meets the requirements\" of the CWA. § 1313(c)(3). Once approved, \"such standard shall thereafter be the water quality standard for the applicable waters of that State.\" Id. EPA is required to promulgate revised WQS for any state that fails to adopt WQS consistent with CWA requirements and in any case where EPA determines that a revised or new standard is necessary to meet the requirements of the Act. § 1313(c)(4). The Fayetteville plant has been required by EPA to observe federal law, i.e., Oklahoma's EPA-approved water quality standards. See Order on Petitions for Review, R., A-28, at 11 n. 13. Thus, it is misleading to say \"Oklahoma . . . impose[d its ] water quality standards\" on Arkansas, or that Oklahoma has the \"right to block\" a permit issued by Arkansas. See, e.g., Arkansas's Brief at 33, 36, 38-40. The 1982 Oklahoma water quality standards, which EPA judged applicable to the Fayetteville plant, had been approved by EPA. Whether Fayetteville might also be subject to observing Oklahoma state standards that have not received EPA approval is not an issue in this case, and we do not address it. Accordingly, throughout this opinion we use \"applicable water quality standards\" to mean EPA-approved water quality standards that govern the affected waters, and \"Oklahoma water quality standards\" to mean Oklahoma's EPA-approved water quality regulations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This statement requires a brief explanation of a recent Fourth Circuit case. In Champion Int'l Corp. v. EPA, 648 F. Supp. 1390 (W.D.N.C. 1986), motion for withdrawal of mandate denied, 652 F. Supp. 1398 (W.D.N.C. 1987), the district court upheld EPA's assumption of permitting authority under 33 U.S.C. § 1342(d)(4) after EPA objected when North Carolina proposed to permit a discharge in North Carolina without regard for Tennessee water quality standards. The court held that a discharge permit must ensure compliance with the requirements of the CWA, and that EPA reasonably could have concluded that the North Carolina permit, in disregarding the Tennessee water quality standard for color, would not ensure such compliance. 648 F. Supp. at 1394-99. Upon reconsideration in light of an intervening Supreme Court case, however, the district court offered the following limiting statement: \"Nothing in the regulatory framework surrounding the CWA would automatically require that a source state comply with the water quality standards of every downstream state.\" 652 F. Supp. at 1400. Subsequently, the district court's judgment was vacated by the Fourth Circuit with instructions to dismiss for lack of subject matter jurisdiction. Champion Int'l Corp. v. EPA, 850 F.2d 182 (1988). The circuit court prefaced and postscripted its decision by expressing its general agreement with \"much of the district court's opinion.\" 850 F.2d at 183, 190. It also stated that \"EPA's act in assuming the permit issuing authority was consistent with statute and regulation, and the objections it made to the North Carolina permit do not seem to be out of bounds.\" Id. at 187. However, the appellate court ultimately concluded: The actions of EPA . . . at this stage of the NPDES proceeding are not now subject to judicial review. EPA has neither granted nor denied a permit, so such action is not yet reviewable under [33 U.S.C.] § 1369(b)(1). The nature of EPA's objections are well within the contemplation of those it is entitled to make under applicable regulations. 40 C.F.R. § 123.44(c). Whatever may be the result should EPA make an objection completely without its delegated authority, so as to subject that action to present judicial review under Leedom v. Kyne, [ 358 U.S. 184, 3 L. Ed. 2d 210, 79 S. Ct. 180 (1958)], we have no occasion to consider, for such objections have not been made here. 850 F.2d at 190. The court stated that the district court \"properly retained jurisdiction of the case in order to ascertain whether or not EPA acted within its delegated authority,\" and agreed with the district court's decision that EPA was so acting. But it held that, once the district court made that determination, it should have dismissed for want of subject matter jurisdiction and not reached the merits. Id. Champion 's holding is limited to the narrow determination that EPA had not acted \"clearly beyond the boundaries of its authority.\" Id. at 186. Indeed, the court added: \"Even if EPA may ultimately be shown to be incorrect in its objections to North Carolina's permit (and we do not intimate that they are), its acts are not so clearly outside its authority to subject them to immediate judicial review. . . .\" Id. at 187. Thus, Champion does not decide the merits of the question we face, i.e., whether the CWA requires that an NPDES permit ensure compliance with an affected downstream state's water quality standards. One other case deserves brief mention here. In Montgomery Envtl. Coalition, the D.C. Circuit stated: \"A state whose water quality will be affected by the issuance of a permit for discharge in another state may block that permit until conditions are imposed insuring compliance with applicable water quality requirements of the objecting state.\" 646 F.2d at 594 n. 21. But in the next breath the court acknowledged this was not an issue in Montgomery ; thus, the language is dictum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Under the 1972 CWA amendments, water quality standards are considered \"supplementary control measures\" -- \"supplementary\" in the sense that they are in addition to point source effluent limitations, the control measure upon which the 1972 CWA Amendments primarily rely to achieve the Act's objective of eliminating pollutant discharges into navigable waters by 1985. State Water Resources Control Bd., 426 U.S. at 203-05 \u0026 n. 12 (\"water quality standards are retained as a supplementary basis for effluent limitations . . . so that numerous point sources, despite individual compliance with effluent limitations, may be further regulated to prevent water quality from falling below acceptable levels\"). See 33 U.S.C. §§ 1251(a)(1), 1311(b)(1)(A); see also S. Rep. No. 414, reprinted in 1972 U.S. Code Cong. \u0026 Admin. News 3668, 3675 (\"Under this Act the basis of pollution prevention and elimination will be . . . effluent limitations. Water quality will be a measure of program effectiveness and performance, not a means of elimination and enforcement.\"). That WQS are \"supplementary\" in the scheme of the Clean Water Act is, however, irrelevant to the question of their applicability across state lines.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. 33 U.S.C. § 1370 provides: Except as expressly provided in this chapter, nothing in this chapter shall (1) preclude or deny the right of any State or political subdivision thereof or interstate agency to adopt or enforce (A) any standard or limitation respecting discharges of pollutants, or (B) any requirement respecting control or abatement of pollution; except that if an effluent limitation, or other limitation, effluent standard, prohibition, pretreatment standard, or standard of performance is in effect under this chapter, such State or political subdivision or interstate agency may not adopt or enforce any effluent limitation, or other limitation, effluent standard, prohibition, pretreatment standard, or standard of performance which is less stringent than the effluent limitation, or other limitation, effluent standard, prohibition, pretreatment standard, or standard of performance under this chapter; or (2) be construed as impairing or in any manner affecting any right or jurisdiction of the States with respect to the waters (including boundary waters) of such States.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We do not suggest one state may directly regulate the conduct of a discharger in another state. Such exercise of jurisdiction would exceed traditional bounds of sovereignty. Nor does the Act redefine those bounds to allow dual permitting. See Ouellette, 479 U.S. at 491. But the question posed here is whether federal law embodied in the Clean Water Act requires a discharge permit to ensure compliance with the applicable WQS of all affected states. Traditional concepts of state powers and the § 1370 savings clause cannot provide the answer to that question. We must look to the CWA as a whole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The agency contends that its reulations and the legislative history manifest an intent to distribute the burden of meeting water quality standards among all dischargers on and affecting a particular waterway. See PA Brief at 22 \u0026 n. 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In its bill amending section 402 of the Act in 1977 to authorize EPA to issue an NPDES permit where it determines a state-issued permit is inadequate, the Senate committee stated: \"EPA has been much too hesitant to take any actions where States have approved permit programs. The result might wel be the creation of 'pollution havens' in some of hose States which have approved permit programs. This result is exactly what the 1972 amendments were designed to avoid.\" S. Rep. No. 370, 95th Cong. 1st Sess. at 73, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News 4326, 4398. EPA argues reasonably that Arkansas's interpretation would encourage sources to locate in states with less stringent water quality requirements. A source located immediately above a state boundary would not be required to meet the more stringent requirements, if any, of the downstream state, even though that state may be most affected by the discharge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See part III.B. of this opinion for a discussion of the significance in the permitting context of preexisting WQS violations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Both EPA judicial officers here referred to this distinction in discussing what water quality standards are \"applicable\" or \"enforceable\" for purposes of NPDES permitting. Order Denying Review, R., A-3, at 7; Order on Petitions for Review, R., A-28, at 11-12 n. 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Subpart B of these rules deals specifically with determining the effect of proposed discharges on other states.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Arkansas refers erroneously to the section as 33 U.S.C § 1342(a)(1). Arkansas Brief at 34 n. 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See supra note 5 for a brief discussion of § 303 of the CWA, 33 U.S.C. § 1313.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. EPA may also withdraw approval of a state permit program if EPA determines the state is not administering its program in accordance with CWA requisites. 33 U.S.C. § 1342(c)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. EPA's regulations elaborate on these two grounds, enumerating seven possible bases for an EPA objection to a state-issued permit. 40 C.F.R. § 123.44(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Section 1342(d)(3), the paragraph immediately following the veto provision, states: \"The [EPA] Administrator may, as to any permit application, waive paragraph (2) of this subsection.\" The discretionary language of this paragraph initially gave us pause, especially in light of the mandatory tone of paragraph (2) (\"No permit shall issue\" if the Administrator objects). After careful study of the statute and the legislative history, however, we believe the legislative history reveals that EPA's discretion arises only with respect to its authority to choose to review or not review a permit application of which it is notified by a permit-issuing state pursuant to § 1342(d)(1). See Mianus River Preservation Comm. v. Administrator, EPA, 541 F.2d 899, 907-09 (2d Cir. 1976) (discussing legislative history of § 402 of the CWA). Such discretion is consistent with congressional intent to allow EPA-approved, qualified states to administer their own permit programs. An implicit component of this discretion, once exercised, is EPA's authority to determine the impact of a proposed discharge nd whether that impact is acceptable under the CWA. Once EPA chooses to review a permit application and proposed permit under this section, we do not believe it has \"discretion\" to overlook any violation of the CWA revealed by its review. f. § 1342(c)(3) (if EPA determines a state permit program is not being administered in accordance with § 1342, it \" shall withdraw approval of such program\" (emphasis added)); § 1313(c)(4) (EPA \" shall promulgate\" new or revised WQS where necessary to meet CWA requirements or where state has promulgated inaequate standard); contra Mianus River, 541 F.2d at 909 \u0026 n. 24. Interpreting § 1342(d)(3) otherwise (i.e., as making all of the provisions of § 1342(d)(2) discretionary) is inconsistent with the spirit and framework of the CWA and with the express prohibition against discharging any pollutant except in compliance with the Act. 33 U.S.C. § 1311(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Section 1342(b)(5) provides: The Administrator shall approve each such submitted [permit] program unless he determines that adequate authority does not exist . . . [t]o insure that any State (other than the permitting State), whose waters may be affected by the issuance of a permit may submit written recommendations to the permitting State (and the Administrator) with respect to any permit application and, if any part of such written recommendations are not accepted by the permitting State, that the permitting State will notify such affected State (and the Administrator) in writing of its failure to so accept such recommendations together with its reasons for so doing[.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. As EPA argues and we have already discussed, the requirement of compliance with state water quality standards arises from § 1311. Thus, via § 1342(b)(1)(A)'s requirement of compliance with § 1311, permits issued by states must ensure compliance with all applicable WQS.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In other words, industry proposed an \"upset\" defense for exceeding water quality-based effluent limitations, so long as the actual quality of the receiving waters did not fall below established WQS.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. EPA has held this view consistently since at least 1979. 44 Fed. Reg. 32,854, 32,863 (1979) (\"violations of . . . water quality based effluent limitations are not subject to a defense of upset\"); see also Student Pub. Interest Research Group v. P.D. Oil \u0026 Chem. Storage, Inc., 627 F. Supp. 1074, 1086 (D.N.J. 1986); Union Oil, 813 F.2d at 1489.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The 1977 amendments added a \"waiver\" provision in section 301 of the Act (33 U.S.C. § 1311(g)) allowing for use of \"best practicable technology\" instead of \"best available technology\" if 1983 water quality standards could be met thereby. The Senate committee explained that this allowancewas being made to avoid \"[effluent] treatment for the sake of treatment.\" S. Rep. No. 370, 95th Cong., 1st Sess. at 43-44, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News 4326, 4368. To qualify forthe waiver, the amended statute requires compliance with certain conditions, including attainment or maintenance of a high standard of water quality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. 33 U.S.C. § 1311(m) provides another example of Congress's willingness to relax statutory effluent limitations as long as compliance with WQS is assured. This statute governs industrial discharges into \"deep waters of the territorial seas.\" Subsection (m)(1) provides for issuing, under certain unique circumstances, permits containing \"modified\" effluent limitations (i.e., less stringent limits than otherwise required), provided that effluent limitations established in such permits are \"sufficient to implementthe applicable State water quality standards.\" § (m)(2). The statute further provides that EPA may terminate such a permit if it subsequently determines there has been a \"decline in ambient water quality of the receiving waters . . . even if a direct cause and effect relationship cannot be shown,\" but that EPA shall terminate such a permit if the effluent from the source \" is contributing to a decline in ambient water quality of the receiving waters.\" § (m)(4) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In addition, states are required to identify waters for which the effluent limitations established pursuant to § 1311 are \"not stringent enough to implement any water quality standard applicable to such waters,\" 33 U.S.C. § 1313(d)(1)(A), and to establish the acceptable \"total maximum daily load\" for pollutants in those waters, § 1313(d)(1)(C). Eventually, the states are required to establish total maximum daily loads for all waters. § 1313(d)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Section 302 of the conference substitute bill, which was ultimately enacted, was identical to the Senate provision discussed above with one exception: The conference committee eliminated the Senate bill's grant of authority to the states. In the statute as enacted (33 U.S.C. § 1312), authority to impose additional effluent limitations is vested solely in EPA. 1972 U.S. Code Cong. \u0026 Admin. News at 3799.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Throughout this and the prior section of our opinion, we use \"applicable water quality standards\" to refer to those federally approved water quality requirements of affected states with which a proposed discharge must comply. See supra note 5. In this section, we refine the scope of the term to denote federally approved water quality requirements that are relevant to the physical and chemical makeup of a proposed source's effluent. For example, Oklahoma's nutrients standard is relevant to the Fayetteville plant because the plant discharges phosphorus and nitrogen, but the temperature standard is irrelevant because, presumably, any impact that the plant's effluent might have on the temperature of water in the river would be so attenuated at the state line as to be undetectable. For the sake of convenience, we often refer simply to \"Oklahoma water quality standards,\" or \"WQS,\" but in each instance it is implied that those standards have been approved by EPA. We draw no conclusions about state requirements that may not have been approved by EPA.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Water quality standards are promulgated by the Oklahoma Water Resources Board pursuant to Okla. Stat. tit. 82 § 926.3.6. Appendix A of the standards lists the following beneficial uses, inter alia, for the Illinois River, including Lake Frances, and Tenkiller Reservoir below the scenic river: \"public and private water supply,\" \"fish and wildlife propagation\" (primary warmwater fishery), \"agriculture\" (Class I irrigation), \"primary and secondary recreation,\" \"aesthetics,\" and \"smallmouth bass.\" See OWQS § 4 \u0026 App. A. Recall that Oklahoma WQS have been approved by EPA. The paticular standards applicable to the Fayetteville permit are those adopted in 1982. Second Order on Petitions for Review, R., A-37, at 5-6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In oversimplified terms, phosphorus and nitrogen are nutrients which, when added to an aquatic system, stimulate the growth of aquatic plants and other organisms, eventually altering biological characteristics of the system, such as species populations, biomass, and species abundance and diversity, as well as physical and chemical parameters, such as temperature, turbidity, color, and dissolved oxygen. In part B.2.c. of this discussion, we cite evidence in the record relating to the composition of Fayetteville's effluent and compliance with these criteria.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. \"Eutrophication (natural)\" is defined: The normally slow aging process by which a lake evolves into a bog or marsh and ultimately assumes a terrestrial state. During eutrophication the lake becomes so rich in nutritive compounds (especially nitrogen and phosphorus) that algae and other microscopic plant life become superabundant, thereby \"choking\" the lake, and causing the lake to advance in several stages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The text of OWQS §§ 3 and 5 is included as an appendix to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The Oklahoma Attorney General has issued an opinion, however, addressing the question: May the Oklahoma Water Resources Board (OWRB) adopt an antidegradation policy that allows for lower water quality or limited degradation of certain waters? Opinion No. 84-124 (Dec. 28, 1984). The Attorney General acknowledged the federal antidegradation regulation, which provides for lowering water quality in certain limited circumstances, but observed that federal law was meant to set minimum standards. He then set forth the Oklahoma Legislature's intent that state waters were to be classified \"for the purpose of progressively improving the quality . . . and upgrading them from time to time by reclassifying them,\" Okla. Stat. tit. 82, § 926.6(A), and that it was state policy to \"protect, maintain, and improve the quality [of the waters of the state],\" id. § 926.2. He concluded: It is clearly the intent of the Legislature that the quality of state waters be progressively improved and not be allowed to be degraded. Oklahoma law does not set forth any exceptions. . . . . It is, therefore, the official opinion of the Attorney General that . . . the [OWRB] may not adopt a statewide antidegradation policy which allows for lower water quality or limited degradation of certain waters. Thus, it is the expressed view of the Oklahoma executive department that Oklahoma law does not allow even the limited degradation authorized by the federal regulation. OWQS § 3, however, suggests a contrary position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. EPA regulations mandate that all states adopt and implement an antidegradation policy meeting minimum federal requirements. 40 C.F.R. §§ 131.6(d), 131.12. Oklahoma's policy is very similar to the EPA rule; one difference is that Oklahoma specifies scenic rivers for protection from any degradation. Cf. § 131.12(3). Both the federal and state rules establish three levels of protection for state waters. Under level 1, existing instream water uses must be maintained and protected in all streams. Compare 40 C.F.R. § 131.12(1) with OWQS § 3, para. 1. The Oklahoma rule adds that this level of protection prohibits any \"further degradation which would interfere with or become injurious to existing instream water uses\" and that \"Oklahoma's waters . . . shall be . . . improved.\" Under level 2, \"limited degradation\" may be allowed in certain \"high quality waters\" whose \"water quality . . . exceeds those levels necessary to support propagation of fish, shellfish, wildlife, and recreation.\" Compare OWQS § 3, para. 2 with 40 C.F.R. § 131.12(2). However, the state must first decide, after fully satisfying state planning requirements, that \"necessary and justifiable economic or social development\" necessitates this degradation. OWQS § 3, para. 2; cf. § 131.12(2). Moreover, in allowing such degradation, the state is required to \"assure that there shall be achieved the highest statutory and regulatory requirements for all new and existing point sources and all cost effective and reasonable best management practices for nonpoint source control.\" § 131.12(2) (emphasis added). (The comparable provision in the Oklahoma rule is not as clear, but under EPA regulations, it must be interpreted at least as stringently.) Finally, level 3 provides for maintaining and protecting certain exceptional, high quality waters (which in Oklahoma includes scenic rivers). Compare OWQS § 3, para. 3 with 40 C.F.R. § 131.12(3). The Oklahoma rule expressly prohibits any degradation of these waters; the prohibition in EPA's regulation is implicit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. For example, assume the turbidity in Lake Frances is 20 NTUs. If the Upper Illinois River (including Lake Frances) were not designated (a) as well as a scenic river, it would be permissible to allow the lake's turbidity to increase to 25 NTUs, the criterion applicable to \"Warm Water Lakes\" in OWQS § 4.10(b). (The Illinois scenic river is designated a warm water fishery in Appendix A.) Because the lake is part of a scenic river, however, the Beneficial Use Limitations apply. In conjunction with the Anti-Degradation Policy, it prohibits any human-caused, detectable change in te turbidity conditions extant at the time of the scenic river designation. Thus, if the turbidity of the lake in 1970 did not exceed 15 NTUs, human activities may not cause it to exceed that level.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. \"Pollution\" is defined as: Contamination or other alteration of the physical, chemical or biological properties of any natural waters of the state, or such discharge of any liquid, gaseous or solid substance into any waters of the state as will or is likely to create a nuisance or render such waters harmful or detrimental or injurious to public health, safety or welfare, or to . . . legitimate beneficial uses, or to livestock, wild animals, birds, fish or other aquatic life. Okla. Stat. tit. 82 § 926.1.1., quoted in Decision on Remand at 5. The ALJ consulted the statutory definition of \"pollution\" because the 1985 version of the Beneficial Use Limitations does not define its term \"pollutant loading.\" See our discussion of this compound error in the text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The ALJ's interpretation of the Beneficial Use Limitations is also inconsistent with an earlier position taken by the EPA with respect to permitting additional discharges in the Illinois River Basin. The record contains a letter, dated Oct. 1, 1986, from Lawrence Edmison, Director, Oklahoma Department of Pollution Control, to Kenton Kirkpatrick, Deputy Director, Water Management Division, EPA-Region 6. Mr. Edmison was writing to confirm a conversation with Mr. Kirkpatrick in which they apparently reached an \"understanding that Tahlequah's discharge must not increase loading on the Illinois River.\" Addendum to R., OK-4 (emphasis in original). The discussion and letter were precipitated by a debate concerning how the Illinois River's (a) designation affected proposed revisions to the effluent limits in the city of Tahlequah's wastewater treatment plant permit, given that the plant is located a short distance upstream from the Illinois on a tributary not designated (a). An earlier memorandum to Mr. Edmison from Quang Pham, an Oklahoma State Department of Health employee, stated that, because Tahlequah was located on a tributary of an (a) stream, \"EPA indicated that no load increase could be allowed for Tahlequah.\" Addendum to R., OK-4 (emphasis added). This memo also referenced a recent EPA study \"on eutrophication of Illinois River [that] indicated that phosphorus plays a major role in the stimulation of algae growth in the river.\" Id. at 2. These documents reflect a significantly different understanding of Oklahoma's Anti-Degradation Policy and Beneficial Use Limitation than that adopted by the ALJ and approved by the CJO in this permit proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The CJO ruled the error harmless because, in his view, the 1985 and 1982 standards do not differ materially. Second Order on Petitions for Review, R., A-37, at 6. However, the CJO did not specifically consider the difference between the two versions of the Beneficial Use Limitation and how that discrepancy may have affected the ALJ's conclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. This issue has apparently never before been addressed by a federal court, and it was only touched upon at the administrative hearing. For example, the State of Oklahoma offered evidence (visual slides with accompanying narrative testimony), the stated prpose of which(according to counsel) was to \"show that the Illinois River is already in a degraded state and cannot assimilate any more effluent\" and that \"the Illinois River has already exceeded [its] assimilative capacity.\" Tr. at 72, 76. An objection to part of this testimony was overruled, Tr. at 76, although the ALJ indicated he had \"serious problems with the utility of these slides,\" id. at 72. Later in the hearing, in response to an objection that EPA official Larry Champagne's testimony concerning the history of the Fayetteville permit issuance process was irrelevant, an Oklahoma attorney argued that testimony was \"relevant to . . . the issue of whether or not there is degradation\" of the Illinois River. Again, the ALJ expressed doubt, but allowed the testimony. Tr. at 154-55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. It might be considered surprising that the record contains sufficient evidence from which to infer that Illinois River water quality is already degraded, given that the parties did not recognize the real significance of this issue. We suspect the evidence was offered largely to show the potential for water quality deterioration due to Fayetteville. Because pollutants in the Illinois River at the Arkansas-Oklahoma border (see discussion in subart b. below) originate from upstream, i.e., Arkansas, pollution sources, it logically follows that a new Arkansas source (at a distance upstream comparable to that of existing sources) poses a risk of increasing the pollutant load at the state line. There is considerable evidence that the principal point sources of pollution to the Upper Illinois River above Lake Frances are the municipal wastewater treatment plants at Rogers and Springdale, Arkansas. E.g., Gakstatter \u0026 Katko, An Intensive Survey of the Illinois River (Arkansas and Oklahoma) in August 1985 (\"Gakstatter Report\"), Addendum to Oklahoma Brief, at 3, 5, 77; Tr. at 360-61. The Rogers and Springdale plants are 41.5 and 39.5 miles, respectively, upstream from the state line at Lake Frances. Gakstatter Report at 11-13. These distances are nearly identical to Fayetteville's distance (39 miles) from that point. At least on the basis of distance, it is not unreasonable to expect that Fayetteville's effluent will also reach the Oklahoma portion of the Illinois River.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The so-called \"Clean Lakes\" reports are prepared by states pursuant to the requirement therefor in section 314 of the Act, 33 U.S.C. § 1324. Subparagraph (a)(1) of the statute specifically requires that lakes be classified according to \"eutrophic condition.\" The remarks in the Senate Report concerning reauthorization of this section in 1977 are of considerable interest: The 1972 act recognized the urgent need for a lake improvement program to restore the significant number of the Nation's 95,000 freshwater lakes that were in eutrophic and deteriorated conditions. The clean lakes program was conceived to respond to this problem. . . . In the 5 years since Public Law 92-500 went into effect, lake restoration programs essentially have not even begun. . . . The committee hearing record clearly demonstrates that there is a great interest in lake areas in the restoration and preservation of degraded freshwater lakes. . . . . . . . . . . The committee believes this authorization represents a level of effort that reflects the expectations of the Congress for this program, recognizing that the problem of lake eutrophication and deterioration nationwide far exceeds even this authorization level. The committee is hopeful that the new administration will act to make lake restoration a key element of the EPA's water pollution control program contrary to the EPA's implementation of this section to date. S. Rep. No. 370 at 69-70, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News at 4394-95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Section 305(b) of the Clean Water Act, 33 U.S.C. § 1315(b), requires the states to submit to Congress biennial reports on the condition and quality of their surface waters.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. An Arkansas party attorney objected to the relevance of certain slides, which showed Sager and Flint creeks (both Illinois River tributaries) below Siloam Springs, Arkansas's, treatment plant. In defending against the objection, the Oklahoma attorney stated that the slides were \"relevant to show that Fayetteville should not be allowed to discharge because it will just exacerbate the existing violation of Oklahoma Water Quality Standards.\" Tr. at 76. The objection was overruled, id., although the ALJ indicated he had \"serious problems with the utility of these slides,\" id. at 72. Mr. Pigg testified to 30 years of personal experience with the Illinois River, including making \"ollecting trips\" and preparing \"hundreds of reports\" on changes in the fish population. Id. at 65, 86. He was denied the opportunity to offer an opinion, based on his experience with the river, as to whether algae in the river hadincreased during those 30 years apparently on the ground that he had not been qualified as an expert. Id. at 86-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. It should be noted that the Gakstatter study, on which the ALJ relied, see Decision on Remand, R., A-33, at 10-11, 14-15, was conducted during a two-week period of very atypical weather in August 1985. Precipitation for that month was more than three ties the normal amount, streamflow was 50% greater than the normal average, and three inches of rain fell during the survey. Gakstatter Report at 1, 23. Throughout the report the authors conceded several possible effects of these conditions -- increased turbidity due to increased surface runoff and scouring of stream sediments, decreased concentrations of chemical parameters due to dilution, and decreased incidence of periphytons (surface algae) because of high stream flow. Moreover, even though the ALJ relied on it for evidence that the Fayetteville discharge would not affect the Illinois River, the Gakstatter study supports our conclusions concerning the existing degradation of the river and the fact that Fayetteville's effluent will be carried downstream to the Illinois River in Oklahoma.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Additionally, in the circumstances of this case, evidence that such exceedances are ongoing may be required. See Gwaltney of Smithfield, Ltd. v. Chesapeake Bay Found., Inc., 484 U.S. 49, 57-59, 98 L. Ed. 2d 306, 108 S. Ct. 376 (1987) (EPA may take enforcement action against a discharger for wholly past violations of permit conditions, but a citizen suit to enforce permit conditions must be based on evidence of ongoing violations). Where a decision to deny a permit is based in part on a finding that the water quality of the receiving waters is degraded, it is reasonable to require evidence of the continuing nature of the WQS violations. Because eutrophication is not a rapid process (nor can the process by reversed rapidly), the eutrophied state of the Illinois River almost certainly persists and perhaps has worsened since the date of the most recent evidence of degradation in the record. We believe there is substantial evidence in the record to support this conclusion. Cf. Chesapeake Bay Found. v. Gwaltney of Smithfield, Ltd., 890 F.2d 690, 693-95 (4th Cir. 1989). We also point out that this case is easily distinguished from a situation in which a presumption of ongoing violations (for purposes of taking enforcement action) is premised on past violations of technology-based effluent limitations (for instance, failures of control equipment). E.g., Sierra Club v. Shell Oil Co., 817 F.2d 1169 (5th Cir.). cert. denied, 484 U.S. 985, 98 L. Ed. 2d 500, 108 S. Ct. 501 (1987). It is admittedly unreasonable to assume, on the basis of \"past, sporadic or largely unconnected permit violations,\" that a permittee is currently violating the effluent restrictions of his permit. 817 F.2d at 1173. But it is highly probable that water quality violations (e.g., eutrophication effects) that result from the cumulative impacts of the ongoing discharges of several sources will continue as long as the discharges continue. This case is an example of such a situation. Finally, we note that, even if the Illinois River's water quality has improved since the Fayetteville permit was erroneously granted (the record contains no evidence tending to suggest this), under the Oklahoma Anti-Degradation Policy no degradation of that improved quality may be allowed. OWQS § 3, para. 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Section 106(e) of the Act, 33 U.S.C. § 1256(e), requires states to conduct water quality monitoring \"including classification according to eutrophic condition\" and to annually update monitoring data and include the data in 305(b) reports in order to qualify for federal grants for pollution control programs. According to EPA, the 305(b) report is the \"primary water quality problem assessment document under the Act.\" 50 Fed. Reg. 1774, (1985) (WL pp. 22-23 of 57) (preamble to final rule, 40 C.F.R. Parts 355 and 130; § 130.8(b)); see also 40 C.F.R. § 130.8(a) (\"report serves as the primary assessment of State water quality\"). EPA's regulations state that problems identified in the 305(b) report \"should be emphasized . . . in the State's [water quality management plan] . . . under sections 106 and 205(j) of the [CWA].\" 40 C.F.R. § 130.8(a). In years in which a 305(b) report is not required, states may meet their annual 205(j) report requirement by supplementing the most recent 305(b) report with a certification that it still represents current conditions, or by updating it as necessary to reflectcurrent conditions. 40 C.F.R. § 130.8(d); see also 50 Fed. Reg. 1774, (1985) (WL p. 23 of 57).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. This crucial fact seems to have eluded the ALJ, who was aware that photosynthesis by algae produces oxygen, but obviously did not understand that respiration by algae at night consumes oxygen, as does the process of decay of organic materials in the stream. See Decision on Remand, R., A-33, at 19 (misciting the eminently qualified Dr. Walker, see R., OK-7, regarding the mechanisms by which dissolved oxygen levels are reduced, see R., OK-8, at 12-13). See also Tr. at 129 (EPA witness Bondy's testimony concerning sediment oxygen demand). The fact that algae reduce oxygen concentrations in streams (in addition to causing other problems) is recognized by Congress and EPA and has been widely acknowledged in the case law. See, e.g., Chemical Mfrs. Ass'n v. U.S. EPA, 870 F.2d 177, 218 \u0026 n. 149 (5th Cir. 1989) (Congress in amending the CWA \"specifically recognized that algae are a significant cause of water quality problems,\" i.e., that \"'algae [have] grown so rapidly that sufficient oxygen is not available to support other forms of life.'\" (quoting legislative history)). In Montgomery Envtl. Coalition v. Costle, 207 U.S. App. D.C. 233, 646 F.2d 568, 575 (D.C. Cir. 1980), a case repeatedly cited to the ALJ by the Oklahoma parties, the court described the same problem facing the Illinois River: \"Excessive nutrient levels degrade water quality both because the proliferation of algae is itself a nuisance and because algae respiration and subsequent death and decay use up oxygen dissolved in the river's waters.\" (Emphasis added.) Nevertheless, relying on evidence submitted by the Arkansas parties that Fayetteville's effluent would experience \"complete oxygen recovery\" before it enters the Illinois River, the ALJ concluded that \"it is not possible for the City's effluent to violate the Oklahoma dissolved oxygen standards.\" See Decision on Remand at 18-19. The \"re-aeration\" described by the Arkansas parties occurs as a result of turbulence in Mud Creek and possibly Clear Creek above Clear Creek's confluence with the Illinois. This essentially mechanical process takes no account of nutrients in the effluent and their impact on algae growth and, eventually, oxygen levels. The ALJ also labored under apparent misapprehensions concerning the significance of phosphorus concentrations in the river and the relation between phosphorus assimilation and eutrophication. For example, the ALJ stated: \"The assimilative processes [at low flows] is at its [sic] most effective stage and therefore removes [sic] more nutrients upon which the algae feed. . . .\" Decision on Remand at 8. The glaring error of this statement is that the uptake of nutrients by algae is itself one of the \"assimilative processes\" that is \"most effective\" at low flows. Uptake of phosphorus by algae does not reduce the potential for eutrophication, it is an initial step of the process! The ALJ also cited testimony that \"all of the phosphorus below Lake Francis [sic] would be assimilated out by the time it reached Lake Tenkiller.\" Decision on Remand at 10. The flaws in this statement are: (1) it presumes the nutrients standard does not apply to streams (which we have seen is contrary to Oklahoma law), and (2) it ignores the fact that one of the processes by which phosphorus \"assimilates out\" (i.e., which cause phosphorus concentrations in the water to decrease) is uptake by algae, which leads to eutrophication. The ALJ's erroneous conclusions may derive at least in part from the inconistent definitions of the term \"assimilation\" used by various witnesses. See, e.g., Tr. at 308-09, 319, 491, 697. (\"Assimilation\" in this context essentially refers to the uptake and removal mechanisms by which nutrients are taken out of the water -- uptake by plants and animals, animals feeding on plants, sedimentation, ec. The witnesses dsagreed, for example, as to whether assimilation includes dilution.) But the fault is not entirely the witnesses'. As explained above, the ALJ overlooked or misunderstood evidence of fundamental biological processes. He also confused \"assimilation\" with \"assimilative capacity.\" Ostensibly defining \"assimilation,\" he quoted the 1985 OWQS Appendix C definition of \"assimilative capacity\" (the \"amount of pollution a stream can receive and still maintain the W.Q.S. designated for that stream\"). Decision on Remand at 7. Yet the two terms are not interchangeable, nor did the ALJ even acknowledge the existence of two discrete terms. Moreover, as we discuss later in the text, the CJO later determined that the 1982, not the 1985, OWQS are applicable to this permit. (The 1982 definition of \"assimilative capacity\" varies somewhat from the 1985 definition.) It should be noted that the \"assimilative capacity\" of streams protected by the Beneficial Use Limitation may be very limited (given that any detectable change in a water quality parameter violates the applicable WQS for such a stream). Moreover, the term may have limited relevance to the Upper Illinois River, given that existing water quality problems in the Illinois River demonstrate that the \"assimilative capacity\" of the stream has already been surpassed. These are grave misunderstandings because the phenomena of oxygen depletion, which results from \"over-fertilization\" of a stream and the consequent increase in organic matter, and phosphorus uptakeby aquatic organisms, are intrinsic to the eutrophication process. That the ALJ did not comprehend these fundamental concepts casts doubt on his conclusions that Fayetteville's discharge would not jeopardize compliance with the applicable WQS.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. There was testimony at the hearing that future reductions are expected in the phosphorus discharges of three existing municipal treatment plants in the Upper Illinois basin. (In fact, Oklahoma asserts that it was error for EPA to consider these anticipated reductions in deciding whether to grant the Fayetteville permit. Oklahoma Brief at 18-22.) These reductions would result from the installation of new treatment facilities, but would not be mandated by the plants' permits. Phosphorus concentrations in the effluent from the new plants would be approximately 1 milligram per liter (mg/l), or about 50 percent less than previous concentrations. Initial Decision, R., A-26, at 13; R., ARK-1, at 2, 4-5. Dr. Walker testified that, even if all point sources in the basin were controlled to the 1 mg/l level, the phosphorus load to Lake Tenkiller would be reduced by only 40 percent, and that a phosphorus concentration of 1 mg/l is about forty times the concentration sufficient to produce a significant algal bloom. Tr. at 648-49; see also Prefiled testimony of Jack Gakstatter, R., B-56, at 4 (impact of existing plants \"could be substantially attenuated by phosphorus removal . . . to at least. . . 1 mg/l\"; \"benefits to Lake Frances of reducing phosphorus to at least 1 mg/l\" (emphasis added)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Issuance of Fayetteville's permit requires substantial evidence (1) that current water quality meets applicable WQS and that Fayetteville's effluent would not affect maintenance of the applicable WQS; or (2) if current water quality does not meet applicable WQS, that Fayetteville's effluent would not reach the Illinois scenic river. Instead of directly addressing whether the record contains this requisite documentation, we have marshalled the opposing evidence and concluded that there is substantial evidence that the Illinois River is degraded and that Fayetteville's effluent will reach the state line. These conclusions negate the need for conducting the usual substantial-evidence inquiry. However, we do not suggest by this approach that the opponent of a permit bears the burden of making the showings that our examination of the record has revealed. To understand this distinction, it is crucial to review how the Clean Water Act and EPA's implementing regulations allocate the burden of proof in NPDES permitting decisions. Recall that the \"permit applicant always bears the burden of persuading the Agency that a permit authorizing pollutants [to] be discharged should be issued and not denied and this burden does not shift.\" Initial Decision, R., A-26, at 10 (quoting 40 C.F.R. § 124.85(a)(1)). In other words, it is the proponent of a permit who bears the burden of showing that a discharge will comply with all applicable standards, not the opponent of a permit who must show that a discharge will violate applicable requirements. Moreover, EPA's decision to issue a permit (which decision necessarily reflects its judgment that the permit assures compliance with all applicable requirements of the CWA) must be supported by substantial evidence. 5 U.S.C. § 706(2)(E). Denial of a permit, on the other hand, need not be supported by substantial evidence, because of the CWA's fundamental premise that pollution is unlawful and EPA's discretion to issue permits under 33 U.S.C. § 1342(a). In this case the ALJ erred in imposing the burden on the permit opponents to show that water quality standards would be violated. For example, he required the Oklahoma parties to \"show by substantial evidence that the City's discharge will create a nuisance,\" Decision on Remand at 5, and he cited the \"lack of substantial evidence to support the notion that the small increases in phosphorus . . . would result in an increase in eutrophication,\" id. at 8. Ironically, the record does contain substantial evidence showing that the discharge would violate CWA requirements. This evidence is more than sufficient to meet the permit opponent's burden of \"going forward to present an affirmative case,\" 40 C.F.R. § 124.85(a)(3)(ii), and it reinforces our conclusion that the Fayetteville permit may not issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See supra note 47.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. There is extensive legislative history on the goals and policy section, § 101, of the CWA, 33 U.S.C. § 1251(a). See National Wildlife Fed'n, 693 F.2d at 179-81, for one overview of that history. The D.C. Circuit stated: The sponsors of the Act successfully insisted on a zero-discharge-of-pollutants goal despite strong objection from both within and without. . . . Senator Muskie, the Senate sponsor and principal force behind the bill, stated, in the post-conference debate on the bill: \"These [goals] are not merely the pious declarations that Congress so often makes in passing its laws; on the contrary, this is literally a life or death proposition for the nation.\" 224 U.S. App. D.C. 41, 693 F.2d at 179 (quoting 118 Cong. Rec. 33,693 (1972)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. EPA is never required to issue a discharge permit; rather, under 33 U.S.C. § 1342(a)(1), EPA \" may. . . issue a permit . . . upon condition that such discharge will meet . . . all applicable requirements.\" (Emphasis added.) See also § 1342(d)(4) (EPA \" may issue\" a permit pursuant to § 1342(a) if it objects to a state-issued permit) (emphasis added)). The CWA confers no \"right to pollute\"; indeed, it takes away any license to pollute unless a permit is first obtained. In fact, as we saw in the previous section of this opinion, EPA may not permit a discharge if compliance with applicable water quality requirements cannot be insured. 33 U.S.C. § 1341(a)(2). Plainly, EPA is empowered to deny a permit under the circumstances of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Moreover, there is no \"de minimis\" theory applicable to CWA violations. E.g., Union Oil, 813 F.2d at 1490-91 (CWA \"makes no provision for 'rare' violations\"). See also Order on Petitions for Review, R., A-28, at 13 (improper to imply a de minimis test); 49 Fed. Reg. at 38,038 (according to EPA, \"water quality standards . . . are legally required to be met at all times \" (emphasis added)). In this regard, the Clean Water Act and Oklahoma's Anti-Degradation Policy, which we have explained prohibits any detectable change in the water quality of scenic rivers, can be contrasted to the Clean Air Act, 42 U.S.C. §§ 7401-7706, which prohibits \"significant deterioration\" of air quality in \"clean air areas,\" and quantifies \"significant\" in terms of \"maximum allowable increases\" in the concentrations of certain pollutants. 42 U.S.C. §§ 7471-7473.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Indeed, as we saw in the first part of this pinion, the Senate committee was concerned in 1977 that the gains achieved due to the 1977 CWA amendments could be lost in the 1980s if only the 1977 effluent limitations were applied. S. Rep. No. 370, at 42, reprinted in 1977 U.S. Code Cong. \u0026 Admin. News at 4367. The committee warned that \"pressure must be maintained to assure improved water quality and to avoid slipping back.\" Id. (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. It appears Congress did consider a variation of this issue, however. See infra note 57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. This statement assumes the applicability of regulations comparable to Oklahoma's Beneficial Use Limitations/Anti-Degradation Policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. One provision of the CWA, however, intimates that Congress did consider the effect of existing water quality degradation on the decision whether to permit a new source. The certification statute, which we discussed in the first part of this opinion, contemplates a variation of the circumstances of this case. It provides that a certification obtained for purposes of receiving an NPDES permit also satisfies the certification requirement for any other federal license required for operation of the source unless \"there is no longer reasonable assurance that there will be compliance with the applicable provisions of [the CWA] because of changes since the [certification] was issued in. . . the characteristics of the waters into which such discharge is made.\" 33 U.S.C. § 1341(a)(3) (emphasis added). The gist of this provision was first enacted in section 11 of the Water and Environmental Quality Improvement Act of 1970, Pub. L. No. 91-224. According to the House Report on the enacted bill, section 11 provided that the first certification was sufficient for additional licenses or permits \"if, after notice to the affected State or States . . . no written objection is made to the granting of such license or permit without a subsequent certification.\" House Rep. No. 127, 91st Cong., 2d Sess., reprinted in 1970 U.S. Code Cong. \u0026 Admin. News 2691, 2711. The statute further provided that a license or permit could be suspended if a court subsequently found that the licensee or permittee was violating applicable water quality standards. Id. We view these sections in the 1970 and 1972 statutes as buttressing our decision today.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. It is conceivable that a new discharge of pollution to an already degraded stream protected by the equivalent of Oklahoma's Beneficial Use Limitations regulation might be permitted in certain extremely narrow circumstances. This might be permissible where the chemical and physical makeup of the effluent of the new source was unrelated to the standards being violated; for example, where the only potential effect of the effluent was on water temperature (OWQS § 4.11(b)), but the stream was degraded only with respect to toxics (OWQS § 4.3(h)). But where, as here, only the standards being violated are intended to govern constituents of a proposed source's effluent and any amount of that effluent can reasonably be expected to reach the degraded waters, the new discharge may not be permitted.\u003c/span\u003e\n\n",
    "body_length": 175821,
    "citedas": [
      "908 F.2d 595"
    ],
    "attorneys": "Robert A. Butkin (Robert H. Henry, Attorney General, and William J. Holmes, Assistant Attorney General, State of Oklahoma; Ed Edmondson and Julian K. Fite, Muskogee, Oklahoma, on the briefs), Oklahoma City, Oklahoma, for petitioners, The State of Oklahoma, Oklahoma Scenic Rivers Commission and Pollution Control Coordinating Board. John Steven Clark, Attorney General (R. B. Friedlander, Solicitor General, Attorneys for State of Arkansas, Steven Weaver, Anne Roberts Bobo, Attorneys for Arkansas Department of Pollution Control \u0026 Ecology, Little Rock, Arkansas, James N. McCord, Attorney for the City of Fayetteville, Arkansas, The Niblock Law Firm, Attorney for The Beaver Water District, Fayetteville, Arkansas, on the brief) for petitioners, City of Fayetteville, Arkansas, The Beaver Water District, State of Arkansas, Arkansas Department of Pollution Control and Ecology. Gary Guzy (Catherine A. Winer, U.S. EPA; Pat Rankin, U.S. EPA; and Richard B. Stewart, Asst. Attorney General, with him on the briefs), U.S. Department of Justice, Washington, D.C., for the respondent. Ed Edmondson appearing for Save the Illinois River.",
    "category": [
      "243",
      "251",
      "75"
    ],
    "judges": "Anderson and Brorby, Circuit Judges, and Theis,*fn* District Judge.",
    "citation_count": 10
  }
}
