{
  "id": "96FYR2YBTlTomsSBR-tz",
  "document": {
    "title": "California v. TEXACO Inc.",
    "full_title": "THE STATE OF CALIFORNIA EX REL. JOHN K. VAN DE KAMP, AS ATTORNEY GENERAL, ETC. AND v. TEXACO, INC., ET AL. AND",
    "jurisdiction": "California Supreme Court",
    "date": "1988-10-20T00:00:00.000Z",
    "docket": "S.F. No. 24987",
    "body": "The California Attorney General sued under the Cartwright Act (Bus. \u0026 Prof. Code, § 16720 et seq.) and the Unfair Practices\n\nAct (id., § 17000 et seq.) to enjoin defendants Texaco, Inc., (Texaco) et al., from acquiring the California assets of Getty Oil Company (Getty) pursuant to a merger between the two companies.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe trial court sustained defendants' demurrer without leave to amend, and dismissed the complaint. In the Court of Appeal, the Attorney General asserted the lower court erred in concluding that neither the Cartwright Act nor the Unfair Practices Act applies to an acquisition or merger, and that the action is preempted by the supremacy clause (U.S. Const., art. VI, cl. 2) by virtue of a consent decree issued by the Federal Trade Commission (FTC). Additionally, the Attorney General asserted, the lower court erred to the extent it held the action is preempted by the commerce clause (id., art. I, § 8, cl. 3).\n\nThe Court of Appeal held the action preempted by federal antitrust law under the supremacy clause, and affirmed judgment for defendants on that ground. We affirm the judgment of the Court of Appeal, but we do not reach the preemption questions because we hold that neither cited state law regulates a merger.\n\nI. Facts and Procedure\n\nTexaco and Getty entered into a merger agreement under which Texaco would acquire Getty, and thereby become the second largest petroleum company in the United States. Pursuant to 15 United States Code section 18a, the firms notified the FTC and the United States Justice Department of their agreement, and the FTC proceeded to investigate whether the proposed merger would violate federal antitrust law. Thereafter the FTC filed and accepted comments on a provisional consent order concerning both firms. Based in part on comments from, inter alia, the California Attorney General, the FTC issued a complaint under section 7 of the Clayton Act (15 U.S.C. § 18), detailing the potential anticompetitive effects of the proposed merger. At the same time, the FTC entered into an agreement, in the form of a consent order, with Texaco. The consent order bound Texaco to divest itself of certain Getty assets located throughout the country; offer pipeline access to former Getty customers; and refrain from acquiring wholesale\n\ndistribution firms in various states. Regarding California assets, the order required Texaco to sell crude oil of specified grade to certain former Getty customers for five years.\n\nThe Attorney General was unsatisfied with the consent order, however, and filed the present action, which essentially copies the FTC's complaint based on section 7 of the Clayton Act. The Attorney General's complaint asserted the merger may in several specific respects substantially lessen competition in the state market for crude oil and related products. In other words, the complaint claimed the merger posed an incipient threat to competition.\n\nII. Application of the Cartwright Act to a Merger\n\nA. Words of the Statute\n\nThe Cartwright Act (or Act) (Stats. 1907, ch. 530, pp. 984-987) states, \"Except as provided in this chapter, every trust is unlawful, against public policy and void.\" (Bus. \u0026 Prof. Code, § 16726.) The Act defines \"trust\" as \" a combination of capital, skill or acts by two or more persons for any of the following purposes: (a) To create or carry out restrictions in trade or commerce. . . . (e) To make or enter into or execute or carry out contracts, obligations or agreements of any kind or description, by which they . . . [agree] to pool, combine, or directly or indirectly unite any interests that they may have connected with the sale or transportation of any . . . article or commodity, that its price might in any manner be affected.\" (Id. § 16720, subds. (a) \u0026 (e)(4), italics added.) The Act makes agreements in violation of its provisions void and unenforceable (id., § 16722), and subject to injunction (id., § 16754.5) and civil actions for damages (id., § 16750). Another section makes violation of the Act subject to fine or imprisonment, or both. (Id., § 16755, subd. (a).)\n\nThe Attorney General asserts that a merger is \"precisely\" a \"combination of capital,\" hence the statute covers mergers. It is questionable, however, whether the statutory meaning of \"combination\" is so broad. As defendants suggest, the word combination might well contemplate a situation in which separate entities that maintain separate and independent interests, act in concert -- \"combine\" -- for a certain purpose, but which thereafter perdure, i.e., continue to maintain their separate identities and interests.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e A bona fide merger, however, is not such a relationship; in a\n\nmerger the entities lose forever their separate identities, and become a new, independent entity.\n\nAccordingly, we question whether the words of the statute support the Attorney General's assertion that it was intended to apply to mergers. On the other hand, we cannot confidently know, without further inquiry, that defendants' interpretation is the intended one. In this situation, it is appropriate to look beyond the statute's terms to discover its intent. (E.g., Solberg v. Superior Court (1977) 19 Cal. 3d 182, 198 [137 Cal. Rptr. 460, 561 P.2d 1148].)\n\nB. Purpose of the Statute\n\nThe Attorney General first asserts that his interpretation of the statute, and of the word \"combination\" in particular, best comports with the asserted \"manifest purpose\" of the statute: protecting competition. (Marin County Bd. of Realtors, Inc. v. Palsson (1976) 16 Cal. 3d 920, 928 [130 Cal. Rptr. 1, 549 P.2d 833].) His point, however, begs the question. Beyond doubt, the Act was intended to protect and foster competition. The question is, to what lengths did the drafters intend to go to accomplish that goal? Did they intend to regulate any form of business transaction that may affect competition? Or did they intend merely to regulate certain types of collusive arrangements between ongoing, separate businesses? As the following discussion discloses, we conclude the drafters did not intend the Act to regulate a merger.\n\nC. Derivation of the Statute\n\nIn the past, we have attributed various (and sometimes conflicting) roots to the Cartwright Act. We have (i) asserted that it was patterned after a proposed alternative bill to what became the Sherman Act (15 U.S.C. §§ 1-7) (Palsson, supra, 16 Cal. 3d 920, 926; Cianci v. Superior Court (1985) 40 Cal. 3d 903, 919 [221 Cal. Rptr. 575, 710 P.2d 375]); (ii) suggested that it was modeled after the Sherman Act itself (e.g., Palsson, supra, 16 Cal. 3d at p. 925); and (iii) stated that it codified the common law (e.g., Corwin v. Los Angeles Newspaper Service Bureau, Inc. (1971) 4 Cal. 3d 842, 852 [94 Cal. Rptr. 785, 484 P.2d 953]). (See Lasky, Folklore and Myth in Judicial Opinions -- Some Reflections Inspired by Texaco-Getty (1987) 20 U.C.Davis L.Rev. 591.) As discussed below, the first position -- or at least a variation of it -- is most historically correct, and it discloses most clearly the probable intent of the drafters.\n\n1. The Texas Antitrust Act, and Its Progeny\n\na. Senator Reagan's Bills of 1888 and 1890\n\nAs noted above, we have previously stated that the Cartwright Act was modeled after a bill that was proposed (but rejected) in the United States Senate as an alternative to what became the Sherman Act. This shorthand description of the Act's lineage was adequate for purposes of our analysis in Palsson and Cianci (16 Cal. 3d 920; 40 Cal. 3d 903), but for present purposes we need to analyze in greater detail the Act's ancestry.\n\nThe chronology is as follows: Senator Reagan of Texas introduced a short \"bill to define trusts\" in the United States Senate in 1888, on the same day Senator Sherman of Ohio introduced his bill. (19 Cong.Rec. 7512-7513 (1888).) The Senate did not debate the subject, however, until early 1890. In the meantime, several states passed their own antitrust acts. (Davies, Trust Laws and Unfair Competition, Dept. of Commerce, Bureau of Corps. (1916) p. 9 [hereafter Davies]; Rush, Historic Origins of Anti-Trust Legislation (1953) 18 Mo.L.Rev. 215, 246; Rubin, Rethinking State Antitrust Enforcement (1974) 26 U.Fla.L.Rev. 653, 657-658, and authorities cited in fn. 22.) Of those acts, the Maine and Kansas laws were the first. (1889 Me. Acts, ch. 266 (Mar. 7, 1889); 1889 Kan. Sess. Laws, ch. 259 (Mar. 9, 1889).)\n\nThe Kansas act, similar to the Maine law, made illegal \"all arrangements, contracts, agreements, trusts or combinations. . .\" for various improper purposes. (Italics added.) In the next two years, most states that enacted antitrust legislation followed the Kansas-Maine scheme. (1889 Neb. Laws, ch. 69; 1889 Iowa Acts, ch. 28; 1889 Mich. Pub. Acts, No. 225; 1889 Tenn. Pub. Acts, ch. 250; 1889 N.C. Sess. Laws, ch. 374; 1889 Mo. Laws, p. 96; 1890 N.D. Laws, ch. 174; 1890 S.D. Laws, ch. 154.) During the same period, the Texas Legislature considered a number of antitrust bills, and in late March 1889, enacted a law (1889 Tex. Gen. Laws, ch. 117) modeled after Senator Reagan's 1888 Senate bill. (Cotner, James Stephen Hogg (1959) pp. 163-165 [biography of Texas Attorney General, a principal author of the 1889 Texas act]; Mathews, History, Interpretation and Enforcement of the Texas Antitrust Laws, in Southwestern Legal Foundation, Institute on Antitrust Laws and Price Regulations (1950) pp. 28-29 [hereafter Texas Antitrust Laws ].) The body of the Texas act was more detailed than the 1888 Reagan version, but it retained a significant aspect of that bill: unlike the Kansas-Maine approach, the Texas act simply declared \"trusts\" illegal, and proceeded to define \"trust\" as a \" combination of capital, skill or acts . . .\" for various specific improper purposes. (Italics added; compare\n\n1889 Tex. Gen. Laws, ch. 117, § 1, with the 1888 Reagan bill, 19 Cong.Rec. 7512-7513 (both quoted post, fn. 14).)\n\nAccordingly, by the time the United States Senate was ready to debate its own antitrust legislation in 1890, there were two streams of state antitrust laws\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e -- the Kansas-Maine format -- a broadly worded law that was followed in at least nine states -- and the Texas format -- a more narrowly worded, specific law which at the time was followed in only one other state.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In March 1890, Senator Reagan introduced an amended version of his earlier bill; this second bill followed closely the words and format of the Texas act. (Compare second Reagan bill, 21 Cong.Rec. 2456 (1890), with 1889 Tex. Gen. Laws, ch. 117, § 1, both quoted post, fn. 14.) In response to Senator Sherman's criticism, Senator Reagan told the Senate: \"The Senator suggests that my amendment ought to undergo the revision of a committee. I may say to the Senator that much of it is copied out of a law, not a law of Congress but one of the States, which underwent very thorough and searching discussion.\" (21 Cong.Rec. at p. 2564.) It is plain from this chronology, and from comparison of the 1890 Reagan bill and the 1889 Texas act, that Reagan's newly proffered bill was based on the Texas act (which, as noted, itself had its roots in the first version of the Reagan bill). (See Mathews, supra, Texas Antitrust Laws, p. 28; Cotner, supra, pp. 161-167.)\n\nb. Interpretation of the Texas and Michigan Acts\n\nThe Senate rejected Reagan's bill, and enacted a much modified version of Senator Sherman's bill in July 1890. (26 Stats. 209; 15 U.S.C. §§ 1-7.)\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Section 1 of the Sherman Act resembled the Kansas-Maine format: it made illegal \"[every] contract, combination in the form of a trust or otherwise, or\n\nconspiracy in restraint of trade or commerce among the several States . . . .\" (15 U.S.C. § 1.) Section 2 of the Sherman Act had no counterpart in any of the then-existing state antitrust statutes. It provided: \"Every person who shall monopolize, or attempt to monopolize, or combine or conspire with any other person or persons, to monopolize any part of trade or commerce among the several states . . . shall be deemed guilty of a felony . . . .\" (Id., § 2.)\n\nDuring the next 17 years, a few states adopted versions of the Sherman Act as their own state antitrust statutes.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Most, however, adopted acts more closely based on the original Kansas-Maine\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e or Texas\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e formats. Over the years, a number of states switched back and forth between the latter two models, and many added special provisions in a constant effort to refine and focus the law; Texas, for example, enacted revised laws in 1895, 1899, and 1903. Overall, the trend favored the Kansas-Maine format.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn addition to this legislative action, there also developed between 1896-1904, a substantial body of case law construing the various statutes -- particularly the first Texas act (1889 Tex. Gen. Laws, ch. 117), and one of its progeny, the second Michigan act (1899 Mich. Pub. Acts, No. 255).\n\nThe scope and meaning of the term \"combination\" in the original Texas act was addressed in a number of decisions by the Texas Supreme Court. Cooperative action for a specified, anticompetitive purpose by otherwise independent, competing firms, was held to be an illegal combination.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In Gates v. Hooper (1897) 90 Tex. 563 [39 S.W. 1079], however, the court held the 1889 Texas act did not regulate a purchase by one mercantile company of another. The court reasoned that in such a transaction the parties do not \"combine,\" as that term is used in the statute, because under a sale the parties do not maintain a separate, \"otherwise independent and competing\" relationship.\n\nIn Gates, supra, 90 Tex. 563, a merchant sold his business to a competitor. The court explained why this transaction did not result in a \"combination\": \"In order to constitute a trust, within the meaning of the statute, there must be a 'combination of capital, skill or acts by two or more.' 'Combination,' as here used means union or association. If there be no union or association by two or more of their 'capital, skill or acts,' there can be no 'combination,' and hence no 'trust.' When we consider the purposes for which the 'combination' must be formed, to come within the statute, . . . we are led to the conclusion that the union or association of 'capital, skill or acts' denounced is where the parties in the particular case designed the united co-operation of such agencies, which might have been otherwise independent and competing, for the accomplishment of one or more of such purposes. In the case stated in the petition there is no 'combination.' The plaintiff bought defendant's goods, together with the goodwill of his business, both of which were subjects of purchase and sale. . . . By this transaction neither the capital, skill, nor acts of the parties were brought into any kind of union, association or cooperative action. The purchaser became the owner of the things sold . . . .\" (Id., at p. 1080.)\n\nWhen confronted with the question of whether the two Michigan acts applied to mergers, the Sixth Circuit Court of Appeals interpreted the word \"combination\" consistently with Gates, supra, 39 S.W. 1079. In Hitchcock v. Anthony (6th Cir. 1897) 83 Fed. 779, the court rejected a claim that a sale of one dockyard business to another dockyard company violated the first Michigan act (1889 Pub. Acts, No. 225). That act was modeled after the Kansas-Maine format, and prohibited \"all contracts, agreements, understandings and combinations made\" for various anticompetitive purposes. Despite the broadly worded proscription of conduct under the act, the court focused on the word, \"combination.\" The court wrote: \"The Michigan statute cited was properly construed by Judge Severens, who tried this case below, when he said that: 'It is aimed at combinations between parties who, having each a separate business with no interest or concern in that of the other, join together to restrict the output or enhance the prices of goods; and not to cases where one owning a property which he could devote to a given purpose or not, as he pleases, conveys it to another . . . .'\" (Id., at p. 781.)\n\nSimilarly, in A. Booth \u0026 Co. v. Davis (C.C.E.D.Mich. 1904) 127 Fed. 875, the court stated that Michigan's second act (1899 Pub. Acts, No. 225) did not apply to the sale of one fishing business to another fishing company. This Michigan act, as noted, was modeled after the original Texas act. It made trusts illegal, and defined trust as \"a combination of capital, skill or arts\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e by two or more persons . . .\" for specified anticompetitive purposes. The federal district court found the act was \"directed only against combinations of persons or firms . . . conspiring to co-operate in violation of its provisions, and that it contains nothing prohibitive of the acquisition by a person . . . or association . . . . All such persons . . . may carry on business . . . provided they do not . . . combine with other persons [or] firms . . . to effect in any way the ends denounced in the statute.\" (Id., at p. 878.) On appeal, the Sixth Circuit agreed: \"We think that the intent which [would make a given] contract or combination unlawful was one in which both parties participated, and that the act was not intended to comprise a case where there was a sale and a purchase of property, after which the seller should have no interest in the property, and therefore would have no intent as to its further use.\" (Davis v. A. Booth \u0026 Co. (6th Cir. 1904) 131 Fed. 31, 37-38 [construing 1899 Michigan act consistently with 1889 Michigan act].)\n\nThe few other state cases of that period addressing the issue and construing similar statutes are in accord, and they demonstrate general awareness\n\nof the cases discussed above. For example, the Missouri Supreme Court cited and applied Gates, supra, 39 S.W. 1079, in holding a tobacco manufacturing corporation's purchase of another manufacturing corporation did not amount to a \"combination.\" (State v. Continental Tobacco Co. (1903) 75 S.W. 737, 747.) And, although its opinion was filed shortly after the Cartwright Act was passed in 1907, the Nebraska Supreme Court also cited Gates, supra, (together with Davis, supra, 127 Fed. 875, 131 Fed. 31, and Hitchcock v. Anthony, supra, 83 Fed. 779), for the proposition that sale of one lumberyard business to another lumber company is not itself an illegal combination. (Engles v. Morgenstern (1909) 85 Neb. 51 [122 N.W. 688, 690].) In summary, at the time the Cartwright Act was enacted there was a recognizable body of case law construing the word \"combination\" (in both Kansas-Maine and Texas-type acts) as not applying to the purchase of one business by another entity engaged in the same business.\n\nc. Development of Antimerger Provisions\n\nIn the meantime -- and in the face of the various courts' narrow construction of the term \"combination\" -- some states amended their earlier acts to adopt provisions that reached beyond the scope of all previous state acts and the Sherman Act. These newer acts, in addition to regulating \"trusts\" and \"combinations\" in restraint of trade, also regulated, inter alia, monopolies\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and, significantly, corporate mergers.\n\nOn the subject of mergers, the third of Texas's antitrust acts -- the act of 1899 -- stated that \"monopoly\" was unlawful, and broadly defined monopoly as including \"all aggregations, amalgamations, affiliations, consolidations or incorporations of . . . assets [or] property, . . . whether effected by the ordinary methods of partnership or by actual union . . . or an incorporated body resulting from the union of one or more distinct firms or corporations, or by the purchase, acquisition or control of shares or certificates of stock\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e . . . if . . . created or entered into for any one . . . of the purposes named in this act . . . .\" (1899 Tex. Gen. Laws, ch. 146, § 2.)\n\nSimilarly, the second Mississippi act provided: \"No corporation shall directly or indirectly purchase or own the capital stock, or any part thereof, of any other corporation, nor directly or indirectly purchase, or in any manner acquire the franchise, plant or equipment of any other corporation,\n\nif such other corporation be engaged in the same kind of business and be a competitor therein.\" (1900 Miss. Laws, ch. 88, § 5.)\n\nThe fourth (1903) Texas act made illegal any monopoly \"effected by either of the following methods: [ para. ] When the direction of the affairs of two or more corporations is in any manner brought under the same management or control for the purpose of producing, or where such common management or control tends to create a trust . . . . [ para. ] 2. Where any corporation acquires the shares or certificates of stock or bonds, franchise or other rights, or the physical properties, or any part thereof, of any other corporation or corporations, for the purpose of preventing or lessening, or where the effect of such acquisition tends to affect or lessen competition, whether such acquisition is accomplished directly or through the instrumentality of trustees or otherwise.\" (1903 Tex. Gen. Laws, ch. 94, § 2 (1), (2).)\n\nFinally, in 1905, Arkansas amended its earlier act and enacted an antimerger provision worded after the Texas version of 1899. (1905 Ark. Acts, No. 1, § 5.)\n\nd. Enactment of the Cartwright Act\n\nAgainst this background of increasingly sophisticated state antitrust statutes and case law, our Legislature in 1907 enacted the Cartwright Act. In doing so it settled on an act patterned closely after the original 1889 Texas act and its progeny, most notably the 1899 Michigan act.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The Act\n\nembraced by our Legislature contained the well-known limitations on combinations in restraint of trade, but it (i) failed to include the latest invention of the evolving antitrust statutes -- an antimerger provision -- and (ii) embraced the term \"combination,\" without attempting to modify the language in order to avoid the prevailing narrow construction of that term.\n\nIn the absence of contrary indications -- of which we have none -- it must be assumed that our Legislature intended \"combination\" to have the same meaning under the Cartwright Act as that term was given under the identical words of the original 1889 Texas act and the 1899 Michigan act. We have \"long recognized the principle of statutory construction that '[when] legislation has been judicially construed and a subsequent statute on the same or an analogous subject is framed in the identical language, it will ordinarily be presumed that the Legislature intended that the language as used in the later enactment would be given a like interpretation.'\" (Belridge Farms v. Agricultural Labor Relations Bd. (1978) 21 Cal. 3d 551, 557 [147 Cal. Rptr. 165, 580 P.2d 665]; see also Erlich v. Municipal Court (1961) 55 Cal. 2d 553, 558 [11 Cal. Rptr. 758, 360 P.2d 334] [statute patterned after New York statute given same construction as given by New York courts].)\n\nContrary to the Attorney General's suggestions, the absence of today's computerized legal research systems in 1907 does not diminish the force of this canon. As demonstrated above, the Gates and Davis courts' construction of the term \"combination\" was both widely known and followed, explicitly and implicitly, in other courts' interpretations of the same term in cases involving acquisitions. These cases were published in the National Reporter System and the American State Reports, and were available to our Legislature through the Shepard's Citation Service and other resources of the period.\n\nIn this case, the presumption of legislative intent (by virtue of previous judicial construction) is additionally strengthened by the history of sister state legislation -- dating from eight years before the Cartwright Act -- designed to regulate mergers. It is clear that the legislatures of the day both (i) recognized the problems posed by mergers, and (ii) were capable of framing legislation designed to regulate such practices. In particular, the fact that the Texas Legislature (to which our Legislature obviously looked for guidance in this area) saw it necessary to twice enact antimerger provisions, but ours did not, strongly suggests our Legislature was content to enact a law of limited scope, which did not address mergers. (See post, pp. 1167-1168.)\n\nFinally, our Legislature's inaction on this subject for the past 80 years is significant. Although it has amended the Cartwright Act at least 26 times\n\nbetween 1909 and the present, it has never enacted a merger provision.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e This stands in contrast to other states that either (i) enacted antitrust legislation with specific antimerger provisions well before the Cartwright Act was passed in 1907 (see ante, pp. 1159-1160) or (ii) have since then amended their antitrust laws specifically to address the regulation of mergers or acquisitions. (Some of these provisions were enacted shortly after the Cartwright Act: see, e.g., Okla. Stat., tit. 79, § 84 (1913 Okla. Sess. Laws, ch. 114, § 4); La. Rev. Stat. Ann., tit. 51, § 125 (1915 La. Acts, No. 11, § 5). Others are of more recent vintage: Alaska Stat., § 45.50.568 (1975 Alaska Sess. Laws, ch. 53, § 1); Hawaii Rev. Stat., § 480-7 (1961 Hawaii Sess. Laws, ch. 190, § 5); Neb. Rev. Stat., § 59-1606 (1974 Neb. Laws, LB 1028, § 13); N.J. Stat. Ann., 56:9-4 (1970 N.J. Laws, ch. 73, § 4); Wash. Rev. Code, § 19.86.060 (1961 Wash. Laws, ch. 216, § 6).)\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The Attorney General has not cited, nor have we found, a state statute similar to the Cartwright Act that has been construed as applying to mergers. (Cf. post, fn. 20.)\n\nThe foregoing history demonstrates that the drafters of the Cartwright Act must have known the limitations of what they were adopting: The operative words of their act had been construed consistently in at least three published opinions, and Texas, the parent state from which the Cartwright Act was copied, was among the states that had in the interim adopted additional, express statutory provisions clearly extending coverage of their acts to mergers. Instead of adopting one of the newer, more expansive models of antitrust statutes, our Legislature opted for the simpler, judicially construed format first enacted by Texas in 1889. Given this history, we must conclude that the drafters intended that their Act apply, as its words had been construed, only to entities that \"combine,\" in the sense of those who perdure (i.e., continue as separate, independent, competing entities during and after their collusive action) -- and therefore that the drafters did not intend the Cartwright Act to regulate the bona fide purchase and sale of one firm by another. Any other interpretation of the drafters' intent cannot be reconciled with the Act's history. As we explain below, nothing presented by the Attorney General undermines this conclusion.\n\n2. The Sherman Act\n\nThe Attorney General cites authorities stating the Cartwright Act is modeled after the Sherman Act. He then asserts that the Sherman Act has been construed as applying to mergers, and concludes that the Carwright Act should be construed as applying to mergers as well. In light of the above discussion, however, the Attorney General's fundamental premise is flawed. Admittedly, in past statements we have suggested that the Cartwright Act is patterned after the Sherman Act. (E.g., Palsson, supra, 16 Cal. 3d 920, 925, and cases cited.) As shown above, however, historical and textual analysis reveals that the Act was patterned after the 1889 Texas act and the 1899 Michigan act, and not the Sherman Act. (See ante, fn. 14.) Hence judicial interpretation of the Sherman Act, while often helpful, is not directly probative of the Cartwright drafters' intent, given the different genesis of the provision under review. Nevertheless, even if we were to accept the Attorney General's premise, interpretation of the Sherman Act is unhelpful to the Attorney General's view.\n\nAs the Attorney General observes, there are cases allowing challenges to mergers under the Sherman Act. The early cases involved large railroads, the mergers of which would have amounted to an actual restraint of competition. As one commentator noted, these decisions \"hinge on the size of the defendant companies.\" (4 Kitner, Legislative History of the Federal Antitrust Laws and Related Statutes (1980) § 10.77, p. 291 [hereafter Kitner]; see Northern Securities Co. v. United States (1904) 193 U.S. 197 [48 L.Ed. 679, 24 S.Ct. 436]; United States v. Union Pacific Railroad Co. (1912) 226 U.S. 61 [57 L.Ed. 124, 33 S.Ct. 53]; United States v. Reading Co. (1920) 253 U.S. 26 [64 L.Ed. 760, 40 S.Ct. 425]; United States v. Southern Pacific Co. (1922) 259 U.S. 214 [66 L.Ed. 907, 42 S.Ct. 496]; see also Davies, supra, pp. 98-105.)\n\nDefendants respond that these early cases appear to be based on section 2 of the Sherman Act, which section prohibits monopolies. (15 U.S.C. § 2, quoted ante , pp. 1155-1156; see Kintner, supra, pp. 3436-3441, quoting FTC report.) They then cite authorities stating that the Cartwright Act contains no corresponding provision.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The high court's most recent word on the subject, however, defeats defendants' attempted distinction. In United\n\nStates v. First Nat. Bank (1964) 376 U.S. 665 [12 L.Ed.2d 1, 84 S.Ct. 1033], the court cited Northern Securities Co., supra, 193 U.S. 197, and Union Pacific, supra, 226 U.S. 61, and held a bank merger illegal under section 1 of the Sherman Act. (376 U.S. at pp. 669-670 [12 L.Ed.2d at p. 5]; see also U.S. v. Philadelphia Nat. Bank (1963) 374 U.S. 321, 354 [10 L.Ed.2d 915, 939-940, 83 S.Ct. 1715] [\"The Sherman Act, of course, forbids mergers effecting an unreasonable restraint of trade.\"].)\n\nStill, this line of authority ultimately does not assist the Attorney General's position in this case. The cases allowing challenges to mergers under the Sherman Act require -- pursuant to section 1 of that Act -- that an actual \"restraint of trade\" be proved. (15 U.S.C. § 1, quoted ante, p. 1156.) To the extent the Cartwright Act could be said to be patterned after the Sherman Act, a merger challenge under the state Act would require the same showing, i.e., that the merger \"effected\" an unreasonable restraint of trade. The Attorney General, however, has alleged no such thing; as explained above, his complaint is modeled after the FTC's initial complaint in this matter, and both complaints are clearly framed under section 7 of the Clayton Act. (15 U.S.C. § 18.) That latter Act -- in contrast to the Sherman Act -- allows challenges to incipient threats to competition, i.e., \"[mergers] with a probable anticompetitive effect . . . .\" (Brown Shoe Co. v. United States (1962) 370 U.S. 294, 323 [8 L.Ed.2d 510, 534, 82 S.Ct. 1502].)\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e In the present case, the Attorney General has alleged only that the challenged merger poses a threat to competition; he has not alleged the merger has effectuated an unreasonable restraint of competition.\n\nWe reiterate that, contrary to the Attorney General's view, interpretation of the Sherman Act is not directly probative of the intent of the drafters of the Cartwright Act, given the different genesis of the provision under review. Nevertheless, in light of the above discussion, it appears that the Attorney General's complaint in this case would not state a cause of action under his cited Sherman Act cases. In fact, his view would require expansion of both the Cartwright and Sherman Acts beyond the scope attributed to them by any court. Nothing in the Sherman Act or the cases applying it supports the Attorney General's view that the Cartwright Act was intended\n\nto apply to mergers at all, much less mergers that pose, at most, an incipient threat to competition.\n\n3. The Common Law\n\nDefendants attempt to bolster their view of the Cartwright Act by suggesting that (i) the Act is a codification of the common law, and (ii) the common law did not impose restrictions on the outright purchase of one business by another. As we shall explain, both points are mistaken. As we also explain, however, the true state of the common law at the time of the Cartwright Act supports our conclusion about the drafters' intent.\n\nAlthough there is dictum supporting defendants' first proposition in Rolley Inc. v. Merle Norman Cosmetics (1954) 129 Cal. App. 2d 844, 846 [278 P.2d 63], and subsequent cases (e.g., Corwin, supra, 4 Cal. 3d 842, 852), Rolley is based on a misunderstanding of Speegle v. Board of Fire Underwriters (1946) 29 Cal. 2d 34 [172 P.2d 867], in which Justice Traynor explained that the Cartwright Act \"articulates in greater detail a public policy against restraint of trade that has long been recognized at common law.\" (Id., at p. 44.) Speegle stands simply for the proposition that the public policy underlying the Cartwright Act -- and all early antitrust acts, for that matter -- is rooted in the common law. This is not to say, however, that the Act is confined by, or as broad as, the common law; instead, the Act stands on its own, and courts must interpret its words as best they can in order to effectuate the intent, not of \"the common law,\" but of the Act's drafters. Nevertheless, because the state of the common law at the time the Act was drafted may shed light on the drafters' intent, we will review the common law on the question of \"mergers.\"\n\nAs suggested above, defendants assert that the common law distinguished between outright \"purchase\" or \"acquisition,\" on one hand, and \"combinations\" or \"trusts,\" on the other, and that the former were legal and enforceable whereas the latter were void and unenforceable. After reading the cases cited by defendants (e.g., Davis v. A. Booth \u0026 Co., supra, 131 Fed. 31, 37; Lumberman's Trust Co. v. Title Ins. Co. (9th Cir. 1918) 248 Fed. 212, 217-218; and Trenton Potteries Co. v. Oliphant (1899) 58 N.J.Eq. 507, 524 [43 A. 723]), we are not persuaded that defendants' interpretation of them is correct: in our view, these cases do not apply the common law. The cited page to Davis, for example, is to the court's statutory construction analysis of the Sherman Act, not the common law; the court did discuss the common law on the following page (131 Fed. at p. 38), but reached no clear conclusion on the issue here, and it plainly did not announce the rule advanced by defendants. Likewise, Lumberman's interprets a state constitutional provision,\n\nnot a common law rule, and it draws most of its authority from statutory construction cases. Oliphant, too, is similarly influenced by statutory law. Defendants have cited no authority supporting their view that the rule they advance existed at common law.\n\nIn any event, the clear \"majority view\" at common law was that certain forms of mergers or acquisitions were \"illegal.\" As explained by Kintner, supra, \"the test of the legality of a combination . . . regardless of the form it [assumed lay] in the object of the combination\" (id., § 3.14, p. 118), and \"where the purpose, tendency, or natural consequences of a corporate combination was to monopolize or restrain trade, the combination was illegal.\" (Id., at p. 114; see also, Davies, supra, at pp. 65-69.) Accordingly, there are a number of common law cases in which mergers were held illegal. (E.g., Richardson v. Buhl (1889) 77 Mich. 632 [43 N.W. 1102, 1110] [consolidation of separate, otherwise competing, companies into one large corporation amounted to a restraint of competition, and an illegal monopoly]; People v. Chicago Gas Trust Co. (1889) 130 Ill. 268 [22 N.E. 798, 801-803] [same]; Distilling \u0026 Cattle Feeding Co. v. People (1895) 156 Ill. 448 [41 N.E. 188, 202] [same].)\n\nLike the courts construing the Sherman Act, however, the above cited common law cases condemning mergers all involved clear, actual threats to competition, not merely incipient threats to competition. And, as explained above, the Attorney General in this case alleged at most an incipient threat.\n\nMoreover, the Cartwright Act (like most states' antitrust statutes) departed from the common law in a significant way. \"Illegality\" under the common law meant only that an agreement was void and unenforceable (United States v. Addyson Pipe \u0026 Steel Co. (6th Cir. 1898) 85 Fed. 271, 279), or subject to \"prosecution by the state by quo warranto . . . .\" (Distilling \u0026 Cattle, supra, 41 N.E. 188, 203; see also Rush, supra, 18 Mo. L.Rev. 215, 219, and cases cited.) Under the Cartwright Act, however, an \"illegal\" agreement is subject to, inter alia, civil damage awards and criminal punishment. In light of the dramatically enhanced sanctions imposed by the Act, we see no anomaly in the view that the drafters of the Cartwright Act intended to make their law applicable only to situations in which the parties improperly collude and continue as separate, independent entities, and not to situations in which, by virtue of purchase and sale, or merger, one or more of the entities ceases to exist. The drafters could reasonably have believed that the existing remedy at common law under the line of cases following Buhl, supra, 43 N.W. 1102, Chicago Gas, supra, 22 N.E. 798, and\n\nDistilling \u0026 Cattle, supra, 41 N.E. 188, was sufficient to address the anticompetitive effects posed by the latter type of transaction.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn sum, we conclude that the Attorney General's interpretation of the Cartwright Act -- far from being consistent with the common law -- would in fact require a dramatic expansion of the common law. Nothing in the common law compels the Attorney General's interpretation of the Act.\n\n4. Breadth of the Cartwright Act\n\nUltimately, the Attorney General's view that the Cartwright Act applies to mergers is not supported by analogy to the Sherman Act or the common law. As shown above (i) the Sherman Act is not, contrary to our past statements, directly probative on interpretation of the Cartwright Act; (ii) the cases under both the Sherman Act and the common law show at most a willingness to allow challenges to mergers that actually restrain competition, and not those that pose merely an incipient threat to competition; and (iii) in any event, the remedy at common law was different in kind from that available under the Cartwright Act -- invalidation of the \"illegal\" agreement, etc., as opposed to civil or criminal sanctions. At bottom, therefore, the Attorney General resorts to the propositions that (a) the acts of Texas, Michigan and numerous other states, and the cases interpreting those acts, are insignificant indicators of the drafters' intent; (b) the Cartwright Act is more expansive than both of its other putative sources (Sherman Act and common law); and (c) the Cartwright Act essentially embodies the later-enacted section 7 of the Clayton Act, which as noted above allows challenges to mergers in their incipiency.\n\nFor the reasons set out above, we conclude that the 1889 Texas act and the 1899 Michigan act, the interpretation of those acts in Gates, supra, 39 S.W. 1079, and Davis, supra, 127 Fed. 875, 131 Fed. 31, and the striking similarity of the Cartwright Act to those laws, together with the enactment by three states -- including Texas -- of express antimerger provisions, clearly indicates that the drafters did not intend the Cartwright Act to apply to a purchase and sale agreement, or a merger, between otherwise competing firms.\n\nNor can we agree that the Cartwright Act is somehow broader than the Sherman Act and the common law. For this proposition, the Attorney General cites our statement in Palsson, supra, 16 Cal. 3d 920, that the bill\n\nproposed in the United States Senate by Senator Reagan -- on which our act was purportedly based -- \"was designed not to narrow the scope of the Sherman Act but to broaden it.\" (Id., at p. 926.) As we have explained above, however, our shorthand description of the Act's derivation in Palsson, although adequate for proposes of our analysis in that case, was not completely accurate: The Cartwright Act was modeled after the original Texas act of 1889 and the Michigan act of 1899, not the Reagan bill. (See ante, fn. 14.) Even assuming, however, that our Act might be in some respects broader than the Sherman Act, we find nothing to indicate that the Act was intended to be broader than -- or even equal to -- the Sherman Act on the question of merger coverage.\n\nIn the same vein, the Attorney General also rests on dicta from our recent decision in Cianci, supra, 40 Cal. 3d 903, to the effect that the Cartwright Act is \"broader in range and deeper in reach than the Sherman Act\" (id., at p. 920), and that it \"reaches beyond the Sherman Act to threats to competition in their incipiency -- much like section 7 of the Clayton Act . . . -- and thereby goes beyond 'clear-cut menaces to competition' in order to deal with merely 'ephemeral possibilities' [citations].\" (Id., at p. 918.) In view of the evidence to the contrary, Cianci's conclusory and substantively suspect dicta\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e simply cannot support the Attorney General's claim. In light of (i) the authoritative construction of identical language in similar state laws and (ii) the existence (in at least three states) of explicit merger regulations at the time of the Cartwright Act, we believe that the Legislature did not intend for the Act to reach a merger or acquisition.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIII. Application of the Unfair Practices Act to Mergers\n\nThe Unfair Practices Act, Business and Professions Code, section 17000 et seq., defines \"unfair competition\" as, inter alia, \"unlawful, unfair or fraudulent business practice. . . .\" (Id., § 17200, italics added.) As we have said, the statute is directed at \"'on-going wrongful business conduct' . . . .\" (People v. McKale (1979) 25 Cal. 3d 626, 632 [159 Cal. Rptr. 811, 602 P.2d 731].) Thus the \"practice\" requirement envisions something more\n\nthan a single transaction, as in this case; it contemplates a \"pattern' . . . of conduct\" (Barquis v. Merchants Collection Assn. (1972) 7 Cal. 3d 94, 108 [101 Cal. Rptr. 745, 496 P.2d 817]), \"on-going . . . conduct\" (id., at p. 111), \"a pattern of behavior\" (id., at p. 113), or \"a course of conduct.\" (Ibid.) No such \"practice\" is alleged or shown here. The mere fact that the Attorney General asserts in his brief that defendants have engaged in certain unlawful practices in the past, and may do so in the future, is not enough. The complaint attacks only the merger, and no ongoing conduct; hence, it does not state a cause of action under Business and Professions Code section 17200.\n\nIV. Conclusion\n\nWe conclude that neither the Cartwright Act, nor the Unfair Practices Act, was intended to apply to a merger. The judgment of the Court of Appeal is affirmed.\n\nDisposition\n\nWe conclude that neither the Cartwright Act, nor the Unfair Practices Act, was intended to apply to a merger. The judgment of the Court of Appeal is affirmed.\n\nMOSK, J., Concurring and Dissenting. I concur in the judgment as to the complaint's cause of action under the Unfair Competition Act (Bus. \u0026 Prof. Code, § 17200 et seq.). I agree with the majority that the complaint fails to effectively allege that the merger of Texaco, Inc. (hereinafter Texaco) and Getty Oil Company (hereinafter Getty) constituted a violation of the statute.\n\nBut I dissent from the judgment as to the complaint's cause of action under the Cartwright Act (Bus. \u0026 Prof. Code, § 16720 et seq.). As will appear, this claim states facts on which relief may be granted -- viz., a palpable threat to the general economic welfare of the citizens of this state.\n\nSpecifically, contrary to the majority's position the Cartwright Act applies to mergers, including the merger alleged here. This conclusion is unavoidable if the statute is construed in accordance with the plain meaning of its express terms and with an eye on the object it seeks to achieve and the evil it aims to prevent.\n\nAnd contrary to the position of Texaco and Getty, the Cartwright Act claim is not preempted. First, federal statutory law and administrative action do not stand as a bar. It is practically a matter of judicial notice (Evid. Code, § 452, subd. (h)) that the federal government has all but ceased enforcing the federal antitrust laws as they are applicable to mergers (see, e.g., Sullivan, The Antitrust Division as a Regulatory Agency: An Enforcement Policy in Transition (1986) 64 Wash. U.L.Q. 997, 1000 [between 1981\n\nand 1986, \"the Antitrust Division [of the United States Department of Justice] challenged only twenty-six mergers out of over 10,000 merger applications\"]) -- in spite of charges that \"lax merger enforcement has led to a rash of mergers among competing firms that have increased concentration, threatening a legacy of higher prices, dampened innovation, and generally more lethargic performance by U.S. industries already vulnerable to foreign competition\" (Mem. of Representative Peter W. Rodino, Jr., to Members of Subcom. on Competition and Commercial Law re Oversight Hgs. for the Antitrust Div. on Feb. 26 and Mar. 4 (Feb. 25, 1987) 100th Cong., 1st Sess., p. 1). In such a context, vigorous enforcement of state antitrust laws is plainly necessary. Texaco and Getty, however, erroneously suggest that federal antitrust law allows no room for state antitrust law and that nonenforcement of the former precludes enforcement of the latter.\n\nSecond, on demurrer and without the support of a factual record the commerce clause of the United States Constitution cannot be held to be preemptive here. It is not seriously disputed that the state's interests in the California petroleum industry generally and in Getty's California assets in particular are great. Texaco and Getty, however, would unjustifiably prevent the state from exercising its police power in this area in furtherance of the general welfare.\n\nI\n\nThe basic facts that constitute the background to this action are essentially undisputed.\n\nIn January 1984 Texaco and Getty entered into an agreement under which Texaco would acquire Getty's stock and merge Getty's assets into its business. Pursuant to the Hart-Scott-Rodino Antitrust Improvements Act (hereinafter HSR), which added section 7A to the Clayton Act and is codified in section 18a of title 15 of the United States Code, Texaco gave notice of the proposed merger to the Federal Trade Commission (hereinafter FTC or Commission), which has traditionally reviewed mergers in the petroleum industry.\n\nUnder authority given by HSR among other statutes, the FTC initiated an investigation of Texaco's proposed acquisition of Getty. As a result of its review, the Commission caused a draft complaint to issue. As summarized by the FTC staff: \"The proposed complaint states that the Commission has reason to believe that consummation of Texaco's acquisition of the Getty Oil Company ('Acquisition') would violate Section 7 of the Clayton Act\n\n[(15 U.S.C. § 18),]\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and Section 5 of the Federal Trade Commission Act [(15 U.S.C., § 45)].\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The complaint specifically alleges that the Acquisition may substantially lessen competition in several markets: (1) The manufacture and transportation of 'refined light products' (distillate fuel oil, aviation gasoline, gasoline, jet fuels, and kerosene) in the northeastern United States; (2) the wholesale distribution of gasoline and middle distillates (home heating oil and diesel fuel) to retailers in a number of cities and areas in the northeastern United States; (3) the pipeline transportation of refined light product into the state of Colorado; and (4) the sale, pipeline transportation, and refining into petroleum products of heavy crude oil in the state of California.\" (FTC, Texaco Inc. and Getty Oil Co.; Proposed Consent Agreement With Analysis to Aid Public Comment, 49 Fed.Reg. 8550, 8558 (Mar. 7, 1984) [hereinafter FTC, Proposed Consent Agreement ].)\n\nAs to the threatened anticompetitive effects of the acquisition in California, in the words of the FTC staff, \"The problem arises because Getty owns substantial heavy crude oil reserves in California. This crude oil is denser (lower in gravity) than most crude oil produced in the world and often has a higher nitrogen content. These characteristics make the crude more costly to refine. Getty has 17 percent of the production of such crude oil in the San Joaquin Valley of California, and about 140 MBD [i.e., thousand] barrels per day production across the entire state. Getty also has an extensive crude oil gathering and trunkline system capable of transporting heavy crude to California refineries. This includes a heavy crude oil trunkline with about 200 MBD in capacity, linking Bakersfield, California to San Francisco.\n\n\"Getty's crude oil production is about 100 MBD in excess of the operating capacity of its one small refinery in California. Texaco, on the other hand, refines more crude than it produces on the West Coast, with production of only 33 MBD in California, compared to about 153 MBD in refining capacity in California and Washington.\n\n\"At present, Getty is a substantial seller of heavy crude oil to 'non-integrated' California refiners -- i.e., refiners that are not also crude oil producers.\n\nThese non-integrated refiners are to some degree tied to the California heavy crude oil market because of the substantial investment they have made to process this type of crude oil. If such refiners were forced to process lighter, more expensive crude oils, their investment in heavy crude oil processing equipment might no longer be economically viable.\n\n\"Non-integrated refiners face an additional problem in gaining access to heavy crude oil. Such crude oil is rarely produced anywhere elese [ sic ] in the world and is not imported. The refiners must therefore rely on California production. However, most California producers are tied to pipeline gathering systems that are privately-owned. . . . Unlike the systems in most states, California pipelines are not common carriers. Non-integrated California refiners are therefore not guaranteed access to much of the local crude oil production.\n\n\"The above factual situation may have led to a 'two-tier' market. Major gatherers may be able to 'post' and buy crude oil at one price, while non-integrated refiners may be required to pay premiums above the posted price for the more limited supplies of crude oil available to them. (The posted price is the price at which major, integrated purchasers offer to buy crude oil from third parties, rather than the price at which sellers offer to sell crude oil to third parties.) For example, non-integrated refiners cite the $2-$3 per barrel premiums that they have offered for crude oil available from the Elk Hills Naval Petroleum Reserve in California. Texaco, with more refining capacity than West Coast crude production, is in fact one of the few major companies to bid at Elk Hills, winning 10 MBD of crude oil at $2.10 premium above the posted price. Most major integrated oil companies have not participated at the Elk Hills' auctions, relying instead on their own production and purchases at the posted price.\n\n\"As a result of the acquisition, Texaco may have some incentives to divert the Getty heavy crude oil to its own refining system. This may be more profitable than selling the crude oil to others because of the crude oil Windfall Profit Tax Act of 1980. A sale of the crude oil at a premium over the posted price might, in some situations, increase Texaco's Windfall Profit Tax liability. Alternatively, if Texaco were to process the crude oil internally, it might be able to lower its tax payments by transferring the crude oil into its refinery at the lower posted price and by shifting the profits to its refining subsidiary, where they would be taxed at a lower rate.\n\n\"Certain non-integrated California refiners might be vulnerable if Texaco should decide to utilize Getty heavy crude oil in this manner. In particular, non-integrated refiners in the San Francisco area served by the Getty\n\ntrunkline may have no economic alternative source of supply. If these refineries were to fail and Texaco were to acquire them in order to process additional heavy crude oil, the West Coast refining HHI [i.e., Herfindahl-Hirschman Index, a measure of market concentration] would increase by 74 points to 1206. Additional refining failures in other parts of California might result in a greater increase in concentration.\" (FTC, Proposed Consent Agreement, supra, 49 Fed.Reg. at pp. 8561-8562, fns. omitted.)\n\nOn February 13, 1984, in the exercise of its prosecutorial discretion, the FTC entered into a proposed consent order with Texaco in settlement of the draft complaint. Under the proposed consent order, in the summary prepared by the FTC staff, Texaco would be required to: \"(a) 'Divest' (sell) certain of Getty's petroleum-related assets in the northeastern United States; (b) divest a Texaco refinery located in the Northeast; (c) vote to expand (for 10 years) a major refined product pipeline that supplies the Northeast and of which Texaco is a co-owner; (d) divest certain Getty petroleum assets in specified Rocky Mountain, midwestern, and southwestern states; and (e) supply certain independent California refiners with Getty crude oil, on specified terms for set time periods.\" (FTC, Proposed Consent Agreement, supra, 49 Fed.Reg. at p. 8558.)\n\nCommissioner Michael Pertschuk issued a statement dissenting from the FTC's decision to agree to settle the matter and not challenge the merger: \"I dissent from the Commission's decision to accept the consent agreement with Texaco and Getty because it fails to address adequately the central competitive problem in the acquisition -- Texaco's gaining control of Getty's crude oil reserves in California. The Commission acknowledges the competitive risks from the acquisition of these crude reserves -- Texaco's cutting off the flow of crude oil to independent refiners in California. But, instead of stopping Texaco from getting the crude, it opts for an uncertain, temporary and highly regulatory approach which will involve us in overseeing the sale of crude to California refiners. And, what's more, this dubious half-measure terminates after five years when Texaco will be free to cut off independents.\n\n\". . . .\n\n\"This merger is the largest in history. Texaco will pay about $10.1 billion for Getty. The divestiture of assets required by the proposed order amount to about 2% of the total value of the acquisition according to staff, so that the overwhelming percentage of this transaction will survive intact. Texaco is now the fourth largest industrial corporation in the U.S. and the third largest oil company with 1982 sales of $47 billion and assets of over $27 billion. Getty is the 14th largest oil company with total 1982 revenues of\n\n$12 billion. Getty is the 6th largest oil company in crude reserves, while Texaco is the 8th largest. A combined Texaco-Getty firm will be the third largest crude oil producer and will have almost $60 billion in sales, putting it in a virtual tie with GM and Mobil as the second largest industrial corporation behind Exxon.\n\n\". . . .\n\n\"The reason Texaco wants to buy Getty is no secret. No one seriously argues that this merger will lead to even theoretical 'efficiencies' in scale or production synergies or even ethereal management efficiencies from Texaco learning Getty's secrets. Getty has one overriding attraction -- crude oil. It has overall 1.2 billion barrels of proven reserves of crude oil, condensate and natural gas liquids according to a November 1983 report of the American Petroleum Institute. It is the third largest producer of crude oil in California. It, like a number of smaller oil companies rich in crude oil, is an incredibly attractive plum to the major oil companies hungry for dwindling reserves. As stock market values of companies remain low compared to the value of the oil assets they own, and exploration costs go up, the incentive to buy another company's oil rather than develop one's own becomes irresistible. Keeping companies from acting on that powerful incentive when the result would be anticompetitive is one reason we have antitrust laws.\n\n\". . . .\n\n\"Getty has more crude oil than it can use in California and sells the excess to independent refiners. For example, it supplies Tosco, the largest non-integrated refiner in California. The key competitive problem is that Texaco does not have the same incentives to supply the independent refiners as does Getty. By transferring crude oil to its own refineries rather than sell it on the open market, Texaco can reduce its accounting profits at the crude oil level and, thus, its liability under the Windfall Profits Tax. In addition, by keeping California heavy crude off the market and helping to push up its price to independent refiners, Texaco can cut the profit margins of independent refiners which are its downstream competitors in the refining market and perhaps precipitate a sale of refining assets to itself at bargain prices. Finally, by acquiring Getty's pipelines, Texaco can increase its ability to control the flow of crude oil to refiners, particularly in the San Francisco and Los Angeles areas.\n\n\"The majority of the Commission acknowledges all these problems by accepting this consent agreement but opts for a risky regulatory solution and one which evaporates after a limited period of time. . . .\n\n\". . . .\n\n\"Not only is the Commission willing to roll the dice on its regulatory solution, but it terminates after five years in the case of the requirement to supply crude (and 10 years in case of the requirement to allow access to the Santa Fe Springs-Los Angeles pipeline). The entire justification for the five year limitation in the . . . staff memorandum, as far as I can tell, is one sentence: 'At that point, many industry observers expect there will be sufficient new offshore supplies of heavy crude oil to satisfy all market demands.' This blithely optimistic assertion must be assessed in the context of the staff's arguments that California heavy crude is a separate market and that existing refiners have invested heavily in particular facilities in reliance upon its continued supply. In addition, heavy crude oils are not imported and access to supply will continue to be limited by whoever controls the pipelines.\n\n\"The staff states that the most likely anticompetitive effect of Texaco's acquisition of Getty's California crude and pipelines 'may be denial of crude oil and transportation to the independent sector of the California refining industry, leading to refining failures and perhaps a significant increase in West Coast refining concentration.' These economic stakes are too enormous to justify the risks that the Commission is willing to run with this consent agreement.\" (FTC, Proposed Consent Agreement, supra, 49 Fed.Reg. at pp. 8562-8564 (dis. statement of Comr. Pertschuk).)\n\nIn publishing the proposed consent order, the FTC invited interested members of the public to submit comments within 60 days. In that period, the Attorney General of California, among others, offered comments.\n\nOn July 10, 1984, under authority given by HSR among other statutes, the FTC ordered the issuance of the complaint in the form contemplated by the agreement and entered a final consent order that reflected some of the comments made by the Attorney General and others, but was substantially the same as the proposed order. (In re Texaco Inc. and Getty Oil Co. (1984) 104 F.T.C. 241.)\n\nAgain Commissioner Pertschuk dissented: \"The final order as adopted by the majority . . . fails to remedy a major competitive problem concerning independent refiners in California and instead creates a highly regulatory, incredibly complex and temporary crude supply program. . . .\n\n\"The staff's theory concerning the west coast crude oil market is that Getty has been the largest supplier of heavy crude oil to non-integrated\n\nrefiners in California. Texaco does not have the same incentives as Getty to supply independent refiners, in large part because of the Windfall Profits Tax, and, therefore, is more likely to divert crude to its own refinery system. Such a diversion would endanger the long run viability of refiners there and provide a means and added incentive for Texaco to attempt to acquire them at distress prices.\n\n\"The Commission accepts this theory but opts for the inadequate remedy of requiring Texaco to supply crude oil for five years to independent refiners. This crude allocation scheme has become more complex between the initial and final versions of the order because of new questions about how to calculate price, volume, and related terms such as transportation and credit. . . . According to staff, Texaco itself argued in negotiations that it foresaw the possibility of large numbers of disputes and the resolution of them 'might take 100 years.' . . . [The] majority's confident reliance on only a five year requirement is speculative and may well prove inadequate.\" (In re Texaco Inc. and Getty Oil Co., supra, 104 F.T.C. at pp. 261-262 (dis. statement of Comr. Pertschuk).)\n\nII\n\nOn July 16, 1984, the Attorney General filed the complaint in this action, asserting against Texaco and Getty (hereinafter sometimes referred to collectively as defendants) one cause of action under the Cartwright Act (Bus. \u0026 Prof. Code, § 16720 et seq.)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and another under the Unfair Competition Act (id., § 17200 et seq.).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn the Cartwright Act claim, the Attorney General first made several allegations defining the relevant product and geographical markets. Those allegations are in substance as follows.\n\nCrude oil is a relevant product market, and California is a relevant geographical market for this product. California crude oil is a relevant\n\nproduct submarket, and California is the relevant geographic market for this product. In 1982, Getty was the third largest producer of California crude oil, producing about 49 million barrels or about 13 percent of the total production. In the same year Texaco was the seventh largest producer of California crude oil, producing about 15 million barrels or about 4 percent of the total production. Getty produces substantially more heavy crude oil than it can refine in California, and Texaco produces substantially less heavy crude oil than it can refine in the state.\n\nThe refining of crude oil is a relevant product market, and California is a relevant geographic market for refining. Texaco has a refinery in the Los Angeles area with a capacity of 75,000 barrels of crude oil per day. Getty has a refinery in the Bakersfield area with a capacity of 63,000 barrels per day. Independent refiners account for about 33 percent of total California refinery capacity and 22 percent of total California motor gasoline refining capacity.\n\nTexaco and other major petroleum companies have historically refrained from selling crude oil to independent refineries in California at competitive prices. Getty has historically been a significant supplier of crude oil to independent refiners in the state. Of its total crude oil production of 130,000 barrels per day in 1983, Getty supplied more than 100,000 barrels per day to independent refiners in California. Texaco's California refinery competes with the refineries of independents.\n\nThe marketing of each of several specified products is a relevant product market, and California is a relevant geographic market for each product. One such relevant product market is the marketing of motor gasoline. In 1983 Texaco sold about 643 million gallons of motor gasoline in California, and had about 1,221 retail branded outlets. In the same year Getty sold about 116.4 million gallons in the state, and owned 6 retail outlets and supplied 185 California unbranded jobbers with refined petroleum products. Getty has historically supplied motor gasoline to independent marketers in California. Independent refiners have traditionally been the primary suppliers of motor gasoline to independent marketers in the state. Another relevant product market is the marketing of low sulfur fuel. Getty is and has been a significant supplier of low sulfur fuel for Central and Southern California industrial consumers. In 1983, Getty's production of low sulfur fuel was about 20,000 barrels per day. Texaco has historically refused to sell refined products to independent marketers in California.\n\nThe transportation of crude oil through pipelines is a relevant product market. One relevant geographic market for crude oil pipeline operations is\n\nbetween the oil-producing fields in the San Joaquin Valley and refinery centers in the San Francisco area. Another relevant geographic market is between the oil producing fields in the San Joaquin Valley and refinery centers in the Los Angeles basin. Crude oil is produced at various places in California. From the wellhead it is delivered through a system of gathering and feeder pipelines to pump stations where it is transported through transmission pipelines to refinery centers. Getty owns and operates a proprietary pipeline system that gathers crude oil in the San Joaquin Valley. Getty owns about 629 miles of pipelines in California; its San Joaquin Valley Pipeline is a major transmission system for the supply of crude oil to San Francisco area refiners and is the only independent pipeline serving that area. Major oil companies in California have been reluctant to permit independent producers and refiners to use their pipeline systems.\n\nThe Attorney General then made several allegations to state a Cartwright Act violation. Those allegations are in substance as follows.\n\nOn January 6, 1984, Texaco and Getty entered into a merger agreement pursuant to which Getty granted Texaco an option to purchase authorized but unissued shares constituting about 10.2 percent of the total Getty shares that would be outstanding after such issuance. On January 6 and 8, Texaco entered into separate agreements to purchase voting securities constituting about 11.8 percent and 40.2 percent of the outstanding Getty shares. On January 9, Texaco commenced a tender offer for 35 percent of Getty voting securities with the intention of effectuating a follow-up merger for the remaining outstanding shares. Texaco's acquisition of Getty's California assets violates the Cartwright Act.\n\nTexaco has an incentive to increase its refining of California crude oil and to lessen competition from independent refiners. Its acquisition of Getty is likely to increase its incentives and ability to deny independent refiners California crude oil and access to proprietary pipelines.\n\nThe effect of the acquisition may be substantially to lessen competition in each of the specified relevant markets in California in violation of the Cartwright Act in the following ways, among others: (a) actual competition will be eliminated between Texaco and Getty in the marketing of California crude oil; (b) actual competition between competitors in general in the relevant product markets in California will be lessened; (c) California independent refiners may be denied access to California crude oil that is currently supplied by Getty and is necessary to the profitable operation of their refineries; (d) for reasons unrelated to the efficient use of resources, Texaco may have the incentive and ability to deny, and may in fact deny, independent\n\nrefiners access to California crude oil and proprietary pipeline transportation, thereby increasing the difficulty of entry into California refining and decreasing the competitive significance of independent California refiners; (e) Texaco's acquisition of Getty will result in significantly higher concentration ratios in the relevant markets; (f) already high barriers to entry in the California crude oil, refining, pipeline transmission systems, and retail product markets will be substantially raised; (g) actual competition between Texaco and Getty for the transportation in California of crude oil and refined products by pipelines will be eliminated; (h) competition in the marketing of motor gasoline and other refined products may be substantially lessened in California such that the prices of these commodities might be affected; (i) competition in the market for California crude oil may be substantially lessened such that its price might be affected; and (j) competition in the transportation of California crude oil by pipelines may be substantially lessened such that the price of the crude oil might be affected.\n\nIn the Unfair Competition Act claim, the Attorney General first incorporated by reference the allegations of the Cartwright Act cause of action and then asserted that Texaco's acquisition of Getty's California assets constituted an unfair business practice in violation of the unfair competition statute.\n\nIn the complaint's prayer the Attorney General requested the following relief: (a) a temporary restraining order and preliminary injunction requiring Texaco to hold separate and operate separately Getty's California assets pending adjudication of the merits; (b) a declaration that Texaco's acquisition of Getty's California assets violated the Cartwright Act; (c) a declaration that Texaco's acquisition of Getty's California assets violated the Unfair Competition Act; (d) an injunction requiring Texaco to divest itself of Getty's California assets; (e) civil penalties pursuant to the Unfair Competition Act in an amount to be determined by the court; (f) costs of suit; and (g) such other and further relief as the court should deem just and proper.\n\nIn addition to filing the complaint, the Attorney General also applied for a preliminary injunction to require Texaco to hold and operate Getty's California assets separate pending adjudication of the merits. The court issued an order to show cause.\n\nDefendants generally demurred to the complaint on the following grounds: it failed to allege facts sufficient to state a cause of action under either the Cartwright Act or the Unfair Competition Act; the remedy of divestiture was unavailable under state law; the injunctive relief sought\n\nwould unduly burden interstate commerce; and enforcement of the Cartwright Act was preempted by the FTC consent order. Defendants also opposed the Attorney General's application for a preliminary injunction.\n\nThe court held that the complaint failed to allege facts sufficient to state a claim under either the Cartwright Act or the Unfair Competition Act, and that it could not be amended to allege such facts. Specifically, the court concluded that the Cartwright Act did not apply to mergers by acquisition, and that the Unfair Competition Act was not implicated on the facts that were or could be alleged. It added: \"In light of the ruling of the Court, the Court does not reach the constitutional issues raised by defendants' arguments under the Supremacy and Commerce Clauses. However, the Court notes that had it ruled otherwise on the general demurrer, it would find that although no claim is made that the Sherman Act, the Clayton Act or the Hart-Scott-Rodino Antitrust Improvements Act preempt application of the Cartwright Act or the Unfair Practices Act, the FTC Consent Order very specifically regulates the conduct of Texaco in California pursuant to the merger. The Court could find that the relief sought in the complaint is therefore barred by the doctrine of preemption.\" Accordingly, the court sustained the demurrer without leave to amend, discharged the order to show cause and denied the application for preliminary injunction, and entered judgment of dismissal.\n\nOn appeal, the Attorney General contended that the Cartwright Act did in fact apply to mergers, that the allegations of the Unfair Competition Act claim were legally sufficient, that the injunctive relief sought was neither preempted by the consent order nor unduly burdensome to interstate commerce, and that an entitlement to a preliminary injunction had been established.\n\nThe Court of Appeal affirmed. It concluded that the consent order preempted the action and did not reach the other issues.\n\nThereupon, the Attorney General petitioned for review, contending that the complaint stated claims under the Cartwright Act and the Unfair Competition Act, and that the action was not preempted by the consent order. Defendants answered the petition and requested that it be denied. They asked, however, that in the event review was granted the court address as an additional issue whether the relief sought in this action would contravene the commerce clause by directly regulating their interstate operations or by placing an excessive burden on nationwide mergers. The court granted review.\n\nIII\n\nThe Attorney General contends that the first cause of action alleges facts that are legally sufficient under the Cartwright Act, is not preempted by HSR itself or by the consent order entered pursuant thereto, is not barred by the commerce clause, and as a result states a claim on which relief may be granted. For the reasons that follow, I agree.\n\nA\n\nThe first cause of action, as will appear, alleges facts that are legally sufficient under the Cartwright Act.\n\n1\n\nAt the threshold it must be determined whether the Cartwright Act in fact applies to mergers. In resolving this issue, I am guided by well settled principles. \"[The] fundamental rule [is] that a court 'should ascertain the intent of the Legislature so as to effectuate the purpose of the law.'\" (Tripp v. Swoap (1976) 17 Cal. 3d 671, 679 [131 Cal. Rptr. 789, 552 P.2d 749], quoting Select Base Materials v. Board of Equal. (1959) 51 Cal. 2d 640, 645 [335 P.2d 672].) In this task it first looks to the language of the statute itself. (E.g., Brown v. Superior Court (1984) 37 Cal. 3d 477, 485 [208 Cal. Rptr. 724, 691 P.2d 272]; Tracy v. Municipal Court (1978) 22 Cal. 3d 760, 764 [150 Cal. Rptr. 785, 587 P.2d 227]; Leroy T. v. Workmen's Comp. Appeals Bd. (1974) 12 Cal. 3d 434, 438 [115 Cal. Rptr. 761, 525 P.2d 665].)\n\nWhen the language is clear and there is accordingly no uncertainty as to the legislative intent, it looks no further. (E.g., In re Waters of Long Valley Creek Stream System (1979) 25 Cal. 3d 339, 348 [158 Cal. Rptr. 350, 599 P.2d 656]; Solberg v. Superior Court (1977) 19 Cal. 3d 182, 198 [137 Cal. Rptr. 460, 561 P.2d 1148].) In such a case, it does nothing less, and nothing other, than enforce the statute according to its terms. (Leroy T. v. Workmen's Comp. Appeals Bd., supra, 12 Cal. 3d at p. 438; accord, Caminetti v. United States (1917) 242 U.S. 470, 485 [61 L.Ed. 442, 452-453, 37 S.Ct. 192].) This is so because, as a general matter, a court follows the plain meaning of a statute. (E.g., Atlantic Richfield Co. v. Workers' Comp. Appeals Bd. (1982) 31 Cal. 3d 715, 726 [182 Cal. Rptr. 778, 644 P.2d 1257]; People v. Belleci (1979) 24 Cal. 3d 879, 884 [157 Cal. Rptr. 503, 598 P.2d 473].)\n\nWhen, however, a court finds itself compelled to look beyond the statutory language, it applies the \"rule that the object which a statute seeks to\n\nachieve and the evil which it seeks to prevent are of prime consideration in the statute's interpretation\" (Judson Steel Corp. v. Workers' Comp. Appeals Bd. (1978) 22 Cal. 3d 658, 669 [150 Cal. Rptr. 250, 586 P.2d 564]; accord, Freeland v. Greco (1955) 45 Cal. 2d 462, 467 [289 P.2d 463]).\n\nApplying these principles I conclude, as I shall explain, that the Cartwright Act applies to mergers.\n\nTo begin with, the statutory language in this regard is plain and as such clearly reveals the Legislature's intent, and hence there is no need to look beyond the statute's terms. The act provides in relevant part that \"every trust is unlawful, against public policy and void\" (Bus. \u0026 Prof. Code, § 16726), and defines a \"trust\" to include \"a combination of capital . . . by two or more persons . . . To make or enter into or execute or carry out any contracts, obligations or agreements of any kind or description, by which they . . . Agree to pool, combine or directly or indirectly unite any interests that they may have connected with the sale or transportation of any . . . article or commodity, that its price might in any manner be affected\" (id., § 16720, subd. (e)(4)).\n\nIn this section the term that is crucial for present purposes is \"combination.\" In the abstract, that term broadly refers to any arrangement, regardless of whether the combining entities maintain separate and independent interests and identities after they combine. In its statutory context, the term has the same broad scope: the comprehensive language of the statute plainly requires such a construction. Properly qualified, \"combination\" might refer narrowly to only that kind of arrangement in which the combining entities maintain separate and independent interests and identities. No such qualification, however, is expressed or implied in the statute. Thus, in accordance with its express terms the Cartwright Act must be understood to cover mergers -- which, of course, constitute one kind of \"combination of capital.\"\n\nMoreover, even if, for purposes of discussion, I should look beyond the language of the Cartwright Act to the object sought and the evil to be prevented, I would come to the same conclusion as to the meaning of \"combination\" and, more generally, the coverage of the act.\n\nConsumer welfare is a principal, if not the sole, goal of antitrust laws -- of which, of course, the Cartwright Act is one -- and accordingly output restriction is one of their principal targets. (Cianci v. Superior Court (1985) 40 Cal. 3d 903, 918 [221 Cal. Rptr. 575, 710 P.2d 375]; Marin County Bd. of Realtors, Inc. v. Palsson (1976) 16 Cal. 3d 920, 935 [130 Cal. Rptr. 1,\n\n549 P.2d 833]; see, e.g., National Soc. of Professional Engineers v. U.S. (1978) 435 U.S. 679, 686-696 [55 L.Ed.2d 637, 646-653, 98 S.Ct. 1355] [discussing federal antitrust laws]; see generally 1 Areeda \u0026 Turner, Antitrust Law (1978) §§ 103-113, pp. 7-33 [hereinafter Areeda \u0026 Turner] [same]; Bork, The Antitrust Paradox (1978) pp. 50-89 [same].)\n\nIn other words, \"Antitrust laws are designed primarily to aid the consumer. They rest 'on the premise that the unrestrained interaction of competitive forces will yield the best allocation of our economic resources, the lowest prices, the highest quality and the greatest material progress, while at the same time providing an environment conducive to the preservation of our democratic political and social institutions.'\" (Marin County Bd. of Realtors, Inc. v. Palsson, supra, 16 Cal. 3d at p. 935, quoting Northern Pac. R. Co. v. United States (1958) 356 U.S. 1, 4 [2 L.Ed.2d 545, 549, 78 S.Ct. 514].)\n\nIndeed, the Cartwright Act declares as its ultimate purpose \" to promote free competition in commerce and all classes of business in this state.\" (Stats. 1907, ch. 530, tit., p. 984, italics in original; see People v. Sacramento Butchers' Assn. (1910) 12 Cal. App. 471, 476 [107 P. 712].)\n\nIt is beyond question that the consumer's interests can be adversely affected by a \"combination\" in the form of a merger as well as by a \"combination\" in which the parties do not attain to full integration.\n\nThus, when the object the statute seeks to attain and the evil it aims to prevent are considered the construction required by the provision's express terms is confirmed: the Cartwright Act covers mergers.\n\nIn Munter v. Eastman Kodak Co. (1915) 28 Cal. App. 660 [153 P. 737] -- the first reported decision relevant for present purposes -- the Court of Appeal impliedly construed the Cartwright Act to similar effect. It stated: \"There is no violation of the statute in the mere act of a person purchasing or otherwise securing control of a number of different concerns engaged in the business of manufacturing and selling the same article or commodity. The control by one person or corporation of a number of other concerns engaged in its line of business can only become unlawful when the effect of such combination is to establish and foster a monopoly which affects or injures the public welfare. In other words, the statute against predatory trusts or business combinations is violated only where a combination has been formed and is maintained for the purpose and having the effect of creating and fostering restrictions in trade or commerce or preventing legitimate competition in the manufacture and sale or purchase of merchandise,\n\nproduce, or any commodity.\" (Id. at p. 666.) The preceding discussion constitutes the closest thing we have to a contemporaneous construction of the Cartwright Act, written as it was less than a decade after the statute was enacted and much before its language could come to appear ambiguous and its purpose obscure. As such, it confirms what to my mind stands in no need of further confirmation: the Cartwright Act applies to mergers.\n\nBut even if my construction were not compelled by the express language of the Cartwright Act and its manifest purpose, it would be required by certain canons of statutory construction. It is clear that \"if the statute has been judicially construed, such construction of the statutory words becomes part of the statute 'as if it had been so amended by the legislature.'\" (In re Davis (1966) 242 Cal. App. 2d 645, 653 [51 Cal. Rptr. 702] (per Kaus, J.), quoting Winters v. New York (1948) 333 U.S. 507, 514 [92 L.Ed. 840, 849, 68 S.Ct. 665], and citing Cramp v. Bd. of Public Instruction (1961) 368 U.S. 278, 285 [7 L.Ed.2d 285, 291, 82 S.Ct. 275], which itself quotes the Winters language.) It follows that \"To alter the judicial interpretation of a statute the Legislature must alter the statute.\" (Sharpe v. Superior Court (1983) 143 Cal. App. 3d 469, 474 [192 Cal. Rptr. 16].) Applying these rules I conclude that the Cartwright Act should be construed as applying to mergers: in Munter v. Eastman Kodak Co., supra, 28 Cal. App. 660, the Court of Appeal impliedly adopted such a construction, and in the more than 70 years that have followed the Legislature has done absolutely nothing to alter the statute in relevant aspect.\n\nIn the course of their discussion, the majority reject defendants' claim that the act was merely a codification of the common law, and that under the common law acquisitions were plainly lawful per se and mergers by acquisition were not considered \"trusts\" or \"combinations\" subject to prohibition. I agree.\n\nFirst, the Cartwright Act is not a mere codification of the common law. The act does indeed \"have [its] roots in the common law\" (Chicago Title Ins. Co. v. Great Western Financial Corp. (1968) 69 Cal. 2d 305, 315 [70 Cal. Rptr. 849, 444 P.2d 481]) -- but not its boundaries. As the court recently explained in Cianci v. Superior Court, supra, 40 Cal. 3d 903: \"At the very least, the Sherman Act codified the common law\" (id. at p. 919); but \"the Cartwright Act is broader in range and deeper in reach than the Sherman Act\" (id. at p. 920), going as it does \"beyond the Sherman Act to threats to competition in their incipiency -- much like section 7 of the Clayton Act\" (id. at p. 918).\n\nIn support of their point, defendants rely on Rolley, Inc. v. Merle Norman Cosmetics (1954) 129 Cal. App. 2d 844 [278 P.2d 63]. Their reliance,\n\nhowever, is misplaced. In that case, to be sure, the Court of Appeal did indeed state that the Cartwright Act \"is considered basically merely a statutory enactment of the common law of the state.\" (Id. at p. 846.) In so stating, it misread the following language in Speegle v. Board of Fire Underwriters (1946) 29 Cal. 2d 34 [172 P.2d 867]: \"The Cartwright Act merely articulates in greater detail a public policy against restraint of trade that has long been recognized at common law.\" (Id. at p. 44.) Read in context, that statement does not support the Rolley court's language, appearing as it does in a discussion to the effect that the Cartwright Act is at least as broad in scope as the common law. Nor does the statement support the Rolley court's language even when it is read out of its context: the \"[articulation] in greater detail [of] a public policy against restraint of trade that has long been recognized at common law\" (Speegle, supra, at p. 44) is plainly not equivalent to \"merely a statutory enactment of the common law\" (Rolley, supra, at p. 846). In light of the discussion in Cianci, supra, 40 Cal. 3d at pages 917-920, the Court of Appeal language in Rolley is erroneous.\n\nIn any event, the common law is not as defendants represent it to be. To begin with, \"trust,\" which was strictly not a common law term (see Letwin, Congress and the Sherman Antitrust Law: 1887-1890 (1956) 23 U. Chi. L.Rev. 221, 240-247 [hereinafter Letwin, Congress and the Sherman Antitrust Law ]; Stimson, \" Trusts \" (1887) 1 Harv. L.Rev. 132, 132-133 [hereinafter Stimson, \" Trusts \"]), and \"combination,\" which was (see Letwin, Congress and the Sherman Antitrust Law, supra, at p. 243), were each broad enough to encompass mergers. To be sure, both terms were typically used to refer to economic arrangements that did not amount to a full integration. (See, e.g., Stimson, \" Trusts,\" supra, at p. 133 [discussing trusts]; Letwin, Congress and the Sherman Antitrust Law, supra, at p. 243 [discussing trusts and combinations].) Each, however, could refer to such an integration.\n\nFor example, in State v. Neb. Distilling Co. (1890) 29 Neb. 700 [46 N.W. 155], the Nebraska Supreme Court declared the conveyance of the Nebraska Distilling Company to the Whiskey Trust to be null and void, holding that the acquisition and consequent merger constituted a \"combination\" which was in total restraint of trade and as such illegal. (Id. at p. 719.)\n\nSimilarly, in the celebrated case of Richardson v. Buhl (1889) 77 Mich. 632 [43 N.W. 1102], the Michigan Supreme Court held the Diamond Match Company to be an illegal \"combination.\" As the opinion makes clear, Diamond was a single corporation which aimed at, and achieved, \"the aggregation of an enormous amount of capital, sufficient to buy up and absorb all of that kind of business done in the United States and Canada, to prevent any other person or corporation from engaging in or carrying on\n\nthe same, thereby preventing all competition in the sale of the article manufactured.\" (Id. at p. 657.) The court effectively held that the acquisitions and consequent mergers constituted a single grand, and illegal, \"combination.\" As stated above, the case was celebrated. In the long, formal address in which he opened the Senate debate on his antitrust bill, Senator John Sherman of Ohio referred to Richardson v. Buhl as \"quite a leading case\" and read into the record the opinion of the court and the concurring opinion in their entirety. (21 Cong. Rec. 2458 (1890).)\n\nFurther, in a noted article Frederic J. Stimson recognized that the term \"trust\" covered arrangements under which one \"corporation merely relinquishes [to another] its power of management through and by its own stockholders\" and arrangements under which several corporations make an \"assignment of all the corporate assets\" to a holding company (Stimson, \" Trusts,\" supra, 1 Harv. L.Rev. at p. 140). But he also made it plain that the term covered as well an arrangement whereby several corporations \"merge . . . themselves, or their franchises . . . .\" (Ibid.)\n\nMoreover, it is not the case that at common law acquisitions were plainly lawful per se. In support of their claim that they were, defendants rely fundamentally on the following language in the New Jersey Supreme Court's opinion in Trenton Potteries Co. v. Oliphant (1899) 58 N.J. Eq. 507, 524 [43 A. 723]: \"A person engaged in any manufacture or trade, having the right to acquire and possess property, and to do with it what he chooses, may lawfully buy the business of any of his competitors. His first purchase would at once diminish competition. If he continued to purchase, each succeeding transaction would remove another competitor. If his capital was large enough to enable him to buy the business of all competitors, the last purchase would completely exclude competition, at least for a time. But in the absence of legislative restrictions (if such could be imposed) upon the acquisition of such property and its use when so acquired, courts could impose no limitations. They would be obliged to enforce such contracts, notwithstanding the effect was to diminish or even to exclude competition.\"\n\nTo my mind, the Trenton Potteries language does not present an accurate description of the state of the common law on the point. Indeed, it is at odds with the reasoning and result in Richardson v. Buhl, supra, 77 Mich. 632, and State v. Nebraska Distilling Co., supra, 29 Neb. 700 -- cases that even defendants do not claim are aberrations.\n\nAs the Kentucky Supreme Court stated in Merchants' Ice \u0026 Cold Storage Co. v. Rohrman (1910) 138 Ky. 530 [128 S.W. 599]: \"[We] cannot give our approval to the doctrine announced by the New Jersey court. It is not only\n\nentirely at variance with our public policy as often declared both by the legislative and judicial departments of the state, but it is contrary to the great weight of authority. Indeed we have not found any case that goes so far in an effort to promote trusts and encourage monopolies.\" (Id. at pp. 550-551.)\n\nThe Kentucky court explained: \"The question is too delicate and involves too many important rights to attempt an accurate statement of principles that might be applied to each case. On the one side, we have the inalienable right of the citizen to contract, and buy and sell, in the open market that which is the legitimate subject of barter and sale, and this privilege should not be abridged without good reason. On the other side, we have the interest of the public that must be protected, even though it cost a part of the liberty of the individual. It is not the purpose of the law to control or hinder enterprising, energetic men, with brains or capital, from developing an industry or building up a great trade or business. The largest freedom in commercial enterprises compatible with the public good should be allowed. And so there should be no interference with the right to contract or to buy or sell unless it is apparent that the main purpose and reasonable effect of the contract is to create a condition of affairs that will enable the purchaser to control the market, destroy competition, and create a condition incompatible with the public good.\" (138 Ky. at p. 543.)\n\nTo the extent that defendants may be understood to argue at bottom that the spirit of the common law would not brook restrictions on the sale and purchase of businesses they are unpersuasive. The common law prohibited \"engrossing,\" which had originally referred to \"buying up large quantities of a good in order to sell it at raised prices . . . , but . . . came to mean cornering the supply of a commodity . . . .\" (Letwin, Congress and the Sherman Antitrust Law, supra, 23 U. Chi. L.Rev. at p. 241; accord, Adler, Monopolizing at Common Law and Under Section Two of the Sherman Act (1917) 31 Harv. L.Rev. 246, 257-258.) In the face of such a prohibition, it is hard to conclude that the common law would deem the purchase of a business -- through which \"cornering\" could be effected or furthered -- to be lawful per se.\n\nDefendants also argue that the common law recognized that an acquisition and consequent merger could produce certain efficiencies that an arrangement between the parties not amounting to a full integration could not. For argument's sake I shall assume that defendants are correct. But from that premise it does not follow that the common law did or would treat all acquisitions as lawful per se.\n\nIn the course of their discussion, however, the majority do accept defendants' claim that the Cartwright Act has as its ultimate source a Texas antitrust statute (Act of Mar. 30, 1889, 1889 Tex. Gen. Laws, ch. 117, pp. 141 et seq.), that this statute had been definitively construed in Gates v. Hooper (1897) 90 Tex. 563 [39 S.W. 1079], as not covering mergers, and that the Legislature must be deemed to have incorporated that construction. I cannot agree.\n\nFor argument's sake, I shall assume that the Cartwright Act in fact has the Texas statute as its ultimate source. It does not follow, however, that a California court would be compelled to follow the construction of the statute adopted by the court in Gates.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nI recognize, to be sure, the rule of statutory construction that \"When legislation has been judicially construed and a subsequent statute on the same or an analogous subject is framed in the identical language, it will ordinarily be presumed that the Legislature intended that the language as used in the later enactment would be given a like interpretation.\" (Los Angeles Met. Transit Authority v. Brotherhood of Railroad Trainmen (1960) 54 Cal. 2d 684, 688 [8 Cal. Rptr. 1, 355 P.2d 905].)\n\nWhat the rule establishes, I must emphasize, is only a presumption of legislative intent. Moreover, even when the presumption properly operates it does not compel the adoption of the judicial construction of the other\n\njurisdiction's statute. \"In fact, the courts of the adopting state are not absolutely bound and may refuse to follow the construction of the statute if they feel that it is against the weight of authority, the underlying precedent is no longer vital, is inconsistent with policy, or is not based on sound reasoning.\" (2A Sutherland on Statutes and Statutory Construction (Sands 4th ed. 1984 Singer rev.) § 52.02, p. 522, fns. omitted; see also Acco Contractors, Inc. v. McNamara \u0026 Peppe Lumber Co. (1976) 63 Cal. App. 3d 292, 296 [133 Cal. Rptr. 717].)\n\nWere a California court squarely faced with the question whether to follow the Texas court's construction of the Texas statute in Gates, I believe it would be compelled to answer it in the negative. In my view, it could not presume that the Legislature approved of the Gates holding or intended it to be the law of California. First, the reasoning of Gates is unsound: the Texas court recited that the purchaser bought the seller's business, but no more than two sentences later declared, \"By this transaction neither the capital, skill, nor acts of the parties were brought into any kind of union.\" (90 Tex. at p. 564 [39 S.W. at p. 1080], italics added.)\n\nSecond and perhaps more important, Gates is squarely inconsistent with the legislative policy of consumer welfare which underlies and informs the Cartwright Act. Specifically, the opinion must be deemed largely if not primarily an exercise in formalism: its attempt at an economic analysis of the consequences of the acquisition of one person's business by another is empty. On its very face, by contrast, the Cartwright Act is concerned with economic effects. Indeed, \"the statutory language speaks solely in terms of economic effects . . . .\" (Cianci v. Superior Court, supra, 40 Cal. 3d at p. 918, italics added.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nDefendants argue that the Legislature's original intent notwithstanding, the Cartwright Act should not now be construed to apply to the merger at issue here: if the court were to so construe the statute, it would effectively create a new criminal offense without legislative authority and subject them to criminal liability without first giving fair warning. This claim must be rejected out of hand.\n\nDefendants' argument rests on the premise that in enacting the Cartwright Act the Legislature did not intend, and did not clearly reveal its intent, to frame a statute broad enough to include mergers within its scope. That premise, however, has been shown to be false. In any event, defendants' argument is not properly before the court: the action here is civil, not criminal.\n\nDefendants next argue in substance that even if the Cartwright Act was intended to cover mergers, it cannot constitutionally be applied because it contains no standard for determining whether or not a particular merger is lawful. The argument, however, rests on an unsupported premise and must therefore be rejected.\n\nI believe that the Cartwright Act does indeed contain a standard of illegality, and that the standard is essentially the same as that of section 7 of the Clayton Act -- which is indisputably clear enough to be understood by those who may come within the reach of the statute, and clear enough to be applied by the courts.\n\nSection 7 declares that an acquisition is unlawful \"where in any line of commerce or in any activity affecting commerce in any section of the\n\ncountry, the effect of such acquisition may be substantially to lessen competition, or to tend to create a monopoly.\" (15 U.S.C. § 18, italics added.) The Cartwright Act similarly declares that an acquisition is unlawful where as a result of such acquisition the \"price [of any article or commodity] might in any manner be affected.\" (Bus. \u0026 Prof. Code, § 16720, subd. (e)(4), italics added.) Thus, the federal and state standards of illegality are essentially the same.\n\nThis court recently recognized as much in Cianci v. Superior Court, supra, 40 Cal. 3d 903: \"The [Cartwright] Act . . . reaches deep in proscribing anticompetitive conduct . . . . In so doing [it] reaches beyond the Sherman Act to threats to competition in their incipiency -- much like section 7 of the Clayton Act . . . .\" (Id. at p. 918.)\n\nFurther, I believe that the standard of illegality established by the Cartwright Act is meaningful. In Brown Shoe Co. v. United States (1962) 370 U.S. 294 [8 L.Ed.2d 510, 82 S.Ct. 1502], the United States Supreme Court construed section 7 of the Clayton Act thus: \"Congress used the words ' may be substantially to lessen competition' (emphasis supplied), to indicate that its concern was with probabilities, not certainties. . . . Mergers with a probable anticompetitive effect were to be proscribed by this Act.\" (Id. at p. 323 [8 L.Ed.2d at p. 534], fn. omitted.) In this case I have similarly construed the Cartwright Act: the Legislature used the words \"that [the] price [of any article or commodity] might in any manner be affected\" (Bus. \u0026 Prof. Code, § 16720, subd. (e)(4), italics added), to indicate that its concern was with probabilities, not certainties: mergers with a probable anticompetitive effect were to be proscribed by this act.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n2\n\nTurning from the threshold question whether the Cartwright Act applies to mergers, I must now address the question whether the first cause of action alleges facts that are legally sufficient under the statute. For the reasons that follow, I believe that it does.\n\nThe first cause of action, in essence, alleges all the elements of a Clayton section 7 claim. Defendants do not dispute the point. Rather, they maintain\n\nthat the elements of a Cartwright Act claim and those of a Clayton section 7 claim cannot be the same, arguing that the Cartwright Act was enacted earlier and was not intended to go beyond the Sherman Act and the common law, and that the Clayton Act was enacted later and was intended to do so. I am not persuaded.\n\nIn making their argument defendants in essence recast aspects of other claims that I have already rejected. First, although the Cartwright Act was, of course, enacted before the Clayton Act, as I have shown it too was intended to go beyond the Sherman Act and the common law. Second and more important, in relevant aspect the statutes are similar: each proscribes mergers with probable anticompetitive effects.\n\nDefendants also argue that the facts alleged in the first cause of action are legally insufficient because, if true, they establish not the probability of anticompetitive effects but at most the mere ephemeral possibility of such effects. \"The charges of potential anticompetitive consequences in the complaint,\" defendants state, \"are the very charges addressed and solved by the FTC for a minimum of five years and, in the FTC's judgment (based upon its expertise and extensive sources of information), forever.\" The point must be rejected.\n\nIn its review of a ruling on demurrer, a court \"must, under established principles, assume the truth of all properly pleaded material allegations of the complaint\" (Tameny v. Atlantic Richfield Co. (1980) 27 Cal. 3d 167, 170 [164 Cal. Rptr. 839, 610 P.2d 1330, 9 A.L.R.4th 314]), and must therefore look to \"the pleading alone and not the evidence or other extrinsic matters which do not appear on the face of the pleading or cannot be properly inferred from the factual allegations of the complaint\" (Executive Landscape Corp. v. San Vicente Country Villas IV Assn. (1983) 145 Cal. App. 3d 496, 499 [193 Cal. Rptr. 377]; accord, Ramsden v. Western Union (1977) 71 Cal. App. 3d 873, 879 [138 Cal. Rptr. 426]). The ultimate consequences of the FTC's action may indeed prevent the Attorney General from proving his claim that the merger has probable anticompetitive effects. But such possible future consequences cannot render his allegations legally insufficient: they go only to the truth of the claim and hence are immaterial for purposes of demurrer.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nDefendants finally assert in a footnote that the allegations of the first cause of action are legally insufficient because they fail to charge anticompetitive purpose. In support they rely on Jones v. H.F. Ahmanson Co. (1969) 1 Cal. 3d 93 [81 Cal. Rptr. 592, 460 P.2d 464]. But that opinion, properly read, states only that anticompetitive purpose must generally be alleged when the plaintiff alleges violations of certain subdivisions of the Cartwright Act other than that relevant here: \"That Act makes unlawful any 'trust' (Bus. \u0026 Prof. Code, § 16726), defined as a 'combination of capital, skill or acts by two or more persons for [inter alia] the following purposes: (a) To create or carry out restrictions in trade or commerce . . . (c) To prevent competition in . . . purchase of . . . any commodity.' (Bus. \u0026 Prof. Code, § 16720.)\" (1 Cal. 3d at p. 118.) The subdivision of the Cartwright Act relevant here, by contrast, appears to require only intentional conduct from which anticompetitive effects may result, viz., \"a combination . . . by two or more persons . . . To make or enter into or execute or carry out any contracts, obligations or agreements . . . , by which they . . . Agree to pool, combine or . . . unite any interests that they may have connected with the sale or transportation of any . . . article or commodity, that its price might in any manner be affected.\" (Bus. \u0026 Prof. Code, § 16720, subd. (e)(4).) In any event, the Jones court recognized that \"it may be sufficient in some instances to allege solely the effect of such combination from which a purpose to eliminate competition may be inferred . . . .\" (Id. at p. 119.) This, I believe, is such an instance; from the specific allegations of anticompetitive effects stated in the complaint a purpose to eliminate competition may readily be inferred.\n\nIn conclusion, I would hold that the first cause of action alleges facts that are legally sufficient under the Cartwright Act.\n\nB\n\nThe first cause of action, as I shall now explain, is not preempted by HSR itself or by the consent order.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nBefore I undertake preemption analysis proper, however, I find it necessary to make two general observations relevant to my discussion.\n\nFirst, state and federal antitrust laws are of concurrent effect and hence the latter generally does not preempt the former. Federal antitrust statutes are intended as a general matter to supplement and not supplant state antitrust laws. (E.g., R. E. Spriggs Co. v. Adolph Coors Co. (1974) 37 Cal. App. 3d 653, 660 [112 Cal. Rptr. 585]; Hovenkamp, State Antitrust in the Federal Scheme (1983) 58 Ind. L.J. 375, 375 [hereinafter Hovenkamp, State Antitrust ]; see, e.g., Younger v. Jensen (1980) 26 Cal. 3d 397, 405 [161 Cal. Rptr. 905, 605 P.2d 813].) As Senator Sherman stated in urging passage of his bill, which is the cornerstone of the entire structure of federal antitrust legislation: \"This bill . . . has for its . . . object to invoke the aid of the courts of the United States to deal with the combinations . . . when they affect injuriously our foreign and interstate commerce . . . and in this way to supplement the enforcement of the established rules of the common and statute law by the courts of the several States in dealing with combinations that affect injuriously the industrial liberty of the citizens of these states. It is to arm the Federal courts within the limits of their constitutional power that they may co-operate with the State courts in checking, curbing, and controlling the most dangerous combinations that now threaten the business, property, and trade of the people of the United States.\" (21 Cong.Rec. 2457 (1890).) See generally Hovenkamp, State Antitrust, supra, at p. 378 [\"the Fifty-first Congress, which debated and passed the Sherman Act in 1890[,] . . . envisioned a two-level enforcement scheme in which federal law would supplement but not replace, state antitrust law\"].)\n\nAs Professors Phillip Areeda and Donald F. Turner explain in their authoritative treatise: \"Many states have antitrust laws of their own -- often in the same general terms as the Sherman Act. Normally, when a state statute is consistent with federal law, the two operate concurrently, unless Congress has expressed an intent exclusively to 'occupy the field.' No such intent has been expressed in the antitrust field, and none has been inferred. Nor should it be. While state governments could seek injunctive or damage relief in the federal courts under federal law, there seems little reason to prevent state law from reaching price fixing and similar offenses with a substantial local impact.\n\n\"Where state law prohibits the same, or less than the federal antitrust laws, there is, therefore, no general difficulty in giving effect to the state's commands. However, where state law forbids more than federal law -- which is not the usual situation -- the problem is more subtle. The general answer is that such a state law remains consistent with federal law, and is not preempted. The fact that federal law tolerates certain conduct does not necessarily mean that there is an affirmative federal policy encouraging such conduct.\" (1 Areeda \u0026 Turner, supra, para. 208, pp. 58-59, fns. omitted, italics\n\nadded; see Hovenkamp, State Antitrust, supra, 58 Ind. L.J. at p. 377, fn. 10, and passim [as a general matter, state antitrust law may constitutionally prohibit what federal antitrust law allows]; Note, The Commerce Clause and State Antitrust Regulation (1961) 61 Colum. L. Rev. 1469; Mosk, State Antitrust Enforcement and Coordination with Federal Enforcement (1962) 21 A.B.A. Antitrust Section Rep. 358, 367.)\n\nThe \"general answer\" that Professors Areeda and Turner give is rooted in the very nature of antitrust law. Unlike direct government regulation of private economic activity, which is designed to permit only what the government has reviewed and approved as in the public interest, antitrust law is intended to proscribe certain conduct and otherwise allow private economic actors to manage their affairs as they see fit. (See generally Baker, Competition and Regulation: Charles River Bridge Recrossed (1975) 60 Cornell L. Rev. 159.) In a word, antitrust law does not permit and approve, but merely allows.\n\nMy second general observation concerns the nature, function, and effective scope of the consent decree or order in federal civil antitrust litigation. A consent decree is a settlement of federal antitrust claims, negotiated by a federal enforcement agency and the defendant, and entered by a federal court as a final judgment. (Schwartz \u0026 Flynn, Antitrust and Regulatory Alternatives (1977) p. 22 [hereinafter Schwartz \u0026 Flynn]; see Maryland v. United States (1983) 460 U.S. 1001, 1002 [75 L.Ed.2d 472, 473, 610, 103 S.Ct. 1240] (Rehnquist, J., dissenting from summary affirmance) [recognizing that a consent decree in a federal civil antitrust case \"is in essence a private agreement between parties to a lawsuit\"]; see generally Rep. of Antitrust Subcom., Com. on the Judiciary, Consent Decree Program of the Dept. of Justice, 86th Cong., 1st Sess. (1959) p. ix; United States v. Hartford-Empire Co. (N.D. Ohio 1940) 1 F.R.D. 424, 426; Note, The ITT Dividend: Reform of Department of Justice Consent Decree Procedures (1973) 73 Colum. L. Rev. 594, 595.) In practical effect, the consent decree represents not an approval of any activities or structures by the enforcement agency but simply its determination that the activities or structures as conditioned do not warrant prosecution.\n\nIn determining whether and on what terms to effect a settlement, the government enforcement agency in question exercises broad discretion. And in reviewing the exercise of such discretion before entering judgment, the court does not pass on the merits of the settlement achieved.\n\n\"Prior to 1975,\" as Professors Louis B. Schwartz and John J. Flynn have written, \"consent decree negotiations were generally secret; third parties\n\naffected by the decree had little opportunity or right to participate in formulating the decree; and the [agency] exercised wide discretion, not effectively subject to judicial scrutiny, in making such settlements. In United States v. I.T.T. Corp., 349 F.Supp. 22 (D.C.Conn. 1972), aff'd per curiam, sub. [ sic ] nom., Nader v. United States, 410 U.S. 919, 93 S.Ct. 1363, 35 L.Ed.2d 582 (1973), the consent decree discretion of the [agency] was held to be nonreviewable even upon allegations of 'fraud on the court' with respect to the considerations that influenced the [agency] in settling three merger cases with I.T.T.\" (Schwartz \u0026 Flynn, supra, at p. 22, fn. omitted.)\n\nThe situation changed somewhat, but not essentially, with the enactment of the Antitrust Procedures and Penalties Act of 1974 (hereinafter APPA), amending section 5 of the Clayton Act (15 U.S.C. § 16), which reformed the consent decree process in the wake of \"Revelations during the 'Watergate' episode, questions raised during the confirmation hearings of Attorney General Kliendienst [ sic ], and the subsequent misdemeanor conviction of Kliendienst [ sic ] for misleading the Judiciary Committee about pressures applied to the Justice Department in settling the I.T.T. cases . . . .\" (Schwartz \u0026 Flynn, supra, at p. 22.)\n\nThe APPA imposes the following requirements, among others. At least 60 days prior to the effective date of the judgment, the enforcement agency must file the proposed consent decree in the court in which the case is pending and publish it in the Federal Register. (15 U.S.C. § 16(b).) The agency must also file and publish any written comments on the proposal and any responses by the government. (Ibid. Simultaneously with filing the proposal, the agency must file and publish a \"competitive impact statement,\" which must recite \"(1) the nature and purpose of the proceeding,; [ para. ] (2) a description of the practices or events giving rise to the alleged violation of the antitrust laws; [ para. ] (3) an explanation of the proposal for a consent judgment, including an explanation of any unusual circumstances giving rise to such proposal or any provision contained therein, relief to be obtained thereby, and the anticipated effects on competition of such relief; [ para. ] (4) the remedies available to potential private plaintiffs damaged by the alleged violation in the event that such proposal for the consent judgment is entered in such proceeding; [ para. ] (5) a description of the procedures available for modification of such proposal; and [ para. ] (6) a description and evaluation of alternatives to such proposal actually considered by the United States.\" (Ibid.) The agency must also publish in general-circulation newspapers specified materials, including summaries of the proposed consent decree and the competitive impact statement. (Id., § 16(c).) The agency must accept, consider, and respond to any written comments submitted on the proposal. (Id., § 16(d).) Finally, \"Before entering [the proposed] consent judgment\n\nAlthough -- as will appear -- the APPA opens the settlement process to public participation and scrutiny, it does not significantly limit the breadth of the enforcement agency's discretion or broaden the limits of the court's review. Consequently, it does not transform the practical effect of the consent decree from a determination that certain activities or structures as conditioned do not warrant prosecution into an approval of such activities or structures.\n\nFirst, in drafting the competitive impact statement and carrying out its other responsibilities under the APPA, the enforcement agency is not required to make findings on the competitive effects of the underlying activities or structures, nor is it authorized to approve such activities or structures, conditioned or not. Rather, the agency is required only to explain the basis for the exercise of its discretion.\n\nSecond, in conducting the review required of it the court determines only whether the decision to settle the case is in the public interest -- in other words, whether the agency's judgment that the activities or structures as conditioned do not warrant prosecution is within the scope of its broad discretion -- not whether the activities or structures themselves are in the public interest.\n\nAs Senior Circuit Judge Bailey Aldrich, sitting as a district court, explained in United States v. Gillette Co. (D.Mass. 1975) 406 F.Supp. 713, 716: \"It is not the court's duty to determine whether this is the best possible settlement that could have been obtained if, say, the government had bargained a little harder. The court is not settling the case. It is determining whether the settlement achieved is within the reaches of the public interest. Basically I must look at the overall picture not hypercritically, nor with a microscope, but with an artist's reducing glass.\" (Accord, United States v. G. Heileman Brewing Co. (D.Del. 1983) 563 F.Supp. 642, 647 [78 A.L.R.Fed. 365]; United States v. Agri-Mark, Inc. (D.Vt. 1981) 512 F.Supp. 737, 739; United States v. Carrols Dev. Corp. (N.D.N.Y. 1978) 454 F.Supp. 1215, 1222; United States v. Nat. Broadcasting Co., Inc. (C.D.Cal. 1978) 449 F.Supp. 1127, 1143; 2 Areeda \u0026 Turner, supra, § 330d, pp. 147-148; 5 Kintner, Federal Antitrust Law (1984) § 40.25, pp. 209-210; see Maryland v. United States, supra, 460 U.S. at p. 1005 [75 L.Ed.2d at p. 474] (Rehnquist, J., dissenting from summary affirmance) (stating that under the APPA \"The question assigned to the district courts\" is \". . . 'whether the Department of Justice has exercised its prosecutorial discretion well or, perhaps, as well as possible' . . .\"].)\n\nIn light of the nature and function of the consent decree, its effective scope becomes plain. As a negotiated settlement, the consent decree \"is binding only upon the parties thereto, and independent private rights may be maintained in separate suits [by third parties].\" (Handler, The Shift from Substantive to Procedural Innovations in Antitrust Suits -- The Twenty -Third Annual Antitrust Review (1971) 71 Colum. L. Rev. 1, 17, fn. 88 [hereinafter Handler]; accord, Sam Fox Publishing Co. v. U.S. (1961) 366 U.S. 683, 690 [6 L.Ed.2d 604, 81 S.Ct. 1309]; 2 Areeda \u0026 Turner, supra, para. 330d, p. 143.) Such separate suits, it is plain, may be based on federal law. (Handler, supra, at p. 17, fn. 88; Sam Fox Publishing Co. v. U.S., supra, at p. 690 [6 L.Ed.2d at p. 610]; 2 Areeda \u0026 Turner, supra , para. 330d, p. 143.) A fortiori, they may be based on state law as well: by its terms, the consent decree purports to cover only claims predicated on federal law.\n\nTurning to the issue of preemption, I start with a principle derived from the foregoing discussion -- viz., that as a general matter at least, Congress has not granted preemptive effect to the federal antitrust laws or to consent decrees entered pursuant to those laws. From that principle I reason that unless Congress has specially granted preemptive effect to HSR or to consent decrees entered pursuant to HSR, the Texaco-Getty consent order does not bar this action. As I shall explain, I believe that Congress has made no such grant.\n\nCrucial to the resolution of the issue of preemption is, of course, HSR itself -- which, as noted above, is section 7A of the Clayton Act and is codified in section 18a of title 15 of the United State Code. The statute provides in substance as follows. Subsection (a) generally prohibits one firm from acquiring another where a very large merger will result, unless both give advance notice to the FTC and the Justice Department and wait until the expiration of a premerger waiting period. (Clayton Act § 7A(a), 15 U.S.C. § 18a(a).)\n\nSubsection (b) provides that generally the premerger waiting period begins when the government receives the notification and ends 30 days later. (Clayton Act § 7A(b), 15 U.S.C. § 18a(b).)\n\nSubsection (c) exempts a variety of acquisitions that either pose no anticompetitive threats under section 7 of the Clayton Act, or are already subject to advance antitrust review. (Clayton Act § 7A(c), 15 U.S.C. § 18a(c).)\n\nSubsection (d) requires the FTC to specify the information to be supplied on the premerger notification form. (Clayton Act § 7A(d), 15 U.S.C. § 18a(d).)\n\nSubsection (e) permits the government to request additional information relevant to a planned acquisition within the 30-day waiting period and, in general, to extend the waiting period up to 20 days after receipt of that information. (Clayton Act § 7A(e), 15 U.S.C. § 18a(e).)\n\nSubsection (f) provides that if the government files an action challenging a proposed merger and seeks injunctive relief, the courts shall give expedited consideration to the action. (Clayton Act § 7A(f), 15 U.S.C. § 18a(f).)\n\nSubsection (g) authorizes civil penalties of up to $10,000 per day for violation of HSR's requirements and provides that if any firm fails to comply substantially with a request for premerger information, the courts may order compliance and effectively enjoin the pending merger until substantial compliance is achieved. (Clayton Act § 7A(g), 15 U.S.C. § 18a(g).)\n\nSubsection (h) provides that premerger information submitted under HSR is confidential and generally not subject to disclosure. (Clayton Act § 7A(h), 15 U.S.C. § 18a(h).)\n\nSubsection (i), the savings provision, declares in relevant part as follows: \"Any action taken by the Federal Trade Commission or the Assistant Attorney General [in charge of the Antitrust Division of the Department of Justice] or any failure of the Federal Trade Commission or the Assistant Attorney General to take any action under this section shall not bar any proceeding or any action with respect to such acquisition at any time under any other section of this Act or any other provision of law.\" (Clayton Act § 7A(i), 15 U.S.C. § 18a(i).)\n\nSubsection (j) requires the FTC and the Department of Justice to report on their HSR activities annually. (Clayton Act § 7A(j), 15 U.S.C. § 18a(j).)\n\nCongress's intent in enacting HSR, which may be inferred from the words of the statute itself, is revealed clearly in the legislative history.\n\n\"The purpose of [HSR] is to amend the federal anti-merger law, Section 7 of the Clayton Antitrust Act (15 U.S.C. § 18), by establishing premerger notification and waiting requirements for corporations planning to consummate very large mergers and acquisitions. The [statute] in no way alters the substantive legal standard of Section 7: That statute's longstanding prohibitions against acquisitions that may substantially lessen competition or tend to create a monopoly, remain unaffected by this measure.\n\n\"[HSR] will, however, strengthen the enforcement of Section 7 by giving the government antitrust agencies a fair and reasonable opportunity to detect and investigate large mergers of questionable legality before they are consummated. The government will thus have a meaningful chance to win a\n\npremerger injunction -- which is often the only effective and realistic remedy against large, illegal mergers -- before the assets, technology, and management of the merging firms are hopelessly and irreversibly scrambled together, and before competition is substantially and perhaps irremediably lessened, in violation of the Clayton Act.\" (H.R. Rep. No. 94-1373, 94th Cong., 2d Sess. (1976) p. 5.)\n\nIn addressing the question whether HSR preempts state antitrust laws generally and the Cartwright Act specifically, I am guided by settled principles declared by the United States Supreme Court. \"It is well established that within constitutional limits Congress may pre-empt state authority by so stating in express terms. [Citation.] Absent explicit pre-emptive language, Congress' intent to supersede state law altogether may be found from a '\"scheme of federal regulation . . . so pervasive as to make reasonable the inference that Congress left no room for the States to supplement it,\" because \"the Act of Congress may touch a field in which the federal interest is so dominant that the federal system will be assumed to preclude enforcement of state laws on the same subject,\" or because \"the object sought to be obtained by the federal law and the character of obligations imposed by it may reveal the same purpose.\"' [Citations.] Even where Congress has not entirely displaced state regulation in a specific area, state law is pre-empted to the extent that it actually conflicts with federal law. Such a conflict arises when 'compliance with both federal and state regulations is a physical impossibility,' [citation], or where state law 'stands as an obstacle to the accomplishment and execution of the full purposes and objectives of Congress.' [Citation.]\" (Pacific Gas \u0026 Elec. v. Energy Resources Comm'n (1983) 461 U.S. 190, 203-204 [75 L.Ed.2d 752, 765, 103 S.Ct. 1713].)\n\nAlthough Congress may preempt by implication, \"It will not be presumed that a federal statute was intended to supersede the exercise of the power of the state unless there is a clear manifestation of intention to do so. The exercise of federal supremacy is not lightly to be presumed.\" (Schwartz v. Texas (1952) 344 U.S. 199, 202-203 [97 L.Ed. 231, 235, 73 S.Ct. 232]; accord, New York Dept. of Social Services v. Dublino (1973) 413 U.S. 405, 413 [37 L.Ed.2d 688, 695, 93 S.Ct. 2507].) Put otherwise, there is an \"assumption that the historic police powers of the States were not to be superseded by the Federal Act unless that was the clear and manifest purpose of Congress.\" (Rice v. Santa Fe Elevator Corp. (1947) 331 U.S. 218, 230 [91 L.Ed. 1447, 1459, 67 S.Ct. 1146]; accord, P.R. Dept. of Consumer Affairs v. Isla Petroleum (1988) 485 U.S. 495, [99 L.Ed.2d 582, 589, 108 S.Ct. 1350, 1353].)\n\nI observe at the threshold that the application of preemption analysis appears uncalled for here. Congress has made it plain that HSR is not\n\npreemptive: in the savings provision it expressly declares that \"Any action taken by the Federal Trade Commission . . . or any failure of the Federal Trade Commission . . . to take any action under this section shall not bar any proceeding or any action with respect to such acquisition at any time under any other section of this Act or any other provision of law.\" (15 U.S.C. § 18a(i)(1), italics added.) If the federal antitrust laws were generally preemptive, the savings provision might perhaps be susceptible of a construction preserving rights of action under federal law alone. But inasmuch as they are not, the savings provision cannot be so construed but must be read to mean precisely what it says.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nFor purposes of discussion, however, I shall proceed to apply preemption analysis. Under such analysis, it is manifest that the general presumption of nonpreemption, which is applicable to HSR, cannot be overcome.\n\nFirst, Congress has not inserted in the statute express language preempting state action. Indeed, as I have shown, the only language bearing on the issue is expressly nonpreemptive.\n\nSecond, the scheme of HSR is not so pervasive as to make reasonable the inference that Congress left no room for state action. The statute is limited to premerger notification and review and as such plainly leaves room for the enforcement of the substantive provisions of the Cartwright Act. More particularly, HSR does not touch a field in which the federal interest is so dominant as to preclude enforcement of state laws on the same subject: as I have explained, federal and state antitrust laws are of concurrent effect. Nor is a congressional purpose to preclude the enforcement of the substantive provisions of the Cartwright Act revealed either by the object of HSR -- i.e., the facilitation of early and effective federal review of certain very large mergers -- or by the character of the obligations it imposes -- i.e., the requirement that merging parties notify the federal government, provide it with certain information, and refrain from consummating the merger.\n\nThird, there is no conflict between HSR and the Cartwright Act. It is not physically impossible for merging parties to comply with both the notification requirements of HSR and the substantive requirements of the\n\nCartwright Act. Nor does the Cartwright Act stand as an obstacle to the fulfillment of the notification requirements by the merging parties or to the conduct of review of the proposed merger by the federal government.\n\nImpliedly conceding that HSR itself is not preemptive, defendants argue that the consent order entered pursuant to the statute is. As I shall explain, the point must be rejected.\n\nAt the threshold I believe that a court may properly hold the consent order to be nonpreemptive as a matter of law without undertaking additional preemption analysis. If Congress has not granted the FTC authority to preempt state action under HSR, the FTC has no such authority under the statute. (See Fidelity Federal Sav. \u0026 Loan Assn. v. De La Cuesta (1982) 458 U.S. 141, 152-154 [73 L.Ed.2d 664, 674-676, 102 S.Ct. 3014].) I am unable to find any such grant of authority. Congress, it is undisputed, has not granted preemptive authority expressly. Nor does it appear to have done so impliedly: otherwise, it would not have used the broad and express nonpreemptive language it has used in the savings provision.\n\nCertainly, if Congress had intended to grant the FTC power to authorize mergers capable of preempting state law, it knew how to do so. Indeed, it has given the Interstate Commerce Commission (hereinafter ICC) precisely that power over railroad consolidations, mergers, and acquisitions. Specifically, it has provided that \"The [ICC] shall approve and authorize [such] a transaction . . . when it finds the transaction\" -- as originally proposed by the parties or as subsequently conditioned by the ICC -- is \"consistent with the public interest.\" (49 U.S.C. § 11344(c).) It has further provided: \"A carrier or corporation participating in or resulting from a transaction approved by . . . the [ICC] . . . may carry out the transaction, own and operate property, and exercise control or franchises acquired through the transaction without the approval of a State authority. A carrier, corporation, or person participating in that approved . . . transaction is exempt from the antitrust laws and from all other law, including State and municipal law, as necessary to let that person carry out the transaction, hold, maintain, and operate property, and exercise control or franchises acquired through the transaction.\" (Id., § 11341(a), italics added.)\n\nIn sum, if Congress had intended to grant the FTC preemptive authority through HSR, it would have used language identical or similar to that quoted above, or at the very least would not have inserted in the statute the savings provision with its broad and express nonpreemptive language.\n\nFor purposes of discussion, however, I shall address the issue whether the Texaco-Getty consent order has preemptive effect. As the United States Supreme Court has made clear, in determining whether a particular administrative\n\naction is preemptive courts must consider factors developed originally in the context of statutory preemption: \"Under the Supremacy Clause, . . . the enforcement of a state regulation may be pre-empted by federal law in several circumstances: first, when Congress, in enacting a federal statute, has expressed a clear intent to pre-empt state law, [citation]; second, when it is clear, despite the absence of explicit pre-emptive language, that Congress has intended, by legislating comprehensively, to occupy an entire field of regulation and has thereby 'left no room for the States to supplement' federal law, [citation]; and, finally, when compliance with both state and federal law is impossible, [citation], or when state law 'stands as an obstacle to the accomplishment and execution of the full purposes and objectives of Congress.'\" (Capital Cities Cable, Inc. v. Crisp (1984) 467 U.S. 691, 698-699 [81 L.Ed.2d 580, 588-589, 104 S.Ct. 2694]; see also California Coastal Comm'n v. Granite Rock Co. (1987) 480 U.S. 572, 581 [94 L.Ed.2d 577, 107 S.Ct. 1419, 1425] [discussing the second and third factors]; accord, Silkwood v. Kerr-McGee Corp. (1984) 464 U.S. 238, 248 [78 L.Ed.2d 443, 452, 104 S.Ct. 615] [same].)\n\nWhen administrative action is claimed to preempt by implication, the implication of preemption must be pellucidly clear. \"Pre-emption of state law by federal . . . regulation is not favored 'in the absence of persuasive reasons -- either that the nature of the regulated subject matter permits no other conclusion, or that the Congress has unmistakably so ordained.'\" (Chicago \u0026 N. W. Tr. Co. v. Kalo Brick \u0026 Tile Co. (1981) 450 U.S. 311, 317 [67 L.Ed.2d 258, 264-265, 101 S.Ct. 1124].) \"Courts are reluctant to infer preemption, and it is the burden of the party claiming that Congress intended to preempt state laws to prove it.\" (Elsworth v. Beech Aircraft Corp. (1984) 37 Cal. 3d 540, 548 [208 Cal. Rptr. 874, 691 P.2d 630]; accord, Perdue v. Crocker National Bank (1984) 38 Cal. 3d 913, 937 [216 Cal. Rptr. 345, 702 P.2d 503]; see, e.g., Exxon Corp. v. Governor of Maryland (1978) 437 U.S. 117, 132 [57 L.Ed.2d 91, 104, 98 S.Ct. 2207].)\n\nAs the United States Supreme Court recently stated: \"[Because] agencies normally address problems in a detailed manner and speak through a variety of means, including regulations, preambles, interpretive statements, and responses to comments, we can expect that they will make their intentions clear if they intend for their regulations to be exclusive. Thus, if an agency does not speak to the question of pre-emption, we will pause before saying that the mere volume and complexity of its regulations indicate that the agency did in fact intend to pre-empt.\" (Hillsborough County v. Automated Medical Labs. (1985) 471 U.S. 707, 718 [85 L.Ed.2d 714, 724, 105 S.Ct. 2371].)\n\nApplying this analysis to the case at bar, I am of the opinion that the consent order is not preemptive. The first factor, as no one disputes, is absent here: the consent order contains no express statement of preemption.\n\nAs to the second factor -- the agency's regulation of the underlying transaction in such a comprehensive manner as to imply an intention to occupy an entire field -- I make the following observation at the threshold. The United States Supreme Court has made it clear that a court should rely on this factor to infer preemption with great caution. \"We are even more reluctant to infer pre-emption from the comprehensiveness of regulations than from the comprehensiveness of statutes. As a result of their specialized functions, agencies normally deal with problems in far more detail than does Congress. To infer pre-emption whenever an agency deals with a problem comprehensively is virtually tantamount to saying that whenever a federal agency decides to step into a field, its regulations will be exclusive. Such a rule, of course, would be inconsistent with the federal-state balance embodied in our Supremacy Clause jurisprudence.\" (Hillsborough County v. Automated Medical Labs., supra, 471 U.S. at p. 717 [85 L.Ed.2d at p. 724].)\n\nThe consent order, though long and detailed, seems hardly comprehensive. Restricting my view to those aspects of the merger that directly concern California, I note that the consent order essentially addresses only one matter material to this action -- viz., the supply of Getty California crude oil to independent refiners -- and does so in provisions that expire by their own terms in 1989. I am unable to conclude that administrative action so limited in scope and temporal effect can properly be deemed \"comprehensive.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe third factor to which a court must look to determine whether federal administrative action preempts state law comprises two considerations: whether compliance with both state and federal law is impossible, and whether state law stands as an obstacle to the accomplishment of federal objectives.\n\nIn addressing the first consideration, I begin with the observation that the requirement of the impossibility of dual compliance is strictly construed: the federal-state conflict must be actual and unavoidable, not merely possible (Askew v. American Waterways Operators, Inc. (1973) 411 U.S. 325, 336-337). Guided by such a construction, I believe that the first consideration\n\ndoes not support preemption: compliance with both the Cartwright Act and the consent order simply does not appear to be impossible.\n\nAlthough defendants do not dispute this conclusion, they may be understood to argue that they could not comply with both the interlocutory and permanent obligations sought by the Attorney General -- viz., that pending conclusion of the action Texaco hold Getty's California facilities and properties separate, and that at the action's conclusion it divest itself of those assets -- and the obligations imposed by the consent order -- viz., that Texaco manage Getty's California facilities and properties in a specified manner. The terms of the consent order itself show that such an argument would be specious.\n\nDefendants can comply with both the consent order and the interlocutory relief sought. Under the order Texaco is required to divest itself of certain non-California assets, to hold them separate pending divestiture, and to manage them in a specified manner in the interim. If Texaco can hold non-California assets separate and at the same time manage them in a specified manner, it can evidently do the same with regard to Getty's California facilities and properties.\n\nDefendants can also comply with both the consent order and the permanent relief sought. Under the order, Texaco is not required to merge Getty's California facilities and properties into itself, but is merely allowed to do so if it meets certain conditions. Contrary to what appears to be defendants' argument, by entering into the consent order the FTC did not authorize or approve the merger, but simply declared in effect that the merger as conditioned did not warrant prosecution. Thus, Texaco can fulfill the obligations under the consent order and divest itself of Getty's California assets.\n\nBut even if the consent order did require Texaco to merge Getty's California facilities and properties into itself, Texaco could still fulfil its obligations under the order and divest itself of those assets. To assure the possibility of dual compliance, the court need only tailor its injunction to become effective on or after expiration of the consent order. I must presume that the trial court would readily do so.\n\nIn any event, even if under the terms of the consent order defendants were unable to comply with the interlocutory or permanent obligations sought by the Attorney General, it is undisputed that they are able to comply with the Cartwright Act itself and other relief that may be granted under its provisions. Thus, the order can effectively bar, at most, one form of relief sought under the cause of action. But it simply cannot bar the cause of action itself.\n\nThe second consideration also fails to support preemption. Neither the Cartwright Act itself nor the Attorney General's attempt to enforce it in this action stands as an obstacle to the objectives Congress sought to attain through the enactment of HSR. Congress's purpose was to \"establish[] premerger notification and waiting requirements for corporations planning to consummate very large mergers and acquisitions\" and thereby \"[give] the government antitrust agencies a fair and reasonable opportunity to detect and investigate large mergers of questionable legality before they are consummated.\" (H.R. Rep. No. 94-1373, 94th Cong., 2d Sess., supra, p. 5.) It does not appear, nor do defendants claim, that the Cartwright Act in the abstract or this action as an enforcement procedure conflicts with Congress's purpose.\n\nFurther, neither the Cartwright Act itself nor this action stands as an obstacle to the objectives the FTC sought to attain through the entry of the consent order -- viz., the carrying out by defendants of the conditions they agreed to in their negotiations with the agency. The Cartwright Act itself plainly does not interfere with defendants' obligations under the consent order. Nor does this action -- far from it: the relief requested by the Attorney General builds on, and certainly does not undermine, the obligations arising from the consent order.\n\nDefendants argue that this action does indeed stand as an obstacle to the attainment of federal objectives. None of the grounds on which they rely, however, provides support for their claim.\n\nThe first ground is in substance that if a private right of action under state law existed the bargaining power of the federal antitrust enforcement agencies would be undermined. But if the existence of a private right of action under federal law does not undermine that bargaining power -- in view of Congress's insertion of the savings provision I am compelled to conclude it does not -- I fail to see, and defendants fail to show, how the existence of a private right of action under state law could do so.\n\nThe second ground defendants rely on is in essence as follows: one of Congress's goals in enacting HSR was to \"prevent the consummation of so-called 'midnight' mergers, which are designed to deny the government any opportunity to secure preliminary injunctions\" (H.R. Rep. No. 94-1373, 94th Cong., 2d Sess., supra, p. 11); to allow state action against mergers within the coverage of HSR might make merging firms reluctant to comply with the statute's notification requirements and lead to the very \"midnight\" mergers Congress sought to prevent. Again I fail to see, and defendants fail to show, how the existence of a private right of action under state law could make merging firms reluctant to comply with HSR. But even if they were\n\nsomehow made reluctant to comply, I am confident that comply they would: HSR provides that any person who fails to comply shall be liable for a civil penalty of up to $10,000 for each day during which he is in violation of the statute's requirements (15 U.S.C. § 18a(g)(1)).\n\nThe third ground on which defendants rely is in substance as follows: another of Congress's purposes in enacting HSR was to \"advance the legitimate interests of the business community in planning and predictability, by making it more likely that Clayton Act cases will be resolved in a timely and effective fashion\" (H.R. Rep. 94-1373, 94th Cong., 2d Sess., supra, p. 11); the existence of a private right of action under state law, however, would inject uncertainty, unpredictability, and delay into the process and thereby frustrate Congress's purpose. The point is empty. It is plain from the text of HSR itself (15 U.S.C. § 18a) and from its legislative history (H.R. Rep. No. 94-1373, 94th Cong., 2d Sess., supra, pp. 1, 5-13) that Congress intended to \"advance the legitimate interests of the business community in planning and predictability\" only insofar as government-prosecuted Clayton Act suits were concerned: otherwise it would surely not have inserted the savings provision, which expressly preserves inter alia private rights of action.\n\nThe fourth ground on which defendants rely rests on their reading of Lieberman v. F.T.C. (2d Cir. 1985) 771 F.2d 32, and Mattox v. F.T.C. (5th Cir. 1985) 752 F.2d 116, and is in substance that the existence of a private right of action under state law would frustrate the centralization of regulation of very large mergers in the federal antitrust agencies. This ground too is insufficient.\n\nTo begin with, neither Lieberman nor Mattox supports defendants' point. In Mattox the Fifth Circuit held section 7A(h) of HSR (15 U.S.C. § 18a(h)) -- which provides that premerger information and materials submitted under the statute are confidential -- precludes the disclosure of such information and materials to state attorneys general. To explain its conclusion, the court gave among others the following reason: \"Because HSR only covers transactions likely to affect the entire national economy, Congress may have wanted to centralize regulation of such mergers in the FTC and the Justice Department. Disclosure to state attorneys general would tend to balkanize that needed centrality.\" (752 F.2d at p. 122.)\n\nIn Lieberman -- in which various state attorneys general sued the FTC alleging it had improperly denied their requests for access to documents generated in connection with the proposed Texaco-Getty merger -- the Second Circuit followed the reasoning of the Mattox court and arrived at the same result: \"As the Mattox Court recognized, giving state authorities the\n\npremerger information and the chance to bring suit more easily might well mean big delays in the fast world of mergers -- delays Congress has not countenanced. We doubt if Congress would have intended to have the staffs of fifty state attorneys general sitting as oversight committees reacting to Commission or Justice Department decisions whether to block large-scale mergers of national or international significance.\" (771 F.2d at p. 40.)\n\nEven if the disclosure of HSR information and materials to state attorneys general would frustrate the timely and effective conduct of premerger review, it does not follow that the existence of a private right of action under state law would do so as well: any suit under state law would, of course, be separate from and, almost necessarily, subsequent to the federal agency's proceedings and hence could not cause them to be delayed or undermined.\n\nIndeed, I am of the opinion that Congress has made it clear that it believes the existence of private rights of action would not frustrate its purposes. Otherwise it would not have inserted the savings provision, which expressly preserves such rights of action, but would likely have provided that review under HSR, like review under the Interstate Commerce Act, \"[exempts] [the merging firms] from the antitrust laws and from all other law, including State and municipal law, as necessary to let [them] carry out the transaction, hold, maintain, and operate property, and exercise control or franchises acquired through the transaction.\" (49 U.S.C. § 11341.)\n\nNot only do Mattox and Lieberman fail to support defendant's argument on the fourth ground, the predicate on which the argument rests is false. Under HSR the federal antitrust enforcement agencies do not \"regulate\" -- in the sense of authorizing and approving -- mergers, but merely review them and on that basis decide whether to prosecute an antitrust action against the parties. Accordingly, under HSR a consent decree does not represent or effect the authorization or approval of a merger, but simply makes formal and public the agency's decision that the merger as conditioned does not warrant prosecution.\n\nIn conclusion, I would hold that the first cause of action is not preempted by HSR itself or by the consent order entered pursuant thereto.\n\nC\n\nTo \"the general rule that state antitrust law may be enforced even though it prohibits less, the same, or more than federal antitrust law\" (1 Areeda \u0026 Turner, supra, para. 208, p. 59), there is an exception that is potentially applicable to this case: \"state regulation remains subject to the usual imperative that it must not unduly burden interstate commerce\" (ibid.).\n\nAs professor Herbert Hovenkamp has persuasively argued, however, this exception may be more illusory than real. He states: \"As a matter of history, applications of state antitrust laws to situations 'in or affecting' interstate commerce have rarely been condemned and nearly all cases that did condemn such applications were decided before 1935, when judges had a much more restrictive view of the power of the states to regulate in interstate commerce, or to exercise their jurisdiction over persons outside the state. The [United States] Supreme Court has upheld applications of state antitrust laws where significant interstate commerce or extraterritorial activity is involved . . . .\" (Hovenkamp, State Antitrust, supra, 58 Ind. L.J. at pp. 386-387, fn. omitted.) He concludes: \"Since the Supreme Court has held in a long line of cases that preemption is not to be presumed or inferred, and because Congress clearly intended that state antitrust law not be preempted as a general matter, there are virtually no operative limits on the reach of state antitrust law under the commerce clause.\" (Id. at pp. 389-390, italics in original and fns. omitted; see also Flood v. Kuhn (2d Cir. 1971) 443 F.2d 264, 267, affd. on other grounds (1972) 407 U.S. 258 [32 L.Ed.2d 728, 92 S.Ct. 2099] [stating it is \"difficult[] . . . [to] [determinee] to what extent, if at all, the states are precluded from antitrust regulation of interstate commerce\" (italics added)].)\n\nBut assuming for purposes of discussion that the exception stated above is real and not illusory, for the reasons that follow I believe that it proves to be inapplicable here.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIn Brown-Forman Distillers v. N.Y. State Liquor Auth. (1986) 476 U.S. 573 [90 L.Ed.2d 552, 106 S.Ct. 2080], the United States Supreme Court recently summarized the principles relevant in this context. \"This Court has adopted what amounts to a two-tiered approach to analyzing state economic regulation under the Commerce Clause. When a state statute directly regulates or discriminates against interstate commerce, or when its effect is to favor in-state economic interests over out-of-state interests, we have generally struck down the statute without further inquiry. [Citations.] When, however, a statute has only indirect effects on interstate commerce and regulates evenhandedly, we have examined whether the State's interest is legitimate and whether the burden on interstate commerce clearly exceeds the local benefits. [Citation.] We have also recognized that there is no clear line separating the category of state regulation that is virtually per se invalid under the Commerce Clause, and the category subject to the . . .\n\nbalancing approach. In either situation the critical consideration is the overall effect of the statute on both local and interstate activity.\" (Id. at p. 578-579 [90 L.Ed.2d at pp. 559-560, 106 S.Ct. at p. 2084].)\n\nReviewing the question after defendants have chosen to forgo the support of a factual record in favor of attacking the complaint on its face by demurrer, I can do nothing other than speculate on \"the overall effect of [this action] on both local and interstate activity\" (Brown-Forman Distillers v. N.Y. State Liquor Auth., supra, 476 U.S. at p. 579 [90 L.Ed.2d at p. 560, 106 S.Ct. at p. 2084]). As a result I am precluded from concluding here that the action is barred by the commerce clause.\n\nDefendants argue strenuously that an order of divesture would contravene the commerce clause and hence that this cause of action is barred. On this record I do not find a factual basis sufficient to support the premise. But even if the premise were supported, the argument would still lack merit: the conclusion simply does not follow. As I explained above, the fact that one form of relief sought in the cause of action may be barred does not mean that the cause of action itself is barred.\n\nOn the record before the court this case seems similar to Exxon Corp. v. Governor of Maryland, supra, 437 U.S. 117. In Exxon the United States Supreme Court considered the claim of Exxon and other petroleum companies that the commerce clause was violated by a Maryland statute that prohibited oil producers or refiners from operating retail service stations within the state and that thereby required them to divest themselves of those assets. In rejecting the claims, the court reasoned as follows.\n\nFirst, the fact that the burden of the divestiture provisions fell solely on interstate firms, the court believed, did not by itself establish a claim of discrimination against interstate commerce: the provisions created no barrier against interstate firms per se -- since interstate marketers who were not producers or refiners were not affected -- nor did they prohibit the flow of interstate goods, place added costs on them, or distinguish between in-state and out-of-state firms. (Id. at pp. 125-126 [57 L.Ed.2d at p. 100].)\n\nSecond, the fact that the burden of state regulation fell on interstate firms, according to the court, did not show that the divestiture provisions impermissibly burdened interstate commerce: \"the Commerce Clause [does not] protect[] the particular structure or methods of operation in a retail market. [Citation.] . . . [The] Clause protects the interstate market, not particular interstate firms, from prohibitive or burdensome regulations.\" (Id. at pp. 127-128 [57 L.Ed.2d at p. 101].)\n\nThird, a lack of national uniformity in the regulation of retail gasoline marketing, the court concluded, would not impede the flow of interstate\n\ngoods, and hence the commerce clause did not in itself preempt the entire field and thereby leave no room for regulation by the individual states. (Id. at p. 128 [57 L.Ed.2d at p. 101].) As the court explained: \"[The petroleum companies] point out that many state legislatures have either enacted or considered proposals similar to Maryland's, and that the cumulative effect of this sort of legislation may have serious implications for their national marketing operations. While this concern is a significant one, we do not find that the Commerce Clause, by its own force, pre-empts the field of retail gas marketing. . . . [This] Court has only rarely held that the Commerce Clause itself pre-empts an entire field from state regulation, and then only when a lack of national uniformity would impede the flow of interstate goods. [Citations.] The evil that [the petroleum companies] perceive in this litigation is not that the several States will enact differing regulations, but rather that they will all conclude that divestiture provisions are warranted. The problem thus is not one of national uniformity.\" (Ibid. [57 L.Ed.2d at pp. 101-102], fn. omitted.)\n\nThe case at bar is similar to Exxon. First, the fact that any relief that may be awarded in this action falls solely on interstate firms is fortuitous and does not establish a claim of discrimination against interstate commerce: the action does not threaten to create any barrier against interstate firms, prohibit the flow of interstate goods, place added costs on them, or distinguish between in-state and out-of-state firms. Defendants suggest that the action may have some potential to favor local firms, but fail to show how that may be. Indeed, the purpose and effect of the divestiture that the Attorney General seeks appear simply to be to allow Getty products and facilities to be available to all firms, whether intrastate or interstate, in an open and competitive market.\n\nSecond, the fact that the burden of the action falls on Texaco and Getty, which are interstate firms, does not show that the action impermissibly burdens interstate commerce: the commerce clause protects from prohibitive state regulations the interstate market, not particular interstate firms or their structure or methods of operation.\n\nDefendants suggest that in Exxon the court implied that whereas the commerce clause does not protect \"the particular structure or methods of operation in a retail market \" (437 U.S. at p. 127 [57 L.Ed.2d at p. 101], italics added) -- which they assert is of necessity local -- the clause does protect their \"structure\" and \"methods of operation.\" They are unpersuasive. The fact that it was the retail marketing of petroleum products that was implicated in Exxon was not material to the issues raised by the parties or to the reasoning the court undertook or the result it reached. Rather, as the court stated, \"The crux of [the petroleum companies'] claim is that . . .\n\n[the State] has interfered 'with the natural functioning of the interstate market either through prohibition or though burdensome regulation[]'\" (ibid. [57 L.Ed.2d at p. 101]) -- specifically, by undoing the integration of certain assets in interstate firms. The crux of defendants' claim is similar: this action interferes with the \"natural\" functioning of the interstate market by threatening to undo the integration of Getty's California assets in Texaco. Since the petroleum companies' claim was rejected in Exxon, so must defendants' claim be rejected here.\n\nThird, the commerce clause does not by its own force preempt the entire field of the regulation of mergers and thereby leave no room for action by the states. This conclusion follows from the fact that a lack of national uniformity in this field would not impede the flow of interstate goods. That fact, in turn, follows from the basic fact that even insofar as the Attorney General seeks divestiture, this action appears to affect only particular interstate firms and their structure and methods of operation, and not to burden the interstate market itself. That the attorneys general of other states may seek similar relief under their states' antitrust laws, as the high court made clear in Exxon, simply does not affect the conclusion.\n\nAgainst my conclusion on the commerce clause issue defendants make two general claims. Their decision to forgo the support of a factual record, however, denies an adequate basis on which to address the contentions and to make a principled determination that this action contravenes the commerce clause. Nevertheless, for purpose of discussion I shall consider the two points.\n\nDefendants first claim that through this action the Attorney General, in contravention of the commerce clause, seeks to directly regulate interstate commerce. In support they argue that an order requiring the divestiture of Getty's California assets would undo the integration of Texaco, which is plainly a firm in interstate commerce, would therefore affect persons and properties outside California, and as a result would amount to direct regulation of interstate commerce. But if the Maryland statute upheld in Exxon did not affect direct regulation of interstate commerce -- even though it required the divestiture of Maryland assets of certain interstate firms and thereby undid the integration of those firms and consequently affected persons and properties outside Maryland -- neither would any divestiture order entered in this action.\n\nDefendants also argue that this action seeks to prevent the export of Getty crude oil from California or to allocate the supply between intrastate and interstate firms. The argument is altogether empty and indeed disingenuous:\n\nwhat the action clearly seeks is an independent Getty free to deal with other firms, intrastate or interstate, as it sees fit.\n\nDefendants next argue that crude oil is in interstate commerce and as such is beyond the state's power to regulate. For argument's sake I shall assume the factual premise is correct. The conclusion, however, does not follow. For example, even though interstate carriers are in interstate commerce, they are plainly subject to state regulation. (Colorado Comm'n v. Continental (1963) 372 U.S. 714, 718-722 [10 L.Ed.2d 84, 87-90, 83 S.Ct. 1022]; Collins v. American Buslines (1956) 350 U.S. 528, 530-531 [100 L.Ed. 672, 675, 76 S.Ct. 582]; Fry Roofing Co. v. Wood (1952) 344 U.S. 157, 161-163 [97 L.Ed. 168, 73 S.Ct. 204].)\n\nDefendants finally argue that this action seeks to require them to obtain this state's approval before they act in other states. Not so: the action seeks only to prevent or mitigate the alleged anticompetitive effects that flow from Texaco's acquisition of Getty's California assets and are felt within California.\n\nDefendants' second claim is that this action's burden on interstate commerce is excessive in relation to the local interests it seeks to protect. They in effect maintain that in view of what they claim to be the \"federal policy\" on petroleum industry mergers the national interests are great, and that under Partee v. San Diego Chargers Football Co. (1983) 34 Cal. 3d 378 [194 Cal. Rptr. 367, 668 P.2d 674], the local interests are small. The argument is unpersuasive.\n\nTo begin with, I am reluctant to characterize as \"federal policy\" what defendants present as such -- i.e., the congressional testimony of a national administration official opposing a blanket prohibition of all mergers in the petroleum industry. The only undoubted general federal policy on petroleum industry and other mergers that I have been able to discover is that reflected in section 7 of the Clayton Act, in which Congress has implicitly but clearly declared that the national benefits of a merger must be forgone \"where in any line of commerce . . . in any section of the country, the effect of such [merger] may be substantially to lessen competition, or to tend to create a monopoly.\" (15 U.S.C. § 18.) Under this policy, the national interests in the Texaco-Getty merger cannot be considered great -- otherwise the threat of anticompetitive effects in a single section of the country would not be sufficient to prohibit the merger.\n\nBut even under the \"policy\" defendants set forth the conclusion is not significantly different. Since that \"policy\" merely disfavors the blanket prohibition of petroleum company mergers, it does not necessarily favor any particular merger as procompetitive, and accordingly cannot serve as a\n\npredicate for defendants' assertion that the national interests in the Texaco-Getty merger are great.\n\nMoreover, the state's interests in a free and competitive marketplace in the sale and transportation of crude oil seem on their face to be compelling. Nor does Partee v. San Diego Chargers Football Co., supra, 34 Cal. 3d 378 -- when given a fair reading -- lead to any other conclusion. In that case we held only that the state's interests in the application of its antitrust law to professional sports was not of great urgency: \"This opinion has a limited scope. The Cartwright Act remains vital. We do not mean to suggest that multistate activities of other businesses may not be subject to state regulation upon due consideration of the commerce clause. Our holding is limited to the issue directly before us, the inapplicability of the Cartwright Act to professional football.\" (Id. at pp. 385-386, fn. 5, italics added.)\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIn urging their excessive-burden point defendants rely on the plurality opinion in Edgar v. MITE Corp. (1982) 457 U.S. 624 [73 L.Ed.2d 269, 102 S.Ct. 2629]. At the threshold I question whether the MITE plurality opinion remains good law after the high court's discussion in CTS Corp. v. Dynamics Corp. of America (1987) 481 U.S. 69 [95 L.Ed.2d 67, 107 S.Ct. 1637]. In any event, the opinion does not support defendant's claim.\n\nIn MITE, a plurality of the United States Supreme Court determined that the Illinois Business Take-Over Act was unconstitutional on the ground that the burden it imposed on interstate commerce was excessive in relation to the local interests it served. It reasoned that the state's interests in protecting local investors (457 U.S. at pp. 644-645 [73 L.Ed.2d at pp. 284-285]) and in regulating the internal affairs of a domestic corporation (id. at pp. 645-646 [73 L.Ed.2d at p. 285]) were outweighed by the burden on interstate commerce \"[arising] from the statute's . . . nationwide reach which purports to give Illinois the power to determine whether a tender offer may proceed anywhere\" (id. at p. 643 [73 L.Ed.2d 284]).\n\nThis case is different. I shall assume for argument's sake that the state's interests in a free and competitive market in the supply and transportation\n\nof crude oil are no weightier than the interests the Illinois statute was claimed to further. Nevertheless, I cannot deem the burden, if any, that this action threatens to impose on interstate commerce to be as great as that imposed by the Illinois statute. Whereas that statute had a \"nationwide reach which [purported] to give Illinois the power to determine whether a tender offer [might] proceed anywhere \" (457 U.S. at p. 643, italics added), this action -- even if it results in an order of divestiture -- plainly cannot, and indeed does not even purport to, determine whether the Texaco-Getty merger may proceed or survive outside California.\n\nIn conclusion, I would hold that the first cause of action is not barred by the commerce clause.\n\nIV\n\nThe Attorney General contends that the second cause of action alleges facts that are legally sufficient under the Unfair Competition Act, is not preempted by HSR itself or by the consent order, is not barred by the commerce clause, and as a result states a claim on which relief may be granted. The contention, as will appear, fails at the threshold.\n\nThe statute defines \"unfair competition\" to mean, as relevant here, \"unlawful, unfair or fraudulent business practice. . . .\" (Bus. \u0026 Prof. Code, § 17200, italics added.) In so doing it effectively requires what the court variously described in the leading case of Barquis v. Merchants Collection Assn. (1972) 7 Cal. 3d 94 [101 Cal. Rptr. 745, 496 P.2d 817], as \"a 'pattern' . . . of conduct\" (id. at p. 108), \"ongoing . . . conduct\" (id. at p. 111), \"a pattern of behavior\" (id. at p. 113), and, \"a course of conduct\" (ibid.).\n\nWhat the Attorney General challenges in this action is the Texaco-Getty merger. Under the Barquis court's construction of the statute, however, the merger itself cannot be characterized as \"a 'pattern' . . . of conduct,\" \"ongoing conduct,\" \"a pattern of behavior,\" \"a course of conduct,\" or anything relevantly similar: it is rather a single act. That the complaint, under the Attorney General's reading, alleges that Texaco engaged in certain unlawful, unfair, or fraudulent business practices in the past and may engage in other such practices in the future is simply not enough: the complaint attacks not those past or future practices, but only the merger.\n\nV\n\nFor the foregoing reasons I would hold that the judgment of the Court of Appeal should be reversed insofar as it affirms the judgment of dismissal on the first cause of action alleging the Texaco-Getty merger violates the Cartwright Act, and hence I dissent from the judgment of the court in that\n\nregard. And I would hold that the judgment of the Court of Appeal should be affirmed insofar as it affirms the judgment of dismissal on the second cause of action alleging the merger violates the Unfair Competition Act, and hence I concur in the judgment of the court in that regard.\n\n\u003cspan class=\"fn\"\u003e1. Several days after oral argument in this case, defendant Texaco petitioned under the federal bankruptcy law for protection from creditors. Thereafter the United States Bankruptcy Court, Southern District of New York, approved by order a stipulation between the parties in this suit. The stipulation provides that the parties desire this appeal be determined by this court and that \"[neither] Texaco nor the Attorney General shall use the pendency of Texaco's [bankruptcy] case as a basis to challenge the other party's right to proceed with the pending appeal in [this] litigation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. As discussed below, this was the accepted interpretation of \"combination\" when the statute was enacted. (See post, part II.C.1.b.; cf., G.H.I.I. v. MTS, Inc. (1983) 147 Cal. App. 3d 256, 266 [195 Cal. Rptr. 211, 41 A.L.R.4th 653] [suggesting similar interpretation]; Bondi v. Jewels by Edwar, Ltd. (1968) 267 Cal. App. 2d 672 [73 Cal. Rptr. 494] [same].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Although overlooked by some prominent commentators who have focused on the history of the federal antitrust laws, it has been correctly observed that \"the first legislation spawned by the national antitrust movement of the late nineteenth century occurred at the state level.\" (Thorelli, The Federal Antitrust Policy: Origin of An American Tradition (1955) pp. 155-157; Rubin, supra, 26 U. Fla. L.Rev at p. 657, and fn. 21.) Indeed, it appears from the debates of the Sherman Act, and the language of the Clayton Act, that Congress borrowed liberally from state statutes of the day (in addition to the common law). On the subject of mergers, for example, compare the acts of Texas (1899), Mississippi (1900), Texas (1903), and Arkansas (1905), all discussed post, pages 1159-1160, with the original language of the Clayton Act (38 Stats. 730 (1914)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. (1890) Miss. Laws, ch. 36.) Still, the Texas law was well publicized in this early period. The Texas bill was presented at conventions of state legislators in 1889 and 1890, and \"this attention . . . resulted in several states copying [the Texas bill].\" (Mathews, supra, Texas Antitrust Laws, pp. 29-30; see also Cotner, supra, at pp. 165-166.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See Letwin, Congress and the Sherman Antitrust Law: 1887-1890 (1956) 23 U. Chi. L.Rev. 221, 249-255; Rubin, supra, 26 U. Fla. L.Rev. 653, 661, footnote 38; Thorelli, supra, at pages 210-214.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. (1890 La. Acts, No. 86; 1905 Neb. Laws, ch. 162, §§ 1, 2.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In addition to the initial round of states that adopted the Kansas-Maine format (ante, p. 1154), at least five more states adopted that format. (1891 Ill. Laws, p. 206; 1897 S.C. Acts, No. 265; 1899 Ark. Acts 41; 1907 Wis. Laws, § 1791j, pp. 432-433; 1907 Ind.Acts, ch. 243.) Moreover, a number of states, some of which had previously embraced the Texas format, subsequently enacted a law using the Kansas-Maine format. (See the laws of Kansas, Texas, and Mississippi, post, fn. 9.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It is widely recognized that the 1889 Texas act served as the model for a number of state acts that followed it. (Rubin, supra, 26 U. Fla. L.Rev. 653, 659; Mathews, Texas Antitrust Laws, pp. 29-30.) In addition to the initial laws of Mississippi and Ohio (see 1890 Miss. Laws, ch. 36; 1898 Ohio Laws, p. 143), the Texas act appears to have been the model for the subsequent acts of Kansas, Michigan, North Dakota, South Dakota, Nebraska, as well as forming the basis for later revisions of the Texas antitrust acts. (See post, fn. 9.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Texas enacted a new act, similar in all relevant respects to its first, in 1895. (1895 Tex. Gen. Laws, ch. 83.) Mississippi, in 1900, and Texas, in 1899, switched from the Texas format to the Kansas-Maine format. (1900 Miss. Laws, ch. 88; 1899 Tex. Gen. Laws, ch. 146.) Missouri reenacted its Kansas-type act in 1891 (Mo. Laws, p. 186) and did so again in 1895 (Mo. Laws, p. 237). Texas then switched, as did five other states, from the Kansas-Maine format to the Texas format. (1903 Tex. Gen. Laws, ch. 94; 1897 Neb. Laws, ch. 79; 1897 Kan. Sess. Laws, ch. 265; 1897 S.D. Laws, ch. 94; 1899 Mich. Pub. Acts, No. 255; 1905 N.D. Laws, ch. 188.) In 1893, and again in 1897, Illinois reenacted Kansas-type laws (Ill. Laws, p. 89; Ill. Laws, p. 298). In 1899 Kansas returned to its original format, and Missouri again reenacted a Kansas-type law (1899 Kan. Sess. Laws, ch. 293; 1899 Mo. Laws, p. 314). In 1905, Nebraska switched to a format following the Sherman Act. (1905 Neb. Laws, ch. 162.) Tennessee reenacted a law following the Kansas scheme (1903 Tenn. Pub. Acts, ch. 140), and Michigan returned to a Kansas-type law. (1905 Mich. Pub. Acts, No. 229.) Arkansas reenacted a Kansas-type law (1905 Ark. Acts, No. 1). Finally, Missouri continued to tinker with its Kansas-type law. (1907 Mo. Laws, p. 377.) At least one state enacted a law that combined attributes of the two formats. (1892 La. Acts, No. 90.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The court first confronted the meaning of the term in Texas \u0026 P. Coal Co. v. Lawson (1896) 89 Tex. 400 [34 S.W. 919]. In that case, a coal company leased some of its land to a saloon owner. The contract provided the company would lease to no other saloon; that it would pay its employees by check, not money; and that the saloon would accept the checks as payment, and remit to the company two-thirds of the profits as rent. The court held this illegal under the statute because \"the contract provided, not only for the union or association by the parties of their capital, but also for their united and associated action, during the entire term, in furtherance of the common object, and was, therefore, a 'combination of capital' and 'acts.'\" (Id., at p. 920.) Similar decisions focusing on the definition of \"combination\" were handed down thereafter. (See Welch v. Phelps \u0026 Bigelow Windmill Co. (1896) 89 Tex. 653 [36 S.W. 71] [\"The purpose of the statute was to prohibit 'two or more persons,' etc., from uniting or associating their otherwise independent, separate, and possibly competing 'capital, skill, or acts' . . .\"]; Texas Brewing Co. v. Templeman (1896) 90 Tex. 277 [38 S.W. 27, 28]; Fuqua v. Pabst Brewing Co. (1896) 90 Tex. 298 [38 S.W. 29, 30].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See post, footnote 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. (E.g., 1899 Tex. Gen. Laws, ch. 146, §§ 2, 3, 4, 13; 1903 Tex. Gen. Laws, ch. 94, §§ 2, 4; 1900 Miss. Laws, ch. 88, § 2; 1905 Neb. Laws, ch. 162, § 2; see also 1889 Tenn. Pub. Acts, ch. 250, § 1; 1890 La. Acts, No. 86, § 3; 1907 Ind. Acts, ch. 243, § 2.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Eleven years earlier, a commentator had recommended prohibiting corporations from holding or controlling, directly or indirectly, the stock of another corporation. (Stimson, Trusts (1888) 1 Harv.L.Rev. 132, 143.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Comparison of selected relevant language (and enforcement provisions) from the various acts and the Reagan bills of 1889 and 1890 demonstrates that the Cartwright Act, although similar in many respects to the Reagan bill of 1890, is more similar to the Texas and Michigan acts. Comparison also discloses that the language of the Cartwright Act has very little in common with that of the Sherman Act. By way of example, some key passages are set out below, with deviation from the words and punctuation of the Cartwright Act noted by underscoring. The Cartwright Act. As originally enacted, the Cartwright Act read: \"A trust is a combination of capital, skill or acts by two or more persons, firms, partnerships, corporations or associations of persons, or of any two or more of them for either, any or all of the following purposes: [ para. ] 1. To create or carry out restrictions in trade or commerce. . . . [ para. ] 5. To make or enter into or execute or carry out any contracts, obligations or agreements of any kind or description, . . . so as to directly or indirectly preclude a free and unrestricted competition among themselves, . . . or by which they shall agree to pool, combine or directly or indirectly unite any interests that they may have connected with the sale or transportation of any such article or commodity, that its price might in any manner be affected. . . .\" (Stats. 1907, ch. 530, § 1 (1) \u0026 (5), pp. 984-985.) The Reagan Bill of 1888. This bill read: \"That a trust is the combination of capital or skill . . . by two or more persons . . . for . . . the following purposes: [ para. ] First. To create or carry out restrictions on trade . . .. [ para. ] Fourth. To create a monopoly. . . . \" (19 Cong.Rec. p. 7512.) The Texas act of 1889. The original Texas act expanded the scope and specified the reach of the 1888 Reagan bill by rewriting the first sentence, and adding a fifth paragraph. It also narrowed the reach of the act by deleting the monopoly provision. It read as follows: \"That a trust is a combination of capital, skill, or acts by two or more persons, firms, . . . corporations, or associations of persons, or of either two or more of them for either, any, or all of the following purposes: First -- To create or carry out restrictions in trade . . . . Fifth -- To make or enter into, or execute or carry out any contract , obligation, or agreement of any kind or description . . . to . . . preclude a free and unrestricted competition among themselves . . . or by which they shall agree to pool, combine, or . . . unite any interest that they may have in connection with the sale or transportation of any such article or commodity that its price might in any manner be affected. . . . \" (1889 Tex. Gen. Laws, ch. 117, § 1.) The acts of Mississippi and North Dakota closely follow this language. (1890 Miss. Laws, ch. 36, § 1; 1905 N.D. Laws, ch. 188, § 1.) The Reagan bill of 1890. This second Reagan bill copied the first sentence of the above act, replaced the monopoly provision, renumbered the final sentence as paragraph six, copied the first half of that sentence from the above act, and made syntax and punctuation changes in the last half of that sentence. It read as follows: \"That a trust is a combination of capital, skill, or acts by two or more persons, firms, . . . corporations, or associations of persons, or of any two or more of them for either, any, or all of the following purposes: [ para. ] First. To create or carry out restrictions in trade . . . [ para. ] Fifth. To create a monopoly . . . . [ para. ] Sixth. To make or enter into or execute or carry out any contract, obligation, or agreement of any kind or description . . . so as to . . . preclude . . . free and unrestricted competition among themselves . . . or by which they shall agree to pool, combine, or . . . unite any interest . . . they may have connected with the sale or transportation of any such article or commodity that its price may, in any manner, be so affected. . . . \" (21 Cong.Rec. p. 2456 (1890).) The Michigan act of 1899. This act modified the first sentence by adding the word \"partnerships,\" substituting \"arts\" for \"acts,\" and deleting some punctuation. It also deleted the monopoly provision, added an opening clause to the fifth paragraph, made plural that paragraph's list of \"contracts, obligations or agreements,\" added the phrase \"directly or indirectly\" in two places in the middle of that sentence, and modified (consistently with the 1889 Texas act) the syntax of the final clause of the last sentence (\"that its price might in any manner be affected. . . .\"). It read: \"That a trust is a combination of capital, skill or arts by two or more persons, firms, partnerships, corporations or associations of persons, or of any two or more of them for either, any or all of the following purposes: [ para. ] 1. To create or carry out restrictions in trade or commerce;. . . [ para. ] 5. It shall hereafter be unlawful . . . [to] make or enter into or execute or carry out any contracts, obligations or agreements of any kind or description, . . . so as to directly or indirectly preclude a free and unrestricted competition among themselves, . . . or by which they shall agree to pool, combine or directly or indirectly unite any interests that they may have connected with the sale or transportation of any such article or commodity, that its price might in any manner be affected. . . .\" (1899 Mich. Pub. Acts, No. 255, § 1 (1) \u0026 (5).) Michigan, in turn, appears to have followed the language of the Ohio act of 1898. (See Ohio Laws, p. 143 et seq., § 1 (1) \u0026 (5).) (The language of the Sherman Act, by contrast, differed substantially from all of the above. See ante, pp. 1155-1156, quoting 15 U.S.C. §§ 1, 2.) In addition to the above noted differences in language and coverage between the Reagan bills and the Cartwright Act, we also note that the two Reagan bills differed in another significant respect from the Cartwright Act, and from the acts of Texas and Michigan: Unlike the latter acts, the Reagan bills contained essentially no enforcement provision. (Compare 19 Cong.Rec. 7512-7513 (1888), and 21 Cong.Rec. 2456 (1890), with 1889 Tex. Gen. Laws, ch. 117, §§ 2-5, 7-9; 1899 Mich. Pub. Acts, No. 255, §§ 2-3, 5-6, 11; and Stats. 1907, ch. 530, §§ 2-3, 5-6, 11.) This, together with the striking similarity between the enforcement provisions of the three acts, further indicates that the Cartwright Act was modeled after the Texas and Michigan acts, and not the Reagan bills or the Sherman Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Additionally, it is clear that our Legislature is well aware of the Clayton Act, section 7 of which expressly regulates mergers. (15 U.S.C. § 18; see post, fn. 18.) In 1961 the Legislature enacted Business and Professions Code section 16727, essentially adopting section 3 of the Clayton Act (15 U.S.C. § 14), which deals with exclusive dealing arrangements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The antimerger provisions of the original three states remain in effect today. (Tex. Bus.\u0026 Comm. Code Ann., § 15.05(d); Miss. Code Ann., § 75-21-13; Ark. Code Ann., § 4-75-301.) We note that the Uniform State Antitrust Act (1974) does not contain an antimerger provision. This may reflect some commentators' concern about the propriety of such state regulation. (See Rubin, supra, 26 U.Fla. L.Rev. 653, 731, 723, fn. 502, and authorities cited.) The drafters of at least one modern state antitrust statute specifically declined to adopt the Clayton Act, which, inter alia, regulates mergers. (See 15 U.S.C. § 18; coms., Ill. Stat. Ann., ch. 38, § 60 et seq., p. 441 [drafters' comments on 1965 Ill. Laws, p. 1943].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. (E.g., Von Kalinowsky \u0026 Hanson, The California Antitrust Laws: A Comparison With the Federal Laws (1959) 6 UCLA L.Rev. 533, 553; but see Folsom \u0026 Fellmeth, California Antitrust Law and Practice (1983) § 45, pp. 37-38; Lowell v. Mother's Cake \u0026 Cookie Co. (1978) 79 Cal. App. 3d 13, 23 [144 Cal. Rptr. 664, 6 A.L.R.4th 184]; Munter v. Eastman Kodak Co. (1915) 28 Cal. App. 660, 666 [153 P. 737] [dicta].) We need not decide the Attorney General's claim that the Cartwright Act reaches monopolistic practices by individual firms, because the Attorney General's complaint does not allege a monopoly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See Kintner, supra, section 10.77, page 292 (Section 7 of the Clayton Act \"was designed to reach acquisitions and mergers before they accomplished their anticompetitive effects. [It] was to reach 'incipient monopolies and trade restraints' which would otherwise be immune from attack under the Sherman Act. Therefore, the Clayton Act speaks in terms of probabilities rather than actualities. The Government need not show that a lessening of competition has already occurred, or that it will certainly occur; instead, the Clayton Act merely requires that it is probable that competition will be substantially lessened by the transaction.\"). (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Attorney General did not challenge the merger on common law grounds, and we do not address the issue here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Cianci's dicta is evidently based on Business and Professions Code section 16720, subdivision (e)(4), which prohibits certain activity respecting \"'any . . . article or commodity, that its price might in any manner be affected.'\" (40 Cal. 3d at p. 918, italics added in Cianci.) This provision -- including the underscored phrase -- appears in the original Texas act of 1889, and most acts following it. (See 1889 Tex. Gen. Laws, ch. 117, § 1; e.g., 1890 Miss. Laws, ch. 36, § 1; 1897 Kan. Sess. Laws, ch. 265, § 1; 1897 Neb. Laws, ch. 79, § 1; 1898 Ohio Laws, p. 143, § 1(5); 1899 Mich. Pub. Acts No. 255, § 1(5); N.D. Laws, ch. 188, § 1.) We are aware of no case construing this language as suggested by Cianci's dicta.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. To the extent it is inconsistent with our conclusion, we disapprove dicta in Munter, supra, 28 Cal. App. 660, 666.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Section 7 of the Clayton Act provides in relevant part: \"No person engaged in commerce or in any activity affecting commerce shall acquire, directly or indirectly, the whole or any part of the stock or other share capital and no person subject to the jurisdiction of the Federal Trade Commission shall acquire the whole or any part of the assets of another person engaged also in commerce or any activity affecting commerce, where in any line of commerce or in any activity affecting commerce in any section of the country, the effect of such acquisition may be substantially to lessen competition, or to tend to create a monopoly.\" (15 U.S.C. § 18.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 5(a)(1) of the Federal Trade Commission Act provides: \"Unfair methods of competition in or affecting commerce, and unfair or deceptive acts or practices in or affecting commerce, are declared unlawful.\" (15 U.S.C. § 45(a)(1).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The provisions of the Cartwright Act relevant to this action are codified in Business and Professions Code sections 16720 and 16726. Section 16726 declares: \"Except as provided in this chapter, every trust is unlawful, against public policy and void.\" Section 16720, in pertinent part, defines a \"trust\" as \"a combination of capital, skill or acts by two or more persons . . . To make or enter into or execute or carry out any contracts, obligations or agreements of any kind or description, by which they . . . Agree to pool, combine or directly or indirectly unite any interests that they may have connected with the sale or transportation of any . . . article or commodity, that its price might in any manner be affected.\" (Id., § 16720, subd. (e)(4).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Business and Professions Code section 17200 provides, in relevant part, that \"unfair competition shall mean and include unlawful, unfair or fraudulent business practice. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The pertinent discussion in Gates is as follows: \"In order to constitute a trust, within the meaning of the statute, there must be a 'combination of capital, skill or acts by two or more.' 'Combination,' as here used, means union or association. If there be no union or association by two or more of their 'capital, skill or acts,' there can be no 'combination,' and hence no 'trust.' When we consider the purposes for which the 'combination' must be formed, to come within the statute, the essential meaning of the word 'combination,' and the fact that a punishment is prescribed for each day that the trust continues in existence, we are led to the conclusion that the union or association of 'capital, skill or acts' denounced is where the parties in the particular case designed the united co-operation of such agencies, which might have been otherwise independent and competing, for the accomplishment of one or more of such purposes. In the case stated in the petition there is no 'combination.' The plaintiff bought defendant's goods, together with the good will of his business, both of which were subjects of purchase and sale; and, in order to render the sale of the good will effectual, the seller agreed that he would not, for one year thereafter, do a like business in that town. This was but a kind of covenant or warranty that the purchaser should have the use and benefit of such good will during that year; for it is clear that, if the seller had immediately engaged in a like business at the same place, the purchaser would have had no benefit therefrom. By this transaction neither the capital, skill, nor acts of the parties were brought into any kind of union, association, or co-operative action. The purchaser became the owner of the things sold, and the seller was, by the terms of the contract, restrained from doing a thing which, if done, would have defeated in part the effectiveness of the sale. The agreement that the seller would exert himself to aid the purchaser in securing patronage but constituted the former the agent of the latter for that purpose, and in no wise contravened the statute.\" (90 Tex. at pp. 564-565 [39 S.W. at pp. 1080-1081].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The majority present three minor arguments in support of their conclusion that the Cartwright Act cannot be construed to cover mergers. The first is that at the time the statute was enacted the term \"combination\" referred narrowly to only that kind of arrangement in which the combining entities maintain separate and independent interests and identities. As I have shown, this is not so. The majority may be understood to claim that certain language in G.H.I.I. v. MTS, Inc. (1983) 147 Cal. App. 3d 256, 266 [195 Cal. Rptr. 211, 41 A.L.R.4th 653], and Bondi v. Jewels by Edwar, Ltd. (1968) 267 Cal. App. 2d 672, 678 [73 Cal. Rptr. 494], support their construction. They are wrong: that language says nothing more than that \"combination\" does embrace an arrangement between two or more persons within a single entity. The majority's second argument is that had the Legislature intended the Cartwright Act to apply to mergers it would have inserted an express antimerger provision as other state legislatures had done. But if as I have concluded the language of the act is broad enough to reach mergers, no such express provision was needed. If the Legislature has never expressly provided that the Cartwright Act is applicable to mergers, it is because it has never had to. As I have explained, in Munter v. Eastman Kodak Co., supra, 28 Cal. App. 660, the Court of Appeal stated clearly, albeit impliedly, that although only mergers with anticompetitive effects are unlawful under the Cartwright Act, mergers are indeed within the act's coverage. The majority's third argument appears to be as follows: in 1961 the Legislature enacted Business and Professions Code section 16727 (hereinafter section 16727), which essentially incorporated section 3 of the Clayton Act (15 U.S.C. § 14) prohibiting exclusive-dealing agreements; in so doing it manifested its recognition that the Cartwright Act did not have the reach of the Clayton Act generally; it thereby impliedly recognized that the Cartwright Act did not cover mergers. The argument is unpersuasive. I believe that the Legislature's enactment of section 16727 can reasonably be understood not as the recognition the majority claim it is, but rather as a response to the decision in Rolley, Inc. v. Merle Norman Cosmetics, supra, 129 Cal. App. 2d 844, 845-852, which held that the Cartwright Act did not apply to exclusive-dealing agreements. In an attempt to support their conclusion that the Legislature did not intend to include mergers in the scope of the Cartwright Act, the majority assert that that body may have had a reason to so limit the statute's reach. On this point, however, they engage in mere speculation and conjecture -- and altogether unpersuasive speculation and conjecture at that: in view of the fact that it sought to further consumer welfare by enacting the Cartwright Act, the Legislature cannot reasonably be deemed to have intended the application of the statute to turn on the formal characteristics of an arrangement rather than on its potential economic effects.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In Rolley, Inc. v. Merle Norman Cosmetics, supra, 129 Cal. App. 2d 844, the court stated: \"the Clayton Act is broader in its prohibitions than the Sherman Act. It is in the same respects broader than the Cartwright Act . . . .\" (Id. at p. 851.) In Milton v. Hudson Sales Corp. (1957) 152 Cal. App. 2d 418 [313 P.2d 936], the court followed Rolley : \"the Clayton Act is broader in its prohibitions than the Sherman Act, and, in the same respects, is broader than the Cartwright Act . . . .\" (Id. at p. 441.) In light of the foregoing discussion each statement must be considered erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. I observe in passing that as of this date the FTC's \"solution\" to the anticompetitive problems posed by the Texaco-Getty merger in California appears destined for failure. As noted above, that \"solution\" was predicated on the expectation that by 1989, when the part of the consent order requiring Texaco to supply Getty crude oil to independent refiners in the state expires, there would be new supplies of oil from offshore sites to satisfy all market demands. That expectation, however, will likely be frustrated. It currently appears that offshore sites may not even be leased for oil production until 1990 or later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendants have submitted briefs in which they present arguments to the contrary. In the course of my analysis I shall address their points. After briefing was completed, they directed the court's attention to an article by Daniel Oliver, appointed to the FTC as Chairman in 1986, which is essentially devoted to an analysis of the present action: Federal and State Antitrust Enforcement : Constitutional Principles and Policy Considerations (1988) 9 Cardozo L.Rev. 1245 [hereinafter Oliver, Federal and State Antitrust Enforcement ]. Although Chairman Oliver's views cannot be rejected out of hand, they need not be addressed separately: they amount to little more than restatements of arguments presented by defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendants' attempt to empty HSR's savings provision of its substance founders on the plain meaning of the words of the clause and hence does not require an extended response. One point, however, may be made. Contrary to defendants' assertion, nothing in the language of HSR, its purpose, or its legislative history supports, less still compels, the conclusion that the statute bars actions in state courts based on state antitrust law. The legislative history cited by defendants and rehearsed in Oliver, Federal and State Antitrust Enforcement, supra, 9 Cardozo L.Rev. at page 1270, establishes only that the savings provision was intended, inter alia, to preserve the federal government's right to challenge a merger -- not that it was meant to preclude a challenge founded in state law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Russo v. Texaco, Inc. (E.D.N.Y. 1986) 630 F.Supp. 682, 685, affirmed (2d Cir. 1986) 808 F.2d 221, the district court noted with apparent approval language used by the court of Appeal below: \"That order 'comprehensively [regulated] the merger between Texaco and Getty on a nationwide basis.'\" In reliance on that quotation, defendants argue that the consent order is indeed \"comprehensive.\" Their reliance, however, is misplaced. The district court's approval cannot be understood to extend beyond the Court of Appeal's language to its conclusion that the consent order is \"comprehensive\" for purposes of preemption. The district court did not address, less still resolve, the issue of preemption. \"It is axiomatic that cases are not authority for propositions not considered.\" (People v. Gilbert (1969) 1 Cal. 3d 475, 482, fn. 7 [82 Cal. Rptr. 724, 462 P.2d 580]; accord, McDowell \u0026 Craig v. Santa Fe Springs (1960) 54 Cal. 2d 33, 38 [4 Cal. Rptr. 176, 351 P.2d 344].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defendants have submitted briefs in which they present arguments to the contrary. In the course of my analysis I shall address their points. I shall not address, however, the views expressed in Oliver, Federal and State Antitrust Enforcement, supra, 9 Cardozo L.Rev. 1245: they amount to little more than restatements of arguments set forth by defendants. (See fn. 9, ante.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. To the extent defendants seek to establish that the state's interests in subjecting the Texaco-Getty merger to review in this action are not compelling by asserting that the Attorney General \"cannot cite a single previous instance where this State sought to challenge a merger under the Cartwright Act,\" they are patently unsuccessful. First, it simply does not follow from the alleged fact that the state has not challenged any other merger under the Cartwright Act that its interests in this particular very large merger in this particular very important industry are not compelling. Second and at least as important, in the past the Cartwright Act was as a practical matter unnecessary in view of the vigorous prosecution of Clayton section 7 actions by federal enforcement agencies and other parties, and the plain receptivity of the federal courts to such actions. That situation, as is commonly recognized, has changed. (See, e.g., Hovenkamp, State Antitrust, supra, 58 Ind. L.J. at p. 376 [\"the notion that federal antitrust law is aggressive . . . is largely a thing of the past\"].)\u003c/span\u003e\n\n",
    "body_length": 193791,
    "citedas": [
      "252 Cal. Rptr. 221",
      "762 P.2d 385",
      "46 Cal. 3d 1147"
    ],
    "attorneys": "John K. Van de Kamp, Attorney General, Andrea Sheridan Ordin, Chief Assistant Attorney General, Michael J. Strumwasser, Special Assistant Attorney General, Sanford N. Gruskin, Assistant Attorney General, Lawrence R. Tapper, Michael I. Spiegel, Owen Lee Kwong and Richard Light, Deputy Attorneys General, for Plaintiff and Appellant. Leslie C. Randall, Hefner, Stark \u0026 Marois, David G. Yetter, Heller, Ehrman, White \u0026 McAuliffe, Laurence M. Popofsky, Kaye, Scholer, Fierman, Hays \u0026 Handler, Milton J. Schubin and Anton Arbisser for Defendants and Respondents.",
    "category": [
      "243",
      "251",
      "252"
    ],
    "judges": "Opinion by Lucas, C. J., with Panelli, Arguelles and Eagleson, JJ., concurring. Separate concurring and dissenting opinion by Mosk, J., with Broussard and Kaufman, JJ., concurring.",
    "citation_count": 2
  }
}
