{
  "id": "a7OqTGYBTlTomsSBs2k6",
  "document": {
    "title": "Hosain v. Malik",
    "full_title": "JOOHI Q. HOSAIN (FKA MALIK) v. ANWAR MALIK",
    "jurisdiction": "Court of Special Appeals of Maryland",
    "date": "1996-02-21T00:00:00.000Z",
    "docket": "No. 228, September Term, 1995",
    "body": "Joohi Q. Hosain (formerly Joohi Malik) appeals from an order of the Circuit Court for Baltimore County (Kahl, J.) entered in a custody dispute in which appellant, the mother, and appellee, Anwar Malik, the father, have been battling for sole custody of their minor child. By this order, the circuit court declined to assume jurisdiction in the matter and granted comity to various Pakistani court orders that granted sole unrestricted custody of the child to appellee. Four questions were presented originally on this appeal. Appellee presented the first question, a threshold matter, and appellant presented the next three issues. We restate these issues as follows:\n\nI. Should this Court dismiss appellant's appeal because appellant allegedly included and relied on matters in the appendix of her brief that were extraneous to this appeal?\n\nII. Did the circuit court abuse its discretion by proceeding with a remand hearing in the absence of the child's attorney?\n\nIII. Did the circuit court err in determining that appellant failed to prove that Pakistani law was not in substantial conformity with Maryland law?\n\nIV. Did the circuit court err in not assuming jurisdiction under the Uniform Child Custody Jurisdiction Act?\n\nSubsequent to oral argument before a three-judge panel of this Court on October 6, 1995, we issued an Order to counsel to appear before this Court, en banc, on January 10, 1996 to specifically address the querie, \"In deciding whether the Pakistani Court applied the best interest of the child standard, should the trial court's determination focus on the particular culture, customs and mores of Pakistan and the religion of the parties or, alternatively, is the best interest standard to be determined based on Maryland law, i.e., American cultures and mores?\". We answer the four original questions in the negative and we hold that the lower court properly determined the best interest standard by applying relevant Pakistani customs, culture and mores. We, therefore, affirm the order of the circuit court.\n\nFACTS\n\nThis is a long and bitter child custody dispute involving orders of courts in both Maryland and Pakistan. Not too long ago, these parties and their dispute were before this Court in Malik v. Malik, 99 Md. App. 521, 638 A.2d 1184 (1994), which we decided on March 30, 1994. Needless to say, with the battle still raging, the parties have returned once again to this Court. Subsequent to oral argument before a three-judge panel of this Court, it was determined that an en banc hearing would be necessary. The Court set the matter in for an en banc hearing. The facts of this appeal arise directly out of the proceedings following Malik.\n\nAs a matter of background, we recite the facts of this case as stated in Malik:\n\nThe parties to this appeal are battling for custody of their daughter (the child), who was born in Karachi, Pakistan on September 11, 1983. . . . The child's father . . . is a citizen of Pakistan. The child's mother, also a citizen of Pakistan, has obtained a student visa that permits her to remain in this country on a temporary basis. The parties were married on June 20, 1982 and lived together until September of 1990, at which time the child was attending St. Joseph's Convent School in Karachi.\n\nOn September 15, 1990, [the mother] left the marital home and moved in with her parents. She took the child with her. [The father] sued for custody. When [the mother] learned of [the father's] lawsuit, she fled the country, taking the child with her. Soon thereafter, [the mother] moved into the home of a man with whom she has continued to live and by whom she conceived a son who was born in 1991. [The mother] was represented by counsel in the Pakistani custody proceeding. She refused, however, to appear in person. She also refused to obey the judge's order that the child be produced. It appears that the judge did consider a written statement submitted by [the mother], but awarded custody to [the father].\n\nHaving obtained legal custody of his daughter, [the father] set out to find her. [The mother] hid the child from [the father] for over two years. In 1992, [the father's] private detectives were finally able to locate the child and [the mother] in Baltimore County. Once she realized that she had been discovered and that [the father] was about to seek enforcement of the order granting him custody of his daughter, [the mother] filed a complaint in the Circuit Court for Baltimore County, requesting custody of the child and a restraining order against [the father]. At the conclusion of an emergency hearing, the trial judge decided that the Circuit Court for Baltimore County had jurisdiction to determine custody, that the Pakistani custody order was not entitled to comity, that temporary custody should be granted to [the mother], and that [the father] should be enjoined from going within three hundred feet of the child, [the mother] or their residence.\n\n99 Md. App. at 523-24. The parties point out to this Court that appellant fled to the U.S. from Pakistan with the child shortly before -- not after -- appellee filed a petition for custody in Pakistan. In this regard, we stand corrected. Additionally, appellant has since married the man by whom she had a son.\n\nIn Malik, the father presented the following question for our review: \"Did the chancellor err in exercising jurisdiction when custody proceedings were pending in a foreign country?\" Id. at 525. Although we held that the circuit court did have \"home state\" jurisdiction under the Uniform Child Custody Jurisdiction Act (UCCJA) (codified in MD. CODE ANN., FAM. LAW § 9-201 to 9-224 (1991)), we did not affirm the circuit court's refusal to grant comity to the Pakistani custody order. Id.\n\nRather, we held that \"the circuit court should decline to exercise jurisdiction unless persuaded that the Pakistani court either (1) did not apply the best interest of the child standard when it awarded custody to [the father], or (2) arrived at its decision by applying a law (whether substantive, evidentiary, or procedural) so contrary to Maryland public policy as to undermine confidence in the outcome of the trial.\" 99 Md. App. at 533-34. Accordingly, we remanded the case to the circuit court for an evidentiary hearing on these issues. Id. at 536. In so doing, we set forth the law for the circuit court to apply in determining whether the evidence that would be introduced demonstrated that the Pakistani court did not apply law in \"substantial conformity with Maryland law.\" Id. at 534-36. In addition, we held that the burden was on the mother to prove these matters by a preponderance of the evidence. Id. at 536.\n\nAccordingly, on November 14, 1994, the parties returned to circuit court for the remand hearing. Consistent with our holding in Malik, counsel for both appellant and appellee were present and prepared to introduce evidence and examine witnesses regarding child custody law and its application in Pakistan. Court-appointed counsel for the minor child, however, failed to appear for the hearing. As counsel explained in her brief to this Court, \"counsel for the minor child was aware of the hearing date, but failed to note it in her calendar and was out of the state at the time of the hearing.\" The hearing continued in the absence of the child's lawyer.\n\nEach party came to the hearing armed with an expert witness to testify concerning the law of Pakistan. Appellant's expert witness was Dr. Hafeez Malik (no relation to the parties). Dr. Malik is a professor of political science at Villanova University. Dr. Malik's specialty involves Pakistani foreign policy as it relates to other nations. Dr. Malik testified that he has conducted research on Pakistani political, social, legal, and constitutional issues. The record reveals that Dr. Malik has a great deal of expert knowledge about Pakistan and its policies, through his research, membership in various associations, and publications. Dr. Malik, however, is not a lawyer. Although he did read the Pakistani court orders in this case, Dr. Malik's testimony indicated only a limited knowledge of Pakistani child custody law. Dr. Malik conceded that his area of specialty was not custody matters.\n\nDr. Malik acknowledged that the Guardians and Wards Act of 1890 (the Act), a British enactment governing child custody matters, is an accepted part of Pakistani law that governs child custody matters and specifically requires a Pakistani court to consider the \"welfare of the minor.\" Dr. Malik recognized that, in application of the welfare of the minor test, the Act directs the court to consider such factors as the child's age, sex, religion, character and capacity of the guardian, nearness of the guardian's kin to the minor, parental wishes, the child's preference, and any existing or previous relationship of the proposed guardian with the minor or his or her property.\n\nDr. Malik testified that, although \"lip service\" was paid to the welfare of the child test, the Pakistani court did not really apply it to his satisfaction in the instant dispute, but rather focused on only one or two factors -- fitness of the parent and religion. Throughout his testimony, Dr. Malik characterized the proceedings in Pakistan as \"one-sided,\" because the Pakistani court never considered appellant's side of the dispute due to her absence from the proceedings. Dr. Malik, however, conceded that appellant at all times had the right to appear before the Pakistani court and to produce witnesses on her behalf and cross-examine appellee, but elected not to do so.\n\nAppellee's expert witness was retired Pakistani Justice Sardar Muhammad Dogar. Justice Dogar practiced law for twenty-five years in Pakistan and was a Pakistani appellate court judge for twelve and one-half years. Although Justice Dogar had not handled many child custody cases, he did say that as an appellate judge he was required to be well versed with all areas of law. He read the Pakistani court orders.\n\nJustice Dogar testified that child custody disputes are governed by the \"welfare of the minor\" standard as enacted in the Act. He explained that Pakistani courts look to various factors in determining the welfare of the child, including character and fitness of the parents, desire of the child's parents, the child's preference, opportunities affecting the future life of the child, the child's age, sex, parental abandonment, abuse, religion, and the child's relationship with the proposed custodian.\n\nJustice Dogar recognized that attention to \"personal law,\" which he described as religious law based on Hinduism and Islam, is another factor to be considered in the Act. According to Justice Dogar, the \"personal law,\" among other things, dictates whether the mother or father should get custody of the child, depending on the age and sex of the child. The testimony of both experts indicated that this is a set of parental preference rules based on religious and societal doctrine. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn addition, Justice Dogar explained that the child's religion is a very important factor. Specifically, he stated that custody of a Moslem child will not be granted to an individual intending to raise the child as a non-Moslem. Similarly, Justice Dogar testified that custody of a non-Moslem child will not be granted to an individual intending to raise the child as a Moslem.\n\nFrom his review of the Pakistani orders, Justice Dogar believed that the welfare of the child standard was applied in Pakistan. He also opined that the Pakistani court did not consider appellant's allegations. This was because a natural presumption was drawn that she did not have a good case from her failure to show up at the hearing in Pakistan, having received proper notice thereof. Had appellant elected to appear, Justice Dogar stated, she could have presented witnesses and cross-examined witnesses.\n\nSubsequent to the hearing day, at the conclusion of counsels' arguments, the circuit court issued a bench ruling, followed by a formal written order several days later. After commenting that appellee's expert was more qualified on issues of Pakistani child custody law than appellant's expert, the circuit court concluded that appellant \"failed to prove by a preponderance of the evidence that which the Court of Special Appeals indicated [in Malik ] she must prove, and this court must decline to exercise its jurisdiction in this case.\" The circuit court, therefore, granted comity to the Pakistani custody order.\n\nThe circuit court also issued a written order dated December 12, 1994, which stated that appellant \"failed to prove, by a preponderance of the evidence, either of the tests set out by the Court of Special Appeals . . .\" As a result, the order concluded that the circuit court declined to assume jurisdiction in this matter and granted comity to the Pakistani child custody orders. It is from this order that appellant appeals.\n\nLEGAL ANALYSIS\n\nI\n\nWe first address appellee's contention that we should dismiss this appeal because appellant allegedly included and relied on extraneous materials in the appendix of her brief. Appellee specifically objects to the fact that appellant included in the appendix to her brief the reports and affidavits of Dr. Leon A. Rosenberg, Ph.D., Associate Professor of Pediatrics and Medical Psychology at Johns Hopkins University School of Medicine. These materials reflect his custody recommendation. According to appellee, these documents had no bearing on, nor were they even offered as evidence in the November 14, 1994 remand hearing. As a result, appellee charges that these materials are irrelevant and prejudicial to this appeal.\n\nConsequently, appellee urges this Court to exercise its power to dismiss this appeal pursuant to MD. RULES 8-501(m) \u0026 8-602(a)(8) (1995) because the contents of the appendix to appellant's brief do not comply with MD. RULE 8-501, which requires the record extract and brief appendices to contain only those parts of the record \"reasonably necessary\" and \"material\" to the appeal. While we agree with appellee that Dr. Rosenberg's reports and affidavits are irrelevant to this appeal and should not have been included in the appendix of appellant's brief, we decline to exercise our power to dismiss this appeal. Instead, we simply shall not consider those extraneous materials, as appellee alternatively requests of this Court. See Frosburg v. State Dept. of Personnel, 37 Md. App. 18, 32, 375 A.2d 582 (1977).\n\nII\n\nAppellant's first argument is that the circuit court abused its discretion by proceeding with the remand hearing in the absence of the child's court-appointed attorney. Appellee, on the other hand, contends that appellant failed to preserve this issue for appeal under MD. RULE 8-131(a), because appellant never objected to proceeding with the hearing in the absence of the child's counsel. Additionally, appellee asserts that, even if the matter was properly preserved, the circuit court did not abuse its discretion. We agree with appellee that this issue was not properly preserved for appeal, and we may therefore, decline to review the issue. Nonetheless, for the benefit of appellant and the circuit court, we observe that conducting the remand hearing without the child's attorney was not an abuse of discretion.\n\nAlthough appellant states in her brief that the circuit court proceeded \"over the objection of counsel,\" our review of the record reveals that counsel never made any such objection at the time the matter of the child's attorney's presence initially arose during the remand hearing. At the very beginning of the remand hearing, after greeting those present in the courtroom and calling the case, the circuit court stated the following:\n\nAnd my understanding is that [the child's attorney], who was appointed to represent the child in the case, is not available. She apparently, although she agreed to this date, she is not here and she is not able to be contacted. My understanding is she may be on her way in from South Carolina or North Carolina at this time.\n\nI think, in view of the difficulty we have had in setting the case in, at this time, we ought to proceed, even though she is not here. So I am going to make that decision and proceed, even though counsel for the child is not present.\n\nIs there anything by way of opening statement from counsel?\n\nAfter this point, when it would seem most natural to object, neither appellant's counsel nor appellee's counsel objected to proceeding without the child's attorney. The hearing then went forward. The matter arose again after the remand hearing had fully concluded, and the circuit court and parties were discussing reconvening on another day for closing arguments. At this point, in response to appellant's counsel's request that the child's attorney be present to make a statement at closing argument on behalf of the child, the circuit court stated:\n\nThe child's position really at this point is not relevant. We are not at a point where the child's position is to be taken into consideration.\n\nWe are looking here at the mandate of the Court of Special Appeals, which requires me to determine whether [appellant has] met [her] burden of proof, that the Pakistani court did not apply the best interests of the child standard or that, in making its decision, that court applied a rule of law or evidence or procedure so contrary to Maryland public policy as to undermine confidence in the outcome of the trial. Unless either of those are proven, the Circuit Court must decline to exercise jurisdiction and shall grant custody.\n\nThe attorney for the child has no function in making that determination. That's why I elected to proceed today, even though [the child's attorney] is not present. . . .\n\nWithout objecting to the hearing proceeding in the absence of counsel, appellant failed to alert the circuit court or appellee of her position that the hearing should be continued until such time as the child's counsel could be present. Under MD. RULE 8-131(a), we will not ordinarily decide a non-jurisdictional issue \"unless it plainly appears by the record to have been raised in or decided by the trial court . . .\" The primary purpose of this rule is to ensure fairness to all parties in the case and to promote the orderly administration of law. State v. Bell, 334 Md. 178, 189, 638 A.2d 107 (1994). This concern for fairness is furthered by requiring counsel to bring her client's position on the matter at issue to the attention of the circuit court so that the circuit court may pass upon and perhaps correct any potential errors in the proceedings. Id. \"Even errors of Constitutional dimension may be waived by failure to interpose a timely objection at trial, and so may alleged violations of sub-constitutional procedural rules.\" Medley v. State, 52 Md. App. 225, 231, 448 A.2d 363 (1982) (citations omitted). See, e.g., Tichnell v. State, 287 Md. 695, 713-14, 415 A.2d 830 (1980) (defendant's argument of prejudicial removal was not preserved because defendant failed to object to the removal to Wicomico County and failed to seek a further removal to another county); Dresbach v. State, 228 Md. 451, 453, 180 A.2d 299 (1962) (per curiam) (\"If the accused desired to complain of an alleged impropriety of a remark made by the court at his trial he should have either moved to strike it out, or moved to withdraw a juror and declare a mistrial.\").\n\nIn certain circumstances, counsel's objection is not needed to preserve the issue for appeal. For example, in Suggs v. State, 87 Md. App. 250, 252-56, 589 A.2d 551 (1991), during cross-examination of a witness in a criminal trial, defense counsel asked an improper question related to prior criminal misconduct. The prosecutor objected, and the trial judge called a bench conference, during which the trial judge strongly admonished counsel not to \"ever do that again in this courtroom.\" Id. at 254. Counsel agreed not to do so, and cross-examination resumed. Id. Counsel then asked the witness a proper question inquiring into possible bias on the part of the witness. Id. at 254, 256-57. The prosecutor immediately entered a strong objection under the mistaken belief that this question was the same as the previous \"forbidden\" question. Id. The trial court, also under the same mistaken belief, ordered the sheriff to \"take a hold\" of defense counsel, whereupon, in the jury's presence, \"the sheriff moved immediately behind [counsel] in a position to exercise control over him. . . .\" Id. at 254, 257. After this episode, the jury was removed, and the trial court instructed counsel that if he asked the question again he would be put in jail. Id. at 254-56. The jury returned, and the trial continued and the defendant was ultimately convicted. Id. at 251. At no point did defense counsel object to the trial court's action. Id. at 258.\n\nOn appeal to this Court, we held that the trial judge's comments \"painted such a prejudicial portrait of the defense counsel as to deny [the defendant] his right to a fair trial.\" Id. at 257. Furthermore, we held that defense counsel did not waive appellate review by failing to object \"because he reasonably feared that he would personally incur the greater wrath of the already outraged trial judge.\" Id. at 258. In the instant case, in contrast to Suggs, appellant's counsel was not precluded by the wrath of an outraged judge from objecting to proceeding without the child's attorney.\n\nRather, the instant case is much like John O. v. Jane O., 90 Md. App. 406, 435, 601 A.2d 149 (1992), wherein we held that a parent, challenging the circuit court's child custody determination, could not raise for the first time on appeal the absence of the child's attorney during the taking of testimony. In John O., the child's counsel requested, and both parties agreed, that he be excused prior to the taking of testimony. Id. In addition, the child indicated that he did not object to his attorney's absence. Id. Although these facts are not precisely the same as in the case at hand, we believe that John O.'s rule is fully applicable. First, appellant's counsel's silence and her failure to object at the time it would have been natural to do so, is naturally and reasonably construed as counsel's waiver of any objection to the absence of the child's attorney. See Fireman's Fund Ins. Co. v. Bragg, 76 Md. App. 709, 719, 548 A.2d 151 (1988) (\"When a party has the option of objecting, his failure to do so is regarded as a waiver estopping him from obtaining review of that point on appeal.\"). Second, the child's attorney, in her brief to this Court, states that, since the remand hearing did not involve the substantive issue of the child's best interest, she could not have assisted the circuit court in the factual determination required under Malik. Thus, the child, through her attorney, takes the position that counsel's presence was unnecessary in light of the discrete nature of the remand hearing. John O., therefore, is similar to the instant case, and its rule fully applies hereto.\n\nAccordingly, after remaining silent and failing to object to the circuit court's procedure, appellant's counsel cannot now complain that the remand hearing improperly proceeded without the child's attorney. As a consequence of appellant's counsel remaining silent in this regard, neither the circuit court nor appellee had any way of knowing of appellant's disagreement to going forward with the remand hearing. Indeed, the only way to construe appellant's counsel's failure to speak up is as an agreement to the manner in which the hearing proceeded. To review this issue now, would be patently unfair to the circuit court and to appellee. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn any event, even if appellant had properly preserved the issue for our review, we would agree with appellee that the circuit court did not abuse its discretion by proceeding in the child's attorney's absence. There can be no doubt that in a contested child custody case the role of the child's attorney is critical. Court-appointed counsel provides the circuit court with an opportunity to hear from an individual who will speak for the child. John O., 90 Md. App. at 435 (quoting Levitt v. Levitt, 79 Md. App. 394, 404, 556 A.2d 1162 (1989)). Furthermore, the child's attorney \"provides independent analysis of the child's best interest, not advocating either parent's position.\" 90 Md. App. at 436.\n\nNonetheless, as the circuit court correctly observed, the interests of the parties' child were not the focus of the remand hearing. Our mandate in Malik was very specific. It required the circuit court upon remand to decide two very specific factual issues as stated above. The remand hearing was not for the purpose of determining the ultimate issue of the child's best interests, but rather to address only the limited threshold issues. Malik, 99 Md. App. at 533-34, 536.\n\nWe agree with appellee that there was no need for experts to testify at the remand hearing concerning whether the child's interests would be best served by awarding custody to appellant or appellee. Thus, the presence of the child's counsel was not essential for that purpose. In addition, as we noted, counsel for the child states in her brief that she \"was aware that the minor child did not wish to have any contact with Appellee Malik,\" but that \"this type of information would not have assisted the trial court in making the required determinations as established in Malik v. Malik, 99 Md. App. 521, 638 A.2d 1184.\" In short, the matters for which the presence of the child's counsel would be necessary were not yet at issue at this early stage in the proceedings.\n\nAlso from our review of the record, it is clear that the circuit court had ample evidence from which to render a decision in accordance with the mandate in Malik. The child's attorney could not have offered anything meaningful in addition to what appellant's counsel already presented. Indeed, appellant has failed to demonstrate or suggest, and we fail to see, how appellant or the child was in any way prejudiced by counsel's absence. See, e.g., Velez v. State, 106 Md. App. 194, 213-17, 664 A.2d 387 (1995) (where criminal defense counsel's absence from proceeding is not prejudicial to defendant's rights, it is harmless error to proceed in counsel's absence). See also 66 C.J.S. New Trial § 85(a)(2) (prejudice that counsel's absence causes to a party is an element to be considered before granting a new trial). Indeed, it is not generally an abuse of discretion to refuse to continue a trial on the ground that a party's counsel is absent where the party is represented adequately by other counsel present. Martin v. Rossignol, 226 Md. 363, 366, 174 A.2d 149 (1961). See also Cruis Along Boats, Inc. v. Langley, 255 Md. 139, 143, 257 A.2d 184 (1969). Thus, while we recognize that the child's attorney's function is to represent the interests of the child, despite whatever the wishes of the litigating parents might be, the child's attorney in the instant case has made it clear that the child's position in this custody dispute is the same as appellant's position. As a result, because of the thoroughness of the presentation of her client's position by appellant's attorney at the remand hearing, we are unable to discern any prejudice to the child. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nEven if the matter were properly preserved for appeal, therefore, proceeding in the absence of counsel was not an abuse of discretion. Langley, 255 Md. at 143 (continuance because of counsel's absence is discretionary). See, e.g., Markey v. Wolf, 92 Md. App. 137, 177-78, 607 A.2d 82 (1992) (denial of continuance not reversed unless abuse of discretion) (citing a wealth of cases stating same); Reaser v. Reaser, 62 Md. App. 643, 648, 490 A.2d 1315 (1985) (denial of continuance not reversed on appeal absent abuse of discretion).\n\nIn sum, our holding on this issue is best captured by the language of the Court of Appeals sixty years ago:\n\nWe confess our inability to understand in what manner plaintiff's case was injured by this incident, yet, if we felt otherwise, we would be powerless to help him, since he then made no objection to continuing the trial. For a party to remain silent under such circumstances until after losing his case before a jury and then for the first time make objection to such procedure and be sustained therein would be alike unfair to courts, litigants, and the public.\n\nLynch v. Mayor \u0026 City Council of Baltimore, 169 Md. 623, 633, 182 A. 582 (1936).\n\nIII\n\nTurning to the heart of this appeal, appellant argues that the circuit court erred in determining that appellant failed to prove that Pakistani law was not in substantial conformity with Maryland law. In this regard, appellant's argument is two-pronged: first, appellant maintains that the Pakistani court did not apply the \"best interest of the child\" standard to the case at hand, although the standard exists in Pakistan; and second, even if the Pakistani court did apply the best interest of the child standard, the rules of law and procedure that the Pakistani courts followed were contrary to Maryland's public policy. Before addressing these arguments, we feel constrained to make certain critical observations.\n\nDevotees of our national sports pastime agree that what is most important for a batter is to keep his or her eye on the ball. So too must we be guided in our review herein. Lest there be any confusion about our assigned task on this appeal from the limited remand hearing below, we must bear in mind what this case is not about. This case is not a review of legal determinations of the circuit court. Neither is this case about whether a Pakistani trial judge or a Maryland trial judge reached the \"right\" decision, for both judges are entitled to deference as to their factual findings; in other words, they have the right to \"call them as they see them.\" Significantly, this case is not about this Court undertaking the task of acting as a fact finder in place of the circuit court or substituting its judgment for that of the Pakistani court. And, this case is not about whether Pakistani religion, culture, or legal system is personally offensive to us or whether we share all of the same values, mores and customs, but rather whether the Pakistani courts applied a rule of law, evidence, or procedure so contradictory to Maryland public policy as to undermine the confidence in the trial.\n\nMore specifically, the resolution of this case is about our limited and focused task as derived from the very narrow and specific function of the circuit court on remand from Malik. As we explained in Malik, 99 Md. App. at 536:\n\nOn remand, the circuit court must first determine whether the Pakistani court applied law that is in substantial conformity with Maryland law. That determination requires the presentation of evidence. See Md. Code (1974, 1991 Repl. Vol.), § 10-505 of the Courts and Judicial Proceedings Article. The Pakistani court's custody order is presumed to be correct, and this presumption shifts to [appellant] the burden of proving by a preponderance of evidence that (1) the Pakistani court did not apply the \"best interest of the child\" standard, or that (2) in making its decision, the Pakistani court applied a rule of law or evidence or procedure so contrary to Maryland public policy as to undermine confidence in the outcome of the trial. If either (1) or (2) is proven, the circuit court must conclude that the law of Pakistan is so lacking in conformity with the law of Maryland that comity cannot be granted to the Pakistani custody order. Unless either is proven, however, the Circuit Court shall decline to exercise its jurisdiction and shall grant comity to the Pakistani custody decree.\n\nHaving issued that very limited mandate, it is crystal clear that the task of the circuit court on remand was straightforward and simple. Thus, the circuit court was obliged to hold an evidentiary hearing to determine (1) whether the Pakistani courts applied the \"best interest of the child\" standard or its equivalent, and (2) whether the procedural and substantive rights applied to the litigants before the Pakistani courts were such that confidence in the outcome there was undermined. Accordingly, faithfully adhering to our mandate and following Malik 's simple road map, the circuit court conducted an evidentiary hearing wherein two experts testified -- Dr. Malik for appellant and Justice Dogar for appellee. Based on their testimony, the circuit court concluded that the testimony presented by Justice Dogar supported a finding that appellant failed to meet her burden of proof on the two matters that she was required to prove under Malik.\n\nThe circuit court having made that determination -- a factual determination -- we cannot now reverse the judgment of the circuit court unless we find the circuit court's determination to be \"clearly erroneous.\" See MD. RULE 8-131(c) (1995) (\"when an action has been tried without a jury, the appellate court will review the case on both the law and the evidence. It will not set aside the judgment of the circuit court on the evidence unless clearly erroneous, and will give due regard to the opportunity of the trial court to judge the credibility of the witnesses.\"). See also Van Wyk, Inc. v. Fruitrade, Int'l., 98 Md. App. 662, 668-69, 635 A.2d 14 (1994) (the \"clearly erroneous\" standard applies to findings of fact under MD. RULE 8-131(c)). Accordingly, we must view the evidence produced during the remand hearing in the light most favorable to the prevailing party, appellee. Mayor of Rockville v. Walker, 100 Md. App. 240, 256, 640 A.2d 751 (1994) (quoting Maryland Metals, Inc. v. Metzner, 282 Md. 31, 41, 382 A.2d 564 (1978)). Viewed in this light, if there is evidence to support the circuit court's determination, we will not disturb it on appeal. Id. In other words, the circuit court's findings will not be deemed clearly erroneous if supported by competent material evidence. Nixon v. State, 96 Md. App. 485, 491-92, 625 A.2d 404 (1993).\n\nWith these principles in mind, we shall now determine whether appellant has directed our attention to issues appropriate for this appeal and, if appropriate, whether they have any merit.\n\nA\n\nThe evidence was overwhelming that, as a general principle, Pakistan follows the best interest of the child test in making child custody decisions. Both experts testified that the Guardians \u0026 Wards Act of 1890 applies to child custody disputes. Section 7 of the Act authorizes a court to appoint a guardian for a child where \"the Court is satisfied that it is for the welfare of a minor . . . .\" GUARDIANS AND WARDS ACT § 7 (1992). Section 17 of the Act, in pertinent part, states:\n\n(1) In appointing or declaring the guardian of the minor, the Court shall, subject to the provisions of this section, be guided by what, consistently with the law to which the minor is subject, appears in the circumstances to be for the welfare of the minor.\n\n(2) In considering what will be for the welfare of the minor, the Court shall have regard to the age, sex and religion of the minor, the character and capacity of the proposed guardian and his nearness of kin to the minor, the wishes, if any, of a deceased parent, and any existing or previous relations of the proposed guardian with the minor or his property.\n\n(3) If the minor is old enough to form an intelligent preference, the Court may consider that preference.\n\nGUARDIANS AND WARDS ACT § 17 (1992).\n\nAs noted above, the experts made it clear during the remand hearing that Section 17 of the Act encompasses many different types of factors considered by courts in determining the \"welfare of the minor.\" The expert testimony was clear that, depending on the specifics of a given case, Pakistani courts examine a number of different facts to determine the welfare of the child.\n\nIn their seminal handbook on Maryland family law, Judge Fader and Master Gilbert, citing an exhaustive collection of Maryland case law, outlined the various factors that courts may consider in determining the best interest of the child, including: fitness of parents, character and reputation of the parties, the child's preference, the age, health, and sex of the child, adultery of parents, and material opportunities affecting the future life of the child. JOHN F. FADER, II \u0026 RICHARD J. GILBERT, MARYLAND FAMILY LAW, § 7.3 (1990 \u0026 Supp. 1993). See also Best v. Best, 93 Md. App. 644, 655-56, 613 A.2d 1043 (1992). In addition, determining the best interest of the child involves a multitude of often ambiguous and intangible factors. Best, 93 Md. App. at 655. Necessarily, therefore, this analysis is conducted on a case-specific basis, as the child's best interest \"varies from each individual case.\" Id. In view of the expert testimony and the language of the Guardians and Ward Act itself, there was substantial evidence supporting the circuit court's determination that Pakistan follows the best interest of the child standard in child custody disputes.\n\nAppellant, however, argues that, under this Court's mandate in Malik, it is not enough that Pakistani law merely recognizes that the best interest of the child standard controls matters of child custody. Rather, appellant maintains that Malik required the circuit court to determine whether the Pakistani courts in this case actually applied that standard, and that the circuit court \"erred in finding that the Pakistani court applied the best interest of the child standard\" because the decisions of the Pakistani courts were \"based solely on the mother's failure to appear in the Pakistani proceedings.\"\n\nWe agree with appellant that the first part of our mandate in Malik required the circuit court to deny comity to the Pakistani order if appellant could prove that the Pakistani court did not apply the best interest standard to this case. Malik, 99 Md. App. at 533-34, 536. In other words, appellant is correct that it was not enough under our mandate for the circuit court to merely find that the best interest of the child standard is the law in Pakistan in child custody disputes. We are persuaded, however, that substantial evidence before the circuit court indicated that the Pakistani courts in fact applied the best interest of the child standard.\n\nPreliminarily, we shall address appellant's argument that the Pakistani courts' sole reliance on appellee's evidence because of appellant's absence from the Pakistani proceedings rendered it impossible for the Pakistani courts to have actually applied the best interest of the child standard. A fair reading of the record reveals that the courts in Pakistan considered appellee's evidence, including appellee's denial of appellant's allegations, and concomitantly refused to accord weight to those allegations. Appellee's expert testified that, as a matter of practice, the only way the Pakistani court would have considered appellant's allegations is if she had appeared in person to substantiate them. Since she did not, according to appellee's expert, the Pakistani court did not consider those allegations.\n\nThis, however, does not mean that the first prong of our mandate in Malik was not satisfied. That the Pakistani court may have considered only appellee's evidence and refused to give credence to appellant's allegations in making the best interest of the child determination does not render that determination defective for purposes of granting comity to the Pakistani order under our mandate in Malik.\n\nIt seems elementary that the Pakistani court could rely only on evidence that was presented during the proceedings in Pakistan. In Maryland, before making a custody determination under the Maryland UCCJA, the court must provide reasonable notice and opportunity to be heard to any person claiming a right to custody of a child. MD. CODE ANN., FAM. LAW § 9-205 (1991). If a party to the custody proceeding whose presence is desired by the court is outside the state, \"with or without the child,\" the court may order that the notice of the proceeding direct that party to appear personally and declare \"that a failure to appear may result in a decision adverse to that party.\" Id. at § 9-211(b). Simply put, a custody decree of a Maryland court\n\nbinds all parties who have been served in this State or notified in accordance with the Maryland Rules of Procedure, or who have submitted to the jurisdiction of the court, and who have been given an opportunity to be heard. As to these parties, the custody decree is conclusive as to all issues of law and fact decided and as to the custody determination made unless and until that determination is modified pursuant to law, including the provisions of this subtitle.\n\nId. at § 9-212 (emphasis added). Thus, in Maryland a court will proceed with a child custody determination in the absence of one of the parents. Moreover, appellee denied appellant's allegations during the Pakistani proceeding.\n\nWe do not find, therefore, that the best interest of the child test was not applied in Pakistan because of appellant's failure to put on a case. Justice Dogar testified that a natural presumption is drawn from one's failure to present evidence. This is not unique to the courts of Pakistan. In Hayes v. State, 57 Md. App. 489, 495, 470 A.2d 1301 (1984) (citations omitted), we observed:\n\nThe Court of Appeals of Maryland has consistently applied this rule in civil cases and held that where a party fails to take the stand to testify as to the facts peculiarly within his knowledge, or fails to produce evidence (e.g., testimony by certain witnesses) the fact finder may infer that the testimony not produced would have been unfavorable to that party. In civil cases, the unfavorable inference applies where it would be most natural under the circumstances for a party to speak, or present evidence.\n\nIndeed, had this case originated in Maryland, and had appellee been the one who failed to appear to testify or present evidence through other persons, after having received proper notice, our circuit court would be obliged to proceed on the evidence before it. This would not mean, however, as appellant suggests, that the circuit court would not have applied the best interest test. Quite to the contrary, this simply would mean that the circuit court applied the test using the evidence before it.\n\nIn this regard, the Pakistani court proceeded in virtually the same manner in which a Maryland court would have proceeded had a parent failed to appear. Under these circumstances, therefore, we shall not condemn the Pakistani court for doing substantially that which a Maryland circuit court would have done.\n\nOur view is bolstered by the uncontroverted fact that appellant had notice and an opportunity to present her side in Pakistan, but decided against doing so. The evidence is uncontradicted that appellant had notice of the child custody proceedings in Pakistan; she had the right to representation of counsel; and she had the right to present evidence, call witnesses, and cross-examine witnesses. She in fact participated in the Pakistani proceedings through counsel and through her father as attorney-in-fact. Appellant failed to demonstrate to the circuit court that she did not have a meaningful opportunity to be present in Pakistan for the hearing. A reasonable examination of the record demonstrates sufficient evidence from which the circuit court could have concluded that appellant had the opportunity to go to Pakistan, elected not to do so, and that, had she done so or had she produced evidence through any witness, the Pakistani court would have considered fully any evidence she could have produced. In light of all of this, she cannot now cry foul for the Pakistani courts' exclusive reliance on appellee's evidence. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Furthermore, for the reasons expressed in Part III.B.v., we are not persuaded by appellant's argument that the effect of her admission to adultery prevented her from returning to Pakistan.\n\nIn sum, therefore, the fact that the Pakistani courts relied exclusively on appellee's evidence, without consideration of appellant's evidence in support of allegations, did not, of itself, make it legally impossible for the Pakistani courts to have applied the best interest of the child test.\n\nB\n\nWe now address whether substantial competent evidence existed from which the circuit court could have determined that the best interest of the child standard was in fact applied in Pakistan. Preliminarily, we believe it beyond cavil that a Pakistani court could only determine the best interest of a Pakistani child by an analysis utilizing the customs, culture, religion, and mores of the community and country of which the child and -- in this case -- her parents were a part, i.e., Pakistan. Furthermore, the Pakistani court could only apply the best interest standard as of the point in time when the evidence is being presented, not in futuro, the Court having no way of predicting that the child would be spirited away to a foreign culture. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In other words, how could a Pakistani trial court apply any other standard pre-supposing -- as it was constrained to -- that the minor child would continue to be raised in Pakistan under the Islamic culture and religion? Thus, faced with the facts of a Pakistani child of two Pakistani parents who had been raised in the culture of her parents all of her life, not only did the Pakistani court properly utilize the only mores and customs by which the family had been inculcated, but it used the only principles and teachings available to it at the time. The circuit court was required to determine whether the best interest of the child standard was applied as a Pakistani court would have applied it utilizing the customs and mores indigenous to that society. In this regard, the circuit court, relying on the testimony of Justice Dogar, properly based its findings of fact on how a Pakistani court would have applied the best interest of the child standard. Hence, bearing in mind that in the Pakistani culture, the well being of the child and the child's proper development is thought to be facilitated by adherence to Islamic teachings, one would expect that a Pakistani court would weigh heavily the removal of the child from that influence as detrimental. It certainly is not our task on this appeal to attempt to reorder the priorities of the Pakistani court in its analysis of undeniably legitimate factors bearing on whether the best interest of the child is served by granting custody to appellee.\n\nBased on a plain reading of the Pakistani court orders, we hold that the trial judge was not clearly erroneous in finding that the Pakistani courts applied the best interest of the child standard to this case. On their face, the Pakistani court orders -- especially the August 1, 1993 order granting permanent custody to appellee -- unambiguously indicate that the welfare of the child standard was in fact applied. Before analyzing each Pakistani order, we are guided by the widely-recognized principle that judgments must be construed in the same manner as other written documents, and accordingly, where its meaning is clear and unambiguous, we do not look beyond the order, as there is no room for construction. See, e.g., Reavis v. Reavis, 82 N.C. App. 77, 345 S.E.2d 460, 462 (N.C. Ct. App. 1986); Lashgari v. Lashgari, 197 Conn. 189, 496 A.2d 491, 495 (Conn. 1985); Blanchard v. Blanchard, 484 A.2d 904, 906 (R.I. 1984). The circuit court recognized this principle when it stated that \"the judgment speaks for itself.\" Because appellant appealed appellee's Pakistani custody order, several Pakistani courts issued orders upon review thereof. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWe first examine the October 23, 1991 order originally granting temporary custody to appellee. The Court of Vth Senior Judge/ASJ at Karachi East issued this order. In the first several paragraphs of the order, the court stated that appellee had applied for custody and set forth the facts on both sides of the case. The court then presented both parties' arguments for why the welfare of the child demands that custody be awarded to that particular party. Next, the court examined prior Pakistani case law dealing with the welfare of the child where one parent has taken the child away from the other parent. The court also noted that there was binding precedent for the proposition that, in passing an \"order for the temporary custody of the minor, the welfare of the minor is to be considered as a paramount consideration.\" From these cases, the court concluded that appellant lost her right of \"Hazanit\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e over the minor by removing the child from the father.\n\nThe court focused heavily, which from the perspective of the Pakistani court is understandable, on the fact that appellant took the child out of the country. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The court stated that \"in the present case the minor has been removed from Karachi to U.S.A. and the father is even not being given the proper address of the minor to see her and there is nothing in the pleadings of the [mother] as to where the minor is studying . . .\" In light of the Pakistani case law, the court stated that, by removing the child to the U.S.A., appellant has deprived the child of \"an opportunity to meet her father.\" This, according to the court, was injurious to the mental health and emotional well being of the child. As a result, the court held that appellant lost her right to Hazanit and awarded temporary custody to appellee.\n\nAppellant successfully had the custody order suspended during the pendency of her appeal of that order. Upon that appeal, the Court of III Addl. District Judge Karachi East issued a judgment on April 19, 1992 affirming the October 23, 1991 order. After reciting the facts on both sides, this judgment concluded that the court correctly applied the case law holding that the mother loses her right of Hazanit where she removes the child from the father's access. As a result, the reviewing court found no reason to interfere with the October 23, 1991 order.\n\nAfter this appeal, the Court of Vth Senior Civil Judge/ASJ \u0026 R.C. issued a judgment dated August 1, 1993, disposing of appellee's application under section 25 of the Act for the return of the child to appellee's custody and granting permanent custody to appellee. Section 25 states that, where a child is removed from the custody of her guardian, the court may order that the child be delivered into the custody of the guardian, if the court finds that \"it will be for the welfare of the ward.\"\n\nAfter reciting the facts of both sides of the dispute, the court set out to determine specifically \"with whom the welfare of the minor lies.\" In so doing, the court set forth the testimony of appellee. Appellee testified that appellant is living a \"sin life\" with her lover in the U.S., and that his daughter is not being properly cared for by appellant. In addition, appellee testified that when his child lived in Pakistan he paid for her to attend the St. Joseph School where she received an Islamic education, but that the child is not now receiving an Islamic education in the U.S. Moreover, appellee testified that appellant is controlling the child through fear, and that appellant lacks moral character. Appellee also informed the court of appellant's failure to comply with a Pakistani court order. Appellee further stated that the man with whom appellant was living was a stranger to the child. In sum, appellee's testimony before the Pakistani court was that the welfare of the child will suffer in the hands of appellant and her lover.\n\nThe Pakistani court then noted that appellant did not challenge or rebut appellee's testimony, \"though she was given full chance for the same purpose.\" In addition, the court observed that appellant's counsel \"also failed to argue the matter.\" Based on this uncontradicted evidence on the record, i.e., appellee's testimony, the Pakistani court reasoned that custody should be awarded to appellee in the interest of \"the welfare and well being\" of the child. In so doing, the court relied upon and considered several factors to which appellee testified, e.g., that appellant forcibly removed the child from appellee's access, that appellant lived with another man in adultery, that appellant had a child with her paramour, that the child was living in a non-Islamic society, that appellee is a businessman living in an Islamic society, and that appellee is of good moral character.\n\nWe believe it is pellucid that these orders unambiguously indicate that the Pakistani courts did in fact apply the welfare of the child test in awarding custody to appellee. Moreover, these orders clearly contravene the minority's assertion that the Pakistani courts considered only that appellant was purportedly living a life of sin in the United States and that appellant kidnapped the child from Pakistan to the United States, and ignored other relevant best interest factors. Indeed, in its August 1, 1993 final custody order, the Pakistani court plainly based its conclusion on appellee's testimony. We see nothing improper with the Pakistani court's reliance on appellee's testimony. A Maryland trial judge, likewise, sitting without a jury is entitled to weigh and judge the credibility of the testimony of the witnesses. See MD. RULE 8-131(c) (1995). Thus, the minority's suggestion that the Pakistani court failed to consider the evidence and draw a reasoned conclusion therefrom is without merit. As we stated, we are not concerned with whether the Pakistani court applied the test properly or correctly, because we are not reviewing the merits of that decision. We are, however, only concerned with whether, as a matter of fact, the test was applied. To be sure, were we standing in the shoes of the Pakistani judge, we might have given greater or lesser weight to the various factors at issue, thereby reaching a different conclusion. Moreover, we would certainly give great weight, as a Pakistani judge, to the impact tearing a child away from his/her cultural and religious moorings would have on the child's best interest. On this appeal, however, it is not our function to consider how we would have applied the best interest of the child standard, nor is it that of a Pakistani appellate court reviewing the merits of the Pakistani lower court's determination.\n\nBased exclusively on the plain reading of the Pakistani court orders themselves, we hold that there was substantial competent evidence from which the circuit court could have concluded that the Pakistani courts applied the best interest standard. We are satisfied that the unambiguous and clear terms of these orders do indeed speak for themselves. Even if we were inclined to go beyond the plain reading of the orders, it is readily apparent that there is other sufficient evidence to support the circuit court's determination.\n\nAppellee's counsel asked appellee's expert, Justice Dogar, for his opinion regarding whether the Pakistani court applied the welfare of the child test. Justice Dogar replied that he had no reason to believe that the Pakistani court did not apply the test since that is what was written in the orders. While one might not agree with the Pakistani courts' reasoning, Justice Dogar testified that the test was applied to the extent of the evidence presented and the circuit court had the right to credit that testimony.\n\nIn any event, in light of the orders themselves, which indicate the consideration of several factors, and in light of Justice Dogar's extensive testimony, we conclude that the record contains substantial competent evidence from which the circuit court could conclude that the Pakistani courts in fact applied the best interest of the child standard. We affirm, therefore, the grant of comity on this basis.\n\nC\n\nNext, appellant argues that, even if the Pakistani court did in fact apply the best interest of the child standard, the circuit court erred in failing to conclude under the second part of our mandate in Malik that the child custody law and procedure that the Pakistani courts followed was contrary to Maryland's public policy. We disagree. Appellant sets forth several arguments in support of her contention that Pakistani law is contrary to Maryland law. We shall address each argument in turn.\n\ni\n\nWe reject appellant's argument that the Pakistani court applied a rule of law so \"contrary to Maryland's public policy as to undermine confidence in the outcome of the trial,\" when it allegedly based its child custody order only on evidence that appellee presented. Initially, we observe that we are not called upon here to pass judgment on a trial by fire, trial by ordeal, or a system rooted in superstition, or witchcraft. In fact, the Pakistani child custody system is rooted in the Guardian and Wards Act of 1890 -- an enactment based on British common law. As we noted in part A, the great weight of evidence shows: (1) the Pakistani court proceeded in a manner quite similar to the manner in which a Maryland court would have proceeded had a parent failed to appear; (2) appellant had notice and an opportunity to present her side of the case in Pakistan; and (3) appellant was represented by counsel and by her father in Pakistan. As a result, the circuit court did not err by failing to conclude that basing the child custody decision only on evidence that was before the Pakistani court was \"repugnant to Maryland public policy.\" Malik, 99 Md. App. at 534.\n\nii\n\nAppellant also claims that the law as applied in Pakistan is repugnant to Maryland public policy because the Pakistani order was based on the right of Hazanit. In Malik, we stated the following:\n\nOn the record before us, we cannot determine whether Pakistani law lacks conformity with Maryland law. We can, however, resolve the narrow issue of whether the Pakistani order should be denied comity because there is a paternal preference in Pakistani law. If the only difference between the custody laws of Maryland and Pakistan is that Pakistani courts apply a paternal preference the way Maryland courts once applied the maternal preference, the Pakistani order is entitled to comity. A custody decree of a sister state whose custody law contains a preference for one parent over another would be entitled to comity, provided, of course, the sister state's custody law applies the best interest of the child standard. . . . A Maryland court should not, therefore, refuse to enforce a Pakistani custody order merely because a paternal preference is found in that country's law.\n\nId. at 535.\n\nAs we previously noted, the doctrine of Hazanit embodies complex Islamic rules of maternal and paternal preference, depending on the age and sex of the child. Appellant describes the doctrine as follows:\n\nUnder the Islamic law, the Doctrine of Hazanit governs child custody. Under the Doctrine of Hazanit, the mother is entitled to custody of her male child up to the age of seven (7) and of her female child up to the age of puberty. However, the mother's right to Hazanit is subject to the control of the father who is the child's natural guardian. Moreover, if the father is unfit for custody once the child reaches the requisite age, the child's paternal male relatives, and not the mother, are given custody. Further, the mother can lose custody before the child reaches the requisite age if she is an \"apostate\" (wicked or untrustworthy). The mother can also lose custody before the child reaches the requisite age if she can not [sic] promote the religious or secular interests of the child.\n\nAppellant states that in this case, the Pakistani court ruled that she lost Hazanit because she removed the child to the U.S. where appellee was unable to exercise his right to control as the child's natural guardian. Appellant further notes that she was considered \"apostate\" for living in an adulterous household.\n\nCertainly, the doctrine of Hazanit is not a preference rule applied in Pakistan the same \"way Maryland courts once applied the maternal preference.\" This, however, does not mean that it is therefore \"repugnant to Maryland public policy.\" Our review of the record indicates that there was substantial competent evidence upon which the circuit court could base its conclusion that \"the law there in Pakistan is not so repugnant to the law of Maryland that we should fail to grant comity in the case.\" Given this evidence, we are also satisfied that the circuit court was legally correct in this regard.\n\nThe circuit court had before it the expert testimony of Justice Dogar that, under the Act, Hazanit is but one of the factors to be considered in the welfare of the child test. He stressed that a Pakistani court does not blindly apply the doctrine of Hazanit in making child custody determinations. According to Justice Dogar, \"If the personal law [as expressed in the doctrine of Hazanit] was to be the only thing on the basis on which [the welfare of the child] was decided, there would have been no Guardians and Wards Act . . .\" Given the circuit court's opinion of the credibility of this expert, from this testimony, we hold that the circuit court could reasonably have found that Hazanit was merely one factor. In addition, consideration of this factor does not make Pakistani law repugnant to Maryland public policy.\n\nWe recognize that Hazanit is different in many respects from the traditional maternal preference once followed in this State. We recognize, however, that Hazanit is nonetheless similar to the traditional maternal preference in that they both are based on very old notions and assumptions (which are widely considered outdated, discriminatory, and outright false in today's modern society) concerning which parent is best able to care for a young child and with which parent that child best belongs. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Viewed in this regard, standing as a factor to be weighed in the best interest of the child examination, Hazanit is no more objectionable than any other type of preference. As we noted in Malik, the courts of this State will not refuse to enforce child custody awards of those states still recognizing the maternal preference as a factor. Malik, 99 Md. App. at 535.\n\nGiven that Hazanit is only more doctrinaire in degree from the maternal preference and because the circuit court could have reasonably found it to be only a factor, we hold that the circuit court did not err in concluding that the principles of Pakistani law which were applied were not repugnant to Maryland law. In fact, the Pakistani court arrived at the same rule of maternal preference now recognized in Maryland by virtue of its decision that appellant had forfeited her right of Hazanit, i.e., the preference no longer was applied in the custody determination. Thus, had the right of Hazanit been considered as a factor, we would be obliged to note that we are simply unprepared to hold that this longstanding doctrine of one of the world's oldest and largest religions practiced by hundreds of millions of people around the world and in this country, as applied as one factor in the best interest of the child test, is repugnant to Maryland public policy. Since the Pakistani court decided the right to Hazanit was forfeited, it was not factored in and thus the effect of the preference was the same as that now recognized under Maryland law.\n\niii\n\nNext, appellant asserts that the Pakistani custody orders were founded on principles of law repugnant to Maryland public policy because the orders were allegedly based on the Pakistani presumption that an adulterous parent is unfit for custody. We disagree. The record, including the Pakistani orders and the testimony of the experts, contains substantial evidence that adultery was only one factor considered.\n\nThere is nothing \"repugnant,\" or even foreign, in a court considering adultery as a factor in determining the best interest of the child. In Davis v. Davis, 280 Md. 119, 127, 372 A.2d 231 (1977), the Court of Appeals stated that it is proper in certain cases to consider adultery. In Swain v. Swain, 43 Md. App. 622, 629, 406 A.2d 680, cert. denied, 286 Md. 754 (1979), we stated the following:\n\nThere are now no presumptions whatsoever with respect to the fitness of a parent who has committed, or is committing, adultery. Rather, adultery is relevant only insofar as it actually affects a child's welfare. We will not presume a harmful effect, and the mere fact of adultery cannot \"tip the balance\" against a parent in the fitness determination. Thus, a chancellor should weigh, not the adultery itself, but only any actual harmful effect that is supported by the evidence.\n\nWhile appellant argues in terms of \"presumption of unfitness,\" the testimony at the remand hearing was sufficient to support a conclusion that adultery was only a factor. Accordingly, the circuit court did not err by failing to conclude that this aspect of the Pakistani welfare of the child test was repugnant to Maryland public policy.\n\niv\n\nQuoting Malik, 99 Md. App. at 536-37, appellant further argues that the circuit court \"erred in not heeding the warning of the Court of Special Appeals to avoid placing '. . . too much emphasis . . . on the removal of the child and too little emphasis . . . on the circumstances that preceded the removal . . .'\". Appellant misunderstands this aspect of Malik. Our statement of caution in this regard only would be applicable \"if the circuit court must resolve this dispute in accordance with Maryland law. . . .\" Id. at 536. Since the circuit court never reached the resolution of the custody dispute in accordance with Maryland law, the circuit court did not err.\n\nTo the extent that appellant argues that the Pakistani courts placed too much weight on appellant's removal of the child, we simply state that we have already determined that the Pakistani courts cannot be faulted for proceeding based on only the evidence that was before it. A Maryland court could only consider events preceding the removal of the child if evidence of those events are presented during the proceedings. As stated, appellant did not go to Pakistan to substantiate her claims and her representatives at the proceedings in Pakistan presented no evidence to support her allegations; therefore, the Pakistani courts simply chose to believe appellee's testimony and evidence over appellant's unsubstantiated allegations. The circuit court did not err by failing to conclude that it was repugnant to Maryland law for the Pakistani courts to proceed in this fashion.\n\nv\n\nAdditionally, appellant asserts that the Pakistani custody orders were founded on principles of law repugnant to Maryland public policy because the Pakistani courts allegedly \"penalized the mother for not appearing without considering the affect of her admission to adultery on her ability to return to Pakistan.\" In this regard, appellant points out that if convicted under Pakistani criminal law, her penalty could be public whipping or death by stoning.\n\nAlthough Dr. Malik opined that appellant would be arrested for adultery if she returned to Pakistan for the custody proceedings, he also conceded that punishment for adultery \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e was extremely unlikely and that proving the crime \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e was extremely difficult. Given this testimony, the circuit court was not clearly erroneous in not considering the effect of whether appellant's admission to adultery was \"repugnant\" to Maryland public policy in its failure to find that the Pakistani courts punished her for not appearing.\n\nvi\n\nAppellant also asserts that the circuit court erred in not assuming jurisdiction under the UCCJA. This argument evidences a total misunderstanding of our mandate in Malik. As we have stated throughout this opinion, in Malik, we remanded this case to the circuit court for a very discrete purpose. The circuit court, following our mandate which required appellant to bear the burden of proof, found that she failed to prove both: (1) that the Pakistani court did not apply the best interest of the child test; and (2) that the Pakistani law applied was contrary to Maryland public policy. In the event that neither one of these two determinations was proved, our remand instructions were crystal clear: \"the circuit court should decline to exercise jurisdiction.\" Id. at 533.\n\nIn other words, as we stated, \"Unless either is proven, however, the Circuit Court shall decline to exercise its jurisdiction and shall grant comity to the Pakistani custody decree.\" Id. at 536. Neither having been proven, the circuit court did just as we instructed -- declined to assume jurisdiction and granted comity. We find no merit in appellant's jurisdictional argument. Our opinion in Malik speaks for itself, and it has already adequately addressed appellant's argument in this regard.\n\nvii\n\nPeppered throughout the minority opinion are sundry references to matters introduced at the initial proceeding before the Circuit Court for Baltimore County, unsupported allegations of wrong doing by appellee, and the report of Dr. Rosenberg, not only objectionable because they are beyond the pale of Malik, but because they are not a part of the record on this appeal. The minority nevertheless makes reference to these extraneous materials and utterly ignores the procedural posture of this case. Consideration of matters that go to the merits of a cause before a determination of the question of jurisdiction -- when there is such a question -- runs counter to accepted rules of procedure. See Zouck v. Zouck, 204 Md. 285, 302, 104 A.2d 573 (1954), and Stewart v. State, 21 Md. App. 346, 348, 319 A.2d 621 (1974), aff'd, 275 Md. 258, 340 A.2d 290 (1975).\n\nIn other words, the legal effect of our decision in Malik was to suspend and remove from consideration all of the events that transpired in the Circuit Court for Baltimore County -- including all proceedings and evidentiary matters -- prior to our decision in Malik. In legal contemplation, it is as though they never happened and are not subject to our review until such time as there were factual findings supporting a grant of comity, vel non, and hence a resolution of the question of the exercise of the court's jurisdiction. Thus, consistent with our ruling on appellee's motion to dismiss, none of the matters referred to or materials introduced at the initial proceeding before the circuit court are properly before us.\n\nLikewise, when appellant's counsel asked that the child's lawyer be allowed to be present to make a statement on behalf of the minor child, it was pointed out that counsel for the child had not heard the testimony of the two experts and would not be in a position to comment on what the appropriate standards should be with regard to jurisdiction.\n\nThe trial court, in response to whether a comment should be presented on the child's position, stated, \"we are not at a point where the child's position is to be taken into consideration.\" The court then specifically noted that it was to be guided by the mandate of the Court of Special Appeals, \"which requires me to determine whether you have met your burden of proof, that the Pakistani court did not apply the best interests of the child standard or that, in making its decision, that court applied a rule of law or evidence or procedure so contrary to Maryland public policy as to undermine confidence in the outcome of the trial. Unless either of those is proven, the circuit court must decline to exercise jurisdiction and shall grant custody.\" The court went on to observe that the \"attorney for the child has no function in making that determination.\"\n\nThus, it is only after the circuit court, pursuant to our mandate in Malik, determined that it would, in fact, exercise its jurisdiction that it would be empowered to consider the merits, including Dr. Rosenberg's report and other extraneous matters referred to by the dissent. Stated otherwise, a factual determination of whether the proceeding in Pakistan comported with Maryland law was antecedent to any consideration of the child's present position because the circuit court was without power to address the merits until it determined that it should exercise its jurisdiction. Appellant's counsel could have offered the report of Dr. Rosenberg or any other evidence on the merits had the trial court determined that comity should not be granted; however, since the court granted comity and thereby declined to exercise jurisdiction, the proceedings never ripened to a point where the child's present position was relevant.\n\nAs we have indicated herein, the trial court throughout made reference to our mandate in Malik as it endeavored to carry out our mandate. Significantly, the court, as we instructed it, imposed upon appellant the burden of proving that the Pakistani court did not apply the best interests of the child standard or applied a rule of law or evidence or procedure so contrary to Maryland public policy as to undermine confidence in the outcome of the Pakistani trial. Having faithfully adhered to our mandate, as evidenced by repeated references to that mandate throughout, the circuit court unquestionably made a definitive factual finding when it ruled:\n\nthe expert opinion so-indicates, that indeed the welfare of the child, which is certainly akin, if not exactly the same, as the best interest of the child standard would be given appropriate consideration, as paramount to the concerns that the court would have in awarding custody.\n\nThe circuit court specifically found that \"the Courts there [Pakistan] would not consider allegations offered on paper in any way at all but would insist on testimony being offered in person by the contending party, that certain things were true or not true.\" To the extent that the best interest standard was not applied, the court opined that \"it is only because the mother and the child -- [whom the court had ordered to be produced by appellant] \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e -- were not present in person to substantiate the mother's allegations.\" Notably the Pakistani court would not consider the allegations because, as the court observed, the Pakistani court \"would insist on testimony offered, in person, in other words, not allegations offered on paper.\" Hence it is not simply a question of appellant's failure to appear; it was her failure to produce evidence. The court concluded that \"the law of Pakistan requires their courts to give paramount consideration to the welfare of the child\" where the parties are present and available to testify. Were we to remand this case for further proceedings, as the minority urges, the circuit court would be obliged to simply reiterate that the Pakistani court was prevented from considering allegations offered to show that the best interest of the child was not served by granting custody to appellee because the bald allegations were not supported by evidence.\n\nMost notably, the court specifically concluded that the mother \"has failed to prove by a preponderance of the evidence that which the Court of Special Appeals indicated she must prove, and this court must decline to exercise its jurisdiction in this case.\" Judge Kahl's conduct of the proceedings on remand and his understanding of Malik was commendable, notwithstanding the minority's reference to a single comment regarding the lack of evidence before the Pakistani court from which it could apply the best interests standard. The lack of evidence was occasioned exclusively by appellant's failure and/or refusal to participate personally in the proceedings in Pakistan. A review of the record reveals that, throughout, Judge Kahl accurately articulated and faithfully carried out our mandate pursuant to Malik.\n\nSimply put, what the minority would have us do in this appeal is abandon our appellate role, assume the function of the trial judge, and re-try the hearing on remand because of dissatisfaction with the result. While it would seem evident that Judge Kahl reached the right result, even if we were to conclude that we might reach a different result -- which we do not -- it is not even a close call that his findings were not clearly erroneous.\n\nIn addition, the minority would have us disregard both our holding in Malik regarding the appropriate issues to be addressed and the lower court's factual determination in response to our mandate in Malik, and now have our decision turn, in part, on the \"length of separation from natural parents,\" the \"potentiality of maintaining natural family relations,\" the \"material opportunities effecting the future of the child,\" and the fact that \"Mahak, through no fault of her own, has now lived in this country for approximately half of her life and has undoubtedly become increasingly 'Americanized' . . . . [and] has lived continuously with her mother and her half-sibling.\"\n\nWhile this is indeed an unfortunate circumstance, the minor child would not have undergone the cultural adjustment, nor would she have developed those relationships here had it not been for appellant's improper conduct of removing the child from her homeland and absconding to Maryland. We are not paving new roads herein in regard to the malingering of one seeking custody. Indeed, in the context of adoption proceedings, other courts have echoed this sentiment. See, e.g., In re Petition of John Doe, 159 Ill. 2d 347, 638 N.E.2d 181, 182, 202 Ill. Dec. 535 (Ill. 1994) (\"When the father entered his appearance in the adoption proceedings 57 days after his baby's birth and demanded his rights as a father, the petitioners [adoptive parents] should have relinquished the baby at that time. It was their decision to prolong this litigation through a lengthy, and ultimately fruitless, appeal.\"); In re Clausen, 442 Mich. 648, 502 N.W.2d 649, 664-67, 665 n.43 (Mich. 1993) (\"Prompt action by the father to assert rights, combined with the father's being prevented from developing a relationship with the child by actions of courts or the custodians, are factors that excuse or mitigate the failure to establish such a relationship.\").\n\nWhile we empathize with the minor child and fully appreciate the hardship attendant to her readjustment, we must be mindful of the precedent that our dissenting colleagues would have us set. Were we to adopt the minority's reasoning, our holding would promote the uprooting of children from their home surroundings away from the non-custodial parent, family, and friends and the absconding to this State, where a judge would be obliged to grant custody to the errant parent because personal bonding and a readjustment to the new surroundings will have occurred during the pendency of judicial proceedings.\n\nThis is not simply a case where one parent having custody legally or pursuant to a lawful court order awaits the court's determination of which parent ultimately should have custody. Nor is this a case about an American citizen married to someone from a foreign country or a custodial parent from a foreign country who has come to this country and forthwith sought relief from an American court. Under such circumstances, arrangements may be made for visitation by the non-custodial parent in order to facilitate continuity in the relationship between the minor and the non-custodial parent. In other words, the court, acting as a referee, is in a position to issue pendente lite orders until such time as a judicial determination can be made concerning who is most fit to have custody.\n\nHere, the natural father was, for a period of over two years, not only deprived of the companionship of his child, but he was ostensibly subject to the emotional trauma occasioned by not knowing where his child was for that period of time. Appellee also was constrained to incur expenditures just to ascertain his daughter's whereabouts and, pending this protracted litigation, he continues to be denied the opportunity to observe his daughter undergoing the emotional, psychological, and physical changes all parents are entitled to witness as their children develop; once denied this opportunity, a parent is never able to recreate that phase of the child's development.\n\nMore to the point, the child has been robbed of the guidance, love, and association with her natural father. Unquestionably, appellant's actions in secreting the child for over two years constituted extra legal efforts by appellant essentially to usurp the decision-making function of both the Pakistani and the American courts as to who should have custody of the minor child. Should appellant now be heard to interpose events that transpired over the two-year period she avoided detection and then, only after she was tracked down by appellee's investigators, seek to secure legal sanction for her extra legal acts?\n\nCiting Hadick v. Hadick, 90 Md. App. 740, 603 A.2d 915 (1992), the minority suggests that we should consider the policy in Maryland regarding separation of siblings. Again, the circumstance of the uniting of the step-siblings in the first place is a consequence of her adulterous relationship and her subsequent flight to this country wherein she secreted the minor child from the natural father for two years. The minority posits that appellant \"should not be chastised for contesting Pakistani decrees . . . merely because she and her child are Pakistani by birth.\" We have acknowledged, in Malik, 99 Md. App. at 528, that the Circuit Court for Baltimore County had jurisdiction because \"Maryland is the child's 'home state.'\" The nationality of appellant and the minor child is not an issue except insofar as the minority seeks to rely on the alleged disruption resultant from uprooting the child after five years. All parties were before the Pakistani court and subject to its jurisdiction precisely in the same manner that three citizens of Maryland would and should be under the jurisdiction of a Maryland court. A determination of personal jurisdiction always begins with the geographical location of the parties and one's residence is initially a by-product of the accident of one's birth.\n\nThere was absolutely no nexus between the parties to this case and the Baltimore County Circuit Court until appellant fled from Pakistan and defied a court order to produce the minor child. Appellant was, and continued for two years to be, a fugitive from the Pakistani legal system. Upon being found, appellant sought to enlist the aid of the Circuit Court for Baltimore County in what appears to be a conscious and apparently calculated plan to circumvent the laws of both jurisdictions since, during the two-year period appellant secreted the minor child, she, in essence, unilaterally appropriated custody to herself and thereby denied custody or visitation to appellee without authorization from any judicial authority. In other words, she took the law into her own hands. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nReturning to the true issues in the case at hand, as we have previously observed, none of the events subsequent to appellant's arrival in this country are relevant to the court's inquiry pursuant to Malik as to whether the circuit court had jurisdiction. That inquiry involved only what happened in Pakistan, not what has happened here.\n\nWhile we are mindful that our decision today requires that the minor child readjust to her former culture and way of life, it would be manifestly unjust for us to reward appellant for her brazen disdain for the rule of law which has, pursuant to Malik, made a determination that the proper forum for determining the best interest of the minor child is Pakistan. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e To decide otherwise would be to encourage all who are so inclined to circumvent the laws of their home state and remain outside the reach of any court for a period of time sufficiently long to permit the fugitive parent to argue that he or she should be awarded custody notwithstanding the fact that his or her actions occasioned the hardship upon which he or she bases his or her claim for relief. We decline to countenance such a result.\n\nJUDGMENT OF THE CIRCUIT COURT FOR BALTIMORE COUNTY AFFIRMED.\n\nCOSTS TO BE PAID BY APPELLANT.\n\nI respectfully dissent, and I do so for several reasons. In my view, the issue regarding counsel has been preserved. Additionally, I believe that the trial court and the majority have erred in characterizing as \"not relevant\" the child's views with respect to the critical issues that the judge had to resolve. Therefore, I conclude that the circuit court erred in proceeding when the child's court-appointed counsel failed to appear. Furthermore, my reading of the Pakistani court orders convinces me that the Pakistani courts did not apply the \"best interests of the child\" standard. As a result, the orders are not entitled to comity. Accordingly, I would reverse.\n\nI.\n\nThe circuit court properly appointed an attorney to represent and protect the interests of twelve year old Mahak Malik, who is at the center of the controversy. Consistent with this Court's directive in Malik, evidence was presented on remand regarding Pakistani child custody law and its application in this case.\n\nInexplicably, Mahak's attorney failed to note on her calendar the date of the hearing and did not appear either at the trial or at the closing arguments that were held on another day. Nonetheless, the trial judge elected to proceed without the child's attorney. The majority holds that the issue of whether the trial judge erred in doing so is not preserved for our review, because appellant did not make a timely objection. Even if the issue were preserved, the majority concludes that the trial judge did not err, because \"the interests of the parties' child were not the focus of the remand hearing.\" I disagree.\n\nA.\n\nIn concluding that the counsel issue is not preserved, the majority has misconstrued Md. Rule 8-131(a). It provides that, ordinarily, we will not review a non-jurisdictional issue \"unless it plainly appears by the record to have been raised in or decided by the trial court . . . .\" (Boldface added). The use of the word \"or\" plainly indicates that the rule's requirement is disjunctive, not conjunctive. Therefore, an issue is preserved for our review if it was either raised by a party or decided by the court. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThis interpretation of the rule is consistent with its purpose. The rule is intended \"'to ensure fairness for all parties in a case and to promote the orderly administration of the law.'\" Brice v. State, 254 Md. 655, 661, 255 A.2d 28 (1969), quoting Banks v. State, 203 Md. 488, 495, 102 A.2d 267 (1954). By requiring counsel to object, see Bell v. State, 334 Md. 178, 189, 638 A.2d 107 (1994), the judge is on notice of an alleged error, and then has an opportunity to correct it. See Clayman v. Prince George's County, 266 Md. 409, 416, 292 A.2d 689 (1972); Robinson v. State, 66 Md. App. 246, 254-55, 503 A.2d 725 (1986). What is critical, then, is the judge's opportunity to consider an issue.\n\nLawyers do not commit error. Witnesses do not commit error. Jurors do not commit error. The Fates do not commit error. Only the judge can commit error, either by failing to rule or by ruling erroneously when called upon, by counsel or occasionally by circumstances, to make a ruling.\n\nDeLuca v. State, 78 Md. App. 395, 397-98, 553 A.2d 730 (1989) (emphasis supplied).\n\nIn this case, the court was called upon to rule by the circumstances presented. Clearly, the counsel issue was decided by the circuit court. The record reflects that, at the beginning of the hearing, the judge noted that Mahak's counsel was not present. Nevertheless, he expressly decided to proceed. Thus, under the plain language of Rule 8-131(a), the issue is preserved for our review.\n\nThe case of John O. v. Jane O., 90 Md. App. 406, 601 A.2d 149 (1992), on which the majority relies to support its position of non-preservation, is inapposite. There, counsel for the child appeared at the hearing and asked to be excused. All of the parties then affirmatively consented to the absence. Moreover, although the Court said that the father had not \"raised\" the issue in the circuit court, the Court did not discuss whether the issue had been \"decided.\"\n\nPermeating much of the majority's analysis is the claim that appellant did not timely object. While there are provisions of the Maryland rules requiring a party to object as soon as the grounds become apparent, these rules, by their terms, apply to objections to the admission of evidence. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In contrast, Rule 2-517(c), which governs \"objections to other rulings or orders,\" states:\n\nFor purposes of review by the trial court or on appeal of any other ruling or order, it is sufficient that a party, at the time the ruling or order is made or sought, makes known to the court the action that the party desires the court to take or the objection to the action of the court.\n\n(Emphasis supplied).\n\nThe plain language of Rule 2-517(c) suggests that a timely objection is \"sufficient.\" But a \"sufficient\" condition is different from a \"necessary\" condition. The difference in phraseology between Rule 2-517(c) and Rule 2-517(a) indicates that the choice of words was no accident. If the drafters wished to require timely objections to rulings other than ones concerning the admission of evidence, they obviously knew how to do so.\n\nI am also troubled by the majority's apparent view that a minor child's rights in a custody case may be readily forfeited through the inaction of a parent. In this child custody maelstrom, the child's rights should not depend on whether a parent made a timely objection. Even in the context of child support cases, parents cannot bargain away their children's rights. Stambaugh v. Child Support Enforcement Administration, 323 Md. 106, 111, 591 A.2d 501 (1991); Shrivastava v. Mates, 93 Md. App. 320, 327, 612 A.2d 313 (1992); Lieberman v. Lieberman, 81 Md. App. 575, 588, 568 A.2d 1157 (1990). By analogy, Mahak's right to an attorney at the very hearing that would determine her future should not be washed away merely because her mother did not timely complain. That result ignores the principle that, notwithstanding any failure to object, the \" parens patriae power of the equity courts is plenary to afford minors whatever relief may be necessary to protect their best interests.\" Wagner v. Wagner, 109 Md. App. 1, 674 A.2d 1, 1996 Md. App. LEXIS 16, *56, (1996).\n\nThe reasoning of the Court of Appeals in In re Adoption/Guardianship No. A91-71A, 334 Md. 538, 557, 640 A.2d 1085 (1994), and Washington County Dept. of Social Services v. Clark, 296 Md. 190, 199-200, 461 A.2d 1077 (1983), is persuasive. The Court determined that no objection was necessary to preserve the issue of a court's failure to appoint independent counsel for the child, because the appointment of counsel was statutorily mandated. The Court also noted that the minor child was unable to object. Certainly, these cases are distinguishable, because they involved an adoption and a guardianship, and the trial courts failed altogether to appoint counsel. But to one in Mahak's position, this is a distinction without a difference. The effect of the circuit court's decision is that Mahak's voice was silenced.\n\nB.\n\nI also disagree with the majority's conclusion that, even if the issue were preserved, the circuit court did not abuse its discretion in proceeding without her attorney. At the conclusion of the evidentiary hearing, the trial judge stated, inter alia, that the child's position was \"not relevant,\" because the hearing concerned only the two issues specified in our mandate in Malik. Consequently, the trial court concluded that it was \"not at a point where the child's position is to be taken into consideration.\" In adopting this view, the majority states that the \"interests of the parties' child were not the focus of the remand hearing,\" that \"the remand hearing was not for the purpose of determining the ultimate issue of the child's best interests,\" that \"the matters for which the presence of the child's counsel would be necessary were not yet at issue . . . ,\" and that the remand hearing was only an \"early stage\" of the proceedings.\n\nThe majority misconstrues the vital role of Mahak's counsel at the evidentiary hearing and overlooks the child's fundamental right to participate, as a party; that right, in Mahak's case, could only be exercised through counsel. Moreover, the issues set forth in our mandate in Malik were the dispositive issues in the case. Indeed, the outcome would determine Mahak's fate -- whether she would remain in the United States with her mother, with whom she has resided here since 1990, or whether she would be returned, against her wishes, to Pakistan and to a father she apparently feared. Consequently, the hearing was not merely an \"early stage\" of the proceedings; the trial court's ultimate resolution of the comity issue would necessarily turn on what occurred at that hearing and, if its ruling is upheld, it will be the only hearing of significance. In this light, Mahak's position was exactly what was relevant, and it is a travesty to conclude otherwise.\n\nThe relevance of the child's position and the fundamental importance of counsel's role are underscored by the function of the child's counsel in an acrimonious custody dispute. Md. Code Ann., Fam. Law (\"F.L.\") § 1-202 (1991), authorizes the circuit court to appoint counsel for a child to provide the court with an \"independent analysis\" of the child's position. John O. v. Jane O., supra, 90 Md. App. at 436. Indeed, \"the purpose of § 1-202 is to afford the court an opportunity to hear from someone who will speak on behalf of the child.\" Id., 90 Md. App. at 435-36 (citation and internal quotation marks omitted). The statute thus recognizes that the interests and positions of the parents in these cases are not necessarily congruent with those of the children, and that the child is entitled to an advocate who will champion the child's position.\n\nThe case of Levitt v. Levitt, 79 Md. App. 394, 556 A.2d 1162, cert. denied, 316 Md. 549, 560 A.2d 1118 (1989), is noteworthy. There, we held that a trial court was required to appoint counsel for a child in a custody modification proceeding, although no party had apparently ever moved for the appointment of counsel. Id., 79 Md. App. at 403-04. In much the same way, without the presence of her counsel, Mahak was not heard. While Mahak and her counsel wanted the court to deny comity, Mahak's counsel was unable to attempt to elicit any evidence to demonstrate that the Pakistani courts had not applied the best interests test. Through the questioning of witnesses, the introduction of evidence, and argument, her counsel might have been able to persuade the court to adopt the child's position that the Pakistani court decisions were not entitled to comity.\n\nNumerous cases in other jurisdictions have recognized the importance of actual participation by the child's counsel in custody battles. The Montana Supreme Court's decision in In re Marriage of Kramer, 177 Mont. 61, 580 P.2d 439 (Mont. 1978), for example, is instructive. That court held that the judge erred in deciding a custody issue in a divorce proceeding when appointed counsel for the children did not participate in any of the hearings. What the court said, 580 P.2d at 445, is pertinent here:\n\nThe purpose of the statute [authorizing trial courts to appoint independent counsel for children] is to provide the children with an advocate who will represent their interests and not the parents' interest. This means that the attorney is not to take a passive role in the hearing on custody. He should represent the children actively and present to the court all the evidence he can marshal concerning the best interests of the children.\n\nSee also, J.A.R. v. Superior Court, 179 Ariz. 267, 877 P.2d 1323, 1331 (Ariz. Ct. App. 1994); G.S. v. T.S., 23 Conn. App. 509, 582 A.2d 467 (Conn. App. Ct. 1990) (court commits plain error if it fails to appoint independent counsel for children involved in custody dispute that involved allegations of sexual abuse); In re Marriage of Barnthouse, 765 P.2d 610 (Colo. Ct. App. 1988), cert. denied sub nom. Barnthouse v. Barnthouse, 490 U.S. 1021, 104 L. Ed. 2d 184, 109 S. Ct. 1747 (1989) (child's attorney should take an active role in presenting evidence); Veazey v. Veazey, 560 P.2d 382, 390-91 (Alaska 1977).\n\nWithout question, Mahak's attorney did not fulfill her responsibility when she failed to participate at the hearing or at closing arguments. While the dereliction was undoubtedly accidental and unintentional, Mahak should not be forced to bear the burden of the error. We should be mindful of what the District of Columbia Court of Appeals said in Jones v. Roundtree, 225 A.2d 877, 878 (D.C. 1967), albeit in a different context: \"We are hesitant . . . to visit the sins of an attorney on his client, especially when that client is a minor.\"\n\nC.\n\nIn determining that the circuit court did not err in proceeding without Mahak's counsel, the majority states that \"the child's attorney could not have offered anything meaningful in addition to what appellant's counsel already presented.\" In support of its conclusion, the majority relies on the assertion of child's counsel that she would not have presented anything helpful even if she had been at the evidentiary hearing. My concern is obvious; however innocent counsel's mistake was in failing to appear, the child's attorney has a substantial self-interest in minimizing the resulting harm to her client. Indeed, in spite of her client's position and her own position opposing comity, she appeared at the appellate argument as an appellee and submitted an appellee's brief. An acknowledgement by her that her presence would have made a difference in the outcome would be tantamount to an admission of malpractice.\n\nIn my view, Mahak was tangibly prejudiced by her counsel's failure to participate. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Included in appellant's appendix were reports from Dr. Leon Rosenberg, who examined Mahak during the pendency of the circuit court proceedings. His reports purport to show that Mahak was extremely fearful of her father. The majority says that the reports are irrelevant and \"extraneous,\" because the circuit court was not conducting a best interests hearing; it agrees with appellee that, since the reports were not admitted below, they cannot be considered here. That is precisely the point. Because child's counsel was not present, she could not attempt to introduce the reports. Had the reports been introduced, Mahak's counsel could have relied on them to show important deficiencies in the Pakistani proceedings and to highlight what was not done or considered there. Thus, the reports would have advanced the child's claim that, by failing to consider or address Mahak's fear of her father, the Pakistani courts did not apply the best interests standard.\n\nThe only way to show prejudice is to demonstrate what Mahak's counsel could have done had she participated at the hearing. The majority's reasoning is thus circular -- it declares that there is no evidence of prejudice from counsel's failure to appear, and simultaneously it strips appellant of the ability to establish such prejudice. This circuitous approach means that a court's decision to proceed without counsel may never be reversible error, because practically the only way to establish prejudice is to go beyond the record and show what counsel could have introduced if he or she had participated in the hearing. In this regard, I find compelling the Court's comment in Town of Somerset v. Montgomery County Board of Appeals, 245 Md. 52, 225 A.2d 294 (1966). In considering whether actual prejudice must be shown to establish a denial of procedural due process, the Court said, \"It would be a mockery of justice to hold that a person cannot complain of the denial of the right to cross-examine unless he can show what the result of the cross-examination would have been; that result is often as unexpected as it is revealing.\" Id., 245 Md. at 66. Cf. Wagner v. Wagner, 1996 Md. App. LEXIS 16 at *27 (\"there is no requirement that actual prejudice be shown before denial of due process can be established\").\n\nIn a footnote, the majority also asserts that a remand would accomplish nothing except \"to allow appellant a second bite at the apple.\" Mahak is not a casual bystander in these proceedings. \"We are not here dealing with chattels.\" Krebs v. Krebs, 255 Md. 264, 266, 257 A.2d 428 (1969). She is a young girl who will be profoundly affected by the outcome of these proceedings. Whether a remand gives the mother a second bite at the apple is not the point; a remand would give Mahak her only real bite. Fundamental fairness requires no less.\n\nIn sum, I cannot accept the majority's view that the child's position was not compromised. Without counsel, Mahak's position was neither articulated nor considered with respect to the critical and complex issues that were determinative of her future. The fact that Mahak was unable to have her interests represented in a proceeding, the outcome of which will have a colossal impact on her life, is, in my view, \"prejudice\" enough.\n\nII.\n\nI disagree with the majority's conclusion that the Pakistani court orders show that the courts there applied the best interests standard. The majority admonishes that, in analyzing the issue, it is important \"to keep [our] eye on the ball.\" I respectfully submit, however, that, in its ultimate analysis of the Pakistani court orders, the majority strikes out.\n\nA.\n\nAs a threshold matter, I note that there is some confusion in the record as to whether the circuit court actually found that the Pakistani courts had applied the best interests of the child standard. In his oral ruling at the conclusion of the hearing, the trial judge stated: \"The court is persuaded that, while the courts of Pakistan did not apparently apply the best interest of the child standard to their decision, it is only because the mother and the child were not present in person to substantiate the mother's allegations.\" (Emphasis supplied). He later stated: \"I am persuaded that, if the child and the mother had been present, the law of Pakistan requires their courts to give paramount consideration to the best interests of the child.\" (Emphasis supplied). These statements indicate that the circuit court actually found that the Pakistani courts had not applied the best interests of the child standard. This view is supported by the fact that, when counsel asked the court whether the proposed order to be submitted by counsel should contain the court's findings, the judge replied: \"I don't think the findings need to be expressed in the order. The findings are on the record.\"\n\nNevertheless, in its subsequent written order, the court stated that appellant had \"failed to prove [that] the Pakistani court did not apply the 'best interest of the child' standard.\" Thus, there are flatly contradictory findings on the record. It is not dispositive that the finding favorable to appellee is in a written order executed subsequent to the court's oral rulings. As the Court of Appeals stated in Davis v. Davis, 335 Md. 699, 713, 646 A.2d 365 (1994), \"the subsequent issuance of a formal written order does not preclude a finding that judgment was actually orally rendered on an earlier date.\"\n\nThe problem of the contradictory findings is not merely of academic concern; it is crucial with respect to the appropriate standard of review. We must determine whether the circuit court's factual conclusions are clearly erroneous. Our decision hinges on which decision is subjected to that test. To say that the circuit court's finding that the Pakistani courts applied the best interests of the child test is not clearly erroneous is completely different from saying that its finding that the Pakistani courts did not apply the best interests of the child test is clearly erroneous.\n\nIt is also significant that the trial court orally suggested that the Pakistani courts did not apply the best interests of the child standard, albeit because appellant and Mahak did not appear in Pakistan. While the trial court may have meant to blame appellant for the Pakistani court's action, it is the underlying finding that is critical. We expressly said in Malik that the Pakistani decisions are not entitled to comity if the Pakistani courts did not apply the best interests of the child standard. Malik, 99 Md. App. at 533-534. We did not say that, if the Pakistani courts failed to apply the proper standard because the mother did not appear, comity is warranted.\n\nThe majority minimizes this concern when it calls the court's initial finding \"a single comment regarding the lack of evidence before the Pakistani court from which it could apply the best interests standard.\" But the circuit court did not simply refer to a \"lack of evidence.\" To the contrary, it initially found that the Pakistani courts had not applied the best interests standard. Further, that \"single comment\" happens to be a finding on the paramount issue of this case.\n\nAs it is unclear what the circuit court found, we should not be forced to speculate, particularly when the future of a child is at stake. If we cannot clearly determine what the trial judge meant, at a minimum, a remand for clarification is required.\n\nB.\n\nMalik makes clear that a cardinal question is whether the Pakistani courts applied the best interests of the child standard. The Pakistani opinions certainly contain phraseology that sounds like a best interests standard. But careful review of the Pakistani orders makes clear that the Pakistani courts did not apply the best interests standard within the meaning of Maryland law.\n\nIn Queen v. Queen, 308 Md. 574, 521 A.2d 320 (1987), the Court defined the best interests standard:\n\n\"For the purpose of ascertaining what is likely to be in the best interests and welfare of a child a court may properly consider, among other things, the fitness of the persons seeking custody, the adaptability of the prospective custodian to the task, the age, sex and health of the child, the physical, spiritual and moral well-being of the child, the environment and surroundings in which the child will be reared, the influences likely to be exerted on the child, and, if he or she is old enough to make a rational choice, the preference of the child. 2 Nelson, Divorce and Annulment, § 15.01 (2nd ed., 1945). It stands to reason that the fitness of a person to have custody is of vital importance. The paramount consideration, however, is the general overall well-being of the child.\"\n\nId., 308 Md. at 587-88, quoting Hild v. Hild, 221 Md. 349, 357, 157 A.2d 442 (1960).\n\nIn addition to the factors enumerated in Queen, we added in Best v. Best, 93 Md. App. 644, 655, 613 A.2d 1043 (1992), that the trial court should also consider \"length of separation from the natural parents,\" \"potentiality of maintaining natural family relations,\" \"material opportunities affecting the future of the child,\" and \"prior voluntary abandonment or surrender.\" Best, 93 Md. App. at 656-657. See also Montgomery County Department of Social Services v. Sanders, 38 Md. App. 406, 419-21, 381 A.2d 1154 (1978). I am unable to find any contemporary authority suggesting that the best interest standard compels a custody award adverse to a parent who, without violating a court order, nevertheless leaves or flees the home jurisdiction with the child who is the focus of the custody battle.\n\nNumerous cases in Maryland emphasize the overriding importance of the best interest standard. Indeed, we recently reiterated that the best interest standard is \" the dispositive factor on which to base custody awards.\" Wagner v. Wagner, 109 Md. App. 1, 674 A.2d 1, 1996 Md. App. LEXIS 16 at *51 (emphasis in original). Moreover, in Taylor v. Taylor, 306 Md. 290, 303, 508 A.2d 964 (1986), the Court said that the best interest of the child is \"the objective to which virtually all other factors speak.\" See also Robinson v. Robinson, 328 Md. 507, 519, 615 A.2d 1190 (1992) (the best interest standard is the \"primary concern\"); McCready v. McCready, 323 Md. 476, 481, 593 A.2d 1128 (1991) (best interest test is the \"appropriate standard\" to determine custody); Ross v. Hoffman, 280 Md. 172, 175, 178, 372 A.2d 582 (1977) (\"the best interest standard controls\" custody dispute and is \"always determinative\"); Fanning v. Warfield, 252 Md. 18, 24, 248 A.2d 890 (1969) (best interest standard is the \"ultimate test\"); Dietrich v. Anderson, 185 Md. 103, 116, 43 A.2d 186 (1945) (the best interest standard is \"of transcendent importance\"); Shunk v. Walker, 87 Md. App. 389, 396, 589 A.2d 1303 (1991) (\"The guiding principle of any child custody decision, whether it be an original award of custody or a modification thereof, is the protection of the welfare and best interests of the child\"); Kramer v. Kramer, 26 Md. App. 620, 623, 339 A.2d 328 (1975). Bearing in mind the undisputed importance of the best interest standard, I turn to a review of the Pakistani orders in issue.\n\nIn the opinion of the Court of Vth Senior Civil Judge at Karachi East, issued October 23, 1991, the judge awarded custody to Mr. Malik because appellant removed the child from the \"constructive custody\" of her father and \"the father cannot exercise his control\" over the child. The court then cited a previous case for the proposition that \"by removing the minor to U.S.A. the defendant has deprived the minor child of an opportunity to meet her father, which means that she has done something [injurious] to the mental and emotional well-being of the minor, and thereby has lost the right of Hizanat.\" Those were the only reasons that the court gave in support of its conclusion.\n\nNoticeably absent is any discussion or findings as to the fitness of either parent. Nor is there any consideration of the well-being of the child or the standard of living or surroundings in which Mahak would be reared. Further, the court did not attempt to ascertain the desires of Mahak, who was then eight years old, either through appointment of an attorney for her or through counsel for the parties. This is in spite of the fact that § 17(3) of the Pakistani Guardians and Wards Act (\"the Act\") allows the court to consider the preference of the minor \"if the minor is old enough to form an intelligent preference.\"\n\nIt is also significant that there was no effort by the Pakistani court to appoint an attorney for Mahak. Considering the importance of independent counsel for children in contested custody disputes, (supra) at 6-8, this failure offends the procedure of Maryland courts.\n\nIn its recitation of facts, the Pakistani court noted appellant's allegations that her former husband \"is addicted of Alcohol and tranquilizers and the said habits made him unable to deal with daily life and discharge his obligation to look after the welfare of [appellant] and the minor\" and that Mr. Malik\n\nused to extend threats of dire consequences to the [appellant] and also used to threaten to snatch away the minor from the [appellant]. Due to said threats the minor started awakening at night time and used to utter words 'Bachao Bachao.' In order to save the minor from unpleasant atmosphere and in the welfare of the minor the [appellant] left Karachi for U.S.A. along with the minor....\n\nYet the court failed to investigate, consider, or resolve the mother's serious allegations of appellee's substance and domestic abuse. As the majority concedes, Justice Dogar, appellee's expert witness, \"opined that the Pakistani court did not consider appellant's allegations,\" because she failed to appear.\n\nAlthough appellant did not personally appear in Pakistan to present the allegations of abuse, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e it is extremely unlikely that a Maryland judge would simply award custody of a child to a parent accused of abuse or misconduct, merely because the other parent fails to appear. Rather, the judge would attempt to ascertain the validity of the claims, in order to safeguard the well-being of the child. See John F. Fader II \u0026 Richard J. Gilbert, MARYLAND FAMILY LAW § 5-8 (2nd ed. 1995).\n\nTo be sure, an investigation is not statutorily required. See Powers v. Hadden, 30 Md. App. 577, 587, 353 A.2d 641 (1976). There are, however, circumstances when our courts have recognized that an investigation is warranted, to enable the court to fulfill the mission of doing what is best for the child. See Ouellette v. Ouellette, 246 Md. 604, 608, 229 A.2d 129 (1967) (\"we think that the determination of the [custody issue], due to the ages of the children, should have been deferred until after a qualified agency had made an investigation for the chancellor. . . .\"); Jester v. Jester, 246 Md. 162, 171, 228 A.2d 829 (1967). See also Shanbarker v. Dalton, 251 Md. 252, 259, 247 A.2d 278 (1968). In the face of appellant's allegations, which were known to the courts, the Pakistani court should have sought to assure the child's safety. See Ross v. Hoffman, supra, 280 Md. at 176, citing Dietrich v. Anderson, supra, 185 Md. at 118 (\"a court of chancery stands as a guardian of all children and may interfere...in any way to protect and advance their welfare and interests\"). Appellee's denial of the accusations is not a substitute for an independent investigation.\n\nIn my view, the Pakistani court order fits squarely within the analysis of Al-Fassi v. Al-Fassi, 433 So. 2d 664 (Fla. Dist. Ct. App. 1983), which we discussed favorably in our opinion in Malik, 99 Md. App. at 534. There, Florida's intermediate appellate court declined to grant comity to a Bahamian court order that awarded custody to a father to avoid the risk of the children's becoming \"little Americans,\" of \"losing the cultural heritage of Saudi Arabia,\" and of losing their royal inheritance. 433 So. 2d at 665-66, 668. The court reasoned that the Bahamian decree was not entitled to comity because it did not conform to Florida's public policy of basing custody decisions on the best interests of the children. Id. at 668. The Florida court particularly noted that the Bahamian court had not considered all the factors in Florida's best interests of the child test:\n\nSection 61.13(3), Florida Statutes (1981) states that the court shall consider and evaluate all factors affecting the best interests of the child, and enumerates some of the significant factors. There are conspicuously missing, among the factors considered by the Bahamian court, the following considerations of Section 61.13(3): (1) length of time the children lived in a stable environment and the desirability of maintaining continuity; (2) education of the children; (3) psychological stability of the parents based on competent evidence; and (4) physical health of the parents. Although the decree purports to have considered the best interests of the children, little evidence based on those interests, as set out by statute, was presented to the court. The factor focused on by the Bahamian court was the \"risk\" of losing the inheritance of royalty if the children were raised as \"little Americans.\" Comity must give way to the interests of the state in exercising parens patriae jurisdiction over the child with the objective of protecting the recognized best interests of the child.\n\nId., 433 So. 2d at 668 (emphasis supplied).\n\nLike the Bahamian court order at issue in Al-Fassi, the Pakistani court order, which professes concern for the \"welfare\" of the child, nonetheless gives no indication that it considered all of the best interest factors. Rather, the court merely said that custody belonged with the father because appellant had interfered with the father's right to \"control\" the child. The court appeared to indulge a conclusive presumption that appellant's interference with Mr. Malik's ability to see his daughter meant that custody belonged with Mr. Malik. That is not the application of the best interests of the child test, as we have defined it. As the Court stated in In re Adoption/Guardianship No. A91-71A, supra, 334 Md. at 561, \"the controlling factor . . . in adoption and custody cases is not the natural parent's interest in raising the child, but rather what serves the best interests of the child.\"\n\nThe judgment of the Court of III Additional District Judge at Karachi East, to which Ms. Hosain appealed the previous court's ruling, is equally flawed. The mother's denial of the father's access to the child, and the near total emphasis on the father's \"right\" to \"control\" the child, were apparently the primary grounds on which the court based its decision. Like the lower court, the appellate court focused almost exclusively on Ms. Hosain's interference with Mr. Malik's rights of \"constructive custody\" or \"control.\"\n\nIn affirming the award of custody to Mr. Malik, the court said: \"The fact that the minor has been removed from the access of the father. The mother has lost her right of hizanat of the minor who is under law deemed to be in constructive custody of [the] father therefore the mother has lost right of hizanat. . . .\" The court also made statements that the \"father should be deemed to be in constructive custody of the minor\" and\n\nthe right of a Mohammadan mother of the custody of a minor is subject to the control of the mother [sic; from the context it appears that the court or translator meant to say \"father\"] and if she takes away the minor against the wishes of the father to a place where [the] father cannot exercise supervision and control she acts without authority and her taking away the minor amounts to removal of the minor from the custody of the father.\n\nThe legal authority on which the court based its decision further establishes the apparent conclusive presumption that the mother's interference with the father's control of the child was the basis of the custody decree. The court quoted from the case of PLD 1967 Lahore 382 Mst. Churagh Bibi v. Khadim Hussain:\n\n\"If a woman who has the hizanat of a child denies the father of the child, who is under Muslim law his or her natural guardian, access to the child, she must be considered not only to have removed the child from the constructive custody of the father, but also to have done something which is against the welfare of the minor....\"\n\nAppellant's allegations of abuse are included in the court's opinion:\n\nIt is also contended that during the time they lived separately since both of the houses happened to be nearer to each other the [appellee] in a drunk position used to visit the appellant and extended threats of dire consequences for life of the appellant and used force to snatch away the minor daughter to coerce the appellant to accept the [appellee] and to go according to his wishes. This also badly affected the mind of the minor who used to get up during night hours and cried 'BACHAO BACHAO' due to the aggressive behavior and maltreatment at the hands of the appellee.\n\nBut, again, there is no indication that the court considered these serious allegations or took the lower court to task for failing to do so. From the foregoing, it is clear that the appellate court did not truly apply the best interests of the child test any more than the lower court had.\n\nThe analysis of the Court of Vth Senior District Judge/ASJ \u0026 R.C. at Karachi East, dated August 10, 1993, is concededly closer to the best interests of the child standard. Nonetheless, while the court paid lip service to something that sounds like a best interests of the child standard, it still did not apply that standard.\n\nIn awarding custody to appellee, the court reasoned that Ms. Hosain had \"forcibly removed the custody of the minor Mahak Malik from the custody of\" the father, that Ms. Hosain was \"living a sin life accompanied by her lover,\" and that Mr. Malik was the \"natural guardian\" of the child. It added that the mother lived in \"an unislamic society [which] will not be in the welfare and well being of the minor daughter,\" while Mr. Malik was \"a business man living in an Islamic society with a moral character.\" Although the court mentioned that Ms. Hosain had a child with her paramour, who is now her husband, it did not consider or address Mahak's interest in remaining with her half-sibling. This is inconsistent with the policy in Maryland that courts should avoid the separation of siblings. See Hadick v. Hadick, 90 Md. App. 740, 748-49, 603 A.2d 915, cert. denied, 327 Md. 626, 612 A.2d 256 (1992).\n\nOverall, the Pakistani court's discussion amounts to conclusory statements. As with the Bahamian court order at issue in Al-Fassi, supra, there is no indication of a weighing of the various factors embodied in our best interests test, or a consideration of the child's need for stability. See McCready v. McCready, supra, 323 Md. at 481 (\"The desirability of maintaining stability in the life of a child is well recognized....\"); Cf. Krebs v. Krebs, supra, 255 Md. at 266-67 (\"Frequent change of custody does not contribute to that feeling of security essential to the mental well being of growing children\"); Jordan v. Jordan, 50 Md. App. 437, 443, 439 A.2d 26, cert. denied, 293 Md. 332 (1986) (\"'The stability provided by the continuation of a successful relationship with a parent who has been in day to day contact with a child generally far outweighs any alleged advantage which might accrue to the child as a result of a custodial change.'\" [Citation omitted]). Rather, the court said only that (1) Ms. Hosain denied Mr. Malik access to Mahak; (2) Ms. Hosain was living a sinful life by cohabiting with a paramour; and (3) Mahak would be living in an \"unislamic society.\" Those reasons do not constitute application of the best interests of the child test.\n\nAs for the first reason, Ms. Hosain's denial of Mr. Malik's access to Mahak sounds like the father's-right-to-control rule on which the other courts relied. As for the second reason, the court was certainly entitled to consider that Ms. Hosain lived with another man, and had a child with him, out of wedlock. But the court never established the correlation between that conduct and Mahak's best interests. It is settled policy in Maryland that the fact of adultery should be considered \"only insofar as it affects the child's welfare.\" Davis v. Davis, 280 Md. 119, 127, 372 A.2d 231 (1977). Accord Swain v. Swain, 43 Md. App. 622, 628, 406 A.2d 680, cert. denied, 286 Md. 754 (1979); Draper v. Draper, 39 Md. App. 73, 79, 382 A.2d 1095 (1978). Finally, the Pakistani court's reference to Mahak's living in an \"unislamic society\" is reminiscent of the facts of Al-Fassi, in which the Bahamian court had awarded custody to the father on the grounds of the risk of the children's becoming \"little Americans,\" of \"losing the cultural heritage of Saudi Arabia,\" and of losing their royal inheritance. 433 So. 2d at 665-68.\n\nMoreover, like the previous courts, the allegations of substance and domestic abuse were not considered, although the court stated in its opinion:\n\nIt is further stated by [appellant, in her written statement] that [appellee] is addict of smoking joints, in the habit [of] consuming alcohol and also addict of using tranquilizers, which fact was transpired upon her after the marriage. And due to above addiction, the health of [appellee] is totally wrecked and his mind is unable to deal with his daily life, therefore, he cannot look after the welfare of the minor.\n\nConsideration of these serious charges, regardless of whether the accuser appears, is essential to a meaningful application of the best interests test.\n\nCertainly, I do not intend in any way to criticize Pakistani laws, mores, culture, or customs. Moreover, like the majority, I, too, recognize that Islam is \"one of the world's oldest and largest religions.\" But we were clear in Malik that, unless the Pakistani courts applied the best interests standard, comity was not appropriate. The Pakistani courts' use of phrases such as the \"welfare of the minor\" does not constitute the application of the best interests of the child standard. These words are, after all, only labels.\n\nIII.\n\nThe majority accuses Ms. Hosain of bringing this unfortunate situation upon herself and her child through her \"improper conduct\" in leaving Pakistan and \"absconding\" to Maryland. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e It terms her actions a \"brazen disdain for the rule of law,\" and mentions her \"adulterous\" relationship with her current husband.\n\nMs. Hosain did not unlawfully abscond from Pakistan with Mahak. Early in the opinion, the majority acknowledged that appellant left Pakistan before, and not after, appellee was awarded custody. Thus, when Ms. Hosain came to this country, she was not under any legal compulsion to remain in Pakistan or to relinquish custody of Mahak. In essence, she came as an immigrant to our nation of immigrants. The majority's assertion that appellant attempted to use the Maryland court in \"a conscious and apparently calculated plan to circumvent the laws\" of Pakistan is also unfounded. She, like many others, has resorted to our courts to defend her current living arrangement with her child, and to contest custody orders from another country that, in her view, are inconsistent with this State's policy. She should not be chastised for contesting the Pakistani decrees in the courts of the land where she now lives, merely because she and her child are Pakistani by birth.\n\nThe majority also suggests that the adoption of my views would sanction wholesale \"uprooting\" of children and would lead to the influx to Maryland of parents seeking custody of children who have been snatched, or trying to re-litigate issues that have been determined by custody decrees of other courts. I certainly do not want to be understood as encouraging such conduct. It is worth noting that the Maryland General Assembly and the United States Congress have enacted legislation to address these concerns. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See, e.g., the UCCJA and the Parental Kidnapping Prevention Act, 28 U.S.C. § 1738A. But we should not lose sight of the fact that this case concerns only one child.\n\nI respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. This aspect of the \"personal law\" was referred to as the right of \"Hazanit,\" which we shall discuss more fully below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In a footnote in her brief, citing In re Adoption/Guardianship No. A91-71A, 334 Md. 538, 557, 640 A.2d 1085 (1994), and Washington County Dept. of Social Servs. v. Clark, 296 Md. 190, 199-200, 461 A.2d 1077 (1983), appellant incorrectly asserts that her objection was not required. In both cases, the Court of Appeals held that a party's failure to preserve the issue of the propriety of the circuit court's failure, in the first place, to appoint counsel for the child under the statute mandating such appointment is reviewable because where \"the person for whose protection the statute was enacted is too young to have raised the issue in the absence of counsel, [an appellate court] may, in [its] discretion, address the issue.\" In re Adoption, 334 Md. at 557. See also Clark, at 200. Both cases are inapposite to the instant case because we are not dealing with whether the circuit court should have appointed counsel for the child under a statute requiring it to do so. In our case, court-appointed counsel is already in place. Rather, John O. is the applicable authority in the instant case. In any event, even if both cases applied, it would make no difference in light of our discussion to follow.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. As an aside, we note that it would be a monumental waste of judicial resources, in light of the child's attorney's position, for this Court to remand the case to the circuit court on the ground that the child's attorney was absent from the remand hearing. If we were to remand the case, appellant's counsel would re-prosecute the matter with the child's attorney present, but not adding anything of value to the proceedings because, as counsel has made clear, she could not assist the trial judge in making the relevant determination under Malik. The only result, therefore, would be to allow appellant a second bite at the apple.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We note that, holding otherwise would lead to undesirable behavior on the part of the absent party having physical custody of the child. The absent party could effectively \"hide out\" until the proceedings in the other party's jurisdiction have been concluded. Thereafter, the absent party could run to his jurisdiction's court and successfully have comity denied to the order of the other party's jurisdiction's court on the ground that the best interest of the child test was not applied there because the absent party's evidence was not considered. To frustrate another country's or state's adjudicatory process in this manner is contrary to the orderly disposition of litigation and avoidance of multiplicity of lawsuits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The imperative that the Pakistani court apply the best interest standard as of the time the father sued for child custody in Pakistan and the case was presented in that court is unaffected by our correction, (supra) , noting that the mother fled the country before -- rather than after -- appellee filed his petition for custody. The Pakistani court was not obliged to, nor could it, apply the best interest standard to a Pakistani child using American values.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. At the remand hearing, these orders were introduced into evidence. Our review of these orders indicates that they were from the Pakistani judges' oral rulings from the bench. The orders contain grammatical and word usage errors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As the experts explained, \"Hazanit\" is a religious or personal right to have custody of one's child depending on, among other things, the age and sex of the child. We set forth appellant's explanation of this doctrine below. As an aside, there seems to be some discrepancy regarding the proper spelling of the term. The Pakistani orders state \"Hizanat,\" but the parties state \"Hazanit.\" In the interest of convenience, we shall employ the parties' spelling.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. We are mindful that the court in Pakistan may not have considered the circumstances preceding appellant's departure from Pakistan. As we explained above, however, the court could not do so because appellant never appeared to substantiate her claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In McAndrew v. McAndrew, 39 Md. App. 1, 382 A.2d 1081 (1978), wherein we concluded that Maryland abolished the maternal preference by statute, we presented the reasoning underlying the maternal preference. We noted that it was once described as a \"universal verity\" and was recognized \"by the commonality of man.\" Id. at 6. We concluded, despite these views, that \"[a] parent is no longer presumed to be clothed with or to lack a particular attribute merely because that parent is male or female.\" Id. at 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Q: \"How many women, in the last 50 years, have been stoned under the Hudood Laws [criminal law] for adultery?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDr. Malik: \"No one.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ: \"No one?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA: \"No one.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ: \"Not a single one?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA: \"No.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Q: \"And isn't that because the proof under Hudood is practically impossible?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDr. Malik: \"It's not impossible, but it is very difficult.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ: \"Well, it requires four eyewitnesses --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA: \"That's right.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ: \"-- of the penetration, of the actual act of sexual intercourse; does it not?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA: \"Very true.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Ironically, the minority posits that \"the court did not attempt to ascertain the desires of Mahak, who was then eight years old . . . .\" The Pakistani court ordered the production of the minor child who would have indeed been able to express a preference as to custody; it was appellant who chose to defy the court's order and not produce the child. Justice Dogar testified, with respect to the weight to be given the minor child's preference:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf the court is satisfied the girl is intelligent and understands the implications of leaving the mother or leaving the father or leaving the whole family, then the court will give weight to the statement, but if the court considers that she is not capable of understanding what I am doing by leaving my mother or by leaving my father or by leaving my family, then they will not give it weight.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAppellant, as a consequence of defying the court order, thereby thwarted an opportunity to allow the Pakistani court to take into consideration what may have been the most persuasive evidence available as to the best interest of the child. Unfortunately, we will never know what the child's preference would have been when the Pakistani court ordered her production because, as a result of appellant's refusal to participate personally in the Pakistani proceedings, appellant has now created a five-year hiatus during which the child's preference and feelings have been influenced by the isolation from her father and dependency on appellant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The laws of Maryland, and virtually every jurisdiction in the United States, provide for the issuance of an ex parte order to a parent who is constrained to remove his or her child from the custody of the other parent where the circumstances warrant. MARYLAND CODE ANNOTATED FAMILY LAW § 9-305, is authority for the proposition that it is unlawful for a relative who knows that another person is the lawful custodian of a child under the age of sixteen years to \"abduct, take, or carry away the child from the lawful custodian to a place outside of this State.\" Section 9-306(a) and (b) provide:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) Petition. -- If an individual violates the provisions of § 9-304 or § 9-305 of this subtitle, the individual may file in an equity court a petition that:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) states that, at the time the act was done, a failure to do the act would have resulted in a clear and present danger to the health, safety, or welfare of the child; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) seeks to revise, amend, or clarify the custody order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) Defense. -- If a petition is filed as provided in subsection (a) of this section within 96 hours of the act, a finding by the court that, at the time the act was done, a failure to do the act would have resulted in a clear and present danger to the health, safety, or welfare of the child is a complete defense to any action brought for a violation of § 9-304 or § 9-305 of this subtitle.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis is consistent with one of the stated purposes of the Maryland Uniform Child Custody Jurisdiction Act -- to \"deter abductions and other unilateral removals of children undertaken to obtain custody awards.\" MD. CODE ANN. FAM. LAW, § 9-202(a) (5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSection 9-306(b) plainly provides the mechanism whereby one who has taken a child without legal sanction may file a petition within 96 hours of taking the child alleging that failure to act would have resulted in a clear and present danger to the health, safety, or welfare of the child. Appellant never filed any such petition, nor made any attempt of any kind to seek a legal determination until her whereabouts were discovered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Appellant, notwithstanding our decision herein, may petition the Pakistani court to modify the Pakistani custody decree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSection 9-214(a) provides in pertinent part that a custody decree of another state shall not be modified unless:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) it appears to the court of this State that the court that rendered the decree does not now have jurisdiction under jurisdictional prerequisites substantially in accordance with this subtitle or has declined to assume jurisdiction to modify the decree and (2) the court of this State has jurisdiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe evidence in the record strongly reveals that the Pakistani court retains jurisdiction. In this respect, Justice Dogar testified:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf she goes back and files a petition before the court and says, this case was decided ex parte, and my absence from the court was not intentional, it was due to some compulsion, which she can give one, two, whatever compulsion, and she says, no, I am here now. I am here. I want the ex parte proceedings to be set aside.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe court will grant this one issue only, and the court will call the other party and then upset, if it agreed, upset that order and then will give a full opportunity to both parties to again give evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Malik will again have to make a statement in her presence. She will engage counsel. He will be asked to bring his witnesses. She will be asked to produce witnesses and make statements, and then the whole evidence of both parties, when it comes, according to the case, will be decided, and maybe she presents good evidence and gets custody.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNow, for the sake of an example, she has said that he is an alcoholic. That is a mere allegation on paper. It's not in court. If she comes with some evidence, well, maybe then the court will think he is not a good person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn addition to the above, Justice Dogar stated numerous times during his testimony that the Pakistani courts would entertain appellant's petition to modify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSignificantly, the Order of the Vth Senior Civil Judge/ASJ at Karachi East provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI, may point-out [sic] here that in case any subsequent events are created, the defendent [sic] can apply for review of the order, but it is subject to the production of the minor in Court, as laid down in P.L.D. 1985 Karachi page 645.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, the Commentary to § 17 of the GUARDIAN AND WARDS ACT (1992 Ed.) provides under the heading \"Orders always temporary\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOrders under the Act must not necessarily be, in the nature of the things, final and unalterable; they can be altered from time to time, as circumstances require.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurthermore, Harris v. Melnick, 314 Md. 539, 555, 552 A.2d 38 (1989), cited by appellant, refers to the Commissioners' Note to § 14 [Maryland's § 9-214] of the Uniform Act, and delineates the circumstances causing a \"decree-rendering state to lose modification jurisdiction\":\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFor example, if custody was awarded to the father in state 1 where he continued to live with the children for two years and thereafter his wife kept the children in state 2 for 6-1/2 months (3-1/2 months beyond her visitation privileges) with or without permission of the husband, state 1 has preferred jurisdiction to modify the decree despite the fact that state 2 has in the meantime become the \"home state\" of the child. If, however, the father also moved away from state 1, that state loses modification jurisdiction interstate, whether or not its jurisdiction continues under local law. See Clark, Domestic Relations 322-23 (1968). Also, if the father in the same case continued to live in state 1, but let his wife keep the children for several years without asserting his custody rights and without visits of the children in state 1, modification jurisdiction of state 1 would cease.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFrom the above, appellant clearly may not seek modification of the Pakistani court order by the circuit court, because the Pakistani courts have retained jurisdiction under the principle akin to Maryland's change in circumstances modification standard, i.e., \"in case any subsequent events are created.\" Thus, since appellant may petition the Pakistani court for a modification of the Pakistani decree, under § 9-214, a court of this State \"shall not modify that decree.\" Consequently, appellant may not seek a modification of the Pakistani decree in the circuit court until she has first petitioned the Pakistani court to modify its decree, and the Pakistani court thereafter declines to assume jurisdiction for this purpose. The excerpts cited from the record also indicate appellant may, even now, move to set aside the original Pakistani decree based on her representation that her absence \"was due to some compulsion\" and \"not intentional.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The present language of the rule contrasts with earlier versions that required an issue to have been both raised and decided by the lower court, with certain exceptions not pertinent here, in order to be preserved. See Rules 885, 1085 (repealed). For example, Rule 1085, which governed appeals to this Court, stated in pertinent part: \"This Court will not ordinarily decide any point or question which does not plainly appear by the record to have been tried and decided by the lower court.\" But a 1989 rule change substituted the word \"or\" for the word \"and.\" Thus, three of the cases that the majority cites to support its position, Medley v. State, 52 Md. App. 225, 231, 448 A.2d 363 (1982); Tichnell v. State, 287 Md. 695, 713-14, 415 A.2d 830 (1980); Dresbach v. State, 228 Md. 451, 453, 180 A.2d 299 (1962), are inapposite, because they were decided before this critical rule change.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 For example, Rule 2-517(a) provides such a requirement for objections to the admission of evidence in a civil case, and Rule 4-323(a) provides a similar requirement for criminal cases. Rule 2-517(a) states, in pertinent part: \" An objection to the admission of evidence shall be made at the time the evidence is offered or as soon thereafter as the grounds for objection become apparent. Otherwise, the objection is waived.\" (Emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The majority cites Velez v. State, 106 Md. App. 194, 664 A.2d 387 (1995), to support its conclusion on the prejudice issue. Velez is not on point. Velez concerned the trial court's election to proceed at pretrial suppression hearing in the absence of counsel. The hearing here, by contrast, was tantamount to a trial on the merits. Moreover, our decision in Velez depended not only on the fact that the decision did not affect the outcome, but also on the fact that several safeguards existed to protect the defendant. See id. at 216-17. First, the defendant's counsel missed the testimony of only one collateral witness. Id. at 211. Also, counsel for another defendant took \"copious\" notes for absent counsel. Id. Moreover, and most important, the court gave counsel the opportunity to review the testimony and decide whether he wished to recall the witness for cross-examination. Id. at 212. Our decision in Velez was thus highly fact-sensitive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 Appellant explained that she failed to return to Pakistan because, given her status as an adulterer, she could be severely punished. In view of Pakistani and Islamic laws and traditions, which the majority thoroughly reviewed, the mother also apparently recognized that the proceedings in Pakistan would likely result in an award of custody to the father, notwithstanding her claims of abuse. Cf. Hanke v. Hanke, 94 Md. App. 65, 72, 615 A.2d 1205 (1992) (\"Where the evidence is such that a parent is justified in believing that the other parent is sexually abusing the child, it is inconceivable that the parent will surrender the child to the abusing parent without stringent safeguards....\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 I am not, as the majority seems to suggest, condoning parents who flagrantly disobey court orders or unlawfully bring their children to Maryland, \"secrete\" them, and then apply for custody on the ground that the child has bonded with the absconding parent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 According to appellant, the Hague Convention on the Civil Aspects of International Child Abduction is the international version of the UCCJA. The parties agree that Pakistan is not a signatory to the Hague Convention. Moreover, appellant claims that appellee's expert conceded that Pakistan does not recognize child custody awards issued by other nations.\u003c/span\u003e\n\n",
    "body_length": 144731,
    "citedas": [
      "671 A.2d 988",
      "108 Md.App. 284"
    ],
    "attorneys": "Submitted BY Natalie H. Rees of Towson, Md., For Appellant. Argued BY Linda Haspel (Leslie B. Fried and Haspel \u0026 Meiselman, Chartered on the brief) all of Rockville, Md. Angela R. White of Baltimore, Md. on the brief for appellee, minor child, For Appellee.",
    "category": [
      "158"
    ],
    "judges": "Argued Before Wilner, C.j., Moylan, Bloom, Fischer, Davis, Murphy, Hollander and Alpert (Paul E., Retired, specially assigned), JJ. Opinion by Davis, J. Dissenting Opinion by Hollander, J., in which Alpert, J. joins.",
    "citation_count": 19
  }
}
