{
  "id": "BIH4PWYBTlTomsSBrIQk",
  "document": {
    "title": "Brokerage Concepts",
    "full_title": "BROKERAGE CONCEPTS, INC. v. U.S. HEALTHCARE, INC.; CORPORATE HEALTH ADMINISTRATORS, INC.; UNITED STATES HEALTH CARE SYSTEMS OF PENNSYLVANIA, INC., D/B/A THE HEALTH MAINTENANCE ORGANIZATION OF PENNSYLVANIA; RICHARD WOLFSON; SCOTT MURPHY; WILLIAM BROWNSTEIN RICHARD WOLFSON, SCOTT MURPHY AND WILLIAM BROWNSTEIN IN NO. 96-1891 U.S. HEALTHCARE, INC.; UNITED STATES HEALTH CARE SYSTEMS OF PENNSYLVANIA, INC., D/B/A THE HEALTH MAINTENANCE ORGANIZATION OF PENNSYLVANIA AND CORPORATE HEALTH ADMINISTRATORS, INC. IN NO. 96-1892 U.S. HEALTHCARE, INC.; CORPORATE HEALTH ADMINISTRATORS, INC.; UNITED STATES HEALTH CARE SYSTEMS OF PENNSYLVANIA, INC., D/B/A THE HEALTH MAINTENANCE ORGANIZATION OF PENNSYLVANIA; RICHARD WOLFSON; SCOTT MURPHY; WILLIAM BROWNSTEIN IN NO. 96-1922 BROKERAGE CONCEPTS, INC. IN NO. 96-1923 U.S. HEALTHCARE, INC.; UNITED STATES HEALTH CARE SYSTEMS OF PENNSYLVANIA, INC., D/B/A THE HEALTH MAINTENANCE ORGANIZATION OF PENNSYLVANIA AND CORPORATE HEALTH ADMINISTRATORS, INC. IN NO. 97-1013 RICHARD WOLFSON; SCOTT MURPHY; AND WILLIAM BROWNSTEIN IN NO. 97-1014",
    "jurisdiction": "Third Circuit",
    "date": "1998-04-02T00:00:00.000Z",
    "docket": "NOS. 96-1891, 96-1892, 96-1922, 96-192397-1013, and 97-1014",
    "body": "Volume 1 of 2\n\nFiled April 2, 1998\n\nOPINION OF THE COURT\n\nTABLE OF CONTENTS\n\nA. The Parties 11 B. Gary's Decision to Self-insure 12 C. Gary's Switch to CHA/U.S. Healthcare 16 3. Interaction Between U.S. Healthcare and Other Pharmacy Operations 20 4. The Setting of Reimbursement Prices 21 A. Introduction -- Characterization of BCI's Claim 23 1. Defining the Relevant Market 28 2. U.S. Healthcare's Power in the Tying Market 33 b. Other Factors Bearing on Market Power 37 C. Predicate Acts of BCI's RICO Claim 45 1. Extortion under the Hobbs Act 45 a. The Definition of \"wrongful\". 48 b. Lawful Versus Unlawful Claims to Property 51 c. Evidence of Other Unlawful Objectives 56\n\nI. INTRODUCTION:\n\nThe revolutionary changes in the health care field over the past decade have spawned many novel market arrangements. Perhaps the most significant development is the ascendency of managed-care driven health maintenance organizations (\"HMOs\"), whose hold over a large number of subscribers has permitted them to wield considerable economic power over health care providers. This antitrust, civil RICO, and state law tortious interference case against defendant U.S. Healthcare, one of the nation's largest HMO's, two of its wholly-owned subsidiaries, and three of its top officers, is an exemplar of the legal fallout from this development.\n\nThis appeal presents several quite difficult and important first impression questions for us, including: (1) whether the defendants' use of economic fear in the context of hard business bargaining constitutes wrongful conduct amounting to extortion for civil RICO purposes; (2) whether the inability of the plaintiff to prevail on antitrust and extortion-based civil RICO claims forecloses a successful state law tortious interference claim based on the same facts; and (3) whether the defendants' hard bargai ning constituted \"wrongful means\" so as to forfeit the defense of privileged business competition to a tortious interference claim.\n\nThe lawsuit emanates from U.S. Healthcare's refusal to approve the application of a new Abington, Pennsylvania store of \"I Got It at Gary's\" (\"Gary's\"), a small southeastern Pennsylvania pharmacy, health and beauty aid chain, for membership in U.S. Healthcare's network of medical prescription providers. U.S. Healthcare conditioned membership in its provider network on Gary's agreement to discontinue its contractual relationship with plaintiff Brokerage Concepts, Inc. (\"BCI\"), a health care consulting firm whose specialty is serving as a Third Party Administrator (\"TPA\") for health benefit self-insurers (such\n\nas Gary's), and to give its TPA business to a U.S. Healthcare subsidiary, Corporate Health Administrators (\"CHA\").\n\nU.S. Healthcare also applied pressure on Gary's in other ways -- through \"hard-ball\" negotiation tactics, which deliberately left Gary's \"hanging\" as to whether its new application would be approved, and a seemingly vindictive audit of Gary's generic prescription drug dispensing policy at one of its stores that was already part of the U.S. Healthcare network. Since U.S. Healthcare subscribers constituted a significant portion of its customer base, Gary's understandably yielded to the pressure and gave its TPA business to CHA. BCI thereupon sued in federal district court asserting Sherman Act and civil RICO claims, as well as a claim of tortious interference with contractual relations under Pennsylvania law. BCI sought compensatory and treble damages, injunctive relief, and counsel fees on its antitrust and civil RICO claims, and compensatory and punitive damages on its state law tortious interference claim. Gary's is not a party to the lawsuit.\n\nThe case proceeded to trial before a jury, which rendered a verdict finding U.S. Healthcare and its officers liable to BCI on all of BCI's claims, and awarding compensatory and punitive damages. On post-trial motions, the district court upheld the verdict but ruled that: (1) BCI must elect between the punitive damages awarded on its state law claim and the treble damages awarded on its federal claims (i.e., that it cannot recover both); and (2) if it elects the state law remedies, BCI cannot also collect the attorney's fees that are available under its RICO and antitrust claims. The defendants' appeal of the district court's denial of its post-verdict motion for judgment as a matter of law or, in the alternative, for a new trial, attacks the jury verdict on all fronts, asserting that the verdict is tainted by erroneous evidentiary rulings and jury instructions, and also that there is insufficient evidence to sustain any of the claims under proper instructions. BCI cross-appeals, contending that, under Fineman v. Armstrong World Indus., Inc., 980 F.2d 171, 218-19 (3d Cir. 1992), the district court erred in requiring BCI to elect which remedies it will recover, and also in refusing to award injunctive relief to BCI under either RICO or the antitrust laws.\n\nBecause all three of BCI's claims are grounded upon U.S. Healthcare's leveraging of its economic power, and because, under the jury instructions given by the district court, the RICO and state law claims may depend on the existence of a viable antitrust claim, the threshold doctrinal battleground has been over antitrust law. This aspect of the case is quite complex, not because of the need for sophisticated economic analysis or the resolution of any close or cutting-edge trade regulation issue, but rather because of the difficulty of attempting to shoehorn into the traditional antitrust model a claim that resists such characterization.\n\nThe matter was presented to the district court primarily as a tying case, under which a plaintiff can assert both a per se and a \"rule of reason\" claim. In a typical tying case, a seller leverages its market power in the market for the tying product to require the buyer of the product to purchase an unwanted product in the tied market, thereby (unlawfully) foreclosing competition in that market. But Gary's, the party who has been \"put upon,\" is a seller, not a buyer, in the tying product market: when U.S. Healthcare accepts Gary's into its network of providers, what Gary's gains is the opportunity to sell drugs to U.S. Healthcare subscribers. The defendants, in contrast, contend that the case is better viewed as one of reciprocal dealing which, they submit, carries with it less stringent antitrust standards.\n\nAs will appear, our Disposition of BCI's antitrust claim will take us through a number of layers of analysis, dealing with both its per se and rule of reason claims, and in the course thereof treating such matters as product market definition (and the applicability vel non of the decision in Eastman Kodak Co. v. Images Technical Servs., 504 U.S. 451 (1992)); geographic market definition (and the lack of utility of a flawed market survey in identifying the market); and above all, with the sufficiency of the record evidence (including the inferences which can be drawn therefrom) to support a legally viable antitrust claim. In the end, we conclude that, since the record before us does not support a finding that U.S. Healthcare exercised appreciable market power in a properly defined tying market, or that the\n\narrangement at issue harmed competition in the tied market, the antitrust jury verdicts on both the per se and the rule of reason claims must be set aside.\n\nIn support of its civil RICO claim, BCI alleges a variety of predicate acts, as a civil RICO claim requires. Although we deal with all of the predicate acts invoked, rejecting defendants' contention that BCI lacks RICO standing, the only acts that arguably could come within RICO's ambit are alleged extortionate acts by the defendants. Under the Hobbs Act, 18 U.S.C. § 1951, \"[e]xtortion\" is defined as \"the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, or fear.\" 18 U.S.C. § 1951(b)(2). The \"fear\" may be of economic loss as well as of physical harm. See United States v. Addonizio, 451 F.2d 49, 72 (3d Cir. 1972). In this case, the evidence is clear that U.S. Healthcare employed economic leverage in an effort to force Gary's to chose CHA as its TPA. However, while BCI contends that this conduct amounts to extortion through the wrongful use of the fear of economic loss, defendants assert that the conduct is merely hard business bargaining that cannot be made to fit within the statutory framework of Hobbs Act extortion.\n\nAs will be shown, resolution of BCI's extortion claim turns on whether the defendants' use of economic fear in the context of hard business bargaining was legally wrongful, an issue with which we have not previously had occasion to deal. We conclude that the \"claim of right\" defense to extortion (i.e., a defense based on a lawful claim to the property obtained by the allegedly extortionate acts) formulated by the Supreme Court in United States v. Enmons, 410 U.S. 396 (1973), is applicable in cases, such as this one, which involve solely the allegation of the use of economic fear in a transaction between two private parties. In so concluding, we are mindful of, and address, those cases that reject the broad application of Enmons outside of the labor context in which it arose for fear that it would \"effectively repeal the Hobbs Act.\" See United States v. Agnes, 753 F.2d 293 (3d Cir. 1985).\n\nHaving determined that the claim of right defense is available to the defendants in this case, we address the difficult problem of separating out lawful from unlawful\n\nclaims to property. We make no effort to announce any broad principles in this difficult area. Drawing instruction from Enmons and Viacom Int'l v. Icahn, 747 F. Supp. 205 (S.D.N.Y. 1990), we make a rule only for a very narrow subset of the potential universe of extortion cases: one involving the accusation of the wrongful use of economic fear where two private parties have engaged in a mutually beneficial exchange of property. We conclude that BCI's extortion claim can only survive if Gary's had a right to pursue its business interests free of the fear that it would be excluded from U.S. Healthcare's provider network. Albeit with misgivings, we find that since Pennsylvania, unlike other states, has no \"Any Willing Provider\" law that compels HMOs to allow all interested and minimally qualified providers into their network, BCI had no such right. If such a law was in force, Gary's would have had a legal entitlement to be a member of the provider network and thus to be free of the fear that it would be excluded from that network if it did not switch TPA providers. Having determined that BCI did not present a sustainable case of extortion, or establish any of the other predicate acts alleged, we set aside the jury verdict as to the civil RICO count.\n\nThat BCI's federal claims have fallen is not, however, the end of its case. BCI also alleges the defendants unlawfully and improperly interfered with its existing and prospective contractual relations with Gary's in violation of Pennsylvania tort law. While BCI must prove a number of things to prevail on a tortious interference claim under Pennsylvania law, only one is in serious dispute here. The battleground is over Restatement (Second) of Torts § 768 which sets forth a competitors privilege, and in fact over only one facet of that section, § 768(1)(d), which withdraws immunity from liability if the competitor employs \"wrongful means.\" The Pennsylvania Supreme Court has yet to define that term and hence we must predict how it would do so to resolve this case.\n\nThe parties' debate in this area was focused primarily on whether Pennsylvania would limit wrongful means to conduct that is independently actionable. While the parties have ably briefed that point, the Disposition of BCI's claim\n\ndoes not require us to resolve it. Rather, we conclude, based upon a passage from § 768 comment (e), that even if the Pennsylvania Supreme Court were to require independently actionable means, it would not apply that requirement in cases, such as this one, where the defendant exerted \"economic pressure\" or \"a superior power\" in a market unrelated to the competitive market. Here, BCI proffered ample evidence from which a jury could conclude that U.S. Healthcare attempted to acquire Gary's TPA business by threatening Gary's with withdrawal of membership in the U.S. Healthcare provider network, an unrelated market. BCI also adduced evidence of heavy- handed tactics by U.S. Healthcare in that market for pharmacy customers.\n\nIn addition to our analysis of the substance of Pennsylvania tort law, we address defendants' more fundamental argument that tort liability is not appropriate here. The crux of that argument is that BCI's tort claims are predicated on the same conduct that underlie its federal claims, and that the law should therefore not permit BCI to repackage these failed claims as tortious interference. As will be shown, in our view, BCI has attempted just the opposite. That is, it has taken conduct that constitutes tortious interference with contractual relations and has attempted to turn it into a violation of both federal antitrust and racketeering laws. While these attempts have been frustrated on this appeal, that result does not foreclose BCI's state law claim. BCI's tortious interference claim does not require proof of criminal conduct as does its extortion claim, nor is it anchored in the same kind of market based considerations as is its antitrust claim. We see no need for congruence between federal antitrust law, which is designed to protect competition and free access to markets, and state business tort law, which is designed to protect competitors.\n\nNotwithstanding this Conclusion, the tortious interference verdict cannot stand, and a new trial on the tort claims is necessary, because the jury instructions permitted the jury to find tortious interference based on antitrust and/or civil RICO violations which, we have concluded, did not exist. Hence, while we reverse outright on the antitrust and civil\n\nRICO claims, we will remand the tortious interference claims for a new trial. We intimate no view on the question whether defendants' behavior was outrageous enough to justify an award of punitive damages under Pennsylvania law; that will be for determination on remand. Since the antitrust and RICO claims are out of the case, we also need not address the question of the propriety of injunctive relief for either RICO or antitrust claims, or the interesting issues posed by the cross-appeal.\n\nII. FACTS \u0026 PROCEDURAL HISTORY\n\nA. The Parties\n\nBCI serves as a TPA for employers who wish to self- insure for their health benefits and other insurance needs. In this capacity, BCI designs the employer's self-insured benefit plan and usually recommends a health services provider network. The providers in the network then supply the health care, and BCI reviews and processes the resulting claims for the employer. In addition, BCI typically helps the employer purchase \"stop-loss\" insurance policies that cap the employers' exposure for large individual and aggregate claims. BCI also serves as an insurance broker for employees who choose to purchase fully-insured policies.\n\nU.S. Healthcare develops, owns, operates, and markets HMOs in many states in the eastern United States, including Pennsylvania and New Jersey. These HMOs are operated by wholly owned subsidiaries, including defendant United States Healthcare Systems of Pennsylvania, Inc., d/b/a The Health Maintenance Organization of Pennsylvania (\"HMO PA\"), which operates as U.S. Healthcare's HMO for Pennsylvania. As of December 31, 1994, U.S. Healthcare and its subsidiaries had approximately 1,695,000 subscribers enrolled in its insured plans.\n\nCHA is also a wholly owned subsidiary of U.S. Healthcare. It is a TPA, and provides the same type of services for self-insured employers as does BCI. In the geographic areas in which U.S. Healthcare operates an\n\nHMO, CHA utilizes only the U.S. Healthcare network of doctors and hospitals. Similarly, U.S. Healthcare bars all TPAs other than CHA access to its network. At all times relevant to the present dispute, defendant Richard Wolfson was the Director of Pharmacy Programs and the Chairman of the Board of U.S. Healthcare, defendant William Brownstein served as the Regional Pharmacy Director for Pennsylvania, and defendant Scott Murphy was the Senior Vice President of U.S. Healthcare, and the senior marketing executive for CHA. We will at times refer to U.S. Healthcare, CHA, and HMO PA collectively as the \"corporate defendants,\" and Wolfson, Brownstein and Murphy collectively as the \"individual defendants.\"\n\nB. Gary's Decision to Self-insure\n\nU.S. Healthcare has established a network of health care providers which includes doctors, hospitals, and pharmacies in various geographic regions. Under the U.S. Healthcare prescription purchase program, individuals who enroll as subscribers in U.S. Healthcare's HMOs select one pharmacy from the network of providers at which they will purchase prescription drugs. Subscribers can change their pharmacy designation by filling out a form. Under this program, subscribers can purchase their prescription drugs for a small co-payment (such as $5.00), with the rest of the cost of the prescription reimbursed to the pharmacy by U.S. Healthcare. In addition, U.S. Healthcare pays the pharmacies that serve the prescription purchase plan a set monthly amount based on the number of U.S. Healthcare subscribers designating that pharmacy, without regard to the actual purchases of drugs from that pharmacy. Because subscribers seldom purchase prescription drugs from pharmacies other than those within the network, membership in the U.S. Healthcare network is highly coveted.\n\nIn 1991, Eagleville Pharmacy, Incorporated, d/b/a/ I Got It At Gary's (\"Gary's\") was a pharmacy chain of four stores in suburban Philadelphia. All four stores served as approved providers in the U.S. Healthcare pharmacy network. At this time, Gary's offered its full-time employees two options for their health insurance coverage: a Blue\n\nCross/Blue Shield plan and a U.S. Healthcare HMO. Approximately 35 Gary's employees enrolled as U.S. Healthcare members. In 1991, to save costs, Gary's decided to terminate its relationship with Blue Cross/Blue Shield and U.S. Healthcare, and to self-insure.\n\nIn need of a TPA to process its claims, Gary's evaluated several contenders, and then entered a written contract with BCI, terminable upon 30 days prior written notice. Sandra Chen, the benefits manager at Gary's, sent termination letters to Blue Cross/Blue Shield and U.S. Healthcare.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In response to the letter, Chen testified that she received an angry and verbally abusive phone call from an unidentified U.S. Healthcare marketing executive.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e So began the wrath of U.S. Healthcare. Upon receipt of Gary's letter terminating its insurance contract, David Rocchino, one of U.S. Healthcare's sales vice-presidents, telephoned Wolfson to inform him of the new development and expressed his displeasure. Wolfson became \"upset\" that Gary's had decided to self-insure, and knowing that Gary's was approved to serve as a pharmacy for U.S. Healthcare subscribers, promptly ordered an internal \"quality assurance\" review of the generic utilization rates of Gary's stores. Wolfson admitted at trial that his only reason for ordering such a review was that Gary's had terminated U.S. Healthcare coverage for its employees, but he testified that ordering a retaliatory review was not inappropriate.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In August 1993, Gary's opened its fifth store, in Abington, Pennsylvania. Gary's applied for admission of the new store to U.S. Healthcare's pharmacy network. Wolfson, acting as director of U.S. Healthcare's pharmacy program, advised Brownstein not to process the application. U.S. Healthcare's executives acknowledged in their testimony that their motivation in refusing to process Gary's application was retaliatory, based on a belief that Gary's did not deserve U.S. Healthcare's business once Gary's had terminated U.S. Healthcare's contract in a manner that Wolfson and Brownstein found to be offensive. In compliance with Wolfson's instructions, Brownstein did not process the application. However, at this time, no one at U.S. Healthcare told Gary's of the decision to refuse to process the application. Instead, Gary's was informed that the application would be processed in due course. As Wolfson conceded at trial, the plan was to \"let [Gary's] hang . . . until they did something.\"\n\nAt the same time that Gary's Abington store applied for membership in the pharmacy network, U.S. Healthcare, at the instruction of Brownstein, performed a two-day, on-site audit of the utilization of generic drugs at Gary's store in Eagleville, Pennsylvania. The audit measured the pharmacy's compliance with the requirement of U.S. Healthcare's provider agreement that generic drugs be used whenever possible to contain costs. The audit results suggested that Gary's dispensed brand-name drugs instead of generic drugs at a rate higher than the median of the U.S. Healthcare provider, and lacked complete documentation of prescription requests. Brownstein's audit also demonstrated that the average cost-per-prescription to U.S. Healthcare at the Eagleville pharmacy was in line with the network median, so that the store's prescriptions were not costing U.S. Healthcare more on average than other pharmacies. Brownstein forwarded the audit results to the Quality Assurance Committee, which referred the matter to the Peer Review Committee. The Peer Review Committee, consisting of three outside pharmacists, had the power to recommend sanctions to Wolfson, who would then decide whether or not to impose them.\n\nOn November 16, 1993, the Peer Review Committee recommended that Gary's Eagleville store be put on\"freeze\" for three-months. The freeze was implemented and, as a result, U.S. Healthcare removed the Eagleville store from the list of approved pharmacies, and new U.S. Healthcare subscribers could not designate that store as their location for purchasing prescription drugs. In contrast to the treatment of Gary's, other pharmacies with generic drug utilization rates lower than the Eagleville pharmacy and less complete documentation of prescription requests, had not been \"frozen,\" and instead had received lesser or no sanctions. In fact, the parties stipulated that out of the approximately 1300 pharmacies in the U.S. Healthcare network for southeastern Pennsylvania and southern New Jersey, the freeze sanction had been imposed for generic utilization reasons only four times (including its use against Gary's) in all of 1993 and 1994.\n\nAlthough the extent to which Wolfson and Brownstein were involved in the implementation of the freeze sanction is unclear, both had participated regularly in Quality Assurance and Peer Review Committee meetings. Brownstein later cited the results of the audit on the Eagleville store as the reason for the delay in processing the Abington store's application for membership in the pharmacy network, stating that U.S. Healthcare had concerns about Gary's dispensing too many brand-name drugs at its stores.\n\nFaced with a freeze on its Eagleville store and no movement on the Abington store's application for membership in the pharmacy network, Gary's President, Gary Wolf, set up a meeting with U.S. Healthcare officials, including Wolfson and marketing executive Scott Murphy, for December 1, 1993. Among the issues discussed were Gary's generic drug use and the admission of the Abington store to the U.S. Healthcare provider network.\n\nU.S. Healthcare expressed its displeasure with Gary's termination of U.S. Healthcare coverage in 1991, and Wolfson commented that \"we like to do business with people who do business with us.\" At the same meeting, U.S. Healthcare requested and received permission to bid on Gary's TPA business for the next annual contract period.\n\nC. Gary's Switch to CHA/U.S. Healthcare\n\nFollowing the meeting with U.S. Healthcare, Wolf instructed his sister, Robin Risler, the Director of Human Resources at Gary's, to \"take a look at\" switching to the TPA services offered by CHA at the anniversary date of Gary's contract with BCI (at which time the contract could be terminated with 30 days advance notice.) Concurrently, Wolf sent a letter to Wolfson (dated December 6, 1993) expressing, among other things, his \"commitment that we will do everything possible to afford [U.S. Healthcare/CHA] the opportunity to service our company's needs as long as the programs are mutually beneficial\", and requesting that U.S. Healthcare consider acting on the pending application for Gary's Abington store.\n\nWhen the December 6 letter failed to produce any movement on the Abington store, Wolf explained to Chen that, in order to get the Abington store approved, Gary's needed to \"appease\" U.S. Healthcare, and instructed her to write a further letter to U.S. Healthcare assuring them that Gary's would consider CHA's bid for its TPA services. This letter, dated January 3, 1994, and addressed to Murphy, was more explicit then the December 6 letter. It stated:\n\nAs you requested, I am writing you to acknowledge the agreement made between I got it at Gary's and U.S. Healthcare. We agree that as long as there are no additional cost[s] to the plan or reduction in service, US Healthcare will assume the role of TPA for our self insured medical plan on July 1, 1994.\n\nWe also understand that in anticipation of our strengthening relationship, US Healthcare will release the provider number for our pharmacy in Abington, PA.\n\nChen testified that once this letter was written, it was a \"foregone Conclusion\" that, as long as CHA's bid was comparable and for the same services, Gary's would switch to CHA. As of this time, CHA had not yet submitted a formal proposal to Gary's.\n\nIn January 1994, within weeks of Chen's letter, U.S. Healthcare had inspected the Abington pharmacy, and, without further ado, approved its participation in the provider network. Brownstein testified that he was informed that Gary's had agreed to switch TPAs to CHA, and \"on the basis of that,\" was instructed to enroll Gary's Abington store in the provider network. U.S. Healthcare acted with such speed in approving the Abington store's application for membership in the provider network that it failed to follow its own standard approval procedures, and did not present the store's application to the Membership Application Credentials Committee until after the pharmacy was already participating as a provider.\n\nIn February 1994, U.S. Healthcare lifted the freeze on the Eagleville store. Similarly, Gary's sixth pharmacy in Aston, Pennsylvania, was accepted into the provider network without delay. At approximately this same time, Robin Risler, who testified that, ultimately, the selection of a TPA was her responsibility, hired an insurance broker to assist her in evaluating the competing TPAs. In early June 1994, both BCI and CHA submitted bids for Gary's TPA business, but CHA was given the opportunity to review BCI's bid before submitting its final proposal. In May 1994, even before Gary's had received a proposal from U.S. Healthcare, Risler told Lori Manley, the BCI customer service representative, that Gary's would be switching to CHA/U.S. Healthcare. Manley testified that Risler confided that she felt she was being \"strongarmed\" by U.S. Healthcare, that \"she herself did not want to leave BCI\" and that the decision \"was out of her control.\" Two other BCI employees similarly testified that in the spring of 1994, Risler denied having any real choice in the decision to give Gary's TPA business to CHA in light of the loss of U.S. Healthcare's business that Gary's would suffer if it failed to switch TPAs. The testimony with respect to Risler of Manley and the two additional BCI employees was\n\nadmitted over U.S. Healthcare's objection as state of mind evidence. See (infra) note 31.\n\nAs the time for Gary's formal switch to CHA drew near, U.S. Healthcare scheduled another on-site \"quality assurance\" audit, this time of Gary's Lansdale store for June 16, 1994. In the second week of June, Risler officially informed BCI of Gary's decision to give its TPA business to CHA. After Gary's decision was officially announced, the audit of the Lansdale store uncovered no problems. Moreover, there were no further audits of Gary's pharmacies.\n\nThe reasons behind Risler's decision to switch to CHA are in dispute. BCI's TPA expert, Carlton Harker, testified that for the one year period of 1994-95, the BCI proposal would have saved Gary's approximately $64,000, or 14%, compared to the proposal submitted by CHA. Harker further testified that he did not perceive any significant differences in the services provided under the respective plans that would explain the cost differential. Risler testified that, in making the decision to give Gary's TPA business to CHA, she was motivated by non-price, quality of service reasons. She also acknowledged, however, that she had been satisfied with BCI's services. At all events, the results of the decision are clear -- BCI lost its contract with Gary's.\n\nIn March 1995, BCI filed the present suit challenging the defendants' actions that preceded Gary's decision to terminate its TPA contract with BCI. BCI proceeded at trial against defendants on four counts. Count I alleged that U.S. Healthcare, HMO PA, and CHA violated Section 1 of the Sherman Act, 15 U.S.C. § 1, by tying the participation by Gary's in the U.S. Healthcare pharmacy network to the purchase of CHA's TPA services for Gary's employees. In Count II, BCI alleged that all defendants violated the Racketeer-Influenced and Corrupt Organizations Act (\"RICO\"), 18 U.S.C. § 1961 et seq., by engaging in or conspiring to commit at least two acts of racketeering activities, among them extortion, bribery, mail and wire fraud, and violations of the Travel Act.\n\nIn a Count III, BCI also contended that, to the extent that defendants Wolfson, Murphy, and Brownstein were not\n\nprincipal wrongdoers, they are liable for aiding and abetting under RICO. Finally, in Count IV, BCI alleged that all defendants tortiously interfered with its existing or prospective contractual relationship with Gary's in violation of state law. BCI sought treble damages and attorneys fees under its federal law claims. It also sought punitive damages from each defendant in connection with its state law claim.\n\nD. Economic Evidence\n\n1. Impact on Gary's\n\nBCI argued at trial that Gary's ability to operate profitably depended on the business of U.S. Healthcare subscribers. As evidence, BCI pointed to the parties' stipulation that, as of December 1993, when Wolfson told Gary Wolf that U.S. Healthcare likes to do business with people \"who do business with us,\" 9,178 U.S. Healthcare subscribers had designated Gary's as their provider pharmacy, and that in 1993, Gary's subscribers purchased $1.66 million of prescription drugs. BCI's expert Dr. Calvin Knowlton, who is an associate professor and Chair of the Department of Pharmacy Practice and Pharmacy Administration at the Philadelphia College of Pharmacy and Science, and the President of the American Pharmaceutical Association, testified that, based on the stipulated information and Gary's Sales Reports, in 1993, U.S. Healthcare members accounted for between 3-15% of Gary's prescription drug sales, and, by 1995, for 20% of prescription drug sales in Gary's Montgomery County stores.\n\nIf Gary's operated as an unapproved pharmacy, any U.S. Healthcare subscriber who wanted to fill his or her prescription at Gary's would have to pay full price, instead of a small co-payment. Additionally, Gary's head pharmacist testified that prescription drug purchasers are valuable consumers because they typically purchase other items in addition to their prescription drugs. BCI also presented evidence that the prescription drug business of pharmacies is a low-margin business that depends on high volume in order to operate profitably. In order to maximize\n\ntheir sales, pharmacies typically become members of as many prescription drug plans as possible. Out of approximately 1300 participating pharmacies in southeastern Pennsylvania and southern New Jersey, only four pharmacies left the U.S. Healthcare pharmacy network in the period from January 1, 1993 to October 1, 1995 for reasons other than going out of business.\n\n2. Knowlton's Survey\n\nAt trial, BCI presented a telephone survey of the market areas surrounding several of Gary's pharmacies, performed by Dr. Knowlton, which was admitted over objection. In this survey, pharmacy students telephoned six to eight pharmacies in the vicinity of three arbitrarily selected Gary's store locations and asked them a series of questions. Knowlton drew Conclusions regarding U.S. Healthcare's market power based only on the responses of those stores that listed U.S. Healthcare as their primary HMO customer. He testified that based on this survey U.S. Healthcare's market share of prescription drug sales for the market areas served by the two largest Gary's pharmacies and the new Abington pharmacy was approximately 25%. Knowlton further testified that other sources of information indicated that his survey Conclusions as to market share would apply generally in Montgomery County.\n\n3. Interaction Between U.S. Healthcare and Other\n\nPharmacy Operations\n\nThe jury also heard evidence of the interaction between U.S. Healthcare and Rite-Aid, Shop-Rite, Food Circus, Walmart, Phar-mor and Weis Markets. With respect to the pharmacy operation in each of these chains, U.S. Healthcare conditioned participation in the provider network upon their making U.S. Healthcare insurance available to their employees. Despite initial resistance, Rite- Aid, Phar-Mor and Weis Markets ultimately agreed to offer their employees U.S. Healthcare insurance products. There was, however, an absence of supporting evidence on the point, and it is not clear that these large companies made U.S. Healthcare a part of their benefits package in response to economic pressure rather than for legitimate business reasons.\n\nShop-Rite and Food Circus responded by filing complaints with the New Jersey Department of Insurance.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e After the Department of Insurance took action, U.S. Healthcare agreed to accept the stores into its provider network notwithstanding their refusal to offer U.S. Healthcare coverage. The Walmart stores also resisted U.S. Healthcare's policy, choosing instead to forgo membership in the provider network. U.S. Healthcare did approve the Walmart stores in Massachusetts, where an Any Willing Provider statute was in force. Defendants' experts testified that linkage of network membership and purchase of TPA services was normal business behavior and was not anti-competitive.\n\n4. The Setting of Reimbursement Prices\n\nBCI also presented evidence of how U.S. Healthcare exercised its market power to set reimbursement prices. In January 1996, it effected a drastic reduction in the reimbursements it paid to participating pharmacies for prescription drugs dispensed to U.S. Healthcare subscribers. Dr. Knowlton testified that this reduction, when considered with the fact that U.S. Healthcare does not pay pharmacies a dispensing fee, made U.S. Healthcare's overall compensation to pharmacies the lowest of any third- party payor in the southeastern Pennsylvania region. Yet, notwithstanding the major reimbursement price reduction, only two pharmacies out of approximately 8000 in 12 or 13 states discontinued their participation in the U.S. Healthcare provider network.\n\nDr. Knowlton testified that, based on this evidence, and the evidence of U.S. Healthcare's successful dominance of other pharmacies, exclusion from the U.S. Healthcare provider network could threaten Gary's survival. As a result, he testified that Gary's had no choice but to accept U.S. Healthcare's arrangement. E. The Jury Verdict\n\nAfter 17 days of trial, the case was submitted to the jury on special interrogatories. The jury returned a verdict for BCI on all counts and awarded BCI $200,000 in compensatory damages.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The jury also awarded BCI $1,000,000 in punitive damages in connection with its tortious interference claim. That award was apportioned as follows: $400,000 against U.S. Healthcare, $200,000 against CHA, $100,000 against HMO PA, $200,000 against Wolfson, $75,000 against Murphy, and $25,000 against Brownstein.\n\nAt the close of BCI's case, and again at the close of all evidence, the defendants moved, pursuant to Fed. R. Civ. P. 50(a), for judgment as a matter of law. These motions were denied. Following the verdict, defendants renewed their motion for judgment as a matter of law pursuant to Fed. R. Civ. P. 50(b). Concurrently, defendants filed an alternative motion for a new trial pursuant to Fed. R. Civ. P. 59. The district court denied these motions in all respects. On appeal, defendants challenge the denial of these motions. The majority of the issues before us arise from the district court's denial of defendants' renewed motion for judgment as a matter of law, and, as to these issues, our review is plenary. See Stelwagon Mfg. Co. v. Tarmac Roofing, 63 F.3d 1267, 1270-71 (3d Cir. 1995) (\"The legal foundation for the jury's verdict is reviewed de novo while the factual findings are reviewed to determine whether the evidence and justifiable inferences most favorable to the prevailing party afford any rational basis for the verdict.\"). Where a different standard of review is implicated, it will be noted in the text. III. THE ANTITRUST ISSUES\n\nA. Introduction -- Characterization of BCI's Claim\n\nBCI's antitrust claim arises from U.S. Healthcare's decision to use the leverage acquired by virtue of its ability to provide Gary's access to thousands of potential pharmacy customers to pressure Gary's into selection of its subsidiary, CHA, as its TPA. BCI claims that this arrangement was an illegal tie in violation § 1 of the Sherman Act, 15 U.S.C. § 1, which generally outlaws \"[e]very contract . . . in restraint of [interstate or international] trade or commerce.\" Defendants submit that their conduct was simply hard bargaining that is well within the mainstream of business conduct and does not form the basis of a cognizable antitrust claim.\n\nAt trial, BCI's theory of the case prevailed. The jury found that U.S. Healthcare's practices were illegal under both per se and rule of reason theories of antitrust liability. On appeal, defendants challenge the characterization of the arrangement at issue as a tying arrangement. They contend that the arrangement was one of reciprocal dealing and not tying, and that as a result the per se test for antitrust liability is inapplicable. Before turning to a review of the jury verdict, which the defendants challenge, we will consider the characterization question.\n\nTying exists where a seller conditions the sale of one good (the tying product) on the buyer also purchasing another, separate good (the tied product). See Town Sound \u0026 Custom Tops, Inc. v. Chrysler Motors Corp., 959 F.2d 468, 475 (3d Cir. 1992) (in banc). The antitrust concern over tying arrangements arises when the seller can exploit its market power in the tying market to force buyers to purchase the tied product which they otherwise would not, thereby restraining competition in the tied product market.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See Allen-Myland, Inc. v. International Bus. Mach. Corp., 33 F.3d 194, 200 (3d Cir. 1994); Jefferson Parish Hosp. Dist. No. 2 v. Hyde, 466 U.S. 2, 12 (1984).\n\nUnlike tying -- where one party is only a seller and the other only a buyer -- reciprocal dealing exists where \"two parties face each other as both buyer and seller. One party offers to buy the other party's goods, but only if the second party buys other goods from the first party.\" Spartan Grain \u0026 Mill Co. v. Ayers, 581 F.2d 419, 424 (5th Cir. 1978). More colloquially, reciprocal dealing exists when one party tells the other: \"I'll buy from you, if you buy from me.\" Again, like tying, not all reciprocal dealing arrangements are anti- competitive. The Sherman Act is concerned with what has been termed \"coercive\" reciprocal dealing, where a party uses its economic power as a purchaser in one market in order to restrict competition in another market where it is a seller. See Betaseed, Inc. v. U \u0026 I, Inc., 681 F.2d 1203, 1216 (9th Cir. 1982).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nBCI argued, and the jury found, that U.S. Healthcare and CHA tied the purchase of CHA's TPA services to the right to continued participation in the U.S. Healthcare pharmacy network. In order to characterize this arrangement as a tie, U.S. Healthcare must be deemed to have \"sold\" Gary's the ability to participate in its pharmacy network, but only if Gary's also purchased CHA's TPA services. Defendants contend that BCI's characterization is not correct since U.S. Healthcare did not \"sell\" Gary's the ability to participate in the pharmacy network as participation in that network is free. In fact, the ultimate result of the contract was that money flowed in the opposite direction -- from U.S. Healthcare to Gary's in exchange for prescription drugs purchased by U.S. Healthcare members that designated one of Gary's stores as their network pharmacy. Thus, defendants argue, the arrangement is more accurately labeled as reciprocal dealing where U.S. Healthcare conditioned its agreement to purchase prescription drugs from Gary's on Gary's agreement to purchase TPA services from CHA.\n\nWe agree that the arrangement is not tying. While there is force to defendants' broader argument, we do not believe that the relationship between Gary's and U.S. Healthcare can be neatly squeezed into the purchase/sale paradigm. As a result, we are hesitant to conclude that the arrangement was reciprocal dealing, but instead believe that the true character of the arrangement lies somewhere between the two practices. Fortunately, resolution of the antitrust issue presented in this appeal does not require us to wedge the facts into either doctrinal box, for we conclude that there was insufficient evidence to support liability under the Sherman Act regardless of the label placed on the challenged arrangement.\n\nThe law is well developed as to when tying arrangements should give rise to liability under the Sherman Act. Such arrangements can be deemed illegal per se or be found to violate the rule of reason. Per se liability exists where the defendant is found to have appreciable market power in the tying market. In such cases, the ability to leverage this power to restrain trade in the tied market is presumed and no inquiry need be made into the actual prevailing market conditions in that market. See Jefferson Parish, 466 U.S. at 15-18 \u0026 n. 25; Town Sound, 959 F.2d at 477. Where appreciable tying market power cannot be shown, inquiry into the tied product market cannot be avoided, and the plaintiff therefore has the more difficult burden of showing that the arrangement violated the rule of reason because it unreasonably restrained competition in the tied product market. See Jefferson Parish, 466 U.S. at 29.\n\nIn contrast to tying arrangements, reciprocal dealing has not been the subject of extensive case law development. Indeed, this Court has yet to set forth a test for determining\n\nwhen a reciprocal dealing arrangement runs afoul of the Sherman Act.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Defendants seek to persuade us to fill this vacuum by holding that reciprocal dealing arrangements cannot be found illegal per se, but instead should be Judged only under the less rigorous rule of reason test.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e This position has not been adopted by any of our sister circuits. All those that have examined the relationship between tying and reciprocal dealing have determined that each practice should be evaluated under both the per se and rule of reason tests.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThis position is logical since both practices implicate the same antitrust concern -- the unlawful extension of economic power in one market to another market. However, we decline to resolve this conflict here since the amorphous and idiosyncratic nature of this case does not provide an appropriate framework in which to fully flesh out the need for a separate test for reciprocal dealing arrangements. Further, we need not reach this issue in order to resolve the present appeal since we find that BCI failed to set forth either a valid per se or rule of reason antitrust claim -- a finding fatal to both a tying claim and a reciprocal dealing claim under any test we might devise.\n\nB. Per se Liability\n\nSince our jurisprudence regarding both per se and rule of reason liability has developed in the context of tying cases, we will use the terms \"tying\" product market and \"tied\" product market to describe the two markets at issue despite our belief that the arrangement in this case lies somewhere between tying and reciprocal dealing. The per se test is used in cases where exploitation of leverage in the market for the tying product is \"probable\". See Jefferson Parish, 466 U.S. at 15; Town Sound, 959 F.2d. at 476-77. The elements of a per se claim are (1) the defendant seller must sell two distinct products; (2) the seller mu st possess market power in the tying product market; and (3) a substantial amount of interstate commerce must be affected. See id. at 477. Where such elements are shown, the defendant's tying practices are condemned without further proof of anti-competitive effect. See id. Principally at issue in this appeal is whether BCI met its burden of proving the second element of this test: that U.S. Healthcare exercised market power in the tying market.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe jury determined that U.S. Healthcare exercised sufficient market power in the tying market to constitute a per se violation of the Sherman Act. The viability of that finding, however, depends on the correctness of the market definition sent to the jury. Defendants maintain that the definition was incorrect as a matter of law, and that U.S. Healthcare could not exercise sufficient power in a properly defined tying market to sustain a per se claim.\n\n1. Defining the Relevant Market\n\nBefore we can evaluate the extent to which U.S. Healthcare exercises power in the tying market, that market must be properly defined. A market has two components, product and geographic. See Brown Shoe Co. v. United States, 370 U.S. 294, 325-28 (1962). The burden is on the plaintiff to define both components of the relevant market. See Queen City Pizza, Inc. v. Domino's Pizza, Inc., 124 F.3d 430, 436 (3d Cir. 1997); Pastore v. Bell Telephone Co., 24 F.3d 508, 512 (3d Cir. 1994); Tunis Bros Co., Inc. v. Ford Motor Co., 952 F.2d 715, 726 (3d Cir. 1991). The tying market definition asserted by BCI and adopted by the jury was: \"U.S. Healthcare members with prescription drug benefits in the areas surrounding . . . Gary's pharmacies in suburban Philadelphia.\" Defendants contend that this definition contains both a flawed product market -- U.S. Healthcare members with prescription drug benefits-- and a flawed geographic market -- the areas surrounding Gary's pharmacies in suburban Philadelphia. They submit instead that the relevant tying market consists of \"all purchasers of prescription drugs in the greater Philadelphia area.\"\n\nWe agree that BCI failed to meet its burden of presenting sufficient evidence to support the product and geographic markets adopted by the jury. However, while the evidence enables us to determine that the proper product market consists of all purchasers of prescription drugs, it is more difficult to determine the relevant geographic market on the basis of the record. Fortunately, as will be shown, delineation of the exact contours of the geographic market is not necessary to an evaluation of the merit of plaintiff's per se claim. We turn first to the product market issue.\n\na. The Product Market\n\nBCI has posited a single brand market consisting solely of U.S. Healthcare members with prescription drug benefits. Should we accept this market definition our inquiry would be at an end, for U.S. Healthcare must, by definition, control 100% of this product market regardless of the geographic market. BCI seeks to support this product market by arguing that no products are \"reasonably interchangeable\" with U.S. Healthcare members, and that it is compelled by the Supreme Court's decision in Eastman Kodak Co. v. Image Technical Servs., Inc., 504 U.S. 451 (1992). Examining each of these contentions in turn, we conclude that this narrow market definition cannot stand as a matter of law.\n\nThe outer boundaries of a product market are determined by evaluating which products would be reasonably interchangeable by consumers for the same purpose. See Allen-Myland, 33 F.3d at 201 n.8; Town Sound, 959 F.2d at 480. \"Interchangeability implies that one product is roughly equivalent to another for the use to which it is put; while there might be some degree of preference for the one over the other, either would work effectively.\" Allen Myland, 33 F.3d at 206. One measure of interchangeability is \"cross elasticity of demand between the product itself and substitutes for it.\" Queen City Pizza, 124 F.3d at 437 (quoting Brown Shoe Co. v. U.S., 370 U.S. 294, 325 (1962)).\n\nWhen there is cross-elasticity of demand between products in a market, \"the rise in the price of a good within [the] relevant market would tend to create a greater demand for other like goods in that market.\" Tunis Brothers, 952 F.2d at 722.\n\nThus the issue is which products, if any, Gary's, the consumer, would find to be reasonably interchangeable with, or substitutable for, U.S. Healthcare members who purchase prescription drugs. Defendants argue that no evidence in the record contradicts the logical assumption that Gary's considers members of other prescription plans, or uninsured persons, completely interchangeable with U.S. Healthcare members. We agree.\n\nThe only evidence to which BCI directs us to support its argument that there are no products reasonably interchangeable with U.S. Healthcare customers is that when U.S. Healthcare lowered the prices it would pay to pharmacies for the purchase of prescription drugs by U.S. Healthcare members, none of the pharmacies dropped out of the U.S. Healthcare network. BCI asserts that this shows that there is no cross-elasticity of demand between U.S. Healthcare members and other purchasers of prescription drugs since, if there were, then the lowering of prices would have caused pharmacies to stop doing business with U.S. Healthcare customers in favor of other customers who paid more.\n\nThis evidence does not support BCI's market definition. The fact that participating pharmacies do not drop out of the U.S. Healthcare network when it lowers its payment schedule does not prove that U.S. Healthcare's action failed to increase the pharmacies demand for customers who are not members of U.S. Healthcare. Even though pharmacies undoubtedly desire higher profit customers, it would not be necessary for them to drop out of the U.S. Healthcare network in order to pursue, or acquire, these customers. Nor would it be economically rational to do so since pharmacies, like most businesses, seek as many customers as they can find.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Moreover, to the extent that BCI is arguing that U.S. Healthcare customers are not interchangeable with other customers because the market for prescription customers is so competitive that U.S. Healthcare members are difficult to replace, this argument also does not support its product market definition. Product market definition turns on the existence of close substitutes for a particular product, not on the ability of any particular consumer to switch effortlessly to such substitutes. It is true that when Gary's loses a supply of customers it must compete for other customers to make up lost sales; however, this does not mean that those new customers, when found, would not be interchangeable with U.S. Healthcare members from Gary's standpoint.\n\nBCI also seeks to support its single brand market by reference to the Supreme Court's opinion in Kodak. That case, however, is inapposite. In Kodak, independent service organizations brought suit alleging that Kodak had tied replacement parts for its copiers to Kodak repair service. See 504 U.S. at 459. Although Kodak exercised complete control over the market for the tying product -- replacement parts for its copiers -- since they were unique, see id. at 456-57, it argued that it could not, as a matter of law, have sufficient market power in that derivative aftermarket to restrain trade because the primary market for new copiers was competitive. According to Kodak, any attempt to exercise market power in the derivative market for copier parts would raise the \"life cycle\" cost of owning a Kodak copier, and customers would buy fewer Kodak copiers, making the attempt unprofitable. See id. at 470.\n\nThe Supreme Court declined to let Kodak's economic theory prevail on summary judgment, holding that, under certain circumstances, the buyer of a Kodak copier could be \"locked in\" to the Kodak parts market by virtue of the high \"switching costs\" of purchasing a new copier from another manufacturer. See id. at 476. In such a situation, Kodak copier owners would be forced to purchase copier parts from Kodak since there were no reasonable substitutes for such parts. Thus, Kodak establishes that a single brand market may be considered the relevant market where a legitimate class of consumers is locked in to purchasing a non-interchangeable tying product in a derivative market due to high switching costs in the primary market. See Queen City Pizza, 124 F.3d at 439-40.\n\nBCI directs us to no evidence introduced at trial to support a Conclusion that Kodak is applicable to this case. On appeal, they argue that U.S. Healthcare members are \"locked in\" to U.S. Healthcare and, by extension, to the pharmacies in its provider network. We doubt that this argument is factually correct, for we find no evidence suggesting that U.S. Healthcare members who wish to switch HMOs face switching costs significant enough to constitute a lock in. But even if it is, the argument is misplaced since Kodak is concerned with the situation where the victims of the alleged tie -- in that case, the purchasers of Kodak copiers -- are faced with high switching costs and thus are \"locked in\" to the market for the tying product. Under BCI's theory of the case, Gary's is the purchaser of the tying product which is U.S. Healthcare members who purchase prescription drugs. Thus in order to fall within Kodak's concept of lock in, BCI needed to, at a minimum, provide evidence that Gary's -- not U.S. Healthcare members -- was locked into the U.S. Healthcare network. That it did not do.\n\nb. The Geographic Market\n\nBCI proposed a non-contiguous, gerrymandered geographic market consisting solely of the areas surrounding Gary's pharmacies in suburban Philadelphia. To meet its burden of proving the relevant geographic market, see Tunis Brothers Co., 952 F.2d at 726, BCI was required to show that the geographic market it proposed was \"the area in which a potential buyer may rationally look for the goods or services he or she seeks.\" See id.\n\n(quoting Pennsylvania Dental Ass'n v. Medical Serv. Ass'n of Pa., 745 F.2d 248, 260 (3d Cir. 1984)).\n\nThe only evidence that BCI offered to support its geographic market was testimony from Dr. Knowlton that the area from which Gary's stores, or any pharmacies, draw their customers is made up of primary and secondary trading areas surroundings its stores. Knowlton defines a primary trading area is the geographic area surrounding a pharmacy from which it draws 50% of its clientele, and a secondary trading area as the geographic area from which it draws 90% of its clientele.\n\nWe believe that Knowlton is undoubtedly correct to the extent that the jury could reasonably find that pharmacy customers generally use pharmacies near their home. Thus we reject defendants' argument that the relevant geographic market should be the greater Philadelphia area.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e However, mere invocation of the common-sense precept that customers use pharmacies near their homes does not satisfy BCI's burden of showing that the particular geographic market chosen fairly represents \"the area in which a potential buyer may rationally look for the goods or services he or she seeks.\" In this case, where BCI introduced no evidence to support such a Conclusion, an amorphous and gerrymandered geographic market cannot stand as a matter of law. See id. at 727 (\"The mere delineation of a geographical area, without reference to a market as perceived by consumers and suppliers, fails to meet the legal standard necessary for the relevant geographic market.\").\n\n2. U.S. Healthcare's Power in the Tying Market\n\nHaving determined that the market definition adopted by the jury was erroneous as a matter of law, we are now faced with the task of assessing U.S. Healthcare's market power in a properly defined market on the basis of the trial record. Our task is made more difficult by the fact that the record does not contain sufficient evidence to enable us to clearly define the relevant geographic market. In most instances, the proper course in the face of such circumstances would be to remand the case for a new trial; however, our review of the record indicates that it is simply not possible for U.S. Healthcare to have exercised sufficient market power in the properly defined product market to constitute a per se violation in any plausible geographic market.\n\nIn order to impose per se antitrust liability, it must be shown that the defendant had \"appreciable economic power in the tying market.\" Kodak, 504 U.S. at 464 (emphasis added). \"Market power is defined as the ability`to raise prices or to require purchasers to accept burdensome terms that could not be exacted in a completely competitive market.' \" Allen-Myland, 33 F.3d at 200 (quoting United States Steel Corp. v. Fortner Enters., Inc. (Fortner II), 429 U.S. 610, 620 (1977)). Since \"[t]he existence of such power ordinarily is inferred from the seller's possession of a predominant share of the market,\" Kodak, 504 U.S. at 464 (citations omitted), we turn first to an inquiry into U.S. Healthcare's share of the market for drug prescription customers. In so doing, we are mindful of the fact that \"[m]arket share, of course, is only one type of evidence that may prove the defendant has sufficient market power to impose per se antitrust liability.\" Allen-Myland, 33 F.3d at 209.\n\na. Evidence of Market Share\n\nAt trial, BCI's sole evidence of market share derived from a survey conducted by Dr. Knowlton. His survey concluded that U.S. Healthcare members purchased twenty to twenty- five percent of the prescriptions at the surveyed pharmacies. Defendants argue that this market share is insufficient as a matter of law to serve as the basis for a finding of a per se violation. We agree.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The highest\n\n(Text continued on page 36) we conclude that even if the survey were admitted, it would not help BCI, we address the methodological errors that should have barred its admission only briefly.\n\nSurvey results offered as proof of the matter asserted are hearsay, and thus the results of a survey, and any testimony based on those results, cannot be admitted into evidence unless the survey falls into a recognized class exception to the hearsay rule or into the residual exception contained in Fed. R. Evid. 803(24). See Pittsburgh Press Club v. United States, 579 F.2d 751, 755-58 (3d Cir. 1978). In this case none of the class exceptions are present, so we examine whether the survey contains the \"circumstantial guarantees of trustworthiness\" required for admissibility under Rule 803(24).\n\nIn Pittsburgh Press, we stated that \"the circumstantial guarantees of trustworthiness are for the most part satisfied if the poll is conducted in accordance with generally accepted survey principles.\" Id. at 758. We then discussed several factors which must be examined in determining whether a poll meets generally accepted survey principles\n\nA proper universe must be examined and a representative sample must be chosen; the persons conducting the survey must be experts; the data must be properly gathered and accurately reported. It is essential that the sample design, the questionnaires and the manner of interviewing meet the standards of objective surveying and statistical techniques.\n\nId.\n\nThe proponent of the evidence has the burden of establishing these elements of admissibility. See id. In this case, we find that this burden was not met and that the methodology of the survey was so flawed that the district court's decision to admit it was not consistent with the exercise of sound discretion.\n\nKnowlton's survey was designed to determine U.S. Healthcare's market share in the region close to three of Gary's six pharmacy locations. To determine market share, he had pharmacy students call six to eight to pharmacies within varying distances of each of the three pharmacies (resulting in a total universe of twenty pharmacies). The pharmacists at these pharmacies were then asked to name the HMO with which they did the majority of their business, and to report the percentage of their prescription business for which that HMO was responsible.\n\nThis methodology is flawed in several respects. We identify two particularly significant errors. First, the survey questions used were not objective. For example, pharmacists were asked:\n\nestimate of U.S. Healthcare's market share resulting from Knowlton's survey -- which, in addition to the methodological errors set out in note 14, used the improper geographic market discussed at pp. 32-33, (supra) -- was twenty five percent. Even were we to accept this percentage as accurate, it is insufficient in itself to impose per se antitrust liability. See Jefferson Parish, 466 U.S. at 27 (defendant hospital's 30 percent share of market showed that it lacked the \"kind of dominant market position that obviates the need for further inquiry into competitive conditions.\"); see also Times-Picayune Pub. Co. v. United States, 345 U.S. 594, 612-13 (1953) (defendants share of 33-40 percent of advertising market insufficient to invoke per se rule). In fact, since Jefferson Parish no court has inferred substantial market power from a market share below 30 percent. See, e.g. Town Sound, 959 F.2d at 481 (affirming summary judgment for defendant with control of 10-12% of tying product market); Marts v. Xerox, 77 F.3d 1109, 1113 n.6 (8th Cir. 1996) (18% share of one portion of photocopier market too small for unlawful tying); Continental Trend Resources, Inc. v. OXY USA, Inc., 44 F.3d 1465, 1482 (10th Cir. 1995) (affirming grant of summary judgment for defendants where defendants controlled less than 10% of relevant market, since \"plaintiffs failed to establish defendants had sufficient strength in the relevant market.\"), vacated on other grounds and remanded, 116 S. Ct. 1843 (1996); Breaux Bros. Farms, Inc. v. Teche Sugar Co., Inc, 21 F.3d 83, 87-88 (5th Cir. 1994) (17.5 percent share of relevant market for tying product \"is not normally sufficient to satisfy the requirements of the per se rule.\").\n\nBecause U.S. Healthcare's true market share in a properly defined geographic area could be no higher than 25 percent, plaintiff's cannot rely solely on market share to establish a per se antitrust violation.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nb. Other Factors Bearing on Market Power\n\nFactors other than market share can establish that U.S. Healthcare exercised appreciable power in the market for pharmaceutical customers. See Allen-Myland, 33 F.3d at 209. BCI contends that in this case market power can be inferred from the numerosity of the ties imposed by the defendants, and by \"market realities\" which indicate that the figures for prescription drug sales understate the importance of U.S. Healthcare members to a pharmacy's bottom line.\n\nIn order to demonstrate tying market power through evidence of the widespread acceptance of a tie, the plaintiff must show that the tie was accepted by an appreciable number of buyers within that market, and that there is an \"absence of other explanations for the[ir] willingness . . . to purchase the package.\" See Fortner II, 429 U.S. 610, 618 n.10 (1977); see also Grappone, Inc v. Subaru of New England, Inc., 858 F.2d 792, 797-98 (1st Cir. 1988) (widespread acceptance of tie not evidence of market power where there are plausible business reasons for accepting tie). In this case, BCI has failed to meet its burden.\n\nAt trial, the only evidence offered by BCI concerning other ties by defendants was that, with respect to six large chains -- Rite-Aid, Shop-Rite, Food Circus, Walmart, Phar-mor and Weis Markets -- defendants attempted to tie approval of additional pharmacies for participation in the U.S. Healthcare network to each chain agreeing to offer CHA and/or U.S. Healthcare to its employees. Of these purported tying attempts, only three -- those involving Rite- Aid, Phar-Mor and Weis Markets -- were deemed \"successful\" by the plaintiff. However, as we have already observed, BCI failed to demonstrate that these large companies did not base their decision to make U.S. Healthcare a part of their benefits package on plausible business reasons, see (supra) pp. 20-21. Without some such showing, the evidence of other tie-ins is insufficient to constitute proof of appreciable market power.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nBCI also argues that market power can be inferred from the fact that exclusion from the U.S. Healthcare pharmacy network would have a major adverse impact on a pharmacy, to the point of threatening that pharmacy's survival. BCI submits that since the prescription drug business is a low-margin business that depends on high volume, large purchasers such as U.S. Healthcare exert considerable market power. As an example of this market power, BCI again directs us to the evidence that U.S. Healthcare was able to lower its payment schedule to pharmacies without loss of pharmacy participation in its network.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThis argument has two flaws. In the first instance, it proves too much. The evidence at trial showed that Gary's was a member of forty or more networks that provided access to pharmaceutical customers. There is no evidence, and no reason to believe, that the customers that U.S. Healthcare delivers are any more desirable than those delivered by other networks. Thus, if we accept the logic of BCI's argument, each of these networks exercises sufficient market power to violate the per se rule of antitrust liability. Yet, it would pervert the antitrust notion of market power to find that each of over forty organizations, delivering the same product, has sufficient market power over a pharmacy such as Gary's to generate a per se violation of the antitrust laws.\n\nBCI's argument also runs counter to the purpose of the antitrust laws. \"The purpose of the Sherman Act `is not to protect businesses from the working of the market; it is to protect the public from the failure of the market.' \" Queen City Pizza, 124 F.3d at 441 (quoting Spectrum Sports, Inc. v. McQuillan, 506 U.S. 447, 458 (1993)); see also Town Sound, 959 F.2d at 494 (it is \"no concern of the antitrust laws\" that a practice may consign even an entire \"class of competitors . . . to competitive oblivion,\" unless \"consumers [a]re also hurt because of diminished competition.\"); United States v. Syufy Enterprises, 903 F.2d 659, 668 (9th Cir. 1990) (\"[i]t can't be said often enough that the antitrust laws protect competition, not competitors.\"). If we were to accept BCI's argument that a showing of appreciable market power can be based solely on a pharmacy's \"need\" for customers, we would in effect outlaw the agglomeration of pharmacy customers -- a result that provides benefits to individual consumers -- in order to protect pharmacies. This result would stand antitrust jurisprudence on its head, and establish a precedent whereby the antitrust laws would protect competitors rather than competition and consumers. C. The Rule of Reason Claim\n\nThe jury also found that defendants were liable under the rule of reason standard for antitrust violations. Unlike a per se case where a showing that the defendant had market power in the tying market leads to a presumption that it is using that power to expand into the tied market, to succeed on a rule of reason claim the plaintiff must prove that the alleged tie \"unreasonably restrained competition.\" Jefferson Parish, 466 U.S. at 29; see also Town Sound, 959 F.2d at 495 (in order to support a rule of reason claim, plaintiff must prove that the tie in question caused an \"injury to competition\"). This burden \"necessarily involves an inquiry into the actual effect of the [challenged conduct] on competition [in the tied market].\" 466 U.S. at 29.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Before we can determine whether there was harm to competition in the tied market, that market must be defined. BCI had the burden of defining the tied market, but made no attempt to do so at trial. On appeal, BCI contends that the tied market consists of the market for the provision of health insurance and benefits -- a market that includes HMOs and personal choice plans in addition to TPAs. We find no support for this broad market definition. Instead, we believe, on the basis of the record, that the proper tied market consists solely of the market for TPA services. BCI is a TPA provider and the harm alleged to have occurred as result of the tying arrangement took place in the market for TPA services.\n\nIn that market, the only evidence of harm to competition was that BCI failed to renew one contract, its contract with Gary's. That showing is insufficient as a matter of law since it fails to show competitive harm to the tied market as a whole. See Town Sound, 959 F.2d at 493 (requiring foreclosure of a \"substantial portion\" of the tied market to hurt competition.); see also Virtual Maintenance, Inc. v. Prime Computer, Inc., 957 F.2d 1318, 1330 (6th Cir.) (\"[t]he foreclosure of 400 computer systems out of the thousands of systems [in the tied market] is insignificant as a matter of law\"), vacated, 506 U.S. 910 (1992), reinstated in pertinent part, 11 F.3d 660, 663-64 (6th Cir. 1993).\n\nMoreover, even if we accepted the broad market which BCI proposed, it still failed to provide sufficient evidence of competitive harm. The only evidence offered to show that competition was adversely affected in this broad market consisted of the previously mentioned studies of several large pharmacy chains which faced pressure to offer their employees membership in the U.S. Healthcare HMO. These studies do not provide any evidence of market foreclosure or harm to competition since those pharmacies that were \"forced\" to offer their employees U.S. Healthcare coverage did so in addition to, rather than instead of, other health insurance plans. Further, even if this evidence did show harm to competition, BCI has introduced no evidence in which to evaluate the extent to which such foreclosure harmed competition in the broad market for health insurance services generally.\n\nD. Conclusion\n\nSince the record before us does not support a finding that U.S. Healthcare exercised appreciable market power in a properly defined tying market or that the arrangement at issue harmed competition in the tied market, the antitrust jury verdicts on both the per se and the rule of reason claims must be set aside.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIV. CIVIL RICO\n\nA. Introduction\n\nThe jury found that U.S. Healthcare's business practices constituted a pattern of racketeering activity in violation of 18 U.S.C. §§ 1962(c) and (d). Section 1962(c) prohibits any person employed by or associated with an enterprise from conducting or participating in the conduct of that enterprise's affairs through a pattern of racketeering activity. A pattern of racketeering activity \"requires at least two acts of racketeering activity\", 18 U.S.C.§ 1961(5). Racketeering activity is defined as an act or threat chargeable as one of a variety of state felonies or any act which is \"indictable\" under specifically listed federal criminal statutes, see 18 U.S.C. § 1961(A)-(B). Section 1962(d) outlaws any conspiracy to violate the other subsections of § 1962, including, as is relevant to this case, § 1962(c).\n\nU.S. Healthcare challenges the jury verdict on two primary grounds, asserting that (1) BCI failed to establish its standing to recover for any offenses allegedly committed against Gary's; and (2) BCI failed to present a su stainable case that the defendants committed any of the alleged predicate acts. We address each argument in turn.\n\nB. RICO Standing\n\nThe section of RICO allowing private parties such as BCI to pursue a civil action provides that:\n\n[a]ny person injured in his business by reason of a violation of section 1962 of this chapter may sue therefor in any appropriate United States district court and shall recover threefold the damages he sustains and the cost of the suit, including a reasonable attorney's fee.\n\n18 U.S.C. § 1964(c)\n\nThe Supreme Court examined the standing requirement of this statutory provision in Holmes v. Securities Investor Protection Corp., 503 U.S. 258 (1992). The Court noted that Congress modeled § 1964(c) on the Clayton Act, and found that a plaintiff's right to sue under RICO, as under the federal antitrust laws, requires a showing that the alleged violation was the proximate cause of the plaintiff's injury. See id. at 267-68. The Court looked to the common law for guidance in defining the proximate cause requirement. In so doing, it focused primarily on one element of proximate cause: the directness of the relationship \"between the injury asserted and the injurious conduct alleged.\" Id. at 268. This requirement of a direct relation was held to generally preclude recovery by \"a plaintiff who complained of harm flowing merely from the misfortunes visited upon a third person by the defendant's acts.\" Id. at 268-69.\n\nOn the facts presented in Holmes, the Court held that the plaintiff, Securities and Investor Protection Corporation (\"SIPC\"), had not met the proximate cause requirement and thus had no standing to bring suit under RICO . SIPC is a\n\nprivate nonprofit corporation, created pursuant to the Securities Investors Act, which most broker-dealers are required by law to join and which has a statutory duty to advance funds to reimburse the customers of member broker-dealers that are unable to meet their obligations. See id. at 261. SIPC brought a civil RICO action alleging that Holmes, and other former members of a brokerage firm, conspired in a stock manipulation scheme that prevented two broker-dealers from meeting their obligations, thereby requiring SIPC to advance nearly $13 million to cover claims by the customers of the affected broker-dealers. SIPC sought standing under § 1964(c) by arguing, inter alia, that it was subrogated to the rights of those customers of the broker-dealers who did not purchase the manipulated securities but incurred loses when the broker-dealers failed and could no longer meet their obligations. See id. at 270.\n\nThe Court assumed, for the sake of argument, that SIPC was entitled to stand in the shoes of the non-purchasing customers, but held that the defendants' conduct was not the proximate cause of those customers' injuries. The Court held that \"the link is too remote between the stock manipulation alleged and the customers' harm, being purely contingent on the harm suffered by the broker dealers . . . [t]he broker-dealers simply cannot pay their bills, and only that intervening insolvency connects the conspirators' acts to the losses suffered by the non- purchasing customers and general creditors.\" Id. at 271.\n\nDefendants' argue that, under Holmes, BCI lacks standing in this case. They assert that since BCI is alleging that Gary's has been a victim of the RICO predicate acts, BCI exemplifies the \"plaintiff who complain[s] of harm flowing merely from the misfortunes visited upon a third person.\" Id. at 268. We disagree. The injury proved by BCI, the loss of its TPA contract with Gary's, is not derivative of any losses suffered by Gary's. Unlike the injuries suffered by the non-purchasing customers in Holmes, BCI's injury was not contingent upon any injury to Gary's, nor is it more appropriately attributable to an intervening cause that was not a predicate act under RICO. Here, BCI's TPA relationship with Gary's was a direct target of the alleged\n\nscheme -- indeed, interference with that relationship may well be deemed the linchpin of the scheme's success. Accordingly, we conclude that BCI had standing to pursue its civil RICO claim.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nC. Predicate Acts of BCI's RICO Claim\n\nIn its special verdict form, the jury found that each defendant had committed one or more types of the predicate acts of: (1) extortion under the Hobbs Act, 18 U.S.C. § 1951; (2) violation of Pennsylvania's commercial bribery statute, 18 Pa. Cons. Stat. § 4108(b); (3) mail fraud, 18 U.S.C. § 1341; (4) wire fraud, 18 U.S.C. § 1343; and (5) violation of the Travel Act, 18 U.S.C. § 1952. Defendants challenge the verdict on the ground that BCI has failed to prove that defendants' conduct violated any of these laws. Defendants contend that this failure to prove any predicate acts, and a fortiori to show a pattern of racketeering activity, entitles them to judgment as a matter of law on the RICO claims. In their submission, the conduct underlying each of the alleged predicate acts was at its bottom no more than aggressive business bargaining and, just as BCI cannot convert aggressive business tactics into antitrust violations, it cannot shoehorn such tactics into the definitions of the predicate acts at issue here. We shall devote the bulk of our time to the important and difficult issue of whether the defendants' conduct amounted to Hobbs Act extortion. The others alleged predicate acts are disposed of easily .\n\n1. Extortion under the Hobbs Act\n\nThe Hobbs Act imposes criminal penalties on \"[w]hoever in any way or degree obstructs, delays, or affects commerce or the movement of any article or commodity in commerce, by robbery or extortion or attempts or conspires to do so.\" 18 U.S.C. § 1951. \"Extortion\" is defined in the Act as \"the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, or fear, or under color of official right.\" 18 U.S.C. § 1951(b)(2). The term \"fear\" includes the fear of economic loss. See United States v. Addonizio, 451 F.2d 49, 72 (3d Cir. 1972); United States v. Capo, 817 F.2d 947, 951 (2d Cir. 1987) (in banc).\n\nBCI alleges that the defendants extorted Gary's health benefits business by conditioning access to the U.S. Healthcare provider network on Gary's agreement to switch to CHA as its TPA. According to BCI, this conduct amounts to extortion through the wrongful use of the fear of economic loss. Defendants respond that the use of economic leverage in this manner cannot be made tofit within the statutory framework of Hobbs Act extortion. They reason that any fear of economic loss felt by Gary's was the result of the give and take of bargaining between U.S. Healthcare and Gary's in a business setting in which both parties offered and received something of value. They contend that the use of this economic fear to extract concessions from Gary's was not wrongful, as required by the Hobbs Act, but is instead part and parcel of normal business negotiations.\n\nAs will appear, we conclude that plaintiff's theory, which is quite ingenious, does not state a viable claim of extortion because the defendants' use of the fear of economic loss in the context of hard business bargaining was not (legally) wrongful. While this decision may seem compelled by common sense, it is not easily derived from our precedent. This Court has not had prior occasion to address the line separating the legitimate use of economic fear to acquire property in a business setting (i.e., hard bargaining) from the wrongful use of such fear (i.e., extortion). Accordingly, we turn for guidance to the decisions of those few courts that have previously faced the issue. Because it looms so large on the Hobbs Act landscape, we must first, however, consider the Supreme Court's decision in United States v. Enmons, 410 U.S. 396 (1973), which construes the meaning of the term \"wrongful\" under the Act.\n\na. The Definition of \"wrongful\".\n\nIn Enmons, the Court faced the question whether the use of violence in a labor strike to obtain higher wages and other benefits was extortion within the meaning of the Hobbs Act. The Court reviewed the wording of the Act and its legislative history and determined that such conduct was not extortion. In reaching its decision, the Court interpreted the word wrongful, which is not defined in the Act, as follows:\n\nThe term \"wrongful,\" which on the face of the statute modifies the use of each of the enumerated means of obtaining property -- actual or threatened force, violence, or fear -- would be superfluous if it only served to describe the means used. For it would be redundant to speak of \"wrongful violence\" or \"wrongful force\" since, as the government acknowledges, any violence or force to obtain property is \"wrongful.\" Rather, \"wrongful\" has meaning in the Act only if it limits the statute's coverage to those instances where the obtaining of the property would itself be \"wrongful\" because the alleged extortionist has no lawful claim to that property.\n\nId. at 399-400 (emphasis added).\n\nThe ability to defend against an extortion charge based on a lawful claim to the property obtained has been dubbed the \"claim of right\" defense to extortion. See United States v. Agnes, 753 F.2d 293, 298 (3d Cir. 1985). Since Enmons dealt with the use of force to obtain property, and concluded that it was not extortion, read broadly, Enmons could stand for the principle that in all extortion cases, even \"inherently\" wrongful actions such as the use or threatened use of force or violence, do not constitute extortion where the defendant has a lawful claim to the property obtained. This broad application of Enmons, i.e., outside of the labor context, has, however, been uniformly rejected by the courts of appeals out of a fear that it would \"effectively repeal the Hobbs Act.\" See United States v. Cerilli, 603 F.2d 415, 419 (3d Cir. 1979).\n\nThe effort to limit the potential impact of Enmons has led to a line of cases wherein this Court and others have refused to extend the claim of right defense to defendants accused of using actual or threatened force or violence to obtain property outside of the labor context. For example, in United States v. Agnes, supra, the defendant was convicted of extortion for using threats of force and actual violence in seeking property which was arguably his under state law. On appeal, he argued that the district court erred in refusing to allow him to assert a claim of right defense and in failing to properly instruct the jury that it is not wrongful to obtain property to which one has a legal right. See 753 F.2d at 297. We noted that defendant's contentions were predicated on Enmons and held that, contrary to defendant's suggestion, Enmons did not create a general claim of right defense in all cases involving the threatened or actual use of force or violence. Instead we interpreted Enmons to \"create a claim of right defense only in . . . situations [such as those present in Enmons] in which the use of force is expressly identified by Congress as being outside the purview of the Hobbs Act.\" Id. at 299 (emphasis added). Other cases, noted in the margin, have similarly limited the reach of the claim of right defense in cases involving the threatened or actual use of force or violence.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe present case does not fall within this line of cases limiting Enmons since it solely involves the accusation of the wrongful use of the fear of economic loss. Unlike the use or threatened use of force or violence, the use of economic fear in business negotiations between private parties is not \"inherently\" wrongful. See Sturm, 870 F.2d at 773 (citation omitted); United States v. Clemente, 640 F.2d at 1077; Hall Am. Ctr. Assoc. Ltd. Partnership v. Dick, 726 F. Supp. 1083, 1095 (E.D. Mich. 1989). Indeed, the fear of economic loss is a driving force of our economy that plays an important role in many legitimate business transactions. This economic reality leads us to conclude that the reach of the Hobbs Act is limited in cases, such as this one, which involve the use of economic fear in a transaction between two private parties. The limitation we apply is that set forth in Enmons: that a defendant is not guilty of extortion if he has a lawful claim to the property obtained.\n\nWe find support for our Conclusion in the law of other circuits. The Second Circuit recognized the issues and concerns affecting this case in United States v. Capo, 791 F.2d 1054, 1062 (2d Cir. 1986), vacated in part, on other grounds, 817 F.2d 947 (2d Cir. 1987) (in banc), when it stated that:\n\nWe recognize, of course, that fear of economic loss plays a role in many business transactions that are entirely legitimate; awareness of that fear and use of it as leverage in bargaining, in which each side offers the other property, services, or rights it legitimately owns or controls, is not made unlawful by the Hobbs Act. What the Act reaches is not mere hard bargaining but the exploitation of the fear of economic loss in order to obtain property to which the exploiter is not entitled.\n\n(emphasis added).\n\nSee also United States v. Clemente, 640 F.2d at 1076-78 (use of fear of economic loss is wrongful when employed to achieve the wrongful purpose of obtaining property to which one is not entitled).\n\nThe First Circuit has explicitly extended the claim of right defense to cases involving solely the fear of economic harm. See Sturm, 870 F.2d at 773 (\"[F]or purposes of the Hobbs Act, the use of legitimate economic threats to obtain property is wrongful only if the defendant has no claim of right to that property.\"). The position of the First and Second Circuits is mirrored in the federal pattern jury instructions for the Hobbs Act. In those instructions \"wrongful\" is defined as \"mean[ing] that the defendant had no lawful claim or right to the money or the property (he)(she) sought or attempted to obtain\", and district courts are directed that this definition \"should be given only in cases involving a fear of economic loss or in trials concerning the use of violence by union leadership to secure higher wages for the membership as opposed to securing money for themselves.\" E. Devitt et al., Federal Jury Practice and Instructions, Criminal, § 45.08 \u0026 notes (4th ed. 1990). We believe that the position of the First and Second Circuits is sensible, and adopt it here.\n\nb. Lawful Versus Unlawful Claims to Property\n\nOur Conclusion that the defendants are not guilty of extortion if they had a lawful claim to the property obtained from Gary's, while focusing our inquiry, does not resolve the issue before us since the line separating lawful from unlawful claims to property obtained in business negotiations is by no means self evident. Once again, we start with Enmons which, although addressing extortion through force or violence, provides direction as to the distinction between lawful and unlawful claims to property.\n\nThe Court in Enmons, having held that a Hobbs Act conviction could not be predicated on violence related to union activity that was aimed at obtaining property to which the alleged extortionist had a lawful claim, found that the defendants, union members and officials, had a lawful claim to the property -- in the form of wages and other employment benefits -- that they obtained from the employer. The Court found that where violence is employed \"to achieve legitimate union objectives, such as higher wages, in return for genuine services which the employer seeks . . . there has been no `wrongful' taking of the employer's property; he has paid for the services bargained for, and the workers receive the wages to which they are entitled in compensation for their services.\" 410 U.S. at 400. This scenario was distinguished from cases where \"union officials threatened force or violence against an employer in order to obtain personal payoffs, and where unions used the proscribed means to exact `wage' payments in return for `imposed, unwanted, superfluous and fictitious services' of workers.\" Id. In such cases, the union officials would not have a lawful claim to the property obtained, and thus the conduct would fall within the reach of the Hobbs Act.\n\nWe find particularly illuminating the application of Enmons' basic teaching by the District Court for the Southern District of New York in Viacom Int'l v. Icahn, 747 F. Supp. 205 (S.D.N.Y. 1990), aff'd on other grounds, 946 F.2d 998 (2d Cir. 1991), a case involving the allegation of extortion through the wrongful use of the fear of economic loss. In Viacom, the defendants were accused of purchasing substantial stock in the plaintiff company (Viacom) and then coercing the plaintiff to buy its stock back for cash, stock warrants, and free advertising -- all allegedly under a threat of a corporate takeover. In return for the requested \"greenmail,\" the defendants agreed not to buy the plaintiff's stock (or otherwise seek control of the plaintiff) for a period of eleven years. See id. at 207-09. Following this transaction, the plaintiff brought a civil RICO suit alleging, inter alia, that defendants had violated the Hobbs Act by obtaining above-market consideration for their shares from plaintiff with plaintiff's consent, with such consent induced through the wrongful use of economic fear. See id. at 210. On defendants' motion for summary judgment, the court dismissed as a matter of law the allegation that the challenged practice constituted extortion. See id. at 213.\n\nThe court recognized that it was faced with a case in which the alleged extortion victim received something of value -- an eleven-year standstill covenant, 3,498,200 shares of common stock, and, thereby, relief from the threat of a corporate takeover. It then surveyed existing case law in which the victim received something of value in exchange for his property, and found that in these circumstances \"some acts constitute extortion and others are found to be `hard bargaining.' \" Id. at 212-13. The court drew the following distinction between the two:\n\nIn a \"hard bargaining\" scenario the alleged victim has no pre-existing right to pursue his business interests free of the fear he is quelling by receiving value in return for transferring property to the defendant, but in an extortion scenario the alleged victim has a pre- existing entitlement to pursue his business interests free of the fear he is quelling by receiving value in return for transferring property to the defendant.\n\nId. at 213.\n\nApplying this framework, the court used as examples of extortion, the \"personal payoff cases\" addressed in Enmons. In those cases the defendants \"had no lawful claim to the property they received from the victims in exchange for providing the victims with influence and goodwill which quelled the victims fears of harm to their economic interests.\" Id. While the victim received something of value in return for this payment, \"the victim [was] entitled by law to be free of the fear he [was] quelling by giving property to the defendant . . . [and thus] the `something of value' the victim receive[d] [was], as a matter of law, as `imposed, unwanted, superfluous and fictitious' as the hiring of a second worker to do the job that another worker is already doing.\" Id. (citations omitted).\n\nThe court then focused on those cases in which the victim receives something of value yet the conduct is found to be hard bargaining. It drew examples of this conduct from the Second Circuit's opinion in United States v. Capo, 791 F.2d at 1062-63, which stated that:\n\n[a]lthough a job applicant who has long been out of work may have a fear of not obtaining employment that would constitute a fear of economic loss within the meaning of the Act, the Act would not ordinarily reach, for example, the efforts of a prospective employer to bargain down the level of compensation to be paid the applicant. Nor would it reach the normal activities of an employment agency in dealing with the applicant even if, for example the agency required payment from its applicants of some sort of filing fee, service charge, or contingent fee.\n\nIn these cases, the defendant is legally entitled to the property obtained from the victim since he has provided real value in exchange for that property, and the victim has no pre-existing right to be free of the fear he is quelling in return for his payment to the defendant.\n\nA further example of hard bargaining was provided by the facts of Viacom itself. Since the plaintiff had received something of value in return for the property transferred to the defendants, the court looked to whether the law entitled \"Viacom to a right to pursue its business interests free of the problems and fears caused by the threat of a takeover by defendants.\" 747 F. Supp. at 213. The court found that the law granted no such entitlement and thus that any intentional exploitation of fear by defendants was only part of \"hard bargaining\" in a deal which resulted in plaintiff receiving a benefit to which it was not otherwise entitled by law. Accordingly, defendants did not obtain property from plaintiff to which they had no lawful claim and therefore did not commit extortion.\n\nId. at 213-14.\n\nIn the present case, the property that U.S. Healthcare obtained from Gary's was the payments made by Gary's to CHA pursuant to its TPA contract. In return for this property, U.S. Healthcare gave Gary's access to its provider network -- something that is of considerable value to Gary's. Thus, like the court in Viacom, we deal with a very narrow subset of the potential universe of extortion cases: one involving solely the accusation of the wrongful use of economic fear where two private parties have engaged in a mutually beneficial exchange of property. While we believe that the fact-bound nature of this type of case will not supply a generalized precept, we are convinced by the logic of Viacom that BCI's extortion claim can only survive if Gary's had a right to pursue its business interests free of the fear that it would be excluded from the provider network. Albeit with misgivings, we find that it had no such right.\n\nThe chief obstacle to BCI's claim is the fact that Pennsylvania, unlike many other states, has not adopted an \"Any Willing Provider\" law which compels HMOs to allow all interested and minimally qualified providers into their networks. If such a law were in force, then Gary's would have had a legal entitlement to be a member of the provider network and thus to be free of the fear that it would be excluded from that network if it did not switch TPA providers.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e However, in the absence of such a law, Gary's has no right of access to the U.S. Healthcare network and thus U.S. Healthcare could have denied Gary's access to its network for any reason, or for no reason at all. Under these conditions, U.S. Healthcare had the right to exchange the valuable consideration of inclusion in its network in return for consideration from Gary's in the form of its TPA contract. We thus conclude that this case provides an example of hard bargaining rather than extortion.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nBCI raises several arguments in opposition to this conclusion. First, BCI submits that even if Gary's had no right to membership in the provider network per se, it did have a right to compete for membership in that network free from coercion. BCI attempts to ground this right in our holding in Addonizio, supra. In that case, we considered extortion charges based on public corruption in which government officials demanded kickbacks from contractors, suppliers and engineers engaged in public works projects for the city of Newark, New Jersey. In upholding defendants' extortion convictions, we determined that, while the contractors have no right to obtain a contract with the city, they \"have a right to expect that when they incur time and expense to bid on public projects, they will be awarded contracts when their bids are lowest . . . . The City of Newark had systematically destroyed this right.\" 451 F.2d at 73 (emphasis added).\n\nOur holding in Addonizio is distinguishable since it is based on the right of private citizens to compete for government contracts on a level playing field. Such a right is solidly embedded in public policy. See also United States v. Collins, 78 F.3d 1021, 1030 (6th Cir.), cert. denied, ___ U.S.___, 117 S. Ct. 189 (1996) (upholding Hobbs Act conviction of husband of Kentucky Governor charged with soliciting political contributions in exchange for right to contend for state contracts since \"[payors] acted out of fear that without payments they could lose the opportunity to compete for government contracts on a level playingfield, an opportunity to which they were legally entitled.\"). In this case, involving solely private parties, and in the absence of an Any Willing Provider Law, Gary's had no such right to a level playing field.\n\nc. Evidence of Other Unlawful Objectives\n\nBCI also argues that even if U.S. Healthcare did not have the unlawful objective of obtaining property to which it had no lawful claim, it had three other unlawful objectives that convert the economic coercion at issue here into extortion.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThey are (1) violation of Pennsylvania's insurance fraud statute; (2) violation of New Jersey's Any Willing Provider law; and (3) violation of U.S. Healthcare's own internal procedures. Of these three objectives, the jury was only instructed as to BCI's theory that the defendants use of economic fear was wrongful because it had the unlawful objective of violating the Pennsylvania Insurance Fraud statute, and thus we address only that theory in the text.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The other two theories, on which the jury was not instructed, are rejected summarily in the margin.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe Pennsylvania insurance fraud statute provides that:\n\na health care provider may not compensate or give anything of value to a person to recommend or secure the provider's service to or employment by a patient or as a reward for having made a recommendation resulting in the provider's service to or employment by a patient.\n\nBCI's argument that U.S. Healthcare had the unlawful objective of violating its own internal regulations is founded on BCI's assertion that U.S. Healthcare's internal regulations required it to admit into its network all pharmacies whose applications met U.S. Healthcare's admission criteria. BCI's brief, however, does not clearly specify the exact regulation(s) in which such a requirement is contained, and it is not at all clear that such regulations exist. At all events, BCI's claim must fail since, even if U.S. Healthcare's regulations did contain such a requirement, we see no reason why violation of an internal regulation regarding provider admission would be unlawful.\n\n18 Pa. Cons. Stat. Ann. § 4117(b)(2) (Purdon 1997). We disagree with BCI that the jury could reasonably have concluded that U.S. Healthcare's conduct violated this statute. By its terms the statute forbids providers from buying recommendations or referrals of patients, and is thus properly characterized as an \"anti-kickback\" statute directed at providers rather than insurers, such as HMOs. Even if we ignored the statute's clear focus, BCI's contention that U.S. Healthcare violated the statute by referring patients to pharmacies that agreed to give them a benefit fails for two reasons. First, the record does not support an inference that U.S. Healthcare recommended that its members patronize any particular pharmacy in the network. Second, health care providers generally give HMOs something of value (at least in the form of lower prices) in exchange for admission into a network. Thus, if the allegations in this case violated the statute, HMOs might be rendered illegal in Pennsylvania. The Pennsylvania General Assembly could not have so intended.\n\n2. Commercial Bribery\n\nThe Pennsylvania commercial bribery statute states that a \"person who holds himself out to the public as being in the business of making disinterested selection, appraisal, or criticism of commodities or services\" violates the law \"if he solicits, accepts or agrees to accept any benefit to influence his selection, appraisal or criticism.\" 18 Pa. Cons. Stat. Ann. § 4108(b) (Purdon 1983). Thus, in order for the conduct in this case to constitute commercial bribery, BCI would have to prove (1) that U.S. Healthcare held itself out as being in the business of making disinterested selection, appraisal or criticism of health care providers; and (2) that it solicited, accepted, or agreed to accept a benefit to influence that selection, appraisal or criticism.\n\nBCI argues that the jury had sufficient evidence before it from which to conclude that the defendants held themselves out to the public as selecting providers disinterestedly, based solely on the quality of the provider. BCI points to the testimony of defendant Wolfson to the effect that U.S. Healthcare holds itself out as having quality assurance procedures, and to a snippet from U.S. Healthcare's annual report which boasts of U.S. Healthcare's performance monitoring and quality assessment systems for the health care providers in its networks, and which states that the quality assessments systems \"begin with the certification of providers before they can become eligible to care for our members.\"\n\nU.S. Healthcare responds convincingly that this evidence merely documents the reality that provider quality was a necessary, but not always sufficient, criterion for inclusion in its network. The \"bottom line\" is that U.S. Healthcare is not a disinterested appraiser of health care providers; it is an HMO. An HMO is designed to provide access to low-cost, good quality health care, at a profit for the HMO. Thus, while U.S. Healthcare is required by law to allow only qualified providers into its network,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e and chooses its providers from the set of qualified providers, it alone decides whom within that set to admit largely on the basis of a provider's willingness to furnish care at managed care rates. There is nothing disinterested about this process, and we find no evidence to support a finding that U.S. Healthcare represented to the public that the process was, in fact, disinterested.\n\nFinally, we note that the essence of BCI's claim is that U.S. Healthcare used its quality assurance machinery not just to assure quality, but also to coerce Gary's into giving CHA its TPA business. The commercial bribery statute, however, is not concerned with the motive underlying U.S. Healthcare's use of its quality assurance procedures, so long as U.S. Healthcare did not hold itself out as a disinterested appraiser of pharmacies. Thus, while evidence of such coercion provides fodder for BCI's tortious interference claim, see infra, it is misplaced in the context of an argument regarding the carefully circumscribed crime of commercial bribery. In sum, since BCI failed to produce evidence to support a finding that U.S. Healthcare held itself out as a disinterested appraiser of pharmacies, we must set aside the jury's finding that some of the defendants committed commercial bribery.\n\n3. Mail and Wire Fraud\n\nThe federal mail and wire fraud statutes, 18 U.S.C. § 1341 and 18 U.S.C. § 1343, prohibit the use of the mails or interstate wires for the purpose of carrying out any scheme or artifice to defraud. See Kehr Packages, Inc. v. Fidelcor, Inc., 926 F.2d 1406, 1413 (3d Cir. 1991). \"A scheme or artifice to defraud need not be fraudulent on its face, but must involve some sort of fraudulent misrepresentations or omissions reasonably calculated to deceive persons of ordinary prudence and comprehension.\" Id. at 1415 (internal quotations omitted).\n\nBCI contends that there was ample evidence for the jury reasonably to have found that the defendants engaged in a scheme to defraud Gary's concerning the nature and purpose of the quality assurance audit and freeze of the Eagleville store, and the reason for the refusal to process the Abington store application. BCI submits that, whereas the defendants led Gary's to believe that legitimate quality assurance concerns motivated their actions, U.S. Healthcare really intended to use the audit as a means to pressure Gary's into switching to CHA as its TPA. Assuming that BCI is correct regarding U.S. Healthcare's true motivation (and the record supports their view), the failure to disclose this motivation does not create a cognizable \"scheme to defraud\" in the absence of any evidence that this omission was \"reasonably calculated to deceive\" Gary's.\n\nHere, such a Conclusion is not supported by the record evidence, which instead supports the Conclusion that Gary's was well aware of the fact that the audits were motivated either by a desire to retaliate against it for canceling the contract with U.S. Healthcare and switching to a self-insurance program, or by a desire to encourage it to choose CHA as its TPA. Indeed, the thrust of plaintiff's case is that Gary's was so acutely aware of this fact that it felt that it had no choice but to switch TPA providers. Moreover, if U.S. Healthcare's intention was to use the audits as a means of coercing Gary's to switch TPA providers, it would make little sense to conceal this underlying motivation from Gary's.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nAs was the case with BCI's commercial bribery claim, the evidence of defendants' heavy-handed business tactics and, specifically, of their misuse of the quality assurance machinery, while relevant to a tortious interference claim, cannot be made to fit within the statutory and doctrinal constraints of the mail and wire fraud statutes.\n\n4. The Travel Act\n\nTo make out a violation of the Travel Act, 18 U.S.C. § 1952, BCI is required to prove interstate travel or use of an interstate facility with the intent to promote unlawful activity. See United States v. Zolicoffer, 869 F.2d 771, 774 (3d Cir. 1989). \"Unlawful activity\" is \"extortion, bribery, or arson in violation of the laws of the State in which committed or of the United States.\" 18 U.S.C.§ 1952(b)(2). Thus, BCI's Travel Act claim hinges on the success of its Hobbs Act and commercial bribery claims. Since we have determined that the jury's findings of these predicate acts must be set aside, so too must be the finding of a Travel Act violation.\n\nD. Conclusion\n\nHaving found that the BCI did not present a sustainable case that defendants committed any of the alleged predicate acts, we must set aside the verdict that defendants violated 18 U.S.C. § 1962(c) and that they conspired to violate that section as prohibited by 18 U.S.C. § 1962(d).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nV. TORTIOUS INTERFERENCE\n\nIn addition to finding for BCI on its federal law claims, the jury also awarded BCI damages on the theory that defendants unlawfully and improperly interfered with BCI's existing and prospective contractual relations with Gary's.\n\nDefendants challenge this verdict on the ground that, as competitors for Gary's TPA business, they had a privilege to interfere with BCI's terminable at will contract with Gary's so long as they did not employ \"wrongful means\". See Restatement (Second) of Torts § 768(1)(b) (1979).\n\nDefendants contend that BCI made no legally sufficient showing of wrongfulness, and thus that the \"competitors' privilege\" compels entry of judgment in their favor on BCI's tortious interference claim. In the alternative, defendants argue that even if BCI presented a jury question on tortious interference, a new trial is required because of an error in the jury charge.\n\nPennsylvania recognizes both interference with existing contractual relations and interference with prospective contractual relations as branches of the tort of interference with contract. See U.S. Healthcare, Inc. v. Blue Cross of Greater Philadelphia, 898 F.2d 914, 925 (3d Cir. 1990). While the two branches of tortious interference are distinct, they share essentially the same elements. In order to prevail on a claim for intentional interference with contractual or prospective contractual relations, a plaintiff must prove:\n\n(1) the existence of a contractual, or prospective contractual relation between itself and a third party;\n\n(2) purposeful action on the part of the defendant, specifically intended to harm the existing relation, or to prevent the prospective relation from occurring;\n\n(3) The absence of a privilege or justification on the part of the defendant;\n\n(4) the occasioning of actual legal damage as a re sult of the defendants' conduct; and\n\n(5) for prospective contracts, a reasonable likeli hood that the relationship would have occurred but for the interference of the defendant\n\nPelagatti v. Cohen, 536 A.2d 1337, 1343 (Pa. Super. 1988); see also Thompson Coal Co. v. Pike Coal Co., 412 A.2d 466, 471 (Pa. 1979); Birl v. Philadelphia Elec. Co., 167 A.2d 472, 474 (Pa. 1960).\n\nThe defendants assert that BCI failed to present sufficient evidence to satisfy the third element of its claim, which is the absence of privilege or justification on the part of the defendants. In support of this contention the defendants direct us to § 768 of the Restatement (Second) of Torts which sets forth the competitors' privilege. That section provides:\n\n§ 768. Competition as Proper or Improper Interference.\n\n(1) One who intentionally causes a third person no t to enter into a prospective contractual relation with another who is his competitor or not to continue an existing contract terminable at will does not interfere improperly with the other's relation if\n\n(a) the relation concerns a matter involved in the competition between the actor and the other and\n\n(b) the actor does not employ wrongful means and\n\n(c) his action does not create or continue an unla wful restraint of trade and\n\n(d) his purpose is at least in part to advance his interest in competing with the other.\n\n(2) The fact that one is a competitor of another f or the business of a third person does not prevent his causing a breach of an existing contract with the other from being an improper interference if the contract is not terminable at will.\n\nSection 768 has been recognized by Pennsylvania courts, see Gilbert v. Otterson, 550 A.2d 550, 554 (Pa. Super. Ct. 1988); Franklin Music Co. v. American Broadcasting Co.,\n\n63 616 F.2d 528, 543-44 (3d Cir. 1980), which are guided by the Restatement of Torts in the area of tortious interference, see Adler, Barish, Daniels, Levin \u0026 Creskoff v. Epstein, 393 A.2d 1175 (Pa. 1978).\n\nAs a threshold matter, the parties dispute whether BCI's contract with Gary's was prospective or existing, and thus whether defendants can even seek the protection of § 768. BCI contends that, since it had an existing contract with Gary's at the time of defendants' alleged interference, defendants' status as competitors could not make the interference proper. See § 768(2). In response, defendants argue that BCI's contract with Gary's was terminable at will, and thus that the Restatement would characterize it as prospective, see Restatement (Second) of Torts § 766 cmt. g. (\"an interference with [a contract terminable at will] is closely analogous to interference with prospective contractual relations.\"), thereby bringing defendants' behavior within the ambit of § 768(1). While the proper classification of at will contracts in tortious interference case law has been the subject of some controversy, we need not enter this debate here since § 768(1), by its terms, applies to alleged interference with either prospective contractual relations or existing contracts terminable at will. There is no question that BCI's contract with Gary's was terminable at will.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nTurning to the four elements set forth in § 768(1), the parties do not contest that elements (a) and (d) are satisfied. BCI and CHA were competitors for Gary's TPA contract, and defendants had the purpose, at least in part, of advancing their interests through their competition with BCI. We also conclude that to the extent that BCI is arguing that defendants' conduct constituted an unlawful restraint of trade within the meaning of § 768(1)(c), this contention is foreclosed by our reversal of BCI's antitrust claim and BCI's failure to show how defendants conduct violated any other federal or state statutory or common law anti-competitive prohibition. Thus, the question is whether defendants' actions were privileged business competition, which turns on whether they employed \"wrongful means\" of inducement in their efforts to secure Gary's TPA contract. See § 768(1)(b).\n\nThe Pennsylvania Supreme Court has yet to provide a definition of \"wrongful means\", and thus we turn to the Restatement for guidance. In defining what kind of means are wrongful, comment e to § 768 provides, in part, that:\n\nIf the actor employs wrongful means, he is not justified under the rule stated in this Section. The predatory means discussed in § 767, Comment c, physical violence, fraud, civil suits and criminal prosecutions, are all wrongful in the situation covered by this Section.\n\nOther courts, relying partly on this language, have interpreted the wrongful means element of § 768 to require independently actionable conduct on the part of the defendant. See, e.g. DP-Tek, Inc. v. AT\u0026T Global Information Solutions Co., 100 F.3d 828, 833-35 (10th Cir. 1997). Under this standard, wrongful means are those that are themselves capable of forming the basis of liability for the defendant. Id. at 834 (citing Amerinet, Inc. v. Xerox Corp., 972 F.2d 1483 (8th Cir. 1992)). The defendants contend that the Pennsylvania Supreme Court would adopt this construction of wrongful means, and that we must therefore set aside the tortious interference verdict as a matter of law since BCI has failed to identify any basis on which the defendants' conduct could be independently actionable other than the antitrust and RICO theories which we have found to be legally untenable.\n\nThe Disposition of BCI's claim, however, does not require us to determine whether Pennsylvania would limit wrongful means to those that are independently actionable because the allegations of wrongful means in this case differ in one crucial aspect from those in cases such as DP-Tek. Whereas in DP-Tek the defendant was accused of using wrongful means in the market in which it and the plaintiff competed, here BCI has alleged that the defendants employed economic pressure in what we have deemed the market for pharmacy customers (where BCI was not a competitor) in order to force Gary's hand in the TPA market (where BCI and CHA competed). This form of \"competition\" is specifically deemed wrongful by the portion of comment e which directly follows that quoted above. It reads:\n\nThe rule stated in this Section rests on the belief that competition is a necessary or desirable incident of free enterprise. Superiority of power in the matters relating to competition is believed to flow from superiority in efficiency and service. If the actor succeeds in diverting business from his competitor by virtue of superiority in matters relating to their competition, he serves the purposes for which competition is encouraged. If, however, he diverts the competitor's business by exerting a superior power in affairs unrelated to their competition there is no reason to suppose that his success is either due to or will result in superior efficiency or service and thus promote the interest that is the reason for encouraging competition. For this reason economic pressure on the third person in matters unrelated to the business in which the actor and the other compete is treated as an improper interference.\n\n§ 768, cmt. e. (emphasis added)\n\nBased on the this section of comment e, we believe that even if the Pennsylvania Supreme Court were to require independently actionable means, it would not apply that requirement in cases, such as this one, where the defendant exerted \"economic pressure\" or \"a superior power\" in a market unrelated to the competitive market. Cf. DP-Tek, 100 F.2d at 835 n.8 (citing comment e and noting that an exception to the independently actionable conduct requirement may exist \"where a plaintiff proffers evidence that the defendant exerted `a superior power in affairs unrelated' to the business in which they compete.\"). The defendants contend that Pennsylvania, while it has adopted § 768, would ignore this portion of comment e. We disagree, since we see no reason why Pennsylvania would subscribe to the requirements of § 768, but only to selective portions of the comments explaining that section.\n\nBCI proffered ample evidence from which a jury could conclude that U.S. Healthcare attempted to acquire Gary's TPA business by threatening Gary's with withdrawal of its membership in the U.S. Healthcare provider network. BCI also adduced evidence of heavy-handed tactics by U.S. Healthcare in the market for pharmacy customers. As was discussed in the RICO section, a reasonable jury could have found that U.S. Healthcare used its quality assurance machinery not only to assure quality, but also to generate economic pressure on Gary's to switch TPA providers. While we found that this coercive misuse of the quality assurance apparatus was not cognizable as commercial bribery or mail/wire fraud, see supra, it is sufficient, based on comment e, to constitute wrongful means under Pennsylvania tortious interference law.\n\nDefendants seek to avoid the clear application of comment e to their actions by arguing that since both comment e and federal tying/coercive reciprocal dealing jurisprudence are concerned with the extension of economic power from one market to another, the two bodies of law should be read in tandem, and thus that BCI's failure to show that the defendants possessed sufficient market power to violate the Sherman Act should preclude BCI, as a matter of law, from recovering on its tortious interference claim. Put differently, defendants assert that they could not apply \"economic pressure\" on Gary's in the market for pharmaceutical customers since they did not have appreciable market power, under federal law, in that market. We disagree both with the defendants' reading of comment e and with the premise that state tortious interference law and federal antitrust law should be read in pari materia.\n\nDefendants' argument that the federal market power requirement must be grafted onto comment e is predicated on their suggestion that without such a requirement, comment e would render all reciprocal dealing/tying arrangements tortious -- even those that are pro- competitive. (Our reference to pro-competitive tying arrangements is to those that do not violate the Sherman\n\nAct.) Defendants submit that such a result would be contrary to the public policy of Pennsylvania as evidenced by the Commonwealth's failure to pass an Any Willing Provider law. According to the defendants, this failure indicates that Pennsylvania favors selective contracting between HMOs and providers, and thereby approves of the conduct at issue here.\n\nWe decline to read an affirmative policy statement into a legislature's failure to pass a law; to do so would be wholly speculative. But even if defendants are correct that Pennsylvania has a policy of allowing HMOs to decide whom to admit into their networks, it would stretch this policy beyond its logical constraints to find in it tacit approval of the use of threatened exclusion from a pharmacy network to foreclose competition on the merits in an unrelated market.\n\nFurthermore, we do not agree with defendants' reading of comment e. Rather, we read the language requiring the plaintiff to show that the defendant employed \"economic pressure\" and \"a superior power\" in the unrelated market as requiring evidence that the defendant used its economic power in that market to coerce the third party's decision in the competitive market. In order to show coercive pressure, the plaintiff must prove that the defendant exercised some market power in the unrelated market -- lest the third party simply ignore its demands. However, we see no reason why economic coercion cannot be generated by market power that, while not sufficient to violate the Sherman Act, is nonetheless not insignificant, which is the case here.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nViewing the preceding Discussion in a broader context, defendants' contention that comment e should be read to include a federal market power requirement ignores the different purposes and scopes of inquiry of the two bodies of law. In particular, it fails to recognize both the gatekeeping role that the market power requirement plays in federal tying jurisprudence and the quite different policies of state tort law. Federal antitrust law is directed at protecting competition rather than individual competitors, and outlaws only those tying/reciprocal dealing arrangements that substantially foreclose competition in the tied product market. The market power requirement of the per se antitrust jurisprudence serves this goal since it is presumed that where the defendant exercises appreciable market power in the tying product market it can leverage that power to substantially foreclose competition in the tied product market.\n\nThe use of the federal market power screen is, however, inapposite to state tortious interference law which does not predicate liability on a showing that the defendant's conduct had broad anti-competitive effects. Unlike federal antitrust law, state tortious interference law is designed to protect competitors not competition. In this regard, it bases liability for competitors, in part, on the means of competition employed and their effect on a single competitive interaction. This inquiry neither requires, nor is served by, a showing that the defendant exercised appreciable market power.\n\nIn the end, we take a fundamentally different view of BCI's tortious interference claim from that espoused by the defendants. As we noted earlier in this opinion, the crux of defendants' argument is that BCI should not be able to repackage a failed antitrust claim as tortious interference. In our view, BCI has attempted just the opposite. That is, it has taken conduct that constituted tortious interference with contractual relations and attempted to turn it into violations of federal antitrust and racketeering laws. While these attempts have been derailed on this appeal, that result does not foreclose BCI's state tort law claim.\n\nDespite our determination that BCI adduced sufficient evidence at trial to allow a reasonable jury to find that defendants employed wrongful means and thus acted outside the scope of the competitors' privilege, we must reverse the judgment and remand the case for a new trial because of errors in the relevant jury charge. The district court instructed the jury on \"wrongful means\" as follows:\n\nIt is -- wrongful means to take business away from a competitor by using economic power in matters that are unrelated to the business in which the competitors compete. Thus taking away a competitor's business by applying economic pressure in an area that is unrelated to the field in which the parties compete constitutes wrongful means.\n\nWrongful means also include any unlawful conduct in violation of specific statutory provisions or of established public policy.\n\nTo determine whether a defendant's interference was wrongful, you should consider the following factors: first, the nature of the actor's conduct; second, the actor's motive; third, the interests of the other with which the actor's conduct interferes; fourth, the interests sought to be advanced by the actor; fifth, the social interests in protecting the freedom of action of the actor and the contractual interests of the other; sixth, the proximity or remoteness of the actor's conduct to the interference and, seventh, the relations between the parties.\n\nAs set out in the proceeding Discussion, the first paragraph of this instruction, which is derived from comment e to § 768, provides a proper basis on which the jury could have determined that the defendants' conduct was wrongful. However, the second paragraph, while an accurate statement of the law, necessitates a retrial because it invited the jury to import the errors in the antitrust and RICO analysis, as set out supra, into the tortious interference analysis. Indeed, based on the prominent position that BCI's antitrust claim occupied at trial, such infection almost certainly occurred. Faced with this circumstance, the proper course is for us to remand for a new trial rather than attempt to divine the basis of the jury's verdict. See Wilburn v. Maritrans GP, Inc., ___ F.3d ___, 1998 WL 100551, *9 (3d Cir. Mar. 10, 1998) (\"Where a jury has returned a general verdict and one theory of liability is not sustained by the evidence or legally sound, the verdict cannot stand because the court cannot determine whether the jury based its verdict on an improper ground.\"); Avins v. White, 627 F.2d 637, 646 (3d Cir. 1980) (\" `Where . . . a general verdict may rest on either of two claims -- one supported by the evidence and the other not -- a judgment thereon must be reversed.' \") (quoting Albergo v. Reading Co., 372 F.2d 83, 86 (3d Cir. 1967)); see also McKenna v. Pacific Rail Service, 32 F.3d 820, 831-32 (3d Cir. 1994).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nBCI argues that remand is not required since defendants' waived any objection to the jury charge. Their argument has two bases. The first is Fed. R. Civ. P. 51 which requires any objections to the jury charge to be made at the close of the charge. As BCI correctly notes, no such objection was lodged in this case. Despite this failure, we do notfind waiver since we see no basis on which defendants could have objected to this portion of the instruction. As noted, the problem with the court's instruction was not that it misstated the law, but rather that, in correctly stating the law, it created the possibility that errors in the RICO and antitrust verdicts would contaminate the tortious interference verdict. Thus, it was not until our decision on appeal that the tortious interference instructions became erroneous. In such a situation, it would be unfair to visit\n\nDo you find that the plaintiff has proven by a preponderance of the evidence that the following defendants intentionally interfered with the plaintiff's existing or prospective contractual relations.\n\nAs this interrogatory in no way facilitates our inquiry into the basis for the jury verdict, we find that the general rule requiring remand stated in Wilburn and Avins governs.\n\nthe harsh consequence of waiver on the defendants. This conclusion is buttressed by the fact that defendants did object at trial to the jury instructions regarding the alleged antitrust violation.\n\nBCI also contends that since the case was submitted to the jury on special interrogatories, defendants' failure to proffer any interrogatories requiring the jury to specify the basis on which they found defendants conduct to be wrongful resulted in a waiver by defendants of any right they had to a new trial on that basis. This contention is based on Fed. R. Civ. P. 49(a), which governs the use of special verdicts in the federal courts. Specifically, plaintiff relies on that part of Rule 49(a) which provides that if, when submitting special interrogatories to the jury, \"the court omits any issue of fact raised by the pleadings or by the evidence, each party waives the right to a trial by jury of the issue so omitted unless before the jury retires he demands its submission to the jury.\" Fed. R. Civ. P. 49(a).\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nWhile, under Rule 49(a), a court may be deemed to have made a factual finding on an element of an offense that is necessary to sustain a judgment even though the jury did not specifically answer an interrogatory concerning that element, see Watkins v. Fibreboard Corp., 994 F.2d 253, 257-58 (5th Cir. 1993), we do not read this rule, by its terms, as applying to the situation where, as here, the defendants' objection is not based on the fact that the wrongfulness issue was not submitted to the jury, but rather that the court gave a definition of wrongful that has been rendered erroneous by our decision on this appeal.\n\nNor would such an application be in keeping with the purpose of that section of Rule 49(a) that allows the trial court to \"fill in the gaps\" of a special verdict. As noted in Watkins, this ability\n\nis imperative if a special verdict . . . rather than a general verdict is to continue to be employed. Otherwise there would always be the danger that the special verdict would be set aside because the jury had failed to make a particular finding whereas a general verdict could not be challenged on this ground.\n\n994 F.2d at 258 (citing 5A Moore's Federal Practice ¶ 49.03(4) (1993); 9a Charles A. Wright \u0026 Arthur R. Miller, Federal Practice and Procedure § 2507 (1971)). In this case, even had the jury rendered a general verdict, we would be constrained to remand for a new trial based on errors in the charge. Thus, the need to preserve symmetry between the treatment of general and special verdicts would not be served, and would indeed be denigrated, by a finding of waiver predicated on Rule 49(a).\n\nVI. CONCLUSION\n\nFor the foregoing reasons, the judgment of the district court will be reversed and the case remanded with instructions to grant judgment for the defendants' on BCI's antitrust and civil RICO claim, and to conduct a new trial on BCI's claim for tortious interference with contractual relations.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe parties shall bear their own costs.\n\nA True Copy: Teste:\n\nClerk of the United States Court of Appeals for the Third Circuit\n\n\u003cspan class=\"fn\"\u003e* Honorable Edward R. Becker, United States Circuit Judge for the Third Circuit, assumed Chief Judge status on February 1, 1998.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1.. The letter to U.S. Healthcare read: Dear Sirs: This letter is to advise U.S. Healthcare that effective June 30th, 1991, . . . Gary's will discontinue its medical insurance coverage with your organization. Please adjust your records to reflect this upcoming change and advise me of any information you may need to finalize our relationship.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2.. In contrast, Chen testified to the receipt of a polite and professional phone call from a Blue Cross/Blue Shield representative, inquiring if they could accommodate Gary's needs in anyway and as to the reason behind Gary's decision to cancel their health care contract.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3.. When asked by BCI's counsel whether he ordered the review of Gary's in response to Gary's decision to terminate with U.S. Healthcare, Wolfson responded: Well, I didn't think it was appropriate with an account that we had a relationship with just to send a \"dear sir\" letter [of termination] to a post office box . . . . I didn't feel that they were giving us due consideration and if they were operating in that fashion, I wanted to look to see if in fact there were any other issues related to the I Got It At Gary's Pharmacies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4.. The record does not develop the extent to which these complaints may have been facilitated by New Jersey's enactment, in July 1994, of an Any Willing Provider statute which provides that a pharmacy cannot be excluded from an HMO if it \"accepts the terms\" of the HMO. N.J. Stat. Ann. § 26:2J-4.7(a)(2) (West 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5.. The district court's initial order of judgment made it unclear whether BCI was to receive $200,000 in total compensatory damages, or to recover that amount separately on each of its three legal theories (thus allowing a total recovery of $600,000 in compensatory damages). In response to defendants' motion, pursuant to Fed. R. Civ. P. Rule 59(e), to alter or amend the order of judgment, the district court subsequently amended its order to make clear that BCI may recover only once the $200,000 in compensatory damages that it was awarded. BCI does not dispute this point on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6.. Of course, not all tying arrangements have anti-competitive effects in violation of the Sherman Act. The Supreme Court has twice made use of the following as an example of a tie that is not a concern of the antitrust laws: \"[I]f one of a dozen food stores in a community were to refuse to sell flour unless the buyer also took sugar it would hardly tend to restrain competition if its competitors were ready and able to sell flour by itself.\" Jefferson Parish Hosp. Dist. No. 2 v. Hyde, 466 U.S. 2, 12 (1984) (quoting Northern Pac. R. Co. v. United States, 356 U.S. 1 (1958)). Indeed package sales such as those noted in the foregoing example may be used by a seller as a means of competing, and may be desired by buyers. The Sherman Act is not designed to preclude such arrangements. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7.. This is distinguished from \"mutual\" reciprocal dealing which occurs \"when both parties stand on equal footing with respect to purchasing power, yet they agree to purchase from one another.\" Betaseed, 681 F.2d at 1216.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8.. Defendants suggest that we set forth a rule for judging reciprocal dealing arrangements in W.L. Gore \u0026 Assocs., Inc. v. Carlisle Corp., 529 F.2d 614, 624 (3d Cir. 1976) where we stated that: [T]he use of substantial purchasing power in one product market to coerce a supplier into a reciprocating purchase in another market may be an illegal restraint of trade if the user's purchasing power is sufficiently substantial and its use results in substantial foreclosure of competition in the other weaker product market. In Gore, the owner of two patents brought an action for infringement. The defendant's answer denied the validity of the patents, asserted that one of the patents was unenforceable because of fraud in its procurement, and counterclaimed for damages alleging a violation of the Sherman Act. After trial, the district court entered a judgment holding one of the patents valid and infringed and the other patent invalid, granting the plaintiff an injunction restraining the defendant from infringing the valid patent, and determining that plaintiff had violated the Sherman Act. Both parties appealed from the judgment. In determining that we had jurisdiction to review the injunction, we expressly stated that we had no jurisdiction in an interlocutory appeal over the antitrust counterclaim of the defendant. See id. at 618. Thus, the statement in Gore regarding reciprocal dealing was dicta, and does not establish a rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9.. In support of this view, defendants primarily rely on Phillip E. Areeda et al., Antitrust Law, a leading treatise. Areeda argues that \"forced reciprocal exchanges are . . . legally distinct from ties and need not receive the same antitrust treatment.\" X Areeda, Antitrust Law ¶ 1750c, at 268 (1996). He believes that reciprocal trading should not be illegal per se, and that such a claim should instead be Judged solely under the rule of reason test. See Id. ¶ 1778, at 460-61. Professor Areeda's view may be colored by his belief that tying arrangements also should not be illegal per se, a view that is contrary to current law. See IX Areeda, Antitrust Law ¶ 1730, at 406 14 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10.. See, e.g., Betaseed, Inc. v. U\u0026I, Inc., 681 F.2d 1203, 1221 (9th Cir. 1982) (\"The similarity between coercive reciprocity and tying arrangements, both in form and in anti-competitive consequences, leads to the Conclusion that the two practices should be Judged by similar standards.\"); Spartan Grain \u0026 Mill Co. v. Ayers, 581 F.2d 419, 425 (5th Cir. 1978) (holding that label of tying and reciprocal dealing was immaterial, and that the per se standard should be applied in both); E.T. Barwick Indus. v. Walter E. Heller \u0026 Co., 692 F. Supp. 1331 (N.D. Ga. 1987) (same legal standards apply to reciprocal dealing as tying), aff'd 891 F.2d 906 (11th Cir. 1989). See also II Earl W. Kintner, Federal Antitrust Law § 10.67, at 264-65 (1980) (\"[T]he very presence of the element of coercion indicates that such reciprocal dealings are only anti- competitive in effect. It is widely agreed that coercive reciprocality, like tying arrangements, should be considered a per se violation of Section 1 of the Sherman Act.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11.. The other issues have not been briefed by the parties. The third element is plainly not disputed. While arguably there is an implicit challenge to the first element, it would involve the characterization question, and we need not reach it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12.. We assume that membership in the U.S. Healthcare network remained profitable after U.S. Healthcare lowered its payment schedule. To the extent that BCI is arguing that pharmacies stayed in the U.S. Healthcare network despite the fact that it became unprofitable to do so, this argument renders their overall claim a non sequitur. U.S. Healthcare cannot exercise control over pharmacies via access to its network where membership in that network causes pharmacies to lose money.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13.. Defendants rely primarily on evidence that Gary's advertised in the greater Philadelphia area to support their expansive conception of the geographic market. This reliance is misplaced since \"the geographic market is not comprised of the region in which the seller attempts to sell its product, but rather is comprised of the area where his customers would look to buy such a product.\" Tunis Bros., 952 F.2d at 726.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14.. Defendants also argue that the district court abused its discretion in admitting the survey. We also agree with this contention; however, since You provide services for people with prescription cards, like PCS and Paid, et cetera. You also provide services for people on specific HMO plans like Keystone, U.S. Healthcare, et cetera. What's the name of the HMO with which you did the most prescription business . . .? This question improperly slants the response by highlighting respondent to U.S. Healthcare's market presence. People responding to a survey tend to react to the framing of a question. See, e.g. J.R. Eiser, Social Psychology 219-20 (1986). In addition, this question specifically excluded large institutional, non-HMO purchasers of prescription drugs such as PCS and PAID. As a result, it narrowed the product market from \"purchasers of prescription drugs\" to \"HMO purchasers of prescription drugs\". Second, while Knowlton surveyed 20 pharmacies, he only used the data obtained from 14 of those pharmacies in tabulating his results. This decision resulted from the fact that only fourteen of the twenty pharmacies surveyed named U.S. Healthcare as their largest HMO customer. Knowlton simply ignored the other six pharmacies whose data presumably stated a lower estimate of U.S. Healthcare's market share. This type of selective analysis violates the requirement that, in order for survey results to be admissible, the \"data must be properly gathered and accurately reported\". We conclude that the cumulative effect of these, and other, methodological errors render it impossible to say that this survey was \"conducted in accordance with generally accepted survey principles,\" and thus it should not have been admitted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15.. We note that evidence produced at trial showed that 16% of the residents of the greater Philadelphia area belong to a U.S. Healthcare plan. We assume, therefore, that U.S. Healthcare's market share in the relevant geographic market lies somewhere between 16%, its share in an impermissibly broad geographic market, and 25%, its share in an impermissibly narrow one.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16.. We further note that while it is apparent that Rite-Aid, Phar-Mor and Weis Markets are large chains, pharmacies are only a part of their business and BCI has offered no specific evidence that the number of pharmacies affected by the alleged tie-ins constituted \"an appreciable number of buyers within the market.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17.. See (supra) p. 21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18.. BCI contends that by failing to specifically challenge the sufficiency of the evidence of anti-competitive effects in the tied market in their pre- verdict motions for judgment as a matter of law made pursuant to Fed. R. Civ. P. 50(a), defendants waived their right to raise that specific argument in their post-trial Rule 50 motions, or thereafter. In their pre- trial motions, made both at the Conclusion of plaintiff's case and at the conclusion of all evidence, the defendants' challenge to the sufficiency of the evidence on the rule of reason claim read: The evidence is insufficient to support a finding or sustain a verdict that U.S. Healthcare's practices constituted an unreasonable restraint of trade in light of all the circumstances of the case. Plaintiff has offered no such evidence. Under Rule 50(a), a pre-verdict motion for judgment as a matter of law \"shall specify the judgment sought and the law and the facts on which the moving party is entitled to the judgment.\" Further, a post-trial motion for judgment as a matter of law made pursuant to Rule 50(b) \"must be preceded by a Rule 50(a) motion sufficiently specific to afford the party against whom the motion is directed with an opportunity to cure possible defects in proof which otherwise might make its case legally insufficient.\" Lightning Lube, Inc. v. Witco Corp., 4 F.3d 1153, 1173 (3d Cir. 1993) (quoting Acosta v. Honda Motor Co., 717 F.2d 828, 831-32 (3d Cir. 1983)); see also Fineman v. Armstrong World Indus., Inc., 980 F.2d 171, 183-84 (3d Cir. 1992) (compliance with Rule 50(a) \"ensures that the party bearing the burden of proof will have an opportunity to buttress its case before it goes to the jury and the moving party will not gain unfair advantage through surprise.\"). While the text of the Rule 50(a) motion quoted above is far from a model of completeness or clarity, we do not measure its sufficiency by the text alone, but against the background, as reflected in the record, of what the party now claiming waiver understood as to the tenor of the Rule 50 movant's position and theory. See Acosta, 717 F.2d at 832 (\"[T]he communicative content, `specificity' and notice giving function of an assertion [in a rule 50(a) motion] should be Judged in context.\") In Fineman, for example, we held that a general motion for a directed verdict contesting the sufficiency of the evidence with respect to \"coercion\" preserved defendant's challenge to the sufficiency of the evidence with respect to the tortious interference claim, because \"plaintiffs' counsel was clearly on notice of the legal rubric under which [defendants] planned to proceed.\" 980 F.2d at 184. We think that is the case here, and hence find no waiver.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19.. Since we find that the jury verdict must be set aside, we need not address defendants challenge to the rule of reason jury instructions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20.. We note, however, that BCI's RICO standing is limited to injuries arising from its competition with U.S. Healthcare for Gary's TPA business. BCI does not have RICO standing to recover for any injuries suffered by other pharmacies as a result of their relations with U.S. Healthcare since there is no evidence that these relations directly injured BCI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21.. See United States v. Zappola, 677 F.2d 264, 269, 70 (2d Cir. 1982) (Enmons inapplicable where businessmen beat and threatened victim to coerce payment of alleged debt); United States v. Porcaro, 648 F.2d 753, 759-60 (1st. Cir. 1981) (claim of right to property irrelevant where force or threats are used in resolution of contractual dispute); United States v. Kattar, 840 F.2d 118, 123 n.2 (1st Cir. 1988) (\"Except in certain labor contexts . . . using threats of violence to induce the payment of money is unlawful, regardless of the extortionist's possible legal right to the funds at issue.\"); United States v. Sturm, 870 F.2d 769, 772-73 (1st Cir. 1989) (defendants \"claim of right\" to property obtained from victim is proper defense outside of labor context only if defendant did not use \"inherently wrongful\" means such as force or violence to obtain the property); United States v. Warledo, 557 F.2d 721, 729-30 (10th Cir. 1977) (Enmons inapplicable to Indian tribe's threats and violence to pursue allegedly valid claim against railroad); United States v. Cohen, 738 F.2d 287, 289 (8th Cir. 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22.. Indeed, if Pennsylvania had such a law not only might the outcome of this suit, at least as it pertains to the RICO counts, be different, but it is likely that the underlying facts would never have occurred. Those facts, which demonstrate how heavy-handed tactics can be effectively applied by a large corporation (U.S. Healthcare) against a small firm (Gary's) in this context, might suggest to the Pennsylvania General Assembly that it is time to enact an Any Willing Provider law in Pennsylvania.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23.. This is also not a case where U.S. Healthcare exerted monopoly power in the market for pharmaceutical customers. Under such circumstances, the antitrust laws might well confer on Gary's the legal right to be free of the economic coercion arising from U.S. Healthcare's monopoly. However, we are not presented with such a case and thus do not opine on the potential success of such a theory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24.. Since we conclude that each of these allegations of wrongful objectives lacks support, we need not decide whether proof that defendants' possessed one of these objectives would be sufficient to convert U.S. Healthcare's use of the fear of economic loss into extortion where U.S. Healthcare had a lawful right to the property obtained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25.. The district court also instructed the jury that one such unlawful objective would be \"a violation of the Federal antitrust laws.\" In light of the fact that we vacate the antitrust verdict, this instruction alone might compel us to vacate the jury finding with respect to extortion and, indeed, to the whole of the RICO count. However, since we find that both claims fall of their own weight, we need not rely on this flawed jury instruction as grounds for reversal, and thus do not address BCI's contention that U.S. Healthcare waived any objection to the instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26.. BCI's claim that U.S. Healthcare had the unlawful objective of violating the New Jersey Any Willing Provider Law, see N.J.S. 26:2J-4.7(a)(2), fails because BCI has RICO standing only to recover for the loss of its TPA contract with Gary's, all of whose pharmacies are located in Pennsylvania.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27.. See 28 Pa. Code. § 9.71 (1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28.. Further, to the extent that BCI contends that U.S. Healthcare's proffered justification for the audit -- Gary's excessive use of brand name drugs -- was an overt misrepresentation, we disagree. The record shows that Gary's employees conceded that the stated reason was accurate, and that the audit revealed that Gary's was using generic drugs far less than the network average and inadequately documenting decisions not to use them. Our Conclusion does not diminish BCI's claim that the audit was intended to coerce Gary's choice of TPA providers since even a \"legitimate\" audit may, based on timing and other circumstances, have a coercive purpose and effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29.. Defendants have also argued that the aiding and abetting liability imposed on the three U.S. Healthcare executives cannot survive because the statutory analysis applied to securities cases by the Supreme Court in Central Bank of Denver, N.A. v. First Interstate Bank of Denver, N.A., 511 U.S. 164 (1994), if applied to the RICO statute, would eliminate RICO aiding and abetting liability. In view of the dismissal of the RICO claims, that argument need not be reached.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30.. BCI's contract with Gary's provided that\"[e]ither party may terminate this Agreement for any reason or no reason at any time upon thirty (30) days written notice.\" This language clearly marks the contract as terminable at will upon proper notice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31.. We reject defendants' argument that they are entitled to judgment as a matter of law since the only direct evidence that Gary's was coerced consists of hearsay testimony from three BCI employees to whom Gary's Robin Risler indicated that she was forced to fire BCI, and testimony from Sandra Chen that Gary Wolf had indicated to her that he was under pressure to entertain a bid for U.S. Healthcare's TPA service. The district court properly admitted these statements pursuant to Fed. R. Evid. 803(3), the \"state of mind\" exception to the hearsay rule, with the limiting instruction that the jury should not view the testimony as proof of the truth of the underlying facts asserted. Defendants contend that despite this instruction, the jury must have improperly used the testimony as substantive evidence of coercion, because there was no other evidence of coercion. We disagree with this Conclusion and with the defendants' view of the evidence, since we believe that there is ample circumstantial evidence from which a jury could have reasonably inferred that Gary's was coerced. Defendants are, of course, free to argue their view of the evidence on remand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32.. We do not believe that any doubt is cast on the applicability of this general rule by the fact that this case was submitted to the jury on special interrogatories and thus, unlike the cases cited, the jury did not render a general verdict. Our reading of the verdict sheet submitted to the jury in this case indicates that, at least as to the tortious interference count, the verdict rendered by the jury was the functional equivalent of a general verdict. The sole question relating to tortious interference liability posed to the jury was\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33.. Rule 49(a) provides: (a) Special Verdicts. The court may require a jury to return only a special verdict in the form of a special written finding upon each issue of fact. In that event the court may submit to the jury written questions susceptible of categorical or other brief answer or may submit written forms of the several special findings which might properly be made under the pleadings and evidence; or it may use such other method of submitting the issues and requiring the written findings thereon as it deems most appropriate. The court shall give to the jury such explanation and instruction concerning the matter thus submitted as may be necessary to enable the jury to make its findings upon each issue. If in so doing the court omits any issue of fact raised by the pleadings or by the evidence, each party waives the right to a trial by jury of the issue so omitted unless before the jury retires the party demands its submission to the jury. As to an issue omitted without such demand the court may make a finding; or, if it fails to do so, it shall be deemed to have made a finding in accord with the judgment on the special verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34.. On retrial, the jury will have to consider anew whether defendants' behavior was outrageous enough to warrant an award of punitive damages under Pennsylvania law. See Takes v. Metropolitan Edison Co., 655 A.2d 138, 146 (Pa. Super. 1995) (\"[P]unitive damages will lie only in cases of outrageous behavior, where defendant's egregious conduct shows either an evil motive or reckless indifference to the rights of others.\") While the original jury found malice on the part of U.S. Healthcare and its executives, such a finding may not be inevitable at retrial where the jury will not be under the mistaken impression that defendants' conduct violated the Sherman Act, civil RICO, and the statutes underlying the predicate acts of the RICO count. We, of course, intimate no view on that subject.\u003c/span\u003e\n\n",
    "body_length": 153444,
    "citedas": [
      "140 F.3d 494"
    ],
    "attorneys": "David H. Marion, Esquire Francis P. Newell, Esquire Howard J. Bashman, Esquire Patrick T. Ryan, III, Esquire Montgomery, McCracken, Walker \u0026 Rhoads, Llp 123 So. Broad Street Philadelphia, PA 19106 Counsel for Richard Wolfson, Scott Murphy and William Brownstein Patrick W. Kittredge, Esquire Lisa G. Miller, Esquire Kittredge, Donley, Elson, Fullem \u0026 Embick, Llp 421 Chestnut Street, 5th Floor Philadelphia, PA 19109 Robert E. Bloch, Esquire Roy T. Englert, Jr., Esquire (argued) Donald M. Falk, Esquire Robert L. Bronston, Esquire Mayer, Brown \u0026 Platt 2000 Pennsylvania Avenue, NW Washington, DC 20006-1882 Counsel for U.s. Healthcare, Inc., Corporate Health Administrators, United States Health Care Systems of Pennsylvania, Inc. d/b/a The Health Maintenance Organization of Pennsylvania Richard L. Bazelon, Esquire (argued) A. Richard Feldman, Esquire Bazelon \u0026 Lees 1515 Market Street, 7th Floor Philadelphia, PA 19102 Counsel for Brokerage Concepts, Inc.",
    "category": [
      "124",
      "252"
    ],
    "judges": "Before: Becker, Mansmann, and Rosenn, Circuit Judges.",
    "citation_count": 185
  }
}
