{
  "id": "5ZBAQmYBTlTomsSB_l1m",
  "document": {
    "title": "IN RE NATIONAL CREDIT MGMT. GROUP",
    "full_title": "IN RE NATIONAL CREDIT MANAGEMENT GROUP, L.L.C., GLEN BUZZETTI, Individually and as an officer of National Credit Management Group, L.L.C.; and JOSEPH FERGUSON, Individually and as an officer of National Credit Management Group, L.L.C.",
    "jurisdiction": "D. New Jersey",
    "date": "1998-03-25T00:00:00.000Z",
    "docket": "98-936 (AJL)",
    "body": "LECHNER, District Judge\n\nThis is an action brought by plaintiffs the Federal Trade Commission (the \"FTC\") and the New Jersey Attorney General (the \"State of New Jersey\") against defendants National Credit Management Group (\"NCMG\"), d/b/a \"1-800-YES-CREDIT,\" Glen Buzzetti (\"G. Buzzetti\") and Joseph Ferguson (\"Ferguson\") \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" (collectively, the \"Defendants\"). The instant action alleges violations of Section 5(a) (\"Section 5\") of the Federal Trade Commission Act (the \"FTCA\"), 15 U.S.C. § 45(a), the Credit Repair Organization Act (the \"CROA\"), 15 U.S.C. § 1679a et seq., the Telemarketing and Consumer Fraud and Abuse Prevention Action (the \"TCFA\"), 15 U.S.C. § 6101 et seq., the Telemarketing Sales Rule (the \"TSR\"), 16 C.F.R. Part 310 and the New Jersey Consumer Fraud Act (the \"CFA\"), N.J.S.A. 56:8-1 et seq.\n\nOn 3 March 1998, the Plaintiffs filed a complaint. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" Specifically, the Plaintiffs seek, among other things, a permanent injunction enjoining the Defendants from further violations of the aforementioned statutes, appointment of a receiver and an asset freeze which extends to the assets of the Individual Defendants. See Second Consolidated Complaint, PP 140-142, p. 39, PP 3,8; Moving Brief at 37-38. Jurisdiction is alleged pursuant to 28 U.S.C. §§ 1331, 1337(a), 1345 and 1367, and 15 U.S.C. §§ 53(b), \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" 57b, 6102(c), 6103(a), 6105(b), 1679(h)(b) and 1679h(c)(1). See Second Consolidated Complaint, P 4.\n\nCurrently before the court is an order to show cause (the \"Order to Show Cause\") seeking a preliminary injunction \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" filed by the Plaintiffs. For the reasons set forth below, the request for a preliminary injunction is granted. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\"\n\nI. BACKGROUND\n\nA. Procedural History\n\nOn 3 March 1998, the FTC \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" and the State of New Jersey \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" each initiated separate suits and filed separate applications for the issuance of TROs in the instant action. During the 3 March 1998 Hearing, the two cases were consolidated and the Plaintiffs were directed to file a consolidated complaint captioned In Re National Credit Management Group L.L.C., 98-936. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" See Transcript from 3 March 1998 Hearing at p. 4, lines 8-11; p. 30, lines 6-10. The Defendants were initially served with the applications made by both the FTC and the State of New Jersey for TROs on 2 March 1998. See NCMG Chronology at p. 4. At the 3 March 1998 Hearing, a return date was set for 20 March 1998 to allow the Plaintiffs to file a joint brief and the Defendants an opportunity to file opposition. See Transcript 3 March 1998 Hearing at p. 31, lines 15-21. The Plaintiffs also indicated a reply would be filed. See id. at p. 18, lines 17-18.\n\nThe Plaintiffs agreed to treat the instant proceeding and the hearing to be held on 20 March 1998 (the \"20 March 1998 Hearing\") as one for a preliminary injunction. See Transcript from 3 March 1998 Hearing at p. 35, lines 18, 21-22. The parties declined, however, to treat the 20 March 1998 Hearing as a hearing for a permanent injunction. See id. at p. 35, line 6.\n\nAt the 20 March 1998 Hearing, the parties were heard on the issue of whether a preliminary injunction should be issued. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nB. Facts\n\n1. The Defendants\n\nNCMG, which also conducts business under the name of \"1-800-YES-CREDIT,\" advertises credit monitoring and credit card services. See Smith Cert. at P 2; Second Consolidated Complaint, P 8. NCMG was formed as a New Jersey limited liability company by G. Buzzetti and Ferguson in 1995. See Smith Cert. at P 2; see also Certificate of Formation of NCMG attached as Exh. A to Smith Cert. The publically disseminated mailing address for NCMG is 177 Main Street, Suite 230, Fort Lee, New Jersey, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" but NCMG is physically located at 115 River Road, Edgewater, New Jersey. See Smith Cert. at P 2.\n\nG. Buzzetti is the Chief Executive Officer, President and eighty-percent equity owner of NCMG. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" See Smith Cert. at P 8; G. Buzzetti Deposition (the \"G. Buzzetti Dep.\"), dated 17 October 1997, attached as Exh. F. to Smith Cert. at p. 12, lines 5-7. Ferguson is the Chief Financial Officer, Vice President and twenty-percent equity owner of NCMG. See G. Buzzetti Dep. attached as Exh. F. to Smith Cert. at p. 13, lines 6-10; Ferguson Deposition (the \"Ferguson Dep\"), dated 10 October 1997, attached as Exh. E to Smith Cert. at p. 10, lines 3-10. G. Buzzetti and Ferguson have been and are the only two equity members of NCMG. See Smith Cert. at P 8.\n\nBeginning in March 1995, the Defendants offered credit monitoring services to consumers throughout the United States. See Second Consolidated Complaint, P 12. Almost from the start, NCMG used the \"1-800-YES-CREDIT\" toll-free line as the central marketing focus of its business. See Ferguson Dep. attached as Ex. E to Smith Cert. at p. 45, line 21 to p. 46, line 19. The Defendants placed advertisements on cable television and radio for the toll-free telephone number, \"1-800-YES-CREDIT.\" See Second Consolidated Complaint, P 13. These advertisements indicate that if an individual has credit problems he or she should call \"1-800-YES-CREDIT\" to receive a \"confidential analysis\" regarding his or her credit history. See id. Many of these advertisements also promise NCMG provides consumers with a complimentary \"approved\" application for a major credit card without a security deposit. See id.\n\nNCMG receives a daily estimate of 5,000 weekday and 1,500 weekend \"inbound\" telephone calls from consumers responding to its television and radio advertisements. See Smith Cert. at P 13; Ferguson Dep. attached as Exh. E to Smith Decl. at p. 50, lines 2-3 (estimating 6,000 to 7,000 incoming calls daily). NCMG does not engage in \"cold calling.\" See Ferguson Dep. attached Exh. E to Smith Cert. at p. 38, lines 10-12. On average, five to nine percent of consumers calling the toll-free number purchase the initial credit analysis (the \"Initial Analysis\") offered by NCMG for $ 95.00. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 58, lines 1-7. NCMG has approximately 100,000 to 150,000 customers who have either purchased the Initial Analysis or the two-year program (the \"Program\") offered by NCMG to consumers who either desire to establish or re-establish their credit. See Ferguson Dep. attached as Exh. E. to Smith Cert. at p. 64, lines 11-18.\n\nIn its first two years of operations, NCMG grew from having only a few employees to a company with more than 270 employees. See Smith Cert. at P 39; Ferguson Dep. attached as Exh. E to Smith Cert. at p. 19, lines 19-22 and p. 25 lines 13-16. The net revenues of NCMG for the six months ended 30 June 1997 was $ 6,318,975. See Financial Statements attached as Exh. E to Smith Cert. at 3.\n\nSince its inception, the Individual Defendants have participated in and supervised the day-to-day operations of NCMG. See Smith Cert. at P 8; Second Consolidated Complaint, PP 9-10. Both G. Buzzetti and Ferguson help produce the materials used by NCMG and provided to consumers. See Ferguson Dep. attached as Exh. E to Smith Cert. at p. 44, lines 7-8; G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 21, lines 6-18. Ferguson also oversees the computer and telephone systems, as well as the distribution and processing departments. See Ferguson Dep. attached as Exh. E to Smith Cert. at p. 19, line 24 to p. 20, line 18. Additionally, G. Buzzetti supervises the advertising campaigns and the sales staffs of the customer relations and credit analyst departments. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 27, line 6 to p. 28, line 7; p. 34, line 17 to p. 35, line 4. In fact, G. Buzzetti has designed and produced most of the advertisements. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" See id. p.34, line 17 to p. 35, line 24.\n\n2. The Investigations\n\na. The Illinois Investigation\n\nOn 28 January 1996, NCMG was identified as a potential target of an FTC investigation known as \"Operation Payback.\" See Plaintiffs' Chronology at 2. Operation Payback involved a nationwide sweep of credit repair companies. See id. This investigation led to the filing of a complaint in the United States District Court for the Northern District of Illinois against NCMG by the Illinois Attorney General (the \"Illinois Action\"). See id. at 3.\n\nThe Illinois Attorney General asserted claims arising under the TSR, the Illinois Credit Services Act (the \"ICSA\"), which is similar to the CROA, and the Illinois Consumer Fraud Act (the \"ICFA\"). See A. Buzzetti Cert. at P 2. The suit sought to enjoin the collection of fees by NCMG prior to the completion of the two-year program offered by NCMG. See id.\n\nNCMG filed a counterclaim in the Illinois Action alleging that the ICSA, ICFA and the advance-fee restrictions regarding credit improvement services of the TSR violated the First Amendment as applied and on their face. See A. Buzzetti Cert. at P 3; see also Counterclaim attached as Exh. 1 to A. Buzzetti Cert.\n\nThe judge presiding over the Illinois Action requested that the FTC file an amicus brief concerning the constitutionality of the credit repair section of the TSR \"because the pleadings raise serious questions about the constitutionality of [the TSR], 16 CFR § 310.4(a)(2), and the [FTC's] authority to regulate credit repair services absent a clear statement from Congress.\" See A. Buzzetti Cert. at P 4; Order attached as Exh. 2 to A. Buzzetti Cert.\n\nOn 20 March 1997, oral argument was held on this issue. See Plaintiffs' Chronology at p. 3. Thereafter, the Illinois Attorney General entered into a stipulation of dismissal with prejudice as to all claims. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" See A. Buzzetti Cert. at P 7; Stipulation of Dismissal attached as Exh. 5 to A. Buzzetti Cert.\n\nb. The New Jersey Investigations\n\nMeanwhile, on 27 February 1996, the OCP opened a file on NCMG after receiving five consumer complaints. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" See Plaintiffs' Chronology at 5. Investigator Smith was assigned to inquire into the practices of NCMG against which there were twenty consumer complaints as of 10 January 1997. See id. at 6.\n\nAs part of the investigation by the State of New Jersey, subpoenas ad testificandum were issued for Ferguson, Catherine Lucena (\"Lucena\"), Lazarus Manrique, G. Buzzetti, Larry Gilligan, Irene Weekley (\"Weekley\") and Richard Ornitz (\"Ornitz\"). See Plaintiffs' Chronology at 8; Defendants' Chronology at 2-3.\n\nThen, in the Summer of 1997, NCMG was identified as a potential target in a similar, but separate, investigation commenced by the FTC known as \"Operation Eraser.\" See Plaintiffs' Chronology at 4. Operation Eraser was a nationwide sweep of credit repair companies. See id. After conducting an investigation into the practices of NCMG, approval was sought on 30 December 1997 to institute an action against NCMG. See id. at 5. On 25 February 1998, the FTC approved the filing of a complaint on its behalf. See id.\n\n3. The Practices of NCMG\n\nThe nationwide advertisements sponsored by NCMG claim NCMG can assist consumers in obtaining unsecured major credit cards and in establishing or re-establishing credit. The advertisements encourage consumers to telephone \"1-800-YES-CREDIT.\" See Pamela Anderson Decl. at P 2; Brooks Cert. at P 2; Cheek Cert. at P 2; Clark Decl. at P 2; DeFalco Decl. at P 2; Domenico Cert. at P 2; Deshaies Decl. at P 2; Eleby Cert. at P 2; Hunter Cert. at P 2; Johnson Cert. at P 2; Kepshire Decl. at P 2; Leos Decl. at P 2; Lewis Decl. at P 2; Pettit Decl. at P 2; Prine Decl. at P 2; Shuler Decl. at P 3; Struble Cert. at P 2; Stocksill Decl. at P 2; Strait Decl at P 3; Torres Cert. at P 2; Upchurch Decl. at P 3.\n\nAs mentioned, NCMG advertises in the print media as well as on the radio and on television. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 34, lines 9-16. The majority of such advertisements, however, are seen on a cable television channel, the Prevue channel, and promise consumers a \"confidential analysis\" or \"an educational analysis with a trained credit information specialist.\" See Smith Cert. P 10; see also Videotaped copies of televised commercials (the \"Videotape\") included as Exh. AA to Smith Cert. In some advertisements, the spokespersons have stated consumers will receive a complimentary application for an unsecured major credit card with no security deposit. See Second Consolidated Complaint, P 13. The words, \"COMPLIMENTARY MAJOR CREDIT CARD APPLICATION APPROVED,\" appear in large letters. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" See Videotape included as Exh. AA to Smith Cert.\n\nThe advertisements fail to disclose any of the limitations, terms or conditions of the issuers of the credit cards. To the contrary, NCMG advertisements superimpose the word \"APPROVED\" on persons purporting to provide testimonials about how NCMG helped them re-establish their credit. See Smith Cert. at P 11; Videotape included as Exh. AA to Smith Cert. The display of the word \"APPROVED\" and its frequency, size and placement, leads the ordinary consumer to believe NCMG is promising a credit card. See id. at PP 10-11. See, e.g., Deshaies Decl. at P 2; Eleby Cert. at P 2; Johnson Cert. at P 2; Parker Cert. at P 2; Shuler Decl. at P 2; Stocksill Decl. at P 2; Strait Decl. at P 2; Upchurch Decl. at P 2. Disclaimers which are applicable to the cable-advertised services provided by NCMG are illegible because written in small, white print against a strongly colored background. See Videotape included as Exh. AA to Smith Cert.\n\nNCMG represents its credit analysts have earned the designation of \"FCRA Trained and Certified,\" \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" see G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 55, lines 13-21, implying that the credit analysts have participated in some form of training that has governmental approval or authorization. To become \"FCRA Trained and Certified\" a credit analyst must pass the \"Fair Credit Reporting Act Quiz.\" See Letter, dated 14 November 1997, from A. Buzzetti, Esq. attached as Exh. M to Smith Decl. NCMG is the producer and administrator of the \"Fair Credit Reporting Act Quiz\" which consists of twelve multiple choice questions, six true/false questions and two short answer questions. See id.\n\nConsumers who call \"1-800-YES-CREDIT\" reach a NCMG representative who offers consumers the Initial Analysis in exchange for an up-front fee of $ 95.00. See, e.g., Transcript attached to First Gross Decl. at p. 19, line 25 to p. 20, line 2. During this initial phone conversation, NCMG represents the information the consumer is being asked to provide -- name, address, social security number, checking account number, employment and income - is necessary to enable the credit analyst to gather information concerning the credit history of the consumer extending back seven to ten years. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" See Smith Cert. at P 14; Ornitz Dep. attached as Exh. K to Smith Cert. at p. 16, lines 9-19. Representations are also made that the $ 95.00 fee is the charge associated with the accumulation and monitoring of the information contained in the credit profile of the consumer. See Smith Cert. at P 14. NCMG does nothing to dispel the impression the advertisements create that the consumer will receive both an unsecured credit card and a personalized confidential analysis of his or her credit history.\n\nWith respect to the analysis, the telemarketer indicates the consumer will receive personalized attention from \"trained credit analysts who are educated and trained in the credit systems laws ... [and] are able to pinpoint deficiencies in [the consumer's] credit and negative information that can be either erased or modified by law.\" \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Transcript attached to First Gross Cert. at p. 5, lines 1-12. As to the credit card, the telemarketer represents that consumers who qualify for the Initial Analysis have a ninety-five percent success ratio on qualifying for an unsecured major credit card as well. See Smith Cert. at P 21. See, e.g., Transcript attached to First Gross Cert. at p. 6, lines 10-18.\n\nDuring this initial phone call no fees or costs are mentioned other than the $ 95.00 up-front fee. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 90, lines 6-14. See, e.g., Struble Cert. at P 7; Torres Cert. at P 6. Consumers are led to believe there is a genuine selection process by which only some will qualify for the Initial Analysis offered by NCMG. They are also led to believe the payment of the $ 95.00 fee is risk-free because qualifying consumers get the Initial Analysis and non-qualifying consumers can get a refund of the $ 95.00. See, e.g., Transcript attached to First Gross Decl. at p. 6, lines 21-23; Transcript attached to Second Gross Decl. at p. 11, line 23 to p. 12, line 1.\n\nOnce the consumer agrees to the Initial Analysis, the NCMG representative manually turns on a tape recorder connected to the telephone and records a \"verification\" of the verbal authorization of the consumer for NCMG to debit the $ 95.00 fee from the checking account of the consumer. See Smith Cert. at P 19; see also G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 87, line 14 to p. 88, line 1. NCMG also requests the address, social security number of the consumer. No portion of the sales pitch and dialogue with the consumer is recorded and the sales person has exclusive control over when and for how long the tape machine runs. See Smith Cert. at P 19; see also G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 87, line 15 to p. 88, line 23. NCMG failed to produce, in response to the investigative subpoena of the State of New Jersey, the verification tapes for at least one third of the approximately 260 identified consumers. See Smith Cert. at P 29. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nDuring this initial phone conversation, the consumer is told a credit analyst will get back to him or her within two weeks with the results of the Initial Analysis. See, e.g., Transcript attached to Second Gross Decl. at p. 5, lines 22-25. Subsequent to the purchase of the Initial Analysis and prior to the return phone call from a credit analyst, NCMG does not conduct an analysis of the credit history of the consumer nor does it verify through independent sources any of the credit problems the consumer volunteered to the NCMG representative. See Smith Cert. at P 20. Since on or about August 1997 and until recently, NCMG has not even purchased the credit reports of the consumer from any of the major credit reporting bureaus because the cost \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" was deemed uneconomical by G. Buzzetti. See G. Buzzetti Dep. attached as Exh. G to Smith Cert. at p. 8, lines 1-5. The only information NCMG verifies either through its own sources or through independent entities is the accuracy of the checking account routing numbers and the name and address of the owner of the account which is to be used by NCMG to produce \"phone checks\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" that debit the account of the consumer. See Letter of Albert Buzzetti, Esq., attached as Exh. N. to Smith Cert. at 2; G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 59, lines 11-18.\n\nNCMG representatives encourage consumers to call National Business Reporting Bureau (the \"NBRB\") to obtain a report or reference on NCMG. See Transcript attached to First Gross Cert. at p. 24, line 13 to p. 26, line 12. The Defendants equate the NBRB with the Better Business Bureau (the \"BBB\"). See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 16, line 2 to p. 17, line 4. The Defendants imply the NBRB is an independent, third-party reporting organization which provides objective and reliable reports accurately describing the business practices of its members. See id. at p. 24, lines 13-19. Now under a Federal court receivership, the NBRB was in the business of providing references for telemarketers for a fee. See Moscowitz Decl. at P 3(c). As the NBRB told prospective subscribers to its service, it did nothing to screen or qualify its clients. See Attachment B to Moscowitz Cert. at p. 5.\n\nOnce NCMG obtains the checking account information of a particular consumer, the alleged check debiting scheme is set in motion. Many consumers have stated they telephoned NCMG within several minutes to several hours of the initial phone call, informed NCMG that they had changed their minds, and specifically instructed NCMG not to debit their checking accounts. See, e.g., Pettit Cert. at P 4; Stocksill Cert. at P 4; Alston Cert. at p. 2; Torres Cert at P 5. Despite these instructions, NCMG still proceeded and debited the accounts of these consumers. See Pettit Cert. at P 5; Stocksill Cert. at P 5; Alston Cert. at p. 2; Torres Cert at P 7. These consumers were either verbally assured their cancellation request would be honored, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" see, e.g, Pettit Cert. at P 4, Torres Cert. at P 5, or were shuffled from one extension to another, leaving messages that were not returned. See, e.g., Parker Cert. at PP 3-6.\n\nAs indicated, within several days to several weeks after the initial phone call, a credit analyst telephones the consumer. Contrary to what has been promised, however, the credit analyst does not discuss the credit history of the consumer; rather, the purpose of the call is to sell the Program offered by NCMG for prices ranging from several hundred dollars to well over a thousand dollars. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" See, e.g., Lewis Cert. at P 4; Prine Cert. at P 4. If a consumer declines to purchase the Program, the credit analyst insists on mailing the package (the \"Package\") \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" detailing the Program for the consumer to review. See, e.g., DeFalco Cert. at P 4; Strait Cert. at P 3. The credit analyst often fails to inform consumers NCMG will use the previously supplied checking account information to debit the checking account of the consumer unless the consumer exercises his or her right of rescission. The rescission option is not voluntarily disclosed by the credit analyst during this conversation. See Lucena Dep. attached as Exh. H to Smith Cert. at p. 60, lines 2-6. This right of rescission is exercised by returning the Package via \"certified U.S. mail,\" so that it is received by NCMG \"by midnight of the third business day\" including the date of receipt by the consumer. See Ornitz Dep. attached as Exh. K to Smith Cert. at p. 47, line 13 to p. 55, line 10. NCMG indicated its policy is now to provide customers with a five business day right of rescission effective when the materials are postmarked. See G. Buzzetti Cert. at P 26; Ornitz Cert. at PP 6, 25.\n\nIn the instances when a customer declines to purchase the Program, and in attempt to save the sale, NCMG at times sends the customer the Package for his or her review. The consumer accepts the Package thinking he or she is merely receiving promotional materials from NCMG, unaware of the negative option if the Package is not timely returned. The Package includes, inter alia, an introductory letter, a schedule of payments (the \"Schedule of Payments\"), payment terms (the \"Payment Terms\"), a Disclosure Agreement (the \"Disclosure Agreement\") and a guarantee (the \"Guarantee\"). See Package attached as Exh. Q to Smith Cert. The Disclosure Agreement states the verbal authorization of the consumer has been recorded and that it is binding whether or not the consumer signs the Disclosure Agreement. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" See id. at 340. By referring to the consumer as an \"applicant\" and indicating the need for signature, the Disclosure Agreement conveys the impression that the consumer is not bound to purchase the services offered by NCMG unless he or she signs the \"application.\" See Smith Cert. at P 32-33. See, e.g., Torres Cert. at P 9 (indicating she \"never signed the contract that was enclosed in the Package and in fact, returned it unsigned with the other items\"). The signature line was deleted in or about April 1997. See id. at P 32.\n\nThe Package also includes the Schedule of Payments which sets forth the fees associated with the purchase of the Program and which NCMG will automatically debit from the checking account of the consumer. See Schedule of Payments attached as Exh. Q to Smith Cert. at 345. The Disclosure Agreement and the Payment Terms accompanying the Schedule of Payments indicate consumers can exercise their right of rescission in the following manner: \"The Package must be received by NCMG via certified U.S. mail, by midnight of the third business day, from the date you receive the Disclosure Agreement, at our business address. (delivery confirmation recorded).\" Id. at 343; see id. at 341. The Defendants include the date of receipt as the first day in the calculation of the three-day period. See Ornitz Dep. attached as Exh. K to Smith Cert. at p. 54, line 12 to p. 55, line 4. Many consumers do not discover this negative option either until their checking accounts have been debited or until the expiration of the rescission period. For example, Gina DeFalco did not learn of the three-day return requirement until she discovered a $ 400.00 debit on her checking account. See DeFalco at P 5. When she complained, she was told of the three-day requirement. See id.\n\nSome consumers do not receive the Package, but find their accounts debited anyway. See, e.g., Prine Cert. at P 5; Leos Cert. at P 5; Whited Cert. at PP 5, 7. Still others comply with the rescission policy and even telephone NCMG to state the Package is being returned and NCMG should not debit their accounts. See, e.g., Shuler Cert. at P 5; Strait Cert. at P 8. Nevertheless, NCMG debits their accounts. See Shuler Cert. at P 9; Strait Cert. at P 9.\n\nAs indicated, NCMG provides to its customers who purchase the Program, inter alia, the Disclosure Agreement, the Guarantee and the Schedule of Payments. Different versions of these documents have been used but no one at NCMG was able to identify when changes were made. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" See Smith Cert. at P 30; G. Buzzetti Dep. attached as Exh. G to Smith Cert. at p. 30, line 4 to p. 31, line 6; p. 41, lines 10-18. In the Disclosure Agreement apparently used during the majority of the time since NCMG was formed in 1995, there was a signature line for the consumer and a direction in the cover letter that the consumer should sign the Disclosure Agreement and mail it back to NCMG. See Versions of Disclosure Agreement attached to Smith Cert. as Exh's. R (March 1996, April 1996, July 1996 and other months where date is illegible) and S (September 1996). Some consumers who desired to cancel their purchase of the Program before or upon review of the Package believed they could void any contract of sale with NCMG if they refused to sign the Disclosure Agreement. See, e.g., Patricia Anderson Decl. at P 7; Torres Cert. at P 9.\n\nAt least as recently as September 1996, the Guarantee and Payment Terms also displayed a signature line at the bottom of each document with the designation \"Applicant\" and \"Co-Applicant.\" See Payment Terms attached as Exh. S to Smith Cert.; Guarantee attached as Exh. T to Smith Cert. The signature lines were deleted from these forms in or about April 1997. See Smith Cert. at P 32.\n\nThe current version of the Guarantee states: \"If for any reason after completing our ... Program you are not 100% satisfied, [NCMG] will refund your ... Program in full!!! (provided the client meets the terms and conditions set forth in the Disclosure Agreement.)\" Current version of the Guarantee attached as Exhibit Q to Smith Cert. as Attachment One. Immediately below this statement, the Guarantee also states: \"This Guarantee is based on the premise that the client has agreed to maintain a current status on all creditor accounts/bills throughout the terms of the ... Program or Guarantee becomes null and void.\" See id.\n\nNCMG produces certain written documents which it terms \"credit educational materials.\" Some of these materials are sent to consumers who purchase the Program. See Smith Cert., P 28. Apparently, there is one set of materials received by consumers receive who are seeking to establish credit and a slightly different set of materials received by consumers who desire to re-establish credit. See 8 December 1997 A. Buzzetti Letter attached as Exh. Q to Smith Cert.\n\nSeparate and apart from the Package NCMG sends to each consumer who is presumably enrolled in the Program, other materials are available to purchasers of the Program. Customers, however, must specifically ask for these materials which include additional sample letters and booklets. See Smith Cert. at P 39; G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 75, lines 7-21. Credit analysts do not inform consumers during the scripted sales presentation that the Program is almost entirely a self-help program. See Smith Cert. at P 39; Eleby Cert. at P 15; see also Lucena Dep. attached as Exh. H to Smith Cert. at p. 24, lines 9-11.\n\nOn advice of their banking institutions, many consumers have closed their accounts and reopened new ones just to preclude NCMG from gaining access to their bank accounts. See Torres Cert. at P 10. Without taking such action, many consumers faced mounting bank overdraft service charges because the unwanted debits made by NCMG drained their accounts of funds needed for essential bills. See Deshaies Cert. at P 7; Whited Cert. at PP 5-6; Hunter Cert. at P 7; Shuler Decl. at P 9.\n\nThe processing department of NCMG provides the offered \"assistance\" and \"monitoring\" to consumers. There are nine employees in the processing department available to provide credit services to the approximately 200,000 customers of NCMG. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" See Irene Weekley Dep. (the \"Weekly Dep.\") attached as Exh. J to Smith Cert. at p. 14, lines 16-20. This assistance, for the most part, includes forwarding consumers additional materials in the form of more sample letters upon the request and initiative of the consumer. See id. at p. 17, lines 2-20. Weekley, who is the Vice-President of the processing department and who has been with NCMG since March 1995, could not identify any other resources available to the clients of NCMG during the Program except the inventory of sample letter that the processing department provides to consumers upon their request. See Weekley Dep. attached as Exh. J to Smith Cert. at p.17, lines 2-20. It appears the processing department is the only department within NCMG which assembles information for customers who call and request it. See id. at p. 21, lines 6-17.\n\nThe business practices of NCMG stand in contrast to the genuine counseling and debt management services a consumer can receive from a non-profit consumer credit counseling agency, such as Consumer Credit Counseling Services of New Jersey, Inc. (\"CCCS\") for minimal fees. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" See Marabotto Cert.\n\nII. DISCUSSION\n\nInjunctive relief is an extraordinary remedy which should be granted only if a plaintiff produces evidence sufficient to demonstrate the following four factors:\n\n(1) the likelihood that the plaintiff will prevail on the merits at a final hearing;\n\n(2) the extent to which the plaintiff is being irreparably harmed by the conduct complained of;\n\n(3) the extent to which the defendant will suffer irreparable harm if the preliminary injunction is issued; and\n\n(4) the public interest.\n\nSee, e.g., AT \u0026 T Co. v. Winback and Conserve Program, Inc., 42 F.3d 1421, 1427 (3d Cir. 1994), cert. denied, 514 U.S. 1103, 131 L. Ed. 2d 757, 115 S. Ct. 1838 (1995); Gerardi v. Pelullo, 16 F.3d 1363, 1373 (3d Cir. 1994); S \u0026 R Corp. v. Jiffy Lube Int'l, Inc., 968 F.2d 371, 374 (3d Cir. 1992); Opticians Ass'n of Am. v. Independent Opticians of Am., 920 F.2d 187, 191-92 (3d Cir. 1990); Alessi v. Pennsylvania, Dep't of Pub. Welfare, 893 F.2d 1444, 1447 (3d Cir. 1990); Instant Air Freight Co. v. C.F. Air Freight, Inc., 882 F.2d 797, 799 (3d Cir. 1989); Fechter v. HMW Indus., Inc., 879 F.2d 1111, 1116 (3d Cir. 1989); Jews for Jesus v. Brodsky, 1998 U.S. Dist. LEXIS 2962, CIV.A.No. 98-274, 1998 WL 111676, at *5-6 (D.N.J. 6 Mar. 1998); Federal Trade Comm'n v. National Invention Servs., Inc., 1997 U.S. Dist. LEXIS 16777, CIV.A.No. 97-3459, 1997 WL 718492, at *3 (D.N.J. 11 Aug. 1997); Genovese Drug Stores, Inc. v. TGC Stores, Inc., 939 F. Supp. 340, 343 (D.N.J. 1996); United States v. Richlyn Labs., Inc., 827 F. Supp. 1145, 1150 (E.D.Pa. 1992); Apollo Techs. v. Centrosphere Indus., 805 F. Supp. 1157, 1191 (D.N.J. 1992); Glenside West Corp. v. Exxon Co., U.S.A., 761 F. Supp. 1118, 1132 (D.N.J. 1991); CPC Int'l, Inc. v. Caribe Food Distribs., 731 F. Supp. 660, 664 (D.N.J. 1990). The grant or denial of a preliminary injunction lies within \"'the sound discretion of the district judge, who must balance all of these factors in making a decision.'\" FM 103.1, Inc. v. Universal Broad. of N.Y., Inc., 929 F. Supp. 187, 193 (D.N.J. 1996) (citing Kershner v. Mazurkiewicz, 670 F.2d 440, 443 (3d Cir. 1982); Atlantic Coast Demolition v. Board of Chosen Freeholders of Atlantic City., 893 F. Supp. 301, 307 (D.N.J. 1995)).\n\nWhere, however, injunctive relief is sought pursuant to a statutory provision, a different standard is applicable. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" See United States v. Focht, 882 F.2d 55, 57 (3d Cir. 1989); National Invention Servs., 1997 WL 718492, at *3; Waterfront Comm'n of NY Harbor v. Construction and Marine Equip. Co., 928 F. Supp. 1388, 1398 (D.N.J. 1996); Richlyn Labs., 827 F. Supp. at 1150 (citing United States v. Toys \"R\" Us, Inc., 754 F. Supp. 1050, 1053 (D.N.J. 1991)); see also United States v. Roach, 947 F. Supp. 872, 876-877 (E.D.Pa. 1996). \"Indeed, because Congress has seen fit to act in a given area by enacting a statute, irreparable injury must be presumed in a statutory enforcement action.\" Richlyn Labs., 827 F. Supp. at 1150 (citing United States v. Odessa Union Warehouse Co-Op, 833 F.2d 172, 176 (9th Cir. 1987)); see National Invention Servs., 1997 WL 718492, at *3 (implementing the statutory injunction standard when a suit was brought pursuant to Section 5 of the FTCA, one of the same provisions at issue in the instant case); Roach, 947 F. Supp. at 877. The passage of the FTCA, in a sense, results in an implied finding that violations of this statutory enactment will harm the public and should be restrained if necessary. See generally Richlyn Labs., 827 F. Supp. at 1150 (citation omitted).\n\nWhere an injunction is sought pursuant to a statutory provision, the moving party must establish \"probable cause exists to believe that the statute in question is being violated and that there is some reasonable likelihood of future violations.\" Richlyn Labs., 827 F. Supp. at 1150 (citing Instant Air, 882 F.2d 797 at 803; see Focht, 882 F.2d at 57 (citation omitted); Commodity Futures Trading Comm'n v. Hunt, 591 F.2d 1211, 1220 (7th Cir.), cert. denied, 442 U.S. 921, 61 L. Ed. 2d 290, 99 S. Ct. 2848 (1979)); Toys \"R\" Us, 754 F. Supp. at 1053 (citing Focht, 882 F.2d at 57). Additionally, the public interest must be examined. See National Invention Servs., 1997 WL 718492, at *3; Roach, 947 F. Supp. at 877; see also Federal Trade Comm'n v. University Health, Inc., 938 F.2d 1206, 1217 (11th Cir. 1991); World Travel, 861 F.2d at 1029; Federal Trade Comm'n v. Staples, Inc., 970 F. Supp. 1066, 1071 (D.D.C. 1997).\n\nNo immediate or specific showing of the exact way in which violations of the statute will result in public harm is necessary. See Richlyn Labs., 827 F. Supp. at 1150 (citation omitted).\n\nA. Preliminary Injunction\n\nProving a violation of the statute sued upon is akin to the traditional requirement of proving likelihood of success on the merits. To obtain injunctive relief, the Plaintiffs must show by a preponderance of the evidence that the Defendants have committed a violation of the applicable statutes and that such violations will likely occur in the future. See Toys \"R\" Us, 754 F. Supp. at 1058.\n\nIn determining whether a moving party has satisfied its burden of establishing a reasonable likelihood of future violations of the applicable statute in the absence of injunctive relief, the following factors, among others, are considered:\n\n(1) the degree of scienter involved on the part of the defendant;\n\n(2) the isolated or recurrent nature of the infraction;\n\n(3) the defendant's recognition of the wrongful nature of his conduct;\n\n(4) the sincerity of the defendant's assurances against future violations; and\n\n(5) the nature of the defendant's occupation.\n\nRichlyn Labs., 827 F. Supp. at 1150 (quoting Toys \"R\" Us, 754 F. Supp. at 1058-59); see Securities and Exchange Comm'n v. Bonastia, 614 F.2d 908, 912 (3d Cir. 1980).\n\nAdditionally, it is important to consider the voluntary cessation by a defendant of challenged practices, the genuineness of the efforts of a defendant to conform to the applicable laws, the progress of a defendant towards improvement and compliance by a defendant with any recommendations made by the Government. See Richlyn Labs., 827 F. Supp. at 1150; Toys \"R\" Us, 754 F. Supp. at 1058-1059 (citing, inter alia, City of Mesquite v. Aladdin's Castle, Inc., 455 U.S. 283, 289, 71 L. Ed. 2d 152, 102 S. Ct. 1070 (1982); Odessa Union Warehouse Co-Op, 833 F.2d at 176)).\n\nMoreover, while past misconduct does not automatically lead to the conclusion that there is a reasonable likelihood of future violations, \"it is highly suggestive of the likelihood of future violations and the court should therefore look at the totality of the circumstances and any factors suggesting that the infraction might not have been an isolated occurrence.\" Richlyn Labs., 827 F. Supp. at 1150 (citing Hunt, 591 F.2d at 1220); see Toys \"R\" Us, 754 F. Supp. at 1059 (\"Essentially, the court must make a prediction of the likelihood of future violations based upon an assessment of the totality of the circumstances surrounding the violator and the violations that were committed.\").\n\n1. Section 5 of the FTC30\n\na. Violations of Section 5\n\nSection 5 of the FTCA states: \"Unfair methods of competition in or affecting commerce, and unfair or deceptive acts or practices in or affecting commere, are declared unlawful.\" Id.; World Travel, 861 F.2d at 1029. In order to establish an act or practice as deceptive, the FTC must demonstrate that the representations, omissions or practices likely would mislead consumers acting reasonably under the circumstances. See National Invention Servs., 1997 WL 718492, at *4; World Travel, 861 F.2d at 1029; Federal Trade Comm'n v. Wilcox, 926 F. Supp. 1091, 1098 (S.D.Fla. 1995) (citing, inter alia, World Travel Vacation Brokers, 861 F.2d at 1029); Federal Trade Comm'n v. American Standard Credit Sys., 874 F. Supp. 1080, 1087 (C.D.Cal. 1994) (citations omitted). Additionally, \"misrepresentations of material facts made for the purpose of inducing consumers to purchase services constitute unfair or deceptive acts or practices forbidden by Section 5(a).\" World Travel, 861 F.2d at 1029 (quotation omitted). Explicit claims or deliberately-made implicit claims utilized to induce the purchase of a service or product are presumed to be material. See Wilcox, 926 F. Supp. at 1098 (citations omitted).\n\nTo be actionable under Section 5, a defendant need not have engaged in the practices or made the misrepresentations with an intent to deceive. See World Travel, 861 F.2d at 1029 (citing Beneficial Corp. v. Federal Trade Comm'n, 542 F.2d 611, 617 (3d Cir. 1976), cert. denied, 430 U.S. 983, 52 L. Ed. 2d 377, 97 S. Ct. 1679 (1977)); Wilcox, 926 F. Supp. at 1098 (quoting Regina Corp. v. Federal Trade Comm'n, 322 F.2d 765, 768 (3rd Cir. 1963) (\"Deception may be accomplished by innuendo rather than by outright false statements....\")). \"An advertiser's good faith does not immunize it from responsibility for its misrepresentations....\" World Travel, 861 F.2d at 1029 (quotation omitted). Furthermore, the omission of material information, even if an advertisement does not include falsehoods, may result in a violation of Section 5. See id. (citations omitted).\n\nThe FTC argues the Defendants have misrepresented (1) NCMG will provide a \"personal credit analysis,\" (2) the customers of NCMG receive a pre-approved credit card, and (3) NBRB is an independent consumer reporting agency. See Moving Brief at 12. In response, the Defendants argue contested factual and legal issues preclude a finding of likelihood of success in proving a violation of Section 5 and that NCMG does not engage in an \"unconscionable commercial practice\" prohibited by Federal law. See Opposition at 15.\n\nIn determining if deceptive claims pursuant to Section 5 are present, a court is not limited to express claims, but may also look to the overall net impression conveyed by the advertising and promotional statements of a defendant. See Kraft, Inc. v. Federal Trade Comm'n, 970 F.2d 311, 314 (7th Cir. 1992), cert. denied, 507 U.S. 909, 122 L. Ed. 2d 652, 113 S. Ct. 1254 (1993); Federal Trade Comm'n v. U.S. Sales Corp., 785 F. Supp. 737, 751 (N.D.Ill. 1992); Beneficial Corp., 542 F.2d at 617. In Beneficial Corp. the Circuit explained the rationale for the net impression rule:\n\nThe parties agree that the tendency of the advertising to deceive must be judged by viewing it as a whole, without emphasizing isolated words or phrases apart from their context. An intent to deceive is not an element of a deceptive advertising charge under [Section] 5.... Whether particular advertising has a tendency to deceive or mislead is obviously an impressionistic determination more closely akin to a finding of fact than to a conclusion of law.\n\nId. at 617 (citation omitted); see also American Home Prods. Corp., 695 F.2d at 688.\n\nTo establish a violation of Section 5(a), the FTC must show \"1) ... a reasonably prudent person would rely on the allegedly deceptive advertisements, 2) ... the advertisements were widely disseminated, and 3) ... consumers purchased the product.\" FTC v. World Travel, 861 F.2d 1020, 1029 (7th Cir. 1988); see Wilcox, 926 F. Supp. at 1098. Once the FTC has satisfied its burden, a defendant, to avoid liability, must establish that consumers did not rely on the representations or that such reliance was unreasonable. See World Travel, 861 F.2d at 1029.\n\nThe second and third criteria can be disposed of easily in the instant matter. NCMG advertises its credit services on television and radio for its toll-free telephone number, \"1-800-YES-CREDIT.\" See Second Consolidated Complaint, P 13. Considering NCMG does not engage in \"cold-calling\" and receives 5,000 weekday and 1,500 weekend \"inbound\" telephone calls from consumers responding to its advertisements, its advertisements are widely disseminated. Moreover, the numerous consumer certifications submitted in support of the allegations of the Plaintiffs identifies a group of consumers who have seen or heard the adds for NCMG and have purchased the Initial Analysis and possibly the Program. Accordingly, the remaining element which must be determined is whether the advertisements are deceptive.\n\ni. NCMG will provide a \"personal credit analysis\"\n\nThe FTC contends the Defendants misrepresent that consumers who pay $ 95.00 will receive a \"personal credit analysis\" from a \"trained credit analysis\" who will provide consumers with \"information with respect to [a consumer's] profile so that [he or she] may attempt to establish and/or re-establish ... credit.\" See Moving Brief at 13 (quoting Transcript attached to Second Gross Cert. at p. 5, line 23 to p. 6, line 1). The FTC argues consumers do not receive such a personal analysis but, rather, \"a sales pitch from a telemarketer attempting to sell the 'education materials'\" offered by NCMG. See id. Moreover, the FTC argues consumers who purchase these \"educational materials\" are unable to obtain assistance despite numerous telephone calls to NCMG credit analysts. See id. (citing Pamela Anderson Cert. at P 11; Cheek Cert. at P 7).\n\nWithout specifically addressing this claim, the Defendants contend the allegations asserted in the Second Consolidated Complaint are based upon stale information and do not address the current conduct of NCMG. See Opposition at 4. The Defendants contend NCMG materials \"provide a valuable educational resource to persons who are in need of information on how to navigate through the maze of the nation's credit laws and practices.\" Id. at 16 (citing Szwak Cert. at P 14).\n\nThe Wilcox case is instructive in the instant matter. In Wilcox, the FTC brought an action seeking permanent injunctive relief and other equitable relief against defendants who were engaged in the direct mail business. See 926 F. Supp. at 1096. The FTC argued the solicitations by and the awards promised to consumers who purchased the items offered by the defendants created a false or misleading impression causing consumers to believe they could claim valuable merchandise or substantial amounts of money by forwarding a nominal fee to the defendants. See id. at 1098. In actuality, consumers responding to the solicitations received little or nothing in return. See id.\n\nThe Wilcox court found these practices to be deceptive. See 926 F. Supp. at 1099. The court observed that customers never received the \"guaranteed award\" promised in the solicitations. See id. Moreover, the court rejected the arguments by defendants that the number of consumer declarations and consumer complaints constituted such a small percentage of their total mailings that they were insufficient to prove the solicitations violated Section 5. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" See id.\n\nIn determining the practices of the defendants violated Section 5, the Wilcox court quoted U.S. Sales Corp. which stated:\n\nThe FTC needs only to show that a reasonable consumer, upon hearing the advertisement, likely would be misled to his detriment. In other words, the FTC is only required to show that it is likely, not that it is certain, that a reasonable consumer would be mislead. Accordingly, the FTC does not need to show that every reasonable consumer would be mislead by the advertisements....\n\n926 F. Supp. at 1099 (quoting U.S. Sales Corp., 785 F. Supp. at 748) (citations omitted).\n\nAlso, in American Standard Credit Sys. the FTC brought an action against a marketer and its individual officers for deceptive practices and misrepresentation in the marketing of a secured bank credit card in violation of Section 5. See 874 F. Supp. at 1082. The advertisements used by the defendants indicated anyone could qualify for this secured credit card which could be obtained by calling a \"900\" pay-per-call telephone number. See id. at 1084, 1085. Everyone did not qualify for this credit card. See id. at 1085. Certain credit granting criteria needed to be met before a credit card would be issued. See id. Furthermore, the defendants failed to disclose additional costs and conditions were associated with the issuance of these credit cards. See id. Based upon this information, the FTC argued the defendants were liable for deceptive practices and acts under Section 5. See id.\n\nThe defendants in American Standard Credit Sys. argued the FTC was only empowered to enjoin current unlawful practices and prevent their recurrence in the future. See 874 F. Supp. at 1086-87. The defendants contended the pay-per-call advertising practices sought to be enjoined by the FTC had since been prohibited by VISA and MASTERCARD and the method was no longer being used by the defendants. See id. at 1087. Accordingly, the defendants argued the FTC had no power to enjoin the defendants from engaging in such methods. See id.\n\nThe American Standard Credit Sys. court observed:\n\nIt is settled that an action for an injunction does not become moot merely because the conduct complained of was terminated, if there is a possibility of recurrence, since otherwise the defendants \"would be free to return to\" [their] old ways.\n\n874 F. Supp. at 1087 (quoting Allee v. Medrano, 416 U.S. 802, 811, 40 L. Ed. 2d 566, 94 S. Ct. 2191 (1974)); see Wilcox, 926 F. Supp. at 1099. The court opined the failure of the defendants to demonstrate there was no possibility the alleged offending conduct would recur made the fact that the defendants had terminated their behavior irrelevant. See American Standard Credit Sys., 874 F. Supp. at 1087.\n\nAmerican Standard Credit Sys. is analogous to the instant case. The \"personal credit analysis\" promised in the advertisements produced by NCMG, before the recently implemented policy of obtaining the credit reports of the consumer, involved nothing more than providing information about the Federal Fair Credit Reporting Act and the Equal Credit Opportunity Act. Moreover, the Initial Analysis served as the vehicle used by NCMG to sell the Program. The practices engaged in by NCMG did not provide a consumer with \"information with respect to [his or her] profile.\" See, e.g., Transcript attached to Second Gross Cert. at p. 5, lines 23-25. The promised \"personal credit analysis\" likely mislead consumers acting reasonably under the circumstances. This misrepresentation is material because it is likely many consumers would not have telephoned the toll-free telephone number, \"1-800-YES-CREDIT,\" had they known payment of the $ 95.00 fee would not entitle them to a \"personal credit analysis.\" It is also likely consumers would not have paid $ 95.00 to be subjected to the hard sell tactics of the NCMG telemarketers, whose livelihood was based entirely upon commissions generated from sales of the heavily pushed Program.\n\nAs indicated, the Defendants contend the modifications recently implemented, namely the action of NCMG to now obtain credit reports on customers, make the allegations in the Second Consolidated Complaint stale. It is noteworthy, however, after having previously determined obtaining copies of credit reports of consumers who order the initial analysis was too costly and unnecessary, see G. Buzzetti Dep. at p. 61, lines 5-18, NCMG has only recently started obtaining a copy of a credit report from one of the credit bureaus. See G. Buzzetti Cert. at P 11.\n\nIt appears the Defendants assert that by now ordering credit reports they are engaging in person credit analyses, as promised to consumers. The Defendants, however, have failed to establish there is no possibility of recurrence of charging $ 95.00 for a \"personal credit analysis\" without providing such a service. Although obtaining credit reports does not automatically ensure NCMG is providing such an individualized service, it may aid in allowing NCMG to offer consumers a personalized credit analysis by providing information specific to that customer.\n\nii. Pre-Approved Credit Card Applications\n\nThe FTC also argues the Defendants misrepresent consumers will receive pre-approved credit card applications. See Moving Brief at 13. The FTC contends the advertisements produced by NCMG convey the impression that consumers, regardless of credit history or credit worthiness, have a high likelihood of obtaining an unsecured credit card either directly through NCMG or with the assistance of NCMG. See id. at 13-14. The FTC argues \"by emphasizing the word 'APPROVED,' the [advertisements], at a minimum, impliedly represented that NCMG's customers will receive pre-approved major credit card applications.\" Id. at 14.\n\nDuring some of the advertisements for NCMG, the spokepersons indicate the consumer will receive a \"complimentary application for an unsecured major credit card with no security deposit required.\" See Moving Brief at 14. See, e.g., Videotape included as Exh. AA to Smith Cert. The telemarketers also sometimes inform consumers that ninety-five percent of the credit card applications are approved. See, e.g., Transcript attached to First Gross Cert. at p. 21, lines 13-19. The FTC argues consumers believed they were \"virtually guaranteed to receive an unsecured major credit card.\" See Moving Brief at 14. See, e.g., Clark Cert. at P 2; Eleby Cert. at P 2; Leos Cert. at P 3.\n\nThe FTC argues the customers of NCMG are not pre-approved or guaranteed to obtain the promised credit cards; every customer must meet the criteria for each credit card issuer. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" See Moving Brief at 14. Moreover, the FTC contends and the Defendants do not deny, the \"complimentary credit card application\" requires additional fees. See Reply at 6.\n\nThe Defendants again contend the information alleged in the Second Consolidated Complaint is stale and that as part of its current practice it \"does not state or suggest that clients who utilize NCMG's services will be 'approved' for credit.\" Opposition Brief at 17; G. Buzzetti Cert. at P 7. The Defendants also argue NCMG \"no longer represented that anyone will be approved for a credit card.\" Opposition Brief at 18; G. Buzzetti at P 7.\n\nG. Buzzetti states all current commercials and scripts have removed references to any claim of \"approved.\" \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" See G. Buzzetti Cert. at P 7. G. Buzzetti also states consumers who telephone NCMG, regardless of whether the credit analysis is ultimately purchased, receive a free application from a bank which \"told [the Defendants] [it] approved [ninety-five] of all qualified applicants.\" Id. G. Buzzetti indicates the qualifications for applicants are minimal. See id.\n\nThe advertisements of NCMG leave the impression that consumers, regardless of credit history or credit worthiness, have a high likelihood of obtaining an unsecured credit card either directly through NCMG or with its assistance. In fact, during the initial conversation between a NCMG representative and a consumer, the representatives sometimes inform consumers that ninety-five percent of the credit card applications are approved. See, e.g., Transcript attached to First Gross Cert. at p. 21, lines 11-16.\n\nAlso, by emphasizing the word \"approved,\" the advertisements impliedly represent the customers of NCMG will receive pre-approved major credit card applications. The NCMG telemarketers promise consumers a \"complimentary application for an unsecured major credit card with no security deposit required.\" NCMG representatives, however, fail to mention additional fees are associated with the issuance of such a credit card. These practices, especially the emphasis on the word \"approved,\" likely mislead consumers, acting reasonably under the circumstances, to believe they were virtually guaranteed to received an unsecured major credit card. See, e.g., Upchurch Cert. at PP 2-3; Leos Cert. at P 3. This misrepresentation is material. It is likely many consumers would not have telephoned NCMG and ordered the Initial Analysis had they known additional fees were associated with the complimentary applications or that the offered credit card applications were not pre-approved.\n\nThe FTC has substantiated its claim the practices and advertisements employed by NCMG concerning pre-approved, complimentary, unsecured credit card applications are deceptive. The Defendants have failed to produce any evidence to the contrary.\n\niii. NBRB is an Independent Review Agency\n\nThe FTC further argues the Defendants, so as to bolster the credibility of NCMG, misrepresent the NBRB can provide objective and reliable reports describing the business practices of NCMG. See Moving Brief at 14-15. During the initial telephone call, NCMG representatives encourage consumers to telephone the NBRB for references. See, e.g., Transcript attached to First Gross Cert. at p. 24, lines 13-23.\n\nOne NCMG telemarketer stated:\n\n[NCMG is] listed with the [NBRB] .... They're basically just like the [BBB]. It's a national organization, non-profit - that has information on companies and their programs and their business rating in the community.\"\n\nTranscript attached to First Gross Cert. at p. 24, lines 13-23.\n\nThe promotional material issued by the NBRB states it does not screen its clients but, rather:\n\nYOUR COMPANY IS GUARANTEED ACCEPTANCE INTO OUR SERVICE SO LONG AS YOU AGREE TO ANSWER ANY REGISTERED COMPLAINTS ONCE YOU BECOME A MEMBER!!!!\n\nALL BUSINESSES QUALIFY FOR MEMBERSHIP!!! [THE NBRB] DOES NOT JUDGE YOUR COMPANY, SIMPLY DUE TO THE NATURE OF YOUR BUSINESS / OR THE SERVICES YOU PROVIDE.\n\nAttachment B to Moscowitz Cert. at 3 (emphasis in original).\n\nAlthough not addressed in the Opposition Brief, G. Buzzetti states in his certification that in November 1997, NCMG discontinued using the services offered by NBRB after it learned the NBRB was not providing consumers with an independent assessment of the business practices of NCMG. See G. Buzzetti Cert. at P 33.\n\nThe statement made by NCMG representatives concerning the independence of and the objective data provided by NBRB would lead reasonably prudent people to believe purchasing the services offered by NCMG was a worthwhile and safe investment. Such a claim is material because it is likely to affect the decision of a consumer to purchase the services offered by NCMG. Thus, while it might not be reasonable to believe that everyone who purchased credit services from NCMG interpreted the above representation in this way, it can be presumed that a reasonably prudent consumer would interpret these statements in this way.\n\nb. Reasonable Likelihood of Future Violations\n\nAs mentioned, to determine if there is a reasonably likelihood of future violations of the applicable statute in the absence of injunctive relief, the following factors, among others, are considered:\n\n(1) the degree of scienter involved on the part of the defendant;\n\n(2) the isolated or recurrent nature of the infraction;\n\n(3) the defendant's recognition of the wrongful nature of his conduct;\n\n(4) the sincerity of the defendant's assurances against future violations; and\n\n(5) the nature of the defendant's occupation.\n\nRichlyn Labs., 827 F. Supp. at 1150 (quoting Toys \"R\" Us, 754 F. Supp. at 1058-59); see Bonastia, 614 F.2d at 912.\n\nAdditionally, the voluntary cessation by a defendant of challenged practices, the genuineness of the efforts of a defendant to conform to the applicable laws, the progress of a defendant towards improvement and compliance by a defendant with any recommendations made by the Government also should be considered. See Richlyn Labs., 827 F. Supp. at 1150; Toys \"R\" Us, 754 F. Supp. at 1058-1059 (citations omitted).\n\nPast misconduct, while not determinative future violations will occur, is highly suggestive of the likelihood of future violations and a \"court should therefore look at the totality of the circumstances and any factors suggesting that the infraction might not have been an isolated occurrence.\" Richlyn Labs., 827 F. Supp. at 1150 (citing Hunt, 591 F.2d at 1220); see Toys \"R\" Us, 754 F. Supp. at 1059.\n\nIn Richlyn, the court preliminarily enjoined a manufacturer and its president from continuing manufacturing, processing and distribution activities of prescription and over-the-counter drugs until they were in compliance with the regulations promulgated by the Food and Drug Administration (the \"FDA\") for validation, stability testing and prevention of cross-contamination. See 827 F. Supp. at 1151. The defendants did not seriously contest their production, labeling and distribution operations did not comply with the applicable FDA regulations. See id. Instead, the defendants argued that they had been and were taking steps toward complying with the applicable FDA regulations and had implemented many improvements in their practices thus far. See id. at 1152. The defendants argued the issuance of a preliminary injunction would be unnecessarily harsh considering they had taken steps toward compliance with FDA regulations. See id.\n\nThe Richlyn court acknowledged the several improvements implemented by the defendants since the inspection by the FDA where these violations were first discovered. See 827 F. Supp. at 1152. The court, however observed:\n\nWe nevertheless cannot ignore the defendants's history of [FDA] violations or its history of promising and attempting to comply with these regulations only upon receipt of FDA Violation Notices or under threat of further legal action by the Government. The record clearly indicates that the violations discovered by the FDA's inspection team ... are not isolated incidents.... With more than twenty-five years of experience in the drug manufacturing-processing industry, the defendants should know what actions must be taken and what procedures must be implemented to satisfy the requirements of the [FDA regulations]. Given this evidence, this court finds it difficult, if not impossible, to believe that the defendants are sincere when they say that they intend to be in full compliance with the regulations within one year.\n\nId. Accordingly, the Richlyn court preliminarily enjoined the defendants from continuing their manufacturing, processing and distribution activities until such time as they were in compliance with the FDA regulations. See id. at 1152.\n\nThe decision in Toys \"R\" Us is instructive. There a preliminary injunction was held to be unwarranted. See 754 F. Supp. at 1061. In Toys \"R\" Us, the Government commenced a suit against a major toy retailer alleging the defendant imported and distributed toys and other articles for children which were banned hazardous substances pursuant to the Federal Hazardous Substances Act (the \"FHSA\") and the Consumer Products Safety Act (the \"CPSA\"). See id. at 1052. The court acknowledged it was \"troubled by aspects of defendants' past conduct with regard to the safety of the toys ... it has imported and sold.\" Id. at 1059. The court, however, observed, and the Government conceded, although the defendants had violated the FHSA and the CPSA a number of times, these violations were not willful or knowing. See id.\n\nThe court outlined the previous compliance procedures utilized by the defendants to ensure conformance with the FHSA and the CPSA and commented \"from the nation's largest retailer of children's toys more was required.\" See Toys \"R\" Us, 754 F. Supp. at 1059. The court, however, observed the defendants were making substantial efforts at quality control and had been doing so for a number of years. See id. Moreover, the court observed the defendants stopped the importation and sale of all products determined to constitute banned products under both the CPSA and the FHSA in addition to two non-violative products. See id. at 1059-60. The court observed these actions, for the most part, were taken before any formal requests were made. See id. at 1060.\n\nFurther, the court indicated the defendants had hired an outside company to design and implement a comprehensive testing and inspection program of the items it sold. See Toys \"R\" Us, 754 F. Supp. at 1060. The court opined the commitment of the defendants to product safety was genuine, rather than simply a reaction to the commencement of the Federal action and held that a preliminary injunction was unwarranted. See id. The court concluded its opinion by commenting:\n\nParenthetically, I note with some dismay that plaintiff appeared more interested in filing this action and obtaining an injunction than in responding to defendants' appeals for guidance in improving its quality control procedures, even assuming that those appeals were not entirely altruistic.\n\nId.\n\nThe Defendants rely upon the factors enunciated in Toys \"R\" Us to support its argument that further statutory violations are not likely. See Opposition at p. 31. The Defendants contend they have made \"substantial efforts to meet Plaintiffs' concerns, even though the State of New Jersey has declined to provide any guidance to NCMG.\" Id. at 32.\n\nThe Defendants appear to have implemented changed in their standard practices. These changes, for the most part, appear to have taken effect as recently as 9 March 1998. See Scripts attached to Ornitz Cert.; Reply at 7 n.1. These changes, however, do not resolve the issue. As indicated, if a defendant fails to demonstrate there is no possibility that the alleged offending conduct with recur, the termination of such behavior is irrelevant. See American Standard Credit Servs., 874 F. Supp. at 1087. The Defendants have failed to establish these alterations in the standard procedures of NCMG will not change once the threat of this instant litigation dissipates.\n\nAdditionally, the Defendants do not appear to recognize their conduct was wrongful. Unlike the defendants in Toys \"R\" Us, the changes implemented by the Defendants in their advertisements and during the conversations between consumers and NCMG representatives are not sincere. Rather, they are simply a reaction to the initiation of the instant suit.\n\nMoreover, the nature of the business engaged in by NCMG targets individuals who are not necessarily financially secure and are seeking assistance from a legitimate source. The individuals to whom NCMG markets its credit services truly are in need of such assistance. This need, however, is only for such services providing a true benefit, not for services which merely cause the consumer to suffer greater financial distress. As indicated by the numerous certifications submitted by the Plaintiffs, the cost of the Initial Analysis is almost prohibitive to some of these consumers unless they are receiving useful personalized information concerning how they can establish or re-establish their credit or as some believe an approved unsecured credit card. The market targeted by NCMG does not have the luxury of spending money on services which are not provided. The large number of telephone calls received by NCMG in 1997, together with the other facts recited, demonstrate adequate reason to protect the public from these deceptive advertisements and solicitations.\n\nFor the purposes of this opinion, the consistency among the certifications submitted by consumers renders them credible. Considering the totality of the circumstances, and considering the past violations of NCMG, it is likely that violations of Section 5 of the FTCA will occur in the future.\n\n2. The CFA\n\na. Violations of the CFA\n\nThe CFA \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" provides in pertinent part:\n\nThe act, use or employment by any person of any unconscionable commercial practice, deception, fraud, false pretense, false promise, misrepresentation, or the knowing concealment, suppression, or omission, of any material fact with intent that others rely upon such concealment, suppression or omission, in connection with the sale or advertisement of any merchandise ... or with the subsequent performance of such person as aforesaid, whether or not any person has in fact been misled, deceived or damaged thereby, is declared to be an unlawful practice.\n\nN.J.S.A. 56:8-2 (\"Section Two\").\n\nAn \"unlawful practice\" can be committed by \"any person\" with respect to the sale or advertisement of \"any merchandise.\" See Section Two. \"Person\" is defined i N.J.S.A. 56:8-1(d) as including:\n\nany natural person or his legal representative, partnership, corporation, company, trust, business entity, or association, and any agent, employee, salesman, partner, officer, director, member, stockholder, associate, trustee or cestuis que trustent thereof.\n\nId.\n\n\"Merchandise\" is defined in the CFA as including \"any objects, wares, goods, commodities, services or anything offered, directly or indirectly to the public for sale.\" N.J.S.A. 56:8-1(c).\n\nThe CFA \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\" is one of the strongest consumer protection statutes in the nation. See Cox v. Sears Roebuck, 138 N.J. 2, 15, 647 A.2d 454 (1994). Courts have stressed that similar to other remedial legislation, the CFA should be construed liberally in favor of consumers. See Yourman v. People's Sec. Life Ins. Co., 1998 U.S. Dist. LEXIS 798, CIV.A.No. 97-1196, 1998 WL 35381, at *4 (D.N.J. 28 Jan. 1998) (citation omitted); Lemelledo v. Beneficial Management Corp., 150 N.J. 255 at 264, 696 A.2d 546 (citations omitted); Cox, 138 N.J. at 15 (citing, inter alia, Barry v. Arrow Pontiac, Inc., 100 N.J. 57, 69, 494 A.2d 804 (1985); Levin v. Lewis, 179 N.J. Super. 193, 200, 431 A.2d 157 (App.Div. 1981)). Although initially enacted to combat \"sharp practices and dealings\" that victimized consumers by attracting them into purchases through fraudulent or deceptive means, see Cox, 138 N.J. at 16 (citing D'Ercole Sales, Inc. v. Fruehauf Corp., 206 N.J. Super. 11, 23, 501 A.2d 990, (App.Div. 1985)), the CFA no longer focuses solely on \"shifty, fast-talking and deceptive merchant[s]\" but reaches \"nonsoliciting artisans\" as well. Id. (quotation omitted). This expansion of the CFA increased the breadth of the definition of an \"unlawful practice\" to include an \"unconscionable practice.\" See Miller v. American Family Publishers, 284 N.J. Super. 67 at 74, 663 A.2d 643.\n\nThe CFA is intended to protect the public even when a merchant acts in good faith. See Cox, 138 N.J. at 16 (citation omitted). \"Given that 'the fertility of [human] invention in devising new schemes of fraud is so great ...,' the CFA could not possibly enumerate all, or even most, of the areas and practices that it covers without severely retarding its broad remedial power to root out fraud in its myriad, nefarious manifestations.\" Lemelledo, 150 N.J. at 265 (citation omitted). Oral misrepresentations are equally actionable under the CFA. See Chattin v. Cape May Greene, Inc., 216 N.J. Super. 618, 641, 524 A.2d 841 (App. Div.), certif. denied, 107 N.J. 148, 526 A.2d 209 (1987).\n\nThe \"capacity to mislead\" is at the heart of the definition of an \"unlawful practice.\" See Miller, 284 N.J. Super. at 74 (citing Cox, 138 N.J. at 17). A practice can be unlawful \"even if no person was in fact misled or deceived thereby.\" Miller, 284 N.J. Super. at 74 (citing Cox, 138 N.J. at 17); see also Barry, 100 N.J. at 69 (observing the test of whether sales material violates the CFA is whether it is \"misleading to the average consumer\")).\n\nThere are two types \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\" of unlawful acts defined in Section Two of the CFA: (1) affirmative acts and (2) knowing omissions. See Cox, 138 N.J. at 17; Miller, 284 N.J. Super. at 74-75. Affirmative acts defined as unlawful in Section Two are set out in the disjunctive. See Cox, 138 N.J. at 19; Miller, 284 N.J. Super. at 75. They include: (1) unconscionable commercial practices, (2) deception, (3) fraud, (4) false pretense, (5) false promise, and (6) misrepresentation. See Section Two.\n\nEstablishing that the conduct of a defendant constitutes an unlawful act will set forth a violation of the CFA, regardless of any proof of intent. See Cox, 138 N.J. at 19; Miller, 284 N.J. Super. at 75. Intent is not an essential element and need not be proven with respect to affirmative acts. See Miller, 284 N.J. Super. at 75 (citing Cox, 138 N.J. at 17-18); see also Chattin v. Cape May Greene, Inc., 124 N.J. 520 at 522, 591 A.2d 943 (Stein, J., concurring).\n\nThe second type of statutory violation under the CFA, a knowing omission, includes: (1) concealment, (2) suppression, or (3) omission. See Section Two. Knowing omissions require a showing of intent. See Cox, 138 N.J. at 18; Miller, 284 N.J. Super. at 75. Accordingly, proof establishing a defendant acted knowingly, with intent that another rely on such concealment, suppression, or omission is necessary. See Miller, 284 N.J. Super. at 75 (citing Cox, 138 N.J. at 18).\n\nThe New Jersey Supreme Court in Cox observed:\n\nIn respect of what constitutes an \"unconscionable commercial practice,\" this Court explained in Kugler..., that unconscionability is \"an amorphous concept obviously designed to establish a broad business ethic.\" [58 N.J.] at 543.... The standard of conduct that the term \"unconscionable\" implies is a lack of \"good faith, honesty in fact and observance of fair dealing.\" Id. at 544....\n\n138 N.J. at 18.\n\nThe State of New Jersey contends the Defendants violate and have violated the CFA in four respects. First, the State of New Jersey argues the Defendants are engaging and have engaged in unauthorized transactions by debiting the checking accounts of consumers who declined the credit services offered by NCMG. See Moving Brief at 26. Second, the State of New Jersey contends the advertisements and oral solicitations of NCMG are and have been \"replete with misrepresentations and omissions of material facts.\" See id. at 27. Third, the State of New Jersey contends the services offered by the Defendants are and have been fraudulent and unconscionable. See id. at 29. Fourth, the State of New Jersey argues the refund policies of NCMG are unconscionable. See id. at 30.\n\nI. Unauthorized Transactions\n\nThe State of New Jersey argues NCMG has improperly debited the checking accounts of consumers who declined its credit services. See Moving Brief at 26. The State of New Jersey alleges that on numerous occasions, NCMG received a call or facsimile transmission from a consumer soon after the initial authorization was given which expressly revoked the right of NCMG to process a \"phone check\" from the bank account of the consumer; however, the bank accounts of these consumers were still debited. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\" See id. See, e.g., Petit Cert. at P 4; Stocksill Cert. at P 4; Alston Cert. at p. 2; Torres Cert. at P 5. The State of New Jersey contends this practice constitutes consumer fraud because such practices are deceptive and prey upon the vulnerability of consumers in the telemarketing context. See Moving Brief at 26.\n\nThe State of New Jersey also argues the Defendants are presently automatically deducting a postage and handling charge of $ 9.95 which has never been disclosed to consumers. See Reply at 6.\n\nThe State of New Jersey argues the inability of NCMG to produce a sizeable number of verifications further supports its contention of unauthorized transactions. See Moving Brief at 26. NCMG failed to produce sixty-five percent of the taped verbal authorizations for the Initial Analysis and thirty-nine percent of the taped verbal authorizations for the Program. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\" See Reply at 4; Supp. Smith Cert. at P 6.\n\nThese unauthorized transactions constitute an unconscionable commercial practice which violates Section Two. The practice of debiting an account of a consumer without proper authorization or after that authorization had been revoked establishes a lack of good faith, a lack of honesty in fact and a failure to engage in fair dealings. This practice coupled with the high pressure sale engaged in by NCMG representatives demonstrates NCMG is not dealing fairly with its customers but is more concerned with selling its services and making a profit at the expense of mislead consumers.\n\nii. Misrepresentations and Omissions\n\nThe State of New Jersey argues the Defendants are making the following misrepresentations:\n\nConsumers are sold a \"credit analysis\" (that is never performed); consumers are on their way to repairing their credit if they are among the ones qualified and approved by NCMG for the program (yet there is no verification of any qualifications and everyone is approved); NCMG provides trained and certified experts (except that NCMG's employees are trained only on the sales script and a homemade multiple choice quiz); consumers are instructed that they will be canceled if they return the package (but they are not only not canceled but charged a hidden fee of $ 9.95 for shipping); NCMG's triple A rating can be verified by the NBRB (because NCMG paid a fee to the NBRB); consumers are promised a major unsecured credit card (that may never be delivered unless they pay yet another application fee and meet the issuer's own set of criteria); consumers are sold a two-year program of monitoring to assist the reestablishment of credit (that evaporates into the thin air of endless voice mailboxes once the initial manual is sent); there is no risk to enrolling in the program because refunds are available (except it is impossible to meet the conditions); and other misrepresentations set forth in the Verified Complaint.\n\nMoving Brief at 27-28.\n\nThe State of New Jersey contends the Defendants have also knowingly omitted disclosing information to consumers which would be material to their decision of whether to utilize the credit services offered by NCMG. See Moving Brief at 28. These omissions include\n\nfailing to disclose in the first sales presentation that there will be another sales pitch; that the principal purpose of the credit analyst's return call is to sell a $ 900 \"program;\" that any credit card applications forwarded to the consumer will have an additional processing fee and further criteria; that the ... Program is premised upon the consumer doing all the work; that NCMG will have few staff persons available to aid and assist the person; and that those NCMG representatives who may aid the consumer are not experts in the federal credit reporting laws.\n\nId.\n\nNumerous affirmative acts engaged in by NCMG are unlawful. NCMG misrepresents that customers will receive a \"personal credit analysis\" when, in fact, there is nothing individualized about the credit analysis. Although the Defendants indicate NCMG recently began ordering credit reports again, this has not been the standard practice of NCMG and there is no assurance this practice will continue.\n\nThe Defendants have also misrepresented that a consumer must qualify for the Initial Analysis when in actuality the qualification process involves no more than ensuring the customer is not in bankruptcy or engaged in credit counseling.\n\nAdditionally, the Defendants misrepresented NCMG credit analysts are trained and certified. This representation indicates advanced knowledge; however, these representative receive limited training and are certified by NCMG and not an independent entity.\n\nNCMG also misrepresented there was a high likelihood that consumers who qualified for the Initial Analysis would receive a pre-approved secured credit card when there was no strong likelihood that customers would receive such a credit card. Customers still were required to meet the individual criteria set forth by the credit card issuer.\n\nA number of omissions in the advertisements and representations of NCMG employees also establish violations of Section Two. NCMG failed to inform consumers the principal service it is selling is the Program. Although the availability of other materials offered by NCMG is sometimes mentioned during the initial telephone call, the price and self-help nature of the Program is not conveyed to the customer. This omission is intentional and designed to avoid immediately alienating potential customers with the large fees associated with the Program. Consumers are more likely to purchase the credit services offered by NCMG when led to believe that only a $ 95.00 fee will be charged. Once NCMG lures customers to purchase the Initial Analysis, it is easier for a credit analyst to convince consumers to purchase the Program.\n\nAll of the above representations and omissions were likely to mislead a reasonable consumer and in many instances did. These mistaken impressions, deliberately created by defendant, are the type of misleading statements constituting illegal action the CFA seeks to prohibit and punish.\n\niii. Fraudulent and Unconscionable Services\n\nThe State of New Jersey contends the informative purpose of the material distributed by the Defendants becomes virtually irrelevant in light of the exorbitant price demanded of consumers for such materials. See Moving Brief at 29. The State of New Jersey argues \"NCMG gives so little value that the underlying goods and services offered are unconscionable.\" Id.\n\nThe State of New Jersey contends intervention is warranted when the goods or services offered by a company are offered at a price so exorbitant as to shock the conscience. See Moving Brief at 29. The State of New Jersey argues the prices charged for the services and materials offered by NCMG are unconscionable. See id. at 30. The State of New Jersey also contends the $ 95.00 fee for the Initial Analysis \"is exorbitant and unconscionable because the consumer receives nothing for this charge except the mistaken belief that he or she will get a personalized 'confidential analysis.'\" Id. at 30. Further, the State of New Jersey contends the $ 95.00 fee is unconscionable because it does not include a credit card or an independent review of the credit situation of a consumer. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" See id.\n\nThe Defendants argue the materials offered to consumers \"provide valuable educational resources to persons who are in need of information on how to navigate through the maze of the nation's credit laws.\" Opposition at 16.\n\nThe Romain case is analogous to the instant matter. In Romain, the Court looked at the practices of a business engaged in the door-to-door solicitation of educational books in poorer urban areas. See 58 N.J. at 524. The materials were sold at prices of between two to three times their market value which the Court found to be unconscionable, especially when coupled with the fact that \"the goods sold had little or no value to the consumer for the purposes for which he [or she] was persuaded to buy them and which the seller pretended they would serve.\" Id. at 530, 544. The books were sold under a contract which set forth in small print terms and conditions including a no-refund policy, mandatory insurance and a waiver of defenses. See id. at 528. In addition, the Court found that the solicitations included misrepresentations and deceptions and that the collection practices of the defendant practices were unfairly aggressive. See id. at 531-33.\n\nNCMG similarly preys upon economically disadvantaged individuals, as did the defendants in Romain. The practices of NCMG are unconscionable in numerous respects. See Reynolds Publishers, Inc. v. Graphics Fin. Group, Ltd., 938 F. Supp. 256, 266 (D.N.J. 1996) (\"Generally, New Jersey courts apply the unconscionability doctrine to protect 'those most subject to exploitation -the uneducated, the inexperienced and the people of low incomes.'\"). As in Romain, NCMG is selling services at exorbitant prices which \"have little or no value to the customer for the purposes for which he [or she] was persuaded to buy [the service] and which the seller pretended [the service] would serve.\" Romain, 58 N.J. at 524. As indicated, the touchstone of \"unconscionability\" is conduct lacking in \"good faith, honesty in fact and observance of fair dealing.\" Miller, 284 N.J. Super. at 83 (citing Cox, 138 N.J. at 18); Romain, 58 N.J. at 544.\n\nThe imposition of the $ 95.00 fee is unconscionable considering the consumer is mislead as to what payment of the fee entails. Basically, NCMG receives $ 95.00 from a consumer and provides services of limited value in return. This demonstrated conduct lacking in good faith and fair dealing. The Defendants attempt to align themselves with such companies as American Express, see Opposition at 23, which offers what appears to be legitimate credit monitoring services at the cost of $ 49.95 instead of the exorbitant price charged by NCMG. See Reply at 6.\n\nAdditionally, unbeknownst to a consumer, any information provided as a result of the initial analysis can be independently obtained. This alone does not suffice to constitute an unconscionable practice, but when combined with the representations and advertisements of NCMG, one must reach the conclusion that the practice is unconscionable. Moreover, the $ 95.00 fee does not include a secured credit card, as some consumers were lead to believe. The $ 95.00 fee also is grossly excessive in relation to the costs of NCMG.\n\niv. Unconscionable Refund Policies\n\nThe State of New Jersey argues the refund polices on both the initial analysis and the Program are unconscionable \"because the rules are rigged so that the consumer can never meet the conditions for a refund.\" Moving Brief at 30-31.\n\nThe Defendants counter this argument by contending NCMG has implemented changes in its refund policies. See Opposition at 5. The Defendants note the current refund policy of NCMG for the Program provides for a five-business day right of rescission effective when the materials are postmarked. See G. Buzzetti Cert. at P 26. Ornitz stated the credit analysts now advise consumers of the right to rescission. See Ornitz Cert. at P 25.\n\nOnce the $ 95.00 fee for the Initial Analysis is debited from the checking account of a consumer, NCMG merely has to qualify the consumer in order to defeat any refund request. Contrary to its express representations, NCMG does not verify any information provided by the consumer except to check basic information such as name and address and the micro-encoding information which allows NCMG access to the checking account of a consumer. See Letter, dated 21 January 1998, of Albert Buzzetti, Esq. attached as Exh. N to Smith Cert. at 2; G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 59, lines 11-18.\n\nCustomers wishing to cancel the Initial Analysis were transferred to a special extension where an experienced NCMG employee would attempt to save the sale. See Tadros Cert. at P 5. Employees handling such calls were trained to deny all cancellation requests. See id. The most that could be done for a customer was to post-date the $ 95.00 debit so that it would be deducted from the checking account of the consumer at a later date. See id. In December 1997, these employees were instructed they could cancel orders for the Initial Analysis if a customer so desired. See id. The employee was still expected to try to save the sale or give a free Initial Analysis to the consumer. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\" See id.\n\nAdditionally, it is only after a consumer has enrolled in the Program that he or she receives the materials which include the Disclosure Agreement, the Guarantee and the Payment Terms. Up until the latest revision to the scripts followed by the credit analysts, information concerning the right of rescission was not discussed with consumers. See Lucena Dep. attached as Exh. H to Smith Cert. at p. 60, lines 2-6. If a consumer does locate the rescission provision it is most likely too late to exercise the right to cancel within the time frame allotted by NCMG. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\"\n\nAs mentioned, the Defendants indicate NCMG has implemented changes in its refund policy. See Ornitz Cert. at P 25. These changes were only recently instituted and there is no indication they will become a permanent practice at NCMG. Accordingly, the refund policy of NCMG constitutes and \"unconscionable commercial practice\" as defined in Cox because it implies a lack of \"good faith, honesty in fact and observance of fair dealing.\" See Miller, 284 N.J. Super. at 83 (citing Cox, 138 N.J. at 18).\n\nb. Reasonable Likelihood of Future Violations\n\nFor the reasons previously set forth concerning the likelihood of future violations of Section 5 of the FTCA, there is a reasonable likelihood of future violations of Section Two as well.\n\n3. The TSR42\n\na. Violations of the TSR\n\nThe Plaintiffs also allege the practices of the Defendants violate the TSR. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\" See Moving Brief at 15. The Plaintiffs argue by engaging in unauthorized check debiting and by failing to comply with the provisions of the TSR, the Defendants have violated 16 C.F.R. § 310.3(a)(3) (\"Section 310.3(a)(3)\") and § 310.3(a)(5) (\"Section 310.3(a)(5)\"). See id. at 16. The Plaintiffs also argue the Defendants have violated 16 C.F.R. § 310.3(a)(1) (\"Section 310.3(a)(1)\") by failing to disclose the actual costs of goods and services, the additional application fees required for the credit card applications provided by NCMG, and that applicants must meet the minimum credit-granting criteria of the lender. See id. Further, the Plaintiffs contend the Defendants have violated 16 C.F.R. § 310.4(a)(4) (\"Section 310.4(a)(4)\") by requesting or receiving payment in advance of obtaining an extension of credit when a NCMG seller or telemarketer has guaranteed or represented a high likelihood of success in obtaining or arranging such an extension of credit for a person. Section 310.4(a)(4). See id.\n\ni. Unauthorized Check Debiting\n\nThe TSR prohibits a seller or telemarketer from obtaining or submitting for payment a draft on a bank account without the express verifiable authorization of the owner of the account. See Section 310.3(a)(3). \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\" The TSR permits a seller or telemarketer to obtain express verifiable authorization by any one of three methods: (1) written authorization, (2) taped oral authorization (\"Method Two\"), or (3) written confirmation of a prior oral agreement (\"Method Three\"). See id. The TSR sets forth specific information that must be included in authorizations under Method Two and Method Three. See Sections 310.3(a)(2) and (3). Authorizations using Method Three must include a statement regarding the procedures by which the customer can obtain a refund from the seller or telemarketer in the event the confirmation is inaccurate. See Section 310.3(a)(3).\n\nThe Defendants contend they properly verify the authorizations of customers who purchase either the Initial Analysis or the Program. See Opposition at 18-19. The Defendants argue the fact that they lost some of the taped verifications when NCMG relocated does not establish a pattern of impermissible activity. See id. The Defendants also indicate they have strengthened controls over obtaining, recording and retaining customer verifications. See id. (citing Ornitz Cert. at P 5).\n\nCustomer certifications, however, demonstrate NCMG often debits the checking accounts of consumers without obtaining the express verifiable authorization from those consumers using any of the methods permitted by the TSR. See, e.g., Alston Decl. at p. 2; Clark Decl. at PP 5, 10; Deshaies Decl. at P 7; Johnson Cert. at P 6; Leos Cert. at P 5; Parker Cert. at P 3.\n\nAs to the debit for the advance fee for the Initial Analysis, NCMG has failed to produce tape recorded authorizations for approximately sixty percent of those transactions. See Supp. Smith Cert. at P 6. As to the subsequent debits for the Program, NCMG has no verifiable authorization for almost forty percent of the transactions. See id.\n\nDefendants appear to be relying on Method Two and Method Three of the TSR to establish proper verification procedures were followed. The consumer certifications mentioned above establish oral authorizations were not given in many instances but NCMG still debited the accounts of consumers. Method Two, therefore, does not lend support to the contentions of the Defendants. Adequate oral authorizations do not exist in numerous instances.\n\nThe written confirmations used by NCMG also fail to comply with the requirements of Method Three of the TSR because they contain only four of the six pieces of information required by Section 310.3(a)(3). First, the confirmations fail to identify the date of the oral authorization. Of course an accurate date of oral authorization would be impossible to identify because most consumers never authorized the subsequent debits.\n\nSecond, to use Method Three, a seller or telemarketer must inform consumers about the procedures by which the customer can obtain a refund in the event the confirmation is inaccurate. See Section 310.3(a)(iii)(B). Consumers were not informed about the right of rescission before authorizing a purchase from NCMG. Moreover, as previously discussed, the procedure specified by NCMG is in reality not a refund procedure at all, because it is unlikely to be discovered, virtually impossible to exercise, and not honored when it is discovered and followed. Therefore, the right of rescission cannot constitute \"a procedure by which the customer can obtain a refund\" within the meaning of the TSR. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\"\n\nii. Failure to Disclose Total Cost and Material Limitations of the Goods and Services Offered\n\nThe Plaintiffs contend the failure of NCMG to disclose the total costs to purchase and any material restriction, limitation, or condition of a good or service being offered constitutes serious violations of the TSR. See Moving Brief at 18 (citing Section 310.3(a)(1)(I) and (ii)). \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\"\n\nThe Defendants contend NCMG fully discloses the nature of the goods provided in compliance with Section 310.3(a)(1) and (a)(5). See Opposition at 19. The Defendants argue NCMG now advises consumers during the initial telephone call that the Initial Analysis includes the pulling of the credit report of the consumer and that NCMG provides educational materials. See id. The Defendants also contend these actions do not violate Section 310.4(a)(4) because NCMG does not represent that it is a lender or a provider of credit and it does not guarantee to consumers a high likelihood of success in arranging a loan or other extension of credit. See id. The Defendants contend NCMG merely provides a free credit card application to consumers. See id.\n\nNCMG telemarketers disclose the $ 95.00 fee for the Initial Analysis but fail to disclose, until after the consumer has paid the $ 95.00, the total costs of the Program. See, e.g., Pamela Anderson Decl. at P 5; Patricia Anderson Cert. at PP 4-5; Clark Decl. at P 5; Deshaies Decl. at P 4; Hunter Cert. at P 3. In addition, NCMG does not disclose that the \"complimentary credit card application\" requires additional fees ranging from $ 50.00 to $ 100.00. See Moving Brief at 18. NCMG also does not disclose the material condition that consumers would be required to meet the minimum lending criteria of a lender before receiving a credit card. See Aube Aff. at P 5.\n\nThe above described information is material because many consumers would not have ordered the Initial Analysis if it did not include, as they were led to believe, a complimentary pre-approved credit card. This fact is material to consumers in light of the representation that ninety-five percent of the credit card applications submitted by NCMG customers were approved. See, e.g., Transcript attached to First Gross at p. 21, lines 11-24. Also, many consumers were led to believe the $ 95.00 was the only cost associated with the services offered by NCMG. If consumers would have been made aware of the existence of the Program and its cost before ordering the Initial Analysis it is unlikely they would have ordered services from NCMG. The failure of the Defendants to disclose the total cost of services offered and to make other material disclosures violates the TSR. See Section 310.3(a)(1)(I) and (ii); see also New York v. Financial Services Network, 930 F. Supp. 865, 869-71 (W.D.N.Y. 1996); United States v. Cen-Card Agency, 724 F. Supp. 313, 315 (D.N.J. 1989).\n\niii. Requesting and Receiving Payment in Advance\n\nThe Plaintiffs also argue the advertisements of the Defendants represent a high likelihood of success in obtaining credit by conveying that the Defendants can assist consumers in obtaining pre-approved credit cards. See Moving Brief at 18-19 (citing Section 310.4(a)(4)). Specifically, Section 310.4(a)(4) \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\" prohibits a seller or telemarketer from requesting or receiving payment of any fee or consideration in advance of the customer obtaining a loan or other extension of credit when the seller or telemarketer has guaranteed or represented a high likelihood of success in obtaining or arranging a loan or other extension of credit for the customer. See Section 310.4(a)(4).\n\nThe Package sent to consumers after they first call \"1-800-YES-CREDIT\" includes a sheet of paper entitled \"Common Questions and Answers.\" Attachment A to Lewis Cert. at p. 791. That sheet states:\n\nQ: \"When will I receive my \" pre-approved \" credit card application?\"\n\nA: After approximately [thirty] days from the time of your Credit Analysis, you will receive a complimentary, pre-approved, unsecured, major credit card application with no security deposit required ! This may help to build and re-establish new credit with the major credit agencies.\n\nId. (emphasis in original). The offer of a pre-approved credit card promises a high likelihood of success in obtaining credit. Similar representations were made in the advertisements produced by NCMG.\n\nConsumer certifications also demonstrate that defendants both request and receive funds in advance of delivering services, separate violations of Section 310.4(a)(4). \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\" Only consumers who pay the $ 95.00 receive the credit card applications. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\"\n\nIt appears the Defendants question the constitutionality of Section 310.4(a)(4) and contend it imposes an unreasonable burden upon free speech by postponing the time when NCMG is able to collect payments from customers for its services. See Opposition at 24-25. Section 310.4(a)(4), however, does not bar the sale of \"educational\" materials produced by NCMG as the Defendants claim, but merely regulates when payment may be collected in a situation where a company has represented or guaranteed a high likelihood of success of an extension of credit as NCMG did here. See Section 310.4(a)(4).\n\nThe Plaintiffs have established the Defendants violated Section 310.4(a)(4). See Financial Services, 930 F. Supp. at 870-71.\n\nb. Reasonable Likelihood of Future Violations\n\nFor the reasons set forth concerning the likelihood of future violations of Section 5 of the FTCA and the CFA, there is a reasonable likelihood of future violations of the TSR as well.\n\n4. The CROA\n\na. Violations of the CROA\n\nThe Plaintiffs contend the NCMG is a credit repair organization as defined in the CROA, 15 U.S.C. § 1679a(3) (\"Section 1679a(3)\"). Section 1679a(3) provides in pertinent part:\n\nThe term \"credit repair organization\" --\n\n(A) means any person who uses any instrumentality of interstate commerce or the mails to sell, provide, or perform (or represent that such person can or will sell, provide, or perform) any service, in return for the payment of money or other valuable\n\nconsideration, for the express or implied purpose of -\n\n(i) improving any consumer's credit record, credit history, or credit rating; or\n\n(ii) providing advice or assistance to any consumer with regard to any activity or service described in clause (i).\n\nId. (emphasis added).\n\nAlthough the Defendants do not provide services to repair credit histories, they do represent that they will perform services, monitor, and provide advice to assist consumers improve their credit ratings. The Defendants promise NCMG will provide consumers with a personal credit analysis by a trained credit analyst who \"will provide [them] with information with respect to [their] profile so that [they] may attempt to establish and/or re-establish [their] credit. \" Transcript attached to Second Gross Decl. at p. 5, line 22 to p. 6, line 1; see also id. at p. 16, lines 8-10. The Plaintiffs argue the CROA applies because, as evidenced by the above statements, the Defendants represent that, for a fee, they will provide a service that will assist consumers in improving their credit ratings. See Moving Brief at 20.\n\nThe Defendants have been aware, since April 1997, that the FTC likely viewed NCMG as a credit repair organization under the CROA. See 22 April 1997 Letter from the FTC at p. 2. NCMG had requested the FTC provide an informal opinion letter with respect to this issue. In response, the 22 April 1997 Letter from the FTC was sent indicating that under the situation described in the letter from counsel for NCMG, \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\" NCMG would be considered a credit repair organization. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\" See id. The 22 April 1997 Letter from the FTC indicated if NCMG delivered its products to consumers without any communication between NCMG and the consumer, NCMG would not be providing a service for the purposes of the CROA. See id. NCMG was told, however, that if NCMG representatives communicated with consumers \"in any way \" about the credit situation of a consumer it would be providing a service covered by the CROA. See id. (emphasis in original).\n\nThe Defendants argue the FTC never intended \"for educational and credit monitoring programs of the type being offered by NCMG to be governed by the CROA, its present litigation stance notwithstanding.\" Opposition at 21. In support of this contention, the Defendants rely upon commentary to the CROA. See Reply at 9 n.3.\n\nCommentary, however, is not binding. See Heintz v. Jenkins, 514 U.S. 291, 298, 131 L. Ed. 2d 395, 115 S. Ct. 1489 (1995). This is especially true when the commentary conflicts with the plain language of the statute at issue. See id. Accordingly, the CROA, as evidenced by its plain language, explicitly covers the services offered by NCMG and the commentary is not entitled to conclusive weight.\n\ni. Failure to Provide Required Documents and Forms\n\nThe Plaintiffs contend NCMG fails and has failed to provide consumers with a written statement containing prescribed language concerning consumer rights before any contract or agreement is executed as required by the CROA. See Moving Brief at 21 (citing 15 U.S.C. § 1679c(a)). The Plaintiffs further argue NCMG fails and has failed to provide a written and dated contract containing specific information required by 15 U.S.C. § 1679d(a). See id. Other than Defendants arguing NCMG is not and was not a credit repair organization, as previously discussed and rejected, these contentions are undisputed.\n\nThe Plaintiffs also contend NCMG fails and has failed to provide consumers with cancellation notices which comply with 15 U.S.C. § 1679e (\"Section 1679e\"). See Moving Brief at 20. The right to cancel set forth in the Disclosure Agreement does not comply with Section 1679e because it fails to include the specific requisite language and because it does not comply with minimal time allotments for cancellation. See Section 1679e. Section 1679e requires that consumers be allowed three business days to cancel, not including the date of the contract. See id. Section 1679e also states cancellation is effective upon mailing or delivery, not upon receipt. See id. Under the previous return policy utilized by the Defendants, consumers were effectively required to mail the Package back the same date it was received.\n\nNCMG has recently implemented a five day return policy, but as mentioned earlier, there is no guarantee such a policy will continue. The Defendants have violated Section 1679e.\n\nii. Requesting and Receiving Payment in Advance of Providing Services\n\nThe CROA prohibits credit repair organizations from charging or receiving a fee for a service before \"such service is fully performed.\" See 15 U.S.C. § 1679b(b) (\"Section 1679b(b)\"). In the instant matter, the Plaintiffs argue consumer certifications establish the Defendants ask for and receive $ 95.00 for a credit analysis and never perform such an analysis. See Moving Brief at 21.\n\nThe Defendants contend Section 1679b(b) unconstitutionally restricts pure speech because the statute \"bar[s] the sale of [NCMG's] educational material.\" See Opposition at 24. The Program offered by NCMG spans a two-year period. Defendants contend restricting its right to collect payment on purchases of the Program until after the two-year period is completed \"has a chilling effect on the rights of consumers to receive information.\" See id. at 26.\n\nThe Plaintiffs contend the Defendants inaccurately characterize their First Amendment rights. See Reply at 9. The Plaintiffs argue Section 1679b(b) does not serve as a bar on sales, but \"merely prohibits any credit repair organization from charging any money for the performance of any service before such service is fully performed.\" Id. The Plaintiffs also contend the Defendants are free to charge any conscionable price the market will bear for its services. See id. The Plaintiffs further argue the right of NCMG to receive payment is protected because it must enter into a contract with each consumer prior to providing any services. See Reply at 10 n.5 (citing 15 U.S.C. § 1679d).\n\nThe Plaintiffs argue the CROA does not interfere with the First Amendment rights of NCMG even though its services include the communication of information. \"The power of the Government to regulate the professions is not lost whenever the practice of a profession entails speech.\" Lowe v. Securities and Exchange Comm'n, 472 U.S. 181, 228, 86 L. Ed. 2d 130, 105 S. Ct. 2557 (1985) (White, J., concurring); see also Thomas v. Collins, 323 U.S. 516, 544-545, 89 L. Ed. 430, 65 S. Ct. 315 (1945) (Jackson, J., concurring).\n\nJust as offer and acceptance are communications incidental to the regulable transaction called a contract, the professional's speech is incidental to the conduct of the profession. If the government enacts generally applicable licensing provisions limiting the class of persons who may practice the profession, it cannot be said to have enacted a limitation on freedom of speech or the press subject to First Amendment scrutiny.\n\nLowe, 472 U.S. at 232 (White, J., concurring).\n\nThe Plaintiffs argue if the Government can, without offending the First Amendment, preclude someone from practicing a profession, then it can regulate the profession. See Reply at 11. In particular, the Plaintiffs argue there is no offense to the First Amendment when Congress regulates the time at which a credit repair organization may receive payment for a service. See id. This is especially true, the Plaintiffs contend, when the regulation is imposed to \"'protect the public from unfair or deceptive advertising and business practices.'\" See id. (quoting Section 1679(b)(2)).\n\nThe Plaintiffs also contend this regulation is further supported by the fact that these business practices \"'have worked a financial hardship upon consumers, particularly those of limited economic means and who are inexperienced in credit matters.'\" Id. (citing Section 1679(a)(2)). Accordingly, the Plaintiffs conclude by contending there is no First Amendment violation even if the delayed payment provision of the CROA makes it more costly for NCMG to offer its services. See id.\n\nThe Defendants rely upon Simon \u0026 Schuster, Inc. v. Crime Victims Bd., 502 U.S. 105, 116 L. Ed. 2d 476, 112 S. Ct. 501 (1991), to support their argument. See Opposition at 27. In Simon \u0026 Shuster, the Supreme Court reviewed New York's \"Son of Sam Law\" requiring income received by an accused or convicted criminal from works describing the crime committed be deposited in an escrow account for five years. See 502 U.S. at 108. These funs were to be made available to the victims of the crime and other creditors of the criminal. See id.\n\nThe Court observed the \"Son of Sam Law\" established a financial disincentive to publish works concerning past criminal acts. See Simon \u0026 Shuster, 502 U.S. at 118. The Court concluded the \"Son of Sam Law\" singled out speech on one subject and imposed a financial burden that it placed on no other income or speech. See id. at 123. The Court further observed in order to justify this differential treatment, \"'the state must show that its regulation is necessary to serve a compelling state interest and is narrowly drawn to achieve that end.'\" Id. at 118 (quotation omitted).\n\nThe Court opined the state had a compelling interest in compensating individuals victimized by these criminals, but little, if any, interest in restricting such compensation to the criminal's speech concerning the illegal acts. See Simon \u0026 Shuster, 502 U.S. at 120-21. The Court held the \"Son of Sam Law\" was not narrowly tailored to advance the interests of the state because it would also encompass works not enabling a criminal to profit from his illegal actions while a victim is uncompensated. See id. at 122.\n\nThe argument of the Plaintiffs, see pp. 94-96, supra, is persuasive. Unlike the \"Son of Sam Law\" which prohibited profiting from a crime, the Defendants are not prohibited from offering their services; they are merely required to perform the services before customers incur a resulting charge. This does not impinge upon the rights of the Defendants under the First Amendment.\n\nThe Defendants are able to offer their services to the public in ways which will cause little if any financial impact upon them. If all NCMG does, as it contends, is offer educational and credit material to consumers, there is no reason why a customer could not be charged each time the customer called up to order particular material.\n\nThe efforts of Congress to regulate the credit repair profession are further driven by its intent to \"protect the public from unfair or deceptive advertising and business practices.\" See Section 1679(b)(2). Contrary to the arguments voiced by the Defendants, Section 1679b(b) does not \"bar the sale of \"educational\" materials produced by NCMG as the Defendants claim, but merely regulates when payment may be collected.\n\nb. Reasonable Likelihood of Future Violations\n\nFor the reasons set forth concerning the likelihood of future violations of Section 5 of the FTCA, the CFA, and the TSR, there is a reasonable likelihood of future violations of the CROA as well.\n\nB. Public Interest\n\nThe statutory test for issuance of a preliminary injunction also involves a balancing of the equities, giving greater weight to the public interest. See World Travel, 861 F.2d at 1029. In this case, immediate injunctive relief is necessary to protect the public from further financial harm caused by the misrepresentations of and violations by the Defendants of the FTCA, the CFA, the TSR and the CROA.\n\nThe Plaintiffs argue it is in the public interest to issue a preliminary injunction in the instant case. The Defendants, however, contend the public interest would not be advanced if NCMG were preliminarily enjoined from \"distributing true and accurate informational materials.\" See Opposition at 36. Further, the Defendants argue the public interest is not benefitted by the actions of the State of New Jersey spurning the attempts of NCMG to conform its conduct with applicable statutes. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\" See id.\n\nThe proposed preliminary injunction is designed to restrain NCMG and the Individual Defendants from making the false and deceptive statements that have permeated their business operations and mislead unsuspecting innocent consumers. Such a prohibition does not work any undue hardship on the Defendants. The Defendants do not have the right to persist in conduct that violates Federal or state law. See Federal Trade Comm'n v. World Wide Factors, Ltd., 882 F.2d 344, 347 (9th Cir. 1989) (upholding finding of \"no oppressive hardship to the defendants in requiring them to comply with the [FTCA], refrain from fraudulent representation or preserve their assets from dissipation or concealment\").\n\nAlthough the actual credit materials disseminated by the Defendants contains factually accurate information, it is the means by which the Defendants are advertising and solicitating customers that is problematic. The sheer number of telephone calls received by NCMG further supports the need to take action to protect the public. The imposition of this preliminary injunction provides the needed protection to those members of the public who suffer from economic difficulties, which are compounded by the predatory conduct of the Defendants.\n\nC. Individual Defendants Are Liable\n\nIndividual liability pursuant to Section 5 of the FTCA for the acts of a corporation can be based upon either an individual having: (1) directly participated in the violative actions, (2) played a part in controlling, directing or formulating the policies and practices of the company which violate Section 5, or (3) the authority to control the actions of other individuals combined with the actual or constructive knowledge that those individuals were committing misrepresentations. See National Invention Servs., Inc., 1997 WL 718492, at *4 (citations omitted); Amy Travel Serv., Inc., 875 F.2d at 573; see also United States v. Building Inspector of Am., 894 F. Supp. 507, 518 (D.Mass. 1995) Federal Trade Comm'n v. Sharp, 782 F. Supp. 1445, 1449 (D.Nev. 1991). This same standard should be applied in determining whether members of a limited liability company, such as NCMG, should be held individually liable.\n\nThe Plaintiffs argue the Individual Defendants are liable for the challenged acts and practices because they had the ability to control violations and had actual knowledge that the violations were taking place. See Moving Brief at 33.\n\nG. Buzzetti is the Chief Executive Officer, President, and a co-owner of NCMG. See Smith Cert. at P 8; G. Buzzetti Dep. attached as Exh. E to Smith Cert. at p. 12, lines 5-7. He manages the day-to-day affairs of NCMG and supervises the telemarketers. Among other things, he has responded to complaints forwarded from the BBB and has held-himself out as a manager. See Attachment F to Stocksill Cert. The signature of G. Buzzetti appears on some of the canceled demand drafts and some of the refund checks. He participated in the misrepresentations by producing a number of the advertisements. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 34, line 17 to p. 35, line 24.\n\nFerguson is the Chief Financial officer, Vice President, and co-owner of NCMG. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 13, lines 6-10; Ferguson Dep. attached as Exh. E. to Smith Cert. at p. 10, lines 3-10. He works daily at NCMG and assists in managing the daily affairs of NCMG. Also, Ferguson supervises the distribution and compliance departments at NCMG. He signs refund checks.\n\nThe Plaintiffs have established the reasonable probability they will be able to prove the Individual Defendants either orchestrated the deceptive practices of NCMG or, at the very least, knew about these practices through the managerial roles they played and encouraged and permitted these practices to continue. See National Invention Servs., Inc., 1997 WL 718492, at *5. Accordingly, individual liability for the imposed injunctive relief is appropriate.\n\nD. Asset Freeze and Appointment of Receiver\n\n1. Asset Freeze\n\nSection 13(b) of the FTCA states \"that in proper cases the [FTC] may seek, and after proper proof, the court may issue, a permanent injunction.\" Section 13(b). Section 13(b) provides a Federal court with broad power to fashion appropriate remedies for violations of the FTCA. See Federal Trade Comm'n v. Pantron I Corp., 33 F.3d 1088, 1102 (9th Cir. 1994), cert. denied, 514 U.S. 1083, 131 L. Ed. 2d 722, 115 S. Ct. 1794 (1995). The remedial authority provided in Section 13(b) is not limited to the power to issue an injunction; rather, this power includes the ability \"to grant any ancillary relief necessary to accomplish complete justice.\" See id. This power possessed by a Federal court includes the authority to order restitution. See id. (citation omitted). \"A corporation is liable for monetary relief under Section 13(b) if the FTC shows that the corporation engaged in misrepresentations or omissions of a kind usually relied on by reasonably prudent persons and that consumer injury resulted.\" Id. (citation omitted).\n\nPart of the relief sought by the Plaintiffs is restitution to those consumers defrauded by the misrepresentations made by NCMG. To preserve the possibility of such relief, the Plaintiffs argue a freeze of the assets of the Defendants and the appointment of a receiver to prevent concealment or dissipation of assets pending final resolution of this case is needed. See Moving Brief at 37. In essence, the Plaintiffs contend an asset freeze is necessary in the instant case so as to preserve assets for effective final relief in the form of consumer redress. See id.\n\nIt has been determined a reasonable consumer would be misled by the advertisements and oral representations made by NCMG. Advertisements of the credit services offered by NCMG are widely disseminated. The Plaintiffs have submitted certifications from but a few of the individuals throughout the country who have fallen victim to the deceptive practices of NCMG. Presently, there is no way to determine how many consumers across the country were similarly misled. The certifications demonstrate the bank accounts of consumers were debited, often repeatedly, by the Defendants without proper authorization. Because Plaintiffs are likely to prevail in their claim for consumer redress, a freeze of the assets of all Defendants is appropriate to preserve those assets for possible restitution awards.\n\nThis form of temporary relief is also warranted considering NCMG appears to be experiencing financial difficulties. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\" See Dolan Cert. at P 1. NCMG has failed to stay current with one of its primary suppliers, United Parcel Services (\"UPS\"). See id. Recently, UPS has ceased doing business with NCMG because of an undisputed, outstanding bill in the amount of $ 98,600.00. See id. NCMG indicated to UPS it did not have the funds available to satisfy the bill. See id.\n\nThe Plaintiffs contend this freeze should extend to the assets of the Individual Defendants. See Moving Brief at 38. A freeze of the assets of the Individual Defendants is warranted because their knowledge of, encouragement of and participation in the practices which violated the FTCA, the CFA, the CROA, and the TSR and their failure to act within their authority to control those practices makes them liable for monetary damages. See World Travel, 861 F.2d at 1031; see also National Invention Servs., Inc., 1997 WL 718492, at *4 (citations omitted); Amy Travel Serv., Inc., 875 F.2d at 573; see also Building Inspector of Am., Inc., 894 F. Supp. at 518; Sharp, 782 F. Supp. at 1449.\n\nWhen, as in this case, business operations are permeated by misrepresentations and fraud, the likelihood that assets may be dissipated during the pendency of the legal proceedings is strong. See Commodity Futures Trading Comm'n v. American Metals Exchange, 991 F.2d 71, 79 (3d Cir. 1993) (citation omitted). In the instant matter, absent a freeze, meaningful consumer redress is unlikely, especially in light of the recent economic difficulties experienced by NCMG. The Individual Defendants, however, should be able to withdraw funds for normal personal expenses.\n\n2. Appointment of a Receiver\n\nThe Plaintiffs contend appointing a receiver over NCMG is also essential to maintain the status quo, and to prevent the destruction of documents and the concealment or dissipation of company assets when the Defendants have engaged in fraud or deceptive conduct. See Moving Brief at 39. The Plaintiffs further argue the many deceptive practices engaged in by the Defendants and the propensity to change these practices only if economically justifiable further warrant the appointment of a receiver. See Reply at 14.\n\nThe Defendants contend the appoint of a receiver is unnecessary because in the instant matter there are no violations of previous agreements or court orders, no evidence of flight and no serious threat of the dissipation of assets. See Opposition at 37. The Defendants further argue they have been cooperating with the State of New Jersey for more than thirteen months during its investigation of NCMG and have turned over all requested information. See id. Also, in support of this argument, the Defendants contend NCMG pays its taxes and employs nearly 250 individuals who would be adversely affected by such an appointment, \"especially on the paucity of the investigatory record.\" See id.\n\nThe appointment of a receiver, while an extraordinary remedy, is appropriate where \"fraud, or the imminent danger of property being lost, injured, diminished in value or squandered, and where legal remedies are inadequate.\" Leone Indus. v. Associated Packaging Inc., 795 F. Supp. 117, 120 (D.N.J. 1992) (citing McDermott v. Russell, 523 F. Supp. 347, 352 (E.D.Pa. 1981), aff'd, 722 F.2d 732 (3d Cir. 1983)). Precisely that situation exists here. A temporary receiver can preserve records and make an accounting that will assist in (1) identifying the assets of the Defendants, (2) determining the size and the extent of the fraud, and (3) identifying the individuals injured.\n\nThe Plaintiffs argue when the FTC has made a showing of deceptive practices in circumstances where dissipation of assets and destruction of documents are foreseeable, courts have not hesitated to appoint receivers in the past. See Moving Brief at 40 (citing Federal Trade Comm'n v. American National Cellular, Inc., 810 F.2d 1511 (9th Cir. 1987) (affirming without discussion appointment of receiver); Federal Trade Comm'n v. U.S. Oil \u0026 Gas Corp., 748 F.2d 1431, 1431 (11th Cir. 1984) and American Metals Exchange, 991 F.2d at 73)). Accordingly, it appears the appointment of a temporary receiver is appropriate and necessary to maintain the status quo in the instant matter considering the aforementioned deceptive practices of the Defendants and the threat of the dissipation of assets.\n\nE. Bond\n\nBefore a preliminary injunction may be issued, the applicant for the injunction usually must give security\n\nin such sum as the court deems proper, for the payment of such costs and damages as may be incurred or suffered by any party who is found to have been wrongfully enjoined or restrained.\n\nFed. R. Civ. Pro. 65(c) (\"Rule 65(c)\"); Elliott v. Kiesewetter, 98 F.3d 47, 59-60 (3d Cir. 1996) (stating security must be given unless balance of equities weighs overwhelmingly in favor of party seeking injunction and then district court has discretion to waive Rule 65(c) bond requirement after proper finding). Rule 65 specifically excepts the Federal Government and its agencies from this requirement. See Rule 65; see also Opposition at 38. Accordingly, the FCC need not post bond in the instant matter. Consequently, the State of New Jersey is not automatically exempted from this requirement. See Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405.\n\nThe Third Circuit has interpreted the bond requirement pursuant to Rule 65 quite strictly. See Elliot, 98 F.3d at 59; Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405 (citing Hoxworth v. Blinder, Robinson \u0026 Co., Inc., 903 F.2d 186, 210 (3d Cir. 1990)). The Hoxworth court observed:\n\nalthough the amount of the bond is left to the discretion of the court, the posting requirement is much less discretionary. While there are exceptions, the instances in which a bond may be required are so rare that the requirement is almost mandatory. We have previously held that absent circumstances where there is no risk of monetary loss to the defendant, the failure of a district court to require a successful applicant to post a bond constitutes reversible error.\n\nId. at 210; Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405. The issuance of an improper interlocutory order \"may harm the defendant and a bond provides a fund to use to compensate incorrectly enjoined defendants.\" Instant Air Freight Co., 882 F.2d at 804; Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405. The bond requirement also \"deters rash applications for interlocutory orders; the bond premium and the chance of liability on it cause plaintiff to think carefully beforehand.\" Instant Air Freight Co., 882 F.2d at 804; Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405.\n\nThe protection afforded by the imposition of a bond is important for two reasons. Generally, with rare exceptions, a defendant wrongfully enjoined only has recourse against the bond. As the Supreme Court has observed: \"A party injured by the issuance of an injunction later determined to be erroneous has no action for damages in the absence of a bond.\" Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405 (quoting W.R. Grace \u0026 Co. v. Local Union 759, Int'l Union of United Rubber, Cork, Linoleum and Plastic Workers, 461 U.S. 757, 770 n.14, 76 L. Ed. 2d 298, 103 S. Ct. 2177 (1983)); see also Elliot, 98 F.3d at 59. And since a preliminary injunction is granted before a trial is held on the merits, the possibility it was incorrectly imposed is a reality. See Clark v. K-Mart, 979 F.2d 965, 968 (3d Cir. 1992); Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405.\n\nIn Hoxworth, the court observed, \"while there are exceptions, the instances in which a bond may not be required are so rare that the requirement is almost mandatory.\" 903 F.2d at 210 Notwithstanding this strict reading of Rule 65(c), there may be instances in which a strict reading of the Rule 65(c) is inappropriate.\n\nIn Temple University v. White, 941 F.2d 201 (3d Cir. 1991), cert. denied sub nom. 502 U.S. 1032, 116 L. Ed. 2d 778, 112 S. Ct. 87 (1992), the Circuit recognized an exception to the bond requirement pursuant to Rule 65(c). See id. at 219. Relying upon an approach utilized by the First Circuit, the court in Temple University determined, \"at least in noncommercial cases, the court should consider the possible loss to the enjoined party together with the hardship that a bond requirement would impose on the applicant.\" Id. (quotation omitted); see Elliot, 98 F.3d at 59-60 (quoting Temple University, 941 F.2d at 219); Waterfront Comm'n of NY Harbor, 928 F. Supp. 1388 at 1405. Also, a court should consider the effect the bond requirement would have on the \"enforcement of important Federal rights or 'public interests,' arising out of comprehensive federal health and welfare statutes.\" Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405 (citing Temple University, 941 F.2d at 219).\n\nThus, the exception proffered in Temple University involves a balance of the equities of the potential hardships that each litigant would suffer as a result of the imposition of a preliminary injunction. See Elliot, 98 F.3d at 60. When the balance of these equities overwhelmingly favors the party seeking the injunction, a district court has the discretion to waive the Rule 65(c) bond requirement. See id.\n\nThe scope of the possible loss to NCMG is unclear. According to the evidence, NCMG receives a daily estimate of 5,000 weekday and 1,500 weekend \"inbound\" call from consumers. See Smith Cert. at P 13. On average, five to nine percent of these consumers purchase the Initial Analysis offered by NCMG for $ 95.00. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 58, lines 1-7. The number of consumers who then go on to purchase the Program is unknown. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\" See id. at p. 80, lines 4-18.\n\nThe State of New Jersey is not an impecunious party. There is no reason that it cannot set aside adequate revenues to satisfy a bond requirement in the instant matter. No economic hardship or duress will be imposed upon the State of New Jersey by the imposition of a bond. In addition, the State of New Jersey, through the New Jersey Attorney General, is explicitly charged with protecting the public interest by enforcing the CFA. In some instances, the bond requirement could conceivably impede the ability of the State of New Jersey to fulfil its role. But that is not the situation here. See Waterfront Comm'n of NY Harbor, 928 F. Supp. at 1405-06 (holding a bi-state commission was not exempt from the bond requirement and imposing a bond of $ 60,000 indicating a larger sum was unnecessary).\n\nBased upon the above analysis, it has been determined that, under the standard set forth in Temple University, the State of New Jersey should not be exempt from the bond requirement. At the same time, a large bond is unnecessary.\n\nThe computation of the bond amount may be set \"in such sum as the court deems proper.\" Rule 65(c); see Hoxworth, 903 F.2d at 210; Waterfront Comm'n of NY Harbour, 928 F. Supp. at 1405; see also Maryland Dep't of Human Resources v. United States Dep't of Agriculture, 976 F.2d 1462, 1483 (4th Cir. 1992). In the instant matter, the State of New Jersey is attempting to provide for the public interest by enforcing a law enacted to protect consumers from unfair commercial practices. As indicated, although the State of New Jersey is not exempt from the bond requirement, the posting of a large bond is not required. Under the circumstances, a $ 10,000 bond will suffice.\n\nIII. CONCLUSION\n\nFor the reasons stated, the Order to Show Cause seeking a Preliminary Injunction is granted.\n\nDated: 25 March 1998\n\n\u003cspan class=\"fn\"\u003e1. Collectively, G. Buzzetti and Ferguson will be referred to as the Individual Defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. During a hearing on 3 March 1998 (the \"3 March 1998 Hearing\"), the FTC and the State of New Jersey agreed to consolidate their complaints (the \"Consolidated Complaint\"). See Transcript from 3 March 1998 Hearing at p. 14, line 16 to p. 15, line 2. Counsel for the State of New Jersey indicated it was necessary for a group of commissioners from the FTC to approve the Consolidated Complaint as the commissioners had approved the complaint initially filed by the State of New Jersey. See id. at p. 14, lines 16-21. The Plaintiffs were directed to file the Consolidated Complaint with leave to amend if changes were necessary. See id. at p. 14, line 22 to p. 15, line 1. A second amended consolidated complaint (the \"Second Consolidated Complaint\") was filed on 23 March 1998.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Section 13(b) of the FTCA, 15 U.S.C. § 53(b), states \"that in proper cases the [FTC] may seek and after proper proof the court may issue, a permanent injunction.\" Id. This granting of permanent injunctive power \"'also [gives a] court authority to grant any ancillary relief necessary to accomplish complete justice because it [does] not limit the traditional equitably power explicitly or by necessary and inescapable inference.'\" FTC v. Amy Travel Serv. Inc., 875 F.2d 564, 571 (7th Cir.) (quoting Federal Trade Comm'n v. World Travel Vacation Brokers, Inc., 861 F.2d 1020, 1026 (7th Cir. 1988)), cert. denied, 493 U.S. 954, 107 L. Ed. 2d 352, 110 S. Ct. 366 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Plaintiffs initially sought a temporary restraining order (a \"TRO\"), as well as a preliminary injunction. At the 3 March 1998 Hearing, the Plaintiffs agreed to treat the hearing as one seeking a preliminary injunction rather than one seeking a TRO. See Transcript from 3 March 1998 Hearing at p. 35, lines 18, 21-22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In support of the Order to Show Cause, the Plaintiffs submitted: the Joint Memorandum Supporting Plaintiff's Application for Preliminary Injunctive Relief; Certification of Terry Smith (the \"Smith Cert.\"), attaching Exhibits A-U; Consumer Certifications including the Declaration of Anthony E. Alston (the \"Alston Decl.\") with attached Exhibit, Declaration of Pamela Anderson (the \"Pamela Anderson Decl.\"), Declaration of Patricia J. Anderson (the \"Patricia Anderson Decl.\"), Certification of Jennifer Brooks (the \"Brooks Cert.\"), Certification of Dwight Cheek (the \"Cheek Cert.\"), Declaration of Leroy Clark (the \"Clark Decl.\") with attached Exhibits A-S, Declaration of Gina Marie DeFalco (the \"DeFalco Decl.\") with Attachment A, Certification of Mary Ann Domenico (the \"Domenico Cert.\"), Declaration of Mark K. Deshaies (the \"Deshaies Decl.\") with Attachments A-D, Certification of Alfred Eleby (the \"Eleby Cert.\"), Certification of Darlene Hunter (the \"Hunter Cert.\") with Attachments, Certification of Patricia L. Johnson (the \"Johnson Cert.\"), Declaration of Donna S. Kepshire (the \"Kepshire Decl.\") with Attachments A-G, Declaration of Roberta Leos (the \"Leos Decl.\"), Declaration of Winkeysha R. Lewis (the \"Lewis Decl.\") with Attachments A-E, Certification of Jarvis M. Parker (the \"Parker Cert.\"), Declaration of Rachel E. Pettit (the \"Pettit Decl.\") with Attachments A-B, Declaration of Michael Prine (the \"Prine Decl.\") with Attachments A-B, Declaration of Carol Shuler (the \"Shuler Decl.\") with Attachments A-D, Certification of Richard R. Struble Jr. (the \"Struble Cert.\"), Declaration of Sean Stocksill (the \"Stocksill Decl.\") with Attachments A-F, Declaration of Eddy Strait (the \"Strait Decl.\") with Attachments A-B, Certification of Carol L. Torres (the \"Torres Cert.\"), Declaration of Stacy Upchurch (the \"Upchurch Decl.\") with Attachment A, Certification of Christina Lynn Whited (the \"Whited Cert.\"); Miscellaneous Certifications including the Affidavit of Gregory R. Aube (the \"Aube Aff.\"), Declaration of Mitchell A. Gross (the \"First Gross Decl.\") with attached Exhibit 1, Declaration of Mitchell A. Gross (the \"Second Gross Decl.\") with attached Exhibit 1, Declaration of Clarice K. M. McCauley (the \"McCauley Decl.\") with attached Exhibit 1; Certification of Sylvine A. Marabotto (the \"Marabotto Cert.\"), Declaration of Jane Moscowitz (the \"Moscowitz Decl.\") with attached Exhibits A-C, Letter dated 22 April 1997 from Federal Trade Commission to Jerome S. Lamet, Esq. (the \"22 April 1997 Letter from the FTC\"); Plaintiffs' Factual and Procedural Chronology (the \"Plaintiffs' Chronology\"); Plaintiffs' Joint Reply Brief (the \"Reply\"); Supplemental Certification of Terry Smith (the \"Supp. Smith Cert.\") with Attachments; Certification of Pat Dolan (the \"Dolan Cert.\"); Certification of Samier Tadros (the \"Tadros Cert.\"). In opposition to the Order to Show Cause, the Defendants submitted: NCMG's Brief in Opposition to Request for Preliminary Restraints; Certification of David Szwak (the \"Szwak Cert.\"), Certification of Glen R. Buzzetti (the \"G. Buzzetti Cert.\") including an Advertising Video annexed as Exhibit 5 and an Instructional Video annexed as Exhibit 13; Certification of Irene F. Weekley, Certification of Joseph Ferguson (the \"Ferguson Cert.\"); Certification of Richard Ornitz (the \"Ornitz Cert.\"); Certification of Albert L. Buzzetti, Esq. (the \"A. Buzzetti Cert.\"), Certification of William Harla, Esq., Procedural and Factual Chronology (the \"Defendants' Chronology\"); NCMG's Statement of Material and Undisputed Facts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The suit commenced by the FTC was captioned Federal Trade Commission v. National Credit Management Group, L.L.C., et al., Civil Action Number 98-935.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The suit initially filed by the State of New Jersey was captioned Peter Verniero, Attorney General of New Jersey v. National Credit Management Group, L.L.C, et al., Civil Action Number 98-936.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. By order, dated 17 March 1998 (the \"17 March 1998 Order\"), the caption was amended to In Re National Credit Management Group, L.L.C.; Glen Buzzetti, individually and as an officer of National Credit Management Group, L.L.C.; and Joseph Ferguson, individually and as an officer of National Credit Management Group, L.L.C., Civil Action Number 98-936. See 17 March 1998 Order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. At the 20 March 1998 Hearing, the Parties were asked numerous times if they wished to submit any new information not previously covered by their briefs or affidavits. See Transcript from 20 March 1998 Hearing at p. 3, lines 13-16; p. 7, lines 20-24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. This address belongs to a Mail Boxes Etc. store location. See Smith Cert. at P 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. G. Buzzetti employs his brother, Anthony Buzzetti as his attorney. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 23, line 24 to p. 24, line 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. So-called personalities such as Dr. Dre, Ad Lovers, Steve O'Brien and Pros of the Fujis appear in these commercials. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 37, lines 1-24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It appears the State of New Jersey was kept apprised of the Illinois Action. See A. Buzzetti Cert. at P 6. A memorandum, dated 31 March 1997, (the \"31 March 1997 Memorandum\") from Terry Smith (\"Investigator Smith\"), an investigator with the State of New Jersey Department of Law and Public Safety Division of Consumer Affairs, Office of Consumer Protection (the \"OCP\"), indicated he spoke with an attorney at the Illinois Attorney General Office who indicated oral argument \"did not go well.\" See 31 March 1997 Memorandum. Smith indicated \"to avoid an adverse ruling the FTC has asked that the case be dismissed.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The OCP served the summons and complaint upon NCMG on behalf of the Illinois Attorney General in the Illinois Action. See Plaintiffs' Chronology at 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In the most recent version of advertisements for NCMG, all references to the word \"approved\" have been discontinued. See G. Buzzetti Cert. at P 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. FCRA is the acronym for the Fair Credit Reporting Act. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 55, lines 16-17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The NCMG representative sometimes also inquires if the consumer has previously filed a bankruptcy petition or if the consumer is presently in credit counseling. See Deposition of Richard Ornitz (the \"Ornitz Dep.\"), dated 12 December 1997, attached as Exh. K to Smith Cert. at p. 16, line 20 to p. 17, line 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. During a second taped conversation with a NCMG representative, a representative similarly stated: The first step is to provide you with a personal credit analysis. We assign a trained credit analyst to your case who will provide you with information with respect to your profile so that you may attempt to establish and/or re-establish your credit. Transcript attached to Second Gross Cert. at p. 5, line 22 to p. 6., line 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Plaintiffs contend this is a conservative estimate of the missing verification tapes because many consumers fell victim to the two-step solicitation for both the Initial Analysis and the Program. See Moving Brief at 5 n.3. Thus, the Plaintiffs argue for those consumers, there should have been two verification tapes. See id. The Plaintiffs contend if one counts by transaction rather than by consumer, the percentage of unverified -- and hence unauthorized -- sales rises to over fifty percent. See id. Ferguson testified NCMG relocated its offices in August or September 1996 and some of the verifications were likely misplaced or inadvertently thrown out during the move. See Ferguson Dep. attached as Exh. E to Smith Decl. at p. 68, line 20 to p. 70., line 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The cost of obtaining credit reports ranged from $ 3.00 to $ 12.00. See G. Buzzetti Dep. attached as Exh. G to Smith Cert. at p. 8, lines 6-17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. A \"phone check\" is a negotiable instrument created and printed by the payee using the bank institution and account micro-encoding information printed across the bottom of the checks of the payor. It visually resembles a real check but is signed by the payee and references an authorization by the payor. See, e.g., Attachments A and C to Deshaies Cert.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. One consumer, Donna Kepshire, sent a certified letter, return receipt requested, the day after she agreed to the $ 95.00 debit in which she canceled her agreement to have her checking account debited by NCMG. See Kepshire Decl. at P 4 and Attachment A. She also called NCMG directing it to refrain from debiting her account and notified it she had sent a certified letter to that effect. See Kepshire Decl. at P 5. Although she was assured by a NCMG representative her account would not be debited, approximately one week later she received an insufficient funds notice from her bank due to an attempted debit by NCMG. See id. at P 6. She immediately called NCMG and was told that there was no record of her cancellation, but since the draft had been returned for insufficient funds, the NCMG representative would mark it canceled and she need do nothing more. See id. at P 6. Three weeks later, NCMG made a successful attempt at debiting her account. See id. at P 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Discretion as to pricing lies solely with the telemarketer whose salary is wholly based upon commission from the sales of the Program. See Katherine Lucena Deposition (the \"Lucena Dep.\") attached as Exh. H to Smith Decl. at p. 12, lines 10-19 and p. 32, line 23 to p. 33, line 7. Other than distinguishing between consumers who are establishing or re-establishing credit, the Program and Package are the same whether the consumer is charged $ 300.00 or $ 1400.00. See Smith Cert. at P 26; Lucena Dep. attached as Exh. H to Smith Cert. at p. 50, line 23 to p. 51, line 5; G. Buzzetti Dep. attached as Exh. G at p. 18, lines 1-10. NCMG indicates fees associated with the purchase of the Program have recently been capped at $ 700.00 or $ 900.00 depending upon whether the consumer is purchasing the Package for establishing or re-establishing credit. See Opposition at 6; G. Buzzetti Cert. at P 31. Discretion remains with the credit analysts to set the appropriate fee.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Package for consumers seeking to establish credit includes: a \"Disclosure Agreement,\" a \"Guarantee,\" a \"Payment Schedule,\" a \"National Credit News\" one-page flyer, a \"Consumer Alert\" one-page flyer, a \"Credit Bureau Letters\" flyer, an \"Instructions\" flyer on how to use the \"Credit Bureau Letters\" flyer and how to use the \"Payment Schedule\" to enter NCMG's \"phone checks\" in the consumer's checkbook, a \"Mortgage Express\" list of contacts in each state, an \"Auto Express\" list of contacts in each state, a flow chart of \"What does [NCMG's] [Program] include???,\" and nine business envelopes of which six are addressed to NCMG and three are blank. See Attachment One to 8 December 1997 A. Buzzetti Letter attached as Exh. Q to Smith Cert. For those consumers who are attempting to re-establish credit, NCMG sends the above-itemized materials as well as a booklet entitled \"Establishing and Re-Establishing Credit\" with additional sample letters and instructions on how to read credit reports and dispute information contained on these reports. See Attachment Two to 8 December 1997 A. Buzzetti Letter attached as Exh. Q to Smith Cert.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Specifically, the Disclosure Agreement states in pertinent part: THE FOLLOWING IS INFORMATION CONCERNING [NCMG'S] CREDIT INFORMATION PROGRAM ON CREDIT EDUCATION. THIS AGREEMENT IS FOR EDUCATIONAL PURPOSES ONLY. YOUR VERBAL AUTHORIZATION HAS BEEN RECORDED FOR QUALITY CONTROL PURPOSES. DISCLOSURE DOES NOT HAVE TO BE SIGNED TO BIND THE PARTIES. Disclosure Agreement attached as Exh. Q to Smith Cert. at 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. For example, during a portion of the relevant period at issue, the rescission policy of NCMG was not set forth on the Disclosure Agreement but only in the Payment Terms. See Versions of Disclosure Agreement attached to Smith Cert. as Exh's. R (March 1996, April 1996, May 1996, July 1996 and other months where date is illegible) and S (September 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. NCMG indicates it has recently installed a new \"800\" toll-free extension and has added operators to assist in the fielding of consumer inquiries as well as cancellation requests. See G. Buzzetti Cert. at P 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. CCCS, a nonprofit community services program, provides assistance to consumers in need of credit counseling or debt management skills. See Marabotto Cert. at PP 1, 5. Consumer counselors at CCCS pass a national examination and are enrolled in annual continuing education classes. See id. at P 4. CCCS charges $ 35.00 for the initial counseling session, which can be waived in cases of extreme hardship. See id. at P 12. Additionally, there is a monthly fee of between $ 15.00 to $ 25.00 for participation in the debt management program. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The Defendants argue the traditional equitable standard previously set forth above should govern the instant controversy instead of the statutory injunction test. See Opposition at 14. The Defendants argue Section 13(b) of the FTCA is a statutory codification of the traditional standard. See id. (citing Section 13(b)). Section 13(b) states: \"Upon a proper showing that, weighing the equities and considering the FTC's likelihood of ultimate success, such action would be in the public interest ... a [TRO] or a preliminary injunction may be granted without bond.\" The Seventh Circuit examined this issue in World Travel, and held that the legislative history of Section 13(b) clearly indicated the traditional equity standard did not apply. See 861 F.2d at 1028. The court observed \"'the Conferees did not intend, nor do they consider it appropriate, to burden the [FTC] with the requirements imposed by the traditional equity standard which the common law applies to private litigations.'\" Id. at 1028-29 (quoting Conf.Rep.No. 624, 93d Cong., 1st Sess. 11 (1973), reprinted in 1973 U.S.Code Cong. \u0026 Admin.News 2417, 2533) (other citations omitted)). This reasoning is persuasive and, accordingly, the argument of the Defendants need not be further addressed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The Supreme Court in addition to other Federal courts expansively interpret both the scope of the FTCA and the powers granted to the FTC thereunder. See Sandoz Pharmaceuticals Corp. v. Richardson-Vicks, Inc., 902 F.2d 222, 226 (3d Cir. 1990) (citing Federal Trade Comm'n v. Colgate-Palmolive Co., 380 U.S. 374, 13 L. Ed. 2d 904, 85 S. Ct. 1035 (1965); American Home Prods. Corp. v. Federal Trade Comm'n, 695 F.2d 681 (3d Cir. 1982)). This broad view of the capacity of the FTC to both define and regulate unfair trade practices is based upon the FTC's \"familiarity with the expectations and beliefs of the public, acquired by long experience.\" Id. (quoting American Home Prods., 695 F.2d at 686).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Similarly, the Defendants contend NCMG received nearly one million telephone calls in 1997 and has over 200,000 clients but the investigation of the State of New Jersey is only based upon 280 complaints. See Opposition at 7. The Defendants further contend Investigator Smith only contacted approximately twenty-five of these consumers who filed complaints. See id. at 8. As indicated above, the number of complaints filed is not determinative to the decision of whether a violation of Section 5 has occurred. See Wilcox, 926 F. Supp. at 1099 (quoting U.S. Sales Corp., 785 F. Supp. at 748). The FTC need only demonstrate a reasonable consumer, not a majority or even a substantial number of consumers, would be mislead by the advertisements. See id. (quoting U.S. Sales Corp., 785 F. Supp. at 748). Accordingly, the argument of the Defendants that only a limited number of consumers complained about the practices and procedure of NCMG is meritless and need not be addressed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. For example, NCMG sends consumers secured credit card applications from First Consumers National Bank (\"FCNB\"). See Moving Brief at 14. In 1997, FCNB declined more than thirty-eight percent of the total applications for the secured credit cards it received. See Aube Aff. at P 7. Although the exact percentage of customers of NCMG who were approved for the credit card offered by FCNB has not been provided, FCNB issues secured credit cards only to those applicants who are considered to be credit worthy under defined credit criteria. See id. at P 5. The criteria FCNB considers does not include awarding NCMG customers a preferred status. Accordingly, it can be assumed the acceptance rate for NCMG customers, who typically suffer from credit problems, is no higher, and probably much lower, than the total acceptance rate of FCNB.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The scripts used by NCMG representatives which outline the current practices of NCMG were all revised as of 9 March 1998. See Current Scripts attached to Ornitz Cert. The scripts that were used by NCMG since it commenced business were produced during the investigation conducted by the FCC and the State of New Jersey as recently as November and December 1997.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The legislative history of the CFA states: the purpose of [the CFA] is to permit the Attorney General to combat the increasingly widespread practice of defrauding the consumer. The authority conferred will provide effective machinery to investigate and prohibit deceptive and fraudulent advertising and selling practices which have caused extensive damage to the public. J \u0026 R Ice Cream Corp. v. California Smoothie Licensing Corp., 31 F.3d 1259, 1272 (3d Cir. 1994) (citing Kugler v. Romain, 58 N.J. 522, 545, 279 A.2d 640 (1971)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The New Jersey Attorney General is vested with jurisdiction to enforce the CFA through a number of mechanisms. See N.J.S.A. 56:8-1 to -8, -11, -15 to -18, \u0026 20. The New Jersey Attorney General enforces the CFA through the Division of Consumer Affairs. See Lemelledo v. Beneficial Management Corp. of Am., 150 N.J. 255, 264, 696 A.2d 546 (1997). The New Jersey Attorney General may initiate suit to discontinue any unlawful practice, to collect penalties, or to recover losses born by any victim. See Miller v. American Family Publishers, 284 N.J. Super. 67, 76, 663 A.2d 643 (Ch. Div. 1995). Only a showing of a violation of the CFA need be demonstrated. See id. Private plaintiffs may also commence suits under the CFA. See Miller, 284 N.J. Super. at 76. An additional showing of ascertainable loss as a result of the illegal conduct must be established by a private plaintiff though. See id. (quoting Meshinsky v. Nichols Yacht Sales, Inc., 110 N.J. 464, 473, 541 A.2d 1063 (1988)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. A third type of violation of the CFA also exists, but is not defined in Section Two. See Miller, 284 N.J. Super. at 74 n.2; see also Cox, 138 N.J. at 17. Pursuant to N.J.S.A. 56:8-4, the Division of Consumer Affairs may implement regulations which have the force of law. See N.J.S.A. 56:8-4. A violation of such a regulation will be considered a violation of the CFA. See Miller, 284 N.J. Super. at 74 n.2 (citing Cox, 138 N.J. at 18-19). This type of violation is not at issue in the instant matter and need not be discussed further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The State of New Jersey correctly indicates whether this revocation would constitute a breach of contract is not presently at issue. See Moving Brief at 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Inspector Smith states a number of the tapes NCMG did produce contain questionable authorizations. See Supp. Smith Cert. at P 7. Inspector Smith states that in some of the tapes two voices were not heard and only the voice of the NCMG representative was audible. See id. See, e.g. Transcriptions of Verifications for Darius Osborne and Tammy McGill attached to the Supp. Smith Cert.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The State of New Jersey admits NCMG likely incurs costs associated with verifying the micro-encoding information provided by the consumer, but argues this only benefits NCMG and not the consumer. See Moving Brief at 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. An employee who had worked in the customer service department estimated that at least seventy percent of the incoming calls to the department are from dissatisfied customers who desire a refund. See Tadros Cert. at P 9. This employee stated that when a consumer calls NCMG and demands a refund, a NCMG representative pulls up the client card for that customer on a computer and marks the reason for granting a refund. See id. at P 13. One of the lines in this field is \"BBB, Attorney General, other agencies\" and another field included \"media, private attorney.\" See id. The employee stated \"if a consumer mentioned either [Ferguson] or [G. Buzzetti] by name, [the NCMG representative] would note 'BBB, AG, other agency' and also tell Dick Ornitz personally.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The right of rescission serving as the sole way to cancel the Program before the two-year period has ended directly contradicts the statements previously utilized by NCMG indicating the consumer is an \"applicant\" who must sign and return the contractual papers included in the Package. Previous versions of the documents used by NCMG contained lines for the signature of an \"applicant.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Section 310 of the TSR implements the TCFA. See 16 CFR § 310.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The business practices of the Defendants are covered by the TSR. NCMG is a \"telemarketer\" or \"seller\" within the meaning of the TSR. See 16 C.F.R. § 310.2(r),(t), and (u). NCMG markets its program by the use of one or more interstate telephone calls. See 16 C.F.R. § 310.2(u). The representations of NCMG also indicate a high likelihood of success in obtaining credit for consumers. See, e.g., Videotape included as Exh. AA to Smith Cert. Consumers who telephone the toll-free number \"1-800-YES-CREDIT\" speak with a NCMG telemarketer who indicates a credit analysis will improve the ability of a consumer to obtain credit in exchange for an advance payment of $ 95.00. See, e.g., Struble Cert. at P 7. Although the TSR generally does not apply to calls made by consumers in response to general media advertisements, the Plaintiffs correctly contend TSR applies to the practices of NCMG of representing a high likelihood of success in obtaining loans or other extensions of credit for consumers and charging an advance fee for these services. See 16 C.F.R. § 310.6(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Section 310.3(a) states: Prohibited deceptive telemarketing acts or practices. It is a deceptive telemarketing act or practice and a violation of this Rule for any seller or telemarketer to engage in the following conduct: .... (3) Obtaining or submitting for payment a check, draft, or other form of negotiable paper drawn on a person's checking, savings, share, or similar account, without that person's express verifiable authorization. Such authorization shall be deemed verifiable if any of the following means are employed: (i) Express written authorization by the customer, which may include the customer's signature on the negotiable instrument; or (ii) Express oral authorization which is tape recorded and made available upon request to the customer's bank and which evidences clearly both the customer's authorization of payment for the goods and services that are the subject of the sales offer and the customer's receipt of all of the following information: (A) The date of the draft(s); (B) The amount of the draft(s); (C) The payor's name; (D) The number of draft payments (if more than one); (E) A telephone number for customer inquiry that is answered during normal business hours; and (F) The date of the customer's oral authorization; or (iii) Written confirmation of the transaction, sent to the customer prior to submission for payment of the customers check, draft, or other form of negotiable paper, that includes: (A) All of the information contained in §§ 310.3(a)(3)(ii) (A)-(F); and (B) The procedures by which the customer can obtain a refund from the seller or telemarketer in the event the confirmation is inaccurate; Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As previously indicated, NCMG has recently implemented changes to its right of rescission. There is, however, no guarantee such changes will continue to apply to the refund right of customers of NCMG.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Section 310.3(a)(1) states, in pertinent part: Before a customer pays for goods or services offered, failing to disclose, in a clear and conspicuous manner, the following material information: (i) The total costs to purchase, receive, or use, and the quantity of, any goods or services that are the subject of the sales offer; (ii) All material restrictions, limitations, or conditions to purchase, receive, or use the goods or services that are the subject of the sales offer. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Section 310.4(a)(4) states: (a) Abusive conduct generally. It is an abusive telemarketing act or practice and a violation of this Rule for any seller or telemarketer to engage in the following conduct: .... (4) Requesting or receiving payment of any fee or consideration in advance of obtaining a loan or other extension of credit when the seller or telemarketer has guaranteed or represented a high likelihood of success in obtaining or arranging a loan or other extension of credit for a person. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Abusive conduct under Section 310.4(a)(4) involves: Requesting or receiving payment of any fee or consideration in advance of obtaining a loan or other extension of credit when the seller or telemarketer has guaranteed or represented a high likelihood of success in obtaining or arranging a loan or other extension of credit for a person. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The Defendants have indicated recent changes have been implemented and all consumers who call NCMG are now entitled to receive a credit card application.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. In a letter, dated 27 March 1997, in which counsel for NCMG requested this informal opinion, counsel indicated NCMG was engaged ...in the business of selling written material which include books, sample form letters and other written material designed to enable the consumer to engage in self-help activities such as: a) Updating inaccurate information on credit reports pursuant to the Fair Credit Reporting Act. b) Explaining extenuating circumstances for non-payment or slow payment of debts to credit reporting agencies as these circumstances relate to the scope of the Equal Credit Opportunity Act and the consumer[']s application for credit as governed by this Act. c) Consumers['] rights and obligations under the Fair Debt Collection Practices Act. d) ...Establishing a customer relations center that will offer free, truthful information about the books and other educational material it disseminates. 22 April 1997 Letter from the FTC at 1-2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The 22 April 1997 Letter from the FTC indicated it was only an informal staff opinion and, as such, was not binding upon the FTC. See 22 April 1997 Letter from the FTC at 3. The 22 April 1997 Letter from the FTC, however, provides guidance as to whether NCMG is considered a credit repair organization.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The State of New Jersey indicated that during its investigation it conveyed to the Defendants several times that the business practices of NCMG \"were more likely to conform to the law if [NCMG] sold the Package ... as a one-time sale of goods and at a reasonable price.\" See Reply at 8 n.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. At the 20 March 1998 Hearing, counsel for the Plaintiffs indicated NCMG has approximately $ 700,000 in outstanding accounts payable. See Transcript from 20 March 1998 Hearing at p. 5, lines 9-10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. G. Buzzetti approximated that thirty to fifty percent of the individuals who purchased the Initial Analysis also purchased the Program. See G. Buzzetti Dep. attached as Exh. F to Smith Cert. at p. 80, lines 4-11. G. Buzzetti stated he did not believe anyone at NCMG knew the exact percentage because such records were not kept. See id. at p. 80, lines 16-18.\u003c/span\u003e\n\n",
    "body_length": 159125,
    "citedas": [
      "21 F. Supp. 2d 424"
    ],
    "attorneys": "Faith S. Hochberg, United States Attorney, Kimberly Guadagno, AUSA, United States Attorneys' Office, Peter Verniero, Attorney General of New Jersey, Gail M. Cookson, Deputy Attorney General, Newark, New Jersey. , Sheldon S. Lustigman, Esq., Andrew B. Lustigman, Esq., The Lustigman Firm, P.C., Hillsdale, New Jersey, for National Credit Management Group, L.L.C., Defendant. , William Harla, Esq., DeCotiis, Fitzpatrick \u0026 Gluck, Teaneck, New Jersey, for Joseph Ferguson, Defendant. , Albert L. Buzzetti, Esq., Sekas \u0026 Buzzetti, L.L.C., Englewood Cliffs, New Jersey, for Glen Buzzetti, Defendant. LECHNER, District Judge.",
    "category": [
      "124",
      "242",
      "251",
      "75"
    ],
    "judges": "LECHNER, District Judge",
    "citation_count": 0
  }
}
