{
  "id": "nKFdR2YBTlTomsSB4_w7",
  "document": {
    "title": "People v. Howard",
    "full_title": "THE PEOPLE AND v. ALBERT CECIL HOWARD AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1992-02-27T00:00:00.000Z",
    "docket": "No. S004562, Crim. No. 23252",
    "body": "A jury convicted defendant Albert Cecil Howard of the first degree murder, mayhem, and robbery of Lois (Roy) Fried (Pen. Code, § 187, 203, 211)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and the attempted murder, attempted mayhem, and robbery of Gladys Fried (§ 187, 203, 211, 664). As special circumstances,\n\nthe jury found that defendant committed the murder during the commission of robbery and burglary and for financial gain. (§ 190.2, subd. (a)(1), (17)(i) \u0026 (17)(vii).) The jury also found that defendant personally inflicted great bodily injury on each victim (§ 1203.075, 12022.7) and that each was over the age of 60 (§ 1203.09). At the penalty phase, the jury returned a verdict of death.\n\nAs discussed below, we reverse the convictions for attempted murder and attempted mayhem and strike the related enhancement findings. We also strike the finding on the financial-gain special circumstance. In all other respects, the judgment is affirmed.\n\nI. Facts\n\nOn May 25, 1982, defendant was visiting friends and relatives in the City of Tulare. Defendant had temporarily left his residence in Compton to avoid retribution from his former employer, whose motorcycle shop he had burglarized.\n\nEarly in the afternoon a party began at Eddie Franks's house, where defendant was staying. At the party were defendant, his mother Paralee Faulk, his aunt Dorothy Haynes, his half brother Johnny Malone, his sister- in-law Pamela Malone, his half brother Ernest (Ernie) Malone, Ernie's girlfriend Denise Devine, Johnny Washington, and Howard Green. Drinking and socializing continued well into the evening.\n\nDefendant left the party several times with Ernie\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e to walk to a nearby store for beer and wine. The last such trip began sometime after dark. The two men left by way of an alley behind the house and returned about 45 minutes later. When they returned, defendant was walking ahead of Ernie and carrying a brown paper bag. Defendant showed the contents to Eddie Franks and carried it into the house.\n\nEventually, defendant and most of the other people at Eddie's house found their way to a second party at the home of defendant's sister, Lavern Howard. Testimony about when defendant left Eddie's house was wildly inconsistent. The witnesses' recollections were vague, openly speculative, influenced in some cases by the consumption of alcohol, and generally impossible to reconcile. According to various witnesses, defendant could have left Eddie Franks's house as early as 8 p.m., after 10:45 p.m., or at any point in between.\n\nIn any event, by 11:30 p.m. the party at Lavern's house included Lavern herself, her husband Richard Sanders, Johnny Malone, Pamela Malone,\n\nDenise Devine, Johnny Washington, Howard Green, Dorothy Haynes, Paralee Faulk, and defendant. Pamela, defendant's sister-in-law, recounted at trial what happened when he arrived. Defendant had earlier expressed a desire to buy Johnny Malone's car. When defendant arrived, he asked Johnny if he still wanted to sell it. When Johnny said that he did, defendant dropped several bills on the floor--one $100 and two $50's. Pamela, Johnny's wife, said, \"[d]rop [$50] more and [I'll] give you the papers and everything.\" Defendant dropped another $50. Lavern Howard also witnessed the transaction.\n\nMany of the people at Lavern's house heard defendant talking about something that had happened earlier that evening. Defendant was \"excited\" and \"hyper.\" As Lavern later testified, defendant was \"boasting\" that he had \"gotten some money\" and \"brought somebody down.\" Defendant said that he had \"stomped\" \"a dude\" with his foot. Ernie had \"tried to stop him\" but, as defendant told the story, \"this old mother-fucker seen me, and he ain't going to see me no more.\" Other people heard defendant brag that he had \"stomped\" someone, \"stomped somebody's face in from being identified,\" or \"brought somebody down.\" Lavern also testified that Ernie, according to defendant, \"was supposed to have [done] something to some woman.\" Besides Lavern, the witnesses who heard defendant describe the incident included Richard Sanders, Pamela Malone, Denise Devine, and Johnny Washington. Defendant's mother had recounted a similar statement to the police but repudiated it at trial.\n\nAbout 1 a.m. the next morning, Ernie Malone arrived at Denise Devine's apartment. When Denise turned on the lights, she saw a wallet, money, and identification cards on the kitchen table. The cards belonged to Roy and Gladys Fried. Ernie asked Denise to count the money. She counted $540, which Ernie pocketed. Later, about 4 a.m., defendant arrived with Johnny and Pamela Malone. Defendant told Denise that he had bought Johnny's car. Ernie got upset and told defendant that \"he had to leave because he talked too much.\" The next morning, Denise put the identification cards in a bag and discarded them in a dumpster.\n\nAbout noon that same day, defendant visited Pamela. She asked defendant where he had gotten the money to buy her husband's car. As before, defendant explained that he had \"brought somebody down.\" Defendant also explained, in more detail, that he and Ernie had \"knocked on somebody's door, and an old man came to the door.\" The man \"got hit\" and grabbed defendant's leg. Defendant demonstrated with his foot how he had then \"stomped\" the man.\n\nRoy Fried lived with his wife, Gladys, in a house in Tulare. Eddie Franks's house was one block away, connected by an alley. Mr. Fried was\n\n74, and Mrs. Fried was 71. Both had impaired mobility and used aluminum walkers. The Frieds' two sons, Leland and Albert, saw and telephoned their parents frequently. On the evening of May 25, Albert's wife Jo Ann spoke with Mrs. Fried on the telephone until a few minutes before 10 p.m. At that time everything seemed to be in order.\n\nAbout 3:30 p.m. the next day, Leland's fiance Janice Yagel and her daughter Kim Payne drove to the Frieds' home. Janice stayed in the car while Kim went in to return Mrs. Fried's medical card. When no one answered her knock, Kim opened the door and saw Mr. and Mrs. Fried on the floor, lying on their stomachs. Mr. Fried's walker was on top of his body and his pockets were turned inside out. Mrs. Fried, who was wearing a nightgown, had her arm over her husband's back. When Mrs. Fried lifted her head to see who was at the door, Kim saw that her face was bloody. Kim yelled for help, and Janice telephoned the police. Mr. Fried's body was cold and had no pulse.\n\nThe police and medical technicians arrived a few minutes later, Mrs. Fried was cold, clammy, and breathing heavily, and her face, eyes, nose, and mouth showed extensive injuries. The ambulance crew administered first aid and took her to the hospital. Mr. Fried was pronounced dead. Rigor mortis had set in, and he was lying in blood and other bodily fluids. There was broken denture material on the living room floor. The house had been ransacked. The Frieds' sons later confirmed that a large amount of cash was missing. Leland had recently repaid a $2,000 loan in cash. The tan, \"government- type\" envelope into which Mrs. Fried had put the money was lying on the floor, empty. Also missing were Mr. Fried's wallet, in which he ordinarily kept several hundred dollars, and the purse that Jo Ann had given Mrs. Fried the previous Christmas. An expert on crime-scene reconstruction testified that the crimes could have been committed in as few as eight minutes.\n\nThe autopsy showed that Mr. Fried had suffered multiple blows to the head, face, neck, and chest. A blow to the neck had separated the larynx and trachea from the spine. A blow to the right eye had pushed the eyeball backwards and fractured the orbit. Multiple blows to the head had caused intracranial bleeding and bruised the brain. The blows had been delivered with considerable force by a tapering, firm or hard object and were consistent with having been delivered by a shod foot. At several places, the decedent's face showed a raised, curlicue pattern of small bruises. There were no defensive wounds. The cause of death, which took several minutes, was asphyxia with associated cranial and cerebral trauma.\n\nMrs. Fried had suffered very similar injuries, including multiple blows to the head, face, and eyes. Her eyelids were so swollen that they had to be\n\npulled open, and the whites of her eyes had hemorrhaged. Her lips and gums were injured, and her dentures had been knocked out of her mouth. She had also suffered a contusion, or bleeding within the brain.\n\nThe next day, May 27, defendant went with his sister Lavern to a pharmacy across the street from the Frieds' home. According to Lavern's testimony, the clerk was talking about how a friend of hers had been killed. Once outside the store, defendant told his sister that \"he had a murder beef and he had to get out of town.\" He also said that \"we'd be hearing about it on the news.\"\n\nPolice arrested defendant later that day in the car he had bought from Johnny Malone. Defendant gave a false name. Because he was barefoot and the sidewalk was hot, he told an officer that he would like to have his shoes out of the back seat. Officer Troy Otto went to get the shoes, but put them back because defendant was already in the patrol car. Later forensic examination showed that the shoes, a pair of black and white, tasselled, plastic, wing tip loafers, matched the curlicue pattern on decedent's face. Five witnesses had recently seen defendant with such shoes. That same day, police recovered Mr. and Mrs. Frieds' identification and charge cards, as well as some family photographs, from the dumpster outside Denise Devine's apartment. The cards were in a bag with a piece of paper bearing the handwritten words \"Uncle Ernie.\" Police seized Mrs. Fried's purse from Denise's apartment.\n\nDefendant, who testified at trial, denied involvement in the crimes. He explained his statements about \"stomping\" a man as references to a fight in Compton with John Hughes, his former employer. In April, defendant had burglarized Hughes's motorcycle shop. Hughes and his brother later attacked defendant with a pipe and broke defendant's arm. Hughes, who testified at trial, corroborated defendant's claim that defendant had burglarized the store in April 1982 and later become involved in a fight. Alfred Hunter, defendant's friend of 15 years who had witnessed the fight, testified that Hughes \"was kicking and stomping\" defendant. Hunter had previously been convicted of automobile theft and burglary. Booker Beard, who knew defendant well, testified that he had heard Hughes threaten defendant, saying that \"if [defendant] didn't leave Compton he wasn't never going to leave.\" Beard had been convicted of automobile theft and a narcotics charge.\n\nDefendant also explained that he was referring to Hughes, rather than to Mr. Fried, when he said that the \"mother-fucker won't see my face again.\" According to defendant, he made the statement because his girlfriend Novalene Taylor, who had remained in Compton, told him over the telephone\n\nthat Hughes had attacked Erskin Bell. After hearing this defendant feared for his own safety and decided to stay away. Novalene Taylor did not testify. However, Bell confirmed that Hughes had assaulted him after accusing him of complicity in the burglary of the motorcycle shop. Bell had previously been convicted of arson.\n\nDefendant denied telling Pamela Malone on May 26 that he had robbed an elderly man and woman. According to defendant, he did not see Pamela on that day and spent most the afternoon having his car repaired. Melvin Alston, a neighbor who repaired automobiles on the side, testified that defendant slept at Alston's house while Alston worked on the car. Alston had previously been convicted of burglary.\n\nDefendant testified that the money he used to buy Johnny Malone's car came from the Compton burglary. He denied that the wing tip shoes in the car belonged to him. He admitted owning a pair of shoes \"almost exactly\" like those in evidence but said that his were made of leather rather than plastic. Finally, the defense exploited the contradictory testimony about the timing of events on May 25, emphasizing those accounts which portrayed defendant as leaving Eddie's house for Lavern's before 10 p.m., when Jo Ann Fried talked with the victims over the telephone.\n\nII. Guilt Phase\n\nA. Wheeler/Batson Claim.\n\n1. Alleged racial bias. Defendant moved at trial to quash the jury panel on the ground that the prosecutor had used peremptory challenges to exclude two Black prospective jurors solely because of their race. (See People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748] (Wheeler); Batson v. Kentucky (1986) 476 U.S. 79 [90 L.Ed.2d 69, 106 S.Ct. 1712] (Batson).) The trial court denied the motion without asking the prosecutor to explain his challenges, ruling in effect that defendant had failed to establish a prima facie case of group bias.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e We hold that the trial court did not err.\n\nWhat a party must do to establish a prima facie case of group bias under Wheeler is well settled. \"If a party believes his opponent is using his peremptory challenges to strike jurors on the ground of group bias alone, he\n\nmust raise the point in timely fashion and make a prima facie case of such discrimination to the satisfaction of the court. First, ... he should make as complete a record of the circumstances as is feasible. Second, he must establish that the persons excluded are members of a cognizable group within the meaning of the representative cross-section rule. Third, from all the circumstances of the case he must show a strong likelihood that such persons are being challenged because of their group association rather than because of any specific bias.\" (Wheeler, supra, 22 Cal. 3d at p. 280, italics added, footnote omitted; see also People v. Fuentes (1991) 54 Cal. 3d 707, 714 [286 Cal. Rptr. 792, 818 P.2d 75].)\n\nThe prosecutor in this case exercised eleven peremptory challenges. His third and fourth challenges were to Black prospective jurors; the remaining nine challenges were to Whites. Defendant objected under Wheeler at the Conclusion of voir dire, just before the jury was sworn. Defendant's Wheeler motion was timely and Black persons obviously form a cognizable group. (Wheeler, supra, 22 Cal. 3d at p. 280.) However, defendant's showing was otherwise completely inadequate. His entire motion consisted of these three sentences: \"[T]here [have] been two Black people that advanced to the point where they were on the panel at one time. Both of them were excluded by the District Attorney, and it is my position they were excluded because they are black and for no other reason. I would like to make a motion under Wheeler on that basis.\"\n\nThus, defendant relied solely on the fact that the prosecutor had challenged the only two Black prospective jurors. Defendant did not make any effort to set out the other relevant circumstances, such as the prospective jurors' individual characteristics, the nature of the prosecutor's voir dire, or the prospective jurors' answers to questions. A showing as limited as defendant's offers little practical assistance to the trial court, which must determine from \"all the circumstances of the case\" whether there is \"a strong likelihood\" that prospective jurors have been challenged because of their group association rather than because of any specific bias. (Wheeler, supra, 22 Cal. 3d at p. 280.)\n\nIn view of defendant's meager showing, the People argue that this case is governed by People v. Rousseau (1982) 129 Cal. App. 3d 526 [179 Cal. Rptr. 892]. In Rousseau, the prosecutor \"exercised two peremptory challenges against black jurors. The trial court took judicial notice that these jurors were the only blacks on the panel. However, [the] appellant's attempt to satisfy the required prima facie case was limited to his statement that 'there were only two blacks on the whole panel, and they were both challenged by the district attorney.' \" (Id., at p. 536.) The trial court declined\n\nto find a prima facie case, and the Court of Appeal affirmed. (Id., at pp. 536-537.)\n\nAlthough defendant's attempt to show a prima facie case was clearly inadequate, we have not limited our review in such cases solely to counsel's presentation at the time of the motion. This is because other circumstances might support the finding of a prima facie case even though a defendant's showing has been no more detailed than in the case before us. Nor should the trial court blind itself to everything except defense counsel's presentation. Indeed, we have emphasized that such rulings require trial Judges to consider \"all the circumstances of the case\" ( Wheeler, supra, 22 Cal. 3d at p. 280) and call upon Judges' \" 'powers of observation, their understanding of trial techniques, and their broad judicial experience.' \" (People v. Bittaker (1989) 48 Cal. 3d 1046, 1092 [259 Cal. Rptr. 630, 774 P.2d 659] (Bittaker), quoting Wheeler, supra, 22 Cal. 3d at p. 281; see also Batson, supra, 476 U.S. at p. 97 [90 L.Ed.2d at p. 88].) The trial Judge in this case, for example, obviously knew that defendant belonged to the same group as the challenged jurors and that his victims did not. Clearly these are relevant factors (see Wheeler, supra, 22 Cal. 3d at p. 281), and they were apparent to the trial court even though defendant did not mention them during his Wheeler motion.\n\nFor these reasons, when a trial court denies a Wheeler motion without finding a prima facie case of group bias the reviewing court considers the entire record of voir dire. (E.g., Bittaker, supra, 48 Cal. 3d at p. 1092; People v. Sanders (1990) 51 Cal. 3d 471, 498 [273 Cal. Rptr. 537, 797 P.2d 561] (Sanders).) As with other findings of fact, we examine the record for evidence to support the trial court's ruling. Because Wheeler motions call upon trial Judges' personal observations, we view their rulings with \"considerable deference\" on appeal. (Sanders, supra, 51 Cal. 3d at p. 501; cf. Batson, supra, 476 U.S. at p. 88 [90 L.Ed.2d at p. 82].) If the record \"suggests grounds upon which the prosecutor might reasonably have challenged\" the jurors in question, we affirm. (Bittaker, supra, 48 Cal. 3d at p. 1092.)\n\nProspective juror Betty T., who described herself as a \"housewife,\" was a nonpracticing registered nurse with a degree in sociology. She had lived in the county for 20 years, was married to a physician, and had 2 grown children. At voir dire the prosecutor asked her, among other things, about her views on the death penalty and about her medical training. Regarding the latter, he explained to her that \"[t]he reason [he] ask[ed] those questions [was that] sometimes we run into jurors who have a basic expertise in an area that might be tested in this trial.\" Betty T. said she did \"not think\" that her training would be a problem. Defense counsel did not directly question Betty T. about her degree in sociology but did ask how she would consider\n\nevidence regarding defendant's background and childhood. She answered that she thought that such evidence was \"something that could be considered, but it would have to be weighed very carefully.\" She believed that \"other evidence\" would also be important.\n\nProspective juror Katie B. was a nurse's aide who had completed the 10th grade. She had lived in the county for 39 years, was married to a retired gardener, and had no children. During the Witherspoon/Witt voir dire (see Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88 S.Ct. 1770]; Wainwright v. Witt (1985) 469 U.S. 412 [83 L.Ed.2d 841, 105 S.Ct. 844]) she passively answered the trial Judge's leading questions in the manner the questions suggested. Thus, her brief responses to the court indicated that she had no beliefs that would prevent a vote for the death penalty, that she would not automatically vote for or against it, and that she would weigh both penalties before deciding for one or the other. In contrast, her subsequent answers to defense counsel's nonsuggestive questions revealed uncertainty. Asked about her \"personal feelings\" on the death penalty, Katie B. responded, even though she had just explored the matter with the trial court: \"I have never been confronted with this question before so I really haven't thought it over.\" Asked if she would favor the death penalty \"if the situation warranted,\" she responded: \"If I know the circumstances, you know, I could understand it better, but right now I don't know anything about it so I don't know what to say.\"\n\nThe trial Judge, who presided over the entire voir dire, was in a good position to decide from all the relevant circumstances\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e whether there was a \"strong likelihood\" that the prosecutor had challenged Betty T. and Katie B. solely because of their group association. (Wheeler, supra, 22 Cal. 3d at p. 280.) Betty T.'s professional training and Katie B.'s apparent uncertainty about the death penalty \"suggest[ed] grounds upon which the prosecutor might reasonably have challenged\" the jurors in question. (Bittaker, supra, 48 Cal. 3d at p. 1092.) Moreover, the prosecutor's voir dire of the two prospective jurors, which focused on the matters just mentioned, was not \"desultory.\" (Cf. Wheeler, supra, 22 Cal. 3d at p. 281.) Although the removal of all members of a certain group may give rise to an inference of impropriety (id., at p. 280), especially when the defendant belongs to the same group, the inference is not conclusive. (Sanders, supra, 51 Cal. 3d at p. 500.) Considering all of the relevant circumstances (Wheeler, supra, 22 Cal. 3d at p. 280), we cannot conclude from this record that the trial court erred.\n\nDefendant also argues that the trial court \"abdicated its duties\" under Wheeler by denying the motion without requiring the prosecutor to explain his challenges. However, the court had no occasion to ask for explanations unless and until it found a prima facie case of group bias. This case is thus unlike People v. Snow (1987) 44 Cal. 3d 216, 226 [242 Cal. Rptr. 477, 746 P.2d 452], in which the trial Judge \"expressed serious suspicions that the prosecutor was using some of his peremptory challenges to exclude Blacks\" but went no further, and People v. Hall (1983) 35 Cal. 3d 161, 168 [197 Cal. Rptr. 71, 672 P.2d 854], in which the trial court asked the prosecutor to explain his challenges but made no serious attempt to evaluate them. In short, the trial court here simply did not find a prima facie case. Because the record of voir dire supports that decision, we reject defendant's claim of error.\n\n2. Alleged gender bias. Shortly before we heard argument in this case, defendant asserted the new claim that the prosecutor challenged one prospective juror solely because of her gender. We reject the claim because it was not raised in the trial court. (People v. Hayes (1990) 52 Cal. 3d 577, 605 [276 Cal. Rptr. 874, 802 P.2d 376] (Hayes).)\n\nThe prosecutor exercised 11 peremptory challenges, all to female prospective jurors. The jury as sworn included six female and six male jurors. Defendant did not assert gender bias as a ground for his Wheeler motion. Instead, he argued that two challenges were motivated solely by racial bias and that eight challenges were motivated solely by bias against persons opposed to the death penalty. We have already discussed the first argument. The trial court correctly rejected the second argument because persons opposed to the death penalty do not make up a cognizable class for Wheeler purposes. (People v. Zimmerman (1984) 36 Cal. 3d 154, 160-161 [202 Cal. Rptr. 826, 680 P.2d 776].)\n\nAfter the trial court denied the Wheeler motion, the prosecutor submitted a declaration to explain his reasons for challenging the eight jurors whom defense counsel had described as opposed to the death penalty. The prosecutor stated that he had challenged one prospective juror, Lyn V., not because of her views on capital punishment but because she \"was a seductive looking female who [the prosecutor] felt might distract the attention of the male jurors.\" Defendant interprets this statement as \"an admission of purposeful gender discrimination.\"\n\nIn Hayes, supra, 52 Cal. 3d at page 605, we held that a party may not challenge an opponent's use of peremptory challenges for the first time on appeal. Defendant suggests three reasons why this rule should not apply to his case. None is persuasive.\n\nFirst, defendant mistakenly asserts that gender bias was not clearly recognized as an impermissible basis for the exclusion of jurors until the decision in United States v. De Gross ((9th Cir. 1990) 913 F.2d 1417, petition for rehearing en banc granted). To the contrary, whatever federal law may have provided at the time of trial, state law clearly permitted a defendant to challenge the exclusion of jurors based on gender. In Wheeler, supra, 22 Cal. 3d 258, we did not limit our holding to claims of racial bias. Instead, we held that a claim of improper exclusion was proper whenever \"the persons excluded are members of a cognizable group within the meaning of the representative cross-section rule.\" (Id., at p. 280.) Moreover, our opinion left no reasonable doubt that women made up a cognizable group for the purposes of the representative cross-section rule because we expressly relied on opinions holding exactly that. (See Taylor v. Louisiana (1975) 419 U.S. 522, 533 [42 L.Ed.2d 690, 699-700, 95 S.Ct. 692]; cf. Ballard v. United States (1946) 329 U.S. 187, 191 [91 L.Ed. 181, 184-185, 67 S.Ct. 261], and Glasser v. United States (1942) 315 U.S. 60, 86 [86 L.Ed. 680, 707, 62 S.Ct. 457]; all cited in Wheeler, supra, 22 Cal. 3d at pp. 267-270.)\n\nNext, defendant argues that it would have been futile at the time of trial to assert a claim based on the improper exclusion of a single juror. This may have been true under federal law because of Swain v. Alabama (1965) 380 U.S. 202 [13 L.Ed.2d 759, 85 S.Ct. 824]. Swain created a presumption that peremptory challenges had been properly exercised and permitted a defendant to rebut the presumption, and thus state a federal equal protection claim, only by \"show[ing] the prosecutor's systematic use of peremptory challenges ... over a period of time\" rather than just in a single case. (Id., at pp. 222, 227 [13 L.Ed.2d at pp. 773-774, 776].) The federal courts did not abandon the Swain rule until long after the trial in this case. (Batson, supra, 476 U.S. at pp. 93-98 [90 L.Ed.2d at pp. 85-89].) However, we had already rejected Swain as a matter of state law and held that a trial court must strike the jury if \" any of the questioned peremptory challenges\" could not be justified. (Wheeler, supra, 22 Cal. 3d at pp. 282, 283-287, italics added.)\n\nFinally, defendant argues that the prosecutor's decision to volunteer reasons for challenging Ms. V. makes the issue cognizable on appeal despite Hayes (supra, 52 Cal. 3d at p. 605). However, the federal case on which defendant relies does not support the proposition. In Andrews v. Deland (10th Cir. 1991) 943 F.2d 1162, the Tenth Circuit merely held that the Swain presumption (i.e., that peremptory challenges have been properly exercised) does not apply when a prosecutor volunteers explanations.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Thus, even under Swain a prosecutor who voluntarily offered explanations thereby authorized\n\nthe trial court to inquire into their validity without requiring a showing of systematic discrimination over a period of time. (Andrews v. Deland, supra, 943 F.2d at pp. 1178-1179.)\n\nBecause we had already rejected Swain as a matter of state law at the time of defendant's trial (see Wheeler, supra, 22 Cal. 3d at pp. 283-287), and because Wheeler expressly authorized trial courts to inquire into the validity of particular peremptory challenges (), Andrews v. Deland, supra, has no bearing on this case. Moreover, nothing in the Tenth Circuit's opinion suggests that a prosecutor's decision to volunteer explanations excuses a defendant from the ordinary obligation to raise claims of error in the trial court. Because defendant did not raise the claim below, it is waived. (Hayes, supra, 52 Cal. 3d at p. 605.)\n\nB. Cross-sectional Representation/Ineffective Assistance Claim.\n\nDefendant next argues that the venire did not fairly represent the Hispanic population of Tulare County. He attributes the alleged underrepresentation to the trial court's having excused a large number of prospective jurors for hardship. Defendant waived this claim by failing to raise the point below. (Code Civ. Proc., § 225, subd. (a)(1); see former § 1060, repealed by Stats. 1988, ch. 1245, § 21, p. 4155.) For purposes of the appeal, defendant has restated the claim as one of ineffective assistance based on counsel's failure to challenge the panel. However, such a challenge would not have been meritorious.\n\nUnder the federal and state Constitutions, a criminal defendant is entitled to a jury drawn from a representative cross-section of the community. (U.S. Const., Amend. VI; Cal. Const., art. I, § 16; Duren v. Missouri (1979) 439 U.S. 357, 358-367 [58 L.Ed.2d 579, 583-589, 99 S.Ct. 664] (Duren); People v. Harris (1984) 36 Cal. 3d 36, 48-49 [201 Cal. Rptr. 782, 679 P.2d 433] (Harris).) The federal and state guarantees are coextensive and the analyses are identical. (People v. Bell (1989) 49 Cal. 3d 502, 525, fn. 10 [262 Cal. Rptr. 1, 778 P.2d 129] (Bell); e.g., Harris, supra, 36 Cal. 3d at pp. 48-49.) \"In order to establish a prima facie violation of the fair- cross-section requirement, the defendant must show (1) that the group alleged to be excluded is a 'distinctive' group in the community; (2) that the representation of this group in venires from which juries are selected is not fair and reasonable in relation to the number of such persons in the community; and (3) that this underrepresentation is due to systematic exclusion of the group in the jury-selection process.\" (Duren, supra, 439 U.S. at p. 364 [58 L.Ed.2d at p. 587]; see also Bell, supra, 49 Cal. 3d at p. 525.)\n\nWe need not dwell on the first two parts of the Duren test. Hispanic persons make up a distinctive group (Harris, supra, 36 Cal. 3d at p. 51), and we shall assume for argument's sake, without deciding the point, that the alleged underrepresentation of Hispanics was significant. According to census data, Hispanics made up 24.8 percent of the adult population of Tulare County.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e An examination of surnames indicates that Hispanics made up 15.8 percent of the venire and 9.6 percent of the jury pool after the court granted excuses for hardship.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nTo satisfy the third part of the Duren test, a defendant must show that the claimed underrepresentation was \"due to systematic exclusion of the group in the jury selection process.\" (Duren, supra, 439 U.S. at p. 364 [58 L.Ed.2d at p. 587].) A defendant cannot carry this burden with nothing more than statistical evidence of a disparity. One must, in addition, show that the disparity is the result of an improper feature of the jury selection process. (Bell, supra, 49 Cal. 3d at pp. 528-529.)\n\nDefendant attempts to find an impropriety in the court's treatment of the venirepersons' hardship claims.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Specifically, defendant asserts that the trial court applied a more lenient standard in excusing Hispanics than non-Hispanics. The assertion is critical to his argument. While an abuse of discretion in granting excuses for hardship might, in theory, \"upset the demographic balance of the venire\" (Wheeler, supra, 22 Cal. 3d at p. 273), defendant cannot demonstrate systematic exclusion based upon the evenhanded application of a neutral criterion, such as hardship. (Bell, supra, 49 Cal. 3d at p. 530.)\n\nIn fact, the record does not support defendant's assertion of impropriety or abuse of discretion. The court evaluated 364 claims of hardship, including 65 by Hispanics. Of these many instances, defendant has identified only three in which he believes the court applied a more lenient standard to Hispanics than to non-Hispanics. Of the three Hispanic venirepersons whose excusal defendant now questions, one thought that jury service would prevent her from being paid, one's son had multiple doctor's appointments, and one said\n\nthat it would be hard to take the time off from work. Defendant compares these with three non-Hispanic jurors whom the court did not excuse. Of these, one planned a vacation that would end before the trial began, one speculated that she might not be paid but apparently declined the court's invitation to pursue the matter with her employer, and one claimed that service on the jury would be a hardship for her employer but not for herself, since her job and income would not be in jeopardy. Nothing about these rulings, which appear quite ordinary, suggests an abuse of discretion.\n\nDefendant also restates his contention as one under former section 1059, which at the time of trial would have permitted him to challenge the jury panel based on \"a material departure from the forms prescribed in respect to the drawing and return of the jury ....\" (See former § 1059, repealed by Stats. 1988, ch. 1245, § 20, p. 4155.) Because defendant did not challenge the panel in the trial court, he again presents the claim as one of ineffective assistance of counsel. To fit the claim within section 1059, defendant characterizes the trial court's apparently lenient standard for evaluating hardship claims as a violation of the Code of Civil Procedure, which authorizes the excuse of eligible persons only for \"undue hardship.\" (Code Civ. Proc., § 204, subd. (b); see former Code Civ. Proc., § 200, repealed by Stats. 1988, ch. 1245, § 1, p. 4140.) Defendant argues, citing People v. Buford (1982) 132 Cal. App. 3d 288, 298-299 [182 Cal. Rptr. 904], that the Legislature did not intend \"that every financial cost\" be treated as undue hardship.\n\nIt is true that the trial court granted an unusually large number of excuses for hardship. The court disapproved only 7 of 364 requests. We do not necessarily approve of such practices. (See People v. Thompson (1990) 50 Cal. 3d 134, 158 [266 Cal. Rptr. 309, 785 P.2d 857].) Nevertheless, assuming for argument's sake that the court thereby deviated from the statutory procedures governing jury selection, such a deviation constitutes reversible error only if it results in prejudice. (People v. Wright (1990) 52 Cal. 3d 367, 398 [276 Cal. Rptr. 731, 802 P.2d 221]; People v. Langdon (1976) 54 Cal. App. 3d 384, 391 [126 Cal. Rptr. 575].) To show prejudice, defendant merely repeats his argument to the effect that excuses for hardship unconstitutionally reduced Hispanic representation. This claim, as we have already explained, lacks merit.\n\nC. Claim of Mental Incompetence.\n\nDefendant contends that the trial court erred on two occasions by not ordering, sua sponte, a hearing on his competence to stand trial. (See Pate v. Robinson (1966) 383 U.S. 375, 385 [15 L.Ed.2d 815, 86 S.Ct. 836];\n\nPeople v. Pennington (1967) 66 Cal. 2d 508, 518 [58 Cal. Rptr. 374, 426 P.2d 942] (Pennington); see also § 1367, 1368.) However, the incidents in question did not raise a reasonable doubt about his mental competence, and the contention thus lacks merit.\n\nDefendant claims the court should first have ordered a hearing, sua sponte, on the occasion of his motion for a continuance. Five days before jury selection was to begin, defense counsel informed the court that defendant was suffering from uveitis, an inflammation of the eyes, and could not see well. Defendant also reportedly suffered from other physical ailments such as headaches, dizziness, and tiredness. Defendant's ophthalmologist testified that uveitis was usually a symptom of a more serious disease and that defendant needed tests and treatment. The ophthalmologist thought that defendant's other ailments might have been due to anxiety over his medical condition. Counsel moved for a continuance because he feared that defendant's condition would prevent him from effectively participating in the defense. At the Conclusion of the hearing, the trial court continued the trial for approximately three months. Neither defense counsel nor anyone else suggested that defendant was mentally incompetent. Apparently defendant received appropriate treatment; no further complaint about his medical condition appears in the record.\n\nDefendant also argues that the court should have ordered a competence hearing, sua sponte, on the occasion of his motion for a mistrial or change of venue. The motion was based on apparent harassment by jail personnel during the jury-selection phase. Deputy sheriffs assigned to the Tulare County jail had sometimes refused, despite a court order, to permit a law clerk on the defense team to consult with defendant in a private room. On other occasions deputies had kept defendant unnecessarily in a crowded holding tank after court recessed rather than returning him immediately to his regular cell. As a result of these incidents defendant believed that he was \"being punished by the staff at the jail.\" At the hearing on the motion, defense counsel added that defendant was \"angry\" with counsel over the jail situation, \"so agitated\" that counsel \"could hardly control him at several points,\" and \"so emotionally upset by what is going on and [the] treatment that he is receiving that he is not able to really effectively participate in his trial.\" Counsel also asserted that his own ability to conduct voir dire was being impaired by defendant's preoccupation with jail conditions.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The trial court denied the motions for mistrial and change of venue but made additional orders regarding defendant's confinement. Once again, there was no suggestion that defendant was mentally incompetent.\n\nThe principles that apply to defendant's claim are well settled. A trial court is required to conduct a competence hearing, sua sponte if necessary, whenever there is substantial evidence of mental incompetence. (Pennington, supra, 66 Cal. 2d at p. 518; People v. Stankewitz (1982) 32 Cal. 3d 80, 93 [184 Cal. Rptr. 611, 648 P.2d 578, 23 A.L.R.4th 476]; see also Pate v. Robinson, supra, 383 U.S. at p. 385 [15 L.Ed.2d at p. 822].) Substantial evidence for these purposes is evidence that raises a reasonable doubt on the issue. (People v. Jones (1991) 53 Cal. 3d 1115, 1152 [282 Cal. Rptr. 465, 811 P.2d 757] (Jones).)\n\nApplying these principles to the record before us, we cannot say as a matter of law that the evidence raised a reasonable doubt as to defendant's mental competence. A defendant is mentally incompetent \"if, as a result of mental disorder or developmental disability, the defendant is unable to understand the nature of the criminal proceedings or to assist counsel in the conduct of a defense in a rational manner.\" (§ 1367, italics added.) The circumstances underlying defendant's motion for a continuance indicated that he needed medical attention, and those underlying his motion for a mistrial indicated that the conditions of his confinement were unsatisfactory. However, nothing about either incident remotely suggested that he was mentally incompetent. Thus, the court was not required to order a hearing.\n\nLater in the proceedings, defense counsel expressly questioned his client's competence. During the penalty phase, at the close of the People's case in aggravation, defendant decided that he did not want counsel to present mitigating evidence.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Counsel explained the matter to the court in these words: \"[Defendant] still does not want me to argue for life imprisonment, nor present any evidence in mitigation. And he--he wants the death penalty. If he were to testify and testifies, he would tell the jury so. We are still in disagreement on that matter. He's told me in fact that he wants nothing more to do with the jury or the Judge. He prefers to sit in the tank while the penalty phase was to [proceed].\" Viewing his client's desire as evidence of incompetence, counsel asked the court to conduct a competence hearing. The court declined.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nUnder section 1368, if \"a doubt arises in the mind of the Judge\" as to the defendant's mental competence, the Judge must \"state that doubt in the\n\nrecord\" and solicit defense counsel's opinion on the matter. (§ 1368, subd. (a).) In such a case, \"[i]f counsel informs the court that he believes the defendant is or may be mentally incompetent,\" the court must order a hearing. (§ 1368, subd. (b).) Because the court in this case did not declare a doubt, section 1368 did not require the court to conduct a hearing based solely on counsel's opinion.\n\nThis is not to say that counsel's opinion had no importance. To the contrary, the court must order a hearing whenever there is substantial evidence of incompetence (Pennington, supra, 66 Cal. 2d at p. 518), whatever the source (Drope v. Missouri (1975) 420 U.S. 162, 180 [43 L.Ed.2d 103, 118, 95 S.Ct. 896]). In making this decision the court must consider all of the relevant circumstances (), and counsel's opinion is undoubtedly relevant. However, counsel's opinion was that his client's apparent preference for the death penalty, by itself, constituted substantial evidence of mental incompetence. The court correctly rejected that position. (People v. Guzman (1988) 45 Cal. 3d 915, 963-965 [248 Cal. Rptr. 467, 755 P.2d 917].) All of the other relevant circumstances, including defendant's anxiety over his ophthalmological problem and his anger over jail conditions, did not compel a different result. The court had no reason to believe that these other circumstances were due to mental incompetence rather than to the specific problems of which defendant had complained.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nD. Unreported Conferences.\n\nThe stenographic record in this case does not include three bench conferences and one conference in chambers. Although the trial Judge conducted a hearing to settle the record, he declared himself unable to make findings on the matter for lack of an independent recollection of the unreported proceedings. Defendant contends that the omissions from the record require the judgment to be reversed. In opposition, the Attorney General argues that defendant waived the point by failing to request a reporter at the proceedings in question. We reject the contention not because of a waiver, but because defendant has not shown that the omissions were prejudicial.\n\nThe trial in this place took place before the enactment of section 190.9 (added by Stats. 1984, ch. 1422, § 2, p. 4994), which requires that all\n\nproceedings in capital cases be transcribed. Regardless of that section a defendant is entitled to a record that is adequate to permit meaningful appellate review. (People v. Moore (1988) 201 Cal. App. 3d 51, 57 [248 Cal. Rptr. 31].) However, it is defendant's burden to show that deficiencies in the record are prejudicial. As we said in People v. Chessman (1950) 35 Cal. 2d 455, 462 [218 P.2d 769, 19 A.L.R.2d 1084], \"[i]nconsequential inaccuracies or omissions in a record cannot prejudice a party; if in truth there does exist some consequential inaccuracy or omission, the appellant must show what it is and why it is consequential.\" () The Penal Code is to the same effect: \"After hearing the appeal, the court must give judgment without regard to technical errors or defects, or to exceptions, which do not affect the substantial rights of the parties.\" (§ 1258; see also § 960, 1404.)\n\nThe omissions in this case are not prejudicial because the record is adequate to permit defendant to argue each of the points purportedly addressed in the unreported conferences. We have already mentioned the first such conference, which occurred during jury selection. Counsel claims to have informed the court at that conference that defendant was emotionally upset over conditions in the Tulare County jail and that defendant's preoccupation with the matter was impairing counsel's ability to conduct voir dire. (See p. 1162, fn. 9, ante. ) Counsel argues that he asserted defendant's constitutional right to be mentally present at trial only in the unreported proceeding. However, we do not read the record so grudgingly. On the preceding day, counsel argued on the record that harassment at the jail was \"interfering with [defendant's] mental state and his approach to this trial, which is really in effect denying him a fair trial.\" While the claim lacks merit (see p. 1161 et seq., ante), it is clear counsel that counsel sufficiently preserved the point for appellate review.\n\nThe same is true of each of the remaining unreported conferences. In the second conference, defense counsel claims that he moved under Evidence Code section 352 to strike testimony by Albert Fried about his mother's physical appearance after she was attacked. In the third conference, counsel claims to have objected under the same statute to the prosecutor's cross-examination of defendant about defendant's statement that he had once sold stolen coins to a \"fence.\" Each of these objections appears on the record. Thus, the record is adequate to permit review even though defendant has not renewed the claims on appeal. In the fourth conference, counsel moved in limine to restrict cross-examination of a proposed expert witness for the defense. The expert, a psychiatrist, was aware of matters in defendant's criminal record that the court had decided not to admit as circumstances in aggravation. Counsel asked the court to bar cross- examination on such matters, but the court denied the motion. Here, too, the record is adequate for\n\nreview (see p. 1183, fn. 21, post) because the court and counsel later summarized the unreported conference on the record.\n\nDefendant also argues that, in view of the transcript's omissions, the United States Constitution requires the judgment to be reversed. However, there is no federal requirement that all proceedings be transcribed. (See Adkins v. Bordenkircher (4th Cir. 1982) 674 F.2d 279, 283 [14th Amend.]; Stephens v. Zant (5th Cir. 1980) 631 F.2d 397, 402-404, rehg. den. and opn. mod. (1981) 648 F.2d 446, cert. den. 454 U.S. 1035 [70 L.Ed.2d 480, 102 S.Ct. 575] [8th Amend.].) Under the Fourteenth Amendment, the record of the proceedings must be sufficient to permit adequate and effective appellate review. (Griffin v. Illinois (1956) 351 U.S. 12, 20 [100 L.Ed. 891, 899, 76 S.Ct. 585, 55 A.L.R.2d 1055]; Draper v. Washington (1963) 372 U.S. 487, 496-499 [9 L.Ed. 2d 899, 905-907, 83 S.Ct. 774].) Under the Eighth Amendment, the record must be sufficient to ensure that there is no substantial risk the death sentence has been arbitrarily imposed. (Stephens v. Zant, supra, 631 F.2d at pp. 402-404; see also Dobbs v. Kemp (11th Cir. 1986) 790 F.2d 1499, 1514.) The record in this case meets these standards.\n\nE. Motion to Change Venue.\n\nDefendant moved before trial to change venue on the ground that news coverage of the Fried killing would make it difficult to obtain a fair trial. The trial court denied the motion. On appeal, defendant urges that the court erred and that the failure to change venue caused actual prejudice.\n\nAs a preliminary matter, we reject the People's contention that defendant has waived this claim. Because the trial court initially denied the motion without prejudice, defendant needed to renew it at the close of voir dire in order to preserve the issue for appeal. (People v. Hoover (1986) 187 Cal. App. 3d 1074, 1085 [231 Cal. Rptr. 203].) In fact, defendant did renew his motion on the final day of voir dire, a few hours before the jury was sworn. The People argue that defendant, in renewing the motion, emphasized his problems at the jail rather than the extent of pretrial publicity. (See p. 1162, ante.) However, the record does not conclusively demonstrate that the renewed motion was intended or understood as limited to that ground. Therefore, this issue cannot properly be resolved on a theory of procedural default.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nUnder section 1033, the trial court must grant a motion to change venue if \"there is a reasonable likelihood that a fair and impartial trial cannot\n\nbe had in the county.\" In making this determination, a court considers \"the nature and gravity of the offense, the nature and extent of the news coverage, the size of the community, the status of the defendant in the community, and the popularity and prominence of the victim.\" (People v. Harris (1981) 28 Cal. 3d 935, 948 [171 Cal. Rptr. 679, 623 P.2d 240].)\n\nThe charged offenses in this case were obviously serious. However, every capital case involves a serious charge. While this factor adds weight to a motion to change venue, it does not in itself require a change. (People v. Cooper (1991) 53 Cal. 3d 771, 806, [281 Cal. Rptr. 90, 809 P.2d 865] (Cooper); People v. Jennings (1991) 53 Cal. 3d 334, 360 [279 Cal. Rptr. 780, 807 P.2d 1009] (Jennings).)\n\nDefendant claims that his status as a nonresident also weighed in favor of changing venue because, in comparison with the resident victims, it cast him in an unfavorable light.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e This argument about status, however, is of little weight because there is no indication that either defendant or his victims were prominent in the community. Defendant also argues that his race gave him an unfavorable status in the community. The 1980 census describes Tulare County's adult population as 77 percent White and 1 percent Black. However, both the trial court and defense counsel questioned prospective jurors about racial bias, and the court excused a prospective juror for cause on that basis. Defendant did not argue below, and does not argue here, that any of the jurors or alternates actually sworn should also have been excused for racial bias.\n\nThe size of Tulare County, which we have recognized is not a small community, does not weigh substantially in favor of a change of venue. (People v. Hamilton (1989) 48 Cal. 3d 1142, 1158- 1159 [259 Cal. Rptr. 701, 774 P.2d 730] (Hamilton).) With 253,000 inhabitants at the time of trial, Tulare County ranked 20th among California's 58 counties in population. (; see also People v. Whalen (1973) 33 Cal. App. 3d 710, 716 [109 Cal. Rptr. 282].) As we have previously observed, most recent successful venue motions have involved communities with substantially smaller populations. (See Hamilton, supra, 48 Cal. 3d at p. 1158, and cases cited therein.)\n\nIn short, the gravamen of defendant's motion, as well as its asserted basis, was the extent of pretrial publicity. In support of his motion, defendant showed that the local media had given significant attention to the crimes at the time of their commission and in the months before trial. Newspapers had reported that defendant's half brother had been found guilty as an aider and\n\nabettor after implicating defendant as the actual killer. Defendant also presented a survey of the community at large on the question of exposure to pretrial publicity. According to the defense expert who conducted the survey and interpreted its results, \"6.7 of the 120 respondents interviewed had knowledge of the defendants; another 7.5 were not sure. However, when given more details about the incident of the Frieds' case, 40 (or 33.3) remembered the occurrence.\" Defendant supplemented this showing with questionnaires submitted to 168 of the prospective jurors who had been excused for hardship. Of these, 60 had heard of the Fried killing. However, only 20 had heard that defendant was to stand trial, and only 10 had heard of the trial of defendant's half brother. The remainder checked a box labelled \"not sure\" or chose not to respond.\n\nDefendant argues that the results of these surveys weighed heavily in favor of changing venue. However, the degree of exposure to publicity that defendant claims was far lower than in other cases in which a change of venue was not required. (See, e.g., Jennings, supra, 53 Cal. 3d at pp. 359-363 [72 percent of sample recalled the crime, and 31 percent believed the district attorney had a very strong case against the defendant]; People v. Coleman (1989) 48 Cal. 3d 112, 135 [255 Cal. Rptr. 813, 768 P.2d 32] (Coleman) [46.3 percent recalled the crime, and 31.4 percent thought the defendant definitely or probably guilty].)\n\nAlthough defendant predicted in limine that pretrial publicity would affect his ability to obtain a fair trial, on appeal we must consider that forecast \"in conjunction with the actual selection of the jury.\" (Coleman, supra, 48 Cal. 3d at p. 135.) This is because posttrial review of an order denying a motion to change venue is retrospective. Thus, even if a trial court were to err in denying a motion to change venue, the showing of error would not in itself justify reversal on appeal. The defendant must also demonstrate that, in view of what actually occurred at trial, it is reasonably likely that a fair trial was not in fact had. (People v. Edwards (1991) 54 Cal. 3d 787, 807 [1 Cal. Rptr. 2d 696, 819 P.2d 436] (Edwards); see also Cooper, supra, 53 Cal. 3d at pp. 805- 806; People v. Harris, supra, 28 Cal. 3d at p. 949.)\n\nThe jurors and alternates sworn to try the case stated that they could and would decide it impartially, based on the evidence presented in court. In view of the survey results, defendant argues that we should view such statements with skepticism. To be sure, the jurors' assertions of impartiality do not automatically establish that defendant received a fair trial. However, a review of the entire record of voir dire may still demonstrate that pretrial publicity had no prejudicial effect. (Coleman, supra, 48 Cal. 3d at p. 135; see also Jennings, supra, 53 Cal. 3d at pp. 360-361; People v. Harris, supra, 28 Cal. 3d at p. 949.)\n\nThe record of voir dire in this case is particularly helpful in assessing prejudice because the trial court thoroughly explored the matter of pretrial publicity with each prospective juror and excused those who had significant exposure. In addition, defense counsel supplemented the court's questions with his own. Defendant now argues that counsel's questioning on this subject was ineffective. However, the court's thorough coverage of the matter left little for counsel to do. Moreover, counsel did ask additional questions about publicity whenever a prospective juror's responses to the court's questions suggested that there might be some point to further inquiry.\n\nDefendant interprets the voir dire testimony of two jurors and two alternates as indicating some exposure to news reports about the case. As to all but one alternate, however, the record does not necessarily support defendant's interpretation. Juror Main, asked whether he had read or heard anything about the killing, testified: \"There are so many that I hear and see on television that I don't recall that one particularly.\" Juror Warren, asked whether he had heard about the trial of defendant's accomplice, testified: \"It seems like the name Malone is familiar, but I don't know what the connection is.\" Warren did not recall any publicity. Alternate Hubler's testimony was similar: \"I have probably heard about them [defendant's and Malone's trials] on the news, but it is nothing that I dwelled on or that I remembered.\" Hubler did not recall anything about the case. Of all the jurors and alternates, only alternate Babb clearly remembered hearing about the Fried killing. She had read in a newspaper that \"an elderly couple had been robbed and the man had been killed.\" However, Babb did not remember anything else about the case and had no opinion on defendant's guilt or innocence.\n\nIn summary, voir dire demonstrated the following about the impact of pretrial publicity on the jury: Ten of the jurors and one of the alternates had no recollection whatever of publicity. There was the barest possibility of exposure for jurors Warren and Main and alternate Hubler, but none remembered anything about the case. Alternate Babb had heard about the crime but remembered nothing other than that an elderly couple had been robbed and the man killed. Neither of the alternates was called upon to serve as a juror.\n\nOn this record, we cannot hold that there is a reasonable likelihood that defendant did not have a fair and impartial trial. Vague recollections of news reports by a few jurors do not compel a change of venue. Indeed, a much greater degree of exposure to pretrial publicity would not necessarily have compelled the court to order a change. As courts have recognized, \" '[i]t is not required ... that the jurors be totally ignorant of the facts and issues involved. In these days of swift, widespread and diverse methods of communication, an important case can be expected to arouse the interest of\n\nthe public in the vicinity, and scarcely any of those best qualified to serve as jurors will not have formed some impression or opinion of the merits of the case. ... It is sufficient if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.' \" (People v. Harris, supra, 28 Cal. 3d at pp. 949-950, quoting Irvin v. Dowd (1961) 366 U.S. 717, 722-723 [6 L.Ed.2d 751, 755-756, 81 S.Ct. 1639].)\n\nUnder these guidelines, the effect of pretrial publicity on the jury in this case was insignificant. Not only did the jurors and alternates lack an \" 'impression or opinion of the merits of the case' \" (People v. Harris, supra, 28 Cal. 3d at p. 950), all but one alternate lacked any pertinent knowledge. Thus, the results of voir dire do not indicate a reasonable likelihood that defendant did not in fact receive a fair trial. Because defendant has offered no substantial reason to doubt this Conclusion, we reject his claim that the trial court's failure to change venue requires reversal of the judgment.\n\nF. Denial of Continuance.\n\nDefendant argues that the trial court abused its discretion by denying his request for a continuance at the Conclusion of the guilt phase. Defendant wished to locate an expert witness and to reopen his case- in-chief for the expert's testimony, assuming one could be found. The argument lacks merit because defendant did not show good cause for a continuance.\n\nAt the time defendant was arrested, there was a pair of black and white, wing tip shoes in his car. Five witnesses had seen defendant with such shoes. During the People's case-in-chief, two pathologists and a criminalist testified that a curlicue pattern of bruises on the deceased victim's face and neck could have been made by the shoes' decorative perforations. While the bruises reflected the shoes' exact pattern, no expert could positively attribute decedent's bruises to the particular shoes. Defense counsel's cross-examination emphasized the experts' uncertainty. In addition, defendant testified that the shoes were not his. The People rebutted defendant's testimony by recalling the arresting officers. According to the officers, defendant was not wearing shoes when they stopped him and asked him to get out of his car. Because the sidewalk was hot, defendant asked an officer to retrieve his shoes from the back seat of his car. Those shoes were the shoes in evidence.\n\nAfter the prosecution completed its rebuttal, the defense requested permission to reopen its case-in-chief for expert testimony about the connection between decedent's injuries and the shoes. Based on counsel's representation that he was expecting a witness to arrive \"at any time,\" the court recessed instead of beginning with closing argument. A few hours later, however,\n\ndefense counsel informed the court that the pathologist he had wished to call was \"unable to testify on [defendant's] behalf\" and that efforts to locate a substitute had not been successful. To account for the delay in presenting such testimony, counsel explained that he had made \"a tactical decision during the defense case in chief\" not to call an expert because counsel had felt the prosecution's expert testimony did not require rebuttal. However, the officer's rebuttal testimony had caused counsel to change his mind. Counsel requested a 24-hour continuance. The court denied the request, noting that it might have been unintentionally misled about the purported witness's availability and that there was, in fact, no witness to call.\n\nThe granting or denial of a continuance during trial traditionally rests within the sound discretion of the trial Judge. (People v. Laursen (1972) 8 Cal. 3d 192, 204 [104 Cal. Rptr. 425, 501 P.2d 1145]; see also People v. Grant (1988) 45 Cal. 3d 829, 844 [248 Cal. Rptr. 444, 755 P.2d 894].) To establish good cause for a continuance, defendant had the burden of showing that he had exercised due diligence to secure the witness's attendance, that the witness's expected testimony was material and not cumulative, that the testimony could be obtained within a reasonable time, and that the facts to which the witness would testify could not otherwise be proven. (Owens v. Superior Court (1980) 28 Cal. 3d 238, 250-251 [168 Cal. Rptr. 466, 617 P.2d 1098]; see also § 1050.)\n\nUnder this standard, defendant's attempt to establish good cause was inadequate in two respects. First, defendant did not show that any expert existed who would be willing and able to offer material testimony within a reasonable time. (See Owens v. Superior Court, supra, 28 Cal. 3d at pp. 250-251.) Instead, defendant could only offer the prospect of further delay while he searched. Second, the defense had not been diligent in securing an expert witness's attendance. The defense had been aware of the People's experts since before trial and had had an additional ten days after those experts testified to decide whether to present a rebuttal expert. The decision not to do so achieved the tactical benefit of avoiding further expert testimony to the effect that Mr. Fried had been kicked to death--testimony that defendant could understandably wish to avoid. Defendant argues that the police officers' testimony amounted to a change in circumstances that compelled a reevaluation of counsel's decision. However, the officers' testimony dealt solely with the issue of who owned the shoes; it had no bearing on the subject matter of expert testimony. On this weak showing, we cannot conclude that the trial court's ruling was an abuse of discretion.\n\nNor did the court's ruling deny defendant his federal constitutional rights to due process and compulsory process. \"[I]t is not every denial of a\n\nrequest for more time that violates due process even if the party fails to offer evidence or is compelled to defend without counsel.\" (Ungar v. Sarafite (1964) 376 U.S. 575, 589 [11 L.Ed.2d 921, 931, 84 S.Ct. 841].) Instead, \"[t]he answer must be found in the circumstances present in every case, particularly in the reasons presented to the trial Judge at the time the request is denied.\" (Id., at pp. 589, 591 [11 L.Ed.2d at pp. 931- 932].) In this case, defendant could not show that he had been diligent in securing an expert witness's attendance, that a substitute would be available within a reasonable time, or that any witness, assuming one could be found, would say something material and helpful to the defense. Under these circumstances, \"[g]iven the deference necessarily due a state trial Judge in regard to the denial or granting of continuances,\" the court's ruling does not support a claim of error under the federal Constitution. (See Ungar v. Sarafite, supra, 376 U.S. at p. 591 [11 L.Ed.2d at p. 932]; cf. Hicks v. Wainwright (5th Cir. 1981) 633 F.2d 1146, 1149.)\n\nG. Instructional Error.\n\n1. Instructions on Aiding and Abetting. The trial court instructed the jury regarding the liability of an aider and abettor because there was evidence to show that Ernie Malone accompanied defendant into the Frieds' home and that Malone, rather than defendant, attacked Mrs. Fried. We subsequently held that instructions of the type given here are defective because they do not explain that an aider and abettor must share the principal's unlawful purpose or intend to commit, encourage, or facilitate the crime. (People v. Beeman (1984) 35 Cal. 3d 547, 560- 561 [199 Cal. Rptr. 60, 674 P.2d 1318].)\n\nDefendant argues that these errors, which the People concede in their brief, require us to reverse his convictions for attempting to murder and attempting to commit mayhem upon Mrs. Fried. Defendant theorizes that the instructions would have permitted the jury to find him guilty of these crimes even if Malone had committed them and even if he had not shared Malone's intent. Under the circumstances of this case, the claim has merit.\n\nWe ordinarily hold instructional error such as this to be harmless when the factual question of intent was necessarily resolved adversely to defendant under other, properly given instructions. (See, e.g., People v. Allison (1989) 48 Cal. 3d 879, 897 [258 Cal. Rptr. 208, 771 P.2d 1294]; People v. Sedeno (1974) 10 Cal. 3d 703, 721 [112 Cal. Rptr. 1, 518 P.2d 913].) Indeed, in this case the jury expressly found that defendant personally inflicted great bodily injury on Mrs. Fried. (See § 1203.075, 12022.7; see also § 1203.09 [infliction of great bodily injury on victim over the age of 60].) While that finding\n\nwould normally support an inference that the jury found defendant to be the principal in the crimes against Mrs. Fried (cf. People v. Adcox (1988) 47 Cal. 3d 207, 247 [253 Cal. Rptr. 55, 763 P.2d 906] (Adcox)), the People conceded at oral argument that the evidence was insufficient to support the finding.\n\nThe People's concessions in their brief and at oral argument leave no basis on which we can determine beyond a reasonable doubt that the jury did not base its verdict on the erroneous aiding-and-abetting instructions. (Chapman v. California (1967) 386 U.S. 18, 24 [17 L.Ed.2d 705, 710-711, 87 S.Ct. 824, 24 A.L.R.3d 1065]; People v. Dyer (1988) 45 Cal. 3d 26, 64 [246 Cal. Rptr. 209, 753 P.2d 1].) Accordingly, we shall reverse the convictions for attempted murder and attempted mayhem, as well as the related findings under sections 1203.075, 1203.09, and 12022.7.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\n2. Lack of Instructions on Accomplice Testimony. Defendant submitted proposed instructions regarding the weight and effect of accomplice testimony. (CALJIC Nos. 3.10, 3.11, 3.12, 3.18.) The court did not give the instructions, but the record does not show whether they were withdrawn or refused. Defendant claims on appeal that the instructions were necessitated by the testimony of Denise Devine. However, the record does not indicate that defendant made such an argument in the trial court.\n\nIn any event, the claim of instructional error lacks merit. An accomplice for these purposes is \"one who is liable to prosecution for the identical offense charged against the defendant ....\" (§ 1111.) Only through bare speculation could the jury have concluded that Devine was guilty of the charged offenses as an accomplice. Although many people attended the party at Eddie Franks's house on the night the crimes occurred, no witness testified that Devine left the house with defendant and Ernie Malone, the known perpetrators. Malone, Devine's boyfriend, came to her house the next morning with items stolen from the Frieds. Devine counted some money, hid a purse, and helped to dispose of stolen identification and credit cards. This evidence, however, would at most have made her an accessory after the fact. Mere accessories are not accomplices under section 1111. (People v. Daniels (1991) 52 Cal. 3d 815, 867 [277 Cal. Rptr. 122, 802 P.2d 906] (Daniels); People v. Tewksbury (1976) 15 Cal. 3d 953, 960 [127 Cal. Rptr. 135, 544 P.2d 1335].)\n\nDefendant also argues that Devine was an accomplice based on a tape- recorded statement by Mrs. Fried to the effect that an unidentified Black\n\nwoman was in her house on the night of the crimes and on the fact that police at some point had arrested Devine or threatened her with arrest. However, neither the prosecution nor the defense moved at trial to have Mrs. Fried's statement admitted into evidence. For this reason, defendant's argument that the Sixth Amendment to the United States Constitution entitled him to introduce the statement is irrelevant. The jury did hear that Devine had been threatened with arrest, but it could not properly have found her to be an accomplice based on speculation about the reasons for police conduct.\n\nEven if Devine was not an accomplice as a matter of law, defendant argues that the court should nevertheless have submitted the issue to the jury based on the evidence presented at trial. It is true that a witness's status is a question for the jury if there is a genuine evidentiary dispute and if \"the jury could reasonably [find] from the evidence\" that the witness is an accomplice. (People v. Hoover (1974) 12 Cal. 3d 875, 880 [117 Cal. Rptr. 672, 528 P.2d 760]; see also Daniels, supra, 52 Cal. 3d at p. 867; People v. Gordon (1973) 10 Cal. 3d 460, 468-469 [110 Cal. Rptr. 906, 516 P.2d 298].) In this case, however, there was insufficient evidence to support the inference that Devine shared defendant's criminal purpose or intended to commit, facilitate, or encourage the crime. (Beeman, supra, 35 Cal. 3d at pp. 560-561.) Therefore, the question was a matter of law (Daniels, supra, 52 Cal. 3d at p. 867; Hoover, supra, 12 Cal. 3d at p. 880), and the court did not err in failing to give the proposed instructions.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nH. Yurko Error.\n\nBefore trial, defendant admitted the special allegation that he had served a prison term for burglary within the preceding five years. Based on this admission, the trial court enhanced his sentence for the noncapital crimes by one year. (See § 667.5, subd. (b).) Defendant now contends that the special finding must be reversed because the trial court accepted his admission without first advising him, expressly and on the record, of the privilege against self-incrimination. (See In re Yurko (1974) 10 Cal. 3d 857, 863-864 [112 Cal. Rptr. 513, 519 P.2d 561] (Yurko).)\n\nWhile the trial court clearly erred, the parties disagree on the applicable standard of review. Defendant argues that Yurko error involving Boykin/Tahl admonitions (see Boykin v. Alabama (1969) 395 U.S. 238 [23 L.Ed.2d 274, 89 S.Ct. 1709] (Boykin); In re Tahl (1969) 1 Cal. 3d 122 [81 Cal. Rptr. 577, 460 P.2d 449] (Tahl)) is reversible per se, or regardless of\n\nprejudice. Indeed, most of our statements on the subject support defendant's position, if only by analogy or in dictum. (Cf. People v. Wright (1987) 43 Cal. 3d 487, 493- 495 [233 Cal. Rptr. 69, 729 P.2d 260]; In re Ibarra (1983) 34 Cal. 3d 277, 283, fn. 1 [193 Cal. Rptr. 538, 666 P.2d 980]; In re Ronald E. (1977) 19 Cal. 3d 315, 320-321 [137 Cal. Rptr. 781, 562 P.2d 684].) The one notable exception is People v. Guzman, supra, 45 Cal. 3d 915, 968, in which we applied a harmless error test but did not discuss our earlier holdings. Because of the apparent uncertainty here and in the lower courts,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e we specifically asked the parties to address the question.\n\nWe expressly based our decision in Yurko on the interpretations of federal law set out in Boykin and Tahl. (See Yurko, supra, 10 Cal. 3d at p. 863.) However, the overwhelming weight of authority no longer supports the proposition that the federal Constitution requires reversal when the trial court has failed to give explicit admonitions on each of the so-called Boykin rights. Accordingly, we have no choice but to revisit our prior holdings. \"The question of an effective waiver of a federal constitutional right in a proceeding is of course governed by federal standards.\" (Boykin, supra, 395 U.S. at p. 243 [23 L.Ed.2d at p. 279].)\n\nAs discussed below, we now hold that Yurko error involving Boykin/Tahl admonitions should be reviewed under the test used to determine the validity of guilty pleas under the federal Constitution. Under that test, a plea is valid if the record affirmatively shows that it is voluntary and intelligent under the totality of the circumstances. (See North Carolina v. Alford (1971) 400 U.S. 25, 31 [27 L.Ed.2d 162, 167-168, 91 S.Ct. 160]; Brady v. United States (1970) 397 U.S. 742, 747-748 [25 L.Ed.2d 747, 755-756, 90 S.Ct. 1463]; see also the cases cited in fn. 18, post.) In the exercise of our supervisory powers, we shall continue to require that trial courts expressly advise defendants on the record of their Boykin/Tahl rights. However, errors in the articulation and waiver of those rights shall require the plea to be set aside only if the plea fails the federal test.\n\nBefore Boykin, supra, 395 U.S. 238, it was well established that a valid guilty plea presupposed a voluntary and intelligent waiver of the defendant's constitutional trial rights, which include the privilege against self-incrimination, the right to trial by jury, and the right to confront one's accusers. (See Brady v. United States, supra, 397 U.S. at p. 747, fn. 4 [25 L.Ed.2d at p. 756]\n\n[discussing the law before Boykin ]; see also id., at p. 748; Boykin, supra, 395 U.S. at p. 243, fn. 5 [23 L.Ed.2d at p. 280]; Machibroda v. United States (1962) 368 U.S. 487, 493 [7 L.Ed.2d 473, 477-478, 82 S.Ct. 510]; Kercheval v. United States (1927) 274 U.S. 220, 223 [71 L.Ed. 1009, 1012, 47 S.Ct. 582].) The new question that the high court addressed in Boykin was whether it was permissible to infer such a waiver from a silent record.\n\nThe defendant in Boykin had been sentenced to death after pleading guilty to five counts of robbery. In taking the plea, \"[s]o far as the record show[ed], the Judge asked no questions of [the defendant] concerning his plea, and [the defendant] did not address the court.\" (395 U.S. at p. 239 [23 L.Ed.2d at p. 277].) On review, the high court held that \"[i]t was error ... for the trial Judge to accept petitioner's guilty plea without an affirmative showing that it was intelligent and voluntary.\" (Id., at p. 242 [23 L.Ed.2d at p. 279]; see also id., at p. 244 [23 L.Ed.2d at p. 280].) The court explained its holding in these words: \"Several federal constitutional rights are involved in a waiver that takes place when a plea of guilty is entered in a state criminal trial. First, is the privilege against compulsory self- incrimination .... [Citations.] Second, is the right to trial by jury. [Citations.] Third, is the right to confront one's accusers. [Citations.] We cannot presume a waiver of these three important federal rights from a silent record.\" (Id., at p. 243 [23 L.Ed.2d at pp. 279-280].)\n\nOur first occasion to interpret Boykin came only five months later, before a substantial body of federal law on the point had developed. The defendant in Tahl (supra, 1 Cal. 3d 122) contended that his plea was invalid because, in pleading guilty, he had waived constitutional rights \"more by inference than by express language.\" (Id., at p. 126.) We asked whether Boykin should be interpreted to require explicit waivers of each of the three constitutional rights. Although we acknowledged that \"the Boykin text contain[ed] no such requirement in express terms,\" we nevertheless interpreted that opinion as requiring that \"each of the three rights mentioned--self-incrimination, confrontation, and jury trial--must be specifically and expressly enumerated for the benefit of and waived by the accused prior to acceptance of his guilty plea.\" (Tahl, supra, 1 Cal. 3d at p. 132.)\n\nAlthough we considered the argument that the state Constitution also required explicit waivers, we expressly declined to base our holding on state law. We chose to rely instead on federal law because \"it [was] our view that Boykin necessitate[d] a more precise showing ....\" (Tahl, supra, 1 Cal. 3d at p. 131; see also id., p. 132 \u0026 fn. 5.) Indeed, we stressed the purported federal ground of our decision by noting that \"[a]ny variance [between California law and the law of other jurisdictions] tilts somewhat towards\n\nmore tolerance and less precision \" (id., at p. 127, italics added) and by holding that the defendant's plea was valid under California law. (Id., at pp. 127-129 \u0026 fn. 4.)\n\nFive years later we extended Tahl 's requirement of express admonitions and waivers to cases in which the defendant admits a prior conviction for sentencing purposes. (Yurko, supra, 10 Cal. 3d 857.) In Yurko, we held that the admission of a prior was sufficiently like a plea of guilty to require the same procedural protections. Again, as in Tahl, we expressly based our decision not on state law but rather on Boykin and our own prior interpretation of that decision. (Yurko, supra, 10 Cal. 3d at p. 863.)\n\nThe rule that error under Yurko is reversible per se arose later. Neither Yurko nor Tahl had announced the rule in so many words. To the contrary, in each decision we noted that \"there may be other circumstances in particular cases which may warrant the finding of a proper waiver ....\" (Yurko, supra, 10 Cal. 3d at p. 863, fn. 6; cf. Tahl, supra, 1 Cal. 3d at p. 133, fn. 6.) However, this apparent qualification went unnoticed as we began to state in subsequent cases that the failure to obtain explicit waivers of each of the three Boykin/Tahl rights required reversal regardless of prejudice. (See People v. Wright, supra, 43 Cal. 3d at pp. 493- 495; In re Ibarra, supra, 34 Cal. 3d at p. 283, fn. 1; In re Ronald E., supra, 19 Cal. 3d at pp. 320-321.)\n\nIn the 22 years since Tahl, our interpretation of federal law in that opinion has not garnered significant support in the federal courts. Indeed, the high court has never read Boykin as requiring explicit admonitions on each of the three constitutional rights. Instead, the court has said that the standard for determining the validity of a guilty plea \"was and remains whether the plea represents a voluntary and intelligent choice among the alternative courses of action open to the defendant.\" (North Carolina v. Alford, supra, 400 U.S. at p. 31 [27 L.Ed.2d at p. 168], citing Boykin, supra, 395 U.S. at p. 242 [23 L.Ed.2d at p. 279]; see also Brady v. United States, supra, 397 U.S. at pp. 747-748 [25 L.Ed.2d at pp. 755- 756].) \"The new element added in Boykin \" was not a requirement of explicit admonitions and waivers but rather \"the requirement that the record must affirmatively disclose that a defendant who pleaded guilty entered his plea understandingly and voluntarily.\" (Brady v. United States, supra, 397 U.S. at pp. 747-748, fn. 4 [25 L.Ed.2d at p. 756].)\n\nWhile the high court has never accepted our interpretation of Boykin, the federal appellate courts have expressly rejected it. Consequently, the weight of authority today makes it abundantly clear that \"the California interpretation of Boykin announced in Tahl is not required by the federal Constitution ....\" (United States v. Pricepaul (9th Cir. 1976) 540 F.2d 417, 424-425;\n\nsee also Stinson v. Turner (10th Cir. 1973) 473 F.2d 913, 916.) \" Boykin does not require specific articulation of each of the three rights waived by the guilty plea, as long as it is clear from the record that the plea was voluntary and intelligent ....\" (United States v. Pricepaul, supra, 540 F.2d at p. 424.) There is wide agreement both on this point and on the applicable test: The record must affirmatively demonstrate that the plea was voluntary and intelligent under the totality of the circumstances. (See the cases cited below;\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e see also North Carolina v. Alford, supra, 400 U.S. at p. 31 [27 L.Ed.2d at p. 167]; Brady v. United States, supra, 397 U.S. at pp. 747-748 \u0026 fn. 4 [25 L.Ed.2d at pp. 755-756]; Boykin, supra, 395 U.S. at pp. 242, 244 [23 L.Ed.2d at pp. 279-280].) Because the effectiveness of a waiver of federal constitutional rights is governed by federal standards (Boykin, supra, 395 U.S. at p. 243 [23 L.Ed.2d at p. 279]), we adopt the federal test in place of the rule that the absence of express admonitions and waivers requires reversal regardless of prejudice.\n\nThis does not mean that explicit admonitions and waivers are no longer an important part of the process of accepting a plea of guilty or an admission of a prior conviction. Despite the rejection of Tahl as a matter of federal law, explicit admonitions and waivers still serve the purpose that originally led us to require them: They are the only realistic means of assuring that the Judge\n\nleaves a record adequate for review. (Tahl, supra, 1 Cal. 3d at p. 132.) Moreover, the essential wisdom of explicit waivers remains beyond question. We note that the federal district courts, despite the absence of a constitutional requirement, continue to admonish defendants on the three Boykin rights under the aegis of rule 11 of the Federal Rules of Criminal Procedure. (See Fed. Rules of Crim. Proc., rule 11(c)(3), 18 U.S.C.; see also id., rule 11(h) [codifying the harmless-error test].)\n\nFor these reasons we emphasize that explicit admonitions and waivers are still required in this state. We also reaffirm our caveat in Tahl that trial courts \"would be well advised to err on the side of caution and employ the time necessary to explain adequately and to obtain express waivers of the rights involved. At stake is the protection of both the accused and the People, the latter by the assurance that an otherwise sound conviction will not fall due to an inadequate record.\" (1 Cal. 3d at p. 132.)\n\nWe next consider whether the record in this case affirmatively shows that defendant's admission of the prior conviction constituted a knowing and voluntary waiver of his constitutional rights. For these purposes, we set out the trial court's colloquy with defendant and his counsel:\n\n\"The Court: ... Now, special allegation on page [two] at the top, is there going to be an admission of that?\n\n\"[Defense Counsel]: Yes, this is the prior conviction of burglary in 1980.\n\n\"The Court: All right. Mr. Howard, you have a right to present this--any of these allegations, of course, to the jury for their determination as to whether they're true or not. It is my understanding that you wish to waive that right of presenting it to a jury; is that correct?\n\n\"The Defendant: Yes.\n\n\"The Court: All right. You realize you have the right to force the District Attorney to prove this and to bring in evidence and witnesses?\n\n\"The Defendant: Yeah.\n\n\"The Court: And be confronted by them? You wish to waive those rights?\n\n\"The Defendant: Yes.\n\n\"The Court: And so therefore, you are asking that the special allegation, each time it alleges the prior violation of Section 459 of the Penal Code, on the 2nd of September, 1980, you are--it is your intention to admit that violation?\n\n\"Defendant: Yeah.\"\n\nOn this record, the absence of an express waiver of the privilege against self-incrimination does not lead us to conclude that defendant's admission of the prior was less than voluntary and intelligent. As the Ninth Circuit has explained, \"[a] plea of guilty is the most complete form of self-incrimination. By the plea, the defendant admits that he is guilty of the offense charged.\" It is, thus, \"essential that the defendant know that he has a right not to plead guilty, and that the record show he knows it.\" (United States v. Sherman, supra, 474 F.2d at pp. 305-306.) However, when the record demonstrates that knowledge there is \"no need to go farther and attach to such knowledge the talismanic phrase 'right not to incriminate himself.' \" (Id., at p. 306; see also U.S. v. Henry, supra, 933 F.2d at p. 560; United States v. Caston ([former] 5th Cir. 1980) 615 F.2d 1111, 1113-1116.)\n\nThe record in this case affirmatively demonstrates that defendant knew he had a right not to admit the prior conviction and, thus, not to incriminate himself. The court specifically informed defendant that he had a right to force the district attorney to prove the prior conviction in a trial and that, in such a trial, he would have the rights to a jury and to confront adverse witnesses. The admonitions were not empty words because defendant was actively represented by counsel and preparing for trial on charges to which he had pled not guilty. Moreover, there was a strong factual basis for the plea.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e On this record, considering the totality of the relevant circumstances, we conclude that defendant's admission of the prior conviction was voluntary and intelligent despite the absence of an explicit admonition on the privilege against self-incrimination. Accordingly, we affirm the special finding.\n\nI. Erroneous Financial-gain Special Circumstance.\n\nThe jury found three special-circumstance allegations to be true: murder during the commission of robbery (§ 190.2, subd. (a)(17)(i)) and burglary (subd. (a)(17)(vii)) and for financial gain (subd. (a)(1)). Because the financial-gain allegation was based solely on the robbery, it was error to submit the allegation to the jury. This is because there was no evidence to the\n\neffect that \"the victim's death [was] the consideration for, or an essential prerequisite to, the financial gain sought by the defendant.\" (People v. Bigelow (1984) 37 Cal. 3d 731, 751 [209 Cal. Rptr. 328, 691 P.2d 994, 64 A.L.R.4th 723]; cf. People v. Howard (1988) 44 Cal. 3d 375, 409-410 [243 Cal. Rptr. 842, 749 P.2d 279].) Accordingly, the erroneous special-circumstance finding must be set aside.\n\nIII. Penalty Phase\n\nDefendant strongly opposed, and ultimately frustrated, his counsel's efforts to present a case in mitigation. This circumstance underlies several of defendant's contentions on appeal. Although the contentions lack merit, they do require us to set out the procedural history of the penalty phase in some detail.\n\nThe jury returned its verdict of guilty on Tuesday afternoon. On Thursday morning, the trial court heard motions in limine relating to the penalty phase. The People wished to introduce, as circumstances in aggravation, one prior felony conviction for burglary (see § 190.3, factor (c)) and five alleged instances of prior violent criminal conduct (see § 190.3, factor (b)). Included in the latter category were an assault with a deadly weapon (§ 245), a kidnapping (§ 207), an incident involving vandalism and obstruction of a peace officer (§ 148, 594), and two armed robberies (§ 211). According to the prosecutor, some of these incidents had caused the state to revoke defendant's parole. Apart from the burglary conviction, however, none of the incidents had led to criminal charges. Defense counsel, arguing that the People would not be able to prove any of the uncharged acts beyond a reasonable doubt, persuaded the court to exclude them all.\n\nDefense counsel next asked the trial court either to impanel a new jury for the penalty phase or to permit additional voir dire to determine whether or not there was good cause to do so. (See § 190.4, subd. (c).) The court denied the motion.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nAt that point, defense counsel announced that he and his client did not agree on how to proceed during the penalty phase. In counsel's words, defendant \"does not want me to argue for life imprisonment, nor present any evidence in mitigation. And he--he wants the death penalty. If he were to testify and testifies, he would tell the jury so. We are still in disagreement on\n\nthat matter. He's told me in fact that he wants nothing more to do with the jury or the Judge. He prefers to sit in the tank while the penalty phase was to [proceed].\" Counsel requested a continuance in order to discuss the matter further with his client. The court stated that it was prepared to grant a continuance \"for a couple of days.\"\n\nFinally, counsel suggested that defendant's apparent preference for the death penalty was \"an irrational act\" tantamount to \"suicide\" and, on that basis, asked the court to conduct a competency hearing under section 1368. The court, which was \"quite impressed with the manner in which the defendant [had] conducted himself\" as a witness, declined to declare a doubt as to his competence and denied the motion. (See § 1368, subd. (a).) As already discussed, this ruling was correct. (See p. 1163 et seq., ante.)\n\nWhen court reconvened on Friday, counsel reported that he and defendant were still in disagreement over how to conduct the penalty phase. For that reason, counsel requested permission to withdraw from the representation. The court denied the motion, explaining its understanding of the matter as follows: \"Now, if your client wants to get on the stand in this situation and it has happened before, and say what he wants to say in regards to the death penalty, you can still argue whatever you want for his life. There is no question about that. ... You're certainly more well acquainted with this file, had a closer insight than anybody that I can think of. And I feel you've done a very good job with what you had, and ... I'll deny the motion.\" The court placed no restrictions on counsel, allowing him to proceed as he thought best under the circumstances.\n\nThe penalty phase began on Monday. Defense counsel informed the court that defendant had, after all, consented to the presentation of some mitigating evidence. However, counsel explained that defendant's earlier refusal to permit such evidence had left him unprepared to begin and that he would need \"a couple of days to line up witnesses.\" The court and counsel agreed that the prosecution would begin immediately and that the defense would begin on Wednesday.\n\nBecause defense counsel had persuaded the court to exclude all evidence of uncharged criminal conduct, the case in aggravation was limited to a single felony conviction for burglary. The People proved this conviction exclusively through certified records (see § 969b) and the testimony of two foundational witnesses, who identified defendant's fingerprints and compared them with the fingerprints in the records. Defense counsel conducted a brief cross-examination. The People did not present evidence regarding the circumstances of the prior offense. Because the People had no more witnesses, the court recessed until Wednesday for the convenience of the defense.\n\nOn Wednesday morning the court and counsel placed into the record the substance of an earlier ruling in limine. (See pp. 1165-1166, ante.) Defense counsel had wished to call a clinical psychiatrist as an expert witness on defendant's behalf. However, in forming his opinion the psychiatrist had relied on reports that mentioned the defendant's prior criminal conduct. Defense counsel asked the court to bar the People from cross-examining the expert about the reports, but the court properly refused to do so. (See Evid. Code, § 721, subd. (a).)\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e (21) (See fn. 21.)\n\nIn view of the court's ruling, defense counsel announced that he would not call the witness for tactical reasons. In counsel's words, \"I feel it's in my client's best interest even though the [psychiatrist] would be helpful not to present that evidence and open the door to that cross- examination. So at this time we would have no witnesses to present. We are prepared to argue.\"\n\nBecause the defense rested, the court permitted the prosecutor to begin his argument to the jury. Defense counsel interrupted at one point to object, and his objection led the prosecutor to forgo arguing that the death penalty had deterrent value.\n\nWhen the prosecutor concluded his argument, defense counsel informed the court that defendant did \"not want [counsel] to make any kind of argument on his behalf\" and that, if counsel did argue, defendant would interrupt the proceedings. Counsel did not renew his motion to withdraw. Instead, counsel announced that he would honor his client's wishes. In counsel's words: \"It would be my position at this time then not to make any argument and see to my client's wishes at this point. I feel that would be the least detrimental approach at this time.\"\n\nAt that point, the court engaged in the following colloquy with defendant outside the jury's presence:\n\n\"The Court: Mr. Howard, if Mr. Thommen [defense counsel] did make an argument--is it your intention disrupting--\n\n\"The Defendant: Yeah.\n\n\"The Court: --and say something to the jury and disrupt what he's saying; is that correct?\n\n\"The Defendant: Yeah.\n\n\"The Court: And you understand that he has indicated to you that he feels that he could be helpful in arguing but you don't want him to do that; is that right?\n\n\"The Defendant: I done been railroaded here already, you know, what I'm talking about. I've been convicted of a murder I didn't do. It's no use fighting no more. Let me get to the higher courts and get on out of here.\n\n\"The Court: You don't want Mr. Thommen to argue any further; is that right?\n\n\"The Defendant: No.\n\n\"The Court: He's explained what he would do?\n\n\"The Defendant: Yeah.\n\n\"The Court: If he gets up and attempts anything, you would just disrupt the whole thing?\n\n\"The Defendant: Yeah.\n\n\"The Court: Is that right? And you prefer that he just submit it right now; is that right?\n\n\"The Defendant: Yeah, Yeah.\"\n\nWhen the jury returned to the courtroom, defense counsel made this statement: \"Based upon my client's requests, Cecil has asked me not to make any argument in his behalf. I would submit the matter.\" The court then instructed the jury on the law and directed them to begin their deliberations. Forty-seven minutes later, the jury returned a verdict of death.\n\nA. Claims Related to Defendant's Refusal to Permit Defense Counsel to Present a Case in Mitigation.\n\n1. Improper \"self-representation. \" As the record demonstrates, defendant strongly opposed, and ultimately frustrated, his counsel's efforts to\n\npresent a case in mitigation. Defendant now contends that the court should have ordered defense counsel to disregard his client's expressed wishes and that, by failing to do so, the court in effect permitted defendant to waive the right to counsel and to represent himself. Based on that premise, defendant makes the related contentions that self- representation at the penalty phase is impermissible and that the so-called \"waiver of counsel\" in this case was invalid because it was not express, knowing, or intelligent.\n\nDefendant's claim of improper \"self-representation\" is both factually and legally unsound. It is factually unsound because defendant never asked to represent himself and because the record unequivocally demonstrates that counsel continued to function as such during the penalty phase. Among other things, counsel successfully moved to exclude virtually all of the evidence in aggravation, obtained two-continuances, conducted cross-examination, and significantly limited the prosecutor's closing argument.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Counsel also moved, albeit unsuccessfully, to impanel a new jury and for a competency hearing. In short, counsel performed as well as could reasonably have been expected within the drastic limitations his client imposed.\n\nDefendant's claim is unsound legally as well as factually because it assumes that, if counsel honors his client's wishes to forgo the presentation of a case in mitigation, counsel has ceased to function as counsel. We expressly rejected this argument in People v. Lang (1989) 49 Cal. 3d 991 [264 Cal. Rptr. 386, 782 P.2d 627] (Lang). We reasoned that, \"[t]o require defense counsel to present mitigating evidence over the defendant's objection would be inconsistent with an attorney's paramount duty of loyalty to the client and would undermine the trust, essential for effective representation, existing between attorney and client. Moreover, imposing such a duty could cause some defendants who otherwise would not have done so to exercise their Sixth Amendment right of self-representation [citation] before commencement of the guilt phase [citations] in order to retain control over the presentation of evidence at the penalty phase, resulting in a significant loss of legal protection for these defendants during the guilt phase.\" (Lang, supra, 49 Cal. 3d at p. 1031; see also People v. Deere (1991) 53 Cal. 3d 705, 713-717 [280 Cal. Rptr. 424, 808 P.2d 1181] (Deere II).)\n\nDefendant relies on People v. Bloom (1989) 48 Cal. 3d 1194, 1219 [259 Cal. Rptr. 669, 774 P.2d 698] (Bloom), in which we analyzed another defendant's request to control the presentation of his case as a motion for\n\nself- representation. Unlike the defendant in Bloom, however, defendant here did not seek to \" 'go pro. per.,' \" to assume the role of \" 'cocounsel,' \" to call witnesses, or to participate in their examination. (Id., at p. 1219.) In the case before us, to be sure, defendant's wishes severely limited what counsel might do on his behalf. However, defendant was entitled to place such limits, and counsel could properly choose to respect them. (See Deere II, supra, 53 Cal. 3d at pp. 713-717; Lang, supra, 49 Cal. 3d at p. 1031.)\n\n2. Ineffective assistance of counsel. Our holdings in Deere II (supra, 53 Cal. 3d 705) and Lang (supra, 49 Cal. 3d 991) also dispose of the contention that counsel's decision to honor his client's wishes amounted to an unreasonable interpretation of his ethical obligations and that the court failed to ensure that counsel understood his obligations. Defendant distinguishes Lang, supra, on the ground that counsel in that case did not doubt his client's mental competence. However, as we have already discussed, the facts did not raise a reasonable doubt as to defendant's competence. (See p. 1161 et seq., ante.)\n\nIn a reply brief, defendant also questions his counsel's failure to present additional mitigating evidence after the trial court denied his motion to limit cross-examination of the proposed expert witness. (See p. 1183, fn. 21, ante.) Defendant concedes, however, that counsel's \"control of the defense strategy was short lived\" because defendant thereafter resumed his opposition to any case in mitigation. As defendant also concedes, it is clear that counsel \"did not present available mitigating evidence because [defendant] desired to be sentenced to death\" and that counsel \"vehemently opposed [defendant's] decision not to present a penalty phase defense.\" Under these circumstances, defendant may not complain of counsel's acquiescence. (Deere II, supra, 53 Cal. 3d at p. 717; Lang, supra, 49 Cal. 3d at p. 1032.)\n\n3. Reliability of the verdict. Finally, defendant argues that the lack of mitigating evidence and argument makes the verdict constitutionally unreliable. We have previously rejected this contention, and no point would be served by repeating at length the reasoning of the opinions in which we did so. (See Deere II, supra, 53 Cal. 3d at p. 717; Lang, supra, 49 Cal. 3d at p. 1030; Bloom, supra, 48 Cal. 3d at p. 1228.) In brief, \"the required reliability is attained when the prosecution has discharged its burden of proof at the guilt and penalty phases pursuant to the rules of evidence and within the guidelines of a constitutional death penalty statute, the death verdict has been returned under proper instructions and procedures, and the trier of penalty has duly considered the relevant mitigating evidence, if any, which the defendant has chosen to present.\" (Bloom, supra, 48 Cal. 3d at p. 1228.) The verdict in this case meets those requirements.\n\nB. Brown and Easley Error.\n\nDefendant asks us to reconsider our holding in People v. Brown (1985) 40 Cal. 3d 512, 544 [220 Cal. Rptr. 637, 709 P.2d 440] (Brown), that the sentencing procedure set out in the 1978 death penalty law is not unconstitutionally mandatory. We decline to do so.\n\n(23) (See fn. 23.), Defendant also contends that the same law is unconstitutional as applied to him because the court did not give an explanatory instruction on the weighing process (see Brown, supra, 40 Cal. 3d at p. 545, fn. 19) or an \"expanded factor (k) instruction\" (see People v. Easley (1983) 34 Cal. 3d 858, 878, fn. 10 [196 Cal. Rptr. 309, 671 P.2d 813] (Easley); see § 190.3, factor (k))\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and because the prosecutor assertedly misled the jury about the nature of its sentencing discretion.\n\nTo the extent defendant's claims are based on the federal Constitution, they are obviated by Boyde v. California (1990) 494 U.S. 370, 377- 386 [108 L.Ed.2d 316, 327-333, 110 S.Ct. 1190, 1196-1201], in which the high court held that jury instructions in the statutory language, such as those given here, are constitutional.\n\nTo the extent defendant's claims are based on state law, it is our practice to review the entire record to determine whether \"the sentencer may have been misled to defendant's prejudice about the scope of its sentencing discretion ....\" (Brown, supra, 40 Cal. 3d at p. 544, fn. 17.) Defendant speculates that the jury was misled because the prosecutor emphasized the language of section 190.3 (\"the trier of fact ... shall impose a sentence of death if [it] concludes that the aggravating circumstances outweigh the mitigating circumstances\" [italics added]), said that the word \"shall\" was \"mandatory,\" and reminded the jurors that they had committed themselves to follow the law.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e However, in cases too numerous to mention we have found similar remarks to be harmless. We have, for example, held that argument is not misleading simply because it restates the statutory language (e.g., Hamilton, supra, 48 Cal. 3d at p. 1181), describes the statutory language as mandatory (e.g., Adcox, supra, 47 Cal. 3d at p. 267 [\" 'you haven't any choice' \"]; People v. Hendricks (1988) 44 Cal. 3d 635, 662 [244 Cal. Rptr. 181, 749 P.2d\n\n836] [\"shall\" is a \" 'term of command' \" and \" 'compulsory' \"]), or reminds the jurors of their promise to follow the law (e.g., People v. Burton (1989) 48 Cal. 3d 843, 870 [258 Cal. Rptr. 184, 771 P.2d 1270]).\n\nAccording to defendant, the prosecutor's emphasis on the statutory language was especially likely to mislead the jury in this case because defense counsel did not argue. If defendant had permitted his counsel to argue, counsel might have put the prosecutor's remarks into context by emphasizing the jury's sentencing discretion.\n\nIt is true that the statutory term \"shall,\" understood in context, refers only to the result of a \"weighing\" process. Moreover, it is important to convey the concept of \"weighing\" to the jury because it connotes \"a mental balancing process\" that is \"incapable of precise description\" and, hence, discretionary. (Brown, supra, 40 Cal. 3d at p. 541.) However, the jury was not deprived of the fuller context. The prosecutor repeatedly described the sentencing process as one of \"weighing\" and \"balancing,\" as did the court in its instructions. In addition, the prosecutor correctly identified his own comments on the weight of particular sentencing factors as argument and said that he \"expect[ed] [the jury] to examine [his] arguments with the same critical eye that [it] would examine anything in this case.\" Moreover, the prosecutor expressly acknowledged the jurors' moral discretion, conceding that \"[j]ustice must be tempered by mercy for sure,\" but also arguing that Justice \"must be firm and uncompromising in the face of senseless and unnecessary violence and great depravity.\"\n\nDefendant also argues that jury was misled about its ability to consider character and background evidence in mitigation. (Cf. Easley, supra, 34 Cal. 3d at p. 878.) The claim is somewhat theoretical because defendant did not present any such evidence. On appeal, defendant characterizes as mitigating the People's failure to introduce evidence of prior violent criminal activity under factor (b). (See § 190.3, factor (b).) However, there is no reason to believe that the jury was misled on this point because the court specifically instructed it to consider \"the presence or absence\" of such evidence. The prosecutor did \"point out\" \"the absence of factors in mitigation,\" but such argumentative characterizations of the evidence are generally harmless (e.g., People v. Mason (1991) 52 Cal. 3d 909, 965 [277 Cal. Rptr. 166, 802 P.2d 950] (Mason)), especially when, as here, the prosecutor informs the jury that his Discussion of the sentencing factors is merely argument to be examined with a \"critical eye.\"\n\nIn summary, the court's instructions and the prosecutor's remarks would have led a reasonable juror to understand that capital sentencing was\n\na weighing process that permitted the jury to consider any relevant mitigating evidence and to exercise moral judgment. Thus, we conclude that the jury was not misled about the scope of its discretion. (See Brown, supra, 40 Cal. 3d at 544, fn. 17.)\n\nC. Davenport Error.\n\nTwo years after defendant's trial we held that it is improper for a prosecutor to argue that a mitigating factor, in the absence of pertinent mitigating evidence, becomes an aggravating factor. (People v. Davenport (1985) 41 Cal. 3d 247, 288-290 [221 Cal. Rptr. 794, 710 P.2d 861] (Davenport).) In the case before us, the prosecutor argued to the jury that the apparent lack of \"extreme duress\" was an aggravating factor. (See § 190.3, factor (g).) To support the argument, the prosecutor briefly mentioned evidence to the effect that defendant continued his assault upon Mr. Fried despite his accomplice's request that he stop.\n\nWe have rejected many similar claims. (E.g., Jones, supra, 53 Cal. 3d at p. 1151; People v. Gallego (1990) 52 Cal. 3d 115, 200-201 [276 Cal. Rptr. 679, 802 P.2d 169]; People v. Gonzales (1990) 51 Cal. 3d 1179, 1233-1234 [275 Cal. Rptr. 729, 800 P.2d 1159].) While the prosecutor's argument about factor (g) was incorrect under the rule later adopted in Davenport, supra, for several reasons it is not reasonably possible that the argument affected the jury's verdict. First, the argument did not lead the jury to consider inadmissible evidence or to mistake mitigating evidence for aggravating evidence. This is because defendant's personal role in the attack on Mr. Fried was a \"circumstance[] of the crime\" and, thus, proper aggravating evidence under section 190.3, factor (a).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Second, although the prosecutor briefly reviewed the state of the evidence on several factors, he expressly mischaracterized only factor (g) as aggravating. Third, the jury was not bound in any event to accept the prosecutor's argument regarding factor (g); the court instructed the jury to consider each factor only \"if applicable.\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Fourth, the aggravating evidence can fairly be described as overwhelming; the circumstances of the crime showed defendant's attack on Mr. Fried to have been callous and brutal (see § 190.3, factor (a)), his subsequent statements and conduct indicated a distinct lack of remorse, and he chose not to present a case in\n\nmitigation. Under these circumstances, any error under Davenport, supra, was clearly harmless.\n\nD. Booth/Gathers Error.\n\nDefendant argues that the penalty verdict must be reversed under state and federal law because the prosecutor argued to the jury about the effect of defendant's crimes on the victim's family. The federal cases on which defendant relies were decided long after his trial (Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529] (Booth); South Carolina v. Gathers (1989) 490 U.S. 805 [104 L.Ed.2d 876, 109 S.Ct. 2207] (Gathers)) and have, in the meantime, been overruled: (Payne v. Tennessee (1991) 501 U.S. [115 L.Ed.2d 720, 111 S.Ct. 2597] (Payne).)\n\nIn Edwards, supra, 54 Cal. 3d 787, this court considered the effect of the high court's decision in Payne. We concluded that the specific harm a defendant has caused is a \"circumstance[] of the crime\" (§ 190.3, factor (a)) and, thus, a proper subject of evidence and argument at the penalty phase. (Edwards, supra, 54 Cal. 3d at pp. 832-836.) This analysis represents a return to the understanding that apparently prevailed in this state before our interpretation of factor (a) was colored by the now- overruled decisions in Booth and Gathers. (Edwards, supra, at pp. 834-835; see also People v. Haskett (1982) 30 Cal. 3d 841, 863-864 [180 Cal. Rptr. 640, 640 P.2d 776] (Haskett).)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e There is no need to reiterate Edwards's analysis in detail.\n\nOf course, to say that the prosecutor may argue about the impact of the defendant's crimes \"does not mean that there are no limits on emotional evidence and argument.\" (Edwards, supra, 54 Cal. 3d at p. 836.) Instead, \" 'the jury must face its obligation soberly and rationally, and should not be given the impression that emotion may reign over reason. [Citation.] In each case, therefore, the trial court must strike a careful balance between the probative and the prejudicial. [Citations.] On the one hand, it should allow evidence and argument on emotional though relevant subjects that could provide legitimate reasons to sway the jury to show mercy or to impose the ultimate sanction. On the other hand, irrelevant information or inflammatory rhetoric that diverts the jury's attention from its proper role or invites an irrational, purely subjective response should be curtailed.' \" (Id., at p. 836, quoting Haskett, supra, 30 Cal. 3d at p. 864.) Similarly, under federal law evidence and argument must not be \"so unduly prejudicial that it renders the\n\ntrial fundamentally unfair\" under the due process clause. (Payne, supra, 501 U.S. at p. [115 L.Ed.2d at p. 735, 111 S.Ct. at p. 2608].)\n\nIt is under these standards that we evaluate the prosecutor's argument. For these purposes, we briefly review the evidence on which the argument was based. We do so only to put the argument into context and to explain its evidentiary basis; defendant does not expressly argue that the underlying evidence was improperly admitted at the guilt phase.\n\nTestimony at the guilt phase established the following: Mr. Fried had impaired mobility and needed an aluminum walker. The walker, which was lying on Mr. Fried's body, appeared in photographs of the crime scene. Mr. Fried's two sons, Leland and Albert, helped to establish that a large amount of cash was missing. Leland had recently repaid, in cash, a loan of over $2,000. Both sons testified that their father ordinarily carried several hundred dollars in his wallet. Leland remembered seeing a large amount of cash because he and his father had joked about who had more. Albert remembered seeing a large amount of cash because his father had given him some of it to buy a Mother's Day present. Because the Frieds' family members visited the house often, their testimony helped to establish the time of the murder, that the house had been ransacked, and that particular items were missing. In this context Jo Ann Fried, Albert's wife, mentioned that she knew the Frieds almost as well as her own parents.\n\nBased on the foregoing testimony, the prosecutor commented that Mr. Fried was \"disabled,\" \"a family man,\" and \"of value to his family\" because he \"still can joke\" and was \"still able to render assistance to [his] children.\" The prosecutor also used the family members' testimony, together with defendant's own reported statements about the murder, to make the following argument about moral culpability: \"Mr. Fried is still [of] value, of worth. He's 74. He's old. He's feeble. He's still of some value, some worth to this community. And he lives in a modest home with his wife who helped him raise his kid--kids in the City of Tulare. And into that swaggers the defendant, Cecil Howard. To do what? To stomp and kick Mr. Fried to death. To stop this family. This small touch of civilization. ... For what purpose does Mr. Fried die? We know for money. And that's a base purpose in itself. But for what other reason? Why was it necessary for him to die? Cecil said 'naw, this old mother fucker done seen me.' What caused the end of his life? What caused this impact on his family was seeing Cecil. He saw him. So he had his eyes stomped in. He was kicked in the throat. Without mercy. Without compassion. Kicked to death. A 74 year old man who has to get around in a walker. Coldly with thought. Thinking about it. Doing it with purpose. Mr. Fried died as a circumstance of the crime. The total lack of any reason for him to die is a circumstance of the crime.\"\n\nThese remarks by the prosecutor did not violate state or federal limits on argument regarding the specific harm a defendant has caused. (See Edwards, supra, 54 Cal. 3d at p. 836; Payne, supra, 501 U.S. at p. [115 L.Ed.2d at p. 735, 111 S.Ct. at p. 2608].) The prosecutor used properly admitted evidence to make the obvious points that defendant's crimes were callous and had an impact on the victims' family.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e While the prosecutor clearly asked the jury to consider this impact in assessing defendant's moral culpability, such argument is appropriate at the penalty phase. (Edwards, supra, 54 Cal. 3d at pp. 835-836; cf. Haskett, supra, 30 Cal. 3d at p. 863.) Viewed under state law, the argument was not so \" 'inflammatory' \" as to \" 'divert[] the jury's attention from its proper role.' \" (Edwards, supra, 54 Cal. 3d at p. 836, quoting Haskett, supra, 30 Cal. 3d at p. 864.) Viewed under federal law, the argument was not \"so unduly prejudicial that it render[ed] the trial fundamentally unfair.\" (Payne, supra, 501 U.S. at p. [115 L.Ed.2d at p. 735, 111 S.Ct. at p. 2608].) Accordingly, the prosecutor's argument was not improper.\n\nDefendant also argues that the prosecutor appealed \"to potential xenophobic prejudice\" with the remark that \"Mr. Fried was a member of our community,\" that \"[t]he defendant came into it and brutally killed him and robbed him,\" and that the jury should impose the death penalty to express the community's outrage. To be sure, it would have been seriously improper to argue that defendant's status as an outsider was relevant to the penalty determination. However, the prosecutor did not make such an argument. What the prosecutor did say can fairly be understood as a direct reference to defendant's own testimony that he had come to Tulare about a week before the murder to escape revenge at the hands of his former employer, whose store he had burglarized. For this reason, we do not lightly infer that the prosecutor intended his remarks to have their most damaging meaning or that the jury drew that meaning rather than the less damaging one. (Cf. Donnelly v. De Christoforo (1974) 416 U.S. 637, 647 [40 L.Ed.2d 431, 439, 94 S.Ct. 1868]; Boyde v. California, supra, 494 U.S. at p. 385 [108 L.Ed.2d at p. 332, 110 S.Ct. at p. 1200]; Mason, supra, 52 Cal. 3d at p. 965.) In any event, the prosecutor's remarks were not so inflammatory or unduly prejudicial as to warrant reversal under the standards discussed above.\n\nE. CALJIC No. 8.84.1.\n\nThe trial court instructed the jury with CALJIC No. 8.84.1, the former standard instruction on aggravating and mitigating circumstances.\n\nDefendant claims that the instruction is erroneous because it does not clearly state that factor (b) (prior violent criminal activity) and factor (c) (prior felony convictions) apply only to crimes other than those adjudicated at the guilt phase. (§ 190.3, factors (b) \u0026 (c).) We rejected a similar argument in People v. Miranda (1987) 44 Cal. 3d 57 [241 Cal. Rptr. 594, 744 P.2d 1127] (Miranda), finding it unlikely that a jury would misunderstand the instruction and double- or triple-count aggravating factors. However, \"to avoid any possible confusion on this point\" we also held that trial courts in the future should expressly instruct that factors (b) and (c) do not refer to the crimes underlying the guilt determination. (Id., at p. 106, fn. 28.)\n\nAlthough it would have been incorrect for the jury to apply factors (b) and (c) to the guilt-phase offenses, there is no reason to believe that the jury did. The prosecutor did not mention factor (b) at all. Although he mentioned factor (c), he did so only in the context of an argument about defendant's prior conviction for burglary, which was properly admitted under factor (c). Under these circumstances, defendant's claim lacks merit. (See People v. Siripongs (1988) 45 Cal. 3d 548, 583-584 [247 Cal. Rptr. 729, 754 P.2d 1306]; Miranda, supra, 44 Cal. 3d at p. 106.)\n\nF. Age as an Aggravating Factor.\n\nDefendant contends that the trial court and the prosecutor improperly led the jury to consider defendant's age as an aggravating factor. We find no error.\n\nThe court instructed the jury in correct, statutory language that it was permitted to consider \"[t]he age of the defendant at the time of the crime.\" (See § 190.3, factor (i).) Based on this instruction, the prosecutor argued that defendant was \"31 years old. He's an adult male. He's responsible for his acts. This isn't some kid.\" The argument was proper because the statutory term \"age\" refers to \"any age-related matter suggested by the evidence or by common experience or morality that might reasonably inform the choice of penalty\" and because it is well established that \"either counsel may argue any such age-related inference in every case.\" (People v. Lucky (1988) 45 Cal. 3d 259, 302 [247 Cal. Rptr. 1, 753 P.2d 1052].)\n\nG. Automatic Motion for Modification of the Verdict.\n\nDefendant contends that the trial court, at the automatic motion for modification of the verdict (§ 190.4, subd. (e)), committed Booth and Davenport error and that defense counsel rendered ineffective assistance. (See Booth, supra, 482 U.S. 496; Davenport, supra, 41 Cal. 3d 247.) The contentions lack merit.\n\n1. Booth error. The trial court, before ruling on the automatic motion, permitted the prosecutor to read into the record a letter from the victims' daughter. In her letter the daughter wrote that the \"pain caused by this brutal vicious killing cannot be described\" and asked the Judge to impose the death penalty.\n\nDefendant argues that the trial court, by hearing this letter, violated Booth (supra, 482 U.S. 496). Among other things, Booth held that it violates the Eighth Amendment to the United States Constitution to present to a jury information about the victim's family's characterizations and opinions of the crime, the defendant, and the appropriate sentence. (482 U.S. at pp. 508-509 [96 L.Ed.2d at p. 452].) This part of the Booth decision survives the high court's recent decision in Payne (supra, 501 U.S. at p. , fn. 2 [108 L.Ed.2d at p. 739, fn. 2, 111 S.Ct. at p. 2611, fn. 2]). However, \"the broad holding of Booth... does not extend to proceedings relating to the application for modification of a verdict of death under section 190.4[, subdivision (e)].\" (People v. Benson (1990) 52 Cal. 3d 754, 812 [276 Cal. Rptr. 827, 802 P.2d 330]; see also People v. Duncan (1991) 53 Cal. 3d 955, 981 [281 Cal. Rptr. 273, 810 P.2d 131].)\n\nDefendant also objects, correctly, that a trial court in ruling on the automatic motion may only consider evidence that was presented to the jury. (People v. Jennings (1988) 46 Cal. 3d 963, 995 [251 Cal. Rptr. 278, 760 P.2d 475].) However, such an error is not prejudicial when the court, as here, explains its ruling solely by reference to information presented to the jury and not to the extraneous information. (See Lang, supra, 49 Cal. 3d at p. 1044; Jennings, supra, 46 Cal. 3d at pp. 994-995; cf. People v. Medina (1990) 51 Cal. 3d 870, 912 [274 Cal. Rptr. 849, 799 P.2d 1282].)\n\n2. Davenport Error. As defendant argues, the trial court technically mislabelled several sentencing factors as \"aggravating\" in view of the lack of pertinent mitigating evidence. (Cf. Davenport, supra, 41 Cal. 3d at pp. 288-290.) However, it is unlikely that the Judge was significantly influenced by the lack of evidence on factors (d) (extreme mental or emotional disturbance), (e) (consent of victim), (f) (moral justification), (g) (extreme duress), and (h) (mental disease or defect) because such evidence is typically lacking in murder cases. (See People v. Whitt (1990) 51 Cal. 3d 620, 660 [274 Cal. Rptr. 252, 798 P.2d 849] (Whitt).) The court also mislabeled as aggravating the absence of evidence under factor (k) (other extenuating circumstances). This mistake, however, did not lead the court to disregard mitigating evidence because the defendant presented none. Significantly, the court correctly noted that the absence of prior violent criminal activity was mitigating under factor (b).\n\nThe factor that aggravated defendant's culpability more than any other was his role as the actual killer and the motivating force behind the crimes. In the court's words: \"Not only did [defendant] plan all aspects of the crime, and he put it into effect, but he ultimately did the actual killing.\" This important finding had ample evidentiary support, including defendant's claim that he \"stomped\" Mr. Fried to avoid identification and that he continued the fatal attack despite his accomplice's request that he stop. The court properly discussed this evidence under factor (j) (degree of participation). The court also relied, correctly and expressly, on the weight of the evidence against defendant, the circumstances of the crime (factor (a)) and defendant's prior conviction (factor (c)). In view of the strength of the aggravating evidence on which the court expressly relied and the virtual absence of mitigating evidence, the court's technical mistakes in labelling the sentencing factors were harmless. (Cf. Whitt, supra, 51 Cal. 3d at p. 660; Hamilton, supra, 48 Cal. 3d at pp. 1186-1187; People v. Brown (1988) 46 Cal. 3d 432, 462 [250 Cal. Rptr. 604, 758 P.2d 1135].)\n\n3. Ineffective assistance of counsel. Defendant contends that his counsel rendered ineffective assistance at the hearing on the automatic motion by failing to present argument and by failing to object under Booth (supra, 482 U.S. 496) and Davenport (supra, 41 Cal. 3d 247). The claim based on counsel's failure to argue lacks merit because counsel was honoring defendant's own wish that counsel not \"pursue any activity which would be looked upon as pleading for ... life imprisonment,\" specifically including, according to counsel, argument at the hearing on the automatic motion. The claims based on counsel's failure to object lack merit because the cases on which defendant relies were not decided until long after the trial. Thus, it is unfair to characterize counsel's failure to object as ineffective assistance. (Jones, supra, 53 Cal. 3d at p. 1151.) In any event, the underlying claims lack merit for the reasons already discussed.\n\nH. Effect of Erroneous Special-circumstance Finding.\n\nDefendant contends that the erroneous finding on the financial-gain special circumstance (see pp. 1180-1181, ante) requires the judgment to be reversed because the court at the automatic motion, as well as the jury, considered it in determining the appropriate penalty. However, the record does not support the contention. The financial-gain allegation did not result in the admission of any additional evidence at trial, and the prosecutor, who mentioned it only in passing, did not argue that it had any significance distinct from the valid robbery-murder and burglary-murder findings. Nor does it appear that the court, in ruling on the automatic motion, gave the erroneous finding any significance apart from the valid findings. Under these\n\ncircumstances, there is no reasonable possibility that the erroneous finding affected either the court's decision on the automatic motion or the jury's verdict. (See People v. Adcox, supra, 47 Cal. 3d at pp. 251-252.)\n\nI. Request to Reconsider Previous Holdings.\n\nIn prior decisions we have held that trial courts are not required to identify particular sentencing factors as aggravating or mitigating and that the 1978 death penalty law is constitutional despite the absence of such a requirement. (People v. McLain (1988) 46 Cal. 3d 97, 118 [249 Cal. Rptr. 630, 757 P.2d 569]; People v. Rodriguez (1986) 42 Cal. 3d 730, 777-778 [230 Cal. Rptr. 667, 726 P.2d 113] (Rodriguez).) We have also held that the same law is constitutional despite its failure to require written findings or jury unanimity on aggravating factors, or proof beyond a reasonable doubt that each aggravating factor exists, that aggravating factors outweigh mitigating factors, and that death is the appropriate punishment. (Rodriguez, supra, 42 Cal. 3d at pp. 777-778.) Finally, we have held that effective judicial review is possible without written findings by the jury on aggravating circumstances. (;cf. People v. Frierson (1979) 25 Cal. 3d 142, 178-179 [158 Cal. Rptr. 281, 599 P.2d 587] [1977 death penalty law].) We decline the invitation to reconsider these holdings.\n\nJ. Cumulative Prejudice.\n\nIn his reply brief, defendant contends that particular, asserted errors warrant reversal because of their cumulative effect. However, the claims of error to which defendant refers either lack merit or had no effect on the verdict. These include counsel's permissible decision to honor defendant's wish not to present a case in mitigation (pp. 1184-1185, ante), the prosecutor's proper argument about defendant's age (p. 1193, ante), the court's correct refusal to insulate a proposed expert witness from cross- examination (p. 1183, fn. 21, ante), and prosecutorial argument that would have been improper only under the now-overruled holdings in Booth (supra, 482 U.S. 496) and Gathers (supra, 490 U.S. 805) (see p. 1190, ante). Defendant also points to his claims under Brown (supra, 40 Cal. 3d 512), Easley (supra, 34 Cal. 3d 858), and Davenport (supra, 41 Cal. 3d 247), but any error under those decisions was clearly harmless, as already discussed. (See pp. 1187-1190, ante.)\n\nIV.\n\nThe convictions for attempted murder and attempted mayhem are reversed, and the related findings under sections 1203.09, 1203.075, and\n\n12022.7 are stricken. The special-circumstance finding under section 190.2, subdivision (a)(1), is also stricken. In all other respects the judgment is affirmed.\n\nLucas, C. J., Arabian, J., Baxter, J., and George, J., concurred.\n\nAppellant's petition for a rehearing was denied April 29, 1992.\n\nMosk, J., was of the opinion that the petition should be granted.\n\nConcurring and Dissenting.\n\nI concur in the judgment as to guilt and death eligibility. After review, I have found no error warranting reversal or vacation on either question.\n\nI Dissent, however, as to penalty. Pursuant to People v. Deere (1985) 41 Cal. 3d 353, 360-368 [222 Cal. Rptr. 13, 710 P.2d 925], I would set aside the verdict of death as unreliable under the Eighth Amendment to the United States Constitution and article I, section 17, of the California Constitution because defendant failed, and indeed refused, to introduce available evidence in mitigation.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e If an accused is to be permitted to follow such a course--and thereby practically compel the imposition and subsequent affirmance of the ultimate sanction--he may as well be allowed to irrevocably \"plead death.\" At least in such a situation, we avoid, both at trial and on appeal, the unseemly spectacle of an empty charade.\n\nOne issue presented in this case raises a question of general importance and calls for extended Discussion--defendant's admission of a sentence- enhancement allegation.\n\nIn Boykin v. Alabama (1969) 395 U.S. 238, 242-244 [23 L.Ed.2d 274, 279-280, 89 S.Ct. 1709], the United States Supreme stated the following principles applicable here. For a defendant's guilty plea to be valid under the due process clause of the Fourteenth Amendment, it must be knowing and voluntary. Such a plea effectively waives several federal constitutional rights, including three basic trial rights--viz., the privilege against compulsory self-incrimination, the right to trial by jury, and the right to confront one's accusers. For such a waiver to be valid under the due process clause, it must itself be knowing and voluntary. A valid waiver of the three basic trial rights cannot be presumed from a silent record. It is therefore error for a trial court to accept a guilty plea from a defendant without an affirmative showing that the plea is knowing and voluntary. Such a showing, of course, assures that \"the Judge ... leaves a record adequate for any review that may be later sought ....\" ( at p. 244, fn. omitted [23 L.Ed.2d at p. 281].)\n\nIn In re Tahl (1969) 1 Cal. 3d 122 [81 Cal. Rptr. 577, 460 P.2d 449], we held that Boykin requires that, before accepting a guilty plea, the trial court must give the defendant express admonitions, and obtain from him express waivers, as to each of the three basic trial rights.\n\nThe Tahl holding was virtually unanimous. (1 Cal. 3d at pp. 129- 133; at p. 138 (conc. \u0026 dis. opn. of Peters, J.).) A single Justice Dissented, stating only his disagreement with the Disposition--which did not depend on Boykin. ( at p. 138 (dis. statement by McComb, J.).)\n\nMoreover, the Tahl holding was supported by close analysis. (1 Cal. 3d at pp. 129-133.) We recognized that there were \"at least two plausible interpretations of Boykin. \" ( at p. 130.) One would merely ask for \"statements and facts in the record from which a reasonable presumption could be drawn that a defendant has been apprised of and has voluntarily waived his rights, and has intelligently pleaded guilty.\" ( at pp. 130-131.) The other would demand that each of the three basic trial rights \"must be specifically and expressly enumerated for the benefit of and waived by the accused prior to acceptance of his guilty plea.\" ( at p. 132.) We adopted the latter. We reasoned: \"While the Boykin text contains no such requirement in express terms, we believe it is not only a fair inference from the opinion ... but it is the only realistic means of assuring that 'the Judge ... leaves a record adequate for any review that may be later sought.' \" ()\n\nAt the Conclusion of the relevant Discussion in Tahl, we impliedly raised, but declined to resolve, the question whether harmless- error analysis was available if a trial court failed in its obligations and, if so, what such analysis would entail. (1 Cal. 3d at p. 133.)\n\nIn In re Yurko (1974) 10 Cal. 3d 857 [112 Cal. Rptr. 513, 519 P.2d 561], we held that Boykin and Tahl require that before accepting an admission of a sentence- enhancement allegation, the trial court must give the defendant express admonitions, and obtain from him express waivers, as to each of the three basic trial rights.\n\nThe Yurko holding was unanimous. (10 Cal. 3d at pp. 861-863; at p. 867 (conc. \u0026 dis. opn. of Mosk, J.).) It was also supported by close analysis. ( at pp. 861-863.) We reasoned, in substance, that an admission was functionally equivalent to a guilty plea. ()\n\nAt the Conclusion of the relevant Discussion in Yurko, we impliedly raised, but declined to resolve, the question whether harmless- error analysis was available if a trial court failed in its obligations and, if so, what such analysis would entail. (10 Cal. 3d at p. 863, fn. 6.)\n\nIn the case at bar, the majority undertake to reconsider Tahl and Yurko. I see no reason to do so. The wisdom of requiring express admonitions and waivers, as the majority themselves acknowledge, \"remains beyond question.\" (Maj. opn., ante, at p. 1179.) Moreover, the rules themselves are now long and well settled. \"[T]he respect accorded prior decisions increases ... with their antiquity, as the society adjusts itself to their existence, and the surrounding law becomes premised upon their validity.\" (South Carolina v. Gathers (1989) 490 U.S. 805, 824 [104 L.Ed.2d 876, 892, 109 S.Ct. 2207] (dis. opn. of Scalia, J.).) Finally, the exercise of reexamination here turns out to be merely academic: the result is simply to declare again rules declared previously--albeit on supervisory rather than federal constitutional grounds.\n\nBe that as it may, if Tahl and Yurko are indeed to be reconsidered, they should then be reaffirmed categorically and unconditionally.\n\nTo begin with, the holdings of Tahl and Yurko are supported by persuasive Discussion. They are also clear and unambiguous, easy to understand and easy to apply.\n\nFurther, the United States Supreme Court has never explicitly rejected either Tahl or Yurko. Nor has it done so implicitly.\n\nContrary to the majority's implication, neither Brady v. United States (1970) 397 U.S. 742 [25 L.Ed.2d 747, 90 S.Ct. 1463], nor North Carolina v. Alford (1970) 400 U.S. 25 [27 L.Ed.2d 162, 91 S.Ct. 160], purports even to consider the question whether Boykin requires express admonitions and waivers.\n\nIn a footnote, Brady states in dictum that \"The requirement that a plea of guilty must be intelligent and voluntary to be valid has long been recognized. The new element added in Boykin was the requirement that the record must affirmatively disclose that a defendant who pleaded guilty entered his plea understandingly and voluntarily.\" (397 U.S. at pp. 747-748, fn. 4 [25 L.Ed.2d at p. 756], citation omitted.) Precisely what the required affirmative disclosure demands does not figure in Brady in any way. Therefore, the quoted statement does not bear on the issue of express admonitions and waivers.\n\nFor its part, Alford states that United States v. Jackson (1968) 390 U.S. 570 [20 L.Ed.2d 138, 88 S.Ct. 1209], \"established no new test for determining the validity of guilty pleas. The standard was and remains whether the plea represents a voluntary and intelligent choice among the alternative courses of action open to the defendant.\" (400 U.S. at p. 31 [27 L.Ed.2d at pp.\n\n167- 168].) Jackson dealt only with the question whether a guilty plea entered to avoid the death penalty was voluntary. Here too, the quoted statement does not bear on the issue of express admonitions and waivers.\n\nI recognize, as I must, that Tahl and Yurko stand against a majority of lower federal court decisions. (See, e.g., United States v. Pricepaul (9th Cir. 1976) 540 F.2d 417, 424-425 [guilty plea].) But they certainly do not stand alone. (See, e.g., United States ex rel. Miller v. McGinnis (7th Cir. 1985) 774 F.2d 819, 823- 824 [guilty plea].)\n\nIn any event, the dispositive issue is whether Tahl and Yurko were correctly decided. I believe they were: as stated above, the supporting Discussion is persuasive.\n\nAlthough I see no reason for us to reconsider Tahl and Yurko, I do believe that we should consider the general question of the availability and character of harmless-error analysis. This broad issue has never been definitively resolved.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e It should be. Otherwise, the conflicts that have arisen in the case law\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e are likely to persist and indeed grow more numerous and more severe.\n\nTo my mind, automatic reversal should not result on the erroneous omission of one or more express admonitions and/or waivers as to one or more of the three basic trial rights when a guilty plea or an admission is accepted.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nFor example, in many cases a reviewing court may perhaps be able to declare the error harmless by finding that the trial court substantially complied with its obligations. The standard, suggested by the case law, is whether \"the record ... affirmatively disclose[s]\" (Brady v. United States, supra, 397 U.S. at p. 747, fn. 4 [25 L.Ed.2d at p. 756]) that the guilty plea or admission in question \"represents a voluntary and intelligent choice among the alternative courses of action open to the defendant\" (North Carolina v. Alford, supra, 400 U.S. at p. 31 [27 L.Ed.2d at p. 168]). That is to say, does the record show on its face that the guilty plea or admission amounts to a knowing and voluntary decision to exercise or abandon the three basic trial rights? The relevant choice--trial or no trial--can be knowing and voluntary if and only if what is chosen thereby--trial rights or no trial rights--is itself understood and intended.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn other cases, in which substantial compliance cannot be found, the reviewing court may simply vacate the judgment in pertinent part and remand the cause to the trial court for a limited evidentiary hearing. At such a hearing, the court would determine whether the defendant's guilty plea or admission was in fact knowing and voluntary. If yes, it would reinstate the judgment. If no, it would strike the guilty plea or admission and allow the defendant to respond to the charge anew.\n\nIn accepting defendant's admission of the sentence-enhancement allegation in this case, the trial court gave express admonitions, and obtained express waivers, concerning two of the three basic trial rights, i.e., jury trial and confrontation. It failed, however, to give such an admonition or to obtain such a waiver as to the third, i.e., the privilege against compulsory self- incrimination. The omission was, of course, error. But it was not fatal. The court substantially complied with its obligations. It explicitly told defendant that he had \"the right to force the District Attorney to prove this and to bring in evidence and witnesses[.]\" It thereby implicitly told him that he had the right to stand mute at trial if he so chose. Hence, the record shows on its face that defendant's admission amounts to a knowing and voluntary decision to abandon the privilege.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Accordingly, the error was harmless.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn Conclusion, although I would affirm the judgment in all other respects, I would reverse it insofar as it imposes the sentence of death.\n\nConcurring and Dissenting.\n\nI join the majority in affirming defendant's conviction and death sentence.\n\nUnlike the majority, however, I conclude that defendant did establish a prima facie case, or a strong likelihood, that during jury selection impermissible group bias was the basis for the prosecutor's use of peremptory challenges to remove the only two African-American jurors. Once defendant made such a showing, the burden shifted to the prosecutor to show that group bias did not form the basis for the jurors' removal. (People v. Wheeler (1978) 22 Cal. 3d 258, 281 [148 Cal. Rptr. 890, 583 P.2d 748].) The prosecutor, however, discharged this burden when he gave plausible reasons for the jurors' exclusion, without any challenge or disagreement by the defense. Thus, there was no reversible error.\n\nI.\n\nDefendant, an African-American, was charged with the murder, mayhem and robbery of Roy Fried, and the attempted murder, attempted mayhem and robbery of Gladys Fried, both White. During jury selection, the prosecutor used two of his first four peremptory challenges to remove the only two African- American jurors called into the jury box. Defendant moved to quash the jury panel under People v. Wheeler, supra, 22 Cal. 3d 258. The trial court denied defendant's motion. The court did so without requiring the prosecutor to give reasons for exercising the challenges, implicitly finding that defendant had failed to make a prima facie showing of group bias. Several days later, the prosecutor filed a written declaration stating his reasons for the peremptory challenges. Defendant now contends that the trial court committed prejudicial error when it denied his Wheeler motion without first requiring the prosecutor to justify his peremptory challenges of the two African-American jurors.\n\nIn People v. Wheeler, supra, 22 Cal. 3d at pages 276-277, we held that \"the use of peremptory challenges to remove prospective jurors on the sole ground of group bias violates the right to trial by a jury drawn from a representative cross-section of the community under article I, section 16, of\n\nthe California Constitution.\" We then described the procedure to be followed by the trial court when a party contends that the opposing party is improperly exercising peremptory challenges on the basis of group bias.\n\nAs a threshold requirement, the objecting party must make a prima facie case, that is, a showing of a \"strong likelihood,\" that jurors have been excluded because of their membership in a cognizable group within the meaning of the representative cross-section rule. If the trial court finds that such a showing has been made, the burden shifts to the allegedly offending party to show that the challenges were made for constitutionally permissible reasons. If the trial court finds no justification, it must quash the venire, and begin jury selection again with a new venire. (People v. Wheeler, supra, 22 Cal. 3d at pp. 280-282; see also Batson v. Kentucky (1986) 476 U.S. 79, 96-98 [90 L.Ed.2d 69, 87-88, 106 S.Ct. 1712].)\n\nThe Wheeler court mentioned, by way of example, four types of evidence that would tend to show group bias. As I shall demonstrate, this case has all four types of evidence, which created the appearance that the prosecutor's use of peremptory challenges was based not on specific bias but on group discrimination.\n\nIllustrative of group bias, we said in Wheeler, is a showing that a party \"has struck most or all of the members of the identified group from the venire, or has used a disproportionate number of his [or her] peremptories against the group.\" (People v. Wheeler, supra, 22 Cal. 3d at p. 280.) Here, the prosecutor used peremptory challenges to remove the only two African-American jurors called. Moreover, the jurors were two of the first four jurors the prosecutor challenged, before he ever \"passed\" the jury.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea\n\nAlso indicative of group bias, we observed in Wheeler, is the failure of the allegedly offending party \"to engage [the challenged] jurors in more than desultory voir dire, or indeed to ask them any questions at all.\" (People v. Wheeler, supra, 22 Cal. 3d at p. 281.) Here, as I shall show, the prosecutor's questioning of prospective jurors Betty T. and Katie B. was brief and perfunctory.\n\nDuring the initial stage of the voir dire, when the prospective jurors were individually questioned about their views on the death penalty, the prosecutor asked juror Betty T. only two questions and juror Katie B. only three.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea By comparison, the prosecutor's questioning of most of the other jurors was more extensive.\n\nAt the second stage of the voir dire, when the prosecutor and defense counsel asked more general questions of the jury, the prosecutor questioned the panel only briefly. He asked each juror if he or she would return a guilty verdict if the prosecution proved its case beyond a reasonable doubt; Katie B. and Betty T. joined the other prospective jurors in responding affirmatively. The prosecutor directed most of his other questions to the jury as a whole; jurors responded only if the questions applied to them. During that questioning, juror Betty T. responded that she was a nonpracticing registered nurse, and juror Katie B. replied that she worked as a nurse's aide. The prosecutor then asked these two prospective jurors if their training would impair their ability to critically evaluate testimony of witnesses; both said it would not. They made no response to any other questions the prosecutor addressed to the panel.\n\nThe third element the Wheeler court discussed as being an indicator of a strong likelihood of group bias is the defendant's membership in the excluded group and the alleged victim's membership in the group to which the majority of the jurors belong. (People v. Wheeler, supra, 22 Cal. 3d at p. 281.) Here, defendant was African- American, as were the excluded jurors; but his two victims, and the remaining jurors, were White.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ea\n\nWheeler suggested a fourth factor indicative of a prima facie case of group discrimination: a showing that the peremptorily challenged jurors share only\n\ntheir membership in the group, being in other respects--such as sex, age, occupation, and social and economic background--as heterogeneous as the community as a whole. (People v. Wheeler, supra, 22 Cal. 3d at p. 280 \u0026 fn. 27.) Here, the two prospective jurors in question had some things in common other than race: both were women, both were housewives, and both had some nursing experience. But these points of similarity provided no obvious basis for prosecutorial challenge and were overshadowed by other differences. Betty T. lived in Porterville, had a degree in sociology, was married to a physician, was a member of the Sierra Club, was involved in the nuclear freeze movement, and had previously served on a jury. By comparison, juror Katie B. lived in Tulare, had not graduated from high school, was married to a retired gardener, was apparently not connected with any political or environmental group, and had never served on a jury. Thus, in terms of factors likely to influence the exercise of a peremptory challenge on grounds other than group bias, these jurors were predominantly dissimilar.\n\nRelying on People v. Bittaker (1989) 48 Cal. 3d 1046 [259 Cal. Rptr. 630, 774 P.2d 659], the majority concludes that the trial court did not err when it found that defendant had not made a prima facie showing of group bias, because the record \" 'suggests grounds upon which the prosecutor might reasonably have challenged' \" the two excluded African-American jurors. (Maj. opn., ante, p. 1155, quoting People v. Bittaker, supra, 48 Cal. 3d at p. 1092.) The majority's reliance on Bittaker is misplaced for two reasons.\n\nFirst, unlike the situation here, People v. Bittaker, supra, 48 Cal. 3d 1046, is not a case in which the guidelines that were given in People v. Wheeler, supra, 22 Cal. 3d at pages 280-281, and that I discussed in detail above, suggested that group bias formed the basis for the prosecutor's peremptory challenges. Bittaker was not a member of the same minority group to which the excluded jurors belonged, the prosecutor did not remove all of the jurors on the panel who were members of that minority group, and there was no indication that the prosecutor's questioning of the dismissed jurors was \"desultory.\"\n\nSecond, in contrast to this case, there were compelling reasons why the prosecutor in Bittaker would wish to exclude the jurors in question: four of them had expressed significant reservations about voting to convict the defendant of murder or to impose the death penalty,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ea while the fifth, who had studied psychology, said: \" 'I really feel that I would try to be an amateur\n\npsychologist, psychiatrist, if I was in this case, in due fairness.' \" (People v. Bittaker, supra, 48 Cal. 3d at p. 1092.) This is not the case here.\n\nThe majority makes much of the fact that juror Katie B., when asked about her feelings about the death penalty, replied she had \"never been confronted with this [question] before\" and had not \"thought it over.\" But unlike the answers of the challenged jurors in People v. Bittaker, supra, 48 Cal. 3d at page 1092, Katie B.'s response showed no reluctance to impose the death penalty; it simply reflected a recognition that the issue was an important one deserving of careful thought. In answer to other questions asked by the trial court, Katie B. said she had no religious or personal beliefs that would prevent her from voting for the death penalty. In response to the court's statement, \"What we are trying to find out is whether somebody is so strongly opposed that no matter what the circumstances and what was presented, they couldn't vote for [the death penalty],\" she replied, \"That's not me.\" There was no apparent concern by the prosecutor about prospective juror Katie B.'s alleged reluctance to impose the death penalty: he asked her no questions on the subject, and did not mention her responses when he filed his written explanation of his reasons for the peremptory challenges.\n\nIn the case of prospective juror Betty T. too, there was no obvious reason for the prosecutor's removal of her. The majority states that her \"professional training\" (she was a nonpracticing registered nurse) suggested a basis for disqualification. Yet there was nothing in the nature of the offenses charged to suggest that her nursing background would make her objectionable to the prosecution.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ea The prosecutor's affidavit made no mention of juror Betty T.'s professional training as his reason for excluding her.\n\nThere were, in sum, no immediately apparent reasons justifying the prosecutor's peremptory challenges against prospective jurors Katie B. and Betty T., the only African-American persons called. The voir dire was similar to that in People v. Snow (1987) 44 Cal. 3d 216, 223 [242 Cal. Rptr. 477, 746 P.2d 452], in which \"several Black venirepersons were excused after giving seemingly routine, acceptable responses to the prosecutor's\n\nquestions.\" Some of the answers given by the two excluded jurors here might have furnished the prosecution a legitimate basis for the use of a peremptory challenge against them. But, as in Snow, supra, \"the record reveals no 'obvious' or 'apparent' reason for excusing [the jurors].\" ()\n\nI recognize that in this case the prosecutor exercised peremptory challenges against \"only\" two African-American jurors, but a single discriminatory exclusion violates a defendant's right to a representative jury (People v. Fuentes (1991) 54 Cal. 3d 707, 716, fn. 4 [286 Cal. Rptr. 792, 818 P.2d 75]), and in this case the prosecutor succeeded in removing all the African-American jurors who were tentatively seated. Instructive on this point is People v. Turner (1986) 42 Cal. 3d 711 [230 Cal. Rptr. 656, 726 P.2d 102]. There, as here, the prosecutor used two early peremptory challenges to remove the only African-American jurors tentatively seated. We commented that the trial court's implied finding of a prima facie case \"was amply supported by the record.\" ( at p. 719.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003ea Thus, it is no answer to an otherwise sufficient showing of a prima facie case that no more than two jurors have been improperly struck. To hold otherwise would improperly sanction the use of racially motivated challenges when only one or two members of the targeted race are present in the venire.\n\nIn those instances where the record has established a prima facie case of group bias, this court has held that the trial court's failure to require an explanation for the peremptory challenges in question was improper. (People v. Snow, supra, 44 Cal. 3d at p. 226; People v. Motton (1985) 39 Cal. 3d 596, 608 [217 Cal. Rptr. 416, 704 P.2d 176]; People v. Allen (1979) 23 Cal. 3d 286, 294 [152 Cal. Rptr. 454, 590 P.2d 30]; People v. Wheeler, supra, 22 Cal. 3d at p. 283.) Here, as I have established above, application of the four factors set forth in Wheeler suggest that the only two African-American persons called were excluded because of group bias; in contrast to People v. Bittaker, supra, 48 Cal. 3d 1046, there were no compelling reasons justifying the prosecutor's peremptory challenges against these jurors. Therefore, the trial court should not have assumed without inquiry that the prosecutor's peremptory challenges to remove the only two African-American jurors called were for constitutionally permissible reasons. Accordingly, the court erred in finding that defendant had not established a prima facie case, or a strong likelihood, of discriminatory juror exclusion. This does not end the matter, however.\n\nII.\n\nAs I mentioned at the outset, the establishment of a prima facie case of impermissible juror exclusion based on group bias merely shifts the burden\n\nto the party exercising the peremptory challenges to show that they were made for constitutionally permissible reasons. (People v. Wheeler, supra, 22 Cal. 3d at p. 281; Batson v. Kentucky, supra, 476 U.S. at pp. 97-98 [90 L.Ed.2d at p. 88].) Here, although not required by the trial court to do so, the prosecutor discharged his burden of demonstrating a nonracial basis for his exclusion of the jurors in question.\n\nAfter the trial court's denial of defendant's Wheeler motion, the prosecutor advised the court that he intended to file a declaration explaining the reasons for the peremptory challenges. The trial court responded: \"You may do so. If [defendant] wants to respond, he can.\" Thus blessed with judicial authorization,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003ea the prosecutor filed a declaration explaining his challenges.\n\nThe prosecutor gave three reasons for removing juror Katie B. First, she was \"passive\" in the way she answered questions leading him to believe she might reach a decision that was not well thought out. Second, she was \"grossly overweight, appeared unclean and wore an excess of cheap jewelry,\" factors he believed might prevent effective interaction with other jurors. Third, her facial expressions and the manner in which she responded \"communicated a difficulty in being able to mentally grasp the process of a criminal trial involving the death penalty.\"\n\nWith regard to juror Betty T., the prosecutor also articulated three reasons for his peremptory challenge of her. First, he was concerned that Betty T's degree in sociology might lead her to assign \"responsibility for a person's conduct to societal systems, such as economics, and environmental influences.\" Second, she was involved in the nuclear freeze movement; because some members of that movement advocate acts of civil disobedience, the prosecutor thought that Betty T. might hold beliefs that would lead her to make a decision not based on the law. Third, Betty T. was dressed in a style that made her look like \"an aged hippy,\" leading the prosecutor to believe that she might be less willing to follow the law in this case.\n\nDespite the trial court's invitation to do so, defense counsel made no response to the prosecutor's articulation of reasons for his peremptory challenges. Defense counsel's failure to respond gives rise to the reasonable inference that the prosecutor accurately described the facts relating to the challenged jurors' appearance and behavior that led to his peremptory challenges of them.\n\nHad the trial court found the prosecutor's explanations for his peremptory challenges convincing, that determination would undoubtedly have been\n\naccepted on appeal. (See People v. Johnson (1989) 47 Cal. 3d 1194, 1220 [255 Cal. Rptr. 569, 767 P.2d 1047] [\"if ... jurors appear to be passive or timid types, it would not be unusual or unreasonable for the lawyer to peremptorily challenge [them] even though other similar types remain\"]; People v. Wheeler, supra, 22 Cal. 3d at p. 275 [\"a prosecutor may fear bias on the part of one juror ... simply because his clothes or hair length suggest an unconventional lifestyle\"].) Here, the trial court never actually evaluated the prosecutor's reasons for excluding the two challenged jurors. Nevertheless, the prosecutor's explanations are plausible, and there is no apparent reason why we should reject them. (Indeed, those aspects of the jurors' appearance that the prosecutor found significant may well have influenced the trial court's determination that defendant had not established a prima facie case of group discrimination in the prosecutor's use of peremptory challenges.) Jury selection is often a matter of guesswork, and it is not unusual for attorneys to exercise peremptory challenges for reasons such as those given by the prosecutor in this case.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nPeremptory challenges are a significant part of trial by jury. (Batson v. Kentucky, supra, 476 U.S. at p. 98 [90 L.Ed.2d at p. 89].) They may be based \"on a broad spectrum of evidence suggestive of juror partiality [ranging] ... from the obviously serious to the apparently trivial, from the virtually certain to the highly speculative.\" (People v. Wheeler, supra, 22 Cal. 3d at p. 275.) Through the use of peremptory challenges, both sides can guard against the possibility that jurors before whom they try the case will base their decision not on the evidence before them but on their particular prejudices. Accordingly, courts must be careful not to \"undermine the contribution the challenge generally makes to the administration of Justice.\" (Batson v. Kentucky, supra, 476 U.S. at pp. 98-99 [90 L.Ed.2d at p. 89].) No party, therefore, should be denied its statutory right to exercise peremptory challenges (Code Civ. Proc., § 231) unless necessary to protect the opposing party's right to a jury drawn from a representative cross-section of the community (People v. Wheeler, supra, 22 Cal. 3d at pp. 276-277) or to equal protection under the law (Batson v. Kentucky, supra, 476 U.S. at p. 89 [90 L.Ed.2d at pp. 82-83]).\n\nAs I have discussed above, defendant's failure to rebut the prosecutor's plausible reasons for challenging prospective jurors Katie B. and Betty T., notwithstanding the trial court's invitation that he do so, suggests the accuracy of those explanations. I therefore conclude that under People v.\n\nWheeler, supra, 22 Cal. 3d at page 282, the prosecutor sustained his burden of explaining that his peremptory challenges of Katie B. and Betty T. were for constitutionally permissible reasons. Accordingly, I would affirm defendant's conviction and death sentence, although not for the reasons expressed by the majority.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory citations are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Ernie Malone was charged with murder as a codefendant, tried separately, found guilty as an accomplice, and sentenced to life without possibility of parole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. A few days after the trial court denied the Wheeler motion, the prosecutor submitted a declaration explaining his peremptory challenges. Because the trial court did not find a prima facie case, request explanations, or consider the prosecutor's declaration, we reject the People's argument that defendant waived the claim by failing to submit a responsive declaration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendant argues that the relevant circumstances include the fact that, four and one- half years after the trial in this case, the Court of Appeal reversed on Wheeler grounds an unrelated case tried later by the same prosecutor. (People v. Granillo (1987) 197 Cal. App. 3d 110 [242 Cal. Rptr. 639] [prosecutor failed to carry his burden of justification as to a single juror].) However, even if a trial court might properly consider a prosecutor's past in determining whether a prima facie case exists, a court obviously cannot consider a prosecutor's future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Tenth Circuit applied Swain, supra, 380 U.S. 202, rather than Batson v. Alabama, supra, 476 U.S. 79, because the latter does not apply retroactively on collateral review. (Andrews v. Deland, supra, 943 F.2d at p. 1178, fn. 21; see Allen v. Hardy (1986) 478 U.S. 255, 257-261 [92 L.Ed.2d 199, 203-206, 106 S.Ct. 2878].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant's motion for judicial notice of the results of the 1980 federal census is granted. (See Evid. Code, § 452, subds. (c) \u0026 (h); People v. Williams (1883) 64 Cal. 87, 91 [27 P. 939].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Three members of the pool (Patricia Cardoza, Eleanor Ribiero, and Frank Pedro) have apparently Hispanic surnames that are not included in the 1980 Census List of Spanish Surnames. If one includes these persons, Hispanics made up 16.4 percent of the venire and 12.0 percent of the pool.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Although the percentage of Hispanics in the general population did not match the percentage in the venire, defendant has not attempted to show that this disparity resulted from any improper practice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defense counsel claims that he also raised the matter the next day at an unreported bench conference. After a hearing to settle the record, the trial court declared itself \"unable to make a special finding\" on the accuracy of counsel's recollection. (See p. 1164 et seq. post.) For the sake of argument we assume that counsel's recollection is accurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Other arguments related to defendant's desire not to present a case in mitigation are discussed below. (See p. 1184 et seq., post.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Defendant reiterated his desire not to present mitigating evidence after the prosecutor finished his closing argument. Defendant explained to the court that he had been \"railroaded\" and wanted to \"get to the higher courts and get on out of here.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defendant restates his claim as one based on the trial court's failure to appoint a psychiatric expert to investigate his competence (People v. Campbell (1987) 193 Cal. App. 3d 1653, 1663 [239 Cal. Rptr. 214]; see also Evid. Code, § 730) and on a denial of his right to be mentally present at trial (In re Dennis (1959) 51 Cal. 2d 666, 671-672 [335 P.2d 657]). However, these alternative formulations do not lead to a different Conclusion. Absent a reasonable doubt as to defendant's mental competence, the trial court had no obligation to pursue the matter further. (Jones, supra, 53 Cal. 3d at p. 1152; cf. People v. Campbell, supra, 193 Cal. App. 3d at p. 1663.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Because the claim of error has been preserved for appeal, there is no need to consider defendant's alternative argument that a failure to preserve the claim would have amounted to ineffective assistance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Defendant makes a related claim involving prosecutorial argument at the penalty phase. (See p. 1192, post.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Because we must reverse the conviction for attempted murder, there is no need to discuss the effect of the jury instructions on attempted murder, which were erroneous under People v. Lee (1987) 43 Cal. 3d 666, 670-671 [238 Cal. Rptr. 406, 738 P.2d 752], and People v. Ratliff (1986) 41 Cal. 3d 675, 695-696 [224 Cal. Rptr. 705, 715 P.2d 665].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Accordingly, we need not address defendant's contention that an erroneous refusal to instruct on accomplice testimony would have impaired various rights under the federal Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. There are lower court decisions holding that Yurko error involving Boykin/Tahl admonitions is reversible per se. (People v. Ray (1990) 220 Cal. App. 3d 943, 945-950 [269 Cal. Rptr. 682] [\"It may be that Yurko is due for reexamination\"]; People v. Johnson (1989) 212 Cal. App. 3d 1179, 1182 [261 Cal. Rptr. 159].) However, other decisions hold that such error is reversible only for prejudice. (People v. Shippey (1985) 168 Cal. App. 3d 879, 889-890 [214 Cal. Rptr. 553]; People v. Prado (1982) 130 Cal. App. 3d 669, 675-676 [182 Cal. Rptr. 129].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The authority on these points can fairly be described as overwhelming. All but two circuits agree, and those two (the First and the District of Columbia) appear not to have addressed the issue. See, e.g., Third Circuit: United States v. Vallejo (3d Cir. 1973) 476 F.2d 667, 671; Davis v. United States (3d Cir. 1972) 470 F.2d 1128, 1132. Fourth Circuit: Wade v. Coiner (4th Cir. 1972) 468 F.2d 1059, 1060-1061. Fifth Circuit: Alexander v. Whitley (5th Cir. 1991) 940 F.2d 946, 947; Holloway v. Lynaugh (5th Cir. 1988) 838 F.2d 792, 793-794. Sixth Circuit: Riggins v. McMakin (6th Cir. 1991) 935 F.2d 790, 794-795. Seventh Circuit: U.S. v. Henry (7th Cir. 1991) 933 F.2d 553, 559-560. Eighth Circuit: Gonzales v. Grammer (8th Cir. 1988) 848 F.2d 894, 897; Stacey v. Solem (8th Cir. 1986) 801 F.2d 1048, 1050-1051; Todd v. Lockhart (8th Cir. 1974) 490 F.2d 626, 628 \u0026 fn. 1. Ninth Circuit: United States v. Carroll (9th Cir. 1991) 932 F.2d 823, 824-825; Rodriguez v. Ricketts (9th Cir. 1986) 798 F.2d 1250, 1254; United States v. Pricepaul, supra, 540 F.2d at pp. 424-425; Wilkins v. Erickson (9th Cir. 1974) 505 F.2d 761, 763- 764; United States v. Sherman (9th Cir. 1973) 474 F.2d 303, 305- 306. Tenth Circuit: Stinson v. Turner, supra, 473 F.2d at pp. 915-916. Eleventh Circuit: McChesney v. Henderson ([former] 5th Cir. 1973) 482 F.2d 1101, 1106-1111; United States v. Frontero ([former] 5th Cir. 1971) 452 F.2d 406, 415 [cases decided by the former Fifth Circuit on or before September 30, 1981, are binding as precedent in the Eleventh Circuit; see Bonner v. City of Prichard (11th Cir. 1981) 661 F.2d 1206, 1207].) The Second Circuit has adopted a standard of strict adherence to rule 11(c)(3) of the Federal Rules of Criminal Procedure, which directs federal district courts to inform defendants of their Boykin rights before accepting guilty pleas. (People v. Journet (2d Cir. 1976) 544 F.2d 633, 636; but see Fed. Rules Crim. Proc., rule 11(h), 18 U.S.C. [codifying the harmless-error test as of Aug. 1, 1983].) However, because the strict standard is not constitutionally mandated, courts in the Second Circuit do not apply it when reviewing guilty pleas entered in state court. (See, e.g., Guerrero v. Harris (S.D.N.Y. 1978) 461 F.Supp. 583, 587; Perry v. Vincent (E.D.N.Y. 1976) 420 F.Supp. 1351, 1357- 1358.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Indeed, the People subsequently proved the prior conviction at the penalty phase through certified records and the testimony of foundational witnesses. (See p. 1182, post.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Defendant does not challenge this ruling on appeal, except to ask that we reconsider People v. Ainsworth (1988) 45 Cal. 3d 984, 1028-1029 [248 Cal. Rptr. 568, 755 P.2d 1017], and People v. Melton (1988) 44 Cal. 3d 713, 748-750 [244 Cal. Rptr. 867, 750 P.2d 741], which support the trial court's ruling. We decline to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Defendant challenges this ruling as an abuse of discretion, arguing that the court had power to limit cross-examination under Evidence Code section 352. However, it is axiomatic that an expert witness \"may be fully cross-examined as to ... (2) the subject to which his expert testimony relates, and (3) the matter upon which his opinion is based and the reasons for his opinion.\" (Evid. Code, § 721, subd. (a).) Assuming for the sake of argument that the court had the power defendant suggests, there was no abuse of discretion because the court considered defendant's argument on the record and expressly rejected it due to the probative value of cross-examination regarding the basis of expert opinion testimony. Defendant also argues that the trial court's ruling was error of constitutional dimension because it led to the exclusion of mitigating evidence, i.e., the expert's testimony. However, the court did not exclude mitigating evidence. The court properly declined to shield defendant's expert from cross-examination, and counsel chose for tactical reasons not to call the expert.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. That counsel chose not to object more frequently during the prosecutor's argument does not demonstrate, as defendant suggests, that counsel abandoned his role. Moreover, the claims that defendant faults his counsel for not raising lack merit in any event. (See p. 1187, fn. 24, post.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The trial court correctly did not give an antisympathy instruction at the penalty phase. We have never held, as defendant suggests, that the trial court at the penalty phase must expressly countermand an antisympathy instruction given at the guilt phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Here, as in the other instances of asserted prosecutorial misconduct, defendant faults his counsel for failing to object to a form of argument that courts had not yet disapproved at the time of trial. Under circumstances like these it is unfair to characterize a failure to object as ineffective assistance of counsel. (Jones, supra, 53 Cal. 3d at p. 1151.) For that reason, we have considered such claims on their merits despite counsel's failure to object. ()\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. For the same reason, the prosecutor's argument did not violate McClesky v. Kemp (1987) 481 U.S. 279 [95 L.Ed.2d 262, 107 S.Ct. 1756], in which the high court warned that \"[i]t would be improper and often prejudicial to allow jurors to speculate as to aggravating circumstances wholly without support in the evidence.\" (Id., at p. 314, fn. 37 [95 L.Ed.2d at p. 293].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant argues that the trial court should have deleted the inapplicable sentencing factors from the jury instructions, but we have previously rejected that argument. (People v. Ghent (1987) 43 Cal. 3d 739, 776-777 [239 Cal. Rptr. 82, 739 P.2d 1250].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Defendant concedes that an objection to the prosecutor's argument in this pre- Booth trial \"would have been futile\" because the argument \"could reasonably have been perceived as acceptable under this court's decision in Haskett. \" (See Haskett, supra, 30 Cal. 3d at pp. 863-864.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Even under Gathers, supra, 490 U.S. 805, we have found to be harmless \"obvious comments to the effect that [the defendant's] crimes caused suffering\" for the victim's family. (Mason, supra, 52 Cal. 3d at p. 964 [the prosecutor asked the jurors to \" 'put [themselves] behind the eyes and in the mind and in the memories of the relatives and friends' and said that the relatives would 'weep' for the victims\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Compare People v. Sanders (1990) 51 Cal. 3d 471, 531-533 [273 Cal. Rptr. 537, 797 P.2d 561] (dis. opn. of Mosk, J.) (finding a verdict of death constitutionally unreliable when available mitigating evidence was not introduced); People v. Lang (1989) 49 Cal. 3d 991, 1059-1062 [264 Cal. Rptr. 386, 782 P.2d 627] (conc. \u0026 dis. opn. of Mosk, J.) (same); and People v. Williams (1988) 44 Cal. 3d 1127, 1158-1061 [245 Cal. Rptr. 635, 751 P.2d 901] (conc. \u0026 dis. opn. of Mosk, J.) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See generally People v. Ray (1990) 220 Cal. App. 3d 943, 945-950 [269 Cal. Rptr. 682], which holds automatically reversible the erroneous omission of one or more express admonitions and/or waivers as to one or more of the three basic trial rights when an admission is accepted. Ray discusses decisions including the following: People v. Guzman (1988) 45 Cal. 3d 915, 968 [248 Cal. Rptr. 467, 755 P.2d 917], which holds that such an error on an admission is subject to harmless-error analysis under what is evidently the \"reasonable probability\" standard of People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243]; People v. Wright (1987) 43 Cal. 3d 487, 493-495 [233 Cal. Rptr. 69, 729 P.2d 260], which holds that such an error on a submission that is not tantamount to a guilty plea is subject to harmless-error analysis under the Watson \"reasonable probability\" standard; In re Ibarra (1983) 34 Cal. 3d 277, 283, footnote 1 [193 Cal. Rptr. 538, 666 P.2d 980], which states in dictum that such an error on a guilty plea is automatically reversible; In re Ronald E. (1977) 19 Cal. 3d 315, 320-321 [137 Cal. Rptr. 781, 562 P.2d 684], which makes the same statement in dictum; People v. Johnson (1989) 212 Cal. App. 3d 1179, 1182 [261 Cal. Rptr. 159], which holds that such an error on a guilty plea or an admission is automatically reversible; People v. Shippey (1985) 168 Cal. App. 3d 879, 889 [214 Cal. Rptr. 553], which holds that such an error on an admission is subject to harmless-error analysis under the Watson \"reasonable probability\" standard; and People v. Prado (1982) 130 Cal. App. 3d 669, 675 [182 Cal. Rptr. 129], which makes the same holding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See footnote 2, ante.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. I recognize that Boykin can indeed be construed to require automatic reversal regardless of the circumstances. (E.g., Boykin v. Alabama, supra, 395 U.S. at pp. 244-249 [23 L.Ed.2d at pp. 280-283] (dis. opn. of Harlan, J.); see also fn. 2, ante.) But I do not so read the decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The majority are apparently in accord. True, their opinion contains language that may perhaps be read to suggest that the relevant choice can be deemed knowing and voluntary even if what is chosen thereby is not itself understood and intended. Such a rule, however, would be unsound. One cannot knowingly and voluntarily choose to face or forgo trial if he does not understand what trial means; and he cannot understand what trial means if he is not aware of the three basic trial rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The majority opinion contains language that may perhaps be read to suggest that if a defendant knows he has the right not to plead guilty or not to make an admission but rather to proceed to trial, he must necessarily know he has the right not to incriminate himself at any trial that might ensue. Such an inference, however, would be supported by neither fact nor logic.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. I note in passing that the prosecutor's conduct at several points in the course of trial is troubling. For example, his peremptory challenges against all the Black prospective jurors raises a suspicion of invidious racial discrimination--against defendant as well as the prospective jurors themselves. Proof, it seems, is lacking: defendant's motion under People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748], was inadequate. Also, the prosecutor's summation at the penalty phase had an apparent racist subtext. But because I have found prejudicial Deere error, I need not, and do not, determine whether the argument amounted to reversible misconduct. 1a After exercising his first five peremptory challenges, the prosecutor \"passed\" his next four challenges, expressing satisfaction with the jury as chosen. He later exercised six additional peremptory challenges. Defendant used all of the 26 challenges allotted him. 2a The dialogue between the prosecutor and Betty T. was as follows: \"Q [Prosecutor]: As I understand your answers to the Judge and the defense attorney, you could vote for the death penalty if the circumstances warranted it? \"A Right. I think I could. It is possible that it would be the right decision to make, but it is also possible that it would not be the right decision to make. \"Q All right. So you have the ability to weigh those two alternatives and balance them and take into account all the factors that His Honor will give to you, that you can take into account them and choose the appropriate penalty? \"A (Juror nods head affirmatively.) \"[Prosecutor]: I'll pass for cause.\" The dialogue between the prosecutor and Katie B. was as follows: \"Q [Prosecutor]: You understand what his Honor was talking about when he told you about the two different parts of the trial or the three different parts? To determine guilt or innocence first, and then later on the possible penalty? \"A Yes. \"Q You understand that? Okay. Now, do you understand that you determine guilt and innocence first before you ever get to the penalty part? And that you are not supposed to take into consideration what penalty may be faced by the defendant when you are determining guilt. Do you understand that? \"A Yes, I think I do. \"Q You think you can go along with that and not let the fact that the defendant might face the death penalty enter into your deliberations on guilt or innocence? \"A I don't think that would bother me. \"[Prosecutor]: Okay. No problem on that. Thank you. I pass for cause.\" 3a The record reflects that one juror had a Spanish surname. 4a As we explained in Bittaker : \"Juror Martin expressed considerable doubt whether she could vote for a verdict of first degree murder in a case in which the body had never been found [police were unable to locate the bodies of two of the defendant's victims]. Juror Weaver initially said that she would automatically return a verdict of life imprisonment; she later equivocated, and the Judge denied the prosecutor's challenge for cause. Juror Walker opined that in a death penalty case, the standard of proof should not be that of reasonable doubt, but absolute proof. Juror Mims was uncertain whether he could return a death verdict and told the Judge, 'If you ask me if I could kill somebody, I don't know. So I can't just sit here and tell you.' \" (People v. Bittaker, supra, 48 Cal. 3d at p. 1092.) 5a This is not to say that a background in nursing would be an unacceptable ground for exercising a peremptory challenge, but only that it is not an obvious or apparent reason for doing so in this case, and thus it is not useful in determining the existence of a prima facie case. Had the trial court found a prima facie case of group bias, the prosecutor could have rebutted the prima facie case by means of a credible explanation that he had challenged Betty T. because of her professional training rather than her race. 6a The prosecutor in Turner later also exercised a peremptory challenge against a third African-American juror who was called after the defendant had made his Wheeler motion. We noted that this event served to \"confirm\" the existence of a prima facie case. (People v. Turner, supra, 42 Cal. 3d at pp. 719-720.) 7a Compare People v. Motton, supra, 39 Cal. 3d at page 605 (court labeled affidavit filed by defense as \"filed without permission,\" sought no opposition, and affirmatively indicated that it took \"no action\" on the affidavit).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The prosecutor's concern with prospective juror Katie B.'s \"passivity\" and lack of understanding of the nature of the process is reflected in the fact that he challenged several other jurors (Ruth D. and Pamela S.) whose answers seemed passive or who had difficulty understanding the nature of the process.\u003c/span\u003e\n\n",
    "body_length": 177353,
    "citedas": [
      "824 P.2d 1315",
      "1 Cal. 4th 1132",
      "5 Cal. Rptr. 2d 268"
    ],
    "attorneys": "Karen S. Sorenson, under appointment by the Supreme Court, and Michael Laurence for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Richard B. Iglehart and George Williamson, Chief Assistant Attorney General, Arnold O. Overoye and Robert R. Anderson, Assistant Attorneys General, Michael J. Weinberger, Thomas Y. Shigemoto and James T. McNally, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "78"
    ],
    "judges": "Opinion by Panelli, J., with Lucas, C. J., Arabian, Baxter and George, JJ., Concurring. Separate Concurring and Dissenting opinions by Mosk and Kennard, JJ.",
    "citation_count": 24
  }
}
