{
  "id": "X5ooRWYBTlTomsSBGJOh",
  "document": {
    "title": "CONSOLIDATED GAS CO. OF FLORIDA v. CITY GAS CO. OF",
    "full_title": "Consolidated Gas Company of Florida, Inc., Plaintiff, v. City Gas Company of Florida, Inc., Defendant",
    "jurisdiction": "S.D. Florida",
    "date": "1987-07-24T00:00:00.000Z",
    "docket": "83-1010-CIV",
    "body": "MARCUS, District Judge\n\nThe central issue presented by this case is whether a monopolist involved in the distribution and sale of natural gas, a business regulated by the Florida Public Service Commission, is completely immunized from the sweep of the federal antitrust laws. On the facts of this case, where we can find no clearly articulated state policy or codification conferring any such immunity, we hold that the conduct of Defendant City Gas of Florida, Inc. (\"City Gas\"), as to the creation of a territorial agreement not to compete in south Florida with its only real competitor in this state, violates the Sherman Act. We also hold that the Defendant's refusal to deal with the Plaintiff, Consolidated Gas Company of Florida, Inc. (\"Consolidated\"), a tiny potential competitor in south Dade County, as to the transportation or sale of natural gas violates the Sherman Act, inter alia, under the essential facilities doctrine. The particular regulatory scheme adopted in Florida does not extend so far as to clothe with absolute immunity the Defendant's demonstrably anticompetitive conduct.\n\nFor the reasons which we detail at great length below, it is hereby\n\nORDERED AND ADJUDGED as follows:\n\n1. Defendant City Gas has violated § 2 of the Sherman Act, 15 U.S.C. § 2.\n\n2. Plaintiff Consolidated shall recover $ 1,587,065.15 from Defendant City Gas as compensatory damages, to be trebled pursuant to 15 U.S.C. § 15, for a total recovery of $ 4,761,195.45 in antitrust damages from City Gas.\n\n3. Consolidated's request for injunctive relief, pursuant to 15 U.S.C. § 26, is granted. City Gas shall sell or transport natural gas to Consolidated at a reasonable price to be determined, upon Consolidated's request, by the Florida Public Service Commission.\n\n4. Consolidated's claims for costs and attorneys' fees shall be determined upon subsequent motion.\n\n5. Consolidated shall submit a proposed order of final judgment in this cause to this Court within ten (10) days of the date of this Order.\n\nI. THE CLAIMS\n\nPlaintiff has brought suit against Defendant alleging that Defendant violated § 2 of the Sherman Act by monopolizing and attempting to monopolize the natural gas market in south Florida. Plaintiff has sued under 15 U.S.C. §§ 2, 15 and 26 (the Sherman Anti-Trust Act (§ 2) and the Clayton Anti-Trust Act (§§ 15, 26)), seeking injunctive relief, damages and treble damages, costs and attorneys' fees.\n\nPlaintiff has charged Defendant with possessing and illegally exercising monopoly power, and with having wrongfully deprived Plaintiff of access to natural gas while Defendant allegedly took away all of Plaintiff's commercial customers and some of its residential customers, thereby destroying Plaintiff's ability to compete. Plaintiff specifically alleges, among other things, that Defendant acquired and maintained monopoly power from an unlawful territorial agreement not to compete with Peoples Gas System, Inc. (\"Peoples\"), the only other major natural gas distributor in south Dade; from a grant to Defendant by the Federal Energy Regulatory Commission (\"FERC\") of the right to purchase natural gas in sufficient bulk to serve many more customers than it serves; and from the fact that Defendant allegedly occupied a \"bottleneck\" position and was in exclusive possession of essential facilities regarding the transportation and sale of natural gas in portions of Dade County.\n\nThe Defendant has filed an Amended Counterclaim alleging in three counts that Plaintiff violated § 1 of the Sherman Act (15 U.S.C. § 1) by engaging in contracts, combinations and conspiracies having as their purpose and effect the restraint of trade with respect to the purchase and resale of gas products; that Plaintiff violated § 2 of the Sherman Act (15 U.S.C. § 2) in that it unlawfully possessed and exercised monopoly power in the Bel Air/Point Royale subdivision, thereby substantially prohibiting or foreclosing Defendant from selling its product therein; and finally that Plaintiff violated § 3 of the Clayton Act (15 U.S.C. § 14) by virtue of an illegal exclusivity agreement between Plaintiff and the subdivision developers and a restrictive covenant running with the land, providing that no liquified or natural gas would be sold within the subdivision unless sold and supplied by Plaintiff.\n\nAt the core of Defendant's prayer for relief is the assertion that Plaintiff violated the antitrust laws by these arrangements, improperly binding subdivision customers to purchase gas to be used for power, heating or cooking exclusively from Plaintiff. Defendant contends that as a direct and proximate result of these arrangements, it has been \"precluded,\" \"foreclosed,\" or \"delayed\" from selling natural gas in the subdivision. Like Plaintiff, Defendant seeks declaratory and injunctive relief, damages and treble damages, costs and attorneys' fees.\n\nThis protracted and complex cause came on for trial before the Court, and accordingly, we make the following Findings of Fact and Conclusions of Law.\n\nII. FINDINGS OF FACT\n\nA. The Parties\n\nConsolidated is a retail distributor of liquid petroleum gas (\"LP gas\") to approximately 2,000 residential and 10 commercial consumers located in the south Dade County subdivision known as the Bel Air/Point Royale Subdivision. Consolidated's gas is shipped by rail or truck to storage tanks owned by Consolidated, and then is transported from the storage tanks to the ultimate consumer by a series of underground pipes located in easements. Consolidated has been in the LP business since before its current President, Mr. Arnold Rosen, purchased the company in the early 1960's.\n\nDefendant City Gas began business in 1949 as an LP gas company. [Tr. 2-113]. It served district subdivisions throughout Florida and currently serves over 23 such communities. City Gas' principal competitor has been Peoples, which also operated numerous LP gas subdivisions throughout Florida. In 1960, natural gas, which can only be transported by pipeline, became available for resale in southern Florida and both City Gas and Peoples applied for and received allocations to purchase and resell natural gas in Florida from the Federal Energy Regulatory Commission or its predecessor agency. City Gas soon became a major distributor of natural gas in Florida. Currently it purchases natural gas from Florida Gas Transmission (\"FGT\"), the sole wholesale pipeline supplier of natural gas for resale in Florida. City Gas serves approximately 100,000 residential, commercial and industrial customers. City Gas' pipes and area of service totally surround Consolidated's system. Despite its dominance in the natural gas field, City Gas continued to operate LP subdivision systems until May 1984 through its wholly owned subsidiary, Dade Gas Co. [Tr. 3-104].\n\nB. Regulation of LP and Natural Gas in Florida\n\nThe LP gas business is unregulated; no governmental franchise or approval is required to purchase and resell LP gas. Moreover, LP gas is not subject to rate regulation by the Florida Public Service Commission (\"FPSC\"), although its resale rates were subject to a federal price ceiling from 1973 until 1981. [Exec. Order No. 12,287, 3 C.F.R. 124 (1982)]. In contrast, natural gas distributors are regulated public utilities. Each natural gas distributor must obtain an \"allocation\" from the FERC in order to purchase natural gas from a pipeline company such as FGT. [Tr. 4-8]. Additionally, the regulatory process controls the resale prices of natural gas in three ways. First, FERC regulates natural gas \"wellhead\" prices, which are the prices paid by pipeline companies such as FGT to natural gas producers. Second, FERC regulates FGT's wholesale price of natural gas to natural gas distribution companies such as City Gas. Finally, the FPSC regulates natural gas distribution companies' retail rates to residential and commercial consumers.\n\nThe FPSC's regulation of natural gas distributors, however, is not all-inclusive. For although rates are determined through a complex and heavily monitored process known as a \"rate case,\" other critical aspects of a natural gas distributor's business conduct are addressed either on a hit-or-miss basis or are simply not regulated at all by the FPSC. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" Particularly relevant to this case is the FPSC's regulation of territorial agreements between natural gas distributors. These important agreements are not required to be approved by the FPSC; they are in fact only considered when a utility requests FPSC approval, and they are only subsequently reviewed if a complaint is filed with the FPSC.\n\nC. Gas Availability and Price Structure\n\nDuring the 1960's and up to the onset of the Arab Oil Embargo in 1973, the price of LP gas was slightly higher than the price of natural gas, but the prices of both were extremely low. Indeed, the two to three-cent-per-therm price differential that existed during this time period created little incentive for distribution companies or consumers to undertake the risk and expense of converting from LP gas to natural gas. [Tr. 6-54]. In 1973, however, the Arab Oil Embargo caused unprecedented increases in world oil prices. Despite some federal price controls, LP gas prices rose much more rapidly than natural gas prices which were subject to regulation at the wellhead, at wholesale, and at retail. The resulting price differential, which approached twenty cents per therm at the wholesale level, suddenly made conversion to natural gas much more economically desirable. However, during the remainder of the 1970's until 1981, there was a national shortage of natural gas. As a result, the federal government established a rationing program which in turn curtailed pipeline distribution. [Tr. 6-54-55]. During this era of unprecedented instability, natural gas prices were kept artificially low by the three-tiered regulatory scheme. These low prices were such potent disincentives to production that they, in turn, were responsible for the natural gas \"shortage\" that contributed to the federal government's conservation policy and rationing program.\n\nIn addition to the Arab Oil Embargo, in 1979 the supply of crude oil, from which LP gas is refined, was reduced because of the cessation of oil imports from Iran, and in January 1981, federal price controls were lifted to increase supply. Thus, in 1981 LP gas cost twice as much as natural gas. As a result, LP gas became the 1980's dinosaur of retail fuel products. Like whale oil, it had become obsolete. It could no longer compete with natural gas.\n\nIt was not until the first quarter of 1981 that a small surplus of natural gas appeared. This surplus grew rapidly from approximately 3% to 4% in 1981, to 12.3% by the end of 1982. [Tr. 6-289]. By October of 1983, the surplus had reached 30.2 %. [ Id.]. This surplus is expected to last beyond the year 2000.\n\nAs a result of the dramatic increase in the cost of LP gas, LP distributors began to consider the wisdom of converting their systems to natural gas. Whereas natural gas must be transported by pipeline, LP gas is transported in containers and is then distributed to consumers through an underground pipe system. [Tr. 6-52]. Because the same underground system used for LP gas distribution is suitable for natural gas distribution, an LP system located near a natural gas pipeline may be converted to natural gas on an economically feasible basis. Conversely, many LP systems are located at too great a distance from a natural gas pipeline to justify the capital expenditure necessary to extend a pipeline to a natural gas source. [Tr. 6-52].\n\nConsolidated began its efforts to switch from LP gas to natural gas on March 9, 1982. On this date its controller, Richard Fleisher, wrote a letter to FGT requesting that FGT begin providing it with natural gas, and that FGT construct the necessary pipeline facilities. [Tr. 1-11; Plaintiff's Ex. A-0004]. On April 2 1982, FGT responded that in order to buy gas from FGT, Consolidated first had to obtain a FERC natural gas allocation. [Tr. 4-12-13; 1-12]. Additionally, FGT advised Consolidated that it would be required to reimburse FGT for the cost of connecting Consolidated's system to the FGT pipeline. This cost was then estimated to be approximately $ 250,000. [Tr. 4-13]. FGT suggested that, as a more economical alternative, Consolidated might arrange for a connection with City Gas' system, which was located much closer to Consolidated's system than the FGT pipeline. [Tr. 4-13]. In any event, for sound economic reasons Consolidated determined that it wanted to have a natural gas allocation and consequently applied for one from the FERC on May 21, 1982. Consolidated's application was the first application of its type to the FERC for a new natural gas allocation in 12 years. [Tr. 6-287].\n\nD. City Gas' Market Power\n\nIn order to determine City Gas' market power, we must first define the relevant market. It is clear based on an analysis of functional interchangeability and cross-elasticity between natural gas and LP gas that the relevant product market in this case is composed solely of natural gas. For although natural gas and LP gas are functionally interchangeable as to use, there is no cross-elasticity between them. Where natural gas is available, LP gas simply cannot compete because of its overwhelming price disadvantage. Like whale oil after the advent of kerosene, LP gas is obsolete in any geographic area where natural gas is available. However, even if the relevant product market consists of both natural gas and LP gas, as City Gas asserts -- a proposition which we cannot accept, because of the enormous price differential between the two products and the lack of any evidence which suggests that this situation will change in the foreseeable future -- we find that our result would remain unchanged. City Gas' market share even in the combined natural gas/LP gas market is so great that it has market power even in this market.\n\nWe also find that the relevant geographic market in this case consists of City Gas' territory, Consolidated's service area, and the as yet unserved portions of southwest Dade County. The only alternative choice for a relevant geographic market, presented to us by Defendant, is that of Consolidated's service area. In an economic sense, however, this geographic area is meaningless. Consolidated's service area has nothing to do with either the area in which the sellers compete or the area in which prospective purchasers will turn for sellers. Rather, it is clear that City Gas serves customers well beyond Consolidated's service area, which its pipes surround, and that Consolidated would like to compete beyond its service area as well. Additionally, it has been established that customers in Consolidated's service area look beyond these boundaries for sellers of gas. Indeed, many of these customers have already done so by turning to City Gas for service. Thus, we reject City Gas' theory of the relevant geographic market.\n\nWith the relevant market established, we now turn to the measurement of Defendant's market power. First of all, we observe that City Gas' market share is overwhelming. The market shares of natural gas companies in the relevant market in 1981 were as follows: City Gas sold 123,734,000 therms of natural gas in 1981; Miller Gas sold 2,836,000 therms; Plaintiff did not sell any natural gas. This computes to a 97% market share for City Gas and a 2.4% share for Miller Gas. [Tr. 7-3]. Moreover, City Gas had 100% of the market for \"hookups\" of new natural gas customers during 1981. [Tr. 7-4]. In the second place, the record evidence has established that entry barriers in the natural gas business are high because the potential entrant must build or acquire a costly pipeline distribution network and a way to obtain natural gas, whether from the FERC or another distributor. Indeed Consolidated experienced enormous difficulty in attempting to enter the market, even though it had already made a substantial distribution network. Third, we note that exit barriers in the industry are also high because a company withdrawing from the natural gas business could not easily withdraw its money from its pipelines by converting them to some other business line. [Tr. 7-6]. A fair review of the evidence adduced at trial therefore establishes Defendant's overwhelming market share.\n\nIn deciding to convert from LP gas to natural gas in 1982, Consolidated suddenly found itself in potential competition with City Gas, which had grown to be a giant in the south Florida area. Because only three companies in Florida had natural gas allocations, and because natural gas became substantially less expensive than LP gas, City Gas had expanded quickly.\n\nCity Gas' power was further strengthened by a territorial agreement which it entered into in September 1960 with its only major competitor, Peoples. [Plaintiff's Ex. C-0018]. This agreement delineated separate natural gas service areas for each of the natural gas companies and eliminated any competition between them. [ Id.]. Under the terms of the agreement, City Gas and Peoples essentially divided up south Florida into the areas Peoples would serve and the areas City Gas would serve; each promised not to compete in the other's territory. City Gas and Peoples requested the Florida Public Utilities Commission (now the \"FPSC\") to approve their territorial agreement, and it was subsequently approved by the Commission, which observed that such agreements were in the public interest and should be encouraged. The territorial agreement remains in effect, and City Gas and Peoples, the two largest natural gas companies in Florida, do not compete with each other. [Tr. 3-93]. While City Gas and Peoples do not compete with each other, they are not precluded from competing with other smaller natural gas companies within the service areas which each reserved to itself under their agreement. Consolidated's small LP system is located deep within City Gas' territory. Consequently, Consolidated was forced to compete with City Gas in order to retain its customers or else see them go to City Gas for more economical gas service.\n\nThe region of southwest Dade County in which Consolidated is located is projected to be one of the fastest growing portions of Dade County through the year 2005. [Tr. 5-234-237]. The areas adjacent to Consolidated's system are expected to experience growth of approximately 144.3 %, which amounts to some 88,185 people over the next twenty years. [Tr. 5-234-237]. This growth should take place in the areas to the west, north and south of Consolidated's present area of service. [Tr. 5-237]. Between 1984 and 2005, this growth in population should generate a 130.1 % increase in the number of housing units in these areas, which means that approximately 34,225 housing units will be constructed during these years. [Tr. 5-237-239]. Related commercial building is expected to increase along with the population. [Tr. 5-238]. New light commercial and service enterprises such as restaurants, stores, cleaners and other businesses likely to use gas can be expected to accompany the expansion. [ Id.]. Accordingly, Consolidated should be able to expand its system in response to this growth if it can procure a competitively priced source of natural gas.\n\nIndeed, since 1982 a dozen new businesses have been constructed in Consolidated's territory, but Consolidated has been unable to serve them because it does not have natural gas. [Tr. 1-25]. Moreover, during 1984, City Gas began providing service to seven commercial accounts in a shopping center adjacent to Consolidated's service area. [Tr. 6-73]. Thus, it became crucial that Consolidated convert to natural gas for as low a cost as possible in order to be able to offer rates that were competitive with those City Gas could offer. In order to compete effectively, Consolidated believed it was imperative that FGT provide Consolidated with a first connection to the natural gas pipeline at FGT's cost. The amortization of the estimated $ 250,000 capital cost of this lateral pipeline would have increased Consolidated's cost of securing natural gas by approximately five cents per therm. [Tr. 6-91-92]. City Gas had already received approximately ten such connections with FGT at no cost and thus it did not have similar expenses driving up its natural gas rates. [Tr. 5-187-188].\n\nFaced with these problems, Consolidated was left with three potential courses of action if it was going to remain in business: (1) obtain a FERC allocation and hope that it could convince FGT to pay for the lateral pipeline connection; (2) connect a pipeline to City Gas' pipe and purchase gas directly from City Gas; or, finally (3) obtain a FERC allocation, connect a pipeline to City Gas' pipe, and pay City Gas the cost of transporting gas through City Gas' pipes. Two of these courses of action required Consolidated to deal directly with its future competitor, and the third alternative, as the facts reveal, involved unreasonable delays and uneconomically high expenses. In response to Consolidated's dilemma, City Gas, the only natural gas distributor with pipelines near Consolidated's service area, responded by attempting to eliminate its tiny competitor, as it had already succeeded in doing to two other small LP distributors, Nationwide Utilities (\"Nationwide\") and Miramar Gas Company (\"Miramar\").\n\nThe pattern established by City Gas' acquisition of Nationwide and Miramar is, we believe, particularly instructive in this case. At the time that it acquired Nationwide, in 1980, City Gas' pipelines surrounded the area served by this small LP distributor, located in south Broward County. City Gas had the only supply of natural gas to offer for sale in the area and Nationwide did not have a natural gas supply of its own. Consequently City Gas installed a line and began to provide natural gas to a number of residential customers served by Nationwide. [Tr. 3-122]. Nationwide could not compete with City Gas once it began soliciting and hooking up its customers, simply because LP gas could not compete with the price advantage of natural gas. [Tr. 3-123-124]. On July 31, 1980, City Gas bought Nationwide for $ 300 per active customer. [Plaintiff's Ex. C-0047].\n\nIn early 1982, City Gas acquired Miramar, another small LP distributor in south Broward County. Here again, City Gas' pipeline surrounded the area served by Miramar, and City Gas had the only supply of natural gas to offer for sale in the area. City Gas began converting some of Miramar's customers to natural gas [Tr. 2-202-203], and was then able to purchase Miramar for $ 385 per active customer. [Tr. 3-117-120].\n\nWhen Nationwide and Miramar sold their businesses to City Gas, there was no other distributor from whom they could have purchased natural gas or to whom they could have sold their systems. [Tr. 3-124-125]. In view of City Gas' FERC allocation, its market share in the geographic area and the absence of any other natural gas supply, Nationwide and Miramar had no other realistic choice but to sell to City Gas. In 1982 Consolidated faced a similar dilemma. We think City Gas' policy of acquiring tiny competitors was part of its underlying purpose to eliminate all competition within its region.\n\nE. City Gas' Efforts to Acquire Consolidated\n\nOn February 22, 1982, City Gas' Board of Directors ratified and approved City Gas' contract to purchase Miramar. At the same meeting the Chairman of the Board, Sid Langer, advised the Board that he had been \"attempting to acquire the gas properties of Consolidated,\" and the Board passed a resolution authorizing Mr. Langer and its other officers to \"work out the acquisition of the assets of Consolidated Gas Company and take whatever steps with respect thereto, as they deem appropriate.\" [Tr. 5-223; Plaintiff's Ex. G-0089]. However, no one from City Gas had ever contacted anyone at Consolidated prior to February 22, 1982 about buying the company, and no contact of any kind was made with Consolidated until late March of 1982 when City Gas' president, Jack Langer, telephoned Consolidated's controller, Richard Fleisher, to advise him that City Gas had already begun to serve some of Consolidated's customers and intended to serve others. Subsequently, in May of 1982, Sid Langer and Jack Langer of City Gas met with Arnold Rosen of Consolidated to discuss the idea that City Gas purchase Consolidated. [Tr. 2-171-172; 3-8]. At the meeting, Sid Langer offered to buy Consolidated for the same price per customer that City Gas had paid for Nationwide, which Mr. Rosen understood to be $ 300 per customer. [Tr. 3-9]. Mr. Rosen stated that he wanted $ 900 per account. [Tr. 2-173]. No agreement was reached and Mr. Rosen left. [Tr. 3-10].\n\nOn February 23, 1982, one day after the Board resolution authorized Sid Langer to attempt to acquire Consolidated and notably before City Gas had notified Consolidated of its interest in pursuing an acquisition, City Gas' sales manager, Ken Kessler, sent his sales staff out to make door-to-door solicitations of Consolidated's customers. Some of these customers had signed a 1981 petition which they sent to City Gas and which requested that natural gas service be offered to them, but most of them had not. At least 60 of Consolidated's approximately 2,000 customers were solicited [Tr. 5-201], and nine signed up to receive natural gas from City Gas. City Gas then sent letters to residents offering City Gas' natural gas service, and followed up with door-to-door solicitations. Furthermore, City Gas' representatives left door knob hang-tag advertisements at the homes of Consolidated's customers if no one was home. [Tr. 2-11-13]. City Gas also ran newspaper ads directed specifically to people living near the Point Royale Shopping Center (within Consolidated's service area) who were receiving LP gas, inviting them to call for a free survey as to the feasibility of receiving natural gas. [Tr. 2-17]. It would be fair to characterize City Gas' sales efforts in Consolidated's service area as \"full scale.\" On April 5, 1982, City Gas began extending its pipelines [Plaintiff's Ex. E-0008] to serve eighteen of Consolidated's residential customers which it had solicited in February.\n\nCity Gas' solicitation behavior, after its Board decided to attempt to acquire Consolidated but before it notified Consolidated of its intentions, leads us to find that City Gas' solicitations and pipeline extensions were not simply ordinary business expansions, but rather, were basic components of City Gas' strategy to force Consolidated to sell out. This conclusion is further supported, we think, by the fact that City Gas had to duplicate a portion of Consolidated's pipeline in order to serve the eighteen Consolidated customers it had recently signed. Yet if City Gas had expected to reach a purchase agreement with Consolidated, it would have acquired Consolidated's pipelines and would not have had to incur this expense. City Gas' action of duplicating these pipelines before notifying Consolidated of its interest in acquiring the company seems to have been designed to force Consolidated to sell at a low price or face the resultant certainty of losing its customers and their value as quickly as City Gas could serve them.\n\nF. Consolidated's Easement Agreements\n\nIn expanding its system into the territory that was supplied by Consolidated, City Gas placed its own gas mains and lines in utility easements which had been granted to Consolidated by a recorded \"Easement Agreement\" dated December 13, 1963. As a public utility, under Florida law, City Gas possessed the power of eminent domain entitling it to condemn and to pay just compensation for any real or personal property rights necessary for its provision of natural gas service to any customer. City Gas did not consider selling natural gas to customers in Consolidated's territory until 1982. Prior to June 1, 1982, when a state lawsuit was filed by Consolidated against City Gas and served upon City Gas thereafter, City Gas had no knowledge of this recorded \"Easement Agreement\" or any of its provisions. City Gas also had not researched the public records to determine whether Consolidated had rights under any recorded documents. City Gas had observed other gas companies supplying gas in the subdivision, and believed that it was free to provide gas service to any home or business located in the subdivision. On or about June 1, 1982, Consolidated filed suit in Dade County Circuit Court against City Gas, seeking to enjoin City Gas from infringing upon the easements which had been granted to Consolidated by this recorded Easement Agreement. On June 16, 1982, the Circuit Court issued its order Granting Preliminary Injunction, ordering City Gas to cease and desist from extending any additional gas lines into the subdivision until further order of the court and requiring Consolidated to post a $ 5,000 injunction bond. While the injunction was in effect, City Gas continued supplying natural gas to the former Consolidated customers which it had already hooked up to its system. The preliminary injunction was dissolved by the Circuit Court in its Final Judgment dated November 30, 1982. Immediately after the Circuit Court dissolved the preliminary injunction, City Gas again began extending its system to provide natural gas service to homes and businesses located within the subdivision.\n\nOn March 6, 1984, the Third District Court of Appeal affirmed the Circuit Court's Final Judgment on the grounds that (1) the portion of the Easement Agreement which gave Consolidated \"an exclusive franchise\" did not create an exclusive property right enforceable by Consolidated against City Gas, and (2) that the Easement Agreement by its terms gave Consolidated a \"perpetual right of way easement\" but did not create an exclusive right of way easement. The Court held that City Gas, a public utility, was not precluded by the Easement Agreement from using the servient land in any manner not inconsistent with the limited non-exclusive rights vested in Consolidated as the easement owner.\n\nCity Gas asserted as an affirmative defense in the state court litigation that the recorded \"Easement Agreement\" was invalid as a restraint of trade, but at no time did City Gas file or attempt to file a counterclaim alleging the illegality, under the Florida Antitrust Act of 1980 or other provisions of state or federal law, of any exclusive rights claimed by Consolidated in the easements in the subdivision. On March 4, 1985, Consolidated and City Gas entered into a settlement in the form of a stipulation pursuant to which the state litigation was ended with a Stipulated Order Directing Disposition of Injunction Bond, which was entered in circuit court on March 6, 1985. The settlement stipulation, was signed by both Philip Schiff, the attorney for City Gas, and Sid Langer, President and Chairman of the Board of City Gas. It and the Stipulated Order were drafted by Phillip Schiff.\n\nG. Consolidated's FERC Application\n\nOn May 21, 1982, Consolidated applied to the FERC for a natural gas allocation so that it could resell natural gas to its customers. [Tr. 1-13; Plaintiff's Ex. B-0011 (1 of 122)]. Consolidated's application was filed under Section 7(a) of the Natural Gas Act, which requires an applicant to demonstrate that it has the technical and financial ability to distribute gas to customers; that the pipeline from which it seeks service (in this case FGT) has an adequate supply of gas; and that the customers who would be provided with gas service would derive some benefit from it. [Tr. 4-9].\n\nOn June 21, 1982, City Gas filed a petition with the FERC requesting leave to intervene in Consolidated's application to oppose its request for natural gas. [Tr. 1-14; Plaintiff's Ex. B-0012, B-0011 (9 of 122)]. City Gas' Petition to Intervene asserted that City Gas had existing transmission and distribution lines extending through the heart of the proposed service territory, as well as around it, and that City Gas anticipated that it would soon convert a majority of Consolidated's customers to natural gas. [Tr. 1-14-15; Plaintiff's Ex. B-0011 (9 of 122)]. City Gas also raised questions about the capacity of Consolidated's system to operate at the pressures necessary to deliver natural gas. City Gas further argued that Consolidated should have to pay the $ 250,000 cost of the FGT lateral connection. [Plaintiff's Ex. A-0001 at 14]. Finally, City Gas challenged Consolidated's application on the basis of the adequacy of the natural gas supply.\n\nOn November 21, 1983, the presiding administrative law judge (\"ALJ\") granted Consolidated's application and rejected City Gas' arguments. [Plaintiff's Ex. B-0011 (52 of 122)]. The FERC affirmed that decision on September 19, 1984, but it ruled that Consolidated should pay the cost of connection with FGT's pipeline. [Plaintiff's Ex. B-0011 (115 of 122); Tr. 3-21]. The FERC opinion stated:\n\nThere is no doubt that Consolidated's proposed project would be economically feasible, if City did not have its eye on capturing Consolidated's propane gas customers. . . .\n\nWe admit that it is difficult to predict whether Consolidated's project will be a success. But we need not make a \"conclusive, definitive, formal finding\" of economic feasibility. It is enough that there is a possibility of economic success. We think there is enough of a reasonable likelihood that Consolidated will retain its present customers and, therefore, be successful as a natural gas distributor for us to grant its request. The fact that its market is threatened by competition from City does not lead us to deny that request, for we do not think it in the public interest to deny Consolidated the right to compete.\n\n[Plaintiff's Ex. B-0011 (115 of 122) at 3-4 (footnotes omitted)].\n\nThe FERC also observed:\n\nAnd at bottom that is what we are concerned with -- the public interest. If we deny Consolidated's request, City will win the war by default.\n\n[ Id. at n.12].\n\nThe opinion further held:\n\nThe record shows that standing alone both Consolidated and City could successfully serve Consolidated's customers. We do not believe it is appropriate for us to determine which is the rightful distributor. That should be done by Consolidated's customers. We should not deprive them of the right to choose between two competitors for their natural gas service. Accordingly, we grant Consolidated's application as modified below.\n\n[ Id. at 4-5 (footnote omitted)].\n\nThere is no doubt that City Gas' intervention profoundly altered the course and nature of the FERC's consideration of Consolidated's application. If full litigation of factual disputes had not been necessary, it would have taken only six to nine months for the FERC to have reached a final decision. [Tr. 4-18]. City Gas' intervention caused a delay in the proceeding of more than one year. [Tr. 4-78]. Additionally, if City Gas had not intervened Consolidated could have received a temporary certificate entitling it to obtain natural gas within 90 days of the filing of its application. [Tr. 4-20]. Because City Gas intervened, this option became unavailable.\n\nIt is also demonstrably clear that the delay in the FERC proceedings severely hurt Consolidated. During the course of the proceedings, City Gas began providing service to seven of Consolidated's eight commercial customers and the bulk of its residential customers. [Tr. 5-131-133]. Since Consolidated could not purchase natural gas from FGT without final FERC approval, its first and third courses of action were effectively foreclosed. Consequently, Consolidated was left with only its second alternative if it was to remain in business: the purchase of natural gas directly from City Gas.\n\nH. City Gas' Proposed Terms for the Sale or Transportation of Natural Gas\n\nAs we have observed already, Consolidated had to purchase natural gas from City Gas because the next nearest natural gas distributor, Miller Gas, a small company when compared to City Gas and Peoples, was located approximately fifteen miles away. The cost of connecting a lateral to Miller's pipeline would have exceeded $ 5,000,000 [Tr. 3-19], more than the entire net worth of Consolidated. Thus, Consolidated had no alternative but to purchase gas from City Gas.\n\nDuring the course of the FERC proceedings, City Gas was asked by FERC personnel if it would consider selling natural gas to Consolidated. City Gas indicated that it would sell natural gas to Consolidated at City Gas' cost plus ten cents per therm, with Consolidated paying all costs of connection, metering and other costs. [Tr. 1-19-20; 3-13-14]. In making this offer, City Gas knew that the FPSC would not approve sales on these terms because the rate was too high. [Tr. 3-226-227]. Indeed, City Gas' Vice President, Mr. Ball, testified that he made no attempt to ascertain a reasonable price for direct gas sales to Consolidated, and that he came up with the cost plus ten cents terms \"out of the air.\" [Tr. 3-284]. At the time that City Gas made this offer, it had a contract to sell natural gas to Florida Gas for cost plus one cent per therm and it was buying gas from Peoples for resale under their non-competition agreement for one development in Peoples' territory at cost plus seven cents per therm. [Plaintiff's Ex. C-0051; Tr. 3-141-144, 5-182, 2-140].\n\nConsolidated also proposed that City Gas allow its system to be used to transport natural gas from FGT's pipeline to Consolidated if Consolidated received its own FERC allocation. City Gas rejected this suggestion.\n\nCity Gas did not modify its purchase or resale offers in any way until March 25, 1983, when the FERC staff scheduled a conference in Washington. [Tr. 3-227-228; Plaintiff's Ex. A-0076]. The FERC's purpose in calling this conference was to identify \"settlement postures\" and it directed the parties to \"send a representative authorized to enter into binding negotiations on that party's behalf.\" [Plaintiff's Ex. A-0075]. At the March 23, 1983 FERC settlement conference, Consolidated proposed that City Gas transport natural gas to Consolidated at cost plus two and one-half cents per therm, but City Gas responded that this offer was \"out of the question.\" [Tr. 3-67; Plaintiff's Ex. A-0076]. Later in the conference, City Gas for the first time lowered its resale offer from cost plus ten cents to cost plus seven cents per therm, with Consolidated paying all costs. [Tr. 3-16-17; 3-228]. Consolidated had received advice that City Gas' seven-cents-per-therm offer was far beyond competitive levels and that a price between 3 mills and one cent per therm was a reasonable range. [Tr. 3-69]. However, because the FERC staff was pushing for a settlement and City Gas' actions were threatening Consolidated's existence, Consolidated proposed that City Gas sell or transport at cost plus two and one-half cents and, later, at cost plus five cents, even though Consolidated believed these prices to be unreasonable. [Tr. 3-69-70; Tr. 5-41-42].\n\nAt the close of the conference, City Gas handed Consolidated a written \"Final Offer,\" in which City Gas (1) reiterated its offer of $ 385 per active customer to purchase Consolidated's system on terms of ten percent down and ten percent interest over a ten-year term; and (2) stated that it would sell or transport natural gas to Consolidated for resale at cost plus seven cents per therm, with Consolidated paying all costs of connections and metering equipment. [Plaintiff's Ex. A-0041]. On June 23, 1983, City Gas wrote to Consolidated attaching a \"Settlement Offer\" dated June 7, 1983. [Plaintiff's Ex. C-0060]. In that offer, City Gas restated its purchase offer of $ 385 per active customer, thereby excluding Consolidated's former customers. The June 7th offer also retracted City Gas' short-lived offer to transport gas from FGT to Consolidated for a seven-cent markup, referring only to the sale of natural gas to Consolidated at cost plus seven cents per therm. [ Id.]. The accompanying letter stated that the June 7th offer would be withdrawn on June 27, 1983, unless either offer were accepted. [ Id.]. Following the June 27th expiration of the June 7th offer, City Gas made no offer of any kind to sell or transport natural gas to Consolidated. [Tr. 3-235].\n\nThe expert testimony presented at trial by Consolidated convincingly established that neither price term was a reasonable or competitive price. First, City Gas' marginal cost in selling or transporting gas to Consolidated was at or near zero since, under both offers, Consolidated was to pay all costs of connection and metering. At most, City would incur the expense of opening and maintaining a new account on its books and reading the meter on a monthly basis. Second, City Gas had no opportunity costs, which are the costs of providing this service to Consolidated instead of some other customer. City Gas had and still possesses a vast, unused natural gas entitlement of approximately 27 million therms per year in excess of its needs [Tr. 5-166-167], and its sale or transportation of 600,000 therms or less of gas to Consolidated would cost City Gas no other sales. Third, the price City Gas demanded bears no reasonable relation to its costs of providing the service. FGT charges approximately thirty-two cents per therm which includes its cost of gas and the cost of transporting it from producing fields in Texas and Louisiana to south Florida. [Tr. 6-61]. City Gas demanded between 25 % and 33 % of that just to transport gas a few thousand feet. [Tr. 6-61-63]. Thus, in selling or transporting gas on the terms it quoted, City Gas would be earning far more per therm than the three to four cents net profit it earns on an average for all the therms it sells to all other customers. [Tr. 6-60].\n\nCity Gas argued that the cost-plus-seven-cents offer was reasonable because that is what it paid Peoples under the Limited Waiver agreement to serve one community in Peoples' territory. Notably, no witness even ventured any opinion that the ten-cent offer was reasonable. But even the seven-cent offer cannot be justified by the Peoples-City Gas non-competition agreement seven-cent rate because this agreement was not reached in a competitive setting. Under the agreement, Peoples and City Gas do not compete in the area being served. Consequently, City Gas has been able to pass the seven-cent price increase along to its customers without fear of losing them to Peoples. The situation facing Consolidated was entirely different. If it was required to pay seven cents more for gas than City Gas, it would obviously be at a severe price disadvantage in selling natural gas in head-to-head competition with City Gas.\n\nCity Gas also argued that the seven-cent markup must be reasonable because the FPSC approved those terms for Peoples' sales to City Gas. The evidence does not support that argument, because it was established that the FPSC does not pass on the reasonableness of the charge between two large industrial firms, such as City Gas and Peoples, based upon the obviously sound assumption that they can take care of themselves in the marketplace. [Tr. 6-64].\n\nThe expert and lay testimony indicated that because the costs to City Gas of providing the service are effectively zero, a fair and reasonable price for City Gas' sale or transportation of natural gas to Consolidated would probably be in the area of one cent per therm over other costs. [Tr. 7-15]. This Court will not attempt, nor do we feel required to determine exactly what a fair price would be. The task is best left to regulatory agencies, such as the FPSC, which would regulate Consolidated if it still seeks to sell natural gas to consumers, or to the marketplace. The FPSC is designed to make such complex and specialized rate determinations and to monitor continuously the rates of natural gas companies. The federal courts, on the other hand, are not well equipped to set a \"fair price,\" or to monitor the changing circumstances which might merit a review of such a determination. Accordingly, all that we find on this record, and we believe the facts as developed at trial compel this finding, is that the price terms for the sale or transportation of natural gas which City Gas proposed to Consolidated were wholly unreasonable. The terms bore no relationship whatsoever to any economic calculation which Defendant might have made. We believe, in short, that the price terms were the functional equivalent of a refusal to deal at all.\n\nCity Gas' true objectives were further revealed by its demands for excessive sale or transport prices and its willingness to forego short-term profits on reasonably priced natural gas sales to Consolidated. Since prior to 1980, City Gas has had an allocation entitling it to purchase and sell much more natural gas each year than it is able to resell to its customers. In 1981, City Gas' largest industrial customer, Lonestar Florida, Inc., reduced its annual purchases of natural gas from City Gas. This left City Gas with an excess supply of approximately 27 million therms of natural gas annually, in addition to the surplus it already had. [Tr. 5-166]. Consolidated's LP gas consumption equals approximately 491,000 therms of natural gas per year. [Tr. 5-167]. Had City Gas sold a portion of its excess gas to Consolidated when Consolidated was asking to buy the gas, it could have supplied all of Consolidated's needs with only 1.8 % of City Gas' excess gas supply. [ Id.]. In fact, transporting gas for sale to Consolidated's customers would have consumed none of City Gas' allocation at all.\n\nAdditionally, there were no engineering or other impediments to City Gas' selling or transporting gas to Consolidated. Consolidated's pipe system is well suited for natural gas delivery and, in fact, is virtually identical to City Gas' system. The cost of interconnecting the two systems would be approximately $ 21,752 and both systems would have functioned properly with such interconnection. [Tr. 2-309-310; Plaintiff's Ex. A-0071].\n\nWe have concluded that City Gas' offer was tantamount to a refusal to deal and we think City Gas' purpose in making it was to destroy a potential competitor, no matter how small and inconsequential it may have been. This conclusion is amply supported by the record in this case. The purpose behind City Gas' conduct was, we believe, candidly stated by its Chairman of the Board, Sid Langer. When Mr. Langer was asked whether the receipt by Consolidated of a natural gas allocation to serve its 2,000 customers would deplete the natural gas supply to the other natural gas distributors, his answer was surprisingly telling:\n\nA. Of course; plus, it would give every other propane dealer . . . a chance to request natural gas for their own development throughout the state or throughout the country. God only knows.\n\nQ. What is wrong with LP companies getting natural gas?\n\nA. Nothing wrong with it.\n\nQ. You said --\n\nA. Except you try to protect your own domain, and there is nothing wrong with that either.\n\nQ. Okay. Does it make any sense to argue that if Consolidated Gas received an allocation to serve those 2,000 customers, that it would reduce the supply of gas available?\n\nA. Maybe yes, maybe no. . . .\n\n[Tr. 3-161-162] (emphasis added).\n\nMr. Langer's testimony was echoed by City Gas' Vice-President, Ivan Ball, who indicated that City Gas' intervention in the FERC proceeding was \"almost automatic\" as it was Defendant's policy to oppose the allocation of natural gas to any other company in what it believed to be its \"natural gas territory.\" [Tr. 3-174]. Ball also testified that if Plaintiff's FERC application were granted \"it [would mean] that any propane company up and down the State could get an allocation.\" [Tr. 3-264; see also testimony of Jack Langer, Tr. 8-64]. The Defendant City Gas quite apparently believed that because it was involved in a regulated industry, it had untrammeled authority to eliminate any potential competitor within its area of operation.\n\nI. The Feasibility of City Gas' Expansion to Serve Consolidated's Customers\n\nStill further indication of City Gas' underlying purpose may be gleaned from its uneconomical expansion into Consolidated's service area without requiring its new customers to pay \"contributions in aid of construction\" which City Gas normally charges in such circumstances. The FPSC requires all public utilities to observe regulations pertaining to the allocation of costs of extension of utility facilities to serve new customers. The purpose of these regulations, commonly referred to as \"feasibility rules,\" is to protect present customers of the utility from having to subsidize the utility's speculative expansion into areas that are not economically and financially feasible. [Tr. 5-115]. Prior to April 29, 1983, the feasibility of City Gas' extension of its service to a new customer or group of customers was to be determined by a formula comparing the costs of the extension to twice the gross annual revenues earned from the customer. If the cost of the extension exceeded two times annual gross revenues, then a contribution in aid of construction was to be charged to the utility customer, alleviating the cost burden to the utility and also protecting the other customers from the costs of subsidizing that extension. [Tr. 5-116; Plaintiff's Ex. D-0001; Plaintiff's Ex. J-0004].\n\nIn applying the feasibility rule, the proper method for determining the estimated annual revenue from a new customer who has been receiving gas service from another company is to estimate consumption based on past consumption as reflected in prior bills. If the new customer has no history of gas consumption, then alternative estimates may be employed, such as tables that indicate consumption levels for various appliances. But the latter method may not be properly employed where the customer has a history of gas consumption. [Tr. 5-116, 147]. The cost of a given extension of facilities may be determined through estimates of the costs of constructing the facilities by the contractor or by the engineering department of a utility company. [Tr. 5-116-117].\n\nCity Gas performed no true feasibility study of any kind prior to the expansion of its system to the bulk of Consolidated's customers. City Gas' estimates of annual revenues from those customers were exaggerated and any feasibility study based on those estimates would have provided a distorted view of the feasibility of the expansion. Although all of Consolidated's former customers had gas appliances and a history of gas consumption, City Gas' salesmen made no effort to determine past consumption levels. Instead, the salesmen used the appliances' maximum gas consumption ratings from plates located on the appliances and then projected annual revenues by multiplying those revenues by City Gas' prevailing rates. [Tr. 2-42; 2-85-87]. As a result, City Gas' estimates of annual revenues were far in excess of its new customers' historical and actual consumption. In fact, City Gas' estimates of annual therms and revenues for new residential accounts taken from Consolidated were overstated by some 71.1 %, and City Gas' estimates of annual therms and revenues for its new commercial accounts were overstated by approximately 35.6 %. [Tr. 5-117-120]. In view of the information available to City Gas, the variance between these estimates and reality appears to be more than a matter of negligence or accident.\n\nA feasibility study based on the actual consumption levels of City Gas' new customers both before and after they were taken from Consolidated shows that City Gas' extensions of its facilities to all but ten customers did not meet the company's feasibility criteria. Although documentation indicates that City Gas contemplated charging a contribution in aid of construction, no such contributions were collected. [Tr. 5-122-126]. City Gas' counsel agreed at trial that City Gas had waived some $ 19,000 in contributions that should have been collected from Consolidated's customers under City Gas' feasibility rule. [Tr. 8-16, 26]. City Gas obtained the funds to expand into Consolidated's territory from the proceeds of its natural gas sales to other customers. [Tr. 3-208-209]. Thus, City Gas' other customers paid the costs of City Gas' expansion into Consolidated's service area because City Gas waived the necessary contributions.\n\nJ. The Stay of This Lawsuit\n\nThe present action was filed by Consolidated on April 22, 1983, seeking damages and an injunction to prohibit City Gas from engaging in any further efforts to block or delay Consolidated's access to natural gas. City Gas responded to the Complaint on May 16, 1983, by moving the Court to stay this lawsuit. Consolidated amended its Complaint on May 23, 1983, alleging that City Gas' motion to stay this suit was an additional act designed to delay Consolidated from obtaining judicial relief. On June 2, 1983, City Gas renewed its motion to stay in response to the Amended Complaint. This motion to stay remained pending and delayed the progress of this suit for almost one year, from May 16, 1983 until May 3, 1984, when United States District Judge Hastings, to whom this cause had been assigned originally, entered an order denying the motion.\n\nK. Consolidated's Damages\n\nThe expert and lay testimony and documentary evidence presented at trial shows that City Gas' actions diminished Consolidated's value as a going concern by the amount of $ 1,503,975. [Tr. 6-67]. An industry and valuation expert, Mr. Ben Ball, whose testimony we have credited, derived this figure by determining Consolidated's net present value as a natural gas company with a competitively priced source of natural gas selling natural gas at City Gas' rates and possessing the same number of residential customers (1,995) and commercial customers (8) that it averaged during the years 1981 and 1982. According to Mr. Ball's calculations, Consolidated's net revenue above variable costs would have been $ 128 per residential customer per year and $ 2,182 per commercial customer per year. [Tr. 6-69]. Using an interest rate of 10 percent and a term of 20 years, the net present value of the cash flow stream generated by each residential customer would have been $ 1,092; and the net present value of the cash flow stream generated by each commercial customer would have been $ 18,573. [Tr. 6-69]. These values per customer were then multiplied by the average number of customers in the 1981-1982 period. [Tr. 6-69].\n\nFrom this total, Mr. Ball substracted approximately $ 100,000, representing the costs to Consolidated of the modifications necessary to its customers' appliances to accept natural gas ($ 50 per customer). [Tr. 6-69]. Mr. Ball next subtracted the present value of Consolidated's starting costs (approximately $ 500,000) and the cost of interconnecting the City Gas and Consolidated systems for resale or transportation of natural gas ($ 21,000). [Tr. 6-70.] On the basis of these calculations, Mr. Ball calculated that Consolidated's value as a natural gas company selling natural gas at City Gas' rates to the 1,995 residential and 8 commercial customers it had on an average during 1981 and 1982 would be approximately $ 1,705,000. [Tr. 6-71].\n\nTo this amount, Mr. Ball added $ 130,011, which represents the present value of seven commercial customers ($ 18,573 per customer) attached by City Gas during 1984 in the South Dade Shopping Center. [Tr. 6-73]. This shopping center is contiguous to the Consolidated system and consists of customers for which Consolidated did not have an opportunity to compete because it lacked a competitively priced supply of natural gas. Mr. Ball also added the present value of one new residential account ($ 1,092) that City Gas added to its system in September of 1985. [Tr. 6-73]. Accordingly, Consolidated's value including those seven commercial customers and one residential customer to which City Gas is providing service in its area and for which Consolidated could not compete is approximately $ 1,836,000. [Tr. 6-73].\n\nNext Mr. Ball calculated the additional value Consolidated would have because of its potential to grow at the rate of 6 percent per year. [Tr. 5-238-239]. Ball did not assume that Consolidated would obtain all of the 6 percent annual growth projected by Mr. David Starke, Plaintiff's population growth trend expert, for the areas adjacent to its system in the next 20 years. Instead, in calculating the value of Consolidated's growth potential, Ball assumed only that Consolidated itself would expand its existing system at the rate of 6 percent per year. [Tr. 6-75]. Taking into account the additional costs of expanding its system to new customers, Mr. Ball calculated the total added present value of Consolidated's growth potential to be approximately $ 438,000. [Tr. 6-75-77]. Based on these calculations, Mr. Ball concluded that Consolidated's value today as a natural gas firm, including the seven commercial accounts in the South Dade Shopping Center and the one residential account for which Consolidated never had the opportunity to compete, plus the present value of a 6 percent projected growth over 20 years, would be approximately $ 2,275,000. [Tr. 6-77].\n\nMr. Ball then proceeded to determine Consolidated's actual value today. Applying the market approach, he determined Consolidated's maximum value today to be $ 771,155. This value is the amount of the offer made by City Gas to Consolidated ($ 385 per existing customer). Mr. Ball considered this to be Consolidated's maximum value today. [Tr. 6-73-74]. He applied the market approach because City Gas' capacity to use its strategic location and resources to deny Consolidated natural gas and to take its customers had severely threatened Consolidated's continued existence, and would continue to do so. Accordingly, application of the income approach that Mr. Ball used to calculate Consolidated's value in the absence of City Gas' actions would not provide a meaningful or accurate measure of Consolidated's present going concern value, as that approach assumes a reasonable likelihood of continued cash income. Furthermore, in view of these same circumstances, City Gas was the only potential buyer and could dictate its own price. Accordingly, someone purchasing Consolidated would succeed to Consolidated's present predicament and would ultimately be forced to sell to City Gas at a distress price. Thus, we agree that City Gas' $ 771,155 offer represents Consolidated's maximum value today. [ Id.].\n\nThe diminution in Consolidated's value as a natural gas company as a result of City Gas' actions is the difference between what its value would have been in the absence of City Gas' actions ($ 2,275,130) and its value on the market today ($ 771,155). That difference is $ 1,503,975. [Tr. 6-78]. In addition to the diminution in Consolidated's going concern value, it has suffered lost profits in the form of revenues earned by City Gas from Consolidated's former customers. These lost profits were determined by calculating the total amount of gross revenues collected from these customers and by subtracting the cost of gas. Because City Gas incurs virtually no variable costs in serving these accounts, none were deducted. The amount of Consolidated's lost profits is $ 83,090.15 through September 30, 1985. [Tr. 5-130-133]. Therefore, we find Consolidated's total compensatory damages to be $ 1,587,065.15.\n\nIII. CONCLUSIONS OF LAW: CONSOLIDATED'S MONOPOLIZATION CLAIM\n\nPlaintiff Consolidated has alleged that Defendant City Gas violated § 2 of the Sherman Act by monopolizing and attempting to monopolize the natural gas market in south Florida. We think Consolidated has sustained its burden. Our discussion of Consolidated's claim will be broken down into these component parts: (A) the relevant product market; (B) the relevant geographic market; (C) monopoly power; (D) monopolistic intent; (E) the willful acquisition of monopoly power; (F) the willful maintenance of monopoly power; and (G) damages.\n\nThe offense of monopoly under § 2 of the Sherman Act has two elements: (1) the possession of monopoly power in the relevant market and (2) the willful acquisition or maintenance of that power as distinguished from growth or development as a consequence of a superior product, business acumen, or historic accident.\n\nUnited States v. Grinnell Corp., 384 U.S. 563, 570-71, 16 L. Ed. 2d 778, 86 S. Ct. 1698 (1966). To determine whether City Gas is liable for a § 2 violation, we must first define the relevant market.\n\nA. The Relevant Product Market\n\nThe relevant product market consists of those products which are reasonably interchangeable with each other and for which there is a high \"cross-elasticity of demand.\" Brown Shoe Co. v. United States, 370 U.S. 294, 325, 8 L. Ed. 2d 510, 82 S. Ct. 1502 (1962). As the Supreme Court stated in United States v. E.I. DuPont de Nemours \u0026 Co.:\n\nIn considering what is the relevant market for determining the control of price and competition, no more definite rule can be declared than that commodities reasonably interchangeable by consumers for the same purposes make up that \"part of the trade or commerce,\" monopolization of which may be illegal.\n\n351 U.S. 377, 395, 76 S. Ct. 994, 100 L. Ed 1264 (1956). The Supreme Court in DuPont made clear that the test is not one simply of \"functional\" interchangeability, but one of \"reasonable\" interchangeability, an analysis which necessarily embraces a variety of additional factors. As the Court stated, \"[the] market is composed of products that have reasonable interchangeability for the purposes for which they are produced -- price, use and qualities considered.\" Id. at 404. A necessary and vital component of reasonable interchangeability analysis therefore is price. This factor calls for an appraisal of cross-elasticity of demand. Id. at 394.\n\nNumerous courts, relying on the DuPont test, have rejected the view that where products are merely functionally interchangeable, they automatically comprise the same market. For example, the court in Borden, Inc. v. F.T.C. stated:\n\nBorden's contention that fresh lemons and ReaLemon are reasonably interchangeable emphasizes the similarity of the end uses of the two products, and de-emphasizes other factors such as price differences, low cross- elasticity of demand, and quality differences between fresh lemons and ReaLemon. However, under United States v. E.I. DuPont de Nemours \u0026 Co., 351 U.S. 377, 76 S. Ct. 994, 100 L. Ed. 1264 (1956) (Cellophane), all of these factors are to be considered in assessing the reasonable interchangeability of products. It is now well established that monopoly power is equated with the power to control prices or exclude competition. As a consequence, in examining whether competition from other products prevents the possession of monopoly power, \"price and competition are so intimately entwined that any discussion of theory must treat them as one.\" Id. at 392, 76 S. Ct. at 1005. In Cellophane the court discussed the reasonable interchangeability of products in terms of cross-elasticity of demand, and in terms of comparative costs of the products to consumers.\n\n674 F.2d 498, 507 (6th Cir. 1982) (footnotes omitted). Since there are possible substitutes for almost every product, the test of reasonable interchangeability is used to determine two things: (1) the products' use or uses, and (2) their physical characteristics. In this manner, the total universe of possible substitutes may be ascertained for application of the cross-elasticity of demand test. The Supreme Court defined this process in Times-Picayune Publishing Co. v. United States :\n\nFor every product, substitutes exist. But a relevant market cannot meaningfully encompass that infinite range. The circle must be drawn narrowly to exclude any other product to which, within reasonable variations in price, only a limited number of buyers will turn; in technical terms, products whose \"cross-elasticities of demand\" are small.\n\n345 U.S. 594, 612 n.31, 73 S. Ct. 872, 882 n.13, 97 L. Ed. 1277 (1953) (emphasis added).\n\nTo determine whether there is a high \"cross-elasticity of demand\" between two products, it is necessary to examine whether an increase in the price of one of the two products being considered for inclusion in the market would cause substantial substitution by its users of the other product under consideration. If substantial substitution takes place, then there is high \"cross-elasticity of demand\" and the products compete in the same market. If, however, a substantial price rise does not cause substantial substitution of the other product, there is low cross-elasticity of demand and the products do not compete in the same market. Photovest Corp. v. Fotomat Corp., 606 F.2d 704, 713-14 (7th Cir. 1979), cert. denied, 445 U.S. 917, 63 L. Ed. 2d 601, 100 S. Ct. 1278 (1980).\n\nThe United States Department of Justice, in establishing enforcement guidelines in merger cases, has set forth a good common sense explanation of the process:\n\nTaking the product of the merging firm as a beginning point, the Department will establish a provisional product market. The Department will include in the provisional market those products that the merging firm's customers view as good substitutes at prevailing prices. The potential weakness of such a market based solely on existing patterns of supply and demand is that those patterns might change substantially if the prices of the products included in the provisional market were to increase. For this reason, the Department will test further and, if necessary, expand the provisional market. The Department will add additional products to the market if a significant percentage of the buyers of products already included would be likely to shift to those other products in response to a small but significant and non-transitory increase in price. As a first approximation, the Department will hypothesize a price increase of five percent and ask how many buyers would be likely to shift to the other products within one year. The Department will continue expanding the provisional market until it satisfies the general profitability standard stated above.\n\nUnited States Department of Justice, Antitrust Division, Merger Guidelines, 47 Fed. Reg. 28,493, 28,494-95 (1982) (footnotes omitted).\n\nApplication of these principles has led us to conclude that the relevant product market in this case is composed solely of natural gas. Although natural gas and LP gas may both be used to fuel gas appliances with relatively inexpensive modifications to the appliances, it is undisputed that where natural gas is available, LP gas simply cannot compete because of its overwhelming price disadvantage. [Tr. 6-295-296]. On the demand side, the evidence is clear that a five percent increase in the price of natural gas would not cause consumers to substitute LP gas, as the price of the latter is already roughly 100 % higher than the price of natural gas. That the prices for these products are so far apart is alone substantial evidence that they no longer compete in the same product market, as prices within a product market tend towards uniformity.\n\nAccordingly, it is not surprising that there is little or no cross-elasticity of demand between LP gas and natural gas. This finding is unaltered by the fact that consumers in areas where natural gas becomes available substitute natural gas for LP gas. While this substitution is attributable to price in a broad sense, it is not the kind of price-sensitive substitution to which economists refer in defining market boundaries. Instead, it is simply recognition that where natural gas is available, LP gas is not a factor in the market because the price of natural gas simply renders LP gas obsolete.\n\nThus, we find that there is no cross-elasticity of demand between natural gas and LP gas. The relevant product market is comprised solely of natural gas. Even if we were to assume, however, that the relevant product market comprises both natural gas and LP gas, as City Gas has suggested, the result would remain wholly unchanged.\n\nB. The Relevant Geographic Market\n\nBoth parties agree that the appropriate test for the determination of relevant geographic market is stated in Tampa Electric Co. v. Nashville Coal Co.:\n\nThe area of effective competition in the known line of commerce must be charted by careful selection of the market area in which the seller operates, and to which the purchaser can practicably turn for supplies.\n\n365 U.S. 320, 327, 100 S. Ct. 1278, 5 L. Ed. 2d 580 (1961). In Brown Shoe Co. v. United States, the Supreme Court set forth the method by which the boundaries of relevant geographic markets may be established:\n\nThe criteria to be used in determining the appropriate geographic market are essentially similar to those used to determine the relevant product market. Moreover, just as a product submarket may have . . . significance as the proper \"line of commerce\" so may a geographic submarket be considered the appropriate \"section of the country.\" Congress prescribed a pragmatic, factual approach to the definition of the relevant market and not a formal, legalistic one. The geographic market selected must, therefore, both \"correspond to the commercial realities\" of the industry and be economically significant.\n\n370 U.S. 294, 336-37, 82 S. Ct. 1502, 8 L. Ed. 2d 510 (1962) (citations omitted).\n\nThe Tampa Electric and Brown Shoe tests clearly establish the relevant geographic market for natural gas in this case to include all of the territory given to City Gas in its agreement not to compete with People's Gas. [Tr. 6-299]. Indeed, both parties agree that Peoples' service area is not properly considered as part of the relevant geographic market in this case. [Tr. 9-163]. Rather, City Gas contends that the relevant geographic market includes only Consolidated's service area. We can find no economic significance to this proposed geographic area. We observe that City Gas' pipes have run through much of Consolidated's service area for quite some time, that City Gas was able to take customers away from Consolidated within its area, and that Consolidated's customers are quite able to turn to City Gas to purchase natural gas. Thus, it is readily apparent that potential purchasers look beyond Consolidated's service area for suppliers of natural gas. Moreover, City Gas, a company located outside of Consolidated's service area, supplies customers in Consolidated's service area with natural gas. Since the sellers within Consolidated's service area also operate outside of it and purchasers in Consolidated's service area turn to suppliers located outside of it, it is clear that the effective potential area of competition between City Gas and Consolidated is much broader than Consolidated's service area.\n\nUnder Tampa Electric, City Gas' market is the \"market area in which the seller operates and to which the purchaser can practicably turn for supplies.\" This is true both at wholesale and at retail. Prior to obtaining a FERC allocation, Consolidated could turn to no one except City Gas to obtain wholesale natural gas, as no other supplier was physically close enough to Consolidated's system to make a connection economically feasible. [Tr. 3-19]. And retail customers in City Gas' service area, and in the as yet unserved portions of southwest Dade County, could turn to no one but City Gas for natural gas since Consolidated had none to offer. [Tr. 1-25].\n\nMoreover, the relevant geographic market should encompass all of the service area City Gas serves, a substantial portion of Dade County and part of Broward County. The effects of demand and cost are spread throughout City Gas' service area through the rate regulation process. [Tr. 6-298]. Thus, City Gas can cross-subsidize prices or costs in any one part of its territory with revenues earned in the rest of its service area. Accordingly, we find that the relevant geographic market is composed of the areas in which Consolidated serves its existing customers, the entire region served by City Gas, and the as yet unserved portions of southwest Dade County.\n\nC. Monopoly Power\n\nMonopoly power is the \"power to control prices or exclude competition.\" United States v. Grinnell Corp., 384 U.S. 563, 571, 16 L. Ed. 2d 778, 86 S. Ct. 1698 (1966) (quoting United States v. E. I. DuPont de Nemours \u0026 Co., 351 U.S. 377, 391, 76 S. Ct. 994, 100 L. Ed. 1264 (1956)). Cases dealing with non-regulated industries have developed a number of analytic tools to aid in determining market power. Frequently courts have approached the problem by defining first the relevant product and geographic markets and then computing the defendants' market share from this statistical data. Where that data reveal a market share of more than 70 to 80 percent, the courts have inferred the existence of monopoly power. In this case, the facts quite clearly show that City Gas had a market share in retail natural gas of at least 97 % [Tr. 7-3], far above the threshhold for actual monopoly power. See, e.g., American Tobacco Co. v. United States, 328 U.S. 781, 797-98, 90 L. Ed. 1575, 66 S. Ct. 1125 (1946). Miller Gas, its only natural gas competitor, had a market share of 2.4 %. [Tr. 7-3]. Measured by new \"hookups\" to serve customers, City Gas had 100% of the market in its service area. [Tr. 7-4]. In the wholesale market, City Gas sold 100 % of the natural gas requested for resale in its service area. Moreover, even if we were to lump LP gas and natural gas in the same relevant product market, the record indicates that Defendant possessed monopoly power in that market too. Indeed, even considering sales of LP gas separately, Defendant sold some 4,436,984 therms of LP in 1982 compared to Consolidated's sale of only 542,170 therms. [Plaintiff's Ex. B-0011 (53 of 122); C-0062]. Finally, we observe that Defendant has failed to refute this definition of the relevant product market by any expert testimony.\n\nHowever, \"reliance on statistical market share is a questionable approach in cases involving regulated industries. . . . A predominant market share may merely be the result of regulation, and regulatory control may preclude the exercise of monopoly power.\" Southern Pacific Communications Co. v. American Telephone \u0026 Telegraph Co., 238 U.S. App. D.C. 309, 740 F.2d 980, 1000 (D.C. Cir. 1984), cert. denied, 470 U.S. 1005, 84 L. Ed. 2d 380, 105 S. Ct. 1359 (1985); see MCI Communications Corp. v. American Telephone \u0026 Telegraph Co., 708 F.2d 1081, 1106-07 (7th Cir.), cert. denied, 464 U.S. 891, 78 L. Ed. 2d 226, 104 S. Ct. 234 (1983); Mid-Texas Communications Systems v. American Telephone \u0026 Telegraph Co., 615 F.2d 1372, 1386-87 (5th Cir.), cert. denied, 449 U.S. 912, 101 S. Ct. 286, 66 L. Ed. 2d 140 (1980); Watson \u0026 Brunner, Monopolization by Regulated \"Monopolies\": The Search for Substantive Standards, 22 Antitrust Bull. 559, 565-68 (1977).\n\nIn many regulated industries, each purveyor of service, regardless of absolute size, is in a monopoly position with regard to its customers. . . . For these reasons, the size of a regulated company's market share should constitute, at most, a point of departure in assessing the existence of monopoly power. Ultimately, that analysis must focus directly on the ability of the regulated company to control prices or exclude competition -- an assessment which, in turn, requires close scrutiny of the regulatory scheme in question.\n\nMCI Communications Corp., 708 F.2d at 1107 (footnote omitted). See, e.g., Travelers Insurance Co. v. Blue Cross, 361 F. Supp. 774, 780 (W.D. Pa. 1972) (company was not a monopolist since it lacked control over rate-making mechanism), aff'd, 481 F.2d 80 (3d Cir.), cert. denied, 414 U.S. 1093, 38 L. Ed. 2d 550, 94 S. Ct. 724 (1973); Redwing Carriers, Inc. v. McKenzie Tank Lines, Inc., 443 F. Supp. 639, 641 (N.D. Fla. 1977), aff'd, 594 F.2d 114 (5th Cir. 1979) (where price for transportation of item is set by regulatory agency, fact that one shipper may obtain a monopoly is irrelevant since price will be unaffected); Nankin Hospital v. Michigan Hospital Service, 361 F. Supp. 1199, 1209-10 \u0026 n.33 (E.D. Mich. 1973) (company does not possess monopoly power since rates are controlled and actively reviewed by state insurance commission).\n\nThe fact that a defendant may have had the largest share or the entire share of a market may not be sufficient alone to establish monopoly power if state or federal regulation prevented the defendant from having the power to restrict entry or control prices. MCI Communications Corp., 708 F.2d at 1107. In short, we must also examine the realities of the regulatory scheme. Southern Pacific Communications Co., 740 F.2d at 1001. If pricing and interconnection decisions are left to the defendant rather than to the regulatory agency in the first instance, then it cannot fairly be said that a regulatory agency prevented a defendant from controlling price or excluding competition. Id. Additionally, costs and delays imposed by the regulatory process must be considered barriers to entry. Id. \"The defendant's innocence or blameworthiness, however, has absolutely nothing to do with whether a condition constitutes a barrier to entry.\" Id.\n\nApplying this regulatory analysis to the case at bar, we must consider in sum whether the overwhelming statistical evidence as to Defendant's monopoly power was rebutted by any evidence that City Gas was unable to control prices or exclude competition. City Gas adduced little evidence regarding the effects of regulatory agencies, if any, on its ability to control price or exclude competition. A review of the evidence presented by both parties has led us to conclude that City Gas did indeed have monopoly power.\n\nFirst, although the FPSC approves City Gas' rates in the wholesale market for the resale of natural gas, City Gas, like AT \u0026 T, proposes the rates in the first instance, reaches an agreement with the buyer company, and then simply submits the agreement to the FPSC for its approval. Moreover, because Fla. Stat. § 366.03 (1985) states that natural gas utilities shall not be required to resell gas, it is unclear whether the FPSC could compel City Gas to sell at any particular rate. Second, FERC, the federal regulator of wholesale natural gas, does not control intrastate sales of natural gas. Thus, City Gas cannot rely on this regulator in asserting any sort of regulatory defense. Rather, it appears that City Gas was able to resell gas at will, essentially without regulatory intervention. We find on this record that City Gas had the power to control prices and exclude competition in the wholesale natural gas market.\n\nAs to the retail market, it is clear that the FPSC regulates City Gas' rates to customers and the entry of new suppliers into the retail natural gas market. However, because a potential entrant into this market must obtain a natural gas supply first, from either FGT (after receiving a FERC allocation) or from City Gas, the fundamental realities of the situation are that City Gas has significant control over price and entrants to the retail market. This is further evidenced by the fact that the FPSC has approved two resale gas agreements to which City Gas is a party -- one for one cent per therm over cost and one for seven cents per therm over cost -- without any apparent reason for this disparity. These additional costs are then passed on to the consumer, suggesting that the fee City Gas sets is actually reflected in retail rates. This indicates that the regulatory scheme is structured in such a manner that at least some retail pricing decisions are made by City Gas in the first instance. We find that City Gas had substantial power to control prices in the retail natural gas market.\n\nWe also find, significantly, that City Gas had monopoly power due to the presence of high barriers to entry. Costs and delays imposed by the regulatory process are important barriers to entry. Southern Pacific Communications Co., 740 F.2d at 1001. This issue was addressed in United States v. American Telephone \u0026 Telegraph Co.:\n\n[A] persuasive showing has been made that [AT \u0026 T has] monopoly power (wholly apart from FCC orders with respect to interconnection) through various barriers to entry, such as the creation of bottlenecks, entrenched customer preferences, the regulatory process, large capital requirements, access to technical information, and disparities in risk. These factors, in combination with the evidence of market shares, suffice at least to meet the government's initial burden, and the burden is then appropriately placed upon defendants to rebut the existence and significance of barriers to entry. On that basis, the defendants' regulatory defense to the government's claim of monopoly power must and will be rejected.\n\n524 F. Supp. 1336, 1347-48 (D.D.C. 1981) (footnotes omitted). The natural gas industry also presents any newcomer with the requirement of large initial capital outlays, lengthy construction programs and regulatory delays, such as those experienced by Consolidated in obtaining a natural gas allocation from the FERC. These entry barriers, combined with City Gas' overwhelming market share, compel a finding of monopoly power. Furthermore, although City Gas did not squarely assert a regulatory defense to monopoly power, we find, on the basis of the regulatory scheme evidence which was presented, that any such defense would be rejected. In sum, City Gas had monopoly power in the relevant market.\n\nD. Intent to Monopolize\n\nThe existence of monopoly power in the relevant market, however, does not by itself prove the offense of actual monopolization. A monopolist's behavior is not unlawful unless the monopolist has engaged in the \" willful acquisition or maintenance of that power as distinguished from growth or development as a consequence of a superior product, business acumen, or historic accident.\" United States v. Grinnell Corp., 384 U.S. 563, 570-71, 16 L. Ed. 2d 778, 86 S. Ct. 1698 (1966) (emphasis added). A general intent to monopolize is all that is ordinarily required in monopolization cases. United Staes v. Griffith, 334 U.S. 100, 107, 92 L. Ed. 1236, 68 S. Ct. 941 (1948), overruled on other grounds, Copperweld Corp. v. Independence Tube Corp., 467 U.S. 752, 81 L. Ed. 2d 628, 104 S. Ct. 2731 (1984). A specific intent to restrain competition or to achieve a monopoly is not required. Id. In unregulated settings, the precise dimensions of the general intent standard have been the subject of considerable litigation and varying formulas. See United States v. United Shoe Machinery Corp., 110 F. Supp. 295, 342 (D. Mass. 1953), aff'd per curiam, 347 U.S. 521, 74 S. Ct. 699, 98 L. Ed. 910 (1954). Some courts, building upon Judge Learned Hand's opinion in United States v. Aluminum Co. of America, 148 F.2d 416 (2d Cir. 1945), have concluded that monopolistic conduct can be presumed from the possession of monopoly power unless the accused business demonstrates that its market power was \"thrust upon it.\" Id. at 429. Under this approach, if the ordinary business conduct of a dominant firm leads to the acquisition or maintenance of monopoly power, that conduct is presumed to reflect the requisite monopolistic intent.\n\nThis approach, however, has been specifically rejected when attempting to identify monopolistic conduct by a regulated utility. See, e.g., MCI Communications Corp., 708 F.2d at 1108; Watson \u0026 Brunner, Monopolization by Regulated \"Monopolies\": The Search for Substantive Standards, 22 Antitrust Bull. 559, 575-79 (1977). The rationale behind this finding is that in many regulated industries, anticipating and meeting all reasonable demands for service is a statutory obligation. MCI Communications Corp., 708 F.2d at 1108. Consequently, \"to apply the Alcoa presumption to such conduct would be tantamount to holding that adherence to a firm's regulatory obligation could, by itself, constitute improper willfulness in a section 2 monopolization case.\" Id. Thus, at least one court has suggested that in cases involving a regulated utility the plaintiff must prove that each of the allegedly anticompetitive acts was done with the intent to maintain a monopoly in the relevant market. Id. One commentator, who also suggests that the Alcoa standard should be abandoned when dealing with regulated utilities, suggests that in developing an appropriate standard three concerns should be addressed: First, \"conduct that implements a clearly articulated public policy against competition in a particular industry should not be the kind of exclusionary conduct that demonstrates willful monopolization.\" Watson \u0026 Brunner, supra, at 577. Second, actions or refusals to act (such as expanding facilities to meet anticipated growth in demand) required because of status as a public utility should not be deemed predatory conduct. Id. at 578. Third, reasonable actions legitimately taken by a regulated utility to protect its ability to provide reliable service to its customers should not be deemed evidence of improper intent. Id. at 579. It is in the context of these concerns that the Seventh Circuit found that \"'something more than general intent should be required to establish a Sherman Act violation'\" when dealing with a regulated utility. MCI Communications Corp., 708 F.2d at 1108 (quoting City of Mishawaka v. American Electric Power Co., 616 F.2d 976, 985 (7th Cir. 1980), cert. denied, 449 U.S. 1096, 66 L. Ed. 2d 824, 101 S. Ct. 892 (1981)).\n\nIn the instant case, as we shall discuss at length, certain aspects of the anticompetitive conduct at issue, we believe, are not regulated by any state or federal agency on a consistent basis. Consequently, it is unclear to us that we need go as far as the MCI Communications Corp. court in declaring that to establish intent, each allegedly anticompetitive act must be proven to have been done with the intent to maintain a monopoly. Nevertheless, we conclude that in fact this is the case. Thus, whether we apply a general intent standard, something \"more than general intent,\" or indeed even a specific intent standard, we find that Consolidated has proven the requisite intent. As for the public utility concerns raised by Watson and Brunner, we address the first and third issues as defenses to the specific types of anticompetitive conduct to which they relate; the second issue is simply not anticompetitive conduct upon which our decision rests.\n\nCity Gas has demonstrated an intent to monopolize the relevant market through a number of individual acts and admissions of its intent. Principally, we shall address the following acts: (1) City Gas' 1960 territorial agreement whereby the parties agreed not to compete with each other in the sale of natural gas in Florida; (2) City Gas' refusal to sell or transport natural gas to Consolidated at a reasonable price; and (3) City Gas' efforts to acquire Consolidated in order to eliminate it as a potential competitor. We also discuss the following acts which, we believe, when viewed together with the principal acts, are still further evidence of City Gas' intent to monopolize: (1) City Gas' use of its monopoly power to acquire Nationwide and Miramar, two small potential competitors; (2) City Gas' intervention in Consolidated's FERC proceeding to oppose Consolidated's application for a natural gas allocation; and finally (3) City Gas' use of price discrimination to take Consolidated's customers by not charging them City Gas' customary contribution in aid of construction to extend service to them.\n\nE. The Willful Acquisition of Monopoly Power: The Territorial Agreement\n\nThe division of markets by competitors is a restraint of trade and is prohibited by § 1 of the Sherman Act. 2 Von Kalinowski, Antitrust Laws and Trade Regulations § 6F.01 (1986). The practice of allocating territories between competitors at the same level of the market structure (horizontal market division) is seen as having no purpose other than the elimination of competition and is deemed illegal per se. See, e.g., United States v. Topco Associates, 405 U.S. 596, 607-08, 31 L. Ed. 2d 515, 92 S. Ct. 1126 (1972). For although courts generally utilize a \"rule of reason\" approach in evaluating the legality of restraints alleged to be violative of the Sherman Act, certain business relationships are considered to be so uniformly anticompetitive that they are deemed to be per se violations of the Sherman Act without regard to any consideration of their reasonableness. Id. at 607. Justice Black explained the need for per se rules:\n\nThere are certain agreements or practices which because of their pernicious effect on competition and lack of any redeeming virtue are conclusively presumed to be unreasonable and therefore illegal without elaborate inquiry as to the precise harm they have caused or the business excuse for their use. This principle of per se unreasonableness not only makes the type of restraints which are proscribed by the Sherman Act more certain to the benefit of everyone concerned, but it also avoids the necessity for an incredibly complicated and prolonged economic investigation into the entire history of the industry involved, as well as related industries, in an effort to determine at large whether a particular restraint has been unreasonable -- an inquiry so often wholly fruitless when undertaken.\n\nId. (quoting Northern Pacific Railway Co. v. United States, 356 U.S. 1, 5, 2 L. Ed. 2d 545, 78 S. Ct. 514 (1958)). \"It is only after considerable experience with certain business relationships that courts classify them as per se violations of the Sherman Act.\" Topco, 405 U.S. at 607-08. One of the classic examples of a per se violation of § 1 of the Sherman Act is horizontal market division. Id. at 608. Moreover, if as a result of horizontal market division a company acquires monopoly power, it also violates § 2 of the Sherman Act. Such are the allegations in this case. See United States v. Grinnell Corp., 384 U.S. 563, 576, 16 L. Ed. 2d 778, 86 S. Ct. 1698 (1966).\n\nAs we have detailed already, in September 1960, Defendant City Gas entered into a territorial agreement with Peoples, which delineated distinct natural gas service areas for each of these principal competitors; each company bound itself not to compete in the other's territory. In accordance with its terms, the agreement was submitted by the parties to the Florida Public Utilities Commission (now the \"FPSC\"), which gave its formal approval and observed that such agreements were in the public interest and should be encouraged.\n\nIn 1962 Peoples filed a claim in circuit court alleging that City Gas had violated the 1960 agreement. City Gas responded by asserting, among other things, that the agreement was void as violative of Florida's antitrust laws and the Sherman Act. The case proceeded through the Florida state court system, and, in 1965, the Florida Supreme Court upheld the agreement. City Gas Co. v. Peoples Gas System, 182 So.2d 429 (Fla. 1965). The court concluded that the FPSC had adequate implied authority under Chapter 366, Florida Statutes, to validate such an agreement. Id. at 436. The court also found that Florida's antitrust laws were designed to prohibit only unreasonable restraints on trade, and that the public did not need the state's antitrust laws to protect it against this type of agreement because the public interest was adequately protected by Chapter 366, Florida Statutes. The court concluded that although the agreement could result in monopolistic control, the FPSC's statutory powers over the regulated companies were more than sufficient to prevent monopolistic pricing, production and quality of service. Id. at 435. In upholding the agreement, the court did not specifically address the applicability of the Sherman Act.\n\nCity Gas now claims that because the FPSC approved the territorial agreement and because the Florida Supreme Court upheld this agreement against an attack based on the Florida antitrust laws, the agreement is necessarily immune from attack under the federal antitrust laws. Defendant argues that its conduct here was reasonable, and authorized by the Florida Supreme Court, and therefore lawful. Its analysis ends with that point. While horizontal market division is normally considered a per se violation of the Sherman Act, the so-called \"state action\" exemption in fact will immunize certain types of conduct from antitrust liability. And while not squarely asserted by the Defendant beyond the citation of the Florida Supreme Court case, this issue is indeed a serious one requiring thorough analysis.\n\nThe state action doctrine exempts from antitrust liability acts by the state or those that bear a close relationship to state power or authority. The doctrine originated with Parker v. Brown, 317 U.S. 341, 87 L. Ed. 315, 63 S. Ct. 307 (1943). In Parker, a state statute for marketing raisins restricted competition among growers and maintained prices to packers. Id. at 355. An action was commenced against state officials seeking to enjoin them from enforcing the raisin marketing program. The Court held that the Sherman Act did not prohibit the state from imposing this restraint on competition since it was an act of government. The Parker decision was based on the principle of preemption. 6 Von Kalinowksi, Antitrust Laws and Trade Regulations § 46.02 (1986). The critical issue was whether Congress, in enacting the Sherman Act, had intended to occupy the field of state-sanctioned anticompetitive activity. Id. The Supreme Court concluded that it had not, and thus that the legislative interests of the states had to be accommodated. 317 U.S. at 352.\n\nThe Parker doctrine has evolved in recent years through a number of cases. Two requirements for state action immunity have emerged: first, the anticompetitive conduct must be undertaken pursuant to a clearly articulated and affirmatively expressed policy of the state to displace competition; and, second, the anticompetitive conduct must be actively supervised by the state. California Retail Liquor Dealers Association v. Midcal Aluminum, Inc., 445 U.S. 97, 63 L. Ed. 2d 233, 100 S. Ct. 937 (1980). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" This test applies to actions brought against private parties as well as those brought against the state officials who implement the conduct. Southern Motor Carriers Rate Conference, Inc. v. United States, 471 U.S. 48, 56-57, 85 L. Ed. 2d 36, 105 S. Ct. 1721 (1985). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\"\n\nThe rules of state action may be summarized as follows. When a state acts in its sovereign capacity, its actions are immune from federal antitrust scrutiny. Parker, 317 U.S. at 352 (act of state legislature is act of state). \"When a state legislature adopts legislation, its actions constitute those of the State. . . .\" Hoover v. Ronwin, 466 U.S. 558, 567-68, 80 L. Ed. 2d 590, 104 S. Ct. 1989 (1984). \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Additionally, \"a state supreme court, when acting in a legislative capacity, occupies the same position as that of a state legislature.\" Id. at 568. See Bates v. State Bar, 433 U.S. 350, 359-63, 53 L. Ed. 2d 810, 97 S. Ct. 2691 (1977) (state supreme court rule that restricted advertising by lawyers is act of state). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" Contra Goldfarb v. Virginia State Bar, 421 U.S. 773, 775, 793, 44 L. Ed. 2d 572, 95 S. Ct. 2004 (1975) (enforcement by state bar of county bar's minimum fee schedule for lawyers is not act of state). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" When a state acts in its sovereign capacity, it is unnecessary to apply the two-pronged Midcal Aluminum test; the act is simply immune from the antitrust laws.\n\nBut when the anticompetitive activity is carried out by private parties pursuant to state authorization, which includes authorization by a state agency, both parts of the Midcal Aluminum test must be satisfied. Southern Motor Carriers, 471 U.S. at 60-63. \"This requirement insures that the anticompetitive conduct be actually intended by the state as part of its regulatory scheme.\" 6 Von Kalinowski, Antitrust Laws and Trade Regulation § 46.04[3] (1986). See Southern Motor Carriers, 471 U.S. at 65-66 (collective ratemaking via state public service commissions, permitted by statute in three states and permitted pursuant to clearly articulated state policy in fourth state, is immune from the antitrust laws); New Motor Vehicle Board v. Orrin W. Fox Co., 439 U.S. 96, 109, 58 L. Ed. 2d 361, 99 S. Ct. 403 (1978) (state agency's decisions were outside reach of antitrust laws because state statute's regulatory scheme was clearly articulated and designed to displace competition in the relevant area). \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" Contra Midcal Aluminum, 445 U.S. at 105-06 (although legislative policy clearly articulated purpose to permit resale price maintenance, the program was not immune from the antitrust laws due to inadequate state supervision); Cantor v. Detroit Edison Co., 428 U.S. 579, 584-85, 49 L. Ed. 2d 1141, 96 S. Ct. 3110 (1976) (electric utility's free light bulb tariff which was approved by public service commission was not exempt from the antitrust laws because there was no evidence of any state policy or statute relating to light bulbs). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nIn the instant case, the territorial agreement was approved by a state agency, possibly pursuant to Chapter 366, Florida Statutes. The restraint was not approved by a state legislature or by the state supreme court acting as sovereign. Consequently this conduct must satisfy both parts of the Midcal Aluminum test in order for it to be immune from the antitrust laws. We must decide whether the FPSC, a nonsovereign state agency, acted pursuant to a clearly articulated and affirmatively expressed state policy in approving the territorial agreement, and whether such agreements are actively supervised by the FPSC.\n\n1. The First Prong: No Clearly Articulated State Policy\n\nThe FPSC derives its power from Chapter 366, Florida Statutes. This Chapter defines a public utility to include any supplier of gas -- natural, manufactured or similar gaseous substance -- with exceptions which are not relevant here except that, notably, a person supplying LP gas is not a public utility. Fla. Stat. § 366.02 (1985). The powers of the FPSC with respect to public utilities are enumerated in § 366.05. They include the following powers:\n\n(1) In the exercise of such jurisdiction, the commission shall have power to prescribe fair and reasonable rates and charges, classifications, standards of quality and measurements, and service rules and regulations to be observed by each public utility; to require repairs, improvements, additions, and extensions to the plant and equipment of any public utility when reasonably necessary to promote the convenience and welfare of the public and secure adequate service or facilities for those reasonably entitled thereto; to employ and fix the compensation for such examiners and technical, legal, and clerical employees as it deems necessary to carry out the provisions of this chapter; and to prescribe all rules and regulations reasonably necessary and appropriate for the administration and enforcement of this chapter.\n\nConspicuously absent from this broad list of powers is any reference to establishment of territories or resolution of territorial disputes. However, as noted in Southern Motor Carriers :\n\nA private party acting pursuant to an anticompetitive regulatory program need not \"point to a specific, detailed legislative authorization\" for its challenged conduct. Lafayette v. Louisiana Power \u0026 Light Co., 435 U.S. at 415, (opinion of BRENNAN, J.). As long as the State as sovereign clearly intends to displace competition in a particular field with a regulatory structure, the first prong of the Midcal test is satisfied. . . .\n\nIf more detail than a clear intent to displace competition were required of the legislature, States would find it difficult to implement through regulatory agencies their anticompetitive policies. Agencies are created because they are able to deal with problems unforeseeable to, or outside the competence of, the legislature. Requiring express authorization for every action that an agency might find necessary to effectuate state policy would diminish, if not destroy, its usefulness. Cf. Hallie v. Eau Claire, ante, at 44 (requiring explicit legislative authorization of anticompetitive activity would impose \"detrimental side effects upon municipalities' local autonomy\"). Therefore, we hold that if the State's intent to establish an anticompetitive regulatory program is clear, as it is in Mississippi, the State's failure to describe the implementation of its policy in detail will not subject the program to the restraints of the federal antitrust laws.\n\n471 U.S. at 64-65 (footnote omitted).\n\nIt is clear from Chapter 366 that the Florida legislature intended to substitute competition between public utilities for a regulatory program which would include foreseeable anticompetitive effects. This is particularly clear from the list of powers which the FPSC has over public utilities. Although the focus of the list seems to be on rates, it includes quality of service and repair language as well.\n\nThe case presently before this Court may be in some measure analogous to Southern Motor Carriers. In Southern Motor Carriers, the public service commission had broad authority to prescribe rates but lacked specific authority to allow collective ratemaking. The Court held that specific authority was not necessary because the legislature intended that rates would be set by a regulatory agency, and that collective ratemaking was just one detail of this inherently anticompetitive ratesetting process. 471 U.S. at 63-64. Arguably, the same could be said about Florida's ratemaking structure. Nevertheless, we are convinced that the power to authorize territorial agreements, which by their purpose and effect exclude competition within defined geographic boundaries, is not simply a detail of the FPSC's explicit authority to regulate rates, or to require repairs and improvements, or to hire employees or fix compensation for examiners. Moreover, there is nothing unforeseeable about the creation or regulation of territorial agreements not to compete in regulated industries such as this one. This is particularly true where, as we note below, the Florida legislature has expressly and affirmatively given the FPSC the power to establish and regulate exclusive territories in such related public utilities as the telephone industry, water and sewer utilities, and rural electric cooperatives. The most that can be said here is that territorial agreements, although not mentioned at all in Chapter 366 as to natural gas utilities, have an undisputable effect upon rates. In one FPSC order which addressed proposed tariffs and the resolution of a natural gas territorial dispute, the FPSC analyzed how each company's rate of return would be affected if it received or lost the territory in question. In re: Tariff filed by Miller Gas Company and In Re: Petition of City Gas Company, Docket Nos. 850115-GU, 850118-GU, Order No. 15268, 85 FPSC 10:205 (October 18, 1985). The FPSC noted that loss of the customer \"would force Miller to seek significant increases in the rates to its residential and commercial customers.\" Id. at 3.\n\n\"Agency approval may be undoubted in fact, clearly authorized by state law, and yet not constitute an expression of state policy that is meant to be contrary to the federal antitrust laws.\" 1 P. Areeda \u0026 D. Turner, Antitrust Law para. 214b (1978). One method which commentators have suggested to determine legislative intent is the \"central purpose\" test. Id. at para. 214b4. Professors Areeda and Turner have noted that the primary objective of most state public utility regulations is the prevention of consumer exploitation by the regulated industry. Thus agency approval might mean that in the agency's judgment consumers are not injured by the practice, rather than that the practice is necessary to increase consumer welfare. In reviewing the instant territorial agreement, however, it is clear that the FPSC thought that the agreement was necessary to increase consumer welfare. The FPSC has stated numerous times that territorial agreements are in the public interest because they \"will minimize, and perhaps even eliminate, unnecessary and uneconomical duplication of plant and facilities. . . .\" Order No. 2948, Docket No. 6081-EU; see, e.g., Re Florida Power Corporation, 78 P.U.R. 3d 411, 412 (FPSC 1969); Re Florida Power \u0026 Light Co., 71 P.U.R. 3d 362, 364 (FPSC 1967). Consequently, an application of the central purpose test at least suggests that territorial agreements may be part of the FPSC's central purpose in regulating the natural monopoly characteristics of natural gas.\n\nThere is, however, powerful contrary authority which leads us to the conclusion that the legislature did not intend to give the FPSC the power to approve territorial agreements between natural gas companies. In the first place, in other Florida statutes dealing with specific utilities, the legislature affirmatively gave the FPSC the power to establish exclusive territories for telephone companies (Fla. Stat. § 364.335-.337), \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" and water and sewer utilities (Fla. Stat. § 367.041-.055), \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" and to resolve territorial disputes between rural electric cooperatives (Fla. Stat. § 366.04). \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" By virtue of the fact that the legislature specifically addressed these utilities, it can be implied, as a sound rule of statutory construction, that it would have included such a provision for natural gas companies if it had intended to delegate such powers. See, e.g., J. Ray McDermott \u0026 Co. v. Vessel Morning Star, 457 F.2d 815, 818 (5th Cir.), cert. denied, 409 U.S. 948, 93 S. Ct. 292, 34 L. Ed. 2d 218 (1972) (\"Where Congress has carefully employed a term in one place but excluded it in another, it should not be implied where excluded.\"); State Highway Commission v. Volpe, 479 F.2d 1099, 1114 (8th Cir. 1973) (\"'where Congress has consistently made express its delegation of a particular power, its silence is strong evidence that it did not intend to grant the power.'\" (citations omitted)); Western States Newspapers, Inc. v. Gehringer, 203 Cal. App. 2d 793, 22 Cal. Rptr. 144 (1962); 2A Sutherland Stat. Const. § 51.02 (4th ed. 1984); see also Shell Oil Co. v. Federal Energy Administration, 400 F. Supp. 964, 968 (S.D. Tex. 1975), aff'd, 527 F.2d 1243 (Temp. Emerg. Ct. App. 1975) (\"An intentional omission of a word is evidence that Congress did not intend to grant a power which the inclusion of the word would have given.\" (citations omitted)).\n\nFurthermore, in a recent FPSC Order, the FPSC itself questioned its authority to resolve territorial disputes between natural gas companies but decided the Petitions before it without reaching this issue. In re: Tariff filed by Miller Gas, 85 FPSC 10:205 at 5-6 (October 18, 1985). The FPSC stated:\n\nIt is not clear that this Commission has the statutory authority to either establish exclusive service territories for natural gas utilities (as it does for telephone, water and sewer utilities) or resolve territorial disputes between natural gas utilities (as specifically authorized for electric utilities). However, our resolution of this question is not necessary in view of our finding that Miller is the appropriate utility to serve WASA's natural gas requirements for both the water pumps and the lime kiln.\n\nId. This authority seems to provide an even stronger indication that the Florida legislature did not intend to give the FPSC the power to approve territorial agreements between natural gas companies. Moreover, a review of FPSC decisions regarding this territorial agreement shows that the FPSC has known for at least 14 years that this agreement might violate the federal antitrust laws. See In re: Investigation of Territorial Agreement Between Peoples Gas System and City Gas Co., Order No. 5495, Docket 72040-GU (July 25, 1972), as modified by Order No. 5800 (July 11, 1973). Despite its initial concern, however, on rehearing, the FPSC distinguished the cases which had found territorial agreements to be violative of the antitrust laws and reaffirmed its position that it had the authority to approve these agreements. Notably, the FPSC stated that City Gas contended \"that due to recent legal developments it is now clear that the territorial agreement is invalid under the federal antitrust law and that this Commission should not put itself in the position of ordering the Respondents to continue to adhere to an unlawful agreement.\" Order No. 5495 at 2.\n\nOf particular significance is the authority the FPSC cites as the source of its power to approve territorial agreements. It cites not Chapter 366 or any other state statute, but the Florida Supreme Court's decision in City Gas Co. v. Peoples Gas System, 182 So.2d 429 (Fla. 1965). Indeed, the FPSC has cited this case for this proposition in numerous cases involving territorial agreements. See, e.g., Re Florida Power Corp., 78 P.U.R. 3d 411, 412 (FPSC 1969); Re Florida Power \u0026 Light Co., 71 P.U.R. 3d 362, 364 (FPSC 1967). State supreme court authority, however, does not form the basis for a clearly articulated state policy except when the court acts in its legislative capacity. In the City Gas Co. case relied upon, the Florida Supreme Court was acting in its judicial capacity; it did not by affirmative command adopt, supervise and enforce its own rule. Consequently, this decision cannot form the basis for state action immunity. For the same reason, the other Florida Supreme Court cases which uphold territorial agreements and are cited by Defendant are not controlling. See, e.g., Storey v. Mayo, 217 So.2d 304 (Fla. 1968), cert. denied, 395 U.S. 909, 23 L. Ed. 2d 222, 89 S. Ct. 1751 (1969); Peoples Gas System v. Mason, 187 So.2d 335 (Fla. 1966).\n\nBeing mindful that Midcal Aluminum requires that the FPSC act pursuant to a clearly articulated and affirmatively expressed state policy, we cannot say that such a policy exists in view of the legislature's specific grant of similar power to the FPSC with regard to other utilities and the pronounced absence of such an express grant with respect to natural gas companies. While in the absence of these legislative enactments such a position might at least be arguable in light of Southern Motor Carriers, when these enactments are considered, as we think they must be, we do not think that even under the most liberal reading of Southern Motor Carriers that a clearly articulated state policy to allow approval of territorial agreements by the FPSC can be found.\n\nIt is not for the federal courts to question why a state legislature chooses to state expressly a policy regarding territorial agreements as to some utilities and not as to others. Rather, it is for us to note only that such a clearly expressed state policy does not exist in Florida as to natural gas territorial agreements. If the Florida legislature wishes to establish such a policy, it is free to do so. But for us to imply that the legislature intended to make such a statement about so important a matter would create the kind of interference with state sovereignty which Parker was intended to prevent.\n\n2. The Second Prong: Absence of Active Supervision of Territorial Agreements\n\nTurning to the second part of the Midcal Aluminum test, the issue becomes whether the FPSC actively supervised territorial agreements between natural gas companies. \"The adequate supervision criterion ensures that state-federal conflict will be avoided in those areas in which the state has demonstrated its commitment to a program through its exercise of regulatory oversight. At the same time, it guarantees that when the Sherman Act is set aside, private firms are not left to their own devices.\" 1 P. Areeda \u0026 D. Turner, Antitrust Law para. 213a (1978). In order to meet this test, supervision does not have to be rigorous. Id. at para. 213c. An allegation \"that state officials customarily 'rubber stamp' the self-interested decisions or recommendations of the private parties involved should not ordinarily oust Parker immunity.\" Id. However, in situations where a regulated firm submits tariffs to an agency, and the tariffs take effect unless the agency disapproves them, Parker immunity will not lie. Id. at para. 213f. Agency inaction will not satisfy the active supervision requirement.\n\nA few cases have addressed how much supervision is adequate. At one end of the spectrum is Midcal Aluminum where the state simply enforced the prices established by private parties. 445 U.S. at 105-06. The Court held that this did not meet the requirement of active supervision. Some supervision was required in Coin Call, Inc. v. Southern Bell Telephone \u0026 Telegraph Co., where the court found that even assuming the coin telephone tariff was in large measure produced by defendant's initiative, that it met the second prong of Midcal because the PSC actively enforced the original tariff and participated in its revision. 636 F. Supp. 608, 614 (N.D. Ga. 1986). In another case, a district court found that a city did not actively supervise a private company to whom it had granted the exclusive right to perform electrical inspections where the city exercised control over standards, methods and/or practices employed by the private company in its inspections but maintained no control over the private party's fees. Englert v. City of McKeesport, 637 F. Supp. 930, 933 (W.D. Pa. 1986). Last, in Tambone v. Memorial Hospital, a court found that hospital peer review actions were not actively supervised by the state. 635 F. Supp. 508, 514-15 (N.D. Ill. 1986). The court stated that although the Department of Health had access to peer review materials, inspectors were not obligated to inspect these materials. Thus, there was no regular organized supervision of the peer review process.\n\nLittle evidence of the FPSC's supervision of territorial agreements was adduced during this trial. It is clear that territorial agreements are not required to be submitted to the FPSC to become effective, but that when they are submitted, the FPSC will act upon them. It also appears from a review of FPSC orders regarding this agreement, that the FPSC enforces the agreement or considers its revision, after a hearing, only when someone complains to it or petitions for a review of the agreement. The FPSC does not review the agreement on its own initiative. Thus, as the FPSC seems to supervise territorial agreements only on a sporadic basis, the FPSC does not appear to have met even the less rigorous Coin Call, Inc. adequate supervision standard. Unlike the situation in Coin Call, Inc., we have been presented with no evidence that the FPSC actively enforces the territorial agreements it approves, or that it participates in the revision of such agreements. If we apply the more rigorous Englebert or Tambone standard, the FPSC definitely would not be seen as engaging in active supervision. There is no evidence that the FPSC has established any standards for the creation of territorial agreements or that territorial agreements are reviewed on a regular basis in the absence of a petition by a party or utility customer for reconsideration. On this record, we find that the FPSC does not adequately supervise natural gas territorial agreements and accordingly, we must conclude that the second prong of the Midcal Aluminum test has not been met.\n\nBecause we have found that City Gas has monopoly power in the relevant market, and that it acquired that power by virtue of a territorial agreement that was not immune from the scope of the antitrust laws, we conclude that City Gas has violated § 2 of the Sherman Act. For in the absence of state action immunity, a territorial agreement, even one between regulated utilities, is a per se violation of the Sherman Act. See, e.g., Gainesville Utilities Department v. Florida Power \u0026 Light Co., 573 F.2d 292, 299-300 (5th Cir. 1978), cert. denied, 439 U.S. 966, 58 L. Ed. 2d 424, 99 S. Ct. 454 (1978); Pennsylvania Water \u0026 Power Co. v. Consolidated Gas, Electric, Light \u0026 Power Co., 184 F.2d 552, 558 (4th Cir.), cert. denied, 340 U.S. 906, 95 L. Ed. 655, 71 S. Ct. 282 (1950); accord Montana-Dakota Utilities Co. v. Williams Electric Cooperative, 263 F.2d 431 (8th Cir. 1959).\n\nF. The Willful Maintenance of Monopoly Power: Refusals to Deal; Other Predatory Acts\n\nConsolidated also has contended that City Gas' failure to negotiate in good faith a reasonable rate for natural gas sales or transportation amounts to an illegal refusal to deal in violation of § 2 of the Sherman Act. We agree and conclude that Defendant's refusal to deal with Plaintiff in the context of this case is an even more compelling and altogether independent basis to sustain a finding that § 2 has been violated.\n\nIn general there exists no duty to deal, so long as the decision not to deal is made unilaterally. See, e.g., Associated Press v. United States, 326 U.S. 1, 14-15, 89 L. Ed. 2013, 65 S. Ct. 1416 (1945); United States v. Colgate \u0026 Co., 250 U.S. 300, 307, 63 L. Ed. 992, 39 S. Ct. 465 (1919). This rule was enunciated by the Supreme Court: \"In the absence of any purpose to create or maintain a monopoly, the [Sherman] act does not restrict the long recognized right of trader or manufacturer engaged in an entirely private business, freely to exercise his own independent discretion as to parties with whom he will deal.\" 250 U.S. at 307. Where a firm is a monopolist, however, additional obligations are imposed which would not attach in the ordinary refusal to deal context. Byars v. Bluff City News Co., 609 F.2d 843, 855 (6th Cir. 1979). Consequently, Section 2 violations have been found where a firm with monopoly power at one level of the distribution chain refuses to deal with competitors at another level of the distribution chain, in order to drive these companies out of business so that the monopolist can integrate vertically and achieve a monopoly at both levels. See, e.g., Otter Tail Power Co. v. United States, 410 U.S. 366, 35 L. Ed. 2d 359, 93 S. Ct. 1022 (1973); MCI Communications Corp., 708 F.2d 1081.\n\nThere are two distinct lines of cases which have imposed a duty to deal upon a monopolist -- the \"essential facilities\" doctrine, or \"bottleneck\" theory, and the \"intent\" test. Under either theory we think Plaintiff has proven a violation of § 2.\n\n1. The Essential Facilities Doctrine\n\nTo begin with, the essential facilities doctrine teaches that, when a business controls a scarce facility, it assumes an obligation to provide its competitors reasonable access to that facility. Byars, 609 F.2d at 856. A refusal to deal in this context may be unlawful because it could result in the monopolist extending its power vertically from one level of production to another. MCI Communications Corp., 708 F.2d at 1132. The doctrine originated with United States v. Terminal Railroad Association, 224 U.S. 383, 56 L. Ed. 810, 32 S. Ct. 507 (1912), where a group of railroads acquired ownership over the only feasible terminal for rail traffic coming to St. Louis from the West. The Supreme Court ruled that the terminal owners had to make the facility equally accessible to all users. Over the years, the doctrine has been applied in a variety of contexts. See Otter Tail Power Co. v. United States, 410 U.S. 366, 35 L. Ed. 2d 359, 93 S. Ct. 1022 (1973) (utility that had monopoly over wholesale electric power market violated § 2 by refusing to sell to competitors); Associated Press v. United States, 326 U.S. 1, 89 L. Ed. 2013, 65 S. Ct. 1416 (1945) (A.P.'s bylaws restricting membership by competitors of existing members struck down as unreasonable restraint on competition); Byars v. Bluff City News Co., 609 F.2d 843 (6th Cir. 1979) (wholesale periodical distributor that refused to continue selling to a small jobber because it wished to take over the jobber's business violated § 2); Woods Exploration \u0026 Producing Co. v. Aluminum Co. of America, 438 F.2d 1286 (5th Cir. 1971), cert. denied, 404 U.S. 1047, 30 L. Ed. 2d 736, 92 S. Ct. 701 (1972) (defendants hindered plaintiff from extracting natural gas from a field by refusing access to transport facilities, pooling arrangements or a right-of-way); Six Twenty-Nine Productions, Inc. v. Rollins Telecasting, Inc., 365 F.2d 478 (5th Cir. 1966) (local radio station refused to pay normal commission for material prepared by an advertising agency, effectively refusing to deal with it); Packaged Programs, Inc. v. Westinghouse Broadcasting Co., 255 F.2d 708 (3d Cir. 1958) (factual issue whether television station's refusal to accept a competitor's film programs was done in the exercise of business judgment or to eliminate competitor); Gamco, Inc. v. Providence Fruit \u0026 Produce Building, Inc., 194 F.2d 484 (1st Cir.), cert. denied, 344 U.S. 817, 97 L. Ed. 636, 73 S. Ct. 11 (1952) (defendants had to provide equal access to their commercially unique building; however, denial of access to competitor would be proper if done for valid business reason).\n\nRecent developments in the telecommunications industry have further refined the essential facilities doctrine. In MCI Communications Corp., the Seventh Circuit found that \"it was technically and economically feasible for AT \u0026 T to have provided the requested interconnections, and that AT \u0026 T's refusal to do so constituted an act of monopolization,\" because AT \u0026 T controlled an \"essential facility\" for the establishment of long distance service -- the local exchange service which brought the long distance signals to and from individual businesses and residences. 708 F.2d at 1133. The court stated:\n\nThe case law sets forth four elements necessary to establish liability under the essential facilities doctrine: (1) control of the essential facility by a monopolist; (2) a competitor's inability practically or reasonably to duplicate the essential facility; (3) the denial of the use of the facility to a competitor; and (4) the feasibility of providing the facility. Hecht v. Pro-Football, Inc., 187 U.S. App. D.C. 73, 570 F.2d 982, 992-93 (D.C. Cir. 1977), cert. denied, 436 U.S. 956, 98 S. Ct. 3069, 57 L. Ed. 2d 1121 (1978).\n\nId. at 1132-33 (additional citations omitted).\n\nThis test was applied by the Tenth Circuit in Aspen Highlands Skiing Corp. v. Aspen Skiing Co., 738 F.2d 1509, 1520-21 (10th Cir. 1984), aff'd, 472 U.S. 585, 86 L. Ed. 2d 467, 105 S. Ct. 2847 (1985). In Aspen, the operator of one of four skiing facilities in Aspen, Colorado brought an antitrust action against the owner of the other three facilities alleging that the latter's refusal to continue a joint marketing of an \"all-Aspen ticket\" violated § 2. The court found that the defendant controlled an essential facility (3 of the 4 mountains), that plaintiff could not easily duplicate the facility due to regulatory restrictions, delays and expenses, that defendant denied the use of the facility to plaintiff, and finally that it was feasible for defendant to provide access to the facility. The Supreme Court affirmed the Tenth Circuit but found it unnecessary to rely on the essential facilities doctrine. 472 U.S. 585, 600, 105 S. Ct. 2847, 86 L. Ed. 2d 467 (1985).\n\nAn application of the MCI Communications Corp. four-part test to the facts of this case yields a similar result. First, City Gas, a monopolist, controlled an essential facility -- a pipeline that transported wholesale gas. Prior to 1984, when Consolidated received a FERC allocation, Consolidated could not have purchased wholesale gas from anyone except City Gas. After 1984, Consolidated could have purchased from City Gas or FGT, but would have encountered a prohibitive transportation problem if it had chosen the latter. A lateral pipeline connecting Consolidated's facilities to the FGT main would have cost $ 250,000, or approximately five cents per therm. There is grave doubt as to whether Consolidated could have effectively competed with City Gas based on these additional expenses, and there is also a serious question as to whether the FPSC would have approved such an increased cost based on an uneconomical duplication of City Gas' existing line.\n\nThis concern leads us to the second part of the MCI Communications Corp. test -- whether Consolidated could practicably or reasonably duplicate the essential facility. In the AT \u0026 T line of cases, duplication of the local exchange facilities would obviously be much more expensive than duplication of City Gas' lateral pipe. In Otter Tail, a case which is factually more similar to this case than are the AT \u0026 T cases, however, the Court did not even suggest that the municipalities should attempt to duplicate the electric transmission lines. Although the Court did not indicate the cost involved, we believe this to be highly supportive of a finding that such facilities cannot be reasonably duplicated. In Aspen Skiing Co., the Tenth Circuit found that duplication was unreasonable \"due to regulatory restrictions, and delays, and the expense and time required.\" 738 F.2d at 1521. The same is true here. Consolidated should not have had to wait two years to get FERC approval for a natural gas allocation. Additionally, it would have been unreasonable to require Consolidated to spend $ 250,000, which would potentially have made it uncompetitive with City Gas, to duplicate City Gas' lateral pipe. \"To be 'essential' a facility need not be indispensable; it is sufficient if duplication of the facility would be economically infeasible and if denial of its use inflicts a severe handicap on potential market entrants.\" Hecht v. Pro-Football, Inc., 187 U.S. App. D.C. 73, 570 F.2d 982, 992 (D.C. Cir. 1977), cert. denied, 436 U.S. 956, 57 L. Ed. 2d 1121, 98 S. Ct. 3069 (1978) (footnote omitted). We find that such duplication would have been impractical and unreasonable and would have severely, if not fatally, handicapped Consolidated's potential entry into the natural gas market. See, e.g., Gamco, Inc., 194 F.2d at 487 (unique produce building would be unreasonable to duplicate even though space was available nearby).\n\nThe third part of the test requires that the monopolist deny the use of the facility to the competitor. It is undisputed that City Gas has refused to transport gas for Consolidated. [Tr. 3-15-16]. Additionally, City Gas agreed to sell gas only at 10 cents per therm over cost [Tr. 1-19-20; 3-13-14], which was eventually reduced to 7 cents per therm. [Tr. 3-16-17]. These unreasonable offers essentially amounted to a refusal to deal at all. City Gas justified the latter price as reasonable because that is what it paid Peoples pursuant to an agreement between them whereby City Gas would serve a small area located within People's territory. We note, however, that pursuant to their territorial agreement, City and Peoples do not compete. Accordingly, this price cannot be viewed as an arm's length reasonable price. The evidence presented by Consolidated at trial suggested that a reasonable price was less than 1 cent per therm over cost. [Tr. 3-69]. Although we do not decide exactly what a reasonable price would have been, it is absolutely clear from the gross disparity between one cent and seven cents per therm, that City Gas' proposal amounted to a refusal to deal.\n\nIn Aspen Skiing Co., the Tenth Circuit similarly dealt with an unreasonable offer that constituted a refusal to deal. There, defendant offered plaintiff a 12.5% share of joint revenues for the 1978-79 ski season. In the past plaintiff's share had never fallen below 13.2% based on surveys, and 15.8% based on actual usage. 472 U.S. at 590 \u0026 n.8. Defendant admitted that it had refused to deal with plaintiff (738 F.2d at 1521), and that it had offered plaintiff a deal that plaintiff could not accept. 472 U.S. at 592. Although City Gas has not been quite so explicit, it is clear to us from the evidence in this case that City Gas' offer of seven cents per therm was one which was unreasonable and which it knew Consolidated could not accept. Indeed, City Gas' Vice President Ball indicated that he made no attempt to ascertain a reasonable price for direct gas sales to Consolidated, and that he came up with the cost-plus-ten-cents terms \"out of the air.\" Consequently, we find that the third part of the MCI Communications Corp. test has been met.\n\nLast, MCI Communications Corp. requires that it be feasible for the monopolist to provide its facility to plaintiff. In this case it is uncontradicted that it was technically feasible for City to provide Consolidated with an interconnection and that the flow of gas via the interconnection could be easily monitored. Although City Gas has alleged that such an interconnection could deplete its potentially needed surplus supply of gas, City Gas' concerns are not supported by the record, and after 1984, when Consolidated received its own gas allocation, these concerns became moot. Accordingly, we find that all four parts of the MCI Communications Corp. test have been met, and thus, that Consolidated has established that this case involves an essential facility. Because City Gas has been unable to present us with any legitimate justification for its actions, we find that its refusal to deal constitutes an unlawful maintenance of monopoly power in flat violation of § 2 of the Sherman Act.\n\nThere are, however, defenses available to one who controls an essential facility and consciously refuses to make it available to others. \"Absolute equality of access to essential facilities . . . is not mandated by the antitrust laws.\" Southern Pacific Communications Co. v. American Telephone \u0026 Telegraph Co., 238 U.S. App. D.C. 309, 740 F.2d 980, 1009 (D.C. Cir. 1984), cert. denied, 470 U.S. 1005, 84 L. Ed. 2d 380, 105 S. Ct. 1359 (1985). In Terminal Railroad Association, the Supreme Court made clear that access only need be afforded \"upon such just and reasonable terms and regulations as will, in respect of use, character and cost of service, place every such company upon as nearly an equal plane as may be with respect to expenses and charges as that occupied by the [monopolist].\" 224 U.S. at 411; see Town of Massena v. Niagara Mohawk Power Corp., 1980-2 Trade Cas. (CCH) P63,526 (N.D.N.Y. 1980) (monopolist need not provide preferential access to its facilities). In Hecht, the District of Colombia Circuit found that the essential facility must be made available on \"fair terms,\" but that the \"antitrust laws do not require than an essential facility be shared if such sharing would be impractical or would inhibit the defendant's ability to serve its customers adequately.\" 570 F.2d at 992-93 (footnote omitted); see also United States v. American Telephone \u0026 Telegraph Co., 524 F. Supp. 1336, 1361 (D.C. Cir. 1981) (\"problems of feasibility and practicability may be taken into account by the Court in determining the sufficiency under the law of the access to essential facilities granted by defendants to non-Bell carriers\"). Denials of access have also been justified based on a \"regulatory defense.\" In several relevant cases against American Telephone \u0026 Telegraph, AT \u0026 T claimed that it refused to provide interconnections to other carriers because of its duty to comply with § 201(a) of the Communications Act (47 U.S.C. § 201(a) (1976)). Section 201(a) stated that when presented with an interconnection request, AT \u0026 T had to determine whether the interconnection would serve the public interest, before deciding whether to grant the request. Southern Pacific Communications Co., 740 F.2d at 1009; Mid-Texas Communications Systems v. American Telephone \u0026 Telegraph Co., 615 F.2d 1372, 1389 (5th Cir.), cert. denied, 449 U.S. 912, 101 S. Ct. 286, 66 L. Ed. 2d 140 (1980). In order to assert successfully this defense, it is required that the denial be reasonable and made in good faith on that basis, rather than solely on the basis of competitive considerations. Southern Pacific Communications Co., 740 F.2d at 1009.\n\nNotably, the justification of self-preservation has not been successfully asserted as a defense to denial of access to an essential facility. Otter Tail Power Co., 410 U.S. at 380-82. In Otter Tail, the defendant unsuccessfully relied on this defense; the Supreme Court accepted the district court's conclusion that Otter Tail's fears were greatly exaggerated. Id. at 381.\n\nA number of utility cases provide close factual comparisons to the case at bar. Of these cases, however, the facts of Otter Tail are most similar. In Otter Tail, a regulated electric utility refused to sell power wholesale or to transport power purchased from other sources (a procedure referred to as \"wheeling\") to municipalities which chose to own their own retail distribution systems. Otter Tail's policy was to acquire existing municipal systems within its service area. Additionally, Otter Tail would attempt to prevent municipalities from replacing it when their franchises with Otter Tail expired. Between 1945 and 1970, twelve municipalities proposed to replace Otter Tail; only three were successful. Municipalities faced great obstacles in establishing their own systems. They had to purchase electricity at wholesale, and get that electricity transported to their customers. The only existing transmission lines in the area belonged to Otter Tail, and Otter Tail refused to sell or wheel power to them.\n\nFurthermore, Otter Tail invoked restrictive contract clauses so that municipalities could not obtain power from other sources. Last, it engaged in a pattern of harassing litigation against any municipality which desired to set up its own system. Interestingly, Otter Tail did deal with municipalities which had always had their own power companies. Only when an Otter Tail customer attempted to establish its own power system would Otter Tail retaliate.\n\nThe district court found that Otter Tail used its monopoly power to foreclose competition or gain a competitive advantage, or to destroy a competitor. The court found further that there were no engineering factors that prevented Otter Tail from selling wholesale power and \"that Otter Tail's refusal to sell at wholesale or to wheel were solely to prevent municipal power systems from eroding its monopolistic position.\" Id. at 378. Otter Tail's only defense was that \"without the weapons which it used, more and more municipalities will turn to public power and Otter Tail will go downhill.\" Id. at 380. The district court rejected this argument as \"not supported by the record.\" Id. at 381. The Supreme Court affirmed. Id. at 382. Although the district court relied on both the essential facilities doctrine and the intent test in finding Otter Tail's refusal to deal to be illegal under § 2, the Supreme Court combined both theories in its analysis.\n\nThe facts presented in the instant case are remarkably similar to those in Otter Tail. City Gas initially refused to sell natural gas to Consolidated, and then, when Consolidated finally received its own natural gas allocation, City Gas refused to transport the gas. Similarly, the only pipeline available anywhere near the area Consolidated wished to serve was owned by City Gas. City Gas, like Otter Tail, had begun a practice of acquiring LP companies like Consolidated. Indeed, Consolidated thus far is the only Florida LP company to have attempted the conversion to natural gas. As in Otter Tail, the entry barriers Consolidated faced were great.\n\nThe justifications which City Gas has offered for its refusal to deal are as unpersuasive as those offered in Otter Tail. City Gas first claimed that if it sold gas to Consolidated, that it would deplete its own supply of gas, and then, if another natural gas shortage occurred it could not adequately serve its own customers. As noted in Otter Tail, if access will impair the utility's ability to render adequate service, interconnection will not be required. The evidence, however, does not support this conclusion. City Gas' current surplus gas allocation is so large, and Consolidated's needs so small that City Gas could serve all of Consolidated' needs by using only 1.8% of its surplus allocation. Additionally, now that Consolidated has received its own natural gas allocation, City Gas' reserve would be completely unaffected. Accordingly, we reject this defense.\n\nCity Gas also claimed that if Consolidated was allowed to sell natural gas then every LP dealer in the state might try to do so. [Tr. 3-161-3-162]. This statement seems to be alluding to the concern that Otter Tail raised -- that new entrants would erode its market. Again, the evidence does not support such a finding in light of City Gas' overwhelming dominance in the area. Furthermore, and more important, as noted in Otter Tail, \"the promotion of self-interest alone does not invoke the rule of reason to immunize otherwise illegal conduct.\" Id. at 380 (quoting United States v. Arnold, Schwinn \u0026 Co., 388 U.S. 365, 375, 18 L. Ed. 2d 1249, 87 S. Ct. 1856 (1967)). Because we find that the requested interconnection would not impair City Gas' ability to render adequate service to its customers, we reject this defense.\n\nMoreover, as in Otter Tail, there does not appear to be any technical reason why City Gas could not sell or transport gas to Consolidated. Indeed, as in Otter Tail, City Gas currently provides this service to at least one small gas company, Florida Gas. Additionally, neither Otter Tail nor City Gas offered any evidence to show why their behavior was in the public interest, thus we need not consider any regulatory defense. Accordingly, we find that based on the analysis offered in Otter Tail, City Gas' conduct constitutes an illegal refusal to deal in violation of § 2 of the Sherman Act.\n\nDefendants cite Florida Cities v. Florida Power \u0026 Light Co., 525 F. Supp. 1000 (S.D. Fla. 1981), for the proposition that the essential facilities doctrine does not apply where access to defendant's facilities would simply be more economical to plaintiff than an alternative source. In that case, plaintiff, a power supplier wanted access to defendant's nuclear generated electricity because it was more cost-efficient than other methods of electricity generation. Plaintiff claimed that these facilities were essential and thus that defendant had an obligation to deal with it. In granting summary judgment for the defendant, the court found that defendant's facilities were \"not bottleneck resources, and that plaintiff ha[d] not shown a firm interest in or need for access to defendant's facilities.\" Id. at 1005. Notably, however, defendant obtained only 29 % of its electricity from nuclear power. Thus it is apparent that other forms of electricity provided the majority of even defendant's needs. It is difficult to view nuclear power as an essential facility in light of this statistic. Second, the defendant did not even have enough nuclear power to serve all of its own customers, much less, all of plaintiff's customers. Thus, service to defendant's customers would have been impeded had defendant made its nuclear power available to plaintiff. And that is indeed a proper justification for a monopolist's refusal to deal.\n\nThe facts in this case are much different from those of Florida Cities. In the first place, City Gas uses natural gas to meet 100 % of its needs. This provides a much stronger basis for inferring that natural gas, as opposed to any type of gas, is an essential facility. And second, City Gas has a large excess allocation of natural gas and we have found that City Gas' customers would not be hurt if it sold gas to Consolidated. Accordingly, we find Florida Cities inapposite.\n\nCity also claims that pursuant to Fla. Stat. § 366.03, it was never required to resell natural gas to Consolidated and hence could not have violated the antitrust laws in refusing to sell. Section 366.03 provides as follows:\n\nGeneral duties of public utility. -- Each public utility shall furnish to each person applying therefor reasonably sufficient, adequate, and efficient service upon terms as required by the commission. No public utility shall be required to furnish electricity or gas for resale except that a public utility may be required to furnish gas for containerized resale. All rates and charges made, demanded, or received by any public utility for any service rendered, or to be rendered by it, and each rule and regulation of such public utility, shall be fair and reasonable. No public utility shall make or give any undue or unreasonable preference or advantage to any person or locality, or subject the same to any undue or unreasonable prejudice or disadvantage in any respect.\n\n(emphasis added). Although City Gas has not explained how this statute would insulate it from federal antitrust liability, apparently it is once again asserting state action immunity. Unlike the circumstances surrounding the territorial agreement, this statute affirmatively expresses a state policy. Two areas of concern, however, remain.\n\nFirst, it is not at all apparent as required by Town of Hallie v. City of Eau Claire, 471 U.S. 34, 42-44, 85 L. Ed. 2d 24, 105 S. Ct. 1713 (1985), \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" that the legislature clearly contemplated this type of anticompetitive effect. The statute appears to have been derived from Florida Power \u0026 Light Co. v. State ex rel. Malcolm, 107 Fla. 317, 144 So. 657 (1932). There, the Florida Supreme Court upheld a utility's refusal to provide gas to a landlord who proposed to buy it at wholesale, re-meter it, and resell it to his tenants at higher prices. Notably, the attorney general of the state appeared and argued in support of the utility. The attorney general's concern was that a decision in favor of the landlord might put the regulation of such services \"beyond the control of the public authorities having jurisdiction over the subject-matter of reasonable rates to consumers of public utility services.\" Id. at 659. This concern plainly would not be applicable to sales by a utility to another gas company, which would have to submit to FPSC regulation before it could resell to the public.\n\nSecond, as explained in our discussion of the territorial agreement, we have found that the FPSC does not adequately supervise this type of anticompetitive conduct for purposes of the second prong of the Midcal Aluminum test. For example, based on the evidence presented, the FPSC has approved wholesale natural gas resale prices of both one cent over cost and seven cents over cost. No explanation has been offered for this disparity. Rather, the evidence here suggests that when an agreement between two gas utilities is presented to the FPSC, the FPSC normally approves it, assuming that the private parties have struck their best bargain. Again we find that City Gas' refusal to sell gas is not immune from the sweep of the Sherman Act. Moreover, and more important, by its own terms Fla. Stat. § 366.03 has no application at all to Defendant's refusal to transport gas. Thus City Gas' refusal to transport gas would be subject in any event to Sherman Act scrutiny.\n\nWe also note that the facts in this case are not like those presented in MCI Communications Corp. with respect to intercity interconnections. MCI alleged that Bell's intercity lines were essential facilities. In rejecting this argument, the court stated that the \"evidence presented did not demonstrate either that the duplication of Bell's intercity lines was economically infeasible or that the denial of access inflicted a severe handicap on market entrants.\" 708 F.2d at 1148. We have specifically made findings to the contrary in this case. Additionally, the MCI Communications Corp. court found that \"MCI's primary business was to build precisely the type of facilities to which it sought access from the Bell System.\" Id. In the instant case Consolidated's primary business is to serve retail customers, and indeed, its retail pipes are already in place. Consolidated is not attempting to enter the wholesale gas business, and it is access to this type of pipe which it claims is essential. We agree.\n\n2. The Intent Test\n\nA second and independent basis for imposing § 2 antitrust liability upon City Gas for its refusal to deal would be a determination that City Gas' actions constituted sufficient evidence of an intent to monopolize. \"In addition to the cases finding liability for a refusal to deal when an essential service is involved, there are cases which find liability when a monopolist's refusal to deal with a competitor is shown to be evidence of an illegal intent to destroy competition. These cases focus on the intent and competitive effect of the refusal to deal; not on whether the facility itself is 'essential.'\" MCI Communications Corp., 708 F.2d at 1148 (citations omitted). In Byars, the theoretical distinction between the intent theory and the essential facilities doctrine was said to be that \"the former focuses on the monopolist's state of mind while the latter examines the detrimental effect on competitors.\" 609 F.2d at 856. In practice, however, often there are many overlapping considerations.\n\nThe intent test originated with United States v. Colgate \u0026 Co., 250 U.S. 300, 63 L. Ed. 992, 39 S. Ct. 465 (1919), where the Court said that a business is free to deal with whomever it pleases so long as it has no \"purpose to create or maintain a monopoly.\" Id. at 307. This test was applied in Eastman Kodak Co. v. Southern Photo Materials Co., 273 U.S. 359, 71 L. Ed. 684, 47 S. Ct. 400 (1927). There, Kodak had monopoly power over the national wholesale market for certain photographic supplies. Kodak decided to vertically integrate and began buying out retail distributors. When one distributor refused to sell out, Kodak refused to sell it photographic supplies at wholesale prices. The jury found that Kodak had violated § 2. The Supreme Court affirmed despite the fact that the only evidence of monopolistic purpose was Kodak's desire to buy out retail distributors and its inability to provide a legitimate business reason for its actions.\n\nIn Lorain Journal Co. v. United States, a newspaper which was indispensable to local businesses refused to sell advertising space to customers who bought advertising on a local radio station. 342 U.S. 143, 72 S. Ct. 181, 96 L. Ed. 162 (1951). The Court found that this was designed to destroy the radio station, a competitor, and enjoined it as an illegal attempt to monopolize. The last well-known \"intent\" test case is Otter Tail, 410 U.S. 366, 35 L. Ed. 2d 359, 93 S. Ct. 1022. As noted earlier, Otter Tail is also based on the essential facilities doctrine. Because Otter Tail's conduct was predatory and designed to destroy its competitor, however, the decision can be based also on the intent test. Finally, courts have also found a monopolist's refusal to deal to be unlawful where the monopolist has acted to preserve its monopoly. See, e.g., Poster Exchange, Inc. v. National Screen Service Corp., 431 F.2d 334, 339 (5th Cir. 1970), cert. denied, 401 U.S. 912, 27 L. Ed. 2d 811, 91 S. Ct. 880 (1971) (\"National Screen intentionally used the monopoly power it had at the manufacturing level to eliminate Poster as a competitor at the distributor-jobber level.\"); United States v. Klearflax Linen Looms, Inc., 63 F. Supp. 32, 39 (D. Minn. 1945) (\"[monopolist] cannot refuse to sell if its design and purpose is to establish a wrongful monopoly.\")\n\nThis does not end the analysis. As with the essential facilities doctrine, there are defenses available to a monopolist. Specifically, antitrust liability will not be imposed without first examining business reasons which might justify a refusal to deal. See Sargent-Welch Scientific Co. v. Ventron Corp., 567 F.2d 701, 712 (7th Cir. 1977), cert. denied, 439 U.S. 822, 58 L. Ed. 2d 113, 99 S. Ct. 87 (1979) (lawfulness of a monopolist's termination of a dealer depends upon the purpose for which it was done). \"The rationale for this is that since we tolerate the existence of some monopolists, we must give them some leeway in making business decisions.\" Byars, 609 F.2d at 862 (citations omitted). See, e.g., International Railways of Central America v. United Brands Co., 532 F.2d 231, 239-40 (2d Cir.), cert. denied, 429 U.S. 835, 50 L. Ed. 2d 100, 97 S. Ct. 101 (1976) (defendant's refusal to deal lawful because it \"had no reasonable business alternative but to abandon an unprofitable and uncomfortable operation.\"); Gamco, Inc. v. Providence Fruit \u0026 Produce Building, Inc., 194 F.2d 484, 487-88 \u0026 n.3 (1st Cir.), cert. denied, 344 U.S. 817, 97 L. Ed. 636, 73 S. Ct. 11 (1952) (defendants may deny access to their building because of limited space or the applicant's financial unsoundness).\n\nThe instant case bears many similarities to the \"intent\" cases. First, City Gas' Chairman baldly admitted at trial that its actions toward Consolidated were intended to \"protect its own domain.\" He posited that if Consolidated were to receive an allocation of natural gas to serve its customers that it \"would give every other propane dealer a chance to request natural gas for their own development through the state . . . or the country.\" [Tr. 3-161-162]. Moreover, City Gas' Vice-President, Ivan Ball, said basically the same thing. These statements strongly suggest that City Gas' intent simply was to destroy competition. Second, similar to Kodak, City Gas' refusal to sell gas to Consolidated took place after City Gas had determined that it wished to buy out Consolidated. We have found that City Gas' defenses for this action do not justify its behavior. Furthermore, we note again the similarity this case bears to Otter Tail. Otter Tail's unjustified refusal to sell or wheel electricity was found to show an intent to drive out competition. We find similarly that City Gas' behavior was designed to foreclose competition. Finally, City Gas has offered us no business justification for its refusal to sell or transport gas to Consolidated. Indeed, the evidence suggests that since City Gas' charge to Consolidated would be based on a cost-plus basis, that even a one-cent-per-therm rate would provide City Gas with a substantial profit and minimal additional related expenses. Accordingly, although City Gas generally may be free to deal with whomever it pleases, we find based on a review of the record evidence, that its real purpose here was to maintain its monopoly unlawfully, and conclude that its behavior constitutes an illegal refusal to deal under § 2 of the Sherman Act.\n\n3. Other Predatory Acts\n\nConsolidated offered proof at trial of a number of other acts by City Gas which it claimed were also exclusionary and anticompetitive. Consolidated need not prove every single act; rather, it must establish that City Gas has engaged in an overall pattern of anticompetitive behavior. In Aspen Highlands Skiing Corp. v. Aspen Skiing Co., 738 F.2d 1509 (10th Cir. 1984), aff'd, 472 U.S. 585, 86 L. Ed. 2d 467, 105 S. Ct. 2847 (1985), the defendant argued that each of the \"six things\" on which plaintiff relied to demonstrate deliberate exclusion from the Aspen ski market must be supported by sufficient evidence for a § 2 verdict. The court rejected that argument and held:\n\nWe cannot agree that each one of the \"six things\" which plaintiff argued demonstrated abuse of monopoly power, taken alone, must be supported by sufficient evidence to find a § 2 violation. . . .\n\nDefendant's argument would require that we view each of the \"six things\" in isolation. To do this, however would be contrary to the Supreme Court's admonition that an antitrust plaintiff \"should be given the full benefit of [its] proof without tightly compartmentalizing the various factual components and wiping the slate clean after scrutiny of each.\" Plaintiff's evidence should be viewed as a whole. Each of the \"six things\" viewed in isolation need not be supported by sufficient evidence to amount to a § 2 violation.\n\nId. at 1522 n. 18 (citations omitted).\n\nThe record has shown additional evidence of Defendant's anticompetitive behavior. And although we do not hold that any of the following acts standing alone -- unlike the territorial agreement not to compete or the refusal to deal -- would necessarily violate the Sherman Act, when viewed in concert with the anticompetitive behavior already discussed, they further demonstrate City Gas' abuse of monopoly power and support a finding that City Gas has violated § 2.\n\nIn this context, we believe that City Gas' acts of acquiring Nationwide and Miramar are evidence of its intent to eliminate any potential competitors. City Gas' efforts to acquire Consolidated further support this finding. While we make no specific findings here as to whether City Gas also violated § 7 of the Clayton Act, a number of the factors associated with violations of this provision are present here. One such factor is an industry trend toward concentration -- certainly a characteristic of the natural gas industry in this region and, indeed nationwide. See Brown Shoe Co. v. United States, 370 U.S. 294, 343-46, 8 L. Ed. 2d 510, 82 S. Ct. 1502 (1962); United States v. Kimberly-Clark Corp., 264 F. Supp. 439, 462-65 (N.D. Cal. 1967); United States v. Kennecott Copper Corp., 231 F. Supp. 95, 102-05 (S.D.N.Y. 1964), aff'd per curiam, 381 U.S. 414, 85 S. Ct. 1575, 14 L. Ed. 2d 692 (1965). Another factor which has often figured prominently in the application of § 7 is the high market share of the acquiring firm. See, e.g., United States v. Phillipsburg National Bank \u0026 Trust Co., 399 U.S. 350, 26 L. Ed. 2d 658, 90 S. Ct. 2035 (1970); United States v. Continental Can Co., 378 U.S. 441, 12 L. Ed. 2d 953, 84 S. Ct. 1738 (1964). In this regard, City Gas clearly dominates the relevant market for natural gas. Yet a further factor deemed relevant to horizontal acquisitions such as City Gas has carried out with respect to Nationwide and Miramar is the inelastic nature of supply and demand in the market. 4 Von Kalinowski, Antitrust Laws and Trade Regulation, § 19.02[11] (1968). Because natural gas in these circumstances is being used as a home fuel product such as for cooking and heating, the demand for it remains relatively constant except for seasonal variations. This inelasticity is also present in the supply of natural gas, as to which there is expected to be a large surplus for the foreseeable future.\n\nWithout delving further into an inquiry as to City Gas' possible violation of this Clayton Act provision, we note that City Gas' acquisition of Miramar and Nationwide, as well as its putative acquisition of Consolidated Gas, provide additional evidence of the corporation's intent to monopolize the relevant market and eliminate competition.\n\nConsolidated also claims that City Gas violated § 2 by intervening in Consolidated's FERC proceeding to oppose Consolidated's application for a natural gas allocation. City Gas argues that the Noerr-Pennington Doctrine immunizes its opposition before the FERC even though such actions delayed Consolidated's efforts to obtain natural gas. Two Supreme Court decisions -- Eastern Railroad Presidents Conference v. Noerr Motor Freight, Inc., 365 U.S. 127, 5 L. Ed. 2d 464, 81 S. Ct. 523 (1961) and United Mine Workers of America v. Pennington, 381 U.S. 657, 14 L. Ed. 2d 626, 85 S. Ct. 1585 (1965) -- established the general rule that \"lobbying and other similar concentrated efforts by businessmen to obtain legislative or executive action do not violate the antitrust laws, even though intended to eliminate competition or otherwise restrain trade.\" 6 Von Kalinowski, Antitrust Laws and Trade Regulation § 46A.01 (1986) (footnote omitted). The rationale behind the doctrine is the belief that \"public participation in the legislative process, no matter how selfish the participant's motivation, must be encouraged even at the expense of possible injury to competition. . . .\" Id.\n\nWhether the Noerr-Pennington defense is applicable or not, two facts are clear: first, Consolidated was severely damaged by the delay which occurred as a direct result of City Gas' intervention; and, second, City Gas' reason for opposing Consolidated's application was to protect its own domain. [Tr. 3-161-162, 174]. Thus, although we do not hold that City Gas' intervention in the FERC proceeding violated § 2, we believe evidence of City Gas' motives are derived from its officers' statements regarding Consolidated's application.\n\nFinally, Consolidated has alleged that City Gas engaged in price discrimination to take away Consolidated's existing and prospective customers. Courts have long recognized that \"'predatory pricing' may be a means of obtaining or maintaining a monopoly position in violation of Section 2 of the Sherman Act . . . .\" Janich Bros. v. American Distilling Co., 570 F.2d 848, 855 (9th Cir. 1977), cert. denied, 439 U.S. 829, 58 L. Ed. 2d 122, 99 S. Ct. 103 (1978) (citing United States v. American Tobacco Co., 221 U.S. 106, 160, 182, 55 L. Ed. 663, 31 S. Ct. 632 (1911), and Standard Oil Co. v. United States, 221 U.S. 1, 43, 55 L. Ed. 619, 31 S. Ct. 502 (1911)). The essence of the violation is whether there has been \"discrimination\" in the prices charged by a seller to different purchasers.\n\nIn the instant case, City Gas' Chairman testified that his orders were to charge every customer contributions in aid of construction when the cost of extending natural gas service to any customer exceeded the \"feasibility rule.\" [Tr. 5-192-193]. City Gas' Vice-President testified that the Chairman's orders were followed. [Tr. 8-87]. There is no conflict in the evidence that City Gas generally charged \"contributions in aid of construction\" to commercial customers when appropriate [Tr. 9-47] and that none of Consolidated's commercial customers were required to contribute to City Gas' installations of the pipes to serve them. [Tr. 3-241-243]. City Gas' counsel stipulated at the trial that some $ 19,000 in contributions were required under the feasibility rule and had been waived by City Gas in extending service. Expert testimony was adduced that the FPSC procedures require use of prior gas bills to calculate whether contributions in aid of construction are required and that, because they were not used, City Gas' estimations of residential revenues were overstated by some 71 %, to make it appear that contributions were not required. [Tr. 5-116-120]. The only feasibility study produced by City Gas as to these customers had been prepared four months after this suit was filed and almost one year after the service had been extended. [Tr. 8-4].\n\nAgain, we do not hold that City Gas' failure to charge contributions in aid of construction establishes a predatory pricing scheme necessarily sufficient to state an independent cause of action under § 2 of the Sherman Act, but we do find that this conduct, when viewed with other behavior of City Gas, is still further evidence of City Gas' intent to eliminate Consolidated.\n\nG. Damages\n\nThe Supreme Court has acknowledged the uncertainty necessarily involved in proving damages in antitrust cases: \"The vagaries of the marketplace usually deny us sure knowledge of what plaintiff's situation would have been in the absence of the defendant's antitrust violation.\" J. Truett Payne Co. v. Chrysler Motors Corp., 451 U.S. 557, 566, 68 L. Ed. 2d 442, 101 S. Ct. 1923 (1981). An antitrust wrongdoer cannot defeat recovery by insisting on rigorous proof of damages. See Zenith Radio Corp. v. Hazeltine Research, Inc., 395 U.S. 100, 123, 23 L. Ed. 2d 129, 89 S. Ct. 1562 (1969). The amount of damages can be determined by the trier of fact based on \"a just and reasonable estimate . . . based on relevant data.\" Bigelow v. RKO Radio Pictures, Inc., 327 U.S. 251, 264, 90 L. Ed. 652, 66 S. Ct. 574 (1946). Such an estimate may include both \"'probable and inferential, as well as direct and positive proof.'\" Id. (citations omitted). An antitrust plaintiff has a lesser burden of proof as to damages than do plaintiffs in other types of civil actions. See Zenith Radio Corp., 395 U.S. at 123; Malcolm v. Marathon Oil Co., 642 F.2d 845, 864 (5th Cir.), cert. denied, 454 U.S. 1125, 71 L. Ed. 2d 113, 102 S. Ct. 975 (1981).\n\nOur former Fifth Circuit in Malcolm, recognizing the \"relaxed standard\" in calculating damages in antitrust cases, stated:\n\nThis relaxed standard is based on a recognition of the difficulty in reconstructing events that might have happened but for the defendant's unlawful conduct. It is appropriate that if there is uncertainty, the defendant should bear the burden of that uncertainty because his unlawful actions created it.\n\n642 F.2d at 864. The Eleventh Circuit has adopted the rule set forth in the Malcolm case. See Graphic Products Distributors, Inc. v. Itek Corp., 717 F.2d 1560, 1578-79, 1580 n.38 (11th Cir. 1983).\n\nWe find that the evidence presented by Plaintiff's expert, Mr. Ben Ball, whose testimony we have credited, meets this standard. Mr. Ball presented this Court with a detailed analytical formula which supported his determination of the diminution in Consolidated's going concern value. Ball began by determining the net present value of the cash flow stream generated by each of Consolidated's customers during the relevant time period, subtracted costs which Consolidated would have incurred, and added the present value of customers which Consolidated probably would have obtained in the absence of City Gas' actions. Each of these calculations was based on detailed estimates of costs and revenues which were broken down for each item Ball considered. The six percent annual growth rate, which Ball used to determine what Consolidated's growth would have been, was also supported by the testimony of another expert, Mr. Starke. Finally, Ball's determinations of both Consolidated's actual value and its lost profits were based on the precise amount offered for the company by City Gas and the actual gross revenues collected by City Gas less costs. In sum, we conclude that Ball's testimony amply meets the definiteness standard set forth in this Circuit for proof of antitrust damages.\n\nConsolidated seeks to recover both its lost profits during the period of City Gas' antitrust misconduct and the resulting diminution in the value of the business as a going concern. We find that Consolidated is entitled to recover both of these types of damages. See Eiberger v. Sony Corp. of America, 622 F.2d 1068, 1081 (2d Cir. 1980); Carpa, Inc. v. Ward Foods, Inc., 536 F.2d 39, 51 (5th Cir. 1976), overruled on other grounds, Copper Liquor, Inc. v. Adolph Coors Co., 701 F.2d 542 (5th Cir. 1983); Atlas Building Products Co. v. Diamond Block \u0026 Gravel Co., 269 F.2d 950, 958-59 (10th Cir. 1959), cert. denied, 363 U.S. 843, 4 L. Ed. 2d 1727, 80 S. Ct. 1608 (1960). Additionally, Consolidated is entitled to three times the amount of damages proved. 15 U.S.C. § 15.\n\nLoss of going concern value involves primarily an evaluation of the plaintiff business' loss of good will as a result of the defendant's conduct. The Eleventh Circuit in Graphic Products Distributors, Inc. v. Itek Corp., succinctly stated the manner in which diminution in going concern value is calculated and the method by which it is proved:\n\nProof of the diminution in the going concern value of a business is ascertainable by comparing the fair market value of the business before and after the antitrust violation. See Pollock \u0026 Riley, Inc. v. Pearl Brewing Co., 498 F.2d 1240, 1245 (5th Cir. 1974), cert. denied, 420 U.S. 992, 95 S. Ct. 1427, 43 L. Ed. 2d 673 (1975). Testimony of business appraisal experts as to what a hypothetical willing buyer would pay a hypothetical willing seller on the open market would be one method of establishing loss in going concern value.\n\n717 F.2d 1560, 1580, n.37 (11th Cir. 1983). Moreover, in determining what the value of a business would have been in the absence of an antitrust violation, the \"market share\" theory may be used. This theory involves an estimation of the market share the plaintiff would have had but for the defendant's unlawful conduct. Based on the market size and an estimate of plaintiff's likely profit margin, the total profits the plaintiff would have earned if the estimated market share had been achieved are determined. Zenith Radio Corp. v. Hazeltine Research, Inc., 395 U.S. 100, 116, 23 L. Ed. 2d 129, 89 S. Ct. 1562 (1969). This theory, which takes into account the projected expansion of the plaintiff's business in a market unaffected by the wrongful conduct, serves to compensate the plaintiff not only for the actual customers or business lost to the monopolist but also for the additional business plaintiff would have had but for the defendant's unlawful conduct.\n\nFurthermore, Consolidated may recover both lost past profits for City Gas' unlawful conduct and damages for the resulting diminution in its going concern value. This was made clear by the Tenth Circuit in Atlas Building Products Co. v. Diamond Block \u0026 Gravel Co.:\n\nThe statute speaks of injury to \"business or property.\" And see Section 4 of the Clayton Act, 38 Stat. 731, 15 U.S.C.A. § 15. And, those words in their ordinary sense have been construed in terms of (1) the difference, if any, between the amounts actually realized by the injured party and what it would have reasonably expected to realize from sales but for the unlawful acts complained of; and (2) the extent to which the value of the petitioner's property had been diminished as a result of such acts. We think both loss of profits in business and diminishment of the assets were proper elements of damage, and the trial court did not err in so submitting the case to the jury.\n\n269 F.2d 950, 958-59 (10th Cir. 1959), cert. denied, 363 U.S. 843, 80 S. Ct. 1608, 4 L. Ed. 2d 1727 (1960) (emphasis added) (citations and footnote omitted); accord, Eiberger v. Sony Corp. of America, 622 F.2d 1068, 1081-82 (2d Cir. 1980); Carpa, Inc. v. Ward Foods, Inc., 536 F.2d 39, 51 (5th Cir. 1976), overruled on other grounds, Cooper Liquor, Inc. v. Adolph Coors Co., 701 F.2d 542 (5th Cir. 1983).\n\nConsolidated is entitled to recover damages from February 20, 1982, as that is the date when the Board of Directors of City Gas focused the economic power of City Gas on Consolidated in a resolution authorizing Sid Langer to attempt to acquire Consolidated -- prior to any discussions with Consolidated. Much planning and activity must have occurred prior to this date (the minutes reflect Mr. Langer's report that he was already attempting to acquire Consolidated), but the date of the meeting presents a reasonable starting point, based on solid evidence, for calculating the damages herein. Cf. Hobart Bros. v. Malcolm T. Gilliland, Inc., 471 F.2d 894, 903 (5th Cir.), cert. denied, 412 U.S. 923, 37 L. Ed. 2d 150, 93 S. Ct. 2736 (1973); Zenith Radio Corp. v. Hazeltine Research, Inc., 401 U.S. 321, 339, 28 L. Ed. 2d 77, 91 S. Ct. 795 (1971).\n\nConsequently, we find that, when applying these theories, City Gas' anticompetitive actions were the proximate cause of antitrust damages to Consolidated in the following amounts: (1) $ 1,503,975 -- the difference between (a) Consolidated's market value as a natural gas company selling gas at the same rates charged by City Gas with the growth Consolidated could reasonably have been expected to enjoy and (b) the present market value of Consolidated as a result of the injuries caused by City Gas' actions; plus (2) $ 83,090.15 -- lost profits that Consolidated would have earned from the customers taken by City Gas, calculated at the rates that City Gas charged such customers for natural gas less the costs of the natural gas sold to them. Consolidated is therefore entitled to recover from City Gas the amount of $ 1,587,065.15 trebled, or the total sum of $ 4,761,195.45 in antitrust damages.\n\nWe also find that Consolidated is entitled to injunctive relief. Injunctive relief under § 16 of the Clayton Act (15 U.S.C. § 26) is granted for the purpose of preventing threatened loss or damage by reason of a violation of the federal antitrust laws. Helfenbein v. International Industries, Inc., 438 F.2d 1068, 1071 (8th Cir.), cert. denied, 404 U.S. 872, 30 L. Ed. 2d 115, 92 S. Ct. 63 (1971). In the framing of equitable decrees, the district courts are clothed with broad discretion to model their judgments to fit the exigencies of the particular case. See Allis-Chalmers Manufacturing Co. v. White Consolidated Industries, Inc., 414 F.2d 506, 525 n.32 (3d Cir. 1969), cert. denied, 396 U.S. 1009, 90 S. Ct. 567, 24 L. Ed. 2d 501 (1970). As the court in Bergjans Farm Dairy Co. v. Sanitary Milk Producers stated:\n\nAn injunction in a suit by a private individual cannot correct completely a monopolistic situation caused by the unlawful action of defendants, but should open the market to competition in every way that is appropriate, because it is the purpose of the antitrust laws to prevent the accomplishment of an unlawful result by every means, and not by just the means found unlawful in that particular case.\n\n241 F. Supp. 476, 488 (E.D. Mo. 1965), aff'd, 368 F.2d 679 (8th Cir. 1966).\n\nIn the instant case, Consolidated has asked this Court to require City Gas to sell or transport natural gas to Consolidated at a reasonable price. Because we have found, among other things, that City Gas controls an essential facility, we are compelled to grant this request. There is no adequate remedy at law which would make Consolidated whole. We are not, however, prepared to determine exactly what a reasonable price would be. See, e.g., Byars, 609 F.2d at 863-64. Florida has a regulatory agency to whom we can turn to obviate the problem of judicial price-setting in this regulated industry. Thus, we shall defer to a decision of the FPSC in making this finding. Accordingly, if Consolidated wishes to sell natural gas, which it may purchase from City Gas, the Defendant shall sell or transport natural gas to Consolidated at a reasonable price to be determined by the FPSC.\n\nIV. CITY GAS' COUNTERCLAIM: THE ILLEGAL TYING CLAIM\n\nDefendant/Counterplaintiff City Gas has filed an Amended Counterclaim alleging in three counts that Consolidated violated §§ 1 and 2 of the Sherman Act, and § 3 of the Clayton Act, by tying the sale of homes in the Bel Air/Point Royale Subdivision to the purchase of LP gas from Consolidated. We find that City Gas has failed to sustain its burden as to each of these contentions.\n\nSection 3 of the Clayton Act provides:\n\nSale, etc., on agreement not to use goods of competitor.\n\nIt shall be unlawful for any person engaged in commerce, in the course of such commerce, to lease or make a sale or contract for sale of goods, wares, merchandise, machinery, supplies, or other commodities, whether patented or unpatented, for use, consumption, or resale within the United States . . . or fix a price charged therefor, or discount from, or rebate upon, such price, on the condition, agreement, or understanding that the lessee or purchaser thereof shall not use or deal in the goods, wares, merchandise, machinery, supplies, or other commodities of a competitor or competitors of the lessor or seller, where the effect of such lease, sale, or contract for sale or such condition, agreement, or understanding may be to substantially lessen competition or tend to create a monopoly in any line of commerce.\n\n15 U.S.C. § 14.\n\nA tying arrangement is \"an agreement by a party to sell one product but only on the condition that the buyer also purchases a different (or tied) product, or at least agrees that he will not purchase that product from any other supplier.\" Northern Pacific Railway Co. v. United States, 356 U.S. 1, 5-6, 2 L. Ed. 2d 545, 78 S. Ct. 514 (1958) (footnote omitted). Tying arrangements have been challenged successfully under § 1 of the Sherman Act, § 3 of the Clayton Act, and as conduct supporting a finding that § 2 of the Sherman Act has been violated. Section 3 of the Clayton Act, however, applies only to those arrangements in which both the tying and tied products are \" goods, wares, merchandise, machinery, supplies or other commodities.\" 15 U.S.C. § 14 (emphasis added). Section 3 is by its literal terms limited to a sale, lease or contract of these enumerated items, and articles of the same class and character. A \"commodity\" is thought generally to be tangible personal property, and therefore tying arrangements involving such intangibles as credit, services and trademarks do not fall within the ambit of § 3.\n\nIt is equally clear that land is not a \"commodity\" under the Clayton Act. Fortner Enterprises, Inc. v. United States Steel Corp., 394 U.S. 495, 521, 22 L. Ed. 2d 495, 89 S. Ct. 1252 (1969) (Fortas, J., dissenting) (\"Clayton Act provision applies only to 'goods, wares, merchandise, machinery, supplies, or other commodities,' and not to land.\"); Blackwell v. Power Test Corp., 540 F.Supp 802, 812 (D. N.J. 1981), aff'd, 688 F.2d 818 (3d Cir. 1982); see Gaylord Shops, Inc. v. Pittsburgh Miracle Mile Town \u0026 Country Shopping Center, Inc., 219 F. Supp. 400, 403 (W.D. Pa. 1963). Thus, if the tying arrangement does not involve a commodity, but rather land, services or credit, it is not governed by the Clayton Act at all. It would, however, fall within the scope of the Sherman Act, and the plaintiff would be required \"to bear the additional burden of proving that the defendant's economic power with respect to the tying product is sufficient to produce an appreciable restraint.\" N.W. Controls, Inc. v. Outboard Marine Corp., 333 F. Supp. 493, 500 (D. Del. 1971). Thus, City Gas cannot claim that this tying arrangement violates § 3 of the Clayton Act.\n\nCity Gas has also claimed that §§ 1 and 2 of the Sherman Act were violated by Consolidated's tying arrangement. Section 1 of the Sherman Act provides in pertinent part:\n\nEvery contract, combination in the form of trust or otherwise, or conspiracy, in restraint of trade or commerce among the several States, or with foreign nations, is declared to be illegal.\n\n15 U.S.C. § 1. Of course, not every agreement violates § 1, but rather only those that unreasonably restrict competition. Regardless of the character of the contract, combination, or conspiracy, every § 1 violation requires proof: (1) that a contract, combination or conspiracy between two or more entities was present; (2) that a contract unreasonably restrains trade; and (3) that it affects interstate or foreign commerce. A tying arrangement will violate § 1 if the plaintiff can establish that two separate products are involved; that there is indeed a sale or agreement which has conditioned the sale of one product (the tying product) upon the purchase of another (the tied product); that the seller has engaged in some modicum of coercive conduct toward the buyer; that the seller has sufficient economic power in the market for the tying product to enable it to restrain trade in the tied product market; and, finally, that a not insubstantial amount of commerce in the tied product is affected. Hirsh v. Martindale-Hubbell, Inc., 674 F.2d 1343, 1346-47 (9th Cir.), cert. denied, 459 U.S. 973, 74 L. Ed. 2d 285, 103 S. Ct. 305 (1982).\n\nCity Gas' Sherman Act tying claim must fail first because it has not established that the seller (Consolidated Gas) had sufficient economic power as to the tying product (real estate) to restrain trade appreciably in the market for the tied product. See Kentucky Fried Chicken Corp. v. Diversified Packaging Corp., 549 F.2d 368, 375 (5th Cir. 1977). An analysis of market power as to the tying product and the effect of the wrongful activity must be made in the context of a relevant economic market.\n\nThe Defendant has failed to present sufficient evidence, including economic testimony, to define the relevant product or geographic market for these products. That failure, we think, is fatal as to the tying claim. \"An antitrust plaintiff . . . makes out a prima facie case under the rule of reason only upon 'proof of a well-defined relevant market upon which the challenged anticompetitive actions would have had a substantial impact.'\" Dougherty v. Continental Oil Co., 579 F.2d 954, 962 (5th Cir. 1978), vacated by stipulation of the parties, 591 F.2d 1206 (5th Cir. 1979) (quoting Cornwell Quality Tools Co. v. C.T.S. Co., 446 F.2d 825 (9th Cir. 1971), cert denied, 404 U.S. 1049, 92 S. Ct. 715, 30 L. Ed. 2d 740 (1972)) (additional citations omitted); see also L.A. Draper \u0026 Son v. Wheelabrator-Frye, Inc., 735 F.2d 414, 422 (11th Cir. 1984).\n\nA fair review of the facts presented has not established Consolidated's market power as to the tying product -- real estate. United States v. Loew's, Inc., 371 U.S. 38, 45, 9 L. Ed. 2d 11, 83 S. Ct. 97 (1962). Nor has City Gas fully satisfied its burden -- even assuming it had sufficient market power within a discernible market -- that customers were coerced into buying the tied product. Moreover, a claim of monopolization or attempted monopolization also requires proof that a defendant either possesses or is perilously close to possessing monopoly power within those markets. City Gas has not established either the relevant markets or appreciable or monopoly power within those markets. Without sufficient proof that Consolidated has, within the relevant markets, monopoly power as to its § 2 Sherman Act claim, or appreciable market power as to its § 1 Sherman Act claim, we cannot find any violation of the antitrust laws.\n\nBeyond failing to establish that Consolidated possessed monopoly power or even appreciable market power within definable markets, City Gas has also failed to establish that Consolidated's conduct actually foreclosed City Gas from competing. City Gas claims that \"as a direct and proximate result of the inhibiting, threatening and coercive effect of the exclusivity provisions and restrictive convenants . . . CITY GAS has been precluded by CONSOLIDATED from effectively providing its natural gas product to the subdivision.\" [Amended Counterclaim, para. 10].\n\nDamages may be obtained under § 4 of the Clayton Act by \"any person . . . injured in his business or property by reason of anything forbidden in the antitrust laws.\" 15 U.S.C. § 15. And \"it is enough that the illegality is shown to be a material cause of the injury. . . .\" Zenith Radio Corp. v. Hazeltine Research, Inc., 395 U.S. 100, 114 n.9, 23 L. Ed. 2d 129, 89 S. Ct. 1562 (1969). Nevertheless, City Gas must show some direct causal relationship between the purported violation of the antitrust laws and the injury sustained. Brunswick Corp. v. Pueblo Bowl-O-Mat, Inc., 429 U.S. 477, 489, 50 L. Ed. 2d 701, 97 S. Ct. 690 (1977). And if the wrongful conduct was not the cause of any palpable injury, then no actionable violation of the antitrust law has occurred. Sometimes the issue is framed as one of standing. In this Circuit, the test applied in order to determine standing to sue in an antitrust case has been explained in Amey, Inc. v. Gulf Abstract \u0026 Title, Inc.:\n\nThe Eleventh Circuit has adopted the \"target area\" test used by the Fifth Circuit. See Construction Aggregate Transport, Inc. v. Florida Rock Industries, Inc., 710 F.2d 752, 762 (11th Cir. 1983). The rule of antitrust standing in this circuit, the target area test, does not produce results materially different from the results obtained in Blue Shield and Associated General. See Construction Aggregate Transport, 710 F.2d at 762, 765, n.28. First, as in Blue Shield, we recognize that a \"target\" does not have to be in the same area of the market as the antitrust act; a victim is a target when located in the same area of the market affected by the antitrust act or in another area of the market \"so closely related\" that both may be considered targets of the same anti-competitive act. Construction Aggregate Transport, 710 F.2d at 764; Blue Shield, 457 U.S. at 479-81, 102 S. Ct. at 2548-49. Second, our test is highly responsive to the Supreme Court's policies of denying standing to plaintiffs with injuries that are too remote and whose injuries are not \"the type of loss which a violation of antitrust law would be likely to cause.\" Midwestern Waffles, Inc. v. Waffle House, Inc., 734 F.2d 705, 710 (11th Cir. 1984); Construction Aggregate Transport, 710 F.2d at 764, 765. See Associated General, 459 U.S. at 540, 103 S. Ct. at 910; Blue Shield, 457 U.S. at 479, 102 S. Ct. at 2548. See also Jeffrey v. Southwestern Bell, 518 F.2d 1129, 1131 (5th Cir. 1975). Third, the Supreme Court's policy against granting standing where the possibility exists of duplicative recovery by the indirectly injured plaintiff and the more directly injured person who has yet to sue, see Associated General, 459 U.S. at 545, 103 S. Ct. at 912, Blue Shield, 457 U.S. at 475, 102 S. Ct. at 2546, has long been part of this circuit's and the former Fifth Circuit's target area test. Construction Aggregate Transport, 710 F.2d at 764; Jeffrey v. Southwestern Bell, 518 F.2d at 1131. The Supreme Court cases, therefore, provide policy guidance consistent with that which is the foundation of this circuit's target area test. See Midwestern Waffles, Inc., 734 F.2d at 710. See also Quality Foods de Centro America, S.A. v. Latin American Agribusiness Development Corp., 711 F.2d 989, 999 (11th Cir. 1983).\n\n758 F.2d 1486, 1496-97 (11th Cir. 1985), cert. denied, 475 U.S. 1107, 106 S. Ct. 1513, 89 L. Ed. 2d 912 (1986) (footnote omitted).\n\nPart of the Counterclaim alleges damages for the period of time preceding Consolidated's commencement of the state court action on June 1, 1982; another part relates to the period in which City Gas was preliminarily enjoined from providing natural gas service to customers within the subdivision, that is, from June 16, 1982, through November 30, 1982, when the injunction was dissolved by the state court; and the last part relates to the period after November 30, 1982. During no portion of time can City Gas claim that it sustained injuries as a result of Consolidated's conduct.\n\nIn the first place, the record evidence established that City Gas was not actually precluded from selling or offering to sell gas prior to the date Consolidated filed the state court complaint. City has admitted that it was wholly unaware of the existence of the \"Easement Agreement\" prior to June 1, 1982. Jack Langer of City Gas indicated that no one told him about Consolidated's claim to have any exclusive rights until filing the lawsuit in state court. Nor is there any record evidence suggesting that City Gas made an effort to sell natural gas or to solicit customers prior to approximately February 1982. Indeed, City Gas has stipulated as fact that it did not consider selling natural gas to customers in the territory served by Consolidated until 1982, and that once it decided to do so, it acted immediately to solicit Consolidated's customers and began extending its pipelines accordingly. The evidence also leads us to conclude that City Gas did not consider it economically feasible to extend its pipelines into Consolidated's area until 1982, when it did so. We do not think City Gas can establish on this record that it sustained antitrust injury as a result of conduct about which it knew nothing. In short, City Gas was neither restrained nor deterred in any way by Consolidated's conduct prior to June 1982.\n\nNor, finally, does the record evidence establish that subdivision customers -- and indeed only a small handful of them were called to testify at trial by City Gas -- refrained from turning to City Gas as an alternative source of energy because of the \"Easement Agreement.\" Those customers who did testify indicated that when they changed suppliers they were driven to do so by considerations of price. City Gas has, therefore, presented no evidence that it suffered damages resulting from the \"Easement Agreement\" prior to June 1, 1982.\n\nMoreover, for the period subsequent to November 30, 1982, when the state court preliminary injunction was dissolved, City Gas was in no way foreclosed or excluded from providing natural gas service to homes and businesses within the subdivision. The state court held that City Gas was free to provide natural gas service across Consolidated's easements. And indeed following the dissolution of the injunction, City Gas resumed extending its lines to take customers from Consolidated and continued supplying the ones it had signed up earlier. Thus, City Gas also has failed to show that it suffered any damages subsequent to November 30, 1982.\n\nFinally, as to the period when the injunction was in effect, from June 16, 1982 to November 30, 1982, a clear and unambiguous release was executed by the parties as to any damages which might arguably be attributed to the state suit or the preliminary injunction, thereby releasing Consolidated from any potential liability. The release settled the record as to any \"damages and costs incurred by [City Gas] as a result of the fact the [Consolidated] obtained the issuance of an injunction,\" and the release constituted a \"full settlement and payment for costs and damages incurred by the defendant as a result of this lawsuit.\" City Gas has not argued that the release was invalid for any reason, or that it does not operate to bar any claims for damages in this action for the time period between June 1, 1982 and November 30, 1982. In short, we can find no viable theory upon which City Gas can sustain its burden as to injury and damages during this time frame.\n\nSince we have concluded that City Gas has not established a number of critical elements necessary to sustain any claim under the Sherman Act, this Court need not address Consolidated's contention that the Counterclaims are barred also by the doctrines of res judicata and collateral estoppel.\n\nDONE AND ORDERED in Miami, Florida this 24th day of July, 1987.\n\n\u003cspan class=\"fn\"\u003e1. We also note in passing that Plaintiff presented evidence at trial that Florida's regulatory scheme was incomplete even as to the regulation of rates. Specifically, Plaintiff argued that such regulation is an imperfect constraint on a utility's ability to exploit a monopolistic position, that competition between regulated utilities yields lower prices, and that when rate regulation is the sole limiting factor on the exercise of monopoly power, utilities can earn above normal rates of return. [Tr. 6-253-257]. It is not essential to our holding that we address the crux of Plaintiff's argument, which amounts to a direct challenge to the regulatory process. We do note, however, that this argument was raised and was not controverted by Defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In California Retail Liquor Dealers Association v. Midcal Aluminum, Inc., a wine distributor challenged California's resale price maintenance and price posting statutes for the wholesale wine trade as violative of the Sherman Act. 445 U.S. 97, 99, 100 S. Ct. 937, 63 L. Ed. 2d 233 (1980). The Court stated that its decisions had established two standards for antitrust immunity under Parker v. Brown. \"First, the challenged restraint must be 'one clearly articulated and affirmatively expressed as state policy'; second, the policy must be 'actively supervised' by the State itself.\" Id. at 105 (citation omitted). The Court found that the legislative policy in Midcal Aluminum forthrightly stated its purpose to permit resale price maintenance; accordingly, the first standard had been met. The program, however, did not meet the second requirement for Parker immunity because \"the State simply authorizes price-setting and enforces the prices established by private parties. The State neither establishes prices nor reviews the reasonableness of the price schedules; nor does it regulate the terms of fair trade contracts. The State does not monitor market conditions or engage in any 'pointed reexamination' of the program.\" Id. at 105-06 (footnote omitted). Without such supervision, the Court found that the plan was subject to the antitrust laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In Southern Motor Carriers Rate Conference, Inc. v. United States, the most recent Supreme Court case to address this issue, private carriers formed a rate bureau that submitted joint proposals on rates to state regulatory agencies. 471 U.S. 48, 105 S. Ct. 1721, 85 L. Ed. 2d 36 (1985). State laws permitted joint proposals but did not require them. 471 U.S. at 50. The Supreme Court held that the activity was immune from antitrust attack. Id. at 66. The Court reasoned that Parker did not require compulsion because Parker was an attempt to reconcile state displacement of competition with federal antitrust goals, and requiring compulsion would force a higher degree of state anticompetitive conduct. Id. at 61. Southern Motor Carriers, however, presented the Court with one unusual twist. For although the North Carolina, Georgia and Tennessee statutes expressly permitted collective ratemaking, Mississippi's statutes did not specifically address collective ratemaking. Id. at 63. The Court noted that Mississippi did give its public service commission the authority to regulate common carriers and the power to prescribe just and reasonable rates. From this the Court reasoned as follows: The legislature thus made clear its intent that intrastate rates would be determined by a regulatory agency, rather than by the market. The details of the inherently anticompetitive rate-setting process, however, are left to the agency's discretion. The State Commission has exercised its discretion by actively encouraging collective ratemaking among common carriers. We do not believe that the actions petitioners took pursuant to this regulatory program should be deprived of Parker immunity. Id. at 63-64 (citation omitted). Accordingly, since the proposals were submitted pursuant to statutes which permitted collective ratemaking or pursuant to a statute which clearly articulated the state's intent to displace price competition among carriers with a regulatory structure, the first prong of the Midcal Aluminum test was met. The second prong of the Midcal Aluminum test was conceded. Id. at 66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In Hoover v. Ronwin, an unsuccessful candidate for the bar alleged that the Committee on Examinations and Admissions had set grading criteria to limit the entrance of new attorneys rather than to measure their competence. 466 U.S. 558, 204 S. Ct. 1989, 80 L. Ed. 2d 590 (1984). The Supreme Court held that the action of the Committee was immune because the action of the Committee was that of the state itself. Id. at 570. The Court reasoned that \"although the Arizona Supreme Court necessarily delegated the administration of the admissions process to the Committee, the court itself approved the particular grading formula and retained the sole authority to determine who should be admitted to the practice of law in Arizona.\" Id. at 573. As a result, the Court found it unnecessary to address whether the policy was clearly articulated and affirmatively expressed state action. Id. at 569. The Court further stated that if the same activity had been carried out by private parties pursuant to state authorization, then the two-part Midcal Aluminum test would have been applied to ensure that the conduct was contemplated by the state. Id. at 568-69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In Bates v. State Bar of Arizona, as a part of its regulation of the bar, the Arizona Supreme Court had promulgated a rule against advertising by lawyers. 433 U.S. 350, 97 S. Ct. 2691, 53 L. Ed. 2d 810 (1977). The Supreme Court upheld the rule because it was the \"affirmative command\" of the Arizona Supreme Court which had adopted, supervised and enforced the rule, thereby acting as sovereign. The Court deemed it significant that the \"state policy [was] so clearly and affirmatively expressed and that the State's supervision [was] so active.\" Id. at 362.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In Goldfarb v. Virginia State Bar, a case that involved the publication of a minimum fee schedule for lawyers of that state's bar, the Court found that mere enforcement by the state bar of a county bar association's minimum fee schedule was not the act of the state as sovereign even though the bar was a state agency for some purposes. 421 U.S. 773, 790-91, 95 S. Ct. 2004, 44 L. Ed. 2d 572 (1975). The Court stated that the anticompetitive activities were not \" compelled by direction of the State acting as a sovereign.\" Id. at 791 (emphasis added). The Court looked to state statutes and state supreme court ethical opinions and found no evidence of compulsion. Id. at 790-91. This compulsion requirement was only renounced recently by the Supreme Court in Southern Motor Carriers. Even without the compulsion requirement, however, it has been suggested that the result in Goldfarb would not differ. Southern Motor Carriers Rate Conference, Inc., 471 U.S. at 61. For although the State Bar was empowered to oversee the practice of law, it is unlikely that the state intended price fixing to be one of its specific powers. See Lopatka, State Action and Municipal Antitrust Immunity: An Economic Approach, 53 Fordham L.Rev. 23, 39-40 (1984). Thus, Goldfarb still would not meet the first prong of the Midcal Aluminum test for state action immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In New Motor Vehicle Board v. Orrin W. Fox Co., the Court reviewed a state law (the Automobile Franchise Act) which gave an existing auto dealership the right to petition a state agency if a manufacturer attempted to create a new dealership in the same area. 439 U.S. 96, 99 S. Ct. 403, 58 L. Ed. 2d 361 (1978). The state agency could refuse to allow the new franchise. The Court held that the decisions of the agency were outside the reach of the antitrust laws because the Act's regulatory scheme was \"a system of regulation, clearly articulated and affirmatively expressed, designed to displace unfettered business freedom in the matter of the establishment and relocation of automobile dealerships.\" Id. at 109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Court addressed anticompetitive activity carried out by private parties in Cantor v. Detroit Edison Co., where the Supreme Court held that a public utility's program of distributing free light bulbs to customers was not immune from antitrust attack despite the fact that the program was set forth in a tariff approved by the state. 428 U.S. 579, 96 S. Ct. 3110, 49 L. Ed. 2d 1141 (1976). The Court stated that the state's participation in adopting and implementing the anticompetitive conduct must be dominant in order to immunize such conduct from the Sherman act. In this case there was no statute authorizing the regulation of light bulbs; indeed, there was no evidence of any state policy relating to light bulbs. Id. at 584-85. Therefore, the Court found that this conduct was not immunized from the Sherman Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The relevant portion of Fla. Stat. § 364.335 (1985) provides as follows: Application for certificate. (1) Each application for a certificate shall: (a) Provide all information required by rule or order of the commission, which may include a detailed inquiry into the ability of the applicant to provide service, a detailed inquiry into the territory and facilities involved, and a detailed inquiry into the existence of service from other sources within geographical proximity to the territory applied for. . . . . (4) The commission may grant a certificate, in whole or in part or with modifications in the public interest, but in no event granting authority greater than that requested in the application or amendments thereto and noticed under subsection (1); or it may deny a certificate. The commission shall not grant a certificate for a proposed telephone company, or for the extension of an existing telephone company, which will be in competition with or duplicate the local exchange services provided by any other telephone company unless it first determines that the existing facilities are inadequate to meet the reasonable needs of the public and it first amends the certificate of such other telephone company to remove the basis for competition or duplication of services. The commission may, however, grant such a certificate for a proposed telephone company, which will be providing competitive or duplicative pay telephone service only without determining that existing facilities are inadequate to meet the reasonable needs of the public and without amending the certificate of another telephone company to remove the basis for competition or duplication of services. Pay telephone service shall include that telephone service using telephones that are capable of accepting payment by specie, paper money, or credit cards. Fla. Stat. § 364.337 (1985) provides as follows: Duplicative or competitive services. (1) When the commission grants a certificate to a telephone company for any type of service that is in competition with or that duplicates the services provided by another telephone company, the commission, if it finds that such action is consistent with the public interest, may: (a) Prescribe different requirements for the company than are otherwise prescribed for telephone companies; or (b) Exempt the company from some or all of the requirements of this chapter. (2) In determining whether the actions authorized by subsection (1) are consistent with the public interest, the commission shall consider: (a) The number of firms providing the service; (b) The geographic availability of the service from other firms; (c) The quality of service available from alternative suppliers; (d) The effect on telephone service rates charged to customers of other companies; and (e) Any other factors that the commission considers relevant to the public interest. (3) Each amount paid by an interexchange telephone company to a telephone company providing local service for use of the local network shall be deducted from gross operating revenues for purposes of determining the amount of the regulatory fee assessed the interexchange telephone company pursuant to s. 350.113.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The relevant portion of Fla. Stat. § 367.041 (1985) provides as follows: Application. Each applicant for a certificate shall: (1) Provide information required by rule or order of the commission, which may include a detailed inquiry into the ability of the applicant to provide service, the territory and facilities involved, the need for service in the territory involved, and the existence or non-existence of service from other sources within geographical proximity to the territory applied for; . . . . The relevant portion of Fla. Stat. § 367.051 (1985) provides as follows: Issuance of certificate. . . . . (2) If, within 20 days following the official date of filing, the commission receives from the public counsel or a governmental agency, or from a utility or consumer who would be substantially affected by the requested certification, a written objection requesting a proceeding pursuant to s. 120.57, the commission shall order such proceeding conducted in or near the territory applied for, if feasible. Notwithstanding the ability to object on any other ground, a county or municipal government has standing to object on the ground that the issuance of the certificate will violate established local comprehensive plans developed pursuant to ss. 163.3161-163.3211. If any consumer, utility, or governmental agency or the public counsel requests a public hearing on the application, such hearing shall, if feasible, be held in or near the territory applied for; and the transcript of such hearing and any material submitted at or before the hearing shall be considered as part of the record of the application and any proceeding related thereto. (3)(a) The commission may grant a certificate, in whole or in part or with modifications in the public interest, but may in no event grant authority greater than that requested in the application or amendments thereto and noticed under s. 367.041, or it may deny a certificate. The commission shall not grant a certificate for a proposed system, or for the extension of an existing system, which will be in competition with, or a duplication of, any other system or portion of a system, unless it first determines that such other system or portion thereof is inadequate to meet the reasonable needs of the public or that the person operating the system is unable, refuses, or neglects to provide reasonably adequate service. The relevant portion of Fla. Stat. § 367.055 (1985) provides as follows: Application for deletion of territory. (1) Each applicant for deletion of territory shall: (a) Provide the information required by rule or order of the commission, which may include a detailed inquiry into the ability or lack of ability of the applicant to provide service, the need or lack of need for service in the territory sought to be deleted, and the existence or non-existence of service from other sources within geographical proximity to the territory sought to be deleted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The relevant portion of Fla. Stat. § 366.04 (1985) provides as follows: Jurisdiction. . . . . (d) To approve territorial agreements between and among rural electric cooperatives, municipal electric utilities, and other electric utilities under its jurisdiction. However, nothing in this chapter shall be construed to alter existing territorial agreements as between the parties to such agreements. (e) To resolve any territorial dispute involving service areas between and among rural electric cooperatives, municipal electric utilities, and other electric utilities under its jurisdiction. In resolving territorial disputes, the commission may consider, but not be limited to consideration of, the ability of the utilities to expand services within their own capabilities and the nature of the area involved, including population, the degree of urbanization of the area, its proximity to other urban areas, and the present and reasonably foreseeable future requirements of the area for other utility services.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In Town of Hallie v. City of Eau Claire, plaintiffs claimed that the city was trying to extend its existing sewage treatment monopoly to a monopoly on sewage transportation services. 471 U.S. 34, 105 S. Ct. 1713, 85 L. Ed. 2d 24 (1985). The city relied on a state statute which provided that a municipality may by ordinance fix the limits of its service to unincorporated areas, and shall have no obligation to serve beyond the area so delineated. The Seventh Circuit upheld the city's practices because they were effectuated pursuant to a clearly articulated and affirmatively expressed state policy to displace competition, the first prong of the Midcal Aluminum test. 700 F.2d 376, 384-85 (7th Cir. 1983). The Supreme Court affirmed, but noted that the activities were authorized, but not compelled, by the state, which did not actively supervise them. 471 U.S. at 45-47. The Court held that the first prong of Midcal Aluminum had been met because the statute showed that \"the legislature contemplated the kind of action complained of.\" Id. at 44 (quoting City of Lafayette v. Louisiana Power \u0026 Light Co., 435 U.S. 389, 98 S. Ct. 1123, 55 L. Ed. 2d 364 (1978). The Court thus indicated that the test was one of forseeability by the legislature of the anticompetitive acts that would follow. Id. at 42-44. Additionally, for the first time the Court held that a municipality, unlike a private party, need not satisfy the second Midcal Aluminum prong, because absent a contrary showing, a municipality presumptively acts in the public interest. Id. at 46.\u003c/span\u003e\n\n",
    "body_length": 204141,
    "citedas": [
      "665 F. Supp. 1493"
    ],
    "attorneys": "William J. Dunaj, Esq., Philip A. Allen, III, Esq., Eric D. Isicoff, Esq., Attorneys for Plaintiff, Mershon, Sawyer, et al. , Gary S. Brooks, Esq., Attorney for Defendant, Fine, Jacobson, et al. Marcus, District Judge.",
    "category": [
      "252"
    ],
    "judges": "MARCUS, District Judge",
    "citation_count": 0
  }
}
