{
  "id": "XaROSGYBTlTomsSBwPkI",
  "document": {
    "title": "People v. Rodriguez",
    "full_title": "THE PEOPLE OF THE STATE OF COLORADO v. FRANK D. RODRIGUEZ",
    "jurisdiction": "Supreme Court of Colorado",
    "date": "1990-05-29T00:00:00.000Z",
    "docket": "No. 87SA48",
    "body": "none\n\n[EDIT ]\n\nNo. 87SA48, People v. Rodriguez : Criminal Law -- Death Sentence -- § 16-11-103, 8 C.R.S. (1978 \u0026 1984 Supp.) Closing Arguments -- Penalty Phase Jury Instructions.\n\nThe defendant was convicted of the kidnapping, sexual assault, and first-degree murder of the victim and, pursuant to the jury's verdict at the penalty phase, the district court sentenced the defendant to death. On direct appeal, the supreme court affirmed the judgment and sentence of death.\n\nThe defendant first claimed that the prosecutors' closing arguments at the penalty phase violated his rights under the due process and prohibition against cruel and unusual punishment clauses of the federal and Colorado Constitutions. The supreme court concluded that although some of the prosecutors' comments were improper, the error was harmless beyond a reasonable doubt.\n\nThe defendant also contended that the penalty phase jury instructions led the jurors to believe that they had to unanimously agree on the existence of a mitigating factor before they could consider it. The supreme court held that there was not a reasonable likelihood that the jurors would have interpreted the jury instructions as a whole as foreclosing them from considering mitigating evidence unless they were unanimous.\n\nThe defendant urged and the court agreed that the \"especially heinous, cruel or depraved\" statutory aggravating factor was unconstitutionally vague without a proper limiting instruction. However, the jury found that five other valid statutory aggravating factors existed beyond a reasonable doubt, no evidence was introduced at the penalty phase that would have been excluded if the \"cruel and heinous\" aggravating factor had not been alleged by the prosecution, and the prosecutors did not overly rely or stress that aggravating factor in closing arguments. Thus the inclusion of the \"cruel and heinous\" aggravating factor without a proper limiting instruction was harmless beyond a reasonable doubt.\n\nEven if the prosecutors did stress the invalid aggravating factor, the court concluded that the facts of this case were within the limiting instruction and definition of \"especially heinous, cruel or depraved\" given in People v. Davis, 794 P.2d 159 (Colo. 1990), and that the jury, if properly instructed, would have found the existence of the \"cruel and heinous\" aggravating factor. Any error in failing to give the proper limiting instruction was harmless beyond a reasonable doubt.\n\nNor did the jury instructions violate Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985), by suggesting to the jury that the ultimate decision on the life or death of the defendant rested other than on the jurors themselves.\n\nThe instructions given to the jury were consistent with the capital sentencing statute, § 16-11-103, 8 C.R.S. (1978 \u0026 1984 Supp.), did not foreclose the jury from properly considering the statutory aggravating and mitigating factors, and the trial court did not commit reversible error in refusing the defendant's tendered anti-sympathy instruction or complicity instruction. The instructions as given did not allow the jury to impose death in violation of Enmund v. Florida, 458 U.S. 782, 73 L. Ed. 2d 1140, 102 S. Ct. 3368 (1982), or Tison v. Arizona, 481 U.S. 137, 95 L. Ed. 2d 127, 107 S. Ct. 1676 (1987).\n\nThe court also held that defense counsel's unsworn assertions failed to overcome the presumption that the record prepared by the court reporter correctly reflected the trial proceedings.\n\nFinally, as required by section 16-11-103(7) and C.A.R. 4(e), the supreme court independently reviewed the record and concluded that the record amply supported the jury's determination that death was the appropriate punishment, and that the death sentence was not imposed under the influence of passion, prejudice, or any other arbitrary factor.\n\nAccordingly, the court affirmed the judgment and sentence of death.\n\nThis is a capital case where the jury imposed the death penalty after an extended trial. The defendant, Frank D. Rodriguez, does not seek review of the jury's determination of guilt, but only seeks to set aside the death penalty imposed by the jury. The only issue on appeal is whether errors in the penalty phase of the trial require that the death penalty be set aside and that the defendant be resentenced to life imprisonment. We affirm the judgment and sentence of death.\n\nI\n\nOn November 14, 1984, at about 4:00 p.m., the defendant, his younger brother Chris Rodriguez, and David Martinez and his girlfriend Patricia Thomas, kidnapped Lorraine Martelli as she was walking from her place of work to her Chevrolet Monte Carlo near downtown Denver. The defendant and his compatriots forced the victim into her own car, and the defendant drove away. Over a period of hours, Lorraine Martelli was driven around the Denver area, and as far west as Lookout Mountain, in her automobile. The defendant stopped and purchased beer during the drive with Lorraine Martelli's money.\n\nThe testimony at trial established that Chris Rodriguez sexually assaulted the victim first. Then the defendant raped, beat, and sodomized Lorraine Martelli in the backseat of her Monte Carlo. During the drive, the victim asked what would become of her, and Chris Rodriguez told her that they would probably let her go. The defendant said that she had seen their faces and they had to kill her.\n\nLorraine Martelli was eventually driven to a deserted dead-end near some warehouses in Denver. She tried to plead for her life with Patricia Thomas, but the defendant called her stupid. He then proceeded to stab her approximately twenty-eight times with a folding knife. Some of the knife cuts around her neck were shallow and indicate that it was the killer's intention to torture her before she died.\n\nAfterwards, the defendant and his compatriots placed the victim's body in the trunk of the Monte Carlo and proceeded to drive around town. They drove to a friend's apartment house, where the defendant handed the knife to a two-year-old child. The child's mother took the knife away and ultimately gave it to the police. The defendant then drove away in the Monte Carlo in search of more beer.\n\nThere had been an eyewitness to the victim's abduction, and the Denver police were looking for the Monte Carlo. The police spotted the defendant and gave chase in their vehicles, and later on foot. The defendant, Chris Rodriguez, and the two others were arrested that night.\n\nChris Rodriguez was tried first for the capital murder of Lorraine Martelli, and was sentenced to life imprisonment. People v. Rodriguez, 786 P.2d 472 (Colo. App. 1989). David Martinez pleaded guilty to second-degree kidnapping and received a twenty-year sentence. Patricia Thomas was given immunity in exchange for her testimony for the prosecution. Before the capital murder trial of Frank Rodriguez commenced, it was the subject of an original proceeding which reviewed a number of pretrial motions. Rodriguez v. District Court, 719 P.2d 699 (Colo. 1986). A substantial number of other motions were addressed by this court prior to the announcement of this opinion.\n\nThe defendant's capital murder trial began on November 21, 1986 with jury selection. The jury was sworn on December 2, 1986 and the guilt phase commenced. Among other evidence of the defendant's guilt, Patricia Thomas testified that the defendant raped and sodomized the victim, and then killed her. The prosecution also introduced letters written by the defendant while he was in jail awaiting trial to his girlfriend Margie Marquez, another prisoner at the jail. In the letters the defendant admitted that he killed Lorraine Martelli.\n\nThe defense position at trial, during both the guilt and sentencing phases of the trial, was that the circumstantial evidence made it likely that David Martinez, not the defendant, was the actual killer. Through Marquez defense counsel attempted to establish that the defendant wrote the letters to her for the express purpose of having the letters turned over to the district attorney, so that she could seek reduction of the charges which had been made against her.\n\nThe jury retired to deliberate in the guilt phase on December 11, 1986 and returned with guilty verdicts on December 12, 1986. The jury found the defendant guilty of first-degree murder after deliberation, § 18-3-102(1)(a), 8B C.R.S. (1986), and first-degree felony murder, § 18-3-102(1)(b). The jury also found the defendant guilty of seven other felonies.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe capital sentencing phase began on December 15, 1986. The capital sentencing statute in effect on the date of the offense, November 14, 1984, was section 16-11-103, 8 C.R.S. (1978 \u0026 1984 Supp.). The relevant parts of the statute are set out in Appendix A to this opinion. Unless otherwise noted, references to section 16-11-103 are to the 1984 version of the statute.\n\nIn addition to the evidence adduced at the guilt phase, the prosecution introduced evidence that the defendant and his brother Chris Rodriguez raped and sodomized a woman in 1978, which resulted in a substantial term in prison for the defendant. The testimony showed that the defendant and his brother considered killing the victim in 1978. The defendant was in favor of killing her because the victim could identify them, but Chris Rodriguez just wanted to drop her off, and the defendant acquiesced.\n\nThe prosecution also called George Stapleton to testify that the defendant shot him at point blank range while Stapleton sat in his car ten days before Lorraine Martelli was murdered. The court permitted the introduction of these prior criminal episodes for the sole purpose of establishing that the defendant killed Lorraine Martelli to prevent her from being a witness against him, a statutory aggravating factor. The defendant introduced evidence in mitigation at the trial, including a document called \"Frank Rodriguez -- A Life History,\" that detailed the defendant's unhappy childhood and his growing up in a poor broken family.\n\nAfter lengthy deliberation, the jury found that six statutory aggravating factors existed beyond a reasonable doubt, and that the mitigating factors did not outweigh the aggravating factors. The jury concluded that death was the appropriate punishment, and the trial court sentenced the defendant to death. The death sentence was stayed pending appeal, which is a direct appeal by the defendant from the sentencing phase, and an automatic appeal of the death sentence under section 16-11-103(7) and C.A.R. 4(e).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nOn this appeal, the defendant has been assisted by counsel who has asserted a myriad of reasons for setting aside the death penalty. The errors alleged on appeal question the conduct of the trial court and openly charge the prosecution with conduct that was overzealous and resulted in the denial of the defendant's rights to due process and a fair trial. Defense counsel, in multiple appearances on behalf of the defendant in both the trial court and on appeal, has asserted grounds to delay the resolution of this case by filing numerous requests for extensions of time and only filed a partial opening brief when we refused to grant defense counsel additional time to prepare a brief. C.A.R. 31(a) provides for forty days to file an opening brief after the record is filed. In addition to a number of extensions of time to file the record and supplement the record, defense counsel was granted four extensions to file an opening brief. Defense counsel filed a 138 page so-called partial opening brief with a protest that a complete brief could not be filed unless additional time was granted. Defense counsel's opening brief was filed nearly two years after the case was docketed in this court. The prosecution's answer brief encompassed 104 pages, and the defendant's \"partial\" reply brief was 93 pages in length.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nSubsequently, defense counsel attempted to file an additional brief and has now set forth a number of additional grounds for reversal.\n\nEvery case should be determined on appeal within a reasonable time. A defendant is entitled to a fair trial, but not a perfect trial. The record in this case encompasses more than forty volumes. The trial extended over three weeks. Defense counsel has claimed that a number of rights guaranteed to the defendant by the United States and Colorado Constitutions have been violated. Accordingly, we address the issues that have been preserved for appeal at some length.\n\nII\n\nA\n\nThe defendant contends that the closing arguments of the prosecutors during the penalty phase of the trial violated the Due Process Clauses of the federal and Colorado Constitutions,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e the constitutional right to trial by jury,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and the prohibition against cruel and unusual punishment.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In particular, he refers to twenty-three separate instances of alleged improper argument by the prosecutors during closing arguments in the sentencing phase of the trial. The defendant did not make contemporaneous objections to the majority of the arguments he now claims constitute reversible error. When there is no objection to a prosecutor's argument, this court normally reviews the argument under the \"plain error\" standard. Crim. P. 52(b) states that \"[p]lain errors or defects affecting substantial rights may be noticed although they were not brought to the attention of the court.\" In the context of a prosecutor's closing argument, we have stated that\n\nan error or defect in trial proceedings to which an accused fails to make a contemporaneous objection will not be the basis for reversal unless it casts serious doubt upon the basic fairness of the trial itself. . . . [W]e believe the appropriate standard for plain-error review is whether an appellate court, after reviewing the entire record, can say with fair assurance that the error so undermined the fundamental fairness of the trial itself as to cast serious doubt on the reliability of the judgment of conviction.\n\nWilson v. People, 743 P.2d 415, 419-20 (Colo. 1987). \"[L]ack of an objection is a factor to be considered in examining the impact of a prosecutor's closing argument. . . . The lack of an objection may demonstrate defense counsel's belief that the live argument, despite its appearance in a cold record, was not overly damaging.\" Brooks v. Kemp, 762 F.2d 1383, 1397 n.19 (11th Cir. 1985) (en banc), vacated on other grounds, 478 U.S. 1016, 106 S. Ct. 3325, 92 L. Ed. 2d 732 (1986), reinstated, 809 F.2d 700 (11th Cir.), cert. denied, 483 U.S. 1010, 107 S. Ct. 3240, 97 L. Ed. 2d 744 (1987).\n\nThis is a capital case in which the defendant was sentenced to death. Because death is a punishment qualitatively unlike any other, Lockett v. Ohio, 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978); People v. District Court, 196 Colo. 401, 404, 586 P.2d 31, 33 (1978), and there is a corresponding need for reliability in the sentencing proceeding, People v. Tenneson, 788 P.2d 786, slip op. at 8, 9 \u0026 n.7 (Colo. 1990), we have elected to examine the record of the closing arguments as if there had been contemporaneous objections.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe twenty-three allegedly improper prosecutorial arguments fall within nine general categories: (1) a request that members of the jury place themselves in the victim's shoes; (2) sympathy for the victim and the victim's family; (3) the future dangerousness of the defendant; (4) the jury as the representative of the community, and placing the imprimatur of the state on the death sentence in this case; (5) the injection of the prosecutor's personal belief and superior knowledge; (6) derogatory references to the defendant; (7) misstatements of the law and instructions; (8) the argument that the death penalty is cheaper than life imprisonment; and (9) miscellaneous appeals to irrelevant factors and emotion.\n\nIt has long been recognized that misconduct by a prosecuting attorney in closing argument may be grounds for reversing a conviction. Berger v. United States, 295 U.S. 78, 55 S. Ct. 629, 79 L. Ed. 1314 (1934). Part of this recognition stems from a systemic belief that a prosecutor, while an advocate, is also a public servant \"whose interest, therefore, in a criminal prosecution is not that it shall win a case, but that justice shall be done.\" 295 U.S. at 88, 55 S. Ct. at 633.\n\nBeyond a concern with the inherent role of the prosecuting attorney, courts have also noted that prosecutorial misconduct is particularly dangerous because of its likely influence on the jury. . . .\n\nThus our review of alleged errors in argument must be informed by an awareness that the prosecutorial mantle of authority can intensify the effect on the jury of any misconduct.\n\nBrooks v. Kemp, 762 F.2d at 1399.\n\nCases addressing the propriety of prosecutorial argument in the guilt phase of a criminal trial are plentiful. A capital sentencing procedure is sui generis, however, and we must take into account the special characteristics of the Colorado sentencing scheme when we determine the scope of permissible closing argument. See Coleman v. Brown, 802 F.2d 1227, 1239 (10th Cir. 1986), cert. denied, 482 U.S. 909, 96 L. Ed. 2d 383, 107 S. Ct. 2491 (1987); Brooks v. Kemp, 762 F.2d at 1403.\n\nColorado has a Gregg-type death penalty statute. See Gregg v. Georgia, 428 U.S. 153, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976). It provides for a separate sentencing phase by the jury. The prosecution must prove at least one aggravating factor beyond a reasonable doubt, and the jury makes the ultimate individualized decision on whether death is the appropriate penalty. The statute mandates review of the sentencing procedure in the supreme court. A detailed discussion of the workings of the death penalty statute applicable to this case is contained in People v. Tenneson, No. 88SA144.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIn Colorado unlike the Georgia statute in Gregg, after finding a statutory aggravating factor, the jury may weigh only the statutory aggravating factor or factors found against all mitigating factors found. § 16-11-103(2)(a)(II), (III); see also Barclay v. Florida, 463 U.S. 939, 954, 77 L. Ed. 2d 1134, 103 S. Ct. 3418 (1983) (\"Unlike the Georgia statute, however, Florida law requires the sentencer to balance statutory aggravating circumstances against all mitigating circumstances and does not permit nonstatutory aggravating circumstances to enter into this weighing process.\"). With these general contours of the Colorado statute in mind, we now turn to a discussion of the individual alleged errors in the closing argument of the penalty phase.\n\nB\n\nThe defendant complains that the prosecutor's invitation for the jury members to imagine themselves in the place of the victim, Lorraine Martelli, was improper. The prosecutor stated:\n\nThe people submit that there can be no doubt now, no doubt whatsoever that it was this defendant; it was this defendant who raped and brutalized the anus of Lorraine Martelli. Can you imagine being anally raped by this defendant?\n\nI am not just talking to the women on this jury. I am talking to everybody on the jury.\n\nThe \"golden rule\" argument, as defense counsel claims, is improper in a civil case, e.g., Adkins v. Aluminum Co. of America, 110 Wash. 2d 128, 139-43, 750 P.2d 1257, (1988), and in criminal cases in contexts other than capital sentencing, e.g., United States v. Gaspard, 744 F.2d 438, 441 n.5 (5th Cir. 1984), cert. denied, 469 U.S. 1217, 84 L. Ed. 2d 341, 105 S. Ct. 1197 (1985).\n\nIn a capital sentencing proceeding, however, there are different, unique considerations and it is not necessarily improper for the prosecutor to urge the jurors to place themselves in the victim's shoes. See People v. Haskett, 30 Cal. 3d 841, , 640 P.2d 776, 790, 180 Cal. Rptr. 640, , (1982); State v. Moore, 432 So. 2d 209, 222 (La.), cert. denied, 464 U.S. 986, 78 L. Ed. 2d 367, 104 S. Ct. 435 (1983); State v. Rice, 110 Wash. 2d 577, 606-09, 757 P.2d 889, 905-06 (1988), cert. denied, 491 U.S. 910, 109 S. Ct. 3200, 105 L. Ed. 2d 707 (1989).\n\nIn the instant case, the jury was required to weigh the aggravating factors found against the mitigating circumstances. Even if the jury concluded that the mitigating factors did not outweigh the aggravating factors, the jury was required to make a factual and moral assessment of whether death was the appropriate punishment for the offense. Tenneson, No. 88SA144, slip op. at 8; Haskett, 30 Cal. 3d at , 640 P.2d at 790, 180 Cal. Rptr. at . In making these decisions, we believe that it is proper for the jury to consider the circumstances of the offense itself. In order to do so, it is germane for the jury to make the assessment from the viewpoint of the victim herself. Haskett, 30 Cal. 3d at , 640 P.2d at 790, 180 Cal. Rptr. at . As the Washington Supreme Court stated:\n\nIn the death penalty phase, the jury is not deciding an issue of guilt or innocence, but instead is deciding a sentencing issue. The jury does not decide if the elements of the crime are met, but rather weighs the nature of the criminal acts against any mitigating factors. The jury should be allowed to consider, as part of that analysis, the crime's impact on the victims, and argument on that topic is proper to the extent that it is restricted to the circumstances of the crime.\n\nRice, 110 Wash. 2d at 607, 757 P.2d at 906. In this case, no part of the argument related to impact on the victim, apart from the acts committed and known to the defendant. Cf. South Carolina v. Gathers, 490 U.S. 805, 109 S. Ct. 2207, 104 L. Ed. 2d 876 (1989). As long as the argument does not bring in extrinsic matters, is confined to evidence adduced during the trial and reasonable inferences therefrom, and is not presented in an inflammatory manner, it is not objectionable. Haskett, 30 Cal. 3d at , 640 P.2d at 790, 180 Cal. Rptr. at ; Rice, 110 Wash. 2d at 608, 757 P.2d at 906.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFirst-degree sexual assault of the victim is a statutory aggravating factor, § 16-11-103(6)(g). If the jury found the existence of that aggravating factor beyond a reasonable doubt, a finding clearly supported by the evidence,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e that factor would be weighed against any mitigating factors found. The circumstances of the sexual assault were relevant to the weight to be accorded by the jury to that aggravating factor. Thus, the prosecutor's argument inviting the jury to imagine themselves in the victim's place during the sexual assault was germane and was confined to the evidence brought out at trial. In our view, the argument was not impermissibly inflammatory when viewed in the context of the argument as a whole and the extremely aggravated circumstances of the criminal episode.\n\nC\n\nThe defendant contends that the prosecutors improperly attempted to inflame the emotions of the jury by asking them to consider the feelings of the victim's family and extend sympathy to the victim, in violation of Booth v. Maryland, 482 U.S. 496, 96 L. Ed. 2d 440, 107 S. Ct. 2529 (1987). In particular, he complains of the following statements of the prosecutors:\n\nObviously, this decision is a very important matter. It's important to everybody in this courtroom. It's important to nearly everybody in this community and it's important to you twelve people.\n\nIt's a difficult decision. I don't want to minimize it for you. It may not be a difficult decision for these people in the audience, but it is for you because --\n\n[Defense Counsel]: Objection, judge. I have to object to that. It's improper, when we refer to the audience making a decision in this case.\n\n[Prosecutor]: It's not, Your Honor.\n\nThe Court: You're saying it maybe [sic] easy for someone who is not on the jury. I don't see why you're objecting to that.\n\n[Defense Counsel]: He is appealing to the community again and I object to it.\n\nThe Court: Overruled.\n\nRead in context, and as reasonably construed by the trial judge, these statements served to remind the jurors of their \"awesome responsibility,\" Caldwell v. Mississippi, 472 U.S. 320, 341, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985), in reaching a decision on life or death. We do not believe that the jury would have reasonably interpreted the comments as an improper reference to the wishes of the victim's family. As the Supreme Court has stated in a similar context:\n\nIsolated passages of a prosecutor's argument, billed in advance to the jury as a matter of opinion not of evidence, do not reach the same proportions. Such arguments, like all closing arguments of counsel, are seldom carefully constructed in toto before the event; improvisation frequently results in syntax left imperfect and meaning less than crystal clear. While these general observations in no way justify prosecutorial misconduct, they do suggest that a court should not lightly infer that a prosecutor intends an ambiguous remark to have its most damaging meaning or that a jury, sitting through lengthy exhortation, will draw that meaning from the plethora of less damaging interpretations.\n\nDonnelly v. DeChristoforo, 416 U.S. 637, 646-47, 94 S. Ct. 1868, 40 L. Ed. 2d 431 (1974).\n\nThe defendant also complains of the following statements during closing argument:\n\nShe had no chance to say 'good-bye\" to her loved ones and her loved ones had no chance to say \"good-by\" to her.\n\nIn his rebuttal during closing argument, the prosecutor told the jury:\n\nLadies and gentlemen, next Saturday will be Lorraine Martelli's birthday; her birthday. She won't be here to celebrate that birthday. Contrast Lorraine Martelli's fate with that of the defendant's if you are to determine that he should spend a life sentence in the penitentiary.\n\nLorraine Martelli will not ever be able to write letters to anyone, much less her blood family. Her family will never be able to write to her. She won't have a group of peers to hang out with. She won't even be able to go to work at the House of Glass. She will never see television again.\n\nPlaced within the context of the entire trial, these comments were not objectionable. A prosecutor may argue the facts in evidence and reasonable inferences from those facts. People v. Moody, 676 P.2d 691, 697 (Colo. 1984); see I ABA Standards for Criminal Justice 3.5-8(a) (2d ed. 1980). These comments did not go outside of those limits. The jury knew of the victim's family because they were called to testify during the guilt phase of the trial. The victim's employer also testified that Lorraine Martelli was kidnapped as she was leaving work. The remainder of the statements were mainly in response to defense counsel's arguments regarding the severity of life imprisonment, and compared the victim's fate with that of the defendant. As such, they were permissible comment by the prosecuting attorney \"for or against a sentence of death,\" § 16-11-103(1)(b), and were relevant to the jury's decision on the appropriate penalty, § 16-11-103(2)(a)(II), (III).\n\nIn Booth v. Maryland, 482 U.S. 496, 96 L. Ed. 2d 440, 107 S. Ct. 2529, the Court held that the introduction of a \"victim impact statement,\" that detailed the emotional impact on the victims' family resulting from the victims' killing, and contained descriptions of the personal characteristics of the victims unknown to the defendant, was irrelevant to the proper considerations of a capital sentencing proceeding. Id. at 505-09. It created an unacceptable risk that the death penalty would be imposed in an arbitrary and capricious manner in violation of the eighth amendment. Id. at 505.\n\nIn contrast, the comments of the prosecutors in this case did not draw the jury's attention to any impermissible impact on the family, or personal characteristics of the victim unknown to the defendant and irrelevant to capital sentencing. Nor did the prosecutors' statements involving the victim herself violate South Carolina v. Gathers, 490 U.S. 805, 109 S. Ct. 2207, 104 L. Ed. 2d 876 (1989).\n\nIn Gathers, the prosecuting attorney in closing argument in a capital sentencing proceeding referred to certain personal characteristics of the murder victim inferred from materials the victim was carrying when he was killed. The materials were unknown to the defendant, and hence unrelated to the defendant's blameworthiness. Id. at 2210-11. The prosecutors' arguments here did not suffer from such infirmity, and were not improper.\n\nD\n\nThe argument that the defendant might some day escape from prison was not impermissible. It went to the issue of future dangerousness, and whether the defendant would pose a continuing threat to society, which the prosecutor correctly anticipated the defense would argue was a mitigating circumstance since the defendant would be in prison for life. It is a statutory mitigating factor that the defendant would not pose a continuing threat to society. § 16-11-103(5)(k). The prosecutor's reference to future dangerousness, i.e., the absence of a statutory mitigating factor, did not inject a nonstatutory aggravating factor into the proceedings. People v. Saathoff, 790 P.2d 804, slip op. at 5-6 (Colo. Apr. 16, 1990) (evidence of the non-existence of statutory mitigating factor admissible in prosecution's case-in-chief in capital sentencing proceeding); see also Campbell v. Kincheloe, 829 F.2d 1453, 1458 (9th Cir. 1987), cert. denied, 488 U.S. 948, 109 S. Ct. 380, 102 L. Ed. 2d 369 (1988).\n\nWhile it is true that there was no evidence before the jury on the probability of escape, \"the fact that escape is a possibility was within the common public knowledge,\" Brooks v. Kemp, 762 F.2d at 1411 n.46, and thus the prosecutor's argument was not impermissible. See also People v. Strozzi, 712 P.2d 1100, 1104 (Colo. App. 1985), cert. denied, 476 U.S. 1105, 106 S. Ct. 1950, 90 L. Ed. 2d 359 (1986).\n\nNor was it error to argue about the safety of prisoners and guards at the prison if the defendant is given life. \"This argument was an appropriate means of pointing out the possibility of [the defendant's] future dangerousness and did not call for a speculative inquiry into prison conditions. See Brooks v. Kemp, 762 F.2d at 1411; see also California v. Ramos, 463 U.S. 992, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983).\" Tucker (William) v. Kemp, 762 F.2d 1480, 1486 (11th Cir. 1985) (en banc), vacated, 474 U.S. 1001, 106 S. Ct. 517, 88 L. Ed. 2d 452 (1985), aff'd, 802 F.2d 1293 (11th Cir. 1986), cert. denied, 480 U.S. 911, 107 S. Ct. 1359, 94 L. Ed. 2d 529 (1987); see also Tucker (Richard) v. Kemp, 762 F.2d 1496, 1507 (11th Cir. 1985) (en banc), cert. denied, 478 U.S. 1022, 92 L. Ed. 2d 743, 106 S. Ct. 3340 (1986).\n\nE\n\nIt is impermissible to deliver arguments \"wrapped in the cloak of state authority,\" Drake v. Kemp, 762 F.2d 1449, 1459 (11th Cir. 1985) (en banc) (prosecutor's reading to jury from two Georgia Supreme Court cases on the death penalty during capital sentencing phase was improper, especially where jury was not told the cases were 100 years old), cert. denied, 478 U.S. 1020, 92 L. Ed. 2d 738, 106 S. Ct. 3333 (1986), so as to lead the jury to believe that the General Assembly requires death as the punishment in a particular case. We do not, however, read the prosecutor's argument that broadly and do not conclude that the jury interpreted it in the way urged by the defendant. The prosecutor stated:\n\nAs you can all plainly see, I have a big, blue book in my hand. This big blue book is very important to district attorneys, and defense attorneys throughout the State of Colorado. In it are the criminal laws, the criminal statutes, the criminal rules of this state; the state we all live in. This is the law of the State of Colorado.\n\nInside this book on page 140 is a statute; a law passed by our elected officials. That makes clear that it provides for the death penalty. Colorado has a death penalty. The instructions the judge just read to you come from this book here.\n\nAs jurors you have a sworn duty to follow the law. The People urge you; the People implore you; the People cannot tell you strongly enough, follow the law. The law tells you the factors to look at; look at them. Follow the law. Don't make up your own rules; go by the book; go by this book right here.\n\nIf you do that you will see that on page 140 it is this defendant that is exactly the sort of person they're talking about as being appropriate for the death penalty.\n\n(Emphasis added.) We have previously held that it is improper for counsel to misstate or misinterpret the law during closing argument. People v. Sepeda, 196 Colo. 13, 25, 581 P.2d 723, 732 (1978). Moreover, an attorney may not usurp the trial court's duty and authority to instruct the jury on the law, People v. Alvarez, 187 Colo. 290, 292, 530 P.2d 506, 507 (1975), but that error did not occur in this case. The prosecuting attorney did not attempt to read from the book he was holding, and he did refer to the law as contained in the judge's instructions.\n\nMore serious, however, is the defendant's contention that the prosecutor was telling the jury that the General Assembly had somehow decided that the death penalty was appropriate for this particular defendant. If the comments could reasonably be interpreted in that way, they would reflect prosecutorial misconduct. Drake v. Kemp, 762 F.2d at 1459. We do not believe, however, that the jury would have interpreted the prosecutor's statement in so literal and unreasonable a fashion. See Donnelly v. DeChristoforo, 416 U.S. at 646-47. Although we do not regard this particular argument as a model, and we discourage its use, we conclude that it did not constitute reversible error under the facts of this case.\n\nThe defendant also objects to references by the prosecutors to the jury as the representatives or conscience of the community, and that the jury was the last fall-back of a free society. In other contexts, we have held that prosecutors should not appeal to the jury to consider the wishes of the community in reaching a verdict, e.g., Wilson v. People, 743 P.2d 415, 420 n.8 (Colo. 1987).\n\nHowever, because the considerations inherent in a capital sentencing proceeding are unique, we have concluded that such comments do not constitute reversible error in this case. See People v. Davis, 794 P.2d 159, slip op. at 85 (Colo. 1990) (relying on Booth, 482 U.S. at 504, for the proposition that a capital sentencing jury's function is to \"express the conscience of the community on the ultimate question of life or death.\").\n\nF\n\nThe defendant argues that the prosecutor improperly injected his own beliefs and opinions into the proceeding by the following statements during closing argument:\n\nIt's a very rare combination of a crime and a defendant that satisfies so many of the statutory criteria.\n\n[Defense counsel]: Objection, judge, to any comparison to this to other cases.\n\nThe Court: Overruled. Let Mr. Silverman finish his argument.\n\nThis sort of conduct is rarely seen in Colorado, but we have seen it here; all sorts of things that make the crime worse than your average first-degree murder. There are other things; this defendant's terribly extensive and violent background make him far worse than your typical cold-blooded killer.\n\nA prosecutor may not tell the jury that of all the cases that have come before him, this is one of the very worst; such an argument is irrelevant and has the possibility of being unfairly prejudicial. Tucker (William) v. Kemp, 762 F.2d 1480, 1484 (11th Cir.) (en banc), vacated, 474 U.S. 1001, 106 S. Ct. 517, 88 L. Ed. 2d 452 (1985), aff'd, 802 F.2d 1293 (11th Cir. 1986), cert. denied, 480 U.S. 911, 107 S. Ct. 1359, 94 L. Ed. 2d 529 (1987). See also Wilson v. People, 743 P.2d at 418-19.\n\nWhile the prosecutor in this case did not refer to his opinions and superior personal knowledge in the first-person, we conclude that the argument was objectionable, but did not by itself rise to the level of reversible error. We consider whether this argument, in conjunction with other improper prosecutorial arguments, requires reversal in Part II K below.\n\nG\n\nThe defendant complains that the prosecutor urged the jury to ignore the defendant's basic humanity in the following comments:\n\nNow, I know there were a lot of other letters in Defendant's Exhibit 20. If anyone of you has a reasonable doubt as to the appropriateness of death in this case, I urge you, I ask you to read those letters. Read all of those letters; get a taste for who this defendant is. See how warped and evil and perverted this defendant is.\n\nThis defendant has chosen to be evil. This defendant loves human suffering. It appears he always has, but the thing is it's escalated. It's escalated so much, ladies and gentlemen, year after year after year to what we see now is totally beyond redemption. Every so often in his adult life this defendant has been on a leash on the streets of Denver.\n\nYou know, putting someone to death is certainly not a pleasant proposition. This defendant is a failure to society; he is a failure for himself. The defendant is not a young man. The defendant is set in his ways and his way is evil.\n\nThis defendant's conduct cannot be tolerated anywhere on this planet; not among us, not in jail, not anywhere. This defendant has proven that he lacks any humanity. There is not even a spark of redeeming feature for this defendant. This defendant does not have that spark of humanity we all must have to live.\n\nStudy the words the defendant. Study his letters. Look at the lack of respect he has for everything and everyone but himself. This defendant is rotten through and through. Read the letters.\n\nWe conclude that the prosecutor's descriptions of the defendant were part of an argument to the jury about the unlikelihood of rehabilitation, and the defendant's \"lack of mercy and danger to society, were supported by the evidence and not improper.\" Tucker (Richard) v. Kemp, 762 F.2d 1496, 1507 (11th Cir. 1985) (en banc), cert. denied, 478 U.S. 1022, 92 L. Ed. 2d 743, 106 S. Ct. 3340 (1986). We find no reversible error in these comments.\n\nH\n\nThe defendant also contends that the prosecutors during closing argument misstated the law. First, the prosecutor told the jurors that in the sentencing phase of a capital trial, the normal rules of evidence, and especially the rule against hearsay, are relaxed. Thus the defendant's exhibit entitled \"Frank Rodriguez -- A Life History,\" should be evaluated by the jurors keeping in mind that it contained hearsay and was not subject to cross-examination. The question of whether the rules of evidence are in fact \"relaxed\" at the sentencing phase of a capital trial is not before us, and we express no opinion thereon. The prosecutor's statement was essentially accurate with respect to the mitigating evidence introduced by the defendant, however, and we conclude that the comment did not constitute reversible error.\n\nIt was also not reversible error for the prosecutor to ask rhetorically whether the defendant was cruel, heinous, or depraved. We conclude below that the statutory aggravating factor upon which this question was based is invalid, but its inclusion was harmless beyond a reasonable doubt. Similarly, this comment was harmless beyond a reasonable doubt.\n\nI\n\nOn the other hand, it was improper to argue that it is cheaper to execute a defendant than to keep him or her in prison for the rest of their life. There was no support in the record for such an assertion, nor was it a legitimate factor for the jury to consider. Gregg v. Georgia, 428 U.S. 153, 183-87, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976); Tucker (William) v. Kemp, 762 F.2d at 1486; Brooks v. Kemp, 762 F.2d at 1412. We consider the effect of this improper argument in Part II K below.\n\nJ\n\nThe defendant contends that the prosecutor told the jury to base its decision \"on inflamed emotions of fear and sympathy, not on facts or the constitutionally and statutorily-mandated criteria.\" The contention is based on statements made by the prosecutor in closing argument on rebuttal regarding the fact that the victim would not be around to celebrate her birthday anymore; that she would be unable to write letters to her family or anyone else; that she would never view television again; and that she would never go to work again. The prosecutor continued:\n\nCounsel for the defendant would like to dismiss these thoughts because they don't serve the defendant well, because a jury thinking those types of thoughts might just start putting them in when you start to weigh these aggravating factors in making a just determination under the law, so let's dismiss those.\n\nLet's just weigh that off; forget about Lorraine. This terrible thing is conceded; don't be emotional and don't be upset; don't be the conscience of the community; don't be a jury.\n\nYou know, as I look at you through my blood-shot eyes, I know this is not a jury of twelve computers, but twelve human beings who do have feelings about these things, and that's why we use citizens and not computers, and that's why that's okay, because justice is the product we manufacture in this courtroom, and that's what we're here for.\n\nWe do not believe that the jury would interpret these remarks in a manner contrary to the trial court's instructions or in violation of their duty as jurors. We find no reversible error.\n\nIn his brief the defendant cites numerous other examples of alleged improper appeals to prejudice and sympathy by the prosecutors. We conclude that none of these additional arguments or comments warrant reversal.\n\nK\n\nThe statements by the prosecutor based on his personal beliefs and superior knowledge were improper. See Part II F above. In addition, the argument that it was cheaper to execute the defendant than to keep him in prison for life was erroneous. See Part II I above. Reading the closing arguments as a whole, and mindful of the circumstances of the crime itself as revealed by the evidence before the jury during the trial, we are confident that their inclusion in the closing argument could not have affected the result in this case. We conclude that the errors in the arguments were harmless beyond a reasonable doubt. Chapman v. California, 386 U.S. 18, 24, 17 L. Ed. 2d 705, 87 S. Ct. 824 (1966).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIII\n\nThe defendant contends that his sentence violates the due process and prohibition against cruel and unusual punishment provisions of the federal and state Constitutions because the jury instructions led the jurors to believe that they had to unanimously agree on a mitigating factor before giving it any effect. Appendix B to this opinion contains the relevant instructions given at the sentencing phase. If true, the sentencing proceeding violated the eighth amendment because it did not permit the jurors to give effect to all relevant mitigating evidence. McKoy v. North Carolina, 494 U.S. 433, 110 S. Ct. 1227, 1233, 108 L. Ed. 2d 369 (1990); Mills v. Maryland, 486 U.S. 367, 384, 100 L. Ed. 2d 384, 108 S. Ct. 1860 (1988).\n\nUnder our decisions, it is not relevant whether the barrier to the sentencer's consideration of all mitigating evidence is interposed by statute, Lockett v. Ohio, supra, Hitchcock v. Dugger, 481 U.S. 393, 95 L. Ed. 2d 347, 107 S. Ct. 1821 (1987); by the sentencing court, Eddings v. Oklahoma, supra ; or by an evidentiary ruling, Skipper v. South Carolina, supra. The same must be true with respect to a single juror's holdout vote against finding the presence of a mitigating circumstance.\n\nId. at 375. The constitutional problem with instructing the jury that it must be unanimous with respect to a mitigating factor was illustrated by the Court with two hypothetical situations. In the \"hold-out\" juror hypothetical, all but one of the jurors are convinced that six relevant mitigating factors exist. However, because of the unanimity requirement, the individual members of the jury, in determining the appropriateness of the death penalty, cannot give any effect to the mitigating factors they have found if even one juror concludes that no mitigating factors exist. Id. at 373-74.\n\nIn the second hypothetical, all twelve jurors agree that mitigating circumstances exist, but all twelve cannot agree on the same mitigating circumstances. The Court concluded that \"it would certainly be the height of arbitrariness to allow or require the imposition of the death penalty under [these hypothetical] circumstances. . . .\" Id. at 374.\n\nThe jury instructions in this case, like the verdict form and instructions in Mills, and unlike the instructions in McKoy, did not explicitly instruct the jury that its decision on any one mitigating factor had to be unanimous before that factor could be considered by any juror. The defendant argues that portions of Instruction No. 21 led the jury to believe that it had to unanimously find the existence of a particular mitigating factor before that factor could be considered:\n\nIf in the first two steps of your deliberations you have made unanimous findings that the prosecution has proven beyond a reasonable doubt that one or more aggravating factors exist and that no mitigating factors exist, or that a mitigating factor or factors exist, you must now decide whether the prosecution has proven that any factors in mitigation do not outweigh the aggravating factor or factors.\n\n(Emphasis added.) At worst, the emphasized portion of this instruction is ambiguous. We considered an instruction in People v. Davis, 794 P.2d 159, slip op. at 70-74 (Colo. 1990), which was identical in relevant part, and concluded, as we do here, that the instruction did not impose a requirement of unanimity on jury consideration of mitigating factors.\n\nIn Boyde v. California, 494 U.S. 370, 110 S. Ct. 1190, 1197, 108 L. Ed. 2d 316 (1990), the majority noted that the Court had not always applied the same test for determining whether an ambiguous jury instruction impermissibly restricted the jury's consideration of relevant evidence.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Because it was \"important to settle upon a single formulation for this Court and other courts to employ in deciding this kind of federal question,\" id., the Court posited the following test:\n\nThe claim is that the instruction is ambiguous and therefore subject to an erroneous interpretation. We think the proper inquiry in such a case is whether there is a reasonable likelihood that the jury has applied the challenged instruction in a way that prevents the consideration of constitutionally relevant evidence. Although a defendant need not establish that the jury was more likely than not to have been impermissibly inhibited by the instruction, a capital sentencing proceeding is not inconsistent with the Eighth Amendment if there is only a possibility of such an inhibition. . . . Jurors do not sit in solitary isolation booths parsing instructions for subtle shades of meaning in the same way that lawyers might. Differences among them in interpretation of instructions may be thrashed out in the deliberative process, with commonsense understanding of the instructions in the light of all that has taken place at the trial likely to prevail over technical hairsplitting.\n\nId. at 1198 (emphasis added).\n\nIn Mills, the jurors were given a verdict form listing certain mitigating factors. \"[T]he jury marked 'no' beside each referenced mitigating circumstance and returned a sentence of death.\" 486 U.S. at 370. The Maryland Court of Appeals concluded that this merely meant that the jury unanimously found that a mitigating factor did not exist. It did not mean the jury thought that it must unanimously find a particular mitigating circumstance before it could be considered. The Supreme Court disagreed, finding that\n\nthere is a substantial probability that reasonable jurors, upon receiving the judge's instructions in this case, and in attempting to complete the verdict form as instructed, well may have thought they were precluded from considering any mitigating evidence unless all 12 jurors agreed on the existence of a particular such circumstance. Under our cases, the sentencer must be permitted to consider all mitigating evidence. The possibility that a single juror could block such consideration and consequently require the jury to impose the death penalty, is one we dare not risk.\n\nId. at 384. The relevant penalty phase jury instructions are set out in Appendix B to this opinion.\n\nAn examination of the jury instructions, read as a whole, and in context, reveals that the only requirements of unanimity imposed by the instructions relate to the finding of specified aggravating factors and the verdict of death. See Instructions Nos. 14, 15, 16, 21, and 28. The jury was instructed again and again that if one or more jurors disagreed with the majority, the result would be life in prison. See Instructions Nos. 14, 15, 16, 21, and 28. In addition, Instruction No. 13 told the jury that they could sentence the defendant to life in prison even if they \"decide[d] that no mitigating factor exists or that a mitigating factor or factors d[id] not outweigh an aggravating factor found to exist. . . .\" There was no affirmative instruction that the jury could not consider or give effect to a mitigating factor if the jury was not unanimous. See Commonwealth v. Frey, 520 Pa. 338, , 554 A.2d 27, 31 (1989), cert. denied, 494 U.S. 1038, 110 S. Ct. 1500, 108 L. Ed. 2d 635 (1990); cf. State v. Bey, 112 N.J. 123, , 548 A.2d 887, 906 (1988). This was in stark contrast to the unanimity requirement imposed with respect to the finding of an aggravating factor. See Instructions Nos. 15, 16. Contrast this with the portion of Instruction No. 15 which states: \"If one or more jurors finds sufficient mitigating factor or factors exist that outweigh a specified aggravating factor or factors, then the result is a sentence of life imprisonment.\"\n\nUnlike the stage of jury deliberations involving the finding of at least one aggravating factor, the instructions did not require that any vote be taken by the jury on the existence of mitigating factors. Instruction No. 16 states: \"After you have discussed these aggravating factors, you shall take a vote to determine whether the prosecution has proven the existence of one or more of these aggravating factors beyond a reasonable doubt.\" There is no corresponding instruction for a jury vote on the existence of a mitigating factor. See State v. Clark, 108 N.M. 288, , 772 P.2d 322, 343 (unlike the Maryland practice and instructions found deficient in Mills, New Mexico has no requirement that a vote be taken or findings made regarding mitigating factors), cert. denied, 493 U.S. 998, 110 S. Ct. 555, 107 L. Ed. 2d 551 (1989).\n\nAlso running as a theme through the instructions is that the individual jurors could disagree with respect to the effect they gave to mitigating factors. See Instructions No. 15 (\"If one or more jurors finds sufficient mitigating factor or factors exist that outweigh a specified aggravating factor or factors, then the result is a sentence of life imprisonment.\"); No. 21 (\"If one or more of the jurors believe that a mitigating factor or factors outweigh the aggravating factor or factors found to exist, then the jury shall enter a verdict of life imprisonment.\"). In addition, Instruction No. 22 stated:\n\nEach of you must also decide for yourself what weight to give each mitigating circumstance that you find exists. Your decision as to what weight to give any mitigating circumstances does not have to be unanimous. You do not have to take the decisions, opinions or feelings of any other juror into account, although you may do so if you wish.\n\nSee State v. Thompson, 768 S.W.2d 239, 250-51 (Tenn. 1989) (instructions not deficient under Mills where they stressed the individual juror's autonomy in considering mitigating evidence).\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e We are convinced that neither of the two hypothetical situations posited in Mills could have occurred under the instructions given the jury in this case. We conclude that there was no reasonable likelihood that the jury would interpret either Instruction No. 21, or the instructions as a whole, as foreclosing them from considering and giving effect to relevant mitigating evidence unless they were unanimous. The jury instructions did not violate either Mills or McKoy.\n\nIV\n\nOne statutory aggravating factor is that \"the defendant committed the offense in an especially heinous, cruel, or depraved manner. . . .\" § 16-11-103(6)(j). At the penalty phase of the defendant's trial, the court gave Instruction No. 16:\n\nThe first step in your deliberations is to consider whether one or more statutory aggravating factors is present. . . . The aggravating factors relied upon by the prosecution in this case are:\n\n(b) The defendant committed the offense in an especially heinous, cruel or depraved manner.\n\nA verdict form completed by the jury indicates that they found that this aggravating factor existed beyond a reasonable doubt, and we must assume that the jury considered this factor in determining the appropriateness of the death penalty. The jury was given no further instruction or guidance on the meaning of subsection (6)(j). In the absence of a narrowing instruction or definition, we conclude that subsection (6)(j) violated the eighth amendment because it gave insufficient guidance to the capital sentencer.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Clemons v. Mississippi, 494 U.S. 738, 110 S. Ct. 1441, 108 L. Ed. 2d 725 (1990); Maynard v. Cartwright, 486 U.S. 356, 100 L. Ed. 2d 372, 108 S. Ct. 1853 (1988); Godfrey v. Georgia, 446 U.S. 420, 64 L. Ed. 2d 398, 100 S. Ct. 1759 (1980);\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e People v. Davis, No. 87SA288, slip op. at 25-26.\n\nThe fact that the jury was instructed on, and found, an invalid statutory aggravating factor does not require that we vacate the defendant's sentence, however, if we can conclude that the error was harmless beyond a reasonable doubt. Clemons v. Mississippi, 110 S. Ct. at 1450. Unlike the jury in Clemons which found only one valid statutory aggravating factor, the jury in this case found five statutory aggravating factors in addition to subsection (6)(j).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In his closing argument, defense counsel conceded that the prosecution had proven the statutory aggravating factors alleged beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nOur review of the record indicates that no evidence was introduced before the jury that would have been excluded had subsection (6)(j) not been alleged as an aggravating factor. The facts and circumstances relevant to the manner in which the murder was committed were also admissible to prove the existence of other valid statutory aggravating factors, as well as the relative weight to be accorded the aggravating and mitigating factors found.\n\nAlso unlike Clemons, the prosecutors in this case did not overly stress or rely on the invalid aggravating factor in closing argument. Defense counsel himself stated in closing argument that the murder was \"heinous.\" Given the overwhelming evidence supporting the five valid aggravating factors found by the jury, we conclude that the inclusion of the invalid aggravating factor was harmless beyond a reasonable doubt.\n\nThe dissent asserts that the prosecutors did in fact stress and rely on the invalid aggravating factor. That would be true only if all of the prosecutors' comments regarding the brutality of the murder were relevant only to the cruel and heinous statutory aggravating factor. The manner in which the murder was committed was also independently relevant to the jury's consideration of the weight to be accorded the remaining five aggravating factors. Even if the prosecutors relied in closing argument on the cruel and heinous aggravating factor, we believe that the inclusion of that factor was harmless beyond a reasonable doubt in this case.\n\nIn People v. Davis, No. 87SA288, slip op. at 33, we held that \"the aggravator 'especially heinous, cruel or depraved' should have been limited to include only those murders which were conscienceless or pitiless, and were unnecessarily torturous to the victim.\" Although, as here, there was no proper limiting instruction, the facts and circumstances of that case that were considered by the jury satisfied our definition limiting \"especially heinous, cruel or depraved.\" We concluded that the jury, if given the proper limiting instruction, would have concluded that the murder was committed in an \"especially heinous, cruel or depraved\" manner, and therefore the trial court's failure to give the instruction was harmless error.\n\nSimilarly, we believe that the jury, given the facts and circumstances of this case, would have found that the murder was \"conscienceless or pitiless, and [was] unnecessarily torturous to the victim.\" Lorraine Martelli was kidnapped off the streets of Denver in her own car, driven around for hours, repeatedly raped, sodomized, beaten and humiliated. She was ultimately murdered in a manner indicating that the defendant intended to torture her before she died. We conclude that the error in failing to give the proper limiting instruction in this case was harmless beyond a reasonable doubt.\n\nV\n\nThe defendant next maintains that the jury instructions were invalid under Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985), People v. Drake, 748 P.2d 1237 (Colo. 1988), and People v. Durre, 690 P.2d 165 (Colo. 1984), and that comments by the trial judge and the prosecutors reinforced the error. This contention is without merit.\n\nIn Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985), the Court stated:\n\n[W]e conclude that it is constitutionally impermissible to rest a death sentence on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's death rests elsewhere. This Court has repeatedly said that under the Eighth Amendment \"the qualitative difference of death from all other punishments requires a correspondingly greater degree of scrutiny of the capital sentencing determination.\" California v. Ramos, 463 U.S., at 998-999. Accordingly, many of the limits that this Court has placed on the imposition of capital punishment are rooted in a concern that the sentencing process should facilitate the responsible and reliable exercise of sentencing discretion.\n\nId. at 328-29.\n\nThis Court has always premised its capital punishment decisions on the assumption that a capital sentencing jury recognizes the gravity of its task and proceeds with the appropriate awareness of its \"truly awesome responsibility.\" In this case, the State sought to minimize the jury's sense of responsibility for determining the appropriateness of death. Because we cannot say that this effort had no effect on the sentencing decision, that decision does not meet the standard of reliability that the Eighth Amendment requires. The sentence of death must therefore be vacated.\n\nId. at 341. In the sentencing hearing in this case the jurors were unambiguously instructed that they possessed the \"awesome responsibility\" of deciding the fate of the defendant. Instruction No. 2 provided:\n\nMembers of the jury, the evidence in the sentencing hearing has been completed and I will now instruct you on the law. After these instructions and after closing arguments by counsel, it will then be your duty to decide whether FRANK D. RODRIGUEZ should be put to death or whether he should be sentenced to life imprisonment.\n\n(Emphasis added.) The instructions directed to the jury referred to \"your verdict\" of life imprisonment or \"your verdict\" of death. Instruction No. 23 then stated: \"The manner of inflicting the punishment of death in the State of Colorado is by the administration of lethal gas. You must assume that the penalty of death will be carried out if imposed by the Court pursuant to the jury verdict.\" (Emphasis added.) See People v. Davis, No. 87SA288, slip op. at 75 n.35 (rejecting defendant's argument that the word \"assume\" in a very similar instruction failed to convey to the jury its ultimate responsibility).\n\nThe defendant complains that the prosecutors communicated to the jury that they were to act as representatives of the community, but that the ultimate decision was \"up to the judge.\" What the prosecutor actually said was:\n\nLadies and gentlemen of the Jury: For two years now everything has been coming down to this moment of truth; this moment when the citizens of this state take over. You heard how many transcripts have been generated. If counsel looked a little tired on both sides, it's obviously because we have been working, but ultimately it's up to the judge, and it's not up to the attorneys; it's up to the citizens, the lay people who make that final decision in the case.\n\n(Emphasis added.) This argument does not suggest that the ultimate decision was up to the judge; in fact it implies the opposite. The prosecutor's argument thus did not attempt to minimize the gravity of the jury's responsibility, or suggest that the jury's determination was subject to de novo review, as in Caldwell. We conclude, therefore, that the jury instructions did not violate Caldwell.\n\nNor did the trial court commit reversible error when it refused to instruct the jury with the defendant's tendered instructions with respect to the jury's role in imposition of the death penalty. The requested instructions were similar to the ones actually given, and defense counsel was permitted to argue to the jury in conformance with his requested instructions. People v. Nhan Dao Van, 681 P.2d 932, 936 (Colo. 1984).\n\nThe instructions were not inconsistent with the teachings of People v. Drake, 748 P.2d 1237, or People v. Durre, 690 P.2d 165. In Durre, which was decided before Caldwell, we reversed a death sentence because the jury was inadequately instructed as to the effect of their verdict. We said:\n\nBecause under Colorado's capital sentencing procedures the jury's resolution of the existence of mitigating, additional mitigating, and aggravating circumstances necessarily involves a determination of whether life imprisonment as opposed to a death sentence is justified under the evidence, the certainty essential to a jury verdict directly resulting in death can only be achieved when the jurors are clearly instructed concerning the effect of their verdicts on the ultimate question of life imprisonment or death.\n\nA basic flaw in the trial court's instructions, as related to the issue of unanimity, is the failure to inform the jury of the effect of its verdicts on the issue of punishment.\n\n690 P.2d at 173-74. The jury instructions in Drake suffered from the same defect as those in Durre. Drake, 748 P.2d at 1255, 1257-58. In this case, the instructions adequately informed the jury of the effects of its verdicts on aggravating circumstances, the weighing of mitigating against aggravating factors, and their decision on the appropriateness of the death penalty as opposed to life imprisonment. See Instructions Nos. 2, 3, 13, 14-16, 21, 23, 28. Within the context of the death penalty statute applicable to this case, the jury instructions were not inconsistent with the command of Drake or Durre.\n\nVI\n\nThe defendant next complains that the trial court's instructions violated the trial by jury,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e due process, and prohibition against cruel and unusual punishment provisions of the state and federal Constitutions because they failed to instruct the jury that the only factors they could consider in reaching their decision on life or death were the statutory criteria. Even assuming arguendo that the instructions can be read to allow the jury to consider aggravating circumstances outside of the statutory aggravating factors, we perceive no constitutional infirmity. The Supreme Court has summarized the minimum constitutional requirements of a capital sentencing procedure in the following passage from McCleskey v. Kemp, 481 U.S. 279, 95 L. Ed. 2d 262, 107 S. Ct. 1756 (1987):\n\nIn sum, our decisions since Furman have identified a constitutionally permissible range of discretion in imposing the death penalty. First, there is a required threshold below which the death penalty cannot be imposed. In this context, the State must establish rational criteria that narrow the decisionmaker's judgment as to whether the circumstances of a particular defendant's case meet the threshold. Moreover, a societal consensus that the death penalty is disproportionate to a particular offense prevents a State from imposing the death penalty for that offense. Second, States cannot limit the sentencer's consideration of any relevant circumstance that could cause it to decline to impose the penalty. In this respect, the State cannot channel the sentencer's discretion, but must allow it to consider any relevant information offered by the defendant.\n\nId. at 305-06 (also quoted in Blystone v. Pennsylvania, 494 U.S. 299, 110 S. Ct. 1078, 1084, 108 L. Ed. 2d 255 (1990)). Once the capital sentencing statute narrows the class of individuals eligible for the death penalty, as ours does, the federal Constitution does not prohibit the sentencer from considering aggravating facts or circumstances other than statutory aggravators. Barclay v. Florida, 463 U.S. 939, 956, 77 L. Ed. 2d 1134, 103 S. Ct. 3418 (1983); Zant v. Stephens, 462 U.S. 862, 887-88, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983); see also People v. Saathoff, 790 P.2d 804, slip op. at 5 (Colo. 1990). In the context of capital punishment, we have not interpreted the state Constitution to provide broader protection than the federal Constitution. See People v. Davis, No. 87SA288, slip op. at 10-14.\n\nThe proper inquiry is whether the instructions were inconsistent with the Colorado sentencing scheme. We conclude that they were not. The relevant provision is section 16-11-103(2), which provides, in part:\n\n(2)(a) After hearing all the evidence and arguments of the prosecuting attorney and the defendant, the jury shall deliberate and render a verdict based upon the following considerations:\n\n(I) Whether at least one aggravating factor has been proved as enumerated in subsection (6) of this section;\n\n(II) Whether sufficient mitigating factors exist which outweigh any aggravating factor or factors found to exist; and\n\n(III) Based on the considerations in subparagraphs (I) and (II) of this paragraph (a), whether the defendant should be sentenced to death or life imprisonment.\n\n(Emphasis added.) We believe that Instructions Nos. 1, 3, 15, 16, 19, and 21, when read in context, and as a whole, conveyed to the jury their responsibility under section 16-11-103(2)(a) in reaching a decision on life or death.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e We also conclude that the trial court did not commit reversible error in failing to give the instructions tendered by the defendant. People v. Nhan Dao Van, 681 P.2d 932, 936 (Colo. 1984).\n\nVII\n\nThe defendant requested that the following instruction be read to the jury at the conclusion of the sentencing phase:\n\nAt the first part of the trial, I instructed you that you were not to be swayed by sympathy. However, in this part of the trial the law permits you to be influenced by mercy, sentiment and sympathy for Mr. Rodriguez as mitigating circumstances. You must not be influenced by prejudice, bias or public opinion against Mr. Rodriguez. You must not be influenced by sympathy for the victim against Mr. Rodriguez.\n\nThe trial court refused the instruction. The defendant argues that failure to give the instruction violated his rights under the right to trial by jury,\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e due process, and prohibition against cruel and unusual punishment provisions of the state and federal Constitutions, as well as under section 16-11-103.\n\nThe requested instruction has three components. First, it tells the jury that they may be influenced by mercy and sympathy for the defendant as mitigating circumstances. The jury instructions as given adequately instructed the jury on their responsibility to consider and give effect to relevant mitigating evidence. See Instructions Nos. 15, 20, 26. For example, Instruction No. 26 stated in part:\n\n\"Mitigating circumstances\" are circumstances which do not constitute a justification or excuse for the offense in question, but which, in fairness or mercy, may be considered as extenuating or reducing the degree of moral culpability.\n\n(Emphasis added.) These instructions, if anything, were more explicit and favorable to the defendant than the instructions found constitutionally adequate in Boyde v. California, 110 S. Ct. at 1199-1201. We find no error in the failure of the trial court to give this portion of the instruction.\n\nThe second part of the requested instruction was: \"You must not be influenced by prejudice, bias or public opinion against Mr. Rodriguez.\" The defendant cites no authority holding that such an instruction must be given at the sentencing phase of a capital trial. See Young v. People, 180 Colo. 62, 64, 502 P.2d 81, 82-83 (1972) (defendant cited no authority in support of contention that he was entitled to anti-sympathy instruction to offset prejudice in sensational homosexual rape case, and court found none).\n\nIt would not have been error for the court to have given the second part of the requested instruction. See generally 23A C.J.S. Criminal Law § 1308, at 216 (1989). On the other hand, the giving of a cautionary or admonitory instruction such as this is within the discretion of the trial court and we will not reverse absent an abuse of that discretion and demonstrated prejudice to the defendant. Young v. People, 180 Colo. at 64, 502 P.2d at 82-83; Luna v. People, 170 Colo. 1, 5, 461 P.2d 724, 725-26 (1969); see also York v. State, 566 S.W.2d 936, 938 (Tex. Crim. App. 1978).\n\nThe jury was instructed in the guilt phase not to let prejudice influence their decision. In the absence of any change in circumstances necessitating another admonitory instruction, we conclude that the trial court did not abuse its discretion in refusing the second part of the defendant's requested instruction.\n\nFinally, the trial court did not err in refusing the third part that instructed the jury not to be influenced against the defendant by sympathy for the victim. While such an instruction was proper during the guilt phase, it would have been improper in the sentencing phase for the reasons expressed in Part II 9 above. Nor did the refusal of the instruction violate Booth v. Maryland, 482 U.S. 496, 96 L. Ed. 2d 440, 107 S. Ct. 2529, or South Carolina v. Gathers, 490 U.S. 805, 109 S. Ct. 2207, 104 L. Ed. 2d 876 . See Part II C above.\n\nVIII\n\nIt is alleged by the defendant that Instructions Nos. 15 and 21 were unconstitutional under the trial by jury, due process, and prohibition against cruel and unusual punishment provisions of the federal and Colorado Constitutions. The supposed offending parts are as follows:\n\nINSTRUCTION NO. 15\n\nThe third step in your deliberations involves a weighing of the specified aggravating factor or factors against any and all mitigating factors. . . . You may assign any weight you wish to each aggravating or mitigating factor. It is the weight assigned to each factor, and not the number of factors found to exist that is to be considered.\n\nINSTRUCTION NO. 21\n\nIn the third step of your deliberations you must weigh the aggravating factor or factors found to exist against any and all mitigating factors. This is not a mere counting process in which aggravating factors are weighed against mitigating factors. Rather, it is a process in which you must apply your reasoned judgment in deciding whether the situation calls for life imprisonment or requires the imposition of the death penalty, in light of the totality of the circumstances present.\n\nThe number of factors found is not determinative. The jury may emphasize one factor more than another in a particular case. You must consider the relative substantiality and persuasiveness of the existing aggravating and mitigating factors in making this determination.\n\n(Emphasis added.) We disagree with the defendant's assessment that these instructions foreclosed the jury unconstitutionally from any consideration of the number of aggravating and mitigating factors. The instructions properly told the jury that the statutory weighing process did not involve merely a counting process. We conclude that the instructions were consistent with the statute and did not offend the federal or state Constitutions.\n\nIX\n\nThe prosecution's theory at trial was that the defendant raped, sodomized, tortured, and then killed the victim with his own hands. The defense theory was that the prosecution's evidence showed that David Martinez, and not Frank Rodriguez, personally murdered Lorraine Martelli. At the conclusion of the evidence of the guilt phase, the trial court instructed the jury on criminal responsibility under the principle of complicity.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe defendant maintains that the failure of the trial court to give his anti-complicity instruction\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e at the sentencing phase of the trial violated the principles of Tison v. Arizona, 481 U.S. 137, 95 L. Ed. 2d 127, 107 S. Ct. 1676 (1987) (eighth amendment does not forbid death sentence where defendant's participation in felony that results in killing is major and defendant's mental state is at least a reckless indifference to human life), and Enmund v. Florida, 458 U.S. 782, 73 L. Ed. 2d 1140, 102 S. Ct. 3368 (1982) (eighth amendment prohibits death penalty as disproportionate for defendant who aids and abets felony in which killing takes place but who does not himself kill, attempt to kill, or intend that killing take place or that lethal force be used).\n\nInitially, we reject the premise that the jury would have carried the complicity instruction through to the penalty phase in the absence of an anti-complicity instruction. The complicity instruction stated that the defendant was \"guilty of an offense committed by another person\" if the four listed conditions were met. The instruction by its own terms was thus applicable only to the phase in which the jury determined guilt or innocence. The sentencing phase instructions did not use the words \"guilt\" or \"guilty\" except when referring to the guilt phase and in Instruction No. 19 which provided, in part:\n\nThe fact that you have found Mr. Rodriguez guilty of the crime of murder in the first degree is not an aggravating factor. Except as required by the alleged aggravating factor No. f listed in Instruction No. 16, the fact that you have found Mr. Rodriguez guilty of other crimes is not an aggravating factor.\n\n(Emphasis added.) Instruction No. 1 told the jury that it was to apply the rules of law given during the sentencing phase:\n\nDuring the course of the trial and penalty phase hearing you received all of the evidence that you may properly consider to decide the case. Your decision must be made by applying the rules of law which I give you to the evidence presented.\n\nIt is your duty first to determine the facts from the evidence you have heard during the first trial on guilt or innocence as well as the additional evidence presented during the penalty phase hearing. Then you are to evaluate those facts in light of the requirements set forth in these instructions.\n\n(Emphasis added.) Instruction No. 2 stated that \"the evidence in the sentencing hearing has been completed and I will now instruct you on the law.\" (Emphasis added.) The sentencing phase instructions did not themselves suggest that the defendant's individual culpability or blameworthiness could depend on complicity principles.\n\nEven more significant, however, is that the jury unanimously found, beyond a reasonable doubt, that the defendant killed Lorraine Martelli. In their special verdict form on aggravating factors, the jury concluded that \"[t]he defendant intentionally killed a person kidnapped or being held as a hostage by him or anyone associated with him.\" (Emphasis added.) Instruction No. 27 stated:\n\nA crime is committed when the defendant has committed a voluntary act prohibited by law by a culpable mental state. Voluntary act means an act performed consciously as a result of effort or determination. . . .\n\nA person acts \"intentionally\" or \"with intent\" when his conscious objective is to cause the specific result proscribed by the statute defining the offense.\n\n(Emphasis added.) Because the jury found beyond a reasonable doubt that it was the defendant who intentionally killed the victim, any error, if there was error, in not giving the defendant's anti-complicity instruction, was harmless beyond a reasonable doubt. We note also that the jury found beyond a reasonable doubt that the defendant acted intentionally. Enmund therefore is inapplicable. See Tison, 481 U.S. at 156.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nX\n\nThe defendant's final contention is that comments made by the trial judge to defense counsel during the prosecutor's closing argument were overly harsh and require reversal. The record reveals the following exchange between the trial judge and defense counsel:\n\n[Prosecutor]: It's a very rare combination of a crime and a defendant that satisfies so many of the statutory criteria.\n\n[Defense counsel]: Objection, judge, to any comparison to this to other cases.\n\nThe Court: Overruled. Let Mr. Silverman finish his argument.\n\n[Defense counsel]: Can the court please tell the jury I have a right to object?\n\nThe Court: Mr. Eisner.\n\n[Defense counsel]: Thank you, judge.\n\nThe Court: Let Mr. Silverman finish his argument.\n\n[Defense counsel]: Just for clarification\n\nThe Court: Mr. Eisner, please have a seat.\n\nIn his appellate brief and in an accompanying \"Appendix 1,\" defendant's appellate counsel has a different but unsworn version of what happened:\n\nThe Court: Overruled. Mr. Eisner sit down and let Mr. Silverman finish his argument, without any further objections.\n\n[Defense counsel]: Can the court please tell the jury I have a right to object?\n\nThe Court: Mr. Eisner, shut up and sit down.\n\n[Defense counsel]: Thank you, judge.\n\nThe Court: Let Mr. Silverman finish his argument, without interruption.\n\n[Defense counsel]: Just for clarification --\n\nThe Court: Mr. Eisner, sit down and be quiet.\n\n(Emphasis added.) There is a presumption that the record as prepared by the court reporter correctly reflects the trial proceedings because the court reporter has a duty to accurately record all the testimony and rulings of the court. § 13-5-127, 6A C.R.S. (1987); Jones v. District Court, 780 P.2d 526, 528 (Colo. 1989). The unsworn assertions of defendant's appellate counsel in his brief and \"Appendix 1\" are insufficient to overcome this presumption. The record does not support the defendant's claim that the trial judge made improper remarks to defense counsel that deprived the defendant of a fair trial. See United States v. Crawford, 707 F.2d 447, 451 (10th Cir. 1983).\n\nWe do not believe that defense counsel could have reasonably interpreted the trial court's comments as foreclosing further valid objections to improper argument. We note that defense counsel did object to subsequent statements made by the prosecutors during their argument. In any event, even if we assume that the defendant's version of the trial judge's comments is correct, we find those comments harmless beyond a reasonable doubt since we have reviewed the prosecutors' arguments as if there had been contemporaneous objections made. See Part II above.\n\nXI\n\nWe are also required to review the defendant's sentence to ensure that it was not arrived at improperly. Section 16-11-103(7) provides, in part:\n\n(a) Whenever a sentence of death is imposed upon a person pursuant to the provisions of this section, the supreme court shall review the propriety of that sentence, having regard to the nature of the offense, the character and record of the offender, the public interest, and the manner in which the sentence was imposed, including the sufficiency and accuracy of the information on which it was based. The procedures to be employed in the review shall be as provided by supreme court rule.\n\n(b) A sentence of death shall not be imposed pursuant to this section if the supreme court determines that the sentence was imposed under the influence of passion or prejudice or any other arbitrary factor or that the evidence presented does not support the finding of statutory aggravating circumstances.\n\nSee also C.A.R. 4(e); People v. Davis, No. 87SA288, slip op. at 116-18.\n\nWe have reviewed the record in this case with great care. We conclude that there was overwhelming evidence of the defendant's guilt and personal participation in the kidnapping, sexual assault and murder of Lorraine Martelli. The record contains ample evidence supporting the jury's finding of the statutory aggravating factors. We have examined the mitigating evidence offered and find that the jury properly concluded that the mitigating factors did not outweigh the statutory aggravating factors found.\n\nThis was a particularly brutal and pitiless murder. The defendant has demonstrated no remorse, has perpetrated similar crimes and assaults in the past, and was on parole for kidnapping and raping another woman at the time he committed this latest offense. The jury did not improperly conclude that death was the appropriate punishment for this defendant. We also hold that the sentence was not imposed under the influence of passion or prejudice or any other arbitrary factor.\n\nAccordingly, we affirm the judgment and sentence of death. We dissolve the stay of execution and remand to the trial court to set a date for imposition of the death sentence.\n\nAppendix A\n\nThe capital sentencing statute in effect on the date of the offense, November 14, 1984, was section 16-11-103, 8 C.R.S. (1978 \u0026 1984 Supp.). It provided, in relevant part:\n\n16-11-103. Imposition of sentence in class 1 felonies -- appellate review.\n\n(1)(a) Upon conviction of guilt of a defendant of a class 1 felony, the trial court shall conduct a separate sentencing hearing to determine whether the defendant should be sentenced to death or life imprisonment. . . . The hearing shall be conducted by the trial judge before the trial jury as soon as practicable. . . .\n\n(b) All evidence presented by either the prosecuting attorney or the defendant that the court deems relevant to the nature of the crime, and the character, background, and history of the defendant, including any evidence presented in the guilt phase of the trial, and any matters relating to any of the aggravating or mitigating factors enumerated in subsections (5) and (6) of this section, may be presented. Any such evidence which the court deems to have probative value may be received, as long as each party is given an opportunity to rebut such evidence. This subsection (1) shall not be construed to authorize the introduction of any evidence secured in violation of the Constitution of the United States or of Colorado. The prosecuting attorney and the defendant or his counsel shall be permitted to present arguments for or against a sentence of death. The jury shall be instructed that life imprisonment means life without the possibility of parole for twenty calendar years.\n\n(d) The burden of proof as to the aggravating factors enumerated in subsection (6) of this section shall be beyond a reasonable doubt. There shall be no burden of proof as to proving or disproving mitigating factors.\n\n(2)(a) After hearing all the evidence and arguments of the prosecuting attorney and the defendant, the jury shall deliberate and render a verdict based upon the following considerations:\n\n(I) Whether at least one aggravating factor has been proved as enumerated in subsection (6) of this section;\n\n(II) Whether sufficient mitigating factors exist which outweigh any aggravating factor or factors found to exist; and\n\n(III) Based on the considerations in subparagraphs (I) and (II) of this paragraph (a), whether the defendant should be sentenced to death or life imprisonment.\n\n(b)(I) In the event that no aggravating factors are found to exist as enumerated in subsection (6) of this section, the jury shall render a verdict of life imprisonment and the court shall sentence the defendant to life imprisonment.\n\n(II) The jury shall not render a verdict of death unless it finds and specifies in writing that:\n\n(A) At least one aggravating factor has been proved; and\n\n(B) There are insufficient mitigating factors to outweigh the aggravating factor or factors that were proved.\n\n(c) In the event the jury's verdict is to sentence to death, such verdict shall be unanimous and shall be binding upon the court; unless the court determines, and sets forth in writing the basis and reasons for such determination, that the verdict of the jury is clearly erroneous as contrary to the weight of the evidence, in which case the court shall sentence the defendant to life imprisonment.\n\n(d) If the jury's verdict is not unanimous, the jury shall be discharged, and the court shall sentence the defendant to life imprisonment.\n\n(5) For purposes of this section, mitigating factors shall be the following factors:\n\n(a) The age of the defendant at the time of the crime; or\n\n(b) His capacity to appreciate wrongfulness of his conduct or to conform his conduct to the requirements of law was significantly impaired, but not so impaired as to constitute a defense to prosecution; or\n\n(c) He was under unusual and substantial duress, although not such duress as to constitute a defense to prosecution; or\n\n(d) He was a principal in the offense which was committed by another, but his participation was relatively minor, although not so minor as to constitute a defense to prosecution; or\n\n(e) He could not reasonably have foreseen that his conduct in the course of the commission of the offense for which he was convicted would cause, or would create a grave risk of causing, death to another person; or\n\n(f) The emotional state of the defendant at the time the crime was committed; or\n\n(g) The absence of any significant prior conviction; or\n\n(h) The extent of the defendant's cooperation with law enforcement officers or agencies and with the office of the prosecuting district attorney; or\n\n(i) The influence of drugs or alcohol; or\n\n(j) The good faith, although mistaken, belief by the defendant that circumstances existed which constituted a moral justification for the defendant's conduct; or\n\n(k) The defendant is not a continuing threat to society; or\n\n(l) Any other evidence which in the court's opinion bears on the question of mitigation.\n\n(6) For purposes of this section, aggravating factors shall be the following factors:\n\n(a) The class 1 felony was committed by a person under sentence of imprisonment for a class 1, 2, or 3 felony as defined by Colorado law or United States law, or for a crime committed against another state or the United States which would constitute a class 1, 2, or 3 felony as defined by Colorado law; or\n\n(b) The defendant was previously convicted in this state of a class 1 or 2 felony involving violence as specified in section 16-11-309, or was previously convicted by another state or the United States of an offense which would constitute a class 1 or 2 felony involving violence as defined by Colorado law in section 16-11-309; or\n\n(d) The defendant intentionally killed a person kidnapped or being held as a hostage by him or by anyone associated with him; or\n\n(e) The defendant has been a party to an agreement to kill another person in furtherance of which a person has been intentionally killed; or\n\n(g) The defendant committed a class 1, 2, or 3 felony and, in the course of or in furtherance of such or immediate flight therefrom, he intentionally caused the death of a person other than one of the participants; or\n\n(h) The class 1 felony was committed for pecuniary gain; or\n\n(j) The defendant committed the offense in an especially heinous, cruel, or depraved manner; or\n\n(k) The class 1 felony was committed for the purpose of avoiding or preventing a lawful arrest or prosecution, or effecting an escape from custody. This factor shall include the intentional killing of a witness to a criminal offense.\n\n(7)(a) Whenever a sentence of death is imposed upon a person pursuant to the provisions of this section, the supreme court shall review the propriety of that sentence, having regard to the nature of the offense, the character and record of the offender, the public interest, and the manner in which the sentence was imposed, including the sufficiency and accuracy of the information on which it was based. The procedures to be employed in the review shall be as provided by supreme court rule.\n\n(b) A sentence of death shall not be imposed pursuant to this section if the supreme court determines that the sentence was imposed under the influence of passion or prejudice or any other arbitrary factor or that the evidence presented does not support the finding of statutory aggravating circumstances.\n\n(8)(a) If any provision of this section or the application thereof to any person or circumstances is held invalid or unconstitutional, such invalidity or unconstitutionality shall not affect other provisions or applications of this section, which can be given effect without the invalid or unconstitutional provision or application, and to this end the provisions of this section are declared to be severable.\n\n(b) If any death sentence is imposed upon a defendant pursuant to the provisions of this section and the imposition of such death sentence upon such defendant is held invalid or unconstitutional, said defendant shall be returned to the trial court and shall then be sentenced to life imprisonment.\n\nAppendix B\n\nINSTRUCTION NO.1\n\nMembers of the jury, the evidence in this penalty phase hearing has been completed. In a moment I will read you the law which you must apply in order to reach your sentencing decision. . . .\n\nDuring the course of the trial and penalty phase hearing you received all of the evidence that you may properly consider to decide the case. Your decision must be made by applying the rules of law which I give you to the evidence presented.\n\nIt is your duty first to determine the facts from the evidence you have heard during the first trial on guilt or innocence as well as the additional evidence presented during the penalty phase hearing. Then you are to evaluate those facts in light of the requirements set forth in these instructions.\n\nINSTRUCTION NO. 2\n\nMembers of the jury, the evidence in the sentencing hearing has been completed and I will now instruct you on the law. After these instructions and after closing arguments by counsel, it will then be your duty to decide whether FRANK D. RODRIGUEZ should be put to death or whether he should be sentenced to life imprisonment.\n\nINSTRUCTION NO. 3\n\nThe law presumes that a defendant convicted of a capital offense is innocent of any aggravating factors. The presumption of innocence is, alone, sufficient to justify a finding that no aggravating factors exist. Unless you are satisfied beyond a reasonable doubt of the proof of at least one aggravating factor, you are instructed to return a verdict sentencing FRANK D. RODRIGUEZ to life in prison.\n\nThe Defendant never has the burden of proving that an alleged aggravating factor does not exist, nor does the Defendant have an obligation to produce witnesses or evidence on the question of whether an alleged aggravating factor exists.\n\nIn order to return a verdict of death, you must be convinced beyond a reasonable doubt that a mitigating factor or factors do not outweigh any aggravating factors found to exist and that the death penalty is the appropriate penalty.\n\nINSTRUCTION NO. 8\n\nThe court admitted certain evidence for a limited purpose.\n\nAt that time you were instructed not to consider it for any purpose other than the limited purpose for which it was admitted.\n\nYou are again instructed that you cannot consider evidence admitted for a limited purpose except for the limited purpose for which it was admitted.\n\nINSTRUCTION NO. 9\n\nEvidence has been introduced concerning allegations of first degree sexual assault, second degree kidnapping, and felony menacing of Judy Archeluta by the Defendant, Frank D. Rodriguez.\n\nThis evidence is to be considered by you only for the purpose of determining whether or not the People have proven beyond a reasonable doubt the aggravating factor that:\n\n\"The murder was committed for the purpose of avoiding or preventing a lawful arrest or prosecution, or effecting an escape from custody. This factor shall include the intentional killing of a witness to a criminal offense.\"\n\nINSTRUCTION NO. 10\n\nEvidence has been introduced concerning an alleged shooting of George Stapleton by the Defendant, Frank D. Rodriguez, on November 4, 1984. You are instructed that Mr. Rodriguez has been accused but not tried on this matter and is presumed to be innocent of any and all charges arising out of that incident.\n\nThis evidence is to be considered by you only for the purpose of determining whether or not the People have proven beyond a reasonable doubt the aggravating factor that:\n\n\"The murder was committed for the purpose of avoiding or preventing a lawful arrest or prosecution, or effecting an escape from custody. This factor shall include the intentional killing of a witness to a criminal offense.\"\n\nINSTRUCTION NO. 11\n\nA mitigating factor does not have to be proved by any burden of proof. You must find that a mitigating factor exists if there is any evidence to support it.\n\nINSTRUCTION NO. 12\n\nThere is a presumption of life imprisonment in this case. Unless the prosecution proves beyond a reasonable doubt that the sentence should be death instead of life in prison, you must return a verdict of life in prison. This presumption of life imprisonment remains with Mr. Rodriguez throughout these proceedings, unless the prosecution proves to your satisfaction beyond a reasonable doubt that Mr. Rodriguez should be put to death instead of being sentenced to life in prison.\n\nINSTRUCTION NO. 13\n\nIf you decide that no mitigating factor exists or that a mitigating factor or factors do not outweigh an aggravating factor found to exist, you may sentence the Defendant to life in prison.\n\nINSTRUCTION NO. 14\n\nBefore a verdict of death can be imposed it must be unanimous. To this extent, the requirement is similar to any criminal case, such as the first \"guilt-or-innocence\" half of this case, where the \"verdict\" must be unanimous.\n\nHowever, you must understand that if your verdict cannot be unanimous in all respects, then the jury shall be discharged and the Court shall sentence the Defendant to life imprisonment.\n\nThus, before you can return a verdict of death in this case, you must all unanimously agree on such a verdict. You may also unanimously reach a verdict of life imprisonment. If you cannot unanimously reach a verdict one way or the other, the foreperson shall so notify the Court, and the result will be a sentence of life imprisonment imposed by the Court.\n\nINSTRUCTION NO. 15\n\nYour deliberations must take place in a certain order and within certain legal guidelines. Colorado law allows the death penalty only if the prosecution, in addition to proving Murder In The First Degree, also proves beyond a reasonable doubt that:\n\n1. One or more of the specified aggravating factors exist beyond a reasonable doubt; and\n\n2. No mitigating factor or factors exist; or\n\n3. No mitigating factor or factors outweigh the aggravating factor or factors found to exist beyond a reasonable doubt; and\n\n4. That death is the appropriate punishment in this case.\n\nYou must, therefore deliberate in a series of steps.\n\nThe first step in your deliberations is to decide whether the prosecution has proven the existence of at least one specified aggravating factor beyond a reasonable doubt. If one or more jurors finds that none of the specified aggravating factors has been proven beyond a reasonable doubt, then the result is a sentence of life imprisonment. If and only if all jurors agree that one or more specified aggravating factors have been proven beyond a reasonable doubt, then you should proceed to the second step in your deliberations.\n\nThe second step in your deliberations is to decide whether any mitigating factors have been shown to exist. Mitigating factors include but are not limited to the mitigating factors listed in Instruction No. 20 which follows later.\n\nThe third step in your deliberations involves a weighing of the specified aggravating factor or factors against any and all mitigating factors. You may consider only those aggravating factors [sic] or factors found to exist beyond a reasonable doubt. You may assign any weight you wish to each aggravating or mitigating factor. It is the weight assigned to each factor, and not the number of factors found to exist that is to be considered. If one or more jurors finds sufficient mitigating factor or factors exist that outweigh a specified aggravating factor or factors, then the result is a sentence of life imprisonment. If and only if the jury finds that one or more specified aggravating factors outweigh the mitigating factors, the jury then should proceed to the fourth step.\n\nThe fourth step in your deliberations is to decide whether the defendant should be sentenced to death or life imprisonment. This decision is solely in your discretion. If one or more jurors finds that life imprisonment is the appropriate penalty, then the result is a sentence of life imprisonment. Unless you unanimously agree that the prosecution has proven that the death penalty is the appropriate punishment beyond a reasonable doubt, you must return a verdict of life in prison.\n\nINSTRUCTION NO. 16\n\nThe first step in your deliberations is to consider whether one or more statutory aggravating factors is present. No other circumstances are sufficiently aggravating to support consideration of the death penalty in Colorado. Thus, no other aggravating circumstances shall be considered by you at any time during your deliberations. The aggravating factors relied upon by the prosecution in this case are:\n\n(a) The defendant intentionally killed a person kidnapped or being held as a hostage by him or anyone associated with him.\n\n(b) The defendant committed the offense in an especially heinous, cruel or depraved manner.\n\n(c) The murder was committed for the purpose of avoiding or preventing a lawful arrest or prosecution, or effecting an escape from custody. This factor shall include the intentional killing of a witness to a criminal offense.\n\n(d) On November 14, 1984, the Defendant was under sentence of imprisonment for a class 3 felony as defined by Colorado law.\n\n(e) The Defendant was a party to an agreement to kill Lorraine Martelli in furtherance of which Lorraine Martelli was intentionally killed.\n\n(f) The Defendant committed a class one, class two, or class three felony and in the course of or in furtherance of the felony, he intentionally caused the death of a person other than one of the participants.\n\n(g) The Defendant committed the First Degree Murder for pecuniary gain.\n\nAfter you have discussed these aggravating factors, you shall take a vote to determine whether the prosecution has proven the existence of one or more of these aggravating factors beyond a reasonable doubt. The presumption in favor of life imprisonment shall be given effect by you until and unless it is overcome by the prosecution beyond a reasonable doubt. Your deliberations during step one can lead to one of three results:\n\n1. If one or more of the jurors believe that the prosecution has not proven one or more aggravating factors beyond a reasonable doubt, then you shall enter a verdict of life imprisonment.\n\n2. If all jurors agree that the prosecution has not proven the existence of one or more aggravating factors beyond a reasonable doubt, then you shall enter a verdict of life imprisonment.\n\n3. If all jurors unanimously agree that the prosecution has proven the existence of one or more aggravating factors beyond a reasonable doubt, then you shall continue your deliberations by going on to the next instruction.\n\nINSTRUCTION NO. 19\n\nThese seven alleged aggravating factors are the only aggravating factors you may consider in this case.\n\nThe fact that you have found Mr. Rodriguez guilty of the crime of murder in the first degree is not an aggravating factor. Except as required by the alleged aggravating factor No. f listed in Instruction No. 16, the fact that you have found Mr. Rodriguez guilty of other crimes is not an aggravating factor.\n\nINSTRUCTION NO. 20\n\nYou may consider as a mitigating factor any doubt you may have about Mr. Rodriguez's role or actions in this case.\n\nYou may consider as a mitigating factor that Mr. Rodriguez's co-defendants have received sentences less than the death penalty.\n\nYou may consider as a mitigating factor Mr. Rodriguez's early family and upbringing.\n\nYou may consider as a mitigating factor Mr. Rodriguez's relationship with his family.\n\nYou may consider as a mitigating factor the influence of drugs and alcohol on Frank Rodriguez's behavior.\n\nYou may consider as a mitigating factor evidence of remorse by the Defendant.\n\nYou may consider as a mitigating factor any other factor which constitutes a reason for not imposing a death sentence.\n\nINSTRUCTION NO. 21\n\nIf in the first two steps of your deliberations you have made unanimous findings that the prosecution has proven beyond a reasonable doubt that one or more aggravating factors exist and that no mitigating factors exist, or that a mitigating factor or factors exist, you must now decide whether the prosecution has proven that any factors in mitigation do not outweigh the aggravating factor or factors.\n\nIn the third step of your deliberations you must weigh the aggravating factor or factors found to exist against any and all mitigating factors. This is not a mere counting process in which aggravating factors are weighed against mitigating factors. Rather, it is a process in which you must apply your reasoned judgment in deciding whether the situation calls for life imprisonment or requires the imposition of the death penalty, in light of the totality of the circumstances present.\n\nThe number of factors found is not determinative. The jury may emphasize one factor more than another in a particular case. You must consider the relative substantiality and persuasiveness of the existing aggravating and mitigating factors in making this determination.\n\nYour deliberations during this step of the proceeding can lead to one of three results:\n\n1. If one or more of the jurors believe that a mitigating factor or factors outweigh the aggravating factor or factors found to exist, then the jury shall enter a verdict of life imprisonment.\n\n2. If all jurors unanimously agree that a mitigating factor or factors outweigh the aggravating factor or factors found to exist, then the jury shall enter a verdict of life imprisonment.\n\n3. If all jurors unanimously agree that there are no mitigating factors or there are not sufficient mitigating factors that outweigh the aggravating factor or factors found to exist, then the jury shall determine if death is the appropriate punishment in this case.\n\nINSTRUCTION NO. 22\n\nEach of you must also decide for yourself what weight to give each mitigating circumstance that you find exists. Your decision as to what weight to give any mitigating circumstances does not have to be unanimous. You do not have to take the decisions, opinions or feelings of any other juror into account, although you may do so if you wish.\n\nINSTRUCTION NO. 23\n\nThe manner of inflicting the punishment of death in the State of Colorado is by the administration of lethal gas. You must assume that the penalty of death will be carried out if imposed by the Court pursuant to the jury verdict.\n\nINSTRUCTION NO. 26\n\n\"Mitigating circumstances\" are circumstances which do not constitute a justification or excuse for the offense in question, but which, in fairness or mercy, may be considered as extenuating or reducing the degree of moral culpability.\n\nINSTRUCTION NO. 28\n\nYour decisions must represent the considered judgment of each juror. In order to return a decision sentencing the Defendant, it is necessary that each juror agree to it. Your sentencing decision must be unanimous. If you are unable to unanimously agree on a sentencing decision, your foreperson shall sign the Report of Inability to Reach a Verdict.\n\nDisposition\n\nJUDGMENT AND SENTENCE OF DEATH AFFIRMED\n\nCHIEF JUSTICE QUINN dissenting:\n\nI join in Justice Lohr's and Justice Kirshbaum's dissenting opinions and write separately to point out additional infirmities which, in conjunction with the errors outlined by Justices Lohr and Kirshbaum, impaired the reliability and certainty constitutionally essential to a death sentence and concomitantly vitiated the fairness of the capital sentencing hearing.\n\nThe constitutionally required elements of reliability and certainty mandate that the jury not be led to believe that the responsibility for determining the ultimate appropriateness of a death sentence rests elsewhere. Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985); People v. Drake, 748 P.2d 1237 (Colo. 1988); People Durre, 690 P.2d 165 (Colo. 1984). In this case, the trial court instructed the jury in Instruction No. 25 as follows:\n\nYou are instructed that for purposes of sentencing, Counts One [first degree murder after deliberation] and Two [felony-murder] merge and the Defendant will receive a life sentence.\n\nThe Court must sentence the Defendant to a life sentence on Counts Three through Nine. The decision on whether to impose all of those sentences, or part of them, concurrently or consecutively, is upon the Court.\n\nAs I discussed in my dissent in People v. Davis, 87SA288, slip op. at 12 (Colo. May 14, 1990) (Quinn, C.J., dissenting), this instruction \"created the potential for jury confusion on whether the jury verdicts were advisory only or indeed were final and binding decisions on the ultimate issue of life imprisonment or death.\" Instruction No. 25 served no purpose other than to add to the uncertainty with respect to whether the jury or the court had the ultimate responsibility for determining the appropriateness of the death sentence in this case.\n\nI agree with Justice Lohr's observations that the jury instructions and verdict forms in this case did not comply with this court's decision in People v. Tenneson, 788 P.2d 786 (Colo. 1990). Tenneson requires the trial court to instruct the jury that it must be convinced beyond a reasonable doubt not only that any mitigating factors do not outweigh the proven aggravating factors, but also that death is the appropriate penalty, before a sentence of death may be imposed. I would simply repeat here, as I did in Davis, slip op. at 12-14 (Quinn, C.J., dissenting), that I continue to adhere to the view that the formulation of the \"proof beyond a reasonable doubt\" standard in terms of mitigating factors not outweighing any proven aggravating factors is incompatible with federal and state constitutional standards applicable to a capital sentencing hearing. See Tenneson, 788 P.2d at 802-08 (Quinn, C.J., dissenting).\n\nThe certainty and reliability essential to a death verdict was further impaired in this case by Instructions 16 and 18, which permitted the jury to consider as an aggravating circumstance not only the fact that the defendant intentionally killed the victim whom he kidnapped, but also the fact that the defendant intentionally caused the death of the kidnapped victim in the course of or in furtherance of the crime of second degree kidnapping, a class two felony.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e This duplicate use of the same aggravating circumstances for essentially the same purpose is incompatible with the constitutional requirement that a capital sentencing scheme guide and focus the jury's objective consideration of the particularized circumstances of both the crime and the offender in determining whether death is the appropriate punishment. See, e.g., Jurek v. Texas, 428 U.S. 262, 273-74, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976); Cook v. State, 369 So.2d 1251, 1256 (Ala. 1979); Randolph v. State, 463 So.2d 186, 193 (Fla. 1984), cert. denied, 473 U.S. 907, 87 L. Ed. 2d 656, 105 S. Ct. 3533 (1985); Francois v. State, 407 So.2d 885, 891 (Fla. 1982), cert. denied, 458 U.S. 1122, 73 L. Ed. 2d 1384, 102 S. Ct. 3511 (1982); Provence v. State, 337 So.2d 783, 786 (Fla. 1976), cert. denied, 431 U.S. 969, 53 L. Ed. 2d 1065, 97 S. Ct. 2929 (1977); State v. Rust, 197 Neb. 528, 250 N.W.2d 867, 874 (Neb. 1977); cert. denied, 434 U.S. 912, 54 L. Ed. 2d 198, 98 S. Ct. 313 (1977); State v. Goodman, 298 N.C. 1, 257 S.E.2d 569, 587 (N.C. 1979). Such duplicate use of the same aggravator \"fosters the very type of arbitrary and capricious decision-making that is constitutionally prohibited in a capital sentencing proceeding.\" Davis, 87SA288 slip op. at 19-20 (Quinn, C.J., dissenting).\n\nBecause a sentence of death is unique in both its severity and finality, an appellate court reviewing a death verdict is constitutionally obligated to closely review any colorable claim of error. Zant v. Stephens, 462 U.S. 862, 885, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983). The cumulative effect of the errors in this case, both those outlined by Justices Lohr and Kirshbaum in their dissents and those mentioned herein, cannot be resolved by resort to a harmless error analysis. These errors so impaired the reliability and certainty constitutionally mandated for a valid death verdict and so undermined the fairness of the capital sentencing hearing as to require that the death sentence be vacated.\n\nJUSTICE LOHR dissenting:\n\nIn the death penalty cases that have reached this court, we have consistently emphasized the heightened degree of reliability and certainty necessitated by the unique and irrevocable nature of the death penalty. People v. Tenneson, 788 P.2d 786 (Colo. 1990); People v. Drake, 748 P.2d 1237, 1254 (Colo. 1988); People v. Durre, 690 P.2d 165, 173 (Colo. 1984). In so doing, we have echoed the commands of the United States Supreme Court. See, e.g., Mills v. Maryland, 486 U.S. 367, 383-84, 100 L. Ed. 2d 384, 108 S. Ct. 1860 (1988); Lockett v. Ohio, 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978); Woodson v. North Carolina, 428 U.S. 280, 303-05, 49 L. Ed. 2d 944, 96 S. Ct. 2978 (1976). Because I do not believe that the sentencing phase of Frank D. Rodriguez's trial contained sufficient guarantees of this required level of reliability and certainty, I respectfully dissent.\n\nI.\n\nIn order to avoid violating the eighth amendment's\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea proscription of cruel and unusual punishments, a capital sentencing scheme must meet at least two requirements. First, it must limit and direct the sentencing body's discretion, e.g., Maynard v. Cartwright, 486 U.S. 356, 362, 100 L. Ed. 2d 372, 108 S. Ct. 1853 (1988); Booth v. Maryland, 482 U.S. 496, 502, 96 L. Ed. 2d 440, 107 S. Ct. 2529 (1987); Godfrey v. Georgia, 446 U.S. 420, 427-28, 64 L. Ed. 2d 398, 100 S. Ct. 1759 (1980); Gregg v. Georgia, 428 U.S. 153, 189, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976), thereby narrowing the class of persons eligible for the death penalty. Lowenfield v. Phelps, 484 U.S. 231, 244, 98 L. Ed. 2d 568, 108 S. Ct. 546 (1988); Zant v. Stephens, 462 U.S. 862, 877, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983). Second, it must permit the sentencing body to consider any relevant mitigating evidence concerning the defendant's character and background and the circumstances of the crime. E.g., Boyde v. California, 494 U.S. 370, 110 S. Ct. 1190, 1196, 108 L. Ed. 2d 316 (1990); Penry v. Lynaugh, 492 U.S. 302, 109 S. Ct. 2934, 2946, 106 L. Ed. 2d 256 (1989); Eddings v. Oklahoma, 455 U.S. 104, 110-12, 71 L. Ed. 2d 1, 102 S. Ct. 869 (1982).\n\nIn an effort to comply with these constitutional requirements, the Colorado legislature has adopted a sentencing procedure that includes four distinct steps.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e First, the jury must determine if at least one of the statutory aggravating factors exists. §§ 16-11-103(2)(a)(I), -(6). Second, the jury must consider whether any mitigating factors exist. §§ 16-11-103(2)(a)(II), -(5). Third, the jury must determine whether the mitigating factors outweigh the proven statutory aggravating factors. § 16-11-103(2)(a)(II). Fourth, and finally, the jury must decide whether the defendant should be sentenced to death or to life imprisonment. § 16-11-103(2)(a)(III).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e I would hold that errors in the jury instructions governing each of these steps require reversal.\n\nII.\n\nThe penalty phase instructions presented two erroneous aggravators to the jury: the especially heinous, cruel or depraved aggravator and the under sentence of imprisonment aggravator.\n\nA.\n\nThe trial court submitted to the jury the statutory aggravating factor that \"[t]he defendant committed the offense in an especially heinous, cruel, or depraved manner.\" § 16-11-103(6)(j), 8A C.R.S. (1986). This aggravating factor is violative of the eighth amendment under the United States Supreme Court's holding in Maynard v. Cartwright, 486 U.S. 356, 100 L. Ed. 2d 372, 108 S. Ct. 1853 (1988). See also Godfrey, 446 U.S. at 428-29. The majority concedes this but concludes that the erroneous instruction presenting this aggravator to the jury as one of the criteria to be employed in deciding whether to sentence the defendant to death was harmless beyond a reasonable doubt. Maj. op. at 33-36.\n\nI continue to adhere to my dissenting view in People v. Davis, 794 P.2d 159 (Colo. 1990), that such a harmless error analysis amounts to \"no more than a guess as to what the jury might have decided had it been properly instructed.\" Id. at 3 (Lohr, J., dissenting); see also id. at 21 (Quinn, C.J., dissenting). The Colorado death penalty statute \"requires a fact-finding jury to balance mitigating and aggravating circumstances in reaching its ultimate decision.\" Id. at 1-2 (Kirshbaum, J., dissenting). It does not contemplate an appellate court determining whether a jury would have returned a death verdict had it been instructed on more narrowly defined aggravating factors. Such a determination would inevitably involve appellate courts in the weighing of redefined aggravating factors and mitigating factors for the first time on appeal. In fact, appellate courts in this state do not have the authority to conduct fact-finding. E.g. People in re D.G.P., 194 Colo. 238, 242, 570 P.2d 1293, 1295 (1977); Godfrey v. People, 168 Colo. 299, 301, 451 P.2d 291, 292 (1969). This court is not authorized to \"engage in the type of credibility evaluation and evidentiary comparisons contemplated by the weighing process required by our death penalty statute.\" Davis, slip op. at 2 (Kirshbaum, J., dissenting). The jury that has heard the testimony and seen the witnesses is the only body possessing adequate information and legal authority to find the facts and to make the difficult moral judgment required by the weighing process.\n\nFurthermore, the question under harmless error analysis is \"whether the error substantially influenced the verdict or affected the fairness of the trial proceedings.\" People v. Gaffney, 769 P.2d 1081, 1088 (Colo. 1989); accord Kotteakos v. United States, 328 U.S. 750, 765, 90 L. Ed. 1557, 66 S. Ct. 1239 (1946). In this case the error is of constitutional significance, and therefore, we must be satisfied beyond a reasonable doubt that it was harmless. Satterwhite v. Texas, 486 U.S. 249, 258-59, 100 L. Ed. 2d 284, 108 S. Ct. 1792 (1988); Chapman v. California, 386 U.S. 18, 24, 17 L. Ed. 2d 705, 87 S. Ct. 824 (1967).\n\nIn People v. Tenneson, we held that before sentencing a defendant to death, a jury must be convinced beyond a reasonable doubt that any mitigating factors do not outweigh the proven statutory aggravators. In so doing we demanded from the jurors a high level of confidence in their decision. I cannot now conclude, beyond a reasonable doubt, that the jury's decision to impose the death penalty in the present case was unaffected by the invalid aggravator.\n\nIn support of its conclusion that submission of the invalid aggravator was harmless, the majority notes that the jury found five other statutory aggravators, that the defense counsel conceded that these aggravating factors had been proven beyond a reasonable doubt, that there was \"overwhelming evidence supporting\" those other five aggravating factors, and that the prosecution did not overly rely on the invalid statutory aggravator in its closing arguments. Maj. op. at 35-36. The majority's first three contentions amount to a single reason: that the existence of five valid statutory aggravators makes the submission of a sixth invalid aggravator harmless.\n\nI reject this proposition. The jury was instructed that under Colorado's statutory scheme the weight, not the number, of the various factors is important. Some aggravators may have taken on far greater importance than others for particular jurors. A juror might for example have found the cruelty of the murder much more compelling than the fact that the murder occurred under circumstances that would legally amount to second-degree kidnapping. Under Colorado's weighing statute, I do not believe that the mere number of valid statutory aggravators can compensate for the possible influence of a single invalid aggravator.\n\nThe majority's final reason for concluding that the invalid aggravator was harmless is that the prosecution did not \"overly stress or rely on\" the invalid factor in its closing. In fact, the prosecution repeatedly emphasized what it argued to be the cruel, heinous and depraved character of this killing. The prosecution argued that these adjectives perfectly fit the defendant's conduct and that this aggravating factor \"has to weigh heavily in this case.\" One of the prosecutors talked about the blood and violence associated with a killing by stabbing, referring to thrusting a knife in and out of soft human flesh and feeling the knife smash through tissue and arteries in the vital organs. He stated that the defendant \"butchered\" his victim, that the method of killing was \"particularly despicable,\" that it was a \"gruesome,\" \"agonizingly slow\" death, and that \"[o]ne can hardly imagine a worse way to die.\" The prosecution repeatedly emphasized the brutality of the rapes that preceded the victim's death and invited the jurors to consider how disgusting it would be to be anally raped by the defendant. The prosecutors used the word \"torture\" eight times during their closing arguments. The prosecution argued that the defendant does \"these cruel and heinous things . . . because he enjoys them.\" These characterizations of the defendant's conduct are not relevant to other statutory aggravating factors, and the constant emphasis placed on them by the prosecution increases the likelihood that the invalid especially cruel, heinous or depraved aggravator influenced the jury. I am unable to conclude beyond a reasonable doubt that the erroneous submission of this instruction to the jury was harmless.\n\nB.\n\nThe trial court submitted to the jury the aggravating factor that the defendant was under sentence of imprisonment, see § 16-11-103(6)(a), 8A C.R.S. (1986), because Rodriguez was on parole at the time of the murder.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e I continue to adhere to my dissenting view in People v. Davis, 794 P.2d 159 (Colo. 1990), that this aggravator was not intended to include persons on parole. Id. at 4-5 (Lohr, J., dissenting); see also id. at 15-18 (Quinn, C.J., dissenting).\n\nSeveral reasons support this interpretation. The principle of lenity requires a court to adopt the construction of an ambiguous criminal statute that favors the defendant. People v. Lowe, 660 P.2d 1261, 1267 (Colo. 1983). A principal drafter of the death penalty statute testified before a legislative committee that this aggravator was intended to apply to \"a person [who] is in prison serving a felony sentence and murders somebody.\" Davis, slip op. at 35-36. Finally, the legislature's subsequent amendment of this provision in 1988, adding the phrase \"including the period of parole, or on probation,\" § 16-11-103(6)(a), 8A C.R.S. (1988 Supp.), indicates an intention to change the preexisting law. See Charnes v. Lobato, 743 P.2d 27, 30 (Colo. 1987) (\"The general rule is that when a statute is amended, it is presumed that the legislature intended to change the law.\"). These reasons are explained more fully in Davis, slip op. at 4-5 (Lohr, J., dissenting).\n\nIII.\n\nA capital sentencing statute must permit the sentencing body to consider any relevant mitigating evidence regarding the defendant's character and background, and the circumstances of the offense. E.g., Boyde, 110 S. Ct. at 1196; Penry, 109 S. Ct. at 2946. The United States Constitution does not permit a capital sentencing scheme to require that the sentencing body unanimously agree upon the existence of mitigating factors before those factors are weighed against aggravating factors. McKoy v. North Carolina, 494 U.S. 433, 110 S. Ct. 1227, 1229, 108 L. Ed. 2d 369 (1990); Mills, 486 U.S. at 384.\n\nThe defendant argues that instruction no. 21 could have been misinterpreted by the jurors to require that they unanimously agree upon mitigators. It states in pertinent part:\n\nIf in the first two steps of your deliberations you have made unanimous findings that the prosecution has proven beyond a reasonable doubt that one or more aggravating factors exist and that no mitigating factors exist, or that a mitigating factor or factors exist, you must now decide whether the prosecution has proven that any factors in mitigation do not outweigh the aggravating factor or factors.\n\n(Emphasis added.)\n\nWe considered an instruction identical in all respects relevant to the unanimity issue in People v. Davis, 794 P.2d 159, slip op. at 69-75 (Colo. 1990). I continue to adhere to the view expressed in my dissent from Davis that the ambiguity of this instruction makes it impossible to conclude that no reasonable juror could have interpreted it to require a unanimous finding that a particular mitigating factor existed before that factor could be taken into consideration in the weighing process required in step three of the jury deliberations.\n\nThe question is whether there is a \"reasonable likelihood\" that the jury interpreted the instruction in a constitutionally impermissible way. Boyde, 110 S. Ct. at 1198. If a reasonable person might derive an impermissible meaning from the instructions in a capital case, reversal is required. Andres v. United States, 333 U.S. 740, 752, 92 L. Ed. 1055, 68 S. Ct. 880 (1948) (\"In death cases doubts such as those presented here should be resolved in favor of the accused.\").\n\nThe majority states that \"the only requirements of unanimity imposed by the instructions relate to the finding of specified aggravating factors and the verdict of death\" and that \"[t]here was no affirmative instruction that the jury could not consider or give effect to a mitigating factor if the jury was not unanimous.\" Maj. op. at 31. These conclusory statements ignore the defendant's contention that instruction no. 21 may be interpreted to impose such a unanimity requirement.\n\nThe majority also emphasizes that no verdict form required the jury to indicate which mitigating factors it had found to exist, maj. op. at 29-30, and that the jurors were not instructed that they had to vote on the existence of mitigating factors. Maj. op. at 31. Although the instructions may not have explicitly called for such a vote, the instructions establish a four-step framework in which the jurors are told to decide which mitigating factors exist in step two and then to decide what weight to assign those factors in step three. Instruction no. 21 could be interpreted by a reasonable juror to mean that only those mitigators unanimously found to exist in step two remain in consideration during the weighing process of step three. The various statements in the instructions that the jurors need not agree upon the weight they assign to particular mitigating factors do not contradict this interpretation.\n\nIV.\n\nI also believe that the instructions and verdict forms in this case do not comply with the requirements we enunciated in People v. Tenneson, 788 P.2d 786 (Colo. 1990). In Tenneson, we held that the prosecution must convince the jury beyond a reasonable doubt that any mitigating factors do not outweigh the proven statutory aggravating factors and that death is the appropriate penalty.\n\nAlthough there are two places in the instructions in which the law is correctly stated,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e the verdict forms and those portions of the instructions that provide detailed guidance to the jury in step three of its deliberations omit reference to the beyond a reasonable doubt burden. The relevant verdict form states:\n\nWe, the jury, find that there are insufficient mitigating factors to outweigh the aggravating factor or factors which have been proved by the prosecution beyond a reasonable doubt.\n\nThe paragraph of instruction no. 15 that explains step three of the jury deliberations states that \"[i]f and only if the jury finds that one or more specified aggravating factors outweigh the mitigating factors, the jury then should proceed to the fourth step.\"\n\nInstruction no. 21 supplies the detailed guidance for the jury in conducting its step three deliberations. The instruction states in part:\n\nIf all jurors unanimously agree that there are no mitigating factors or there are not sufficient mitigating factors that outweigh the aggravating factor or factors found to exist, then the jury shall determine if death is the appropriate punishment in this case.\n\nNowhere in instruction no. 21 is the relevant burden of proof set forth.\n\nIn Tenneson, we wrote \"[t]he qualitatively unique and irretrievably final nature of the death penalty 'makes it unthinkable for jurors to impose the death penalty when they harbor \"a reasonable doubt as to its justness.\"'\" 788 P.2d at 792 (quoting State v. Bey, 112 N.J. 123, 548 A.2d 887, 903 (N.J. 1988) (quoting State v. Biegenwald, 106 N.J. 13, 524 A.2d 130, 155 (N.J. 1987)). We emphasized the enhanced need for certainty and reliability in death sentencing proceedings. Id. ; see also Drake, 748 P.2d at 1254; Durre, 690 P.2d at 173. I would hold that the failure of the verdict form and these instructions to comport with Tenneson, despite correct statements of the law elsewhere in the instructions, created an unacceptable risk that the jury did not consider the appropriate burden in its step three deliberations.\n\nV.\n\nThe defendant argues that the jury instructions in this case improperly permitted the jury to consider nonstatutory aggravating factors in its step four determination of the appropriateness of the death penalty. The majority apparently concedes that the Colorado sentencing scheme limits the step four deliberations to considering the previously proven statutory aggravating factors along with any mitigating factors. Maj. op. at 41-42. The question, therefore, is whether the instructions in this case could have reasonably been interpreted to permit the jury to consider other factors.\n\nSeveral of the instructions are relevant. Instruction no. 15 states:\n\nThe fourth step in your deliberations is to decide whether the defendant should be sentenced to death or life imprisonment. This decision is solely in your discretion.\n\n(Emphasis added.) Instruction no. 16 states in part:\n\nThe first step in your deliberations is to consider whether one or more statutory aggravating factors is present. No other circumstances are sufficiently aggravating to support consideration of the death penalty in Colorado. Thus, no other aggravating circumstances shall be considered by you at any time during your deliberations.\n\nInstruction no. 21 provides no guidance for the jury during its step four deliberations. It states simply that \"then the jury shall determine if death is the appropriate punishment in this case.\"\n\nThe relevant verdict form states in pertinent part:\n\nHaving found that aggravating factor(s) were proven beyond a reasonable doubt and based upon all the evidence presented, we further find that death is the appropriate punishment in this case beyond a reasonable doubt. (Emphasis added.)\n\nThe ambiguity of these instructions and the omission of any detailed instruction to guide the jury's deliberations in step four is of particular concern in light of the nonstatutory factors emphasized by the prosecution in its closing argument. For example, the prosecution mentioned that the defendant might someday escape if he were sentenced to prison, and that in committing the murder the defendant had engaged in \"conduct rarely seen in Colorado.\" The prosecution also told the jury about the amenities available in prison at Canon City, how \"[n]obody wants to support this man for the rest of his life,\" and that he \"does not have that spark of humanity we all must have to live.\"\n\nI would hold that the limited guidance provided by the instructions combined with the prosecution's discussion of non-statutory aggravating factors in its closing arguments created an unacceptable risk that the jury's decision was influenced by factors that are not comprehended among those that properly may be considered under Colorado's statutory scheme.\n\nVI.\n\nIn light of the heightened reliability we have consistently demanded in death sentencing procedures, I would hold that the errors discussed above, singly and in combination, sufficiently undermine the fairness and certainty of the death sentence returned in this case to require reversal. I would reverse the sentence of death and return the case to the trial court with directions to impose a sentence of life imprisonment.\n\nJUSTICE KIRSHBAUM dissenting:\n\nI join part II(A) of Justice Lohr's dissent. The trial court instructed the jury that one of the aggravating factors relied upon by the prosecution was the \"especially heinous, cruel and depraved manner\" in which the crime was committed. This particular aggravator has been declared violative of eighth amendment standards by the United States Supreme Court in Maynard v. Cartwright, 486 U.S. 356, 100 L. Ed. 2d 372, 108 S. Ct. 1853 (1988), by this court in People v. Davis, 794 P.2d 159 (Colo. 1990), and now by the majority in this case. Maj. op. at 34, 35. The majority then declares that the trial court's violation of every citizen's fundamental right to be protected from cruel and unusual punishment must be deemed harmless error because the evidence established five other aggravating factors and because if properly instructed the jury would have found \"that the murder was 'conscienceless or pitiless, and [was] unnecessarily torturous to the victim.'\" Maj. op. at 38.\n\nIn my view, the majority misapplies Clemons v. Mississippi, 494 U.S. 738, 110 S. Ct. 1441, 108 L. Ed. 2d 725 (1990), the case upon which it purports to rely. In Clemons, the Supreme Court held that the Mississippi Supreme Court, which apparently possesses authority to weigh or balance evidence on appeal, could, consistent with federal constitutional standards, undertake a re-weighing process itself to determine if, absent the unconstitutional aggravator, the jury would nonetheless have imposed a sentence of death. 110 S. Ct. at 1449. The court then reversed the judgment and remanded the case for further proceedings because it could not determine whether, if appellate re-weighing had occurred, the state appellate court \"sufficiently emphasized the importance of the sentencer's consideration of a defendant's mitigating evidence.\" Id. at 1450. The court also opined that in some circumstances a harmless error analysis might pass constitutional muster and remanded the case for the further reason that it could not determine what harmless error analysis, if any, the state appellate court had applied. Id. at 1451.\n\nI assume that the majority has elected not to perform any appellate re-weighing of the evidence, although its references to this court's recent decision in People v. Davis, 794 P.2d 159 (Colo. 1990), cast doubt on this assumption. I continue to believe that any appellate re-weighing of evidence is beyond the appellate authority of this court, especially in capital cases, where the General Assembly has carefully allocated to the factfinder the sole authority to impose a sentence of death. See Clemons v. Mississippi, 110 S. Ct. at 1447; Hicks v. Oklahoma, 447 U.S. 343, 345-46, 65 L. Ed. 2d 175, 100 S. Ct. 2227 (1980); see People v. Davis, 794 P.2d 159 (Colo. 1990), (Kirshbaum, J., dissenting).\n\nIn stating that the trial court's constitutional error was harmless, the majority initially observes that the evidence admissible to establish the unconstitutional aggravator was also admissible to establish five other aggravators. Maj. op. at 37. The majority also suggests that if an instruction properly limiting the unconstitutional aggravator had been given, the evidence would have established the existence of such newly defined aggravator. Maj. op. at 38. The question under our balancing statute is not what evidence was properly admitted, or what facts were or probably would have been established beyond a reasonable doubt. The ultimate question is whether and, if so, how an appellate court can determine that one juror did not beyond a reasonable doubt give impermissible weight to the unconstitutional aggravator the jury was instructed to consider. The suggestion that the existence of five other aggravators satisfies constitutionally-based concerns about the propriety of the jury's weighing process contravenes our death penalty statute. Under that statute, as the trial court's instructions properly stated,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003eb a sentencing jury must not be influenced by the number of aggravating or mitigating factors established by the evidence when weighing such factors. See maj. op. at 11; People v. Tenneson, 788 P.2d 786 (Colo. 1990).\n\nAs this court pointed out in People v. Tenneson, 788 P.2d at 790, the question in this jurisdiction under our balancing statute is whether the jury, having found a properly defined aggravator, could then conclude beyond a reasonable doubt that any mitigating factors did not outweigh the aggravating factors. To determine that the jury here would have found as a fact a matter about which it was never instructed -- that the murder was conscienceless or pitiless -- and then determine that the jury would have reached the same result in the absence of the instruction it was given is in effect to require this court to perform factfinding and balancing functions the General Assembly has committed to the sole discretion of the finder of fact. This form of analysis, whether denominated harmless error or re-weighing, turns this court into a super-jury in appeals from sentences in capital cases. I find no statutory authority or common law precedent for such result.\n\nI also disagree with the majority's conclusion that the prosecution did not overly emphasize this particular aggravator. Maj. op. at 36. From its initial comment on the evidence (\"This sort of conduct is rarely seen in Colorado\") through its reference to the weight to be given this aggravator (\"Of course, that aggravator applies to this case. It has to weigh heavily in this case; the cruel heinous nature of the way he killed her.\") to its final summation (\"Remember all the things you heard about that terrible murder and add to it all the aggravating factors\"), the prosecution emphasized the brutal nature of the defendant's admittedly vicious conduct. The prosecution was justified in doing so at trial because the trial court had informed the jury that it could consider the especially heinous, cruel, and depraved factor and could conclude that this particular factor alone outweighed all mitigating factors. The instructions were erroneous, however, and I cannot conclude beyond a reasonable doubt either that no juror reached his or her decision by following these instructions or that every juror would have reached the same decision if different instructions had been given.\n\nFor the foregoing reasons, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. The jury found the defendant guilty of first-degree sexual assault, § 18-3-402, 8B C.R.S. (1986); first-degree aggravated motor vehicle theft, § 18-4-409; second-degree kidnapping, § 18-3-302; aggravated robbery, § 18-4-302; conspiracy to commit murder in the first degree, § 18-2-201; conspiracy to commit second degree kidnapping, § 18-2-201; conspiracy to commit first degree aggravated motor vehicle theft, § 18-2-201; as well as five counts of using a deadly weapon during the commission of the above offenses. After the close of the guilt phase, the court held a habitual criminal sentencing hearing. The defendant has not appealed from either the guilt phase or habitual criminal phase of the trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. After submission of the appeal, this court granted a request of the prosecution for a limited remand to the trial court. See People v. Rodriguez, 786 P.2d 1079 (Colo. 1989). The proceedings in the trial court have been completed. See People v. Rodriguez, 794 P.2d 964 (Colo. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. C.A.R. 28(g) provides that the principal briefs of both parties shall not exceed 30 pages without permission of court. A reply brief shall not exceed 18 pages except by permission of the court. The court granted both the defense and prosecution motions to exceed the page limits set forth in the rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. U.S. Const. amend. XIV, § I; Colo. Const. art. II, § 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. U.S. Const. amend. VI; Colo. Const. art. II, § 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. U.S. Const. amend. VIII; Colo. Const. art. II, § 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. On appeal, the defendant maintains that defense counsel did not make contemporaneous objections to many of the alleged improper arguments because the trial judge ordered him not to, and to sit down during the prosecutor's argument. While the trial judge did tell defense counsel to sit down, we do not believe that her comments could reasonably be interpreted to foreclose objections to improper argument. See Part X below. Nevertheless, as discussed in the text of the opinion, because this is a capital case in which the defendant was sentenced to death, we choose to review the prosecutors' arguments as if defense counsel had made contemporaneous objections. Cf. Crim. P. 51 (\"But if a party has no opportunity to object to a ruling or order, the absence of an objection does not thereafter prejudice him.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The statute discussed in Tenneson was actually section 16-11-103, 8A C.R.S. (1986). It incorporated amendments made by the General Assembly in 1985 to subsection 1(b). See ch. 145, sec. 8, § 16-11-103, 1985 Colo. Sess. Laws 653; ch. 146, sec. 3, § 16-11-103, 1985 Colo. Sess. Laws 657. The differences between the 1984 and 1985 versions of the statute are minor and are not relevant to the issues raised on this appeal. In 1988, however, section 16-11-103 was substantially amended. See ch. 114, secs. 1 \u0026 2, § 16-11-103, 1988 Colo. Sess. Laws 673-75.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See also State v. Moore, 432 So. 2d at 222: It is not beyond the scope of normal human behavior and experience to imagine one's self in the shoes of a crime victim, and it is not inconceivable that many, if not all, of the jurors in this case, in viewing the evidence adduced at trial, took into account the emotions experienced by the victim prior to his death in rendering their verdict and penalty recommendation [of death]. We cannot view the prosecutor's argument in any vein other than as an appeal to the jury to apply their general knowledge and experience to the evidence adduced at trial before rendering their recommendation, and we are hereby unwilling to establish a rule which would per se prohibit the state from asking jurors to place themselves in the shoes of the victim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In the guilt phase of the trial, the jury found the defendant guilty beyond a reasonable doubt of first-degree sexual assault, a class 2 felony. § 18-3-402, 80 C.R.S. (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Chapman v. California, 386 U.S. 18, 24, 17 L. Ed. 2d 705, 87 S. Ct. 824 (1966), the Court stated that before a constitutional error can be held harmless, \"the court must be able to declare a belief that it was harmless beyond a reasonable doubt.\" The Chapman test is applicable to capital sentencing proceedings. Clemons v. Mississippi, 494 U.S. 738, 110 S. Ct. 1441, 1450, 108 L. Ed. 2d 725 (1990); Satterwhite v. Texas, 486 U.S. 249, 258, 100 L. Ed. 2d 284, 108 S. Ct. 1792 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. For example, in Mills the Court stated: \"Unless we can rule out the substantial possibility that the jury may have rested its verdict on the 'improper' ground, we must remand for resentencing.\" Id. at 377 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In his closing argument, defense counsel told the jury: You have to decide whether or not the mitigating factor as to the punishment the other people received in this case, how much those are worth in comparison to these aggravating factors, and if you don't like the factors the court has given to you, if you think there are other factors that you think justify a life sentence, then you can rely upon those factors. Each and everyone of you individually can rely on any factor you wish to return a life sentence. You don't have to be unanimous on those factors. (Emphasis added.) Neither the prosecutors nor the trial court contradicted this argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The capital sentencing statute was amended in 1989 to define the terms \"cruel,\" \"depraved,\" and \"heinous,\" as used in section 16-11-103(6)(j). Ch. 148, sec. 37, § 16-11-103(6.5), 1989 Colo. Sess. Laws 828. (a) \"Cruel\" means intentional infliction of physical or psychological torture, and includes the pitiless infliction of pain or suffering with utter indifference to, or the enjoyment of, the suffering of others. (b) \"Depraved\" means senseless or committed without purpose or meaning, or that the murder was not the product of greed, envy, revenge, or another of those emotions ordinarily associated with murder, and served no purpose for the defendant beyond his pleasure of killing. (c) \"Heinous\" means using a particularly shocking or brutal method of killing, or a killing in which the victim is unable to physically defend himself because of physical or mental disability or because he is too old or too young. § 16-11-103(6.5), 8A C.R.S. (1989 Supp.). Since the jury in this case was not given these limiting instructions we do not decide whether they are adequate to satisfy the dictates of Maynard v. Cartwright, 486 U.S. 356, 100 L. Ed. 2d 372, 108 S. Ct. 1853, and Godfrey v. Georgia, 446 U.S. 420, 64 L. Ed. 2d 398, 100 S. Ct. 1759 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. While it is certainly true that the offense in this case was particularly shocking and brutal almost beyond comprehension, we do not believe that the brutality of the crime itself can save this statutory aggravating factor. In Maynard v. Cartwright, 486 U.S. 356, 100 L. Ed. 2d 372, 108 S. Ct. 1853, the Court stated: \"[Godfrey v. Georgia, 446 U.S. 420, 64 L. Ed. 2d 398, 100 S. Ct. 1759 (1980)] plainly rejected the submission that a particular set of facts surrounding a murder, however shocking they might be, were enough in themselves, and without some narrowing principle to apply to those facts, to warrant the imposition of the death penalty.\" Id. at 363.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The jury found the existence of the following statutory aggravating factors beyond a reasonable doubt: (1) the defendant intentionally killed a person kidnapped by him, § 16-11-103(6)(d); (2) the defendant committed a class 1, 2, or 3 felony and intentionally caused the death of someone other than a participant, § 16-11-103(6)(g); (3) the defendant was a party to an agreement to commit murder, § 16-11-103(6)(e); (4) the defendant was under a sentence of imprisonment when the murder occurred, § 16-11-103(6)(a); (5) the murder was committed for the purpose of avoiding or preventing arrest -- including killing a witness, § 16-11-103(6)(k); and (6) the murder was committed in a heinous, cruel, or depraved manner, § 16-11-103(6)(j). The jury did not find, as alleged by the prosecution, that the murder was committed for pecuniary gain, § 16-11-103(6)(h).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Defense counsel stated during closing argument: Before you reach this ultimate question though, the one of whether or not death is appropriate, you have to take some intermediate steps. The first one is: Do these aggravating factors exist? There is no question they do. Mr. Silverman [the prosecutor] put them up for you in graphic display. There is no question they have proven them beyond a reasonable doubt. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The defendant's argument that the instructions denied him his constitutional right to trial by jury is really a due process claim, so we do not address it separately.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Instruction No. 16 stated: The first step in your deliberations is to consider whether one or more statutory aggravating factors is present. No other circumstances are sufficiently aggravating to support consideration of the death penalty in Colorado. Thus, no other aggravating circumstances shall be considered by you at any time during your deliberations. (Emphasis added.) Similarly, Instruction No. 19 provided in part that \"[t]hese seven alleged [statutory] aggravating factors are the only aggravating factors you may consider in this case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See footnote 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The complicity instruction stated: A person is guilty of an offense committed by another person if he is a complicitor. To be guilty as a complicitor, the following must be established beyond a reasonable doubt: 1. A crime must have been committed 2. Another person must have committed all or part of the crime 3. The defendant must have had knowledge that the other person intended to commit all or part of the crime 4. The defendant did intentionally aid, abet, advise, or encourage the other person in the commission or planning of the crime. The defendant has not appealed the guilt phase of the trial, and thus raises no issue with respect to the propriety and correctness of the complicity instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The tendered instruction provided: In the first part of this trial, you were instructed on the principle of complicity, by which a person may be criminally liable for the actions of another. You are instructed that this principle does not apply in the penalty phase of this trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We do not reach the question whether it would have been error for the trial court to have given the anti-complicity instruction as requested. We note, however, that the instruction as tendered is considerably broader than the holdings in either Tison or Enmund would justify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The defendant challenged the propriety of instructing the jury on the \"kidnapping\" aggravator as one of many issues included in an appendix to his opening brief. Instruction No. 16 listed as two of the seven aggravating factors submitted to the jury for its consideration the following: (a) The defendant intentionally killed a person kidnapped or being held as a hostage by him or anyone associated with him. (f) The defendant committed a class one, class two, or class three felony and in the course of or in furtherance of the felony, he intentionally caused the death of a person other than one of the participants. Instruction No. 18 informed the jury that second degree kidnapping is a class two felony. 1a U.S. Const. amend. VIII. The Colorado Constitution also prohibits cruel and unusual punishments. Colo. Const. art. II, § 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. § 16-11-103 was amended substantially on April 11, 1988. Ch. 114, secs. 1 and 2, § 16-11-103, 1988 Colo. Sess. Laws 673-75.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. These four steps are described in greater detail in People v. Tenneson, 788 P.2d at 789.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The defendant raised this issue in the trial court but on appeal presented it only generally in a list of additional issues contained in an appendix to his opening brief and by mention in his reply brief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Instruction no. 3 states in part: In order to return a verdict of death, you must be convinced beyond a reasonable doubt that a mitigating factor or factors do not outweigh any aggravating factors found to exist and that the death penalty is the appropriate penalty. Instruction no. 15 states in part: Colorado law allows the death penalty only if the prosecution . . . proves beyond a reasonable doubt that: 1. One or more of the specified aggravating factors exist beyond a reasonable doubt; and 2. No mitigating factor or factors exist; or 3. No mitigating factor or factors outweigh the aggravating factor or factors found to exist beyond a reasonable doubt; and 4. That death is the appropriate punishment in this case. 1b Instruction No. 21, as submitted to the jury contains the following statements: In the third step of your deliberations you must weigh the aggravating factor or factors found to exist against any and all mitigating factors. This is not a mere counting process in which aggravating factors are weighed against mitigating factors. Rather, it is a process in which you must apply your reasoned judgment in deciding whether the situation calls for life imprisonment or requires the imposition of the death penalty, in light of the totality of the circumstances present. The number of factors found is not determinative. The jury may emphasize one factor more than another in a particular case. You must consider the relative substantiality and persuasiveness of the existing aggravating and mitigating factors in making this determination.\u003c/span\u003e\n\n",
    "body_length": 150720,
    "citedas": [
      "794 P.2d 965"
    ],
    "attorneys": "Duane Woodard, Attorney General, John D. Dailey, Deputy Attorney General, Appellate Section, Robert M. Petrusak, Assistant Attorney General, Joan C. White, Special Assistant Attorney General, Denver, Colorado, Attorneys for Plaintiff-Appellee. David F. Vela, Colorado State Public Defender, Michael J. Heher, Deputy State Public Defender, Denver, Colorado Attorneys for Defendant-Appellant.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "En Banc. Justice Erickson delivered the Opinion of the Court. Chief Justice Quinn dissents. Justice Lohr dissents, Chief Justice Quinn joins in the dissent, and Justice Kirshbaum joins in part II(A) of the dissent. Justice Kirshbaum dissents, and Chief Justice Quinn and Justice Lohr join in the dissent.",
    "citation_count": 5
  }
}
