{
  "id": "p8_2YWYBTlTomsSByjse",
  "document": {
    "title": "Saldana v. State",
    "full_title": "MARO SALDANA (DEFENDANT), v. THE STATE OF WYOMING (PLAINTIFF).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1993-01-28T00:00:00.000Z",
    "docket": "No. 90-24.",
    "body": "Rehearing Denied February 24, 1993.\n\nThe foremost question presented in this case arises out of the claim of Maro Saldana (Saldana) that the State unlawfully invaded his reasonable expectation of privacy with respect to telephone company records for an unlisted telephone number. His specific contention is that certain records concerning telephone calls made to, and from, his unlisted telephone number at his residence were seized, or otherwise intercepted, in violation of Wyo. Const. art. 1, § 4 and Wyo. Stat. §§ 7-3-601 to -610 (Supp. 1990) and, because of the violation of the Constitution and statutes, those telephone company records should not have been admitted as evidence at his trial. Saldana also asserts the admission of certain papers seized from his bedroom dresser drawer, together with testimony of an investigative agent that interpreted those documents to the jury, deprived him of his constitutional right to confrontation. In addition, Saldana contends testimony by the investigative agent was presented as an opinion regarding his guilt and as an opinion concerning credibility of various witnesses so that the testimony usurped the role of the jury. All of these assertions of error by Saldana culminate in his contention that, if the improper evidence had not been admitted, there would not be sufficient evidence in the record to sustain his conviction for the crime of possession of cocaine with intent to deliver. Our review of the record in light of our statutes and controlling precedent leads us to conclude that no reversible error occurred in connection with Saldana's trial, and the judgment and sentence is affirmed.\n\nAs set forth in his Brief of the Appellant, Saldana presents the issues in the case as follows:\n\n1. Was the evidence presented insufficient to sustain Appellant's conviction?\n\n2. Was Agent Arter's testimony concerning his opinion of appellant's guilt and the credibility of various witnesses inadmissible and denied Appellant his right to a jury trial?\n\n3. Did the admission of the papers found in the dresser drawer violate Appellant's right to confrontation?\n\n4. Whether Appellant's phone records and the derivative evidence were seized in violation of Article 1, Section 4 of the Wyoming Constitution and therefore inadmissible as evidence.\n\n5. Whether the Appellant's telephone toll records were intercepted in violation of § 7-3-601 et seq. W.S. (1990 Cum. Supp.) and therefore were inadmissible.\n\nIn its brief, the State of Wyoming states the issues in this way:\n\nI. Whether sufficient evidence was presented to convict appellant of possession of cocaine with the intent to deliver, in violation of W.S. 35-7-1031(a)(i).\n\nII. Whether DCI Agent Mike Arter gave his opinion on the guilt of the appellant and the credibility of witnesses.\n\nIII. Whether it was proper to admit evidence concerning papers which were found on appellant's bureau during the search of his house.\n\nIV. Whether the records of appellant's telephone calls should have been admitted.\n\nV. Whether the use of appellant's telephone records violated W.S. 7-3-601 through 7-3-610, which proscribes the unauthorized interception of telephone conversations.\n\nLate in February of 1989, a package containing four and one-half ounces of uncut cocaine was shipped from Green Bay, Wisconsin to Torrington, Wyoming via United Parcel Service (UPS). The shipper was identified as \"Bob Haeger,\" and the package was addressed to one Hilario Torres (Torres). Torres was an unemployed laborer from Texas who was temporarily residing in the basement of the Saldana home. Saldana lived upstairs with his wife and children.\n\nThe package arrived in Torrington, but it could not be delivered at the time because it was addressed incorrectly and, as a result, had to be returned to Green Bay. \"Bob Haeger\" could not be contacted in Green Bay and, in accordance with standard UPS policy, UPS officials opened the unclaimed parcel in an effort to determine the identity of the shipper or an alternate address. The cocaine that was discovered when the package was opened by UPS was turned over to appropriate law enforcement personnel.\n\nNo one who could be identified as \"Bob Haeger\" ever did inquire about this package. Nevertheless, numerous telephone calls were received by the UPS office in Green Bay regarding the package. As a product of those calls, together with some information from the UPS driver in Wyoming, sufficient information was developed to reveal that Saldana's brother, Umero, actually sent the package, and the Saldana residence in Torrington was the intended destination. Umero Saldana previously had been convicted at least once for trafficking in cocaine.\n\nThe Division of Criminal Investigation (DCI) of the Attorney General's office in Wyoming entered the case when the Green Bay/Brown County, Wisconsin, multijurisdictional drug task force informed the DCI Wisconsin authorities had intercepted a parcel that was shipped to Torrington, Wyoming and contained a large quantity of cocaine. The addressee was identified as a person in the Torrington area named \"Hilario Torres.\" An arrangement was made pursuant to which the resealed package was hand delivered to Mike Arter, a Wyoming DCI agent, on March 2, 1989. The same day, Arter obtained a search warrant and reopened the package. In addition to a jar containing four and one-half ounces of rock cocaine mixed in with coffee grounds, the box contained some empty paper sacks and a pair of worn boots. After it was searched, the package was, again, resealed, and Arter, attired as a UPS driver and operating one of its vans, took it to the Saldana address. Saldana's wife advised Arter the package was expected, but Torres was not at home. She then signed a receipt acknowledging delivery.\n\nAgent Arter returned to the UPS truck but, approximately ten minutes later, he went back to the Saldana residence on the pretext that UPS needed some additional information contained on a \"next day\" shipping label he had forgotten to remove before delivering the package. On this occasion, Saldana answered the door. After hearing Arter's explanation, Saldana went down to the basement and returned with the package which had not been opened. Torres came upstairs later, after he was informed his signature was needed. The testimony in the record discloses Torres seemed confused but, nevertheless, he did as he was asked. The receipt obtained at that time, containing Torres' signature and his handwriting sample, subsequently was lost and was not offered into evidence at trial. After Torres' signature had been obtained, Arter then signaled to two other agents who were waiting outside, and both Torres and Saldana were arrested. Torres seemed unable to speak English, and it appeared to the agents he did not comprehend what was happening.\n\nAgent Arter then obtained a search warrant for the Saldana residence and the package that had been delivered, and the package was opened once more. The rock cocaine and the other contents of the package were identical to those Arter had observed before he resealed the package after opening it when it was hand delivered to him. Other items that were seized, pursuant to the search warrant, included some scraps of paper taken from a dresser drawer located in the Saldana's master bedroom. One of these pieces of paper had written on it \"1 oz. front 2-10-89 paid $1,000.00\" and \"front 2-12-89 paid 825 owes 575.\" There was another, purportedly signed by Federico Saldana, that listed Federico Saldana's address and contained the words \"to pay 1/yr.\" Federico also is a brother of Saldana and, like Umero, previously had been convicted of trafficking in cocaine. With respect to this latter document, Christine Saldana, the Saldanas' daughter, testified she, not Saldana, had written the second note and it related only to a sale of a used Pontiac Tempest by her father to his brother. Additional pieces of paper were seized from the kitchen during the course of the search of the Saldanas' house, and these contained handwriting referring to the return address of the package, the UPS tracking number, the UPS telephone number, and various other \"things of that nature.\"\n\nWithin a short time, the authorities in Wyoming decided Torres was not a part of any drug trafficking scheme, and he had been manipulated to the end that he permitted his name to be used for the address on the package containing the cocaine. He was released from custody and permitted to return to Texas. Saldana was charged with possessing cocaine with intent to deliver in violation of Wyo. Stat. § 35-7-1031(a)(i) (1988). He was found guilty after a trial to a jury, and the trial court sentenced him to a term of not less than two and one-half years nor more than seven years in the Wyoming State Penitentiary with credit allowed for 333 days previously served prior to his sentence. It is from that judgment and sentence Saldana appeals. We will state the facts in more detail as they relate to the several issues Saldana poses.\n\nSaldana asserts in his brief \"[p]erhaps the linchpin of the state's case against Appellant was the introduction and interpretation of Appellant's phone records and derivative evidence,\" and he then argues this evidence was obtained in violation of the provisions of Wyo. Const. art. 1, § 4, and Wyo. Stat. §§ 7-3-601 to -610 (Supp. 1990). Saldana's conclusion is that evidence obtained in violation of the constitution and the statute is not admissible at his trial. The significance of the contested evidence must be conceded, although its total impact may not be as significant as Saldana claims because there are additional facts pointing to his guilt. We must reject Saldana's contention and argument, however, and hold that the telephone records were lawfully obtained and were admissible into evidence.\n\nWith regard to the telephone records, Agent Arter testified he had obtained, through use of the federal subpoena power, since \"the State of Wyoming doesn't have an investigative subpoena power,\" information that connected Saldana to an unlisted telephone number given to the UPS office in Green Bay by an unidentified caller. Through the use of the federal subpoena power, records of telephone calls, made from Saldana's residence and the homes of his two brothers, Federico and Umero, for a period of time extending both before and after delivery of the package containing cocaine, also were obtained. A request for this information previously had been denied by the telephone company, and no state warrant for obtaining the evidence ever was sought. Specifically, Arter testified as follows:\n\nQ: You obtained phone records?\n\nA: That's correct, sir.\n\nQ: And when did you start that process, and what was that process?\n\nA: I started the process almost — actually, to backtrack a little bit, I started the process prior to even delivery of the package.\n\nDuring our investigation with help from that of our counterparts in Green Bay, one of the times that the UPS was called about the package was by a man giving his identity as Homer, who later identified himself as Umero Saldana. He gave a delivery address, the corrected delivery address of what Mr. Saldana's real address is, and he also gave a delivery phone number. The delivery phone number was a local phone number here in Torrington, of course, and I checked that phone number through — who handles yours? It is not U.S. West.\n\nQ: United.\n\nA: United Telephone, yes. I checked that through United telephone. It was a nonpublished number. In order for any law enforcement agencies to get information on a nonlisted number, we have to get a search warrant. In this case — because the State of Wyoming doesn't have an investigative subpoena power. In this case the DEA was also working on the case on this due to the fact that it came from Wisconsin and the amount of drugs involved.\n\nQ: Let's back up. DEA, what agency or what part of our government does that refer to?\n\nA: The Department of Justice.\n\nQ: So that is federal?\n\nA: Yes, sir, we are talking federal.\n\nQ: Federal Department of Drug Enforcement Administration?\n\nA: That's correct, sir. They also had a case start on this, but since I was the case agent, I just merely kept them informed as to what was going on, and they gave me any support they can or any input.\n\nThrough one of the agents with DEA, Special Agent Larry Gregory, we submitted a federal subpoena for the records of United Telephone to determine, number one, who owned the return telephone number, the number that was given. That number was cement [sic] out to me that the person who owned that number was in fact Maro Saldana at the address indicated.\n\nFrom there it sort of stayed for awhile until the package was delivered and everything else from there was my determination that since we did have someone from another state involved that there was a need to see if they communicated, so I subpoenaed, again, through the federal subpoena power — or had Special Agent Gregory subpoena — the phone tolls for a several month period, two months prior to the delivery and the month after.\n\nWhen I received these tolls, I did basically analysis of where the calls were going to. The numbers that I could check that was not nonpublished, I checked to determine who they belonged to the toll calls he had made; and the ones that were nonpublished, if I felt they were germane to the investigation, I got a subpoena and tried to obtain the records also.\n\nQ: All right. Whose phone records from Wisconsin did you obtain in terms of the toll calls?\n\nA: Through the investigation of Mr. Saldana, Maro Saldana's phone records, there was frequent calls to the Green Bay area to several numbers, one being the 465-0171, which was the number of Michele Senechal, who is now the wife of Umero Saldana. Umero Saldana gave the address of 846 Edgewood, which was, of course, her address.\n\nI obtained a subpoena for those toll records. Through also the analysis of Maro Saldana's, I noticed that he called his other brother an unusual amount of times, Federico, and I obtained a federal subpoena to get those phone records.\n\nArter continued to testify about the number and the length of the calls made between Saldana's residence and the residences of Umero and Federico. His interpretation of this telephone activity was that it indicated certain members of Saldana's family were calling other members to keep them informed as to what was happening.\n\nWhen cross-examined about this testimony, Arter conceded there was no way of knowing who was talking to whom from the information developed by a search of the telephone records. On redirect examination, Arter then testified:\n\nQ: You were asked by Mr. Newlon whether you know who made the calls, and you indicated that you did. What I would like to ask you, not what your opinion is as to who made the calls, but why do you think you know who made the calls?\n\nA: Through the investigation that I have conducted and just the experience and the details of the case, it is obvious to me that the calls were made by Maro Saldana. When I was in the house and interviewed both his wife and his daughters, it was fairly obvious to me that the wife and daughters did nothing in that house without the permission of Maro Saldana.\n\nThe wife was, as we interviewed her, she was terrified of the results of his implication here and more from him than what had [sic] considered. There was indication from all the daughters, and the mother, that they were not allowed to use the phone. He told them that they weren't even allowed to answer the phone unless he had told them to. He made those type of phone calls. The phone calls from the month in question was over $266. It is hard for me to understand, how he would allow them to make that type of commitment for phone bills like that on their own sake and not his. I am convinced that he made those calls.\n\nWe have acknowledged many times the constitutional guarantee against government intrusion into an individual's legitimate expectation of privacy through an unreasonable search and seizure. The guarantee is found in both Wyo. Const. art. 1, § 4, and U.S. Const. amend. IV. Goettl v. State, 842 P.2d 549 (Wyo. 1992); King v. State, 780 P.2d 943 (Wyo. 1989); Pellatz v. State, 711 P.2d 1138 (Wyo. 1986). See United States v. Chadwick, 433 U.S. 1, 97 S.Ct. 2476, 53 L.Ed.2d 538 (1977). See also Stanford v. State of Texas, 379 U.S. 476, 85 S.Ct. 506, 13 L.Ed.2d 431, reh'g denied, 380 U.S. 926, 85 S.Ct. 879, 13 L.Ed.2d 813 (1965); Mapp v. Ohio, 367 U.S. 643, 81 S.Ct. 1684, 6 L.Ed.2d 1081, reh'g denied, 368 U.S. 871, 82 S.Ct. 23, 7 L.Ed.2d 72 (1961); Wolf v. People of State of Colorado, 338 U.S. 25, 69 S.Ct. 1359, 93 L.Ed. 1782 (1949). This protection is broad, but it is not absolute. Katz v. United States, 389 U.S. 347, 88 S.Ct. 507, 19 L.Ed.2d 576 (1967). See Jessee v. State, 640 P.2d 56, reh'g denied, 643 P.2d 681 (Wyo. 1982); Neilson v. State, 599 P.2d 1326 (Wyo. 1979), cert. denied, 444 U.S. 1079, 100 S.Ct. 1031, 62 L.Ed.2d 763 (1980). The courts have drawn a balance between the interest of the state in protecting its citizens from the criminal conduct of others and its interest in preserving the freedom of the individual from overly intrusive governmental invasion. Consequently, the rule has developed that any search, assuming first that it does invade a subjective and legitimate expectation of privacy sufficient to invoke the constitutional protections, must be unreasonable in order to be impermissible. United States v. Sharpe, 470 U.S. 675, 105 S.Ct. 1568, 84 L.Ed.2d 605 (1985); Chadwick; United States v. Miller, 425 U.S. 435, 96 S.Ct. 1619, 48 L.Ed.2d 71 (1976); Katz; King; Jessee; Neilson; State v. George, 32 Wyo. 223, 231 P. 683 (1924).\n\nWhether a search is reasonable is to be determined from the facts and circumstances of the case in light of the \"fundamental criteria\" that are found in the Fourth Amendment, as those criteria have been interpreted and defined in the opinions of the Supreme Court. Berger v. State of New York, 388 U.S. 41, 87 S.Ct. 1873, 18 L.Ed.2d 1040 (1967); Ker v. State of California, 374 U.S. 23, 83 S.Ct. 1623, 10 L.Ed.2d 726 (1963); George. The question of reasonableness does not arise, unless there has been an intrusion upon a legitimate expectation of privacy. Pellatz. The primary, and often ultimate, test for determining whether evidence must be suppressed, at least in the federal arena, has evolved into the determination of whether \"the individual's expectation, viewed objectively, is `justifiable' under the circumstances.\" Smith v. Maryland, 442 U.S. 735, 740, 99 S.Ct. 2577, 2580, 61 L.Ed.2d 220 (1979). See Rakas v. Illinois, 439 U.S. 128, 99 S.Ct. 421, 58 L.Ed.2d 387 (1978), reh'g denied, 439 U.S. 1122, 99 S.Ct. 1035, 59 L.Ed.2d 83 (1979); United States v. Waupekenay, 973 F.2d 1533 (10th Cir. 1992).\n\nThe protection against unreasonable searches and seizures found in the Constitution of the State of Wyoming is virtually identical to that found in the federal constitution. U.S. Const. amend. IV; Wyo. Const. art. 1, § 4; State v. Hiteshew, 42 Wyo. 147, 292 P. 2 (1930). Even though the federal law establishes minimum requirements for individual protection and does not mandate any maximum criteria as to the degree of protection afforded an individual under state law, federal interpretations of the Fourth Amendment are regarded as persuasive and this court adheres to them closely absent some contrary direction from the legislature of the State of Wyoming. See U.S. Const. amend. X; Cheyenne Airport Bd. v. Rogers, 707 P.2d 717 (Wyo. 1985), appeal dismissed, 476 U.S. 1110, 106 S.Ct. 1961, 90 L.Ed.2d 647 (1986).\n\nThe facts in Smith are similar to those in the case before us, but they can be distinguished since Saldana maintained an unlisted telephone number while the petitioner in Smith did not. The Supreme Court of the United States in that case held that the warrantless use of a pen register, installed at police request on telephone company property at the telephone company central office, did not constitute a \"`search'\" invading a \"`legitimate expectation of privacy.'\" Smith, 442 U.S. at 742, 99 S.Ct. at 2581. The rationale in Smith was that people generally do not \"entertain any actual expectation of privacy in the numbers they dial\" since they realize they \"must `convey' phone numbers to the telephone company.\" Smith, 442 U.S. at 742, 99 S.Ct. at 2581. Furthermore, pen registers acquire only the numbers dialed and do not report any part of the actual communication so there is no interception of the contents of the conversation. The Supreme Court noted:\n\nIndeed, a law enforcement official could not even determine from the use of a pen register whether a communication existed. These devices do not hear sound. They disclose only the telephone numbers that have been dialed — a means of establishing communication. Neither the purport of any communication between the caller and the recipient of the call, their identities, nor whether the call was even completed is disclosed by pen registers.\n\nSmith, 442 U.S. at 741, 99 S.Ct. at 2581 (citing United States v. New York Tel. Co., 434 U.S. 159, 167, 98 S.Ct. 364, 369, 54 L.Ed.2d 376 (1977)).\n\nSaldana's situation is different from the facts in Smith, but the two cases match sufficiently that the same reasoning can apply in both. Smith is controlling to the extent that we hold the DCI's procurement of Saldana's telephone records, including those linking his name to his unlisted telephone number, does not constitute a \"search\" invading a \"legitimate expectation of privacy\" sufficient to demonstrate an invasion of Saldana's constitutional rights. Any person using a telephone, whether on legitimate business or otherwise, assumes a risk that the telephone can, and will, reveal the numbers that he dials. Smith. It may be that an unlisted number such as that used by Saldana affords to a party some greater subjective expectation of privacy than one would find in connection with a listed number like Smith's. That expectation is not more \"legitimate\" with respect to criminal investigations, however, because the purpose and the privacy protections of an unlisted number go only to veiling it from the general public by not including it in telephone books and directory assistance services. An unlisted number and the name of its owner are not affected any more with respect to its procurement through use of a subpoena or warrant than is the information acquired by a telephone company pen register, which is similarly veiled from public scrutiny. The fact that Saldana's telephone number was not listed, even though permitting increased expectation of privacy with respect to who might call him, is a distinction without a difference for the purposes of this case. Here there was no \"search\" that invaded a legitimate expectation of privacy and, for that reason, no warrant was required. The DCI did not infringe on Saldana's Fourth Amendment rights by acquiring information through the use of the federal DEA investigative subpoena.\n\nUnder the Tenth Amendment to the United States Constitution, the freedom of the state to provide greater expectations of privacy for its citizens than those provided under the federal constitution is guaranteed if, in either its legislative or judicial discretion, it deems it necessary or appropriate to do so. U.S. Const. amend. X; Cheyenne Airport, 707 P.2d 717. See United States v. Millstone Enterprises, Inc., 684 F. Supp. 867 (W.D.Pa. 1988), reversed on other grounds, 864 F.2d 21 (3d Cir. 1988); State v. Gunwall, 106 Wn.2d 54, 720 P.2d 808 (1986). Increased protection could be afforded to Wyoming citizens. It is our conclusion, however, that the substantial identity of the constitutional provisions involved does not suggest, nor do we perceive it appropriate in this instance to recognize, any increased protection as being afforded by our state constitution. U.S. Const. amend. IV; Wyo. Const. art. 1, § 4; Hinshaw.\n\nWe next turn to the statutes relied upon by Saldana, Wyo. Stat. §§ 7-3-601 to -611 (1987), to determine whether legislative discretion may have been invoked to expand the constitutional protection. Saldana claims that, under this Wyoming \"wire-tapping\" statute, the admission into evidence of his telephone records is prohibited. We rely upon the statute in the form that it had been adopted at the time of Saldana's conduct instead of at the later, and somewhat more expansive, version relied upon by Saldana. See Wyo. Stat. §§ 7-3-601 to -610 (Supp. 1990). Cf. Dellapenta v. Dellapenta, 838 P.2d 1153 (Wyo. 1992) (holding statutes are not applied retroactively absent clear legislative intent); Wyoming Refining Co. v. Bottjen, 695 P.2d 647 (Wyo. 1985); Johnson v. Safeway Stores, 568 P.2d 908 (Wyo. 1977). However, it is likely our resolution would be essentially the same under either version. Also, we reiterate our general rule that statutes will be strictly construed to cause them to comport with legislative intent and the first, and foremost, indicator of that intent is found within the language of the statute. Allied-Signal, Inc. v. State Bd. of Equalization, 813 P.2d 214 (Wyo. 1991); Johnson v. Statewide Collections, Inc., 778 P.2d 93 (Wyo. 1989); Halliburton Co. v. Adams, Roux \u0026 Assoc., Inc., 773 P.2d 153 (Wyo. 1989). Furthermore, no statute should be interpreted so that any portion of it would be rendered meaningless. Halliburton; Reliance Ins. Co. v. Chevron U.S.A., Inc., 713 P.2d 766 (Wyo. 1986).\n\nWyo. Stat. § 7-3-602 (1987) provided, in pertinent part:\n\n(a) Except as provided in subsection (b) of this section, no person shall willfully:\n\n(i) Intercept any wire or oral communication;\n\n(ii) Disclose to another person the contents of any wire or oral communication, knowing or having reason to know that the information was obtained through the interception of a wire or oral communication in violation of this section;\n\n(iii) Use the contents of any wire or oral communication knowing or having reason to know that the information was obtained through the interception of a wire or oral communication in violation of this section.\n\n(b) Nothing in subsection (a) of this section prohibits:\n\n(i) An officer, employee or agent of a communications common carrier from intercepting, disclosing or using a wire communication intercepted in the normal course of that person's employment if the interception is made only for mechanical or service quality checks or to protect the property of the communications common carrier;\n\n(ii) An officer, employee or agent of any communication common carrier providing information, facilities or technical assistance to a peace officer who is authorized pursuant to this act to intercept a wire or oral communication;\n\n(v) A peace officer from intercepting, using or disclosing to another peace officer in the course of his official duties any wire or oral communication pursuant to an order permitting the interception under this act;\n\n(c) Any person who violates this section is guilty of a felony punishable by a fine of not more than one thousand dollars ($1000.00), imprisonment for not more than five (5) years, or both.\n\nWyo. Stat. § 7-3-601(a)(iii) (1987) defines the contents of an oral or wire communication to be:\n\n(iii) \"Contents of an oral or wire communication\" includes information concerning the identity of the parties participating in the communication and the existence, meaning, substance or purport of the communication; * * *.\n\nWyo. Stat. § 7-3-601(a)(v) (1987) defines the word \"intercept\" to mean:\n\n(v) \"Intercept\" means the aural acquisition of the contents of any oral or wire communication by use of an electronic, mechanical or other device; * * *.\n\nThere are a few exceptions that are not pertinent in this instance, but the theme of the statute is to prohibit a person, with criminal sanctions attached to infractions, from willfully intercepting, disclosing, or using the contents of any wire or oral communication that is obtained in violation of the statute.\n\nSaldana's argument is that acquiring the identities of the parties participating in a communication amounts to acquiring the contents of that communication within the purpose of this statute. Numerous different individuals can, however, have access to any given telephone number and, consequently, obtaining information regarding the name of the person owning the telephone number does not constitute acquiring information even as to the identity of the parties who were involved in any given communication. In this regard, it is also noteworthy that Wyo. Stat. § 7-3-601(a)(iv) (1987) defines an \"electronic, mechanical or other device\" as:\n\n(iv) \"Electronic, mechanical or other device\" means any device or apparatus which can be used to intercept a wire or oral communication, other than:\n\n(A) Any telephone, telex or telegraph equipment, or component thereof, used in the ordinary course of business; * * *.\n\nThe equipment used to track the calls to, and from, Saldana's residence was equipment used by the telephone company to record connections in the interests of assessing charges in the ordinary course of its business. There is nothing in the record to indicate it was installed to intercept the contents of any wire or oral communication in contravention of the statute, and the information it furnished was specifically obtained for telephone company purposes. It was released to the authorities only under orders promulgated by virtue of a lawfully issued subpoena. It follows that, in light of Wyo. Stat. § 7-3-601(a)(iv) (1987), the devise was not an \"electronic, mechanical or other device,\" and the information obtained by virtue of this equipment was not \"intercepted.\"\n\nWe hold that the telephone toll records Saldana complains of were not \"intercepted,\" and they were not, in fact, acquired, disclosed, or used contrary to the provisions of Wyo. Stat. § 7-3-602(a) (1987). The increased expectation of privacy the statute affords was not breached in this instance, and Saldana's claims to the contrary are not efficacious. In addition, in reaching this result, we recognize that the acquisition of telephone number information is not \"aural acquisition of the contents of any oral or wire communication by use of an electronic, mechanical or other device,\" as is required for a violation of the statute. Wyo. Stat. § 7-3-601(a)(v) (1987) (emphasis added).\n\nWe next consider Saldana's contention that the testimony at trial encompassed testimony of an opinion concerning his guilt and an opinion relating to the credibility of certain witnesses, the result of which denied him his right to trial by jury. See U.S. Const. amend. VI; Wyo. Const. art. 1, § 9. These contentions relate to testimony by DCI Agent Arter in two separate areas. The first of those related to the interpretation of certain papers found during the search of the residence. The second related to comment upon the identification of an individual by a Mr. and Mrs. Cardeilhac as well as the explanation for the dismissal of the charge against Torres.\n\nTurning to the matter of the papers first, the record discloses that Agent Arter testified before the jury that the two papers taken from the bedroom of the home indicated a long-term trafficking in controlled substances; that the individuals involved in the trafficking trusted each other greatly; and that \"there was a knowledge of what was in the package.\" Specifically, Arter testified:\n\nIn the residence we picked up some papers that were recovered from the master bedroom of the Saldana residence which indicated to us through our experience, indicated trafficking in controlled substances, cocaine or something of that nature, or papers that indicated that there was a knowledge of what was in the package and that this type of thing had occurred before.\n\nDefense counsel had objected to the admission of these papers on the ground they were not relevant because no showing was made with respect to who actually wrote the allegedly incriminating memoranda and because the handwriting appeared to be that of two different people. Nonetheless, they ultimately were received into evidence.\n\nWith respect to identification of the individual by the other witnesses, the State attempted, during the trial, to tie one Greg Chisholm, referred to as a known narcotics dealer, into its case. In making this effort, the State relied in part on testimony provided by Mr. and Mrs. Cardeilhac, the owners of a resort area known as the Oregon Trail Lodge. Both Mr. and Mrs. Cardeilhac claimed they had observed a blond male in and around their property during the month of February. This fact was relevant in light of earlier testimony indicating that an individual identified as \"Hilario Torres\" had registered at the motel at approximately the same time. When shown a photograph of Chisholm, both of the Cardeilhacs testified the individual in the picture resembled the blond male they had observed, but they could not be certain it was the same man.\n\nThe State recalled Agent Arter, and he was permitted to testify as follows:\n\nWhat I did was I got a stack of photographs. I took a stack of individuals that are known to be involved in this case, the defendant, Maro Saldana, I took a photograph of Federico Saldana, Umero Saldana, Amato Saldana, Greg Chisholm, Hilario Torres, and I believe there was it. There were 7 or 8 pictures.\n\nDefense counsel objected to the introduction of the photograph and the surrounding testimony on the ground that the witnesses who had testified were unable to make a positive identification of the parties allegedly involved. The defense argued that introduction of the evidence would be unduly and unfairly prejudicial under such circumstances. That objection was overruled by the court, and Arter was permitted to continue with this subject.\n\nArter's testimony then was:\n\nThere was one other — I just remembered there was Henry Castro's photo, also. He was also someone I felt was tied into this case. I showed the photographs to the individuals, in a stack, and I explained to them just to — look at the face and page through them. There was no order that the photographs were in. They were just random.\n\nThey went through and immediately discarded several of them, stated that they had never seen the individual. They stopped at one and said he looked vaguely familiar; and when they got to the photograph of Greg Chisholm they both stopped, independently, and said this individual had been there, had been contacted for making numerous phone calls. There were problems with the phone calls. They told me the entire story about the phone calls, but both Mr. and Mrs. Cardeilhac both independently identified Greg Chisholm as the individual in that room that day.\n\nIn addressing Arter's testimony, Saldana specifically objected to the testimony concerning how the papers taken from his bedroom tended to establish prior drug trafficking and his knowledge that the package contained cocaine. Saldana also contends there was error on the part of the trial court in permitting Arter to testify that the quantity and purity of the substance demonstrated it was meant for distribution and the telephone calls between his residence and the residences of his brothers, and between his residence and the Oregon Trail Lodge, established that Saldana and his brothers were trying to let each other know what was going on regarding the missing package. Saldana's argument is that all of these subjects reflected directly on his guilt, and Agent Arter was offering an opinion as to his guilt. Finally, Saldana objects to the testimony concerning the identifications or the lack of identifications by Mr. and Mrs. Cardeilhac as well as Arter's testimony regarding the dismissal of Torres as both amounting to comments on the credibility of witnesses.\n\nIn Stephens v. State, 774 P.2d 60, 66 (Wyo. 1989), the court quoted from 3 CHARLES E. TORCIA, WHARTON'S CRIMINAL EVIDENCE § 566 at 324-25 (14th ed. 1987), saying:\n\nOrdinarily, the opinion of a lay or expert witness is not admissible if it amounts to a conclusion of law or a mixed conclusion of law and fact. Thus, a witness may not state his opinion as to * * * whether the defendant was guilty or innocent of the crime charged; * * *.\n\nThe court then held that \"permitting a witness, lay or expert, to articulate an opinion as to the guilt of the accused constitutes plain error and demands reversal.\" Stephens, 774 P.2d at 67. See also Phillips v. State, 835 P.2d 1062 (Wyo. 1992); Armstrong v. State, 826 P.2d 1106 (Wyo. 1992); Bennett v. State, 794 P.2d 879 (Wyo. 1990).\n\nIn addition to the testimony of Agent Arter, quoted above with respect to the papers seized during the search of the Saldana residence, Saldana points to the following testimony by Agent Arter as also encompassing a comment on his guilt:\n\nIn the residence we picked up some papers that were recovered from the master bedroom of the Saldana residence which indicated to us through our experience, indicated trafficking in controlled substances, cocaine or something of that nature, or papers that indicated that there was a knowledge of what was in the package and that this type of thing had occurred before.\n\nand additionally:\n\nQ. Now agent Arter, let's talk a little bit about 4 1/2 or 4 ounces plus of cocaine?\n\nA: Yes sir.\n\nQ: First of all, have you ever seen it in rock form like that before?\n\nA: Yes, I have, on many occasions.\n\nQ: And does that in itself signify something based on your experience?\n\nA: Based on my experience, it signifies it is for further distribution. Cocaine in that rock form means it was probably cut off a kilo size chunk of it. Cocaine when it is made and formed and shipped, it is shipped in kilo size packets in the rock, compressed form like that. When it is — when we intercept it in that way, it is either by a big dealer who is selling it, or through other people who are going to refine it to break it down into usable amounts, add adulterants to it, and then further put it out to the street to people that are actually going to use it.\n\nIt is very seldom we find someone for their personal use or someone who is not a distributor that has rock form of hydrochloric cocaine or cocaine hydrochloride in its form like that. It is usually in a powder already broke down and already cut, basically.\n\nQ: What is the basic, bottom-of-the-line amount in a street transaction, usually?\n\nA: Usually — and it varies from area to area — the area we work in the southeast here, we see deals that go for grams and as little as quarter grams, a quarter gram going for $25. The quarter gram is the basic user amount. What usually happens is a person who is buying will buy a gram itself, being about a hundred dollars worth. He will buy that gram. He will take half of it for his own personal use and not cut it. He will cut something else into the other half to equal his whole gram again, and then he will resell that gram either as a full gram or half gram or quarter gram to someone else. It is cut, cut down again. It is pretty weak as far as he is concerned, but he got half a gram of cocaine for his own use for that day, but he didn't spend a cent because he is getting his money back. That is the basic level we will see in this area.\n\nQ: A quarter gram, when you get down to a quarter gram, that's what you use?\n\nA: Basically, yes sir.\n\nQ: And what usually — what has been the purity found in those quarter gram transactions?\n\nA: Again, that varies from who you are getting it from, what the dealer is, who he is selling it to. Because if he is going to establish a clientele, he will keep it at a little higher level of purity. We have bought as low as 6 percent purity.\n\nThe normal, I would say, is somewhere between 20 and 25 percent, 20 to 25 percent being the cocaine, the other 75, 80 percent being some sort ever [sic] additive, adulterate.\n\nQ: So you are confident in the proposition that these 4 ounces plus of cocaine that you seized was not a consumer amount or quantity?\n\nA: No sir, I can't testify that one person was going to cut it down to the amounts we are talking about and sell it [out], but it was for distribution somewhere to be cut and put out in the streets in about 20 to 25 percent purity.\n\nThe specific testimony, furnished on redirect examination, regarding the significance of the long distance telephone calls was as follows:\n\nQ: So there is a suggestion here, perhaps, that members of the defendants family were calling other family members to let them know what was going on?\n\nA: Yes.\n\nThe selection of the particular testimony to which Saldana now objects suggests he would have us extend the holding in Stephens to reach, and exclude, all opinion testimony, expert or not, on any issue that could go to proving an element of the crime charged. Saldana's view is that any analysis offered by a witness on the evidence presented at trial is equivalent to a direct, and thus impermissible, comment on the defendant's guilt. We are not inclined to accept this premise, especially in light of the provisions of Wyo.R.Evid. 702 that permit opinion evidence even on an ultimate issue. Stephens; McCabe v. R.A. Manning Constr. Co., 674 P.2d 699 (Wyo. 1983). An interpretation of the evidence by a witness, even though that interpretation may be important in establishing an element of the crime and thus leading to the inference of guilt, is not in the same category as an actual conclusional statement on the guilt or innocence of the accused party. We are particularly firm in this determination if the record demonstrates the proffered opinion was helpful to the jury in determining the facts of the case and was elicited for that reason. Wyo.R.Evid. 702.\n\nThe inquiry by the court when claims like this are raised, assuming that proper objections are presented, must be whether the testimony sought to be elicited will constitute a direct, and therefore impermissible, opinion with respect to the innocence or guilt of the accused or whether it is nothing more than related information offered to assist the jury in resolving the factual issues placed before it. See Wyo. R.Evid. 702; Rivera v. State, 840 P.2d 933 (Wyo. 1992); Stephens; Lessard v. State, 719 P.2d 227 (Wyo. 1986). Testimony that is given only as an aid to the jury in its pursuit of the facts and does not address directly the guilt of the accused in a conclusional way does not deprive a defendant of the constitutional right to a trial by jury.\n\nIn our view, contrary to the contentions of Saldana, the comments of Agent Arter were not offered as opinions concerning Saldana's guilt; taken by themselves, they could be construed as not even directly implicating Saldana. The average person, a concept that probably includes at least some jurors in this case, is not knowledgeable with respect to matters involving commerce in cocaine. We perceive these comments, instead of being comments on Saldana's guilt, to be statements offered chiefly to the jury to aid it in understanding and resolving the factual issues of the case. We understand the devastating impact a witness perceived to be an expert in a particular field may have when he offers testimony interpreting other evidence and that testimony is contrary to the interests of the defendant. That does not require, however, that the jury be isolated in some constructive vacuum under the pretext all comment on evidence, no matter how unbiased or neutral it might be, is unfair to the accused. In our jurisprudence, the trial is a search for the truth, the identification of the truth being within the province of the jury, and that effort demands the jury be given the benefit of whatever assistance may lawfully be provided. There was no error in the admission of Agent Arter's testimony in this case.\n\nMuch the same thing is true about Saldana's contentions that Arter commented impermissibly on the credibility of the witnesses. When cross-examined with respect to the testimony provided by Mr. and Mrs. Cardeilhac as to their inability to positively identify Greg Chisholm, Agent Arter testified:\n\nQ: Now, when they identified this picture, I take it by your testimony it was a picture of Greg Chisholm; is that correct?\n\nA: That's correct.\n\nQ: How positive were they about that identification at that time?\n\nA: That they had seen this individual, or who he was?\n\nQ: Well, let's start with that they had seen him?\n\nA: Mr. Cardeilhac was immediately certain that that was the individual that was involved in a room and was making all the phone calls. Mrs. Cardeilhac said the same thing from the get-go. She said when she saw the picture, \"I know this guy. He was the one who made all the phone calls, and I had seen him outside.\" They were independently certain of it from the first time they saw the pictures.\n\nQ: Now, you used the word \"certain.\" You were sure in your mind that they were absolutely certain?\n\nA: In my mind, it was the first time they had ever seen the photo. It was an initial response that immediately struck to them. You could see their eyes lit up that they recognized him from somewhere, and their first words were the words that came out.\n\nI have a tendency to agree with that rather than when they get to the stand and are trying to swear to something. They were convinced. They have since talked themselves out of it.\n\nQ: So you think what they told you makes more difference than what they say here?\n\nA: I don't know that I said that. I hope you didn't understand that.\n\nThis court has held, on reasoning similar to the rationale in Stephens, that it is error for an expert witness to comment on the credibility of another witness. Zabel v. State, 765 P.2d 357 (Wyo. 1988). See Rivera; Lessard. The determination of credibility is exclusively within the province of the jury because the members of the jury are themselves the only \"experts\" in that area. Zabel. Nevertheless, testimony assisting the jury in understanding some aspect of the testimony of another witness that does not comment directly on that witness' credibility or veracity is not invasive of the role of the jury. Even though that testimony may have the collateral or incidental effect of either supporting or denigrating the other witnesses' statements, its admission does not constitute error. Zabel. See Griego v. State, 761 P.2d 973 (Wyo. 1988). In connection with this issue, reality demonstrates all testimony may affect the credibility of other testimony in one way or another.\n\nViewed superficially, this testimony may appear to be contrary to Zabel because it does contravene statements made by the Cardeilhacs without providing any additional information helpful to the jury. We recognize, however, that this testimony was elicited by defense counsel in cross-examination of a key prosecution witness. It was not developed by the State. For that reason, there is no need to analyze its impact. If the error was made, it was the error of the defendant, not that of the State of Wyoming, and we will not charge it to the prosecution. This sort of product is one of the hazards of cross-examination. Even though we find nothing improper in this particular instance, we do recognize that, if reversible error is found under this situation, precedent is established that would be regarded in the future as permitting a defense attorney to create error if it looked like the trial was leading to an unfortunate result for his client. We do not think the constitutional guarantee of a fair trial requires that such an opportunity be made available. In this instance, we also note, even though the testimony was elicited by the defendant, no motion was made to strike it. Under these circumstances, we cannot conclude there was error committed in its introduction.\n\nWith respect to Arter's testimony about the investigative disposition of the case against Torres, any tie between that testimony and Torres' testimony is tenuous at best. We see no merit to the contention by Saldana that Arter's testimony that Torres was not charged because he was \"convinced beyond any doubt that he had no part in this plan to receive or deliver cocaine\" constitutes any comment on the credibility of the witness. Arter was merely reporting what had happened in connection with the case. As we noted earlier, there is no requirement that the jury work in a vacuum in order to insure the guarantees of a fair trial. In concluding the analysis of this issue, we reiterate the rule that evidentiary matters are generally within the sound discretion of the trial court, and that discretion will not be overturned on appeal absent clear indications it has been abused. L.U. Sheep Co. v. Bd. of County Comm'rs of Hot Springs County, 790 P.2d 663 (Wyo. 1990); Arnold v. Mountain West Farm Bureau Mutual Ins. Co., 707 P.2d 161 (Wyo. 1985). There was no abuse in this instance.\n\nThe next claim to be addressed is Saldana's contention that the introduction of the papers found in his dresser drawer violated his right to confrontation. See Wyo. Const. art. 1, § 10. Essentially, Saldana is claiming these papers were hearsay, and he then elaborates by asserting the \"documents\" were out-of-court statements admitted without a showing of the unavailability of the witness and without fitting them into any recognized exception to the hearsay rule. We conclude these papers do not fit within the definition of hearsay found in Wyo.R.Evid. 801(c):\n\nHearsay. — \"Hearsay\" is a statement, other than one made by the declarant while testifying at the trial or hearing, offered in evidence to prove the truth of the matter asserted.\n\nOne of the papers carried language reading \"1 oz. front 2-10-89 paid $1,000.00\" and \"front 2-12-89 paid 825 owes 575.\" The other simply listed Federico Saldana's address and contained the words \"to pay 1/yr.\" We understand these notations are the out-of-court statements complained of by Saldana. As he acknowledges in his brief, these \"documents\" were offered as circumstantial evidence of his past trafficking in controlled substances and of his knowledge regarding the illicit contents of the package. They were not offered to establish the quantity and price of drugs, Federico's address, or any other matter contained therein. Consequently, since these papers were not offered \"to prove the truth of the matter asserted,\" they simply do not constitute hearsay. Saldana's creative claim in this regard fails for that obvious reason. Wyo.R.Evid. 801(c). The papers were evidence properly admitted at trial, and no error was committed by the court in receiving them.\n\nSaldana's last claim of error obviously depends upon his success with respect to some of the other claims. We have resolved those other issues contrary to Saldana's argument. We still consider the question whether the admissible evidence presented at trial, viewed collectively, was sufficient to sustain Saldana's conviction. The standard with respect to sufficiency of evidence is this court's assessment as to whether all of the evidence presented is \"adequate to support a reasonable inference of guilt beyond a reasonable doubt to be drawn by the finder of fact, viewing the evidence in the light most favorable to the state.\" Lopez v. State, 788 P.2d 1150, 1152 (Wyo. 1990); Schiefer v. State, 774 P.2d 133 (Wyo. 1989); Washington v. State, 751 P.2d 384 (Wyo. 1988). See Wehr v. State, 841 P.2d 104 (Wyo. 1992) (citing Dreiman v. State, 825 P.2d 758 (Wyo. 1992)); Jennings v. State, 806 P.2d 1299 (Wyo. 1991); Kavanaugh v. State, 769 P.2d 908 (Wyo. 1989); Dangel v. State, 724 P.2d 1145 (Wyo. 1986). We do not substitute our judgment for that of the jury in applying this rule, and our only duty is to determine if a quorum of reasonable and rational individuals would, or even could, have come to the same result the jury actually did. See Munson v. State, 770 P.2d 1093 (Wyo. 1989); Corson v. State, 766 P.2d 1155 (Wyo. 1988); Wells v. State, 613 P.2d 201 (Wyo. 1980). We do not serve as a second jury involved in assessing factual matters that apply to the case at hand according to our own perspective. Neither can we weigh the evidence nor re-examine the credibility of witnesses. Kavanaugh; Johnston v. State, 747 P.2d 1132 (Wyo. 1987). The judgment and sentence of the trial court must be affirmed if the test just stated is met.\n\nThe offense of which Saldana was convicted is encompassed in Wyo. Stat. § 35-7-1031(a) (1988). That statute provides, in pertinent part, that \"it is unlawful for any person to manufacture, deliver, or possess with intent to manufacture or deliver, a controlled substance.\" At trial, the jury was instructed:\n\nInstruction No. 6\n\nThe necessary elements of the crime of unlawful possession with intent to deliver a controlled substance, * * *, are:\n\n1. The crime occurred within the County of Goshen, State of Wyoming, on or about the date of March 2, 1989; and\n\n2. That the defendant possessed cocaine, a Schedule II narcotic drug controlled substance;\n\n3. That the defendant did so possess with a specific intent to deliver cocaine, a Schedule II narcotic drug controlled substance; and\n\n4. That the defendant did so knowingly and intentionally.\n\nIf you find from your consideration of all of the evidence that any of these elements has not been proved beyond a reasonable doubt, then you should find the defendant not guilty.\n\nIf, on the other hand, you find from your consideration of all of the evidence that each of these elements has been proved beyond a reasonable doubt, then you should find the defendant guilty.\n\nThere is no dispute by Saldana that the package addressed to Torres was delivered on March 2, 1989, nor that it contained cocaine. The only factual issue here before the jury is whether Saldana possessed the substance knowingly with an intent to deliver. The State's position is that, acknowledging the lack of actual possession on the part of Saldana, Saldana had constructive possession of the controlled substance, as that has generally been defined. The State contends this circumstance is sufficient to establish that element. The instruction given to the jury on this issue was:\n\nInstruction No. 7\n\nThe law recognizes two kinds of possession: actual possession and constructive possession. A person who knowingly has direct physical control over a thing, at a given time, is then in actual possession of it.\n\nA person who, although not in actual possession, knowingly has both the power and the intention, at a given time, to exercise dominion or control over a thing, either directly or through another person or persons, is then in constructive possession of it.\n\nThe law recognizes also that possession may be sole or joint. If one person alone has actual or constructive possession of a thing, possession is sole. If two or more persons share actual or constructive possession of a thing, possession is joint. You may find that the element of possession as that term is used in these instructions is present if you find beyond reasonable doubt that the defendant had actual or constructive possession, either alone or jointly with others.\n\nAn act or a failure to act is \"knowingly\" done, if done voluntarily and intentionally, and not because of mistake or accident or other innocent reason.\n\nThe State's position is correct that constructive possession is sufficient to meet the possession requirement in Wyoming controlled substance cases. The element of possession, in this instance constructive possession, may be established by circumstantial evidence. Wise v. State, 654 P.2d 116 (Wyo. 1982). See Deluna v. State, 501 P.2d 1021 (Wyo. 1972). Constructive possession is deemed present if the person charged as possessor has sufficient control over the party with actual possession that the illicit goods would be forthcoming at his command. As that concept was stated in Wise, 654 P.2d at 119:\n\nIf a defendant is sufficiently associated with the persons having physical custody so that he is able, without difficulty to cause the drug to be produced for a customer, he can also be found by a jury to have dominion and control over the drug and, therefore, possession.\n\nIn the trial in this case, the evidence presented to the jury was that Torres was an unemployed laborer temporarily residing in Saldana's basement. It appears from the record that, even though the package was addressed to him, he had no knowledge of the contents of the package in its unopened condition. Perhaps more importantly, the record demonstrates that Saldana went downstairs and brought the package back upstairs when he was requested to do so by Arter, posing as the delivery man. Under these circumstances, the reasonable jury certainly is entitled to infer constructive possession of the controlled substance. Since such a finding is both rational and plausible, it should not be disturbed.\n\nTurning to the element of the intent to deliver, the jury was provided evidence, again circumstantial, with respect to Saldana's connection with previously convicted drug dealers. Those individuals happened to be his brothers. There also was submitted admissible evidence that the quantity and purity of the cocaine in question was such that it would not be likely a possessor would have acquired it for personal use. Circumstantial evidence, which is \"proof of facts and circumstances from which the main fact to be proved reasonably follows according to common experience of mankind,\" is sufficient to establish the elements of a crime. Murray v. State, 671 P.2d 320, 328 (Wyo. 1983); Russell v. State, 583 P.2d 690 (Wyo. 1978). Cf. Jozen v. State, 746 P.2d 1279 (Wyo. 1987) (holding circumstantial evidence has equivalent standing to direct evidence in criminal prosecution). As was true with respect to the element of possession, the jury in this instance would be entitled to infer the intent to deliver based upon this evidence. We should not, nor will we, overrule its findings.\n\nIn summation, after analyzing all of the issues presented in this appeal, we conclude: Saldana was not denied the right to a jury trial because of statements that were admitted allegedly constituting comments on his guilt or because of testimony allegedly constituting comment on the credibility of witnesses; the admission of papers found in his personal dresser drawer did not violate his constitutional right to confrontation; his telephone records and other evidence derived therefrom were not seized in contravention of Wyo. Const. art. 1, § 4; and the same telephone records were not intercepted in violation of Wyo. Stat. § 7-3-601 to -611 (1987). We further determine that the admissible evidence presented at trial indeed is sufficient to sustain his conviction. The judgment and sentence of the trial court is affirmed.\n\nMACY, C.J., files a specially concurring opinion.\n\nGOLDEN, J., files a concurring opinion.\n\nURBIGKIT, J., Retired, files a dissenting opinion.\n\nMACY, Chief Justice, specially concurring.\n\nI write only to comment on the dicta in the majority opinion which states:\n\nThe protection against unreasonable searches and seizures found in the Constitution of the State of Wyoming is virtually identical to that found in the federal constitution. Even though the federal law establishes minimum requirements for individual protection and does not mandate any maximum criteria as to the degree of protection afforded an individual under state law, federal interpretations of the Fourth Amendment are regarded as persuasive and this court adheres to them closely absent some contrary direction from the legislature of the State of Wyoming.\n\n(Citations omitted.) I do not concur with the idea that in the future we will blindly follow the United States Supreme Court's interpretation of the Fourth Amendment to the United States Constitution when we interpret the Wyoming Constitution.\n\nGOLDEN, Justice, concurring.\n\nI concur in the majority opinion ably written by Justice Thomas. I write separately to recite my observations about independent state constitutional analysis, since that topic appears as the centerpiece of the dissenting opinion.\n\nAppellant promised in his appellate brief to show that his telephone records and the derivative evidence were seized in violation of Wyo. Const. art. 1, § 4.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e He described this seized evidence as being the \"linchpin of the state's case\" against him. Unfortunately, his brief and argument did not fulfill the promise. He cited King v. State, 780 P.2d 943, 959 (Wyo. 1989), for the proposition that Wyo. Const. art. 1, § 4 affords protection of persons from unreasonable governmental intrusion into legitimate privacy expectations. He also cited Katz v. United States, 389 U.S. 347, 88 S.Ct. 507, 19 L.Ed.2d 576 (1967) (Harlan, J. concurring), a Fourth Amendment case, for the same proposition. King was also a Fourth Amendment decision, not a decision based on Wyo. Const. art. 1, § 4. King, 780 P.2d at 959-61. The state constitutional law argument goes downhill from there; to be accurate, there is no discernible state constitutional law argument in appellant's brief.\n\nAppellant urges us to adopt the reasoning in State v. Gunwall, 106 Wn.2d 54, 720 P.2d 808 (1986), a leading case holding that the Washington Constitution's analogue to the Federal Constitution's Fourth Amendment provides greater protection than the Fourth Amendment for the privacy of telephone records. He asks us, therefore, to hold that the Wyoming Constitution provides greater protection than the Federal Constitution for his privacy interests. The problem is that appellant must do much more than ask; he must show. That also is the problem of the dissenting opinion. In its zealous rush to take the majority to task for following federal law on the search and seizure issue, it has overlooked cardinal principles of appellate judicial process and state constitutional law.\n\nIn countless decisions this court has warned litigants \"[i]n the presentation of an appeal to our court, it is inadequate simply to allude to an issue or identify only a potential issue.\" Kipp v. Brown, 750 P.2d 1338, 1341 (Wyo. 1988). Further, we have reminded litigants:\n\n[I]t is not the function of this court to frame appellant's argument or draw his issues for him.\n\nThis court consistently has refused to consider positions which are not supported by cogent argument or pertinent authority. We are not required to consider on appeal grounds which were neither presented to * * * nor passed upon [by the trial court].\n\nHance v. Straatsma, 721 P.2d 575, 577-78 (Wyo. 1986) (citations omitted).\n\nAppellant identifies the potential state constitutional issue but fails to support his claim by cogent argument or pertinent authority. This court may not frame and make his argument for him. Having found Gunwall, appellant needed to recognize that the Washington Supreme Court analyzed the issue on state constitutional law grounds only because appellant had squarely raised, briefed, and argued the issue on those grounds. The court set out a list of useful \"non-exclusive neutral criteria\" which\n\nare relevant in determining whether, in a given situation, the Washington State Constitution should be considered as extending broader rights to its citizens than the United States Constitution: (1) the textual language; (2) the differences in the texts; (3) constitutional history; (4) pre-existing state law; (5) structural differences; and (6) matters of particular state or local concern.\n\nGunwall, 720 P.2d at 811. I recommend this analytical technique to our practicing bar. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn the case at hand, appellant used neither the Gunwall analytical technique nor any other analytical technique appropriate to brief and present a state constitutional law argument. The Washington Supreme Court handles such failures swiftly and surely, as we should also. In refusing to consider the issue, that court colorfully expressed its position when it said:\n\nAs expressed by the Eighth Circuit, \"Naked castings into the constitutional sea are not sufficient to command judicial consideration and discussion.\" United States v. Phillips, 433 F.2d 1364, 1366 (8th Cir. 1970).\n\nIn re Request of Rosier, 105 Wn.2d 606, 717 P.2d 1353, 1359 (1986).\n\nLitigants would do well to remember:\n\nRecourse to our state constitution as an independent source for recognizing and protecting the individual rights of our citizens must spring not from pure intuition, but from a process that is at once articulable, reasonable and reasoned.\n\nGunwall, 720 P.2d at 813.\n\nJustice Robert F. Utter of the Washington Supreme Court is one of the leaders in the effort to foster and promote the development of state constitutional law. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Speaking for his court in a case in which the appellant had perfunctorily raised but not briefed the issue whether the self-incrimination provision of the Washington Constitution conferred a right to Miranda like warnings, Justice Utter said:\n\nBy failing to discuss at a minimum the six criteria mentioned in Gunwall, he requests us to develop without benefit of argument or citation of authority the \"adequate and independent state grounds\" to support his assertions. See Michigan v. Long, 463 U.S. 1032, 103 S.Ct. 3469, 77 L.Ed.2d 1201 (1983). We decline to do so consistent with our policy not to consider matters neither timely nor sufficiently argued by the parties. In re Rosier, 105 Wn.2d 606, 616, 717 P.2d 1353 (1986).\n\nState v. Wethered, 110 Wn.2d 466, 755 P.2d 797, 800-01 (1988).\n\nMost state appellate courts exercise similar judicial restraint in this important area. Justice Utter observes that \"[a]lmost 80% of the state supreme court justices responding to a recent survey indicated that their court would decline to hear a state constitutional claim if the litigant failed to raise the claim below.\" \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Illustrative of this restraint are decisions from Vermont, Wisconsin, and Utah. In Vermont the court refused to consider an illegal stop and arrest claim under the Vermont Constitution, stating:\n\nThe state constitutional issue has been squarely raised, but neither party has presented any substantive analysis or argument on this issue. This constitutes inadequate briefing, and we decline to address the state constitutional question on the basis of the record now before this court.\n\nState v. Jewett, 146 Vt. 221, 500 A.2d 233, 234 (1985) (citation omitted).\n\nJustice Judith S. Kaye of the New York Court of Appeals, also a leader in this movement, agrees with that said in Jewett:\n\nA grudging parallel citation to a state constitution, or an argument that the state particularly values the rights of its citizens, in a brief devoted to federal law does nothing to aid in the development of state jurisprudence, so that everyone can know from reading a particular state court's decisions what factors would impel that court to decide one way or the other. Only by the customary process of research and reasoning can there be principled development of a body of state constitutional law that does not seek merely to sidestep review by the United states Supreme Court in isolated cases but one that truly supports the state constitution, as state court judges and lawyers are charged to do.\n\nJudith S. Kaye, A Mid-Point Perspective on Directions in State Constitutional Law, 1 Emerging Issues in State Constitutional Law, 17, 24 (1988).\n\nIn Wisconsin, Justice Shirley Abrahamson, also a well-recognized leader in state constitutional law issues, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e wrote for the court in State v. Pitsch, 124 Wis.2d 628, 369 N.W.2d 711, 721 (1985), in deciding an issue of claimed ineffective assistance of trial counsel. She correctly observed that when the litigants present and argue a claim only under the Federal Constitution, the court must apply federal law in analyzing the claim. Pitsch, 369 N.W.2d at 718. Because the litigants failed to develop the claim under the Wisconsin Constitution, the court properly declined to consider it on state constitutional grounds. Pitsch, 369 N.W.2d at 721.\n\nIn Utah, another leader in this area, Justice Christine Durham, wrote for the court on a search and seizure question. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e As had Justice Abrahamson in Pitsch, Justice Durham correctly noted that since the litigants had argued the claim on only Fourth Amendment grounds, not relying on the Utah Constitution's analogue, the court had no choice but to consider the claim only under federal law. State v. Earl, 716 P.2d 803, 805 (Utah 1986). She pointedly wrote:\n\nWe have not considered separate state constitutional standards, even though we are aware that other states are relying with increasing frequency on an analysis of the provisions of their own constitutions to expand constitutional protection beyond that mandated by the United States Supreme Court. * * * Since it was not raised here, we do not treat that question. We note, however, that despite our willingness to independently interpret Utah's Constitution in other areas of the law, the analysis of state constitutional issues in criminal appeals continues to be ignored. It is imperative that Utah lawyers brief this court on relevant state constitutional questions. See State v. Hygh, Utah, 711 P.2d 264 (1985) (Zimmerman, J., concurring). We cite with approval the summary of scholarly commentary and analytical technique set forth by the Supreme Court of Vermont in State v. Jewett, Vt. [146 Vt. 221], 500 A.2d 233 (1985).\n\nEarl, 716 P.2d at 805-06 (citations omitted). Accord, State v. Lafferty, 749 P.2d 1239, 1247 n. 5 and accompanying text (Utah 1988).\n\nThe Wyoming Supreme Court continues to be willing to independently interpret the provisions of the Wyoming Constitution. But it is imperative that Wyoming lawyers properly brief this court on relevant state constitutional questions. See, e.g., Dworkin v. LFP. Inc., 839 P.2d 903, 909 (Wyo. 1992), in which we (1) provided the practicing bar with a comprehensive bibliography on the subject of interpretation of state constitutions, and (2) informed the Bar that it must use a precise and analytically sound approach and provide us with the proper arguments and briefs to ensure the future growth of this important area of the law. That was not done here; therefore, the majority quite properly exercised restraint, as counseled by Justices Abrahamson, Durham, Kaye, and Utter, and declined to consider the claim on state constitutional grounds. Recourse to the Wyoming Constitution as an independent source for recognizing and protecting the individual rights of our citizens must spring from a process that is articulable, reasonable, and reasoned. Gunwall, 720 P.2d at 813. We look forward to developing and applying such a process.\n\n\u003cspan class=\"fn\"\u003e2. Other analytical techniques exist. See, e.g., Wallace Carson, Last Things Last: A Methodological Approach to Legal Argument in State Courts, 19 Williamette L.Rev. 641 (1983); Robert F. Utter and Sanford E. Pitler, Presenting a State Constitutional Argument, 20 Ind.L.Rev. 635 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., Robert F. Utter, Freedom and Diversity in a Federal System: Perspectives on State Constitutions and the Washington Declaration of Rights, 7 U. Puget Sound L.Rev. 157 (1984); Robert F. Utter and Sanford E. Pitler, Presenting a State Constitutional Argument: Comment on Theory and Technique, 20 Ind.L.Rev. 635 (1987); Robert F. Utter, Survey of Washington Search and Seizure Law, 9 U. Puget Sound L.Rev. 1 (1985); Robert F. Utter, The Right to Speak, Write, and Publish Freely: State Constitutional Protection Against Private Abridgement, 8 U. Puget Sound L.Rev. 157 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Utter and Pitler, supra note 2, p. 639 n. 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Linda Matarese, Other Voices: The Role of Justices Durham, Kaye and Abrahamson in Shaping the Methodology of the \"New Judicial Federalism,\" 2 Emerging Issues in State Constitutional Law 239 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Id. URBIGKIT, Justice, Retired, dissenting. What this decision determines is that Wyoming citizens have no judicially enforced protection from the surreptitious acquisition of, and disclosure of: to whom and from whom telephone calls are made. The warrantless use of pen registers and dialed number recorders is legitimatized despite the desired privacy interests of the telephone user. This decision also determines that the provisions of the Wyoming Constitution, which secure a right of privacy and place limitations on search and seizures, provide no significant additional protection to our citizens. Instead, the court accepts a \"lockstep\" application which limits the protection of the state constitution to that which is decreed, from case-to-case, by the United States Supreme Court in analysis of our federal constitution. I. INTRODUCTION What is the significance of the Wyoming Constitution and its Bill of Rights with thirty-six individual provisions stated in Wyo. Const. art. 1? I contemplate, without pleasure, that this decision to adopt federal constitution \"lockstep\" mandates an answer of essentially nothing. I strongly reject the outdated and uninformed conclusion enveloped by the concept that gives the Wyoming constitutional guarantees only the equivalent rights established by the transigent decisions of the United States Supreme Court in applying the Bill of Rights found in the first ten amendments to the United States Constitution. The subject I particularly address in this dissent is frequently called either independent application of the state constitution or, conversely, \"lockstep.\" This appeal presents constitutionally-involved search and seizure questions. The decisive answer is which constitution? In this case, this court, by almost slight of hand, abandons our heritage of an independent analysis and application of our own constitution. We have removed our former protections from the meandering and the week-by-week changes of the United States Supreme Court which has embarked upon an accelerated direction to reduce, remove or differentiate the protection of people's rights from government. These were the rights created in solemn concern by the founders of this nation and written into the United States Constitution as the Bill of Rights by the first ten amendments. More importantly, these are the rights explicitly designed into this state's Constitution upon adoption a century ago. We do not here honor our responsibility to support, obey and defend, Wyo. Const. art. 6, § 20, by joining in the present major judicial trend for state courts to independently apply guarantees of rights enunciated in the individual state constitutions, some of which predate the United States Constitution. William J. Brennan, Jr., State Constitutions and the Protection of Individual Rights, 90 Harv.L.Rev. 489 (1977); Shirley S. Abrahamson, The Matthew O. Tobriner Memorial Lecture. Divided We Stand: State Constitutions in a More Perfect Union, 18 Hastings Const. L.Q. 723 (1991); Ann Althouse, Tapping The State Court Resource, 44 Vand.L.Rev. 953 (1991); Ken Gormley, Pennsylvania Supreme Court Review, 1990. Foreword: A New Constitutional Vigor for the Nation's Oldest Court, 64 Temp.L.Rev. 215 (1991). It is stated in one comprehensive legal article: \"From 1970 to 1984, state courts handed down over 250 opinions holding that state constitutional protection of individual liberties was greater than that afforded by their federal counterparts.\" Foster A. Stewart, Jr., Comment, The Role of New Federalism in Pennsylvania: Does United States Supreme Court Precedent Have Any Weight?, 30 Duq.L.Rev. 707, 709-10 (1992) (citing William J. Brennan, Jr., The Bill of Rights and the States: The Revival of State Constitutions as Guardians of Individual Rights, 61 N YU.L.Rev. 535, 548 (1986)). That number of state constitution-directed decisions has clearly arithmetically accelerated since the 1984 observation. See, e.g., Burt Neuborne, Foreword, State Constitutions and the Evolution of Positive Rights, 20 Rutgers L.J. 881 (1989); Developments in State Constitutional Law: 1989, 21 Rutgers L.J. 903 (1990); Developments in State Constitutional Law: 1990, 22 Rutgers L.J. 887 (1991); and Developments in State Constitutional Law: 1991, 23 Rutgers L.J. 789 (1992), each of which detail developments in state constitutional law during the prior year and recognize the increased utilization of state constitutional provisions for decisions. Included in the authoritative comments of Professor Robert F. Williams are the words of J. Bryce, The American Commonwealth 434 (Rev. 2nd ed. 1891): \"[S]tate constitutions are a `mine of instruction for the natural history of democratic communities.'\" Robert F. Williams, Introduction, 22 Rutgers L.J. 815, 816 (1991). We should have taken heed in this decision of \"a tale of two states.\" Compare Oregon's law with what Wyoming is now directed to be by this majority opinion. Compare also James A. Gardner, The Failed Discourse of State Constitutionalism, 90 Mich.L.Rev. 761 (1992) with David Schuman, A Failed Critique of State Constitutionalism, 91 Mich.L.Rev. 274 (1992). Professor Schuman indicates that Professor Gardner, considering where Wyoming is directed, finds \"`[u]seful tidbits' of constitutional history and philosophy from the state jurists — is either thin, incoherent, derivative, or non-existent.\" Schuman, supra, 91 Mich.L.Rev. at 274 (quoting Gardner, supra, 90 Mich.L.Rev. at 764-66). As Professor Schuman responds, \"[t]he moral of Professor Gardner's story is that state constitutional discourse is impoverished.\" Schuman, supra, 91 Mich.L.Rev. at 274. Professor Schuman recognizes as an alternative: Professor Gardner accurately depicts the depressed condition of state constitutional discourse in many jurisdictions. From that perfectly reasonable premise, he moves to an argument that state courts should abandon their attempts to improve it because that endeavor is inherently impossible and, in any event, undesirably schismatic. This argument ultimately fails, because he provides no convincing evidence that the development of sophisticated and vigorous state constitutional law is either impossible or unwise. By contrast, Oregon, as just one example, has shown that a state can develop a sophisticated independent constitutional culture without any noticeable threat to national values. Id. at 280. I refuse to accept that condition of permanent judicial failure for Wyoming. I also refuse to accept any present judicial amendment of the text of the Wyoming constitutional provisions in Article I establishing our state Bill of Rights by the action of five, six or seven members of the United States Supreme Court whose allegiance to state decisions is only as embracing as their capacity to gain a majority to limit explicitly, or subvert implicitly, constitutional guarantees under the United States Constitution. What they do is beyond control of any Wyoming citizen, but what we do with the Wyoming Constitution remains our solemn oath, which, for a jurist, nothing can be more sacred. The developed literature is near unending since Justice William A. Brennan, Jr. enunciated his classical federalist concept asking for independent state constitutional application in Brennan, supra, 90 Harv. L.Rev. 489 about sixteen years ago. Much will be explored in this dissent about this court's present analysis and decision which will undoubtedly come to be one of its major actions during this century. At least that will be true as long as \"lockstep\" lasts into the future which is directly contrary to our independent history of the past century. To be addressed first will be the substantive appellate issues and then the preclusively important concern about what, in bitter analysis, is frequently characterized to be \"lockstep\" constitutional adjudication. May it suffice in introduction to repeat the analysis of \"lockstep\" enunciated within a most difficult case involving the rape of a fifteen year old girl who requested an abortion, which was discriminatorily denied because of indigency. The Michigan court spoke thoughtfully in review: The Bill of Rights, major portions of which are made applicable to the states by virtue of the Fourteenth Amendment, is derived from state constitutional provisions which predate the adoption of the federal constitution. As the court said in People v. Brisendine, 13 Cal.3d 528, 550, 119 Cal. Rptr. 315, 531 P.2d 1099 (1975): \"It is a fiction too long accepted that provisions in state constitutions textually identical to the Bill of Rights were intended to mirror their federal counterpart. The lesson of history is otherwise: the Bill of Rights was based upon the corresponding provisions of the first state constitutions, rather than the reverse. `By the end of the Revolutionary period, the concept of a Bill of Rights had been fully developed in the American system. Eleven of the 13 states (and Vermont as well) had enacted Constitutions to fill in the political gap caused by the overthrow of British authority. * * * Eight of the Revolutionary Constitutions were prefaced by Bills of Rights, while four contained guarantees of many of the most important individual rights in the body of their texts. Included in these Revolutionary constitutional provisions were all of the rights that were to be protected in the federal Bill of Rights. By the time of the Treaty of Paris (1783) then, the American inventory of individual rights had been virtually completed and included in the different state Constitutions whether in separate Bills of Rights or the organic texts themselves.' (Italics added.) (1 Schwartz, The Bill of Rights: A Documentary History (1971) p 383; see generally 2 id., p 1204.) . . . \"We need not further extend this opinion to trace to their remote origins the historical roots of state constitutional provisions. Yet we have no doubt that such inquiry would confirm our view of the matter. The federal Constitution was designed to guard the states as sovereignties against potential abuses of centralized government; state charters, however, were conceived as the first and at one time the only line of protection of the individual against the excesses of local officials.\" Doe v. Director of Dept. of Social Services, 187 Mich. App. 493, 468 N.W.2d 862, 870-71 (1991). Doe was reversed on further review by the Michigan Supreme Court on a state constitutional examination. Doe v. Department of Social Services, 439 Mich. 650, 487 N.W.2d 166 (1992). I emphatically, specifically, and totally reject the majority dicta which is overtly intended to bring Wyoming into \"lockstep\" with the decisions of the United States Supreme Court. I would follow California, Oregon, Michigan, the persuasive historical Wyoming precedent, and many, if not most, of the states. I do not now, nor will I ever, accept any part of the following statements in the majority opinion: The protection against unreasonable searches and seizures found in the Constitution of the State of Wyoming is virtually identical to that found in the federal constitution. * * * Even though the federal law establishes minimum requirements for individual protection and does not mandate any maximum criteria as to the degree of protection afforded an individual under state law, federal interpretations of the Fourth Amendment are regarded as persuasive and this court adheres to them closely absent some contrary direction from the legislature of the State of Wyoming. Under the Tenth Amendment to the United States Constitution, the freedom of the state to provide greater expectations of privacy for its citizens than those provided under the federal constitution is guaranteed if, in either its legislative or judicial discretion, it deems it necessary or appropriate to do so. * * * Increased protection could be afforded to Wyoming citizens. It is our conclusion, however, that the substantial identity of the constitutional provisions involved does not suggest, nor do we perceive it appropriate in this instance to recognize, any increased protection as being afforded by our state constitution. (Emphasis added.) What this will mean is that the Wyoming decisions are displaced and the Wyoming Constitution is amended by cases politically postured by the United States Supreme Court because Wyoming jurists do not give substance to the Wyoming Constitution. Unfortunately, this case serves to demonstrate how vigorous attacks on crime mutated to a war on drugs and corrupted into a war against our constitutional Bill of Rights. This result is epitomized by the inevitably valid ancient axiom: \"The road to hell is paved with good intentions.\" Likewise, I do not accept a recently expressed restatement that intentions are immaterial if the results are socially acceptable. This concept sounds strikingly similar to result-oriented adjudication where it is first determined how the case can suit perceptions of contemporary desires and then analysis is used to fit fact and precedential logic into some after-the-fact justification for a predetermined answer. II. SUBSTANTIVE ISSUES IN THIS APPEAL A. Right to Privacy — Wire Tapping — Warrantless Search Appellant designated six issues in his extended appellate brief. In reality, guilt was proved by three questionable evidentiary developments. First was the use of federal resources to obtain telephone records contrary to the protection provided by state law. This was followed by the drug investigator's testimony, stated as expert witness opinion, which was directed to authenticate appellant's guilt. Third is the questionable use of hearsay documents. The conviction can only be affirmed by justification of each of these elements as conjunctively used to prove guilt. I agree with the majority's conceptualization of none of them. Unfortunately, at this juncture, neither time nor space justifies exhaustive research in this case to state why I disagree in all three parts of the affirming decision, except for the one that created the carrier for the dictum statement of limited state constitutional right application (lockstep). That issue is the acquisition by federal administrative subpoena of telephone call records and the subsequent use of the recording in the state court prosecution as evidence of guilt. It is important to recognize that Wyoming provides no prosecutorial or investigative agency right to supersede rights to privacy with administrative subpoenas. We should judicially notice that this has been a principal legislative effort of the Attorney General's office and the state prosecutors for a number of sessions. The effort has, to this date, uniformly been rejected by the Wyoming State Legislature. In this case, lacking any legislatively approved right to gain access to these records from telephone companies in this state, the state drug agent used the federal authorities to acquire the documentary information by processes authorized in federal law, but not available in state statutes. There is nothing subversive about interagency co-operation. The issue is admissibility of evidence not legally obtained under state law.1. What we have here are documents acquired in contravention of explicit decisions of the Wyoming State Legislature and then used as evidence in the state courts by a \"gift\" from federal authorities. Stated otherwise, what we have here are documents acquired in a fashion not permitted by either Wyoming statutes or our state constitution when a state agency used a federal subpoena.2. In regard to the telephone calls, we are not faced so much with right to privacy concerns. Today's unfortunate reality is that anyone in business or government who does not assume his or her telephone calls may be intercepted or checked is naive. The vice in this case is admission into evidence of what is clearly obtained without right under state law. This generally presents the \"which is the biggest problem\" syllogism or whether \"the end always justifies the means.\" In this case, in open court, the state drug agent admitted that no authority in state law existed for the acquisition he undertook; so, he used federal sources. Categorically stated, for the state court prosecution, this constituted illegally obtained evidence. What I particularly dislike is this court's blase acceptance that telephone call interception, without following our state laws, is socially acceptable and legally proper where it is decided the end will justify the means. My reasoned anticipation of what is occurring does not lead to acceptance that constitutional or statutory prohibitions and preclusions are administratively repealed and rescinded by a course of conduct of agents of the federal government. With that predicate, I address the majority's differentiation of telephone user identification as acceptable while what may be said (probably also intercepted with regularity) limits the sweep of the anti-wire tap — get a search warrant on probable cause — Wyoming statute. B. Wire Tapping — Pen Register — Wyoming Statute We need to look at this entire statute, Wyo. Stat. §§ 7-3-601 through 7-3-610; 1985 Wyo. Sess. Laws ch. 121; 1987 Wyo. Sess. Laws ch. 157, for proper construction. Allied-Signal, Inc. v. Wyoming State Bd. of Equalization, 813 P.2d 214 (Wyo. 1991). I would suggest nothing, within the plain meaning and clear purpose of the comprehensive statute, provides support for this majority's interpretive application that where the statute says it is the only way, another way is through the use of federal resources and their administrative subpoena. Additionally, the majority contemplates facts clearly not in evidence within this record, although perhaps adaptable from judicial notice resources. Cf. Monn v. State, 811 P.2d 1004 (Wyo. 1991). What on one occasion is stridently and divisively criticized is, on the next case, utilized in adjudicatorial response. This is the case with judicial notice. See Eisenbarth v. Hartford First Ins. Co., 840 P.2d 945 (Wyo. 1992). There is really no dispute about the absence of any right under state law for law enforcement personnel to obtain administrative subpoena information in the fashion portrayed here. This is the reason for the state drug agent using the federal authorities. The fact of acquisition, contrary to state law, hardly makes the information admissible. It is unquestioned in this record that no effort was made by the state investigative authorities to comply with the authorizing processes provided in the state wiretap statutes, Wyo. Stat. §§ 7-3-602, 7-3-605, and 7-3-606. Those statutes stated: (a) Except as provided in subsection (b) of this section, no person shall willfully: (i) Intercept any wire or oral communication; (ii) Disclose to another person the contents of any wire or oral communication, knowing or having reason to know that the information was obtained through the interception of a wire or oral communication in violation of this section; (iii) Use the contents of any wire or oral communication knowing or having reason to know that the information was obtained through the interception of a wire or oral communication in violation of this section. (b) Nothing in subsection (a) of this section prohibits: (v) A peace officer from intercepting, using or disclosing to another peace officer in the course of his official duties any wire or oral communication pursuant to an order permitting the interception under this act[.] Wyo. Stat. § 7-3-602. (a) The governor, the attorney general or the district attorney within whose jurisdiction the order is sought in conjunction with the attorney general may authorize an application to a judge of competent jurisdiction for an order authorizing the interception of wire or oral communications by the Wyoming division of criminal investigation or any law enforcement agency of the state having responsibility for investigation of the offense for which the application is made, if the interception may provide evidence of an attempt to commit, conspiracy to commit, solicitation to commit or the commission of any of the following felony offenses or comparable crimes in any other jurisdiction: (i) Violations of the Wyoming Controlled Substances Act of 1971[.] Wyo. Stat. § 7-3-605. (a) Each authorized application for an order permitting the interception of wire and oral communications shall be made in writing upon oath or affirmation to a judge and shall state the applicant's authority under W.S. 7-3-605(a) to make the application. Each application shall include the following information: (i) The identity of the peace officer; (ii) A full and complete statement of the facts and circumstances relied upon by the applicant to justify his belief that an order should be issued, including: (A) Specific facts concerning the particular offense that is being investigated; (B) A particular description of the nature and location of the equipment from which, or the place where, the communication is to be intercepted; (C) A particular description of the type of communication sought to be intercepted; (D) The identity of the person or persons, if known, who are suspected of committing the offense and whose communications are to be intercepted. (iii) A complete statement as to whether or not other investigative procedures have been tried and have failed, or why they reasonably appear to be unlikely to succeed or too dangerous; (iv) A statement of the required duration of the interception. If the nature of the investigation will require that the interception not automatically terminate when the described type of communication has been first obtained, the application shall state facts sufficient to establish probable cause to believe that additional communications of the same type will occur after the initial interception; (v) A full and complete statement by the applicant concerning all previous applications known to have been made to any judge: (A) For permission to intercept wire or oral communications involving any of the same persons, equipment or places specified in the application; and (B) Action by the judges on each previous application. Wyo. Stat. § 7-3-606. C. Smith v. Maryland Where \"Lockstep\" in Privacy Begins The majority builds its expostulation as to why unlisted numbers, which admittedly were not available to investigating officers in Wyoming, should be admissible evidence when acquired through federal resources by reliance on Smith v. Maryland, 442 U.S. 735, 99 S.Ct. 2577, 61 L.Ed.2d 220 (1979). Smith was a pen register case which set a federal standard seldom followed in state courts and never in the context of conspiratorial or conjunctive efforts as is the evidence here. Additionally, it must be recognized that the pen register discussion of Smith did not account for explicit statutory provisions relating to \"information concerning the identity of the parties participating in the communication * * *.\" Wyo. Stat. § 7-3-601(a)(iii). Explicitly, the Wyoming legislature intended to reject the pen register concept by enactment of 1985 Wyo. Sess. Laws ch. 121 and also carefully continued that thesis into the last amendment provided by 1989 Wyo. Sess. Laws ch. 118. It belies reason to utilize a pen register case where the equipment itself is illegal, except in certain context: when the manufacture, assembly, possession or offer for sale is a felony, Wyo. Stat. § 7-3-603; where intercept means the \"aural acquisition of the contents\", Wyo. Stat. § 7-3-601(a)(v); and where contents include \"information concerning the identity of the parties participating * * *.\" Wyo. Stat. § 7-3-601(a)(iii).3. If the thesis with which we are presented in the \"lockstep\" approach is to attribute to the Wyoming Constitution a confined attribute, unless the legislature adopts an expansive view, then the application of a case such as Smith in the face of the explicit Wyoming statute is a total non sequitur. Just as one who enters a public telephone booth is \"entitled to assume that the words he utters into the mouthpiece will not be broadcast to the world,\" Katz v. United States, [389 U.S. 347, 352, 88 S.Ct. 507, 512, 19 L.Ed.2d 576 (1967)], so too, he should be entitled to assume that the numbers he dials in the privacy of his home will be recorded, if at all, solely for the phone company's business purposes. Smith, 442 U.S. at 752, 99 S.Ct. at 2586, Marshall, J., dissenting. We start this examination with the contention of the State, true or false as it may actually have been, that there was no way under state law that law enforcement could acquire the information desired by some probable cause, judicially issued, warrant; and consequently, that resort to federal administrative subpoena was justified. This contemplates an examination of a reverse \"silver platter doctrine\" concept. Following that examination, we are then faced with the inquiry of whether identification, e.g., pen register or something else as in this case, does not constitute a search since it only breaches privacy by providing identification of the caller's telephone number or the recipient's telephone number. Consequently, the identification provides information locating the calling or called party's name and address. Finally, the weighty question, under the structure of the majority's accommodative dictum, is whether the privacy rights of Wyoming citizens, as guaranteed through our constitution with its preclusion against unreasonable searches and seizures, should be limited by federal case law, albeit United States Supreme Court or otherwise. Essentially, what all of this means is an advance determination that either congressional action or United States Supreme Court decisions will always limit the protection guaranteed in the Wyoming Constitution. The majority opinion has included an impressive lineage of United States Supreme Court decisions, apparently, to authenticate that there is no right of privacy in your telephone number or the usage that you make from it under the prohibition of unreasonable searches and seizures of Wyo. Const. art. 1, § 4. We can classify those cases with some degree of realism by finding they have no persuasive relevance. We should then look, in fresh perspective, at the 1992 controlling philosophy involved in independent constitutional application of a state supreme court and the state's independently applied guarantees of rights within the state constitution. I need not, in the sense of accuracy and completeness, pursue the issue of what constitutes probable cause under the pen register, court order requirement statutes or, for that matter, the federal law since the legislature of this state has not seen fit to authenticate that addition to the Wyoming broadly confining and carefully detailed right to privacy act, Wyo. Stat. §§ 7-3-601 through 7-3-610; 1985 Wyo. Sess. Laws ch. 121. See Richardson v. State, 821 S.W.2d 304 (Tex. App.), judgment vacated in part, 824 S.W.2d 585 (Tex.Cr.App. 1992). It should not be ignored that very specific reporting requirements exist, not only to the state attorney general, Wyo. Stat. § 7-3-608, but also by the attorney general and state courts pursuant to 18 U.S.C. § 2519; Wyo. Stat. § 7-3-611. The federal statute provides a requirement of thirty days after the expiration of an order or denial that the issuing judge report to the administrative office of the United States Court in significant detail. In these cases, we face the constitutional interest of the sanctity and privacy of home. Consequently, close judicial scrutiny should be exercised. United States v. Kalustian, 529 F.2d 585 (9th Cir. 1975). Cf. People v. Yanez, 178 A.D.2d 357, 577 N.Y.S.2d 621 (1991). Inevitably, the federal statutory requirements represent the minimum constitutional criteria for electronic surveillance and does not preclude Wyoming from enacting more stringent standards. See People v. Otto, 2 Cal.4th 1088, 9 Cal.Rptr.2d 596, 831 P.2d 1178, cert. denied, ___ U.S. ___, 113 S.Ct. 414, 121 L.Ed.2d 338 (1992) (holding in a murder case, improper wire tapping of telephone calls between the victim's wife and her lover, recorded by the victim before his death, required reversal for suppression). D. No Issue of Retroactivity As it happens, the Communications Privacy Act, 1985 Wyo. Sess. Laws ch. 121, had an automatic expiration date of July 1, 1989. That automatic repealer was revoked by 1989 Wyo. Sess. Laws ch. 118, which provided a termination date effective July 1, 1995. The difference in terminology is not really significant to the issues presented here and the actual issue is diminutive since the 1989 re-enactment provided an effective date of June 8, 1989, which was subsequent to the investigation in which the federally obtained evidence was acquired to provide the subject of this appeal. I do not seek to apply the 1989 statute retroactively. Without characterizations to be adjudicatorily expansive or not, a difference in justification for the invasion of privacy, cannot be found, in my opinion, from the general difference in the two enactments or the change from \"aural or wire communication\" to \"aural, wire or electronic communication.\" We do not have a fiber optics or microwave issue, which might explain the changes addressed by the 1989 enactment. Obviously, something was occurring which denigrated the philosophy of the 1985 act and required supplementation in the terminology of the 1989 provisions. The pen register cases, e.g. Smith, 442 U.S. 735, 99 S.Ct. at 2577, which became the modus vivendi of the pen register legitimizing cases, could not find a differentiation, in either Wyoming enactment, which equally addresses \"information concerning the identity of the parties participating in the communication * * *.\" The 1989 enactment neither legitimized pen registers nor additionally addressed their illegitimacy under the law. E. \"Silver Platter\" is Back in Reverse In addition to the affixation on Wyoming law of the discredited and discarded non-sequitur that pen register and telephone usage recording equipment does not invade a protected interest of privacy, this court now resurrects the discarded and degenerative \"silver platter\" idiom to justify usage of evidence illegally obtained. For state courts, the name case resolution came in People v. Kelley, 66 Cal.2d 232, 57 Cal.Rptr. 363, 424 P.2d 947 (1967), now twenty-six years in discard, and in a series of United States Supreme Court examinations of the interjection of evidence illegally obtained by state authorities for use in federal court prosecutions. We have this longdiscarded, philosophically disindigenous, \"silver-platter\" doctrine resurrected, in a reverse fashion, for Wyoming criminal procedures. Evidence illegally obtained under the confines of Wyoming rules, statutes and constitution, surreptitiously secured by the conspiratorial activities of federal officialdom is sanitized for introduction in our courts. In Kelley, 57 Cal. Rptr. at 378, 424 P.2d at 962, a confession which was perhaps lawful under military law was deemed inadmissible where not in compliance with California judicial requirements. That court said: \"In other words the `silver platter' doctrine is not here applicable.\" Id. The California Supreme Court restated the subject in 1992 where wire taping was conducted contrary to law and protection of privacy required suppression, even though the government was the innocent recipient of the evidence rather than the procurer. Otto, 9 Cal.Rptr.2d 596, 831 P.2d 1178. Telephone conversations between the murder victim's wife and her lover, recorded by the victim in violation of state law, were not admissible in the wife's murder trial. It would have seemed that the whole ignoble thesis of \"silver platter\" had been exculpated from the law decades ago. Lustig v. United States, 338 U.S. 74, 79, 69 S.Ct. 1372, 1374, 93 L.Ed. 1819 (1949); Gambino v. United States, 275 U.S. 310, 48 S.Ct. 137, 72 L.Ed. 293 (1927). Within the operational facts of this present decision, \"silver platter\" evidentiary usage reappears for a jurisdictional forum shopping justifying the use of evidence unconstitutionally secured. It has perhaps been so long that \"silver platter\" is not even accurately defined by a new crop of politicized jurists in the federal venue. United States v. Queen, 732 F. Supp. 1342, 1346 (W.D.N.C. 1990). Cf. United States v. Freeman, 897 F.2d 346 (8th Cir. 1990) and United States v. Comstock, 805 F.2d 1194 (5th Cir. 1986), cert. denied, 481 U.S. 1022, 107 S.Ct. 1908, 95 L.Ed.2d 513 (1987) with Navarro v. United States, 400 F.2d 315 (5th Cir. 1968), all of which would use evidence in federal courts arguably valid under federal evidentiary concepts. See, however, United States v. McKeever, 905 F.2d 829 (5th Cir. 1990), cert. denied, ___ U.S. ___, 111 S.Ct. 790, 112 L.Ed.2d 852 (1991). Here, however, we have evidence which is not legal in state courts, but validated by retrieval from the federal system by processes not permitted under explicit Wyoming statutes. We subjugate Wyoming law and pollute the system by the subterfuge of alternative jurisdictional agency justified acquisition. \"Silver platter,\" as accurately identified for the state court systems by Kelley, 57 Cal.Rptr. at 378, 424 P.2d at 962 in rejection, had a relatively short, but very abrupt, constitutional interment. The total lack of understanding, of the dysfunctional substance coming from the rejected alternative source to avoid illegality, is demonstrable from a footnote in a recent federal case, where the subject actually was not even governmental agency participation. In United States v. Koenig, 856 F.2d 843, 850-51 n. 8 (7th Cir. 1988), the opinion writer footnoted his discussion by stating: The so-called \"silver platter doctrine\" is not to the contrary. In some situations, evidence illegally obtained by state police cannot be used by federal officials. Gambino v. United States, 275 U.S. 310, 48 S.Ct. 137, 72 L.Ed. 293 (1927). The evidence must be presented to federal officials on a silver platter by state authorities i.e., without any federal participation in the underlying illegal search or seizure, to be admissible in federal prosecutions. Lustig v. United States, 338 U.S. 74, 79, 69 S.Ct. 1372 , 93 L.Ed. 1819 (1949). We note that the rule vindicates core Fourth Amendment policy because state police are state actors and so their actions may independently violate the Fourth and Fourteenth Amendments even if they are not viewed as instruments of the federal authorities. The statement both totally misunderstands the concept of \"silver platter\" and abjectly misstates the substantive law. \"Silver platter\" does not refer to sanitation, it refers to bad evidence delivered as a \"valued gift\" on a \"silver platter.\" \"The `silver platter doctrine' operates on assumption that the illegality of the state seizure has been established. How it has been established is immaterial.\" Rios v. United States, 256 F.2d 173, 177 (9th Cir. 1958), cert. granted, 359 U.S. 965, 79 S.Ct. 881, 3 L.Ed.2d 833 (1959), vacated, 364 U.S. 253, 80 S.Ct. 1431, 4 L.Ed.2d 1688 (1960). What Koenig, 856 F.2d 843 ignores in 1988 is that Rios, written in 1958, and its brethren in protege, were totally rejected and dismembered by the United States Supreme Court. Rios v. United States, 364 U.S. 253, 80 S.Ct. 1431, 4 L.Ed.2d 1688 (1960); Elkins v. United States, 364 U.S. 206, 80 S.Ct. 1437, 4 L.Ed.2d 1669 (1960). See also, the predecessor, Weeks v. United States, 232 U.S. 383, 34 S.Ct. 341, 58 L.Ed. 652 (1914). The \"silver platter\" cases were founded as questions of federal law admittedly premised on more restrictive rules of admission in those courts than applied within the state court system. The subject and the substance remain appropriate for validating today's state court constitutional guarantees where both due process and Fourth Amendment protections have lost their protective facility in federal law and state courts have consequently been called to re-examine the concepts enunciated in state constitutions. The initiating case, which stands as a bulwark against which broad based attacks of diminished protection are now being mounted by current decisional processes developing in federal law, was Weeks, 232 U.S. 383, 34 S.Ct. 341. The philosophic magnificence of Weeks reaches back to the earlier case of Boyd v. United States, 116 U.S. 616, 630, 6 S.Ct. 524, 532, 29 L.Ed. 746 (1886): \"The principles laid down in this opinion affect the very essence of constitutional liberty and security. They reach farther than the concrete form of the case then before the court, with its adventitious circumstances; they apply to all invasions on the part of the government and its employees of the sanctity of a man's home and the privacies of life. It is not the breaking of his doors and the rummaging of his drawers that constitutes the essence of the offense; but it is the invasion of his indefeasible right of personal security, personal liberty, and private property, where that right has never been forfeited by his conviction of some public offense * * *.\" Weeks, 232 U.S. at 391, 34 S.Ct. at 343-44. Weeks was then continued in the dispositive \"silver-platter\" case of Elkins, 364 U.S. at 209-10, 80 S.Ct. at 1439-40: \"The effect of the Fourth Amendment is to put the courts of the United States and Federal officials, in the exercise of their power and authority, under limitations and restraints as to the exercise of such power and authority, and to forever secure the people, their persons, houses, papers and effects against all unreasonable searches and seizures under the guise of law. This protection reaches all alike, whether accused of crime or not, and the duty of giving to it force and effect is obligatory upon all entrusted under our Federal system with the enforcement of the laws. The tendency of those who execute the criminal laws of the country to obtain conviction by means of unlawful seizures and enforced confessions, the latter often obtained after subjecting accused persons to unwarranted practices destructive of rights secured by the Federal Constitution, should find no sanction in the judgments of the courts which are charged at all times with the support of the Constitution and to which people of all conditions have a right to appeal for the maintenance of such fundamental rights. \"* * * The efforts of the courts and their officials to bring the guilty to punishment, praiseworthy as they are, are not to be aided by the sacrifice of those great principles established by years of endeavor and suffering which have resulted in their embodiment in the fundamental law of the land.\" [Weeks], 232 U.S. 383, 391-393 [34 S.Ct. 341, 344]. Weeks further reminds us: \"Accordingly,\" says Lieber in his work on Civil Liberty and Self-Government, 62, in speaking of the English law in this respect, \"no man's house can be forcibly opened, or he or his goods be carried away after it has thus been forced, except in cases of felony; and then the sheriff must be furnished with a warrant, and take great care lest he commit a trespass. This principle is jealously insisted upon.\" Weeks, 232 U.S. at 343, 34 S.Ct. at 343. Case law, as it then developed in the United States Supreme Court through the intermediate stage of Gambino, 275 U.S. 310, 48 S.Ct. 137, would still not have countenanced what happened here since Gambino made the test one of police officer cooperation in a joint enterprise. The agency preclusion of Gambino certainly exists here: \"that the rights guaranteed by the Fourth and Fifth Amendments may be invaded as effectively by such cooperation as by the state officers acting under direction of the federal officials.\" Id. at 316, 48 S.Ct. at 138. This is the co-conspirator acquisition process which, of course, is identical in application to the usage in the present case of a federal process which avoids the more stringent requirements for evidentiary acquisition delineated for utilization by state law enforcement authorities. Although Justice Frankfurter came to dissent in Elkins, 364 U.S. at 233, 80 S.Ct. at 1453, the predicate principal of Wolf v. Colorado, 338 U.S. 25, 69 S.Ct. 1359, 93 L.Ed. 1782 (1949) also requires recognition and application. Wolf determined that evidence which was unconstitutionally obtained, under purview of the United States Constitution, was, by application of the due process clause, inadmissible in the state court proceedings. Enunciated in Wolf, 338 U.S. at 27-28, 69 S.Ct. at 1361, to be fundamental interests by application of due process, Justice Frankfurter observed: The security of one's privacy against arbitrary intrusion by the police — which is at the core of the Fourth Amendment — is basic to a free society. It is therefore implicit in \"the concept of ordered liberty\" and as such enforceable against the States through the Due Process Clause. The knock at the door, whether by day or by night, as a prelude to a search, without authority of law but solely on the authority of the police, did not need the commentary of recent history to be condemned as inconsistent with the conception of human rights enshrined in the history and the basic constitutional documents of English-speaking peoples. In Elkins, 364 U.S. at 215 n. 7, 80 S.Ct. at 1443 n. 7, the author of the majority opinion, Justice Stewart, brought the subject into clear focus: Long before the Court established that the Fourteenth Amendment protects the security of one's privacy against arbitrary intrusion by state officers, Mr. Justice (then Judge) Cardozo perceived a basic incongruity in a rule which excludes evidence unlawfully obtained by federal officers, but admits in the same court evidence unlawfully obtained by state agents. \"The Federal rule as it stands is either too strict or too lax. A Federal prosecutor may take no benefit from evidence collected through the trespass of a Federal officer. . . . He does not have to be so scrupulous about evidence brought to him by others. How finely the line is drawn is seen when we recall that marshals in the service of the nation are on one side of it, and police in the service of the States on the other. The nation may keep what the servants of the States supply. . . . We must go farther or not so far. The professed object of the trespass rather than the official character of the trespasser should test the rights of government. . . . A government would be disingenuous, if, in determining the use that should be made of evidence drawn from such a source, it drew a line between them. This would be true whether they had acted in concert or apart.\" People v. Defore, 242 N.Y. 13, 22-23, 150 N.E. 585, 588. He wrote further in analysis: For surely no distinction can logically be drawn between evidence obtained in violation of the Fourth Amendment and that obtained in violation of the Fourteenth. The Constitution is flouted equally in either case. To the victim it matters not whether his constitutional right has been invaded by a federal agent or by a state office. It would be a curiously ambivalent rule that would require the courts of the United States to differentiate between unconstitutionally seized evidence upon so arbitrary a basis. Such a distinction indeed would appear to reflect an indefensibly selective evaluation of the provisions of the Constitution. Moreover, it would seem logically impossible to justify a policy that would bar from a federal trial what state officers had obtained in violation of a federal statute, yet would admit that which they had seized in violation of the Constitution itself. Elkins, 364 U.S. at 215, 80 S.Ct. at 1442-43 (footnote omitted). The writer then, of course, went from his concept of logic and symmetry to consider the presently divisive point of departure — accuracy versus due process. In the end result, \"silver platter\" admissibility of evidence in the federal court system was terminated. See also, Rios, 364 U.S. 253, 80 S.Ct. 1431. F. Wyoming State Court Decisions — Privacy is Constitutionally \"Real\" We should follow New York in recognizing that protection against unreasonable interception of telephone conversations, and all processes equivalently involved, is a protection guaranteed by the Wyoming Constitution. See People v. Fata, 159 A.D.2d 180, 559 N.Y.S.2d 348, 351 (1990). New York extends that constitutional protection, in responsiveness of rights of the individual, even to cordless telephone communications. Id., 559 N YS.2d at 351. See Fred Jay Meyer, Note, Don't Touch that Dial: Radio Listening Under the Electronic Communications Privacy Act of 1986, 63 N.Y.U.L.Rev. 416 (1988). Although the right to privacy and its protection against governmental intrusion does not appear to have special constitutional significance for the United States Supreme Court, the courts of the states have not, so ungenerously, rewritten their own state constitutions. See Smith v. State, 510 P.2d 793 (Alaska), cert. denied, 414 U.S. 1086, 94 S.Ct. 603, 38 L.Ed.2d 489 (1973); People v. Krivda, 5 Cal.3d 357, 96 Cal.Rptr. 62, 486 P.2d 1262 (1971), cert. granted, 405 U.S. 1039, 92 S.Ct. 1307, 31 L.Ed.2d 579, judgment vacated on other grounds, 409 U.S. 33, 93 S.Ct. 32, 34 L.Ed.2d 45 (1972); People v. Rister, 803 P.2d 483 (Colo. 1990); People v. Oates, 698 P.2d 811 (Colo. 1985); People v. Sporleder, 666 P.2d 135 (Colo. 1983); State v. Tanaka, 67 Haw. 658, 701 P.2d 1274 (1985); Matter of Triplett, 119 Idaho 193, 804 P.2d 922 (1990); State v. Thompson, 114 Idaho 746, 760 P.2d 1162 (1988); State v. Boland, 115 Wn.2d 571, 800 P.2d 1112 (1990); and State v. Gunwall, 106 Wn.2d 54, 720 P.2d 808 (1986). For recognition where a separate federal court order was used, see Van Buren v. State, 823 P.2d 1258 (Alaska App. 1992); Com. v. Edmunds, 526 Pa. 374, 586 A.2d 887 (1991) (rejecting application of the United States v. Leon, 468 U.S. 897, 104 S.Ct. 3405, 82 L.Ed.2d 677 (1984) good faith exception to the exclusionary rule). The corrosion, from the legitimatizing of the pen register, is observed when information obtained from the pen register is utilized to obtain a search warrant upon which a further incursion into eavesdropping privacy may then be legitimatized justifying an otherwise unsupported warrant. In result, the ultimate warrant is inverted and corroded by the original pen register tool which can pervasively be used to invade residential privacy. Yanez, 577 N.Y.S.2d 621; People v. Baker, 174 A.D.2d 815, 570 N.Y.S.2d 857 (1991); People v. Spano, 170 A.D.2d 996, 566 N.Y.S.2d 152 (1991); Fata, 559 N.Y.S.2d 348; People v. Bachiller, 159 A.D.2d 955, 552 N.Y.S.2d 785 (1990). It is noteworthy that the New York legislature did recognize the problem in state law, and the preclusive direction of federal law, in providing privacy protection against pen registers by the enactment of a warrant requirement for pen register usage by law enforcement agencies. 11A McKinney's Consolidated Laws of New York Annotated, § 705.00 (Cum.Supp. 1993); 1988 N.Y. Laws, ch. 744, § 21; Baker, 570 N.Y.S.2d 857. The New York statute became the primary, and almost sole, state to totally follow Smith, 442 U.S. 735, 99 S.Ct. 2577. The statutory change came at the same time as a comprehensive change in federal law which reversed the bland no warrant usage of the pen register, search and seizure, eavesdropping technique justified in Smith. See P.L. 99-508 (1986), 18 U.S.C. § 3121 through 3127.4. What this means is the principal authority used in the majority opinion, Smith, 442 U.S. 735, 99 S.Ct. 2577, is not accepted by the great majority of state courts. Its principal use in New York was rejected by that state's legislature and the United States Congress rejected its use for the federal system. See Van Buren, 823 P.2d 1258 and State v. Koury, 824 P.2d 474 (Utah App. 1991) which recognize the ongoing requirement of the pen register search by authority of a court order. Recognition of a suppression requirement under state law, where the pen register is installed with a warrant, was also comprehensively considered in the Pennsylvania case of Com. v. Melilli, 521 Pa. 405, 555 A.2d 1254 (1989). In Melilli, without a probable cause determination for the usage of the pen register, the court ruled the illegality of the information required the subsequent legal wire tap evidence to be suppressed as fruits of the poisonous tree. Pennsylvania explicitly rejected Smith and followed its more protective application of the state constitution. Incursions into telephone communications \"within the confines of an expectation of privacy under the State Constitution\" required suppression. Melilli, 555 A.2d at 1258. Telephone numbers were equated with other telephone communication information. Melilli, 555 A.2d at 1258-59. See also People v. Chapman, 36 Cal.3d 98, 201 Cal.Rptr. 628, 679 P.2d 62 (1984) and State v. Hunt, 91 N.J. 338, 450 A.2d 952 (1982). The foundational case for Melilli, and decisions of other cases which rejected the United States Supreme Court non-warrant legalization of pen registers, was Com. v. Beauford, 327 Pa. Super. 253, 475 A.2d 783 (1984). That court recognized: The fallacy in the Commonwealth's reliance on Smith is the implicit assumption that our state constitution provides no greater protection against the installation and use of pen registers than the federal constitution provides. Although Smith conclusively decides the extent of the fourth amendment guarantee in this area, appellants have also asserted their rights under article 1, § 8 of the Pennsylvania Constitution. We turn now to the state constitutional claim. Preliminarily, it cannot be doubted that this state has the constitutional power to guard individual rights, including the right to be free from unreasonable searches and seizures, more zealously than the federal government does under the United States Constitution. Pruneyard Shopping Center v. Robins, 447 U.S. 74, 100 S.Ct. 2035, 64 L.Ed.2d 741 (1980); Cooper v. California, 386 U.S. 58, 87 S.Ct. 788, 17 L.Ed.2d 730 (1967); Commonwealth v. Sell, Pa. , 470 A.2d 457 (1983); Kroger Co. v. O'Hara Township, 481 Pa. 101, 392 A.2d 266 (1978); Commonwealth v. Harris, 429 Pa. 215, 239 A.2d 290 (1968); Commonwealth v. Walsh, Pa.Super. , 460 A.2d 767 (1983). \"The present function of state constitutions is as a second line of defense for those rights protected by the federal constitution and as an independent source of supplemental rights unrecognized by federal law.\" Note, The Interpretation of State Constitutional Rights, 95 Harv. L.Rev. 1324, 1367 (1982) (emphasis added). Commentators urge state governments to reflect deeply before deciding whether state constitutional provisions affecting individual liberties conform to similar provisions in the federal constitution. W. Brennan, State Constitutions and the Protection of Individual Rights, 90 Harv.L.Rev. 489, 501 (1977); Note, The New Federalism: Toward a Principled Interpretation of the State Constitution, 29 Stan.L.Rev. 297 (1977). Beauford, 475 A.2d at 788 (emphasis in original). The Idaho Supreme Court likewise joined in the independent state constitutional analysis in reversing the decision in State v. Thompson, 113 Idaho 466, 745 P.2d 1087 (1987), aff'd in part and rev'd in part, 114 Idaho 746, 760 P.2d 1162 (1988). The differentiation, between a pen register surveillance device and the dialed number recorder (DNR), was noted with analysis that the impact on privacy was the same. Idaho found justification in the Smith dissents of Justices Stewart and Marshall and then concluded: We adopt these dissenting comments in Smith as stating the interpretation that should be given to art. 1, § 17 of the Idaho Constitution as it applies to the use of pen registers in Idaho. Perhaps the day will come when a majority of the United States Supreme Court will decide to overrule Smith and establish for the nation the protection to which we believe those who use telephones in Idaho are entitled. Until then, art. 1, § 17 will stand as a bulwark against the intrusions of pen registers into our daily life in Idaho. Thompson, 760 P.2d at 1167. The Colorado court, similarly, provided constitutional protection for privacy from pen registers under the state constitution in Sporleder, 666 P.2d 135. That court rejected both Smith and United States v. Miller, 425 U.S. 435, 96 S.Ct. 1619, 48 L.Ed.2d 71 (1976) in another case, Charnes v. DiGiacomo, 200 Colo. 94, 612 P.2d 1117 (1980), by application of the superior protective rights of the state constitution. See also People v. Lamb, 732 P.2d 1216 (Colo. 1987). See also State v. Rothman, 70 Haw. 546, 779 P.2d 1 (1989), which was considered in detail by Karen L. Stanitz, State v. Rothman: Expanding the Individual's Right to Privacy Under the Hawaii Constitution, 13 U.Haw.L.Rev. 619 (1991). Since Wyoming has not enacted any pen register legislation for state law enforcement usage, installation by those personnel, under any circumstances, would be a crime as would be the case for any federal officials providing the same activity without court order. The Wyoming legislature, see 1985 Wyo. Sess. Laws ch. 121; 1987 Wyo. Sess. Laws ch. 157; and Wyo. Stat. §§ 7-3-601 through 7-3-610, has not chosen to enact pen register legislation and the delay time of two years from October 21, 1986 has long since expired. To justify what occurred to Saldana as a \"silver platter\" authentication of illegal evidence under Wyoming law, through Smith or pen register usage statutes, is absolutely unjustified, if not entirely absurd. We effectuate criminal misconduct to justify the acquisition of evidence for the proffered purpose of the criminal prosecution of someone else who has been alleged to have committed criminal conduct. The present application of \"silver platter\" in state courts, earlier addressed by People v. Kelley, 66 Cal.2d 232, 57 Cal. Rptr. 363, 424 P.2d 947 (1967) in California, follows, in general, a trend stated by 1 LaFave, Search \u0026 Seizure, § 1.5(b) (2d ed. 1987) (footnotes omitted): When (as is occurring with greater frequency) a state court finds that a certain arrest or search passes muster under the Fourth Amendment but that it violates the comparable provision of the state constitution, there does not appear to be any dissent from the conclusion that the fruits thereof must be suppressed from evidence. The rationale for such a result is seldom stated in the cases, but exclusion in these circumstances may be explained on the ground that a violation of the fundamental law of the state constitutes such a substantial intrusion upon the defendant's rights that the exclusionary remedy is just as appropriate as when the Fourth Amendment is violated. The issue of this case, and an increasing number of other cases, develops from the conduct of federal law enforcement agencies within the same jurisdiction5. seeking to acquire desired evidence, with expedited processes unavailable under state law, for the use of state law enforcement agencies. What we have here, and what is occurring with frequency, is that upon request by state authorities of the federal agencies, the evidence is obtained under federal process and delivered to the state enforcement agencies to supply a probable cause basis to then utilize state search and seizure statutory processes to obtain a warrant to invade the home or business privacy of the target individual. State v. Valenzuela, 130 N.H. 175, 536 A.2d 1252 (1987), cert. denied, 485 U.S. 1008, 108 S.Ct. 1474, 99 L.Ed.2d 703 (1988). Arguably excluded from a requirement for a warrant to use the pen register is one case provided by the intermediate appellate court in Texas. State v. Toone, 823 S.W.2d 744 (Tex. App. 1992). Toone did not involve questions of \"joint collaboration\" and defined its adaptation in the opinion as a \"reverse silver platter doctrine.\" Cf. Heitman v. State, 815 S.W.2d 681 (Tex.Cr.App. 1991). Toone did not consider Elkins, 364 U.S. 206, 80 S.Ct. 1437, or recognize the limitations for use mandated in both State v. Mollica, 114 N.J. 329, 554 A.2d 1315 (1989) and State v. Gwinner, 59 Wn. App. 119, 796 P.2d 728 (1990). Toone appears to stand alone in state jurisprudence, except for the differentiated federally used process found in Valenzuela, 536 A.2d 1252. Cf. Thompson, 745 P.2d 1087, where the intermediate appellate court rejected the persuasion and validity of Smith, but found \"lockstep\" adaptation by the state Supreme Court to control. See also State v. Brown, 113 Idaho 480, 745 P.2d 1101 (1987). The Idaho Supreme Court answered the call made in Thompson and reversed, determining that the state would not follow Smith or authenticate the warrantless use of the pen register. It should also be recognized that the philosophical basis for Toone and the following case, Richardson, 821 S.W.2d 304, of \"lockstep,\" the Texas constitutional provisions of article 1, section 9 would not be given a more restrictive standard, was completely obliterated by the Texas Court of Criminal Appeals in Heitman, 815 S.W.2d 681. Heitman rejected \"lockstep\" and adopted an independent application of the state constitution for Texas constitutional law. Lustig, 338 U.S. 74, 69 S.Ct. 1372 was cited in Toone and completely misstated in decision in the opinion, as were the non-law enforcement activity concepts addressed in Burdeau v. McDowell, 256 U.S. 465, 41 S.Ct. 574, 65 L.Ed. 1048 (1921). See 1 LaFave, supra, at § 1.8. Lustig, 338 U.S. at 80, 69 S.Ct. at 1375, Murphy, J., concurring, and Wolf, 338 U.S. at 41, 69 S.Ct. at 1371, Murphy, J., dissenting. In Elkins, 364 U.S. 206, 80 S.Ct. 1437, the United States Supreme Court held that it was unlawful for a state to seize evidence in violation of a defendant's constitutional right and hand that evidence on a \"silver platter\" to the federal courts for prosecution. People v. Martinez, 151 Misc.2d 641, 574 N.Y.S.2d 467, 473 n. 10 (1991). We need not go beyond the cooperation and joint enterprise cases here, since admittedly Wyoming law enforcement officials asked the federal authorities, in their efforts to target Saldana, to get the evidence for them regarding the telephone records by a process which was unavailable to the state authorities without the use of at least a formal search warrant. This joint endeavor preclusion is recognized dispositively in State v. Abdouch, 230 Neb. 929, 434 N.W.2d 317, 325 (1989): Referring to a joint endeavor between a private person and a government official, LaFave notes: \"It is not essential that the government official be involved in the endeavor at the very outset; cases in this area often apply the rule from Lustig v. United States, [338 U.S. 74, 69 S.Ct. 1372, 93 L.Ed. 1819 (1949)] that it is `immaterial' whether the government official `originated the idea or joined in it while the search was in progress' and that it is sufficient that the official `was in it before the object of the search was completely accomplished.' Nor is it necessary that the government official directly participate in the illegal entry. The courts have found sufficient government involvement where the officer was standing by giving tacit approval to the entry made by a private person. 1. W. LaFave, Search \u0026 Seizure, a Treatise on the Fourth Amendment § 1.8(b) at 179-80 (2d ed. 1987). Lustig, 338 U.S. 74, 69 S.Ct. 1372; Gambino, 275 U.S. 310, 48 S.Ct. 137, and Byars v. United States, 273 U.S. 28, 47 S.Ct. 248, 71 L.Ed. 520 (1927) pervasively define the joint conduct to invalidate admissibility if the evidence is obtained by a search violating state constitutional standards. See Elkins, 364 U.S. 206, 80 S.Ct. 1437. In addition to Abdouch, 434 N.W.2d 317, this identical subject was comprehensively addressed in New Jersey by State v. Minter, 116 N.J. 269, 561 A.2d 570 (1989); Mollica, 554 A.2d 1315; and Gwinner, 796 P.2d 728. See also State v. Christensen, 244 Mont. 312, 797 P.2d 893 (1990) (consideration if state action might be involved). Compare the privacy issues addressed in State v. Long, 216 Mont. 65, 700 P.2d 153 (1985), superseded in part by Christensen. See also People v. Jones, 30 Cal.App.3d 852, 106 Cal.Rptr. 749 (1973), where federally obtained information was suppressed when obtained in violation of a state nonadmissibility statute. California's expanded right of privacy by the state constitution and statute was recognized to be controlling. The case of State v. Harms, 233 Neb. 882, 449 N.W.2d 1, 7 (1989) reached the Fourth Amendment conduct of the federal law enforcement personnel, but recognized participative conduct as a concept in rejecting admissibility of the evidence obtained by the federal authorities in violation of the federal constitution: In light of Mapp [v. Ohio, 367 U.S. 643, 81 S.Ct. 1684, 6 L.Ed.2d 1081 (1961)] and Elkins [v. United States, 364 U.S. 206, 80 S.Ct. 1437, 4 L.Ed.2d 1669 (1960)], we see no logical reason why evidence which is unlawfully seized by federal law enforcement personnel should be admissible in state court criminal prosecutions. We therefore hold that evidence illegally obtained by federal law enforcement personnel cannot be used in Nebraska state courts, provided the lawfulness of the seizure is properly raised and adjudicated. I apply the same concept, where participative conduct is involved, if the evidence is obtained in contravention of the state constitution as an improper search and seizure under the preclusion of Wyo. Const. art. 1, § 4: The right of the people to be secure in their persons, houses, papers and effects against unreasonable searches and seizures shall not be violated, and no warrant shall issue but upon probable cause, supported by affidavit, particularly describing the place to be searched or the person or thing to be seized. If this court does not enforce that provision, despite our oath of office requiring justices to \"support, obey and defend,\" Wyo. Const. art. 6, § 20, no one else in this state is available to accept the responsibility. If one deserves to view the law involving individual rights with anguish today and concern tomorrow, a thoughtful reading of Monroe Freedman, Essay, Law in the 21st Century, 60 Fordham L.Rev. 503 (1991), will add further uneasiness. After dire and terrifying prediction about the status of the law and the justice delivery system in the year 2050, none of which he finds favorable, Monroe Freedman then concluded: \"In short, nothing is going to change in the next 59 years.\" Id. at 505. See also Robert Crook, Sorry, Wrong Number: The Effect of Telephone Technology on Privacy Rights, 26 Wake Forest L.Rev. 669 (1991); Glenn Chatmas Smith, We've Got Your Number! (Is it Constitutional to Give it Out?): Caller Identification Technology and the Right to Informational Privacy, 37 U.C.L.A.L.Rev. 145 (1989); and Riley K. Temple \u0026 Michael Regan, Recent Developments Relating to Caller ID, 18 W.St.U.L.Rev. 549 (1991). In further specificity, consider Michael D. Strugatz, Comment, Criminal Procedure — Cordless Telephone Communications and the Federal Wire Tap Act — Tyler v. Berodt, 877 F.2d 705 (8th Cir. 1989), cert. denied, 493 U.S. 1022, 110 S.Ct. 723, 107 L.Ed.2d 743 (1990), XXIV Suffolk U.L.Rev. 1152 (1990); and Tyler v. Berodt, 877 F.2d 705 (8th Cir. 1989), cert. denied, 493 U.S. 1022, 110 S.Ct. 723, 107 L.Ed.2d 743 (1990). G. Where the Law of Wire Tap (Pen Register Included) Goes From Here The issue presented here was not comparable with a Terry stop, Terry v. Ohio, 392 U.S. 1, 88 S.Ct. 1868, 20 L.Ed.2d 889 (1968), and those authorities, United States v. Sharpe, 470 U.S. 675, 105 S.Ct. 1568, 84 L.Ed.2d 605 (1985), have no relevance here. We have already recognized that the pen register cases as identified with Smith, 442 U.S. 735, 99 S.Ct. 2577, are distinguishable because of the preclusive terms of the Wyoming anti-wiretap statute, Wyo. Stat. § 7-3-601. Likewise, this is not a Rakas v. Illinois, 439 U.S. 128, 99 S.Ct. 421, 58 L.Ed.2d 387 (1978) case since the property interest addressed here was specifically one of the charged defendant — his privately listed telephone and record of billings for the calls made therefrom. This was a personal right within the Rakas characterization of the reach of the Fourth Amendment. United States v. Chadwick, 433 U.S. 1, 97 S.Ct. 2476, 53 L.Ed.2d 538 (1977), in recognizing that the Fourth Amendment extends beyond a dwelling, is not favorable authority for justification of the absence thereof for a telephone which is a conjunctive part of a residence in modern America. No warrantless search can be justified from that case. We then move to the case of Miller, 425 U.S. 435, 96 S.Ct. 1619, which is differentiated, at the very least, by the third-party subpoena process used by the United States for its own prosecution. Bank records were held not to constitute the depositor's private papers. See, however, Burrows v. Superior Court of San Bernardino County, 13 Cal.3d 238, 118 Cal.Rptr. 166, 529 P.2d 590 n. 7 (1974); and Miller, 425 U.S. at 455, 96 S.Ct. at 1629, where the Supreme Court found that the subpoena process clearly differentiated Miller from a case where voluntary response to an oral request was the medium of acquisition. Valley Bank of Nevada v. Superior Court of San Joaquin County, 15 Cal.3d 652, 125 Cal.Rptr. 553, 542 P.2d 977 (1975); J. Clark Kelso, California's Constitutional Right to Privacy, 19 Pepp.L.Rev. 327 (1992). The case of Miller was also rejected by the Utah Supreme Court in State v. Thompson, 810 P.2d 415 (Utah 1991) where that court also applied the Utah Constitution independently to find a similar right of privacy in bank records. See Arthur B. Berger, Recent Developments, Right to Privacy in Bank Records Under the Search and Seizure Provision of the Utah Constitution, 1992 Utah L.Rev. 201 (1992) as also assessing State v. Larocco, 794 P.2d 460 (Utah 1990), which applied the independent Utah constitutional standard to the search of an automobile. In reality, we have here a telephone search and seizure not really different from the classical wiretap situation first considered under a reasonableness test in Katz v. United States, 389 U.S. 347, 88 S.Ct. 507, 19 L.Ed.2d 576 (1967). Following Katz, the clearly enunciated public policy in Wyoming has been contained within the enactment of Wyo. Stat. §§ 7-3-601 through 7-3-610. The Wyoming statute, with its felony crime punishment, like Katz, rejects any warrantless wiretap. Katz did, of course, effectively overrule Olmstead v. United States, 277 U.S. 438, 48 S.Ct. 564, 72 L.Ed. 944 (1928) in recognizing that modern communications in today's world is an adjunct to which privacy should extend protecting usage of the telephone so that warrantless intrusion should never be permitted by police authority. See also Berger v. New York, 388 U.S. 41, 87 S.Ct. 1873, 18 L.Ed.2d 1040 (1967); Wong Sun v. United States, 371 U.S. 471, 83 S.Ct. 407, 9 L.Ed.2d 441 (1963); Silverman v. United States, 365 U.S. 505, 81 S.Ct. 679, 5 L.Ed.2d 734 (1961); and John Applegate \u0026 Amy Grossman, Pen Registers After Smith v. Maryland, 15 Harv. C.R.-C.L.L.Rev. 753 (1980). It should be noteworthy that the Wyoming statute applies its prohibition to all wiretap processes and for the controlled substance investigation only provides rights to secure the judicially approved warrant. The case with which search warrants can be obtained surely neither justifies failure to follow the Wyoming law nor alternative resort to the subterfuge of acquisition of information from some federal source. I agree with the State that compliance with Wyoming law did not exist here. Differing from the majority, for me, that omission should deny admission of any illegally obtained information into evidence anywhere in the state court system. Here, we demean and diminish rights or privacy in order to unjusticiably affirm one criminal conviction.6. I reject that result-oriented adventure. III. NO ENFORCEABLE STATE CONSTITUTIONAL RIGHT WHICH WOULD PROVIDE PROTECTION AGAINST ADMISSION OF EVIDENCE ACQUIRED WITHOUT COMPLIANCE WITH STATE LAW A. What \"Lockstep\" Means in Lost State Constitutional Rights for Wyoming Citizens The majority buttresses admissibility of the warrantless pen register data by denial of any constitutionally guaranteed Wyoming right to privacy in the pen register acquired telephone number identifications. In the first place, the concept clearly ignores the specific language of the Wyoming statute which includes information concerning the identity of the parties participating in a telephone call. Wyo. Stat. § 7-3-601(a)(iii). Secondly, the authentication of the diminished right in pen register acquired information stated in Smith, 442 U.S. at 772, 99 S.Ct. at 2597 does not fit either the Wyoming statute or, more preclusively, the state of the law provided in federal statutes responding to Smith. It does not fit, furthermore, with the many state statutes with carefully prescribed processes for judicial supervision of general acquisition of telephone communication data, which specifically pertains to pen register interception equipment usage. It is my perception that this decision, consequently, ignores or misapplies both federal law and the Wyoming state statute, Wyo. Stat. §§ 7-3-601 through 7-3-610; but, furthermore, fails to recognize the emergence of authenticating statutes which has never been chosen by the state legislature to be used in Wyoming. It is, however, in a third concept where this decision is most dangerous. The majority states that, in result, Wyoming is without the protection later provided by congressional action where a pen register statute was enacted. This is to adopt \"lockstep\" with Smith, but to then ignore the congressional change in federal law which effectively superseded Smith. This is the raw, uncontrolled \"lockstep\" in which the court confines protection in this state for search and seizure, and privacy, under the state constitution to constitutional rights apportioned out by decisions of the nation's highest court under the Bill of Rights which are emplaced in the United States Constitution. Specifically, with regard to the right to privacy, this court essentially invalidates one of the Wyoming legislature's efforts to protect citizens from communication incursions. This is done by denial of a constitutional right of privacy or proper recognition of the significance of the Wyoming statute that does exist. I strongly reject this federal legislation limiting rights for our citizens by the non-sequitur of applied \"lockstep.\" It is to that subject, and the growing majority of cases decided by state supreme courts that require first attention to state constitutional rights, which we now need to comprehensively consider. After all, we have built the structure of Wyoming law for too long to now regress to what is said about unprotected rights to privacy and limited rights as controlled by another court. B. Wyoming Precedent Nothing stated by the Wyoming Constitutional Convention membership, when they convened in July 1889, provides authority or persuasive logic that those intellectual and influential citizens assumed that the guarantees of Article I of the constitution that they wrote would only be coextensive with the effect of the Bill of Rights in the United States Constitution. Unfortunately, a verbatim record of the session was not maintained and nothing is directly preserved from committee sessions where most of the drafting was accomplished. Since Idaho started first, their draftsmanship, as well as other surrounding states, clearly, was copied in text. None of those states, through constitutional convention literature, provide support for this present majority's supposition that constitutional guarantees written into each state constitution were to be confined to the interpretive activity of the United States Supreme Court.7. In a most comprehensive and scholarly review, see Robert B. Keiter \u0026 Tim Newcomb, The Wyoming State Constitution: A Reference Guide (1993). Obviously, precedent from the United States Supreme Court can be used for comparison, but Saldana now stands alone in Wyoming adjudicative history in adopting \"bright line\" the \"lockstep\" confinement for interpretation of Wyo. Const. art. 1 in all of its thirty-six provisions. This is the first Wyoming decision which, in either dictum or resolution, specifically determines Wyoming constitutional rights are limited by application of the direct authority of other courts, driven through the analysis of the United States Constitution's Bill of Rights. Four significant cases which defined the course of Wyoming constitutional law are clearly contrary to this majority's position. This court unanimously applied the Wyoming constitutional protections and defended its independence under that document in the rights of students to equal protection. Washakie County School Dist. No. One v. Herschler, 606 P.2d 310 (Wyo.), cert. denied, 449 U.S. 824, 101 S.Ct. 86, 66 L.Ed.2d 28 (1980), contra San Antonio Independent School District v. Rodriguez, 411 U.S. 980, 93 S.Ct. 2266, 36 L.Ed.2d 956 (1973). It is noteworthy that the United States Supreme Court has since retreated from its no constitutional interest in equality of education posture of Rodriguez, and almost directly follows the thesis of the Wyoming Supreme Court in defining the Wyoming Constitution adopted in Herschler. In more recent times, an independent right to expanded jury trial protection for anyone charged with an offense for which a sentence to jail was possible, was realized by the Wyoming Supreme Court and enforced in Brenner v. City of Casper, 723 P.2d 558 (Wyo. 1986). This same thesis which was highlighted and advanced in Brennan, supra, 90 Harv.L.Rev. 489, was cited and recognized in the case of Cheyenne Airport Bd. v. Rogers, 707 P.2d 717, 726 (Wyo. 1985), regarding the exercise of police powers. See also Johnson v. State Hearing Examiner's Office, 838 P.2d 158 (Wyo. 1992) and State v. Langley, 53 Wyo. 332, 84 P.2d 767 (1938); cf. Dworkin v. L.F.P., Inc., 839 P.2d 903 (Wyo. 1992), Urbigkit, J., dissenting, and now pending on rehearing by this court. The most recent constitutional examination was provided by Simms v. Oedekoven, 839 P.2d 381 (Wyo. 1992). In March 1992, this court had adopted rewritten rules of criminal procedure which included, generally, provisions for release on bail. W.R.Cr.P. 46.1. That rule had been adapted, almost verbatim, from the Federal Rules of Criminal Procedure by recommendation of the statutory Wyoming rules committee and consequent approval and adoption by this court. Constitutionality of the rule in usage in the federal system had been clearly established. United States v. Salerno, 481 U.S. 739, 107 S.Ct. 2095, 95 L.Ed.2d 697 (1987). In Simms, this court was called to a closer examination of the Wyoming Constitution regarding right to bail found in Wyo. Const. art. 1, § 14. That examination with closer review revealed that the Wyoming Constitution clearly provided a greater protection for the arrested individual than did its counterpart in the United States Constitution and this court consequently held the adopted rule to be invalid in application of any complete denial of bail for any case except those constitutionally excluded (capital offenses, Wyo. Const. art. 1, § 14).8. What is so curious about the approach now adopted by this court in this case is that it is completely contrary to the attitude provided in decisional resolution in both Washakie County School Dist. No. One and Brenner on the equally significant issues of right for education and right to a jury trial upon criminal prosecution. We follow Wyoming law from statehood through the grand days of Justices Blume, Riner and Kimball to current time to demonstrate not only how inappropriate, but how shortsighted, this dictum development in this case really is. Then we will, with the hundreds of state cases, look at the coverage of the Justice Brennan philosophy as now developing and followed in most state jurisdictions at the present time. The sweep and scope of the federalism movement will be left in total analysis for others with more academic time than this writer, but representative analysis and determination will be pervasively provided to demonstrate, again, how this court pushes the state backwards from modern courts in what this case establishes to be the meaning and purpose of the Wyoming constitution. Before exhaustively pursuing these cases, there is another vice in what is occurring in this decision. We extrapolate a principle in the circumstances of the Teague v. Lane, 489 U.S. 288, 109 S.Ct. 1060, 103 L.Ed.2d 334 (1989), cf. Richard H. Fallon \u0026 Daniel J. Meltzer, New Law Non-Retroactivity, and Constitutional Remedies, 104 Harv.L.Rev. 1733 (1991) and Paul E. McGreal, A Tale of Two Courts: The Alaska Supreme Court, the United States Supreme Court, and Retroactivity, IX Alaska L.Rev. 305 (1992), direction of adjudication by the United States Supreme Court involving determination of a case on some basis which had been neither considered nor argued by the litigants in the case.9. Obviously, the appellate court is not limited to the logic or conceptualization of the litigants, but surely an issue such as this most important development in Wyoming law would deserve the associative value of litigant briefing. This contribution should have at least been given the opportunity to predate adoption of the broadsweeping and totally unnecessary conclusions found in this decision. This is not an issue of liberal courts versus conservative courts. This is a question of the validity of federalism and the basic reality and meaning of the state constitution. The choice the majority makes is not only abysmally unacceptable to me, but specifically contrary to thought, analysis and generic development within most state courts in this nation's federalistic two-tier judicial system. IV. THE DIRECTION OF AMERICAN LAW TODAY — AN INDEPENDENT ALLOCUTION OF STATE CONSTITUTIONAL PRECEPTS There is an almost unlimited supply of texts, legal articles and court cases which agreeably consider utilization of the state constitution for decisions regarding rights of citizens of the jurisdiction. None stated with more simplicity, yet with convincing logic, than the student author in Timothy Stallcup, Comment, The Arizona Constitutional \"Right to Privacy\" and the Invasion of Privacy Tort, 24 Ariz.St.L.J. 687, 693-95 (1992) (footnotes omitted), where he wrote: State courts have many reasons to look to their state constitutions for guarantees of individual rights. The most compelling is the traditional role of state constitutions as primary protectors of individual liberties: state constitutions protected individual rights before the enactment of the Federal Constitution; debate at the Continental Congress resolved that the states maintain separate, individual constitutions; the powers of the Federal Government are specifically enumerated, whereas those of the states are plenary; and prior to incorporation of most of the Bill of Rights under the Fourteenth Amendment, the first ten amendments explicitly were held inapplicable to the states. The framers of state constitutions, and the voters who adopted them, intended those constitutions to protect individual rights. Because they are frequently more recent than their federal counterpart, and more easily changed, a state constitution may better reflect the history, needs, and desires of the state's people. Also, Arizona judges are sworn to uphold both the Arizona and Federal Constitutions. Most important, individual liberties deserve the dual protections of federal and state law. If the United States Supreme Court has recently sought to shift the burdens of government to the states, defining and enforcing individual rights should be one of those burdens most welcomely accepted.[10.] It is witnessed by a requirement for this dissent that in any individual state, the long term result today is not determinable with certainty. Clearly, Wyoming moves backward in lacking the present willingness to provide reality to our state constitutional rights for the major concerns of life and criminal process involved in privacy and search and seizure. Retired Justice Hans A. Linde of the Oregon Supreme Court concluded in his contribution for Emerging Issues in State Constitutional Law: So the future of the \"new federalism\" remains doubtful. There is no reason for confidence that most state courts will systematically decide what their state constitutions require, either adapting someone's federal analysis or making their own, before deciding whether their state has violated the nation's Constitution. Perhaps the best we can hope for is that those judges who do not abdicate their responsibility outright will put first things first when the case is properly put to them. How often and how well they do it depends on the professionalism of the younger generation of advocates in constitutional cases as well as on the professionalism of the younger generation of judges. Hans A. Linde, Does the \"New Federalism\" Have a Future?, 4 Emerging Issues in State Constitutional Law 251, 261 (1991). Professor Barry Latzer would apparently agree. See Barry Latzer, Into the '90s: More Evidence That The Revolution Has a Conservative Underbelly, 4 Emerging Issues in State Constitutional Law 17 (1991); see, however, Yvonne Kauger, Reflections On Federalism: State Constitutions' Role As Nurturers of Individual Rights, 4 Emerging Issues in State Constitutional Law 105 (1991). Justice Kauger set the concepts in order by her conclusion: Travel by train is a wonderful experience. The travel itself becomes a part of the adventure as you rumble through the countryside. However, there is always an appropriate place to stop — an appropriate place to end a journey. This is the point for this article to end. If a purely federal right is at issue the journey concludes somewhere in the federal system with the absolute terminal being the United States Supreme Court. However, if a right guaranteed by the federal Constitution is also recognized by a state constitution, the train station to seek may well be within the state of origin — that state's highest court. The prudent train conductor (attorney) will consult the correct schedule (the state constitution) to guarantee that the passenger will receive all that is due. A first-class trip does not conclude when only basic rights are given but when civil liberties and personal rights have enjoyed their fullest protection. Id. at 131 (footnote omitted). Compare also Gardner, supra, 90 Mich.L.Rev. 761.11. The flood of case law in state courts demonstrate momentum, if not absolute unanimity, that the people's protection from the encroachment and violation by government requires independent review and application of rights written as guarantees in the separate state constitutions. The cases and subjects can be mined on rational recitation or even reconciliation, but adjusted within the topics of privacy, search and seizure, arrest and due process, a composite of fairly recent cases is particularly illustrative. Wyoming marches in lonely retreat with the federal constitution \"lockstep\" when it does what was done in this case as an unthinking and casual surrender of its philosophic independence. Justice Mosk said it best in his concurrence in the case of Sands v. Morongo Unified School Dist., 53 Cal.3d 863, 281 Cal. Rptr. 34, 61, 809 P.2d 809, 836 (1991), cert. denied, ___ U.S. ___, 112 S.Ct. 3026, 120 L.Ed.2d 897 (1992), where he directed us: Indeed, as the highest court of this state, we are independently responsible for safeguarding the rights of our citizens. State courts are, and should be, the first line of defense for individual liberties in the federal system. It is unnecessary to rest our decision on federal authority when the California Constitution alone provides an independent and adequate state constitutional basis on which to decide. Symptomatic for this court's minority position in falling prey to \"lockstep,\" we would recognize the following state resolutions among the multitude of cases. A. Privacy A pen register invasion of privacy, Sporleder, 666 P.2d 135, is unconstitutional as an unreasonable search and seizure under the Colorado Constitution by invasion of a legitimate expectancy of privacy in telephone numbers dialed by the user. Warrantless search is presumed to be invalid under the Colorado Constitution. Cf. People v. Guerra, 65 N.Y.2d 60, 489 N.Y.S.2d 718, 478 N.E.2d 1319 (1985); People v. Di Raffaele, 55 N.Y.2d 234, 448 N YS.2d 448, 433 N.E.2d 513 (1982) (declined to extend rights of privacy in New York on this subject beyond decision of the United States Supreme Court) and Winfield v. Division of Pari-Mutuel Wagering, Dept. of Business Regulation, 477 So.2d 544 (Fla. 1985) (right of privacy in Florida Constitution is much broader in scope than the federal constitution including privacy in financial institution records). See also Shaktman v. State, 553 So.2d 148 (Fla. 1989) (judicial order was required for pen register invasion of individual's right of privacy). Hunt, 450 A.2d 952 determined that the state legislature and the state constitution should move beyond protection provided by the federal doctrine as a second line of defense for rights of individuals, with telephone toll record acquisition without warrant invalidated. Contra State ex rel. Ohio Bell Tel. Co. v. Williams, 63 Ohio St.2d 51, 407 N.E.2d 2 (1980) (a warrant to install a pen register was not mandatory but \"it is a good procedure\"). As another example, the right to privacy in the use of \"controlled\" substances providing an issue determinable under the state constitution was involved in State v. Erickson, 574 P.2d 1 (Alaska 1978) and Ravin v. State, 537 P.2d 494 (Alaska 1975). In Washington, there is no good faith exception to the exclusionary rule under the state constitution. State v. Crawley, 61 Wn. App. 29, 808 P.2d 773 (1991). When the United States Supreme Court departed from the Aguilar-Spinelli standard in Illinois v. Gates, 462 U.S. 213, 103 S.Ct. 2317, 76 L.Ed.2d 527 (1983), Washington, in State v. Jackson, 102 Wn.2d 432, 688 P.2d 136 (1984), declined to follow Gates and retained the \"`well established protections against unreasonable searches' provided by Aguilar-Spinelli. * * * Under the Washington Constitution, the exclusionary rule serves not merely as a remedial measure for unconstitutional government actions, but rather to assure judicial integrity and preserve the individual's right to privacy.\" Crawley, 808 P.2d at 776 (quoting Jackson, 688 P.2d at 143) (emphasis added). See State v. White, 97 Wn.2d 92, 640 P.2d 1061 (1982). Washington recognized in the early case of State v. Gunkel, 188 Wn. 528, 63 P.2d 376, 380 (1936) \"that the State may not use, for its own profit, evidence that has been obtained in violation of law.\" The general subject is well stated in White, 640 P.2d at 1070-71 (footnote omitted): As we have stated in previous decisions, this court may interpret the Washington Constitution as more protective of individual rights than parallel provisions of the United States Constitution. See State v. Simpson, 95 Wn.2d 170, 177-82, 622 P.2d 1199 (1980); State v. Fain, 94 Wn.2d 387, 392-93, 617 P.2d 720 (1980); Federated Publications, Inc. v. Kurtz, 94 Wn.2d 51, 615 P.2d 440 (1980); Northend Cinema, Inc. v. Seattle, 90 Wn.2d 709, 714, 585 P.2d 1153 (1978); State v. Hehman, 90 Wn.2d 45, 49, 578 P.2d 527 (1978); Darrin v. Gould, 85 Wn.2d 859, 868, 540 P.2d 882 (1975). State v. Michaels, 60 Wn.2d 638, 646-47, 374 P.2d 989 (1962). See generally W. Brennan, State Constitutions and the Protection of Individual Rights, 90 Harv.L.Rev. 489 (1977). We have had two recent occasions to interpret Const. art. 1, § 7 more expansively than the Fourth Amendment so as to provide additional protection to citizens of this state. In State v. Simpson, supra, a plurality of this court found that Const. art. 1, § 7 conferred the right of \"automatic standing\" to contest illegal searches and seizures. This interpretation gave greater protections than those found by the United States Supreme Court in United States v. Salvucci, 448 U.S. 83, 100 S.Ct. 2547, 65 L.Ed.2d 619 (1980). In State v. Hehman, supra, this court found the Washington Constitution to grant greater protections than the Fourth Amendment in the area of custodial arrests for minor traffic violations. * * * The result reached by the United States Supreme Court in [Michigan v.] DeFillippo, [443 U.S. 31, 99 S.Ct. 2627, 61 L.Ed.2d 343 (1979)] is justifiable only if one accepts the basic premise that the exclusionary rule is merely a remedial measure for Fourth Amendment violations. As a remedial measure, evidence is excluded only when the purposes of the exclusionary rule can be served. This approach permits the exclusionary remedy to be completely severed from the right to be free from unreasonable governmental intrusions. Const. art. 1, § 7 differs from this interpretation of the Fourth Amendment in that it clearly recognizes an individual's right to privacy with no express limitations. In a case involving entry into a hotel room, the Washington court in State v. Ramirez, 49 Wn. App. 814, 746 P.2d 344 (1987), recognized that the Washington Constitution afforded greater protection to privacy interests than the Fourth Amendment, citing State v. Bell, 108 Wn.2d 193, 737 P.2d 254 (1987). In a search incident to an arrest, the Hawaiian Constitution provides significantly more confining rights of privacy to the individual in declining to follow United States v. Robinson, 414 U.S. 218, 94 S.Ct. 467, 38 L.Ed.2d 427 (1973) and Gustafson v. Florida, 414 U.S. 260, 94 S.Ct. 488, 38 L.Ed.2d 456 (1973). The Supreme Court of Hawaii in State v. Quino, 840 P.2d 358, 362 (Hawaii 1992) declined to adopt the definition of seizure the United States Supreme Court utilized in California v. Hodari D., ___ U.S. ___, 111 S.Ct. 1547, 113 L.Ed.2d 690 (1991). The court stated, \"`[a]s long as we afford defendants the minimum protection required by federal interpretations of the Fourteenth Amendment to the Federal Constitution, we are unrestricted in interpreting the constitution of this state to afford greater protection.'\" Quino, 840 P.2d at 362 (quoting State v. Texeira, 50 Haw. 138, 142 n. 2, 433 P.2d 593, 597 n. 2 (1967)). A federal court, in analyzing pre-employment polygraph testing, considered a trend of federal cases, Plante v. Gonzalez, 575 F.2d 1119 (5th Cir. 1978), cert. denied, 439 U.S. 1129, 99 S.Ct. 1047, 59 L.Ed.2d 90 (1979), and used a balancing test rather than the strict scrutiny analysis for privacy adopted by the Supreme Court of Texas. Woodland v. City of Houston, 940 F.2d 134 (5th Cir. 1991); Texas State Employees Union v. Texas Dept. of Mental Health and Mental Retardation, 746 S.W.2d 203 (Tex. 1987). These cases delineate the invalidity and short-sightedness of any lavish adaptation of decisions of the United States Supreme Court for application to protect the citizens of the jurisdiction under the purview of the state constitution. The Massachusetts Supreme Court in Guiney v. Police Com'r of Boston, 411 Mass. 328, 582 N.E.2d 523 (1991) repelled privacy invading random drug testing of police department personnel. The court rejected the concept approved by National Treasury Employees Union v. Von Raab, 489 U.S. 656, 109 S.Ct. 1384, 103 L.Ed.2d 685 (1989). Of particular note was the concurrence of Chief Judge Liacos, where he stated: While I concur with the result reached in this case, I must reiterate my concern with this court's willingness to consider the \"balance\" of public interests against privacy interests in determining the constitutionality of searches and seizures. * * * Notwithstanding its allusion to the laws of physics, and their concomitant certainty and precision, a \"balancing\" test subjects the constitutional right against unreasonable searches and seizures to a standard only slightly more enduring than the latest public opinion poll. It is my firm belief that the use of these tests, no matter how well-intended, will result in the eventual dissolution of this precious constitutional right. The focus of the constitutional analysis must remain on the issue whether reasonable cause exists to justify the particular search and seizure at issue. Guiney, 582 N.E.2d at 527. That court likewise in Com. v. Henderson, 411 Mass. 309, 582 N.E.2d 496 (1991) declined to follow Arizona v. Youngblood, 488 U.S. 51, 109 S.Ct. 333, 102 L.Ed.2d 281 (1988) requiring bad faith in failure to preserve potentially useful evidence. Instead of bad faith, due process was applied. On the subject of warrantless home arrest, the Washington Constitution provides greater protection to privacy interests than the Fourth Amendment. See State v. Griffith, 61 Wn. App. 35, 808 P.2d 1171 (1991) and Bell, 737 P.2d 254. In regard to the right to privacy, the Massachusetts Constitution does, or may, afford more substantive protection to individual's than that which prevails under the United States Constitution. Com. v. Blood, 400 Mass. 61, 507 N.E.2d 1029 (1987); Com. v. Upton, 394 Mass. 363, 476 N.E.2d 548 (1985). Considering an affidavit for arrest warrant — illegally obtained evidence, we find State v. Novembrino, 105 N.J. 95, 519 A.2d 820, 849-50 (1987), which states: It is an established principle of our federalist system that state constitutions may be a source of \"individual liberties more expansive than those conferred by the Federal Constitution.\" Pruneyard Shopping Center v. Robins, 447 U.S. 74, 81, 100 S.Ct. 2035, 2040, 64 L.Ed.2d 741, 752 (1980); see Oregon v. Hass, 420 U.S. 714, 718, 95 S.Ct. 1215, 1218-19, 43 L.Ed.2d 570, 575 (1975); State v. Gilmore, 103 N.J. 508, 522, 511 A.2d 1150 (1986); \"Symposium: The Emergence of State Constitutional Law,\" 63 Tex.L.Rev. 959 (1985); Pollock, \"State Constitutions as Separate Sources of Fundamental Rights,\" 35 Rutgers L.Rev. 707 (1983); \"Developments in the Law — The Interpretation of State Constitutional Rights,\" 95 Harv.L.Rev. 1324 (1982); Brennan, \"State Constitutions and the Protection of Individual Rights,\" 90 Harv.L.Rev. 489 (1977); Note, \"The New Jersey Supreme Court's Interpretation and Application of the State Constitution,\" 15 Rutgers L.J. 491 (1984). This Court has frequently resorted to our own State Constitution in order to afford our citizens broader protection of certain personal rights than that afforded by analogous or identical provisions of the federal Constitution. State v. Williams, 93 N.J. 39, 459 A.2d 641 (1983); Right to Choose v. Byrne, 91 N.J. 287, 450 A.2d 925 (1982); State v. Hunt, supra, 91 N.J. 338, 450 A.2d 952; State v. Alston, 88 N.J. 211, 440 A.2d 1311 (1981); State v. Schmid, 84 N.J. 535, 423 A.2d 615 (1980), appeal dismissed sub nom., Princeton Univ. v. Schmid, 455 U.S. 100, 102 S.Ct. 867, 70 L.Ed.2d 855 (1982); State v. Johnson, 68 N.J. 349, 346 A.2d 66 (1975). Although the language of article I, paragraph 7 of the New Jersey Constitution is virtually identical with that of the fourth amendment, we have held in other contexts that it affords our citizens greater protection against unreasonable searches and seizures than does the fourth amendment. See State v. Hunt, supra, 91 N.J. 338, 450 A.2d 952 (individual has protectible interest in telephone toll billing records under article I, paragraph 7 of the New Jersey Constitution); State v. Alston, supra, 88 N.J. 211, 440 A.2d 1311 (possessory interest in property sufficient to confer standing to challenge validity of automobile search); State v. Johnson, supra, 68 N.J. 349, 346 A.2d 66 (validity of consent to search depends on knowledge of the right to refuse consent). Warrantless entry of a home in the absence of exigent circumstances or other necessity raises a right to privacy under the Arizona Constitution: While we are cognizant of the need for uniformity in interpretation, we are also aware of our people's fundamental belief in the sanctity and privacy of the home and the consequent prohibition against warrantless entry. We believe that it was these considerations that caused the framers of our constitution to settle upon the specific wording in Article 2, § 8. While Arizona's constitutional provisions generally were intended to incorporate the federal protections, Malmin v. State, 30 Ariz. 258, 261, 246 P. 548, 549 (1926), they are specific in preserving the sanctity of homes and creating a right of privacy. Id. at 262-63, 246 P.2d at 549. After noting our previous cases and the wording of both the state and federal constitutional provisions, we held in [State v.] Martin, 139 Ariz. at 474, 679 P.2d at 498, and affirm here, that as a matter of state law officers may not make a warrantless entry of a home in the absence of exigent circumstances or other necessity. Such entries are \"per se unlawful\" under our state constitution. * * * Such entries are violations of our constitution's guarantee of the right to privacy. State v. Bolt, 142 Ariz. 260, 689 P.2d 519, 523-24 (1984) (footnotes omitted). See also People v. Hammons, 235 Cal.App.3d 1710, 5 Cal.Rptr.2d 317 (1991), involving right to promised privacy at police station. Cf. Haworth v. State, 840 P.2d 912 (Wyo. 1992). For a comprehensive review involving state constitutional rights of privacy from personal autonomy to sobriety check points, see Ken Gormley \u0026 Rhonda G. Hartman, Privacy and the States, 65 Temple L.Rev. 1279 (1992). This general subject of privacy, as a constitutional issue under state constitutions, has a broad and pervasive scope as the small sample of cases earlier outlined illustrate. In this anxiety, a thoughtful consideration of the dangers to the intrinsic structure of the American society is illustrated in a long course of consideration by legal commentators. The point of departure in considering privacy, of course, came from Samuel D. Warren \u0026 Louis D. Brandeis, The Right to Privacy, 4 Harv.L.Rev. 193 (1890). See also William L. Prosser, Privacy, 48 Cal.L.Rev. 383 (1960). That broad subject has now narrowed for this decision by the dual concepts of no right to privacy regarding numbers to whom or from whom calls are placed by telephone and the \"lockstep\" attribution of United States Supreme Court decisions. An illustrative sampling of writing from commentators' analyses discloses the depth of concern. See, e.g., Alan F. Westin, Science, Privacy, and Freedom: Issues and Proposals for the 1970's, 66 Colum.L.Rev. 1003 (1966) and Gerald B. Cope, Jr., Note, Toward a Right of Privacy as a Matter of State Constitutional Law, 5 Fla.St. U.L.Rev. 631 (1977). Gerald B. Cope, Jr. said, as he anticipated the future with concern and with considerable foresight: Events of the past ten years have brought to the fore privacy issues on a larger scale. At the same time, retrenchment by the United States Supreme Court and the report of the Privacy Protection Study Commission have made it abundantly clear that the right of privacy will be fully protected only if there is action by the states. It is time to take that step. It is vital to a free society to establish a zone of privacy in which each individual is free from physical and psychological intrusion and has the autonomy to make vital personal decisions. \"[T]he right to be let alone,\" Brandeis said, is \"the most comprehensive of rights and the right most valued by civilized men.\" It is time to protect that right — by establishing the right of privacy as a matter of state constitutional law. Id. at 742-43 (quoting Olmstead, 277 U.S. at 478, 48 S.Ct. at 572, Brandeis, J., dissenting). See also, Robert F. Utter, Ensuring Principled Development of State Constitutional Law: Responsibilities for Attorneys and Courts, 1 Emerging Issues in State Constitutional Law 217 (1988). A broadened perspective regarding rights of privacy under state constitutions and an issue important to state jurists is provided by numerous commentators, which include John C. Barker, Constitutional Privacy Rights in the Private Workplace, Under the Federal and California Constitutions, 19 Hastings Const. L.Q. 1107 (1992); Timothy O. Lenz, Florida's Constitutional Right of Privacy and Criminal Justice Policies, 28 Crim.L.Bull. 137 (1992); Sheldon W. Halpern, Rethinking the Right of Privacy: Dignity, Decency, and the Law's Limitations, 43 Rutgers L.Rev. 539 (1991); John Wesley Hall, Jr., Privacy: Drug War Casualty, Nat'l L.J., Feb. 17, 1992; and Kelso, supra, 19 Pepp.L.Rev. 327. State constitutional guarantees for a right to privacy are alive and enduring (except in Wyoming). This right for us should not be easily or ignorantly abandoned. B. Equal Protection For similar consideration within this broad subject, we should also look at the state equal protection clause. See Alaska Pacific Assur. Co. v. Brown, 687 P.2d 264 (Alaska 1984); Erickson, 574 P.2d 1; Isakson v. Rickey, 550 P.2d 359 (Alaska 1976). See also Sonneman v. Knight, 790 P.2d 702 (Alaska 1990). In Zsupnik v. State, 789 P.2d 357 (Alaska 1990), as an incident of arrest, the defendant was entitled to call a relative or a lawyer before determining whether to take a breathalyzer test. In Lauderdale v. State, 548 P.2d 376 (Alaska 1976), the Alaska Supreme Court addressed the reversal of a conviction where the arresting agency failed to retain the components of the breathalyzer test for scientific determination relative to the validity of the test when given. The issue of a fair trial was at stake. The consistency of the Alaska court in recognizing the state due process right, as different from the limited protection provided by the United States Supreme Court, see California v. Trombetta, 467 U.S. 479, 104 S.Ct. 2528, 81 L.Ed.2d 413 (1984), in following Lauderdale, 548 P.2d 376, includes Gundersen v. Municipality of Anchorage, 792 P.2d 673 (Alaska 1990) and Oveson v. Municipality of Anchorage, 574 P.2d 801 (Alaska 1978). The Alaska court, in application of equal protection, applies a flexible sliding scale more protective of state citizens than is afforded by United States Supreme Court decisions. See Sonneman, 790 P.2d 702; Alaska Pacific Assur. Co., 687 P.2d 264. The Utah Supreme Court, in Greenwood v. City of North Salt Lake, 817 P.2d 816, 820-21 (Utah 1991) (citing Malan v. Lewis, 693 P.2d 661, 670 (Utah 1984)), in considering public safety regulation of pitbull breeding, recognized different equal protection guarantees derived from application of the Utah Constitution and the results provided under federal law: Because no fundamental right or suspect class is involved in this case, the Fourteenth Amendment requires only that the classification be rationally related to a valid public purpose. * * * [The Utah Constitution] requires that a law must apply equally to all persons within a class and that statutory classifications must have a reasonable tendency to further the objectives of the statute. State v. Russell, 477 N.W.2d 886 (Minn. 1991) involved a differentiated penalty for crack cocaine compared to cocaine powder involving a determined racial function in usage. The Minnesota court recognized that \"[s]ince the early eighties, this court has, in equal protection cases, articulated a rational basis test that differs from the federal standard[.]\" Id. at 888. A more stringent standard of review as a matter of state law was applied under the state constitution equivalent to the equal protection clause of the federal constitution. An interesting comment was included: To harness interpretation of our state constitutional guarantees of equal protection to federal standards and shift the meaning of Minnesota's constitution every time federal case law changes would undermine the integrity and independence of our state constitution and degrade the special role of this court, as the highest court of a sovereign state, to respond to the needs of Minnesota citizens. Id. at 889. The issue on a certified question to be considered by the Ohio Supreme Court from the federal district court of that jurisdiction resulted in a persuasive recognition by the state tribunal: We begin with a truism: the Ohio Constitution permits the state to exercise its own sovereignty as far as the United States Constitution and laws permit. Since federal law recognizes Ohio's sovereignty by making Ohio law applicable in federal courts, the state has the power to exercise and the responsibility to protect that sovereignty. Scott v. Bank One Trust Co., N.A., 62 Ohio St.3d 39, 577 N.E.2d 1077, 1079 (1991). The Ohio court further included a comment from a federal judge with which strong disagreement was stated: Another federal judge has argued that it matters little if a federal court errs in applying state law, because if \"state law is so unclear that a federal court, honestly trying to discover and apply it, falls into error * * * the relevant state policies are so lacking in development and firmness that their nonapplication in a diversity case is not of very great moment.\" Id., 577 N.E.2d at 1080 (quoting Wright, The Federal Courts and the Nature and Quality of State Law, 14 Wayne L.Rev. 317, 320 (1967)). C. Search and Seizure — Confessions The subject of expanded protection, in the multiplicity of search and seizure circumstances, has not been ignored in state constitutional law development. Recent cases, declining to follow a \"lockstep\" attribution of the United States Supreme Court decision making, would include the Massachusetts Constitution which provides greater protection against unlawful search and seizure than does the Fourth Amendment. Com. v. Cast, 407 Mass. 891, 556 N.E.2d 69 (1990). See also Blood, 507 N.E.2d 1029 (wiretaps). The court recognized that not only probable cause was required, but, for warrantless search, exigent circumstances had to be demonstrated. See also Com. v. Wunder, 407 Mass. 909, 556 N.E.2d 65 (1990). A search preclusion was authenticated in Com. v. Rostad, 410 Mass. 618, 574 N.E.2d 381 (1991), considering a custodial inventory search of defendant's purse following traffic conduct observation stop and license suspension arrest. Defendant's handbag was opened and its contents inventoried. Lacking specificity in written police procedures, which otherwise permitted exercise of discretion, the search was unfair within the Massachusetts Constitution. Another pat-down case was provided in People v. Mathis, 211 Ill. App.3d 678, 156 Ill.Dec. 158, 570 N.E.2d 634 (1991) when a hard object, about the size of a golf ball, was felt on a defendant's person, seized, opened, and determined to contain cocaine. Under the totality of the circumstances, the court held that the statement that the officer reasonably might have believed the object was a weapon was manifestly erroneous. An order denying a motion to suppress was reversed and the conviction was overturned. A pharmacy search, State v. Penn, 61 Ohio St.3d 720, 576 N.E.2d 790 (1991), based on entry permitted by a discharged employee, was likewise subjected to review under the Ohio Constitution and was found to protect the commercial building as well as private homes and offices. A violation of a knock-and-announce rule on entry into a private dwelling was a violation of a state constitutional prohibition against unreasonable searches and seizures under the Pennsylvania Constitution. For the violation, exclusion of the evidence was the appropriate remedy under the Pennsylvania constitutional protective umbrella. \"Exclusion of evidence is the appropriate remedy for this violation. `A search is not to be made legal by what it turns up. In law, it is good or bad when it starts and does not change character from what is dug up subsequently.' Commonwealth v. Newman, 429 Pa. 441, 449, 240 A.2d 795, 799 (1968), citing United States v. Di Re, 332 U.S. 581, 595, 68 S.Ct. 222, 229, 92 L.Ed. 210 (1948).\" Com. v. Chambers, 528 Pa. 403, 598 A.2d 539, 542 (1991). The Di Re case is probably not good law today under present applications of the United States Constitution in current cases. Two of the most persuasive cases coming from jurisdictions which protect the validity and sanctity of the state constitutions are State v. Geisler, 25 Conn. App. 282, 594 A.2d 985 (1991) and People v. Harris, 77 N Y2d 434, 568 N.Y.S.2d 702, 570 N.E.2d 1051 (1991). In State v. Geisler, 22 Conn. App. 142, 576 A.2d 1283, cert. denied, 215 Conn. 819, 576 A.2d 547 (1990), cert. granted and judgment vacated, ___ U.S. ___, 111 S.Ct. 663, 112 L.Ed.2d 657 (1991) (Geisler I), the Connecticut court held that warrantless entry into the defendant's home violated the Fourth Amendment to the United States Constitution, lacking exigent circumstances to justify the entry. The court held that evidence derived from the illegal arrest was a tainted product of that arrest and subject to suppression. The United States Supreme Court reversed and remanded based on New York v. Harris, 495 U.S. 14, 110 S.Ct. 1640, 109 L.Ed.2d 13 (1990). The original New York decision had likewise required suppression under a similar circumstance. The United States Supreme Court reversed and remanded on a federal constitutional basis. In Harris, 568 N.Y.S.2d 702, 570 N.E.2d 1051, upon remand, the New York Court of Appeals declined to follow the federally determined Harris decision and applied a protective body of law for New York resting on concerns of due process which is substantially greater than that recognized in the United States Supreme Court decision. In Geisler, the Connecticut court similarly, upon remand, reconsidered based upon the Connecticut Constitution an issue previously unresolved in the earlier opinion and again held the evidence inadmissible. The court stated: We, therefore, reject a per se inclusion of evidence obtained outside a home following a Payton [v. New York, 445 U.S. 573, 100 S.Ct. 1371, 63 L.Ed.2d 639] violation, regardless of temporality and intervening circumstances. The facts of this case are such that the unlawful entry into the home was not diluted or lessened in effect by the passage of time or intervening circumstances when the evidence in question was obtained. We conclude that the federal exclusionary rule, as narrowed by New York v. Harris, supra, does not ensure that Connecticut citizens' rights, as guaranteed by our state constitution, will be adequately protected. We hold, therefore, that our state exclusionary rule, as derived from article first, § 7, bars the state from using evidence acquired outside a defendant's home following a Payton violation, unless the taint resulting from the violation is sufficiently attenuated from the initial entry into the home. Geisler, 594 A.2d at 990. The coerced confession cases and attribution of applied harmless error appropriately come within this category of decision making by state courts which refuse to follow a federal harmless error absolution. Arizona v. Fulminante, ___ U.S. ___, 111 S.Ct. 1246, 113 L.Ed.2d 302 (1991); Tamara Lynne Jones, Comment, Coerced Confessions and Harmless Error, 18 Ohio N.U.L.Rev. 877 (1992); Lynne Trulock Ravellette, Note, Criminal Procedure — Harmless Error — Coerced Confession Is No Longer Grounds for Automatic Reversal of a Trial. Arizona v. Fulminante, ___ U.S. ___, 111 S.Ct. 1246, 113 L.Ed.2d 302 (1991), 14 U.Ark. Little Rock L.J. 537 (1992); David F. Wells, Comment, Due Process Bows to Judicial Expediency: Should Michigan Follow Arizona v. Fulminante?, 69 U.Det. Mercy L.R. 227 (1992); Amy B. Bloom, Comment, Constitutional Law — Harmless Error Analysis Applies to Erroneously Admitted Coerced Confessions — Arizona v. Fulminante, ___ U.S. ___, 111 S.Ct. 1246, 113 L.Ed.2d 302 (1991), 26 Suffolk U.L.Rev. 269 (1992). See, however, Robert J. Fratianne, Note, California and the Coerced Confession: The Effect of Arizona v. Fulminante — Did the Supreme Court Go For Enough?, 22 Sw.U.L.Rev. 285 (1992). It is the Fourth Amendment cases, involving categories of search and seizure, where this court further makes an incursion into \"lockstep,\" by dicta, to which I take the strongest exception. Search and seizure under the Fourth Amendment or arrest under the Fifth Amendment cases provide the arena where the more apparent deviation or distinction between state constitutional rights and the application of the Fourth and Fifth Amendments by the federal court system can more clearly be discerned. Attacks on the exclusionary rule and utilization of the Leon good faith validation of an invalid search and seizure, as well as consideration of when has seizure occurred under the Fourth Amendment, provide the substance for both case decisions in reversing denial of suppression or seizure and extended commentaries by legal authorities. A review, which examines this whole galaxy of issues, is provided by Daniel J. Capra, Prisoners of Their Own Jurisprudence: Fourth and Fifth Amendment Cases in the Supreme Court, 36 Vill.L.R. 1267 (1991), where the author considers checkpoint stops, Michigan Dept. of State Police v. Sitz, 496 U.S. 444, 110 S.Ct. 2481, 110 L.Ed.2d 412 (1990), under some character of a Terry, 392 U.S. 1, 88 S.Ct. 1868 concept. Next considered was anonymous tip information sufficient to create reasonable suspicion. Alabama v. White, 496 U.S. 325, 110 S.Ct. 2412, 110 L.Ed.2d 301 (1990). See Goettl v. State, 842 P.2d 549 (Wyo. 1992), Urbigkit, J., dissenting; plain view seizure eliminating the required inadvertence, Horton v. California, 496 U.S. 128, 110 S.Ct. 2301, 110 L.Ed.2d 112 (1990); third party consent, Illinois v. Rodriguez, 497 U.S. 177, 110 S.Ct. 2793, 111 L.Ed.2d 148 (1990);12. reasonableness of protective sweep for self protection, Maryland v. Buie, 494 U.S. 325, 110 S.Ct. 1093, 108 L.Ed.2d 276 (1990); discretional inventory searches, Florida v. Wells, 495 U.S. 1, 110 S.Ct. 1632, 109 L.Ed.2d 1 (1990); exigent circumstances for arrest, Minnesota v. Olson, 495 U.S. 91, 110 S.Ct. 1684, 109 L.Ed.2d 85 (1990); and Miranda limitation, Illinois v. Perkins, 496 U.S. 292, 110 S.Ct. 2394, 110 L.Ed.2d 243 (1990), where an undercover agent was placed in the prisoner's cell. It would seem that this whole array of cases, each without protective morality, has now been rewritten into Wyoming law. D. Leon For Example Illustrative, for only one of the segments of this array of issues, is State v. Oakes, 157 Vt. 171, 598 A.2d 119 (1991), where that court declined an invitation to apply good faith as a justification to fulfill the lack of initial probable cause. The Leon concept has been given broad rejection. State v. Gutierrez, 112 N.M. 774, 819 P.2d 1332 (1991), cert. granted, 841 P.2d 549 (N.M. 1992). The \"good faith\" exception to the exclusionary rule defined in Leon, 468 U.S. 897, 104 S.Ct. 3405 was not followed in Edmunds, 586 A.2d 887. See also State v. Marsala, 216 Conn. 150, 579 A.2d 58 (1990); Mason v. State, 534 A.2d 242 (Del.Super. 1987); Upton, 476 N.E.2d 548; Stringer v. State, 491 So.2d 837 (Miss. 1986); Novembrino, 519 A.2d 820; People v. Bigelow, 66 N.Y.2d 417, 497 N.Y.S.2d 630, 488 N.E.2d 451 (1985); State v. Carter, 322 N.C. 709, 370 S.E.2d 553 (1988); Jean-Paul Layrisson, Comment, The Exclusion of Unconstitutionally Obtained Evidence and Why the Louisiana Supreme Court Should Reject United States v. Leon on Independent State Grounds, 51 La.L.Rev. 861 (1991); and Andrea Lynn Bistline, Note, The State Constitution as a Source of Individual Liberties: Declining to Apply the \"Good-Faith\" Exception to the Exclusionary Rule in Commonwealth v. Edmunds, 96 Dick.L.Rev. 573 (1992). Andrea Bistline's conclusion provides a thoughtful perspective: The decision in Edmunds reflects a deep-rooted tradition of respect for individual privacy rights in Pennsylvania. While the failure to apply the \"good-faith\" exception may in some cases allow guilty defendants to go free, it also, and more importantly, preserves the integrity of the constitutional right to be free from unreasonable searches and seizures. At a time when more and more individual liberties are being curtailed on a federal level, state courts are returning to their own constitutions to deal with issues that have been left to the United States Supreme Court for forty years. State courts must continue to interpret their own laws on a separate basis from federal law in order to guarantee the full realization of personal liberties throughout this country. Id. at 579 (footnotes omitted). For further review and authority, see William J. Mertens and Silas Wasserstrom, The Good Faith Exception to the Exclusionary Rule: Deregulating the Police and Derailing the Law, 70 Geo.L.J. 365 (1981). Likewise disdaining to follow Leon, there is no good faith exception to the exclusionary rule under the New Mexico Constitution, following with approval in State v. Greene, 162 Ariz. 383, 783 P.2d 829 (1989); Marsala, 579 A.2d 58; People v. David, 119 Mich. App. 289, 326 N.W.2d 485 (1982); Novembrino, 519 A.2d 820; and Bigelow, 497 N.Y.S.2d 630, 488 N.E.2d 451. Good reason for a better rule is persuasively provided. E. The Roadblock Cases for Another Example The roadblock cases centered upon Sitz, 496 U.S. 444, 110 S.Ct. 2481 have comparable aspects regarding state law constitutional adaptation. But see Sitz v. Department of State Police, 193 Mich. App. 690, 485 N.W.2d 135 (1992). See also Jonathan A. Block, Please Stop: The Law Court's Recent Roadblock Decisions, 44 Me.L.Rev. 461 (1992). Considerable persuasion is provided on this topic by the result achieved in Michigan following remand from Sitz for a consideration of the constitutional principles involved in the automatic stop under the purview of the Michigan Constitution. Sitz, 485 N.W.2d 135. The state court categorically declined to follow the prior United States Supreme Court distillation of constitutional interest involved in that police activity. \"We find the indiscriminate suspicionless stopping of motor vehicles violative of art. 1, § 11 of the Michigan Constitution.\" Sitz, 485 N.W.2d at 139. See also Mitchell Lampson, On the Silver Anniversary of Terry v. Ohio: The Reasonableness of an Automatic Frisk, 28 Crim. L.Bull. 336 (1992) and Judith E. Baylinson, Criminal Procedure — Pennsylvania Circumvents the Plain View Doctrine in a Warrantless Search — Commonwealth v. Smith, 524 Pa. 72, 569 A.2d 337 (1990), 64 Temp.L.Rev. 251, 260 (1991). F. To Be Followed by Hodari D. and Bostick Similarly emplaced in search and seizure are the Hodari D. and Bostick derived cases. Hodari D., ___ U.S. ___, 111 S.Ct. 1547; Florida v. Bostick, ___ U.S. ___, 111 S.Ct. 2382, 115 L.Ed.2d 389 (1991). See also Thomas K. Clancy, The Future of Fourth Amendment Seizure Analysis After Hodari D. and Bostick, 28 Am.Crim. L.Rev. 799 (1991); Christian J. Rowley, Florida v. Bostick: The Fourth Amendment — Another Casualty of the War on Drugs, 1992 Utah L.Rev. 601 (1992); Susan M. Kuzma, Seizures Under the Fourth Amendment: Let's Cut to the Chase, 18 Am.J.Crim.L. 289 (1991); and Wayne R. LaFave, Pinguitudinous Police, Pachydermatous Prey: Whence Fourth Amendment \"Seizures\"?, 1991 U.Ill.L.Rev. 729 (1991). Exigent or explained circumstances cases fare no better. George E. Dix, Entry to Execute Search Warrants In Texas Criminal Procedure, 19 Am.J.Crim. L. 159 (1992); Jacqueline Bryks, The Second Circuit Review — 1989-1990 Term. Exigent Circumstances and Warrantless Home Entries: United States v. MacDonald, 57 Brook L.Rev. 307 (1991); Baylinson, supra, 64 Temp.L.Rev. 251. In a motor vehicle search case, it was recognized to be \"settled law that the Washington constitution * * * provides greater protection than does the Fourth Amendment.\" State v. McFadden, 63 Wn. App. 441, 820 P.2d 53, 55 (1991). See also Gunwall, 720 P.2d 808; Boland, 800 P.2d 1112; Gutierrez, 819 P.2d 1332; State v. Beyer, 822 P.2d 519 (Hawaii 1991). The bottoming fact for this entire snow-covered prairie of issues involving the Fourth and Fifth Amendments is the directed federal attack on philosophical justification for the exclusionary rule. The attack embraces the principle of useability based on usefulness without regard for method of acquisition. Christopher Slobogin addressed the topic in, The World Without a Fourth Amendment, 39 U.C.L.A.L.Rev. 1 (1991). This well-plowed field before the snow came does include, as illustrative only, William C. Heffernan \u0026 Richard W. Lovely, Evaluating the Fourth Amendment Exclusionary Rule: The Problem of Police Compliance With the Law, 24 U.Mich.J.L.Ref. 311 (1991); John Apol, The Fourth Amendment: Historical Perspective, Warrantless Searches and a Solution to the Exclusionary Rule Debate, 4 Det.C.L.Rev. 1205 (1991); Craig D. Uchida \u0026 Timothy S. Bynum, Search Warrants, Motions to Suppress and \"Lost Cases:\" The Effects of the Exclusionary Rule in Seven Jurisdictions, 81 J.Crim.L. \u0026 Criminology 1034 (1991); Yale Kamisar, Does (Did) (Should) The Exclusionary Rule Rest On A \"Principled Basis\" Rather Than An \"Empirical Proposition\"?, 16 Creighton L.Rev. 565 (1983); Peter F. Nardulli, The Societal Cost of the Exclusionary Rule: An Empirical Assessment, 1983 Am.B.Found.Res.J. 585 (1983); and Silas Wasserstrom \u0026 William J. Mertens, The Exclusionary Rule On The Scaffold: But Was It A Fair Trial?, 22 Am.Crim. L.Rev. 85 (1984). G. Other Constitutional Protections Enforced and Protected by State Constitutions — Confrontation, Proportionality, Counsel, Bail and Double Jeopardy, for a Few Examples Similar concerns involving state constitutional rights to confrontation have followed the United States Supreme Court decision of Coy v. Iowa, 487 U.S. 1012, 108 S.Ct. 2798, 101 L.Ed.2d 857 (1988). See also Beyer, 822 P.2d 519. For example, regarding the right of confrontation, U.S. Const. amend. VI, see Com. v. Ludwig, 527 Pa. 472, 594 A.2d 281 (1991) and Com. v. Lohman, 527 Pa. 492, 594 A.2d 291 (1991) (closed circuit television disproved in contravention to right of confrontation). In a somewhat similar constitutional examination, the Indiana court in Brady v. State, 575 N.E.2d 981 (Ind. 1991) determined that a statute authorizing video taped testimony of a child witness in child abuse cases unconstitutionally infringed upon the defendant's right of confrontation guaranteed under the Indiana Constitution. The court recognized its historical precedent. The confrontation right contained both the right to cross-examine and the right to meet the witnesses face to face. It further said: This Court has recently examined the origins and traced the development of the right of criminal defendants to meet the witnesses face to face as this right is guaranteed by Article I, § 13 of the Indiana Constitution. Miller [v. State], 517 N.E.2d 64. Article I, § 13 provides: \"In all criminal prosecutions, the accused shall have the right . . . to meet the witnesses face to face. . . .\" This Court has long recognized that this basic trial right is an ancient one with roots in the common law and that its design has more than a single part. Because this right is secured by the Constitution, it cannot be abridged by judicial or legislative action. Graves v. State (1931), 203 Ind. 1, 178 N.E. 233. Brady, 575 N.E.2d at 986-87. Other topics similarly demonstrating extension beyond the criteria now enforced by the United States Constitution include right to assistance of counsel, People v. Settles, 46 N.Y.2d 154, 412 N.Y.S.2d 874, 385 N.E.2d 612 (1978) (right to assistance of counsel to safeguard substantive and procedural rights is inviolable and fundamental). Protection is superior to that afforded by federal constitutional application, including the requirement that a criminal defendant under indictment and in custody may not waive his right to counsel unless he does so in the presence of an attorney. The right to bail, including the protection from unreasonable or arbitrary denial, extends the protection beyond the federal Bill of Rights. Huihui v. Shimoda, 64 Haw. 527, 644 P.2d 968 (1982). See, in identical circumstance, a fourth Wyoming case which has recently revisited the Wyoming Constitution in determining right to bail for those persons arrested by state authorities. Simms, 839 P.2d 381. Likewise, see the principle applied in State v. Soriano, 68 Or. App. 642, 684 P.2d 1220, 1222 (1984), where refusal to testify before the grand jury was considered after the defendant had been granted use and derivative use immunity: In recent years, the Oregon Supreme Court has made it clear that the Oregon Constitution has a content independent of that of the federal constitution and that Oregon courts should consider state constitutional claims before examining issues of federal law. See, e.g., In re Lasswell, 296 Or. 121, 673 P.2d 855 (1983); State v. Lowry, 295 Or. 337, 667 P.2d 996 (1983); State v. Kennedy, 295 Or. 260, 666 P.2d 1316 (1983); State v. Davis, 295 Or. 227, 666 P.2d 802 (1983); Hewitt v. SAIF, 294 Or. 33, 653 P.2d 970 (1982); State v. Caraher, 293 Or. 741, 653 P.2d 942 (1982). The state nonetheless argues that, with respect to the issue now before us, we should generally construe the Oregon Constitution to the same effect as the United States Supreme Court construes similar provisions of the federal constitution. It points out that many of the guarantees in both constitutions come from the same sources and urges that the United States Supreme Court's construction of them should control the Oregon construction. The state's arguments miss the point of the Oregon Supreme Court's holdings. While many guarantees of the state and federal constitutions have their roots in the same sources, they are embodied in different constitutions, with different ultimate interpreters, and may reflect variations in their values and purposes. They generally appeared first in state constitutions and were later added to the federal. No court is the primary interpreter of those guarantees. Under the Fourteenth Amendment, the United States Supreme Court's construction of the federal version of those guarantees is both authoritative for the federal system and a constitutional minimum which states must obey. Its decisions do not, however, decide the meaning of the Oregon Constitution. In that respect, a United States Supreme Court majority is no more binding in Oregon than is a United States Supreme Court minority, a decision of the Supreme Courts of Hawaii, California, or Georgia, or a well-reasoned law review article. Judicial opinions from other jurisdictions are helpful in interpreting the Oregon Constitution to the extent that their reasoning is persuasive and their background is applicable to Oregon. Cf. State v. Kennedy, supra (establishing a double jeopardy rule under the Oregon Constitution different from that proposed by the majority or the minority of the United States Supreme Court). This independent construction of Oregon law holds even the Oregon law is directly derived from the federal law, which the Oregon Bill of Rights is not. See State v. Pottle, 296 Or. 274, 677 P.2d 1 (1984). In People v. Young, 814 P.2d 834, 842-43 (Colo. 1991), the death penalty was discussed by the Colorado Supreme Court: We have recognized and exercised our independent role on a number of occasions and on several have determined that the Colorado Constitution provides more protection for our citizens than do similarly or identically worded provisions of the United States Constitution. See, e.g., People v. Oates, 698 P.2d 811 (Colo. 1985) (rejecting the reasoning of United States v. Karo, 468 U.S. 705, 104 S.Ct. 3296, 82 L.Ed.2d 530 (1984), which construed the United States Constitution, and holding that warrantless installation of an electronic tracking device in a drum of chemicals prior to sale violated the purchaser's right to protection against unreasonable searches under the Colorado Constitution); People v. Sporleder, 666 P.2d 135 (Colo. 1983) (holding, in contrast to Smith v. Maryland, 442 U.S. 735, 99 S.Ct. 2577, 61 L.Ed.2d 220 (1979), construing the federal constitution, that warrantless installation of a pen register to record numbers dialed from defendant's home telephone constituted an unreasonable search under the Colorado Constitution); Charnes v. DiGiacomo, 200 Colo. 94, 612 P.2d 1117 (1980) (rejecting the rationale of United States v. Miller, 425 U.S. 435, 96 S.Ct. 1619, 48 L.Ed.2d 71 (1976), which construed the federal constitution, and holding that a bank customer has a reasonable expectation of privacy in bank records of the customer's financial transactions for purposes of state constitutional protections against unreasonable searches); People v. Paulsen, 198 Colo. 458, 601 P.2d 634 (1979) (rejecting the double jeopardy analysis in United States v. Scott, 437 U.S. 82, 98 S.Ct. 2187, 57 L.Ed.2d 65 (1978), in interpreting the state constitution to preclude a retrial of the defendant where the trial court erroneously entered post-jeopardy judgment of acquittal on grounds unrelated to factual guilt or innocence); Juhan [v. District Court for Jefferson County], 165 Colo. 253, 439 P.2d 741 (rejecting due process analysis in Leland v. Oregon, 343 U.S. 790, 72 S.Ct. 1002, 96 L.Ed. 1302 (1952), which held an Oregon statute requiring an accused to prove sanity beyond a reasonable doubt to be constitutional under federal standards, and concluding that a Colorado statute requiring an accused to prove sanity by a preponderance of evidence violated the due process clause of the Colorado Constitution). Cf. [People v.] Davis, 794 P.2d at 170-72 (evaluating challenges to the death penalty statute under the Colorado Constitution by applying Colorado law and using United States Supreme Court cases only for guidance); * * *. This history reflects our repeated recognition that the Colorado Constitution, written to address the concerns of our own citizens and tailored to our unique regional location, is a source of protection for individual rights that is independent of and supplemental to the protections provided by the United States Constitution. Double jeopardy — exigent circumstances — is not found by smelling burning marijuana cigarettes. State v. Santiago, 813 P.2d 335 (Hawaii App. 1991). The Hawaiian double jeopardy constitutional standard was more \"rigorous\" than the Blockburger rule adapted by the United States Supreme Court. Sentencing as a subject for a contrary view to determinations by the United States Supreme Court is also a subject not without notice. Harmelin v. Michigan, ___ U.S. ___, 111 S.Ct. 2680, 115 L.Ed.2d 836 (1991) as compared to Solem v. Helm, 463 U.S. 277, 103 S.Ct. 3001, 77 L.Ed.2d 637 (1983) has received both law journal and case disaffirmance. State v. Bartlett, 171 Ariz. 302, 830 P.2d 823, cert. denied ___ U.S. ___, 113 S.Ct. 511, 121 L.Ed.2d 445 (1992); People v. Boyce, 228 Ill. App.3d 87, 170 Ill.Dec. 65, 592 N.E.2d 501 (1992); Aisha Ginwalla, Proportionality and the Eighth Amendment: And Their Object Not \"Sublime, to Make the Punishment Fit the Crime\", 57 Mo.L.Rev. 607 (1992); G. David Hackney, A Trunk Full of Trouble: Harmelin v. Michigan, 111 S.Ct. 2680 (1991), 27 Harv.C.R.-C.L.L.Rev. 362 (1992).13. Also compare Bowers v. Hardwick, 478 U.S. 186, 106 S.Ct. 2841, 92 L.Ed.2d 140 (1986) with the Kentucky resolution in State v. Wasson, 842 S.W.2d 487 (Ky. 1992) and the Illinois court differentiation of People v. Griggs, 152 Ill.2d 1, 178 Ill.Dec. 1, 604 N.E.2d 257 (1992) and People v. McCauley, 228 Ill. App.3d 893, 172 Ill. Dec. 222, 595 N.E.2d 583 (1992) with Moran v. Burbine, 475 U.S. 412, 106 S.Ct. 1135, 89 L.Ed.2d 410 (1986). Another example of additional state constitutional protection is provided in Utah for due process in eyewitness identification in State v. Ramirez, 817 P.2d 774 (Utah 1991). See also Developments in State Constitutional Law, supra, 23 Rutgers L.J. at 846 (procedural due process discussion). The foregoing cases and analysis are not intended to be either exhaustive or even illustrative of the character of cases where many of the state's highest courts have determined that the state constitution should be given first consideration in protecting individual rights. Estimates vary, but the total number of cases available today to demonstrate this adaptive principle are considered to certainly total more than five hundred, generally coming since 1977 after the ground breaking call to action was broadcast by Justice William J. Brennan, Jr. Illustrative, as taken from a differentiated non-criminal case involving equal protection, is the defining comment in Hodgeman v. Jard Co., 599 A.2d 1371, 1373 (Vt. 1991). The court held \"that the Vermont Constitution is freestanding and may require [it] to examine more closely distinctions drawn by state government than would the Fourteenth Amendment.\" Id. Directed to the same perception, Chief Justice Randall T. Shepard provided a foreword in Indiana Law, the Supreme Court, and a New Decade, 24 Ind.L.Rev. 499 (1991). He recognized that the turning point in the Indiana Supreme Court's jurisdiction during the period was the court's use of the Indiana Constitution to resolve issues that previously would have been resolved only by reference to the United States Constitution. State courts across the country increasingly have relied on their own constitutions for almost two decades, but most commentators did not notice the movement until 1975 when Justice William Brennan, dissenting from a Burger Court decision on the constitutional rights of criminal defendants, urged state courts to use their own constitutions to afford protections not available under the federal charter. Id. at 504 (citing Michigan v. Mosley, 423 U.S. 96, 120, 96 S.Ct. 321, 334, 46 L.Ed.2d 313 (1975), Brennan, J., dissenting). A footnote in the law review further considered: For a more thorough discussion of the view that Brennan hardly started this movement but only gave it visibility, see Shepard, State Constitutions: State Sovereignty, Intergovernmental Perspective, Summer 1989, at 10. See also Falk, The Supreme Court of California, 1971-1972: Foreword — The State Constitution: A More Than \"Adequate\" Nonfederal Ground, Neglect and the Need for a Renaissance, 3 Val.U.L.Rev. 125 (1969); Linde, First Things First: Rediscovering the States' Bills of Rights, 9 U.Balt.L.Rev. 379, 396 n. 70 (1980) (providing extensive bibliography). Shepard, supra, 24 Ind.L.Rev. at 504 n. 25. Whenever it started, it certainly is here to be a major progression in American law. Illustrative reviews by a wide range of analysts, legal scholars and commentators would find general substance in the attribution of state constitutional application. I note in review, only in part, however: Brennan, supra, 90 Harv.L.Rev. 489; The Role of a Bill of Rights in a Modern State Constitution, 45 Wn.L.Rev. 453 (1970). See generally, 17 Intergovernmental Perspective (Fall 1991), including articles involving the following subjects: Daniel J. Elazar, Rights: The States and the Federal Government, at 5; Donald S. Lutz, The State Foundations of the U.S. Bill of Rights, at 6; Kermit L. Hall, The Legacy of 19th-Century State Bills of Rights, at 15; Daniel E. Lungren, Federal-State Relations in the Habeas Corpus Process, at 18; Ellen A. Peters, State Supreme Courts in Our Evolving Federal System, at 21; Stanley H. Friedelbaum, Supreme Courts in Conflict: The Drama of Disagreement, at 27; John Kincaid, The State and Federal Bills of Rights: Partners and Rivals in Liberty, at 31; Mark L. Glasser \u0026 John Kincaid, Selected Rights Enumerated in State Constitutions, at 35; and Janice C. May, Amending State Bills of Rights: Do Voters Reduce Rights?, at 45. 1 Emerging Issues in State Constitutional Law (1988), including: Warren E. Burger, Foreword, at ix; Robert Abrams, Introduction, at xi; A.E. Dick Howard, The Renaissance of State Constitutional Law, at 1; Judith S. Kaye, A Mid-Point Perspective on Directions in State Constitutional Law, at 17; Ken Gormley, Ten Adventures in State Constitutional Law, at 29; Richard M. Frank, The Scorpions' Dance: Judicially Mandated Attorney's Fees — The Legislative Response and Separation-of-Powers Implications, at 73; William P. French \u0026 John G. Loughrey, Impeachment Power: The Legislature as Moral and Ethical Watchdog Over the Executive, at 101; Julie F. Pottorff, Political Stew: Item Veto Issues Bubbling to the Top in State Court Jurisdictions, at 121; Eric B. Schnurer, It Is a Constitution We Are Expanding: An Essay on Constitutional Past, Present and Future, at 135; Don Siegelman \u0026 Courtney W. Tarver, Victims' Rights in State Constitutions, at 163; Ralph L. Finlayson, State Constitutional Prohibitions Against Use of Public Financial Resources in Aid of Private Enterprises, at 177; Ronald K.L. Collins, Litigating State Constitutional Issues: The Government's Case, at 201; Robert F. Utter, Ensuring Principled Development of State Constitutional Law: Responsibilities for Attorneys and Courts, at 217; and Jeffrey Amestoy \u0026 Julie Brill, State Constitutions from the Attorney General's Perspective: An Institutional Schizophrenia, at 229. 2 Emerging Issues in State Constitutional Law (1989), including: Harry Carrico, Foreword, at ix; Tom Miller, Introduction, at xi; Ken Gormley, Significant Developments in State Constitutional Law, 1988, at 1; Vincent Bonventre, State Constitutionalism in New York: A Non-Reactive Tradition, at 31; Janice May, State Constitutional Revision in 1988, at 61; Richard Briffault, The Item Veto: A Problem in State Separation of Powers, at 85; James C. Harrington, Reemergence of Texas Constitutional Protection, at 101; Harry F. Tepker, Jr., Abortion, Privacy and State Constitutional Law: A Speculation If (Or When) Roe v. Wade Is Overturned, at 173; Louis F. Hubener, Rights of Privacy in Open Courts — Do They Exist?, at 189; Michael W. Catalano \u0026 Christine Modisher, State Constitutional Issues in Public Funding Challenges, at 207; Christine M. Durham, The New Judicial Federalism and the Policy Making Role of State Supreme Courts, at 219; Earl Maltz, The Political Dynamic of the \"New Judicial Federalism\", at 233; Linda Matarese, Other Voices: The Role of Justices Durham, Kaye and Abrahamson in Shaping the Methodology of the \"New Judicial Federalism\", at 239; and David Schuman, Advocacy of State Constitutional Law Cases: A Report from the Provinces, at 275. 3 Emerging Issues in State Constitutional Law (1990), including: Vincent L. McKusick, Foreword, at ix; Mary Sue Terry, Introduction, at xiii; Neil C. McCabe, Criminal Law Developments Under State Constitutions, 1989-90, at 1; Gerald F. Uelmen, The California Constitution After Proposition 115, at 33; Jeffrey A. Parness, Respecting State Judicial Articles, at 65; Michael W. Catalano, The Single Subject Rule: A Check on Anti-Majoritarian Logrolling, at 77; Daniel D. McDevitt, State Action in Pennsylvania: Suggestions for a Unified Approach, at 87; John A. Saurenman, Keystone, First English, and Nollan Three Years Later: How Fare the States?, at 115; Harry F. Tepker, Jr., The Trouble With Pool Halls: Rationality and Equal Protection in Oklahoma Law, at 151; Steven J. Twist \u0026 Mark Edward Hessinger, New Judicial Federalism: Where Law Ends and Tyranny Begins, at 173; and John M. Devlin, State Constitutional Autonomy Rights in an Age of Federal Retrenchment: Some Thoughts on the Interpretation of State Rights Derived from Federal Sources, at 195. 4 Emerging Issues in State Constitutional Law (1991), including: Robert N.C. Nix, Jr., Foreword, at vii; Ken Eikenberry, Introduction, at xi; Vincent M. Bonventre, State Constitutional Recession: The New York Court of Appeals Retrenches, at 1; Barry Latzer, Into the '90s: More Evidence that the Revolution Has Conservation Underbelly, at 17; Bruce Ledewitz, Judicial Construction of State Constitutional Provisions Protecting the Environment, at 33; Eric B. Schnurer, The Sorry Phenomenon of \"Legal Constitutional Evasion\": The Lesson of State Constitutional Debt Limits, at 81; Yvonne Kauger, Reflections on Federalism: State Constitutions' Role as Nurturers of Individual Rights, at 105; Neil C. McCabe \u0026 Cynthia Ann Bell, Ex Post Facto Provisions of State Constitutions, at 133; Gerald E. Weis, Stepping Into the Breach: State Constitutional Protection of Expressive Rights in Privately Owned Commercial Establishments, at 159; Ann C. Michailenko, Pennsylvania's Constitutional Mandate and the General Assembly's Duty to Provide Public School Students with a \"Thorough and Efficient\" Education, at 177; Peter Galie, Modes of Constitutional Interpretation: The New York Court of Appeals' Search for a Role, at 225; and Hans A. Linde, Does the \"New Federalism\" Have a Future?, at 251. See also Symposium, Emerging Issues in State Constitutional Law, 65 Temp.L.Rev. 1119 (1992). Many additional literate and philosophical commentaries are available, which include: Tom Stacy, The Search for the Truth in Constitutional Criminal Procedure, 91 Colum.L.Rev. 1369 (1991); Yvonne Kauger, William O. Douglas Lecture. Reflections on Federalism: Protections Afforded by State Constitutions, 27 Gonz. L.Rev. 1 (1991/92); Irene Merker Rosenberg \u0026 Yale L. Rosenberg, Miranda, Minnick, and the Morality of Confessions, 19 Am.J.Crim.L. 1 (1991); Marcia Coyle, Back to the Future — The Justices Re-Examine the Habeas Corpus Writ, Nat'l L.J., Feb. 17, 1992, at 1; and Brian J. O'Connell, Note, Search and Seizure: The Erosion of the Fourth Amendment Under the Terry-Standard, Creating Suspicion in High Crime Areas — State v. Andrews, 57 Ohio St.3d 86, 565 N.E.2d 1271 (1991), cert. denied, 111 S.Ct. 2833 (interim ed. 1991), 16 U.Dayton L.Rev. 717 (1991). Symposium: Federalism and Parity, 71 B.U.L.Rev. (1991), including: Erwin Chemerinsky, Ending the Parity Debate, at 593; Michael Wells, Behind the Parity Debate: The Decline of the Legal Process Tradition in the Law of Federal Courts, at 609; Akhil Reed Amar, Comment, Parity as a Constitutional Question, at 645; and Susan N. Herman, Why Parity Matters, at 651. Section of Individual Rights \u0026 Responsibilities, 19 Human Rights (ABA 1992), including: Robin Sher, Choosing the Right Court, at 12; Vicki Quade, State Courts: The Next Frontier, at 14; Barbara Kritchevsky, What State Courts Can Do to Protect Privacy, at 16; MaryAnn Dadisman, Gay Activists Seek Rights State by State, at 18; Sheila Murphy, Diverting Abuse Cases Before They Clog Courts, at 20; Phylis Skloot Bamberger, The Dark Side of Constitutional Law, at 22; and Shirley Abrahamson, Reawakening to State Courts, at 26. 496 Annals Am.Acad.Pol. \u0026 Soc.Sci. (1988), including: John Kincaid, Preface, at 10; John Kincaid, State Constitutions in the Federal System, at 12; Donald S. Lutz, The United States Constitution as an Incomplete Text, at 23; Lawrence M. Friedman, State Constitutions in Historical Perspective, at 33; Robert F. Williams, Evolving State Legislative and Executive Power in the Founding Decade, at 43; Stanley Mosk, The Emerging Agenda in State Constitutional Rights Law, at 54; G. Alan Tarr, Religion Under State Constitutions, at 65; Peter J. Galie, State Courts and Economic Rights, at 76; Jennifer Friesen, The Public Employee's Stake in State Constitutional Rights, at 88; Earl M. Maltz, Lockstep Analysis and the Concept of Federalism, at 98; Michael E. Libonati, Intergovernmental Relations in State Constitutional Law: A Historical Overview, at 107; Richard Briffault, Localism in State Constitutional Law, at 117; and Ivo D. Duchacek, State Constitutional Law in Comparative Perspective, at 128. See also Daniel R. Gordon, Progressives Retreat: Falling Back From the Federal Constitution to State Constitutions, 23 Ariz.St.L.J. 801 (1991); Craig L. Crawford, Comment, Dowling v. United States: A Failure of the Criminal Justice System, 52 Ohio St.L.J. 991 (1991); Rita Coyle DeMeules, Minnesota's Variable Approach to State Constitutional Claims, 17 Wm. Mitchell L.Rev. 163 (1991); Louis A. Smith, II, Recent Decision, Criminal Law — Search and Seizure — Warrant — Affidavit — Rules of Criminal Procedure — \"Four Corners\" Determination of Probable Cause — Exclusionary Rule — Rejection of \"Good Faith\" Exception — Right of Privacy — Magisterial Neutrality, 30 Duq. L.Rev. 115 (1991); Symposium, The Right to Privacy One Hundred Years Later, 41 Case W.Res.L.Rev. 643 (1991); Craig F. Emmert, Note, Litigants in State Supreme Court Judicial Review Cases: Participation and Success, 14 Just.Sys.J. 486 (1991); Althouse, supra, 44 Vand.L.Rev. 953; Henry C. Strickland, The State Action Doctrine and the Rehnquist Court, 18 Hastings Const.L.Q. 587 (1991); Lee Anne Fritzler, Optimality in Fourth Amendment Law, 27 Am.Crim.L.Rev. 473 (1990); Marguerite A. Kirk, Note, State v. Andrews: The Fourth Amendment in Jeopardy, XVIII Ohio N.U.L.Rev. 309 (1991); and Daniel R. Gordon, The Demise of American Constitutionalism: Death by Legal Education, 16 S.Ill.U.L.J. 39 (1991). 20 Rutgers L.J. (1989), including: Robert F. Williams \u0026 Earl M. Maltz, at 877; Burt Neuborne, Foreword: State Constitutions and the Evolution of Positive Rights, at 881; Developments in State Constitutional Law: 1988, at 903; James A. Thomson, Review Essay: State Constitutional Law: Some Comparative Perspectives, at 1059; and Earl M Maltz, Robert F. Williams \u0026 Michael Araten, Selected Bibliography on State Constitutional Law, 1980-1989, at 1093. 21 Rutgers L.J. (1990), including: Robert F. Williams, Introduction, at 793; Gary L. McDowell, Foreword: Rediscovering Federalism? State Constitutional Law and the Restoration of State Sovereignty, at 797; John Devlin, Constructing an Alternative to \"State Action\" as a Limit on State Constitutional Rights Guarantees: A Survey, Critique and Proposal, at 819; Developments in State Constitutional Law: 1989, at 903; and Paul Bender \u0026 Earl M. Maltz, Judicial Activism Under State Constitutions: Boon or Bane?, at 1113. See Annual Issue on State Constitutional Law, 22 Rutgers L.J. 815 (1991); Shirley S. Abrahamson, Criminal Law and State Constitutions: The Emergence of State Constitutional Law, 63 Tex. L.Rev. 1141 (1985); William Brennan, Jr., The Bill of Rights: State Constitution as Guardians of Individual Rights, 59 N YSt.B.J. 10 (1987); Developments in the Law, The Interpretation of State Constitutional Rights, 95 Harv.L.Rev. 1324 (1982); Stanley G. Feldman \u0026 David L. Abney, The Double Security of Federalism: Protecting Individual Liberty Under the Arizona Constitution, 20 Ariz.St. L.J. 115 (1988); Arthur J. Goldberg, Stanley Mosk: A Federalist for the 1980's, 12 Hastings Const. L.Q. 395 (1985); Robert B. Keiter, An Essay on Wyoming Constitutional Interpretation, 21 Land \u0026 Water L.Rev. 527 (1986); Steven Knitzer, Double Jeopardy: State Courts Advance as the Supreme Court Retreats, 1984 Ann. Surv.Am.L. 201 (1985); Stanley Mosk, The Emerging Agenda in State Constitutional Rights Law, 496 Annals Am.Acad.Pol. \u0026 Soc.Sci. 54 (1988); Stanley Mosk, The Power of State Constitutions in Protecting Individuals Rights, 8 N.Ill.U.L.Rev. 651 (1988); Christopher Slobogin, State Adoption of Federal Law: Exploring the Limits of Florida's \"Forced Linkage\" Amendment, 39 U.Fla.L.Rev. 653 (1987); and Sol Wachtler, Our Constitutions — Alive and Well, 61 St. John's L.Rev. 381 (1987). See also Potter Stewart, The Road to Mapp v. Ohio and Beyond: The Origins, Development and Future of the Exclusionary Rule in Search-and-Seizure Cases, 83 Colum.L.Rev. 1365 (1983); Thomas Y. Davies, A Hard Look at What We Know (and Still Need to Learn) About the \"Costs\" of the Exclusionary Rule: THE NIJ Study and Other Studies of \"Lost\" Arrests, 1983 Am.B.Found.Res.J. 611 (1983); Hans A. Linde, Due Process of Lawmaking, 55 Neb.L.Rev. 195 (1976); Arval A. Morris, The Exclusionary Rule, Deterrence and Posner's Economic Analysis of Law, 57 Wn.L.Rev. 647 (1982); Walter Urbigkit, Address at the Bill of Rights Seminar, Casper Star-Tribune (July 1991); Robert B. Keiter, Address at the Wyoming State Bar Convention (Sept. 13, 1991); Robert S. Peck, The Bill of Rights \u0026 the Politics of Interpretation (1992). In addition, see Charles H. Sheldon, \"We Feel Constrained to Hold. . . .\" An Inquiry Into the Basis for Decision in the Exercise of State Judicial Review, 27 Gonz. L.Rev. 73 (1991-92); Robert F. Utter, Advancing State Constitutions in Court. Protecting Individual Rights, 27 Trial 41 (October 1991); Elder Witt, State Supreme Courts: Tilting the Balance Toward Change, I Governing 30 (August 1988); Vicki Quade, State Courts: The Next Frontier for Civil Liberties, 19 Human Rights 14 (Winter 1992); John Kincaid \u0026 Robert F. Williams, The New Judicial Federalism: The States' Lead in Rights Protection, 65 J. State Government 50 (April-June 1992); Symposium, \"The Law of the Land.\" The North Carolina Constitution and State Constitutional Law, 70 N.C.L.Rev. 1701 (1992); Barry Latzer, State Constitutions and Criminal Justice (1992); Calvin R. Massey, Federalism and Fundamental Rights: The Ninth Amendment, 38 Hastings L.J. 305 (1987); Sol Wachtler, Judging the Ninth Amendment, 59 Fordham L.Rev. 597 (1991); Hans A. Linde, Are State Constitutions Common Law?, 34 Ariz.L.Rev. 215 (1992); National Conference on State-Federal Judicial Relationships, 78 Va.L.Rev. 1655 (1992); and Barry Latzer, State Constitutional Developments, 28 Crim.L.Bull. 141 (March-April 1992). This extensive, but still incomplete, listing of legal review and source material, is not abstractly presented for this dissent. It serves to demonstrate that a mere one sentence adaptation of \"lockstep\" in the majority opinion ignores an actual universe of contrary decisions and academic analyses. In reality, the state of Wyoming and its judiciary looks backward and inward to another century. That character of bowing to special interest groups with unitary purpose can hardly serve our duty to the Wyoming Constitution and to build a greater society within a forward faced progressive state — our Wyoming. V. CONCLUSION Harm is done in affirming Saldana's conviction within the present structure of Wyoming criminal law under the trial deficiencies presented. Far greater damage is done to the rights of every citizen under the state constitution, without persuasive logic, by the adaptation of a \"lockstep\" adjudicatory process to demean and de-effectuate this state's constitution. I emphatically and unreservedly dissent. Constitutional rights and their preservation remain, to each of us, a primary and unlimited obligation, whether as an office holder or as a citizen, jurist or lawyer. This decision, whether by dicta or with resolution, fails that responsibility. I dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The court's opinion fails to recognize the status of congressional legislation involving wire taps and pen registers and the correlative fact that Wyoming has failed to enact pen register authenticating legislation. Following Smith v. Maryland, 442 U.S. 735, 99 S.Ct. 2577, 61 L.Ed.2d 220 (1979), the United States Congress commenced an active re-examination of communication privacy. As a result, the Electronic Communications Privacy Act of 1986 was enacted to amend the original wire tap legislation of 1968. 18 U.S.C. § 2510, et seq. (1979). The stated purpose of the Electronic Communications Privacy Act of 1986 was to protect against the unauthorized interception of electronic communications. The bill amends the 1968 law to update and clarify Federal privacy protections and standards in light of dramatic changes in new computer and telecommunications technologies. When the Framers of the Constitution acted to guard against the arbitrary use of Government power to maintain surveillance over citizens, there were limited methods of intrusion into the \"houses, papers, and effects\" protected by the fourth amendment. During the intervening 200 years, development of new methods of communication and devices for surveillance has expanded dramatically the opportunity for such intrusions. The telephone is the most obvious example. Its widespread use made it technologically possible to intercept the communications of citizens without entering homes or other private places. When the issue of Government wiretapping first came before the Supreme Court in Olmstead v. United States, 277 U.S. 438 [48 S.Ct. 564, 72 L.Ed. 944] (1928), the Court held that wiretapping did not violate the fourth amendment, since there was no searching, no seizure of anything tangible, and no physical trespass. Today, the Olmstead case is often remembered more for Justice Brandeis' prescient dissent than for its holding. Justice Brandeis predicted: \"Ways may some day be developed by which the Government, without removing papers from secret drawers, can reproduce them in court, and by which it will be enabled to expose to a jury the most intimate occurrences of the home . . . Can it be that the Constitution affords no protection against such invasions of individual security?\" Forty years later, the Supreme Court accepted Justice Brandeis' logic in Katz v. United States, 389 U.S. 347 [88 S.Ct. 507, 19 L.Ed.2d 576] (1967), holding that the fourth amendment applies to Government interception of a telephone conversation. At the same time, the Court extended fourth amendment protection to electronic eavesdropping on oral conversations in Berger v. New York, 388 U.S. 41 [87 S.Ct. 1873, 18 L.Ed.2d 1040] (1967). 5 U.S.Code Congressional and Administrative News 3555-56 (1986). Wyoming first responded comprehensively to those wire tap and privacy concerns by enactment of 1985 Wyo. Sess. Laws ch. 121, Wyo. Stat. §§ 7-3-601 through 7-3-610 (1985), the Communications Privacy Act of Wyoming. The Electronic Communications Privacy Act of 1986, P.L. 99-508, 100 Stat. 1848, provided significant changes in federal law, including explicit removal of pen register legislation from 18 U.S.C. § 2510, et seq. (1979), and the creation of a new regulatory code for pen registers, 18 U.S.C. § 3121 through 3127 (1992), entitled Pen Registers and Trap and Trace Devices. John Applegate \u0026 Amy Grossman, Pen Registers After Smith v. Maryland, 15 Harv.C.R.C.L.L.Rev. 753 (1980). In result, Smith was explicitly superseded by the regulatory authority of the new enactment. The terminology of the pre-1986 federal law included in the definition of \"contents\": \"information concerning the identity of the parties [participating in the] communication.\" 18 U.S.C. § 2510(8) (1979). This identical language was contained in Wyo. Stat. § 7-3-601(a)(ii) and (iii) (1985). The federal Electronics Communications Privacy Act of 1986 deleted this law to make it clear that pen register information was not regulated by the wire tap statute, see 18 U.S.C. § 2510(8) (1992), and clearly identified transfer to the new register statute responsibilities and control of this medium of intervention in personal privacy by governmental authorities. See Senate Report 99-541, 5 U.S.Code Congressional and Administrative News, at 3567: Subsection 101(a)(5) of the Electronic Communications Privacy Act amends current section 2510(8) of title 18 to exclude from the definition of the term \"contents,\" the identity of the parties or the existence of the communication. It thus distinguishes between the substance, purport or meaning of the communication and the existence of the communication or transactional records about it. The importance of the legislative history is that the Wyoming legislature, even though the communication privacy legislation was addressed twice in amendment: 1987 Wyo. Sess. Laws ch. 157, criminal code recodification; and 1989 Wyo. Sess. Laws ch. 118, specific amendments; did not remove identification information from the statute as had the United States Congress or pass pen register legislation as invited by the federal code. That law, the Electronics Communications Privacy Act of 1986, effective ninety days after October 21, 1986, contained a two year gateway for state legislation. 18 U.S.C. § 3121 (1992). Consequently, on or about January 19, 1988, the preclusion provision of the federal pen register law went into effect. Clearly, and without question, the Wyoming statute contained identification preclusion and federal law then also precluded pen register usage since the Wyoming legislature had not provided the statutory changes required. Actually, in the text of 1989 Wyo. Sess. Laws ch. 118 neither the \"contents\" amendment to federal law nor the pen register legitimatizing legislation was considered. It must be concluded: (a) Smith was superseded by subsequent federal legislation; (b) \"contents\" under Wyo. Stat. § 7-3-601, in the clear meaning of the term itself, includes pen register identification information; (c) Wyoming has not accepted the invitation to enact pen register authenticating legislation; (d) warrantless acquisition and subsequent disclosure of the information from pen registers is illegal in this state and constitutes a felony offense under Wyo. Stat. § 7-3-602(c), except to the extent that federal authorities use federal processes for federal purposes; and (e) admission in evidence for criminal prosecution cannot be justified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. I do not suggest that it was impossible for the state drug agent to have legally, and perhaps even simplistically, obtained the desired information in compliance with the state constitution. The fact is he chose the shortcut in disregard of the Wyoming Constitution and statutes. Now this court is called upon to justify the violation by affirming the case in result and to also limit the Wyoming Constitution. Consequently, rights of Wyoming citizens under the Wyoming Constitution are not only limited by the constitutional interpretations of the United States Constitution by the United States Supreme Court, but also federal statutes and federal criminal investigative activities define the authority of the Wyoming legislature to respond to the Wyoming constitutional Bill of Rights. Not only the constitution of this state, but also the legislative responsibility for exercise of the police power are superseded and subverted by that conduct and this decision. It is fair to suggest that the Wyoming legislature could pass one law and then close up and go home. That law would adopt the enactments, by reference, of the entire United States Code and all its peculiarities and technicalities regularly added. Fortunately, they have not and, hopefully, will not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Wyoming statute was changed at a date effective shortly after those events occurred. Wyo. Stat. § 7-3-601(a)(v) redefined intercept to include \"aural or other acquisition\" by 1989 Wyo. Sess. Laws ch. 118. The majority did not find the change to be dispositive when the new provision became effective on June 8, 1989, after approval on February 24, 1989, and was before any pen register had occurred for this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In part, that enactment presently provides: § 3121. General prohibition on pen register and trap and trace device use; exception (a) In general. Except as provided in this section, no person may install or use a pen register or a trap and trace device without first obtaining a court order under section 3123 of this title or under the Foreign Intelligence Surveillance Act of 1978 (50 U.S.C. § 1801 et seq.). (b) Exception. The prohibition of subsection (a) does not apply with respect to the use of a pen register or a trap and trace device by a provider of electronic or wire communication service — (1) relating to the operation, maintenance, and testing of a wire or electronic communication service or to the protection of the rights or property of such provider, or to the protection of users of that service from abuse of service or unlawful use of service; or (2) to record the fact that a wire or electronic communication was initiated or completed in order to protect such provider, another provider furnishing service toward the completion of the wire communication, or a user of that service, from fraudulent, unlawful or abusive use of service; or (3) where the consent of the user of that service has been obtained. (c) Penalty. Whoever knowingly violates subsection (a) shall be fined under this title or imprisoned not more than one year, or both. 18 U.S.C. § 3121 (1992). The law provided a state two-year window for similar enactments. See Act Oct. 21, 1986, P.L. 99-508, Title III, § 302, 100 Stat. 1872: (b) Special rule for State authorizations of interceptions. Any pen register or trap and trace device order or installation which would be valid and lawful without regard to the amendments made by this title [adding 18 U.S.C. § 1367 and 3121 et seq.] shall be valid and lawful notwithstanding such amendments if such order or installation occurs during the period beginning on the date such amendments take effect and ending on the earlier of — (1) the day before the date of the taking effect of changes in State law required in order to make orders or installations under Federal law as amended by this title [adding 18 U.S.C. § 1367 and 3121 et seq.]; or (2) the date two years after the date of the enactment of this Act. The federal legislation provided a procedure to obtain an order for installation in 18 U.S.C. § 3122, comprehensive provisions relating to issuance in § 3123, a methodology in § 3124, and, finally, an exception provision in § 3125.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The question presented does not address mere jurisdictional state court questions where acquisition results in the non-forum state and was legally obtained in accord with the laws of the place where acquired. See People v. Blair, 25 Cal.3d 640, 159 Cal.Rptr. 818, 602 P.2d 738 (1979) and Com. v. Bennett, 245 Pa. Super. 457, 369 A.2d 493 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. With presentence confinement credit of 333 days and a sentence of two and one-half years to seven years, Saldana was released from penitentiary confinement months ago. I write in this case for the future of individual rights for citizens of this state from governmental dominance and destruction of individualism.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This basis of thinking is self-evident since the United States Supreme Court decisions using the Fourteenth Amendment for state law incorporation came a number of decades later. Selective incorporation of the protection of the federal constitution's Bill of Rights into the Fourteenth Amendment's restrictions on state action began with the famous footnote four in United States v. Carolene Products Co., 304 U.S. 144, 152 n. 4, 58 S.Ct. 778, 783 n. 4, 82 L.Ed. 1234 (1938). See Laurence H. Tribe, American Constitutional Law, § 11-2 (2d ed. 1988). The court suggested that \"[t]here may be narrower scope for operation of the presumption of constitutionality when legislation appears on its face to be within a specific prohibition of the Constitution, such as those of the first ten Amendments, which are deemed equally specific when held to be embraced within the Fourteenth.\" Carolene Products Co., 304 U.S. at 152 n. 4, 58 S.Ct. at 783 n. 4. From this thesis, the United States Supreme Court has selectively incorporated, into the reach of the Fourteenth Amendment, provisions of the Bill of Rights stated in the first eight amendments to the federal constitution. Incorporation was quickly applied to the First Amendment freedoms of: speech, Fiske v. Kansas, 274 U.S. 380, 47 S.Ct. 655, 71 L.Ed. 1108 (1927); press, Near v. Minnesota ex rel. Olson, 283 U.S. 697, 51 S.Ct. 625, 75 L.Ed. 1357 (1931); assembly, De Jonge v. Oregon, 299 U.S. 353, 57 S.Ct. 255, 81 L.Ed. 278 (1937); petition, Hague v. Committee for Industrial Organization, 307 U.S. 496, 59 S.Ct. 954, 83 L.Ed. 1423 (1939); and religion, Cantwell v. Connecticut, 310 U.S. 296, 60 S.Ct. 900, 84 L.Ed. 1213 (1940). The incorporation of rights now commonly associated with criminal prosecutions was more deliberate. The Fourth Amendment rights to be free of unreasonable search and seizure, Wolf, 338 U.S. 25, and to exclude illegally seized evidence, Mapp v. Ohio, 367 U.S. 643, 81 S.Ct. 1684, 6 L.Ed.2d 1081 (1961), required the passage of more than a decade between decisions. Indeed, the decade of the 1960's brought incorporation to most of the rights involving prosecutions. Malloy v. Hogan, 378 U.S. 1, 84 S.Ct. 1489, 12 L.Ed.2d 653 (1964) (incorporating Fifth Amendment right to be free of compelled self-incrimination); Benton v. Maryland, 395 U.S. 784, 89 S.Ct. 2056, 23 L.Ed.2d 707 (1969) (incorporating double jeopardy protection); Gideon v. Wainwright, 372 U.S. 335, 83 S.Ct. 792, 9 L.Ed.2d 799 (1963) (incorporating Sixth Amendment right to counsel); Klopfer v. North Carolina, 386 U.S. 213, 87 S.Ct. 988, 18 L.Ed.2d 1 (1967) (incorporating Sixth Amendment right to speedy trial); Pointer v. Texas, 380 U.S. 400, 85 S.Ct. 1065, 13 L.Ed.2d 923 (1965) (incorporating opportunity to confront witnesses).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. W.R.Cr.P. 46.1 was then rewritten by the rules committee following the publication of Simms. The proposed change was adopted by this court on October 30, 1992, with the amendment to be effective sixty days after publication — January 20, 1993.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. I acknowledge what is said in special concurrence, but suggest that the litigants did not fail to address the state constitutional issue. This court provides an answer in the majority decision to a question that was never asked nor analyzed by the litigants. Rejection or acceptance of the independent state constitutional basis for decision is first considered in this present opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Timothy Stallcup followed in thesis and text the statement of Justice William Brennan in recognizing: \"[T]here exists in modern America the necessity for protecting all of us from arbitrary action by governments more powerful and more pervasive than any in our ancestors' time.\" Stallcup, supra, 24 Ariz.St.L.J. at 695 n. 57 (quoting Brennan, supra 90 Harv.L.Rev. at 495). See also Charles G. Douglas, III, The Clash Over Constitutions; The Reassertion of State Authority, Judges J., Summer 1987, at 39. The significance of this issue to Justice William J. Brennan, Jr. is shown by a 1990 interview where he analyzed: \"[T]he emphasis on the individual rights and their protection * * * has been the principal contribution to jurisprudence that the Court has made in my time, including things like supporting the extension of protections to state decisions that rely on state constitutions rather than on the federal Constitution.\" David O. Stewart, A Life on the Court, 77 ABA J. 62 (February 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It is noteworthy in advancing legal thought that four of the most vocal supporters of state constitutional rights decision making are female justices of state supreme courts: Judith S. Kaye, Judge, New York Court of Appeals; Christine Durham, Justice Utah Supreme Court; Shirley Abrahamson, Justice, Wisconsin Supreme Court; and Yvonne Kauger, Justice, Oklahoma Supreme Court. See Abrahamson, supra, 18 Hastings Const. L.Q. 723; Judith S. Kaye, A Midpoint Perspective On Directions In State Constitutional Law, 1 Emerging Issues In State Constitutional Law 17 (1988); and Christine M. Durham, Obligation or Power? The New Judicial Federalism and the Policy-Making Rule of State Supreme Courts, 2 Emerging Issues In State Constitutional Law 219 (1989); see also Linda B. Matarese, Other Voices: The Role of Justices Durham, Kaye, and Abrahamson in Shaping the \"New Judicial Federalism\", 2 Emerging Issues in State Constitutional Law 239 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Thomas Y. Davies, Denying a Right by Disregarding Doctrine: How Illinois v. Rodriguez Demeans Consent, Trivializes Fourth Amendment Reasonableness, and Exaggerates the Excusability of Police Error, 59 Tenn.L.Rev. 1 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It is most interesting to observe that the Michigan Supreme Court refused to follow the United States Supreme Court's reconceptualization of Michigan's sentencing laws. See why the Michigan Constitution required a different understanding of its cruel and unusual punishment standard in People v. Bullock, 440 Mich. 15, 485 N.W.2d 866 (1992).\u003c/span\u003e\n\n",
    "body_length": 240398,
    "citedas": [
      "846 P.2d 604"
    ],
    "attorneys": "Wyoming Public Defender Program: Leonard D. Munker, State Public Defender, Steven E. Weerts, Sr. Asst. Public Defender, Mike Cornia, Appellate Counsel, for appellant. Joseph B. Meyer, Atty. Gen., John W. Renneisen, Deputy Atty. Gen., Mary B. Guthrie, Sr. Asst. Atty. Gen., for appellee.",
    "category": [
      "243",
      "75"
    ],
    "judges": "BEFORE MACY, C.J., AND THOMAS, CARDINE, URBIGKIT*FN1 AND GOLDEN, JJ. *FN1 CHIEF JUSTICE AT TIME OF ORAL ARGUMENT; RETIRED 1/1/93.",
    "citation_count": 22
  }
}
