{
  "id": "uqFbR2YBTlTomsSBiPV9",
  "document": {
    "title": "Taxpayers to Limit Campaign Spending v. Fair Political Practices Commission",
    "full_title": "TAXPAYERS TO LIMIT CAMPAIGN SPENDING v. FAIR POLITICAL PRACTICES COMMISSION",
    "jurisdiction": "California Supreme Court",
    "date": "1990-11-01T00:00:00.000Z",
    "docket": "No. S012016",
    "body": "The California Constitution provides: \"If provisions of 2 or more measures approved at the same election conflict, those of the measure receiving the highest affirmative vote shall prevail.\" (Const., art. II, § 10, subd. (b). Hereafter, section 10(b).)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Rules of statutory construction, however, require an attempt to reconcile statutory provisions relating to the same subject matter whenever possible in order to avoid conflict and give effect to every provision. The threshold question in this case is whether section 10(b) either permits application of these rules of construction to competing initiative measures, or contemplates that only the provisions of the measure receiving the highest affirmative vote shall become effective. The question is one of first impression in the application of section 10(b).\n\nWe conclude that, unless a contrary intent is apparent in the ballot measures, when two or more measures are competing initiatives, either because they are expressly offered as \"all-or-nothing\" alternatives or because each creates a comprehensive regulatory scheme related to the same subject, section 10(b) mandates that only the provisions of the measure receiving the highest number of affirmative votes be enforced. Neither an administrative nor a regulatory agency, nor the court, may enforce individual provisions of the measure receiving the lower number of affirmative votes. Were the court to do so the result might be a regulatory scheme created without any basis for ascertaining whether the electorate understood or intended the result. In short, section 10(b) does not permit the court to engraft onto one regulatory scheme provisions intended to be part of a different scheme.\n\nI\n\nThe issue arises in the following context.\n\nAt the June 7, 1988, Primary Election the voters approved two initiative statutes, Propositions 68 and 73, both of which regulate political campaign contributions and spending. Both measures amend and supplement the Political Reform Act of 1974 (the Act) (Gov. Code, § 81000 et seq.),\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e which established the Fair Political Practices Commission (FPPC) and gives it responsibility for implementing the Act. (§ 83100.) Each proposition adds a different chapter 5, commencing with section 85100, to title 9 of the code. Proposition 73 received more votes than Proposition 68. The complete text of these measures is set forth in an appendix to this opinion.\n\nOn November 9, 1988, respondent FPPC issued an opinion responding to the question: \"What, if any, of Proposition 68 (the 'Campaign Spending Limits Act') survives the passage of Proposition 73 (the 'Campaign Contributions Limits without Taxpayer Financing Amendments to the Political Reform Act') by a greater number of votes?\" The FPPC concluded that because section 10(b) applied only if a conflict existed, each provision of Proposition 68 had to be examined to determine if it conflicted with any provision of Proposition 73. Where conflicts existed the provisions of Proposition 73 would prevail. After comparing the measures provision by provision, the FPPC concluded that most of the provisions of Proposition 68 conflicted with provisions of Proposition 73 or were not severable from other provisions which did conflict. The FPPC identified several provisions of Proposition 68 which, it concluded, did not directly conflict and held that those provisions should become operative.\n\nPetitioner, Taxpayers to Limit Campaign Spending (Taxpayers), an association which sponsored Proposition 68, initiated this mandamus proceeding to compel the FPPC to enforce additional provisions of that proposition, specifically those provisions adding sections 68:85101, subdivisions (a), (c), (d), (e), (g), and (i), 68:85102, subdivisions (a), (b), (f), (g), (h), (i), (j), (k), and (m), 68:85202, 68:85204, 68:85206, 68:85305, 68:85306, 68:85307, 68:85309, 68:85311, 68:85312, 68:85313, subdivisions (a) and (b), 68:85314, and 68:85317, and amending sections 91000 and 91005 of the Government Code.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe Court of Appeal, like the FPPC, concluded that it was obligated to attempt to reconcile and give effect to both measures to the extent possible. It held that several additional provisions of Proposition 68 were not irreconcilable with the provisions of Proposition 73, and directed that they be enforced.\n\nWe granted review to consider the FPPC's argument that these additional provisions of Proposition 68 were in irreconcilable conflict with provisions of Proposition 73. The parties were advised, however, that the court would also consider whether the FPPC and the Court of Appeal had properly applied section 10(b) in their efforts to give effect to those provisions of Proposition 68 which they concluded did not conflict with the provisions of Proposition 73.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nA comparison of significant differences between the two propositions in issue here, and the manner in which the Court of Appeal attempted to reconcile them, places the problem in perspective.\n\nThe official title of Proposition 73 was: \"Campaign Funding. Contribution Limits. Prohibition of Public Funding. Initiative Statute.\" (See fn. 5.) The Legislative Analyst explained and described the content of the measure\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e as follows:\n\n\"Background\n\n\"Federal law limits the amount of money that an individual may give as a political campaign contribution to a candidate for federal elective office or to the candidate's campaign committee. California law generally does not impose any similar limits on political campaign contributions. Both federal law and the state's Political Reform Act of 1974, however, require candidates for public office to report contributions they receive and money they and their campaign committees spend.\n\n\"California law does not generally permit any public money to be spent for campaign activities. A few local government agencies,\n\nhowever, have authorized the payment of public matching funds to candidates for certain local elected offices.\n\n\"Proposal\n\n\"In summary this measure:\n\n\"Establishes limits on campaign contributions for all candidates for state and local elective offices;\n\n\"Prohibits the use of public funds for these campaign expenditures; and\n\n\"Prohibits state and local elected officials from spending public funds on newsletters and mass mailing.\n\n\"Limits on Campaign Contributions\n\n\"The measure establishes separate limits for different types of contributors.\n\n\"1. Persons. Contributions from any person to a candidate, or to the candidate's campaign committee, are limited to $1,000 per fiscal year. Contributions to a political committee or political party are limited to $2,500 per fiscal year. The measure defines 'person' to include an individual, business firm, association or labor organization.\n\n\"2. Political Committees. Contributions from any committee to a candidate or the candidate's campaign committee are limited to $2,500 per fiscal year.\n\n\"3. Political Parties and Broad-Based Political Committees. Contributions from any political party or broad-based political committee to a candidate or the candidate's campaign committee are limited to $5,000 per year. A broad-based political committee is defined as one which receives contributions from more than 100 persons and makes contributions to five or more candidates.\n\n\"5. Other Provisions.\n\n\"This measure does not affect any existing limitation on campaign contributions enacted by a local government that imposes lower contribution limits. In addition, any local government may enact its own lower limitations.\n\n\"The personal contribution limits only apply to financial or other support provided to a political committee or broad-based political committee if the support is used for making contributions directly to a candidate. The contribution limits do not apply if the contributions are used by the committee for other purposes, such as administrative costs.\n\n\"The time periods over which the contribution limits apply are modified in the case of special elections and special runoff elections.\n\n\"Public Funding Prohibition\n\n\"No candidate may accept any public funds for the purpose of seeking elective office.\n\n\"Newsletters and Mass Mailings\n\n\"Public funds cannot be used by state and local elected officials to pay for newsletters or mass mailings.\" Administration and Enforcement\n\n\"The State Fair Political Practices Commission has the primary responsibility for administering and enforcing this measure.\n\nAs this analysis explained, the contribution and spending limits of Proposition 73 were to apply to all candidates for state and local elective office; none of these candidates would be permitted to accept public funds for use in seeking such office. The public funds restriction was also expressly mentioned in the title given to the initiative by the Attorney General, and in the title given by the initiative to the chapter 5 it was to establish. Thus, pursuant to the first provision of the proposed law, section 73:85100 would be added to the Government Code, and would declare: \"This chapter shall be known and cited as the 'Campaign Contributions Limits Without Taxpayer Financing Amendments to the Political Reform Act.'\" Section 1 of the initiative proposed the addition of the \"chapter\" to which the quoted provision referred: \"Section 1. Chapter 5 (commencing with Section [73:]85100) is added to Title 9 of the Government Code . . .:\"\n\nProposition 68 also proposed in its section 1 to add a chapter 5 to the Government Code, of which a section 85100 would be the first provision: \"[68:]85100. Title [para.] This chapter shall be known as the Campaign Spending Limits Act.\"\n\nAs the Legislative Analyst explained to the voters, however, the campaign contribution and spending limits of Proposition 68 applied only to candidates for the state Assembly and state Senate, and this proposition expressly provided for public funding. The analysis of Proposition 68 described this proposal, in which the contribution and spending limits differ from those in Proposition 73, and permit contributions only in election years, as follows:\n\n\"Background\n\n\"Federal law limits the amount of money that an individual may give as a political campaign contribution to a candidate for federal elective office and to the candidate's campaign committee. California\n\nlaw generally does not impose any similar limits on political campaign contributions. Both federal law and the state's Political Reform Act of 1974, however, require candidates for public office to report contributions they receive and money they and their campaign committees spend.\n\n\"Proposal\n\n\"In summary, this measure:\n\n\"Establishes limits on campaign contributions that can be made to all candidates for the State Assembly and the State Senate; and\n\n\"Provides state matching funds to these candidates if they agree to comply with limits on spending for their legislative campaigns.\n\n\"Limits on Campaign Contributions\n\n\"The measure establishes separate limits for different types of contributors, and imposes other restrictions on campaign contributions.\n\n\"1. Individual Persons. Contributions from a person to a candidate, or to the candidate's campaign committee, are limited to $1,000 per election. There are also limitations on contributions to political parties, and to committees not controlled by the candidate. Also, no individual may contribute more than $25,000, in total, to all legislative candidates and their campaign committees over a two-year period.\n\n\"2. Organizations. Contributions from an organization to a candidate, or to the candidate's campaign committee, are limited to $2,500 per election. Other limitations include a $200,000 limit on the amount that an organization can give, in total, to all legislative candidates and their campaign committees over a two-year period.\n\n\"3. Small Contributor Political Action Committees. Contributions from these committees to a candidate, or his or her campaign committee, are limited to $5,000 per election. There also are other limitations including a $200,000 limit on the amount that each such committee can give, in total, to all legislative candidates and their campaign committees over a two-year period.\n\n\"4. Other Restrictions.\n\n\"Contributions may be made to any candidate for legislative office only in those years that the candidate's name appears on the ballot.\n\n\"A candidate for the Assembly cannot accept more than $50,000 in total, per election, from all organizations or small contributor political action committees. The similar limit for a candidate for the Senate is $75,000.\n\n\"No transfers of funds are permitted between individual candidates or between their campaign committees.\n\n\"Legislators and legislative candidates are prohibited from accepting more than $2,000 in gifts or honoraria from any one source during a two-year period.\n\n\"Any person who makes independent expenditures supporting or opposing a legislative candidate is prohibited from accepting any contributions in excess of $1,000 from persons or $2,500 from organizations.\n\n\"5. Other Provisions. The contribution limits apply to all candidates, regardless of whether they accept public matching funds. The limits, however, are not operative until the candidate has raised $35,000. The contribution and expenditure limits, and the public matching fund provisions are adjusted each year to reflect changes in the Consumer Price Index.\n\n\"Partial State Funding for Legislative Candidates\n\n\"1. Source of Funds. State income taxpayers may voluntarily decide that part of their income tax payments (up to $3 for single tax returns, and up to $6 for joint returns) can be used to finance state campaign matching payments.\n\n\"2. Use of These Funds. Each candidate for the State Assembly may elect to receive up to $75,000 in state matching funds for a primary election, and up to $112,000 for general, and other (special) elections. Each candidate for the State Senate may elect to receive up to $125,000 for a primary election, and up to $175,000 for general, and other (special) elections.\n\n\"3. Eligibility to Receive Funds. In order to receive state funds, a candidate must comply with campaign spending limits, collect a minimum level of private contributions, and be opposed by a candidate who has qualified for state matching funds, or who has more than $35,000 available to finance a campaign. Further, the candidate may contribute no more than $50,000 per election from personal funds to the campaign.\n\n\"4. State Matching Fund Ratios. Cash contributions totaling $250 or less from a registered voter in the candidate's district are matched by the state on a five-to-one basis. Other contributions totaling $250 or less are matched on a three-to-one basis. No matching funds are available for contributions received from the candidate or the candidate's immediate family.\n\n\"5. Campaign Spending Limitations. This measure places campaign spending limits on candidates who accept state matching funds. Assembly limits are $150,000 for each candidate in a primary election and $225,000 for a general election. Senate limits are $250,000 for each candidate in a primary election and $350,000 for a\n\ngeneral election. The spending limits do not apply, however, if an opposing candidate who does not accept matching funds receives contributions or spends more than these amounts.\n\n\"Administration and Enforcement\n\n\"The State Fair Political Practices Commission has the primary responsibility for administering and enforcing this measure. The Franchise Tax Board and the State Controller also are involved in administering this measure.\"\n\nProposition 68 also included among its provisions an amendment to then existing section 91000, which had provided that any knowing and willful violation of title 9 was a misdemeanor. As amended the section authorized felony or misdemeanor punishment for violation of \"Chapter 5 of this title commencing with Section [68:]85100\" without regard to the knowledge or intent of the violator.\n\nBoth the differences mentioned above, and the manner in which the two propositions were drafted and presented to the voters, clearly indicated that they were offered as alternative regulatory schemes. Each was to add a chapter 5 to title 9 of the Government Code. Each sought to add sections to that code that bore the same number, but differed in content.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The ballot arguments also alerted the voters to the presentation of the two propositions as alternatives.\n\nProposition 68 was described by its supporters as the \"real campaign reform initiative,\" while Proposition 73 supporters told the electorate that it was the \"only campaign finance proposal that applies to all California\n\nElected Offices . . . .\" In rebuttal to the argument in favor of Proposition 73, supporters of Proposition 68 urged defeat of the former, stating:\n\n\"Proposition 68 Limits Campaign Spending.\n\n\"Proposition 73 Does Not.\n\n\"Proposition 68 Achieves Real Campaign Reform.\n\n\"Proposition 73 Does Not.\n\n\"Proposition 68 Is the Citizens' Idea for Reform.\n\n\"Proposition 73 Is the Politicians' and Special\n\nInterest Lobbyists' Idea of 'Reform.'\n\n\"Don't Be Fooled!\n\n\"Vote 'No' on Proposition 73!\n\nAnd, the authors of an argument against Proposition 73 warned that \" Passage of Proposition 73 could prevent Proposition 68 from taking effect,\" while describing Proposition 73 as a \"Trick Designed to Defeat the Real Campaign Reform Contained in Proposition 68 . . . .\"\n\nThe supporters of Proposition 73 responded to the above when they told the voters: \"You Have a Clear Choice!\" and offered one final comparison of the impact of the two propositions.\n\nII\n\nAt least four attempts have been made to determine the effect of the voters' simultaneous approval of both initiative measures. In each, the agency or court assumed that section 10(b): mandated a provision-by-provision analysis of the two measures and the enforcement of each provision of Proposition 68 which did not conflict with Proposition 73, was severable from the remainder of Proposition 68, and was intended by the voters to become effective regardless of the invalidity of the remainder.\n\nA. Legislative Counsel Opinion\n\nThe first governmental postelection opinion on the operation of Proposition 68 was that of the Legislative Counsel. In response to an inquiry from a member of the state Assembly, the Legislative Counsel advised in a July 22, 1988, opinion that none of the provisions of Proposition 68 would become operative. The Legislative Counsel concluded that both Proposition 73 and Proposition 68 proposed a \"comprehensive and interrelated system of campaign finance.\" The system that Proposition 68 proposed, however, contemplated public funding and imposed restrictions on contributions and expenditures which the Legislative Counsel believed to be of doubtful validity\n\nabsent such financing. (See First National Bank of Boston v. Bellotti (1978) 435 U.S. 765 [55 L.Ed.2d 707, 98 S.Ct. 1407]; Buckley v. Valeo (1976) 424 U.S. 1 [46 L.Ed.2d 659, 96 S.Ct. 612]; Hardie v. Eu (1976) 18 Cal. 3d 371 [134 Cal. Rptr. 201, 556 P.2d 301]; Citizens for Jobs \u0026 Energy v. Fair Political Practices Com. (1976) 16 Cal. 3d 671 [129 Cal. Rptr. 106, 547 P.2d 1386]. Cf. Austin v. Michigan Chamber of Commerce (1990) 494 U.S. [108 L.Ed.2d 652, 110 S.Ct. 1391].) Proposition 73 expressly prohibited public financing.\n\nThe Legislative Counsel also undertook a provision-by-provision analysis and reasoned that all provisions of sections 1 through 6 of Proposition 68, which established the campaign financing scheme, either expressly conflicted with the campaign financing provisions of Proposition 73, or were logically inseparable from those that did conflict. The provisions in sections 7 to 9 of Proposition 68 could not be severed because nothing in the measure or in its history suggested that the electorate had focused on these measures and considered whether they should be adopted independent of the invalid campaign finance scheme, and the remaining provisions found in sections 11, 12, and 13 could have no effect if the balance of the proposition failed to become operative.\n\nB. FPPC Opinion\n\nThe opinion of the FPPC was issued on November 9, 1988. The analysis of the FPPC considered each provision of Proposition 68 to determine if any provision expressly conflicted with Proposition 73. If it did not, the provision was examined to determine if it could operate independently of those that were in conflict. If so the provision would be operative if not \"inextricably linked\" to provisions in conflict, but only if it could \"be said with confidence that the electorate's attention was sufficiently focused upon the parts to be severed so that it would have separately considered and adopted them in the absence of the invalid portions.\" (People's Advocate, Inc. v. Superior Court (1986) 181 Cal. App. 3d 316, 333 [226 Cal. Rptr. 640].)\n\nThe analytical approach of the FPPC was similar to that of the Legislative Counsel, and like the Legislative Counsel the FPPC concluded that the public financing and expenditure limits of Proposition 68 were irreconcilable with the financing and expenditure provisions of Proposition 73. The FPPC also examined the remaining provisions of Proposition 68 for conflict and severability; but, unlike the Legislative Counsel, the FPPC found that some provisions adding sections to and amending sections of the Political Reform Act were operative.\n\nThe FPPC summarized its conclusions in this fashion:\n\n\"Provision of Proposition 68 Commission's Conclusion\n\n\"Section 1. Chapter 5\n\n\"Article 1.\n\n\"Title of Measure Conflict with 73\n\n\"Findings and Declarations No Conflict with 73\n\n\"Purposes Conflict with 73\n\n\"Article 2.\n\n\"Definitions Conflict with 73\n\nor Not Severable\n\n\"Article 3.\n\n\"Contribution Limitations Conflict with 73\n\n(including provisions or Not Severable\n\ngoverning off-year elections,\n\nreturn of contributions,\n\ncampaign loans, family\n\ncontributions, total contributions\n\nfrom organizations\n\nand small contributor PACs,\n\naggregate limits to all\n\nlegislative candidates,\n\naggregation of contributions\n\nfrom related entities, and\n\naggregate limits on contributions\n\nfrom non-individuals)\n\n\"Article 4.\n\n\"Expenditure Limitations Not Severable\n\n\"Article 5.\n\n\"Public Financing Conflict with 73\n\n(including provisions governing\n\ndisposition of surplus funds)\n\n\"Article 6.\n\n\"Independent Expenditures\n\n\"Disclaimer on Mailings No Conflict with 73\n\nand Severable\n\n\"Contribution Limits Conflict with 73\n\n\"Limits on Expenditures Conflict with 73\n\nby Contributors\n\n\"Reproduction of Materials Conflict with 73\n\n\"Disclosure for $10,000 No Conflict with 73\n\nIndependent Expenditures and Severable\n\n\"Article 7.\n\n\"Duties of Commission\n\n\"Regarding Public Financing Conflict with 73\n\n\"Prescribe Forms No Conflict with 73\n\nand Severable\n\n\"Studies No Conflict with 73\n\nand Severable\n\n\"Duties of Franchise Tax Board Not Severable\n\n\"Section 2.\n\n\"Repeal of Tax Deduction Moot\n\n\"Sections 3 and 4.\n\n\"Campaign Reform Fund and\n\nAppropriation to Commission Conflict with 73\n\n\"Section 5.\n\n\"Increased Criminal Penalties Not Severable\n\n\"Section 6.\n\n\"Increased Civil Liability Not Severable\n\n\"Section 7.\n\n\"Clarification Regarding No Conflict with 73\n\nAdministrative Penalties and Severable\n\n\"Section 8.\n\n\"Identification of Committees No Conflict with 73\n\nand Severable\n\n\"Section 9.\n\n\"Definition of Intermediary No Conflict with 73\n\nand Severable\n\n\"Section 10.\n\n\"Severability Clause No Conflict with 73\n\nRemains for Guidance\n\n\"Section 11.\n\n\"Legislative Amendments No Conflict with 73\n\nand Severable\n\n\"Section 12.\n\n\"Construction of 68 No Conflict with 73\n\nRemains for Guidance\n\n\"Section 13.\n\n\"Effective Date No Conflict with 73\n\nRemains for Guidance\"\n\nThus, the FPPC found that the operative provisions of Proposition 68 were:\n\nSection 68:85101 [findings and declarations]\n\nSection 68:85600 [disclaimer on mailings]\n\nSection 68:85604 [disclosure of independent\n\nexpenditure over $10,000]\n\nSection 68:85700, subdivisions (b) and (d) [FPPC to\n\nprescribe forms, and prescribe and\n\nrelease studies on impact of title.]\n\nSection 68:83116 [amendment of existing section\n\ngoverning administrative penalties]\n\nSection 68:84106 [identification of committees]\n\nSection 68:84302.5 [defining intermediary].\n\nAlso operative were the severability clause (section 10), the provision permitting legislative amendment pursuant to existing section 81012 (section 11), the direction for liberal construction (section 12), and the effective date (section 13).\n\nThe FPPC also concluded that it was bound by section 10(b) and Estate of Gibson (1983) 139 Cal. App. 3d 733, 736 [189 Cal. Rptr. 201], to examine the initiatives provision-by-provision, and to recognize any provision of Proposition 68 as operative if not in direct conflict with Proposition 73. Unlike that of the Legislative Counsel, however, the FPPC did not conclude that the interrelationship of the provisions of Proposition 68 precluded implementation of any part of the initiative. The FPPC thus found the statement of purposes of Proposition 68 operative, while simultaneously concluding that few of the principal substantive provisions intended to accomplish those purposes were operative.\n\nC. Prior Court of Appeal Decision\n\nIn an earlier proceeding the Court of Appeal upheld the conclusion of the FPPC that the provision of Proposition 68 that would establish a Campaign Reform Fund and a tax check-off system (§ 68:85102, subd. (e); Rev. \u0026 Tax. Code, § 18775) conflicted with Proposition 73 and could not be enforced. (Center for Public Interest Law v. Fair Political Practices Com. (1989) 210 Cal. App. 3d 1476 [259 Cal. Rptr. 21].)\n\nD. This Court of Appeal Opinion\n\nThe Court of Appeal decision in this case represents the fourth attempt to apply section 10(b) and the body of law governing judicial construction of conflicting statutes. The Court of Appeal ruled that additional provisions of Proposition 68 had become operative, in particular:\n\nSection 68:85101, subdivisions (a), (c), (d), (e), (g) and (i) [findings]\n\nSection 68:85102, subdivisions (a), (b), (f), (g), (h), (i), (j), (k) and (m) [purposes]\n\nSections 68:85202, 68:85204 and 68:85206 [definitions]\n\nSection 68:85309 [prohibition of nonelection year contributions to legislative candidates]\n\nSection 68:85311 [return of contributions]\n\nSections 68:85305 through 85307 and 68:85312/68:85313, subdivisions (a) and (b), and 68:85314 [aggregate contribution limits, family contributions, loan rules, and attribution rules as modified]\n\nSection 68:85317 [timing/allocation of contributions among elections]\n\nAmendments to sections 91000 and 91005 [civil and criminal penalties].\n\nThe effect of the efforts of the FPPC, which had conceded that other provisions of Proposition 68 were operative, and the Court of Appeal, was that numerous provisions that had been part of a regulatory scheme applicable only to candidates for state legislative offices, and which contemplated partial public funding, were engrafted onto a legislative scheme that applied to candidates for all state and local offices, and forbade any public funding. The result, the FPPC contends, is a regulatory scheme that neither the drafters of the competing initiatives nor the electorate contemplated.\n\nIII\n\nThe obstacles and uncertainties facing a court when called upon to reconcile provisions of competing initiative measures are illustrated by the divergent conclusions reached by the FPPC and the Court of Appeal with respect to whether the provisions of Propositions 68 and 73 were irreconcilable, and whether the voters would have adopted various parts of Proposition 68 had they not been part of that measure. The court assumed that because a majority of voters approved both initiatives, they intended that both take effect to the greatest extent possible. This assumption, however, is incapable of proof. That some voters would have been satisfied with the adoption of either proposition does not suggest that they wanted both, or that the same voters cast a majority of the affirmative votes for each initiative.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nOne assumes that those voters who did cast ballots for both Proposition 68 and Proposition 73 did so in an effort to ensure that one or the other regulatory scheme would be adopted. It does not follow that these voters attempted to analyze the measures to ascertain which provisions conflicted, understood that the scheme ultimately operative would be an amalgam comprised of provisions from both, or anticipated the results that the Court of Appeal and the FPPC reached.\n\nProceeding on the assumption that section 10(b) required a provision-by-provision analysis and that a majority of voters wanted both measures implemented to the extent possible, the Court of Appeal addressed several aspects of the Proposition 68 statutory scheme as discrete regulations. It first considered the campaign contribution limitations which Proposition 68 made applicable only to legislative candidates and their committees. Those limitations prohibited acceptance of contributions in any odd-numbered (nonelection) year. (§ 68:85309.) Proposition 73 contained no comparable limitation, but did contain limits on the amount that could be contributed by persons, political committees, and broad-based political committees in any fiscal year, i.e., the period between July 1 of one year and June 30 of the following year. (§§ 73:85301-85303.) These provisions could both be enforced, the Court of Appeal reasoned, because the contributor could make the maximum allowable contribution to a legislative candidate during the six months of the fiscal year that overlapped the six months of the year in which the candidate's name appeared on the ballot. Thus, a candidate for the Assembly could accept the maximum contributions authorized by Proposition 73 during each fiscal year as long as the contributions were made in the half of the fiscal year falling in an even-numbered calendar year. By contrast, a candidate for the Senate could not receive any contributions during the two fiscal years that did not overlap a calendar year in which the candidate was standing for election. Senatorial candidates who would be entitled under Proposition 73 to receive $4,000 from an individual during the four-year period between elections, would thus be able to receive only $2,000 once the Proposition 68 restriction on nonelection year contributions was imposed.\n\nThe Court of Appeal reasoned that by restricting contributions in this manner, although neither proposition authorized the restrictions, it was literally possible to apply the provisions of both propositions. The court also concluded that the people had the power to single out legislative candidates for more restrictive treatment, and that the result was not inconsistent with section 68:85305, which authorizes higher contribution limits for senatorial\n\ncandidates than for Assembly candidates. The court rejected the argument that the adoption of fiscal year limits in Proposition 73 served to permit separate limits for primary and general elections, concluding the limits were not \"entitlements,\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and that senatorial candidates could receive their maximum amounts for the primary election in the latter half of one fiscal year and the maximum amount for the primary in the first half of the next fiscal year. Of course, they could not receive three times as much before the primary as before the general election, as would be the case absent the Proposition 68 ban on off-year contributions, and both senatorial and Assembly candidates would be subject to the Proposition 68 contribution limits without the supplements that public financing would have offered.\n\nAll of this, the court reasoned, was permissible because the voters would have adopted the off-year contribution ban even had the public funding provisions not been included in Proposition 68, and the issue of off-year funds had been sufficiently drawn to their attention to justify a conclusion that a majority would have approved the off-year provisions. Left unexplained was the basis for concluding that a majority of voters understood and would have approved the actual monetary limits that resulted under the hybrid scheme.\n\nProposition 73, which banned public funding, contained no aggregate contribution limits for any candidates. Proposition 68, by contrast, provided for public funding, and limited senatorial candidates to receipt of $75,000 and Assembly candidates to $50,000 in the aggregate from all nonindividual donors except political parties and legislative caucuses. (§ 68:85305.) Section 68:85305 limits individual contributions to legislative candidates and committees to $25,000 in a two-year period, while section 68:85307 limits contributions to legislative candidates by organizations and some committees to $200,000 in a two-year period. The FPPC argued that this created a clear conflict with Proposition 73, not only because Proposition 73 does not impose aggregate contribution limits on legislative candidates, but also because section 73:85303, subdivision (c), expressly provides\n\nthat there is no limit to the amount an individual may contribute to committees for purposes other than making contributions directly to candidates for elective office.\n\nThe disparate treatment of legislative candidates that resulted from imposition of the Proposition 68 limits did not trouble the Court of Appeal, which concluded that since the voters approved both measures they intended the distinction. The court concluded on the basis of the findings set out in Proposition 68 that the voters believed that more burdensome restraints on legislative candidates were justified, and reasoned that had equal treatment of candidates been intended by Proposition 73 the drafters would have expressly indicated that intent. As we have noted, however, it is the understanding and intent of the voters that must be ascertained, and the Court of Appeal identified no basis on which to conclude that a majority of voters intended the limitations on spending to operate independently, i.e., without opportunity for partial public financing.\n\nSection 68:85312 specifies the manner in which contributions to legislative candidates by related individuals and entities are to be aggregated (considered to have come from a single donor). It provides, however, that its provisions apply for \"purposes of the contribution limitations in Sections 85300-85307, inclusive, and Section 85310\" (of Proposition 68). The Court of Appeal concluded that the aggregation provision could be given effect notwithstanding Proposition 73 which itself defined \"person\" and provided definitions for persons and entities acting in concert. (§ 73:85102.) In enforcing contribution limitations for legislative candidates, the court reasoned, Proposition 68 simply defined the \"certain very specific circumstances\" in which donors would be deemed a single person or entity. Therefore, although one part of subdivision (d) of section 68:85312 which did conflict with subdivision (b) of section 73:85102 had to be excised, as well as reference in the introductory portion of section 68:85312 to provisions that were concededly invalid, the remainder of section 68:85312, defining \"person,\" could be enforced.\n\nThe Court of Appeal recognized that Proposition 68 clearly and unambiguously applied only to candidates for state legislative office. The court nonetheless held that the amendment of existing section 91000 by Proposition 68, which makes any violation of chapter 5 punishable as a felony and any violation of any other section of that title punishable as a misdemeanor regardless of whether the violation was knowing or wilful, was enforceable and thus applicable to violation of the chapter 5 created by Proposition 73. The court found no reason to believe that the voters intended to limit the more severe punishment authorized by section 68:91000 to violation of the\n\nchapter 5 which Proposition 68 would have created,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and thus held that the amendment to section 91000 had become effective. This conclusion, the FPPC argues, cannot be reconciled with the recognition that by its terms the proposal was to apply to a different chapter 5 than that which became operative when Proposition 73 received a greater affirmative vote.\n\nIV\n\nOur discussion above makes no effort to summarize all of the reasoning by which the Court of Appeal reached its conclusions as to each of the provisions of Proposition 68 that it held were enforceable. Nor do we undertake an analysis of the arguments made by the FPPC and the several amici curiae who dispute the Court of Appeal's conclusion that these additional provisions are enforceable. We attempt nothing more than to illustrate the analytical difficulty and practical impossibility of implementing the presumed, but in fact unknown, will of the electorate by judicially merging competing initiative regulatory schemes.\n\nBoth the FPPC and the Court of Appeal attempted to avoid application of section 10(b), which they understood to invalidate only individual provisions within an initiative if those provisions conflicted with and were not severable from provisions of the initiative that received a greater affirmative vote. In so doing they applied standard rules of statutory construction which obligate the court to attempt to reconcile or harmonize conflicting statutory provisions in an effort to give effect to all provisions if it is possible. (See Code Civ. Proc., § 1858; Fuentes v. Workers' Comp. Appeals Bd. (1976) 16 Cal. 3d 1, 7 [128 Cal. Rptr. 673, 547 P.2d 449]; Estate of Gibson, supra, 139 Cal. App. 3d 733, 736.) The overriding concern in these rules of statutory construction is that the intent of the Legislature or the electorate in adopting a statute be effectuated. (See fn. 10.) (Code Civ. Proc., § 1859; Select Base Materials v. Board of Equal. (1959) 51 Cal. 2d 640, 645 [335 P.2d 672]; Hogya v. Superior Court (1977) 75 Cal. App. 3d 122, 132 [142 Cal. Rptr. 325].)\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn applying section 10(b), however, the question is not construction of a statute to ascertain and effectuate its meaning. The varying results of the efforts of the FPPC and the Court of Appeal to utilize rules of statutory construction to resolve the fundamentally inconsistent approaches of Proposition 73 and 68 to regulation of campaign finance and expenditure, and the arguments of the parties and amici curiae as to whether the resulting regulatory scheme is one intended by the voters, place the crucial issue not only in context, but in bold relief. Does section 10(b) contemplate enforcement of any provisions of an initiative that receives a majority of the votes cast when another initiative on the same ballot, directed to the same subject and offered as a competing regulatory scheme, receives a greater majority? We conclude that it does not.\n\nWhat then does section 10(b) mean when it says: \"If provisions of 2 or more measures approved at the same election conflict, those of the measure receiving the highest affirmative vote shall prevail.\" (Italics added.) Both Taxpayers and the FPPC argue that the language is clear that \"those\" refers only to the individual provisions which conflict and the remaining (nonconflicting) provisions of the initiative or initiatives receiving the lesser affirmative vote are also operative if they are severable. That is not the only reasonable understanding of the section, however. It can also be read to mean that when initiatives with provisions that are in fundamental conflict receive affirmative votes at the same election, only the provisions of the measure receiving the highest affirmative vote are operative.\n\nThe history of section 10(b) suggests that the latter construction is consistent with the intent of the electorate which adopted the constitutional amendment adding the initiative and referendum to the Constitution in 1911. When the electorate gives an affirmative vote to more than one initiative, each of which seeks to regulate the same subject, but in different or conflicting ways, the \"provisions\" are in fundamental conflict, and only the \"provisions\" of the measure receiving the higher affirmative vote prevail. Section 10(b) does not anticipate that the court will create a hybrid regulatory scheme in order to carry into effect some of the provisions of the proposition or propositions that received fewer votes.\n\nThe people reserved the initiative power by amendment of article IV of the Constitution on October 10, 1911. That amendment authorized use of the initiative to enact laws and amend the Constitution under procedures set forth in former section 1 of article IV. Section 1 also reserved to the electors of counties and towns the initiative power, to be exercised pursuant to procedures to be provided by local ordinance. At the time of its adoption the initiative provision specified: \"If any provision or provisions of two or more measures, approved by the electors at the same election, conflict, the provision or provisions of the measure receiving the highest affirmative vote shall prevail.\" Although this language, too, is ambiguous, the ballot arguments suggest that inclusion of \"provision or provisions\" in the section did not mean that all individual nonconflicting provisions of both measures would become operative. It reflected nothing more than recognition that some proposed statutes would contain only one provision.\n\nThis construction finds support in the argument explaining the constitutional amendment by which the initiative and referendum were added to the Constitution: \"No initiative measure is subject to the governor's veto, nor, when adopted, can it be amended or repealed except by the people, unless the measure itself shall differently provide. If a conflict arise between provisions adopted and approved by the electors at the same election, that receiving the highest vote shall prevail.\" (Ballot Pamp., argument in favor of Sen. Const. Amend. No. 22 as presented to the voters, Special Statewide Elec. (Oct. 10, 1911). Italics added.) The singular \"that\" in this language must refer to \"measure\" and not to the conflicting \"provisions.\" Thus, the section was directed to conflicting ballot measures, and it was the initiative measure which received the higher vote that was to prevail.\n\nEarlier in the same year, moreover, the Legislature had added section 4058 to the former Political Code to authorize the adoption of county ordinances by petition to the board of supervisors. The board was required to adopt the proposed ordinance without alteration or submit it to a vote of the people of the county. This statute authorized the submission of any number of proposed ordinances at the same election, and specified: \"If the provisions of two or more ordinances adopted at the same election conflict, then the ordinance receiving the highest number of affirmative votes shall control.\" (Stats. 1911, ch. 342, § 1, p. 578, approved Apr. 3, 1911.) Like the amendments to article IV, it, too, was directed to the treatment of conflicting ballot measures. Thus, precedent also provided that the measure receiving the higher vote prevailed.\n\nThe 1911 ballot argument advised the voters that the initiative was not untried, having been used in Switzerland for 50 years, and noted that\n\nseveral California charter cities, including San Francisco and Los Angeles, had adopted the initiative. It was clear on the face of the Political Code section which then authorized initiative ordinances that only one measure would go into effect in case of a conflict. Nothing in the argument suggested that the conflict resolution provision of the statewide initiative measure was to operate in a different manner.\n\nThe leading contemporary observer of the 1911 session of the Legislature, Franklin Hichborn, understood the 1911 constitutional provision to have the same effect as the Political Code provisions. In his monograph Hichborn summarized the conflict provision: \"In the case of conflict between measures approved by the electors at the same election, that receiving the highest affirmative vote shall prevail.\" (Hichborn, Story of the Session of the Cal. Legislature of 1911 (1911) p. 96, fn. 119.)\n\nContemporary understanding of the conflict provision at the time of its adoption therefore supports our conclusion that initiative ballot measures addressing the same subject are to be examined as a whole and, if they offer conflicting regulatory schemes for governance of that subject, it is the \"measure\" receiving the highest affirmative vote which prevails. Absent an express contrary intent expressed in one or both of the initiative measures, no part of the measure receiving the lesser affirmative vote becomes operative.\n\nThis understanding of the proposed treatment of conflicting initiatives is also reflected in subsequent legislation. Shortly after the Constitution was amended to provide for the initiative, the Legislature again used the clear statutory language of the Political Code provision in adopting a law to permit the electors of incorporated cities or towns to adopt ordinances by initiative. This act, approved on January 2, 1912, stated: \"If the provisions of two or more ordinances adopted at the same election conflict, then the ordinance receiving the highest number of affirmative votes shall control.\" (Stats. 1911, First Ex. Sess. 1911, ch. 33, § 1, p. 133.) This provision exists today as Elections Code section 4016, while Elections Code section 3717 preserves the same language applicable to county ordinances originally found in former Political Code section 4058.\n\nWhen a different treatment of conflicting ballot propositions was intended, language explicitly requiring an attempt to implement provisions of both measures was used. Thus, Assembly Constitutional Amendment No. 25, which proposed amendment of article XI, former section 8 of the Constitution in 1913, authorized amendment of city and county charters on petition of the electors as well as proposals submitted by the legislative body. This proposal specified: \"In submitting any such charter or amendment separate\n\npropositions, whether alternative or conflicting, or one included within the other, may be submitted at the same time to be voted on by the electors separately, and, as between those so related, if more than one receive a majority of the votes, the proposition receiving the larger number of votes shall control as to all matters in conflict.\" (Assem. Const. Amend., No. 25, Stats. 1913 (Reg. Sess.) res. ch. 90, pp. 1730, 1732.)\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e This provision was amended, as article XI, section 3, subdivision (d), of the Constitution in 1970, and the language conformed to that of section 10(b). It now treats conflicts in the same manner as does section 10(b). The explanation of the change given in the June 2, 1970, ballot pamphlet, stating that the intent was to revise the provisions for adoption, revision and repeal of county charters and city charters to make them uniform, strongly suggests an understanding that the section 10(b) language did not contemplate that all nonconflicting provisions of competing initiatives would become operative.\n\nIn order to further the fundamental right of the electorate to enact legislation through the initiative process, this court must on occasion indulge in a presumption that the voters thoroughly study and understand the content of complex initiative measures. (See, e.g., Brosnahan v. Brown (1982) 32 Cal. 3d 236, 252 [186 Cal. Rptr. 30, 651 P.2d 274]; Fair Political Practices Com. v. Superior Court (1979) 25 Cal. 3d 33, 42 [157 Cal. Rptr. 855, 599 P.2d 46]; Amador Valley Joint Union High Sch. Dist. v. State Bd. of Equalization (1978) 22 Cal. 3d 208, 231 [149 Cal. Rptr. 239, 583 P.2d 1281]; Wright v. Jordan (1923) 192 Cal. 704, 713 [221 P. 915].) Relying on this presumption we attempt to ascertain and implement the purposes of the measure. No case has been called to our attention, however, in which the court has assumed that voters not only recognized that they were approving initiatives with fundamentally conflicting provisions intended to regulate the same subject, but also analyzed the remaining provisions in order to predict which would be implemented if either measure received a lesser affirmative vote. A construction of section 10(b) that obligates the court to implement a fictitious electoral intent would be unreasonable and unjustified.\n\nIn concluding that section 10(b) mandates an attempt to reconcile these competing initiatives, each of which offers a comprehensive but fundamentally different regulatory scheme, the dissent and the Court of Appeal apparently assume that a majority of the same voters cast their votes for both Proposition 73 and Proposition 68, and thus enforcement of parts of Proposition 68 will carry out the intent of the electorate. As we have pointed out, however, there is no sound basis for the predicate assumption. The parties concede that the court cannot determine whether a majority of the voters intended that both measures become effective if both passed. Absent some basis for such a determination, the court cannot logically conclude that it was the intent of a majority of the electorate that both propositions be implemented to the extent possible, or that the voters anticipated the amalgam created by the Court of Appeal.\n\nWhen competing initiatives are on the ballot, it is possible, if not probable, that many of the votes in favor of each measure were cast by the voters who cast votes against the alternative proposition. The arguments for and against the initiatives here asked the voters to do just that -- to choose between the two measures. A construction of section 10(b) that invites judicial reconciliation of competing initiatives in these circumstances would lead as easily to thwarting the will of the electorate as to carrying it out.\n\nTaxpayers and the FPPC argue that a construction of section 10(b) that does not permit implementation of individual, nonconflicting provisions of initiative measures will \"eviscerate\" the initiative process, and will make it possible for opponents of an initiative to defeat it even when it has been adopted by an overwhelming majority of the voters. The opponents will be able to do so, they argue, by placing another, less complex, but conflicting, measure on the same ballot in the hope that it will receive a greater vote.\n\nThe possibility of abuse of the initiative, however, does not offset the equally serious threat to the process that may occur when courts and regulatory agencies attempt to enforce provisions of conflicting initiatives in the absence of any assurance that the electorate anticipated the resulting regulatory scheme.\n\nThe process is better served by presentation at a subsequent election of a new initiative measure which the voters can consider in light of the scheme established by the measure that prevailed in the earlier election. We do not denigrate the conscientious efforts of the voters to familiarize themselves with ballot measures. The increasing number and complexity of statewide and local initiative measures, however, supports our conclusions that we should not read section 10(b) as mandating what constitutes judicial\n\nlegislation in which portions of one regulatory scheme are excised and attached to another, quite different scheme. Nor should we assume, as the Court of Appeal felt compelled to, that the voters would have approved incorporation of these several Proposition 68 provisions into the regulatory scheme created by Proposition 73.\n\nWe observed many years ago that even the most conscientious voters may lack the time to study ballot measures with that degree of thoroughness. Noting the tendency of voters to rely on the title to describe the content of an initiative, we agreed implicitly with the Supreme Court of Oregon whose observation we quoted:\n\n\"'. . . The majority of qualified electors are so much interested in managing their own affairs that they have no time carefully to consider measures affecting the general public. A great number of voters undoubtedly have a superficial knowledge of proposed laws to be voted upon . . . . We think the assertion may safely be ventured that it is only the few persons who earnestly favor or zealously oppose the passage of a proposed law initiated by petition who have attentively studied its contents and know how it will probably affect their private interests. The greater number of voters do not possess this information and usually derive their knowledge of the contents of a proposed law from an inspection of the title thereof, which is sometimes secured only from the very meager details afforded by a ballot which is examined in an election booth preparatory to exercising the right of suffrage.'\" (Wallace v. Zinman (1927) 200 Cal. 585, 592-593 [254 P. 946, 62 A.L.R. 1341], quoting State v. Richardson (1906) 48 Ore. 309, 319 [85 P. 225, 229].)\n\nThose observations are no less pertinent today. \"Voters have neither the time nor the resources to mount an in depth investigation of a proposed initiative. Often voters rely solely on the title and summary of the proposed initiative and never examine the actual wording of the proposal.\" (Schmitz v. Younger (1978) 21 Cal. 3d 90, 99 [145 Cal. Rptr. 517, 577 P.2d 652], dis. opn. of Manuel, J.)\n\nWe conclude, therefore, that unless a contrary intent is apparent in competing, conflicting initiative measures which address and seek to comprehensively regulate the same subject, only the provisions of the measure receiving the highest affirmative vote become operative upon adoption. If the measures propose alternative regulatory schemes, a fundamental conflict exists. (See fn. 12.) In those circumstances, section 10(b) does not require or permit either the court or the agency charged with the responsibility of implementing the measure or measures to enforce any of\n\nthe provisions of the measure which received the lesser affirmative vote.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Inasmuch as it is clear, for the reasons explained above, that Propositions 73 and 68 were competing initiative measures offering alternative regulatory schemes whose provisions conflicted, only Proposition 73 is operative.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nV\n\nThe judgment of the Court of Appeal is reversed and the matter is remanded with directions to deny the petition for writ of mandate.\n\nDisposition\n\nThe judgment of the Court of Appeal is reversed and the matter is remanded with directions to deny the petition for writ of mandate.\n\nMOSK, J., Concurring and Dissenting.\n\nI concur with qualifications. Therefore, I write separately to point out some additional problems in interpreting competitive initiatives that purportedly create a \"comprehensive regulatory scheme related to the same subject.\"\n\nIn construing a statute, our overarching duty is to effectuate the lawmakers' intent, be they the electorate in the case of an initiative or, otherwise, members of the Legislature. (In re Lance W. (1985) 37 Cal. 3d 873, 889 [210 Cal. Rptr. 631, 694 P.2d 744].) In the case of an initiative, the ballot arguments are one source from which the electorate's intent may be gleaned. (See Amador Valley Joint Union High Sch. Dist. v. State Bd. of Equalization (1978) 22 Cal. 3d 208, 245-246 [149 Cal. Rptr. 239, 583 P.2d 1281].)\n\nWhile ballot arguments that are mere appeals to passion on emotionally charged topics of public policy illuminate the electorate's intent feebly if at\n\nall (In re Lance W., supra, 37 Cal. 3d at p. 906, fn. 5 [dis. opn. of Mosk, J.]), in this case the proponents of each initiative -- in particular Proposition 68's partisans -- expressly asked the voters to choose between them. (Maj. opn., ante, pp. 754, 769.) Less significant than the ballot arguments, the identical numbering of proposed sections with different content supports the view that the measures were offered expressly as alternatives. (Maj. opn., ante, p. 754.) Thus, the election results do not allow us to presume that a majority wanted both measures to pass. In these circumstances, to patch together the nonconflicting provisions of measures that were expressly offered in opposition to each other would usurp the legislative role, creating, in the worst scenario, a Frankenstein's monster whose existence the voters never contemplated.\n\nHence, under the facts of this case I believe the majority reach the correct result. As my colleagues note elsewhere, the two measures not only were competing regulatory schemes, but were offered as such. (Maj. opn., ante, pp. 765, 767.) Although the majority do not include the qualifying verb \"offer\" in each statement of the conclusion that only the higher votegetter of two competing initiatives is to be given effect, that qualification should be read into our conclusion wherever it appears because the case before us involved explicit invitations to choose between competing schemes.\n\nThe majority further imply, however, that today's holding might apply even if an initiative's opponent attempts to defeat it by placing a simpler but conflicting measure on the same ballot, whether or not the measures announce that they conflict. (Maj. opn., ante, p. 770.) I am troubled by a possible consequence of that suggestion: In my view, the implications of the majority's language are broad enough to allow an initiative designed solely to sabotage another measure through deception to achieve its aim.\n\nIt is a sad fact of democratic life that many voters have neither the time nor the will to scrutinize a measure's contents in the detail needed to discern a conflict not squarely presented in the ballot arguments or title. (See maj. opn., ante, p. 770; see also In re Lance W., supra, 37 Cal. 3d at p. 910 [dis. opn. of Mosk, J.].) An opponent could take advantage of this reality to offer the voters a competing initiative that artfully conceals its true aim by failing to declare its opposition to the target initiative in materials the voter can readily comprehend.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e When an initiative is thus designed to\n\nclandestinely sabotage another, and succeeds in receiving a greater popular vote, I do not believe we can presently say that the voters' true desires will be implemented by giving it effect and entirely discarding the target. Fortunately, this question is not before us now and we do not decide it today.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThough the majority cursorily mention the subject in a footnote, they adopt an ostrich-like approach to recent developments in the real world concerning the fate of Proposition 73. A federal district court declared the significant portions of the measure to be violative of the First Amendment of the United States Constitution, and enforcement of the provisions was permanently restrained. (Service Employees v. Fair Political Practices (E.D.Cal. 1990) 747 F.Supp. 580.) Petitions to stay the district court restraining order were denied by the Ninth Circuit, by Justice O'Connor of the United States Supreme Court, and by Chief Justice Rehnquist on behalf of the entire Supreme Court.\n\nWhile the underlying appeal to the Ninth Circuit has not been heard, restraint against enforcement of the significant provisions of Proposition 73 is in full force and effect. Thus an unequivocal holding that Proposition 73 prevails over Proposition 68 contains an element of practical futility at this writing.\n\nIt can be argued that the federal district court did not invalidate the entire Proposition 73, but only three provisions thereof. However, the undeniable fact is that the court order dealt with the significant portions of the proposition, its raison d'etre, the issues on which voters' approval was sought. The measure purported to add chapter 5 to title 9 of the Government Code. The chapter was entitled \"Limitations on Contributions.\" That is the very subject with which the federal court dealt.\n\nThe new chapter consisted of three articles. The first contained definitions. The second article referred to the amounts of campaign contributions that can be accepted, as provided in the third article. The third article contained the limitations on amounts and on the transferring of funds from one candidate to another.\n\nThere are no other significant provisions in Proposition 73 except for a prohibition against public funding, a practice we do not have and have never had. If the district court's order is ultimately upheld, there are no aspects of the proposition that will survive for enforcement.\n\nThe foregoing status imprecision renders any current action by this court quixotic at best. We can declare as a general principle, with which I agree, that when two ballot propositions asserting a comprehensive regulatory scheme relating to the same subject are passed by the voters, that measure with the greatest majority shall prevail. To that concept, however, I would add this qualification: the principle applies only when both competing proposals are constitutionally valid. A dead horse cannot win a race. If one proposition is ultimately declared invalid, the other necessarily prevails by default.\n\nIn short, I fear that due to the uncertainty caused by federal proceedings not yet final, we are today rendering a mere advisory opinion. It is an opinion with which I have no quarrel if it is read with the qualification recited above.\n\nKENNARD, J.\n\nI dissent. When simultaneously approved electoral measures contain conflicting provisions, our state Constitution instructs us in plain language that the measures are to be examined provision by provision and reconciled to the greatest possible extent. Both parties to this litigation agree that this is what the Constitution requires. Yet the majority, in direct violation of the Constitution, invalidates in its entirety an initiative measure approved by the voters at a statewide election without pausing to determine whether it contains provisions that are reconcilable with the measure that received more votes.\n\nMuch of the majority opinion is devoted to a demonstration of the supposed analytical difficulty of applying the provision-by-provision test to the initiative measures at issue here. I recognize that the majority's all-or-nothing approach makes the task of judicial review much easier, but resolving difficult and complex legal issues is unquestionably this court's constitutionally assigned responsibility. We may not elevate judicial convenience over constitutional command.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea\n\nEqually misguided is the majority's insistence that the Constitution must be interpreted to require an all-or-nothing approach because the provision-by-provision test will result in a hybrid scheme that the voters did not intend. As I will explain, the test employed by the Court of Appeal, and endorsed by both parties to this litigation, requires that any nonconflicting provisions be tested for severability. This is the established and time-tested method for determining whether the voters would have wanted part of an electoral measure to go into effect when another part has been found invalid.\n\nThe ballot for the June 1988 Primary Election included Propositions 68 and 73, two initiative measures that contained provisions imposing restrictions on the financing of political campaigns. Although both measures received a majority of affirmative votes, Proposition 73 received a greater number of affirmative votes. It is undisputed that some of the provisions of Proposition 68 conflict with provisions of Proposition 73. It is equally undisputed that some of Proposition 68's provisions do not conflict with anything in Proposition 73. The issue here, as presented by the parties, is which of Proposition 68's provisions became effective.\n\nThe problem of conflicts in simultaneously approved electoral measures was foreseen and dealt with in our state Constitution in article II, section 10, subdivision (b) (hereafter section 10(b)), which reads: \"If provisions of 2 or more measures approved at the same election conflict, those of the measure receiving the highest affirmative vote shall prevail.\" The proper interpretation of this language has a public importance that transcends the fate of the particular measure challenged here.\n\nThe first step in interpreting a constitutional provision such as section 10(b) is a close examination of its text. A constitutional provision should be construed in accordance with the natural and ordinary meaning of its words. (Mutual Life Ins. Co. v. City of Los Angeles (1990) 50 Cal. 3d 402, 407 [267 Cal. Rptr. 589, 787 P.2d 996]; ITT World Communications, Inc. v. City and County of San Francisco (1985) 37 Cal. 3d 859, 865 [210 Cal. Rptr. 226, 693 P.2d 811]; see also, Gibbons v. Ogden (1824) 22 U.S. 1, 188 [6 L.Ed. 23, 68] [framers of the federal Constitution \"must be understood to have employed words in their natural sense, and to have intended what they have said.\"].) Extrinsic aids should be consulted if, and only if, some legitimate uncertainty remains after consideration of the constitution's language. (Mutual Life Ins. Co. v. City of Los Angeles, supra, at p. 407; Sandelin v. Collins (1934) 1 Cal. 2d 147, 155 [33 P.2d 1009, 93 A.L.R. 956].)\n\nThe wording of section 10(b) is significant in two respects. First, the section distinguishes between \"measures,\" meaning an entire initiative, and \"provisions of . . . measures,\" meaning the separate operative parts of an initiative.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea It speaks not of conflicting measures but of conflicting provisions of measures. Thus the unit of analysis for purposes of determining whether a conflict exists is the individual provision, not the initiative as a whole. Section 10(b) unambiguously requires that courts undertake a provision-by-provision comparison of voter-passed initiatives, not merely a comparison of their overall import.\n\nThe manner in which a conflict is to be resolved is likewise described in terms of provisions, not measures. If the provisions of two or more simultaneously enacted electoral measures conflict, section 10(b) provides that \"those of the measure receiving the highest affirmative vote shall prevail.\" Thus section 10(b) unambiguously prescribes that whenever a provision-by-provision comparison reveals one or more conflicts, each such conflict is to be resolved on a provision-by-provision basis. To hold that any conflict between competing ballot measures renders invalid all provisions of all measures other than the measure receiving the highest affirmative vote, as the majority does, not only disregards section 10(b)'s plain meaning, it also renders surplusage all of section 10(b)'s references to provisions of measures. (See 37 Ops.Cal.Atty.Gen. 52, 56, fn. 11 (1961).) It is an elementary rule of construction, applicable to constitutions no less than statutes, that \"every word should be given some significance, leaving no part useless or devoid of meaning.\" (City and County of San Francisco v. Farrell (1982) 32 Cal. 3d 47, 54 [184 Cal. Rptr. 713, 648 P.2d 935].) The construction adopted by the majority violates this elementary rule.\n\nThe majority's view of section 10(b)'s language is difficult to understand. The majority ultimately concludes that when there is a conflict between simultaneously enacted ballot measures, the measures are sometimes to be examined as a whole, and at other times provision by provision, depending on whether the measures address the same subject or are \"competing.\" (Maj. opn., ante, at p. 771, fn. 12.) I find nothing in the language of section 10(b) to support this bifurcated approach.\n\nA second and no less significant feature of section 10(b)'s language is its use of the term \"prevail.\" Had the framers of section 10(b) intended that\n\nonly one of two or more competing ballot measures could be adopted, it would have been a simple matter to say so. An example of such language is found in a charter amendment that gave the powers of initiative and referendum to the voters of the City and County of San Francisco.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ea The charter amendment was passed by the local electorate in 1910 and approved by the Legislature in February 1911, during the same legislative session at which the predecessor of section 10(b) was drafted as part of the constitutional amendment that reserved the power of initiative for voters at state elections. The charter amendment stated, in relevant part: \"When there are two or more measures proposed to secure the same general purpose, the board of election commissioners shall so declare, and shall have the ballots so printed that the voter (first) can choose between any measure or none, and (secondly) can express his preference for any one. If a majority of the votes on the first question is affirmative, then the measure receiving the highest number of votes shall become law, and the others shall fail of passage. In case two or more measures are tied for the highest vote, they shall be resubmitted at the next ensuing general election. If there is a conflict between two or more measures or between two or more charter amendments adopted at the same election, then the measure or charter amendment receiving the highest affirmative vote shall prevail. No ordinance or measure approved by the electorate under the provision of this chapter shall be subject to veto, or be amended or repealed except by vote of the electorate, unless such ordinance or measure shall otherwise provide.\" (S.F. Charter, former art. XI, ch. III, § 7, italics supplied; see Stats. 1911, ch. 25, pp. 1661, 1670, 1672. See now, S.F. Charter, § 9.114.)\n\nThis charter provision established a dual system. Initiative measures could be presented to the voters as alternatives, in which case the voters would be informed that only one could be adopted and the others would \"fail of passage.\" If initiative measures were not so presented, however, two or more measures that conflicted could be \"adopted,\" that is, could become law. If this happened, the measure receiving the highest affirmative vote would \"prevail.\" (S.F. Charter, former art. XI, ch. III, § 7.)\n\nTo say that one of two conflicting measures shall \"prevail\" is not the same as saying that the other measure shall not take effect. The same term -- \"prevail\" -- is used in Government Code section 9605 to define the resolution of conflicts in statutes enacted at the same legislative session. In relevant part, Government Code section 9605 provides: \"In the absence of\n\nany express provision to the contrary in the statute which is enacted last, it shall be conclusively presumed that the statute which is enacted last is intended to prevail over statutes which are enacted earlier at the same session . . . .\" In this closely related context, this court has interpreted \"prevail\" to mean \"take precedence.\" (In re Thierry S. (1977) 19 Cal. 3d 727, 738 [139 Cal. Rptr. 708, 566 P.2d 610].) In other words, \"prevail\" connotes a comparatively higher degree of rank or authority rather than a complete extirpation of rivals.\n\nThis point is illustrated by a Court of Appeal decision concerning a conflict between two Penal Code sections that had been amended at the 1943 legislative session. As amended, Penal Code section 669 provided that when a person was sentenced to terms of imprisonment for two or more crimes, and one of the terms was for life, the other term or terms were to merge and run concurrently with the life term. Penal Code section 4530, as amended, provided that the term of imprisonment for an escape would commence from the time the prisoner would otherwise have been discharged from prison. The sections conflicted only in the case of a prisoner serving a life term who was thereafter convicted of escape. Applying Government Code section 9605, the Court of Appeal concluded that Penal Code section 4530 \"prevailed\" over Penal Code section 669 because it was enacted later, as evidenced by its higher chapter number, and therefore a prison term for an escape would commence only upon the conclusion of the life term. (In re McManus (1954) 123 Cal. App. 2d 395, 401 [266 P.2d 929].) The court nowhere suggested, however, that the amendment of Penal Code section 669 was ineffective in all those situations in which it did not conflict with the amended Penal Code section 4530, that is, whenever a term of imprisonment for a crime other than escape was imposed on a prisoner serving a life term.\n\nThe meaning of the term \"prevail\" becomes a matter of critical importance when the measure receiving the higher number of votes is held invalid. If the term \"prevail\" in section 10(b) means that the measure receiving fewer votes fails of passage, as the majority appears to hold, then the voters who approved both measures will end up with neither. But if, as I am persuaded, \"prevail\" means only \"take precedence,\" then a conflict between measures affects only the enforceability of the measure receiving fewer votes. As both measures are enacted, the measure receiving fewer votes will become fully effective and enforceable should the measure receiving the greater number of votes be held invalid.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ea\n\nThe preceding examination of the text of section 10(b) leads me to conclude that it compels the provision-by-provision analysis undertaken in this case by both the Fair Political Practices Commission and the Court of Appeal, in which initiative measures enacted together are harmonized whenever possible and specific provisions are invalidated only to the extent they conflict. Because there is no ambiguity in the language of section 10(b), I see no need to resort to extrinsic construction aids. If materials other than the text of section 10(b) are considered, however, the majority's construction of section 10(b) appears all the more untenable.\n\nAs the majority observes (maj. opn., ante, at p. 747, fn. 1), language identical to section 10(b) appears in two other parts of the California Constitution: article XI, section 3, subdivision (d) (hereafter section 3(d)), which applies to conflicts in measures to adopt or amend city or county charters, and article XVIII, section 4 (hereafter section 4), which applies to conflicts in measures to amend the state Constitution. Because parallel provisions using similar or identical language should be construed to have the same meaning (People v. Caudillo (1978) 21 Cal. 3d 562, 585 [146 Cal. Rptr. 859, 580 P.2d 274]; In re Phyle (1947) 30 Cal. 2d 838, 845 [186 P.2d 134]), evidence concerning the meaning of sections 3(d) and 4 should be given great weight in interpreting section 10(b).\n\nSections 3(d) and 4 were both adopted as part of the comprehensive 1970 constitutional revision. To ascertain their meaning, one source that may be consulted is the official reports of the California Constitution Revision Commission (see Mosk v. Superior Court (1979) 25 Cal. 3d 474, 495 [159 Cal. Rptr. 494, 601 P.2d 1030]); such reports are \"entitled to great weight\" (District Election etc. Committee v. O'Connor (1978) 78 Cal. App. 3d 261, 270 [144 Cal. Rptr. 442]). Regarding section 3(d), the California Constitution Revision Commission had this to say in its official report: \"Proposed Section 3(d) resolves conflicts between provisions approved at the same election by providing that the provisions of the measure with the highest affirmative vote prevail. It further provides, in effect, that only invalid provisions of a measure fail.\" (Cal. Const. Revision Com., Proposed Revision (1968) p. 56, italics added.) The commission's comment to section 4 is similar but even more explicit: \"A provision is added requiring that the measure receiving the highest affirmative vote prevails in the event measures approved at the same election contain conflicting provisions. This has been the rule governing measures proposed by the Legislature, and it is now extended to initiative measures and measures proposed by constitutional\n\nconvention. The revision also provides that if one portion of a measure fails because a conflicting measure receives more votes, the remainder of the measure not in conflict remains in effect.\" (Id. at p. 111, italics added.) The commission's comments provide persuasive evidence that sections 3(d) and 4, and consequently section 10(b) as well, require a court, when confronted with conflicts in the provisions of simultaneously adopted electoral measures, to give effect to those provisions not in conflict.\n\nThe majority places considerable reliance on an analysis of historical materials, but nothing in those materials alters my view regarding the meaning of section 10(b). The most obvious flaw in the majority's analysis of the context in which the predecessor of section 10(b) was adopted is its erroneous assumption that the terms \"prevail\" and \"control,\" as applied to one of two conflicting measures, imply that the other measure is without effect. For example, the majority observes that in 1911 a section of the Political Code addressed the problem of conflicts between county ordinances proposed at the same election. Former Political Code section 4058 provided that in this event \"the ordinance receiving the highest number of affirmative votes shall control.\" (Stats. 1911, ch. 342, § 1, p. 578.) Without citing any authority, the majority asserts that it was \"clear on the face\" of former Political Code section 4058 that \"only one measure would go into effect in case of a conflict.\" (Maj. opn., ante, at p. 767.) The majority is simply wrong. As demonstrated above, the terms \"control\" and \"prevail\" mean only that the one measure will take precedence over the other, not that the other will be without effect.\n\nTo cite yet another example of this usage, some statutory conflicts are resolved according to the rule that a more specific statute \"controls\" or \"prevails over\" or \"takes priority over\" a more general statute. (See, e.g., Code Civ. Proc., § 1859 [\"So a particular intent will control a general one that is inconsistent with it.\"]; Estate of Kramme (1978) 20 Cal. 3d 567, 576 [143 Cal. Rptr. 542, 573 P.2d 1369] [\"the specific statute controls and takes priority over a general statute encompassing the same subject\"]; County of Placer v. Aetna Cas. etc. Co. (1958) 50 Cal. 2d 182, 189 [323 P.2d 753] [\"the later specific statute controls\"]; Board of Supervisors v. Simpson (1951) 36 Cal. 2d 671, 673 [227 P.2d 14] [\"a particular statutory provision should prevail over a general one\"].) This does not mean that the general statute ceases to have effect, but that the specific is treated as an exception to the general. (County of Placer v. Aetna Cas. etc. Co., supra, at p. 189.)\n\nAs the majority observes (maj. opn., ante, at pp. 767-768), the predecessor of section 3(d) was adopted in the following form: \"In submitting any such charter or amendment separate propositions, whether alternative or\n\nconflicting, or one included within the other, may be submitted at the same time to be voted on by the electors separately, and, as between those so related, if more than one receive a majority of the votes, the proposition receiving the larger number of votes shall control as to all matters in conflict.\" (Cal. Const., former art. XI, § 8; Stats. 1913, ch. 90, p. 1732, italics added.) As the majority concedes, this means that each proposition receiving a majority of the votes becomes effective as to matters not in conflict. The majority cites this as evidence that when a harmonizing approach was intended, the framers of the Constitution clearly so stated. But the majority fails to explain why the rules for state elections should differ from those applying to local elections, or why, if a different meaning was originally intended, the constitutional provisions governing state and local elections now use identical language.\n\nI would draw a lesson different from that drawn by the majority. First, there is no indication that the former provision's repeal and reenactment as section 3(d) was intended to effect a change in meaning. On the contrary, the official report of the California Constitution Revision Commission contains this comment regarding its proposal that section 3(d) be adopted in its current form: \"This proposal clarifies and extends to counties similar existing provisions which are applicable only to cities.\" (Cal. Const. Revision Com., Proposed Revision (1968) p. 56.) As noted earlier, section 3(d) in its current form is identical to section 10(b). Thus the history of sections 10(b) and 3(d) compels the conclusion that both now require, and their predecessors always have required, that every effort be made to reconcile and harmonize ballot measures adopted at the same election.\n\nThe provision-by-provision analysis required by section 10(b) is consistent with the rule that statutes relating to the same subject matter must be read together and harmonized to the greatest extent possible. (Fuentes v. Workers' Comp. Appeals Bd. (1976) 16 Cal. 3d 1, 7 [128 Cal. Rptr. 673, 547 P.2d 449].) This cardinal rule of construction applies to statutes enacted by initiative as well as to acts of the Legislature. (Estate of Gibson (1983) 139 Cal. App. 3d 733, 736 [189 Cal. Rptr. 201].) It applies with particular force \"when such statutes are enacted at the same time, or at the same session of the Legislature or when they become effective on the same date.\" (In re Marriage of Pinto (1972) 28 Cal. App. 3d 86, 89 [104 Cal. Rptr. 371].) The majority's construction of section 10(b) abandons these long-standing principles.\n\nThe majority's policy arguments for adopting an all-or-nothing approach are unpersuasive. The majority argues that when two or more ballot measures are \"competing initiatives,\" the all-or-nothing approach is necessary\n\nto prevent the creation of a regulatory scheme that the electorate did not understand or intend. Yet the same objective can more accurately and more appropriately be attained by examining the provisions individually.\n\nA ballot measure may be invalidated in its entirety if each of its provisions conflicts with the provisions of a measure receiving a higher number of affirmative votes. Also, any ballot measure can establish a conflict by express statement. Here, for example, it is undisputed that Proposition 73's express prohibition against public financing of contests for elective office renders ineffective all of Proposition 68's provisions dealing with public campaign financing. Presumably a broader express statement could be used to establish a conflict with each of the provisions of a competing measure. When such a \"poison pill\" provision is included, voters will understand that only one of the competing measures will become law and will cast their votes accordingly. But when there is no such broad exclusionary statement, and no irreconcilable conflict as to each provision, then the voters' intent is best determined by a severability analysis.\n\nWhen one portion of an initiative statute conflicts with the state or federal Constitution, or is invalid for any other reason, the offending part must be stricken from the statute but the remainder can take effect if it is severable. (Santa Barbara Sch. Dist. v. Superior Court (1975) 13 Cal. 3d 315, 330 [118 Cal. Rptr. 637, 530 P.2d 605]; see Calfarm Ins. Co. v. Deukmejian (1989) 48 Cal. 3d 805, 821, 835 [258 Cal. Rptr. 161, 771 P.2d 1247].) The nonconflicting provisions are presumed to be severable, and this presumption is \"fortified by the express statement of a severability clause.\" (In re Blaney (1947) 30 Cal. 2d 643, 655 [184 P.2d 892].) The purpose of the severability analysis is to ascertain and give effect to the voters' intent to the greatest possible extent.\n\nTo determine whether a particular provision should take effect, a three-part test is employed: (1) the provision must be mechanically and grammatically severable, (2) it must be functionally severable, and (3) it must appear that the electorate would likely have adopted the provision had it foreseen the partial invalidity of the initiative. (Santa Barbara Sch. Dist. v. Superior Court, supra, 13 Cal. 3d at pp. 330-331; Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at pp. 821-822.) In the case of an initiative measure enacting a complex regulatory scheme, if part of the proposed scheme is so related to the whole that it cannot operate independently, it will fail the functional severability test. And if a provision was presented to the electorate as an indivisible part of the total package, or if the electorate's attention was not focused upon it, or if it can otherwise be concluded that the voters\n\nwould not have wanted it to operate independently, then it will fail the voter-intent test of severability.\n\nWhen an initiative measure is invalid in part, application of the three-part severability test is the established and time-tested way to ascertain and give effect to the voters' intent to the greatest possible extent. I see no reason why this test, routinely used when part of an initiative is held unconstitutional, should not also be used in the case of simultaneously enacted but conflicting initiative measures.\n\nAccepting the Constitution as it is written, though not as we might prefer it to be, this court should submit the provisions of duly enacted but conflicting initiative measures to a careful and detailed scrutiny. The voters who enacted the measures are entitled to no less. Accordingly, I would examine Proposition 68 provision by provision and would uphold any provision that is both reconcilable with Proposition 73 and severable from the irreconcilable provisions.\n\nAppendix\n\n73\n\nCampaign Funding. Contribution Limits. Prohibition of Public Funding. Initiative Statute\n\nText of Proposed Law\n\nThis initiative measure is submitted to the people in accordance with the provisions of Article II, Section 8 of the Constitution.\n\nThis initiative measure amends and adds sections to the government Code, therefore, existing sections proposed to be deleted are printed in strikeout type and new provisions proposed to be added are printed in italic type to indicate that they are new.\n\nPROPOSED LAW\n\nSECTION 1. Chapter 5 (commencing with section 85100) is added to Title 9 of the Government Code, to read:\n\nChapter 5. Limitations on Contributions\n\nArticle 1. Applicability and Definitions\n\n85100. This chapter shall be known and cited as the \" Campaign Contribution Limits Without Taxpayer Financing Amendments to the Political Reform Act.\"\n\n85101. (a) Nothing in this chapter shall affect the validity of a campaign contribution limitation in effect on the operative date of this chapter which was enacted by a local governmental agency and imposes lower contribution limitations.\n\n(b) Nothing in this chapter shall prohibit a local governmental agency from imposing lower campaign contribution limitations for candidates for elective office in its jurisdiction.\n\n85102. The following terms as used in this chapter have the following meanings:\n\n(a) \" Fiscal year \" means July 1 through June 30.\n\n(b) \" Person \" means an individual, proprietorship, firm, partnership, joint venture, syndicate, business trust, company, corporation, association, committee, and labor organization.\n\n(c) \" Political committee \" means a committee of persons who receive contributions from two or more persons and acting in concert makes contributions to candidates.\n\n(d) \" Broad based political committee \" means a committee of persons which has been in existence for more than six months, receives contributions from one hundred or more persons, and acting in concert makes contributions to five or more candidates.\n\n(e) \" Public Moneys \" has the same meaning as defined in Section 426 of the Penal Code.\n\n85103. The provisions of Section 81012 shall apply to the amendment of this chapter.\n\n85104. The provisions of this chapter shall become operative on January 1, 1989.\n\nArticle 2. Candidacy\n\n85200. Prior to the solicitation or receipt of any contribution or loan, an individual who intends to be a candidate for an elective office shall file with the commission a statement signed under penalty of perjury of intention to be a candidate for a specific office.\n\n85201. (a) Upon a filing of the statement of intention pursuant to Section 85200, the individual shall establish one campaign contribution account at an office of a financial institution located in the state.\n\n(b) Upon the establishment of an account, the name of the financial institution, the specific location, and the account number shall be filed with the commission within 24 hours.\n\n(c) All contributions or loans made to the candidate, to a person on behalf of the candidate, or to the candidate's controlled committee shall be deposited in the account.\n\n(d) Any personal funds which will be utilized to promote the election of the candidate shall be deposited in the account prior to expenditure.\n\n(e) All campaign expenditures shall be made from the account.\n\n85202. (a) A candidate may only accept contributions from persons, political committees, broad based political committees, and political parties and only in the amounts specified in Article 3 (commencing with Section 85300). A candidate shall not accept contributions from any other source.\n\n(b) All contributions deposited into the campaign account shall be deemed to be held in trust for expenses associated with the election of the candidate to the specific office for which the candidate has stated, pursuant to Section 85200, that he or she intends to seek or expenses associated with holding that office.\n\nArticle 3. Contribution Limitations\n\n85300. No public officer shall expend and no candidate shall accept any public moneys for the purpose of seeking elective office.\n\n85301. (a) No person shall make, and no candidate for elective office, or campaign treasurer, shall solicit or accept any contribution or loan which would cause the total amount contributed or loaned by that person to that candidate, including contributions or loans to all committees controlled by the candidate, to exceed one thousand dollars ($1,000) in any fiscal year.\n\n(b) The provisions of this section shall not apply to a candidate's contribution of his or her personal funds to his or her own campaign contribution account.\n\n85302. No person shall make and no political committee, broad based political committee, or political party shall solicit or accept, any contribution or loan from a person to the same political committee, broad based political committee, or political party to exceed two thousand five hundred dollars ($2,500) in any fiscal year to make contributions to candidates for elective office.\n\n85303. (a) No political committee shall make, and no candidate or campaign treasurer shall solicit or accept, any contribution or loan which would cause the total amount contributed or loaned by that committee to that candidate for elective office or any committee controlled by that candidate to exceed two thousand five hundred dollars ($2,500) in any fiscal year.\n\n(b) No broad based political committee or political party shall make and no candidate or campaign treasurer shall solicit or accept, any contribution or loan which would cause the total amount contributed or loaned by that committee or political party to that candidate or any committee controlled by that candidate to exceed five thousand dollars ($5,000) in any fiscal year.\n\n(c) Nothing in this Chapter shall limit a person's ability to provide financial or other support to one or more political committees or broad based political committees provided the support is used for purposes other than making contributions directly to candidates for elective office.\n\n85304. No candidate for elective office or committee controlled by that candidate or candidates for elective office shall transfer any contribution to any other candidate for elective office. Transfers of funds between candidates or their controlled committees are prohibited.\n\n85305. (a) This Section shall only apply to candidates who seek elective office during a special election or a special runoff election.\n\n(b) As used in this Section, the following terms have the following meanings.\n\n(1) \" Special election cycle \" means the day on which the office becomes vacant until the day of the special election.\n\n(2) \" Special runoff cycle \" means the day after the special election until the day of the special runoff election.\n\n(c) Notwithstanding Section 85301 or 85303 the following contribution limitations shall apply during special election cycles and special runoff election cycles.\n\n(1) No person shall make, and no candidate for elective office, or campaign treasurer, shall solicit or accept any contribution or loan which would cause the total amount contributed or loaned by that person to that candidate, including contributions or loans to all committees controlled by the candidate, to exceed one thousand dollars ($1,000) during any special election cycle or special runoff election cycle.\n\n(2) No political committee shall make, and no candidate or campaign treasurer shall solicit or accept, any contribution or loan which would cause the total amount contributed or loaned by that committee to that candidate for elective office or any committee controlled by that candidate to exceed two thousand five hundred dollars ($2,500) during any special election cycle or special runoff election cycle.\n\n(3) No broad based political committee or political party shall make and no candidate or campaign treasurer shall solicit or accept, any contribution or loan which would cause the total amount contributed or loaned by that committee or political party to that candidate or any committee controlled by that candidate to exceed five thousand dollars ($5,000) during any special election cycle or special runoff election cycle.\n\n85306. Any person who possesses campaign funds on the effective date of this chapter may expend these funds for any lawful purpose other than to support or oppose a candidacy for elective office.\n\n85307. The provisions of this article regarding loans shall apply to extensions of credit, but shall not apply to loans made to the candidate by a commercial lending institution in the lender's regular course of business on terms available to members of the general public for which the candidate is personally liable.\n\nArticle 4. Gifts and Honoraria\n\n85400. No elected officeholder shall accept any gift or honorarium for any speech, article, or published work on a subject relating to the governmental process from any single source which is in excess of one thousand dollars ($1,000), in any calendar year, except reimbursement for actual travel expenses and reasonable subsistence in connection therewith.\n\nSEC. 2. Section 82041.5 of the Government Code is amended to read:\n\n82041.5 \"Mass mailing\" means two hundred or more identical or nearly identical substantially similar pieces of mail, but does not include a form letter or other mail which is sent in response to a an unsolicited request, letter or other inquiry.\n\nSEC. 3. Section 89001 of the Government Code is amended to read:\n\n89001. No newsletter or other mass mailing shall be sent at public expense by or on behalf of any elected officer to any person residing within the jurisdiction from which the elected officer was elected, or to which he or she seeks election, after the elected officer has filed the nomination documents, as defined in Section 6480 of the Elections Code, for any local, state, or federal office .\n\nSEC. 4. If any provision of this act, or the application of any such provision to any person or circumstances, shall be held invalid, the remainder of this act to the extent it can be given effect, or the application of those provisions to persons or circumstances other than those as to which it is held invalid, shall not be affected thereby, and to this end the provisions of this act are severable.\n\n68\n\nLegislative Campaigns. Spending and Contribution Limits. Partial Public Funding. Initiative Statute\n\nText of Proposed Law\n\nThis initiative measure is submitted to the people in accordance with the provisions of Article II, Section 8 of the Constitution.\n\nThis initiative measure amends and adds sections to the Government Code, and repeals and adds sections to the Revenue and Taxation Code; therefore, existing provisions proposed to be deleted are printed in strikeout type and new provisions proposed to be added are printed in italic type to indicate that they are new.\n\nPROPOSED LAW\n\nSECTION 1. Chapter 5 added to Title 9 of the Government Code as follows:\n\nChapter 5. The Campaign Spending Limits Act of 1986\n\nArticle 1. Findings and Purposes\n\n85100. Title\n\nThis chapter shall be known as the Campaign Spending Limits Act of 1986.\n\n85101. Findings and Declarations\n\nThe people find and declare each of the following:\n\n(a) Monetary contributions to political campaigns are a legitimate form of participation in the American political process, but the financial strength of certain individuals or organizations should not permit them to exercise a disproportionate or controlling influence on the election of legislative candidates.\n\n(b) Campaign spending for California legislative campaigns is escalating to dangerous levels. The average legislative race cost nearly four hundred fifty thousand dollars ($450,000) in 1984. Million dollar electoral contests for seats which pay thirty-three thousand seven hundred thirty-two dollars ($33,732) a year are increasingly common.\n\n(c) The rapidly increasing costs of political campaigns have forced many legislative candidates to raise larger and larger percentages of money from statewide interest groups with a specific financial stake in matters before the Legislature. This has caused the public perception that legislators' votes are being improperly influenced by monetary contributions. This perception is undermining the credibility and integrity of the Legislature and the governmental process.\n\n(d) The average legislative candidate now raises over 90% of his or her campaign contributions from sources outside his or her own district. This has caused the growing public perception that legislators are less interested in the problems of their own constituents than the problems of wealthier statewide contributors.\n\n(e) Legislative candidates are raising less money in small contributions and more money in large individual and organizational contributions. This has created the public impression that the small contributor has an insignificant role to play in political campaigns.\n\n(f) High campaign costs are forcing legislators to spend more time on fundraising and less time on the public's business. The constant pressure to raise contributions is distracting legislators from urgent legislative matters.\n\n(g) Legislators are responding to high campaign costs by raising large amounts of money in off-election years. This fundraising distracts legislators from important public matters,\n\nencourages contributions which may have a corrupting influence and gives incumbents an unfair fundraising advantage over potential challengers.\n\n(h) Incumbents are raising far more money than challengers. In the 1984 general election, Assembly incumbents outspent their challengers by a 14-to-1 ratio and won 100% of their contests. In 1983, a non-election year, incumbent legislators raised $14.3 million while their challengers raised less than fifty thousand dollars ($50,000). In 1984, out of 100 legislative races in the primary and general elections, only two incumbents were defeated. The fundraising advantages of incumbency are diminishing electoral competition between incumbents and challengers.\n\n(i) The integrity of the legislative process, the competitiveness of campaigns and public confidence in legislative officials are all diminishing.\n\n85102. Purpose of this Chapter\n\nThe people enact this Act to accomplish the following purposes:\n\n(a) To ensure that individuals and interest groups in our society have a fair and equal opportunity to participate in the elective and legislative processes.\n\n(b) To reduce the influence of large contributors with a specific financial stake in matters before the Legislature, thus countering the perception that legislation is influenced more by the size of contributions than the merits of legislation or the best interests of the people of California.\n\n(c) To assist serious candidates in raising enough money to communicate their views and positions adequately to the public without excessive expenditures or large contributions, thereby promoting public discussion of the important issues involved in political campaigns.\n\n(d) To limit overall expenditures in legislative campaigns, thereby reducing the pressure on legislative candidates to raise large campaign war chests beyond the amount necessary to communicate reasonably with voters.\n\n(e) To provide a neutral source of campaign financing by allowing individual taxpayers voluntarily to dedicate a portion of their state taxes to defray a portion of the costs of legislative campaigns.\n\n(f) To increase the importance of in-district contributions.\n\n(g) To increase the importance of smaller contributions.\n\n(h) To eliminate off year fundraising.\n\n(i) To reduce excessive fundraising advantages of incumbents and thus encourage competition for elective office.\n\n(j) To allow candidates and legislators to spend a lesser proportion of their time on fundraising and a greater proportion of their time discussing important legislative issues.\n\n(k) To improve the disclosure of contribution sources in reasonable and effective ways.\n\n(l) To ensure that serious candidates are able to raise enough money to communicate their views and positions adequately to the public, thereby promoting public discussion of the important issues involved in political campaigns.\n\n(m) To help restore public trust in the state's legislative and electoral institutions.\n\nArticle 2. Definitions\n\n85200. Interpretation of this Chapter\n\nUnless the term is specifically defined in this chapter or the contrary is stated or clearly appears from the context, the definitions set forth in Chapter 2 (commencing with Section 82000) shall govern the interpretation of this chapter.\n\n85201. Legislative Caucus Committee\n\n\" Legislative caucus committee \" means a committee controlled by the caucus of each political party of each house of the Legislature. Each party of each house may establish only one such committee which shall not be considered to be a candidate-controlled committee. A \" legislative caucus committee \" may make contributions to any candidate running for legislative office.\n\n85202. Small Contributor Political Action Committee\n\n\" Small contributor political action committee \" means any committee which meets all of the following criteria:\n\n(a) All the contributions it receives from any person in a twelve month period total $50 or less.\n\n(b) I has been in existence at least six months.\n\n(c) It contributes to at least five candidates.\n\n(d) It is not a candidate-controlled committee.\n\n85203. Qualified Campaign Expenditure\n\n(a) \" Qualified campaign expenditure \" for legislative candidates includes all of the following:\n\n(1) Any expenditure made by a candidate for legislative office, or by a committee controlled by such a candidate, for the purpose of influencing or attempting to influence the actions of the voters for or against the election of any candidate for legislative office.\n\n(2) Any transfer of anything of value made by the legislative candidate's controlled committee to any other committee.\n\n(3) A non-monetary contribution provided at the request of or with the approval of the legislative candidate, legislative officeholder or committee controlled by the legislative candidate or legislative officeholder.\n\n(4) That portion of a slate mailing or other campaign literature produced or authorized by more than one legislative candidate which is the greater of the cost actually paid by the committee or controlled committee of the legislative candidate or the proportionate share of the cost for each such candidate. The number of legislative candidates sharing costs and the emphasis on or space devoted to each such candidate shall be considered in determining the cost attributable to each such candidate.\n\n(b) \" Qualified campaign expenditure \" does not include any payment if it is clear from the surrounding circumstances that it was not made for political purposes.\n\n85204. Two Year period\n\n\" Two-year period \" means the period commencing with January 1 of an odd-numbered year and ending with December 31 of an even-numbered year.\n\n85205. Campaign Reform Fund\n\n\" Campaign Reform Fund \" means the fund created by Section 18775 of the Revenue and Taxation Code.\n\n85206. Organization\n\n\" Organization \" means a proprietorship, labor union, firm, partnership, joint venture, syndicate, business trust, company, corporation, association or committee which has 25 or more employees, shareholders, contributors, or members.\n\nArticle 3. Contribution Limitations\n\n85300. Limitations on Contributions from Persons\n\n(a) No person shall make to any candidate for legislative office and the controlled committee of such a candidate and no such candidate and the candidate's controlled committee shall accept from each such person a contribution or contributions totaling more than one thousand dollars ($1,000) for each of the following elections in which the candidate is on the ballot or is a write-in candidate: a primary election, a general election, a special election or special runoff election.\n\n(b) No organization shall make to any candidate for legislative office and the controlled committee of such a candidate and no such candidate and the candidate's controlled committee shall accept from each such organization a contribution or contributions totaling more than two thousand five hundred dollars ($2,500) for each of the following elections in which the candidate is on the ballot or is a write-in candidate: a primary election, a general election, a special election or special runoff election.\n\n(c) No person shall make to any committee which supports or opposes any legislative candidate and no such committee shall accept from each such person a contribution or contributions totaling more than one thousand dollars ($1,000) per year.\n\n(d) No organization shall make to any committee which supports or opposes any legislative candidate and no such committee shall accept from each such organization a contribution or contributions totaling more than two thousand five hundred dollars ($2,500) per year.\n\n85301. Limitations on Contributions from Small Contributor Political Action Committees\n\n(a) No small contributor political action committee shall make to any candidate for legislative office and the controlled committee of such a candidate, and no such candidate and the candidate's controlled committee shall accept from a small contributor political action committee a contribution or contributions totaling more than five thousand dollars ($5,000) for each of the following elections in which the candidate is on the ballot or is a write-in candidate: a primary election, a general election, a special election or special runoff election.\n\n(b) No small contributor political action committee shall make to any committee supporting or opposing a legislative candidate and no such committee shall accept from a small contributor political action committee a contribution or contributions totaling more than five thousand dollars ($5,000) in a two-year period.\n\n85302. Limitations on Contributions to Political Parties and Legislative Caucus Committees\n\nNo person, including an organization or a small contributor political action committee, shall make to any political party committee supporting or opposing legislative candidates or legislative caucus, and no such party committee or legislative caucus committee shall accept from each such person a contribution or contributions totaling more than five thousand dollars ($5,000) in a two-year period.\n\n85303. Limitations on Contributions from Political Parties and Legislative Caucuses\n\nNo more than a total of fifty thousand dollars ($50,000) in the case of an Assembly candidate, and a total of seventy-five thousand dollars ($75,000) in the case of a Senate candidate, for a general election or special runoff election, shall be accepted in contributions from legislative caucus committees and political party committees by any candidate and the controlled committee of such a candidate. No legislative caucus committee or political party shall make a contribution to a legislative candidate running in a primary election or special election.\n\n85304. Seed Money\n\nThe limitations in Sections 85300 and 85301 shall not apply to contributions to a candidate for legislative office until the candidate has raised thirty-five thousand dollars ($35,000) in the election year.\n\n85305. Limitations on Contributions from Non-Individuals\n\nNo more than a total of fifth thousand dollars ($50,000) in the case of an Assembly candidate, and a total of seventy-five thousand ($75,000) in the case of a Senate candidate, for either a primary, general, special or special runoff election, shall be accepted in contributions from non-individuals by any candidate and the controlled committee of such a candidate. Contributions from political parties and legislative caucuses shall be exempt from this provision.\n\n85306. Limitations on Total Contributions from Persons\n\nNo person shall make to legislative candidates or to committees supporting legislative candidates contributions aggregating more than twenty-five thousand dollars ($25,000) in a two-year period. Contributions to and contributions from political parties and legislative caucuses shall be exempt from this provision.\n\n85307. Limitations on Total Contributions from Organizations or Small Contributor Political Action Committees\n\nNo organization or small contributor political action committee shall make to legislative candidates or to committees supporting legislative candidates contributions aggregating more than two hundred thousand dollars ($200,000) in a two-year period. Contributions from political parties and legislative caucuses shall be exempt from this section.\n\n85308. Prohibition on Transfers\n\n(a) No candidate and no committee controlled by a candidate or candidates for legislative office or controlled by a legislator or legislators, other than a legislative caucus committee or political party, shall make any contribution to a candidate running for legislative office or to any committee supporting such a candidate including a legislative caucus committee or party committee.\n\n(b) This section shall not prohibit a candidate from making a contribution from his or her own personal funds to his or her candidacy or to the candidacy of any other candidate for legislative office.\n\n85309. Prohibition on Off Year Contributions\n\n(a) No legislative candidate or legislator or any controlled committee of such a candidate or legislator shall accept any contribution in any year other than the year in which the legislative candidate or legislator is listed on the ballot as a candidate for legislative office.\n\n(b) No legislative caucus committee or political party committee supporting or opposing legislative candidates shall accept any contribution in an odd-numbered year.\n\n85310. Limitations on payments of Gifts and Honoraria\n\nNo legislator or legislative candidate and any fund controlled by such a person shall receive more than two thousand dollars ($2,000) in honoraria and gifts in a two-year period from any person other than a member of the candidate's family as specified in Section 82030(b)(9).\n\n85311. Return of Contributions\n\nA contribution shall not be considered received if it is not negotiated, deposited, or utilized, and in addition it is returned to the donor within fourteen (14) days of receipt.\n\n85312. Aggregation of Payments\n\nFor purposes of the contribution limitations in Sections 85300-85307, inclusive, and Section 85310, the following shall apply:\n\n(a) All payments made by a person, organization or small contributor political action committee whose contributions or expenditure activity is financed, maintained or controlled by any business entity, labor organization, association, political party or any other person or committee, including any parent, subsidiary, branch, division, department or local unit of the business entity, labor organization, association, political party or any other person, or by any group of such persons shall be considered to be made by a single person, committee or small contributor political action committee.\n\n(b) Two or more entities shall be treated as one person when any of the following circumstances apply:\n\n(1) The entities share the majority of members of their boards of directors.\n\n(2) The entities share two or more officers.\n\n(3) The entities are owned or controlled by the same majority shareholder or shareholders.\n\n(4) The entities are in a parent-subsidiary relationship.\n\n(c) An individual and any general partnership in which the individual is a partner, or an individual and any corporation in which the individual owns a controlling interest, shall be treated as one person.\n\n(d) No committee which supports or opposes a candidate for legislative office shall have as officers individuals who serve as officers on any other committee which supports or opposes the same candidate. no such committee shall act in concert with, or solicit or make contributions on behalf of, any other committee. This subdivision shall not apply to treasurers of committees if these treasurers do not participate in or control in any way a decision on which legislative candidate or candidates receive contributions.\n\n85312. Loans\n\n(a) A loan shall be considered a contribution from the maker and the guarantor of the loan and shall be subject to the contribution limitations of this chapter.\n\n(b) Every loan to a candidate or the candidate's controlled committee shall be by written agreement and shall be filed with the candidate's or committee's campaign statement on which the loan is first reported.\n\n(c) The proceeds of a loan made to a candidate by a commercial lending institution in the regular course of business on the same terms available to members of the public and which is secured or guaranteed shall not be subjected to the contribution limits of this chapter.\n\n(d) Extensions of credit (other than loans pursuant to subdivision (c) for a period of more than thirty (30) days are subject to the contribution limitations of this chapter.\n\n85314. Family Contributions\n\n(a) Contributions of a husband and wife shall be treated as separate contributions and shall not be aggregated.\n\n(b) Contributions by children under 18 shall be treated as contributions by their parents and attributed proportionately to each parent (one-half to each parent or the total amount to a single custodial parent).\n\n85315. Candidate for Statewide of Local Office\n\nThe contribution limitations shall not apply to any contributions to a candidate for legislative office where such contributions are made to support the candidate's campaign for a specifically named statewide or local elective office, and all of the following conditions are met:\n\n(a) The candidate specifically names the non-legislative office being sought.\n\n(b) A separate committee and account for the non-legislative office being sought shall be established for the receipt of all contributions and the making of all expenditures in connection with the non-legislative office.\n\n(c) The contributions to be exempted from the contribution limitations in this chapter are made directly to this separate committee's account.\n\n(d) No expenditures from such an account shall be made top support the legislative candidate's campaign, or any other candidate's campaign for legislative office.\n\n85316. One Campaign Committee and One Checking Account per Candidate\n\nA legislative candidate shall have no more than one campaign committee and one checking account out of which all expenditures shall be made. This section shall not prohibit the establishment of savings accounts, but no qualified campaign expenditures shall be made out of these accounts.\n\n85317. Time Periods for Primary Contributions and General Election Contributions\n\nFor purposes of the contribution limitations, contributions made at any time before July 1 of the election year shall be considered primary contributions, and contributions made from July until December 31 of the election year shall be considered general election contributions. Contributions made at any time after the seat has become vacant and up through the date of the election shall be considered contributions in a special election, and contributions made after the special election and up through fifty-eight (58) days after the special runoff election shall be considered contributions in a special runoff election.\n\nArticle 4. Expenditure Limitations\n\n85400. Expenditure Limitations for Assembly Candidates\n\nNo candidate for State Assembly who files a statement of acceptance of financing from the Campaign Reform Fund and any controlled committee of such a candidate shall make qualified campaign expenditures above the following amounts:\n\n(a) One hundred fifty thousand dollars ($150,000) in a primary election.\n\n(b) Two hundred twenty-five thousand dollars ($225,000) in a general, special, or special runoff election.\n\n85401. Expenditure Limitations for State Senate Candidates\n\nNo candidate for State Senate who files a statement of acceptance of financing from the Campaign Reform Fund and any controlled committee of such a candidate shall make qualified campaign expenditures above the following amounts:\n\n(a) Two hundred fifty thousand dollars ($250,000) in a primary election.\n\n(b) Three hundred fifty thousand ($350,000) in a general, special or special runoff election.\n\n85402. Expenditure Limitations Lifted -- Primary Elections\n\nIn the primary election, if a candidate who declines to accept payments from the Campaign Reform Fund receives contributions or makes qualified campaign expenditures in excess of the expenditure limits, or if an independent committee or committees spend more than fifty thousand dollars ($50,000) in support of, or in opposition to any legislative candidate, the expenditure limitation shall no longer be applicable to all candidates who seek the party nomination for the same seat. In addition, each candidate, other than the candidate who exceeded the expenditure limits, shall be permitted to receive an additional thirty-five thousand dollars ($35,000) free of contribution limitations, in accordance with Section 85304.\n\n85403. Expenditure Limitations Lifted -- Non Primary Elections\n\nIn the general, special or special runoff election, if a candidate who declines to accept payments from the Campaign Reform Fund receives contributions or makes qualified campaign expenditures in excess of the expenditure limits, or if an independent expenditure committee or committees spend more than fifty thousand dollars ($50,000) in support of or in opposition to any legislative candidate, the expenditure limitations shall no longer be applicable to all candidates running for the same seat in the general, special, or special runoff election. In addition, each candidate, other than the candidate who exceeded the expenditure limits, shall be permitted to receive an additional thirty-five thousand dollars ($35,000) free of contribution limitations, in accordance with Section 85304.\n\n85404. Notification by Candidate Who Exceeds Expenditure Limitations\n\nA candidate who has declined to accept payments from the Campaign Reform Fund and receives contributions or spends an amount over the expenditure limitations shall notify all opponents and the Commission by telephone and by confirming telegram the day the limitations are exceeded.\n\n85405. Time Periods for Primary Election Expenditures and General Election Expenditures\n\nFor purposes of the expenditure limitations, qualified campaign expenditures made at any time before June 30 of the election year shall be considered primary election expenditures, and qualified campaign expenditures made from July 1 until December 31 of the election year shall be considered general election expenditures. Qualified campaign expenditures made at any time after the seat has become vacant and up through the date of the election shall be considered expenditures in a special election, and qualified campaign expenditures made after the special election and up though 58 days after the special runoff election shall be considered expenditures in a special runoff election. However, in the event that payments are made but the goods or services are not used during the period purchased, the payments shall be considered qualified campaign expenditures for the time period when they are used. Payments for goods or services used in both time periods shall be prorated.\n\nArticle 5. Campaign Reform Fund\n\n85500. Candidate Acceptance or Rejection of Funds\n\nEach candidate for legislative office, at the time of filing his or her Declaration of Candidacy shall file a statement of acceptance or rejection of financing from the Campaign Reform Fund. If a candidate agrees to accept financing from the Campaign Reform Fund, the candidate shall comply with the provisions of Article 4 of this Act. A candidate who agrees to accept financing from the Campaign Reform Fund may not change that decision. A candidate who does not agree to accept such financing shall notify all opponents and the Commission by telegram on the day such a candidate raises, spends or has cash on hand of more than thirty-five thousand dollars ($35,000).\n\n85501. Qualification Requirements.\n\nIn order to qualify to receive payments from the Campaign Reform Fund, a candidate shall meet all the following requirements:\n\n(a) The candidate has received contributions (other than contributions from the candidate or his or her immediate family) of at least twenty thousand dollars ($20,000) in contributions of\n\none thousand dollars ($1,000) or less if running for the Assembly, or at least thirty thousand dollars ($30,000) in contributions of one thousand dollars ($1,000) or less if running for the Senate. only contributions received on or after January 1 of the election year or, if a special election, after the Declaration of Candidacy is filed, may be counted for the above threshold. For purposes of this subsection, a loan, a pledge or a non-monetary contribution shall not be considered a contribution.\n\n(b) In the primary election, the candidate is opposed by a candidate running for the same nomination who has qualified for payments from the Campaign Reform Fund or has raised, spent or has cash on hand of at least thirty-five thousand dollars ($35,000).\n\n(c) In the general election, the candidate is opposed by a candidate who has qualified for payments from the Campaign Reform Fund or has raised, spent or has cash on hand of at least thirty-five thousand dollars ($35,000).\n\n(d) The candidate contributes no more than fifty thousand dollars ($50,000) per election from his or her personal funds to the legislative campaign.\n\n85502. Campaign Reform Fund Formula\n\nA candidate who is eligible to receive payments from the Campaign Reform Fund shall receive payments on the basis of the following formulas:\n\n(a) For a contribution or contributions (other than a contribution from the candidate or his or her immediate family) totaling two hundred and fifty dollars ($250) or under from a single source received on or after January 1 of the election year or, if a special election, after the Declaration of Candidacy is file, a matching ratio of three dollars ($3) from the Campaign Reform Fund for each dollar received.\n\n(b) For a contribution or contributions (other than a contribution from the candidate or his or her immediate family) totaling two hundred and fifty ($250) or under from an individual who is a registered voter in the candidate's district and whose contribution is made on or after January 1 of the election year or, if a special election, after the candidate's Declaration of Candidacy is filed, a matching ratio of five dollars ($5) from the Campaign Reform Fund for each dollar received.\n\n(c) For purposes of this section, a loan, a pledge or a non-monetary payment shall not be considered a contribution.\n\n85503. Candidate Request for Payment\n\nThe Commission shall determine the information needed to be submitted to qualify for payment from the Campaign Reform Fund. A candidate may not request less than ten thousand dollars ($10,000) in payments at any one time from the Campaign Reform Fund; provided however, that in the 14 days preceding an election, a candidate may not request less than two thousand five hundred ($2,500) in such payments.\n\n85504. Maximum Funds Available to Candidate\n\nNo candidate shall receive payments from the Campaign Reform Fund in excess of the following amounts:\n\n(a) For an Assembly candidate, seventy-five thousand dollars ($75,000) in the primary election and one hundred twelve thousand five hundred dollars ($112,500) in the general, special or special runoff election .\n\n(b) For a Senate candidate, one hundred twenty-five thousand dollars ($125,000) in the primary election and one hundred seventy-five thousand ($175,000) in the general, special or special runoff election.\n\n85505. Timing of Payments to Candidates\n\nThe Controller shall make payments from the Campaign Reform Fund in the amount certified by the Commission. Payments shall be made no later than 3 business days after receipt of the request by the candidate. If the Commission determines the money in the Campaign Reform Fund is not, or may not be, sufficient to satisfy the full entitlements of the eligible candidates, the Commission shall notify the Controller to withhold sufficient amounts as may be necessary to assure that the eligible candidates will receive a pro rata share of the entitlements. The amount withheld shall be paid when the Commission determines that there is sufficient money\n\nin the Fund to pay the amounts or portions of the amounts. No payments shall be made from any source other than the Campaign Reform Fund.\n\n85506. Surplus Funds\n\n(a) Surplus funds remaining after all obligations are met by the candidate shall be returned to the Campaign Reform Fund after the general election based on a ratio of the public funds received by a candidate compared to the private funds raised by the candidate for each election.\n\n(b) A legislative candidate who has more than one hundred thousand dollars ($100,000) in surplus funds after he or she complies with subdivision (a) shall either return all funds over one hundred thousand dollars ($100,000) to his or her contributors on a pro rata basis or shall donate the surplus over one hundred thousand dollars ($100,000) to the Campaign Reform Fund.\n\nArticle 6. Independent Expenditures\n\n85600. Independent Expenditures for Mass Mailings\n\n(a) Any person who makes independent expenditures for a mass mailing which supports or opposes any candidate for legislative office shall put the following statement on the mailing:\n\nNOTICE TO VOTERS\n\n(Required by State Law)\n\nThis mailing is not authorized or approved by any legislative candidate or election official.\n\nIt is paid for by ___ (name)\n\n___ (Address, City, State)\n\n(b) The statement required by this section shall appear on the envelope and on each page or fold of the mass mailing in at least 10-point type, not subject to the half-tone or screening process, and in a printed or drawn box set apart from any other printed matter.\n\n85601. Contribution Limitations\n\nAny person who makes independent expenditures supporting or opposing a legislative candidate shall not accept any contribution in excess of the amounts set forth in Section 85300(c) and (d).\n\n85602. Limitations on Persons Who Make Independent Expenditures and Contributions to Candidates\n\nAny person who makes a contribution of one hundred dollars ($100) or more to a candidate for legislative office shall be considered to be acting in concert with that candidate and shall not make independent expenditures and contributions in excess of the amounts set forth in Sections 85300 and 85301 in support of that candidate or in opposition to that candidate's opponent.\n\n85603. Reproduction of Materials\n\nAny person who reproduces, broadcasts of distributes any material which is drafter, printed, prepared or previously broadcast by a legislative candidate or a committee controlled by such a candidate shall report such an expenditure as a non-monetary contribution to such candidate or committee.\n\n85604. Notice of Independent Expenditures\n\nAny person who makes independent expenditures of more than ten thousand dollars ($10,000) in support of or in opposition to any legislative candidate shall notify the Commission and all candidates in that legislative district by telegram each time this threshold is met.\n\nArticle 7. Agency Responsibilities\n\n85700. Duties of the Fair Political Practices Commission\n\nThe Fair Political Practices Commission, in addition to its responsibilities set forth in Sections 83100 et seq., shall also:\n\n(a) Adjust the expenditure limitations, contribution limitations and public financing provisions in January of every even-numbered year to reflect any increase or decrease in the Consumer Price Index. Such adjustments shall be rounded off to the nearest hundred for the limitations on contributions and the nearest thousand for the limitations on expenditures and the public financing provisions.\n\n(b) Prescribe the necessary forms for filing the appropriate statements.\n\n(c) Verify the requests for payment for Campaign Reform Funds.\n\n(d) Prepare and release studies on the impact of this title. These studies shall include legislative recommendations which further the purposes of this title.\n\n85701. Duties of the Franchise Tax Board\n\nThe Franchise Tax Board shall audit each candidate who has received payments from the Campaign Reform Fund in accordance with the procedures set forth in Sections 90000 et seq.\n\nSECTION 2. Chapter 18.6 (Commencing with Section 18755) is added to Part 10 of Division 2 of the Revenue and Taxation Code, to read:\n\nChapter 18.6. Campaign Reform Fund Designation\n\n18775. Tax Checkoff\n\nEvery individual whose income tax liability for any taxable year is three dollars ($3) or more may designate an amount up to three dollars ($3) of that tax liability to be deposited into the Campaign Reform Fund. In the case of a joint return of husband and wife having an income tax liability of six dollars ($6) or more, each spouse may designate that an amount up to three dollars ($3) of that tax liability shall be paid to the Fund. Taxpayer designations of funds shall not increase that taxpayer's tax liability. Money in this Fund shall be available for distribution in accordance with the provisions of Chapter 5 of Title 9, commencing with Section 85100 of the Government Code. The Franchise Tax Board shall place on the top third of the first pate of all personal tax returns required to be filed on or after January 1, 1987, the following language:\n\nDo you want $3 of the taxes you are\n\nalready paying to go to this Fund?\n\nCAMPAIGN [ ] YES [ ] NO\n\nREFORM If joint return, does your spouse\n\nFUND want $3 to go to this fund?\n\n[ ] YES [ ] NO\n\nNOTE: Checking \"YES\" will not increase the taxes\n\nyou pay or reduce your refund.\n\n18776. Return of Surplus Money in Campaign Reform Fund\n\nAll money over $1 million, adjusted for cost of living changes, remaining in the Campaign Reform Fund as of January 31 in the year following a general election shall be refunded to the General Fund.\n\nSECTION 3. Section 17245 of the Revenue and Taxation Code (which currently reads as follows) is repealed:\n\n17245. In computing taxable income there shall be allowed as a deduction political contributions by any person in excess of one hundred dollars ($100) (two hundred dollars ($200) on a joint return) in any year; except that no deduction shall be allowed for contributions which are designated pursuant to Section 19720.\n\nSECTION 4. Section 83122.5 is added to the Government Code to read:\n\n83122.5. Appropriation to Fair Political Practices Commission\n\nThere is hereby appropriated from the Campaign Reform Fund to the Fair Political Practices Commission a sum of five hundred thousand dollars ($500,000), adjusted for cost of living changes, during each fiscal year, for expenditures to support the operations of the Commission to carry out its responsibilities pursuant to the Campaign Spending Limits Act of 1986. The expenditure of funds under this appropriation shall be subject to the normal administrative review given to other state appropriations. The Legislature shall appropriate additional amounts to the Commission and other agencies as may be necessary to carry out the provisions of this title.\n\nSECTION 5. Section 91000 of the Government Code is amended to read:\n\n91000. Violations; Criminal\n\n(a) Any violation of Chapter 5 of this title commencing with Section 85100 is a public offense punishable by imprisonment in a state prison or in a county jail for a period not exceeding one year.\n\n(a) Any person who knowingly of willfully violates any provision of this title is guilty of a misdemeanor.\n\n(b) Any violation of any other section of this title is a misdemeanor.\n\n(b)\n\n(c) In addition to other penalties provided by law, a fine of up to the greater of ten thousand dollars ($10,000) or three times the amount the person failed to report properly or unlawfully contributed, expended, gave or received may be imposed upon conviction for of each violation.\n\n(c)\n\n(d) Prosecution for violation of this title must be commenced within four years after the date on which the violation occurred occured.\n\nSECTION 6. Section 91005 of the Government Code is amended to read:\n\n91005. Civil Liability for Violations\n\n(a) Any person who makes or receives a contribution, payment, gift or expenditure in violation of Section 84300, 84304, 85300, 85301, 85302, 85303, 85305, 85306, 85307, 85308, 85309, 85310, 85400, 85401, 85405, 85500, 85501, 95502, 85504, 85506, 85600, 85601, 85602, 85603, 84604, 86202, 86203 or 86204 is liable in a civil action brought by the civil prosecutor or by a person residing within the jurisdiction for an amount up to five hundred dollars ($500) one thousand dollars ($1,000) or three times the amount of the unlawful contribution, gift or expenditure, whichever is greater.\n\n(b) Any designated employee or public official specified in section 87200, other than an elected state officer, who realizes an economic benefit as a result of a violation of Section 87100 or of a disqualification provision of a Conflict of Interest Code is liable in a civil action brought by the civil prosecutor or by a person residing within the jurisdiction for an amount up to three times the value of the benefit.\n\nSECTION 7. Section 83116 of the Government Code is amended to read:\n\n83116. Violation of Title\n\nWhen the Commission determines there is probable cause for believing this title has been violated, it may hold a hearing to determine if such a violation has occurred. Notice shall be given and the hearing conducted in accordance with the Administrative Procedure Act (Government Code, Title 2, Division 3, Part \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e I, Chapter 5, Sections 11500 et seq.). The Commission shall have all the powers granted by that chapter.\n\nWhen the commission determines on the basis of the hearing that a violation has occurred, it shall issue an order which may require the violator to:\n\n(a) Cease and desist violation of this title;\n\n(b) File any reports, statements or other documents or information required by this title; and\n\n(c) Pay a monetary penalty of up to two thousand dollars ($2,000) for each violation to the General Fund of the state.\n\nWhen the Commission determines that no violation has occurred, it shall publish a declaration so stating.\n\nSECTION 8. Section 84106 is added to the Government Code to read:\n\n84106. Identification of Committees\n\nThe name of any committee shall include or be accompanied by the name of any individual, entity or other person by which the committee is controlled. Any committee required to file a statement of organization shall amend its statement to comply with this section within 30 days of the effective date of this Act.\n\nSECTION 9. Section 84302.5 is added to the Government Code to read:\n\n84302.5. Definition of Intermediary\n\nA person is an intermediary for transmittal of a contribution if he or she delivers to a candidate or committee a contribution from another person unless such contribution is from the person's employer, immediate family or an association to which the person belongs. No person who is the treasurer of the committee to which the contribution is made or is the candidate who controls the committee to which the contribution is made shall be an intermediary for such a contribution.\n\nSECTION 10. Severability Clause\n\nIf any provision of this Act or the application thereof to any person or circumstances is held invalid, the remainder of this Act, to the extent it can be given effect, or the application of those provisions to persons or circumstances other than those as to which it was held invalid, shall not be affected thereby, and to this end, the provisions of this Act are severable.\n\nSECTION 11. Legislative Amendments\n\nThe provisions of Section 81012 of the government Code which allow legislative amendments to the Political Reform Act of 1974 shall apply to the provisions of this measure.\n\nSECTION 12. Construction\n\nThis measure shall be liberally construed to accomplish its purposes.\n\nSECTION 13. Effective Date\n\nThe provisions of this measure shall go into effect January 1, 1987, except that Section 2 shall go into effect immediately.\n\n\u003cspan class=\"fn\"\u003e* Presiding Justice, Court of Appeal, Second Appellate District, Division Four, assigned by the Chairperson of the Judicial Council.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. References to constitutional provisions are to the California Constitution. Sections 3, subdivision (d) of article XI and 4 of article XVIII make the same rule applicable to city and county charters and to constitutional amendments. Each specifies: \". . . If provisions of 2 or more measures approved at the same election conflict, those of the measure receiving the highest affirmative vote shall prevail.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. All code and statutory references are to the Government Code and its provisions unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. For clarity, we adopt the designation used by the Court of Appeal to differentiate sections to be added by Propositions 68 and 73, prefacing the section with the number of the proposition of which it was a part. The Court of Appeal ordered enforcement of all of the provisions the FPPC had concluded were valid and enforceable, and, in addition, ordered enforcement of sections 68:85309, 68:85305-85307, 68:85311, 68:85313, subdivisions (a) and (b), 68:85317, 68:91000, 68:91005, and, as limited and modified, 68:85312. The court also held that various statements of purpose, findings and declarations, and definitions in Proposition 68 were valid and enforceable. (§§ 68:85101, subds. (a), (c), (d), (e), (g) \u0026 (i), 68:85102, subds. (a), (b), (f), (g), (h), (i), (k) \u0026 (m), 68:85204, \u0026 68:85205.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Although the FPPC agreed that the Court of Appeal had applied proper standards, and disputes only the conclusions reached by the Court of Appeal under those standards, the issue has been fully briefed by amici curiae. Notice that the issue would be considered was given pursuant to rule 29.2 of the California Rules of Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Because official statements made to the voters about propositions they are asked to approve or reject may assist the court in ascertaining the voters' probable understanding of the measure or measures (see San Diego Coast Regional Com. v. See The Sea, Limited (1973) 9 Cal. 3d 888, 891 [109 Cal. Rptr. 377, 513 P.2d 129]), we set out the analyses of both propositions at length, omitting the \"Fiscal Effect\" portions thereof.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Illustrative of the provisions bearing identical numbers in the proposed article 1 of each measure are sections: 68:85100 [title] and 73:85100 [title], 68:85101 [findings and declarations] and 73:85101 [preserve, and permit more restrictive, local contribution limits], and 68:85102 [statement of purpose] and 73:85102 [definitions]. The proposed article 2, headed \"Definitions,\" of Proposition 68 included sections 68:85200 through 68:85206, which established rules for interpretation and definitions of terms used elsewhere. Article 2 in Proposition 73 proposed to add sections 73:85200 through 73:85202, all relevant to the article's subject heading \"Candidacy.\" Section 68:85300, the first provision in article 3 [\"Contribution Limitations\"], governed \"Limitations on Contributions from Persons,\" but section 73:85300, also part of an article 3 [\"Contribution Limitations\"] prohibited expenditure of and acceptance of \"public moneys for the purpose of seeking elective office.\" Proposition 68 also set forth in article 3 sections 68:85301 through 68:85317, whereas article 3 of Proposition 73 proposed additional sections 73:85301 through 73:85307, none of which mirrored the similarly numbered provisions of Proposition 68.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The record indicates that with 99 percent of the votes counted, 5,258,951 voters expressed a view on Proposition 73. Of those votes, 3,049,349 (58 percent) were affirmative, and 2,209,602 (42 percent) were negative. A total of 5,148,881 voters expressed a view on Proposition 68. Of those votes, 2,720,605 (53 percent) were affirmative and 2,428,276 (47 percent) were negative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Court of Appeal used this term to explain its conclusion that the failure of Proposition 73 to fix contribution and spending limits (other than the $2,500 individual contribution limits of section 73:85302) did not reflect an intent that candidates be \"entitled\" to unlimited contributions and spending. The FPPC argues that the omission of such limits in Proposition 73 may reasonably be understood to reflect deference to candidates' First Amendment right to unlimited and unimpeded political expression (see Buckley v. Valeo, supra, 424 U.S. 1), and does not claim that an \"entitlement\" to unlimited contributions and spending was created. It argues instead that, absent provisions for public spending, imposition of the Proposition 68 limits would contravene that constitutional right. It is for this reason that the FPPC concluded and now argues that the Proposition 68 limits irreconcilably conflict with the contributions permitted under Proposition 73.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Court of Appeal did not address an argument made by amicus curiae Institute of Governmental Advocates that imprisonment as a felon for a strict liability offense was constitutionally impermissible. Amicus curiae argued that the threat of such draconian punishment would chill fundamental First Amendment rights. The FPPC, while taking no position on this issue, urges the court to resolve it. Neither this court nor the United States Supreme Court has yet attempted to define the constitutional due process or Eighth-Amendment-based limits on punishment for strict liability regulatory crimes. (See Morissette v. United States (1952) 342 U.S. 246 [96 L.Ed. 288, 72 S.Ct. 240]; People v. Olsen (1984) 36 Cal. 3d 638, 649 [205 Cal. Rptr. 492, 685 P.2d 52] [conc. and dis. opn. of Grodin, J.].) We need not do so here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The motive or purpose of the drafters of a statute is not relevant to its construction, absent reason to conclude that the body which adopted the statute was aware of that purpose and believed the language of the proposal would accomplish it. (See California Teachers Assn. v. San Diego Community College Dist. (1981) 28 Cal. 3d 692, 699-700 [170 Cal. Rptr. 817, 621 P.2d 856]; In re Marriage of Bouquet (1976) 16 Cal. 3d 583, 589-590 [128 Cal. Rptr. 427, 546 P.2d 1371].) The opinion of drafters or of legislators who sponsor an initiative is not relevant since such opinion does not represent the intent of the electorate and we cannot say with assurance that the voters were aware of the drafters' intent. (Lungren v. Deukmejian (1988) 45 Cal. 3d 727, 743 [248 Cal. Rptr. 115, 755 P.2d 299]; People v. Castro (1985) 38 Cal. 3d 301, 311-312 [211 Cal. Rptr. 719, 696 P.2d 111].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The 1879 Constitution as originally adopted had also provided for presentation of alternative city charter provisions to the electorate by the drafters. Article XI, former section 8, then specified: \"In submitting any such charter, or amendment thereto, any alternative article or proposition may be presented for the choice of the voters, and may be voted on separately without prejudice to others.\" The 1913 version of article XI, former section 8, was construed in Horn v. Allen (1924) 195 Cal. 121 [231 P. 1001] to permit the submission of a city charter to the voters with an alternative provision on the same ballot to allow the voters to decide between the at-large election of councilmembers called for by the proposed charter and the district election called for by the alternative proposition, and to mandate that the conflicting alternative provision become effective if it received an affirmative vote even though the affirmative vote for the charter itself was greater.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. We hold only that under section 10(b) an initiative is inoperative in its entirety if the voters adopt, by a higher vote, an alternative comprehensive regulatory scheme governing the same subject. Our construction of section 10(b) does not foreclose operation of an initiative measure that receives an affirmative vote simply because one or more minor provisions happen to conflict with those of another initiative principally addressed to other aspects of the same general subject. In the latter circumstance, if the principal purpose of the initiative can be accomplished notwithstanding the excision of the minor, incidental conflicting provisions, the remainder of the initiative can be given effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The United States District Court has recently restrained enforcement of the Proposition 73 restrictions on campaign contributions and transfers thereof. (Service Employees v. Fair Political Practices (E.D.Cal. 1990) 747 F.Supp. 580.) That decision is not final, however, and does not invalidate the remainder of Proposition 73. For that reason, we need not decide in this proceeding whether an initiative measure that has no effect at the time it is adopted because it is superseded by another measure adopted by a larger vote at the same election becomes effective if the latter is subsequently invalidated. (Cf. Corning Hospital District v. Superior Court (1962) 57 Cal. 2d 488, 494 [20 Cal. Rptr. 621, 370 P.2d 325].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. In the case of two simple initiatives dealing with an easily understandable issue, the conflict may be clear even if not underscored in the ballot arguments. Not so, however, when the words of either the target or the Trojan horse initiative, or the subject matter itself, are difficult for most voters to understand. Examples would be initiatives that deal with voir dire examination, the rule against perpetuities or other arcane legal principles.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The majority suggest that the answer to abuses of the initiative process is \"presentation at a subsequent election of a new initiative measure which the voters can consider in light of the scheme established by the measure that prevailed in the earlier election.\" (Maj. opn., ante, p. 769.) Perhaps so, if the competing initiatives clearly offer themselves as alternatives; but if one is a Trojan horse, we may later wish to apply a different rule. In any event I read the quoted words as precatory and not necessarily applicable in the case of an initiative designed only to torpedo another without the electorate's awareness. 1a This court recently admonished administrative agencies that when a statute requires the performance of a task, the difficulty of the task does not excuse or exempt the agency from full performance. (Laurel Heights Improvement Assn. v. Regents of University of California (1988) 47 Cal. 3d 376, 399 [253 Cal. Rptr. 426, 764 P.2d 278].) When the state Constitution requires courts to perform a task, such as a provision-by-provision analysis of a ballot measure, it is equally true that the difficulty of the task is not a legitimate or acceptable excuse for nonperformance. 2a This distinction appears even more strikingly in the wording of the provision as originally enacted in 1911: \"If any provision or provisions of two or more measures, approved by the electors at the same election, conflict, the provision or provisions of the measure receiving the highest affirmative vote shall prevail.\" (Cal. Const., former art. IV, § 1; Stats. 1911, ch. 22, § 1, p. 1657.) The change from the former to the present wording, as part of the 1970 constitutional revision, was not intended to alter the provision's meaning. (See Cal. Const. Revision Com., Proposed Revision (1966) p. 47.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3.a The power of direct legislation through the initiative was first exercised in California by voters of charter cities. A constitutional amendment permitting home-rule cities to amend their charters through the initiative process had been ratified in 1902. (Key \u0026 Crouch, The Initiative and the Referendum in California (1939) p. 428.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4.a As of this writing, the point raised in the text is of more than academic concern, since a federal district court has ruled that Proposition 73's contribution limits are invalid as violative of the federal Constitution. (Service Employees v. Fair Political Practices (E.D.Cal. 1990) 747 F.Supp. 580.) The decision is not yet final and an appeal seems likely. The validity of Proposition 73 was not challenged and is not at issue in the proceeding before this court.\u003c/span\u003e\n\n",
    "body_length": 150736,
    "citedas": [
      "51 Cal. 3d 744",
      "799 P.2d 1220",
      "274 Cal. Rptr. 787"
    ],
    "attorneys": "Munger, Tolles \u0026 Olson, Bradley S. Phillips and Mark H. Epstein for Petitioner. Diane M. Griffiths, Kathryn E. Donovan, Margaret Ellison, Jeevan Ahiya and Scott Hallabrin for Respondent. Olson, Connelly, Hagel \u0026 Fong, Lance H. Olson, George Waters, Ball, Hunt, Hart, Brown \u0026 Baerwitz, Allan E. Tebbetts, Judith F. Burkey, Albert W. Gieseman, Jr., Michael R. Overly, Nielsen, Merksamer, Hodgson, Parrinello \u0026 Mueller, Vigo G. Nielsen, Louise J. Rosen-Garcia, John E. Mueller, Charles H. Bell, Jr., Judy S. Davis, Manatt, Phelps, Rothenberg \u0026 Phillips, Philip R. Recht, Remcho, Johansen \u0026 Purcell, Joseph Remcho, Robin B. Johansen, Lowell Finley, Charles C. Marson, Kopp \u0026 Di Franco, Quentin L. Kopp and Ross Johnson as Amici Curiae on behalf of Respondent.",
    "category": [
      "124"
    ],
    "judges": "Opinion by Eagleson, J., with Lucas, C. J., Panelli, J., and Woods (Arleigh M.), J.,*fn* concurring. Separate concurring and dissenting opinion by Mosk, J. Separate dissenting opinion by Kennard, J., with Broussard, J., concurring.",
    "citation_count": 1
  }
}
