{
  "id": "HbTdTGYBTlTomsSBYQ1c",
  "document": {
    "title": "04/01/80 PEOPLE v. DAVIS",
    "full_title": "PEOPLE v. DAVIS",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1980-04-01T00:00:00.000Z",
    "docket": "Docket No. 60034",
    "body": "Rudy Davis, a Detroit police officer, was charged with conspiracy to obstruct Justice and with omitting his duty for a reward in failing to arrest a narcotics dealer found in possession of narcotics. Two co-defendant police officers were acquitted by a jury in Recorder's Court of Detroit, Justin C. Ravitz, J., of related charges. Defendant Davis was convicted of conspiracy to obstruct Justice. The Court of Appeals, V. J. Brennan, P.J., and J. H. Gillis and D. C. Riley, JJ., reversed in an unpublished opinion, holding that \"Wharton's Rule\", that an agreement by two persons to commit a substantive crime cannot be prosecuted as a conspiracy when the substantive crime requires the participation of two persons, precluded the defendant's conviction (Docket No. 21900). The people appeal.\n\nIn opinions by Chief Justice Coleman, Justice Kavanagh, and Justice Levin, Justice Moody Dissenting, the Supreme Court held that Wharton's Rule applies to prevent the conviction of the defendant in this case of conspiracy to obstruct Justice because the substantive crime charged, agreement to omit duty for a reward, required the participation of the same two persons charged to have conspired.\n\nChief Justice Coleman, joined by Justice Fitzgerald, wrote that Wharton's Rule is applicable in this case to prohibit the use of a conviction of conspiracy to obstruct Justice as a method of circumventing the punishment specifically provided by the Legislature for the activity of the defendant.\n\n1. The prosecutor argues that a police officer's failure to arrest a felon for a corrupt motive is an obstruction of Justice, that the allegations in the indictment that the officer agreed to fail to arrest in exchange for money were not a necessary element of the offense charged but a superfluous explanation of the corrupt motive and the means by which the obstruction was to be accomplished, and that Wharton's Rule does not apply because the offense of obstruction of Justice does not logically require a plurality of agents to commit it. Even assuming, arguendo, that the prosecutor's description of the common-law offense of obstruction of Justice is accurate, the allegation in the indictment that the officer agreed to omit his duty for a reward cannot be ignored. That allegation necessarily entails a receipt by the officer of a promise of a reward as consideration for his failure to arrest, and sets forth all the elements of the statutory offense of omission by a police officer of duty for a reward. Since the Legislature has expressly provided for the punishment of an officer for that conduct, it is not punishable as an offense \"for the punishment of which no provision is expressly made by any statute of this state\".\n\n2. Wharton's Rule is that when the law says a combination between two persons to effect a particular end shall be called, if the end be effected, by a certain name, it is not lawful for the prosecution to call it by some other name; and when the law says that such an offense shall have a certain punishment, it is not lawful for the prosecution to evade this limitation by indicting the offense as a conspiracy. The Legislature has designated the appropriate statute for charging and punishing an officer who receives a promise as consideration for failing to perform a duty. The receipt of the promise as consideration is a substantive offense under that statute, and the prosecutor has not shown any reason to justify a conviction in this case under any other statutory provision.\n\n3. The statute applies only to defendant Davis and not to the narcotics dealer. However, the dealer's conduct in promising any gratuity whatever to Davis to influence his decision to omit his duty was unlawful under another section of the statute concerning the offense of bribery. The Conclusion that Wharton's Rule is inapplicable because one of the parties necessary for the commission of the offense is not subject to prosecution under the same section for his activity is not justified. That would be a distinction without a difference.\n\n4. Because the Legislature has established express provisions punishing these activities, the prosecutor should not be permitted to circumvent them by prosecuting the activities as a conspiracy. Concert and a plurality of agents are indispensable elements of the substantive offense set forth in the indictment. The receipt of a promise as consideration for omitting a duty necessarily involves more than one person. No additional danger was present in this agreement that is not necessarily present in any violation of the statute proscribing omission by a police officer of duty for a reward. Accordingly, Wharton's Rule is applicable in this case to prohibit conviction of conspiracy to obstruct Justice.\n\nJustice Kavanagh also wrote to affirm the judgment of the Court of Appeals. Wharton's Rule, in effect, provides that when two people are necessary to perform a proscribed act, they may not be prosecuted for conspiracy to perform it, because their combination adds nothing to their intent to commit the crime. In this case the defendant and another police officer were charged with conspiracy to obstruct Justice by willfully and unlawfully failing to perform official duties in exchange for the payment of money; the other police officer was found not guilty, and consequently the jury's verdict that the defendant was guilty could only have been based on the Conclusion that defendant Davis and the narcotics dealer conspired for the dealer to pay the defendant to fail to do his official duty. The obstruction of Justice charged in this case required the cooperation of two people to effect it: under the charge it was necessary for both the narcotics dealer and the defendant to act -- bribery requires a giver and a taker -- and their agreement or combination to do the act added no threat to society not included in the performance of it. The jury found defendant Davis not guilty of accepting a bribe from the narcotics dealer. The charge that he \"conspired to obstruct Justice\" by doing so should be dismissed.\n\nJustice Levin wrote that Wharton's Rule precludes affirmance of the conviction of conspiracy in this case.\n\n1. Wharton's Rule declares that an agreement to commit an offense which by its nature requires the cooperative action of two or more persons cannot be prosecuted as a conspiracy. It states a substantive limitation upon the reach of the law of conspiracy. Because the applicability of Wharton's Rule turns upon the nature of the substantive offense that the conspiracy seeks to achieve, accurate identification of that offense is essential. In most cases its proper designation and its individual or cooperative character will not be in doubt, but where, as here, the object of the conspiracy charged is said to be an offense at common law, its dimension and nature must be discovered through examination of the common-law authorities that identified and defined the offense. The people and Davis disagree on the threshold question, what offense Davis was convicted of conspiring to accomplish. The people argue that the offense was obstruction of Justice, an offense which does not require joint activity and can be committed by one person. Davis argues that obstruction of Justice is not one crime, but many, and that the object of the conspiracy charged, obstructing Justice by failing to perform official duties in exchange for the payment of money, requires the cooperative action of two persons and is neither more nor less than the statutory offense of officer omitting duty for reward.\n\n2. There was no generic offense of obstruction of Justice known to the common law. There were instead a large number of separate and specific offenses, some of which in time came to be collected under the rubric \"offense against public Justice\". By 1800 one may observe indictments charging that certain specifically described acts were done with an intent \"to obstruct the due course of Justice\". The element shared by the common-law offenses against public Justice is this willful or corrupt intent, but it is the specific misconduct as well as the intended result that comprise the elements of the charged offense. By the early part of this century, statements suggesting that obstruction of Justice was a single generic offense at the common law appear in the cases. Decisions of the Supreme Court of Michigan contain language which can be read as suggesting that obstruction of Justice is a single common-law crime rather than a lately-evolved heading encompassing a number of distinct common-law offenses, but the cases did not call on the Court to decide whether the offense was one or many at the common law, and should not foreclose this Court's recognition of the multiplicity of common-law \"offenses against public Justice\" and the consequent need to recognize for purposes of Wharton's Rule analysis the precise offense that Davis was convicted of conspiring to accomplish.\n\n3. To state that the offense can be defined solely in terms of the object sought to be accomplished, obstruction of Justice, may mean that the \"Michigan common-law offense of obstruction of Justice\" is void for vagueness, because without additional criteria to identify a punishable obstruction of Justice it would be left to prosecutors to charge and Judges and juries to define case by case, without standards to guide them, what conduct constitutes obstruction of Justice. It is not enough that the conduct interferes with what a jury regards to be the orderly administration of Justice and was done with the intention of achieving that result. Unless the performance of the duty is mandatory, so that mere willful refusal to perform it is punishable, an officer's act or omission in relation to administering the laws is, according to the early text writers, criminal only if it is prompted by a corrupt motive or intent. Police officers today enjoy a measure of discretion in charging, and there could be a wide variety of reasons why even a narcotics dealer might not be arrested. It was the willful failure to perform a non-discretionary duty or the corrupt failure to perform a discretionary duty which was an offense at common law.\n\n4. Davis was charged not merely with conspiring willfully to fail to perform duty but with conspiring corruptly to fail to perform duty. The prosecutor was obliged to prove the element of corruption, the specific corruption charged in the indictment, the agreement for the payment of money. The jury was instructed that it must find an agreement involving a bribe or reward. If the gist of the conspiracy charge was intended interference with the orderly administration of Justice rather than receipt of reward, then the Judge improperly took from the jury the question whether Davis' conduct was intended so to interfere when he instructed that such an agreement constitutes conspiracy to obstruct Justice. Even if it would have been possible to charge Davis with mere neglect or failure to perform duty without regard to whether he acted corruptly, he was not so charged. He was charged with conspiracy to commit a common-law offense which involved payment of money and the corruption of a second actor, the narcotics dealer. When an offense in the nature of bribery is defined in terms that contemplate an exchange or agreement to exchange rather than unilateral solicitation, the offense requires the bilateral action of two or more persons. The substantive offense which is the object of the conspiracy charged in this case consists of an agreement and logically requires the action of two persons, and Wharton's Rule applies.\n\n5. Wharton's Rule has been applied more frequently to bar charges of conspiracy to commit some form of bribery than to bar charges of conspiracy to commit the classic Wharton's Rule offenses of adultery, incest, bigamy and dueling. No court has previously suggested that the application of the rule to conspiracy to bribe depends on the nature of the duty sought to be influenced by the bribe or the gravity of the harm which may flow from the officer's failure to perform his duty. To suggest that the rule's application is limited to a small group of \"victimless crimes\" which today are rarely prosecuted as either substantive offenses or conspiracies is in effect to abolish it. If it ought to be regarded as a historical curiosity which serves no rational purpose in modern law, the decision to discard it should be made only after full consideration of the competing policies which favor its retention or rejection; if it remains viable, it should be applied without flinching in cases involving bribery and other offenses which the terms and policy of the rule comprehend.\n\n6. The conspiracy prosecuted and submitted to the jury in this case consisted of not two but three conspirators; Davis, a co-defendant policeman, and the unindicted co-conspirator narcotics dealer. The verdict indicates that the jury concluded that the codefendant's participation had not been established, but that Davis had conspired with the narcotics dealer. Wharton's Rule should not be deemed inapplicable to a defendant convicted as one of two parties to a conspiracy to commit a two-person crime because additional parties to the conspiracy were charged and acquitted. To allow the rule to be circumvented by charging additional parties whose guilt cannot be established would violate the policy of the rule to prevent imposition of greater punishment than the Legislature has provided for a substantive offense by the expedient of charging the agreement as a conspiracy. The jury also decided that Davis had not committed the crime of officer omitting duty for reward. It is sometimes stated that Wharton's Rule applies only when the substantive offense has been committed, but the better statements of the rule declare that preliminary agreements to commit crimes requiring concerted action are not indictable conspiracies so long as the agreement encompasses only the parties essential to the offense. Absent action by the Legislature punishing the agreement alone or abolishing the rule, Wharton's Rule furnishes a substantive limitation on the law of conspiracy where an appropriate substantive offense is involved.\n\n7. It is not necessary to decide whether the common-law offense has been superseded by the statutory offense of officer omitting duty for reward to decide the Wharton's Rule question on which leave to appeal was granted. Assuming that it is still a common-law offense to obstruct Justice by accepting money for failing to perform an official duty, then it is also such an offense to pay the money. Defendant's co-conspirator Williams also could have been charged with such obstruction of Justice, and the exception to Wharton's Rule where one of the conspirators may not be punished is inapplicable.\n\nJustice Moody, joined by Justice Williams, Dissented. He wrote:\n\n1. Generally, a conspiracy and the substantive crime which is its object are separate crimes for purposes of criminal prosecution. \"Wharton's Rule\", an exception to the general rule, is that an agreement by two persons to commit a substantive crime cannot be prosecuted as a conspiracy where the substantive crime requires the participation of at least two persons. Conspiracies are made punishable because of the increased danger to society from group offenses. Some unlawful combinations, however, do not have any element of added danger. If the substantive offense, for example, requires concerted action and only the necessary parties participate there is no added danger in conspiring to do the offense because nothing is involved in the conspiracy which will not be present whenever the offense is committed. In such a case, there is no logical basis for conviction of other than the substantive offense or an attempt.\n\n2. Wharton's Rule, as a practical matter, must be understood as a judicial presumption, applied where the legal nature of the substantive offense dictates. It depends upon the common-law or statutory elements of the substantive offense and not the evidence presented to prove it. Where the elements of the substantive offense are congruent with the conspiracy charged and indicate that two persons are required to commit the substantive offense, Wharton's Rule will apply to preclude prosecution for conspiracy to commit that offense. Where it is impossible under any circumstances to commit the substantive offense without cooperative action, the preliminary agreement between the same parties to commit the offense is not an indictable conspiracy either at common law or under the statutes.\n\n3. The fact that evidence adduced in a given case shows that the substantive offense which was the object of a conspiracy was committed by two persons pursuant to an agreement does not preclude convicting the parties of both the conspiracy and the substantive offense. Wharton's Rule acts as a bar to the conspiracy charge in the limited number of cases where the elements of the substantive offense make it impossible to commit it without cooperative action. However, the rule does not apply where the substantive offense that is the object of the conspiracy can be committed by a single person, i.e., where more parties participate in the conspiracy than are logically necessary for the commission of the substantive offense which is the object of the conspiracy.\n\n4. The focus for application of Wharton's Rule is upon the nature of the offense or the elements of the crime rather than the particular facts of the case. The rule is not invoked merely because the facts involving the commission of a substantive crime which is the object of a conspiracy show conduct pursuant to an agreement that logically requires two or more persons. If the same substantive offense can logically be committed by a single person, the rule is inapposite. Wharton's Rule operates when the elements of the substantive crime necessarily require the participation of two persons and thus create no added social danger which a conspiracy charge would address. Thus, the Disposition of this case hinges upon whether the elements of the Michigan common-law offense of obstruction of Justice are congruent with the elements of a conspiracy to commit obstruction of Justice.\n\n5. Failure by a public official to perform an official duty in enforcing the s constitutes an obstruction of Justice at common law. An obstruction of Justice is essentially an intended interference with the orderly administration of the law. The crime of obstructing Justice is not an inherently joint act. If defendant Davis, alone, had purposefully refrained from performing his duty by failing to arrest the narcotics dealer, he could have been convicted of obstruction of Justice. No concert of activity nor payment of a reward need be involved. When the offense of unlawfully obstructing an arrest, which may be perpetrated by a single actor, is conducted by a combination of two or more persons, an added danger to society evolves. The likelihood of abandonment of the obstruction may be diminished and the success of the unlawful endeavor may be enhanced. Therefore, Wharton's Rule, which operates only when no added threat to the community is created, does not apply in this case.\n\n6. In this case the substantive offense of obstruction of Justice was not ultimately included as one of the charges. A conspiracy to obstruct Justice stands apart from the substantive crime asserted, officer omitting duty for reward. Furthermore, the immediate consequences of the offense in this case cannot be found to rest solely with the parties. The dealings in narcotics of the man with whom the defendant conspired, which would have been continued if he were not arrested, could have constituted a real and substantial danger to the public. Therefore, this case is categorically different from the offenses traditionally associated with Wharton's Rule, e.g., adultery, incest, bigamy and dueling, in which the immediate consequences of the crime rest on the parties themselves rather than on society at large. An agreement to obstruct Justice by failing to arrest a narcotics dealer compromises the public trust and clearly could affect other persons.\n\n7. The agreement charged in this case poses the exact kind of threat to society that the conspiracy law intends to address. One of the primary reasons for punishing conspiracies separately from the substantive offense is that there is a greater danger to society inherent in a combination of persons for criminal purposes than in one person acting alone. Wharton's Rule is primarily grounded upon the premise that, where both the conspiracy and the substantive offense require a combination of persons, the threats normally associated with conspiracy apply equally to both. Therefore, allowing separate prosecution for conspiracy becomes less defensible. However, in this case, obstruction of Justice does not require concerted criminal activity. Consequently, the evils inherent in conspiracy represent a separate threat to society, which may fairly be addressed in a distinct charge.\n\n8. In contrast, the gravamen of the substantive charge of the statutory offense of an officer omitting his duty for a reward is the receipt by the officer of a reward for omitting or delaying performance of a duty, whether or not he actually omits or delays performing his duty. It is unnecessary to prove that a meeting of minds occurred as to the omission of the duty, or that the officer in fact omitted doing his duty. The defendant might be convicted of that statutory offense even though he had no intention of failing to do his duty. Therefore, the gists of the two substantive offenses differ substantially. It is logically possible in this case for the jury to find the defendant guilty of the conspiracy charged and not guilty of the other offense charged. The jury could have believed that Davis agreed with the narcotics dealer to obstruct Justice by failing to arrest, without being convinced beyond a reasonable doubt that Davis received money for this purpose. The verdicts were consistent.\n\nJustice Ryan did not participate in the decision.\n\nThe facts and the procedural context in which the issue presented by this case arose are adequately set forth in Justice Levin's opinion. Basically, defendant, a police officer, was convicted of conspiracy to obstruct Justice \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e by agreeing with Charles Williams not to arrest Williams in exchange for money. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The Court of Appeals reversed defendant's conviction on the basis that Wharton's Rule prohibited this conspiracy prosecution. Leave to appeal was granted and limited to \"whether the Court of Appeals erred in ruling that Wharton's Rule should be applied so as to preclude conviction of defendant-appellee of the charge of conspiracy to obstruct Justice\". \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Wharton's Rule, as it later became known, was originally a succinct statement of a number of substantive case-law limitations on the law of criminal conspiracy which had developed. It stated:\n\n\"When to the idea of an offense plurality of agents is logically necessary, conspiracy, which assumes the voluntary accession of a person to a crime of such a character that it is aggravated by a plurality of agents, cannot be maintained. As crimes to which concert is necessary (i.e., which cannot take place without concert), we may mention dueling, bigamy, incest, and adultery; to the last of which the limitation here expressed has been specifically applied by authoritative American courts. We have here the well-known distinction between concursus necessarius and concursus facultativus, in the latter of which the accession of a second agent the offense is an element added to its conception; in the former of which the participation of two agents is essential to its conception, and from this it follows that conspiracy, the gist of which is combination, added to crime, does not lie for concursus necessarius. In other words, when the law says, 'a combination between two persons to effect a particular end shall be called, if the end be effected, by a certain name,' it is not lawful for the prosecution to call it by some other name; and when the law says, such an offense -- e.g., adultery -- shall have a certain punishment, it is not lawful for the prosecution to evade this limitation by indicting the offense as conspiracy. Of course when the offense is not consummated, and the conspiracy is one which by evil means a combination of persons is employed to effectuate, this combination is of itself indictable.\" \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nPlaintiff argues that Wharton's Rule is not applicable in this case because a plurality of agents is not logically necessary to commit the offense of obstruction of Justice, see People v Alexander, 35 Mich App 281; 192 NW2d 371 (1971). In the context of this case, it has been contended that a police officer's failure to arrest a felon for a corrupt motive is an obstruction of Justice, and that this offense does not require a plurality of actors. Accordingly, Wharton's Rule would not bar the conspiracy conviction because more actors were involved than required to commit the charged offense and because the agreement in this case increased the dangers to which society was exposed. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Plaintiff claims that the allegations in the indictment that the officer agreed to fail to arrest in exchange for money were not a necessary element of the charged offense, so as to require a plurality of agents, but were only a superfluous explanation of the officer's corrupt motive and the means by which the obstruction was to be accomplished, see Glasser v United States, 315 U.S. 60, 66-67; 62 S Ct 457; 86 L Ed 680 (1942), United States v Manton, 107 F2d 834 (CA 2, 1938), cert den 309 U.S. 664; 60 S Ct 590; 84 L Ed 1012 (1940).\n\nEven assuming arguendo that plaintiff's description of the common-law offense of obstruction of Justice is accurate, one cannot ignore the allegation in the indictment that the officer agreed to omit his duty for a reward. Charging an officer with agreeing to omit a duty in exchange for a reward necessarily entails a receipt by the officer of a promise of a reward as consideration for his failure to arrest. This charge sets forth all the elements of the statutory offense defined in MCL 750.123; MSA 28.318, which provides:\n\n\"Any * * * officer * * * who shall receive * * * any * * * promise to pay or give money * * * as a consideration * * * for omitting or delaying to arrest * * * shall be guilty of a misdemeanor\". \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nTherefore, since the Legislature has expressly made a provision for the punishment of an officer who receives a promise or any valuable thing as consideration for delaying an arrest, this conduct is not punishable under MCL 750.505; MSA 28.773 because it is not an offense \"for the punishment of which no provision is expressly made by any statute of this state\".\n\nThe Legislature's decision to establish a specific punishment for an officer who receives a promise as consideration for omitting a duty requires the analysis of other principles incorporated into Wharton's Rule beyond merely whether the target offense of the charged conspiracy can theoretically be committed by one person. One principle incorporated into the rule states:\n\n\"In other words, when the law says, 'a combination between two persons to effect a particular end shall be called, if the end be effected, by a certain name,' it is not lawful for the prosecution to call it by some other name; and when the law says, such an offense -- e.g., adultery -- shall have a certain punishment, it is not lawful for the prosecution to evade this limitation by indicting the offense as conspiracy.\" 2 Wharton, (12th ed), ยง 1604, p 1862.\n\nThis principle applies to this case because the Legislature has designated MCL 750.123; MSA 28.318 as the appropriate offense for, and established an express provision for the punishment of, an officer who receives a promise to pay money as consideration for failing to perform a duty. The receipt of this promise as consideration is a substantive offense under MCL 750.123; MSA 28.318. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Plaintiff has not shown any reason to justify a conviction in this case under any provision other than MCL 750.123; MSA 28.318.\n\nFor these reasons, the resolution of this case is controlled by the principles applied in United States v Dietrich, 126 F 664 (CCD Neb, 1904). In Dietrich, defendant was charged with conspiracy to commit an offense against the United States by agreeing with someone to receive a bribe for procuring an office of postmaster for that person. However, since it was an offense under 1878 US Rev Stat (2d ed), ยง 1781; 12 Stat 577 for a member of Congress to agree to receive a bribe and an offense for anyone to offer or agree to give a bribe, the Court concluded that the formation of this agreement was not punishable as a conspiracy because it was a substantive offense under ยง 1781.\n\nThe only significant difference between Dietrich and this case is that in Dietrich both conspirators were punishable for substantive offenses defined in one section of the United States Code while in this case, MCL 750.123; MSA 28.318 applies only to police officers and not to Williams. However, this difference is not sufficient to distinguish the logic of Dietrich. Williams' conduct in promising any gratuity whatever to Davis to influence his decision to omit his duty was unlawful under MCL 750.117; MSA 28.312. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The Legislature's decision to create a separate, more specific section of the same Chapter of the Penal Code (XVII) to address the instances when a police officer receives a promise as consideration for omitting a duty is not sufficient to distinguish this case from the Dietrich principle. It does not justify the Conclusion that Wharton's Rule is inapplicable because one of the parties necessary for the commission of the offense is not subject to prosecution under the same section for his activity. That would be a distinction without a difference.\n\nIt is true that when an officer, one who has sworn to uphold and enforce the law and is entrusted with the power and responsibility of so doing, agrees to omit a duty for reward, society is endangered -- directly, by not bringing the offender to Justice, and indirectly, by compromising everyone's respect for the law. Therefore the agreement to omit this duty for reward should not be immune from prosecution based on the principle incorporated into Wharton's Rule that no conspiracy prosecution should be permitted when the agreement poses no distinct danger to society. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e This Conclusion is underlined by the Legislature's decision to punish exchanges of offers or promises under MCL 750.123; MSA 28.318 and MCL 750.117; MSA 28.312.\n\nNevertheless, because the Legislature has established express provisions punishing these activities, the prosecutor should not be permitted to circumvent those limitations by prosecuting the activities as a conspiracy.\n\nConcert and a plurality of agents are indispensable elements of the substantive offense as set forth in the indictment. The receipt of a promise as consideration for omitting a duty necessarily involves more than one person. No additional danger was present from this agreement that is not necessarily present in any violation of MCL 750.123; MSA 28.318. Accordingly, Wharton's Rule is applicable in this case to prohibit the use of a conviction of conspiracy to obstruct Justice as a method for circumventing the punishment specifically provided by the Legislature for this activity.\n\nAffirmed.\n\nKavanagh, J. (for affirmance).\n\nI would affirm the Court of Appeals.\n\nWharton's Rule is a principle of law used in the analysis of a charge of conspiracy to assay the legitimacy of the charge. In effect it provides that when two people are necessary to perform a proscribed act, they may not be prosecuted for conspiracy to perform it, for their combination adds nothing to their intent to commit the crime.\n\nThe usual reason for justifying conspiracy prosecutions is the asserted additional threat to society posed by the combination of individuals to accomplish a forbidden act. This reason would have no application where the act itself requires the concert of their activity. Thus it is impermissible to charge two people with conspiracy to commit adultery with each other.\n\nIn this case Officer Davis and Officer Pollard were bound over on a charge of conspiracy to obstruct Justice by willfully and unlawfully failing to perform official duties in exchange for the payment of money.\n\nOfficer Pollard was found not guilty of this charge and consequently the jury's verdict that Officer Davis was guilty could only have been based on the Conclusion that defendant Davis and informant Williams conspired for Williams to pay Officer Davis to fail to do his official duty.\n\nCrime does not exist in a vacuum. A charged crime is the state's assertion that the defendant committed a specified proscribed act. In order to determine the law applicable to that charge it is necessary to consider the act itself. It will not do to examine merely the label.\n\nThe fact that \"obstruction of Justice\" embraces acts which could be performed alone, should not blind us to the reality that the \"obstruction of Justice\" charged in this case required the cooperation of two people to effect it.\n\nWe are not concerned with a theoretical but a real charge.\n\nBecause under the charge here it was necessary for both Williams and Davis to act -- bribery requires a giver and a taker -- their agreement or combination (conspiracy) to do the act added no threat to society not included in the performance of it.\n\nSuch agreement, combination or indeed conspiracy under this circumstance would amount only to an intent to obstruct Justice. Such intent without performance is no crime.\n\nThe jury found defendant Davis not guilty of accepting a bribe from Williams. The charge that he \"conspired to obstruct Justice\" by doing so should be dismissed.\n\nLevin, J. (to affirm).\n\nRudy Davis, a Detroit police officer, was convicted of conspiracy to obstruct Justice by failing to perform official duties in exchange for money.\n\nThe Court of Appeals reversed his conviction on the basis of Wharton's Rule, a principle of substantive that an agreement to commit an offense necessarily involving the cooperative action of two or more persons cannot be prosecuted as conspiracy, at least where the only parties to the agreement are those whose cooperative action is required to commit the substantive target offense which is the object of the conspiracy.\n\nThis Court granted leave to appeal to consider \"whether the Court of Appeals erred in ruling that Wharton's Rule should be applied so as to preclude conviction of of the charge of conspiracy to obstruct Justice\". \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nBecause the applicability of Wharton's Rule turns upon the nature of the substantive offense that the conspiracy seeks to achieve, accurate identification of that target offense is essential. In most cases, particularly where the target offense constitutes a violation of statute, its proper designation and its individual or cooperative character will not be in doubt. But where, as here, the object of the charged conspiracy is said to be an offense at common law, its dimensions and nature must be discovered through examination of the common-law authorities that identified and defined the offense.\n\nThe people and Davis disagree on a threshold question: For purposes of Wharton's Rule analysis, what offense was Davis convicted of conspiring to accomplish? The people argue that the target offense was obstruction of Justice, an offense which does not require joint activity and can be committed by one person. Davis argues that \"obstruction of Justice is not one, but many crimes under a general category\", and that the described aim of this conspiracy -- obstruction of Justice by an officer's failing to perform official duties in exchange for the payment of money -- requires the cooperative action of two persons and is neither more nor less than the statutory offense of officer omitting duty for reward. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nMy colleague would hold that the payment and receipt of money is not an element of obstruction of Justice, that the offense is essentially an intended interference with the orderly administration of the law and thus a failure to perform an official duty relative to enforcing the s constitutes an obstruction of Justice at common law without regard to whether money has been paid or received. Since payment and receipt of money is not an essential element, one person, the person who fails to perform his duty -- Rudy Davis in this case -- can be charged and convicted of obstruction of Justice and so a plurality of actors is not necessary to commit the offense.\n\nI would hold that Wharton's Rule precludes affirmance of Davis' conviction of the instant conspiracy charge.\n\nThe term \"obstruction of Justice\" does not denote a single offense. Rather, it describes a category consisting of a large number of separate offenses having in common the same unlawful or corrupt purpose.\n\nThe obstruction of Justice offense which was the target of the conspiracy for which Davis was indicted and convicted was obstruction of Justice by failing to perform official duty in return for money. Although Davis might have been indicted for a target offense which did not involve the payment of money, he was not. His conviction cannot be affirmed as though he had been so indicted.\n\nThe target offense charged necessarily involves the cooperative action of two persons because a person cannot obstruct Justice by failing to perform official duties in exchange for money unless a second person has paid money to the person who fails to perform his duty. Since two persons, the payer and the payee, are necessarily involved, the target obstruction of Justice offense charged and of which Davis was convicted necessarily involves the cooperative action of two persons.\n\nI\n\nA Wayne County citizens' grand jury returned an indictment charging Davis and two other officers with one count of conspiracy to \"obstruct the due course of Justice by willfully and unlawfully failing to perform official duties in exchange for the payment of money\", and one count of so obstructing Justice. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The conspiracy count named Charles Williams as an unindicted co-conspirator.\n\nThe defendants were bound over as charged, except that only Davis and one other officer, Craig Pollard, were bound over on the conspiracy count.\n\nThe defendants moved to dismiss or, in the alternative, to be bound over on the statutory offense of officer omitting duty for reward. The Judge refused to quash or amend the charge of conspiracy to commit the obstruction of Justice offense, but ordered the indictment amended to charge the statutory offense of officer omitting duty for reward rather than the substantive obstruction of Justice offense initially described. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAt trial Williams testified that during a police raid on an apartment he had used as a base for selling narcotics Davis had removed about $200 from Williams' pocket and asked him what being released would be worth to him. Williams mentioned $1,000. After Davis and Pollard held a private conversation in the bathroom, Pollard and the third officer accompanied Williams to his brother's nearby house to pick up the money. Williams gave the money to Pollard, who indicated that he knew of \"the deal with Davis\". Williams was eventually let out at a corner gas station.\n\nPollard testified that Davis told him that Williams was turning informant. He and the other officer drove Williams around for several hours and eventually released him when it became clear that he could not provide useful information.\n\nThe jury acquitted all the defendants of the substantive offense of officer omitting duty for reward and Pollard of conspiracy. Davis alone was convicted of conspiracy; Williams was, by implication, his co-conspirator.\n\nII\n\nAs originally formulated by Francis Wharton, whose name it bears, and as reformulated in the latest edition of his treatise, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Wharton's Rule declares that an agreement to commit an offense which by its nature requires the cooperative action of two or more persons cannot be prosecuted as a conspiracy. The doctrine states a substantive limitation upon the reach of the law of conspiracy. Whether Wharton's Rule governs a particular conspiracy charge, therefore, depends upon whether concerted activity is a necessary component of the substantive target offense named as the object of the charged conspiracy. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nA\n\nIt is not clear whether my colleague would hold that obstruction of Justice is a generic offense and that any intended interference with the orderly administration of the law constitutes that offense, or whether he would hold that failure to perform an official duty relative to enforcing the s is a specific obstruction of Justice offense, one of many at common law.\n\nI am satisfied after limited research that there was no generic offense of obstruction of Justice known to the common law. There were instead a large number of separate and specific offenses, some of which with the passage of time came to be collected under the rubric \"Offences Against Public Justice\". Blackstone catalogues 22 separate crimes under this heading, including perjury, embracery (jury tampering), bribery of a Judge or other person concerned in the administration of Justice, and negligence of public officers entrusted with the administration of Justice. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nI found no case where a defendant was indicted for the offense of obstructing Justice, although by 1800 one may observe indictments charging that certain specifically described acts, e.g., conspiring to dissuade a witness from attending judicial proceedings, were done with an intent \"to obstruct the due course of Justice\". \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The element shared by the common-law offenses against public Justice is this willful or corrupt intent, but it is the specific misconduct as well as the intended result, obstruction of Justice, which comprise the elements of the charged obstruction offense.\n\nThe early American text writers do not appear to have regarded obstruction of Justice as a single offense. Separate Discussion of obstruction of Justice is rare compared to the treatment of more specific offenses such as bribery and malfeasance in office. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The Cyclopedia of Law and Procedure, published in 1908, allots a separate heading to \"Obstructing Justice\", but the bulk of this entry is devoted to listing \" offenses regarded as forms of obstructing Justice\". \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nAn overview of the early American cases suggests that the courts initially recognized that many distinct offenses could be described as \"offenses against public Justice\" or \"obstruction of Justice\", but later began to disregard the distinctness of the various crimes and to employ the generic term \"obstruction of Justice\" as if it described one offense rather than many. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e This development may have been advanced by the dissemination of treatises which reproduced indictments including allegations that particular acts were done with the intent to obstruct Justice \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and by the adoption in some jurisdictions of broadly worded criminal statutes punishing obstruction of Justice. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nBy the early part of this century, statements suggesting that obstruction of Justice was a single generic offense at common law appear in the cases. In Commonwealth v Berry, 141 Ky 477, 478-479; 133 SW 212 (1911), the indictment charged that Berry \"did unlawfully obstruct the action of the grand jury\" by \"persuading, enticing and soliciting\" a witness not to appear before the grand jury and to leave the county. The court spoke in passing as if obstruction of Justice were a single offense:\n\n\"The obstruction of legal Justice was a misdemeanor at common law, and the spiriting away of a witness to prevent him from testifying was always regarded as a phase of the offense\" (emphasis supplied),\n\neven though it cited cases \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e stating that the \"offense of spiriting away a witness is an indictable offense at common law\" in support of its reasoning.\n\nThis Court's opinion in People v Boyd, 174 Mich 321, 322-324; 140 NW 475 (1913), reveals no clear view of the matter. The indictment charged that Boyd, \"with intent to obstruct and hinder the due course of Justice, * * * wilfully and unlawfully dissuaded, hindered, bribed, hired, carried, and spirited away the said Nuel Craig, for the purpose of preventing him from appearing to testify as a witness * * * to the obstruction and hindrance of public Justice\". Although the opinion opens with the statement that Boyd was convicted of \"the common-law offense of obstructing the administration of Justice\", it also recognizes the significance of the specific misconduct: \"At the common law, to dissuade or prevent, or to attempt to dissuade or prevent, a witness from attending or testifying upon the trial of a cause is an indictable offense.\" A subsequent passage is similarly equivocal:\n\n\"There was evidence in the case tending to show that respondent had carried and spirited away this witness, for the purpose of preventing him from appearing and testifying. This charges a substantive offense; that respondent did this with intent to obstruct and hinder the due course of Justice ; therefore, when the acts charged were committed, the offense charged was complete.\"\n\nBoyd cites, inter alia, State v Carpenter, 20 Vt 9 (1847), and Berry, supra. Like those cases, Boyd fails to distinguish the specific misconduct indictable as a distinct offense at common law with the associated criminal intent -- to obstruct the administration of Justice.\n\nLater decisions of this Court contain language which can be read as suggesting that obstruction of Justice is a single common-law crime rather than a lately-evolved heading encompassing a number of distinct common-law offenses. See People v Tenerowicz, 266 Mich 276, 282; 253 NW 296 (1934); People v Ormsby, 310 Mich 291, 299-300; 17 NW2d 187 (1945). The indictment in Tenerowicz did not, however, in terms charge obstruction of Justice. In neither case was it of any importance in deciding the issues there presented whether obstruction of Justice is a single offense.\n\nB\n\nOne can agree that specific obstructive misconduct was an indictable offense at common law without agreeing that all misconduct intended to obstruct the course of Justice was prosecuted as the same offense -- obstruction of Justice. In my view, obstruction of Justice, like theft, describes a category of distinct offenses covering a broad range of factual situations and presenting a variety of elements.\n\nA common-law offense cannot now properly be declared on the basis of precedents reflecting misapprehension as to the classification of offenses at common law. None of the Michigan precedents just cited called upon this Court to decide whether obstruction of Justice was one offense or many at common law. Those authorities' misperception of the nature of common-law \"obstruction of Justice\" should not foreclose this Court's recognition of the multiplicity of common-law \"offenses against public Justice\" and the consequent need to recognize for purposes of Wharton's Rule analysis the precise offense that Davis was indicted and convicted of conspiring to accomplish.\n\nTo state that the offense can be defined solely in terms of the object sought to be accomplished -- obstruction of Justice -- may mean that the \"Michigan common-law offense of obstruction of Justice\" is void for vagueness. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e If an officer or other person could be indicted and convicted for accomplishing an obstruction of Justice without additional criteria to identify a punishable obstruction of Justice, it would be left to prosecutors to charge and Judges and juries to define case-by-case, without standards to guide them, what conduct constitutes obstruction of Justice. Persons involved in the administration of Justice would be inhibited in the exercise of discretion. They would not know what were the limits of permissible conduct and would run the risk that some jury or Judge would conclude that their conduct obstructed Justice.\n\nA lawyer who filed a motion to suppress evidence followed by a motion to test the competency of his client to stand trial, followed by motions for discovery, might be convicted of obstruction of Justice if in the meantime a witness were to die or other evidence were to be lost. Prosecutors, lest they be charged with obstructing Justice by failing to perform their duty, might bring obstruction of Justice charges and could disclaim responsibility for the decisions of Judges and juries.\n\nThe foregoing scenario is fanciful because the law does not permit generalized charges of obstruction of Justice. It is not enough that the conduct interferes with what a jury regards to be the orderly administration of Justice and was done with the intention of achieving that result.\n\nC\n\nThe failure of a police officer to make an arrest is not now an obstruction of Justice unless done with a corrupt intent.\n\nIt has never been the law that conduct otherwise lawful is a crime simply because the result is an intended interference with the orderly administration of Justice or that a public official's failure to perform a discretionary duty relative to enforcing the constitutes an obstruction of Justice at common law without regard to whether the public official's failure to perform his duty was attended by good or bad faith.\n\nThere are, to be sure, cases demonstrating or stating that public officials could be indicted at common law for the failure to perform official duties relative to enforcing the s. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e But in every instance the duty was apparently a ministerial activity that the officer had no discretion to refrain from performing. Unless the performance of the duty is mandatory, so that the mere willful refusal to perform it is punishable, an officer's act or omission in relation to administering the laws is, according to the early text writers, criminal only if it is prompted by a corrupt motive or intent. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThus, not every failure to perform an official duty can be an obstruction of Justice. Prosecutors have a discretion in charging which they may exercise by charging a person with less than all of the possible offenses which the evidence might support and they may refuse to charge some offenders and, indeed, fail to enforce certain laws. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nSimilarly, at least today, police officers enjoy a measure of discretion in charging. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Not every offender is taken to the station house, nor is every citation or traffic ticket, if issued at all, written for the full misconduct which the officer observed. And today an officer has discretion to refrain from arresting an offender. There could be a wide variety of reasons why even a narcotics dealer might not be arrested. It is commonplace to use small fish to catch bigger fish in the effort to net the larger dealers. Merely because a narcotics user or dealer was not arrested does not constitute an offense.\n\nTo assert that a police officer's simple failure to perform an official duty relative to enforcing the s is punishable today as a constable's failure to perform a duty was punishable at common law is to propound a harsh and antiquated rule without regard to the realities of the modern law enforcement and criminal Justice system. A constable's duties were prescribed and ministerial and left no room for the exercise of discretion. The modern police officer may exercise good faith discretion in enforcement.\n\nD\n\nIt was the willful failure to perform a non-discretionary duty or the corrupt failure to perform a discretionary duty which was an offense at common law.\n\nDavis was charged not merely with conspiring willfully to fail to perform duty but with conspiring corruptly to fail to perform duty. That was the offense charged, the offense Davis prepared to defend and the offense on which the jury was instructed.\n\nIf Davis had been charged with willful failure to perform duty the people would have been obliged to prove as an element that he had no discretion. The grand jury charged an agreement for a corrupt failure to perform duty and perforce the prosecutor was obliged to prove the element of corruption and, indeed the specific corruption charged in the indictment -- the agreement for the payment of money.\n\nThe Judge instructed the jury that it must find an agreement involving a bribe or reward:\n\n\"If you are satisfied beyond a reasonable doubt that either defendant Rudy Davis or defendant Craig Pollard, or both of them, conspired together or along with Charles Williams to unlawfully agree not to arrest Mr. Williams for a narcotics offense and to, instead, handle the matter outside of court by agreeing to accept a bribe or reward, then I instruct you that such an agreement constitutes a conspiracy to obstruct Justice as it interferes with, impedes and obstructs the administration of the law and Justice. But, you must find that there was such an unlawful agreement between two or more persons, and you must find this beyond a reasonable doubt. If you do, it is your duty to convict; if you do not, it is your duty to acquit.\" (Emphasis supplied.)\n\nIf, as my colleague contends, the gist of the conspiracy charge was intended interference with the orderly administration of law rather than receipt of reward, the Judge improperly took from the jury the question whether Davis' conduct was intended to so interfere when he said \"I instruct you that such an agreement constitutes a conspiracy to obstruct Justice\".\n\nIn sum, even if it would have been possible to charge Davis with mere neglect or failure to perform duty without regard to whether he acted corruptly (money was paid or received), he was not, as the Court of Appeals observed, \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e so charged.\n\nIII\n\nDavis was charged with conspiring to commit a common-law obstruction of Justice offense which involved payment of money and the corruption of a second actor, the alleged narcotics dealer, Williams.\n\nWhen an offense in the nature of bribery is defined in terms that contemplate an exchange or agreement to exchange rather than unilateral solicitation, the offense requires the bilateral action of two or more persons.\n\n\"A person cannot agree with himself, receive from himself, or give to himself. The concurrent and several acts of two persons are necessary to the act of agreeing, receiving, or giving.\" United States v Dietrich. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nDietrich and other cases have applied Wharton's Rule to preclude indictment or conviction for conspiracy to commit bribery offenses necessarily entailing such bilateral action. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The same result should obtain in this case because the substantive offense which is the object of the charged conspiracy consists of an agreement and logically requires the action of two persons.\n\nAs soon as the bribe taker and payer agree to bring about the proscribed result their agreement necessarily implies a promise of reward and a corresponding promise of malfeasance or nonfeasance which together make out the bribery offense.\n\nDavis was indicted for and convicted of agreeing with Williams not to arrest him in exchange for the payment of money. The object of the conspiracy required a plurality of actors -- payer and payee -- and Wharton's Rule applies.\n\nIV\n\nMy colleague argues that Wharton's Rule does not preclude the conspiracy charge in this case because the rule applies only when \"the immediate consequences of the crime rest on the parties themselves rather than on society at large\" and the attendant agreement does not exacerbate the social dangers posed by the substantive offense. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n\"The classic Wharton's Rule offenses -- adultery, incest, bigamy, duelling\", \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e are classic only because Wharton himself cited them as examples of the doctrine's application. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Incest, bigamy and duelling may be ideal theoretical examples of offenses involving concert of action, but research discloses no instance of the rule's application to a charge of conspiracy to commit any of those offenses. Three courts have applied the rule in favor of defendants convicted of conspiracy to commit adultery. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Courts have more often applied the rule where the substantive offense consisted of some form of bribery. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nNo court has previously suggested, let alone held, that the application of Wharton's Rule to conspiracy to bribe depends on the nature of the duty sought to be influenced by the bribe or the gravity of the harm which may flow from the officer's failure to perform his duty.\n\nTo suggest that the rule's application is limited to a small group of \"victimless crimes\" which today are rarely prosecuted as either substantive offenses or conspiracies is in effect to abolish it. If the rule ought to be regarded as a historical curiosity which serves no rational purpose in modern , the decision to discard it should be made only after full consideration of the competing policies which favor its retention or rejection. If the rule remains a viable doctrine, it should be applied without flinching in cases involving bribery and other substantive offenses which the terms and policy of the rule comprehend.\n\nAlthough Iannelli v United States, 420 U.S. 770, 782-785; 95 S Ct 1284; 43 L Ed 2d 616 (1975), stressed the differences between the large-scale gambling operations involved in that case and the traditional Wharton's Rule offenses, the Court ultimately concluded that the presumptive applicability of Wharton's Rule extends to any offense requiring concerted action unless a legislative judgment to the contrary can be discerned. Since the rule originated in part to prevent prosecutorial circumvention of legislative intent \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and since judgments as to whether and how certain conduct should be punished are traditionally left to the Legislature, legislative intent is an appropriate inquiry.\n\nIn the instant case, however, the target offense of the conspiracy is a common-law offense and therefore, as the Court of Appeals observed, no determination of legislative intent would be appropriate in deciding whether the conspiracy charged is barred by Wharton's Rule.\n\nV\n\nA\n\nBecause most authorities regard Wharton's Rule as applicable only where the number of alleged conspirators does not exceed the minimum number logically necessary to complete the substantive offense, \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e a request to the trial court to dismiss the conspiracy charge on the basis of Wharton's Rule would probably have been unsuccessful. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The conspiracy prosecuted and submitted to the jury consisted of not two but three conspirators: Davis, co-defendant Pollard, and unindicted co-conspirator Williams. The verdict indicates that the jury concluded that Pollard's participation in the conspiracy had not been established, but that Davis had conspired with Williams.\n\nWharton's Rule should not be deemed inapplicable to a defendant convicted as one of two parties to a conspiracy to commit a two-person crime because additional parties to the conspiracy were charged and acquitted. One policy of the rule is to prevent imposition of greater punishment than the Legislature has provided for a substantive offense by the expedient of charging the agreement as conspiracy. To allow the rule to be circumvented by charging additional parties whose guilt cannot be established would violate this policy.\n\nIf the jury concludes that the combination was no broader than required to commit the substantive offense, it has determined that the circumstances which normally justify application of the rule prevail, and the rule should be applied.\n\nB\n\nThe jury decided not only that Davis and Williams were the only conspirators but also that Davis had not committed the crime of officer omitting duty for reward. It is sometimes stated that Wharton's Rule applies only when the substantive offense has been committed. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e In my view, the better statements of the rule declare that preliminary agreements to commit crimes requiring concerted action are not indictable conspiracies so long as the agreement encompasses only the parties essential to the offense. If such an agreement dissolves before reaching that stage of preparation which constitutes an attempt, no crime has been committed. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nThe Legislature may, if it chooses, punish an agreement alone, as it has done in the officer omitting duty for reward statute, or it might even reject Wharton's Rule altogether. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Absent such legislative activity, Wharton's Rule furnishes a substantive limitation on the law of conspiracy where an appropriate target offense is involved. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nVI\n\nDavis argues that the conspiracy count should properly have charged an agreement to commit the statutory offense of officer omitting duty for reward.\n\nThe Court of Appeals did not reach the question whether a statutory offense supersedes the common -law offense. It is not necessary to decide that preliminary issue, which may be dispositive on remand, in order to decide whether the Court of Appeals erred in applying Wharton's Rule to Davis' conspiracy conviction. My colleague's opinion may, however, be read as deciding that the common -law offense has not been superseded by the statutory offense of officer omitting duty for reward. Although I would prefer to avoid adverting to Davis' alternative ground of appeal, not within the grant of leave to appeal, I am obliged to respond to my colleague's statements which may be read as inferentially rejecting that ground of appeal.\n\nA\n\nIf the Legislature had not made specific provisions for them, the common-law offenses against public Justice could still be charged as common-law crimes.\n\nAs part of the Revised Statutes of 1838 and the subsequent revision of 1846 the Legislature enacted a series of statutes proscribing perjury, bribery and other forms of conduct tending to obstruct Justice under the chapter heading \" Offences Against Public Justice\". \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e \"It was evidently the purpose of the revisers of 1838 and 1846 to substitute statutory punishment for the common-law offenses as far as possible.\" \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Offenses covered by these statutes are no longer common-law offenses \"for the punishment of which no provision is expressly made by any statute\".\n\nMy colleague agrees that these statutes, which include the present officer omitting duty for reward statute, \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e were enacted in derogation of the common law. It is not contended that the prosecutor could charge these offenses as common-law obstruction of Justice if he wished. Our disagreement concerning this somewhat collateral issue relates to the construction of the officer omitting duty for reward statute.\n\nB\n\nWhile the actual omission of duty is not a necessary element of the offense defined by the officer omitting duty for reward statute, \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e the conduct is not taken out of the purview of the statute when the corrupt omission actually takes place. An officer who actually omits to perform his duty, an officer who only agrees to do so and, indeed, one who in derogation of the agreement performs his duty, all may be charged under the statute. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nThe Legislature's failure to demand proof of an actual omission reflects a desire to punish the officer who is apprehended in the act of violating the statute as well as the officer whose corruption does not come to light until after the bargain is fulfilled. An officer's unlawful failure \"to perform official duties in exchange for the payment of money\" is simply a more developed instance of violation.\n\nThe central element of the offense of officer omitting duty for reward is the agreement between the officer and the reward giver. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e The statute, in terms, proscribes the officer's acceptance of a promise as well as his acceptance of any other consideration. An agreement can violate the statute although it remains wholly executory.\n\nIt is suggested, incorrectly in my opinion, that the statute does not require proof of a meeting of minds on whether the officer will actually omit his duty. In order to form an agreement, the minds of the parties must meet or apparently meet. Whether the officer harbors a secret intention not to fulfill his bargain is immaterial. An agreement may arise although one party harbors an unexpressed intention not to perform so long as the other party's understanding that a commitment has been made is justified. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nC\n\nReference is made to a \"'well-defined' exception\" which declares Wharton's Rule inoperative \"when fewer than all the parties logically necessary for the commission of the substantive offense are indictable for it\". \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e It is asserted that Davis could have been convicted of conspiracy even if the target offense charged were officer omitting duty for reward because his co-conspirator Williams, who was not a police officer, could not be convicted of that offense.\n\nThe notion that the rule does not apply if the law defining the substantive offense fails to specify punishment for one of the necessary participants has been criticized by numerous commentators. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e If a substantive offense defined by statute necessarily contemplates the participation of two or more persons but omits to punish every participant's conduct, it is more reasonable to assume that the Legislature intended to immunize that conduct from prosecution than to assume that it intended all participants, whether or not liable to punishment for the substantive offense, to be exposed to conspiracy prosecutions for their part in an agreement inherent in the substantive offense. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nBut even if the validity of this asserted exception is conceded, the concerns it expresses should not arise where the Legislature has provided in some manner punishment for all the participants in the substantive offense. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e It appears that Williams could have been charged with a related statutory offense. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nBe that as it may, just as it was a common-law offense to obstruct Justice by failing to perform an official duty for reward, so, too, it was such an offense to pay the reward. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Davis was convicted of conspiring with Williams not to perform official duties in exchange for the payment of money; the conduct of either constituted bribery at common law. Hence Williams as well as Davis could have been charged with complementary obstruction of justice offenses \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e and the exception to Wharton's Rule where one of the conspirators may not be charged is inapplicable.\n\nVII\n\nWharton's Rule is a doctrine of substantive which, when applicable, forecloses a conspiracy charge where the agreement between the essential participants is already implicit in the definition of the target offense. Because the target offense here requires a plurality of actors, the Court of Appeals properly applied Wharton's Rule in reversing Davis' conviction.\n\nI would affirm the decision of the Court of Appeals.\n\nBlair Moody, Jr., J.\n\nDefendant Detroit police officer Rudy Davis was indicted by the Wayne County Citizens Grand Jury in 1973 on one charge of obstruction of Justice, contrary to MCL 750.505; MSA 28.773 \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and one charge of conspiracy to obstruct Justice, contrary to MCL 750.157a; MSA 28.354(1). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The charges arose out of defendant's alleged failure to arrest Charles Williams on a narcotics violation in exchange for $1,000. Williams was named by the grand jury as an unindicted co-conspirator. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDefendant Davis and two other police officers, Craig Pollard and Henry Meadows, were bound over at preliminary examination on the obstruction of Justice charge. Only Davis and Pollard were bound over on the conspiracy charge.\n\nThereafter, defense counsel brought a motion to quash the indictment on grounds that the common-law obstruction of Justice charges were improperly laid where there also existed the more specific statutory charge of officer omitting duty for reward. MCL 750.123; MSA 28.318. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The common-law offense constitutes a felony while the statutory offense is punished as a misdemeanor. The trial court denied the motion regarding the conspiracy to obstruct Justice charge, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e but amended the indictment on the substantive obstruction charge to read \"officer omitting duty for reward\".\n\nThe only conviction obtained at trial was against defendant Davis for conspiracy to obstruct Justice. Defendant Pollard was acquitted on the conspiracy charge. Davis, Pollard and Meadows were all acquitted on the substantive charge of officer omitting duty for reward.\n\nDefendant appealed to the Court of Appeals, which reversed his conviction of conspiracy to obstruct Justice on the basis of Wharton's Rule of law. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The people appealed and leave to appeal was granted. 402 Mich 805(1977).\n\nThe question presented is whether Wharton's Rule of law precludes defendant's conviction of conspiracy where defendant alone was convicted of the common-law offense of conspiracy to obstruct Justice while found not guilty of the offense officer omitting duty for reward. We hold that Wharton's Rule does not apply to preclude defendant's conviction and so reverse the Court of Appeals.\n\nI\n\nEvidence offered by the people at trial indicated that Williams was selling narcotics at 3450 West Chicago in Detroit. On December 1, 1972, police officers raided the apartment. Testimony of prosecution witnesses further revealed that Davis and Officer Sherrod entered a bedroom and found Williams lying on the bed with a plastic sandwich-size bag containing five \"quarters\" of heroin and three \"quarters\" of \"mix\". Williams' supply of \"mix\" was stored in a bedroom closet.\n\nThe people's case then demonstrated that, when Sherrod left the room, Davis conferred with Williams. Davis told Williams he was aware of charges pending against Williams and that Williams could not afford to have new charges brought against him. Williams asked Davis to let him go, and Davis asked how much his failure to arrest would be worth. According to prosecution testimony, Williams stated that he would pay Davis $1,000. Davis agreed. The money was to be picked up at a house owned by Williams' brother.\n\nThe people's evidence showed that, following this conversation, Davis and Officer Pollard went into the bathroom. Williams then left with Pollard and Officer Meadows. The officers put Williams in a 1965 model red Chevrolet. After leaving the apartment building, Pollard advised Williams to telephone his brother and arrange to obtain the money. Williams testified at trial that Davis was the only person he had told about the need to stop at his brother's house for the money.\n\nThe people's evidence indicated that the three then proceeded to the brother's house where Williams secured the money and gave it to Pollard. Some dispute arose over the amount to be paid. As related by prosecution testimony, Pollard remarked to Williams at one point, \"You made the deal with Davis for a thousand dollars and that is what he is going to be looking for.\" After the money changed hands, Williams was released at a gas station on the corner of Livernois and Davison in Detroit.\n\nII\n\nWharton's Rule is based upon the principle articulated \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e in Francis Wharton's treatise on :\n\n\"When to the idea of an offense plurality of agents is logically necessary, conspiracy, which assumes the voluntary accession of a person to a crime of such a character that it is aggravated by a plurality of agents, cannot be maintained. * * * In other words, when the law says, 'a combination between two persons to effect a particular end shall be called, if the end be effected, by a certain name,' it is not lawful for the prosecution to call it by some other name; and when the law says, such an offense -- e.g., adultery -- shall have a certain punishment, it is not lawful for the prosecution to evade this limitation by indicting the offense as conspiracy.\" 2 Wharton, (12th ed), ยง 1604, p 1862.\n\nWharton's Rule \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e thus presents an exception to the general principle that a conspiracy and the substantive offense which is the object of the conspiracy are separate crimes for purposes of criminal prosecution. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Expressed in contemporary terms, the doctrine states that an agreement by two persons to commit a substantive crime cannot be prosecuted as a conspiracy where the substantive crime requires the participation of at least two persons. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe basic rationale \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e for the rule has been explained as follows:\n\n\"Conspiracies are made punishable because of the increased danger involved in group offenses. The possibility of abandonment of an unlawful plan before execution is greatly reduced if it is a group plan rather than an individual plan, whereas the risk that attempted execution will succeed is enhanced, and the extent of the potential harm often increased. Hence the unlawful combination is socially harmful because of the added danger and is punished for this reason. Some unlawful combinations, however, do not have any element of added danger.\n\n\"If the target offense requires concerted action and none participate other than the necessary parties there is no added danger because nothing is involved which will not be present whenever the offense is committed. In such a case there is no logical basis for conviction of other than the target offense, or an attempt, if the plan is carried that far, and a well-recognized exception to the general rule is that a combination 'to commit an offense which can only be committed by the concerted action of two persons does not amount to conspiracy' if only those two are involved.\" Perkins, (2d ed), p 620.\n\nConsequently, the principal thrust of the rule precludes a conspiracy charge only where concerted activity is legally necessary to commit the offense upon which the alleged conspiracy is based.\n\nIII\n\nThe people claim that Wharton's Rule does not apply to the instant case. It is their position that for purposes of analysis the substantive crime in the instant case was obstruction of Justice. The prosecution asserts that the application of the rule must be premised upon the nature of the substantive offense charged in the conspiracy. The people cite various cases for the proposition that the offense of obstruction of Justice can be completed by the act of one person. See, e.g., People v Boyd, 174 Mich 321; 140 NW 475 (1913); People v Alexander, 35 Mich App 281; 192 NW2d 371 (1971). Therefore, the people conclude Wharton's Rule is inapplicable to this case because obstruction of Justice does not require the participation of two persons and thus an agreement to commit that offense presents a greater danger to society than the substantive offense itself.\n\nThe defendant, however, contends that under the facts of this particular case the broad generic common-law offense of obstruction of Justice is virtually indistinguishable from the specific statutory offense charged of officer omitting duty for reward. They are in fact the same here, though the indictment was worded in terms of obstruction of Justice. The object of the alleged conspiracy was obstruction of Justice by omitting duty for reward. Defendant contends that the crime of obstructing Justice contains no elements in addition to those contained in the crime of officer omitting duty. Defendant further claims that, however the object crime is labeled, concerted action is necessary. The offense requires an agreement for reward between the giver and receiver of money. In return, a duty will be omitted. Thus, because the substantive crime perforce involves concerted activity, Wharton's Rule should be applied to bar conviction of conspiracy. Defendant argues there are no other parties to the crime, or elements of either crime, to distinguish one offense from the other.\n\nIV\n\nWe hold that Wharton's Rule is inapplicable to this case. As a practical matter, Wharton's Rule must be understood as a judicial presumption, applied where the legal nature of the substantive offense dictates. It depends upon the common-law or statutory elements of the substantive offense and not the evidence presented to prove the crime. Where the elements of the substantive offense are congruent with the conspiracy charged and indicate that two persons are required to commit the substantive offense, Wharton's Rule will apply to preclude prosecution for conspiracy to commit that offense. Iannelli v United States, 420 U.S. 770; 95 S Ct 1284; 43 L Ed 2d 616 (1975); Pereira v United States, 347 U.S. 1, 11; 74 S Ct 358; 98 L Ed 435 (1954); United States v Cordo, 186 F2d 144 (CA 2, 1951); Gebardi v United States, 287 U.S. 112; 53 S Ct 35; 77 L Ed 206 (1932); United States v Holte, 236 U.S. 140, 145; 35 S Ct 271; 59 L Ed 504 (1915).\n\nGebardi gives the following succinct account of this concept:\n\n\"Of this class of cases we say that the substantive offense contemplated by the statute itself involves the same combination or community of purpose of two persons only which is prosecuted here as conspiracy. * * * decisions * * * hold, consistently with the theory upon which conspiracies are punished, that where it is impossible under any circumstances to commit the substantive offense without cooperative action, the preliminary agreement between the same parties to commit the offense is not an indictable conspiracy either at common law * * * or under the federal statute.\" Gebardi, supra, 287 U.S. 121-122.\n\nThe fact that evidence adduced in a given case reveals that the substantive offense which is the object of a conspiracy was committed by two persons pursuant to an agreement does not preclude charging and convicting the parties of both the conspiracy offense and the substantive offense. Wharton's Rule acts as a bar to the conspiracy charge in the limited number of cases where the elements of the substantive offense make it impossible to commit it without cooperative action. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e See Lisansky v United States, 31 F2d 846, 849 (CA 4, 1929), cert den 279 U.S. 873; 49 S Ct 514; 73 L Ed 1008 (1929).\n\nThis fundamental concept is further articulated in 16 Am Jur 2d, Conspiracy, ยง 16, p 136:\n\n\" agreement by two persons to commit a particular crime cannot be prosecuted as a conspiracy where the crime is of such a nature that it necessarily requires the participation of two persons for its commission * * *. The rule does not apply where the substantive offense that is the object of the alleged conspiracy can be committed by a single person. In other words, where more parties participate in the conspiracy than are logically necessary for the commission of the substantive offense contemplated by the conspiracy, the Wharton rule does not apply.\" (Footnotes omitted.)\n\nThus, the focus for application of Wharton's Rule is upon the nature of the offense or, in other words, the elements of the crime rather than the particular factual setting of a case. See Iannelli, supra, 420 U.S. 780, citing United States v Holte, supra, 236 U.S. 145. The rule is not invoked merely because the facts involving the commission of a given substantive crime, which is the object of a conspiracy, reflect conduct pursuant to an agreement that logically requires two or more persons. If the same substantive offense can logically be committed by a single person, the rule is inapposite. It operates when the elements of the substantive crime necessarily require the participation of two persons and thus create no added social danger which a conspiracy charge would address. See Perkins, (supra) , p 620.\n\nThus, the Disposition of this case hinges upon whether the elements of the Michigan common-law offense of obstruction of Justice \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e are congruent with the elements of a conspiracy to commit such a crime. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e See Iannelli, supra, 420 U.S. 782.\n\nA public official's failure to perform an official duty relative to enforcing the s constitutes an obstruction of Justice at common law. People v Tenerowicz, 266 Mich 276, 282; 253 NW 296 (1934); Lorenson v Superior Court of Los Angeles County, 35 Cal 2d 49; 216 P2d 859 (1950). An obstruction of Justice, then, is essentially an intended interference with the orderly administration of the law. People v Ormsby, 310 Mich 291, 299-300; 17 NW2d 187 (1945). See also 67 CJS, Obstructing Justice or Governmental Administration, ยง 2, p 120; 58 Am Jur 2d, Obstructing Justice, ยง 2, pp 855-856; 3 Anderson, Wharton's and Procedure (1957 ed), ยง 1277, pp 623-624. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe offense has been judicially characterized by our Court in this way:\n\n\"The term, to obstruct Justice, connotes an interference with the orderly administration of law. In 46 CJ, p 868, it is stated, 'The phrase \"obstructing Justice\" means impeding or obstructing those who seek Justice in a court, or those who have duties or powers of administering Justice therein.'\n\n\"To establish a conspiracy to obstruct Justice would require evidence indicating some agreement, understanding, plan, design or scheme to commit acts which obstructed or were intended to obstruct the administration of law.\" (Citations omitted.) People v Ormsby, supra, 299-300. See also People v Coleman, 350 Mich 268, 274; 86 NW2d 281 (1957); People v Boyd, supra, 326-327.\n\nThus, the Ormsby Court, upon defining what the common-law crime of obstruction of Justice means, also recognized that obstruction of Justice may be charged as the substantive offense of a conspiracy. This Conclusion is further illustrated by People v Alexander, 35 Mich App 281; 192 NW2d 371 (1971). In Alexander, the defendants were charged both with statutory conspiracy to commit the common -law offense of obstruction of Justice and with the substantive crime of obstructing Justice.\n\nThe crime of obstructing Justice is not an inherently joint act. See, e.g., People v Krum, 374 Mich 356, 361-362; 132 NW2d 69 (1965); People v Boyd, supra, 326-327; People v Alexander, supra, 283. To paraphrase the concise explanation offered in Gebardi, it is not impossible under any circumstances to commit the substantive offense of obstruction of justice without cooperative action. See Gebardi, supra, 287 U.S. 121-123.\n\nIt is of no consequence that the original indictment and the facts of this case reflected the possible participation of two or more persons in the obstruction scenario. If defendant Davis, standing alone, had purposefully refrained from performing his public duty by failing to arrest Williams, he could have been charged with and convicted of this offense. No concert of activity nor payment of a reward need be involved.\n\nAccordingly, the substantive offense of the conspiracy charge, an obstruction of Justice at common law, does not require concerted action. Williams was not a necessary party to the commission of this offense. The charged conspiracy does not necessarily involve \"an offense which can only be committed by the concerted action of two persons\". See Perkins, (supra) , p 620.\n\nHence, when the offense of unlawfully obstructing an arrest, which may be perpetrated by a single actor, is conducted by a combination of two or more persons, an added danger to society evolves. The likelihood of abandonment of the obstruction may be diminished and the success of this unlawful endeavor may be enhanced. See Callanan v United States, 364 U.S. 587, 593-594; 81 S Ct 321; 5 L Ed 2d 312 (1961). Therefore, Wharton's Rule, which operates only when no added threat to the community is created, does not apply in this case.\n\nV\n\nThe congruence of a conspiracy and the substantive offense represents the primary inquiry in any evaluation concerning the application of Wharton's Rule. However, several secondary guidelines exist as well. These guidelines have been set forth by the United States Supreme Court in Iannelli :\n\n\"The classic Wharton's Rule offenses -- adultery, incest, bigamy, duelling -- are crimes that are characterized by the general congruence of the agreement and the completed substantive offense. The parties to the agreement are the only persons who participate in commission of the substantive offense, and the immediate consequences of the crime rest on the parties themselves rather than on society at large. Finally, the agreement that attends the substantive offense does not appear likely to pose the distinct kinds of threats to society that the law of conspiracy seeks to avert.\" (Citation and footnotes omitted.) 420 U.S. 782-783.\n\nAt the outset, we note that in this case the substantive offense to the conspiracy, obstruction of Justice, was not eventually charged. A conspiracy to obstruct Justice stands apart from the substantive crime asserted, officer omitting duty for reward. Furthermore, we do not find that the immediate consequences of the offense in this case rest solely with the parties rather than on society at large. Williams' dealings in narcotics, the continuation of which would have been assured by defendant's inaction, could have constituted a real and substantial danger to the public. This case is categorically different from the offenses traditionally associated with Wharton's Rule, such as adultery, incest, bigamy and dueling. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e An agreement to obstruct Justice by failing to arrest a narcotics dealer is hardly an act that entails consequences only for the parties themselves. Such an act compromises public trust and clearly could affect others. See Iannelli, supra, 420 U.S. 783-784.\n\nFurthermore, the agreement here does pose the distinct kind of threat to society that conspiracy charges are intended to avert. One of the primary reasons for punishing a conspiracy separately from a substantive offense is the greater danger to society inherent in the concept of combination:\n\n\"This settled principle derives from the reason of things in dealing with socially reprehensible conduct: collective criminal agreement -- partnership in crime -- presents a greater potential threat to the public than individual delicts. Concerted action both increases the likelihood that the criminal object will be successfully attained and decreases the probability that the individuals involved will depart from their path of criminality. Group association for criminal purposes often, if not normally, makes possible the attainment of ends more complex than those which one criminal could accomplish. Nor is the danger of a conspiratorial group limited to the particular end toward which it has embarked. Combination in crime makes more likely the commission of crimes unrelated to the original purpose for which the group was formed. In sum, the danger which a conspiracy generates is not confined to the substantive offense which is the immediate aim of the enterprise.\" Callanan v United States, supra, 364 U.S. 593-594.\n\nWharton's Rule is primarily grounded upon the premise that, where both the conspiracy and the substantive offense require combination, the threats normally associated with the concept of conspiracy apply equally to both. Therefore, allowing separate prosecution for conspiracy becomes less defensible.\n\nHowever, in this case, obstruction of Justice does not require concerted criminal activity. Consequently, the evils inherent in conspiracy represent a separate threat to society, which may fairly be addressed in a distinct charge. See, generally, People v Ormsby, supra, 297-298; People v Chambers, 279 Mich 73, 77; 271 NW 556 (1937).\n\nVI\n\nIn this case, Davis was not eventually charged with common-law obstruction of Justice, but with conspiracy to accomplish it. He was also charged with the offense of officer omitting duty for reward.\n\nOriginally, the Wayne County Citizens Grand Jury returned a two-count indictment charging conspiracy to obstruct Justice and obstruction of Justice. See MCL 750.157a; MSA 28.354(1); MCL 750.505; MSA 28.773. Upon pretrial motion, the able trial Judge altered the case by quashing the count of obstruction of Justice and allowed the prosecutor to amend the indictment to charge officer omitting duty for reward. MCL 750.123; MSA 28.318. The conspiracy count was left unchanged.\n\nThe trial court framed its instruction concerning the conspiracy to obstruct Justice as follows:\n\n\"To establish a conspiracy to obstruct Justice requires evidence of an unlawful agreement to commit acts which obstruct or are intended to obstruct the administration of the law. A conspiracy with or among public officials not to perform an official duty relative to the enforcement of s constitutes an obstruction of Justice, and is an indictable offense. The term, 'to obstruct Justice' connotes, or means, an interference with the orderly administration of the law. The phrase means impeding or obstructing those who seek Justice in court, or those who have duties or powers of administering Justice therein.\n\n\"If you are satisfied beyond a reasonable doubt that either defendant Rudy Davis or defendant Craig Pollard, or both of them, conspired together or along with Charles Williams to unlawfully agree not to arrest Mr. Williams for a narcotics offense, and to, instead, handle the matter outside of court by agreeing to accept a bribe or reward, then I instruct you that such an agreement constitutes a conspiracy to obstruct Justice as it interferes with, impedes and obstructs the administration of the law and Justice.\"\n\nThe charge to the jury concerning officer omitting duty for reward was offered in these terms:\n\n\"The statute before you consists of three elements, each of which you must find proven beyond a reasonable doubt, before you can return a verdict of guilty as to any, or all of the defendants.\n\n\"First, you must find that the individual defendant charged was, on or about December 1, 1972, a police officer.\n\n\"Secondly, you must find that the defendant, or defendants, on or about December 1, 1972, received money, or any other valuable thing from Charles Williams.\n\n\"Thirdly, you must find, beyond a reasonable doubt, that the money or other valuable thing, if any, was received by the defendant, or defendants, as consideration, reward or inducement, for omitting or delaying to arrest Charles Williams, or for omitting or delaying to perform any duty pertaining to their status as a police officer.\"\n\nThe gist of the conspiracy count in this case includes the formulation of an agreement not to perform the official duty of arresting Charles Williams. Following the court's instruction, the jury must have concluded beyond a reasonable doubt that defendant Davis agreed with Charles Williams not to arrest Williams in order to find Davis guilty of the conspiracy charge.\n\nIn contrast, the gravamen of the charged offense of officer omitting duty for reward is the receipt by the officer of a reward for omitting or delaying performance of a duty, whether or not such an omission or delay actually occurs. The Court of Appeals has properly characterized the essence of this offense:\n\n\"The gravamen of the offense is not delaying or omitting the performance of duty, just as accomplishment of the unlawful agreement is not the gravamen of the offense of conspiracy. The gist of the offense and the wrong the statute punishes is receipt of money as consideration, reward, or inducement for omitting or delaying performance, whether such omission or delay occurs or not. If it were otherwise, the sheriff could receive the money for omitting or delaying performance of duty and remain immune from prosecution by the simple expedient of refusing to omit or delay performance of duty.\" (Citations omitted.) People v Bommarito, 11 Mich App 328, 332; 161 NW2d 131 (1968).\n\nIn order to secure a conviction under the charge of officer omitting duty for reward, it is unnecessary to prove any kind of agreement or meeting of minds as to whether the officer would actually omit his duty. It is entirely possible that the officer involved would have no intention of failing to carry out his responsibility. Also, the people need not prove that the officer in fact did omit his duty. \"The gist of the offense and the wrong the statute punishes is receipt of money as consideration, reward, or inducement for omitting or delaying performance.\" Id., 332.\n\nAccordingly, the offense charged of officer omitting duty for reward is not the same offense as that which underlies the conspiracy charged in this case. The conspiracy count primarily relates to an agreement to commit the offense of unlawfully failing to arrest, a common-law obstruction of Justice. The officer omitting duty charge pertains to the offense of actually receiving money for the purpose of unlawfully failing to arrest.\n\nSignificantly, then, the jury had before it two totally different questions to resolve in determining the guilt or innocence of defendant Davis with respect to these two charges. On the one hand, because Davis could alone obstruct Justice, their finding of conspiracy to do so in conjunction with Williams was totally plausible and did not violate Wharton's Rule. Further, because the common-law obstruction charge and the charge of officer omitting duty involve clearly different elements, there exists a logical basis for the jury's determination of guilt regarding the conspiracy charge as well as the jury's finding of not guilty as to the charge of officer omitting duty.\n\nThe jury could have believed that Davis agreed with Williams to obstruct Justice by failing to arrest, but was not convinced beyond a reasonable doubt that Davis received money for this purpose. The verdicts were consistent.\n\nVII\n\nIn Conclusion, an analysis of the specific offenses in this case and their relation to guidelines suggested by existing authority requires a finding that Wharton's Rule does not apply to preclude defendant's conviction of conspiracy to obstruct Justice. Therefore, the opinion of the Court of Appeals is reversed and the case is remanded to allow plenary consideration of defendant's remaining claims of error.\n\nReversed and remanded to the Court of Appeals for further proceedings.\n\n\u003cspan class=\"fn\"\u003e1. The indictment charged a conspiracy in violation of MCL 750.505; MSA 28.773 and MCL 750.157a; MSA 28.354(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 750.157a; MSA 28.354(1) provides in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who conspires together with 1 or more persons to commit an offense prohibited by law, or to commit a legal act in an illegal manner is guilty of the crime of conspiracy punishable as provided herein:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) Except as provided in paragraphs (b), (c) and (d) if commission of the offense prohibited by law is punishable by imprisonment for 1 year or more, the person convicted under this section shall be punished by a penalty equal to that which could be imposed if he had been convicted of committing the crime he conspired to commit and in the discretion of the court an additional penalty of a fine of $10,000.00 may be imposed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 750.505; MSA 28.773 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who shall commit any indictable offense at the common law, for the punishment of which no provision is expressly made by any statute of this state, shall be guilty of a felony, punishable by imprisonment in the state prison not more than 5 years or by a fine of not more than $10,000.00, or both in the discretion of the court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The first count of the indictment charged that defendant and others\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"did wickedly, maliciously and feloniously conspire, combine and confederate and agree together and with each other and divers other persons to obstruct the due course of Justice by willfully and unlawfully failing to perform official duties in exchange for the payment of money\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. People v Rudy Davis, 402 Mich 805 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. 2 Wharton, (12th ed), ยง 1604, p 1862.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The rationale underlying the prosecution of separate conspiracy charges is based on the increased dangers presented by the agreement between the plurality of actors. As stated in Callanan v United States, 364 U.S. 587, 593-594; 81 S Ct 321; 5 L Ed 2d 312 (1961):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"This settled principle derives from the reason of things in dealing with socially reprehensible conduct: collective criminal agreement -- partnership in crime -- presents a greater potential threat to the public than individual delicts. Concerted action both increases the likelihood that the criminal object will be successfully attained and decreases the probability that the individuals involved will depart from their path of criminality. Group association for criminal purposes often, if not normally, makes possible the attainment of ends more complex than those which one criminal could accomplish. Nor is the danger of a conspiratorial group limited to the particular end toward which it has embarked. Combination in crime makes more likely the commission of crimes unrelated to the original purpose for which the group was formed. In sum, the danger which a conspiracy generates is not confined to the substantive offense which is the immediate aim of the enterprise.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. MCL 750.123; MSA 28.318 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any sheriff, coroner, constable, peace officer, or any other officer authorized to serve process or arrest or apprehend offenders against who shall receive from a defendant or from any other person any money or other valuable thing or any service or promise to pay or give money or to perform or omit to perform any act as a consideration, reward or inducement, for omitting or delaying to arrest any defendant, or to carry him before a magistrate, or for delaying to take any person to prison, or for postponing the sale of any property under an execution, or for omitting or delaying to perform any duty pertaining to his office, shall be guilty of a misdemeanor, punishable by imprisonment in the county jail not more than 6 months or by fine of not more than 250 dollars: Provided, That if such defendant shall be charged with an offense against the s of the state of Michigan, any officer convicted under the provisions of this section, may, in the discretion of the court, be punished by any fine or by any term of imprisonment or both such fine and imprisonment, within the limits fixed by the statute which such defendant is charged with having violated.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. To convict defendant under the first count of the indictment, the jury must have found beyond a reasonable doubt that defendant entered into an agreement to omit his duty for reward. There is no inconsistency between this verdict and the verdict of not guilty under the second count. Although this agreement, the officer's receipt of a promise to pay money, is sufficient to support a conviction under MCL 750.123; MSA 28.318, the instructions given to the jury required a finding that defendant \"received money, or any other valuable thing from Charles Williams\" in order to convict him under the second count. Since it appears that defendant did not actually receive the money or any other valuable thing, there is no inconsistency between the verdicts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. MCL 750.117; MSA 28.312 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who shall corruptly give, offer or promise to any public officer, agent, servant or employe, after the election or appointment of such public officer, agent, servant or employe and either before or after such public officer, agent, servant or employe shall have been qualified or shall take his seat, any gift, gratuity, money, property or other valuable thing, the intent or purpose of which is to influence the act, vote, opinion, decision or judgment of such public officer, agent, servant or employe, or his action on any matter, question, cause or proceeding, which may be pending or may by law be brought before him in his public capacity, or the purpose and intent of which is to influence any act or omission relating to any public duty of such officer, agent, servant or employe, shall be guilty of a felony.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Iannelli v United States, 420 U.S. 770, 782-783; 95 S Ct 1284; 43 L Ed 2d 616 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 402 Mich 805 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The statute provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Officer omitting duty for reward -- Any sheriff, coroner, constable, peace officer, or any other officer authorized to serve process or arrest or apprehend offenders against who shall receive from a defendant or from any other person any money or other valuable thing or any service or promise to pay or give money or to perform or omit to perform any act as a consideration, reward or inducement, for omitting or delaying to arrest any defendant, or to carry him before a magistrate, or for delaying to take any person to prison, or for postponing the sale of any property under an execution, or for omitting or delaying to perform any duty pertaining to his office, shall be guilty of a misdemeanor, punishable by imprisonment in the county jail not more than 6 months or by fine of not more than 250 dollars: Provided, That if such defendant shall be charged with an offense against the s of the state of Michigan, any officer convicted under the provisions of this section, may, in the discretion of the court, be punished by any fine or by any term of imprisonment or both such fine and imprisonment, within the limits fixed by the statute which such defendant is charged with having violated.\" MCL 750.123; MSA 28.318.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The indictment charged a conspiracy in violation of MCL 750.505; MSA 28.773 and MCL 750.157a; MSA 28.354(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 750.505; MSA 28.773 reads:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who shall commit any indictable offense at the common law, for the punishment of which no provision is expressly made by any statute of this state shall be guilty of a felony, punishable by imprisonment in the state prison not more than 5 years or by a fine of not more than $10,000.00, or both in the discretion of the court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMCL 750.157a; MSA 28.354(1) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who conspires together with 1 or more persons to commit an offense prohibited by law, or to commit a legal act in an illegal manner is guilty of the crime of conspiracy * * *.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUnder the statute, Davis is subject to imprisonment on the conspiracy count for a term \"equal to that which could be imposed if he had been convicted of committing the crime he conspired to commit\". MCL 750.157a(a); MSA 28.354(1)(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe substantive count of the indictment also charged a common-law offense in violation of MCL 750.505; MSA 28.773.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The Judge was of the opinion that the inadequacy of the penalties for officer omitting duty for reward was such that it was \"neither rational nor protective of the public interest\", but as the statute has been construed by this Court, People v Romanski, 213 Mich 636; 182 NW 121 (1921); People v McDonald, 216 Mich 234; 184 NW 860 (1921), a police officer's receipt of a bribe in exchange for nonperformance of duty must be prosecuted under the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHe saw the conspiracy count differently:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Two officers who conspire jointly, and with another, to subvert the legal processes and to take bribe money from an arrestee are committing themselves to something larger than an unlawful agreement to violate 750.123 [MCL 750.123; MSA 28.318, officer omitting duty for reward]. By their joint conduct they, as law enforcement officers, are conspiring to impede and obstruct those who seek Justice in a court (literally and figuratively, the People of the State of Michigan) or those who have duties or powers of administering Justice therein.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe jury's determination that Pollard was not a part of the conspiracy negates the objections raised by the trial Judge' to amending the conspiracy count of the indictment to charge a conspiracy to violate the officer omitting duty for reward statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 \"An agreement by two persons to commit a particular crime cannot be prosecuted as a conspiracy when the crime is of such a nature as to necessarily require the participation of two persons for its commission.\" 1 Anderson, Wharton's and Procedure (1957 ed), ยง 89, p 191.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 I agree with my colleague that Wharton's Rule focuses upon \"the nature of the offense or * * * the elements of the crime rather than the particular factual setting of a case\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMy colleague's Discussion on the whole makes clear that, in speaking of \"\" between the elements of the target offense and the elements of a conspiracy to commit that offense, he means only that the agreement charged as conspiracy must also inhere in the target offense. Iannelli v United States, 420 U.S. 770, 782; 95 S Ct 1284; 43 L Ed 2d 616 (1975), described the traditional Wharton's Rule offenses as \"characterized by the general congruence of the agreement and the completed substantive offense\". To require a congruence of elements between substantive offense and conspiracy would, however, establish a test inherently impossible to meet. The agreement between the participant will be inherent in the cooperative conduct constituting the substantive offense and thus not regarded as a distinct element of that offense, and proof of the substantive offense will require a showing of some overt behavior beyond that necessary to establish the conspiracy. See Iannelli, supra, p 785, fn 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Blackstone's compilation did not purport to be comprehensive, and it spoke of the \"offences against public Justice\" as separate offenses, not as one offense:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The species of crimes, which we have now before us * * *. I shall therefore confine myself principally to general definitions or descriptions of this great variety of offences, and to the punishments inflicted by law for each particular offence ; * * *.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The crimes and misdemeanors that more especially affect the commonwealth, may be divided into five species; viz. offences against public Justice, against the public peace, against public trade, against the public health, and against the public police or economy : of each of which we will take a cursory view in their order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"First, then, of offences against public Justice: some of which are felonious, whose punishment may extend to death; others only misdemeanors. I shall begin with those that are most penal, and descend gradually to such as are of less malignity.\" 4 Blackstone, Commentaries, ch 10, pp 127-128 (emphasis changed).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere follows a separate Discussion of each of the 22 offenses stated. Id., pp 128-142.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 See The King v Steventon, 2 East 362; 102 Eng Rep 407 (1802).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The first 12 editions of Wharton's treatise on (1846 to 1932) do not mention \"obstructing Justice\" as a separate substantive offense, although chapters are devoted to bribery and \"extortion and misconduct in office\". \"Obstructing Justice\" first appears as a chapter heading in 3 Anderson, (supra) , ch 48, pp 623-643.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe various editions of Bishop's commentaries on include a brief chapter on \"obstructing Justice and government\" which notes a handful of miscellaneous statutes and decisions, but the Discussions of bribery and malfeasance in office are more extensive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee, 2 Bishop, (2d ed, 1859), ยงยง 76-79, 825-829, 857-859, pp 61-64, 583-586, 609-610; 2 Bishop, (7th ed, 1882), ยงยง 85-89, 971-982, 1009-1013, pp 50-54, 551-556, 572-573.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Bishop's New Criminal Procedure (4th ed, 1896), ch 49, ยง 879, p 401, declares under the heading \"Obstructing Justice and Government\":\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. Various Offences -- named and unnamed, at common law and statutory, are within the subject of this chapter. But --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. Elsewhere in this Volume -- we have considered Barratry, Bribery, Champerty and Maintenance, Counterfeiting the Coin, and Embracery; and further on, Perjury, Prison Breach, and the like, will come under review.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eClark \u0026 Marshall, Crimes (2d ed, 1905), pp 652-653, declares that \" act which injuriously affects, obstructs, or corrupts the administration of public Justice, or the administration of the government, or which has a direct tendency to do so, is a misdemeanor at common law\", and, after listing many of the same offenses enumerated by Blackstone, states: \" These specific offenses will be considered in the following sections.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. 29 Cyclopedia of Law and Procedure, Obstructing Justice, pp 1325-1339.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In State v Sotherlen, SC Law Reports (Harper) 414 (1824), it is said, citing Blackstone:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" obstruction of the execution of lawful process is an offence against public Justice of a very high and presumptuous nature, and, as such, is punishable by indictment. 4 [Blackstone, Commentaries] 128.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eState v Hailey, 2 SC Law Reports (Strobhart) 73, 76 (SC App, 1847), speaks more generally of the same common-law offense and, citing Blackstone, states: \" Any obstruction of lawful process, whether it be by active means or the omission of a legal duty, is an indictable offence.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn considering whether the seizure of a writ of attachment from a Justice of the peace constituted an indictable offense at common law, the Vermont Supreme Court said in 1830: \"In order to make the act done by this respondent, which is but a trespass, an offence against public Justice, it must have been done with an intent to prevent the course of public Justice.\" State v Lovett, 3 Vt 110, 113-114 (1830).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn an 1836 case arising out of an indictment charging that the defendant had, \"with intent to obstruct and impede the due course of Justice\", endeavored to \"persuade and induce\", \"hinder and prevent\" a witness from testifying at trial, the same court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"An attempt even to induce a witness by threats or promises or any other means to disregard his obligation to attend as a witness upon the trial of a public prosecution * * * is undoubtedly a high-handed offence, and as such should be severely punished.\" State v Keyes, 8 Vt 57, 65 (1836).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne statement in the Keyes opinion tends to obscure the distinctions between the common-law offenses: \"The essence of the offence is obstructing the due course of Justice. This has always been held indictable, as a misdemeanor, at common law.\" Id. (Emphasis supplied.) A subsequent passage indicates, however, that the court intended no such implication:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"And the doing of any act tending to obstruct the due course of public Justice, has always been held indictable as a misdemeanor at common law. Bribing, intimidating or persuading a witness not to testify, or not to attend court, are each among the readiest and the most corrupting of this class of misdemeanors.\" Id., p 67 (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBy 1847, in affirming the conviction of a defendant who, according to the indictment, \"contriving and intending to obstruct and impede the due course of Justice, * * * did endeavor to dissuade, hinder and prevent [a witness] from appearing and testifying before the Grand Jury\", the same court was speaking as if several types of obstructive conduct all constituted the same offense:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"To thwart or obstruct the due administration of Justice by violence, bribery, threats, or other unlawful means, whether in preventing the attendance of witnesses, jurymen, or other officers of court is a high handed offence, which strikes at the vitals of judicial proceedings, and subjects to severe animadversion in every well ordered community.\" State v Carpenter, 20 Vt 9, 12 (1847) (emphasis supplied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAn early Massachusetts decision, Commonwealth v Reynolds, 80 Mass 87, 91; 74 Am Dec 665 (1859), arising from an indictment employing virtually the identical language used in Carpenter, may have helped to fuel the confusion. The opinion declares: \"This indictment charges the defendant with an offence that is indictable at common law\", and the consistently refer to an \"indictment for dissuading, hindering and preventing a witness from appearing before a court\". In rejecting an objection that the indictment failed to allege that any hindrance or obstruction of public Justice actually occurred, the Court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" offence is the obstruction of 'the due course of Justice.' This is what is alleged in the only two precedents which we have found; (The King v Steventon, 2 East [362]; and 2 [Chitty, ], 235;) and what this indictment alleges to have been the defendant's intent and purpose. And the 'due course of Justice' means not only the due conviction and punishment, or the due acquittal and discharge, of an accused party, as Justice may require; but it also means the due course of proceedings in the administration of Justice. By obstructing those proceedings, public Justice is obstructed.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn State v Baller, 26 W Va 90, 93-94; 53 Am Rep 66 (1885), defendant was indicted for furnishing a second person with money to be used to induce a witness not to testify in a pending criminal case against the defendant \"whereby the attempted to obstruct and impede the administration of Justice * * *\". The court's statement of the question to be decided -- \"Was * * * an allegation [that the inducement was actually presented to the witness] necessary to complete the offence charged in the indictment, an attempt to obstruct and impede the administration of Justice?\" -- may suggest that the court combined the several common-law offenses under the general heading of obstruction, but a subsequen for his testimony against the officers charged in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Chitty's , first published in England in 1816 and in this country in 1819, includes an extensive collection of forms of indictments. One chapter entitled \"For Offenses Against Public Justice\" arranges indictments under subheadings for the various crimes. Although Chitty's work, which recognized the existence of a multiplicity of common law offenses, was widely cited -- Carpenter, supra, pp 12-13; Reynolds, supra, p 91; Baller, supra, p 92 -- some courts and prosecutors may have mistaken the frequent references to an unlawful obstructive purpose found in the indictments for a description of the conduct constituting the offense. See Reynolds, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. 1 Stat 112, ยง 22; 4 Stat 487; Code of W Va (2d ed, 1887), ch 147, ยง 30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. State v Keyes, supra; State v Horner, 15 Del 504; 26 A 73, 41 A 139 (1893).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. \" arbitrary and discriminatory enforcement is to be prevented, laws must provide explicit standards for those who apply them. A vague law impermissibly delegates basic policy matters to policemen, Judges, and juries for resolution on an ad hoc and subjective basis, with the attendant dangers of arbitrary and discriminatory application.\" Grayned v City of Rockford, 408 U.S. 104, 108-109; 92 S Ct 2294; 33 L Ed 2d 222 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The King v Mills, 2 Show K B 181; 89 Eng Rep 877 (1682) (sheriff indicted for neglecting to execute a warrant for the apprehending of a constable who had refused to do his office); Crouther's Case, 1 Cro Eliz 654; 78 Eng Rep 893 (1598) (constable indicted for refusing to make hue and cry after notice of a burglary); Regina v Wyatt, 2 Lord Raym 1189; 92 Eng Rep 286 (1705) (constable indicted for failing to execute a warrant directed to him by a Justice of the peace to levy a penalty upon one convicted of deer stealing); Rex v Pinney, 5 Car \u0026 P 254; 172 Eng Rep 962 (1832) (magistrate charged by information with failing to read riot act to unlawful assembly); Rex v Kennett, 5 Car \u0026 P 282; 172 Eng Rep 976 (1781) (same); The King v Antrobus, 2 Ad \u0026 E 788; 111 Eng Rep 304 (1835) (sheriff charged with neglect of duty for failing to execute a condemned criminal).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. \"A Justice of the peace is indictable for misbehavior in his office, when he acts partially, or oppressively, or from malicious or corrupt motive. Wherever, on a Justice or elsewhere, a public duty is imposed, a failure to perform it is indictable. Thus, in New York, it was held clearly indictable to discharge an offender, without taking sufficient sureties, with intent to pervert the course of Justice. * * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"All acts of malfeasance in office, if done with corrupt intent, are indictable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In an indictment against an officer of Justice, for misbehavior in office, it is necessary that the act imputed as misbehavior be distinctly and substantially charged to have been done with corrupt, partial, malicious, or improper motives, and above all with knowledge that it was wrong, though there are no technical words indispensably required in which the charge of corruption, partiality, \u0026c; shall be made.\" Wharton, (2d ed), pp 732-733 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"ยง 972. Criminal Responsibility of Inferior Magistrates. -- We have seen, that, according to the more common doctrine, Justices of the peace and other inferior magistrates may be holden criminally for malfeasance, even in respect of their judicial conduct. Most of the cases in the English books concern the granting of --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Criminal Information. -- In this, the court acts on its discretion as well as the law; and, though it cannot grant an information where an indictment would not lie, it may refuse one. As foundation for an information, --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Corruption. -- The court requires evidence of something more than a mere mistake concerning their duty; it requires corruption. Corruption, also, is necessary to sustain an indictment. * * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"ยง 976. Ministerial distinguished from Judicial. -- Inferior magistrates, like Justices of the peace, have duties of a ministerial sort; and, in reason, and it is believed in authority, they may be punishable for malfeasance or non-feasance in respect of such a duty, where they would not be if it were judicial. * * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"ยง 980. Discretionary Functions. -- If an officer's functions are discretionary, he cannot be punished for honestly exercising them by declining to do a thing.\" 2 Bishop, (7th ed, 1882), pp 551-555.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Miller, Prosecution: The Decision to Charge a Suspect with a Crime (Boston: Little, Brown \u0026 Co, 1969), pp 154 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. LaFave, Arrest: The Decision to Take a Suspect into Custody (Boston: Little, Brown \u0026 Co, 1965), pp 63 et seq.; Davis, Administrative Law of the Seventies, ยง 4.00-1, pp 117-118; American Bar Association, Standards Relating to the Administration of Criminal Justice, The Urban Police Function, ยง 4.1, p 19; President's Commission on Law Enforcement and Administration of Justice, Task Force Report: The Police (Washington, DC: US Government Printing Office, 1967), pp 21-25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The Court of Appeals properly recognized that, where common-law obstruction of Justice rather than a statutory offense is charged, it is necessary to examine the particular obstructive conduct involved:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"We look then instead to the language of the indictment and instructions, both of which alleged by necessary implication that a plurality of actors were involved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Thus, it is no answer to say that theoretically a single person can obstruct Justice, when the controlling language charges that one alleged conspirator obstructed Justice and another prompted the obstruction by the payment of money.\" People v Davis, unpublished per curiam opinion (Docket No. 21900, June 21, 1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. United States v Dietrich, 126 F 664 (CCD Neb, 1904).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Dietrich involved an agreement between an office-seeker and a congressman for payment of a bribe in exchange for exertion of influence. Agreeing to give and agreeing to receive a bribe were both made substantive offenses by the same statute. Comparable statutes defined the substantive offenses in People v Wettengel, 98 Colo 193; 58 P2d 279 (1935) (bribery of a district attorney), and State v Aircraft Supplies, Inc, 45 NJ Super 110; 131 A2d 571 (1957) (commercial bribery of a corporate employee).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Iannelli v United States, supra, pp 782-783.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Id., p 782.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See, e.g., 2 Wharton, (12th ed), ยง 1604, p 1862, and 2 Wharton, (7th ed), ยง 2289, p 634.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Shannon v Commonwealth, 14 Pa 226 (1850); Miles v State, 58 Ala 390 (1877); and State v Law, 189 Iowa 910; 179 NW 145 (1920).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. \"After the Shannon * * * case, the principle established there was used most often with gambling offenses and with charges of bribery.\" Marcus, Prosecution and Defense of Criminal Conspiracy Cases (NY: Matthew Bender, 1978), ยง 3.02[2], p 3-5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee United States v Dietrich, supra, and other cases cited in fn 45, (infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See United States v New York C \u0026 H R R Co, 146 F 298 (CCSD NY, 1906); Vannata v United States, 289 F 424 (CA 2, 1923); State v McLaughlin, 132 Conn 325; 44 A2d 116 (1945); Developments in the Law, Criminal Conspiracy, 72 Harv L Rev 920, 955 (1959).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. 1 Anderson, (supra) , p 193. See, also, LaFave \u0026 Scott, , ยง 62, p 493; Perkins, (2d ed), p 621; Iannelli v United States, supra, p 782, fn 15; Thomas v United States, 156 F 897, 903-905 (CA 8, 1907); Old Monastery Co v United States, 147 F2d 905, 907-908 (CA 4, 1945); State v Clemenson, 123 Iowa 524; 99 NW 139 (1904). But see United States v Sager, 49 F2d 725 (CA 2, 1931); United States v Hagan, 27 F Supp 814 (WD Ky, 1939); People v Wettengel, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The results reached in some of the bribery cases suggest that so long as both the giver and the taker are necessary to the substantive offense, it is immaterial how many parties participate on each \"side\" of the bilateral transaction. See State v Aircraft Supplies, Inc, supra; United States v Sager, supra ; and People v Wettengel, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See, e.g., Curtis v United States, 67 F2d 943, 947 (CA 10, 1933) (\"conspiracy to commit certain crimes will not lie against the participants in the consummated objective offense\"); United States v Zeuli, 137 F2d 845, 846 (CA 2, 1943) (\"if a crime necessarily involves the mutual cooperation of two persons, and if they have in fact committed the crime, they may not be convicted of a conspiracy to commit it\"); United States v Burke, 221 F 1014, 1015 (SD NY, 1915), rev'd on other grounds sub nom Salas v United States, 234 F 842 (CA 2, 1916); and United States v Grand Trunk R Co of Canada, 225 F 283, 286 (WD NY, 1915).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. \"In such a case there is no logical basis for conviction of other than the target offense, or an attempt, if the plan is carried that far.\" Perkins, (supra) , p 620.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee, also, Anno: Conspiracy to commit adultery or other offense which can only be committed by the concerted action of the parties to it, 11 ALR 196: \"And if the offense is not committed, the agreement to commit it on the part of the immediate persons concerned is a mere intent, not punishable as a conspiracy.\" Anderson's statement of the rule also omits the limitation stated in the text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. According to Iannelli, supra, p 782, Wharton's Rule is \"a judicial presumption, to be applied in the absence of legislative intent to the contrary\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In the instant case, the charge required the jury to find that the officers had \"received money, or any other valuable thing from Charles Williams\" in order to convict them of the substantive offense. Under the statute, however, an agreement which violates the statute may be founded upon a mere promise of reward. See part VI-B, (infra). The verdict indicates that the jury concluded that Davis and Williams agreed that Davis would not arrest Williams in exchange for consideration to be paid to Davis by Williams, but that none of the officers ever actually received anything.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHad the jury been correctly instructed regarding the scope of the officer omitting duty for reward statute, it may well have found that any such agreement between Davis and Williams established Davis' guilt of the substantive offense, which was complete when Davis indicated his acceptance of Williams' offer by directing some departure from the normal process of conveying arrestees to jail.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen the officer omitting duty for reward statute is correctly construed, it becomes apparent that it is impossible to have an inchoate agreement between one officer and one defendant to commit this offense which does not itself constitute an agreement proscribed by the statute. Based as it was on an erroneous charge on the requisites of the substantive offense, the jury's Conclusion that no substantive crime had occurred is no bar to the application of Wharton's Rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. 1838 Rev Stat, part IV, tit 1, ch 6; 1846 Rev Stat, ch 156.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. People ex rel Wayne County Prosecutor v Recorder's Court Judge, 59 Mich 529, 544; 26 NW 694 (1886).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. 1838 Rev Stat, part IV, tit 1, ch 6, ยง 22; 1846 Rev Stat, ch 156, ยง 21. See fn 2, (supra) , for current text which is a revision of the Revised Statutes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. People v Bommarito, 11 Mich App 328; 161 NW2d 131 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The statutory scheme is comprehensive, covering all culpable neglects of duty and superseding all common-law offenses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAnother statute provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"When any duty is or shall be enjoined by law upon any public officer, or upon any person holding any public trust or employment, every wilful neglect to perform such duty, where no special provision shall have been made for the punishment of such delinquency, shall be deemed a misdemeanor, punishable by imprisonment in the county jail for not more than 1 year or by a fine of not more than 500 dollars.\" MCL 750.478; MSA 28.746, originally enacted as 1846 Rev Stat, ch 156, ยง 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo characterize the target offense as does my colleague is to implicate the question whether the foregoing statutory offense supersedes that common-law offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAlthough it has been said that the failure of a sheriff or undersheriff \"to enforce the law or prevent a violation of which he is cognizant\" constitutes a breach of the duty imposed by this statute, People v Bommarito, 33 Mich App 385, 388- 389; 190 NW2d 359 (1971), the neglect involved in that case, an undersheriff's failure to see that traffic tickets and complaints handled (but not issued) by deputies under his supervision were processed and disposed of in accordance with the law, appears to be neglect of a non-discretionary duty. Bommarito should not be viewed as authority for the proposition that a police officer's failure to make a specific arrest or other good faith discretionary decision not to enforce the laws to the fullest possible extent is proscribed by this statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. People v Bommarito, 11 Mich App, p 332, recognized this but, as one of the signers of that opinion, I acknowledge that it described the consideration which may cement the illegal bargain too narrowly, ignoring that the statute specifically provides that a promise would be adequate consideration:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The gist of the offense and the wrong the statute punishes is receipt of money as consideration, reward, or inducement for omitting or delaying performance, whether such omission or delay occurs or not.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Cf., Restatement 2d, Contracts (Tentative Draft No 1, 1964), ยง 3, which defines an agreement as \"a manifestation of mutual assent on the part of two or more persons\". \"Manifestation of mutual assent to an exchange requires that each party either make a promise or begin or render a performance.\" Id., ยง 20. \"A promise is a manifestation of intention to act or refrain from acting in a specified way, so made as to justify a promisee in understanding that a commitment has been made.\" Id., ยง 2(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Developments in the Law, fn 28 (supra) , pp 954, 956.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. \"Where a statute makes only one-half of a transaction punishable, the legislature has immunized that substantive action which is unpunishable, and without additional criminal combination exclusive of the sanctioned substantive action, it flies in the face of the legislative intent to render that conduct punishable as conspiracy.\" Recent Cases, -- Bookmaking -- Conspiracy, 4 Rutgers L Rev 724, 725 (1950).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Case Notes, -- Conspiracy -- Wharton's Rule and Exceptions, 23 So Cal L Rev 262, 264 (1950); Recent Cases, Conspiracy -- Criminal Liability -- Conviction for Conspiracy to Commit Offense Requiring Concerted Action Upheld Where Only One Conspirator Could Be Guilty of Substantive Crime, 62 Harv L Rev 1226, 1227 (1949); Recent Cases, , 98 U Pa L Rev 251, 255 (1949); and Recent Decisions, Criminal Conspiracy -- Receiving Stolen Property -- Identity of Conspiracy and Substantive Crime, 13 Fordham L Rev 98, 102-103 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Vannata v United States, supra, p 428, one of the cases usually cited as establishing this exception, offers no explanation why \"for purposes of prosecution, the sole substantive criminal can be joined with those who knowingly assist him in crime, in a conspiracy charge\". Indeed, the Court admits that its holding countenances \"an underhand way of doing something the Legislature never thought of\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. See LaFave and Scott's statement of the rationale for this exception:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A somewhat different limitation on the Wharton rule is this: if the law defining the substantive offense does not specify any punishment for one of the necessary participants, then it is no bar to a conspiracy conviction that only the essential participants were involved. For example, if A agrees with B to give him an illegal rebate, but the applicable statute imposes a penalty only on the giver of the rebate, then A and B may be convicted of conspiracy. Or, if C agrees to make an illegal sale of liquor to D, but the statute penalizes only the seller, C and D are guilty of conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"By taking into account [this limitation and the principle that the rule applies only where no nonessential third party is involved], the apparent rationale of the Wharton rule may be seen more clearly. The notion seems to be that if all the necessary participants would be subject to punishment for the completed substantive crime and if only the necessary participants are parties to the agreement, then the agreement presents no danger beyond that inherent in the crime planned. Put somewhat differently, under the circumstances just stated it may be said that the legislature took into account the dangers of the combination in setting the penalties for the substantive offense, so that it would be inconsistent to permit a separate punishment for the same combination on a conspiracy theory.\" LaFave \u0026 Scott, , ยง 62, p 493.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBut where the statute defining the substantive offense makes both agreeing to give and agreeing to receive a bribe or illegal rebate a crime, Wharton's Rule applies. See United States v Dietrich, 126 F 664 (CCD Neb, 1904); United States v New York C \u0026 H R R Co, 146 F 298 (CCSD NY, 1906); People v Wettengel, 98 Colo 193; 58 P2d 279 (1935); and State v Aircraft Supplies, Inc, 45 NJ Super 110; 131 A2d 571 (1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Although Williams could not have been convicted of the statutory offense of officer omitting duty for reward, he could have been prosecuted under another section of the Penal Code. It should make no difference that the Legislature provided separate punishment for the parties to the agreement, as long as each party is punishable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile no Michigan statute specifically punishes the person who offers the reward and thereby enters into the agreement with the police officer who is punishable under MCL 750.123; MSA 28.318, Williams' conduct appears to violate one or more neighboring sections of the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs the Chief Justice's opinion notes, MCL 750.117; MSA 28.312 makes it a felony to \"corruptly give, offer or promise to any public officer, agent, servant or employe, * * * any gift, gratuity, money, property or other valuable thing, * * * the purpose and intent of which is to influence any act or omission relating to any public duty of such officer, agent, servant or employe\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis statute appears broad enough to reach efforts to bribe all public employees including police officers. People v Karoll, 315 Mich 423; 24 NW2d 167 (1946), upheld the conviction under this section of one who had paid money to an assistant county purchasing agent to obtain orders. The defendant in People v Patterson, 58 Mich App 727; 228 NW2d 804 (1975), was convicted under this section of bribing two police officers, but the question whether the prosecution was founded upon the appropriate statute was not raised on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee, also, the following cases upholding convictions of public employees for receiving bribes under another broadly worded statute, MCL 750.125; MSA 28.320, which punishes both the giving and receiving of bribes intended to affect an agent's, employee's or servant's actions in relation to his principal's, employer's or master's business: People v Nankervis, 330 Mich 17, 23; 46 NW2d 592 (1951) (traffic court employee); People v Leve, 309 Mich 557; 16 NW2d 72 (1944) (director of county bureau supervising hospitalization of indigents); People v Freedland, 308 Mich 449; 14 NW2d 62 (1944) (accounts examiner in state sales tax division).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile we need not decide today under which of these statutes Williams might have been prosecuted had he not received immunity for his testimony, it is clear that the Legislature has not permitted the misconduct of the person who offers the reward to the police officer to go unpunished. No gap in criminal liability justifies suspending Wharton's Rule to allow conspiracy prosecution of the parties to the charged agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Most authorities agree that both giving and taking a bribe in exchange for official action are offenses at common law. See 2 Hawkins, Pleas of the Crown, ch 67, ยง 2; 2 Blackstone (Cooley ed, 1872), p 138, fn 24; 1 Russell, Crimes \u0026 Misdemeanors (Davis ed, 1824), pp 239-240; State v Ellis, 33 NJL 102; 97 Am Dec 707 (1868) (\"The offer of anything of value in corrupt payment or reward for any official act, legislative, executive, or judicial, to be done, is an indictable offense at the common law.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Compare United States v Dietrich and other cases cited in fn 45, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 MCL 750.505; MSA 28.773 reads:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who shall commit any indictable offense at the common law, for the punishment of which no provision is expressly made by any statute of this state, shall be guilty of a felony, punishable by imprisonment in the state prison not more than 5 years or by a fine of not more than $10,000.00, or both in the discretion of the court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 MCL 750.157a; MSA 28.354(1) reads:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any person who conspires together with 1 or more persons to commit an offense prohibited by law, or to commit a legal act in an illegal manner is guilty of the crime of conspiracy * * * .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Williams received a grant of immunity from the state in exchange for his testimony against the officers charged in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 MCL 750.123; MSA 28.318 reads:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Officer omitting duty for reward -- Any sheriff, coroner, constable, peace officer, or any other officer authorized to serve process or arrest or apprehend offenders against who shall receive from a defendant or from any other person any money or other valuable thing or any service or promise to pay or give money or to perform or omit to perform any act as a consideration, reward or inducement, for omitting or delaying to arrest any defendant, or to carry him before a magistrate, or for delaying to take any person to prison, or for postponing the sale of any property under any execution, or for omitting or delaying to perform any duty pertaining to his office, shall be guilty of a misdemeanor, punishable by imprisonment in the county jail not more than 6 months or by fine of not more than 250 dollars: Provided, That if such defendant shall be charged with an offense against the s of the state of Michigan, any officer convicted under the provisions of this section, may, in the discretion of the court, be punished by any fine or by any term of imprisonment or both such fine and imprisonment, within the limits fixed by the statute which such defendant is charged with having violated.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 The conspiracy to obstruct Justice charge was allowed to stand by the trial court on the ground that the facts of this case indicated defendant police officer's criminal conduct extended beyond the specific activity covered by MCL 750.123; MSA 28.318.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 The opinion was an unpublished per curiam release (Docket No. 21900).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 The seventh edition (1874) was the first to contain an account of the rule. See 2 Wharton, (7th ed), ยง 2289, p 634. See also Shannon v Commonwealth, 14 Pa 226 (1850).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 For the most contemporary expression of the rule, see 1 Anderson, Wharton's and Procedure (1957 ed), ยง 89, p 191:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"An agreement by two persons to commit a particular crime cannot be prosecuted as a conspiracy when the crime is of such a nature as to necessarily require the participation of two persons for its commission.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Authority exists to the effect that Wharton's Rule is not based upon double jeopardy concerns. See Iannelli v United States, 420 U.S. 770, 782; 95 S Ct 1284; 43 L Ed 2d 616 (1975). See also Pereira v United States, 347 U.S. 1, 11; 74 S Ct 358; 98 L Ed 435 (1954); Pinkerton v United States, 328 U.S. 640, 643-644; 66 S Ct 1180; 90 L Ed 1489 (1946). But see Lisansky v United States, 31 F2d 846, 849 (CA 4, 1929), cert den 279 U.S. 873; 49 S Ct 514; 73 L Ed 1008 (1929); United States v Cogan, 266 F Supp 374, 377 (SD NY, 1967). In fact, application of the rule could justify dismissing the conspiracy charge before trial. See Gebardi v United States, 287 U.S. 112, 122; 53 S Ct 35; 77 L Ed 206 (1932); United States v Katz, 271 U.S. 354, 355; 46 S Ct 513; 70 L Ed 986 (1926); United States v Dietrich, 126 F 664 (CCD Neb, 1904). But see Iannelli, supra, 420 U.S. 786, fn 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eConsequently, although the rule serves a similar purpose, double jeopardy represents a distinct legal concern. The \"same offense\" test, normally used by the United States Supreme Court in determining violations of double jeopardy, differs substantively from Wharton's Rule. Regarding the \"same offense\" test, see Blockburger v United States, 284 U.S. 299, 304; 52 S Ct 180; 76 L Ed 306 (1932). See also Iannelli, supra, 420 U.S. 785, fn 17. The focus of the rule is not whether each offense requires proof of a fact not required by the other, but whether the elements of the substantive offense are \"congruent\" or legally identical with the conspiracy charged. See id., 420 U.S. 782.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDouble jeopardy concerns might theoretically arise, even when Wharton's Rule was satisfied, in cases where convictions were actually obtained or penalties imposed for both conspiracy and the underlying substantive offense. However, the law is settled that conspiracy and the substantive offense charged do not merge upon consummation of the substantive offense, at least for purposes of independent prosecution or conviction. See id., 420 U.S. 781 and accompanying fn 13; Pinkerton v United States, supra. See also People v Norwood, 312 Mich 266, 271; 20 NW2d 185 (1945); People v Ormsby, 310 Mich 291, 297-298; 17 NW2d 187 (1945); People v Chambers, 279 Mich 73, 77; 271 NW 556 (1937); People v Nawrocki, 6 Mich App 46; 148 NW2d 211 (1967). Viewed in the context of double jeopardy analysis, then, questions and legal considerations concerning multiple charges, prosecutions or convictions in conspiracy cases vary substantially from other common-law or statutory criminal cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 See, generally, 11 ALR 196; 104 ALR 1430; Recent Cases, -- Criminal Conspiracy -- \"Wharton's Rule\" as Exception From Charge of Criminal Conspiracy, 8 U Chi L Rev 138 (1940); 3 Gillespie, Michigan \u0026 Procedure (2d ed), ยง 1224, p 173.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 An allied reason sometimes given for the rule is that, where the Legislature by statute penalizes certain misconduct involving concerted activity, the courts and prosecutors should not be allowed to penalize that same misconduct by additionally charging or convicting the parties under a conspiracy statute. See State v McLaughlin, 132 Conn 325, 336; 44 A2d 116, 121 (1945); Vannata v United States, 289 F 424, 427 (CA 2, 1923). This rationale speaks more to traditional double jeopardy considerations than to the special conspiracy concerns normally and logically associated with Wharton's Rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 In Iannelli, where charges of conspiracy to violate the gambling provisions of 18 USC 1955 were brought, the United States Supreme Court stated its basic position regarding proper application of Wharton's Rule:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Wharton's Rule applies only to offenses that require concerted criminal activity, a plurality of criminal agents. In such cases, a closer relationship exists between the conspiracy and the substantive offense because both require collective criminal activity. The substantive offense therefore presents some of the same threats that the law of conspiracy normally is thought to guard against, and it cannot automatically be assumed that the Legislature intended the conspiracy and the substantive offense to remain as discrete crimes upon consummation of the latter.\" 420 U.S. 785.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Jeffers v United States, 432 U.S. 137, 147; 97 S Ct 2207; 53 L Ed 2d 168 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Were the substantive offense in this case the crime of officer omitting duty for reward rather than obstructing Justice, our Conclusion would be the same but our point of Disposition could be different. If the Court determined that officer omitting duty for reward logically required only one person to commit it, then there would exist no congruence between the elements of the offense and the conspiracy and a conspiracy charge would not violate Wharton's Rule. However, even were we to assume for the sake of analysis that officer omitting duty for reward does logically require the concerted activity of two persons, Wharton's Rule would still not apply to preclude prosecution for conspiracy since co-conspirator Charles Williams could not have been indicted for and convicted of officer omitting duty for reward. See MCL 750.123; MSA 28.318. Such a situation would represent an exception to the normal application of the rule. For instance, in a case involving conspiracy to sell intoxicating beverages, the Federal Court of Appeals for the Second Circuit has held that Wharton's Rule did not preclude prosecution for conspiracy and the substantive offense where only one party to the transaction could have been convicted of the substantive offense. Vannata v United States, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne recent commentary stated the exception in these terms:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A 'well-defined' exception to the operation of the Wharton rule has been established. Under this exception the rule does not operate when fewer than all the parties logically necessary for the commission of the substantive offense are indictable for it. The exception, not provided for in the rule as stated by Wharton, has been criticized. The critics reason that making one of the parties nonculpable for an unlawful object which by its nature requires plurality creates no greater risk justifying prosecution than when all necessary parties are culpable. However, when fewer than all the participants logically required are punishable for the substantive offense, it seems clear that the punishment prescribed by the legislature for that offense does not include any punishment for the anti-social combination necessarily involved.\" Developments in the Law: Criminal Conspiracy, 72 Harv L Rev 920, 956 (1959).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is clear that the unindicted co-conspirator Williams could not have been charged with officer omitting duty for reward. The statute only applies to police officers. Nor could he be charged as an aider and abettor. In re Vickers, 371 Mich 114; 123 NW2d 253 (1963). In Vickers this Court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"[MCL 767.39; MSA 28.979] provides that one who procures, counsels, aids, or abets the commission of an offense may be tried, convicted, and punished as if he had directly committed the offense. In People v Meisner, 178 Mich 115 [144 NW 490 (1913)], this Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'Where an offense can be committed only by a specified class, aiders and abettors cannot be charged as principals if they are outside the statute designation.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Inasmuch, then, as petitioner cannot be held for commission of the crime of abortion upon herself, she may not be held as an aider or abettor thereof.\" 371 Mich 118.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBecause Charles Williams could not have been charged as a police officer who omitted his duty in return for monetary consideration, he could not have been charged as an aider and abettor of that crime. Consequently, given that Williams could in no way have been charged under the statute, Wharton's Rule would not apply to bar prosecution for conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 In its order granting the prosecutor's application for leave to appeal, this Court limited its order to the following issue: Whether the Court of Appeals erred in ruling that Wharton's Rule should be applied so as to preclude conviction of defendant-appellee of the charge of conspiracy to obstruct Justice. In resolving this issue, a comparison of the elements of the common-law and statutory offenses becomes self-evident and was addressed in the briefs by the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 Various statutes have been enacted in derogation of this general common-law offense. See, e.g., MCL 750.117, 750.118, 750.119, 750.121, 750.124; MSA 28.312, 28.313, 28.314, 28.316, 28.319 (bribery); MCL 750.120a, 750.120b; MSA 28.315(1), 28.315(2) (jury tampering); MCL 750.122; MSA 28.317 (interest in public contracts). The crime of officer omitting duty for reward is one such offense. MCL 750.123; MSA 28.318.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe note that statutes in derogation of common law are strictly construed. See People v Powell, 280 Mich 699, 703; 274 NW 372 (1937); James v Howard, 4 Mich 446, 448 (1857); Sibley v Smith, 2 Mich 487, 490 (1853).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 Wharton's Rule was similarly applied by this Court regarding a charge of conspiracy to commit abortion. In re Vickers, 371 Mich 114; 123 NW2d 253 (1963). This Court there stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Abortion involves concert of action between 2 persons, the perpetrator and the victim, the immediate effect of consummation reaching only the participants, as also in respect to adultery, bigamy, incest, or dueling, in which a charge of conspiracy to commit the offense will not lie against the 2 participants. This is because the conspiracy to commit them is in such close connection with the objective offense as to be inseparable from them.\" 371 Mich 117.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurther, we find People v Clifton, 70 Mich App 65; 245 NW2d 175 (1976), where Wharton's Rule was discussed, to be inapplicable to the circumstances of this case.\u003c/span\u003e\n\n",
    "body_length": 151101,
    "citedas": [
      "290 N.W.2d 366",
      "408 Mich. 255"
    ],
    "attorneys": "Frank J. Kelley, Attorney General, Robert A. Derengoski, Solicitor General, William L. Cahalan, Prosecuting Attorney, Patrick J. Foley, Director, Wayne County Organized Crime Task Force, and David A. Hogg, Assistant Prosecuting Attorney, for the people. Armand D. Bove and Richard C. McKnight for defendant.",
    "category": [
      "75"
    ],
    "judges": "Coleman, C.j. (to affirm). Fitzgerald, J., concurred with Coleman, C.j. Kavanagh, J. (for affirmance). Levin J. (to affirm). Blair Moody, Jr., J., Dissents. Williams, J., concurred with Blair Moody, Jr., J.",
    "citation_count": 0
  }
}
