{
  "id": "KqV-SGYBTlTomsSBDo5_",
  "document": {
    "title": "State v. Peeler",
    "full_title": "STATE OF CONNECTICUT v. RUSSELL PEELER",
    "jurisdiction": "Supreme Court of Connecticut",
    "date": "2004-10-12T00:00:00.000Z",
    "docket": "Nos. SC 16362 \u0026 SC 16354",
    "body": "Argued December 3, 2003\n\nOpinion\n\nAfter a jury trial, the defendant was convicted of one count of murder in violation of General Statutes § 53a-54a (a),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e two counts of capital felony in violation of General Statutes (Rev. to 1999) § 53a-54b (8) and (9), respectively,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and one count of conspiracy to commit murder in violation of General Statutes §§ 53a-54a (a) and 53a-48 (a)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e in connection with the shooting death of a woman and her young son. At a separate sentencing hearing for the two counts of capital felony pursuant to General Statutes § 53a-46a (b),\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e the same jury considered further evidence of aggravating and mitigating factors, but was unable to reach a unanimous verdict with regard to the imposition of the death penalty on either of the charges. The trial court thereafter denied the state's motion for mistrial of the penalty hearing and rendered judgment sentencing the defendant to life imprisonment without the possibility of parole.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The defendant appealed from his conviction to this court in accordance with General Statutes § 51-199 (b).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The state appealed\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e from the trial court's judgment sentencing the defendant to life imprisonment.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e We affirm the defendant's conviction on all charges, but we reverse the judgment imposing a sentence of life imprisonment and remand the case for a new penalty hearing on both capital felony counts.\n\nOn appeal, the defendant claims that the trial court: (1) improperly instructed the jury that it could convict the defendant of a capital felony based upon a theory of conspiratorial liability under Pinkerton v. United States, 328 U.S. 640, 647-48, 66 S.Ct. 1180, 90 L.Ed. 1489 (1946); (2) improperly charged the jury on an element of conspiratorial liability under the Pinkerton doctrine by failing to instruct the jury that, in order to find the defendant guilty of murder, it must find that the coconspirator intentionally caused the victims' deaths; (3) deprived the defendant of his federal and state constitutional rights to confront witnesses and to present a defense by refusing to disclose certain medical, drug treatment and psychiatric records of a state's key witness for the purpose of cross-examination; (4) violated his constitutional rights to be present at all stages of his trial and to presence of counsel when it conducted two ex parte proceedings with the attorney for a key witness for the state; and (5) violated the Code of Judicial Conduct when the presiding judge failed to recuse himself, sua sponte, after conducting those two ex parte proceedings. We conclude that the defendant's first, second and fifth claims are without merit. Furthermore, even if we assume that the defendant's third and fourth claims are valid, we nevertheless conclude that the improprieties were harmless. Accordingly, we affirm the conviction portion of the judgment of the trial court.\n\nThe second appeal is the state's appeal from the sentencing portion of the defendant's conviction. Specifically, the state appeals from: (1) the trial court's denial of the state's motion for a mistrial, its dismissal of the penalty phase proceedings, and the subsequent imposition of a sentence of life imprisonment without the possibility of parole; and (2) the trial court's subsequent denial of the state's request for permission to appeal, pursuant to General Statutes § 54-96.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The state claims that the trial court abused its discretion by denying permission to appeal, after concluding, among other things, that a deadlocked jury can reach a lawful verdict. The state further argues that the trial court abused its discretion by denying its motion for a mistrial after improperly instructing the jury that if it remained deadlocked, the trial court would be required to impose a sentence of life imprisonment \"without the benefit of release.\" Such an improper instruction, the state argues, was not only based upon an unsound legal premise, but tainted the jury deliberations by: (1) leading the jury to believe that the responsibility for determining the appropriateness of whether the defendant should be sentenced to life imprisonment or put to death did not rest solely in its discretion; and (2) increasing the likelihood that the jury would remain deadlocked.\n\nIn response to the state's claims, the defendant presents four alternate grounds for affirmance. The defendant argues that the judgment of the trial court, sentencing him to life imprisonment, should be affirmed because: (1) § 53a-46a (b) does not permit a trial court to impanel a new jury after the original jury becomes deadlocked in the penalty phase of a capital case; (2) principles of vicarious liability cannot be used to prove aggravating factors, and, therefore, the state presented insufficient evidence to prove any of the aggravating factors necessary for the imposition of the death penalty; (3) the state failed to produce sufficient evidence to prove beyond a reasonable doubt that the defendant had the particularized mental state required by each aggravating factor; and (4) Pinkerton liability cannot be used to prove aggravating factors, and therefore the state presented insufficient evidence to prove any aggravating factors. We agree with the state's arguments and reject the defendant's alternate grounds for affirmance.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Accordingly, we reverse the trial court's imposition of a sentence of life imprisonment and remand the case for a new penalty hearing.\n\nI. THE FACTS\n\nThe jury reasonably could have found the following facts. In the late 1990s, the defendant and his brother, Adrian Peeler (Adrian), operated a large-scale drug trafficking network that sold crack cocaine (crack) throughout the city of Bridgeport. In 1997, the defendant partnered with Rudolph Snead, Jr., to produce and distribute the crack. Snead's responsibilities included providing the defendant with powdered cocaine, which the defendant, with the help of several associates, processed into crack and then sold on the streets. The partnership began to sour when, in 1997, the defendant accused Snead of overcharging him for the powdered cocaine. Snead responded to the accusation by \"shooting up\" a building on Benham Street in Bridgeport that the defendant used as a \"crack house.\" According to one of the defendant's associates, the defendant vowed to retaliate.\n\nIn September, 1997, the defendant, Corey King, Shawn Kennedy, and the defendant's cousin, Ryan Peeler (Ryan), were driving in Bridgeport when the defendant noticed Snead's car parked in the lot of a barber shop. The defendant observed Snead leave the barber shop, get into his car and drive away. At the time, the defendant was aware that two young boys, later identified as Leroy Brown, Jr., and Tyrell Snead (Tyrell), were passengers in Snead's car.\n\nThe defendant's car followed Snead's car to the Lindley Avenue entrance ramp to Route 25. As Snead proceeded up the ramp, he slowed down and pulled off to the side. The defendant's vehicle pulled up next to Snead's car, and the defendant, who was seated in the right front passenger seat, fired several shots at Snead from a .40 caliber, semi-automatic handgun.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe Defendant Kept Shooting Until His Gun Jammed\n\nSeveral of the shots fired by the defendant hit Snead, injuring him, but not so severely that he was unable to drive away. A Bridgeport police officer, who noticed glass falling from Snead's car as he drove by, stopped the vehicle. After Snead explained what had happened, the officer sent him to St. Vincent's Medical Center for treatment.\n\nAt the hospital, another officer from the Bridgeport police department interviewed Snead and his two young passengers, Brown and Tyrell. The officer's investigative report included the names of all three interviewees. On the basis of Snead's identification of the defendant as the person who had shot him, the defendant was arrested and charged with attempted murder.\n\nThe defendant, however, posted bond and was released from custody. After his release, the defendant made it clear to his associates that he was furious with Snead for reporting the Lindley Avenue shooting to the police, and that he was going to \"get\" him for giving a statement to the police. Subsequently, in May, 1998, while free on bond, the defendant shot and killed Snead in the same barber shop that Snead had patronized immediately prior to the Lindley Avenue shooting.\n\nWhile investigating Snead's death, the Bridgeport police department performed ballistics tests comparing the shell casings retrieved from the murder scene with those from the Lindley Avenue shooting. The tests revealed that all of the bullets had been discharged from the same gun. The police were also aware that Brown could identify the defendant as the shooter in the Lindley Avenue shooting, thus linking him directly to Snead's murder. On the basis of this information, the defendant was arrested and charged with Snead's murder.\n\nThe defendant, however, again secured his release by posting bond. As a condition of his release, the defendant was required to observe a curfew and wear an electronic ankle bracelet to ensure compliance. Despite these precautions, the defendant continued operating his drug trafficking business, albeit from a new location.\n\nIn January, 1998, during the course of pretrial discovery in connection with the Lindley Avenue shooting, the state provided defense counsel with the police report identifying Brown and Tyrell as the two passengers in Snead's car when that shooting had occurred. The trial court, however, ordered counsel to conceal the names of the two children from the defendant to ensure their safety.\n\nDuring the fall of 1998, the defendant frequently discussed his pending cases with his attorney, and often speculated as to the identity of the state's witnesses. He noticed that his attorney had made an extraordinary effort to prevent him from learning the name or names of the state's witnesses. The defendant, however, remembered that during the Lindley Avenue shooting Snead had been accompanied by two children, Tyrell and Brown. He therefore surmised that those children could be the state's witnesses in the cases pending against him.\n\nThe defendant's suspicions were confirmed when, one day while driving past 207 Earl Avenue in Bridgeport, where Brown lived with his mother, Karen Clarke, the defendant saw Brown playing outside. When Brown saw the defendant, he looked surprised and immediately ran away. As a result, the defendant concluded that Brown was in fact one of the state's witnesses. The defendant thereafter openly contemplated the possibility of having someone kill Brown and Clarke.\n\nIn December, 1998, the defendant told his girlfriend, Angelina Keene, that she should move away from Bridgeport because he was going to start killing the witnesses against him.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e At about the same time, the defendant offered Kybarris Taylor $10,000 to kill two people. Specifically, the defendant told Taylor that he wanted to eliminate \"two nobodies.\" Taylor refused the offer. The defendant also asked his brother Adrian and Josephine Lee, a crack addict and prostitute who lived across the street from Clarke and Brown, to carry out the killings. They too initially refused. Ultimately, however, Adrian agreed to commit the double homicide.\n\nThe defendant also told his associates that he wanted the witnesses killed with a revolver because, unlike a .40 caliber semi-automatic handgun, the shell casings would not be discharged from the revolver, making it more difficult to link the shootings to the gun.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In October, 1998, one of the defendant's associates in the drug trade, Albrent Daniels, procured for the defendant the revolver that was to be used to kill Clarke and Brown. Michael Lanier, a drug user, went to a crack house that was controlled by the defendant and offered to trade Daniels a .357 magnum revolver in exchange for drugs. Daniels contacted the defendant and asked whether he was interested in acquiring the gun. The defendant agreed, and Daniels subsequently traded for the revolver. King, another associate of the defendant, then picked up the gun from Daniels and delivered it to the defendant.\n\nKing testified that at one point after the defendant had gained possession of the gun, the defendant described to several of his associates, including Adrian, what he intended to do with it. He said that he would put the gun to Brown's head and go \"[p]ow,\" simulating the sound of a gunshot. The gun eventually was given to the defendant's brother, Adrian.\n\nAt this same time, the defendant and his drug trafficking associates moved their crack production to a house located at 200 Earl Avenue in Bridgeport, across the street from the house in which Clarke and Brown then lived. The residents of the 200 Earl Avenue address, including Lee, were crack users who obtained the drug from the defendant's drug trafficking network.\n\nLee testified that on January 6, 1999, the day before the Clarke and Brown murders, the defendant and an associate, later identified as King, were at the house located at 200 Earl Avenue. According to Lee, the two men spent time in the dining room observing Clarke and Brown's residence. Lee further testified that another of the defendant's associates, later identified as Gary Garner, and the defendant's brother, Adrian, also came by the house that day. At some point, King left Lee's residence and, thereafter, Lee observed Adrian and the defendant conversing in the dining room.\n\nThe defendant and Adrian then entered the kitchen and \"cooked\" some crack. Lee testified that the defendant asked her if she would \"do him a favor . . . [and] kill the woman across the street . . . .\" Lee, however, refused to do so. The defendant thereupon asked Adrian if he would kill Clarke and her son. According to Lee, Adrian indicated that he would \"take care of it.\"\n\nThe defendant then asked Lee to keep an eye on the 207 Earl Avenue address and to contact him when Clarke and Brown returned home. Lee agreed to do so, and the defendant wrote down his beeper number for her to call. The defendant then gave Lee a handful of crack cocaine as payment for her cooperation.\n\nThe next day, when Lee saw Clarke and Brown return home, she telephoned the defendant's beeper number and left her number. When the defendant called her back, she informed him that Clarke and Brown had returned home. The defendant said \"okay\" and hung up the telephone. A few minutes later, Adrian arrived at Lee's residence holding a gun. Adrian greeted Lee and then immediately departed Lee's residence. Lee followed him.\n\nAdrian crossed the street and proceeded toward Clarke and Brown's house at 207 Earl Avenue, stopping first to speak to a lone occupant in a car that was parked in front of that residence. The occupant of the car subsequently was identified as Garner. Lee testified that Garner told her that if she \"said anything,\" she \"was going to be next.\"\n\nAdrian and Lee approached Clarke's residence and Lee rang the front doorbell while Adrian remained behind her. Lee heard a voice from inside the house ask, \"[w]ho is it?\" Lee responded, \"[t]he girl across the street.\" Clarke cracked open the door, at which time Adrian pushed past Lee and forced the door open. Lee testified that she heard the rustle of grocery bags, which were later found strewn across the floor, and the sounds of a struggle inside. When Lee entered the house, she saw Clarke and Brown running up the stairs trying to escape from Adrian, who was chasing them. According to Lee, once Clarke and Brown reached the top of the stairs, she heard a gunshot, and then heard Brown scream out, \"mommy, mommy, mommy, mommy,\" from the top of the stairs. Lee then saw Adrian pursue Clarke into a bedroom and heard him mention something about Brown being a witness to a shooting. Lee, who by this time was at the top of the stairs, testified that she had heard another gunshot and, immediately thereafter, observed Adrian emerge from the bedroom. Lee further stated that she saw Adrian shoot Brown in the head. Adrian then ran out of the house. Lee, who was still at the top of the stairs, testified that she initially had stood frozen, but eventually left to return to her residence at 200 Earl Avenue. On her way out of Clarke and Brown's house, Lee noticed Adrian was gone, as was the car in which Garner had been sitting. Louis Ellis, who also lived at 200 Earl Avenue, corroborated Lee's account, testifying that on the evening of the murders, he heard four or five gunshots, and shortly thereafter, he heard Lee run into the house breathing hard, as if out of breath.\n\nOn April 14, 1999, the defendant was arrested for the murders of Clarke and Brown and charged with one count of murder, two counts of capital felony--one for the murder of Brown, and the second for the double murder--and one count of conspiracy to commit murder. While incarcerated and awaiting trial, the defendant inculpated himself to fellow inmates. Two of those inmates, Audrey Holeman and Thomas Kerr, testified that while each was incarcerated with the defendant, the defendant had bragged about his involvement in the murders. Holman testified that he had overheard the defendant tell another inmate that his brother would not testify against him because the defendant had murdered one person, but his brother had murdered two, and that the defendant was pleased with his brother because Adrian \"had done something righteous\" for him \"that nobody else . . . would do . . . .\" Kerr testified that the defendant had told him that \"that bitch,\" Clarke, rather than the defendant himself, was responsible for both of the deaths, and that \"[s]he should have known not to mess with him.\"\n\nAfter a jury trial, the defendant was found guilty on all counts. The state then proceeded to a penalty hearing, in accordance with § 53a-46a (a),\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e seeking the death penalty for the two capital felony convictions. While deliberating on the defendant's sentence, the jury on several occasions informed the court that it could not reach a unanimous verdict. Notes from the jury to the trial judge indicated that on the charge pertaining to the murder of Brown, the panel found that the state had proven at least one aggravating factor and that the defendant had proven at least one non-statutory mitigating factor, but the jurors could not agree as to whether the aggravating factors outweighed the mitigating factors. Regarding the double homicide of Clarke and Brown, the jury indicated that it could not reach a unanimous verdict as to whether the state had proven an aggravating factor.\n\nAfter several unsuccessful attempts by the trial court to obtain a unanimous verdict, which included the giving of a \"Chip Smith\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e instruction to the jury, the court submitted a revised verdict form that allowed the jury to indicate the following: (1) on the capital felony count concerning the murder of Brown, \"[w]e the jury unanimously agree that we are unable to unanimously agree that one or more of the proved statutory aggravating factors outweighs one or more of the proved nonstatu-tory mitigating factors\"; and (2) as to the capital felony count directed at the double homicide, \"[w]e the jury unanimously agree that we are unable to unanimously agree that the [s]tate . . . has proved one or more of the statutory aggravating factors beyond a reasonable doubt.\" Neither the defendant nor the state objected to the submission of the revised verdict form. The jury then resumed deliberations and, on both counts, selected the option declaring that it unanimously agreed that it could not unanimously agree.\n\nAfter the trial court denied the state's motion for a mistrial, the court subsequently dismissed the penalty phase proceedings, rendered a judgment of guilty in accordance with the verdict and, merging the two capital felony counts and the murder count, sentenced the defendant to a total effective sentence of life imprisonment without the possibility of parole.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e These appeals followed.\n\nII. THE DEFENDANT'S APPEAL\n\nA.\n\nThe defendant first claims that the trial court improperly instructed the jury that it could convict the defendant of a capital felony based on conspiratorial liability under Pinkerton v. United States, supra, 328 U.S. 640.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nSpecifically, the defendant argues that the instruction was erroneous because: (1) this court's decisions in State v. Harrell, 238 Conn. 828, 681 A.2d 944 (1996), and State v. Johnson, 241 Conn. 702, 699 A.2d 57 (1997), preclude a trial court from instructing a jury that it may use the doctrine of Pinkerton liability to find a defendant guilty of a capital felony under § 53a-54b; (2) allowing the use of the Pinkerton doctrine to prove a capital felony would produce an absurd, bizarre and unworkable result; and (3) this court never has adopted the expansive notion of Pinkerton liability applied by the trial court and should not do so in the present case.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nWe disagree with each of the defendant's arguments.\n\nAs a preliminary matter, we address the reviewability of the defendant's claim that the trial court improperly instructed the jury that it could convict the defendant of capital felony based upon Pinkerton liability. The defendant concedes that he failed to preserve his claim by either taking an exception to the relevant jury instructions or submitting a relevant request to charge. He therefore seeks to prevail under the Golding doctrine; see State v. Golding, 213 Conn. 233, 239-40, 567 A.2d 823 (1989); and the plain error rule. See Practice Book § 60-5.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Under Golding, a defendant may prevail on unpreserved claims \"only if all of the following conditions are met: (1) the record is adequate to review the alleged claim of error; (2) the claim is of constitutional magnitude alleging the violation of a fundamental right; (3) the alleged constitutional violation clearly exists and clearly deprived the defendant of a fair trial; and (4) if subject to harmless error analysis, the state has failed to demonstrate harmlessness of the alleged constitutional violation beyond a reasonable doubt.\" State v. Golding, supra, 239-40. \"The first two [prongs of Golding] involve a determination of whether the claim is reviewable; the second two . . . involve a determination of whether the defendant may prevail.\" State v. George B., 258 Conn. 779, 784, 785 A.2d 573 (2001).\n\nWe conclude that, in the present case, the first two prongs of Golding are satisfied, that is, the record is adequate for review and the claim is of constitutional magnitude. See State v. Coltherst, 263 Conn. 478, 490, 820 A.2d 1024 (2003) (claim of improper jury instruction on Pinkerton liability is of sufficient constitutional magnitude for Golding review); State v. Leroy, 232 Conn. 1, 7, 653 A.2d 161 (1995) (\"an improper jury instruction as to an essential element of the crime charged may result in the violation of the defendant's due process right to a fair trial, and thus require the reversal of a conviction based upon that instruction\"). Accordingly, we conclude that the defendant's claim is reviewable.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nWe also conclude, however, that the trial court's instruction on Pinkerton liability was proper and the defendant therefore cannot prevail under the third prong of Golding.\n\nWe begin by setting forth the appropriate standard of review. \"The standard of review for claims of instructional impropriety is well established. [I]ndividual jury instructions should not be judged in artificial isolation, but must be viewed in the context of the overall charge. . . . The pertinent test is whether the charge, read in its entirety, fairly presents the case to the jury in such a way that injustice is not done to either party under the established rules of law. . . . Thus, [t]he whole charge must be considered from the standpoint of its effect on the [jurors] in guiding them to the proper verdict . . . and not critically dissected in a microscopic search for possible error. . . . Accordingly, [i]n reviewing a constitutional challenge to the trial court's instruction, we must consider the jury charge as a whole to determine whether it is reasonably possible that the instruction misled the jury.\" (Citations omitted; internal quotation marks omitted.) State v. Coltherst, supra, 263 Conn. 490. In other words, we must \"consider whether the instructions [in totality] are sufficiently correct in law, adapted to the issues and ample for the guidance of the jury.\" (Internal quotation marks omitted.) Wagner v. Clark Equipment Co., 243 Conn. 168, 185, 700 A.2d 38 (1997); see also Potter v. Chicago Pneumatic Tool Co., 241 Conn. 199, 239-40, 694 A.2d 1319 (1997); Hall v. Burns, 213 Conn. 446, 482, 569 A.2d 10 (1990).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nOur analysis begins with a brief review of our case law applying the Pinkerton doctrine. \"In Pinkerton v. United States, supra, 328 U.S. 647-48, the United States Supreme Court concluded that under the federal common law, a conspirator may be held liable for criminal offenses committed by a coconspirator if those offenses are within the scope of the conspiracy, are in furtherance of it, and are reasonably foreseeable as a necessary or natural consequence of the conspiracy.\" State v. Diaz, 237 Conn. 518, 526, 679 A.2d 902 (1996). \"This court first explicitly adopted the Pinkerton principle of vicarious liability for purposes of our state criminal law in State v. Walton, 227 Conn. 32, 630 A.2d 990 (1993). . . . The rationale for the [adoption of the] principle [was] that, when the conspirator [has] played a necessary part in setting in motion a discrete course of criminal conduct, he should be held responsible, within appropriate limits, for the crimes committed as a natural and probable result of that course of conduct. . . .\n\n\"We concluded in Walton that the Pinkerton principle was applicable in state criminal cases, reasoning, first, that Pinkerton liability is not inconsistent with our penal code and, therefore, that we were not prohibited from recognizing that theory of criminal liability as a matter of state common law. See General Statutes § 53[a]-4. Without foreclosing the use of the Pinkerton doctrine in other circumstances, we then concluded that application of the doctrine was appropriate in Walton, in which [1] the defendant was a leader of the conspiracy, [2] the offense for which vicarious liability was sought to be imposed was an object of the conspiracy and [3] the offense was proved by one or more of the overt acts alleged in support of the conspiracy charge. . . .\n\n\"In State v. Diaz, supra, 237 Conn. 518, we were required to decide whether to extend the principle of vicarious liability that we adopted in Walton to a case in which not all of [the three Walton] conditions have been met, a question that we expressly reserved in Walton. . . . In Diaz, the defendant had been convicted of, inter alia, murder under the Pinkerton doctrine and conspiracy to commit murder. . . . The evidence showed that the defendant, along with several other individuals, had fired multiple gunshots into a motor vehicle occupied by the victim and three others. . . . The victim was struck and killed by a single bullet. . . . The defendant claimed on appeal that the court's instruction under the Pinkerton doctrine had been improper because, among other reasons, it was broader than the limited version of the doctrine recognized in Walton. . . . This court acknowledged that the state had not proved that the defendant was the leader of the conspiracy to ambush the vehicle and its occupants and, thus, had not established the first condition for Pinkerton liability set forth in Walton. . . . We noted, however, that the evidence reasonably established that the defendant was a fully engaged member of the conspiracy who had actively participated in the shooting and that he, along with his coconspirators, intended to kill one or more of the vehicle's passengers. . . . We concluded that where . . . the defendant was a full partner in the illicit venture and the coconspirator conduct for which the state has sought to hold him responsible was integral to the achievement of the conspiracy's objectives, the defendant cannot reasonably complain that it is unfair to hold him vicariously liable, under the Pinkerton doctrine, for such criminal conduct. . . . We further concluded that Pinkerton liability may be imposed even if none of the three Walton conditions is present. . . .\n\n\"We also acknowledged, however, that there may be occasions when it would be unreasonable to hold a defendant criminally liable for offenses committed by his coconspirators even though the state has demonstrated technical compliance with the Pinkerton rule.\n\n. . . In such a case, a Pinkerton charge would not be appropriate.\" (Citations omitted; internal quotation marks omitted.) State v. Coltherst, supra, 263 Conn. 491-93.\n\nIn claiming that the trial court improperly instructed the jury that it could convict the defendant of capital felony under § 53a-54b based upon a theory of conspiratorial liability under the Pinkerton doctrine, the defendant first argues that this court's conclusions in State v. Harrell, supra, 238 Conn. 828, and State v. Johnson, supra, 241 Conn. 702, preclude such an instruction. Specifically, the defendant argues that, in Johnson, this court implicitly rejected the contention that an \"intentional murder committed by [a co-defendant] can be used as the predicate murder for the defendant's capital felony conviction . . . .\"\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e (Emphasis in original.) State v. Johnson, supra, 712. We disagree.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nOur recent decision in State v. Coltherst, supra, 263 Conn. 478, is dispositive of this argument. \"In Coltherst, we considered the defendant's claim that, under State v. Harrell, [supra, 238 Conn. 839], and State v. Johnson, [supra, 241 Conn. 713-14], he could not be convicted of capital felony under § 53a-54b (5) because his murder conviction was premised on the doctrine set forth in Pinkerton v. United States, [supra, 328 U.S. 640]. [As in the present case, the defendant in Coltherst] argued that, although he had been convicted of intentional murder under § 53a-54a, because the intent to kill had been imputed to him under Pinkerton, he had not committed an intentional murder for purposes of the capital felony statute. State v. Coltherst, supra, [500-502]. [The Coltherst court noted that in] Harrell, we determined as a matter of statutory interpretation that the word murder as used in § 53a-54b means intentional murder as defined by Public Acts 1973, No. 73-137, § 2, now codified as § 53a-54a (a). Therefore, we concluded in Harrell that the defendant's conviction for arson murder in violation of § 53a-54d could not serve as a predicate murder for purposes of the capital felony statute. . . . State v. Harrell, supra, 839. Similarly, in Johnson, we rejected the state's claim that the defendant's conviction of felony murder could serve as the predicate for capital felony when the defendant's co-defendant had an intent to kill, concluding that the requirement [under § 53a-54b] of an intentional murder refers to the underlying murder that the defendant was convicted of . . . . State v. Johnson, supra, 712. In Coltherst, we determined that, in Harrell and Johnson, we had not focused on the defendant's subjective state of mind in concluding that a defendant could not be charged under § 53a-54b unless he had been convicted of intentional murder. State v. Coltherst, supra, 500-501. Instead, those cases stand for the proposition that a conviction under § 53a-54a is both necessary and sufficient to meet the requirement of a murder conviction under the capital felony statute, regardless of the defendant's subjective state of mind. Id. Accordingly, we rejected the defendant's claim.\" (Emphasis added; internal quotation marks omitted.) State v. Higgins, 265 Conn. 35, 50 n.17, 826 A.2d 1126 (2003). In the present case, the jury convicted the defendant of intentional murder. Therefore, in accordance with this court's conclusion in Coltherst, nothing would prevent the trial court from instructing the jury on Pinkerton liability to prove a capital felony.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe defendant further argues that \"[a]llowing the use of Pinkerton liability to prove a capital felony would produce an absurd, bizarre and unworkable result.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nSpecifically, he claims such a bizarre result would occur because, under the doctrine of accessorial liability, \"[a] defendant who agrees to commit a violent felony with another and does not intend that the victims be killed would not be guilty of the capital murder of two people if his accomplice kills the victims . . . [b]ut [under the Pinkerton doctrine] a defendant who conspires with another and does not intend that the victims be killed would be guilty of capital murder of two people if his coconspirator killed the victims.\" (Citation omitted.) In light of the fact, however, that the defendant's conspiracy conviction was for a murder in violation of § 53a-54a (a), necessarily an intentional crime under the statute, and the trial court's instructions to the jury that it must decide whether the defendant intended to commit murder, we conclude that the defendant's hypothetical has no relevance to the facts of this case, and therefore we need not address it. See Pizzola v. Planning \u0026 Zoning Commission, 167 Conn. 202, 209, 355 A.2d 21 (1974) (defendant's constitutional attack on statute predicated on hypothetical facts deemed irrelevant and therefore court declined to address); see also Housing Authority v. Olesen, 31 Conn. App. 359, 361, 624 A.2d 920 (1993) (court declines to address defendant's claim because irrelevant to disposition of appeal).\n\nLastly, the defendant argues that this court never has adopted the expansive notion of Pinkerton liability applied by the trial court, and should not do so in the present case. Specifically, he argues that \"[t]his court has [never] applied Pinkerton to a defendant who was not actively involved in the murder or was not even at the scene . . . and should not do so in this case. . . .\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e We disagree.\n\nIn State v. Diaz, supra, 237 Conn. 529, this court concluded that in circumstances wherein \"the defendant was a full partner in the illicit venture and the coconspirator conduct for which the state has sought to hold him responsible was integral to the achievement of the conspiracy's objectives, the defendant cannot reasonably complain that it is unfair to hold him vicariously liable, under the Pinkerton doctrine, for such criminal conduct.\" In upholding the trial court's instruction on Pinkerton liability, the Diaz court reasoned that, \"[a]lthough the state did not prove that the defendant was the leader of the conspiracy to ambush the [victim's] vehicle and its occupants, the evidence reasonably established that the defendant was a fully engaged member of the conspiracy who had actively participated in the shooting and that he, along with his coconspirators, intended to kill one or more of the vehicle's passengers.\" Id. This court then concluded by stating that, although we indicated in Walton that \"there may be occasions when it would be unreasonable to hold a defendant criminally liable for offenses committed by his coconspirators even though the state has demonstrated technical compliance with the Pinkerton rule . . . we are not presented with such a situation in this case.\" (Citation omitted.) Id., 530.\n\nIn the present case, the facts reveal that the defendant sufficiently was engaged in the conspiracy so that it is not unreasonable to impose criminal liability on him for the actions of his coconspirator. Indeed, the defendant was the one who had initiated the plan to murder Brown and Clarke in order to prevent them from testifying against him. The evidence at trial established that the defendant believed that Brown had witnessed the Lindley Avenue shooting. As a result, the defendant conspired with his brother, Adrian, to murder Brown and Clarke in order to prevent them from testifying against him at his trial for Snead's murder. The defendant obtained the murder weapon from one of his associates and gave it to Adrian. He graphically demonstrated to several of his associates, including Adrian, that he wanted Brown to be killed by placing the gun next to his head and pulling the trigger. Finally, the defendant gave Lee a handful of crack as payment for notifying him when the victims were home and providing a means of access into the victims' house. Consequently, although the defendant did not actually pull the trigger of the gun that killed the victims, and was not present when the shootings occurred, his actions clearly establish that he was \"a fully engaged member of the conspiracy who . . . along with his coconspirators, intended to kill [the victims]\"; id., 529; and therefore the defendant \"cannot reasonably complain that it is unfair to hold him vicariously liable, under the Pinkerton doctrine, for such criminal conduct.\" Id.\n\nAccordingly, we conclude that the trial court properly instructed the jury that it could convict the defendant of capital felony based upon conspiratorial liability under the Pinkerton doctrine. Therefore, a constitutional violation does not clearly exist and the defendant's claim fails under the third prong of Golding.\n\nB.\n\nThe defendant's second claim is that the trial court improperly charged the jury on an element of conspiratorial liability under the Pinkerton doctrine by failing to instruct the jury that, in order to find the defendant guilty of murder, it had to find that the coconspirator intentionally caused the victims' deaths. In other words, the defendant argues that by instructing the jury that it could convict the defendant if it found that he had conspired to murder the victims and a coconspirator \"perform[ed] that act that was the proximate cause\" of their deaths, the court improperly treated Pinkerton liability as a species of felony murder requiring that a foreseeable death, rather than a foreseeable murder, occur in furtherance of and within the scope of a conspiracy.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nWe disagree.\n\nAt the outset, we address the reviewability of this claim. The defendant once more concedes that he failed to preserve this claim, and therefore seeks to prevail under Golding and the plain error doctrine.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The defendant argues that the issue is reviewable under Golding because the record is adequate for review and the claim is of constitutional magnitude.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e We agree.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e We conclude, however, that the defendant's claim falls short on its merits, and thereby fails to meet the third prong of Golding.\n\nWe begin our analysis by setting forth the applicable standard of review. As we previously noted herein, \"individual jury instructions should not be judged in artificial isolation, but must be viewed in the context of the overall charge. . . . The pertinent test is whether the charge, read in its entirety, fairly presents the case to the jury in such a way that injustice is not done to either party under the established rules of law.\" (Citation omitted; internal quotation marks omitted.) State v. Coltherst, supra, 263 Conn. 490. Accordingly, in reviewing a constitutional challenge to the trial court's instruction, we must consider the jury charge as a whole to determine whether it is \"sufficiently correct in law, adapted to the issues and ample for the guidance of the jury.\" (Internal quotation marks omitted.) Wagner v. Clark Equipment Co., supra, 243 Conn. 185.\n\nAs we previously noted herein, the Pinkerton doctrine allows the state to prove the guilt of one defendant through the acts of another committed within the scope of and in furtherance of a conspiracy of which the defendant was a member, provided the acts are reasonably foreseeable as a necessary or natural consequence of the conspiracy. See Pinkerton v. United States, supra, 328 U.S. 647-48. In State v. Diaz, supra, 237 Conn. 531, this court clarified the standard when it stated that when applying Pinkerton liability, \"a defendant may not be convicted of murder unless one of his criminal associates acting foreseeably and in furtherance of the conspiracy, caused the victim's death with the intent to do so.\" (Emphasis added.)\n\nOn the basis of the totality of the jury instructions, we are not persuaded that the jury was misled to believe that Adrian's intent was irrelevant in determining whether the defendant was guilty of murder based upon a theory of conspiratorial liability under the Pinkerton doctrine. The jurors specifically were instructed that in order to find the defendant guilty of conspiracy to commit murder, they had to \"conclude [that] the defendant was a member of the conspiracy as charged in the second count of the information beyond a reasonable doubt and that another member of that same conspiracy committed the crime of murder, [that then] you further conclude beyond a reasonable doubt that the murder was in the scope of and the furtherance of this conspiracy, then each and every member of that conspiracy would be guilty of the murder charge whether or not they personally committed the murder.\" (Emphasis added.)\n\nThe trial court then explained to the jury that murder, by definition, must include an intentional act. Citing § 53a-54a (a), the court stated that, \"[a] person is guilty of murder, [when] with intent to cause the death of another person, he causes the death of such person.\" (Emphasis added.) We conclude that the instructions, viewed in their totality, were accurate and, \"[i]n the absence of evidence to the contrary, we presume that the jury properly followed those instructions.\" (Internal quotation marks omitted.) State v. James G., 268 Conn. 382, 398, 844 A.2d 810 (2004); see State v. Walker, 206 Conn. 300, 313, 537 A.2d 1021 (1988).\n\nThe defendant argues in his brief that, \"[o]n six occasions, the court told the jury it only had to find that a coconspirator caused the victims' deaths and never told the jury that it must find that Adrian committed murder . . . .\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Specifically, the defendant points to the trial court's repeated use of the instruction that the jury could convict the defendant of murder if it found that he conspired to murder the victims and a coconspirator \"performed the act that was the proximate cause\" of their deaths. The defendant, however, reads these instructions in isolation and out of context. Although the trial court instructed the jury that it could convict the defendant of murder if it found that he conspired to murder the victims and a coconspirator \"perform[ed] that act that was the proximate cause\" of their deaths, such language was always couched within the court's instruction on murder, which clearly stated that the actor must intend to cause the death of the victim. See footnote 17 of this opinion. We therefore conclude that the trial court's instructions, when read in totality, were \"sufficiently correct in law, adapted to the issues and ample for the guidance of the jury.\" (Internal quotation marks omitted.) Wagner v. Clark Equipment Co., supra, 243 Conn. 185. Accordingly, the defendant's claim fails under the third prong of Golding because there is no clear constitutional violation.\n\nC.\n\nThe defendant's third claim is that the trial court violated his constitutional rights under the sixth\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e and fourteenth amendments to the United States constitution, and article first, § 8,\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e of the Connecticut constitution\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e by denying him disclosure of certain medical, drug treatment and psychiatric records of Lee, a key witness for the state, for purposes of cross-examination.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e The defendant contends that Lee's mental health records demonstrate that she had been diagnosed on numerous occasions with significant mental illnesses, which were exacerbated by an extensive drug habit. The defendant argues that by denying him access to this information, the court prevented him from impeaching Lee's testimony based on the impact of her mental illness on her ability accurately to perceive, remember and recall the events at the time of the murders, thereby violating his rights to confrontation and to present a defense.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Although we agree with the defendant, we conclude that the error was harmless beyond a reasonable doubt.\n\nCertain additional facts are relevant to this issue. Prior to trial, the state moved to depose Lee because she was suffering from a terminal illness and might not survive until trial. After reviewing Lee's medical records and hearing argument on the motion, the trial court granted the state's request.\n\nBefore Lee's deposition, the defendant moved for a hearing on Lee's competency to testify. The defendant argued that because Lee was suffering from an unspecified terminal illness,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e such illness could also affect her competency to testify, and therefore a hearing was warranted. In order to resolve this issue, Lee consented to the release of her medical, drug treatment and psychiatric records (mental health records) from the various federal prisons, psychiatric institutions and rehabilitation centers in which she had been held or admitted over the past several years, to the extent it was necessary to determine whether she was competent to testify.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The trial court, however, postponed ruling on the motion until a later date.\n\nAt about the same time that the defendant filed his motion for an inquiry into Lee's competency, he also filed a motion for production requesting all of Lee's mental health records for impeachment purposes during cross-examination. The defendant argued, among other things, that such documents contained information relevant to Lee's mental condition that reasonably could affect her credibility at trial. He argued that, at a minimum, such information warranted an in camera review by the court. The trial court denied the motion without comment.\n\nThe court nevertheless allowed defense counsel to review Lee's mental health records solely for purposes of the pending competency hearing. In light of the defendant's subsequent motion for full disclosure, the trial court specifically ordered the defense not to use any of the information gleaned from its review of Lee's medical records to cross-examine Lee at her deposition or at trial.\n\nLee's deposition began in early November, 1999.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nThe court initiated the proceedings by addressing the defendant's motion for a hearing regarding Lee's competency to testify. The defendant argued that recently disclosed reports indicated that Lee was a \"patient . . . beginning to lose it, that she hears voices, that she sees hallucinations,\" and, therefore, she was not competent to testify. The trial court, however, disagreed. After reviewing Lee's mental health records, the trial court concluded that Lee appeared to be unstable only when under the influence of narcotics, that she was not presently under the influence of such substances and, therefore, that she was competent to testify. The state then commenced its direct examination of Lee.\n\nPrior to defense counsel's cross-examination of Lee, the defendant renewed his previous motion for permission to use Lee's medical records during cross-examination.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Having previously reviewed Lee's mental health records in relation to his motion on Lee's competency to testify, the defendant argued that an in camera review of the documents would reveal that Lee had been diagnosed as having \"a major depressive disorder and adjustment disorder\" and at the time was taking four different psychotropic medications. Furthermore, the defendant argued, the records reflected Lee's long history of crack abuse, her auditory hallucinations while using crack and her heavy crack use at the time that she claimed to have witnessed the murders. The defendant maintained that such information was relevant to whether Lee accurately could perceive, remember and relate the incidents surrounding the murders.\n\nAfter hearing Lee testify on direct examination, and having heard argument from all the parties, the trial court concluded that Lee \"had feelings of suicide when depressed, and that usually was in conjunction with the development of the use of crack cocaine . . . and/ or alcohol.\" Relying on this court's opinion in State v. D'Ambrosio, 212 Conn. 50, 561 A.2d 422 (1989), cert. denied, 493 U.S. 1063, 110 S.Ct. 880, 107 L.Ed. 2d 963 (1990), the court noted, however, that a witness' history of drug or alcohol treatment does not automatically provide the key to gain access to that witness' mental health records. Therefore, the trial court initially concluded that the defendant had not met the threshold burden needed to justify an in camera review of Lee's mental health records.\n\nNevertheless, \"out of an abundance of caution,\" the trial court reviewed all of Lee's mental health records in camera and concluded that \"[t]here is no especially probative feature to be disclosed from [the mental health records] in the court's judgment of this witness' capacity to relate the truth or to observe and recollect and narrate relevant occurrences, not only now, but in the course of her developing life as she suffered from physical illness and addiction problems.\" The records were then sealed for appellate review, and the deposition proceeded.\n\nDuring his subsequent cross-examination at Lee's deposition, defense counsel attempted to inquire into Lee's mental health at the time of the murders of Brown and Clarke, but was prevented from doing so by the trial court. Specifically, when defense counsel asked Lee about her history of hearing voices, the trial court interjected and reminded counsel that such questions violated its order sealing Lee's records, and that it would not allow any inquiry based on the records into \"the ability of the witness to recall, report accurately under oath and hopefully truthfully.\" The defendant then requested permission to make an offer of proof. The trial court denied the request, making it clear that under no circumstances would it revisit its order sealing Lee's records.\n\nLee subsequently testified before the jury during the defendant's trial. Lee testified on direct examination that in January, 1999, she had smoked crack on a daily basis. She further testified that she had smoked crack on the day of the murders. During cross-examination, Lee admitted that when she was under the influence of crack, she would experience extreme paranoia, lasting approximately five minutes. When asked what she meant by feeling \"paranoid,\" she stated that she would get \"scared.\" The defendant impeached Lee's credibility with an inconsistent statement from her deposition, wherein she testified that she remained paranoid for fifteen to twenty minutes after ingesting crack. The defendant further impeached Lee with numerous inconsistent statements that she had made to the police about the events surrounding the murders. Due to the court's order sealing her mental health records, however, defense counsel made no attempt to question Lee about her mental illnesses.\n\nWhile the appeal in the present case was pending, Adrian's case went to trial. On a motion by counsel for Adrian, the trial judge in that case, O'Keefe, J., ordered that either Lee consent to the release of her mental health records to defense counsel for Adrian, the same mental health records in dispute in the present case, or the state would be precluded from having Lee testify. Lee subsequently consented to their full release, thereby making the records available to Adrian's counsel during cross-examination.\n\nBecause Lee's mental health records had become part of the public record at Adrian's trial, the defendant's appellate counsel subsequently moved to have the records unsealed so their contents could be reviewed and referred to in the present appeal. Lee consented, and the trial court therefore unsealed them.\n\nOn appeal, the defendant claims that the trial court abused its discretion by denying disclosure of Lee's mental health records for purposes of cross-examination. The defendant argues that such an exclusion violated his state and federal constitutional rights to cross-examine Lee about her various hospitalizations, medications and psychiatric conditions, especially as aggravated by her significant crack use, in an effort to challenge her ability to perceive and recall the events surrounding the murders. We have reviewed Lee's mental health records in connection with our determination of this appeal and we conclude that the defendant should have been given access to portions of the records that bore on Lee's ability to understand, recall and relate the circumstances of the murders. We further conclude, however, that the failure to afford the defendant access to these records was harmless beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\n\"We first set forth the standard of review for determining whether the exclusion of this evidence entitles the defendant to a new trial. Upon review of a trial court's decision, we will set aside an evidentiary ruling only when there has been a clear abuse of discretion. State v. Provost, 251 Conn. 252, 257, 741 A.2d 295 (1999), cert. denied, 531 U.S. 822, 121 S.Ct. 65, 148 L.Ed. 2d 30 (2000); State v. Thomas, 205 Conn. 279, 283, 533 A.2d 553 (1987). The trial court has wide discretion in determining the relevancy of evidence and the scope of cross-examination and [e]very reasonable presumption should be made in favor of the correctness of the court's ruling in determining whether there has been an abuse of discretion. . . . To establish an abuse of discretion, [the defendant] must show that the restrictions imposed upon [the] cross-examination were clearly prejudicial.\" (Internal quotation marks omitted.) State v. Rolon, 257 Conn. 156, 173, 777 A.2d 604 (2001).\n\nIt is well established that \"[a] criminal defendant has a constitutional right to cross-examine the state's witnesses, which may include impeaching or discrediting them by attempting to reveal to the jury the witnesses' biases, prejudices or ulterior motives, or facts bearing on the witnesses' reliability, credibility, or sense of perception. Delaware v. Fensterer, 474 U.S. 15, 19, 106 S.Ct. 292, 88 L.Ed. 2d 15 (1985); Davis v. Alaska, 415 U.S. 308, 316, 94 S.Ct. 1105, 39 L.Ed. 2d 347 (1974); State v. Storlazzi, 191 Conn. 453, 457, 464 A.2d 829 (1983). Thus, in some instances, otherwise privileged records, like the ones in this case, must give way to a criminal defendant's constitutional right to reveal to the jury facts about a witness' mental condition that may reasonably affect that witness' credibility. State v. Hufford, 205 Conn. 386, 401-402, 533 A.2d 866 (1987); State v. Pierson, 201 Conn. 211, 227, 514 A.2d 724 (1986), on appeal after remand, 208 Conn. 683, 546 A.2d 286 (1988), cert. denied, 489 U.S. 1016, 109 S.Ct. 1131, 103 L.Ed. 2d 193 (1989).\" State v. Slimskey, 257 Conn. 842, 853-54, 779 A.2d 723 (2001).\n\n\"We are mindful, however, that the right to confront and to cross-examine is not absolute and may, in appropriate cases, bow to accommodate other legitimate interests in the criminal trial process.\" (Internal quotation marks omitted.) State v. Rolon, supra, 257 Conn. 175. \"The need to balance a witness' statutory privilege to keep psychiatric records confidential against a defendant's rights under the confrontation clause is well recognized. See, e.g., State v. Herring, 210 Conn. 78, 108-109, 554 A.2d 686, cert. denied, 492 U.S. 912, 109 S.Ct. 3230, 106 L.Ed. 2d 579 (1989). The test and the associated burdens imposed on a defendant are equally well chronicled. If, for the purposes of cross-examination, a defendant believes that certain privileged records would disclose information especially probative of a witness' ability to comprehend, know or correctly relate the truth, he may, out of the jury's presence, attempt to make a preliminary showing that there is a reasonable ground to believe that the failure to produce the records would likely impair his right to impeach the witness. . . . If in the trial court's judgment the defendant successfully makes this showing, the state must then obtain the witness' permission for the court to inspect the records in camera. A witness' refusal to consent to such an in camera inspection entitles the defendant to have the witness' testimony stricken. . . .\n\n\"Upon inspecting the records in camera, the trial court must determine whether the records are especially probative of the witness' capacity to relate the truth or to observe, recollect and narrate relevant occurrences. . . . If the court determines that the records are probative, the state must obtain the witness' further waiver of his privilege concerning the relevant portions of the records for release to the defendant, or have the witness' testimony stricken. If the court discovers no probative and impeaching material, the entire record of the proceeding must be sealed and preserved for possible appellate review. . . . Once the trial court has made its inspection, the court's determination of a defendant's access to the witness' records lies in the court's sound discretion, which we will not disturb unless abused.\" (Internal quotation marks omitted.) State v. Slimskey, supra, 257 Conn. 855-56.\n\n\"[T]he linchpin of the determination of the defendant's access to the records is whether they sufficiently disclose material especially probative of the ability to comprehend, know and correctly relate the truth . . . so as to justify breach of their confidentiality and disclosing them to the defendant in order to protect his right of confrontation.\" (Internal quotation marks omitted.) Id., 856-57. \"It bears emphasis [however] that any limitation on the impeachment of a key government witness is subject to the most rigorous appellate review.\" State v. Colton, 227 Conn. 231, 250, 630 A.2d 577 (1993), on appeal after remand, 234 Conn. 683, 663 A.2d 339 (1995), cert. denied, 516 U.S. 1140, 116 S.Ct. 972, 133 L.Ed. 2d 892 (1996).\n\nWith this standard in mind, our review of Lee's mental health records convinces us that portions of these records directly relate to Lee's ability to perceive, remember and relate events at the time of the murders and, therefore, should have been disclosed by the trial court to the defendant for use for impeachment purposes. Specifically, the records contain information that could call into question Lee's mental stability at the time of the events in question, and could have created doubt regarding her ability accurately to perceive and relate the events surrounding the murders. See State v. Piskorski, 177 Conn. 677, 736, 419 A.2d 866, cert. denied, 444 U.S. 935, 100 S.Ct. 283, 62 L.Ed. 2d 194 (1979). In particular, the records reveal that both prior to and after the murders, Lee was diagnosed with significant mental disorders, including \"cocaine induced psychiatric disorder with hallucinations,\" \"chronic paranoid schizophrenia,\" \"drug induced psychosis\" while using cocaine, and antisocial personality disorder.\n\nThe records further reveal that in the year prior to the events in question, while hospitalized, Lee had been placed in four point restraints and medicated with Thor-azine, an antipsychotic drug,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e on several occasions after severely acting out as a result of hearing voices. On one occasion in particular, Lee was restrained after running wildly up and down the hallway of the Southwest Community Mental Health Center, experiencing auditory hallucinations, and yelling that \"the people say I got to get out of here.\" Finally, the records reveal that only seven months after the events in question, Lee was again diagnosed as having \"a history of schizophrenia,\" of \"hearing voices for the last two years,\" especially when using drugs, and, most importantly, experiencing difficulty in recalling past events, including her numerous suicide attempts.\n\nOn the basis of the foregoing, we conclude that Lee's mental health records contained information demonstrating that she suffered from conditions that may have \"substantially affected [her] ability to observe, recall or narrate events at issue in the trial.\" State v. Cardinal, 194 Conn. 114, 119, 478 A.2d 610 (1984). Specifically, Lee's records reveal a history of mental unsoundness, including hallucinations, delusions, misperception of reality and paranoia, exacerbated by a severe state of substance dependency. The records therefore were probative of Lee's ability to \"comprehend, know and correctly relate the truth,\" which, as previously noted, is the linchpin in determining whether disclosure is warranted. (Internal quotation marks omitted.) State v. Slimskey, supra, 257 Conn. 856. Accordingly, we conclude that the trial court improperly denied the defendant access to this evidence. See State v. Storlazzi, supra, 191 Conn. 459 (stating that access to records bearing on \" `the mental unsoundness of a witness,' \" including \"such traits as hallucinations, delusions, lack of contact with or misperception of reality, [or] paranoia . . . are admissible to impeach the credibility of a witness\").\n\nThe state argues that the trial court correctly refused the defendant access to Lee's mental health records because her records solely relate to \"her drug and alcohol addiction and treatment, and the resulting depression, despair and suicidal feelings.\" On the basis of this court's conclusion in State v. Bruno, 236 Conn. 514, 529, 673 A.2d 1117 (1996), that \" `we have never held that a history of alcohol or drug abuse or treatment automatically makes a witness fair game for disclosure of psychiatric records of a criminal defendant,' \" the state argues that the trial court did not abuse its discretion in denying the defendant access to Lee's mental health records. We disagree.\n\nThe state mischaracterizes the nature of the defendant's claim. The defendant does not argue that he should have been given access to Lee's mental health records because they demonstrate a history of alcohol and drug abuse, and therefore would be relevant to her credibility. Rather, the defendant argues that he should have been given access because the records reflect that Lee suffered from mental instability, before and after the events in question, which was exacerbated by her drug and alcohol abuse. It is this information that the defendant deems strongly probative of Lee's ability accurately to perceive, recall and relate the events at the time of the murders. We agree with the defendant.\n\nOur conclusion that the trial court improperly denied disclosure of Lee's mental health records for purposes of cross-examination does not, however, end our inquiry. We must next consider whether the trial court's improper refusal to disclose Lee's mental health records is of constitutional magnitude, or whether the error was merely evidentiary in nature. See State v. Kirsch, 263 Conn. 390, 412, 820 A.2d 236 (2003). \"If the claim is of constitutional magnitude, the state has the burden of proving the constitutional error was harmless beyond a reasonable doubt. . . . Otherwise, in order to establish reversible error on an evidentiary impropriety, the defendant must prove both an abuse of discretion and a harm that resulted from such abuse.\" (Citations omitted.) Id. \"In State v. Slimskey, supra, 257 Conn. 858, we stated that `there is . . . a minimum level of cross-examination that must be afforded to the defendant into matters affecting the reliability and credibility of the state's witnesses.' Accordingly, in that case, we held that, because the trial court's failure to disclose treatment records was an abuse of discretion that deprived the defendant of an opportunity to pursue a relevant line of inquiry, such error amounted to a constitutional violation. Id., 859.\" State v. Francis, 267 Conn. 162, 181-82, 836 A.2d 1191 (2003).\n\nIn the present case, the trial court refused to disclose Lee's mental health records, which prevented the jury from evaluating the impact of Lee's mental condition on her ability accurately to perceive, recall and relate the events in question. Moreover, although the trial court allowed the defendant to question Lee during cross-examination concerning her heavy use of crack and the paranoia she felt while under the influence of crack, the defendant was denied any meaningful opportunity to inquire into Lee's extensive history of mental illness, and how her admitted drug use may have affected her mental condition, which we previously have determined was relevant to her credibility as a witness. Consequently, we conclude that the trial court's order denying access to the mental health records and restricting the scope of the defendant's cross-examination of Lee was of constitutional magnitude, which requires the state to establish its harmlessness beyond a reasonable doubt. See id., 182 (constitutional violation when court refused to disclose records reflecting extreme drug and alcohol abuse of witness); see also Davis v. Alaska, supra, 415 U.S. 316 (confrontation clause violated when defense counsel restricted by state confidentiality provisions from questioning witness on juvenile criminal record). We further conclude, however, that the state has met this burden in the present case.\n\n\"Whether [a confrontation violation] is harmless in a particular case depends upon a number of factors, such as the importance of the witness' testimony in the prosecution's case, whether the testimony was cumulative, the presence or absence of evidence corroborating or contradicting the testimony of the witness on material points, the extent of cross-examination otherwise permitted, and, of course, the overall strength of the prosecution's case. . . . Most importantly, we must examine the impact of the evidence on the trier of fact and the result of the trial. . . . If the evidence may have had a tendency to influence the judgment of the jury, it cannot be considered harmless.\" (Internal quotation marks omitted.) State v. Rolon, supra, 257 Conn. 174.\n\nIn the present case, the state supported its case with a considerable amount of corroborating evidence, significantly limiting its need to rely solely on Lee's testimony. This evidence included the testimony of several of the defendant's drug associates corroborating the defendant's involvement in the murders, several incriminating statements said to, or overheard by, the defendant's fellow inmates, and the testimony of Keene, the defendant's girlfriend, all of which pointed to the defendant's guilt.\n\nKennedy, an associate of the defendant's who was with him during the Lindley Avenue shooting, testified that after the defendant's arrest for the murder of Snead, the defendant made a significant effort to discover the identity of the state's witnesses against him in that homicide. Kennedy testified that the defendant ultimately had told him that he had determined that Brown was the state's witness against him and that he \"was going to kill [him]\" to prevent Brown from testifying.\n\nDaniels, an associate who participated in the drug trafficking network with Kennedy and the defendant, testified that he had purchased a .357 Magnum revolver for the defendant, the same type of gun that subsequently was used to commit the murders of Brown and Clarke. Daniels' testimony was corroborated by that of Michael Lanier, the individual who had sold Daniels the gun.\n\nKing testified that once the defendant had obtained possession of the .357 Magnum, the defendant described to Adrian, and several other associates, how he would kill Brown by placing the barrel of the gun to the child's head and pulling the trigger. Ira Kanfer, the state's medical examiner, testified that Brown was killed in such a manner; and Marshall Robinson, the state's firearms expert, testified that Brown and Clarke were both killed by bullets from a .357 Magnum. In addition, Keene testified that sometime in December of 1998, after the defendant had determined that Brown was a state's witness in the Lindley Avenue shooting, the defendant told her to leave town because he was going to begin murdering witnesses. Specifically, Keene testified that the defendant first told her to move in November, 1998, stating that, \"[h]e told me shit was starting to get hot and he [was] about to start getting witnesses, witnesses--wait a minute. . . . [H]e told me witnesses [were] about to get killed.\" Keene further testified that the defendant warned her again on Christmas day in 1998, stating: \"He was talking in an opening to everybody, but, like, me mainly . . . I'm telling her she better move. Shit about to start getting hot, meaning people starting to get killed.\" Lastly, Keene testified that, when the defendant spoke about killing witnesses, he quoted the following lyrics from a rap song: \"[N]iggers want to lie, niggers wonder why, niggers gonna die.\"\n\nLastly, two of the defendant's fellow inmates, Aundrey Holeman and Thomas Kerr, testified that while each was incarcerated with the defendant, the defendant had bragged about his involvement in the murders. Holeman testified that he had overheard the defendant tell another inmate that Adrian would not testify against him because the defendant had murdered one person, but Adrian had murdered two,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e and that the defendant was pleased with his brother because Adrian \"had done something righteous\" for him \"that nobody else . . . would do . . . .\" Kerr testified that the defendant had told him that \"that bitch,\" Clarke, and not the defendant, was responsible for both of the deaths, and that \"[s]he should have known not to mess with him.\"\n\nMoreover, the state presented a significant amount of physical evidence that the jury could have found corroborated Lee's description of the murders, lessening the state's need to rely upon her testimony. For example, Lee testified that grocery bags had been strewn against the door when Adrian forced his way into Clarke and Brown's home. This was confirmed by photographs taken at the scene of the crime. Lee testified that she had heard a gunshot, and then heard Brown yell out, \"mommy, mommy, mommy, mommy\" from the top of the stairs. Brown's body was found at the top of the stairs. Lee stated that she saw Clarke run as far as the second floor bedroom before she heard another shot. Photographs established that Clarke's body was found in a second floor bedroom. Lee testified that she saw Adrian exit the bedroom, proceed to the top of the stairs, and then shoot Brown in the head. Physical evidence confirmed this testimony. Finally, Lee testified that when she realized what had happened, she ran out of the house and returned to her residence at 200 Earl Avenue. Louis Ellis, who also lived at 200 Earl Avenue, corroborated Lee's account, testifying that on the evening of the murders, he heard four or five gunshots, and shortly thereafter, he heard Lee run into the house breathing hard, as if out of breath.\n\nLastly, a review of the record reveals that even without Lee's mental health records, the defendant was able to take full advantage of numerous other methods of challenging Lee's credibility. Defense counsel elicited from Lee herself that she had lied to the police, under oath, on at least ten different occasions. The defendant also put into evidence several letters written by Lee that contradicted and, in some instances, explicitly recanted her accusations regarding the defendant's complicity in the murders.\n\nAdditionally, the defendant mounted a serious attack on Lee's motive for testifying by exposing the fact that, despite being an accessory to these murders and having pleaded guilty to federal drug offenses, Lee was hoping for a minimal amount of jail time as a result of her testimony. The defendant also revealed that Lee was infatuated with Officer Dwayne McBride, one of the investigating Bridgeport police officers, and wanted to convince him that when she was called to testify, she would tell the him the real \"truth.\" Furthermore, the defendant elicited testimony from Lee that since she had been taken into government custody, she was kept safe, she was receiving good meals, medical treatment and drug rehabilitation, and she was looking forward to a new life.\n\nFinally, even without the use of Lee's mental health records, the defendant significantly undermined Lee's credibility concerning her ability to perceive, remember and recall the events in question by highlighting the details of her significant drug habit. In particular, building upon Lee's testimony during direct examination that she had smoked between $100 and $200 worth of crack per day for a period before and after the murders, the defendant was able to further elicit that while Lee was under the influence of crack, she experienced extreme paranoia.\n\nOn the basis of our careful review of the trial court record in the present case, we are persuaded that the state has satisfied its burden of proving that the trial court's refusal to order disclosure of Lee's mental health records and permit their use in cross-examination was harmless beyond a reasonable doubt. The state produced substantial evidence that the crimes had been perpetrated as the defendant had planned, physical evidence reasonably corroborated Lee's testimony, and the defendant was able to undermine Lee's credibility extensively without the use of the mental health records. Consequently, we conclude that the state has established, beyond a reasonable doubt, that the disclosure and use of Lee's mental health records would not \"have had a tendency to influence the judgment of the jury . . . .\" State v. Rolon, supra, 257 Conn. 174; cf. State v. Cassidy, 236 Conn. 112, 129-30, 672 A.2d 899 (1996) (concluding that state had not met its burden of proving harmlessness beyond reasonable doubt because its case rested \"solely on the [uncorroborated] testimony of the victim\"); State v. Colton, supra, 227 Conn. 254 (concluding that trial court's exclusion of witness' testimony was harmful error because state conceded that \"the jury . . . would have to credit [the witness'] testimony to convict the defendant\").\n\nD.\n\nThe defendant's final claim is that by conducting two ex parte\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e proceedings with Lee's attorney, the trial court denied the defendant his rights to: (1) be present at all important stages of trial; (2) have counsel at every critical stage of a criminal proceeding; and (3) have an impartial judge preside at trial. Specifically, the defendant argues that by conducting the ex parte hearings without him or his attorney present, the trial court violated the defendant's constitutional rights under the sixth and fourteenth\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e amendments to the United States constitution. The defendant further argues that events surrounding the ex parte hearings evidenced a bias against the defendant, in violation of canon 3 (a) (4) of the Code of Judicial Conduct,\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e and, therefore, the judge should have recused himself, sua sponte, from further proceedings.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Even if we were to assume, arguendo, that the defendant's constitutional rights were violated, we nevertheless conclude that the state has proven beyond a reasonable doubt that the impropriety was harmless. We therefore conclude that the defendant's claim that the trial court violated the Code of Judicial Conduct is without merit.\n\nThe following facts and procedural history are relevant to this claim. Prior to trial, Lee was incarcerated at a federal penal hospital in Fort Worth, Texas. In December, 1999, near Christmas, Lee sent holiday cards, with letters enclosed, to the three Bridgeport police officers who had befriended her during their investigation of the murders of Brown and Clarke. Simultaneously, she sent a card, with a letter enclosed, to her attorney, Richard Reeve, in which she recanted her accusations against the defendant and Adrian. During transmission, the letters and envelopes were somehow switched, causing the holiday cards and letters addressed to the police officers to be delivered to Reeve, and the recantation letter to be delivered to the Bridgeport police. Once the police officers determined that the letter that they had received had been intended for someone else, they immediately turned the letter over to the Bridgeport state's attorney, Jonathan Benedict.\n\nBenedict, realizing that the letter contained potentially exculpatory information and that it was most likely an inadvertently disclosed privileged communication, forwarded the letter to the trial court, Thim, J., for an in camera review pursuant to General Statutes § 54-86c (b).\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e After reviewing the letter, Judge Thim concluded that it contained exculpatory information that should be disclosed to the defendant, but suggested that if Benedict disagreed, he should present the issue to Judge Ford, the trial judge assigned to the case. The matter was then referred to Judge Ford for his review.\n\nEarly in January, 2000, Judge Ford conducted the first of two\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e ex parte hearings with Reeve in an effort to determine: (1) whether the letter did in fact contain exculpatory information that would require that the state turn the letter over to the defendant; and (2) if the letter did contain exculpatory information, whether such information nevertheless was protected by Lee's attorney-client privilege. Because the exculpatory nature of the letter was apparent from its content, the hearing focused on whether Lee had intended to assert her attorney-client privilege with regard to the letter and, if she did, whether the inadvertent disclosure vitiated the privilege, thereby requiring the court to disclose the letter to the defense.\n\nDuring this meeting, which was conducted without the knowledge of the defendant or the state, the court discussed with Reeve the letter's contents, how the letter came into the state's possession, and the legal ramifications of its disclosure. In particular, the court asked Reeve whether he believed the defendant would be prejudiced by delaying disclosure to the defendant while Reeve discussed the letter with his client, Lee. Both the trial court and Reeve concluded that, under the circumstances, such a delay was warranted and, therefore, the court directed Reeve to travel to Fort Worth, Texas, where Lee was being held in a federal prison, in order to further discuss the matter with her. The court also requested that Reeve file a memorandum with the court detailing the factual and legal basis for Lee's claim of privilege after Reeve visited her. The court then sealed all of the documents obtained during the ex parte hearing, as well as the transcript of the proceedings.\n\nOn February 15, 2000, while the parties were selecting the jury, the trial court took a recess from the proceedings and requested that counsel leave the courtroom so that the trial court could speak privately with Reeve. Although the court did not disclose to either the defendant or the state the purpose of the meeting, both attorneys complied without comment. During this second meeting, Reeve submitted a memorandum to the court confirming that the misdirection of Lee's recantation letter was inadvertent, as well as providing legal argument for not disclosing the letter to the state's attorney or defense counsel. The court then discussed with Reeve, among other things, the legal issue of whether, in light of the letter, Lee's deposition would be admissible should Lee be unavailable to testify. It was the court's opinion that \"when [Lee's letters] are offered in the full context the way in which they have been given . . . they [do not] amount to an awful lot . . . [because] [t]hey don't show anything real[ly] severe[ly] exculpa-tory.\" Reeve agreed, but noted that if Lee were unavailable to testify and the letter to him were disclosed, the defense would want to address on cross-examination the issue of why Lee would lie to her attorney. Reeve stated that, based upon his conversations with Lee, it was his belief that she would respond to any such inquiry by stating that, \"as she realized the gravity of what she had done and the legacy she was leaving with and upon her children . . . it [was] just too difficult . . . to bear. And the question [then became], is there a way for me to get out of this so I don't leave my children with the shame and the legacy of their mother having been involved in a murder which involved another young child?\" Reeve stated, however, that he felt that he had no obligation to disclose Lee's claim that she had lied under oath to both the court and the other parties because he believed that the present recantation was, in fact, a lie in itself. Judge Ford made no comment on this point. At the conclusion of the hearing, the court instructed court personnel not to reveal what had transpired in the hearing and sealed the record for appellate review.\n\nThree days after that hearing, on February 18, 2000, the court filed a memorandum of decision disclosing to both the state and defense counsel that on January 5, 2000, the court had conducted a hearing to determine whether the recantation letter to Reeve should be disclosed to the defendant, and that on February 15, 2000, Reeve had reported back to the court, noting that Lee had intended the letter to be a private communication to her attorney. The court then concluded in its memorandum that the disclosure was inadvertent, that the inadvertent disclosure did not destroy the attorney-client privilege, and, therefore, the letter would remain sealed.\n\nThe defendant thereafter filed a motion for an in camera hearing to establish an \"appropriate record . . . to support [the court's] decision . . . a full record of the facts underlying the invocation of the privilege in this case and to permit the court to explore the exculpatory nature of the information sought by the defendant.\" The motion did not challenge, however, the propriety of the trial court's conducting the previous ex parte proceedings. In a memorandum of decision issued a few days later, the trial court denied the defendant's request for an evidentiary hearing, concluding that \"any further inquiry on the part of the defense into the substance of the letter from [Lee] to her attorney would violate her assertion of the attorney-client privilege . . . .\"\n\nIn early April, 2000, the trial court was informed that Lee had decided to waive her attorney-client privilege regarding the letter she had intended to send to Reeve. The court therefore unsealed the letter and made it available to defense counsel.\n\nLee subsequently testified during the defendant's jury trial on May 9 and 10, 2000. On the second day of her testimony, during cross-examination, she read the letter she had written Reeve to the jury and the letter was admitted as a full exhibit in the case. In the letter, Lee stated that she had lied when she had implicated both the defendant and his brother, Adrian, in the murders of Brown and Clarke. On redirect examination, the state asked Lee why she had written the letter. Lee testified: \"I was very desperate. I didn't want to die in jail . . . because the doctor told me I had AIDS.\" She stated that she thought that if she told her attorney that she had lied, she would be able to get out of jail and \"see [her] kids before [she] die[d].\" Lee, however, did not reveal any concern over what type of legacy her involvement in the murders would leave for her children, as Reeve had suggested to the trial judge during the February 15, 2000 hearing.\n\nAfter this appeal was filed, the transcripts and other documents pertaining to the trial court's ex parte hearings were released to both the state and the defendant. The defendant then learned for the first time of Reeve's disclosure to the court that Lee allegedly wrote the recantation letter out of shame and concern over the legacy that she was leaving her children.\n\n1.\n\nThe defendant first contends that the trial court violated his constitutional rights under the sixth and fourteenth amendments to the United States constitution by conducting two ex parte proceedings with Lee's attorney, during which the substance of Lee's reasons for sending the recantation letter was discussed. Specifically, the defendant argues that by excluding both him and his attorney from the proceedings, the defendant was prevented from discovering, and subsequently utilizing, the reasons for the letter, another ground to impeach Lee, in that such information was disclosed only at these ex parte meetings. The defendant contends that the action by the trial court violated his constitutional right to: (1) be present at any stage of trial where his exclusion would interfere with his opportunity for effective cross-examination; (2) be present at all stages of trial where his presence would contribute to the fairness of the proceedings; and (3) have the presence of counsel at every critical stage of a criminal proceeding. The defendant concedes that this claim was not properly preserved at trial and therefore seeks review under the Golding doctrine and the plain error rule.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nThe defendant argues that the issue is reviewable under Golding\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e because the record is adequate for review and the claim is of constitutional magnitude.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e We agree that the issue is reviewable under Golding, but conclude that the defendant cannot prevail under the fourth prong of Golding because the alleged constitutional violations were harmless beyond a reasonable doubt.\n\nAt the outset, we briefly review the scope of the defendant's claims. The defendant is not claiming that his constitutional rights under the sixth and fourteenth amendments were violated because the court failed to inform him that the ex parte proceedings had occurred or to disclose to him the substance of those proceedings. He concedes that the record reflects just the opposite. In mid-February, 2000, only three days after the conclusion of the second and final ex parte proceeding, the trial court issued a memorandum of decision fully disclosing to the parties the fact that it had conducted two ex parte hearings with Reeve. The memorandum further stated that the purpose of the proceedings was to determine whether Lee's letter recanting her implication of the defendant and Adrian in the murders of Brown and Clarke should be disclosed to the defendant, or whether the letter was protected by Lee's attorney-client privilege.\n\nThe defendant also is not claiming that his constitutional rights were violated because he was not made privy to Lee's recantation letter. The defendant concedes that in April, 2000, after learning that Lee had waived her privilege, the court unsealed the letter and made the letter available to defense counsel. The letter subsequently was read by Lee to the jury during cross-examination and became a full exhibit at trial.\n\nWhat the defendant does argue is that, by failing to disclose Reeve's brief reference to an alternate reason for Lee's recantation letter until after the transcripts of the ex parte proceedings were released following the filing of the present appeal, the trial court violated the defendant's constitutional rights under the sixth and fourteenth amendments by depriving him of an alternate ground to impeach Lee. Specifically, the defendant contends that Reeve's statement that he believed his client wrote the recantation letter because she did not want to \"leave [her] children with the shame and the legacy of their mother having been involved in a murder which involved another young child,\" was critical to impeaching the state's key witness in that she gave a different explanation on cross-examination. During cross-examination, Lee testified that the reason she had written the recantation letter was because she \"was very desperate . . . [and] didn't want to die in jail . . . because the doctor told [her she] had AIDS,\" a reason different from the one that she had given her attorney, which he later conveyed to the trial court. The defendant contends that the trial court's failure to allow for his or his attorney's presence during the ex parte hearing, or at a minimum, subsequently disclose this critical impeachment evidence to the defendant, violated his constitutional rights.\n\nWe begin by setting forth the applicable standard of review. Whether the exclusion of the defendant and his counsel from the trial court's ex parte proceedings violated the defendant's constitutional rights is a mixed question of law and fact. Accordingly, our review is plenary. Duperry v. Solnit, 261 Conn. 309, 318, 803 A.2d 287 (2002) (\"[q]uestions of law and mixed questions of law and fact receive plenary review\").\n\nIn the present case, we need not reach the merits of the defendant's constitutional claims because, even if we were to assume that the defendant's claims are valid, the state has established beyond a reasonable doubt that any impropriety was harmless. A conclusion that a defendant's sixth and fourteenth amendment rights were violated is subject to harmless error analysis, which will result in a new trial only if the exclusion of the proffered evidence is not harmless beyond a reasonable doubt. See Chapman v. California, 386 U.S. 18, 24, 87 S.Ct. 824, 17 L.Ed. 2d 705 (1967) (\"before a federal constitutional error can be held harmless, the court must be able to declare a belief that it was harmless beyond a reasonable doubt\"); State v. Merriam, 264 Conn. 617, 649, 826 A.2d 1021 (2003) (where constitutional violation is subject to harmless error analysis, \"state has burden of demonstrating that . . . violation was harmless beyond a reasonable doubt\"). Whether a constitutional violation is harmless in a particular case depends upon the totality of the evidence presented at trial. State v. Merriam, supra, 649. \"If the evidence may have had a tendency to influence the judgment of the jury, it cannot be considered harmless.\" (Internal quotation marks omitted.) Id.\n\nIn part II C of this opinion, we addressed the issue of whether the trial court's abuse of discretion, in failing to grant the defendant access to portions of Lee's mental health records, was harmless error. We noted that the state had produced an abundance of evidence that the crime was perpetrated just as the defendant had planned, that the physical evidence reasonably corroborated Lee's testimony, and that the defendant was able to challenge Lee's credibility extensively without the use of the mental health records. We therefore concluded that the state had proven beyond a reasonable doubt that the inclusion of Lee's mental health records would not have \"had a tendency to influence the judgment of the jury\"; (internal quotation marks omitted) id.; and, consequently, the improper suppression of those records was harmless beyond a reasonable doubt.\n\nSimilarly, on the basis of the totality of the evidence produced at trial, we conclude that the defendant's inability to utilize the alternate ground for impeaching Lee's testimony concerning the recantation letter--her shame that her children would know that she had been involved in the murder of a child--was harmless beyond a reasonable doubt. First, Lee's motivation in sending the recantation letter provided only marginal additional exculpatory material. Even without this additional impeachment material, the record reflects that the defendant was able to take full advantage of numerous other methods of challenging Lee's credibility as well as her motive to testify. See part II C of this opinion. Moreover, even if Lee's testimony had been stricken from the record entirely, the remaining evidence produced by the state would have been sufficient to convict the defendant beyond a reasonable doubt. Accordingly, we conclude that any misconduct by the trial court was harmless beyond a reasonable doubt and the defendant's claim therefore fails under the fourth prong of Golding.\n\n2.\n\nThe defendant's final argument is that the trial court's two ex parte proceedings with Lee's attorney evidenced a bias against the defendant and, therefore, the trial judge should have, sua sponte, recused himself. Specifically, the defendant argues that the trial judge should have recused himself after violating canon 3 (a) (4) (A) of the Code of Judicial Conduct by: (1) failing promptly to disclose to the defendant the substance of the ex parte hearings and allow him reasonable opportunity to respond; and (2) requesting that Reeve perform an independent investigation of the facts of the case when the trial court directed Reeve to travel to Texas to consult with Lee concerning the recantation letter that she had written.\n\nAs a preliminary matter, we begin by addressing the reviewability of the defendant's claims. The defendant concedes that his claim of judicial impropriety was not properly preserved at trial and therefore he seeks review under Golding and the plain error doctrine.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nThe defendant argues that the issue is reviewable under Golding\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e because the record is adequate for review and the claim is of constitutional magnitude.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e We agree.\n\nWe conclude, however, that the defendant's claim is without merit, and thereby fails to meet the third prong of Golding.\n\nWe begin our analysis by setting forth the applicable standard of review. Whether the trial judge violated the Code of Judicial Conduct by failing to recuse himself, sua sponte, after conducting two ex parte hearings is an issue of law over which our review is plenary. Abington Ltd. Partnership v. Heublein, 246 Conn. 815, 825, 717 A.2d 1232 (1998).\n\nCanon 3 (a) (4) of the Code of Judicial Conduct generally prohibits a presiding judge from initiating, permitting or considering ex parte communications concerning pending or impending proceedings, outside of the presence of the parties. See footnote 46 of this opinion. The canon also contains several explicit exceptions to its general prohibition, one of which provides that \"[a] judge may initiate or consider any ex parte communications when expressly authorized by law to do so.\" (Emphasis added.) Code of Judicial Conduct, Canon 3 (a) (4) (E). The ex parte hearings conducted by the trial court in the present case arose under § 54-86c (b), which expressly provides that \"[a]ny state's attorney, assistant state's attorney or deputy assistant state's attorney may request an ex parte in camera hearing before a judge, who shall not be the same judge who presides at the hearing of the criminal case if the case is tried to the court, to determine whether any material or information is exculpatory.\"\n\nIn the present case, the ex parte hearings, which had been requested by the state's attorney after Lee's letter had been turned over to the trial court, were authorized by § 54-86c (b). Therefore, they fall within the expressly enumerated exception in canon 3 (a) (4) (E) for an ex parte proceeding expressly authorized by law. After Judge Thim performed an in camera inspection of the recantation letter, pursuant to § 54-86c (b), he stated that although it was his opinion that the letter contained exculpatory information, the state also might want to present the issue to Judge Ford, the trial judge, for additional review. The state did in fact present the issue to Judge Ford for a separate § 54-86c (b) review. Because the defendant's case was not tried to the court, it was appropriate for Judge Ford to conduct a separate ex parte hearing concerning the letter. See General Statutes § 54-86c (b) (restricting ex parte in camera review of potentially exculpatory information to judge who is not presiding as fact finder).\n\nWe acknowledge that the trial court's inquiry at the ex parte hearings was not limited to whether Lee's letter contained exculpatory information. The hearings also addressed the issues of whether the letter should remain undisclosed under the attorney-client privilege, and whether that privilege had been waived by the inadvertent disclosure. This broadened scope of the ex parte hearing does not necessarily render the hearings violative of canon 3 (a) (4), however, because, under our common law, ex parte proceedings are authorized to resolve claims of attorney-client privilege.\n\nWe have stated that, \"[t]he decision of whether to engage in an [ex parte] in camera review of . . . allegedly privileged information is necessarily one for the trial court.\" Olson v. Accessory Controls \u0026 Equipment Corp., 254 Conn. 145, 183, 757 A.2d 14 (2000). Furthermore, we have stated that once it has been established that the privilege applies, \"the trial court has discretion to determine if a waiver of the attorney-client privilege has occurred and the scope of that waiver\"; Harp v. King, 266 Conn. 747, 770, 835 A.2d 953 (2003); and \"in certain circumstances, [an ex parte in camera review] may be an appropriate means of examining the allegedly privileged material without abrogating the privilege itself.\" Olson v. Accessory Controls \u0026 Equipment Corp., supra, 182-83; see also, e.g., State v. Ortiz, 252 Conn. 533, 557, 747 A.2d 487 (2000) (discussing standard that criminal defendant must meet to obtain in camera inspection of witness' confidential records sought for impeachment purposes); Babcock v. Bridgeport Hospital, 251 Conn. 790, 846-49, 742 A.2d 322 (1999) (discussing attorney-client privilege and in camera review in context of medical peer review statute). Such situations occur when there is a \"risk of disclosing the privileged material to an adverse party through an examination of the documents themselves . . . .\" Olson v. Accessory Controls \u0026 Equipment Corp., supra, 182. In the present case, such a risk was evident because at the time of the ex parte hearings, Lee had not yet waived her potential privilege in the recantation letter. Consequently, we conclude that because the ex parte proceedings were expressly authorized by law, they were not conducted in violation of the Code of Judicial Conduct.\n\nThe defendant further claims that, even if the law expressly permitted the trial court's inquiry into whether Lee's letter was exculpatory, and whether that letter nonetheless was protected by the attorney-client privilege, the court did not limit its inquiry to these two subjects. Rather, the defendant argues, the trial court also addressed the issue of whether the defendant's constitutional right to confrontation\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e would overcome the attorney-client privilege, which was outside the court's express legal authority, and therefore violative of canon 3 (a) (4) (E). The state responds that, although it does not dispute the contention that the defendant should have been included in the court's discussion of this ancillary topic, the defendant's claim was rendered moot once Lee waived her privilege in the letter. We agree with the state.\n\n\"[M]ootness implicates the jurisdiction of the court. . . . It is a well-settled general rule that the existence of an actual controversy is an essential requisite to appellate jurisdiction; it is not the province of appellate courts to decide moot questions, disconnected from the granting of actual relief or from the determination of which no practical relief can follow. . . . In the absence of an actual and existing controversy for us to adjudicate . . . the courts of this state may not be used as a vehicle to obtain judicial opinions upon points of law . . . and where the question presented is purely academic, we must refuse to entertain the appeal.\" (Citation omitted; internal quotation marks omitted.) Green Rock Ridge, Inc. v. Kobernat, 250 Conn. 488, 497, 736 A.2d 851 (1999).\n\nIn the present case, prior to the commencement of trial, Lee waived her attorney-client privilege regarding the recantation letter. The trial court therefore unsealed the letter and made it available to defense counsel, who had the letter admitted as a full exhibit at trial. Consequently, any claim of impropriety concerning the court's discussion with Reeve about the defendant's right of confrontation was rendered moot when the letter was fully disclosed to the defendant prior to trial.\n\nIII. STATE'S APPEAL\n\nAt a separate penalty phase hearing with regard to the two capital felonies for which the defendant was convicted, the same jury that convicted the defendant considered evidence of aggravating and mitigating factors as provided in § 53a-46a.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e After several days of deliberation following the admission of that evidence, the jury was unable to reach a unanimous verdict as to either of the offenses. The state moved for a mistrial, but its motion was denied. The trial court thereafter merged the two counts and rendered judgment imposing a sentence of life imprisonment without the possibility of parole. The state then moved for permission to appeal, which was also denied. This appeal followed.\n\nThe state now challenges the trial court's denial of (1) the state's request for permission to appeal pursuant to § 54-96,\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e and (2) the state's motion for a mistrial. The state argues that the trial court abused its discretion by denying the state permission to appeal, after concluding, among other things, that a deadlocked jury can reach a lawful verdict. The state further argues that the trial court abused its discretion by denying the state's motion for a mistrial after improperly instructing the jury that if it remained deadlocked, the trial court would be required to impose a sentence of life imprisonment \"without the benefit of release.\" Such an improper instruction, the state argues, was not only based upon an unsound legal premise, but tainted the jury deliberations by: (1) leading the jury to believe that the responsibility for determining the appropriateness of whether the defendant should be sentenced to life imprisonment or put to death did not rest solely in its discretion; and (2) increasing the likelihood that the jury would remain deadlocked. We agree.\n\nA.\n\nThe state first claims that the trial court abused its discretion when it denied the state permission to appeal from the denial of its motion for mistrial. Specifically, the state argues that in denying it permission to appeal, the trial court misconstrued the law of unanimity in the context of a capital felony penalty hearing, and by doing so, improperly concluded that the jury in the present case reached a lawful verdict. We agree.\n\nThe following facts and procedural history are relevant to this issue. After the defendant's conviction of two counts of capital felony, the trial court conducted a penalty hearing before the same jury that had heard the guilt phase of the proceedings. Pursuant to § 53a-46a, the jury was to determine whether the imposition of the death penalty was warranted by making findings concerning aggravating and mitigating factors. While deliberating, the jury repeatedly informed the trial court that it could not reach a unanimous verdict. Despite several reinstructions by the court, which included a \"Chip Smith\"\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e instruction, the jury remained deadlocked.\n\nThe trial court then submitted to the jury a revised verdict form that allowed the jury to indicate that it unanimously agreed that it could not unanimously agree as to certain findings regarding aggravating and mitigating factors. Neither the defendant nor the state objected to the submission of the revised form to the jury. The jury then resumed deliberations and subsequently filled out the verdict form to indicate as follows: On the capital felony count concerning Brown's murder, \"[w]e the jury unanimously agree that we are unable to unanimously agree that one or more of the proved aggravating factors outweighs one or more of the proved nonstatu-tory mitigating factors\"; and, as to the capital felony count directed to the double homicide of Brown and Clarke, \"[w]e the jury unanimously agree that the [s]tate . . . has failed to prove one or more statutory aggravating factors beyond a reasonable doubt.\"\n\nAfter receipt of the revised special verdict form indicating that the jury unanimously agreed that it could not unanimously agree, the trial court ordered the verdict accepted and recorded. The state then orally moved for a mistrial pursuant to Practice Book § 42-45.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e The state argued, among other things, that the jury's response to the revised verdict form merely confirmed that it could not unanimously agree, and therefore, a valid verdict had not been reached because \"no finding of fact [had] been made by the jury.\" The court, however, denied the state's motion. The state subsequently moved for permission to appeal, which request also was ultimately denied.\n\nThereafter, the trial court issued a memorandum of decision articulating its rationale for denying the state's motion for permission to appeal from the denial of its motion for a mistrial.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e In its memorandum, the court reasoned that the jury's finding that it unanimously agreed that it could not unanimously agree constituted a valid verdict that indicated that \"the state [had] failed to sustain its burden of proof.\" The court further concluded that the jury's verdict indicated that the state was unable to overcome any mitigating factor found by the jury and the state's motion for permission to appeal, therefore, was denied.\n\nWe begin our analysis by setting forth the appropriate standard of review that guides our resolution of this issue. \"As a general proposition . . . § 54-96 authorizes the state to appeal questions of law in a criminal case only if the trial court grants permission to appeal. Section 54-96, however, does not preclude an appeal by the state when the denial was so arbitrary as to constitute an extreme abuse of discretion rendering the denial ineffective. In such cases the statute's condition requiring the court's permission to appeal cannot serve to insulate a trial court from review by this court; rather, the statute as a whole remains operative to allow appeal by the state. . . . Although we accord great deference to the trial court's discretionary rulings on these matters, that does not mean that its decision is shielded from our scrutiny. . . . Section 54-96 does not deprive this court of jurisdiction simply because the trial court gave considered reasons when it denied the state permission to appeal.\" (Citations omitted; internal quotation marks omitted.) State v. Bergin, 214 Conn. 657, 660-61, 574 A.2d 164 (1990). \"Confidence in our judicial system would be severely eroded if the trial court had the authority to dismiss [the penalty phase] against [a] defendant . . . on an unsound premise, and could then insulate its decision from appellate review.\" Id., 662-63. Consequently, this court will review a trial court's decision denying the state an appeal and will not uphold the denial if \"the record manifests a `clear and extreme abuse of discretion' or [if] `injustice appears to have been done.' \" Simms v. Warden, 229 Conn. 178, 189, 640 A.2d 601 (1994); see State v. Bergin, supra, 660-61; State v. S \u0026 R Sanitation Services, Inc., 202 Conn. 300, 312, 521 A.2d 1017 (1987); State v. Avcollie, 174 Conn. 100, 110-11, 384 A.2d 315 (1977).\n\n\"[I]n the context of evaluating whether a court has abused its discretion in denying requests for certification or permission to appeal, we repeatedly have applied the criteria set forth in Lozada v. Deeds, 498 U.S. 430, 432, 111 S.Ct. 860, 112 L.Ed. 2d 956 (1991). See, e.g., State v. James, 261 Conn. 395, 405-10, 802 A.2d 820 (2002) (denial of state's request for permission to appeal from court's ruling that police lacked probable cause to arrest); Seebeck v. State, 246 Conn. 514, 534, 717 A.2d 1161 (1998) (denial of request for certification to appeal from denial of petition for new trial); Simms v. Warden, 230 Conn. 608, 616, 646 A.2d 126 (1994) (denial of petition for certification to appeal from denial of writ of habeas corpus). The Lozada inquiry was established in order to determine whether a petitioner has made the requisite substantial showing of the denial of a federal right for the issuance of the required certificate of probable cause to appeal the denial of federal habeas relief . . . . In Lozada, the United States Supreme Court held that the required substantial showing was made if the petitioner [1] demonstrate[s] that the issues are debatable among jurists of reason; [2] that a court could resolve the issues in a different manner; or [3] that the questions are adequate to deserve encouragement to proceed further. . . . In the federal courts, the probable cause certificate serves the same policy goal as the granting of permission for certification to appeal does in Connecticut, namely, to screen out frivolous appeals while still protecting the litigants' statutory right to appellate review of adverse determinations. . . . [Consequently], we held that the Lozada criteria was appropriate in evaluating an abuse of discretion in which the state sought permission to appeal under . . . § 54-96. State v. James, supra, [405-10]. Thus, [we have made] clear that when a petitioner presents an issue on appeal that satisfies any one of the Lozada criteria, that petitioner ought to have that issue considered on appeal.\" (Citations omitted; internal quotation marks omitted.) State v. Turner, 267 Conn. 414, 430-31, 838 A.2d 947 (2004).\n\nIn the present case, we conclude that the state has met its burden of satisfying at least one of the Lozada criteria, namely, that the issue is adequate to \"deserve encouragement to proceed further.\" (Internal quotation marks omitted.) Id., 430. This court's resolution of issues challenging the general requirement of jury unanimity has long been regarded as fundamental to maintaining the consistency and reliability of the judicial system as a whole, and the ultimate verdict in a criminal trial in particular. See generally State v. Sawyer, 227 Conn. 566, 580, 630 A.2d 1064 (1993); State v. Aparo, 223 Conn. 384, 388, 614 A.2d 401 (1992), cert. denied, 507 U.S. 972, 113 S.Ct. 1414, 1415, 122 L.Ed. 2d 785 (1993); State v. Daniels, 207 Conn. 374, 388, 542 A.2d 306, after remand for articulation, 209 Conn. 225, 550 A.2d 885 (1988), cert. denied, 489 U.S. 1069, 109 S.Ct. 1349, 103 L.Ed. 2d 817 (1989); State v. Stankowski, 184 Conn. 121, 147, 439 A.2d 918, cert. denied, 454 U.S. 1052, 102 S.Ct. 596, 70 L.Ed. 2d 588 (1981); State v. Gannon, 75 Conn. 206, 229-30, 52 A. 727 (1902). We have deemed this especially true in capital cases. State v. Daniels, supra, 389. In Daniels, this court noted that \"we perceive a special need for jury unanimity in capital sentencing. Under ordinary circumstances, the requirement of unanimity induces a jury to deliberate thoroughly and helps to assure the reliability of the ultimate verdict. . . . The heightened reliability demanded by the [e]ighth [a]mendment in the determination whether the death penalty is appropriate . . . convinces us that jury unanimity is an especially important safeguard at a capital sentencing hearing.\" (Citations omitted; internal quotation marks omitted.) Id.\n\nThe issue in the present case, namely, whether in denying the state permission to appeal, the trial court misconstrued the law of unanimity in the context of a capital felony penalty hearing, and by doing so, improperly concluded that the jury reached a valid verdict, plainly fits this category. Moreover, the fact that this court has not had an opportunity previously to address this specific issue renders it even more worthy of review. Consequently, we conclude that the issue presented by the state \"deserve[d] encouragement to proceed further\"; (internal quotation marks omitted) Lozada v. Deeds, supra, 498 U.S. 432; and therefore the trial court abused its discretion in denying the state's motion for permission to appeal.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nB.\n\nThe state's second, and principal, claim on appeal is that the trial court abused its discretion by denying the state's motion for a mistrial after improperly instructing the jury that if it remained deadlocked, the trial court would be required to impose a sentence of life imprisonment \"without the benefit of release.\"\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Specifically, the state argues that the trial court's improper instruction was not only based upon an unsound legal premise, but tainted the subsequent jury deliberations by: (1) leading the jury to believe that the responsibility for determining the appropriateness of whether the defendant should be sentenced to life imprisonment or put to death did not rest solely in the jury's discretion; and (2) increasing the likelihood that the jury would remain deadlocked, thereby denying the state its right to fair and thorough deliberations by a jury attempting to reach a unanimous verdict. Therefore, the state argues, the trial court abused its discretion in denying the state's subsequent motion for a mistrial. We agree.\n\nThe following additional facts and procedural history inform our resolution of this issue. On the third day of deliberations in the penalty phase of the defendant's trial, the jury sent to the court a note in reference to the questions on the verdict form dealing with the murder of Brown. The jury requested instructions on how to proceed if it was unable to agree on whether the non-statutory mitigating factor or factors outweighed the aggravating factor or factors. Commenting on the note outside the jury's presence, the trial court told the parties that the jury must \"strive to reach a unanimous verdict. If they become deadlocked on [the issue of weighing] . . . I'll impose life without the benefit of release.\" In response, the state argued that if the jury was deadlocked on this issue, the court would have to declare a mistrial rather than sentence the defendant to life in prison. The trial court, however, disagreed stating: \"[I]f it's deadlock, it means that you haven't met your burden,\" and \"the defendant would get the benefit of it.\"\n\nThe jurors were then recalled to the courtroom and the court reinstructed them on the possible verdicts. The court reiterated that at each point in its deliberations, the jury must be unanimous. Specifically, the court stated that the jury had to agree unanimously that aggravating factors outweighed mitigating factors for death to be imposed, or in the alternative, it had to agree unanimously that mitigating factors either outweighed or were in equipoise with aggravating factors for a life sentence to be imposed. The trial court concluded its substantive re-instruction by stating: \"If you continue to deliberate on this issue and at the final analysis you are not able to agree, then you report that, and in that event your deliberations would cease and by your action I would be required to impose a sentence of life without the benefit of release.\" (Emphasis added.) The jury was then excused to continue its deliberations.\n\nLater that day, the jury sent a second note to the court stating that, with regard to the murder of Brown, it still was deadlocked on the issue of whether the non-statutory mitigating factors outweighed the aggravating factors. In response, the trial court instructed the jury to put the issue aside and to move on to the questions on the verdict form dealing with the double murder of Brown and Clarke. The court implored the jurors to strive to answer the remaining questions. The court then repeated to the jury the action the court would take if the jury were to become deadlocked on the second issue: \"I've already told you, if you cannot agree, then I will impose a sentence which is in accord with the inability of the state to satisfy the burden of proof beyond all reasonable doubt in respect to the aggravating factor and your consideration of the mitigating factor. So there's no puzzle.\" (Emphasis added.) The state again indicated to the court that it disagreed with the court's proposed disposition. The state argued that the jury's notes merely indicated that it was deadlocked and, therefore, imposing a life sentence would be improper. The court adhered to its position.\n\nShortly thereafter, the jurors sent a third note to the court indicating that they also were deadlocked on the issue of whether the state had proven an aggravating factor pertaining to the double homicide. The trial court indicated to the parties that it would respond to the note by giving a \"Chip Smith\" instruction to the jury in an effort to nudge the jury toward unanimity. When the state inquired as to how the court interpreted the jury's deadlock on the aggravating factors pertaining to the double homicide, the court again stated, \"[i]f they can't agree, they haven't--the state hasn't met its burden; simple as that.\" The court then called the jury back in and proceeded by giving the \"Chip Smith\" instruction.\n\nLater that same afternoon, the jury sent a fourth, and final, note to the court stating: \"We still have a problem with the word unanimous . . . . Some of us feel the state has proven one or more statutory aggravating factors and some of us feel the state has failed to prove one or more statutory aggravating factors.\" In response, the court provided the jury with an \"Official Revised\" version of the verdict form which permitted the jurors to \"unanimously agree that [they] are unable to unanimously agree\" on both counts of capital felony. All twelve jurors chose this new option for both counts.\n\nImmediately after the jury announced that it had agreed to disagree, the trial court ordered the verdict accepted and recorded. The state then orally moved, pursuant to Practice Book § 42-45, for a mistrial. The state's motion, however, was denied by the court.\n\nWe begin our analysis by setting forth our standard of review. \"The principles that govern our review of a trial court's ruling on a motion for a mistrial are well established. Appellate review of a trial court's decision granting or denying a motion for a [mistrial] must take into account the trial judge's superior opportunity to assess the proceedings over which he or she has personally presided. . . . Thus, [a] motion for a [mistrial] is addressed to the sound discretion of the trial court and is not to be granted except on substantial grounds. . . . In our review of the denial of a motion for mistrial, we have recognized the broad discretion that is vested in the trial court to decide whether an occurrence at trial has so prejudiced a party that he or she can no longer receive a fair trial. The decision of the trial court is therefore reversible on appeal only if there has been an abuse of discretion.\" (Citation omitted; internal quotation marks omitted.) State v. Cook, 262 Conn. 825, 842, 817 A.2d 670 (2003).\n\nIn reviewing a claim of abuse of discretion, we have stated that \"[d]iscretion means a legal discretion, to be exercised in conformity with the spirit of the law and in a manner to subserve and not to impede or defeat the ends of substantial justice.\" (Internal quotation marks omitted.) State v. Onofrio, 179 Conn. 23, 29, 425 A.2d 560 (1979). In general, abuse of discretion exists when a court could have chosen different alternatives but has decided the matter so arbitrarily as to vitiate logic, or has decided it based on improper or irrelevant factors. See id. Therefore, \"[i]n those cases in which an abuse of discretion is manifest or where injustice appears to have been done, reversal is required.\" State v. Avcollie, supra, 174 Conn. 111.\n\nThe state first contends that the trial court's instruction that, if the jury remained deadlocked, the court would be required to sentence the defendant to life imprisonment, was improper. Specifically, the state argues that the instruction was based upon the unsound legal premise that, under Connecticut law, during the penalty phase of a capital case a deadlocked jury necessarily signifies that the trial court must sentence the defendant to life imprisonment because the state has failed to sustain its burden of proof. We agree with the state.\n\n\"It is settled doctrine in Connecticut that a valid jury verdict in a criminal case must be unanimous. . . . A nonunanimous jury therefore cannot render any finding of fact.\" (Internal quotation marks omitted.) State v. Aparo, supra, 223 Conn. 388. Indeed, where a jury is deadlocked, a court cannot rightfully record a verdict \"because [as a matter of law] no such verdict can be found to have existed . . . .\" State v. Goodman, 35 Conn. App. 438, 448, 646 A.2d 879, cert. denied, 231 Conn. 940, 653 A.2d 824 (1994); see also State v. Daniels, supra, 207 Conn. 394 (concluding that deadlocked jury in penalty phase of capital case makes no finding of whether death or life imprisonment is warranted). Rather, it is axiomatic that a deadlocked jury makes no lawfully cognizable finding, thereby requiring no specific action by the trial court. See State v. Sawyer, supra, 227 Conn. 580; State v. Aparo, supra, 388; State v. Daniels, supra, 388.\n\nThis court addressed a similar issue in State v. Daniels, supra, 207 Conn. 394, wherein the court concluded that under our death penalty statute, a deadlocked jury in the penalty phase of a capital trial \"neither authorizes imposition of the death penalty nor requires the imposition of a life sentence.\" The court stated that, \"[b]ecause the record in this case reveals an unchallenged finding that an aggravating factor exists, but no unanimous finding that the defendant has proved that a mitigating factor exists, the defendant was not entitled as a matter of law to a sentence of life imprisonment . . . .\" Id., 393. Under Connecticut law, therefore, we concluded that a deadlocked jury authorizes neither a life sentence nor the death penalty. Id., 394.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e We therefore determine that the jury instruction in the present case that the trial court would be required to impose a life sentence if the jury remained deadlocked was improper.\n\nThe state further contends that this improper instruction tainted the jury's subsequent deliberations. We agree. The United States Supreme Court and this court continuously have recognized \"the need for heightened reliability in death penalty deliberations . . . .\" (Citations omitted.) State v. Ross, 230 Conn. 183, 230-31, 646 A.2d 1318 (1994), cert. denied, 513 U.S. 1165, 115 S.Ct. 1133, 130 L.Ed. 2d 1095 (1995). \"[T]he task . . . of determining whether a specific human being should die at the hands of the [s]tate . . . necessarily calls upon the intellectual, moral and emotional resources of the jurors in a way that far exceeds any factual determination of guilt or innocence. It requires the jury to make a reasoned moral and individualized determination regarding the imposition of the death penalty. . . . It is not hyperbole to say that making the choice . . . between life and death . . . is the most serious decision that our legal system requires a jury to make.\" (Citations omitted; internal quotation marks omitted.) State v. Rizzo, 266 Conn. 171, 228, 833 A.2d 363 (2003). \"Thus, great care must be taken by the trial court to ensure that a capital sentencing jury fully appreciates the momentous nature of its duty and, in particular, that the jury not be led to believe that the responsibility for determining the appropriateness of the defendant's death rests elsewhere. . . . To ensure that the jury is fully aware of its determinative role in our capital sentencing process . . . [i]t is imperative . . . that the jury instructions in a capital case clearly and unequivocally explain to the jury that it is solely responsible for determining whether the defendant will receive the death penalty or, instead, a sentence of life imprisonment without the possibility of release.\" (Citations omitted; emphasis added; internal quotation marks omitted.) State v. Reynolds, 264 Conn. 1, 124-25, 836 A.2d 224 (2003), cert. denied, U.S. , 124 S.Ct. 1614, 158 L.Ed. 2d 254 (2004).\n\nIn Caldwell v. Mississippi, 472 U.S. 320, 328-29, 105 S.Ct. 2633, 86 L.Ed. 2d 231 (1985), the United States Supreme Court expressly concluded that \"it is constitutionally impermissible to rest a death sentence on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's death rests elsewhere.\" In that case, the defendant challenged the pros-ecution's statement in its closing argument that, under Mississippi's capital sentencing scheme, an appellate court ultimately would decide if the defendant were to live or die. Id., 324-26. The Supreme Court vacated the defendant's death sentence, reasoning that, \"under the [e]ighth [a]mendment the qualitative difference of death from all other punishments requires a correspondingly greater degree of scrutiny of the capital sentencing determination. . . . Accordingly, many of the limits that this [c]court has placed on the imposition of capital punishment are rooted in a concern that the sentencing process should facilitate the responsible and reliable exercise of sentencing discretion. . . .\n\n\"In evaluating the various procedures developed by [s]tates to determine the appropriateness of death, this [c]court's [e]ighth [a]mendment jurisprudence has taken as a given that capital sentencers would view their task as the serious one of determining whether a specific human being should die at the hands of the [s]tate. Thus, as long ago as . . . McGautha v. California, 402 U.S. 183 [91 S.Ct. 1454, 28 L.Ed. 2d 711] (1971), [the court has assumed] . . . that jurors confronted with the truly awesome responsibility of decreeing death for a fellow human will act with due regard for the consequences of their decision . . . . Belief in the truth of the assumption that sentencers treat their power to determine the appropriateness of death as an awesome responsibility has allowed this [c]court to view sentencer discretion as consistent with--and indeed as indispensable to--the [e]ighth [a]mendment's need for reliability in the determination that death is the appropriate punishment in a specific case. Woodson v. North Carolina, [428 U.S. 280, 305, 96 S.Ct. 2978, 49 L.Ed. 2d 944 (1976)] (plurality opinion). See also Eddings v. Oklahoma, [455 U.S. 104, 102 S.Ct. 869, 71 L.Ed. 2d 1 (1982)]; Lockett v. Ohio, [438 U.S. 586, 98 S.Ct. 2954, 57 L.Ed. 2d 973 (1978)].\" (Citations omitted; internal quotation marks omitted.) Caldwell v. Mississippi, supra, 472 U.S. 329-30.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\n\nSimilarly, in the present case, the trial court's instruction to the jury tainted the subsequent deliberations by diluting the jury's appreciation of its role in the sentencing phase of a capital trial. The trial court instructed the jury that if it remained deadlocked, \"[the court] would be required to impose a sentence of life without the benefit of release . . . which is in accord with the inability of the state to satisfy the burden of proof beyond all reasonable doubt in respect to the aggravating factor and your consideration of the mitigating factor.\" (Emphasis added.) These instructions created a \"reasonable likelihood\"; Boyde v. California, 494 U.S. 370, 380, 110 S.Ct. 1190, 108 L.Ed. 2d 316 (1990) (where it is claimed that instruction is subject to erroneous interpretation, \"proper inquiry . . . is whether there is a reasonable likelihood that the jury has applied the challenged instruction\" erroneously); that the jury did not fully appreciate the \"momentous nature of its duty\" and \"its determinative role in our capital sentencing process . . . .\" (Internal quotation marks omitted.) State v. Reynolds, supra, 264 Conn. 124-25. In other words, by charging the jury that if it were to remain deadlocked, the ultimate decision as to the defendant's sentence would be removed from its discretion, the trial court created a reasonable likelihood that the jury failed to appreciate its \"awesome responsibility . . . .\" (Internal quotation marks omitted.) Caldwell v. Mississippi, supra, 472 U.S. 329. On the basis of the explicit content of this instruction, therefore, we cannot conclude that the trial court's instructions to the jury, as a whole, \"clearly and unequivocally explain[ed] to the jury that it is solely responsible for determining whether the defendant will receive the death penalty or, instead, a sentence of life imprisonment without the possibility of release,\" as required by the eighth amendment. (Emphasis added; internal quotation marks omitted.) State v. Reynolds, supra, 125.\n\nThe trial court's instructions further tainted the jury's deliberations by reinforcing the likelihood of deadlock, thereby denying the state its right to fair and thorough deliberations by a jury attempting to reach a unanimous result. It is unquestionable that a defendant has a substantial liberty interest at stake in any criminal trial. State v. Sawyer, supra, 227 Conn. 578-79. \"That does not mean, however, that the defendant's liberty interest is the only substantial interest at stake . . . . The state also has a substantial interest, namely, its interest in securing a [determination of the imposition of the death penalty]\" through the jury's thoughtful deliberation to a unanimous verdict. Id., 579; see also State v. Malcolm, 257 Conn. 653, 658, 778 A.2d 134 (2001) (recognizing \"the state's right to seek a judgment against the defendant\"); State v. James, 247 Conn. 662, 674, 725 A.2d 316 (1999) (\"[t]he [state], like the defendant, is entitled to resolution of the case by verdict from the jury\" [internal quotation marks omitted]). A jury instruction that implies that a jury need not deliberate to a unanimous decision \"neglects the state's interest in the resolution of the charges on which it presented the defendant.\" State v. Sawyer, supra, 578. Indeed, \"[a jury] should not be given an instruction that could encourage it to give the [penalty phase deliberations] short shrift . . . . Anything less [than a unanimous completion of the difficult task] dilutes the right of the state and the defendant to have the jury give its undivided attention and most serious deliberations to the [penalty phase proceedings] and flies in the face of the unanimity requirement of Aparo and Daniels.\" Id., 583. Jury instructions must reflect the \"commitment that justice be done to both the state and the defendant, and that the [penalty phase disposition] be thoroughly deliberated, considered and disposed of definitively.\" Id., 578; State v. Salgado, 257 Conn. 394, 405, 778 A.2d 24 (2001).\n\nIn the present case, after the jury reported being deadlocked, the trial court instructed the jury that, if it remained deadlocked, the trial court would sentence the defendant to life imprisonment. This instruction was reasonably likely to have influenced those jurors who, at that point in the deliberations, were inclined to vote against the imposition of the death penalty, to resist further deliberations aimed at reaching a unanimous verdict. In other words, those jurors who favored sentencing the defendant to life imprisonment improperly were informed by the court that they could ensure a sentence of life imprisonment simply by refusing to deliberate further, in which event the court would impose a life sentence.\n\nAfter improperly instructing the jury as to the sentence that it would be required to impose if the jury were to remain deadlocked, the trial court denied the state's motion for mistrial. The trial court's instruction in the present case impermissibly led the jury to believe that it was not solely responsible for determining the appropriate sentence for the defendant. Moreover, the improper instruction increased the likelihood that the jury would remain deadlocked, as it did, in violation of the state's right to fair and thorough deliberations by a jury attempting to reach a unanimous verdict. We conclude that the denial of the motion for a mistrial was a manifest abuse of discretion and rendered an injustice to the state because it improperly barred the state from pursuing a second penalty hearing before a properly charged and motivated jury. See State v. James, supra, 247 Conn. 674 (state has strong interest \"in fair trials designed to end in just judgments\" [internal quotation marks omitted]); see also State v. Avcollie, supra, 174 Conn. 111 (\"[i]n those cases in which an abuse of discretion is manifest or where injustice appears to have been done, reversal is required\").\n\nIV. DEFENDANT'S ALTERNATE GROUNDS FOR AFFIRMANCE\n\nIn response to the state's claims, the defendant presents four alternate grounds to affirm the trial court's judgment sentencing the defendant to life imprisonment without the possibility of parole. The defendant argues that the trial court's sentence should be upheld because:\n\n(1) § 53a-46a (b)\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e does not permit a trial court to impanel a new jury after the original jury becomes deadlocked in the penalty phase of a capital case; (2) principles of accessorial liability cannot be used to prove the existence of aggravating factors, and therefore the state presented insufficient evidence to prove any aggravating factors necessary for the imposition of the death penalty; (3) the state failed to produce sufficient evidence to prove beyond a reasonable doubt that the defendant had the particularized mental state required by each aggravating factor; and (4) Pinkerton liability cannot be used to prove the existence of aggravating factors, and therefore the state presented insufficient evidence to prove any aggravating factors. We disagree with each of the defendant's alternate grounds for affirmance.\n\nA.\n\nThe defendant first claims that the trial court's judgment denying the state's motion for a mistrial, and the subsequent imposition of a life sentence, was proper because § 53a-46a (b) does not permit a trial court to impanel a new jury after the original jury becomes deadlocked in the penalty phase of a capital case. Specifically, the defendant argues that, pursuant to the plain language of § 53a-46a (b), a trial court may impanel a new jury for a second sentencing hearing only upon a showing of \"good cause,\" and the fact that a jury was unable to reach a unanimous decision on the appropriate punishment cannot be considered \"good cause\" when interpreted in relation to similar statutes. Consequently, the defendant argues, because § 53a-46a (b) bars the impanelment of a new jury for a second sentencing hearing in the case of a deadlocked jury, and because the declaration of a mistrial by the court would have allowed for such an impaneling, the trial court properly denied the state's motion for a mistrial and subsequently imposed a sentence of life imprisonment.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\nWe disagree.\n\nThe question of whether § 53a-46a (b) prohibits the impaneling of a new jury after the original jury becomes deadlocked in the penalty phase of a capital case is a question of statutory interpretation over which our review is plenary. See Waterbury v. Washington, 260 Conn. 506, 546-47, 800 A.2d 1102 (2002).\n\n\"The meaning of a statute shall, in the first instance, be ascertained from the text of the statute itself and its relationship to other statutes. If, after examining such text and considering such relationship, the meaning of such text is plain and unambiguous and does not yield absurd or unworkable results, extratextual evidence of the meaning of the statute shall not be considered.\" Public Acts 2003, No. 03-154, § 1.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e Therefore, our analysis begins with the text of § 53a-46a (b).\n\nSection 53a-46a (b) provides in relevant part that a penalty hearing shall be conducted \"(1) before the jury which determined the defendant's guilt, or (2) before a jury impaneled for the purpose of such hearing . . .\n\n(C) if the jury which determined the defendant's guilt has been discharged by the court for good cause . . . .\" (Emphasis added.) Although the statute, and the Penal Code in general,\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e fail to define \"good cause,\" this court in State v. Webb, 238 Conn. 389, 680 A.2d 147 (1996), had occasion to define the phrase in reference to § 53a-46a (b). In Webb, the defendant challenged the constitutionality of the general requirement of § 53a-46a (b) that the same jury determine both the guilt and penalty phases for a defendant in a capital case, arguing that a jury's determination of guilt creates a bias sufficient to prevent the jury from determining the penalty phase issues fairly and impartially. Id., 464-65 and n.52. In upholding the constitutionality of the statute, this court concluded, among other things, that even if the defendant were able to establish that the jury was in fact biased, the statute provides a mechanism to address such a situation in that it specifically allows a trial court to impanel a new jury for \"good cause.\" Id., 469 n.57. This court then equated \"good cause\" in the context of § 53a-46a (b) with a conclusion by the trial court \"that the jury cannot fairly perform its penalty phase duties.\" Id. On the basis of the definition espoused in Webb, and because it is manifest under Connecticut penal law that jurors are required to be unanimous in their verdicts,\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e it cannot be said that the fact that a jury is unable to reach a unanimous verdict does not constitute good cause pursuant to § 53a-46a (b). The fact that a jury is deadlocked undoubtedly indicates that the jury \"cannot fairly perform its penalty phase duties\"; id.; thereby necessitating the impaneling of a second jury rather than the imposition of a life sentence. See, e.g., Aillon v. Manson, 201 Conn. 675, 681 n.5, 519 A.2d 35 (1986) (noting that deadlocked jury constitutes quintessential rationale for manifest necessity in declaring mistrial).\n\nOur conclusion finds further support in our decision in State v. Daniels, supra, 207 Conn. 374. In Daniels, both the defendant and the state challenged the trial court's sentencing of the defendant to two consecutive terms of life imprisonment for capital felony and murder after the jury unanimously found the existence of an aggravating factor, but was unable to agree unanimously on the existence of a mitigating factor. Id., 378. The state argued that § 56a-46a required that \"once it has established the existence of an aggravating factor, a defendant can escape the death penalty only by persuading the trier of fact that a mitigating factor exists.\" Id., 386. The defendant, however, argued a diametrically opposite construction of the statute, claiming that \"the statute does not authorize the imposition of a death sentence unless there has been an unconditional and unanimous finding by the trier of fact that no mitigating factors exist within the meaning of § 53a-46a (e).\" (Internal quotation marks omitted.) Id. In upholding the judgment of the trial court, this court concluded that contrary to the arguments of both the state and the defendant, § 53a-46a does not mandate a specific outcome for death penalty cases in which the trier of fact cannot come to a unanimous decision on the imposition of the death penalty. Id., 394. The court reasoned that, \"[i]n such circumstances, the statute neither authorizes imposition of the death penalty nor requires the imposition of a life sentence.\" Id. Rather, the court stated that the trial court could elect from among three options, one of which was to declare a mistrial, impanel a new jury and retry the penalty phase. Id., 394-96. Accordingly, under this court's construction of the statute in Daniels, it is apparent that § 53a-46a (b) does not preclude a trial court from declaring a mistrial and subsequently impaneling a new jury for a retrial when the jury is deadlocked in the penalty phase of a capital case.\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\n\nFurthermore, the legislature's failure to amend § 53a-46a after our decision in Daniels, leads us to presume that the legislature agreed with our interpretation of the statute in that case. We have noted that, although \"legislative inaction is not necessarily legislative affirmation . . . we . . . presume that the legislature is aware of [this court's] interpretation of a statute, and that its subsequent non-action may be understood as a validation of that interpretation. . . . Time and again, we have characterized the failure of the legislature to take corrective action as manifesting the legislature's acquiescence in our construction of a statute.\" (Internal quotation marks omitted.) Hammond v. Commissioner of Correction, 259 Conn. 855, 874, 792 A.2d 774 (2002).\n\nIn Daniels, where this court concluded that § 53a-46a mandates the imposition of neither a life nor death sentence in the event of a deadlocked jury, but, rather, permits a trial court, among other things, to declare a mistrial, and subsequently impanel a new jury for a retrial of the penalty phase, the court \"freely acknowledge[d] that [its] construction of § 53a-46a places Connecticut alongside a very small minority of jurisdictions with regard to the proper procedure to be followed when the jury cannot unanimously agree. The majority of states have statutorily provided for an automatic sentence of less than death in the event of a deadlocked jury.\" State v. Daniels, supra, 207 Conn. 393. The court then invited the legislature to address the issue if it disagreed: \"Whether our decision . . . calls for corrective action is a matter that only the legislature can decide.\" Id., 394. Despite numerous substantive changes to Connecticut's capital sentencing scheme since the Daniels decision, the legislature has failed to act on this court's invitation.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Accordingly, based upon the legislature's failure to act, it is reasonable for this court to conclude that the legislature agreed with the Daniels decision.\n\nThe defendant attempts to overcome Webb and Daniels by relying on the United States Supreme Court case of Jones v. United States, 527 U.S. 373, 380-81, 119 S.Ct. 2090, 144 L.Ed. 2d 370 (1999), in which the court concluded that the phrase \" `good cause,' \" within the federal death penalty statute; 18 U.S.C. § 3593;\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e does not include impaneling a second sentencing jury in the event of a deadlock. The defendant claims that because \"[18 U.S.C. § 3593] and § 53a-46a have the same lineage\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e and have virtually the same language setting forth when the jury that determined guilt can be discharged and a new jury impaneled for a penalty retrial,\" they should be interpreted similarly. We are not persuaded.\n\nIn Jones v. United States, supra, 527 U.S. 381, the court held that, \"[t]he phrase `good cause' in § 3593 (b) (2) (C) plainly encompasses events such as juror disqualification, but cannot be read so expansively as to include the jury's failure to reach a unanimous decision.\" In doing so, the court referenced a corresponding section of the death penalty statute which provides: \"Upon a recommendation under section 3593 (e) that the defendant should be sentenced to death or life imprisonment without possibility of release, the court shall sentence the defendant accordingly. Otherwise, the court shall impose any lesser sentence that is authorized by law. Notwithstanding any other law, if the maximum term of imprisonment for the offense is life imprisonment, the court may impose a sentence of life imprisonment without possibility of release.\" (Emphasis added.) 18 U.S.C. § 3594. The text of the statute that we have italicized prompted the court to conclude that the term \" `[o]therwise' \" meant that, without unanimity, the sentencing determination passes to the court, which may impose a sentence of life imprisonment. Jones v. United States, supra, 380-81. Despite the defendant's contention in the present case, such language is clearly absent from Connecticut's death penalty statute. Consequently, 18 U.S.C. § 3593 and § 53a-46a are not analogous and should not be interpreted as such, and we therefore conclude that the defendant's reliance on Jones is unavailing.\n\nB.\n\nThe defendant's second claim is that the trial court's judgment sentencing the defendant to life imprisonment should be upheld because principles of accessorial liability cannot be used to prove the existence of aggravating factors, and the state therefore presented insufficient evidence to prove any aggravating factors needed for the imposition of the death penalty.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\n\nTo support this claim, the defendant argues that: (1) the plain language of General Statutes § 53a-8\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e indicates that principles of accessorial liability cannot be used to prove aggravating factors; (2) the plain language of General Statutes (Rev. to 1997) § 53a-46a (i)\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e indicates that principles of accessorial liability do not apply to aggravating factors; and (3) the use of accessorial liability to prove an aggravating factor violates the eighth\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e and fourteenth amendments to the United States constitution.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\n\nThe following additional facts and procedural history are relevant to our resolution of this issue. The state relied upon four aggravating factors, in accordance with § 53a-46a (i), in seeking the death penalty for the murder of Brown. These were: (1) in the course of Brown's murder, Clarke was placed at a grave risk of death; (2) the murder was committed in an especially heinous, cruel or depraved manner; (3) the defendant paid Lee with cocaine to help commit the crime; and (4) the defendant paid money to Garner, the person who drove Adrian to and from the murder scene, to help commit the crime. With respect to the second count of capital felony, i.e., the double homicide of Brown and Clarke, the state alleged three aggravating factors, the same as those alleged for Brown's murder, with the exception of the first.\n\nAt the beginning of the penalty hearing, the defendant moved to strike each aggravating factor. He argued that:\n\n(1) nothing in Connecticut's death penalty statutory framework allows principles of vicarious liability to be used to prove aggravating factors; (2) the state failed to produce evidence that the defendant instructed Adrian on how the murders were to be carried out, and therefore he did not know that they would be committed in a heinous, cruel or depraved manner; and (3) under the eighth amendment to the United States constitution, the defendant cannot be sentenced to death for the acts of another.\n\nAfter listening to the parties' arguments and thoroughly reviewing the briefs they submitted, the trial court denied the motion to strike, concluding that under Connecticut law, both a coconspirator and an accessory \"may be charged and punished as if he were the principal offender.\" In addition, citing Tison v. Arizona, 481 U.S. 137, 158, 107 S.Ct. 1676, 95 L.Ed. 2d 127 (1987), the trial court stated that the United States Supreme Court has held that the eighth amendment does not prevent the death penalty from being imposed vicariously if there is evidence of major participation by the defendant combined with reckless indifference to human life. Therefore, the trial court concluded that \"the aggravating factors alleged by the state may be applied vicariously because the defendant was a major participant in the planning of the offense . . . and had knowledge of the manner in which the killings were to be completed,\" and, consequently it denied the defendant's motion to strike.\n\nThe defendant first argues that the plain language of § 53a-8 indicates that principles of accessorial liability cannot be used to prove aggravating factors in the penalty phase of a capital case. The defendant contends that because § 53a-8 limits its application to an \"offense,\" which is defined by General Statutes § 53a-24\n\n(a) as any \"crime or violation,\"\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e the use of accessorial liability to prove aggravating factors is necessarily precluded. We disagree.\n\nAs a preliminary matter, we set forth our applicable standard of review. The question of whether principles of accessorial liability can be used to prove aggravating factors in the penalty phase of a capital case is a question of statutory interpretation over which our review is plenary. See Waterbury v. Washington, supra, 260 Conn. 546-47. As we previously noted herein, \"[t]he meaning of a statute shall, in the first instance, be ascertained from the text of the statute itself and its relationship to other statutes,\" and only \"[if] the meaning of such text is . . . [ambiguous can] extratextual evidence of the meaning of the statute . . . be considered.\" Public Act 03-154, § 1.\n\n\"When the statute in question is one of a criminal nature, [however] we are guided by additional tenets of statutory construction. First, it is axiomatic that we must refrain from imposing criminal liability where the legislature has not expressly so intended. State v. Breton, 212 Conn. 258, 268-69, 562 A.2d 1060 (1989). Second, [c]riminal statutes are not to be read more broadly than their language plainly requires and ambiguities are ordinarily to be resolved in favor of the defendant. . . . State v. Jones, 234 Conn. 324, 340, 662 A.2d 1199 (1995). Finally, unless a contrary interpretation would frustrate an evident legislative intent, criminal statutes are governed by the fundamental principle that such statutes are to be strictly construed against the state. State v. Ross, [supra, 230 Conn. 200].\" (Internal quotation marks omitted.) State v. Davis, 255 Conn. 782, 788-89, 772 A.2d 559 (2001). It is, however, equally understood that despite the nature of the statute, it \"must be construed, if possible, such that no clause, sentence or word shall be superfluous, void or insignificant . . . .\" (Internal quotation marks omitted.) State v. Szymkiewicz, 237 Conn. 613, 621, 678 A.2d 473 (1996). In other words, \"[n]o part of a legislative enactment is to be treated as insignificant or unnecessary, and there is a presumption of purpose behind every sentence, clause or phrase . . . [so that] no word [or phrase] in a statute is to be treated as superfluous.\" (Internal quotation marks omitted.) State v. Payne, 240 Conn. 766, 771-72, 695 A.2d 525 (1997); see State v. Ayala, 222 Conn. 331, 346, 610 A.2d 1162 (1992); State v. Delossantos, 211 Conn. 258, 274, 559 A.2d 164, cert. denied, 493 U.S. 866, 110 S.Ct. 188, 107 L.Ed. 2d 142 (1989).\n\nWith these standards in mind, we begin by examining the text of § 53a-8. The statute provides in relevant part: \"A person, acting with the mental state required for commission of an offense, who solicits, requests, commands, importunes or intentionally aids another person to engage in conduct which constitutes an offense shall be criminally liable for such conduct and may be prosecuted and punished as if he were the principal offender.\" General Statutes § 53a-8 (a). By its express terms, the statute provides that a person may be prosecuted and punished as the principal without actually committing the offense himself. The defendant's interpretation, however, would have this court focus solely upon the use of accessorial liability to prosecute a defendant as if he were a principal, and ignore the statute's mandate that an accessory shall also be punished as if he were the principal. Our well established rules of statutory construction prohibit us from interpreting a statute in such a way as to ignore some of the express wording enacted by the legislature.\n\nMoreover, the defendant's proffered interpretation would vitiate one of the clearly stated, overarching purposes of the statute, i.e., the punishment of a person as if he were the principal, when, with the requisite mental state, he solicits, requests, commands, impor-tunes or intentionally aids the person who physically committed the crime. General Statutes § 53a-8 (a); see also State v. Davis, supra, 255 Conn. 792 (\"[t]he accomplice liability statute permits an accessory to be `prosecuted and punished as if he were the principal offender' \" [emphasis in original]). It is a fundamental principle of statutory interpretation that, \"[i]nsofar as the language of the statute will permit, we interpret it in accordance with the purpose of the statute, because legislation is a purposive act.\" Cislo v. Shelton, 240 Conn. 590, 598, 692 A.2d 1255 (1997); see also State v. Talton, 209 Conn. 133, 141, 547 A.2d 543 (1988) (basic tenet of statutory construction that \"the legislature acted to accomplish some purpose\" and statutes must be interpreted accordingly [internal quotation marks omitted]); State v. Campbell, 180 Conn. 557, 561, 429 A.2d 960 (1980) (\"fundamental principle of statutory construction that statutes are to be construed so that they carry out the intent of the legislature\"). The defendant's interpretation of § 53a-8 (a), however, would vitiate its overarching purpose in contravention of this fundamental principle of statutory interpretation.\n\nThis court has addressed a similar issue in State v. Davis, supra, 255 Conn. 792, where we concluded that \"[t]he fact that [a statute] is a sentence enhancement provision rather than a separate and distinct offense . . . is of no consequence to [whether § 53a-8 applies].\" (Citation omitted.) In Davis, the defendant claimed that General Statutes § 53-202k,\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e which provides for an enhanced sentence for any person who commits any class A, B or C felony with the use of a firearm, could not be applied to him through the application of principles of accessorial liability. Id., 787. Specifically, the defendant claimed that \"the plain language and legislative history of § 53-202k demonstrate the legislature's intent that the statute apply only to an individual who actually uses a firearm during the commission of a felony.\" Id. In upholding the trial court's application of § 53a-8 to § 53-202k, we reasoned that, \"[t]he accomplice liability statute permits an accessory to be prosecuted and punished as if he were the principal offender. . . . Thus once convicted of [the substantive offense], even if as an accessory, the defendant is legally indistinguishable from the principal actor. Accordingly, the defendant is subject to the enhancement penalty that the principal also would have received had he been caught and convicted.\" (Citation omitted; emphasis in original; internal quotation marks omitted.) Id., 792.\n\nSimilar to the statute at issue in Davis, § 53a-46a is analogous to a sentence enhancement statute. See generally Ring v. Arizona, 536 U.S. 584, 122 S.Ct. 2428, 153 L.Ed. 2d 556 (2002); Apprendi v. New Jersey, 530 U.S. 466, 120 S.Ct. 2348, 147 L.Ed. 2d 435 (2000). The statute sets forth the procedure for the enhancement of a defendant's penalty for a capital felony conviction from life imprisonment to death through jury findings based on the state having proven certain aggravating factors beyond a reasonable doubt. See General Statutes § 53a-46a (f) and (i).\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e We therefore conclude that the interpretation offered by the defendant in this case runs counter to this court's precedent, would ignore the explicit wording of the statute, and would frustrate clear legislative intent. Accordingly, we decline to read § 53a-8 to preclude its application to aggravating factors in the penalty phase of a capital case.\n\nSimilarly, the defendant also argues that the plain language of § 53a-46a (i) indicates that principles of accessory liability do not apply to aggravating factors. Specifically, the defendant contends that because all but one of the aggravating factors set forth in § 53a-46a (i) state that they apply when \"[t]he defendant committed the offense\"; (emphasis added); such language necessarily precludes their proof through principles of accessorial liability.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e We disagree.\n\nThe text of the revision of the statute in effect at the time of the commission of the offenses in the present case provides in relevant part: \"The aggravating factors to be considered shall be limited to the following . . . (3) the defendant committed the offense and in such commission knowingly created a grave risk of death to another person in addition to the victim of the offense; or (4) the defendant committed the offense in an especially heinous, cruel or depraved manner; or (5) the defendant procured the commission of the offense by payment, or promise of payment, of anything of pecuniary value . . . .\"\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e General Statutes (Rev. to 1997) § 53a-46a (i). The defendant equates the statute's express use of the phrase \"the defendant\" and its failure to make an express reference to accomplices, with an affirmative decision by the legislature that § 53a-46a (i) applies only to principals. We disagree.\n\n\"In making such an assertion, the defendant attempts to draw a distinction between principal and accessorial liability. Such a differentiation, however, misconstrues the nature of accessorial liability. This court has long since abandoned any practical distinction between the terms accessory and principal for the purpose of determining criminal liability. . . . The defendant is incorrect . . . when he argues that his liability turns on whether he was found to be a principal or an accessory. Those labels are hollow . . . . Instead, [t]he modern approach is to abandon completely the old common law terminology and simply provide that a person is legally accountable for the conduct of another when he is an accomplice of the other person in the commission of the crime. . . . The legislature adopted this view and expressed it in . . . § 53a-8 (a). Accordingly, accessorial liability is not a distinct crime, but only an alternative means by which a substantive crime may be committed . . . .\n\n\"This principle is apparent throughout our state's criminal statutes. General Statutes § 53a-54a (a), for example, provides that [a] person is guilty of murder when, with intent to cause the death of another person, he causes the death of such person . . . . The fact that our murder statute prohibits specified criminal conduct of the principal actor, without ever expressly including accomplices, does not preclude its application to accomplices. Although, by its terms, our murder statute encompasses only the principal actor, it undoubtedly applies to all participants in the crime. See, e.g., State v. Henry, 253 Conn. 354, 358, 752 A.2d 40 (2000); State v. Delgado, 247 Conn. 616, 622, 725 A.2d 306 (1999). . . .\n\n\"[Additionally] [b]ecause the legislature is presumed to know the state of the law when it enacts a statute; State v. Dabkowski, 199 Conn. 193, 201, 506 A.2d 118 (1986); we can assume that, absent an affirmative statement to the contrary, it did not intend to change the existing law to create a distinction between accessories and principals when it enacted [§ 53a-46a (i)]. . . . Had the legislature intended to deviate from our usual practice of treating accessories and principals alike, it easily could have expressed this intent. . . . In the absence of specific language to that effect, we refuse to adopt an interpretation of [the statute] that would require courts to retreat to the days of determining which actors should be identified as principals and which should be identified as accomplices.\" (Citations omitted; internal quotation marks omitted.) State v. Davis, supra, 255 Conn. 789-91. We therefore decline to interpret the language of § 54a-46a (i) as precluding the establishment of aggravating factors through the application of principles of accessorial liability.\n\nThe defendant's final argument is that the use of accessorial liability to prove an aggravating factor violates the eighth and fourteenth amendments to the United States constitution. Specifically, the defendant contends that using accessorial liability to prove an aggravating factor would violate the eighth amendment by: (1) depriving the defendant of the constitutionally required individualized consideration of the appropriate punishment for him; and (2) defining a class of death-eligible defendants in a manner unrelated to their individual moral blameworthiness, thereby making death a disproportionate punishment.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e We are not persuaded.\n\nThe eighth amendment to the United States constitution provides that \"[e]xcessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\" In recognizing \"the unique nature of the death penalty and the need for heightened reliability in death penalty deliberations\"; State v. Ross, supra, 230 Conn. 230; the United States Supreme Court has interpreted the eighth amendment to require, among other things, that sentencers \"not be given unbridled discretion in determining the fates of those charged with capital offenses. The [c]onstitution instead requires that death penalty statutes be structured so as to prevent the penalty from being administered in an arbitrary and unpredictable fashion.\" (Internal quotation marks omitted.) Id., 231, quoting California v. Brown, 479 U.S. 538, 541, 107 S.Ct. 837, 93 L.Ed. 2d 934 (1987). This includes \"defin[ing] the crimes for which death may be the sentence in a way that obviates standardless sentencing discretion. . . . Godfrey v. Georgia, 446 U.S. 420, 428, 100 S.Ct. 1759, 64 L.Ed. 2d 398 (1980). A statutory requirement that, before death may be imposed, the sentencer must find at least one statutorily mandated aggravating circumstance is a constitutionally permissible response to the need to avoid standardless sentencing discretion and to narrow the class of persons eligible for the death penalty. Bly-stone v. Pennsylvania, 494 U.S. 299, 302, 110 S.Ct. 1078, 108 L.Ed. 2d 255 (1990); Lowenfield v. Phelps, 484 U.S. 231, 244, 108 S.Ct. 546, 98 L.Ed. 2d 568 (1988); Jurek v. Texas, [428 U.S. 262, 270-71, 276, 96 S.Ct. 2950, 49 L.Ed. 2d 929 (1976)]; Proffitt v. Florida, [428 U.S. 242, 251-53, 96 S.Ct. 2960, 49 L.Ed. 2d 913 (1976)]; Gregg v. Georgia, [428 U.S. 153, 198, 96 S.Ct. 2909, 49 L.Ed. 2d 859 (1976)].\" (Internal quotation marks omitted.) State v. Ross, supra, 232. The aggravating factor, however, must \"genuinely narrow the class of persons eligible for the death penalty and must reasonably justify the imposition of a more severe sentence on the defendant compared to others found guilty of murder. Zant v. Stephens, 462 U.S. 862, 877, 103 S.Ct. 2733, 77 L.Ed. 2d 235 (1983).\" (Internal quotation marks omitted.) State v. Reynolds, supra, 264 Conn. 62. Therefore, when principles of accessorial liability are used by the state in an attempt to establish that a defendant should be sentenced to death, \"the focus [must still remain] on [the defendant's] culpability, not on that of those who committed the robbery and shot the victims, for [the United States Supreme Court] insist[s] on individualized consideration as a constitutional requirement in imposing the death sentence.\" (Internal quotation marks omitted.) Tison v. Arizona, supra, 481 U.S. 149.\n\nAlthough the issue of whether the eighth amendment precludes the application of principles of accessorial liability to prove aggravating factors in the penalty phase of a capital case is an issue of first impression for this court, the United States Supreme Court has addressed a similar issue and, in doing so, implicitly answered the question before us. In Tison, where the defendants were charged with murder based upon accessory liability similar to the present case, the Supreme Court concluded that \"major participation in the [murders] committed, combined with reckless indifference to human life\" demonstrated culpability sufficient for imposition of the death penalty. Id., 158. In that case, the defendants, who were brothers, planned and carried out the escape of their father from prison, with the help of another brother, where the father was serving a life sentence for having killed a correction officer during a previous escape. Id., 139. After the defendants' father and another inmate were freed, the group of five men flagged down a passing automobile after their own automobile became disabled. The four occupants of the automobile that stopped to help the defendants were overtaken, driven into the desert and brutally executed by the defendants' father and his fellow escapee. Id., 139-41.\n\nThe defendants in Tison individually were tried for and convicted of, among other things, capital murder under Arizona's felony murder and accessorial liability statutes. Id., 141-42. During the penalty phase of the proceedings, the trial court found sufficient evidence to establish three statutory aggravating factors, namely:\n\n(1) the defendants had created a grave risk of death to persons other than the victims; (2) the murders had been committed for pecuniary gain; and (3) the murders were especially heinous.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e Id., 142. The trial court did not find any statutory mitigating factors but did find sufficient evidence to establish several non-statutory mitigating factors. The court concluded, however, that the mitigating factors were outweighed by the aggravating factors, and sentenced the defendants to death. Id., 142-43. In evaluating the trial court's findings of aggravating and mitigating factors, the Arizona Supreme Court found that the first aggravating factor-- creation of a grave risk to others--was not supported by the evidence, but upheld the finding of the other factors and, therefore, the imposition of the death sentence. Id., 143.\n\nThe defendants appealed, claiming, among other things, that the state had failed to prove that the defendants had \" `inten[ded] to kill' \" the victims, as required by the Enmund v. Florida, 458 U.S. 782, 797-98, 102 S.Ct. 3368, 73 L.Ed. 2d 1140 (1982). Tison v. Arizona, supra, 481 U.S. 143. On appeal, the United States Supreme Court concluded \"that the [e]ighth [a]mendment did not preclude imposing the death penalty on two brothers who participated substantially in their father's armed prison breakout and in a related kidnaping and robbery that resulted in four murders, even though neither defendant took any act which he desired to, or was substantially certain would, cause death. . . . [The court] found that the [defendants'] involvement in the crime was such that both subjectively appreciated that their acts were likely to result in the taking of innocent life . . . and that the record would support a finding of the culpable mental state of reckless indifference to human life . . . . [The court] noted that reckless indifference to the value of human life may be every bit as shocking to the moral sense as an intent to kill . . . and [it] remanded the case to the Supreme Court of Arizona for a specific determination [of] whether the [defendants] possessed that mental state . . . .\" (Citations omitted; internal quotation marks omitted.) South Carolina v. Gathers, 490 U.S. 805, 818-19, 109 S.Ct. 2207, 104 L.Ed. 2d 876 (1989), citing Tison v. Arizona, supra, 150-52, 157-58.\n\nAlthough the Tison court did not address expressly the narrow issue before this court, i.e., whether principles of accessorial liability may be used to prove aggravating factors under the eighth amendment, in broadly concluding that the eighth amendment did not preclude the imposition of the death penalty based on accessorial liability when there is \"major participation\" by the defendant and he evidences a \"reckless indifference to human life\"; Tison v. Arizona, supra, 481 U.S. 152, 158; the court acknowledged that the eighth amendment does not preclude using accessorial liability to prove aggravating factors. By explicitly recognizing the trial court's finding of aggravating factors established through principles of accessorial liability, and thereafter concluding that an accessory could be sentenced to death, the Supreme Court in Tison implicitly concluded that the eighth amendment permitted the use of accessorial liability to prove aggravating factors. Id. In other words, by answering the broader question, i.e., whether the eighth amendment permitted imposing the death penalty on an accessory, the Tison court necessarily decided the more narrow issue that is presently before us, namely, whether accessorial liability may be used to prove aggravating factors.\n\nFurthermore, we can conceive of no reason why a statutory scheme that requires a jury to evaluate aggravating factors need face a more stringent requirement under the eighth amendment when principles of accessorial liability are being used to prove those aggravating factors rather than the commission of the crime itself. In other words, because the eighth amendment does not mandate that the fact finder evaluate aggravating factors for a capital punishment statutory scheme to be constitutionally valid, and because the death penalty has been upheld as constitutional despite the application of accessorial liability to the crime of capital murder; see id., 158; there should be no greater standard under the eighth amendment when principles of accessorial liability are used to prove aggravating factors that could lead to the imposition of the death penalty, as compared to being used to prove the commission of a crime that could result in the imposition of the death penalty.\n\nThe United States Supreme Court has emphatically stated that, \"[a]ny argument that the [c]onstitution requires that a jury impose the sentence of death or make the findings prerequisite to imposition of such a sentence has been soundly rejected by prior decisions of this [c]court.\" Clemons v. Mississippi, 494 U.S. 738, 745, 110 S.Ct. 1441, 108 L.Ed. 2d 725 (1990); see also Spaziano v. Florida, 468 U.S. 447, 459, 104 S.Ct. 3154, 82 L.Ed. 2d 340 (1984) (concluding that neither sixth amendment, nor eighth amendment, nor any other constitutional provision provides defendant with right to have jury determine appropriateness of capital sentence). For example, in Jurek v. Texas, supra, 428 U.S. 270, the court concluded that the Texas death penalty statute did not violate the eighth amendment or any other section of the federal constitution although the statute did not provide for the narrowing of death-eligible defendants by a jury's consideration of aggravating factors. The court reasoned that, \"[w]hile Texas has not adopted a list of statutory aggravating circumstances the existence of which can justify the imposition of the death penalty as have Georgia and Florida, its action in narrowing the categories of murders for which a death sentence may ever be imposed serves much the same purpose. . . . In fact, each of the five classes of murders made capital by the Texas statute\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e is encompassed in Georgia and Florida by one or more of their statutory aggravating circumstances.\" (Citations omitted.) Id. The Supreme Court concluded by stating that the only mandated requirement of a death penalty statutory scheme under the eighth and fourteenth amendment is that \"a capital-sentencing system must allow the sentencing authority to consider mitigating circumstances.\" Id., 271. In other words, as long as sentencers are not \"given unbridled discretion in determining the fates of those charged with capital offenses,\" so that the death penalty is \"administered in an arbitrary and unpredictable fashion\"; State v. Ross, supra, 230 Conn. 231; and a defendant is permitted \"to introduce any relevant mitigating evidence regarding his character or record and any of the circumstances of the offense\"; (internal quotation marks omitted) id.; the eighth amendment's prescription of cruel and unusual punishment requires nothing more for a capital sentencing scheme to be constitutional.\n\nBecause the United States Supreme Court clearly has stated in Tison that principles of accessorial liability may be used to prove the crime of capital felony under the eighth amendment, and the eighth amendment does not require that a death penalty scheme must mandate that a jury consider aggravating factors, we can conceive of no reason why a statutory scheme that requires a jury to determine the existence of aggravating factors need face a more stringent requirement under the eighth amendment when principles of accessorial liability are being used to prove those aggravating factors rather than the commission of the crime itself.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e Consequently, we conclude that when principles of accessorial liability are used to prove the existence of aggravating factors, the additional requirements that a defendant be a \"major\" participant and that he exhibit a \"reckless indifference to human life,\" as established by the United States Supreme Court in Tison v. Arizona, supra, 481 U.S. 158, sufficiently protect a defendant's constitutional rights under the eighth amendment.\n\nTurning to the facts of the present case, the jury reasonably could have found that the defendant's involvement in the crimes was not minor, but, rather, was substantial and that he evidenced a reckless disregard for human life. Far from merely asking his brother Adrian to murder the two victims, the defendant was \"actively involved . . . in the entire sequence of criminal activity culminating in the murder of [Brown and Clarke] . . . .\" Id. The defendant planned every detail of the crime. This included soliciting the commission of the murders by Adrian, purchasing the gun that eventually was used by Adrian to commit the crimes, and paying Lee to inform him when both Brown and Clarke were at home so that the murders could be committed simultaneously. The defendant even demonstrated to Adrian how he wanted Brown to be killed. Such participation in these murders clearly rises to the level of major participation that evidences \"a reckless disregard for human life.\" Id.\n\nThe defendant argues that, despite the United States Supreme Court's conclusion in Tison, the use of accessorial liability to prove an aggravating factor would define a class of death-eligible defendants in a way unrelated to their individual moral blameworthiness, thereby making death a disproportionate punishment in violation of the eighth amendment. Specifically, the defendant argues that there is a \"moral\" difference between the culpability of a person who was not the triggerman, was not at the murder scene and did not direct how the murder was to occur, and the actual murderer. Therefore, the defendant contends that by allowing the jury to find aggravating factors based upon his status as an accessory to the murders, the jury was not able to make the kind of reasoned moral judgment about the appropriate penalty that the eighth amendment requires. We are not persuaded.\n\nAs we previously noted herein, when a legislature broadly defines capital offenses and provides for the narrowing of culpability for those offenses by jury findings of aggravating circumstances, as the Connecticut legislature has chosen to do here; see General Statutes § 53a-46a; the only other constitutional requirement under the eighth amendment at the sentencing phase is the jury's consideration of mitigating factors. Penry v. Lynaugh, 492 U.S. 302, 319-28, 109 S.Ct. 2934, 106 L.Ed. 2d 256 (1989). The jury must be allowed to consider and give effect to mitigating evidence relevant to a defendant's character, record, or the circumstances of the offense in order that the punishment be directly related to the personal culpability of the defendant. Id., 327-28; see also Franklin v. Lynaugh, 487 U.S. 164, 179, 108 S.Ct. 2320, 101 L.Ed. 2d 155 (1988); Eddings v. Oklahoma, supra, 455 U.S. 113-15. The fact that aggravating factors may be established through principles of accessorial liability therefore is irrelevant to the eighth amendment's requirement that punishment be related to the personal culpability of the defendant. Rather, the only requirement of the eighth amendment is that the jury must be allowed \"to consider and give effect to mitigating evidence relevant to a defendant's character or record or the circumstances of the offense.\" Penry v. Lynaugh, supra, 327-28. In this case, it is clear from the trial court's jury instruction that the jury was required to consider the fact that the defendant was not at the murder scene, and did not control or direct how the murder was to occur at the scene.\n\nSpecifically, the jury was instructed: \"The defendant has a whole list [of mitigating factors], and there is nothing that bars anything from your consideration, even things beyond the list [he] submit[s] that come to you in your consideration, your judgment, of the totality of the facts developed here before you in the case.\" The trial court then reiterated this instruction near the end of its charge stating: \"In addition to any of the mitigating factors claimed by the defendant, you may give a mitigating force to any fact taken alone or in conjunction with facts presented providing, of course, you are persuaded that the fact or facts exist by a preponderance of the evidence and that the fact or facts are mitigating in nature, as that term had been defined for you.\" We conclude that such instructions were sufficient to satisfy the requirements of the eighth amendment.\n\nC.\n\nThe defendant's third argument is that, even if accessory liability may be used to prove aggravating factors, the state failed to produce sufficient evidence to prove beyond a reasonable doubt that the defendant had the particularized mental state required by each aggravating factor and, therefore, the trial court's judgment of life imprisonment without parole should be upheld. Specifically, the defendant claims that the state failed to prove that the defendant: (1) knew that, in killing Brown, another person would be subject to a grave risk of death; (2) intended to or was callously indifferent to the fact that the victims would be killed in an \"especially heinous, cruel or depraved manner\"; General Statutes (Rev. to 1997) § 53a-46a (i) (4); and (3) intended to procure the murders by payment of money or anything else of pecuniary value. We disagree.\n\nThe following additional facts are relevant to our resolution of this issue. During the penalty phase of the defendant's trial, the jury indicated on the final verdict form that, in reference to count two, i.e., the death of Brown, it had agreed unanimously that the state had proven one or more aggravating factors beyond a reasonable doubt, that the defendant had failed to prove any statutory mitigating factors, and that at least one member of the jury found the existence of one or more non-statutory mitigating factors. The form further indicated, however, that the jury was unable to agree unanimously that one or more of the proved statutory aggravating factors outweighed one or more of the proved non-statutory mitigating factors.\n\nWe begin by briefly reviewing what is required under our death penalty statute for the imposition of a sentence of life imprisonment. Section 53a-46a (g) provides that a judgment of life imprisonment shall be imposed by a trial court when the fact finder unanimously finds that: (1) one or more statutory mitigating factors, as set forth in § 53a-46a (h), exists; (2) none of the aggravating factors, as set forth in § 53a-46a (i), exists; or (3) one or more of the aggravating factors and one or more non-statutory mitigating factors exist, but the aggravating factor or factors do not outweigh the mitigating factor or factors. If the jury does find one or more aggravating factors and one or more non-statutory mitigating factors, § 53a-46a (e) sets forth the required weighing process. That subsection provides that, \"[t]he jury or, if there is no jury, the court shall return a special verdict setting forth its findings as to the existence of any factor set forth in subsection (h), the existence of any aggravating factor or factors set forth in subsection (i) and whether any aggravating factor or factors outweigh any mitigating factor or factors found to exist pursuant to subsection (d).\" (Emphasis added.) General Statutes § 53a-46a (e).\n\nConsequently, in applying these precepts to the present case, if we were to determine that there is evidence in the record to support the existence of at least one aggravating factor beyond a reasonable doubt, our inquiry into the sufficiency of the evidence to support the state's alleged aggravating factors would necessarily end. That is because even if we were to assume that the other aggravating factors alleged by the state were not supported by sufficient evidence, we could not conclude, as a matter of law, that the jury would have found that the one aggravating factor did not outweigh the mitigating factor or factors found, thereby requiring the imposition of a life sentence. Section 53a-46a (g) necessarily provides that the only way in which a life sentence would be mandated, as a matter of law, without the jury having to perform its weighing function, would be if this court were to conclude that none of the aggravating factors proposed by the state were supported by sufficient evidence in the record. Only in that specified scenario would this court not need to remand for further proceedings. In other words, the issue presently before us is whether, as a matter of law, a life sentence is mandated. Once there is sufficient evidence to support one aggravating factor, a life sentence is not mandated because there remains an issue of fact, namely, whether the supported aggravating factor outweighs any found mitigating factor or factors. This question must be decided by the fact finder, i.e., the jury in the present case. Therefore, the narrow question we must determine is whether there is sufficient evidence in the record to establish beyond a reasonable doubt at least one of the aggravating factors alleged by the state. We conclude that there is sufficient evidence to prove beyond a reasonable doubt that the defendant knew that, in killing Brown, another person would be subject to grave risk of death, as articulated in § 53a-46a (i) (3).\n\nWe begin by setting forth the appropriate standard of review. \"[B]ecause of the seriousness of any death penalty determination, we will subject a finding of an aggravating factor to the same independent and scrupulous examination of the entire record that we employ in our review of constitutional fact-finding, such as the voluntariness of a confession . . . or the seizure of a defendant.\" (Citations omitted.) State v. Ross, supra, 230 Conn. 259. \"However, [e]ven with the heightened appellate scrutiny appropriate for a death penalty case, the defendant's challenge to the sufficiency of the evidence of aggravating circumstances must be reviewed, in the final analysis, by considering the evidence presented at the defendant's penalty hearing in the light most favorable to sustaining the facts impliedly found by the jury. . . . Furthermore, [i]n viewing evidence which could yield contrary inferences, the jury is not barred from drawing those inferences consistent with [the existence of the aggravating factor] and is not required to draw only those inferences consistent with [its nonexistence]. The rule is that the jury's function is to draw whatever inferences from the evidence or facts established by the evidence it deems to be reasonable and logical.\" (Internal quotation marks omitted.) State v. Reynolds, supra, 264 Conn. 87-88.\n\nThe defendant argues that the state failed to produce sufficient evidence to prove beyond a reasonable doubt that the defendant intended that the offense be committed in such a way as to knowingly create a grave risk of death to another person in addition to the victim. Specifically, the defendant claims that the state failed to prove that he knew that, in carrying out the murder of Brown, Clarke would be exposed to a \"grave risk of death . . . .\"\n\nGeneral Statutes (Rev. to 1997) § 53a-46a (i) (3). We disagree.\n\nBefore we review the evidence adduced by the state in the present case, we define the standard by which it is to be measured. Neither this court nor the legislature, however, has had an occasion to define the phrase \"grave risk of death,\" as set forth in § 53a-46a (i) (3). \"Thus, in construing the term, we look to its commonly approved usage, an inquiry that often is [achieved through] the examination of dictionary definitions.\" Kelo v. New London, 268 Conn. 1, 17, 843 A.2d 500 (2004); see also State v. Vickers, 260 Conn. 219, 224, 796 A.2d 502 (2002) (\"[w]here a statute does not define a term it is appropriate to look to the common understanding expressed in the law and in dictionaries\" [internal quotation marks omitted]); State v. Indrisano, 228 Conn. 795, 809, 640 A.2d 986 (1994) (\"[i]f a statute or regulation does not sufficiently define a term, it is appropriate to look to the common understanding of the term as expressed in a dictionary\"); see also General Statutes § 1-1 (a). Webster's Third New International Dictionary defines \"grave\" as meaning \"very serious: dangerous to life . . . .\" Therefore, in order to establish the aggravating factor set forth in § 53a-46a (i) (3), the state must prove that the defendant knew that in killing one person, another person would be subject to a \"very serious\" risk or \"danger\" to his or her life.\n\nIn the present case, the jury reasonably could have found that the defendant intended to have someone kill not only Brown, but also Clarke, thereby clearly subjecting Clarke to a grave risk of death. The defendant first asked Taylor to kill \"two nobodies.\" (Emphasis added.) After Taylor declined, the defendant proceeded to ask both Lee and Adrian if either of them would murder both Brown and Clarke. Furthermore, the evidence reveals that the defendant asked Lee to tell him when both Brown and Clarke arrived home, demonstrating an intent that he wanted the crimes to be committed together. Finally, at the time of the murder, the defendant knew that Brown was a young child, approximately eight years old. On the basis of this fact, the jury reasonably could have inferred that the defendant knew, or should have known, that there was a strong possibility that Brown's mother would be in close proximity to him, wherever he went, and, therefore, if the defendant intended to have Brown killed, he also would subject Clarke to a substantial risk of death. On the basis of this evidence, we conclude that there is sufficient evidence in the record for the jury to find, beyond a reasonable doubt, that the defendant knew that in killing Brown, another person, i.e., Clarke, would be subject to a \"grave risk of death,\" pursuant to § 53a-46a (i) (3).\n\nConsequently, because we conclude that the record contains sufficient evidence to prove beyond a reasonable doubt at least one aggravating factor, we need not address the remaining aggravating factors, and therefore we reject the defendant's alternate ground for affirmance.\n\nD.\n\nThe defendant's final argument is that the trial court's judgment sentencing the defendant to life imprisonment should be upheld because Pinkerton liability cannot be used to prove aggravating factors, and the state therefore presented insufficient evidence to prove any aggravating factors required for the imposition of the death penalty. To support this claim, the defendant argues that: (1) the application of Pinkerton liability to aggravating factors is inconsistent with the plain language of § 53a-46a; (2) Pinkerton liability is inconsistent with the mental state requirements of aggravating factors; and (3) the use of Pinkerton liability to prove a capital murder, which could result in the imposition of the death penalty, would violate the eighth and fourteenth amendments to the federal constitution.\n\nOur review of the record in the present case, however, reveals that the trial court's instructions to the jury during the penalty phase of the trial were completely devoid of any instruction on Pinkerton liability.\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e We therefore conclude that the defendant's claim is irrelevant to the facts of this case, and we need not address it. See Pizzola v. Planning \u0026 Zoning Commission, supra, 167 Conn. 209 (defendant's constitutional attack on statute predicated on hypothetical facts deemed irrelevant and therefore court declined to address claim); Housing Authority v. Olesen, supra, 31 Conn. App. 361 (court declined to address defendant's claim because irrelevant to disposition of appeal).\n\nThe judgment is affirmed with respect to the defendant's conviction; the judgment is reversed with respect to the sentence of life imprisonment without the possibility of parole and the case is remanded for a new penalty phase hearing.\n\nIn this opinion BORDEN, PALMER and ZARELLA, Js., concurred.\n\nSULLIVAN, C. J., concurring in part and dissenting in part.\n\nI agree with parts I and II of the majority opinion, which address the defendant's appeal. With respect to part III of the majority opinion, which addresses the state's appeal, I respectfully dissent. Although I agree with the majority's conclusion that the court's statements\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e to the jury were not a proper statement of the law, I do not agree that those statements tainted the jury so as to render the court's denial of the state's motion for mistrial an abuse of discretion. Furthermore, I would conclude that the record is ambiguous as to whether the court dismissed the proceedings under General Statutes § 54-56\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e or acquitted the defendant pursuant to Practice Book § 42-40.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Accordingly, I would not reach the state's remaining claims and would remand the issue for an articulation as to which action the court took.\n\nI.\n\nThe majority first asserts that the court's statements are grounds for a mistrial because they led the jury to believe that it was not solely responsible for determining the appropriate sentence for the defendant in violation of the eighth amendment. It cites Caldwell v. Mississippi, 472 U.S. 320, 105 S.Ct. 2633, 86 L.Ed. 2d 231 (1985), in support of this proposition. I disagree. First, as a factual matter, I do not understand how instructing the jury that a life sentence is the \"required\" outcome in the event of a deadlock amounts to an instruction that some other body is responsible for making the final decision as to whether the defendant receives a sentence of life imprisonment or the death penalty. A required outcome precludes choice. Second, and more importantly, I believe that Caldwell is inappo-site to the present case.\n\nIn Caldwell v. Mississippi, supra, 472 U.S. 324, defense counsel, during closing argument, spoke of the jury's awesome responsibility in deciding whether the defendant would live or die. The prosecutor, in response, argued that the defense inappropriately had suggested that the jury was solely responsible for its decision. Id., 325. The prosecutor further stated that the jury's decision was not \"the final decision\"; id.; because it was reviewable automatically by the Mississippi Supreme Court. Id., 325-26. On appeal, the United States Supreme Court concluded that the prosecutor's comments had violated the defendant's eighth amendment right to reliable imposition of the death penalty because \"it is constitutionally impermissible to rest a death sentence on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's death rests elsewhere.\" (Emphasis added.) Id., 328-29.\n\nIn the present case, the death penalty was not imposed. Thus, the Caldwell court's concerns with respect to the reliable imposition of the death penalty do not exist here.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Even if Caldwell may be read so broadly as to require the same level of reliability when a life sentence has been given, I believe that Caldwell is inapposite for other reasons. The majority asserts that the court's statements in the present case, like the prosecutor's comments in Caldwell, \"created a reasonable likelihood that the jury failed to appreciate its `awesome responsibility . . . .' \" The majority's conclusion necessarily suggests that because of this failure, the defendant's eighth amendment right to reliable imposition of the death penalty has been violated. The defendant claims no such violation, however. Rather, the state claims that the court's instructions violated Caldwell and \"prejudiced\" the state. The majority, therefore, appears to be invoking Caldwell not to protect the defendant's eighth amendment rights, but, rather, to protect some unidentified interest of the state. Without an explanation of this unprecedented expansion of eighth amendment jurisprudence, I am compelled to disagree.\n\nMoreover, the Caldwell court was particularly concerned with the bias in favor of the death sentence created by the prosecutor's comments.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The court in the present case did not suggest to the jury that if it imposed a death sentence, or any sentence, its decision would not be final because it would be subject to review by an appellate court. There also was no suggestion that the imposition of a death sentence would lead to appellate review, but that a life sentence would not. Unlike Caldwell, the court's instruction created no bias in favor of a death sentence. If the court's statements created any bias at all, it was in favor of a life sentence for the defendant.\n\nThe majority also asserts that the court's statements are grounds for a mistrial because they gave the jurors in favor of a life sentence an incentive to cut deliberations short, thereby increasing the likelihood that the jury would remain deadlocked. I conclude that the state was not prejudiced by the court's statements.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nAs noted by the majority, the statements may have provided an incentive for those jurors in favor of a life sentence to stop trying to convince those in favor of death to change their minds. The statements did not provide any incentive for the jurors in favor of death to cease their efforts to convince those in favor of life, because doing so would only have resulted in a hung jury with a resultant life sentence. Therefore, I do not agree with the majority that the court's statements adversely affected the state's interests.\n\nAccordingly, I conclude that the court's statements to the jury did not create circumstances such that the court's denial of the state's motion for a mistrial constituted a manifest abuse of discretion.\n\nII.\n\nI, therefore, would reach the state's claim that the court abused its discretion by denying its motion for mistrial and by dismissing the proceedings pursuant to General Statutes § 54-56. The defendant claims that the court did not abuse its discretion when it dismissed the proceedings, and, in the alternative, that the court was not dismissing the proceedings pursuant to § 54-56, but, rather, was acquitting the defendant pursuant to Practice Book § 42-40 or § 42-50. Having carefully reviewed the record, I believe that it is simply unclear whether the court was acquitting the defendant or dismissing the case. Accordingly, bearing in mind the double jeopardy concerns with respect to acquittal, I would remand the case for further articulation.\n\nThe following additional facts and procedural history are necessary for the resolution of this issue. Immediately after the court ordered the jury's special verdict accepted and recorded, the state made an oral motion for a mistrial pursuant to Practice Book § 42-45. The state argued that a mistrial was necessary because the jury was deadlocked, but the court denied the state's motion. The state then asked for permission to appeal, and the court reserved ruling on the issue until the day of sentencing.\n\nAt the sentencing hearing, the court denied the state's motion for permission to appeal and reiterated its assertion that a mistrial was not appropriate.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The court then imposed a total effective sentence of life imprisonment without the possibility of release.\n\nIn a subsequent memorandum of decision on the court's denial of the motion for permission to appeal, the court further articulated its reasons for denying the state's motion for a mistrial. The court first noted that it could take one of three courses of action in response to the jury's inability to agree, pursuant to State v. Daniels, 207 Conn. 374, 394-97, 542 A.2d 306 (1988). Specifically, the court stated that it could: \"(1) declare a mistrial; (2) make factual findings `acquitting' the defendant of the death penalty; or (3) exercise its discretion pursuant to General Statutes § 54-56 to dismiss the death penalty proceedings.\" The court then stated: \"Because the jury was unable to unanimously agree as to whether the proved aggravating factor or factors outweighed the proved mitigating factor or factors, the court found that the state failed to sustain its burden of proof. Anything beyond this conclusion is mere speculation. Indeed, the verdict, as exemplified by the questions posed by the jury and the formulation of the special verdict form, which was accepted by both the state and the defendant, indicates that the state was unable to overcome the mitigating factor or factors found by the jury. Consequently, the court, exercising its discretion, denied the state's motion for a mistrial and dismissed the death penalty proceedings.\" (Emphasis added.) The court concluded by stating: \"The court has given due consideration to the circumstances of the case, including the evidence presented and the jury's verdict as indicated on the special verdict forms. Because the court finds that the state failed to sustain its burden of proof that the one or more aggravating factors outweighed the one or more mitigating factors, the motion for permission to appeal is hereby denied.\" (Emphasis added.)\n\nIn State v. Daniels, supra, 207 Conn. 380-81, the court imposed a life sentence after the jury could not unanimously agree as to the presence or absence of a mitigating factor. On appeal, after determining that the court had three options for disposing of the case after the jury deadlocked (acquit, dismiss or declare a mistrial), this court concluded that the record was ambiguous as to which action the court had taken and why. Id., 401-403. We could not ascertain whether the court acquitted the defendant on the basis of its assessment of the facts or imposed a life sentence because it thought it was required to do so. Id., 402. We refused to entertain the state's remaining claims because, in the event that the court's imposition of a life sentence constituted an acquittal, further review of the state's claim would have been barred by double jeopardy. Id. \"If the trial court's imposition of a life sentence amounts to an `acquittal' of the death penalty then double jeopardy bars a second capital sentencing proceeding.\" Id., 398. The effect of an acquittal is particularly important in the context of the state's claim that the court imposed a life sentence on the basis of erroneous legal conclusions, because, \"[t]he fact that an acquittal is based in whole or in part on an erroneous construction of the governing law is of no import. That fact affects the accuracy of that determination, but it does not alter its essential character.\" (Internal quotation marks omitted.) Id., 399.\n\nThe court's action in the present case is similarly ambiguous. In its memorandum of decision, the court indicated that the state had failed to carry its burden of proof, suggesting that the court itself made factual findings and acquitted the defendant of capital felony murder.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The court, however, also stated in the memorandum of decision that it had \"exercis[ed] its discretion . . . [and] dismissed the death penalty proceedings,\" which suggests that the court intended to exercise its discretion to dismiss the death penalty proceedings pursuant to § 54-56. Keeping in mind that, if the court had acquitted, a second capital penalty hearing would be barred by double jeopardy, I would remand the case to the trial court for an articulation of its action.\n\nAccordingly, I respectfully dissent.\n\nKATZ, J., with whom NORCOTT, J., joins, dissenting.\n\nAdhering to my view that the death penalty is, in all circumstances, cruel and unusual punishment prohibited by the constitution, I reaffirm my position that our \"society should not have the authority to sustain an institution the nature of which is to destroy its own members. If our status as moral creatures is to survive, the termination of our ability to accomplish a deliberate institutionalized method of execution heads my list of desiderata for this society.\" State v. Webb, 252 Conn. 128, 150, 750 A.2d 448 (Katz, J., dissenting), cert. denied, 531 U.S. 835, 121 S.Ct. 93, 148 L.Ed. 2d 53 (2000).\n\nAs I have stated before, the issue \"is not whether the defendant . . . has the right to life, but whether we as a society have the right to kill.\" Id. Certainly the defendant who has committed such hideous atrocities did not have that right. His acts of violence, however, do not justify state sanctioned murder. The \"justice\" we impose is no less shocking than the crime itself, and, far from treating the defendant's offense, instead sullies us. As Justice Brennan of the United States Supreme Court summarized in a dissent: \"The fatal constitutional infirmity in the punishment of death is that it treats members of the human race as nonhumans, as objects to be toyed with and discarded. [It is] thus inconsistent with the fundamental premise of the [cruel and unusual punishments] [c]lause that even the vilest criminal remains a human being possessed of common human dignity. . . . As such it is a penalty that subjects the individual to a fate forbidden by the principle of civilized treatment guaranteed by the [clause].\" (Citation omitted; internal quotation marks omitted.) Gregg v. Georgia, 428 U.S. 153, 230, 96 S.Ct. 2909, 49 L.Ed. 2d 859 (1976).\n\nI also agree with former Justice Berdon and Justice Norcott, both of whom, in separate dissenting opinions, have expressed their opposition to the death penalty because it allows for arbitrariness and racial discrimination in the determination of who shall live or die at the hands of the state. See State v. Cobb, 251 Conn. 285, 530-36, 545-48, 743 A.2d 1 (1999), cert. denied, 531 U.S. 841, 121 S.Ct. 106, 148 L.Ed. 2d 64 (2000). In the years following the United States Supreme Court's decision in Furman v. Georgia, 408 U.S. 238, 92 S.Ct. 2726, 33 L.Ed. 2d 346 (1972), serious efforts were made to comply with its mandate, and legislatures and appellate courts struggled to provide judges and juries with sensible and objective guidelines for determining life and death. We have attempted to define who is \"deserving\" of the death penalty through the use of carefully chosen adjectives, reserving the death penalty for the \"worst of the worst.\" But the Furman promise of consistency and the requirement of individualized sentencing; see Lockett v. Ohio, 438 U.S. 586, 605, 98 S.Ct. 2954, 57 L.Ed. 2d 973 (1978); merely have reduced, rather than eliminated, the number of people subject to arbitrary sentencing. While one might hope that providing the sentencer with as much relevant mitigating evidence as possible will lead to more rational and consistent sentences, experience has taught us otherwise. Indeed, the decision whether a human being should live or die is so inherently subjective that it unavoidably defies the rationality and consistency required by the constitution.\n\nFurthermore, even under the most sophisticated death penalty statutes, race continues to play a major role. We have not eliminated the biases and prejudices that infect society generally; therefore, it should not be surprising that such problems continue to influence the determination of who is sentenced to death, even within the narrower pool of death-eligible defendants selected according to so-called objective standards. Finally, even the most sophisticated death penalty schemes are unable to prevent human error from condemning the innocent. Innocent persons have been executed. See H. Bedau \u0026 M. Radelet, \"Miscarriages of Justice in Potentially Capital Cases,\" 40 Stan. L. Rev. 21, 36 (1987).\n\nAccordingly, I respectfully dissent because to do otherwise would perpetuate yet another killing, sadly this one state sponsored.\n\n\u003cspan class=\"fn\"\u003e1. General Statutes § 53a-54a (a) provides in relevant part: \"A person is guilty of murder when, with intent to cause the death of another person, he causes the death of such person or of a third person or causes a suicide by force, duress or deception . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. General Statutes (Rev. to 1999) § 53a-54b provides in relevant part: \"A person is guilty of a capital felony who is convicted of . . . (8) murder of two or more persons at the same time or in the course of a single transaction; or (9) murder of a person under sixteen years of age.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. General Statutes § 53a-48 (a) provides: \"A person is guilty of conspiracy when, with intent that conduct constituting a crime be performed, he agrees with one or more persons to engage in or cause the performance of such conduct, and any one of them commits an overt act in pursuance of such conspiracy.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. General Statutes § 53a-46a (b) provides in relevant part: \"For the purpose of determining the sentence to be imposed when a defendant is convicted of or pleads guilty to a capital felony, the judge or judges who presided at the trial or before whom the guilty plea was entered shall conduct a separate hearing to determine the existence of any mitigating factor concerning the defendant's character, background and history, or the nature and circumstances of the crime, and any aggravating factor set forth in subsection (i). . . . Such hearing shall be conducted (1) before the jury which determined the defendant's guilt, or (2) before a jury impaneled for the purpose of such hearing if (A) the defendant was convicted upon a plea of guilty; (B) the defendant was convicted after a trial before three judges as provided in subsection (b) of section 53a-45; or (C) if the jury which determined the defendant's guilt has been discharged by the court for good cause, or (3) before the court, on motion of the defendant and with the approval of the court and the consent of the state.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The trial court merged the murder count and the two capital felony counts and rendered judgment sentencing the defendant to life imprisonment without the possibility of parole on the merged counts and twenty years on the conspiracy count. The court further ordered that the sentence on the merged count run consecutively to the defendant's unrelated federal sentence and that the sentence on the count of conspiracy run concurrent to the sentence on the merged count, thereby imposing a total effective sentence of life imprisonment without the possibility of parole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. General Statutes § 51-199 (b) provides in relevant part: \"The following matters shall be taken directly to the Supreme Court . . . (3) an appeal in any criminal action involving a conviction for a capital felony, class A felony, or other felony, including any persistent offender status, for which the maximum sentence which may be imposed exceeds twenty years . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The trial court denied the state permission to appeal, and the state appeals from that denial as well as from the trial court's denial of its motion for mistrial. See part III of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Pursuant to a motion by the defendant, the two appeals were consolidated by this court for the purpose of preparing a single record and setting the briefing schedule. The court chose to treat the defendant's appeal as a cross appeal and, accordingly, the defendant was designated the appellee-appellant and the state was designated the appellant-appellee.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. General Statutes § 54-96 provides: \"Appeals from the rulings and decisions of the Superior Court, upon all questions of law arising on the trial of criminal cases, may be taken by the state, with the permission of the presiding judge, to the Supreme Court or to the Appellate Court, in the same manner and to the same effect as if made by the accused.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The defendant, in his brief, makes three additional alternate grounds for affirmance. First, he argues that a retrial of the penalty phase is barred by the double jeopardy clause of the fifth amendment to the United States constitution because the trial judge acquitted the defendant of the death penalty. This argument is fully addressed as part of the state's claims on appeal; see part III B of this opinion; and, therefore, we need not address it as an alternate ground for affirmance. Second, the defendant argues that under the recent United States Supreme Court case of Sattazahn v. Pennsylvania, 537 U.S. 101, 112, 123 S.Ct. 732, 154 L.Ed. 2d 588 (2003), retrial of the penalty phase is barred \"[i]f a jury unanimously concludes that a [s]tate has failed to meet its burden of proving the existence of one or more aggravating circumstances [because] double jeopardy attaches to the `acquittal' on the offense . . . .\" Similarly, this argument is fully addressed in part III B of this opinion. Third, the defendant argues that a retrial of the penalty phase is barred by the double jeopardy clause when an objection has been made to the declaration of a mistrial and the state has failed to establish the existence of manifest necessity. We find this argument to be unpersuasive. In the present case, the state moved for a mistrial of the penalty phase after the jury had become deadlocked on both of the capital felony counts. Both this court and the United States Supreme Court have long held that the fact that a jury is unable to reach a unanimous verdict is considered the classic basis for a proper declaration of a mistrial, and, therefore, there was no need for the state to establish that there was manifest necessity for its declaration. See, e.g., State v. Aillon, 182 Conn. 124, 129, 438 A.2d 30 (1980), cert. denied, 449 U.S. 1090, 101 S.Ct. 883, 66 L.Ed. 2d 817 (1981), overruled in part on other grounds, State v. Butler, 262 Conn. 167, 176, 810 A.2d 791 (2002); see also Downum v. United States, 372 U.S. 734, 735-36, 83 S.Ct. 1033, 10 L.Ed. 2d 100 (1963); Wade v. Hunter, 336 U.S. 684, 688-89, 69 S.Ct. 834, 93 L.Ed. 974 (1949).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We hereinafter refer to this incident as the Lindley Avenue shooting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Specifically, Keene testified that the defendant first told her to move in November, 1998. She stated that, \"[the defendant] told me shit was starting to get hot and he [was] about to start getting witnesses, witnesses--wait a minute. First he told me witnesses [were] about to get killed.\" She further testified that the defendant warned her again on Christmas day in 1998 stating: \"[The defendant] was talking in an opening to everybody, but, like me mainly . . . I'm telling her she better move. Shit about to start getting hot, meaning people starting to get killed.\" Finally, Keene testified that, when the defendant spoke about killing witnesses, he quoted the following lyrics from a rap song: \"[N]iggers want to lie, niggers wonder why, niggers gonna die.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Although there was no direct evidence presented at trial that the defendant knew that the state had used the shell casings left behind at the Lindley Avenue shooting to link that shooting to Snead's murder, the jury reasonably could have inferred that while preparing his defense to the Snead murder case, the defendant was informed by his counsel that the state intended to use the discarded shell casings to link him to Snead's murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. General Statutes § 53a-46a (a) provides: \"A person shall be subjected to the penalty of death for a capital felony only if a hearing is held in accordance with the provisions of this section.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. \"A Chip Smith instruction reminds the jurors that they must act unanimously, while also encouraging a deadlocked jury to reach unanimity. See State v. Smith, 49 Conn. 376 (1881); see also 5 Connecticut Practice, D. Borden \u0026 L. Orland, Connecticut Criminal Jury Instructions (1986) § 4.8.\" (Internal quotation marks omitted.) State v. Saunders, 267 Conn. 363, 390 n.29, 838 A.2d 186 (2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See footnote 5 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In the course of its charge, the trial court instructed the jury on conspiratorial liability, stating, \"[i]n this case the state has not produced evidence that the defendant in fact shot [Brown or Clarke]. . . . The state relies on what the law calls . . . vicarious liability. There are two ways that vicarious liability may be demonstrated in a case . . . . One of them is . . . conspiratorial liability. . . . [A]nd that conspiracy is the conspiracy to commit murder.\" The court further informed the jury that conspiratorial liability applied to the murder count, to the capital felony counts and \"particularly [to] the fourth count [of conspiracy to commit murder] as well.\" The court then proceeded to charge the jury on Pinkerton liability, without referring to the doctrine by name, by instructing the jury that if it found that the defendant was \"guilty of conspiracy to commit murder,\" but had not killed the victims, it also would have to find that another member of the conspiracy murdered the victims. Specifically, the court stated that, \"[t]here is a doctrine in our law that provides that once a defendant's participation in a conspiracy is established, he is then responsible for each of the criminal acts of the other coconspirators which is within the scope of and in furtherance of the conspiracy. \"This means in this case that if you conclude the defendant was in fact guilty of conspiracy to commit murder, as I will define that for you, but he did not in fact kill [Brown or Clarke], then you must determine whether sufficient evidence has been provided to show you beyond a reasonable doubt that another member of that same conspiracy did in fact perform that act that was the proximate cause of their deaths. If such other member of the conspiracy did perform that act and if that act was in the scope of the furtherance of the conspiracy, then the defendant would be guilty of murder and capital felony as well. \"To reiterate, if you conclude [that] the defendant was a member of a conspiracy as charged in the second count of the information beyond a reasonable doubt and that another member of that same conspiracy committed the crime of murder, [and] you further conclude beyond a reasonable doubt that the murder was in the scope of and the furtherance of this conspiracy, then each and every member of that conspiracy would be guilty of the murder charge whether or not they personally committed the murder. * * * \"It does not matter whether [the murder] that resulted from the . . . coconspirator's act be intended by [the defendant]. When the deaths of the victims caused by the . . . coconspirator's conduct is a foreseeable and natural result of that conduct, the law considers the [chain] of legal causation unbroken and holds the defendant's . . . coconspirators and thus the defendant criminally responsible.\" The jurors were admonished, however, that finding the defendant guilty of conspiracy to commit murder was insufficient to convict him of a capital felony under the theory of Pinkerton liability unless the state proved all of the other elements of those crimes. Specifically, the court stated that, \"[a] verdict of guilty for the crime of conspiracy to commit the murder does not automatically result in a verdict of guilty for the crime of murder or capital felony,\" unless the state proves all of the other elements of the crimes charged. The jury repeatedly was instructed that it must decide whether the defendant intended to commit the murders, the alleged underlying object of the conspiracy. In particular, in the court's supplemental instructions, it told the jury that these are \"specific intent crime[s]. All four charges require the finding by a jury unanimously that the intent of the actor during the course of the conduct is intentional conduct.\" The court then defined the crime of murder as follows: \"A person is guilty of murder, [when] with intent to cause the death of another person, he causes the death of such person.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The defendant makes two additional arguments in his brief. First, the defendant argues that, in light of the United States Supreme Court's decisions in Enmund v. Florida, 458 U.S. 782, 102 S.Ct. 3368, 73 L.Ed. 2d 1140 (1982), Tison v. Arizona, 481 U.S. 137, 107 S.Ct. 1676, 95 L.Ed. 2d 127 (1987), and their progeny, \"the use of Pinkerton to prove a capital murder would call into question the constitutionality of Connecticut's death penalty,\" under the eighth and fourteenth amendments to United States constitution. Because the eighth amendment pertains solely to the punishment phase of a trial, and not the guilt phase, we address this claim as an alternate ground for affirming the trial court's imposition of a life sentence. See part IV of this opinion. Second, the defendant argues that \"[w]here the jury did not articulate on which of [the] two theories of liability it convicted the defendant [accessorial or Pinkerton], if either one of them is legally insufficient, then the conviction must be reversed.\" Because we conclude that the trial court's instruction on Pinkerton liability was proper, and the defendant does not challenge the trial court's instruction on accessorial liability, we need not reach this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Practice Book § 60-5 provides in relevant part: \"The court may in the interests of justice notice plain error not brought to the attention of the trial court. . . .\" Because we conclude that the defendant's argument fails on its merits, we need not address the defendant's claim of plain error. See State v. Cobb, 251 Conn. 285, 343 n.34, 743 A.2d 1 (1999) (plain error doctrine \"invoke[d] in order to rectify a trial court ruling that, although either not properly preserved or never raised at all in the trial court, nonetheless requires reversal of the trial court's judgment\"), cert. denied, 531 U.S. 841, 121 S.Ct. 106, 148 L.Ed. 2d 64 (2000); State v. Rouleau, 204 Conn. 240, 243, 528 A.2d 343 (1987) (declining to address claim of plain error when reviewable under predecessor of Golding).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. We note that the state has not argued that the claim is unreviewable, and has briefed the claim on its merits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The defendant argues that this claim poses a question of statutory interpretation. Because the defendant posits no discernible argument as to why this is a statutory interpretation issue, we decline to address it as such. See City Recycling, Inc. v. State, 257 Conn. 429, 455, 778 A.2d 77 (2001) (claims not properly briefed will not be reviewed); State v. Spigarolo, 210 Conn. 359, 388, 556 A.2d 112, cert. denied, 493 U.S. 933, 110 S.Ct. 322, 107 L.Ed. 2d 312 (1989) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Our resolution of this issue is consistent with the resolution of an identical issue in State v. Garner, 270 Conn. 458, 483-86, 853 A.2d 478 (2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. To the extent that the defendant also argues that the trial court's instruction on Pinkerton liability was improper because, \"[u]nder State v. Harrell, supra, 238 Conn. 828, and State v. Johnson, supra, 241 Conn. 702, an unintentional murder cannot support a capital felony conviction,\" we deem such an argument irrelevant in the context of this case. (Emphasis added.) The defendant was convicted of murder in violation of § 53a-54a (a), which is necessarily an intentional crime, and it was this conviction that provided the foundation for his capital felony conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The defendant also argues that our reasoning in State v. Harrell, supra, 238 Conn. 828, \"shows that the legislature never intended that Pinkerton liability could provide a predicate for a capital conviction.\" Under the facts of the present case, as in Coltherst, \"[t]here is no occasion . . . as there was in Harrell and Johnson, to inquire into the legislature's intent in enacting § 53a-54b.\" State v. Coltherst, supra, 263 Conn. 501. Instead, the question before us is whether our prior precedents adopting and delineating the parameters of the Pinkerton doctrine preclude the state from proving a capital felony through use of the Pinkerton doctrine. Therefore, we decline to address the defendant's argument regarding the legislature's intent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Our opinion in State v. Coltherst, supra, 263 Conn. 478, did not specifically address this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The defendant further claims that this court \"has not considered the impact of extending Pinkerton on capital felony, particularly the extra element of the offense that makes the crime a capital felony as opposed to murder and should not do so in this case where the state also relied on [accessorial] liability.\" The defendant, however, fails to provide any analysis to support this claim, and we therefore decline to review it. See footnote 21 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See footnote 17 of this opinion for the relevant portion of the trial court's jury instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Because we conclude that the defendant's argument fails on its merits, we need not address the defendant's claim of plain error. See footnote 19 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The defendant argues that a failure properly to instruct on an essential element of the crime, i.e., intent, impermissibly would reduce the state's burden of proof under In re Winship, 397 U.S. 358, 364, 90 S.Ct. 1068, 25 L.Ed. 2d 368 (1970), thereby creating an issue of constitutional magnitude. We agree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. We note that the state has not argued that the claim is unreviewable, and has briefed the claim on its merits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The defendant argues that the following statements by the trial court misled the jury: (1) the coconspirator must have \"perform[ed] that act that was the proximate cause of their deaths\"; (2) the defendant would be liable for murder if a coconspirator \"perform[ed] that act [of causing death]\"; (3) \"[t]he state has satisfied its burden of proof for the crime of murder under the theory of conspiratorial liability when it is demonstrated to you beyond a reasonable doubt that the defendant is in fact guilty of conspiracy to commit murder . . . [and] another member of the same conspiracy . . . performed the act that was the proximate cause of the death of [Clarke]\"; (4) \"that another member . . . of the same conspiracy performed the act that was the proximate cause of [Brown's] death and the proximate cause of the death of [Clarke]\"; (5) \"that whoever was the one who committed the crime\" did so within the scope of and in furtherance of the conspiracy; and (6) \"[t]he state has satisfied its burden of proof for the crime of capital felony on the third count under the theory of conspiratorial liability when it demonstrates to you that the defendant is in fact guilty of conspiracy to commit murder . . . [and] another member . . . of the same conspiracy performed the act that was the proximate cause of both [victims' deaths] in the same transaction and at the same time.\" The defendant fails, however, to acknowledge the trial court's instruction that murder requires an intent to cause the death of another person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The sixth amendment to the United States constitution provides in relevant part: \"In all criminal prosecutions, the accused shall enjoy the right . . . to be confronted with the witnesses against him . . . and to have the assistance of counsel for his defense.\" The sixth amendment right of confrontation and right to counsel is made applicable to the states through the due process clause of the fourteenth amendment. See Pointer v. Texas, 380 U.S. 400, 403, 85 S.Ct. 1065, 13 L.Ed. 2d 923 (1965), and Gideon v. Wainwright, 372 U.S. 335, 83 S.Ct. 792, 9 L.Ed. 2d 799 (1963), respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Article first, § 8, of the Connecticut constitution provides in relevant part: \"In all criminal prosecutions, the accused shall have a right . . . to be confronted by the witnesses against him . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The defendant offers no independent analysis under the state constitution. We therefore confine our analysis to the issues raised under the federal constitution. See State v. Rizzo, 266 Conn. 171, 243 n.40, 833 A.2d 363 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The state does not dispute the fact that Lee was an \"invaluable\" witness to the state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The defendant argues for the first time in his reply brief that the issue on appeal is not whether the trial court abused its discretion when it failed to disclose Lee's mental health records to the defense because Lee's subsequent consent to disclosure of the records renders the issue moot. Rather, the defendant argues, the issue is \"whether the defendant's rights to present a defense and to confrontation were violated when he was prevented from impeaching Lee with her psychiatric records,\" and therefore \"until the sixth amendment is satisfied, the trial court has no discretion to prevent the defendant from using the information critical to presenting his defense . . . .\" (Emphasis added.) This argument, however, presents two problems. First, \"[w]e generally do not consider issues raised for the first time in a reply brief.\" Celentano v. Oaks Condominium Assn., 265 Conn. 579, 587 n.6, 830 A.2d 164 (2003); see also Bovat v. Waterbury, 258 Conn. 574, 585 n.11, 783 A.2d 1001 (2001) (\"[i]t is a well established principle that arguments cannot be raised for the first time in a reply brief\" [internal quotation marks omitted]). Second, Lee's consent to the release of her mental health records occurred in the subsequent trial of Adrian, well after the alleged denial of access occurred. The fact that the defendant was given access to the documents after his trial was complete does not affect our inquiry into whether the denial of access during the trial was improper. Therefore, we decline to review this new claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The fact that Lee was suffering from human immunodeficiency virus was not disclosed to the defense until after the trial court allowed the defense to review Lee's mental health records in preparation for her competency hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. These included records from Bridgeport Hospital, Bridgeport Area Regional Mental Health Center, Southwest Community Health Center, Inc., Gosnold Treatment Center/Emerson House in Falmouth, Massachusetts, St. Vincent's Medical Center Alcohol and Drug Recovery Centers, Inc. (other-wise known as Blue Hills Hospital in Hartford), Greater Bridgeport Community Mental Health Center, Connecticut Valley Hospital, Mt. Diablo Medical Center in Concord, California, and the Federal Bureau of Prisons.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Because the trials of Adrian and the defendant had not yet been severed, both counsel for Adrian and counsel for the defendant participated in taking Lee's testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. A renewed motion for disclosure of Lee's records was filed by counsel for Adrian on October 28, 1999. The record reflects, however, that the trial court, counsel for Adrian and counsel for the defendant agreed that from that point forward, in an effort to promote judicial economy, a motion filed by one defendant automatically would be adopted by the other defendant, unless it was agreed otherwise. Therefore, although this particular motion was filed by counsel for Adrian, it necessarily was adopted by the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. This claim is reviewable because it was preserved sufficiently by the defendant during pretrial proceedings by filing a motion for disclosure of Lee's records, and through subsequent oral argument on that motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The Physicians' Desk Reference (35th Ed. 1985) p. 1691, describes Thorazine, as a drug used in the \"management of manifestations of psychotic disorders.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Holeman testified that he had overheard the defendant state that, \"his brother wouldn't roll on him because he has two and he has one, meaning [Adrian] has two and [the defendant] says he has one.\" When asked what the meaning of this was, Holeman stated that it is \"street language,\" for \"bodies.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. An \"ex parte proceeding\" generally refers to a \"judicial or quasi judicial hearing in which only one party is heard\"; (emphasis added) Black's Law Dictionary (6th Ed. 1990); and therefore usually does not include the situation where only a witness or the witness' attorney is present. In the present case, we construe \"party\" broadly as \"[a] person involved in a legal transaction or court proceeding.\" Id. Therefore, in this opinion, we refer to the proceedings between the attorney for the state's witness and the trial court as ex parte.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Section 1 of the fourteenth amendment to the United States constitution provides in relevant part: \"No State shall . . . deprive any person of life, liberty or property, without due process of law . . . .\" The United States Supreme Court, in Kentucky v. Stincer, 482 U.S. 730, 745, 107 S.Ct. 2658, 96 L.Ed. 2d 631 (1987), interpreted the fourteenth amendment to guarantee a defendant \"the right to be present at any stage of the criminal proceeding that is critical to its outcome if his presence would contribute to the fairness of the procedure.\" See also Snyder v. Massachusetts, 291 U.S. 97, 105-106, 54 S.Ct. 330, 78 L.Ed. 674 (1934) (concluding that due process clause provides defendant with right \"to be present in his own person whenever his presence has a relation, reasonably substantial, to the fulness of his opportunity to defend against the charge\"). See footnote 32 of this opinion for the relevant text of the sixth amendment to the United States constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Canon 3 (a) (4) of the Code of Judicial Conduct provides in relevant part: \"A judge shall not initiate, permit or consider ex parte communications, or consider other communications made to the judge outside the presence of the parties concerning a pending or impending proceeding except that: \"(A) Where circumstances require, ex parte communications for scheduling, administrative purposes or emergencies that do not deal with substantive matters or issues on the merits are authorized; provided: \"(i) the judge reasonably believes that no party will gain a procedural or tactical advantage as a result of the ex parte communication, and \"(ii) the judge makes provision promptly to notify all other parties of the substance of the ex parte communication and allows an opportunity to respond. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The defendant also argues that the trial court's ex parte hearings violated canon 3 (c) (1) of the Code of Judicial Conduct by demonstrating an appearance of impropriety. Because we conclude that the ex parte hearings were expressly authorized by law, in accordance with canon 3 (a) (4) (E), we need not address the defendant's alternate claim. See Spears v. Garcia, 263 Conn. 22, 32, 818 A.2d 37 (2003) (statutes should be interpreted so as not to conflict); Nizzardo v. State Traffic Commission, 259 Conn. 131, 157, 788 A.2d 1158 (2002) (same); see also State v. Pare, 253 Conn. 611, 622, 755 A.2d 180 (2000) (principles of statutory construction apply to judicially enacted rules); Grievance Committee v. Trantolo, 192 Conn. 15, 22, 470 A.2d 228 (1984) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. General Statutes § 54-86c (b) provides: \"Any state's attorney, assistant state's attorney or deputy assistant state's attorney may request an ex parte in camera hearing before a judge, who shall not be the same judge who presides at the hearing of the criminal case if the case is tried to the court, to determine whether any material or information is exculpatory.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The defendant contends that Judge Ford conducted a third proceeding with Reeve over the telephone. The record contains no reference to such a conversation, and therefore we address only the two instances reflected in the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The defendant further argues that he never had a realistic opportunity either to object to the ex parte hearings or to file a motion for recusal because he was not given notice of the hearings, nor did the court disclose the full content of these hearings or that there were transcripts of the proceedings. Therefore, the defendant argues that, when there was no meaningful opportunity to object at trial, it cannot reasonably be argued that the defendant has waived his right to raise the issue on appeal. Because we conclude that the issue is reviewable under the first two prongs of Golding, we need not address this argument. Furthermore, because we conclude that any alleged impropriety was harmless, we need not address the defendant's claim of plain error. See footnote 19 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See part II A of this opinion for a discussion of the requirements of Golding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The defendant argues that the \"[d]enial of the right to counsel, and to be present at [all critical stages of] trial\" are of constitutional magnitude. We agree. See State v. Simino, 200 Conn. 113, 125, 509 A.2d 1039 (1986) (\"[a] criminal defendant has a constitutional right to be present at all critical stages of his trial\"); State v. Harman, 198 Conn. 124, 128 n.3, 502 A.2d 381 (1985) (stating that defendant's right to assistance of counsel during all critical stages of trial involves fundamental constitutional right).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Because the defendant fails to provide any analysis to support his claim of reviewability under the plain error doctrine, we decline to review it. See footnote 19 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. See part II A of this opinion for a discussion of Golding and its requirements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The defendant argues that due process requires that a judge possess neither actual nor apparent bias. We agree. See In re Murchison, 349 U.S. 133, 136, 75 S.Ct. 623, 99 L.Ed. 942 (1955) (absence of actual or probable impropriety by trial judge is basic requirement of due process); Petrowski v. Norwich Free Academy, 199 Conn. 231, 238, 506 A.2d 139, appeal dismissed, 479 U.S. 802, 107 S.Ct. 42, 93 L.Ed. 2d 5 (1986) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The United States Supreme Court, in Kentucky v. Stincer, 482 U.S. 730, 740, 107 S.Ct. 2658, 96 L.Ed. 2d 631 (1987), interpreted the confrontation clause of the sixth amendment to guarantee a defendant the right to be present at any stage of a trial where his or her exclusion would \"[interfere] with his opportunity for effective cross-examination.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. See footnote 9 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. See footnote 15 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Practice Book § 42-45 provides: \"The judicial authority shall declare a mistrial in any case in which the jury are unable to reach a verdict.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Following its oral ruling on the state's motion for a mistrial and motion for permission to appeal, the court issued a written memorandum of decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. \"Since it would be a useless procedure to remand this case to the trial court with direction to grant the state permission to appeal, we will address the remaining questions on appeal at this time.\" State v. Bergin, supra, 214 Conn. 663 n.5; see also State v. Avcollie, supra, 174 Conn. 111-12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. The state makes four additional arguments in support of its claim regarding its motion for a mistrial. The state argues that: (1) the trial court improperly provided the jury with a revised verdict form that permitted it to respond that it \"unanimously agree[d] that [it was] unable to unanimously agree\" on the sentencing issues; (2) when the jury responded that it \"unanimously agree[d] that [it was] unable to unanimously agree,\" the trial court compounded its error by mislabeling this result as a \"unanimous jury verdict\"; (3) the trial court's reliance on State v. Daniels, supra, 207 Conn. 374, to dismiss the penalty phase proceedings was improper because, by sanctioning a court's exercise of discretion pursuant to General Statutes § 54-56, Daniels violates the constitutional doctrine of separation of powers, as set forth in article second of the state constitution, as amended by article eighteen of the amendments, and therefore should be overruled; and (4) even if this court declines to overrule Daniels, the trial court abused its discretion when it dismissed the death penalty proceedings pursuant to § 54-56. Because we conclude that the trial court abused its discretion in denying the state's motion for a mistrial on different grounds, we need not address the state's additional arguments. The state further argues that the trial court committed plain error by failing to instruct the jury properly that it must be unanimous with respect to any individual aggravating factor, as opposed to unanimously agreeing that at least one aggravating factor exists. Specifically, the state contends that such an instruction was \"vital in a capital case so that this [c]court could review the sufficiency of the aggravating factors as required by . . . § 53a-46b (b) (2).\" We agree. Because we resolve this appeal in the state's favor on alternate grounds, however, we need not further address the state's claim of plain error.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. See part IV A of this opinion for a more detailed discussion of State v. Daniels, supra, 207 Conn. 374.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. We disagree with the characterization by Chief Justice Sullivan in his concurring and dissenting opinion of our use of Caldwell v. Mississippi, supra, 472 U.S. 320, as controlling on this matter. We recognize that Caldwell presented a different factual circumstance than the present case. We believe, however, that Caldwell is illustrative of the applicable law, namely that \"[i]t is imperative . . . that the jury instructions in a capital case clearly and unequivocally explain to the jury that it is solely responsible for determining whether the defendant will receive the death penalty or, instead, a sentence of life imprisonment without the possibility of release.\" (Citations omitted; emphasis added; internal quotation marks omitted.) State v. Reynolds, supra, 264 Conn. 125.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. See footnote 4 of this opinion for the relevant text of § 53a-46a (b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. The defendant further argues that \"[o]ur legislature did not intend to authorize new penalty trials simply because a death-qualified jury could not agree that the defendant's life should be spared.\" The defendant, however, fails to provide any analysis to support this claim, and therefore we decline to review it. See footnote 21 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Public Act 03-154, § 1, was enacted in order to overrule our rejection of the plain meaning rule in State v. Courchesne, 262 Conn. 537, 577, 816 A.2d 562 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Although the Penal Code does not define \"good cause,\" General Statutes § 1-1, entitled \"[w]ords and phrases,\" does provide in relevant part that \"(a) [i]n the construction of the statutes, words and phrases shall be construed according to the commonly approved usage of the language; and technical words and phrases, and such as have acquired a peculiar and appropriate meaning in the law, shall be construed and understood accordingly. . . .\" Therefore, when a phrase previously has been defined by judicial opinion, the meaning \"shall be construed and understood accordingly.\" General Statutes § 1-1 (a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Connecticut has a long history of requiring unanimity in jury verdicts, especially in capital sentencing cases. See State v. Gannon, supra, 75 Conn. 226-32 (tracing history of right to jury trial and unanimous verdicts). Furthermore, this court has stated that \"[t]he heightened reliability demanded by the [e]ighth [a]mendment in the determination whether the death penalty is appropriate; Sumner v. Shuman, 483 U.S. 66, 72, 107 S.Ct. 2716, 97 L.Ed. 2d 56 (1987); convinces us that jury unanimity is an especially important safeguard at a capital sentencing hearing.\" (Internal quotation marks omitted.) State v. Daniels, supra, 207 Conn. 389.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Although the Daniels court did not explicitly address the issue of whether § 53a-46a (b) authorizes a retrial of the penalty phase of a capital case before a new jury when the first jury was discharged after being deadlocked, it implicitly did so in holding that in the event of a jury deadlock, \"the trial court may, in the exercise of its discretion, grant a motion for mistrial\"; State v. Daniels, supra, 207 Conn. 394; thereby allowing for the impaneling of a second jury to retry the penalty phase, absent double jeopardy concerns. Id., 394-95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. Daniels was decided in 1988. Since then, the legislature has amended § 53a-46a on three occasions. None of the amendments, however, has addressed the court's conclusion in Daniels. See Public Acts 1993, No. 93-306, § 12 (amending subsection [h] to add as aggravating factor that defendant committed offense with assault weapon); Public Acts 1995, No. 95-19, § 1 (revising section to require, among other things, weighing of aggravating factors against mitigating factors in determining defendant's sentence); and Public Acts 2001, No. 01-151, §§ 1 and 2 (amending subsection [h] to bar imposition of death sentence for mentally retarded defendants and subsection [i] to include additional aggravating factors).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Section 3593 of title 18 of the United States Code provides in relevant part: \"(b) Hearing Before a Court or Jury.--If the attorney for the government has filed a notice as required under subsection (a) and the defendant is found guilty of or pleads guilty to an offense described in section 3591, the judge who presided at the trial or before whom the guilty plea was entered, or another judge if that judge is unavailable, shall conduct a separate sentencing hearing to determine the punishment to be imposed. The hearing shall be conducted-- \"(1) before the jury that determined the defendant's guilt; \"(2) before a jury impaneled for the purpose of the hearing if . . . \"(C) the jury that determined the defendant's guilt was discharged for good cause . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. The defendant argues that \"[t]he two statutes descended directly from Senate Bill [No.] 1401, which was originally proposed in 1973,\" and therefore should be read in a similar manner. Although it may be true that the same proposed federal bill originally served as a model for both the federal and Connecticut death penalty statutes, current differences in their respective texts are so numerous as to render the analogy unworkable in the present context.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. The state argues that the defendant was the principal, rather than an accessory, in two aggravating factors in violation of General Statutes (Rev. to 1997) § 53a-46a (i) (5), namely, the procuring of the murders of Brown and Clarke by payment of crack to Lee and money to Garner, and, therefore, the defendant's accessorial liability claims provided no impediment to the trial court presenting these aggravating factors to the jury. Because we conclude that the defendant's arguments concerning the application of accessorial liability in proving aggravating factors lack merit, we need not address the issue of whether the defendant reasonably can be held liable as a principal or an accessory in two of the four aggravating factors charged by the state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. General Statutes § 53a-8 (a) provides: \"A person, acting with the mental state required for commission of an offense, who solicits, requests, commands, importunes or intentionally aids another person to engage in conduct which constitutes an offense shall be criminally liable for such conduct and may be prosecuted and punished as if he were the principal offender.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. General Statutes (Rev. to 1997) § 53a-46a (i) provides: \"The aggravating factors to be considered shall be limited to the following: (1) The defendant committed the offense during the commission or attempted commission of, or during the immediate flight from the commission or attempted commission of, a felony and he had previously been convicted of the same felony; or (2) the defendant committed the offense after having been convicted of two or more state offenses or two or more federal offenses or of one or more state offenses and one or more federal offenses for each of which a penalty of more than one year imprisonment may be imposed, which offenses were committed on different occasions and which involved the infliction of serious bodily injury upon another person; or (3) the defendant committed the offense and in such commission knowingly created a grave risk of death to another person in addition to the victim of the offense; or (4) the defendant committed the offense in an especially heinous, cruel or depraved manner; or (5) the defendant procured the commission of the offense by payment, or promise of payment, of anything of pecuniary value; or (6) the defendant committed the offense as consideration for the receipt, or in expectation of the receipt, of anything of pecuniary value; or (7) the defendant committed the offense with an assault weapon, as defined in section 53-202a.\" We reference herein the 1997 revision of § 53a-46a (i) due to the fact that the defendant's activities in furtherance of his conspiracy to commit the murders of Brown and Clark began in 1998 and continued into January, 1999, when the murders were committed. We also note that the 1997 and 1999 revisions of the statute are identical. In 2001, subsequent to the proceedings in the present case, an eighth aggravating factor was added to § 53a-46a (i). See Public Acts 2001, No. 01-151, § 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. The eighth amendment to the United States constitution provides: \"Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\" It was made applicable to the states through the due process clause of the fourteenth amendment to the United States constitution in the case of Robinson v. California, 370 U.S. 660, 666, 82 S.Ct. 1417, 8 L.Ed. 2d 758 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. The defendant also argues that the use of accessorial liability to prove an aggravating factor violates a similar provision of our state constitution. The defendant, however, fails to provide independent analysis under the state constitution and, therefore, we confine our analysis to the issue raised under the federal constitution. See State v. Rizzo, supra, 266 Conn. 243 n.40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. General Statutes § 53a-24 (a) provides in relevant part: \"The term `offense' means any crime or violation which constitutes a breach of any law of this state or any other state, federal law or local law or ordinance of a political subdivision of this state, for which a sentence to a term of imprisonment or to a fine, or both, may be imposed, except one that defines a motor vehicle violation or is deemed to be an infraction. The term `crime' comprises felonies and misdemeanors. Every offense which is not a `crime' is a `violation'. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. General Statutes § 53-202k provides: \"Any person who commits any class A, B or C felony and in the commission of such felony uses, or is armed with and threatens the use of, or displays, or represents by his words or conduct that he possesses any firearm, as defined in section 53a-3, except an assault weapon, as defined in section 53-202a, shall be imprisoned for a term of five years, which shall not be suspended or reduced and shall be in addition and consecutive to any term of imprisonment imposed for conviction of such felony.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. General Statutes § 53a-46a (f) provides: \"If the jury or, if there is no jury, the court finds that (1) none of the factors set forth in subsection (h) exist, (2) one or more of the aggravating factors set forth in subsection (i) exist and (3) (A) no mitigating factor exists or (B) one or more mitigating factors exist but are outweighed by one or more aggravating factors set forth in subsection (i), the court shall sentence the defendant to death.\" Subsection (i) of § 53a-46a enumerates the aggravating factors to be considered. See footnote 77 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. The defendant also argues that \"[w]here the aggravating factor relies on the record or status of the killer, [namely § 53a-46a (i) (1) and (2)] the legislature clearly never envisioned that accomplice liability would apply,\" because doing so would produce \"bizarre, absurd and unworkable results.\" Because the state has not asserted that § 53a-46a (i) (1) and (2) applied to the defendant, we need not decide whether aggravating factors relying upon the record or the status of a person accused of murder may be proven through principles of accessorial liability. See State v. Coltherst, supra, 263 Conn. 502.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. See footnote 77 of this opinion for the full text of General Statutes (Rev. to 1997) § 53a-46a (i).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. The defendant further argues that, \"[t]he use of accessorial liability to prove an aggravating factor results in overly broad aggravating factors that violate the eighth amendment vagueness doctrine.\" The defendant, however, fails to brief this claim adequately and, therefore, we decline to review it. See footnote 21 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Similar to our death penalty statute, \"Arizona law . . . [then] provided for a capital sentencing proceeding, to be conducted without a jury, to determine whether the crime was sufficiently aggravated to warrant the imposition of death sentence. Ariz. Rev. Stat. Ann. § 13-454 (A) (Supp. 1973) (repealed 1978).\" Tison v. Arizona, supra, 481 U.S. 142.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Article 1257 of the Texas Penal Code Annotated (1973), prescribed the punishment for murder as follows: \"(a) Except as provided in subsection (b) of this Article, the punishment for murder shall be confinement in the penitentiary for life or for any term of years not less than two. \"(b) The punishment for murder with malice aforethought shall be death or imprisonment for life if: \"(1) the person murdered a peace officer or fireman who was acting in the lawful discharge of an official duty and who the defendant knew was a peace officer or fireman; \"(2) the person intentionally committed the murder in the course of committing or attempting to commit kidnapping, burglary, robbery, forcible rape, or arson; \"(3) the person committed the murder for remuneration or the promise of remuneration or employed another to commit the murder for remuneration or the promise of remuneration; \"(4) the person committed the murder while escaping or attempting to escape from a penal institution; \"(5) the person, while incarcerated in a penal institution, murdered another who was employed in the operation of the penal institution. \"(c) If the jury does not find beyond a reasonable doubt that the murder was committed under one of the circumstances or conditions enumerated in Subsection (b) of this Article, the defendant may be convicted of murder, with or without malice, under Subsection (a) of this Article or of any other lesser included offense.\" (Internal quotation marks omitted.) Jurek v. Texas, supra, 428 U.S. 265-66 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. Other federal and state courts have applied criteria similar to those espoused in Tison to affirm the application of accessorial liability in proving aggravating factors. See White v. Wainwright, 809 F.2d 1478, 1484 (11th Cir. 1987) (death penalty upheld even though defendant was nonshooter because defendant contemplated lethal force and actively participated in activities that culminated in victim's death); Ross v. Kemp, 756 F.2d 1483, 1489 (11th Cir. 1985) (en banc) (same); Haney v. State, 603 So. 2d 368, 386-87 (Ala. Crim. App. 1991) (concluding that application of aggravating factors justified even though defendant was not present when killing occurred because defendant fulfilled Tison factors); Ex parte Bankhead, 585 So. 2d 112, 125 (Ala. 1991) (\"heinous, atrocious or cruel\" aggravating factor upheld based on manner of killing and not on defendant's actual participation); Owens v. State, 13 S.W.3d 742, 762 (Tenn. Crim. App. 1999) (vicarious application of \"heinous, atrocious and cruel\" aggravating factor upheld because defendant was major participant in crime and evidenced reckless indifference); but see Omelus v. State, 584 So. 2d 563, 566 (Fla. 1991) (defendant who hired contract killer cannot be held vicariously responsible under \"heinous, atrocious, or cruel\" aggravating factor).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. The trial court instructed the jury that it was to consider principles of conspiratorial liability in its deliberations, stating that \"one who conspires with another is responsible as though they committed the acts in furtherance of the conspiracy where they are committed for the purpose of enhancing or facilitating the object of the conspiracy and it is done knowingly by the parties who are subject to the agreement that a crime be committed.\" The court, however, failed to instruct the jury specifically on Pinkerton liability by neglecting to charge that, in addition to the previously cited language, the jury also must find that the acts of the coconspirator were \"reasonably foreseen as a necessary or natural consequence of the [conspiracy].\" Pinker-ton v. United States, supra, 328 U.S. 648; State v. Diaz, supra, 237 Conn. 526. Although we do not conclude that a court must use this exact language to effectuate a proper Pinkerton instruction, we do conclude that the instruction must be sufficiently correct in law for the jury to understand its responsibility. See Wagner v. Clark Equipment Co., supra, 243 Conn. 185. In this case, such an instruction was absent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The majority notes two problematic statements made to the jury. \"If you continue to deliberate on this issue and at the final analysis you are not able to agree, then you report that, and in that event your deliberations would cease and by your action I would be required to impose a sentence of life without the benefit of release.\" \"I've already told you, if you cannot agree, then I will impose a sentence which is in accord with the inability of the state to satisfy the burden of proof beyond all reasonable doubt in respect to the aggravating factor and your consideration of the mitigating factor.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. General Statutes § 54-56 provides: \"All courts having jurisdiction of criminal cases shall at all times have jurisdiction and control over informations and criminal cases pending therein and may, at any time, upon motion by the defendant, dismiss any information and order such defendant discharged if, in the opinion of the court, there is not sufficient evidence or cause to justify the bringing or continuing of such information or the placing of the person accused therein on trial.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Practice Book § 42-40 provides in relevant part: \"After the close of the prosecution's case in chief or at the close of all the evidence, upon motion of the defendant or upon its own motion, the judicial authority shall order the entry of a judgment of acquittal as to any principal offense charged and as to any lesser included offense for which the evidence would not reasonably permit a finding of guilty. Such judgment of acquittal shall not apply to any lesser included offense for which the evidence would reasonably permit a finding of guilty.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Of the six Connecticut Supreme Court cases that have mentioned Caldwell, all are cases in which the defendant has been sentenced to death. State v. Ross, 269 Conn. 213, 344 n.79, 849 A.2d 648 (2004); State v. Rizzo, 266 Conn. 171, 228, 833 A.2d 363 (2003); State v. Reynolds, 264 Conn. 1, 123, 836 A.2d 224 (2003), cert. denied, U.S. , 124 S.Ct. 1614, 158 L.Ed. 2d 254 (2004); State v. Cobb, 251 Conn. 285, 454, 743 A.2d 1 (1999), cert. denied, 531 U.S. 841, 121 S.Ct. 106, 148 L.Ed. 2d 64 (2000); State v. Breton, 235 Conn. 206, 245, 663 A.2d 1026 (1995); State v. Ross, 230 Conn. 183, 230, 646 A.2d 1318 (1994), cert. denied, 513 U.S. 1165, 115 S.Ct. 1133, 130 L.Ed. 2d 1095 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The United States Supreme Court stated that \"there are specific reasons to fear substantial unreliability as well as bias in favor of death sentences when there are state-induced suggestions that the sentencing jury may shift its sense of responsibility to an appellate court.\" Caldwell v. Mississippi, supra, 472 U.S. 330. The court gave four reasons for its concerns. First, it noted that \"[b]ias against the defendant clearly stems from the institutional limits on what an appellate court can do . . . .\" Id. Second, prosecutorial argument of this nature \"presents an intolerable danger of bias toward a death sentence\" because a jury, even if it is not convinced that the defendant actually deserves death, may wish to \"send a message\" of disapproval of the defendant's acts and may feel free to do so with the prosecutor's assurance that any error will be corrected on appeal. Id., 331. Third, a jury seeking to delegate responsibility for sentencing may return a sentence of death if it assumes, on the basis of argument, that only a death sentence is reviewable. Id., 332. Finally, such comments create \"an intolerable danger that the jury will in fact choose to minimize the importance of its role,\" especially in light of a jury's tendency to believe that an appellate court may be more well suited to make the decision. Id., 333.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The majority relies on State v. Sawyer, 227 Conn. 566, 579, 630 A.2d 1064 (1993), for the novel proposition that \" `[t]he state . . . has a substantial interest, namely, its interest in securing a [determination of the imposition of the death penalty]' through the jury's thoughtful deliberation to a unanimous verdict.\" This court stated in Sawyer: \"The state also has a substantial interest, namely, its interest in securing a conviction on the most serious charge that the evidence will reasonably support.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The court apparently did not find that the jury was deadlocked. The court stated: \"I don't find the jury hung in your language. I find that they intelligently answered the question posed to them [on the revised verdict form] that they were unanimous in their ability to determine that they unanimously agreed they could not agree on the proof of the mitigating factor. . . . So I believe the case is over from that point of view . . . . [The jury] did their job, their sworn duty to determine whether or not the state has met its burden, and they found that they could not do that. That's not hung; that's a determination by the numbers allowed that the overwhelming evidence of the mitigating factor did not fail to rise to a level in the minds of one or more that outweighed the aggravating factor.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The court stated: \"[T]he court finds that the state failed to sustain its burden of proof.\"\u003c/span\u003e\n\n",
    "body_length": 261842,
    "citedas": [
      "857 A.2d 808",
      "271 Conn. 338"
    ],
    "attorneys": "Harry Weller, supervisory assistant state's attorney, with whom were Jonathan C. Benedict, state's attorney, and, on the brief, Joseph Corradino and Susann Gill Riley, senior assistant state's attorneys, for the appellant-appellee (state). Mark Rademacher, assistant public defender, for the appellee-appellant (defendant).",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Sullivan, C. J., and Borden, Norcott, Katz, Palmer, Vertefeuille and Zarella, Js.",
    "citation_count": 96
  }
}
