{
  "id": "f5A_QmYBTlTomsSBm1qI",
  "document": {
    "title": "HATCO CORP. v. W.R. GRACE \u0026 CO.",
    "full_title": "HATCO CORPORATION, Plaintiff, v. W.R. GRACE \u0026 CO. - CONN., Defendant and Third Party Plaintiff, v. ALLSTATE INSURANCE COMPANY (as Successor to NORTHBROOK EXCESS AND SURPLUS INSURANCE COMPANY), AMERICAN EMPLOYERS' INSURANCE COMPANY; CERTAIN UNDERWRITERS AT LLOYD'S, LONDON AND THE LONDON MARKET COMPANIES; COMMERCIAL UNION INSURANCE COMPANY; CONTINENTAL CASUALTY COMPANY; UNIGARD SECURITY INSURANCE COMPANY, Third-Party Defendants.",
    "jurisdiction": "D. New Jersey",
    "date": "1992-08-31T00:00:00.000Z",
    "docket": "89-1031",
    "body": "WOLIN, District Judge\n\nIn an Opinion dated July 27, 1992, published at F.Supp. , the Court addressed a number of motions between a predecessor-in-title and successor-in-title to an industrial site located in Fords, New Jersey at which substantial polluting activities have occurred for more than three decades. This Opinion addresses a different aspect of environmental cleanup litigation: the battle between an insured and its insurers for coverage to pay for the costs of remediating the contaminated site.\n\nInsurance is a vital component of our society, through which individuals, corporations and other entities help assure their future economic stability in the face of unexpected liabilities. As the regulatory tide has turned sharply against waste disposal practices once commonly engaged in, insureds have called in increasing numbers on their insurers to pay for staggering liabilities being retroactively imposed on them pursuant to state and federal environmental laws. These liabilities were in large part unforeseen and unpredicted by either insurers or insureds. Unlike the relationship that typically exists between jointly liable parties under environmental laws, however, the relationship between insureds and their insurers was voluntarily entered into, and is governed by contract. Thus, whatever policy considerations might be implicated by the tremendous impact of environmental cleanup liabilities, in the face of legal insurance contracts, the allocation of risks between insureds and insurers for liabilities imposed by the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (\"CERCLA\") as amended, 42 U.S.C. ยง 9601 et seq., requires that the Court do no more than apply contract law principles to determine the parties' rights.\n\nBefore the Court are a number of motions for summary judgment filed by both defendant/third-party plaintiff W.R. Grace \u0026 Co.-Conn. (\"Grace\") and the third-party defendant insurance companies (the \"Insurers\").\n\nBACKGROUND\n\nBetween 1959 and 1978, Grace operated an industrial chemical manufacturing facility in Fords, New Jersey known as the Hatco Chemical Division. The operation was purchased by Grace as an ongoing business that specialized in the production of lubricants, plasticisers and other chemicals for use in manufacturing applications. As by-products of these manufacturing operations, the Hatco facility emitted a wide variety of primarily organic chemical compounds, including various esters, phthalates and alcohols. Early in Grace's ownership of the plant, effluent containing these chemicals was pumped directly into streams and ditches that drained directly into the Passaic River.\n\nThe waste streams from the manufacturing operations contained large amounts of product that, if re-captured, could be reprocessed and sold. At some point in the early to mid 1960s, Grace constructed unlined ponds that were intended to hold the effluent so that the useful product could be recovered. Later, under pressure from state and local regulatory agencies to curtail the flow of toxic waste directly into the surface waters of the State, Grace constructed clay-lined lagoons and a sewer trunk line that tied into a regional sewerage authority's lines, so that its effluent could be treated. In addition to surface water pollution, government agencies took enforcement measures to abate air pollution caused by the evaporation into the air of the organic waste effluent that was held in the ponds and lagoons.\n\nDiscovery in this case has also revealed that the ponds were used to dump other chemicals that had been used in the manufacturing process. Heat transfer fluids containing polychlorinated biphenyls (\"PCBs\"), used in high-temperature reaction processes, were dumped by employees of Grace from 55 gallon drums directly into the ponds. The phthalic anhydride production facility produced naphthalene effluent as a waste product that was pumped directly onto the soil. Thick tarry residues left in the reaction vessels after distillation of phthalic anhydrides, called \"bottoms\", were removed from the vessels and dumped in a pile directly on the ground next to the phthalic anhydride plant.\n\nGrace sold the Hatco facility a predecessor corporation of the plaintiff in this action, the Hatco Corporation (\"Hatco\"). Hatco filed the primary action in this case against Grace in 1989. It seeks indemnification and contribution under CERCLA and contract for all sums expended to remove hazardous substances disposed of on-site and to remediate lands damaged by the disposals. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" Grace in turn has sued its primary and excess insurers for indemnification, because it claims that all of the damages for which it may be found liable to Hatco fall within the meaning of \"occurrences\" under the primary and excess comprehensive general liability policies, and are therefore covered by the policies.\n\nThe insurance policies implicated by Grace's third party complaint include those in effect both during and after the years it owned the Hatco facility. Many issues have been raised by the parties as to the meaning of numerous provisions in the policies related to the scope of coverage, exclusions from coverage and other issues. The relevant details of the policies will be addressed in the context of the discussion of each motion.\n\nDISCUSSION\n\nI. Standard for Summary Judgment\n\nSummary judgment shall be granted if \"the pleadings, depositions, answers to interrogatories, and admissions on file, together with the affidavits, if any, show that there is no genuine issue as to any material fact and that the moving party is entitled to a judgment as a matter of law.\" Fed. R. Civ. P. 56(c); see Hersh v. Allen Products Co., 789 F.2d 230, 232 (3d Cir. 1986). In making this determination, a court must draw all reasonable inferences in favor of the non-movant. Meyer v. Riegel Products Corp., 720 F.2d 303, 307 n.2 (3d Cir. 1983), cert. dismissed, 465 U.S. 1091, 104 S. Ct. 2144 (1984). Whether a fact is \"material\" is determined by the substantive law defining the claims. Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 248, 106 S. Ct. 2505, 2510 (1986); United States v. 225 Cartons, 871 F.2d 409, 419 (3d Cir. 1989).\n\n\"At the summary judgment stage the judge's function is not himself to weigh the evidence and determine the truth of the matter but to determine whether there is a genuine issue for trial.\" Anderson, 477 U.S. at 249, 106 S. Ct. at 2511. Summary judgment must be granted if no reasonable trier of fact could find for the non-moving party. Id.\n\nII. Grace's Motion For Summary Judgment On the Issue of Trigger of Coverage\n\nGrace seeks summary judgment holding that all insurance policies in effect from the first disposal of a pollutant through the date of manifestation of any contamination afford coverage to a claim of continuous environmental contamination. Grace thereby seeks a declaration that New Jersey law follows the \"continuous trigger\" theory of insurance coverage. For the reasons that follow, the Court will grant Grace's motion in part and deny it in part.\n\nA. Maryland Casualty Policies and Excess Policies Following Form\n\nUnder primary insurance policies issued by Maryland Casualty Company (\"Maryland Casualty\") to Grace between 1961 and 1973, Maryland Casualty agreed \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\"\n\nTo pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of . . . injury to or destruction of property, including the loss of use thereof, caused by occurrence.\n\n\"Occurrence\" is defined in those policies as\n\neither an accident or a continuous or repeated exposure to conditions which result during the policy period in injury to or destruction of . . . property including the loss of use thereof which is accidentally caused and . . . tangible or physical property, including the loss of use thereof.\n\nAll damages arising out of such exposure to substantially the same general conditions shall be considered as arising out of one occurrence.\n\n\"Property damage\" is undefined in the Maryland Casualty policies covering the years 1961 to 1967. That term is defined in the Maryland Casualty policies covering the years 1967 to 1973 as \"injury to or destruction of property\". Except for London defendants policies in effect between 1959 and 1962 these terms are all incorporated, under a \"following form\" provision, into the excess insurance policies in force during the period the Maryland Casualty policies were in effect.\n\nGrace contends that, because the property damage in issue in this case consists of a continuous injury to the land on the Hatco site that began when Grace first began to dispose of hazardous substances onto that land, all policies in effect throughout the course of that continuing injury should provide coverage, under the continuous trigger theory. This theory was first adopted in the context of personal injury caused by exposure to asbestos. See Keene Corp. v. Ins. Co. of North America, 667 F.2d 1034 (D.C. Cir. 1981), cert. denied, 455 U.S. 1007 (1982).\n\nConstruing language substantially the same as that included in the Maryland Casualty policies, courts have found that all policies in effect from the first date of exposure to asbestos until the manifestation of asbestos-related disease must provide coverage. See, e.g., Keene, 667 F.2d at 1045; Lac D'Amiante Du Quebec, Ltee. v. American Home Assur. Co., 613 F. Supp. 1549 (D. N.J. 1985), later proceeding, 864 F.2d 1033 (3d Cir. 1988). These holdings have been based on the finding that \"injury\" begins at the time of first exposure to asbestos and continues thereafter. Keene, 667 F.2d at 1046; Lac D'Amiante, 613 F. Supp. at 1558-59, 1561. Thus, although Grace argues to the contrary, the continuous trigger theory, based on the plain language of the definition of occurrence, requires the insured to prove injury-in-fact during a policy period for coverage to be triggered. Sandoz, Inc. v. Employer's Liability Assur. Corp., 554 F. Supp. 257, 266 (D.N.J. 1983); See Kelly, Messick, Schoenleber \u0026 Miller Assocs. v. Atlantic Mut. Ins. Co., 218 N.J. Super. 395, 412 (App. Div. 1987) (\"negligence committed by an insured does not trigger coverage until a party is damaged by such negligence\"). Courts that have found continuous injury during multiple policy periods have concluded that, under the plain terms of the insurance policies, coverage is continuously triggered until the injury is manifested. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\"\n\nProvisions like those in the Maryland Casualty policies require that, for coverage to be provided, an accident or a continuous or repeated exposure to conditions need only \"result\" in injury during the policy period. Thus, for continuing injuries, courts have concluded that a continuous \"occurrence\" causing continuous injury triggers each policy in effect at any point during the continuing injurious process. Keene, 677 F.2d at 1046; Lac D'Amiante, 613 F. Supp. at 1558-59, 1561.\n\nFurther, despite the Insurers' contention to the contrary, the policy language does not expressly restrict coverage to only the injury that resulted during the policy period. Such a provision could have been expressly included in the policies. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Thus, courts have held that any policy triggered during the continuing injury is liable to the extent of policy limits for all damages arising from the continuing occurrence. Keene, 677 F.2d at 1050; Lac D'Amiante, 613 F. Supp. at 1562-63. The consequent result where multiple policies have been triggered is that each triggered policy has been held jointly and severally liable for the covered injuries. Id.; see also Sandoz, Inc. v. Employer's Liability Assur. Corp., 554 F. Supp. 257, 266-67 (D. N.J. 1983) (indicating that when harm is indivisible, policies should be jointly and severally liable). In sum, although an insured must prove that actual injury occurred during the policy period, coverage is not limited to only the injury that occurs during that period if the injury is part of a continuous, indivisible process.\n\nAlthough the continuous trigger theory has been rejected in other jurisdictions, see e.g., cases cited in Riehl v. Travelers Ins. Co., 772 F.2d 19, 23 (3d Cir. 1985), the only published decision of the New Jersey courts has expressly adopted that theory. The Appellate Division has undeniably declared that \"the continuous trigger theory reflects the law in New Jersey.\" Gottlieb v. Newark Ins. Co., 238 N.J. Super. 531, 537 (App. Div. 1990). This Court has not been persuaded by the Insurers that Gottlieb is an inaccurate reflection of New Jersey law.\n\nMoreover, although Gottlieb did not address the issue of joint and several liability, the Court finds Lac D'Amiante persuasive, and agrees that the New Jersey Supreme Court would interpret the policy language to find that a policy triggered by a continuing occurrence under the policy terms in the Maryland Casualty policies would be jointly and severally liable to policy limits for all damages resulting from that occurrence, including damage that occurred before and after the policy period, subject to contribution from other insurers. The rationale for adopting joint and several liability is twofold.\n\nFirst, the language of the policies themselves do not limit coverage to injury that occurs during the policy period. Lac D'Amiante, 613 F. Supp. at 1562. Thus, as a matter of contract interpretation, overlapping coverage, in effect, had been bargained for. Second, because the Insurers agreed to \"pay all sums which the insured shall become legally obligated to pay as damages\", they in effect step into the shoes of the insured. Here, regardless of when Grace disposed of hazardous substances on the Fords site, under tort law principles and CERCLA it will be jointly and severally liable for the full extent of damage sustained by Hatco during any period of time if the harm sustained was indivisible. ACandS, Inc. v. Aetna Cas. and Sur. Co., 764 F.2d 968, 974 (3d Cir. 1985); Lac D'Amiante, 613 F. Supp. at 1562. Thus, provided Grace bears its burden to establish that injury was continuous and is indivisible, all triggered Maryland Casualty policies and the excess policies following form to the Maryland Casualty policies are jointly and severally liable for all continuous harm. Conversely, because joint and several liability arised only when the injury sustained is indivisible and continuous, Lac D'Amiante, 613 F. Supp. at 1562; Sandoz, Inc., 554 F. Supp. at 266-67, to the extent the Insurers can rebut any showing by Grace that the injury at issue in this case is indivisible, apportionment of liability will be allowed. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\"\n\nB. The Continental Casualty Policies and Excess Policies Following Form\n\nBetween the years 1973 and 1985, Grace's primary insurance was provided by Continental Casualty Company (\"Continental\"). Under the Continental policies, the insurer agreed to\n\npay on behalf of the Insured all sums which the Insured shall become legally obligated to pay as damages including liability assumed under contract because of . . . Property Damage . . . to which this insurance applies, caused by an occurrence. . . .\n\n\"Occurrence\" is defined in the Continental policies as\n\neither an accident, event or continuous or repeated exposure to conditions which unintentionally causes injury to or destruction of property.\n\n\"Property Damage\" is defined as\n\nInjury or destruction of property which occurs during the policy period including the loss of use thereof at any time resulting therefrom. . . .\n\nThe analysis employed with respect to the Maryland Casualty policies applies equally to the Continental policies with respect to the trigger of coverage. Thus, to the extent Grace can prove that a continuing occurrence caused injury during a policy period, coverage will be triggered.\n\nSimilarly, like the Maryland Casualty policies, the Continental policies do not limit liability to only that damage proved to have occurred during the policy period. The policies state that Continental will pay Grace for all sums for which Grace becomes legally obligated to pay because of accidental property damage that occurs during the policy period. Under CERCLA's strict liability regime, Grace could be held liable to pay for all damage at the Hatco site even if its contribution to the site conditions consisted solely of damage caused during a single year. Because the policy language places Continental in Grace's shoes, it may be required to provide coverage for damage that occurred outside of the policy period, provided that Grace's liability for that damage resulted from damage that occurred during the policy period. Consequently, the joint and several liability applied to the Maryland Casualty policies for all damage sustained as a result of a continuing occurrence extending over more than one policy period applies to the Continental policies as well.\n\nC. Analysis\n\nGrace contends that coverage is triggered from the date of first disposal through the date of manifestation of injury. It has failed, however, to establish as an undisputed fact, for purposes of summary judgment, that \"injury\" occurred within the meaning of the policy language at the time of first disposal. Nor has it established beyond dispute the date of the first disposal. Further, it has not established as undisputed fact that injury was a continuous process, is indivisible, and occurred during any given year.\n\nThe Court has been presented with no evidence that suggests that the disposals of chemical waste by Grace have resulted in continuous, indivisible injury to the Fords site. It is possible that only some portions of the property damage will meet these requirements. Thus, while it may appear that seepage and migration of chemicals into and under the ground will have been a continuous injurious process, that does not necessarily mean that surface contamination cannot be separated from the subsurface contamination, and allocated to specific policy periods for purposes of coverage. These and many other questions have not been briefed or otherwise addressed by the parties, and must await trial for resolution.\n\nIn its Reply Memorandum, Grace asserts that it seeks only a declaration as to the legal question of when coverage is triggered under the policies in issue, and that it does not seek to have the Court apply that standard to determine whether coverage actually was triggered for any particular policy. Reply Memorandum at 32-33. In view of the factual vacuum that exists, the Court can do no more than declare the general principles that will determine whether coverage has been triggered under the insurance contracts and related excess insurance contracts. The Appellate Division aptly noted in Gottlieb that the issue of when coverage has been triggered is \"fact sensitive and not properly the subject of an absolute rule.\" 238 N.J. Super. at 537.\n\nAccordingly, to the extent Grace can prove that: (1) injury or destruction to property commenced during a covered policy period, and (2) the injury or damage was continuous and indivisible through some date not later than the manifestation of the injury, \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" coverage would be \"triggered\" as to each policy in effect during that span of time. Further, provided that coverage is actually afforded by a policy and is not in any way precluded or excluded by the terms or conditions of the policy or by operation of law, that policy will be jointly and severally liable to the extent of policy limits for all damages that resulted from the entire continuing indivisible occurrence. To that extent, Grace's motion will be granted.\n\nIII. Cross-Motions for Summary Judgment On The Pollution Exclusion Provisions of Various Insurance Policies\n\nThe Insurers have moved for summary judgment in their favor holding that all excess umbrella insurance policies in effect from June 30, 1971 do not provide coverage for gradual pollution. Grace has cross-moved for summary judgment in its favor that all post-June 30, 1971 excess umbrella insurance policies provide coverage for gradual pollution provided that such pollution was unexpected and unintended.\n\nBy separate motion, Grace seeks a declaration that three excess insurance policies issued by American Employers' Insurance Company (\" Employers'\") that covered the period between October 20, 1962 and June 30, 1971, and one excess insurance policy issued by Employers' Commercial Union Insurance Company (\"Commercial Union\") that covered the period between June 30, 1971 and June 30, 1974, all provide coverage for gradual pollution.\n\nThe underwriters at Lloyd's of London and the London Market Companies (collectively, \"the London defendants\") also move separately for summary judgment as to the effect of the pollution exclusions in policies issued by them between 1959 and 1962.\n\nFor the reasons set forth below, the Court will grant the Insurers' motion in part and deny it in part, grant Grace's motions in part and deny them in part, and deny the London defendants' motion.\n\nThe subject of the cross-motions are all of the excess comprehensive general liability insurance policies at issue in this case that were in force between June 30, 1971 and June 1985. All post-1971 excess policies contained what are referred to as \"pollution exclusions\". There are two different exclusions contained in the various policies, which will be discussed below. Many of the excess policies also contained \"following form\" provisions that defined the extent to which their coverage followed the coverage provided in the underlying primary comprehensive general liability insurance policies. These provisions also varied from policy to policy. The underlying primary policies in effect during the period in issue all provided special policy limits for \"gradual pollution.\"\n\nThe cross-motions require a two-part analysis. First, the parties maintain contrary positions as to whether the pollution exclusion clauses exclude all coverage for gradual pollution. Second, the parties maintain contrary positions as to the effect that the following form provisions contained in many of the excess policies have on any gradual pollution coverage in the underlying primary policies.\n\nA. The Insurers' Motion On the Pollution Exclusions in the Post-1971 Policies\n\nAll of the excess insurance policies in effect from June 30, 1971 to June 30, 1985 contain some form of pollution exclusion. None of the primary insurance policies in effect between 1961 and 1976 contained pollution exclusions. The two Continental primary insurance policies in effect from June 30, 1976 to June 30, 1985 contained pollution exclusion provisions. Only two variations of pollution exclusions are involved in this case. They will be discussed individually.\n\n1. The ISO Exclusion\n\nAll policies that contain pollution exclusions, other than those issued by the London defendants, with only minor variations, use the Insurance Services Office (\"ISO\") standard form exclusion, discussed at length in New Castle County v. Hartford Accident and Indem. Co., 933 F.2d 1162, 1181, 1192-1203 (3d Cir. 1991). That provision bars coverage for:\n\nbodily injury or property damage arising out of the discharge, dispersal, release or escape of smoke, vapors, soot, fumes, acids, alkalis, toxic chemicals, liquids or gases, waste materials or other irritants, contaminants or pollutants into or upon land, the atmosphere or any watercourse or body of water; but this exclusion does not apply if such discharge, dispersal, release or escape is sudden and accidental.\n\nThe Insurers contend that the ISO exclusion bars coverage for \"gradual pollution\", and that it is undisputed that all of the pollution in issue in this case was gradual. Therefore, they seek summary judgment in their favor that none of the policies including the ISO exclusion cover the claims asserted against Grace by Hatco.\n\nThe ISO exclusion is an absolute bar to coverage for property damage caused by pollution, with a narrow exception. That exception exists when the \"discharge, dispersal, release or escape\" is \"sudden and accidental.\" The Insurers make several arguments why the Court should find gradual pollution excluded from coverage by the ISO standard pollution exclusion in this case.\n\nFirst, they argue that the pollution exclusion unambiguously bars coverage for gradual pollution. The gist of the Insurers' argument is that the exclusion's requirement that the discharge or release of pollution be \"sudden\" precludes recovery for any discharge or release that is \"gradual\". This argument is essentially the common argument that \"sudden\" necessarily has a temporal meaning, and means either \"abrupt\" or of short duration. See New Castle, 933 F.2d at 1192. That argument has been litigated throughout the country. The numerous courts that have addressed the issue, however, have split, with no clear majority view having developed. See New Castle, 933 F.2d at 1195-96 nn. 60, 61 (collecting cases). This Court need not lay out the various arguments of the opposing views, as it believes that the Third Circuit Court of Appeals' extensive analysis under Delaware law in New Castle is highly persuasive and would be adopted without reservation by the New Jersey Supreme Court were it to reach the issue. The conclusion of the Third Circuit, that the term \"sudden\" is ambiguous, and that the phrase \"sudden and accidental\" should therefore be construed to mean \"unexpected and unintended\", New Castle, 933 F.2d at 1198-99, is essentially the same as the conclusion reached by the Appellate Division in Broadwell Realty Servs., Inc. v. Fidelity \u0026 Cas. Co., 218 N.J. Super. 516, 536 (App. Div. 1987) (\"We thus construe the word 'sudden' as meaning unexpected and unintended\").\n\nThe Insurers next argue that decisions finding ambiguity in the term \"sudden\" relied on the doctrine of contra proferentem, which they argue is inapplicable to the contracts in issue in this case. This argument fails because the Insurers misconstrue the doctrine of contra proferentem. Contra proferentum is a general doctrine under which ambiguous language in a contract is construed against its drafter. In re Estate of Miller, 90 N.J. 210, 221 (1982); see also In re Community Medical Center, 623 F.2d 864, 866 (3d Cir. 1980). It means literally \"Against the party who proffers\". See Black's Law Dictionary 327 (6th ed. 1990). The Insurers narrowly conceive of the doctrine as one of interpretation of insurance contracts against the insurer, and contend that it has no application when the parties to an insurance contract are equally sophisticated. This view has been rejected by the New Jersey Appellate Division:\n\nprinciples [of interpretation] are no less applicable merely because the insured is itself a corporate giant. The critical fact remains that the ambiguity was caused by language selected by the insurer.\n\nCPS Chemical Co. v. Continental Ins. Co., 222 N.J. Super 175, 189-90 (App. Div. 1988).\n\nThe ISO pollution exclusion included in the excess policies was indisputably drafted by committees of insurance representatives. New Castle, 933 F.2d at 1181. No evidence has been submitted to the Court that indicates the pollution exclusion was inserted in the insurance policies at Grace's urging. To the contrary, all evidence proffered indicates that the ISO pollution exclusion was inserted at the insistence of the Insurers. Thus, the doctrine of contra proferentum applies to construction of the pollution exclusion, and dictates that it be construed against the Insurers.\n\nThe Insurers' last argue that extrinsic evidence indisputably establishes that \"Grace, which had specific gradual coverage in its primary policies since 1962, clearly understood the preclusive nature of the pollution exclusion added to its umbrella contracts as of 1971.\" Insurers' Memorandum at 29. This argument is based in large part on the Insurers' misconstruction of the gradual pollution policy limits as \"coverage\" provisions, and will be discussed below. In any event, the extrinsic evidence relied on by the Insurers is far from conclusive, and establishes little more than that several individuals associated with Grace may have misunderstood after the fact the coverage that Grace had procured.\n\nBecause the Insurers have failed to establish that the ISO pollution exclusion bars coverage for gradual pollution as a matter of law, their motion for summary judgment will be denied.\n\n2. The London Exclusion\n\nThe London defendants contend that the pollution exclusion included in their post-1971 policies is fundamentally different from the ISO exclusion, and unambiguously bars coverage for the pollution in issue in this case. That provision states:\n\nThis Insurance does not cover any liability for:\n\n(1) . . . loss of, damage to or loss of use of property directly or indirectly caused by seepage, pollution or contamination, provided always that this paragraph (1) shall not apply to liability for . . . loss of or physical damage to or destruction of tangible property, or loss of use of such property damaged or destroyed, where such seepage, pollution or contamination is caused by a sudden, unintended and unexpected happening during the period of this Insurance.\n\n(2) The cost of removing, nullifying or cleaning-up seeping, polluting or contaminating substances unless the seepage, pollution or contamination is caused by a sudden, unintended and unexpected happening during the period of this Insurance.\n\n(3) Fines, penalties, punitive or exemplary damages.\n\nThis Clause shall not extend this Insurance to cover any liability which would not have been covered under this Insurance had this Clause not been attached.\n\nThe central argument of the London defendants is that use of the phrase \"sudden, unintended and unexpected\" instead of the \"sudden and accidental\" phrase included in the ISO exclusion, removes the ambiguity of the term \"sudden\", and makes clear that it connotes abruptness, thereby precluding coverage for \"gradual\" pollution. They argue that if \"sudden, unintended and unexpected\" is construed no differently than \"sudden and accidental\", then the term \"sudden\" would be given a redundant meaning, and would thereby be read out of the contract.\n\nThis argument, though possessing facial appeal, must be rejected. The word \"sudden\" has connotations of both the unexpected and unintended. See The Compact Edition of the Oxford English Dictionary 3139 (1980) (defining \"sudden\" as \"happening or coming without warning or premonition\" and \"unpremeditated, done without forethought\"). So too does the word \"accidental\". Id. at 14 (defining \"accidental\" as \"happening by chance, undesignedly or unexpectedly\"). Thus, to a great extent, the terms \"sudden\" and \"accidental\" in the ISO exclusion are redundant. New Castle, 933 F.2d at 1194. The Court cannot conclude that the mere replacement of \"accidental\" with the phrase \"unexpected and unintended\" conclusively demonstrates that the term \"sudden\" has some definite other meaning. Although that may be a plausible construction of the phrase, it is still ambiguous, because it is equally plausible that the phrase was meant as a string of terms of similar meaning, a practice routinely engaged in by drafters of insurance contracts. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nBecause the phrase \"sudden, unexpected and unintended\" is no less ambiguous than \"sudden and accidental\", it must be construed against its drafter, the London defendants. Accordingly, the phrase \"sudden, unintended and unexpected\" will be given no different meaning than the phrase \"sudden and accidental\". That definition does not absolutely preclude coverage for any and all gradual pollution. The only other court to have construed in a reported decision the London defendants' exclusion reached the same conclusion. See Time Oil Co. v. CIGNA Property \u0026 Cas. Ins. Co., 743 F. Supp. 1400, 1407-08 (W.D. Wash. 1990). Therefore, the London defendants' motion for summary judgment will be denied.\n\nB. Grace's Cross-Motion On the Pollution Exclusions in the Post-1971 Policies\n\nBy cross-motion, Grace seeks a declaration that the pollution exclusions in all of the excess insurance policies bar coverage only when the policyholder expected and intended the injury caused by the release of pollutants. Its argument is based primarily on dicta in Broadwell Realty Servs., Inc. v. Fidelity \u0026 Cas. Co., 218 N.J. Super. 516 (App. Div. 1987), and will be rejected.\n\nThe policies in issue provide coverage for damage that results from \"occurrences. \" Occurrence\" is an insurance industry term with well-defined meaning. Several variations of the definition are involved in this case. The Maryland Casualty primary policies define occurrence to mean:\n\neither an accident, event or continuous or repeated exposure to conditions which result during the policy period in injury to or destruction of . . . property . . . which is accidentally caused.\n\nThe Continental primary policies define occurrence as:\n\neither an accident, event or continuous or repeated exposure to conditions which unintentionally causes injury to or destruction of property.\n\nAnother variation in some of the excess insurance policies defines occurrence as:\n\n(A) an accident, or a happening (B) an event, or continuous or repeated exposure to conditions, which unexpectedly results in . . . property damage . . . during the policy period.\n\nThese definitions unambiguously convey that damage which is expected, intended or not accidental is not covered by the policies in which they are included.\n\nBy contrast, the pollution exclusion clearly and unambiguously places the focus of the policyholder's expectation or intention not on the resulting \"damage\", but on the \"discharge, dispersal, release or escape\" of the pollutants. Thus, as the Third Circuit recently stated in New Castle County v. Hartford Accident \u0026 Indemnity Co., F.2d , , No. 91-3857 (3d Cir. July 28, 1992) (\"New Castle II\"):\n\nThe occurrence clause provides coverage when the damage was unexpected and unintended, though caused by an intentional act, whereas the pollution exclusion clause excludes coverage except when the discharge was unexpected and unintended. So an insured can point to unexpected and unintended damage as a result of a deliberate act of discharge, and therefore have an occurrence, yet still be excluded from coverage because the discharge was expected and intended.\n\nSlip Op. at 6. Hence, appellate courts that have specifically focused on this issue have rejected the argument put forth by Grace. See Liberty Mutual Ins. Co. v. Triangle Indus., Inc., 957 F.2d 1153, 1156-58 (4th Cir. 1992) (construing New Jersey law), petition for cert. filed, (U.S. June 1, 1992) (No. 91-1945); New Castle, 933 F.2d at 1199-1203 (construing Delaware law); cases collected at id. at 1200-01 n.68.\n\nBroadwell was a suit over insurance coverage for costs expended to clean up gasoline that had gradually leaked out of an underground storage tank. Id. at 519. At issue was whether gradual leakage of gasoline fell within the meaning of \"sudden and accidental\" in the pollution exclusion. The insurers argued that \"sudden\" meant \"abrupt\" and instantaneous, and maintained that the gradual leakage was therefore excluded from coverage. Id. at 530. The Appellate Division construed the word \"sudden\" in the \"sudden and accidental\" phrase of the ISO pollution exclusion to mean \"unexpected and unintended,\" and held that coverage was not automatically barred because the leakage was gradual. Id. at 536.\n\nThe sole issue before the Broadwell court pertaining to the pollution exclusion was whether the term \"sudden\" in that provision meant abrupt and short in duration. Nothing in the facts of the case as set forth by the Appellate Division indicated that there was an issue as to whether the owner of the gasoline storage tank expected or intended the gasoline to leak out of the tank, or expected or intended the resulting harm to occur. Thus, the court was not required to determine whether the \"sudden and accidental\" phrase in the pollution exclusion referred to the release of the gasoline or to the resulting harm. In dicta, however, the court noted and agreed with an earlier Law Division decision, Jackson Tp. Municipal Utilities Authority v. Hartford Acc. \u0026 Indem. Co., 186 N.J. Super. 156, 164 (Law Div. 1982), which held that the pollution exclusion was \"simply a restatement of the definition of 'occurrence' -- that is, that the policy will cover claims where the injury was 'neither expected nor intended.'\" Broadwell, 218 N.J. Super. at 534. Grace seizes on this language to support its position that damage must be intended, and not merely the act of releasing or dispersing the pollutant.\n\nThe dicta in Broadwell relied on by Grace ignores the plain language of the pollution exclusion. As is often true of dicta, because the issue was not squarely before the Appellate Division, it may not have thought through and articulated a rule of law as carefully as it otherwise would have. This is evidenced by the Appellate Division's somewhat inconsistent treatment of the issue in the next paragraph of Broadwell. There, the court stated that \"where . . . the dispersal of pollutants is both accidental and unforeseen, . . . the 'sudden and accidental' exception to the [pollution] exclusion is applicable. . . .\" Id. at 535 (emphasis added). This statement, unlike the statement from Broadwell relied on by Grace, properly focuses the intent inquiry on the act of releasing the pollutants, and not the resulting harm. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nThis Court predicts, as did the Fourth Circuit Court of Appeals in its recent Liberty Mutual opinion, that the New Jersey Supreme Court would reject the rule stated in dicta in Broadwell, relied on by Grace, and instead hold that the pollution exclusion bars coverage when the \"discharge, release, dispersal or escape\" was expected and intended, and not only when the resulting damage was expected and intended.\n\nFurther, the Court predicts that the New Jersey Supreme Court would not find it necessary for an insured to be aware of the harmful nature of the pollutants when they were discharged or released. Requiring such knowledge would eviscerate the plain language of the exclusion, by bringing into it an element of knowledge of potential to cause harm. This would be at odds with the exclusion's plain language. The ISO exclusion was one step removed from the absolute pollution exclusion that in 1985 became standard policy language in the form CGL policy. See N. Ballard and P. Manus, Clearing Muddy Waters: Anatomy of the Comprehensive General Liability Pollution Exclusion, 75 Cornell L. Rev. 610, 633 (1990). The exception contained in the ISO exclusion is narrow, and designed to insure only against releases of pollutants unintended by the insured. It was not designed to protect insureds against the future consequences of routine business practices involving the releases of chemicals and other contaminants into the environment. Thus, \"knowledge of the nature of the substance discharged is irrelevant.\" New Castle II, F.2d at , Slip Op. at 14. Consequently, to the extent Grace's dumping or pouring of chemicals onto the ground at the Hatco facility was expected and intended, and \"performed as part of a regular business activity\", Liberty Mutual, 957 F.2d at 1158, coverage will be barred by the pollution exclusions contained in the policies issued to Grace. Grace's cross-motion for summary judgment holding that all unexpected and unintended damage is not barred from coverage by the pollution exclusion will therefore be denied.\n\nWhether releases or discharges were expected and intended may or may not involve fact-sensitive issues. The routine permanent disposal of chemicals, such as phthalate anhydride distillation bottoms and naphthalene residues, directly onto the land at the Hatco site as a sort of chemical waste landfill, for example, leaves essentially no room for Grace to argue that the discharge was unexpected and unintended. Whether Grace expected and intended all of the consequences of its acts, such as seepage of the distillation bottom chemicals into the ground, is irrelevant. It need only have intended the disposal.\n\nBy contrast, Grace's temporary storage of effluent and solids in lined and unlined ponds, ditches and muck storage areas before pumping it offsite, either into the sewer system or otherwise, does not admit of as simple an analysis. As to surface residues that must be removed from lined or unlined areas, there is little or no room for Grace to argue that the discharges were unexpected and unintended. Grace knew or should have known that residues would remain, and cannot argue that they were unexpected or unintended.\n\nWhether Grace expected and intended the effluent and solids to escape into the ground, however, poses factual issues that may be dependent on a number of factors. Those factors include the adequacy of any lining to prevent subsurface seepage, and Grace's knowledge, constructive or actual, of the possibility of seepage from either lined or unlined areas into the ground. Evidence in the record indicates that Grace may have known as early as the mid-1960s that chemicals were seeping into the ground and groundwater at the site. See (JA 80-82). Due to the undeveloped state of the record on this motion, none of these issues can be definitively resolved at this stage in the litigation.\n\nC. Cross-Motions on the Effect of the Excess Pollution Exclusions on Gradual Pollution Coverage in the Primary Policies\n\n1. Gradual Pollution: \"Coverage\" or \"Policy Limit\"?\n\nAll of the primary policies in issue contain provisions that have been described by the parties as \"gradual pollution\" coverage provisions. The gradual pollution provisions in the primary policies, however, are not \"coverage\" provisions, but rather limitations of liability. The provisions are essentially identical, except that different dollar amounts were provided in different years. A typical provision states:\n\nIt is . . . understood and agreed that the [insurer]'s limits of liability notwithstanding the limit of liability stated on the declarations page are:\n\n* * * *\n\n(2) Under coverage D [property damage] - $ 100,000 aggregate for injury to or destruction of property arising from gradual pollution or continuous discharge, leakage, or overflow of smoke, fumes, waste or other materials.\n\nHence, despite the parties' characterizations of the \"gradual pollution\" provisions, they clearly do not provide some additional form of \"coverage\". To the contrary, the gradual pollution provisions merely set lower policy coverage limits for property damage resulting from gradual pollution than is provided under the general policy limits for property damage. As the Third Circuit Court of Appeals recognized in New Castle, standard occurrence-based insurance policies such as those in issue here already \"covered property damage resulting from gradual pollution,\" provided that the resulting damage was unintended. 933 F.2d at 1197. Thus, rather than acting as an expansion of coverage, the gradual pollution provision contained in a policy without a pollution exclusion can only be construed as a limitation of coverage.\n\nThis interpretation of the gradual pollution provision presents arguable difficulty only with respect to those primary policies that included both a gradual pollution provision and a pollution exclusion. Two such policies were issued by Continental and were effective between June 30, 1976 and June 30, 1984. It is only in these policies that the gradual pollution provision can be construed to provide additional coverage.\n\nThe first policy, No. CCP 2483440, contained both a $ 200,000 limitation of liability for gradual pollution, amended to $ 500,000 as of June 30, 1978, and an ISO pollution exclusion provision, with no policy language that reconciles the two provisions. Two possible interpretations can be made.\n\nFirst, the gradual pollution provision can be read to place a cap on liability for gradual pollution damage that falls within the exception to the pollution exclusion. In other words, gradual pollution, the release of which was unexpected and unintended would be covered, but only up to the limit stated in the gradual pollution provision.\n\nSecond, an equally plausible construction is that damage from gradual pollution was covered under the ordinary definition of occurrence to the extent of the $ 200,000 or $ 500,000 special gradual pollution policy limit, and was thereafter covered only if it fell within the exception to the pollution exclusion. That is, the policy would provide $ 200,000 or $ 500,000 of coverage for unintended damage from gradual pollution even though the release of the pollutants was intended, but above that limit would cover only gradual releases of pollutants that were unintended and unexpected.\n\nAlthough two interpretations are possible, the Court finds that the only reasonable interpretation of this policy is the second one described above. This interpretation is borne out by reconciling language in the second policy that also included both a pollution exclusion and a gradual pollution sublimit.\n\nThat second policy, an amended No. CCP 2483440, became effective June 30, 1983, and states that it would remain effective until canceled. Until June 30, 1984, this policy provided $ 500,000 coverage for gradual pollution. In expressly reconciling the apparent incompatibility of the gradual pollution coverage and the pollution exclusion, the gradual pollution provision in this second policy states:\n\nIt is agreed that such coverage as is afforded by this policy applies to personal injury and property damage arising out of the gradual discharge, dispersal, release or escape of smoke, vapors, soot, fumes, acids, alkalis, toxic chemicals, liquids or gases, waste materials or other irritants, contaminants or pollutants into or upon land, the atmosphere or on watercourse or body of water.\n\nExclusion (F) [the ISO pollution exclusion] is amended accordingly.\n\nThe limits of liability for coverage afforded by this endorsement is $ 500,000. per loss, and $ 500,000. aggregate.\n\nThis provision unambiguously provides that the pollution exclusion bars coverage only for unintended pollution damages caused by intended gradual releases of pollutants in excess of the gradual pollution coverage sublimit. Hence, any uncertainty in construing the gradual pollution limits together with the pollution exclusion in the first Continental policy is made clear by the parties' later clarification of their earlier intent.\n\n2. The Effect of the Following Form Provisions On Excess Pollution Exclusions\n\nThe parties maintain contrary positions as to the extent to which the \"following form\" provisions in the excess policies incorporate terms from the underlying policies that have the effect of nullifying pollution exclusions in the excess policies issued after 1971. The first policy in question was issued by Commercial Union as Policy #EY-8220-005, and covered the period between June 30, 1971 and June 30, 1974. The \"following form\" provision in that policy provides:\n\nIt is agreed that such coverage as is afforded by this policy shall apply to occurrences covered by the terms and conditions of Maryland Casualty Company Policy #31R-911051 or by the terms and conditions of this policy except that the definition of Property Damage as contained in this policy shall apply.\n\nThe pollution exclusion in the excess policy was a standard ISO form.\n\nGrace asserts that the following form provision in the excess policy effectively incorporates any coverage for gradual pollution provided by the underlying policy into the Employers excess policy, and thereby nullifies the pollution exclusion. The insurers maintain a contrary position.\n\nThe language of the following form provision in this policy is ambiguous, in that it is susceptible to two reasonable interpretations. That provision, unlike provisions contained in other excess policies in this case, does not explicitly provide that any of its terms inconsistent with the terms of the underlying insurance shall have no effect. The Insurers contend that the provision plainly and unambiguously limits liability to \"such coverage as is afforded by the policy.\" Thus, they contend that coverage under the excess policy for occurrences covered by the Maryland Casualty policy is afforded only to the extent that it is consistent with the terms and conditions of the excess policy. Conversely, they contend that to the extent coverage is excluded under the Commercial Union excess policy, occurrences for which coverage is provided within the meaning of the Maryland Casualty policy are not covered. Thus, they argue that coverage for gradual pollution under the Commercial Union policy is limited to that which may fall within the exception to the pollution exclusion for \"sudden and accidental\" pollution.\n\nGrace maintains that the phrase \"such coverage as is afforded by the policy\" in the following form provision refers only to the dollar amount thresholds to trigger excess coverage and the maximum policy limits, and that the following form provision otherwise incorporates all of the terms and conditions of the underlying policies. That this was intended as evidenced, Grace contends, by the express exception for the definition of \"property damage\" in the following form provision.\n\nBoth interpretations of the following form provision are reasonable, given its lack of clarity. Because Commercial Union has not even suggested that the provision was drafted by Grace, it must be construed against Employers'. Therefore, the interpretation favoring Grace -- that the excess policy should be amended to delete the pollution exclusion to the extent it is inconsistent with the coverage provided by the primary policy -- must be adopted. Hence, to the extent the pollution exclusion in the Commercial Union policy is in conflict with the coverage otherwise provided by the underlying policy, under the following form provision, it clearly must give way.\n\nThe second policy in question was issued by Unigard Security Insurance Company (\"Unigard\") as policy No. 1-2517 and was in effect during the period between June 30, 1974 and June 30, 1975. The policy underlying the Unigard policy was written by Continental. That policy included a policy limit of $ 200,000 for destruction of property caused by gradual pollution, and did not include a pollution exclusion except as to one subsidiary of Grace, Teal Petroleum, which is not involved in this action.\n\nThe Unigard policy includes a following form provision that provides:\n\nIt is further understood and agreed that in the event of loss for which the insured has coverage under the underlying insurance scheduled herein, the excess of which would be recoverable hereunder except for terms and conditions of this policy which are not consistent with the underlying, then notwithstanding anything contained herein to the contrary this policy shall be amended to follow the terms and conditions of the applicable underlying insurance in respect of such loss.\n\nThe Unigard policy contained the identical standard form pollution exclusion contained in the Commercial Union policy. Again, Grace contends that the following form provision incorporates coverage for gradual pollution in the underlying primary policy into the excess policy, and overrides the pollution exclusion. Grace is correct. To the extent the pollution exclusion in the Unigard policy is in conflict with the coverage otherwise provided by the underlying policy, under the following form provision, it clearly must give way.\n\nThe following form provision in the Unigard policy expressly provides that coverage would be afforded for any loss in excess of the limits of the \"underlying insurance scheduled therein\". The schedule of underlying insurance attached to the Unigard policy sets forth the limits of coverage under the Continental policy, but does not mention the limits for gradual pollution. From this absence, the Insurers argue that no coverage is provided for gradual pollution. The case the Insurers rely on undercuts their position.\n\nIn Garmany v. Mission Ins. Co., 785 F.2d 941 (11th Cir. 1986), relied on by the Insurers, representatives of the plaintiff-decedent sued a used car dealer's excess umbrella insurer. They sought to recover on judgments obtained against the dealer for the death that resulted from an accident caused by an individual to whom the dealer lent a car for a test ride. The dealer had a primary comprehensive general liability insurance policy that provided coverage to the dealer and its employees of $ 500,000 per occurrence for personal injuries, but provided only $ 20,000 in coverage for permissive users of the dealer's cars. The excess insurer refused to provide coverage for any damages under the excess limit of $ 500,000 listed in the schedule of underlying insurance attached to the excess policy.\n\nPlaintiff's representatives contended that because the excess insurer was aware of the terms of the underlying policy, to the extent it intended for there to be a gap in the excess insurance, it had a duty to make that gap explicit in the policy, and should not be allowed to hide behind the limits expressed in the schedule. Id. at 944. The Circuit Court disagreed. It held that the limits in the schedule were unambiguous, and that the excess insurer could not be held to provide coverage for any amount under the $ 500,000 limit clearly expressed in the schedule. Id. at 946.\n\nRelying on footnote five of Garmany for the proposition that the contents of a schedule in an excess policy must be given effect, the Insurers contend that the absence of a scheduled amount of liability for gradual pollution means that no coverage is afforded for gradual pollution. The Court disagrees. As in Garmany, the schedule in the Unigard policy is unambiguous. It acknowledges underlying coverage for property damage up to $ 1,000,000. Therefore, read together with section four of the policy, the Unigard policy provides coverage for property damage in excess of $ 1,000,000 that results from an occurrence as defined in the underlying policy.\n\nThat the coverage for property damage in the Continental policy had a different limit for harm due to gradual pollution means only, as in Garmany, that there is a gap in coverage between the underlying and excess policies. As in Garmany, the failure to set forth this special limit on property damage coverage in the schedule does not mean that the excess policy provides no coverage for gradual pollution. The primary purpose of the schedule is to set forth the limits at which excess coverage begins, not to detail the coverage provided by the excess policy. The following form provision unambiguously refers to the \"terms and conditions of the underlying insurance\", and gives them effect over the terms of the excess policy in the case of an inconsistency. Because the Unigard policy admits of only one reasonable construction -- that any property damage covered under the underlying insurance will be covered by the excess policy to the extent it exceeds $ 1,000,000 -- the Court need not resort, as the Insurers urge, to an examination of extrinsic evidence as to the intentions of the parties to the Unigard policy.\n\nThe third policy in question was issued by the Northbrook Insurance Company (\"Northbrook\") as policy No. 63-001-170, and was effective between June 30, 1975 and June 30, 1976. This policy contained following form and pollution exclusion provisions identical to those contained in the Unigard policy. The underlying primary insurance policy to this excess policy was the same Continental policy that underlay the Unigard policy. Therefore, the exact same analysis applied to the Unigard policy controls the first Northbrook policy.\n\nThe last policy in question with respect to the issue of coverage for gradual pollution was issued by the London defendants as Policy No. KY017582, and was in force between June 30, 1982 and June 30, 1985. That policy contained a following form provision that stated:\n\nIT IS HEREBY understood and agreed that in the event the Assured suffers a loss which is covered under the policies of the underlying insurances as set out in the schedule attached to this Policy, the excess of which would be payable under this Policy, except for terms and conditions of this policy which are not consistent with the underlying insurances, then notwithstanding anything contained in this Policy to the contrary this Policy shall be amended to follow and be subject to the terms and conditions of such underlying insurances in respect of such loss.\n\nTHE FOREGOING SHALL NOT, HOWEVER, APPLY TO:\n\n. . . Any Seepage and Pollution Exclusion Clause attached to this Policy.\n\nThe policy contained the pollution exclusion provision discussed above in Section III.A.2 of this Opinion.\n\nAlthough Grace asserts in its memorandum in opposition to the Insurers' motion that this London defendants policy incorporated the gradual pollution coverage contained in the underlying Continental Policy No. CCP 2483440, the Court does not see how that is even arguably so. This London defendants policy, unlike the Northbrook or Unigard policies discussed above, expressly provides that its pollution exclusion overrides any coverage in the underlying policy inconsistent with the exclusion. Therefore, to the extent coverage in the underlying policy for gradual pollution is inconsistent with the pollution exclusion in this excess policy, the exclusion controls.\n\nGrace has conceded that none of the other excess insurance policies at issue in this case contain a following form provision as to an underlying primary policy that expressly states a coverage limit for gradual pollution. See Grace Memorandum in Opposition at 6-7 n.6.\n\nFor the reasons discussed above, this aspect of the cross-motions will be granted in part in Grace's favor, granted in part in the Insurers' favor, and otherwise denied.\n\nD. Grace's Motion For Summary Judgment On Pre-1974 Policies\n\nBy separate motion, Grace seeks a declaration that three excess insurance policies issued by Employers' that covered the period between October 20, 1962 and June 30, 1971, and one excess insurance policy issued by Commercial Union that covered the period between June 30, 1971 and June 30, 1974, all provide coverage for \"gradual pollution.\"\n\nThis argument proceeds under the misconception, discussed in the preceding subsection of this Opinion, that the limitation of liability for gradual pollution provisions in the Maryland Casualty policies are \"coverage\" provisions. As noted above, to the extent any gradual pollution is proved to fall within the definition of occurrence, coverage is provided under the Maryland Casualty policies as long as it is not excluded under any other policy provision. The issue on this motion, therefore, is whether anything in the excess policies in question precludes coverage for gradual pollution that is covered by the primary Maryland Casualty policies.\n\nThe two Employers' policies contain following form provisions that provide:\n\nIt is agreed that the terms, conditions and limitations of this policy will not be construed any more restrictive than the terms, conditions and limitations of Underlying [Maryland Casualty policies].\n\nThe Insurers have not asserted any argument that would read coverage under these American policies more restrictively than the underlying Maryland Casualty policies. Thus, to the extent coverage for gradual pollution is afforded under the Maryland Casualty policies, excess coverage exists under the two American policies.\n\nThe third policy in question, in effect during the years 1971 to 1974, has been addressed in the preceding subsection of this Opinion. The Court concluded that coverage for gradual pollution under this Commercial Union policy is not limited by the pollution exclusion provision. Accordingly, Grace's motion will be granted.\n\nE. The London Defendants' Motion On the Early Policies\n\nThe London defendants seek summary judgment in their favor that policies issued between 1959 and 1962 provide no coverage for the claims asserted against Grace by Hatco. They rely on pollution exclusions contained in those policies that provide:\n\n. . . this Policy does not cover any liability . . . for:\n\n(1) Removal of, loss of or damage to subsurface property of others. Nevertheless, liability for consequential loss directly attributable to Blowout shall not be excluded hereby.\n\n(2) Property damage resulting from subsidence caused by subsurface operations.\n\n(3) Property damage caused by seepage, pollution or contamination unless:\n\n(a) such seepage, pollution or contamination is caused by accident, and results in property damage during the period of the policy, or\n\n(b) subsequent to seepage, pollution or contamination an accident ensues which causes property damage during the period of this Policy and then only for property damage proximately caused by such accident.\n\nAt the outset, the parties dispute whether the pollution exclusions in three of four of the policies in question apply to any entity other than the Cosden Petroleum Corporation. The pollution exclusions are all contained on endorsements under which Cosden was added to Grace's policies as an additional named assured. On the face of the endorsements, it is ambiguous whether the pollution exclusion applies to all Grace entities, or merely to Cosden. The Court believes that this issue cannot be resolved on the basis of the record submitted on this motion, which contains little discussion of the issue, and will therefore deny the London defendants' motion as to the policies that contain the Cosden endorsement.\n\nOne other policy clearly includes a pollution exclusion applicable to Grace. Subsection three of that exclusion is no different in substance than the other London defendants pollution exclusions already discussed above. Because many fact issues remain unresolved as to what pollution on the Hatco site may fall within the \"accidental\" exception to the exclusion, the London defendants' motion as to this policy will be denied. The London defendants' further request for summary judgment that subsection one of the exclusion, which excludes coverage for damage of others' property, precludes recovery for damage to groundwater or other property in which the State of New Jersey retains an interest, must also be denied, as the legal issues involved have been inadequately briefed, and the facts necessary to grant summary judgment on that ground remain disputed.\n\nIV. Cross-Motions For Summary Judgment on the \"Owned-Property\" Exclusions\n\nThe excess insurance policies sold to Grace all contained \"owned-property\" exclusions. Policies issued by Employers', Commercial Union, Unigard and Northbrook \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" contain the following provision:\n\nThis policy does not apply . . . to injury to or destruction of property owned by any named Insured.\n\nPolicies issued by the London defendants contained one of the following provisions:\n\nThe term \"property damage\", wherever used herein, shall include, but not by way of limitation, damage to or destruction or loss of property, excluding however damage to property owned by the Named Assured.\n\nThe term \"property damage\", wherever used herein, shall mean loss of or direct damage to or destruction of tangible property (other than property owned by the Named Assured).\n\nGrace seeks summary judgment in its favor on several different aspects of the owned-property exclusions contained in certain insurance policies. First, it seeks summary judgment holding that the exclusion does not bar coverage for damage that occurred to the Hatco site after Grace sold it in 1978, because the site was no longer \"owned\" property of Grace. Second, it seeks summary judgment holding that the owned-property exclusions contained in excess insurance policies that \"follow form\" to the Continental primary insurance policies are ineffective. Last, it seeks summary judgment holding that the owned-property exclusion does not bar coverage for sums expended on owned property to remediate or prevent damage to unowned property. The excess insurers contend that they are entitled to summary judgment dismissing all claims against them on the ground that all damage in issue occurred to owned property and is therefore excluded from coverage. Each motion will be discussed separately.\n\nA. Post-1978 Damage to the Hatco Site\n\nOn August 21, 1978, Grace sold the Fords facility to Hatco's corporate predecessors. Grace contends that any damage that occurred after that date did not occur to property owned by Grace, but to property previously alienated by Grace. It therefore contends that the owned-property exclusion does not apply to such damage. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\"\n\nGrace contends that the unambiguous language of the owned-property exclusion does not preclude damage for property formerly owned Grace, and that if the insurers intended to exclude such property from coverage they could easily have done so with an \"alienated premises\" exclusion.\n\nIn New Jersey, exclusions to coverage are strictly construed against the insurer. United Rental Equipment Co. v. Aetna Life \u0026 Cas. Ins. Co., 74 N.J. 92, 100-01 (1977); Butler v. Bonnor \u0026 Barnewall, Inc., 56 N.J. 567, 576 (1970); Mazzilli v. Accident \u0026 Cas. Ins. Co. of Winterthur, 35 N.J. 1, 8 (1961). Given that insurance companies can and routinely do include alienated premises clauses in insurance contracts, \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" the Court concludes that the reasonable expectations of the parties to a contract that does not contain such a provision is that the owned-property exclusions do not bar coverage for damage that occurs on alienated property.\n\nB. Grace's Following Form Argument\n\nContinental issued primary insurance policies to Grace between 1973 and 1985 that did not contain owned-property exclusions. Grace contends that owned-property exclusions contained in excess insurance policies that followed form to the Continental policies are ineffective by operation of the following form provisions. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" Unigard provided excess insurance coverage to Grace from June 30, 1974 to June 30, 1975. Northbrook provided excess insurance coverage to Grace from June 30, 1974 to June 30, 1976. Both policies contained a following form provision that stated:\n\nIt is further understood and agreed that in the event of loss for which the insured has coverage under the underlying insurance scheduled herein, the excess of which would be recoverable hereunder except for terms and conditions of this policy which are not consistent with the underlying, then notwithstanding anything contained herein to the contrary this policy shall be amended to follow the terms and conditions of the applicable underlying insurance in respect of such loss.\n\nGrace asserts that because the owned-property exclusion in the Unigard and Northbrook policies is inconsistent with the coverage provided by the Continental policies, it should be given no effect. The plain language of the following form provision supports this argument. It states that when coverage provided by an underlying policy would also be provided by the excess policy were it not for terms in the excess policy that are inconsistent with the underlying coverage, the excess policy shall be amended to conform to the underlying policy. The insurers' argument to the contrary, based on their strained interpretation of the following form provision, is unpersuasive. Accordingly, the Court concludes that the owned-property exclusions in the Unigard policy and the first Northbrook policy are ineffective.\n\nC. Sums Spent On Owned Property to Prevent Damage to Unowned Property\n\nGrace has moved for a declaration that the insurance policies that contain enforceable owned-property exclusions do not exclude coverage for the claims asserted against Grace by Hatco, because the claims involve remediation actions already taken or that will be taken on owned property to prevent or remediate damage to property owned by third parties. Because factual issues remain in dispute, Grace's motion will be denied.\n\nIn Broadwell Realty Services, Inc. v. Fidelity \u0026 Cas. Co., 218 N.J. Super. 516 (App. Div. 1987), the Appellate Division held that \"abatement remedies [taken on the insured's property] designed to prevent imminent and immediate damage to third parties cannot be denied on the basis of the owned-property exclusion.\" Id. at 528; see also CPS Chemical Co. v. Continental Ins. Co., 222 N.J. Super. 175, 183-84 (App. Div. 1988) (discussing Broadwell). The \"imminent and immediate\" requirement of Broadwell is a necessary component of the court's ruling. Because the distinction between measures taken to remediate the insured's property and measures taken to abate or prevent damage to adjacent property \"may to some extent become blurred\", and it may be \"extremely difficult to segregate and distinguish between\" such measures, Broadwell, 218 N.J. Super. at 529, the requirement of proof of immediacy and imminency helps to ensure that remediation taken on the insured's property is really necessary to prevent third party harm, and thus not excluded from coverage. Because a reasonable expectation of coverage for remedial measures taken on the insured's land exists only when it is clear that such measures are justified to prevent damage to adjacent land, it must be clear that damage to adjacent lands has already commenced and continues, and future damage is at least imminent and immediate.\n\nFurther, it is clear that Grace bears some burden to demonstrate the imminency and immediacy of harm to adjacent property. Although Grace correctly notes that the burden of proving that coverage is excluded is on the insurer, when an insurance policy includes an unambiguous owned-property exclusion, this burden is met when the insurer makes a prima facie showing that the remedial measures in question were performed on the insured's property. It is then up to the insured to rebut that showing of coverage exclusion by establishing that those measures were taken only to prevent continuing and imminent and immediate future damage to unowned property.\n\nThe Insurers contend that Grace has not submitted proof of any third party property damage or threat of damage that would trigger coverage not excluded by the owned-property exclusions. Yet the Insurers concede that a small percentage of the contamination at the Hatco site is of groundwater. Grace has also submitted proof of damage to or threatened damage to groundwater, which it contends is property of the state. The question of whether the state's parens patriae interest in groundwater constitutes \"property\" within the meaning of an insurance contract is an open question in New Jersey. See Diamond Shamrock Chemicals Company v. Aetna Cas. \u0026 Sur. Co., 231 N.J. Super. 1, 15 (App. Div. 1989). Given the lack of adequate briefing on the issue, and a factual record that is far from undisputed, the Court will not decide this unresolved question. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" See id.\n\nAlthough Grace seeks a declaration that the owned-property exclusions do not bar coverage for Hatco's claims against Grace, the inadequate record presented in support of this motion, together with the fact sensitive nature of the issue involved, makes inappropriate any blanket declaration of the parties' rights under the exclusion. On the basis of the record before the Court, it is far from clear whether any of the damage at the Hatco site is excluded by the owned-property exclusion. Therefore, Grace's motion will be denied.\n\nShould the record indicate that there is no past or present injury to third party property, the owned- property exclusions will prevent Grace from recovering for remediation actions taken on owned property. In the wake of State v. Signo Trading, N0. A-72 (N.J. Sept. 23, 1992), insurance policies containing owned-property exclusions do \"not cover the costs of cleanup performed by or on behalf of an insured on its own property when those costs are incurred to alleviate damage property of a third party.\" Id. at 15. Recovery for cleanup actions intended to prevent future damage, even if the threat of damage is imminent or immediate, is possible only \"when a present injury has already been demonstrated.\" Id. at 16-17.\"\n\nD. The Insurers' Motion For Summary Judgment\n\nMuch for the same reasons that Grace's motion for summary judgment was not warranted because of factual disputes in the record, the Insurers' motion also must be denied. The Insurers argue that \"over 99% of the contamination at the [Hatco] site is bound up in site soils and sludges and poses no immediate threat of off-site migration\". Grace has offered evidence that raises questions as to the accuracy of this figure. Even notwithstanding Grace's arguments, because the Insurers do not contend that 100% of the damage poses no threat to unowned property, they implicitly concede that a small percentage of harm may fall into that category and is thus in dispute. Given the large sums of money potentially involved in the cleanup of the site (estimated by the parties at between \"tens of millions\" and $ 100 million), even the small percentage of harm conceded to be in dispute by the Insurers may give rise to coverage. The Insurers have made no argument that the cost to remediate the small percentage of disputed damage would not be sufficiently great to trigger any coverage under the excess policies. Therefore, the Court cannot conclude that, as to policies containing enforceable owned-property exclusions, there is no possibility of coverage. The Insurers' motion will therefore be denied.\n\nV. Grace's Motion For Summary Judgment On the Issue That the Excess Insurers Are Estopped From Raising Any Defense to Coverage\n\nGrace contends that by their failure to disclaim coverage in the two years between the date Grace sent them written notices of claim and the date Hatco filed suit against Grace, the excess insurers are precluded from raising any defenses to coverage. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" This motion will be denied.\n\nGrace bases its motion on the New Jersey Supreme Court's decision in Griggs v. Bertram, 88 N.J. 347 (1982). In that case, the court held, with respect to a primary insurer, that when,\n\nafter timely notice, adequate opportunity to investigate a claim, and the knowledge of a basis for denying or questioning insurance coverage, the insurance carrier fails for an unreasonable time to inform the insured of a potential disclaimer, it is estopped from later denying coverage under the insurance policy in the event a legal action is subsequently brought against its insured.\n\nId. at 363-64.\n\nSeveral specific contractual provisions were central to the court's holding. It found that the insurer's duty to defend, together with a \"cooperation\" provision, and a provision under which the insured covenanted to \"refrain from 'voluntarily . . . assuming any obligation\", created a justified expectation in the insured that, after he notified his insurer of the claim asserted against him, the insurer would protect his interests. Id. at 359-60, 362. With such duties under the insurance agreement, an insured could reasonably refrain from undertaking his own defense, investigation or settlement negotiations out of fear of forfeiting coverage. Id. at 360. Therefore, when the insurer unreasonably delays in protecting the insured, it may be estopped to assert any defense to coverage, because its delayed disclaimer of coverage has prejudiced the insured's ability to protect his best interests in the interim. Id. at 362.\n\nThe Court finds Griggs inapposite to Grace's motion. None of the insurance contracts implicated by this motion contain provisions like those that form the basis for the holding in Griggs. All of the policies in issue are excess policies. None contain a duty to defend, a mandatory cooperation provision or a covenant not to voluntarily assume any liability. They all contain the following provision:\n\nThe company shall not be called upon to assume charge of the settlement or defense of any claim made, suit brought or proceeding instituted against the Insured but the company shall have the right and shall be given the opportunity to associate with the Insured or the Insured's underlying insurers, or both, in the defense and control of any claim, suit or proceeding relative to an occurrence where the claim or suit involves or appears reasonably likely to involve the company in which event the Insured and the company shall cooperate in all things in the defense of such claim, suit or proceeding.\n\n(Emphasis added). Nothing in this provision could create the reasonable expectation in the insured that gave rise to a conclusive presumption of prejudice in Griggs. Instead, the provision makes clear that Grace should not expect any help from the excess insurers. That the excess insurers retained the right to participate in the defense or settlement of the claim, at their option, could create no expectation in Grace that would give rise to an estoppel. See St. Paul Fire \u0026 Marine Ins. Co. v. Children's Hospital Nat'l Medical Center, 670 F. Supp. 393, 402 (D. D.C. 1987) (holding that excess carrier cannot be estopped to deny coverage because \"it is the duty to defend that gives rise to the duty to disclaim coverage\").\n\nGrace relies on the conclusive presumption of prejudice to establish its entitlement to an estoppel. It has not otherwise attempted to demonstrate prejudice from the excess insurers' delay in disclaiming coverage. Thus, it has failed to establish that summary judgment is appropriate. Because the excess insurers had no duty to disclaim coverage, in the absence of proof that they made affirmative misrepresentations to Grace that induced inaction on its part resulting in detriment, Grace would have no basis for an estoppel. Grace's motion will therefore be denied.\n\nVI. Grace's Motion For Summary Judgment Holding That Continental Casualty Company Has Waived All Defenses to Coverage\n\nGrace contends that Continental waived its right to assert any defense to coverage not specifically raised in the reservation of rights letter it sent to Grace. This motion will be denied.\n\nBy letter dated March 14, 1988, Continental acknowledged receipt of the notice of claim sent by Grace in July 1987 concerning its potential liability to Hatco to clean up the Fords site. See Letter Annexed as Exhibit 14 to the Amended Affidavit of Jeffrey Posner dated February 10, 1992. In that letter, Continental brought to Grace's attention the pollution and owned-property exclusions in the Continental insurance policies, and reserved its rights as to those exclusions. The letter closed with the following statement:\n\nThis reservation of rights letter does not waive any other rights or privileges the Continental Casualty Company has under its contract of insurance\n\nGrace contends that this \"blanket\" reservation of rights was insufficient to preserve any defenses to coverage other than the two grounds specifically set forth in the letter, and therefore constituted a waiver of any other defenses.\n\n\"Waiver, under New Jersey law, involves the intentional relinquishment of a known right, and thus it must be shown that the party charged with the waiver knew of his or her legal rights and deliberately intended to relinquish them.\" Shebar v. Sanyo Business Systems Corp., 111 N.J. 276, 291 (1988). Under this standard, Continental's actions cannot be construed as a waiver. The reservation of rights letter expressly preserved the right to assert all defenses. Grace has not established that Continental acted in any manner inconsistent with its expression of intent to preserve all defenses. Therefore, nothing in Continental's words or acts indicates the intentional relinquishment of a known right.\n\nTo the extent Grace bases its argument on a theory of estoppel instead of waiver (its brief at times treats the two concepts interchangeably), Grace, as a sophisticated party well-represented by legal counsel, cannot contend that it proceeded to defend itself on the assumption that the only barriers to coverage were the pollution and owned property exclusions. The plain language of the reservation of rights letter would make such a belief unreasonable. Therefore, Grace cannot assert it has been prejudiced, \"an essential element\" of estoppel. Merchants Indem. Corp. v. Eggleston, 37 N.J. 114, 129 (1962). Grace's motion is therefore without merit and will be denied.\n\nVII. Grace's Motion For Summary Judgment That Environmental Cleanup Costs Are Covered \"Damages\" Under the Insurance Policies\n\nFive Insurer defendants have asserted affirmative defenses in their answers to the third-party complaint that challenge whether some or all of the relief sought by Hatco from Grace comes within the meaning of \"damages\" as that term is used in the insurance contracts. Continental has asserted as its eleventh affirmative defense that the amounts Grace is liable to pay do not constitute damages. Unigard has asserted a similar contention as its thirty-fourth affirmative defense. Employers' and Commercial Union have asserted as their thirty-first affirmative defense that some or all of the claims against Grace seek equitable relief not covered by the terms of the policies they issued. The London defendants have asserted a similar contention as their ninth affirmative defense. Allstate Insurance Company, as successor to Northbrook, has asserted as its ninth affirmative defense that coverage will not lie to the extent any of the relief sought by Hatco constitutes relief equitable in nature.\n\nGrace seeks a declaration that the claims for money damages made against it by Hatco constitute \"damages\" within the meaning of the five insurers' policies. For the reasons that follow, the Court will grant Grace's motion.\n\nAll of the policies in issue provide that the insurer will pay \"all sums which the insured shall become legally obligated to pay as damages\" because of property damage caused by an occurrence. Should Hatco prevail in this action, the only relief it could obtain would be a money judgment, and a declaration under CERCLA of liability for future costs incurred to remedy damage caused by Grace's past acts. Both forms of relief would clearly do no more than compensate Hatco for sums it has spent or will spend \"to eradicate the effects of the present or past pollution for which the insured has been adjudged liable.\" CPS Chemical Co., Inc. v. Continental Ins. Co., 222 N.J. Super. 175, 188 (App. Div. 1988). Hence, the Insurers' assertion that \"equitable relief\", even in the form of a money judgment, does not fall within the meaning of the term \"damages\" is without merit. Id. at 185-86; New Castle County v. Hartford Accident and Indem. Co., 933 F.2d 1162, 1184-91 (3d Cir. 1991). Consequently, the claims by Hatco for money damages \"fall within the purview of the obligations undertaken by [the Insurers] in their respective insurance contracts.\" Id. at 187. To the extent coverage is excluded under the insurance contracts, however, such as by, for example, an owned-property exclusion, sums for which Grace may be adjudged liable would not be recoverable under the insurance policies. Broadwell Realty Services, Inc. v. Fidelity \u0026 Cas. Co., 218 N.J. Super. 516, 528 (App. Div. 1987).\n\nThe Court will therefore grant summary judgment in Grace's favor on the issue that sums for which it may be adjudged liable to Hatco to remediate the Fords Hatco site are \"damages\" under the insurance policies that may be recovered if Grace proves the existence of coverage and the Insurers fail to prove that coverage is excluded under the policies.\n\nVIII. Grace's Motion For Partial Summary Judgment Requiring Continental and American Employers'/Commercial Union to Pay Grace's Past and Future Defense Cost\n\nMaryland Casualty, Grace's primary insurer for the period between 1962 and 1973, paid Grace's defense costs in this action until January 1, 1990. Having exhausted its policy limits for gradual pollution, Maryland Casualty settled with Grace. Grace has not been reimbursed for any defense costs by any other insurer. By this motion, Grace seeks to compel Continental, Grace's primary insurer from 1973 through at least 1985, to pay defense costs. Grace also seeks to compel Employers' and Commercial Union, Grace's excess insurers for the period covered by Maryland Casualty, to share in responsibility for Grace's defense costs.\n\nAlthough the duty to defend is broader than the duty to indemnify, in that the \"nature of the damage claim, rather than the . . . ultimate liability of the insurer, determines whether the insurer is obliged to defend\", Ohio Cas. Ins. Co. v. Flanagin, 44 N.J. 504, 512 (1965), it is not without limits. The general rule concerning the duty to defend is that\n\nthe complaint should be laid alongside the policy and a determination made as to whether, if the allegations are sustained, the insurer will be required to pay the resulting judgment, and in reaching a conclusion, doubts should be resolved in favor of the insured.\n\nDanek v. Hommer, 28 N.J. Super. 68, 77 (App. Div. 1953), aff'd o.b., 15 N.J. 573 (1954). The \"duty to defend applies only to those injuries for which there would be duty to indemnify if [the] claim were valid.\" Voorhees v. Preferred Mut. Ins. Co., 128 N.J. 165, 180 (1992) (summarizing Burd v. Sussex Mut. Ins. Co., 56 N.J. 383, 388 (1970)). When coverage, however, \"depends upon a factual issue which will not be resolved by the trial of the third party's suit against the insured, the duty to defend may depend upon the actual facts and not upon the allegations in the complaint.\" Id. In this situation the insurer is within its rights to refuse to pay defense costs until the factual issue is resolved in a proceeding between the insurer and the insured. Heldor Industries, Inc. v. Atlantic Mut. Ins. Co., 229 N.J. Super. 390, 399 (App. Div. 1988). Hence, when the allegations of the complaint against the insured, even if taken as true, would not establish the existence of coverage, the insurer's obligation to defend is transformed \"into one to reimburse the insured if it is later adjudged that the claim was one within the policy covenant to pay.\" Burd v. Sussex Mut. Ins. Co., 56 N.J. 383, 390 (1970).\n\nBurd controls in this case. The CERCLA claim asserted by Hatco against Grace for which potential coverage may exist is based on strict liability. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" The issue of intent will play no part in the action, and will be left unresolved. Critical to the issue of coverage in this case is whether either the releases of pollutants or resulting damages were expected and intended by Grace. Laying the Hatco complaint alongside the policies, and assuming the truth of its allegations, it cannot be determined whether the insurers would be required to pay the resulting judgment. Therefore, the insurers are under no obligation to at this point assume Grace's defense or pay its defense costs. Heldor, 229 N.J. Super. at 399 (when issue of intent will be left unresolved in underlying environmental cleanup case, \"the carrier may be within its right to deny a defense and await resolution of the coverage issue\"); CPS Chemical Co., Inc. v. Continental Ins. Co., 203 N.J. Super. 15, 21 (App. Div. 1985) (when issue of intent will be left unresolved in underlying environmental cleanup case, the insurer \"should not be required as a matter of law . . . to assume the defense\").\n\nIn Burd, the court stated that \"the carrier should not be permitted to assume the defense if it intends to dispute its obligation to pay a plaintiff's judgment, unless of course the insured expressly agrees to that reservation.\" 56 N.J. at 390. From this statement, Grace contends that Burd allows an insurer to refuse to provide a defense only in those situations where a conflict of interest exists between the insurer and insured, and the insured refuses to waive the conflict. Grace contends that it will waive the conflict if the insurers pay defense costs. Therefore, it claims that it is entitled to payment of defense costs.\n\nThis argument reads Burd as resting solely on the existence of a conflict of interest between the insurer and insured. That, however, was only one of two concerns of the Burd court. Although Burd contains a substantial discussion of the conflict of interest issue, the court was also concerned with the insurer's right to refuse to defend an insured when the claims asserted against it do not necessarily implicate coverage. That both concerns justified a refusal to provide a defense is apparent from the statement in Burd that\n\nif the carrier does not defend the tort claim because a plaintiff's verdict will not resolve the coverage problem in the insured's favor or because the carrier cannot defend with complete fidelity to the insured's sole interest, then the carrier may be heard upon the coverage issue in a proceeding upon the policy.\n\nId. at 394 (emphasis added). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" Therefore, Grace's motion will be denied.\n\nIX. Cross-Motions For Summary Judgment On the Issue of Late Notice of Claim\n\nThe London defendants, Commercial Union, American Employers', Unigard, Allstate and Continental have moved for summary judgment in their favor on their affirmative defense that coverage is precluded because Grace failed to provide the insurers with timely notice under the terms of the policies. Grace has cross-moved for summary judgment in its favor holding that the defense of failure to provide timely notice is insufficient as a matter of law. For the reasons set forth below, the Court will deny the Insurers' motion, and will grant Grace's motion in part and deny it in part.\n\nThe primary purpose of notice provisions is to give the insurer an early opportunity to investigate the facts and circumstances of the event that may result in the insurer's liability under the policy, before evidence is lost and witnesses become unavailable or lose their recollection of important facts. Morales v. Nat'l Grange Mut. Ins. Co., 176 N.J. Super. 347, 355 (Law Div. 1980). The leading case in New Jersey on the late notice defense to insurance coverage is Cooper v. Government Employees Ins. Co., 51 N.J. 86 (1968). Although the New Jersey Supreme Court acknowledged that the notice provision in an insurance policy is a condition precedent to coverage, id. at 91, it held that failure to comply strictly with the provision will not automatically preclude coverage. Instead, it created an \"appreciable prejudice\" standard:\n\nwe think it appropriate to hold that the carrier may not forfeit the bargained-for protection unless there are both a breach of the notice provision and a likelihood of appreciable prejudice. The burden of persuasion is the carrier's.\n\nId. at 94. Thus, two facts must be established beyond dispute for the Insurers to prevail on this motion: (1) that the applicable notice provision was breached; and (2) that the insurer can demonstrate the likelihood of appreciable prejudice as a result of the breach.\n\nA. Compliance With the Notice Provisions\n\nGrace provided the Insurers with notices of claims for coverage in July 1987. The Insurers base their argument that Grace failed to provide timely notice of claim primarily on two letters sent to Grace by Hatco in 1981 and 1986. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nThe first letter, dated November 23, 1981, was sent to Albert A. Eustis, General Counsel for Grace, by George O. Napack, Vice President and General Manager of Hatco. That letter stated, in pertinent part:\n\nSoon after the acquisition [from Grace of the Fords site by Hatco's predecessors] was accomplished, the New Jersey Department of Environmental Protection commenced several investigations at the site relative to claimed conditions of contaminated soils which were alleged to be contributing to the pollution of subsurface waters, as well as adjoining surface waters.\n\nWe are enclosing herewith a copy of an Administrative Order issued by the New Jersey Department of Environmental Protection, Division of Water Resources and dated June 16, 1981.\n\nIn accordance with the Administrative Order, on July 6, 1981, Hatco Chemical Corporation demanded an Administrative Hearing for the reason that it considers the findings articulated in the Administrative Order to be without basis in fact. Copies of the Request for Hearing, Etc., and Amended Request for Hearing, Etc., are enclosed.\n\nWhile Hatco Chemical Corporation intends to vigorously oppose the order, and especially those aspects requiring excavation and disposal off-site of contaminated soils, we wish to put you on notice that should any liability in any respect be incurred, Hatco Chemical Corporation will look to you for indemnity by reason of the pertinent provisions of the acquisition documents and the fact that any soil conditions resulting in liability or expense were created during the many years the facilities were operated and controlled by W.R. Grace \u0026 Company through its Hatco Chemical Division.\n\n(JA 211).\n\nGrace's General Counsel, Albert A. Eustis, responded to the 1981 Napack letter in a letter dated December 18, 1981. In it, he stated:\n\nThis is in response to your letter dated November 23, 1981 regarding the investigation by the New Jersey Department of Environmental Protection of certain property located in Fords, New Jersey. We see no basis for your claim that you are entitled to indemnification under the terms of the acquisition documents for any of the matters recited in your letter.\n\n(JA 214). The Insurers contend that the Napack letter sufficiently informed Grace in 1981 of its potential liability for the claims in this case such that it had a duty to immediately inform them of the potential claims for coverage under the policies.\n\nThe second letter, dated March 21, 1986, was sent to the attention of the Secretary of Grace, also Albert A. Eustis, by Hatco's attorney, Nathan M. Edelstein. That letter stated, in pertinent part:\n\nPlease be advised that this firm represents Hatco Chemical Corporation regarding [Hatco's draft New Jersey Pollutant Discharge Elimination System permit].\n\nThis letter is to advise and notify W.R. Grace \u0026 Company that the New Jersey Department of Environmental Protection is seeking to regulate Hatco Chemical Corporation under the auspices of the NTPDES [sic] Pollutant Discharge Elimination System . . . Issues relating to this permit involve conditions at the premises relating to ponds which were owned and operated, and purportedly closed by and/or on behalf of W.R. Grace \u0026 Company. Elements of the NJPDES permit also relate to naturally occurring water course and/or lagoons on the premises which were constructed by, operated by, and/or otherwise affected by the operations of W.R. Grace \u0026 Company.\n\nA copy of the draft NJPDES permit is enclosed.\n\nPlease be advised that accountability for such matters may rest with W.R. Grace \u0026 Company.\n\n(JA 265). The Insurers contend that, in the event the Court finds the 1981 Napack letter insufficient to have triggered the notice provisions of the policies, this 1986 letter triggered Grace's duty to give notice to its insurers.\n\nNotice provisions in insurance contracts may vary in the language used. Most, however, place on the insured a good faith obligation to inform the insurer reasonably soon after the insured learns of an occurrence, claim or suit that may form the basis for a claim of coverage under the policy. When, after learning of the possibility of a claim against it, an insured has delayed in providing notice to its insurer, the question of breach of the notice condition in the insurance contract turns on whether \"the insured . . . reasonably and in good faith believe[d] no claim against him was contemplated. . . .\" Id. at 90. This, however\n\ndoes not mean that an insured, conscious of a possibility of a claim, may omit to report the accident upon the ground that in his opinion the claim is without merit either because the fault was not his or because the claimed injuries are unreal. Obviously an insured may not assume the role of judge and jury.\n\nId.\n\nThe Napack letter, together with the attached NJDEP Order, unmistakably informed Grace that Hatco had been ordered by the NJDEP to \"remove all contaminated soils on the Hatco site\", and that Hatco would in the future seek to hold Grace liable for any costs that might be incurred in complying with that order, including liability for the \"excavation and disposal off-site of contaminated soils\", that resulted from Grace's past polluting activities. Thus, it is clear that Grace received knowledge from the Napack letter of the future possibility of a claim by Hatco against Grace.\n\nGrace's argument that the Napack letter did not constitute an actual \"claim\" is irrelevant under the notice provisions in issue. Those provisions all require that notice be given when the insured learns of either an accident, occurrence, claim or suit. Knowledge of a \"claim\" is therefore not the only relevant inquiry. Under New Jersey law, such provisions have been interpreted to place a duty on an insured to provide notice to its insurer on learning that a \"claim against him was contemplated\". Cooper, 51 N.J. at 90. Whether Grace breached the notice provisions of the insurance policies in issue depends, then, on the specific language of those provisions, and on whether Eustis reasonably and good faith believed that Hatco did not contemplate a claim against Grace.\n\n1. Continental Primary Policies\n\nThe Continental primary policy in effect from June 30, 1973 to June 30, 1976 provided that written notice must be given \"as soon as practicable after an occurrence, claim or suit is known to the manager, New York Insurance Department of W.R. Grace \u0026 Company.\" This provision was amended as of January 31, 1975 to require notice after an occurrence, claim or suit \"is known to the Director, Corporate Risk Management Dept., of W.R. Grace \u0026 Co.\".\n\nGrace contends that these provisions were not breached because Eustis never forwarded the Napack letter to the Director of the New York Insurance Department or the Director of Corporate Risk Management of Grace. The Insurers contend that to allow Grace to hide behind the literal terms of the notice provision would encourage insureds to purposely keep the designated officer uninformed so as to defeat insurance carrier defenses to coverage. If that is truly the Insurers' concern, they can easily avoid the potential for such subterfuge by refusing to include provisions based on the knowledge of a specific officer. Insurance carriers certainly wield sufficient bargaining power to protect their interests, and cannot claim that the provision in issue was forced on them by the insured. Thus, policy considerations alone provide no compelling basis to ignore the plain language of the notice provision.\n\nThe Court does not believe, however, that the literal requirement of the notice provisions that a designated officer of Grace receive knowledge of the possibility of a claim can insulate Grace from the late notice defense when high level employees or officers of Grace, such as Eustis, have acted in bad faith in withholding that information from the designated officer. The duty of reasonableness and good faith imposed by the New Jersey Supreme Court in Cooper to the giving of notice to the insurer should also be read into notice provisions such as that included in the Continental policies. That duty required Grace to exercise diligence in keeping its New York Insurance Department and Corporate Risk Management Department aware of information relevant to Grace's notice obligations under its insurance contracts. Thus, the relevant inquiry is not, as Grace suggests, merely whether the designated officers in the New York Insurance Department or Corporate Risk Management Department were made aware of the Napack letter, but whether Eustis acted reasonably and in good faith in choosing not to forward that letter to the designated officers, who were charged by Grace with making decisions whether to notify Grace's insurers.\n\nUnder the circumstances involved here, as a matter of law, Eustis acted unreasonably in failing to forward the 1981 Napack letter to the appropriate insurance department of Grace. It is apparent from the Eustis response letter that, by dismissing the Napack letter as without merit, Eustis weighed the merits of the Hatco notification, and decided for himself and Grace that Hatco could not prevail should it pursue its claim, based on his own evaluation of the contract language. It is also apparent that Eustis believed only that Hatco's claim was without merit, and did not believe that Hatco was less than serious about its claim against Grace. There is no indication in the record, nor does the Court believe there could be, that Eustis believed Grace had no causal connection to the alleged ground pollution at the Fords site or that only trivial damage was implicated in the event Grace had any liability.\n\nAlthough Eustis's failure to forward the Napack letter to Grace's insurance department may appear to have been justified in hindsight when, over the next several years, Hatco made no further demands on Grace, when Hatco's counsel sent the second letter in 1986, Eustis again was informed of Hatco's intent to seek indemnification from Grace. Again, Eustis decided on his own that the claim was without merit, without providing a copy of the letter to the Grace officer charged with the duty to determine whether Grace's insurers should be provided notice of the potential claim. This compounded Eustis's initial error.\n\nUnder Cooper, Eustis's \"assumption of the role of judge and jury\" in determining that Grace could not be held liable are insufficient reasons for him to have failed to inform Grace's insurance or corporate risk department of the possibility of the claim by Hatco. 51 N.J. at 90. Thus, the first part of the notice defense has been established by the Insurers as to the Continental primary policies.\n\n2. Excess Policies 1962-1976\n\nThe Employers', Commercial Union, Unigard and Northbrook excess insurance policies in effect between 1962 and 1976 all included the following notice requirement:\n\nWhen an occurrence takes place which, in the opinion of the insured, involves or may involve liability on the part of the [insurance] company, prompt written notice shall be given by or on behalf of the insured to the company or its Authorized Representatives. Such notice shall contain particulars sufficient to identify the insured and also reasonably obtainable information respecting time, place and circumstances of the occurrence.\n\nThe typical focus of notice provisions in excess insurance policies is not, as it is in primary insurance policies, on whether a claim may possibly be made against the insured, but whether a claim may possibly be made against the insured that may implicate excess insurance coverage. Trustees of University of Pennsylvania v. Lexington Ins. Co., 815 F.2d 890, 895 (3d Cir. 1987) (applying Pennsylvania law). The provision involved here is no exception. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\"\n\nUnder the terms of the notice provisions in the excess policies, written notice was not required until Grace gained knowledge of \"an occurrence . . . which, in the opinion of [Grace], involved or may involve liability on the part of the [insurance] company.\" (Emphasis added). This provision, unlike the notice provisions in the London defendants' policies, discussed below, and the policy in Trustees of University of Pennsylvania, 815 F.2d at 896, takes into account Grace's own subjective view of the possibility that its liability may be so great as to implicate coverage under the excess policy.\n\nThe Insurers bear the burden of proof on the issue of late notice. They have not offered any evidence that establishes objectively that the letters contained information sufficient to have given Eustis, or, assuming he forwarded the Hatco letters to Grace's insurance department, someone with expertise in insurance matters, reason to believe that the potential Hatco claim would have exceeded Grace's $ 1 to $ 2 million in primary coverage, thus triggering excess coverage. Nor is it apparent to the Court, from its examination of the two letters, that excess coverage would necessarily be implicated by Hatco's demands. No dollar amount is mentioned, nor is sufficient information provided such that the dollar amount could be estimated. Bearing in mind that the standard under the notice provision is subjective, the Insurers bear a substantial burden to demonstrate the propriety of granting summary judgment. They have failed to meet that burden to demonstrate that Grace failed as a matter of law to provide timely notice under the terms of the excess policies in effect between 1962 and 1976.\n\nSimilarly, Grace has failed, for purposes of its cross-motion, to demonstrate beyond dispute that its failure to apprise the Insurers of the Hatco letters was reasonable as a matter of law. In particular, it has offered no evidence as to Eustis's subjective beliefs as to possibility that excess insurance could be implicated by Hatco's potential claim, in the event it matured into a liability. It has offered only evidence that Eustis did not believe the Hatco letters constituted a \"claim\". As discussed above, that evidence is not dispositive of the issue of his duty to notify Grace's insurance department. The Court concludes that it is also not dispositive of whether Eustis believed that Hatco's potential claim could involve these excess policies.\n\nGrace's additional argument that the notice provision in certain excess policies \"eliminates any notice obligation of Grace\", Grace Notice Brief at 16, is also without merit. Excess policies issued by Employers', Commercial Union and Northbrook to cover the period between 1965 and 1976 included in the notice provision the following:\n\nIt shall be agreed that awareness of a claim by the Insurance Department of the Insured shall be the same as notice given the [insurance] company.\n\nGrace's contention that this eliminates a notice requirement ignores the plain language of the provision. It is conceded by Grace that Eustis did not inform Grace's insurance department of the 1981 and 1986 Hatco letters. Thus, under the plain terms of the provision, no notice had been given to the insurers.\n\n3. Excess Policies 1976-1985\n\nExcess policies in effect between June 30, 1976 and June 30, 1985 issued by the London defendants, as well as excess policies in effect between June 30, 1976 and June 30, 1982 issued by Northbrook, \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" contain the following notice provision: \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\"\n\nWhenever the Assured has information from which the Assured may reasonably conclude that an occurrence covered hereunder involves injuries or damages which, in the event that the Assured should be held liable, is likely to involve this policy, notice shall be sent [to a designated agent] as soon as practicable, provided, however, that failure to give notice of any occurrence which at the time of its happening did not appear to involve this policy but which, at a later date, would appear to give rise to claims hereunder, shall not prejudice such claims.\n\nThis notice provision is typical of those included in policies of excess insurance. B. Ostrager and T. Newman, Handbook On Insurance Coverage Disputes ยง 4.02[b][3] at 73-74 (2nd ed. 1989). It sets out an objective standard to determine when notice must be given to an insurer. Trustees of University of Pennsylvania, 815 F.2d at 896. Under this provision, notice is required \"if the insured, acting on the basis of the knowledge [Grace] possessed at the time, should have believed that the incident was likely to involve the policy if it had considered the matter reasonably\". \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" Id. at 896.\n\nFor the reasons explained in the preceding subsection, the Insurers have failed to establish as a matter of law that the 1981 and 1986 Hatco letter provided information sufficient to establish objectively that coverage under the excess policies could be implicated should Hatco's potential claim mature into a liability. Under the provision involved here, however, the Insurers carry an even greater burden. They must prove not that the Hatco letters provided information sufficient to inform Grace of an occurrence that \"may involve liability\" of an excess policy, but that is \"likely \" to do so. In this they have failed.\n\nGrace too has, for the reasons discussed in the preceding subsection, failed to carry its burden with respect to its cross-motion on these policies.\n\n4. Excess Policies 1959-1962\n\nThree excess policies issued by the London defendants to cover the period between 1959 and 1962 contain the following notice provision:\n\nThe Assured upon knowledge of any accident or occurrence likely to give rise to a claim hereunder shall give immediate written notice thereof to [the insurer's designated agent].\n\nUnlike the notice provision discussed in the preceding subsection, this provision does not explicitly set out an objective standard to determine when notice is required. The parties have not adequately briefed this issue. Thus, the Court will not determine whether an objective or subjective standard is required by this provision. Because, as discussed in the preceding two subsections, neither party has demonstrated entitlement to summary judgment under either an objective or subjective standard, the Court finds that summary judgment is unavailable to either party on the notice issue with respect to the three early London defendants policies.\n\nB. Appreciable Prejudice\n\nThe second element of the notice defense under New Jersey law is that the insurer demonstrate the likelihood of \"appreciable prejudice\" as a result of the insured's failure to timely provide notice. Cooper, 51 N.J. at 94. For purposes of this motion, prejudice need be addressed only as to the Continental primary policies, because, with the exception of the Insurers proofs as to the Continental policies, neither Grace nor the Insurers have indisputably established the first prong of the notice defense in their favor as to any of the policies in issue. Several cases decided after Cooper have examined the prejudice requirement.\n\nIn Morales v. National Grange Mut. Ins. Co., 176 N.J. Super. 347 (Law Div. 1980), Judge Baime, who currently sits on the Appellate Division, enumerated some of the factors to be considered in determining whether prejudice has been suffered by the insurer:\n\nthe availability of witnesses, the ability to discover information regarding the location of the accident, any physical changes in the scene during the delay, the existence of official reports concerning the occurrence, the preparation and preservation of demonstrative and illustrative evidence such as vehicles or photographs, and the ability of experts to reconstruct the scene.\n\nId. at 355. He also set out a two part test to determine whether appreciable prejudice is likely. The insurer must establish: (1) \"that substantial rights pertaining to a defense against the claim have been irretrievably lost \", id. (emphasis in original); and (2) \"the likelihood that it would have had a meritorious defense had it been informed of the [potential claim] in a timely fashion\", id. at 356.\n\nIn a more recent case, Molyneaux v. Molyneaux, 230 N.J. Super. 169 (App. Div. 1989), the Appellate Division found that an insurer's failure to diligently investigate a claim after late notice was given by the insured \"mitigates against [the insurer's] claim of prejudice.\" Id. at 178. It further found that \"mere[] conjecture and suspicions . . . may not form the basis to establish appreciable prejudice.\" Id. at 179.\n\nContinental makes several arguments in support of its claim of appreciable prejudice, none of which the Court finds is sufficient to merit summary judgment in its favor. First, it contends that Grace's failure to provide timely notice \"precluded [it] from conducting a contemporaneous investigation of the Hatco claim.\" Insurers' Notice Brief at 22. This argument is closely related to Continental's arguments that the delay in notice resulted in the loss of documents in the interim, the loss of memory of some witnesses, and the deaths of some witnesses.\n\nAt his deposition, the claims representative in charge of the Grace/Hatco claims file, created when Grace provided notice to Continental in 1987, stated that, with the exception of minimal correspondence with Grace, Continental did \"almost nothing\" in connection with the Grace/Hatco claim through the next several months. Peterson Dep. at 136. Continental has not refuted Grace's assertion that it failed to conduct any investigation in any way of the Fords site and the underlying facts, take any steps to preserve evidence, or seek to become involved in settlement negotiations after being given notice in July 1987 of the possibility of a claim against Grace by Hatco. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" Nor does it contend that it would have acted any differently had it been given the notice in 1981 that it now contends was critical. Instead, it asserts only that it \"lost the opportunity to make a prompt investigation.\" As the record stands, it is undisputed that Continental did nothing to investigate the claim against Grace until it was sued as a third-party defendant in this action.\n\nAs in Molyneaux, Continental's failure to diligently pursue a factual investigation after its receipt of untimely notice militates against a finding that it would have done so had timely notice been provided. Molyneaux, 230 N.J. Super. at 178. Although if Grace sent its notice six years earlier Continental would have had an \"opportunity\" to preserve testimony and documents, there is little or no reason for the Court to believe that Continental would actually have done so. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" Thus, Continental has not established beyond dispute that Grace's delay was the cause of any prejudice to Continental. \"An insurance carrier's burden of proof will not be satisfied by the showing of a mere possibility of prejudice\". Morales, 176 N.J. Super. at 354.\n\nContinental asserts two additional reasons why it has suffered prejudice. It contends that in the six years between the 1981 Napack letter and the notice given in 1987, the contamination at the Fords site became worse, and more costly, because \"no meaningful remediation was performed at the site. . . .\" Insurers' Notice Brief at 30. As discussed above, because there is no reason to believe that Continental would have taken any action had it been given notice in 1981, this argument fails to establish Continental's right to summary judgment.\n\nThe other contention by Continental is that actions taken at the Fords site in those years \"substantially altered the site's condition.\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" Insurers' Notice Reply Brief at 20-21. The acts that are asserted to have altered the site are insignificant from the perspective of prejudice to Continental. The acts listed by Continental consist solely of the taking of samples of soil and water from the Fords site for laboratory analysis. Without need for extended comment, the Court concludes as a matter of law that these acts were insignificant and caused Continental no prejudice.\n\nIn sum, Continental has failed in its burden on this motion to establish beyond dispute that it has irretrievably lost rights as a result of Grace's delayed notice, which led to the loss of a meritorious defense. Because Grace has also failed to establish beyond dispute that Continental suffered no prejudice, the issue of prejudice must be resolved at trial. Both motions on the issue of timely notice will therefore be denied.\n\nX. Cross-Motions for Summary Judgment On the Priority of Coverage of Grace's Environmental Liability Insurance\n\nBetween June 30, 1981 and April 1985, Grace had in place an Environmental Impairment Liability (\"EIL\") excess insurance program, under which it was covered for property damage and cleanup expenses caused by environmental hazards not occurring on or confined to the insured's property. These policies, issued or subscribed to by a number of insurers, including Continental, certain London defendantsno longer parties to this action, Hartford Accident and Indemnity Company, Gibraltar Casualty Company, Evanston Insurance Company, Twin Cities Insurance Company and Midland Insurance Company, all provided coverage on a \"claims-made\" basis.\n\nExcess insurers Employers', Commercial Union and Unigard contend that the 1981 Napack letter, discussed in the preceding sSection of this Opinion, constituted a \"claim\", and that Grace could have sought coverage under any EIL policy in effect when that \"claim\" was received. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" Further, they contend that because EIL coverage is a specific environmental coverage, it should be called on to cover Hatco's claims against Grace before the general excess CGL policies should be asked to provide coverage. Because Grace failed to seek coverage under the EIL policies, the Insurers contend that Grace voluntarily forfeited available coverage, and should not be allowed to recover under the excess CGL policies any amount that could have been first recovered from the EIL insurers. In effect, they ask that their policies be considered excess insurance to the EIL policies.\n\nBecause the Court finds that the 1981 Napack letter did not constitute a \"claim\" within the meaning of the EIL policies giving rise to coverage, it will not reach the merits of this novel argument, but will deny the Insurers' motion on that basis alone. For the same reason, the Court will grant Grace's motion for a declaration that the Insurers' coverage obligations are unaffected by the availability of EIL coverage as a result of the 1981 Napack letter.\n\nClaims-made coverage is distinctly different from occurrence coverage. Occurrence policies cover the risk of events that cause damage during a policy period, regardless of how far into the future the claim for the damage is made against the insured, while claims-made policies insure against the risk of claims being made during the policy period, regardless of when the damage occurred. Zuckerman v. National Union Fire Ins. Co., 100 N.J. 304, 310-11 (1985).\n\nThe EIL insurance in issue covered, subject to deductibles and policy limits, sums that Grace became legally obligated to pay as a result of \"claims first made against the insured during the policy period.\" \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" \"Claim\" is defined in only one of the policies. Evanston Policy # IE 100349 defines \"claim\" as \"a demand received by the insured for money or services, including the service of suit or institution of arbitration proceedings against the insured.\" In those policies where \"claim\" is undefined, it \"must be interpreted in accordance with [its] ordinary, plain and usual meaning.\" Killeen Trucking, Inc. v. Great American Surplus Lines Ins. Co., 211 N.J. Super. 712, 714 (App. Div. 1986); see also Longobardi v. Chubb Ins. Co. of New Jersey, 121 N.J. 530, 537 (1990) (\"the words of an insurance policy should be given their ordinary meaning\").\n\nAccording to its common meaning, a claim is a \"demand for money or property as of right.\" Black's Law Dictionary at 247 (sixth ed. 1990). No such demand was made in the 1981 Napack letter. Napack informed Grace not that Hatco demanded payment for a loss already sustained by Hatco from Grace's pollution, but merely that \"should any liability in any respect be incurred, Hatco Chemical Corporation will look to you for indemnity. . . .\" (JA 211).\n\n\"Notice that it is [someone's] intention to hold the insured's responsible for a wrongful act is an event commonly antecedent to and different in kind from a claim.\" Bensalem Tp. v. Western World Ins. Co., 609 F. Supp. 1343, 1348 (E.D. Pa. 1985) (quotations omitted). In Evanston Ins. Co. v. Security Assur. Co., 715 F. Supp. 1405 (N.D. Ill. 1989), letters containing threats similar to those in the 1981 Napack letter were held not to be \"claims.\" Id. at 1412-13. Like the Napack letter, the letters in Evanston informed the insured only that it would be held \"directly liable for any resulting damages.\" Id. at 1407. In finding that the letters did not constitute claims, the court stated:\n\nclearly none of the September 1982 communications qualifies as a 'demand for money or property.' After all, American Benefits had not been damaged in any way on September 23-24. What [the insured] was being told, in no uncertain terms, was that it would be held liable for any possible future damages flowing from its refusal to honor its commitment. But such a warning (or even threat) of a possible future suit, at least framed in the way the communications went to [the insured], does not qualify as a present 'claim.'\n\nId. at 1413. This analysis is directly on point. The Napack letter clearly indicated to Grace that Hatco did not yet consider itself to have a present claim. The letter stated that Hatco believed the findings of the New Jersey Department of Environmental Protection \"to be without basis in fact\", and that those findings would be contested. (JA 211). The letter informed Grace that Hatco would in the future seek to hold Grace liable only \"should any liability . . . be incurred.\" Thus, that letter did not \"demand\" anything from Grace, but merely informed Grace that a demand may be forthcoming in the future, should Hatco sustain a loss as a result of Grace's past acts.\n\nUnder the persuasive analysis in Evanston, this Court finds that the 1981 Napack letter did not constitute a \"claim\", but rather, only notice of a potential claim. Unlike the policy at issue in Zuckerman, the policies in issue here do not define claim more broadly than its common meaning so as to cover potential claims of which the insurer has been provided notice during the policy period. See Zuckerman, 100 N.J. at 308 (policy stated \"A claim is first made during the policy period or extended reporting period if . . . during the policy or extended reporting period the insured shall have knowledge or become aware of any act or omission which could reasonably be expected to give rise to a claim under this policy . . . .\"). Because the Napack letter was not a claim but only notice of a potential claim, it did not give rise to coverage under the EIL policies.\n\nThe Insurers' motion is predicated on a finding that coverage was available to Grace under the EIL policies. Because the Court has ruled to the contrary, the Insurers' elaborate arguments contingent on that finding being made need not be addressed. Moreover, because the Court has determined that the 1981 Napack letter did not trigger coverage under Grace's EIL policies, Grace's motion for summary judgment holding that the existence of the EIL policies issued to Grace does not affect the excess insurers' coverage obligations will be granted.\n\nXI. Cross-Motions for Summary Judgment On the Meaning of \"Expected and Intended\" in the Definition of \"Occurrence\"\n\nGrace has moved for partial summary judgment holding that coverage is excluded under the occurrence definition only if it subjectively expected or intended the resulting damage at the Fords site. Employers', Commercial Union Unigard and the London defendants, excess insurers for Grace, have moved for summary judgment holding that Grace is not covered for contamination at the Hatco site on the ground that it knew to a substantial certainty that its acts would result in injury to the soil and groundwater at the site. For the reasons that follow, Grace's motion will be granted and the Insurers' motion will be denied.\n\nThe policies in issue all provide coverage for damage caused by \"occurrences\". The policies, with immaterial differences, define an occurrence as an event that \"unintentionally\" or \"unexpectedly and unintentionally\" results in property damage during the policy period. The claims asserted against Grace by Hatco, for which Grace seeks coverage, all relate to contamination of soil, both surface and subsurface, and groundwater. Grace contends that only its subjective intent to cause injury is relevant, and that it never intended to cause harm to the soil and groundwater at the Hatco site. The Insurers contend that Grace was sufficiently knowledgeable about the effects of its waste disposal practices such that an expectation or intent to harm the soil and groundwater can be presumed as a matter of law.\n\nThe New Jersey Supreme Court recently expounded on the intent inquiry under an occurrence-based policy in Voorhees v. Preferred Mut. Ins. Co., 128 N.J. 165 (1992). It held that \"absent exceptional circumstances that objectively establish the insured's intent to injure, we will look to the insured's subjective intent to determine intent to injure.\" Id. at 185. To establish exceptional circumstances requires more than a showing that \"the actions in question seem foolhardy and reckless\". Id. at 184. Only \"when the actions are particularly reprehensible [will] the intent to injure . . . be presumed from the act without an inquiry into the actor's subjective intent to injure.\" Id. As an example of such actions, the court referred to sexual assault of children as an act \"so inherently injurious that it can never be an accident\". Id. at 185.\n\nThe Insurers assert that Grace's undisputed actions at the Hatco site fall within the \"exceptional circumstances\" exception, and therefore entitle them to summary judgment that no coverage exists. In support of this argument, they document evidence in the record that establishes clearly that Grace was aware in the 1960s that its waste disposal practices caused extensive surface water pollution of nearby brooks and rivers, and air pollution. The Insurers have also submitted evidence that tends to establish Grace's awareness in the mid-1960s of the possibility that effluent pumped into unlined holding ponds could seep into the ground. From this, the Insurers request that the Court presume as a matter of law that Grace expected and intended to damage the soil and groundwater at the site.\n\nIn opposition, Grace argues that proof of knowledge of surface water contamination and air pollution cannot suffice to prove intention to cause subsurface groundwater contamination and soil contamination. Grace supports its argument with deposition testimony by Hatco employees that Hatco was unaware of subsurface groundwater contamination until 1979, after Hatco had been sold by Grace. Grace has also submitted evidence that raises genuine issue of material fact as to whether groundwater contamination was of concern to government and industry before the late 1970s. Further evidence has been submitted that establishes that during the 1960s, government agencies as well the scientific community recommended under certain conditions the spraying of chemical waste onto the ground as an alternative to surface water disposal, because it was believed that the soil and groundwater could \"purify\" some contaminants. In addition, Grace has submitted evidence that tends to prove that Grace was not in violation of any law or regulation related to soil and groundwater pollution during the period it owned Hatco.\n\nAlthough Grace did violate state laws respecting surface water and air pollution, nothing in the record establishes any violation of any law that regulated soil and groundwater contamination. Moreover, although it is possible that Grace might have known or expected that its waste disposal practices would damage the soil and groundwater and could result in later legal liability, genuine disputed issues of material fact preclude the Court from making that determination by way of summary judgment. The stringent standard articulated by the New Jersey Supreme Court for presuming intent to injure as a matter of law has not been met by the Insurers. In view of the lack of regulation of groundwater and soil contamination at the time of Grace's acts, the Court cannot find that Grace's acts were sufficiently \"reprehensible\", Voorhees, 128 N.J. at 184, to give rise as a matter of law to an irrebuttable presumption that Grace intended to pollute the soil and groundwater of the Hatco site.\n\nThe Insurers' separate argument that Grace was aware of a loss due to pollution prior to the inception of coverage under the policies also fails. The Insurers have failed in their burden to establish beyond dispute that Grace knew that it had suffered groundwater or soil damage prior to the inception of coverage under the policies in issue. Although the evidence adduced at trial may establish that fact, thus precluding coverage, see Gloucester Tp. v. Maryland Cas. Co., 668 F. Supp. 394, 403 (D. N.J. 1987), the record as it stands does not justify entry of summary judgment.\n\nGrace will be precluded from coverage under the occurrence definition only if it subjectively expected or intended the resulting damage at the Fords site. The Court will grant Grace's motion, and will deny the Insurers' motion.\n\nCONCLUSION\n\nFor the reasons stated above, the Court will enter an Order reflecting the following conclusions.\n\nGrace's motion for summary judgment holding that New Jersey law follows the \"continuous trigger\" theory of insurance coverage will be granted in part and denied in part.\n\nThe Insurers' motion for summary judgment in their favor holding that all excess umbrella insurance policies in effect from June 30, 1971 do not provide coverage for gradual pollution will be denied.\n\nGrace's cross-motion for summary judgment in its favor holding that all post-June 30, 1971 excess umbrella insurance policies provide coverage for gradual pollution provided that such pollution was unexpected and unintended will be granted in part and denied in part.\n\nGrace's motion for summary judgment holding that certain excess insurance policies provide coverage for gradual pollution will be granted.\n\nThe London defendants motion for summary judgment holding that the pollution exclusions in policies issued between 1959 and 1962 bar coverage for Grace's claims will be denied.\n\nGrace's motion for summary judgment holding that the owned-property exclusion does not bar coverage for damage that occurred to the Hatco site after Grace sold it in 1978 will be granted.\n\nGrace's motion for summary judgment holding that the owned-property exclusions contained in excess insurance policies that \"follow form\" to the Continental primary insurance policies are ineffective will be granted.\n\nGrace's motion for summary judgment holding that the owned-property exclusion does not bar coverage for sums expended on owned property to remediate or prevent damage to unowned property will be granted.\n\nThe excess insurers motion for summary judgment dismissing all claims against them on the ground that all damage in issue occurred to owned property and is therefore excluded from coverage will be denied.\n\nGrace's motion for summary judgment holding that Unigard, Northbrook, Employers', Commercial Union and the London defendants are precluded from raising any defenses to coverage will be denied.\n\nGrace's motion for summary judgment holding that Continental waived its right to assert any defense to coverage not specifically raised in the reservation of rights letter sent to Grace will be denied.\n\nGrace's motion for summary judgment holding that the claims for money damages made against it by Hatco constitute \"damages\" within the meaning of the insurance policies issued by the Insurers will be granted.\n\nGrace's motion for summary judgment holding that Continental and American Employers'/Commercial Union must pay defense costs will be denied.\n\nThe Insurers' motion for summary judgment in their favor on their affirmative defense that coverage is precluded because Grace failed to provide the insurers with timely notice under the terms of the policies will be denied.\n\nGrace's cross-motion for summary judgment in its favor holding that the defense of failure to provide timely notice is insufficient as a matter of law will be denied.\n\nThe motion by Employers', Commercial Union and Unigard for summary judgment holding that Grace should not be allowed to recover under the excess CGL policies any amount that could have been first recovered from the EIL insurers will be denied.\n\nGrace's cross-motion for summary judgment holding that the Insurers' coverage obligations are unaffected by the availability of EIL coverage will be granted.\n\nGrace's motion for partial summary judgment holding that coverage is excluded under the occurrence definition only if it subjectively expected or intended the resulting damage at the Fords site will be granted.\n\nThe motion of Employers', Commercial Union and Unigard for summary judgment holding that Grace is not covered for contamination at the Hatco site on the ground that it knew to a substantial certainty that its acts would result in injury to the soil and groundwater at the site will be denied.\n\nAn appropriate order is attached.\n\nDated: August 31, 1992\n\nALFRED M. WOLIN, U.S.D.J.\n\nORDER\n\nIn accordance with the Opinion filed herewith, it is. this 31st day of August, 1992\n\nORDERED that Grace's motion for summary judgment holding that New Jersey law follows the \"continuous trigger\" theory of insurance coverage is granted in part and denied in part; and it is further\n\nORDERED that the Insurers' motion for summary judgment in their favor holding that all excess umbrella insurance policies in effect from June 30, 1971 do not provide coverage for gradual pollution is denied; and it is further\n\nORDERED that Grace's cross-motion for summary judgment in its favor holding that all post-June 30, 1971 excess umbrella insurance policies provide coverage for gradual pollution provided that such pollution was unexpected and unintended is granted in part and denied in part; and it is further\n\nORDERED that Grace's motion for summary judgment holding that certain excess insurance policies provide coverage for gradual pollution is granted; and it is further\n\nORDERED that the London defendants' motion for summary judgment holding that the pollution exclusions in policies issued between 1959 and 1962 bar coverage for Grace's claims is denied; and it is further\n\nORDERED that Grace's motion for summary judgment holding that the owned-property exclusion does not bar coverage for damage that occurred to the Hatco site after Grace sold it in 1978 is granted; and it is further\n\nORDERED that Grace's motion for summary judgment holding that the owned-property exclusions contained in excess insurance policies that \"follow form\" to the Continental primary insurance policies are ineffective is granted; and it is further\n\nORDERED that Grace's motion for summary judgment holding that the owned-property exclusion does not bar coverage for sums expended on owned property necessary to remediate or prevent damage to unowned property is granted; and it is further\n\nORDERED that the excess insurers' motion for summary judgment dismissing all claims against them on the ground that all damage in issue occurred to owned property and is therefore excluded from coverage is denied; and it is further\n\nORDERED that Grace's motion for summary judgment holding that Unigard, Northbrook, Employers', Commercial Union and the London defendants are precluded from raising any defenses to coverage is denied; and it is further\n\nORDERED that Grace's motion for summary judgment holding that Continental waived its right to assert any defense to coverage not specifically raised in the reservation of rights letter sent to Grace is denied; and it is further\n\nORDERED that Grace's motion for summary judgment holding that the claims for money damages made against it by Hatco constitute \"damages\" within the meaning of the insurance policies issued by the Insurers is granted; and it in further\n\nORDERED that Grace's notion for summary judgment holding that Continental Employers' and Commercial Union must pay defense costs is denied; and it is further\n\nORDERED that the Insurers\" motion for summary judgment in their favor on their affirmative defense that coverage is precluded because Grace failed to provide the insurers with timely notice under the terms of the policies is denied; and it is further\n\nORDERED that Grace's cross-motion for summary judgment in its favor holding that the defense of failure to provide timely notice is insufficient as a matter of law is denied; and it is further\n\nORDERED that the motion by Employers', Commercial Union and Unigard for summary judgment holding that Grace should not be allowed to recover under the excess CGL policies any amount that could have been first recovered from the EIL insurers is denied; and it is further\n\nORDERED that Grace's cross-motion for summary judgment holding that the Insurers\" coverage obligations are unaffected by the availability of EIL coverage is granted; and it is further\n\nORDERED that Grace's motion for partial summary judgment holding that coverage is excluded under the occurrence definition only if it subjectively expected or intended the resulting damage at the Fords site is granted; and it is further\n\nORDERED that the motion of Employers', Commercial Union and Unigard for summary judgment holding that Grace is not covered for contamination at the Hatco site on the ground that it knew to a substantial certainty that its acts would result in injury to the soil and groundwater at the site is denied.\n\nALFRED M. WOLIN, U.S.D.J.\n\n\u003cspan class=\"fn\"\u003e1. Hatco also sought other damages under a state common law theory of strict liability for abnormally dangerous activities. That claim, however, was dismissed by the Court in the July 27, 1992 Opinion, on the ground of failure to bring suit within the statute of limitations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Although slight differences in this provision exist between policies, those differences are immaterial and need not be set forth at length.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Presumably, the date of manifestation of injury is the cutoff date for triggering multiple policies because any injury that occurs after that point in time is known to the insured and would, under general principles of insurance law, be excluded as to any policy written after that date. See Gloucester Tp. v. Maryland Cas. Co., 668 F. Supp. 394, 403 (D. N.J. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. For example, the basic liability clause in the policies could have read that the insurer would be obligated: To pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of injury to or destruction of property, including the loss of use thereof, caused by occurrence; provided, however, that the insurer will not be liable for any damages because of injury to or destruction of property that does not result during the policy period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This result parallels that recognized under principles of tort law. Under section 433A of the Restatement (Second) of Torts : (1) Damages for harm are to be apportioned among two or more causes where (a) there are distinct harms, or (b) there is a reasonable basis for determining the contribution of each cause to a single harm. (2) Damages for any other harm cannot be apportioned among two or more causes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Because the parties have not briefed the issue, and it is not essential to resolution of this motion, the Court need not decide, and intimates no view, as to what constitutes \"manifestation\" of injury in the context of the facts of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. For example, the definition of \"occurrence\" in the London defendants' policies is abundant with redundancies. \"Occurrence\" is defined in relevant part as \"an accident or a happening or event . . . which unexpectedly and unintentionally results in . . . property damage.\" The difference, if any, between \"happening\" and \"event\" escapes recognition. \"Event\" is from the Latin \"eventus,\" which means \"occurrence.\" The Compact Edition of the Oxford English Dictionary 907 (1980). \"Eventus\" is a form of \"evenire,\" which means \"to happen.\" Id. The second definition of \"happening\" in the Oxford Dictionary is \"an event, occurrence.\" Id. at 1254. Beyond the redundancy of \"event\" and \"happening,\" the difference, if any, between: (1) a \"happening or event\" that is \"unexpected and unintentional;\" and (2) an \"accident\" is also indiscernible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. To the extent that Jackson Tp. and other Law Division opinions hold to the contrary, they are decisions to which this Court declines to adhere.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Some of the Northbrook policies do not contain an express owned property exclusion, but instead follow form to the London defendants' policies, which contained such exclusions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Policies in effect during the relevant time period are London defendants' Policy Nos. 76DD1594C, 76DD1633C and KY017582, and Northbrook Policy Nos. 63002048 and 63005793.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Some of the primary insurance policies issued by Maryland Casualty contained the following exclusion: This Insurance does not apply . . . to injury to or destruction of . . . premises alienated by the named Insured. For examples of cases that discuss the alienated premises exclusion see Diamond Shamrock Chemicals Co. v. Aetna Cas. \u0026 Sur. Co., 231 N.J. Super. 1 (App. Div. 1989); Savoy Medical Supply Co., Inc. v. F \u0026 H Mfg. Corp., 776 F. Supp. 703 (E.D.N.Y. 1991); Unigard Mut. Ins. Co. v. McCarty's, Inc., 756 F. Supp. 1366 (D. Idaho 1988); Borden, Inc. v. Affiliated FM Ins. Co., 682 F. Supp. 927 (S.D. Ohio 1987), aff'd, 865 F.2d 1267 (6th Cir.) (table), cert. denied, 493 U.S. 817 (1989); Taylor-Morley-Simon, Inc. v. Michigan Mut. Ins. Co., 645 F. Supp. 596 (E.D. Mo. 1986), aff'd, 822 F.2d 1093 (8th Cir. 1987); Rieder v. Cherokee Ins. Co., 635 F. Supp. 699 (E.D. Pa. 1986), aff'd, 813 F.2d 398 (3d Cir.) (table), cert. denied, 484 U.S. 823 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Although in its briefs Grace asserted that property exclusions in certain policies issued by the London defendants were ineffective because of following form provisions, at oral argument on this motion on July 30, 1992, Grace abandoned that position. See Transcript of Oral Argument, July 30, 1992 at 81.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Grace itself concedes that any determination of the extent of groundwater contamination at the Hatco site is \"premature until discovery shows the extent, nature and cause of that contamination.\" Reply Memorandum of Grace in Support of Its Motion For Partial Summary Judgment at 55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The four insurers at issue on this motion are Unigard, Northbrook, Employers', Commercial Union and the London defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Another claim based on strict liability under state common law, was dismissed by the Court in an Order dated July 27, 1992. See supra note 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Grace has not contended that without payment of defense costs from the insurers it cannot adequately present a defense to the Hatco claims. Thus, the Court need not decide what duty, if any, an insurer may have to provide at least interim financing to an insured to prevent such an injustice, where coverage, although it would not be resolved in the underlying action, remained an open question. Cf. Hartford Accident \u0026 Indemnity Co. v. Aetna Life \u0026 Cas. Ins. Co., 98 N.J. 18, 24-25 (1984) (raising possibility of duty to provide interim financing).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although, in a footnote, the Insurers assert that they also believe the notice obligation was triggered as early as 1959 when government authorities took actions against Grace to stop its pollution of rivers, creeks and other surface waters, they have not adequately briefed or otherwise supported this contention. The Court will thus not treat this argument as one of the grounds on which the Insurers seeks summary judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The primary insurance policies underlying these excess policies contained provisions that required written notice of an accident or occurrence \"as soon as practicable\", or as soon as it \"is known to the New York Insurance Department of W.R. Grace \u0026 Co.\" Because, as discussed above, Grace is held to the same standard of reasonableness and good faith under either type of provision, the notice provisions in the underlying primary policies in effect between June 30, 1962 and June 30, 1976 were no less restrictive than the notice provision in the excess policies in question. Therefore, the following form provisions in the excess policies, which require amendment of the excess policies to conform to the more liberal provisions in the primary policies, have no material effect on the notice provisions in the excess policies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. These policies follow form to the London defendants' policies, and thus incorporate the notice provision of those policies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. London Market Policy No. 59/2209/2, issued by the London defendants and in effect between 1959 and 1962, also contains this notice provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Grace's contention that the portion of the notice provision following the phrase \"provided, however\" incorporates a subjective standard into the provision is without merit. It does not provide an exception for occurrences that do not appear to the insured to involve the policy, but speaks only in general terms of the apparent implication of the excess policy, as does the first portion of the notice provision. To accept Grace's construction of the notice provision would vitiate without justification its carefully drafted objective standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Continental did not even offer to defend Grace. Under the strained relationship between the parties, Continental by that date refused to pay defense costs or incur any expense in connection with any environmental claim filed by Grace.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Many of the witnesses claimed by Continental to have lost memories were facts witnesses as to events that occurred in the early to mid 1960s. Continental has not addressed Grace's statement that there exists no reason to believe that these witnesses' memories would have been any more acute twenty years after the events in question than they were twenty-six years after those events.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Continental's argument that the remediation efforts of Hatco substantially altered the site is somewhat contradictory of its argument that the failure to perform meaningful remediation at the site created worsened conditions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The insurers also argue that to the extent the Court finds the \"continuous trigger\" theory of coverage applies to Hatco's claims, Grace could have sought coverage under all of the EIL policies in effect from 1981 through 1985. This argument is without merit. Coverage under occurrence-based policies is triggered by damage resulting during the policy period. Coverage under claims-made policies is dependent only on whether the claim arose during the policy period. The continuous trigger theory of coverage is strictly an interpretation of the policy language of \"occurrence-based\" policies that holds coverage under multiple policies to be triggered when damage is indivisible and continuous during multiple policy periods. See Section II of this Opinion above. Thus, the continuous trigger theory has no application to \"claims-made\" policies, under which the occurrence of damage during the policy period is irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. A number of EIL policies have been submitted to the Court as exhibits attached to Joint Appendix Exhibits 418-20. The Court assumes that these policies are the only ones in issue on this motion. With slight variation, all of the submitted EIL policies include the language quoted in the text. Some of the policies additionally require that the claim be reported during the policy period. See e.g., Continental Policy # EIL 049657 864 (JA 418, exhibit 3).\u003c/span\u003e\n\n",
    "body_length": 148622,
    "citedas": [
      "801 F. Supp. 1334"
    ],
    "attorneys": "RANDY PAAR, Esq., ELIZABETH A. SHERWIN, Esq., JEROLD OSHINSKY, Esq., ANDERSON KILL OLICK \u0026 OSHINSKY, 666 Third Avenue, New York, New York 10017, -and- ANTHONY MARCHETTA, Esq., HANNOCH WEISMAN, 4 Becker Farm Road, Roseland, New Jersey 07068 (Attorneys for W.R. Grace \u0026 Co.-Conn. , MARTIN P. LAVELLE, Esq., NEWMAN \u0026 HARRINGTON, P.C., 425 Lexington Avenue, New York, New York 10017, -and- KENNETH F. MULLANEY, Jr., Esq., DWYER CONNELL \u0026 LISBONA, 427 Bloomfield Avenue, Montclair, New Jersey 07024. Attorneys for Third-Party Defendant Unigard Security Insurance Company). PETER G. HERMES, Esq., PETER C. NETBURN, Esq., PEABODY \u0026 ARNOLD, 50 Rowes Wharf, Boston, Massachusetts 02110, -and- JAMES W. CHRISTIE, Esq., JAMES B. BURNS, Esq., CLARK LADNER FORTENBAUGH \u0026 YOUNG, One Centennial Square, Haddonfield, New Jersey 08033. (Attorneys for Third-Party Defendants American Employers' Insurance Company and Commercial Union Insurance Company). THOMAS J. QUINN, Esq., EILEEN McCABE, Esq., MENDES \u0026 MOUNT, Three Park Avenue, New York, New York 10016, -and- WILLIAM J. HANLEY, Esq., RONCA, McDONALD \u0026 HANLEY, 600 S. Livingston Avenue, Livingston, New Jersey 07039 (Attorneys for Third-Party Defendants, Certain Underwriters at Lloyd's London and the London Market Insurance Companies). , STUART C. LEVENE, Esq., FORD, MARRIN, ESPOSITO \u0026 WITMEYER, 120 Wall Street - 35th Floor, New York, New York 10005 (Attorney for Continental Casualty Company). For Allstate Insurance Company (as Successor to Northbrook Excess and Surplus Insurance Company), , PHILIP G. McGUIRE, Esq., GLEASON, McGUIRE \u0026 SHREFFLER, 140 Dearborn, Suite 700, Chicago, Illinois 60603, Bruce A. Tritsch, Esq., Feinberg \u0026 Tritsch, 1447 Campbell Street, Rahway, New Jersey 07065 (Attorneys for Allstate Insurance Company (as Successor to Northbrook Excess and Surplus Insurance Company)).",
    "category": [
      "124",
      "184"
    ],
    "judges": "WOLIN, District Judge",
    "citation_count": 0
  }
}
