{
  "id": "z4UqP2YBTlTomsSBHrqk",
  "document": {
    "title": "United States v. Akzo Coatings of America Inc.",
    "full_title": "UNITED STATES OF AMERICA AND STATE OF MICHIGAN: FRANK J. KELLEY, ATTORNEY GENERAL, INTERVENING CROSS-APPELLEE, v. AKZO COATINGS OF AMERICA, INC.; ET AL. CROSS-APPELLANTS.",
    "jurisdiction": "Sixth Circuit",
    "date": "1991-12-05T00:00:00.000Z",
    "docket": "Nos. 89-2092, 89-2137",
    "body": "ENGEL, Senior Circuit Judge. This is an appeal by the State of Michigan from the entry of a consent decree between the United States Environmental Protection Agency (\"EPA\") and twelve defendants\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e pursuant to the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (\"CERCLA\"), as amended by the Superfund Amendments and Reauthorization Act of 1986 (\"SARA\"), 42 U.S.C. § 9601 et seq. The consent decree would require the defendants, or potentially responsible parties (\"PRPs\"), to engage in remedial work to clean up a hazardous waste site in Rose Township, Oakland County, Michigan (\"Rose Site\"). The proposed remedial plan at the Rose Site calls for the excavation and incineration of surface soils contaminated with polychlorinated biphenyls (\"PCBs\"), lead, arsenic and other toxic materials and the flushing of the subsurface soils contaminated with a variety of volatile and semi-volatile organic compounds.\n\nThe state challenges the legality of the remedial action, and seeks to prevent entry of the consent decree. The Natural Resources Defense Council, the Environmental Defense Fund and the Sierra Club have filed a brief as amici curiae supportive of the state's position. The majority of the state's and amici's objections to the decree focus on the effectiveness of soil flushing at the Rose Site, where layers of clay are interspersed among beds of sand and silt. The PRPs cross appeal the district court's determination that the decree must comply with Michigan's groundwater anti-degradation law.\n\nI. STATUTORY OVERVIEW\n\nBy the late 1970s, Congress concluded that existing cleanup programs were inadequate to the task of taking care of literally thousands of sites across the country posing a serious threat to public health and the environment. Consequently, in 1980, Congress enacted CERCLA, also known as \"Superfund,\" to ensure prompt and efficient cleanup of hazardous waste sites and to place the costs of those cleanups on the PRPs. See S. Rep. No. 848, 96th Cong., 2d Sess. 98, reprinted in, 1 Cong. Research Serv., 97th Cong., 2d Sess., A Legislative History of the Comprehensive Environmental Response, Compensation and Liability Act of 1980 (Superfund), at 405 (1980).\n\nThroughout the 1980s, the Superfund hazardous waste cleanup program enjoyed centerstage prominence in environmental law. Nevertheless, the early years of CERCLA were difficult. CERCLA was a hastily-assembled bill which contained a number of technical flaws due to Congress' limited understanding of the hazardous waste problem and its effects on the environment. See Grad, A Legislative History of the Comprehensive Environmental Response, Compensation and Liability (\"Superfund\") Act of 1980, 8 Colum. J. Envtl. L. 1, 2, 34 (1982). Both Congress and EPA, for example, believed in the late 1970s that a site could be adequately cleaned up by \"scraping a few inches of soil off the ground.\" H.R. Rep. No. 253, 99th Cong., 2d Sess., pt. 1, at 54 (1986), reprinted in 1986 U.S. Code Cong. \u0026 Admin. News 2836. Congress also grossly underestimated the number of sites requiring cleanup and the monies necessary to remedy the problem. Compare id. with H.R. Rep. No. 1016, 96th Cong., 2d Sess., pt. 1, at 18-20 (1980), reprinted in 1980 U.S. Code Cong. \u0026 Admin. News 6120-23. EPA, as the delegatee of the President's authority under CERCLA, 42 U.S.C. § 9615, was criticized for the slow pace of cleanups, for failing to provide remedies that would protect public health and the environment, and for alleged \"sweetheart\" deals that reduced cleanup costs for industry at public expense. As a result, in 1986 Congress passed SARA, which reauthorized and amended CERCLA in several important ways. Congress sought to better define cleanup standards, to expand resources available to EPA for investigations and cleanups, to clarify EPA's authority under Superfund law, and to expand and clarify the states' role in any remedial action undertaken, or ordered, by EPA.\n\nCERCLA applies \"primarily to the cleanup of leaking inactive or abandoned sites and to emergency responses to spills.\" F. Anderson, D. Mandelker \u0026 A. Tarlock, Environmental Protection Law and Policy 568 (1984). The Act directs EPA to develop a National Priorities List (\"NPL\") for response priority purposes. 42 U.S.C. § 9605(a). After a site is placed on the NPL, a Remedial Investigation and Feasibility Study (\"RI/FS\") is performed to define the nature and extent of the threat posed by the release and to evaluate proposed remedies. 42 U.S.C. §§ 9604, 9622; 40 C.F.R. § 300.68(d). Once EPA determines under CERCLA that a response action is needed at a particular hazardous waste site, it must publish a proposed remedial action plan (\"RAP\") and provide an opportunity for comment. 42 U.S.C. § 9617. EPA then issues a Record of Decision (\"ROD\") setting forth the remedy selected for the site, including remedial technologies and cleanup standards. 42 U.S.C. § 9617.\n\nIn implementing its RAP, EPA may pursue one of three possible courses of action. See generally Koppers Indus., Inc. v. EPA, 902 F.2d 756, 757 n.1 (9th Cir. 1990) (discussing the various options). EPA may undertake a response measure on its own, which may include removal and/or remedial action,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and then sue PRPs it can find for reimbursement. 42 U.S.C. §§ 9604, 9607. In the interim, or in the event it cannot locate any PRPs or they cannot be made to pay the cleanup costs, the government-initiated cleanup may be financed by the \"Superfund,\" 42 U.S.C. § 9611, a trust fund derived from general federal revenues and an excise tax on specified chemicals. See 42 U.S.C. § 9631. Secondly, EPA may, independent of fund-financed response actions, issue an administrative order directing PRPs to implement removal or remedial action. 42 U.S.C. § 9606. Alternatively, EPA may apply to the district court for an injunction to compel PRPs to clean up or abate an actual or threatened release of hazardous substances from a facility. Id. As a third option, EPA may enter into an agreement with PRPs to perform a response action, 42 U.S.C. § 9622. Such an agreement is at issue here.\n\nThe federal legislative scheme and its history are persuasive that Congress did not intend to leave the cleanup under CERCLA solely in the hands of the federal government. CERCLA, as amended by SARA, provides a substantial and meaningful role for the individual states in the selection and development of remedial actions to be taken within their jurisdictions. In this case for example, pursuant to 42 U.S.C. § 9621(f) the State of Michigan had a reasonable opportunity to comment on the RI/FS, the RAP proposed in the amended ROD, and other technical data related to the implementation of the proposed remedy. The state was also entitled to and did participate in the settlement negotiations that led to the decree at issue. Id. Further, CERCLA is designed to accommodate more stringent \"applicable or relevant and appropriate requirements\" (\"ARARs\"), i.e. environmental standards of the state in which a site is located. 42 U.S.C. § 9621(d). Once a consent decree is proposed by EPA, see id. § 9622(a), the state can challenge it if EPA has proposed implementation of a remedy for which the federal agency has waived a valid and more stringent state requirement. Id. § 9621(d)(4), (f)(2)(B). The state may also enforce a decree to the extent the remedial action fails to comply with any state environmental requirements which have not been waived by EPA. Id. § 9621(e).\n\nIf no PRPs can be located, or if they are insolvent, a state or political subdivision may enter into a contract or cooperative agreement with EPA, whereby both may take action on a cost-sharing basis. 42 U.S.C. § 9604(c), (d). A state may also sue PRPs for remedial and removal costs if such efforts are consistent with the National Contingency Plan (NCP). Id. § 9607(a)(4)(A). However, assuming it is not the \"lead\" agency, the state is limited in its ability to require alternative relief if and when a consent decree is entered into between PRPs and EPA. See id. § 9621(f).\n\nUnder CERCLA, Congress expressed its preference for thorough yet cost-effective remedies at hazardous waste sites. Compare 42 U.S.C. § 9621(a) (\"the President shall select appropriate remedial actions . . . which provide for cost-effective response.\") with 42 U.S.C. § 9621(b) (\"Remedial actions in which treatment which permanently and significantly redress the volume, toxicity or mobility of the hazardous substances . . . are to be preferred over remedial actions not involving such treatment.\"). CERCLA's statutory scheme and legislative history reflect two other principal and related concerns:\n\nFirst, Congress intended that the federal government be immediately given the tools necessary for a prompt and effective response to problems of national magnitude resulting from hazardous waste disposal. Second, Congress intended that those responsible for problems caused by the disposal of chemical poisons bear the costs and responsibility for remedying the harmful conditions they created.\n\nUnited States v. Reilly Tar \u0026 Chemical Corp., 546 F. Supp. 1100, 1112 (D. Minn. 1982). These concerns must be kept in mind as we analyze the challenges to the consent decree.\n\nII. FACTS\n\nThe Rose Site consists of about 110 acres on which liquid and solid industrial wastes were illegally dumped in the late 1960s. In 1979, the Michigan Toxic Substance and Control Commission declared a toxic substance emergency at the Site, and 5,000 drums of toxic waste were immediately removed. Investigation disclosed that the drums contained, among other chemical compounds, PCBs, phthalates, organic solvents, oil and grease, phenols and heavy metals. In 1983, the Rose Site was placed on the NPL.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAll sites placed on the NPL must undergo a Remedial Investigation and Feasibility Study (\"RI/FS\") to determine the extent of contamination and possible remedies. 42 U.S.C. § 9620(e)(1). Under a cooperative agreement with EPA, the Michigan Department of Natural Resources (\"MDNR\") began the RI/FS evaluation of the Rose Site in 1984.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e That study, completed in June of 1987, showed two primary areas of contamination: (1) an area which is less than one acre in size but contains groundwater contaminated by vinyl chloride and surface soils having elevated levels of arsenic; and (2) twelve acres in the southwest corner of the Site that contain surface soils contaminated with PCBs, lead, arsenic and other toxic metals; subsurface soils contaminated with a variety of volatile organic compounds (\"VOCs\") and semi-volatile organic compounds (\"SVOCs\"); and groundwater\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e contaminated with PCBs, metals, VOCs and SVOCs.\n\nA. The RI/FS and the Original ROD\n\nAfter a detailed screening of possible remedies, the 1987 RI/FS recommended excavation and on-site thermal destruction to remedy the soil contamination,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e plus ground water treatment to cleanse the water under the Rose Site. Soil flushing, a method by which the contaminated soil is flushed with water and the resulting flushate is treated to designated cleanup levels and reinjected into the soil, was found to be ineffective at this Site due to the variable permeability of the Rose Site soils. RI/FS, Exh. 3.1a, Table 9-1, at 146.\n\nPursuant to section 117(a) of CERCLA, 42 U.S.C. § 9617(a), which requires that the public be given a reasonable opportunity to comment on a proposed cleanup, EPA published a notice of the remedy and held a public meeting near the Site. In September 1987, EPA issued a Record of Decision (\"ROD\"), setting forth its proposed remedy as recommended in the RI/FS. The State of Michigan concurred in the ROD, which required, among other steps:\n\n(1) Excavation of approximately 50,000 cubic yards of contaminated soil, incineration of the excavated soils that were contaminated with PCBs, VOCs and SVOCs, and proper treatment and disposal of the resulting incinerated ash; and\n\n(2) Extraction and on-site treatment of contaminated ground water with diversion to adjacent marshlands or an alternate location.\n\nThe 1987 ROD issued by EPA included a detailed explanation of the reasons for selecting the proposed remedy, and included specific findings that the remedy satisfied the requirements of CERCLA, complied with federal and state ARARs, and was cost effective. Soil flushing, though not adopted in the 1987 ROD, was not ruled out completely. The ROD listed eight criteria EPA would consider before substituting soil flushing for thermal incineration: economies of scale, community acceptance, cleanup time, land regulations, reliability of soil flushing, implementability, complete site remediation, and cost effectiveness.\n\nB. The Proposed Consent Decree\n\nIn June of 1987, shortly before issuance of the original ROD, EPA began settlement negotiations with the PRPs. The State of Michigan participated in these discussions. In the course of the negotiations, EPA was persuaded that the soil flushing method might be a viable, less costly alternative to the incineration of the VOC/SVOC contaminated soil, and could still result in a cleanup that would comply with all federal and state ARARs.\n\nIn August of 1988, EPA and the twelve PRPs who are defendants in this action signed the consent decree which included a soil flushing remedy for the site. While under the original plan 50,000 cubic yards of contaminated soil were to be incinerated, the consent decree calls for incineration of only half that amount, augmented by soil flushing for the remaining 25,000 cubic yards. In economic terms this is represented as effecting savings of roughly $12 million. To offset the danger that this process might be insufficient, the decree requires the PRPs to prove, both in a laboratory and at the Rose Site, that soil flushing is capable of meeting Phase I water target cleanup levels (\"TCLs\")\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e for the subsurface soils contaminated with VOCs and SVOCs within ten years after implementation of the system. Absent such proof, the PRPs would be required to fund and implement an alternate, permanent remedy designed to meet Phase I TCLs. Under the proposed consent decree, EPA is required to review the remedial action at the site at least every five years, and is permitted to seek further response action from the defendants if EPA determines that supplemental remedies are necessary. The settling defendants are also required to provide EPA with monthly progress reports, and are subject to fines for failure to provide the reports or for delays in the implementation of the proposed remedial action.\n\nThe consent decree retains a requirement that PCBs above 10 parts per million (p.p.m.). at the Rose Site be incinerated either on-site or off-site, but as noted above, it does not incorporate the original remedial action plan's requirement for incineration of all of the otherwise-contaminated soil. Under the decree, the settling defendants would be required to:\n\n(1) Implement supplemental hydrogeological studies regarding well placement, aquifers, permeability and porosity of unsaturated soil, placement of water extraction systems and characteristics of the soil;\n\n(2) Install and maintain a ground water monitoring program;\n\n(3) Excavate and incinerate all soils at the site containing PCBs in excess of 10 p.p.m.;\n\n(4) Treat and bury soils containing lead in excess of 70 p.p.m.;\n\n(5) Install and maintain a ground water extraction/treatment system that includes air stripping and carbon adsorption;\n\n(6) Locate and treat wetlands on the site that contain PCBs in concentrations greater than 10 milligrams per kilogram;\n\n(7) Construct and maintain a six-foot chain link fence around the site;\n\n(8) Install and maintain a soil flushing system designed to remedy VOC and SVOC contaminated subsurface soil and, if the system proves ineffective, to submit within six months an alternate remedy; and\n\n(9) Prepare the soil flushing plan; see details supra.\n\nIn consideration of the work to be performed and the payments to be made by the settling defendants, the United States agrees in the proposed consent decree not to sue them, with some exceptions,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e for claims available under sections 106 and 107 of CERCLA and other federal and state environmental laws which are based on facts about the Site and its contamination known to EPA at the time of the entry of the decree. The covenant does contain reopening provisions which would allow EPA to seek further injunctive relief or cost recovery if conditions unknown until after entry of the decree reveal that the remedial action is not protective of human health and the environment. See Consent Decree XVII.\n\nC. Proceedings in the District Court and the Amended ROD\n\nIn September of 1988, EPA filed the proposed consent decree with the U.S. District Court for the Eastern District of Michigan pursuant to 42 U.S.C. § 9622(d)(1)(A). As required by 42 U.S.C. § 9622(d)(2) and 28 C.F.R. § 50.7, notice of the proposed consent decree was published in the Federal Register on September 26, 1988. At the same time, EPA published a three page document entitled Proposed Settlement Plan -- Explanation of Significant Differences (\"ESD\"). The ESD was published to comply with section 9617(c), which requires EPA to explain why a settlement or consent decree to which the agency agrees differs in any significant respect from the final plan or ROD previously issued for a particular site. In this case the ESD explained the basis for the decision to allow defendants to try soil flushing at the Rose Site in conjunction with incineration, when the 1987 ROD had called for soil incineration only.\n\nAs required by 42 U.S.C. § 9617(a), EPA provided a period for public comment on the proposed changes to the ROD. EPA received written comments from the Michigan Department of Natural Resources and the Michigan Toxic Substances Control Commission, two congressmen, two private environmental organizations (the Environmental Defense Fund and the Michigan Environmental Council), several residents of Rose Township, and the settling defendants. Only the comments from the settling defendants expressed support for the terms of the consent decree.\n\nThose who objected to soil flushing were concerned that it was not a well-demonstrated technology, especially in Michigan's cold weather climate; that flushing may take as long as fifteen years to clean up the site as opposed to two years for incineration; that monitoring of soil flushing's effectiveness is extremely difficult, and that flushing may violate Michigan's groundwater anti-degradation laws.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e There were also concerns that the consent decree did not adequately define defendants' obligations in the event soil flushing failed to achieve established cleanup levels within the required time frame.\n\nThe settling defendants asserted that the proposed consent decree would protect hum: health and the environment, and included a study by the Gradient Corporation, an environmental consulting firm, which estimated that approximately 12,325 pounds of organic chemicals would be removed by the soil incineration method and that approximately 12,234 pounds of organic chemicals would be removed by the soil flushing method. The study added that the two amounts would be even closer in volume than this, because an additional amount of soil that was not to be incinerated under the original remedy would be subjected to soil flushing under the consent decree.\n\nOn January 18, 1989, after considering the comments received, EPA issued an amended ROD for the Rose Site. The amended ROD formally adopts soil flushing as a remedy for VOC and SVOC-contaminated subsurface soils, but only if pilot testing proves that flushing is as protective as thermal destruction. In adopting the remedy it originally ruled out, EPA reasons that (1) the excavation of PCB contaminated soils will remove most of the unflushable contaminants; (2) the geology of the contaminated area may not be as complex as initially thought; and (3) pilot testing has not yet been performed to rule out soil flushing. EPA, in the amended ROD, further asserts that (1) if Phase II target cleanup levels are achieved, flushing will have done as well as incineration was required to do under the original ROD, and will have brought the Site into compliance with all federal and state ARARs; (2) flushing is more cost effective than incineration; (3) assuming the groundwater treatment system uses granular activated carbon to capture the contaminants, soil flushing will satisfy CERCLA's preference for remedies utilizing permanent and innovative treatments; and (4) soil flushing will reduce toxicity, mobility, and the volume of contaminants to the same extent as thermal destruction.\n\nThe State of Michigan filed a complaint with the district court and moved to intervene in the action between EPA and the settling defendants on February 14, 1989, pursuant to 42 U.S.C. § 9621(f)(2)(B). This provision allows a state to challenge a proposed consent decree which allegedly fails to meet the state's environmental protection standards. On May 4, 1989, the U.S. District Court held that Michigan could intervene in order to challenge entry of the consent decree.\n\nOn June 8, 1989, Michigan filed a brief opposing entry of the consent decree, and appended the affidavit of Robert A. Hayes, in which Mr. Hayes discussed his scientific evaluation of soil permeability and the possible ineffectiveness of flushing at the Rose Site. The U.S. District Judge declined to consider the affidavit, as well as a memorandum drafted and submitted by EPA, concluding that the court's review was limited to the administrative record as that record existed at the time EPA amended the ROD. The district court did grant the motion of the Natural Resources Defense Council, the Environmental Defense Fund, and the Sierra Club to file a brief with the court as amici curiae, and their brief objecting to the entry of the consent decree was filed on June 30, 1989.\n\nOn July 18, 1989, one day after oral argument, the district court granted EPA's motion for entry of the consent decree. The State of Michigan moved for a rehearing, requesting the district court to remand to EPA or to grant an evidentiary hearing to determine whether the amended ROD complies with Michigan's ARARs. The court denied this motion when it issued a final Memorandum Opinion and Order on August 9, 1989, approving the decree and ordering its enforcement. United States v. Akzo Coatings of America, Inc., 719 F. Supp. 571 (E.D. Mich. 1989).\n\nIn its opinion, the district court held that Michigan's groundwater anti-degradation law does represent an ARAR for purposes of CERCLA, but found that the consent decree embodying a soil flushing remedy did not violate the state ARAR. The court found that Michigan's concerns about the complex geology of the Site had been adequately addressed by EPA, and observed that soil flushing had been used, with state approval, at other Michigan sites. The district court concluded that, on the administrative record, EPA's decision to enter into the consent decree was not arbitrary or capricious, and was reasonable, fair and not contrary to relevant federal and state laws. In addition, the district court held that CERCLA's provisions allowing EPA to settle claims for remedial action with the PRPs preempted the State of Michigan from imposing additional remedial action requirements on defendants under Michigan's Water Resources Commission Act, M.C.L.A. § 323.6; Michigan's Environmental Protection Act, M.C.L.A. § 691.1201 et seq.; and the common law of public nuisance.\n\nIII. ISSUES ON APPEAL\n\nThe State of Michigan now appeals the entry of the consent decree, and the district court's finding that CERCLA preempts some of the state's environmental remedies against these defendants. The PRPs cross-appeal the district court's finding that Michigan's anti-degradation law is an ARAR. EPA appears as appellee in this action, and does not challenge the judgment of the district court. The specific issues on appeal are:\n\nA. What is the proper standard of review for consent decrees, and should the court consider supplemental evidence not appearing in the administrative record?\n\nB. Is the consent decree arbitrary and capricious?\n\nC. Is the consent decree fair, reasonable and adequate?\n\nD. Does the consent decree comply with CERCLA's and Michigan's applicable environmental provisions?\n\nE. To what extent, if any, does the consent decree preempt state law claims for additional relief?\n\nThese issues will be discussed in the order listed above.\n\nIV. THE STANDARD OF REVIEW\n\nA. The Consent Decree and the Administrative Record\n\nWe must initially determine whether the district court applied the appropriate standard of review to the consent decree reached by EPA and the PRPs. The State of Michigan argues that the district court should have reviewed the consent decree under a de novo standard,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e rather than the more lenient arbitrary and capricious standard.\n\nA court's review process of a response action undertaken by EPA is guided by 42 U.S.C. § 9613(j), which provides:\n\n(1) Limitation\n\nIn any judicial action under this chapter, judicial review of any issues concerning the adequacy of any response action taken or ordered by the President shall be limited to the administrative record. Otherwise applicable principles of administrative law shall govern whether any supplemental materials may be considered by the court.\n\n(2) Standard\n\nIn considering objections raised in any judicial action under this chapter, the court shall uphold the President's decision in selecting the response action unless the objecting party can demonstrate, on the administrative record, that the decision was arbitrary and capricious or otherwise not in accordance with law.\n\nUnder a series of executive orders, the latest of which is codified at 42 U.S.C. § 9615, the functions of the president under CERCLA and SARA are delegated to EPA's administrator, with the authority to redelegate. EPA entered into the consent decree at issue in this case under the authority of this provision. CERCLA empowers the President, and those to whom he lawfully delegates authority, to remedy environmental problems such as the one at issue in Rose Township:\n\nIn addition to any other action taken by a State or local government, when the President determines that there may be an imminent and substantial endangerment to the public health or welfare or the environment because of an actual or threatened release of a hazardous substance from a facility, he may require the Attorney General of the United States to secure such relief as may be necessary to abate such danger or threat, and the district court of the United States in the district in which the threat occurs shall have jurisdiction to grant such relief as the public interest and the equities of the case may require.\n\n42 U.S.C. § 9606(a).\n\nThe State of Michigan argues that the consent decree negotiated between EPA and the PRPs was agreed to, but not \"taken or ordered,\" as described in section 9613(j)(1), supra, or \"select[ed]\" as described in section 9613(j)(2), supra. While these verbs are not defined in the CERCLA statute, we believe EPA, acting on the President's behalf, did select the chosen remedy embodied in the consent decree, and has ordered that the terms of the agreement be carried out by the PRPs. CERCLA authorizes the President to \"remove or arrange for removal of, and provide for remedial action relating to\" hazardous substances at a site, or to \"take any other response measure\" deemed necessary \"to protect the public health or welfare or the environment. \" 42 U.S.C. § 9604(a). Section 9604(c)(4) authorizes the President to select remedies which will further his efforts to remove these hazardous substances and protect the environment. The statute specifically authorizes the President to enter into consent decrees with PRPs in order to achieve these goals. See 42 U.S.C. § 9622. We find that EPA's decision to enter into a consent decree does represent a selection by the President of a remedy. As a result, CERCLA's limitation of judicial review to the administrative record does apply here, and the district court properly declined to engage in a de novo review of the consent decree.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nOur finding on this question of the standard of review is consistent not only with the language of CERCLA itself, but also with congressional intent concerning the role of agency expertise, and with the case law that has developed since the enactment of section 9613(j). Ours should not be the task of engaging in a de novo review of the scientific evidence pro and con on each proposed remedy in the hazardous substance arena. The federal courts have neither the time nor the expertise to do so, and CERCLA has properly left the scientific decisions regarding toxic substance cleanup to the President's delegatee, the EPA administrator and his staff. \"When examining this kind of scientific determination . . . a reviewing court must generally be at its most deferential.\" Baltimore Gas \u0026 Electric Co. v. Natural Resources Defense Council, Inc., 462 U.S. 87, 103, 76 L. Ed. 2d 437, 103 S. Ct. 2246 (1983). Our role, as the CERCLA statute makes clear, is one of review on the administrative record, searching for errors of procedure and for glaring omissions or mistakes which indicate that EPA has acted arbitrarily and capriciously. As the House Report on the SARA amendments notes: \"limiting judicial review of response actions to the administrative record expedites the process of review, avoids the need for time-consuming and burdensome discovery, reduces litigation costs, and ensures that the reviewing court's attention is focused on the criteria used in selecting the response.\" H.R. Rep. No. 253, Pt. 1, 99th Cong., 1st Sess. 81 (1985), reprinted in 1986 U.S. Code Cong. \u0026 Admin. News 2835, 2863. When reviewing a consent decree, a court need only \"satisfy itself that the settlement is reasonable, fair, and consistent with the purposes that CERCLA is intended to serve.\" H.R. Rep. No. 253, Pt. 3, 99th Cong., 1st Sess. at 19 (1985), reprinted in 1986 U.S. Code Cong. \u0026 Admin. News 3038, 3042 [hereinafter \"H.R. Rep. No. 253, Pt. 3\"].\n\nOther courts have viewed this limited, yet important, role as we do. In United States v. Cannons Engineering Corp., 899 F.2d 79 (1st Cir. 1990), the circuit court affirmed the district court's approval of proposed consent decrees reached between EPA and PRPs under CERCLA. The First Circuit stated in that case: \"While the district court should not mechanistically rubberstamp the agency's suggestions, neither should it approach the merits of the contemplated settlement de novo.\" 899 F.2d at 84.\n\nWe recognize that one court has found that EPA's selection of a remedy to clean up a hazardous waste site should be reviewed de novo in the district court. See United States v. Hardage, 663 F. Supp. 1280 (W.D. Okla. 1987). However, we believe that court misinterpreted the plain language of CERCLA and the congressional intent behind the statute. The Hardage court found that the environmental plan in that case had not been \"selected,\" but was merely a proposal which the court, not the President, was in a position to enforce. Therefore, reasoned the court, review of the proposed cleanup plan was not limited to the administrative record by section 9613(j), since the court, not the President, was ordering a remedy.\n\nThe Hardage distinction is without merit, and we believe the court improperly engaged in a de novo review of the remedy in that case. \"If the Hardage court's interpretation of the statute is correct, Congress has enacted an unusual statutory scheme, one in which the scope and standard of review seems to hinge on whether EPA formally issues an order for a response plan or merely asks the court to enforce such a plan.\" In re Acushnet River \u0026 New Bedford Harbor, 722 F. Supp. 888, 892 (IS. Mass. 1989). Another court has described the Hardage court's distinctions as \"hypertechnical and inconsistent with the plain meaning of the statutory language.\" United States v. Bell Petroleum Servs., Inc., 718 F. Supp. 588, 591 (W.D. Tex. 1989). We agree with the view that the Hardage distinctions are improper, given 42 U.S.C. § 9621(a)'s description of actions \"secured under section 9606\" as presidentially-selected remedial actions. The President, acting through EPA, does select a remedy when he presents a consent decree for court approval, and the standard of review found in section 9613(j) should apply to such decrees. The consent decree, as a judicial act, requires court approval. However, the court's role is limited to approval or rejection of the decree, and it remains EPA's responsibility to select the remedy and to take the steps necessary to bring the decree to the court for approval. We must respect Congress' intent that the President develop such decrees, and that the courts review them on the administrative record under an arbitrary and capricious standard.\n\nAnother case interpreting the standard of review under CERCLA is United States v. Ottati \u0026 Goss, Inc., 900 F.2d 429 (1st Cir. 1990). There the court held that review of an EPA request for injunctive relief to force several companies to clean up a hazardous waste site was not limited to the arbitrary and capricious standard. The court drew a distinction, with which we agree, between the court's duty to enforce a \"lawful (nonarbitrary) EPA order,\" and the court's discretion to accept or reject a \"remedial injunction that EPA (lawfully and nonarbitrarily) decides is proper.\" 900 F.2d at 434. As the Ottati \u0026 Goss court said, a reviewing court is not required to adopt EPA's chosen remedy just because EPA believes the remedy is proper. Id.\n\nHowever, we disagree with that court's acceptance of the Hardage case's distinction between remedial actions taken or ordered by the President, and proposed remedies which EPA asks a court to implement. Relying upon the language of section 9606(a), which allows the President to require the Attorney General to secure such relief as may be necessary to abate the danger of a hazardous waste problem, and gives to the district court \"jurisdiction to grant such relief as the public interest and the equities of the case may require,\" the Ottati \u0026 Goss court upheld the district court's modifications to EPA's requested injunctive relief. We believe section 9613(j) reflects Congress' intent that in this highly technical area, decisions concerning the selection of remedies should be left to EPA, and those decisions should be accepted or rejected--not modified--by the district court under an arbitrary and capricious standard. While Congress has directed district courts to \"grant such relief as the public interest and the equities of the case may require, § 9606(a), Congress has also left the crafting of that relief in the hands of qualified experts to whom the President delegates authority. A reviewing court should not attempt to substitute its judgment for the expertise of EPA officials. Ours is the task of searching for errors of procedure, and serious omissions of substantive evidence, not the job of reformulating a scientific clean-up program developed over the course of months or years.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAside from the Hardage and Ottati \u0026 Goss courts, federal courts have consistently reviewed environmental remedies formulated under CERCLA on the basis of the administrative record under an arbitrary and capricious test. United States v. Wastecontrol of Florida, Inc., 730 F. Supp. 401 (M.D. Fla. 1989); In re Acushnet River \u0026 New Bedford Harbor, 722 F. Supp. 888 (D. Mass. 1989); United States v. Bell Petroleum Servs., Inc., 718 F. Supp. 588 (W.D. Tex. 1989); United States v. Seymour Recycling Corp., 679 F. Supp. 859 (S.D. Ind. 1987). Some courts, properly relying on the legislative history accompanying the statute, have also applied a three-part test of (1) fairness, (2) reasonableness, and (3) consistency with CERCLA's goals. See H.R. Rep. No. 253, Pt. 3 at 19, supra. This test is similar to the standards applied before the 1986 SARA amendments. United States v. Conservation Chemical Co., 628 F. Supp. 391, 400 (W.D. Mo. 1985); United States v. Seymour Recycling Corp., 554 F. Supp. 1334, 1337-38 (S.D. Ind. 1982). Review of consent decrees in our court as generally been conducted under similar standards. See United States v. Jones \u0026 Laughlin Steel Corp., 804 F.2d 348, 351 (6th Cir. 1986); Williams v. Vukovich, 720 F.2d 909, 920-23 (6th Cir. 1983).\n\nWe view the standard of fairness, reasonableness and consistency with the statute--our court's general test for consent decrees--coupled with the arbitrary and capricious standard of section 9613(j), to be the proper tests for EPA's proposed decree. We apply these tests to the administrative record before us, as did the district court. We must \"consider whether the decision was based on a consideration of the relevant factors and whether there has been a clear error of judgment.\" Citizens to Preserve Overton Park v. Volpe, 401 U.S. 402, 416, 28 L. Ed. 2d 136, 91 S. Ct. 814 (1971) (applying the arbitrary and capricious test of the Administrative Procedure Act, 5 U.S.C. § 706(2)(A)).\n\nThough judicial review of a proposed consent decree under CERCLA must be performed under the arbitrary and capricious test, with an evaluation of the fairness and reasonableness of EPA's decision, our review must be thorough and penetrating. One court, discussing its role in subjecting scientific evidence to the arbitrary and capricious standard of review has written:\n\nThere is no inconsistency between the deferential standard of review and the requirement that the reviewing court involve itself in even the most complex evidentiary matters. . . . The close scrutiny of the evidence is intended to educate the court. It must understand enough about the problem confronting the agency to comprehend the meaning of the evidence relied upon and the evidence discarded; the questions addressed by the agency and those bypassed; the choices open to the agency and those made. The more technical the case, the more intensive must be the court's efforts to understand the evidence, for without an appropriate understanding of the case before it the court cannot properly perform its appellate function.\n\nEthyl Corp. v. EPA, 176 App. D.C. 373, 541 F.2d 1, 36 (D.C. Cir. 1975) (en banc). In sum, in evaluating the efforts of an agency charged with making technical judgments and weighing complex data, we must give a proper degree of deference to the agency's expertise, see Lile v. University of Iowa Hospitals and Clinics, 886 F.2d 157 (8th Cir. 1989), yet also ensure that the agency has considered all of the relevant evidence in the record and has acted in the public interest.\n\nB. Evidence Submitted Outside of the Administrative Record\n\nThe State of Michigan contends that the affidavit of Robert A. Hayes should have been considered by the district court during its review process. This affidavit was filed with the district court on June 8, 1989. The affidavit indicates that Mr. Hayes is the Senior Hydrogeologist in the Compliance and Enforcement Section of the Environmental Response Division of the Michigan Department of Natural Resources in Lansing, Michigan. He holds bachelors degrees from Wayne State University, and is certified as a Professional Geologist by the American Institute of Professional Geologists. Hayes conducted geophysical tests in March 1989, studying the subsurface soils in six locations at the Rose Site.\n\nThe State of Michigan submitted the Hayes affidavit with its brief to the district court, but the court refused to consider the affidavit because it had not been part of the administrative record considered by EPA and the PRPs at the time they drafted and filed the consent decree for the court's approval on May 4, 1989. The district court held that since its review was limited to the administrative record, no additional supplementary materials could be considered by the court. Akzo Coatings, 719 F. Supp. at 582.\n\nThe failure to consider the affidavit was erroneous under the circumstances of this case. The district court allowed the State of Michigan to intervene in this action for entry of the consent decree on May 4, 1989, pursuant to Fed. R. Civ. P. 24 and 42 U.S.C. § 9621(f)(2)(B). The affidavit was filed the following month. CERCLA specifically provides that the State in which a remedial action plan is to be implemented should be given a reasonable opportunity to review and comment on the supporting technical data and engineering design of the plan. 42 U.S.C. § 9621(f)(1). The statute also provides for a public comment period before the court enters the consent decree as a final judgment.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The affidavit was filed over one month before the district court held a hearing on July 18, 1989 to consider approval of the consent decree. In light of the congressional intent expressed in the statute that public comment and state participation are to be encouraged and considered, we believe the district court improperly refused to accept the affidavit in June of 1989.\n\nMoreover, section 9613(j)(1) of CERCLA indicates that \"otherwise applicable principles of administrative law shall govern whether any supplemental materials may be considered by the court.\" Our reading of related administrative law cases suggests that a reviewing court may consider materials supplementary to the administrative record in order to determine the adequacy of the government agency's decision, even when the court's scope of review is limited to the administrative record.\n\nIn Norwich Eaton Pharmaceuticals, Inc. v. Bowen, 808 F.2d 486 (6th Cir. 1987), this court held that the district court had properly admitted evidence not found in the administrative record in reviewing a decision of the Food and Drug Administration. The additional evidence was required to determine whether the administrative record was adequate, and the district court based its decision on its review of the record. As the Ninth Circuit has stated:\n\nIt will often be impossible, especially when highly technical matters are involved, for the court to determine whether the agency took into consideration all relevant factors unless it looks outside the record to determine what matters the agency should have considered but did not.\n\nAsarco, Inc. v. EPA, 616 F.2d 1153, 1160 (9th Cir. 1980). Other courts have similarly held that a reviewing court evaluating agency action on the administrative record may consider additional evidence as either background information to aid the court's understanding, or to determine if the agency examined all relevant factors or adequately explained its decision. See Missouri Coalition for the Environment v. Corps of Engineers of the U.S. Army, 866 F.2d 1025 (8th Cir. 1989); Love v. Thomas, 858 F.2d 1347 (9th Cir. 1988); Abington Memorial Hosp. v. Heckler, 576 F. Supp. 1081 (E.D. Pa. 1983), aff'd, 750 F.2d 242 (3d Cir. 1984).\n\nHowever, the reviewing court \"must be careful not to allow such evidence to change the character of the hearing from one of review to a trial de novo.\" Town of Burlington v. Dep't. of Educ., 736 F.2d 773, 791 (1st Cir. 1984), aff 'd on other grounds, 471 U.S. 359, 85 L. Ed. 2d 385, 105 S. Ct. 1996 (1985). The court in Sterlingwear of Boston, Inc. v. United States, 11 Cl. Ct. 879 (1987), held that a court conducting record review of agency proceedings may make findings of fact de novo where a party has demonstrated that proposed evidence is newly discovered or was unavailable to the agency at the time of its administrative action. Even so, we decline to transform the entire review process into a de novo consideration of the evidence in light of the Hayes affidavit because of the express language of CERCLA, which limits our review to an arbitrary and capricious standard on the record. Furthermore, we believe that in a highly technical area such as the one at issue, federal courts are ill-equipped to engage in de novo review of such evidence presented to them during the public comment period prior to final entry of the decree.\n\nThe district court should have admitted the Hayes affidavit into evidence, but only for the purpose of determining the adequacy of EPA's decision, not in order to determine whether the decision was the best one available. We must inquire, as the district court should have done, whether the information contained in the Hayes affidavit is of such significance that the agency must reconsider its decision in light of the new information,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e or whether the affidavit, when weighed against all of the other evidence available to EPA at the time it agreed to the consent decree, is insufficient to overcome the deference accorded EPA's actions by a reviewing court applying the arbitrary and capricious test. We recognize that this places the federal courts in the delicate position of weighing the technical strength of new evidence, while at the same time asking them to defer to agency expertise in scientific matters. Nonetheless, this treatment of new evidence reflects the intent of the statute, and comports with the proper limited role of courts in reviewing CERCLA consent decrees, even as those courts accommodate the arrival of new information or significant adverse public comment.\n\nCertainly our decision on the proper consideration of the Hayes affidavit is not reached without some reservations. In other contexts, the Supreme Court has observed:\n\n\"Administrative consideration of evidence . . . always creates a gap between the time the record is closed and the time the administrative decision is promulgated. . . . If upon the coming down of the order litigants might demand rehearing as a matter of law because some new circumstance has arisen, some new trend has been observed, or some new fact discovered, there would be little hope that the administrative process could ever be consummated in an order that would not be subject to reopening.\"\n\nVermont Yankee Nuclear Power Corp. v. Natural Resources Defense Council, Inc., 435 U.S. 519, 554-55, 55 L. Ed. 2d 460, 98 S. Ct. 1197 (1978) (quoting ICC v. Jersey City, 322 U.S. 503, 514, 88 L. Ed. 1420, 64 S. Ct. 1129 (1944)). Nevertheless, it is our opinion that additional evidence can properly be considered in order to ensure the soundness of the agency's action. The standard may well prove much easier to apply than to define. If, in the court's admittedly unscientific judgment, some new evidence which was unavailable to the agency seems so significant that the agency's original action now seems questionable, the reviewing court should remand the consent decree so that EPA's experts can consider the new information. However, if the court finds that EPA would still have acted as it did even had the agency considered the new information, then the court may proceed to evaluate the consent decree on the administrative record using the arbitrary and capricious test.\n\nAside from the language of CERCLA and the case law concerning a district court's consideration of additional evidence when reviewing an agency's actions, our finding that the affidavit should have been considered by the district court is also sound from the viewpoint of public policy. In the technical and still-developing field of environmental science, new data regarding the efficacy of various cleanup remedies continues to come forward. We can imagine a situation in which EPA enters into a consent decree embodying a proposed remedy, and only after this decree is filed with the court does a scientific study come forward discrediting the selected remedy because the agency reached erroneous conclusions, or perhaps because cutting-edge studies indicate that the proposal is technically flawed. In such a case, Congress cannot have intended, and sound principles of justice cannot allow a reviewing court to close its eyes and ears to the new evidence. Were the court to enforce the decree simply because the information available to EPA at the time the decree was filed indicated that the remedial plan was not arbitrary or capricious, the court would surely not be acting in the best interests of the public if in fact the new data clearly showed that the plan would fail in its purpose.\n\nUndoubtedly, a district court's response to new data in general, and the Hayes affidavit in this case, must be guided by the contents of the new evidence and its relationship to the balance of the evidence that was before the administrative agency. We must engage, as the district court in this case should have engaged, in an evaluation of the Hayes affidavit and its possible effect on EPA's decision to enter into the consent decree.\n\nV. WHETHER THE CONSENT DECREE IS ARBITRARY AND CAPRICIOUS\n\nThe State of Michigan first argues, along with amici curiae, that EPA's decision to modify its ROD and consent decree to include soil flushing as a remedy for the Rose Site was arbitrary and capricious because the record does not support EPA's conclusion that the Site is conducive to soil flushing. Under the arbitrary and capricious standard, a lower court's discretionary action \"cannot be set aside by a reviewing court unless it has a definite and firm conviction that the court below committed a clear error of judgment in the conclusion it reached upon the weighing of the relevant factors.\" McBee v. Bomar, 296 F.2d 235, 237 (6th Cir. 1961). Cf. Motor Vehicle Manufacturers Ass'n v. State Farm Mutual, 463 U.S. 29, 43, 77 L. Ed. 2d 443, 103 S. Ct. 2856 (1983) (In articulating the arbitrary and capricious standard, the Supreme Court stated that it would \"uphold a decision of less than ideal clarity if the agency's path may reasonably be discerned.\").\n\nThe 1987 RI/FS and ROD identified soil flushing as not applicable at the site for the following reasons:\n\na. The soils are marginally suitable for this technology because of variable permeabilities;\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nb. The soils contain both soluble and insoluble chemicals -- flushing is only reliable for soluble chemicals and would have to be used with another technology to remove the entire source;\n\nc. Pilot testing would have to be performed before such a remedy is implemented; and\n\nd. Flushing is not well demonstrated, especially in cold weather environments like that of Michigan.\n\nFor the reasons that follow, we believe that the concerns noted in the RI/FS have all been adequately addressed by EPA in the ESD it published when it filed the decree with the district court. See generally Exh. 3.18, Explanation of Significant Differences.\n\nAs evidenced by its placement at the top of EPA's concerns in 1987, there is no question that EPA originally considered the soil conditions at the Rose Site to be the prime deterrent to the use of soil flushing. However, after the RI/FS was performed and after more soil samples were taken, EPA found that the soils to be flushed were not as complex as once thought:\n\nRecall from the RI/FS and the [original] ROD that any contaminated soils below the water table would not be excavated and incinerated (since no PCBs are present in those soils). This includes clays. While the entire site may be geologically complex, only a small portion is intended to be evaluated for flushing. In that area some clays are present -- either on the surface ([where] PCB removal [will be done by excavation and incineration]) or at or below the water table. Thus, a good portion of the clay problem either will be addressed or treated as in the [original] ROD.\n\nExh. 3.22b, Responsiveness Summary, at 21 (emphasis added). The ROD amendment likewise specifies:\n\nIf one examines the logs of soil borings taken at Rose . . ., it can be seen that clay lenses are not present in the entire contaminated area which would need to be flushed. Although the geology of the entire site as a whole is rather complex, the geology of the contaminated subsurface soils may not be. In some areas clay zones are found only in the water table. Other areas find clay at the surface which may have to be excavated due to the presence of PCB contamination.\n\nExh. 3.22a, ROD amendment, at 3 (emphasis in original). Amici admit that \"the contaminated zones are not underlain by clay layers 10 to 40 feet thick, as are some of the non-contaminated areas,\" but nevertheless argue that Figure 5-7, one of the soil boring charts on which the district court relied, \"indicates continuation of clay layers through the areas of contamination.\"\n\nThat chart alone, however, does not persuade us that soil flushing should be avoided at the Rose Site. We recognize that at least six of the two dozen or more soil borings taken in the Southwest area of the site reveal a more complicated geology than does Figure 5-7. However, two of those soil borings, one of which is located near the outer perimeter of the area to be flushed, did not detect volatile organic compounds. Compare Exh. 3.1a, Figure 5-7, Profile A-A' with Exh. 3.1b, Soil Boring Logs RW 6D, RW 8D. Hence, the effectiveness of soil flushing in those areas of the site is not of prime importance. While two other borings revealed clay mixed with silt and sand from ground level down to six and seven feet respectively, Exh. 3.1b, Soil Boring Logs RW4, RWD 5, the excavation of PCB-contaminated soil may take care of most, if not all, of those clay layers.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nOne of the soil borings near the center of the area to be flushed does reveal quite a bit of clay at depths from 4.5 to 14.5 feet deep and 14.5 to 19.5 feet deep. The groundwater level at that location was measured at 22.52 feet. Id. Soil Boring RW 7. Thus, the clay layer in that location can be expected to interfere with the infiltration of flush water to the groundwater. In addition to clay, this boring--as well as most of the soil borings previously discussed--reveals varying amounts of silt, sand and/or rock, all of which vary the soil's permeability and raise the issue as to exactly how much interference with the flushing process there will actually be.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e It must be emphasized, however, that the Remedial Action Plan (\"RAP\") annexed to the consent decree expressly requires that the settling defendants demonstrate to EPA, both in a laboratory and on-site, that soil flushing will work before it is implemented. The required demonstration includes additional field tests to further define the permeability of the soils.\n\nBased on our thorough review of the scientific evidence in the record, we do not find EPA's decision to experiment with soil flushing at the Rose Site to be arbitrary or without foundation. Nor does the Hayes affidavit (see supra), when viewed in light of the other evidence available to EPA at the time it agreed to the consent decree, render EPA's most recent conclusions on the soil permeability of the Rose Site inadequate.\n\nAs stated in the fact summary, Hayes and two other Michigan Department of Natural Resources (\"MDNR\") geologists visited the Rose Site in March of 1989 to conduct geophysical tests (gamma, neutron and gamma-gamma logs) on six monitoring wells previously installed on the site. Five of the wells are located within the area where the PRPs propose to use soil flushing, and the sixth well is less than one hundred feet from that area. \"The purpose of these tests was to analyze the accuracy of the well driller's logs for those six well locations.\" Hayes Affidavit, Jt. App. at 533. The geophysical logs, according to Hayes, \"indicate that the drilling logs of the monitor wells tested are not very accurate with regard to detailed descriptions of the site geology.\" Id.\n\nHowever, the difference in accuracy between the two types of logs performed on the Site does not appear to be substantial enough to overcome the deference accorded to EPA's decision. While it is claimed that the geophysical logs differentiate sand and clay zones precisely whereas the drilling logs conglomerate them into a stew of clay, silt, sand, and gravel,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e in general the former logs reveal the existence of clay layers at approximately the same depths as do the drilling logs. Consequently, much of the evidence the Hayes affidavit presents is only \"supplementary\" rather than \"new,\" and not necessary to our determination whether the agreement embodied in the decree is adequate. See, e.g., Asarco, Inc. v. United States EPA, 616 F.2d 1153, 1160 (9th Cir. 1980).\n\nFurthermore, whether the geophysical logs are capable of providing heightened soil type and permeability differentiation (as well as revealing any previously undiscovered\" clay layers) boils down to a credibility determination. The state does not argue that EPA's methods at the Rose Site to determine soil permeability are unconventional, but only that the geophysical tests are more accurate. \"When specialists express conflicting views, an agency must have discretion to rely on the reasonable opinions of its own qualified experts even if, as an original matter, a court might find contrary views more persuasive.\" Marsh v. Oregon Natural Resources Council, 490 U.S. 360, 378, 104 L. Ed. 2d 377, 109 S. Ct. 1851 (1989). We are not equipped to engage in the same technical evaluations of conflicting evidence that EPA and other experts are daily performing, especially when the evidence was submitted outside the administrative record. Fortunately, CERCLA does not ask us to do so, and we decline to proceed beyond the review procedures established in the statute. In sum, we do not find the Hayes affidavit to be of such significance that EPA must reconsider its selection of remedies for cleanup of the Rose Site.\n\nWe also believe that EPA's responses to Comments about the decree offered by residents, state agencies and politicians demonstrates the sufficiency of EPA's reconsideration of soil flushing as a potentially viable remedy for the Rose Site subsurface soils. For example, one of the main concerns expressed to EPA was that the clay lenses at the site may render grossly inaccurate the required testing defendants must conduct to measure soil flushing's effectiveness. Illustrative are the following comments: \"Using flushate monitor wells to determine what can or cannot be flushed from the site soils . . . is neither logical nor scientifically defensible\" because \"flushate monitor wells receive flushate that percolates downward only in the vicinity above and around the well.\" Accordingly, the wells \"are not representative of the entire soil contamination\" due to \"unequal distribution of contamination coupled with the potential effect of channelization of flushwater [which] may result in varied concentrations and types of contaminants in samples collected only a few feet apart.\" Exh. 3.22b, Responsiveness Summary, at 7.\n\nEPA, however, has always recognized its responsibility to make sure the potential problems associated with the testing, as well as the implementation, of soil flushing are resolved before the cleanup begins: \"The above comments involve design criteria. All these and more will need to be satisfactorily addressed by the PRPs before EPA allows flushing to occur at Rose. EPA believes that an adequate confirmational sampling system can be devised, however.\" Id. at 7-8. Actual placement and locations \"of extraction and monitoring wells will be discerned after the hydrogeologic studies called for in the RAP are performed.\" Id. at 14. The groundwater extraction and treatment system \"will be in place to retain chemicals that may be missed by the flushing operation.\" Id. at 8. Moreover, adequate soil sampling should reveal whether and to what extent there are individual pockets of missed residuals, which \"will need to be addressed by the PRPs before they finish flushing.\" Id. at 8.\n\nWhile we have some concern for the current lack of concrete data as to exactly how effective soil flushing will be at the Rose Site, we are satisfied that EPA will obtain sufficient information to decide whether or not to implement soil flushing, and if so, to maintain its effectiveness. A conceptual model (drawing) of the flushing remedy was handed out by defendants at a public meeting in October, 1988. EPA stated that an actual working model would be made after laboratory testing was finished and the results would then be compiled and presented to the public. \"At that time, U.S. EPA will decide as to whether flushing may be performed in the field.\" Id. The gathering of concrete data would then continue after implementation of soil flushing was allowed. Under the decree, defendants must provide EPA with monthly progress reports; they are required to update EPA annually on the effectiveness of the soil flushing system; and \"are obliged to make all adjustments necessary to maximize\" its effectiveness. After five years of soil flushing, defendants must demonstrate to EPA that the soil flushing system will clean up the subsurface soil within ten years, or else they must adopt some other method. Exh. 3.18, Explanation of Significant Differences, at 3. In addition, defendants are subject to fairly heavy fines for failure to provide the reports and for delays in implementation of the proposed remedial scheme.\n\nWe find EPA's information-gathering timetable to be rational. Cf. United States v. Cannons Engineering Corp., 899 F.2d 79, 88 (1st Cir. 1990) (\"It would deserve a \"principal end of the statute--achievement of prompt settlement and a concomitant head start on response activities--to leave matters in limbo until more precise information was amassed.\"). We also believe the consent decree provides adequate safeguards to ensure the veracity and timeliness of the required test results. Cf. United States v. Hooker Chemicals \u0026 Plastics Corp., 540 F. Supp. 1067, 1074 n.3 (W.D.N.Y. 1982) (the decree and proposed remedy should not await completion of the tests required to better delineate the extent of chemical migration because the agreement provides adequate safeguards to ensure the veracity of the test results). For instance, the settling defendants must \"assure that U.S. EPA personnel or authorized representatives are allowed access to any laboratory utilized by [them] in implementing this Consent Decree.\" Consent Decree VIII.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nMoreover, the record reveals that soil flushing is already occurring at the Rose Site. The proposed soil flushing program will basically accelerate the natural process of flushing. It is\n\nlogical to assume that low permeable soils would have also redirected contaminants away as they migrated towards the water table. In essence, flush water may follow nearly the same paths as the contaminants. Thus, highly permeable soils that are more heavily contaminated will be more intensely flushed than less permeable soils which are less contaminated.\n\nId. at 21. The important distinction between the natural process now occurring and the proposed remediation program is that the flushate will be captured by extraction wells after it passes through the contaminated soils, and then returned to the surface for treatment. In sum, we feel EPA has adequately explained the reversal of its prior conclusion that the Rose Site \"soils are marginally suitable due to variable permeability.\"\n\nThe second reason EPA originally rejected soil flushing has also been satisfactorily resolved by the amended ROD. The ROD recognized that soil flushing, if used at all, would need to be used in conjunction with other technology to effectively clean up the Site and remove the insoluble chemicals in the soils. The amended ROD complies with that concern, as soil flushing is to complement excavation and incineration and not to wholly substitute for the original remedy. Thus, most of the insoluble chemicals in the surface soils which cannot be flushed out, namely the PCBs and lead, will be excavated before soil flushing of the subsurface soils contaminated with soluble chemicals occurs.\n\nThe decree also unquestionably resolves the third reason why soil flushing was screened out, i.e. pilot testing had not been performed. As noted earlier, pursuant to the ROD amendment and the decree, pilot testing of the proposed remedy will be performed on the site. It must be shown through laboratory or pilot studies that flushing would remove hazardous chemicals to such a degree that the operation would be as protective as removal of hazardous chemicals by excavation and thermal destruction. Otherwise, full scale flushing activities may not occur.\" Exh. 3.22a, ROD Amendment, at 3 (emphasis added).\n\nFinally, while EPA originally expressed some concern that soil flushing may not work well in cold climates, that remedy has already been selected at three sites in Michigan with the state's concurrence. See, e.g., Exh. 3.8, ROD for U.S. Aviex Site, at 25-26. Even assuming it is a significant impediment to soil flushing, cold weather does not pose a problem all year long. Moreover, EPA will apparently require that the \"equipment . . . be designed to enable its operation during the winter.\" Exh. 3.22a, Responsiveness Summary, at 21.\n\nAccordingly, we are satisfied that EPA has adequately explained its change of position. As evidenced by language in the 1987 ROD, in which the state concurred, EPA contemplated reopening the decision if soil flushing was found to be \"practical\" and \"less expensive.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The public was therefore put on notice that soil flushing might be re-examined in the near future. In evaluating the potential effectiveness of soil flushing at this particular site, EPA considered the RODs from four other sites at which soil flushing was used as a remedy as well as numerous articles discussing the use of soil flushing. The agency has also published and performed its own studies on the use of soil flushing to cleanup hazardous waste sites some of which had clayey soils,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and thus is keenly aware of the remedy's limitations. See Exh. 3.2-3.11; Jt. App. at 357-410. Further, the Gradient Corporation, an environmental consulting firm, concluded that soil flushing would remove virtually the same amount of chemicals from the subsurface soil at the Rose Site as would incineration. Exh. 3.21i, Gradient Corporation Memorandum, at 11 (Oct. 26, 1988). Finally, it should be emphasized that while relatively new, soil flushing is nevertheless a \"proven\" technology.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Exh. 3.8, ROD for U.S. Aviex Site, at Table 7. In addition to three sites in Michigan, as of March 1988 soil flushing was in use in various foreign countries and at a total of thirteen different Superfund sites.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAn administrative agency should not be, and is not under CERCLA, estopped by its prior precedent from altering its decisions due to increased expertise. Michigan v. Thomas, 805 F.2d 176, 184-85 (6th Cir. 1986); 42 U.S.C. § 9617(c). We believe EPA's conclusion that soil flushing (1) may work as well as incineration for the VOC-contaminated soils, (2) is protective of the human health and environment, and therefore (3) satisfies CERCLA's preference for remedies that utilize permanent and innovative treatment to the maximum extent practicable to reduce toxicity, mobility or volume of hazardous substances, see exh. 3.22a, at 1, is rational and supported by the record. No clear error of judgment was made by the district court in approving EPA's change of position. See McBee, 296 F.2d at 237.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nVI. WHETHER THE DECREE IS FAIR, REASONABLE AND ADEQUATE\n\nAs we have observed earlier, in addition to determining whether a decree is rational and not arbitrary or capricious, we must satisfy ourselves that the terms of the decree are fair, reasonable and adequate -- in other words, \"consistent with the purposes that CERCLA is intended to serve.\" H.R. Rep. No. 253, 99th Cong., 1st Sess. Pt. 3 at 19, supra; United States v. Hooker Chemical \u0026 Plastics Co., 607 F. Supp. 1052, 1057 (W.D.N.Y. 1985) (citation omitted). While we are to \"eschew any rubber stamp approval in favor of an independent evaluation,\" City of Detroit v. Grinnell Corp., 495 F.2d 448, 463 (2d Cir. 1974), we may not substitute our own judgment for that of the parties to the decree. United States v. Jones \u0026 Laughlin Steel Corp., 804 F.2d 348 (6th Cir. 1986) (a reviewing court may not modify but only approve or reject a consent decree). Protection of the public interest is the key consideration in assessing whether a decree is fair, reasonable and adequate. Acushnet River \u0026 New Bedford Harbor: Proceedings re Alleged PCB Pollution, 712 F. Supp. 1019, 1028 (D. Mass. 1989); United States v. Ketchikan Pulp Co., 430 F. Supp. 83, 86 (D. Ala. 1977).\n\nIn determining whether a decree is \"fair,\" courts have considered the following: \"the strength of plaintiffs case, the good faith efforts of the negotiators, the opinions of counsel, and the possible risks involved in the litigation if the settlement is not approved.\" Hooker Chemical \u0026 Plastics Co., 607 F. Supp. at 1057; Cannons Engineering Corp., 720 F. Supp. at 1039-40. \"Fairness should be evaluated from the standpoint of signatories and nonparties to the decree.\" Conservation Chemical Co., 628 F. Supp. at 401. \"The effect on non-settlers should be considered, but is not determinative in the court's evaluation.\" Cannons Engineering Corp., 720 F. Supp. at 1040 (citing Acushnet River, 712 F. Supp. at 1029).\n\nThe good faith efforts of the parties to the decree are evidenced by the voluminous record, the arms-length negotiation process and the manifested willingness of EPA to thoroughly consider all oral and written comments made with regard to the proposed decree. The State of Michigan itself was involved for more than six months in the post-1987 ROD negotiations that led to an amended ROD and the consent decree before it eventually withdrew from the settlement discussions. See Exh. 3.12, Rose Township Chronology of Events. We note and emphasize that at one time during the negotiation process between EPA and the PRPs, the state was willing to consider soil flushing under conditions similar to those imposed by the consent decree. See Exh. 3.14, Letter from Gary Guenther, Chief Environmental Response Division (MDNR) to Basil Constantelos, Director of Waste Management Division (EPA) (May 20, 1988) [hereinafter \"Letter from Guenther\"]; Exh. 3.12, Rose Township Chronology of Events. The only significant difference between the settlement contemplated by the state and the consent decree at issue is that the latter does not incorporate a specified remedy should soil flushing fail. Id. Exh. 3.14, Letter from Guenther.\n\nThe respective legal positions of the parties also militate in favor of the settlement. The strength of the government's case against defendants is not well documented at this point. The settling defendants have maintained throughout this litigation that the evidence linking them to the Rose Site is extremely tenuous. Consequently, if the decree is overturned, the parties will no doubt engage in a protracted legal battle over liability and the appropriate remedy for the Site. In enacting the 1986 amendments to CERCLA, however, Congress sought to \"expedite effective remedial actions and minimize litigation.\" 42 U.S.C. § 9622(a). We have stated before that one of CERCLA's main goals is \"the prompt cleanup of hazardous waste sites.\" Walls v. Waste Resource Corp., 761 F.2d 311, 318 (6th Cir. 1985). Given that (1) liability of the settling defendants is presently uncertain and (2) dumping at the site started some twenty years ago, we are sensitive to EPA's desire to finalize a remedial plan and force the PRPs to get on with the job and clean up a long-standing mess.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Cf. United States v. Cannons Engineering Corp., 899 F.2d 79, 90 (1st Cir. 1990) (\"If the case is less than robust, or the outcome problematic, a reasonable settlement will ordinarily minor such factors.\"); United States v. McGraw-Edison Co., 718 F. Supp. 154, 159 (W.D.N.Y 1989) (settlement reasonable in light of prospect of protracted litigation as contrasted to expeditious reimbursement and remedy).\n\nMoreover, we are faced with a presumption in favor of voluntary settlement. That presumption is particularly strong where a consent decree has been negotiated by the Department of Justice on behalf of a federal administrative agency like EPA which enjoys substantial expertise in the environmental field. United States v. Cannons Engineering Corp., 899 F.2d 79, 84 (1st Cir. 1990). We note that a settlement \"is not an opportunity to avoid any of the cleanup requirements or procedures of the act.\" 132 Cong. Rec. S 14,918 (daily ed. Oct. 3, 1986) (Statement of Sen. Mitchell). As discussed in subsection VII B, infra, however, the decree incorporates all \"cleanup requirements\" imposed by CERCLA and SARA, and the \"procedural requirements\" of these acts are not contested. In evaluating the decree, it is not our function to determine whether this is the best possible settlement that could have been obtained, but only whether it is fair, adequate and reasonable. See, e.g., Durrett v. Housing Auth., 896 F.2d 600, 603-04 (1st Cir. 1990). Accordingly, based on the legal posture of the parties, the nature of the negotiation process that led to the decree, and the need to expedite the cleanup at the Rose Site, we agree with the district court that this settlement is fair.\n\nIn determining whether a consent decree is \"reasonable\" courts have considered the following: the nature/extent of hazards; the degree to which the remedy will adequately address the hazards; possible alternatives for remedying hazards; and the extent to which the decree furthers the goals of the statute. Cannons Engineering Corp., 720 F. Supp. at 1038. See also Conservation Chemical, 628 F. Supp. at 391; United States v. Seymour Recycling Corp., 554 F. Supp. 1334, 1339 (S.D. Ind. 1982). \"These criteria reflect the court's 'limited duty' to inquire into the technical aspects of the cleanup program proposed by a consent decree in order to ensure that the proposed settlement adequately addresses environmental and public health concerns. Seymour Recycling Corp., 554 F. Supp. at 1038 (citing Hooker Chemical \u0026 Plastics Corp., 540 F. Supp. at 1072).\n\nThe most important of these \"reasonableness\" factors, the decree's likely effectiveness as a vehicle for cleansing the Rose Site, has already been addressed under the arbitrary and capricious standard and thus will not be re-examined. See Marsh, 490 U.S. at 377 n.23. In our opinion the decree is binding on the settling defendants. Therefore, contrary to amici's suggestion, the fact that the decree fails to spell out an alternate remedy in the event soil flushing fails does not give settling defendants carte blanche. Should soil flushing prove to be unfeasible, the selection of a significantly different alternative remedy would be subject to the public participation requirements in section 9617 and state participation requirements in section 9621(f), as well as judicial review under section 9613(h)(4).\n\nMoreover, regardless of the effectiveness of soil flushing which must be proven within specific time limits, defendants are required to remedy the site to Phase I TCLs. Once Phase I TCLs have been met, cleanup to Phase II TCLs (ARARs) will be performed by EPA. In other words, should soil flushing be rejected, the settling defendants would still have an incentive to make sure that whatever remedial action were implemented in its place attained all ARARs and did not further degrade the environment.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e As long as ARARS will be attained, no CERCLA provision prohibits the use of open-ended remedial schemes. In fact, section 9621(d)(4)(a), discussed infra in subsection VIIB, implicitly provides support for such decrees.\n\nWe find that the Rose Site decree is carefully structured so as to ensure the protection of human health and the environment while providing reasonable flexibility to the PRPs. For the hazardous chemicals common to both the sites, the Rose Site TCLs are at or below (more stringent than) the levels agreed to by the State of Michigan at the U.S. Aviex Site, where soil flushing is also to be used. Both the Rose Site Phase I and Phase II cleanup standards are at or substantially below the MCLs, which are promulgated water standards under the Safe Drinking Water Act (\"SDWA\"). When remediated to the Phase I levels, the groundwater at the site will be as clean or cleaner than water which is acceptable for the 245 million people in this country to drink. See Exh. A, attached to Brief for Settling Defendants.\n\nOther courts have accepted open-ended decrees. See Partial Consent Decree, Cannons Engineering Corp., 720 F. Supp. at 1027 (\"If the sampling results indicate that the remedial goal has not been attained, a decision will be made to either continue vacuum extraction for a specified length of time and resample, or to complete the remedy with some other suitable technology.\"); Hooker Chemical \u0026 Plastics Corp., 540 F. Supp. at 1076-77 (while the decree is not specific as to methods to be utilized to prevent further contamination should remedies already specified fail, it is nevertheless reasonable and in the public's best interest). We find no reason to strike down the open-ended provision of this decree.\n\nAs CERCLA recognizes, the cleanup of hazardous wastes involves too many variables not to allow the settling defendants to carefully test viable, cost-effective remedies at a particular site. Indeed, the original ROD to which the state consented also allowed for the substitution or modification of the proposed remedy, i.e. excavation and incineration, in the event cost became a factor.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The decree's failure to specify an alternative remedy may in fact be in the public's best interest, as it allows the parties to consider the nature of remaining contamination, the effect of changed soil conditions, and the use of new remedial technologies. Cf. Akzo Coatings, 719 F. Supp. at 585. Already there are other methods to remove VOCs from soil besides incineration, such as thermal aeration and vacuum extraction.\n\nIn determining the reasonableness of a consent decree, we must also consider the cost effectiveness of its proposed remedial action. See 42 U.S.C. § 9621(b). Assuming soil flushing proves to be feasible at the Rose Site, it will result in the accomplishment of the same TCLs set forth in the 1987 ROD at 29% of the cost of the original remedy. While a lot of money may be saved through the use of soil flushing, we find no evidence of a sweetheart deal here between EPA and defendants. The settling defendants must meet Phase I TCLs regardless of cost. It is estimated that the $500,000 to be placed by defendants in a trust fund to pay for the costs of cleanup from Phase I TCLs to Phase II TCLs will grow to about $1,200,000 before it will be needed, and that sum, EPA concludes, should be sufficient to finish the cleanup. With those funds, EPA will operate the water extraction and monitoring systems already in place. In response to the public comment that the PRPs should themselves perform the entire cleanup, EPA stated:\n\nWe believe that it was important to reach a settlement for this case to save the Superfund $30 million, although it means taking on the small burden of continuing the cleanup using the trust funds. Since the Settling Defendants are paying for the trust fund as well as the site work, the main burden of cleanup is in fact on them.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nExh. 3.22b, Responsiveness Summary, at 13. In accordance with CERCLA's goals, the primary and the ultimately forseeable financial responsibility is on the settling defendants. See Walls v. Waste Resource Corp., 761 F.2d 311, 318 (6th Cir. 1985) (\"It is clear that the statute was designed primarily to facilitate the prompt cleanup of hazardous waste sites by placing the ultimate financial responsibility for cleanup on those responsible for the hazardous wastes.\").\n\nIn addition, we find that the time required for the total cleanup of the site, while most likely extended a few years due to the incorporation of the soil flushing remedy, is not unreasonable. Indeed, the time required to comply with the decree's remedial requirements may not be significantly longer than that required for the remedy as originally proposed. Soil flushing may extend the cleanup to 10 to 15 years. However, \"two or three years of incineration would not have ended work at the site, for the groundwater extraction and treatment system was estimated to be operated for an additional 6 to 10 years afterward.\" Exh. 3.22b, Responsiveness Summary for ROD Amendment, at 15. The 1987 ROD estimated that if the decree was signed in 1987, groundwater treatment might continue until at least 1999. In other words, the site will be affected for a long time no matter how the cleanup is performed.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e But if this settlement is rejected, the time required to remedy the site will inevitably be lengthened by several more years.\n\nIt must also be emphasized that, like soil flushing, excavation and incineration are not perfect remedies either. Unlike the case with PCB-contaminated soil, there is a significant risk of release of the VOCs into the atmosphere if such soils are excavated. Exh. 3.1(e), Hart Review of E.C. Jordan Final Report for the Rose Township, at 27 (Aug. 19, 1987). Difficulties may also occur with air emissions during the incineration phase of the remedy. Id.; Akzo Coatings, 719 F. Supp. at 587 (The district court pointed out \"the potential dangers of dust and ash exposure that are associated with soil incineration.\"). Moreover, incineration will not destroy the metals in the soil, \"but what may happen is they will be rendered immobile and thus less hazardous\" and consequently \"further treatment may be necessary for the wastewater and/or ash.\" Exh. 3.1c, Responsiveness Summary for 1987 ROD, at 3.\n\nDeemed \"protective of human health and the environment\" (See 42 U.S.C. § 9621(b)) at other sites by both EPA and the state, soil flushing as used in conjunction with other technologies over which there is no dispute should be given the same chance at the Rose Site. The First Circuit recently stated: \"Congress intended, first, that the judiciary take a broad view of proposed settlements, leaving highly technical issues . . . to the discourse between parties; and second, that the district courts treat each case on its own merits, recognizing the wide range of potential problems and possible solutions.\" United States v. Cannons Engineering Corp., 899 F.2d 79, 85-86 (1st Cir. 1990). When viewed as a whole, the decree is reasonable. See also United States v. Rohm \u0026 Haas Co., 721 F. Supp. 666, 685-86 (D. N.J. 1989) (\"For this settlement to be reasonable, it need not be bottomed on the most convincing analysis of the present factual record, it must merely be reasonable when measured by the range of plausible interpretations of that record.\").\n\nThis decree accomplishes the two principal goals of CERCLA, ensuring prompt effective remedial action while placing the financial burden of the cleanup on the PRPs. Walls, 823 F.2d at 978-79. Accordingly, we find that the decree, which requires the implementation of soil flushing (if proven effective) or an alternative permanent remedy for subsurface soils, plus incineration and a water extraction and treatment system, is a fair, reasonable and adequate settlement.\n\nVII. WHETHER THE PROPOSED DECREE COMPLIES WITH THE LAW\n\nIn their challenges to the legality of the decree and the district court's judgment, the parties raise five significant issues. Defendants argue that the district court erred in its ruling that Michigan's anti-degradation law is an applicable or relevant and appropriate environmental requirement (\"ARAR\"). The State of Michigan, on the other hand, questions whether the decree's remedial action will attain potential state ARARs. Next, the state argues that soil flushing by definition violates Michigan's anti-degradation law, allegedly a state ARAR. The fourth issue concerns the validity of the decree insofar as it contains a covenant not to sue. Finally, we consider defendants' allegation that EPA must enter \"into a contract or cooperative agreement\" with the State of Michigan prior to providing remedial action at the Rose Site. These issues will be addresses sequentially.\n\nA. Whether Michigan's Anti-degradation Law is an ARAR\n\nThe State of Michigan and amici curiae contend that the proposed remedy is not in accordance with the law because it does not meet the state's ARARs. Under CERCLA, the remedial action selected must comply with identified state ARARs that are more stringent than applicable federal standards unless the ARARs are waived. The relevant provision provides in part:\n\nWith respect to any hazardous substance, pollutant or contaminant that will remain onsite, if (i) any standard, requirement, criteria, or limitation under any Federal environmental law, . . . or (ii) any promulgated standard, requirement, criteria, or limitation under a State environmental . . . law that is more stringent than any Federal standard, . . . is legally applicable to the hazardous substance or pollutant or contaminant concerned or is relevant and appropriate under the circumstances, . . . the remedial action selected . . . shall require, at the completion of the remedial action, a level or standard of control for such hazardous substance or pollutant or contaminant which at least attains such legally applicable or relevant and appropriate standard, requirement, criteria, or limitation.\n\n42 U.S.C. § 9621(d)(2)(A). Before deciding whether the decree must comply with such laws, we need to determine whether there are any state ARARs applicable to the Rose Site.\n\nThe district court found that the Michigan Water Resources Commission Act (\"WRCA\"), and its corresponding agency rules, Mich. Admin. Code R. 323.2201 (1980), et seq., (\"Part 22 Rules\") satisfy each of the criteria for ARARs to which a proposed remedy must comply under section 9621(d). Section 6(a) of the WRCA provides, in part:\n\nIt shall be unlawful for any persons directly or indirectly to discharge into the waters of the state any substance which is or may become injurious to the public health, safety, or welfare; or which is or may become injurious to domestic, commercial, industrial, agricultural, recreational or other uses which are being or may be made of such waters. . . .\n\nM.C.L.A. § 323.6(a) (emphasis added). The corresponding agency rules, the Part 22 Rules, provide for the nondegradation of groundwater in usable aquifers. Mich. Admin. Code R. 323.2205 (1980). Defendants challenge the district court's conclusion that said Michigan law and rules, collectively referred to as Michigan's anti-degradation law, qualify as a state ARAR.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nUnder 42 U.S.C. § 9621(d), supra, a state environmental requirement or standard constitutes a state ARAR to which the remedy must comply if it is (1) properly promulgated, (2) more stringent than federal standards, (3) legally applicable or relevant and appropriate, and (4) timely identified.\n\n1. Whether Michigan's Anti-degradation Law is Properly Promulgated\n\nTo be considered an ARAR, the anti-degradation law must be \"promulgated.\" 42 U.S.C. § 9621(d)(2)(A)(ii). According to EPA, \"promulgated\" as used in section 9621 refers to \"laws imposed by state legislative bodies and regulations developed by state agencies that are of general applicability and are legally enforceable.\" EPA, Superfund Program; Interim Guidance on Compliance with Applicable or Relevant and Appropriate Requirements; Notice of Guidance, 52 Fed. Reg. 32495, 32498 (Aug. 27, 1987) [hereinafter Interim Guidance]. See also Preamble, National Oil and Hazardous Substances Pollution Contingency Plan, 55 Fed. Reg. 8666, 8841 (Mar. 8, 1990) (codified at 40 C.F.R. § 300.400(g)(4)) [hereinafter NCP, Final Rule ]. EPA evidently desired to differentiate \"advisories, guidance, or other non-binding policies, as well as standards that are not of general application,\" Interim Guidance, 52 Fed. Reg. at 32498, from laws or rules promulgated by state legislatures or agencies that are imposed on all citizens of a particular state, which is the case with Michigan's anti-degradation law since it was enacted by the Michigan legislature, and the accompanying administrative rules were properly developed by the Michigan Water Resources Commission. Akzo Coatings, 719 F. Supp. at 583.\n\nWhile defendants concede that Michigan's anti-degradation law has general applicability, they contend that it was not properly promulgated because its vagueness and lack of a quantifiable standard render it legally unenforceable.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e A standard is not constitutionally vague if it is drafted \"with sufficient definiteness that ordinary people can understand what conduct is prohibited and in a manner that does not encourage arbitrary and discriminatory enforcement.\" Kolender v. Lawson, 461 U.S. 352, 357, 75 L. Ed. 2d 903, 103 S. Ct. 1855 (1983). As noted above, the WRCA does not permit an one \"directly or indirectly to discharge into the waters of the state any substance which is or may become injurious to the public health, safety, or welfare; or . . . to domestic, commercial, industrial, agricultural, recreational or other uses. . . .\" We believe such a standard is \"sufficiently specific to provide a fair warning that certain kinds of conduct are prohibited.\" Colten v. Kentucky, 407 U.S. 104, 110, 32 L. Ed. 2d 584, 92 S. Ct. 1953 (1972).\n\nTo be sure, when the WRCA was enacted in 1929 the Michigan legislature may have intended \"injurious\" to mean concentrations of contaminants measurable only in parts per thousand rather than parts per billion or per trillion, as we are capable of measuring today. However, any legislature desiring to prohibit \"immoral conduct,\" for example, faces the same dilemma because the standard of what constitutes acceptable conduct changes over time. Cf. Fowler v. Board of Educ., 819 F.2d 657, 664-65 (6th Cir. 1987) (due to the need to govern wide ranges of conduct, various courts including the Supreme Court have rejected vagueness challenges to laws prohibiting federal or state employees from engaging in \"misconduct,\" \"immorality,\" or \"conduct unbecoming\").\n\nMoreover, section 323.5 of the WRCA expressly requires the Water Resources Commission to \"establish pollution standards for lakes, rivers, streams, and other waters of the state. . . .\" As we find is the case with section 323.6 of the WRCA, the Part 22 Rules which prohibit \"degradations\" of \"groundwaters in any usable aquifer which would deteriorate the local background groundwater quality,\" Mich. Admin. Code R. §§ 323.2202(g), 323.2205, are neither vague nor unenforceable. Likewise, the fact that a \"degradation\" of groundwaters may occur only when it is \"determined by the commission to be a deterioration in terms of magnitude of the change and importance of the parameters describing groundwater quality,\" id. § 323.2202(g), does not render Michigan's anti-degradation law constitutionally infirm. The \"background water qualify,\" measured by a hydrogeological study as required under the Part 22 Rules, provides a standard beyond which would-be polluters may not pollute. According to EPA, \"general State goals that are duly promulgated (such as a non-degradation law) have the some weight us explicit numerical standards, although the former have to be interpreted in terms of a site and therefore may allow more flexibility in approach.\" Interim Guidance, 52 Fed. Reg. at 32,498 (emphasis added).\n\nDefendants emphasize that EPA, in its proposed rules, requires \"general state goals\" to be implemented by means of \"specific requirements,\" which Michigan's current implementing regulations fail to do, as they only prohibit \"degradations\" of the \"local background groundwater quality.\" However, as evidenced by its proposed rules as a whole, EPA is not limiting the validity of general state goals solely to those which are implemented via specific numerical standards promulgated in corresponding agency rules. Rather, the type of standard provided is one of several factors courts should consider in deciding whether a state goal is an ARAR. EPA's proposed rules state:\n\nGeneral State goals that are contained in a promulgated statute and implemented via specific requirements found in the statute or in other promulgated regulations are potential ARARs. For example, a State antidegradation statute which prohibits degradation of surface waters below specific levels of quality or in ways that preclude certain uses of that water would be a potential ARAR. Where such promulgated goals are general in scope, e.g., a general prohibition against discharges to surface waters of \"toxic materials in toxic amounts,\" compliance must be interpreted within the context of implementing regulations, the specific circumstances of the site, and the remedial alternatives being considered.\n\nEPA, National Oil and Hazardous Substances Pollution Contingency Plan; Proposed Rule, 53 Fed. Reg. 51394, 51,438 (Dec. 21, 1988) [hereinafter Proposed Rule ] (emphasis added). EPA's final revisions are even clearer: \"Even if a state has not promulgated implementing regulations, a general goal can be an ARAR if it meets the eligibility criteria for state ARARs. However, EPA would have considerable latitude in determining how to comply with the goal in the absence of implementing regulations.\" NCP, Final Rule, 55 Fed. Reg. at 8746. Hence, EPA's own publications recognize that general requirements containing no specific numerical standards, or any implementing regulations at all for that matter, can be enforceable ARARs.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nWe are unable to find any legally binding case law supporting defendants' contention that Michigan's anti-degradation law is unenforceably vague. We recognize that the district court in Kelley v. United States, 618 F. Supp. 1103 (W.D. Mich. 1985), found that Michigan's anti-degradation law did not provide objective, quantifiable standards capable of uniform application such that it could constitute a state pollution \"requirement\" for the purpose of waiving federal sovereign immunity under the Clean Water Act (\"CWA\"), 33 U.S.C. § 1323. Kelley, however, is inapplicable to our case. Unlike the waiver of sovereign immunity under the CWA, which is interpreted strictly, objective standards are not required under CERCLA for a requirement to qualify as an ARAR. See 42 U.S.C. § 9621(d).\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nOther Michigan cases demonstrate that Michigan's anti-degradation law is legally enforceable. For example, in both Attorney General v. Thomas Solvent Co., 146 Mich. App. 55, 380 N.W.2d 53 (1985) and Attorney General v. John A. Biewer Co., 140 Mich. App. 1, 363 N.W.2d 712 (1983), the Michigan Court of Appeals affirmed injunctions requiring abatement and cleanup of water pollution caused by seepage of toxic chemicals through soils into groundwater in violation of M.C.L.A. § 323.6(a). Cf. Michigan Waste Sys. v. Department of Natural Resources, 147 Mich. App. 729, 739-40, 383 N.W.2d 112 (1985) (standard of \"odor\" in agency rules regulating landfill location not impermissibly vague); County of Delta v. Department of Natural Resources, 118 Mich. App. 458, 464-65, 325 N.W.2d 455 (1982) (terms \"sanitary standards\" and \"unlawful pollution\" contained in statute and accompanying guidelines are not impermissibly vague). In sum, the WRCA and the Part 22 Rules are legally enforceable, and thus \"promulgated\" within the meaning of 42 U.S.C. § 9621(d)(2)(A)(ii).\n\n2. Whether Michigan's Anti-degradation Law is More Stringent than Federal Standards\n\nSection 9621(d)(2)A)(ii) also requires that for state standards to apply to a remedial action plan, they must be \"more stringent than any Federal standard, requirement, criteria or limitation. . . .\" The district court summarily concluded that\n\nalthough it is difficult to compare a federal statute containing specific requirements with a state agency rule that contains a broad prohibition, this Court finds that the broad prohibition is more stringent than the federal statute setting minimal standards. Accordingly, Michigan's anti-degradation law also complies with this aspect of 42 U.S.C. § 9621(d).\n\nAkzo Coatings, 719 F. Supp. at 584. The district court, however, is not left without authority for its conclusion. In its proposed revision of the NCP, EPA stated: \"Where no Federal ARAR exists for a chemical, location, or action, but a State ARAR does exist, or where a state ARAR is broader in scope than the Federal ARAR, the State ARAR is considered more stringent.\" Proposed Rule, 53 Fed. Reg. at 51435. Senator Mitchell, one of the principal authors of section 9621, similarly explained during the debate on SARA that a \"more stringent\" state requirement within the meaning of section 9621(d)(2)(A) \"includes any State requirement where there is no comparable Federal requirement.\" 132 Cong. Rec. S 14,915 (Oct. 3, 1986) (emphasis added).\n\nWe find that no comparable federal statute or rule identified by the parties broadly regulates direct or indirect discharges of any injurious or potentially injurious substance into groundwater resources as does section 6(a) of the WRCA. The WRCA is not directly comparable to the federal Safe Drinking Water Act (\"SDWA\"), 42 U.S.C. § 300g-1(a)(2) because it is broader in coverage and, depending on the site, as or more demanding in terms of cleanup requirements than the SDWA. We believe, therefore, that the WRCA is more stringent than the SDWA.\n\nWith regard to coverage, the provisions of the SDWA apply only to a limited number of substances while the WRCA applies to \"any substance which is or may become injurious to the public health,\" M.C.L.A. § 323.6(a). Second, the SDWA applies only to public drinking water supply systems serving a certain minimum number of customers, 42 U.S.C. §§ 300(f)-(g)(4), while the WRCA applies to any waters of the state, whether private or public, including groundwaters. M.C.L.A. § 323.6(a).\n\nLikewise, we find that the WRCA's cleanup requirements implemented by means of that Act's accompanying regulations are equally or in some cases more demanding, and thus not less stringent, than the federal maximum contaminant levels (\"MCLs\") under the SDWA.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The Part 22 Rules prohibit degradation of groundwater \"from local background groundwater quality.\" Mich. Admin. Code R. 323.2205(1). Defendants mischaracterize the Part 22 Rules by equating the terms \"local background groundwater quality\" and \"existing groundwater quality\" -- terms that have distinct meanings under the Rules.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Equating \"local background groundwater quality\" to the \"existing groundwater quality\" as determined before the influence of soil flushing would produce the illogical result of allowing defendants to continue polluting the Rose Site groundwaters as long as the same levels of contaminants already present in the groundwaters from their prior pollution were maintained.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Instead, \"local background groundwater quality\" refers to the condition of the local groundwater \"having virtually no influence by discharges.\" Mich. Admin. Code R. 323.2202(r).\n\nIn many instances, especially when dealing with synthetic compounds which do not naturally occur in groundwater, the Part 22 Rules will be more stringent than the SDWA. For example, the SDWA would limit the vinyl chloride concentration, which at the Rose Site is 140 parts per billion (\"ppb\") at several monitoring wells, to only 2 ppb. 40 C.F.R. § 141.61 (1989). However, with no influence by discharges, the background concentration of vinyl chloride in the groundwaters of the Rose Site should be at or near zero. If the state commission determined the difference between the SDWA and the WRCA standards to be substantial enough,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e the level of cleanup required would therefore be higher under the Part 22 Rules as compared to the federal standard for vinyl chloride and other synthetic compounds. Moreover, the Part 22 Rules also prohibit materials at concentrations that exceed the MCLs for inorganic and organic chemicals, as specified in the federal drinking water regulations, from being discharged into groundwaters in usable aquifers \" even in those cases where the local background groundwater levels for these materials exceed the specified levels.\" Mich. Admin. Code R. 323.2205(3) (emphasis added). With many contaminants in the groundwaters of the Rose Site, therefore, the Part 22 Rules will be at least as stringent as the SDWA, but with others, such as vinyl chloride, they will be more stringent. Accordingly, even if we focus on the Rose Site alone, as EPA seems to require with general state goals, see Interim Guidance, 52 Fed. Reg. at 32498, we find that the WRCA and the Part 22 rules are more stringent than federal standards under the SDWA.\n\n3. Whether Michigan's Anti-degradation Law is Legally Applicable to the Rose Site or Relevant and Appropriate to the Remedial Action Selected\n\nThe third requirement under section 9621(d) is that the potential ARARs be \"legally applicable to the hazardous substance or pollutant or contaminant concerned or [] relevant and appropriate under the circumstances of the release or remedial action selected. . . .\"\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e To determine whether this requirement is satisfied, we must re-examine the scope of Michigan's anti-degradation law. Section 6(a) of the WRCA prohibits persons from discharging, \"directly or indirectly,\" certain substances into the groundwaters. The Part 22 Rules define \"discharges\" to be \"the addition of materials to ground waters from any facility or operation which acts as a discreet or diffuse source. . . .\" Mich. Admin. Code R. 323.2202(j).\n\nThe record in this case clearly establishes an ongoing, indirect discharge of injurious substances from the soil into the groundwater at the Site caused by the natural infiltration of water through contaminated soils, which in turn results in the leaching of contaminants. The RI/FS (Exh. 3.1a, at 20), the 1987 ROD (Exh. 3.1c, at 11), the 1987 Responsiveness Summary (Exh. 3.1c, at 17-18), and the amended ROD (Exh. 3.22a, at 3) all reflect that soils contaminated with toxic chemicals on site will, unless remediated, act as a \"continual source of groundwater degradation.\" Exh. 3.22a, Rod Amendment, at 3. The record also establishes that the nature and distribution of these contaminants is such that they are or may become \"injurious to the public health, safety or welfare . . . or [to] uses which are being made or may be made of such waters. . . .\" M.C.L.A. § 323.6(a). Cf. United States Aviex Co. v. Travelers Ins. Co., 125 Mich. App. 579, 336 N.W.2d 838 (1986) (court held that property owner was subject to liability to the state under WRCA for discharge of pollutants into groundwater under his property as a result of contaminated water used to extinguish a fire at a chemical plant above ground).\n\nWe thus agree with the district court that \"because soil flushing diffusely discharges toxicants from the soil into the ground water, the anti-degradation rules are legally applicable to the clean up of the Rose Township site\" and to soil flushing in particular. Akzo Coatings, 719 F. Supp. at 584 (citing to Mich. Admin. Code R. 323.2202(j)). See also Exh. 3.18, Explanation of Significant Differences, at 2 (The effect of soil flushing \"would be to 'mimic' the natural precipitation infiltration process which is currently leaching chemicals into the groundwater.\"). For reasons previously stated, we do not accept the argument that Michigan's anti-degradation law is inapplicable to soil flushing because it is \"prospective\" and thus only covers further degradation of groundwaters. Michigan's anti-degradation law provides for the protection from degradation of \"background,\" not \"existing,\" groundwater and thus requires, assuming it is an ARAR, that the PRPs restore the groundwater at the site to the local background groundwater quality, whatever that may be. Cf. Thomas Solvent Co., 146 Mich. App. at 64 (The court explained that the \"status quo\" to be protected by the injunction under the WRCA was \"an unpolluted environment . . . [and] the maintenance of uncontaminated groundwater and soil.\").\n\nMoreover, no one could question the applicability of Michigan's anti-degradation law if the state is correct in its assumption that the clay layers in the Rose Site soils will channelize the flushate and create unpredictable drainage pathways, thereby contaminating groundwater offsite. However, as explained below, soil flushing as would be used at the Rose Site is not prohibited under the state's anti-degradation law even though it requires a discharge of prohibited substances into the groundwater because flushing will have a \"remedial\" purpose there.\n\nEven if Michigan's anti-degradation law were not applicable to this site, its consideration would certainly be \"relevant and appropriate.\" Among possible factors to be considered, the environmental media (\"groundwater\"), the type of substance (\"injurious\") and the objective of the potential ARAR (\"protecting aquifers from actual or potential degradation),\" are all \"relevant\" in this case because they pertain to the conditions of the Rose Site. Moreover, considering the aforementioned factors, the use of Michigan's anti-degradation law is well-suited to the site at issue and therefore \"appropriate\" in this case. See Proposed Rule, 53 Fed. Reg. at 51436; 40 C.F.R. § 300.400(g)(2) (1990).\n\nAccordingly, we conclude that Michigan's anti-degradation law is properly promulgated, more stringent than the federal standard, legally applicable or relevant and appropriate, as well as timely identified (the latter factor not having been argued on appeal), and therefore constitutes an ARAR within the meaning of 42 U.S.C. § 9621(d)(2). The fact that Michigan's anti-degradation law is an ARAR, however, does not resolve the question of whether the decree must comply with that ARAR. A decree must comply with all federal and state ARARs unless EPA \"waives\" an ARAR and the state either does not challenge the waiver or the waiver is upheld in court against the state challenge. See 42 U.S.C. § 9621(d)(4), (f)(2).\n\nB. Whether the Decree's Remedial Action Will Attain the Cleanup Requirements of Michigan's Anti-Degradation Law\n\nThe briefs and district court opinion generate considerable confusion on the issues of whether the decree's remedial action will attain the cleanup requirements of Michigan's anti-degradation law and if not, whether EPA actually and properly \"waived\" that ARAR. While the district court found that the state had not designated any portions of the record that establish EPA had failed to consider Michigan's anti-degradation law to be an ARAR, Akzo Coatings, 719 F. Supp. at 586 n.6, several references in the government's brief and in its correspondence during negotiations with defendants suggest that, as with the Aviex Site, it never considered the WRCA and Part 22 Rules to be an ARAR. In any event, the State of Michigan does not, and cannot at this point, allege that cleanup standards at the completion of the remedial action will fall below the ARARs. The state consented to the 1987 ROD and agreed that all ARARs would be met by the accompanying RAP. The 1987 ROD contains the same TCLs as the amended ROD, so the state has implicitly agreed that the amended ROD and consent decree's TCLs satisfy all ARARs, including Michigan's groundwater regulations.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Instead, the state's argument that the consent decree does not attain ARARs only consists of criticisms of the selected methodology; i.e., soil flushing will fail to attain the decree's TCLs and thus the ARARs for the Rose Site.\n\nThe state argues that EPA has a duty to determine, prior to submitting the decree to the court, whether soil flushing would attain ARARs. In contrast, defendants argue and the district court agreed that based on section 9621(d)(2), \"whether the Consent Decree complies with the state ARAR is to be measured 'at the completion of the remedial action.'\" Akzo Coatings, 719 F. Supp. at 586 (quoting 42 U.S.C. § 9621(d)(2)(A)). As evidenced by its title, however, section 9621(d)(2)(A)'s purpose refers to the \"degree of cleanup\" required under CERCLA, which is naturally measured at the completion of the remedial action. That provision does not address the issue of whether EPA has a duty to initially ascertain that the chosen remedy will in fact achieve ARARs.\n\nEPA's own regulations indicate that the agency has some obligation to evaluate proposed remedial actions in terms of whether they will attain ARARs before implementation. Once the initial screening is done, \"Alternatives shall be assessed to determine whether they attain [ARARs].\" 40 C.F.R. § 300.430(e)(9)(iii)(B) (1990). \"The ROD shall describe the following statutory requirements as they relate to the scope and objectives of the action: . . . The [ARARs] . . . that the remedy will attain.\" 40 C.F.R. § 300.430(f)(5)(ii)(B) (1990) (emphasis added). Based on its own regulations, then, EPA must make an appropriate evaluation of whether a selected remedy will attain ARARs. Any other result would essentially nullify judicial review of consent decrees until completion of the remedial action, at which time compliance with CERCLA's goals may be difficult, as human health and the environment may have further deteriorated and the PRPs may be insolvent.\n\nOur review of the various CERCLA provisions dealing with ARARs also supports the state's argument that EPA must determine prior to implementation whether a remedy will meet designated ARARs for a particular site. For instance, although shrouded in considerable ambiguity, the language of section 9621(d)(4) indicates EPA has such a duty. That provision allows EPA to select a remedial action \"that does not attain a level or standard of control at least equivalent to a legally applicable or relevant and appropriate standard, requirement, criteria,\" if it finds that\n\n(A) the remedial action selected is only part of a total remedial action that will attain such level or standard of control when completed . . .\n\n(B) compliance with such requirement at that facility will result in greater risk to human health and the environment than alternative options;\n\n(C) compliance with such requirements is technically impracticable from an engineering perspective;\n\n(D) the remedial action selected will attain a standard of performance that is equivalent to that required under the otherwise applicable standard, requirement, criteria, or limitation, through use of another method or approach;\n\n(E) with respect to a State standard, requirement, criteria, or limitation, the State has not consistently applied (or demonstrated the intention to consistently apply) the standard, requirement, criteria, or limitation in similar circumstances at other remedial actions within the state. . . .; or\n\n(F) in the case of a remedial action to be undertaken solely under section 9604 of this title using the Fund, selection of a remedial action that attains such level or control will not provide a balance between the need for protection of public health and welfare and the environment at that facility under consideration, and the availability of amounts from the Fund to respond to other sites. . . .\n\n42 U.S.C. § 9621(d)(4) (emphasis added). See also 42 U.S.C. § 9621(f)(2)(B) (a state may intervene before entry of the consent decree and challenge a waiver of an ARAR, and if successful, the remedial action shall conform to that ARAR). The waiver of compliance with an ARAR would not mean much if it could only be invoked at the completion of the remedy. While EPA need not and cannot determine with absolute certainty whether a proposed remedy will attain a particular ARAR for the site at issue, we conclude it must make an appropriate and good faith evaluation, subject to the standard of review discussed below in subsection VI(C), or waive compliance with the ARAR.\n\nIn this case it is clear EPA never conclusively determined during negotiations that soil flushing would attain the relevant ARAR at the completion of the remedy:\n\nHad EPA made such a determination, it never would have required a laboratory test or required the implementation of an alternate permanent remedy if the defendants cannot satisfy EPA that soil flushing will work at the Rose Site. All EPA determined was that soil flushing may be a viable remedy at the site and determined to give the defendants a chance to demonstrate whether it will work.\n\nBrief for the United States, at 32 n.38. Section 9621(d)(4) requires that EPA make specific findings and publish them when it invokes a waiver, the latter requirement clearly not having been complied with in this case. We nevertheless hold that EPA has waived the ARARs for soil flushing based on the finding that \"the remedial action selected is only part of a total remedial action that will attain such level or standard of control when completed.\" 42 U.S.C. § 9621(d)(4)(A) (emphasis added).\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e See Exh. 3.22a, Rod Amendment, at 4 (In reference to the effectiveness of soil flushing, the amended ROD stated: \" provided appropriate target cleanup levels are met, all ARARs as in the ROD, would be attained.\") (emphasis added). In other words, EPA recognized that if soil flushing did not in fact attain the ARARs the defendants would have to carry out an alternative remedy to comply with them. Accordingly, the district court correctly allowed the state to intervene under section 9621(f), prior to entry of the consent decree, to challenge the waiver of Michigan's anti-degradation law.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nUnder section 9621, a state may intervene in an action before entry of the consent decree and challenge the waiver of an ARAR, and if the waiver is not supported by substantial evidence, the court is required to conform the remedial action to that ARAR. 42 U.S.C. § 9621(f)(2)(B). In this case, as we find that EPA implicitly waived all ARARs for soil flushing on the basis that the decree as a whole would attain them, the state must show by substantial evidence that EPA's waiver is unlawful.\n\nWe do not believe that the state has met its evidentiary burden in this respect. A number of courts have equated the substantial evidence standard with the arbitrary and capricious standard. The difference between the two standards at issue has been deemed \"primarily a semantic distinction,\" Central States Enter. Inc. v. ICC, 780 F.2d 664, 674 n.10 (7th Cir. 1985), being \"'one and the same' insofar as the requisite degree of evidentiary support is concerned.\" Consumers Union of U.S., Inc. v. FTC, 255 App. D.C. 203, 801 F.2d 417, 422 (D.C. Cir. 1986) (citation omitted). At least for purposes of section 9621(f)(2)(B), however, the legislative history of CERCLA distinguishes the two standards: \"This standard is different than the arbitrary and capricious standard . . . and is intended to subject the validity of the remedial action decision challenged by the State to more searching scrutiny.\" 132 Cong. Rec. S14,917 (daily ed. Oct. 3, 1986) (Statement of Sen. Mitchell).\n\nNevertheless, in previously determining that the overall decree and the decision to use soil flushing were not arbitrary and capricious, we conducted a thorough review of the evidence in the record which in our minds sufficiently compensates for any alleged difference in the two standards of review. Based on reasons and evidence earlier discussed, we find that there is substantial evidence in the record to support and justify EPA's conclusion that the remedial action as a whole will attain the ARARs for the Rose Site. Should soil flushing fail, defendants must propose an alternate remedy that will attain all TCL's embodied in the decree and be as protective to human health and the environment as excavation and incineration.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nAgain, we emphasize that EPA cannot and is under no legal obligation to determine with absolute certainty whether a proposed remedial action will attain ARARs. If the decree is binding on the parties, requires attainment of all ARARs, and provides sufficient safeguards for careful implementation of proposed remedies which include proven technologies that either have been or are being used at similar sites or which are subject to testing under specified performance conditions, then it will be difficult for a court which lacks scientific expertise to find that the state has proven by substantial evidence that the remedial action at a particular site will not attain ARARs. The record contains evidence indicating that both soil flushing and incineration have been successfully used to remedy hazardous sites to pre-determined cleanup levels.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Moreover, the state in this case may always come back to court at the completion of the remedial action and persuade us that the Phase I and/or Phase II TCLs have not been achieved. See 42 U.S.C. § 9621(e). We agree with the district court that the state has failed to present enough evidence to persuade us that the remedial action as a whole will not attain ARARs at its completion.\n\nC. Whether Implementation of Soil Flushing Will by Definition Violate Michigan's Anti-degradation Law.\n\nWhile we conclude that the remedial action as a whole will eventually attain Rose Site ARARs, even though soil flushing may not, amici suggest that the use of soil flushing by definition violates the state anti-degradation ARAR because it constitutes a discharge of contaminants into the ground water of the Site.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Clearly, if the monitoring wells did not collect most or all of the flushate, then soil flushing could degrade groundwaters offsite thus technically violating the state ARAR. As mentioned earlier, the required testing will demonstrate whether soil flushing will work at the Rose Site.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Meanwhile, the WRCA and Part 22 Rules remain applicable and relevant to the Site.\n\nEven if soil flushing only decreases the level of contaminants in the groundwater and does not degrade groundwater outside the contaminated areas, it would be illogical to interpret Michigan's anti-degradation law as prohibiting its use outright. The remedy's goal is to restore the environment, not further it. The fact that the State of Michigan has approved soil flushing at other sites demonstrates that the remedy is not a per se violation of the anti-degradation law. Though soil flushing requires a discharge of hazardous chemicals into the groundwater, the Part 22 Rules suggest that soil falls within a \"cleanup\" exception to the WRCA's prohibition of such discharges:\n\nDischarges into groundwaters may be made, consistent with the requirements of the act and applicable rules, if necessary measures are taken to prevent degradation of groundwaters in usable aquifers. The following are such measures:\n\n(a) Proper wastewater treatment.\n\n(b) Containment of the discharge within the boundaries of the operation or activity defined by the hydrogeological study required by R. 323.2207.\n\nMich. Admin. Code R. 323.2205(2) (emphasis added). Soil flushing could be considered part of the treatment and containment of \"waste water\" within the boundaries of the cleanup operation, as the contaminants in the flushate will be treated and removed by the groundwater extraction system. See Exh. 3.22a, ROD Amendment, at 3 (\"the groundwater extraction system would be pulling back the contaminant plume, which has not yet left the site.\").\n\nWe believe that EPA's regulations advance a reasonable approach to the application of Michigan's anti-degradation law. While we have already stated that general state goals like Michigan's anti-degradation law \"have the same weight as explicit numerical standards,\" according to EPA \"the former may have to be interpreted in terms of a site and therefore may allow more flexibility in approach.\" Interim Guidance, 52 Fed. Reg. at 32,498 (emphasis added). In essence, \"EPA wants to clarify that it recognizes that ARARs that are used to determine final remediation levels apply only at the completion of the action.\" NCP, Final Rule, 55 Fed. Reg. at 8755. Cf. Proposed Rule, 53 Fed. Reg. at 51440 (\"Although not compelled by statute, EPA is proposing that the applicable or relevant and appropriate requirements of other laws [such as CWA effluent discharge limitations] pertinent to a remedial action itself must be met during the conduct of the remedial action as well as at the completion of the remedial action unless a waiver is invoked (see § 300.435(b)(2)).\")). Thus, while soil flushing could technically be regarded as violative of Michigan's anti-degradation law, that ARAR should only apply at the completion of the action -- unless for some reason the testing of soil flushing shows that it is not decreasing, but increasing the level of contaminants in the groundwater, in which case EPA will not approve its use at the Rose Site. Consequently, we feel the WRCA and Part 22 Rules would not prohibit soil flushing as long as it is used as a remedial action and is protective of human health and the environment.\n\nD. Whether the Decree's Covenant Not to Sue Violates CERCLA Section 122(f)(3)\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nThe State of Michigan argues that Section XVII of the Consent Decree, the Covenant Not to Sue, violates 42 U.S.C. § 9622(f)(3), which provides that such a covenant \"shall not take effect until the President certifies that remedial action has been completed in accordance with the requirements of this chapter. . . .\" However, our reading of the statute in light of this particular consent decree indicates that the covenant not to sue is valid as proposed.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nAs noted previously, one of the principal reasons Congress expressly permitted the President to enter into consent decrees was the desire to encourage settlements been EPA and PRPs. Such settlements increase the likelihood that the settling defendants, rather than the federal government, will bear the cost of cleaning up hazardous waste sites. Covenants not to sue are one incentive which CERCLA allows the government to offer to the defendants to encourage such settlements. As long as those covenants comply with the statutory requirements of CERCLA, we will uphold them.\n\nCERCLA permits the United States to enter into covenants not to sue with settling defendants if such covenants are in the public interest. 42 U.S.C. § 9622(f)(1). The statute lists several factors to consider in the evaluation of a covenant not to sue:\n\n(A) The effectiveness and reliability of the remedy, in light of the other alternative remedies considered for the facility concerned;\n\n(B) The nature of the risks remaining at the facility;\n\n(C) The extent to which performance standards are included in the order or decree;\n\n(D) The extent to which the response action provides a complete remedy for the facility, including a reduction in the hazardous nature of the substances at the facility;\n\n(E) The extent to which the technology used in the response action is demonstrated to be effective;\n\n(F) Whether the Fund [federal Superfund] or other sources of funding would be available for any additional remedial actions that might eventually be necessary at the facility; and\n\n(G) Whether the remedial action will be carried out, in whole or in significant part, by the responsible parties themselves.\n\nId. § 9622(f)(4).\n\nWeighing each of these factors, we find that the covenant not to sue is reasonable and in the public interest. The decree requires the settling defendants to implement an effective remedy which will attain specific target levels designed to ensure public health and restore the soil and water at the site. While the effectiveness of soil flushing has not yet been demonstrated at this site, the decree requires the defendants to test and demonstrate the workability of that proven technology. Alternative methods must be developed and implemented if soil flushing does not prove feasible. The decree makes specific provision for a trust fund to cover anticipated costs during Phase II of the cleanup, relieving the United States of this financial obligation. Finally and most significantly for this appeal, the covenant not to sue does not take effect until the settling defendants have completed their obligations under the agreement, aside from long term monitoring requirements. Thus all the factors in 42 U.S.C. § 9622(f)(4) tilt in favor of enforcement of the covenant not to sue as written.\n\nThe consent decree at issue here provides that the United States will not sue the settling defendants for \"any and all claims available to the United States under Sections 106 and 107 of CERCLA, Section 7003 of RCRA, other Federal environmental statutes and any and all claims available under state law, including the common law of nuisance, which are based on any of the facts known to the U.S. EPA at the time of entry of this Decree. . . .\" Consent Decree Section XVII. The covenant does not release the settling defendants from potential future liability arising from: (1) hazardous substance removal which fails to comply with the statutory requirements of 42 U.S.C. § 9622(f)(2)(B); (2) natural resource damages; (3) criminal liability; (4) claims based on a failure by the settling defendants to meet the requirements of the consent decree; and (5) liability for violations of federal law which occur during implementation of the remedial action.\n\nAdditionally, the United States reserves the right in the decree to (1) institute proceedings in a new action or to issue a new order, pursuant to Section 106 of CERCLA, 42 U.S.C. § 9606, seeking to compel the settling defendants to perform any additional remedial action at the Site necessitated by a release from the Site, and (2) institute proceedings in a new action pursuant to Section 107 of CERCLA, 42 U.S.C. § 9607, to seek reimbursement to the United States for its response costs for any additional response action undertaken by EPA under CERCLA at the Site, if: (a) conditions at the Site, previously unknown to the United States, are discovered after the entry of the consent decree, or (b) information is received after entry of the consent decree, and these previously unknown conditions or this new information indicate that the remedial action is not protective of human health and the environment. EPA also reserves the right under the decree to sue any person other than the settling defendants in connection with the Site, which it is in the process of doing.\n\nThe challenge to the covenant not to sue in this case concerns the two-phase cleanup formula described in the decree. Though the settling defendants' obligations essentially end upon attainment of Phase I TCLs, the remedial action will continue at the Site using money from the trust fund they are required to establish. The State of Michigan argues that the covenant not to sue, which may be enforceable once Phase I levels are reached, violates the provision in 42 U.S.C. § 9622(f)(3) which prevents such covenants from taking effect before the President certifies that the remedial action has been completed.\n\nHowever, we find that this consent decree is written to ensure that the covenant not to sue takes effect only when defendants have completed their work. This satisfies the congressional intent expressed in section 9622(f)(3), while still encouraging a settlement in the public interest as described in section 9622(f)(4). The consent decree expressly provides that only upon certification from the President that the settling defendants have completed their work under the decree and have satisfied the conditions of section 9622(f)(2)(B) of CERCLA may the covenant not to sue take effect. Even though EPA will continue to clean up the Site using funds provided by the settling defendants, the work of defendants will be finished once Phase I levels are achieved.\n\nWere the covenant not to sue to take effect at the end of Phase II instead of Phase I, the terms of the decree would provide no additional legal remedies to the government against defendants beyond those which are present under the decree as written. Once defendants complete their work as required under the decree, no reason remains for them to be subject to further liability, aside from the important exceptions which the decree explicitly provides. Therefore the covenant not to sue may properly take effect at that point, even though further cleanup efforts will occur at the Site. Defendants can only be held to the obligations as agreed to by all parties in the decree, and the covenant not to sue should not and does not increase or lessen those obligations.\n\nThis reading of the decree is consistent with a 1987 EPA guidance document discussing the possible effective date of covenants not to sue under CERCLA. While such covenants can only take effect upon completion of remedial action, \"EPA interprets completion of the remedial action as that date at which remedial construction has been completed. Where a remedy requires operational activities, remedial construction would be judged complete when it can be demonstrated that the operation of the remedy is successfully attaining the requirements set forth in the ROD. . . .\" Memorandum to EPA Regional Administrators concerning Covenants Not to Sue (Attachment 1 to Amended Brief for the United States, p. 8) (July 10, 1987). All of the testing and construction will be completed before the covenant not to sue takes effect in this case, and the Phase II cleanup is to be conducted by EPA, not the settling defendants.\n\nThe United States has reserved the right to sue for noncompliance with the terms of the decree. This provision is crucial, for it ensures that further legal action may be initiated to enforce the agreement as written. In this respect, the consent decree is no different than any other, for it establishes limits on the extent of the settling parties' liabilities. Any consent decree which failed to set such limits would hardly serve as an inducement to settlement. The State of Michigan incorrectly reads the decree as absolving the settling defendants of their obligations to conduct long term groundwater monitoring after the attainment of Phase I levels and issuance of the certificate of completion. The exclusion from the covenant not to sue's coverage of \"Claims based on a failure by the Settling Defendants to meet the requirements of this Consent Decree\" will allow EPA or other aggrieved parties to bring legal action to force compliance with the terms of the decree, including the monitoring requirements, even after the covenant not to sue takes effect. 42 U.S.C. § 9622(1).\n\nThe consent decree does affirmatively bind the settling defendants to propose, test and implement remedial action which will attain the Phase I TCLs. In addition, defendants must create a $500,000 trust fund -- which is expected to have grown to $1.2 million before it is needed -- to meet the anticipated costs of attaining Phase II TCLs. The covenant not to sue does not alter or diminish the legal obligations of the settling defendants under the decree. The exceptions from the covenant not to sue for potential criminal acts, for expenses which arise out of conditions unknown at the time of the decree's entry, and natural resource damage, as well as the other exceptions, will ensure that the defendants meet their legal obligations under the decree and do not leave the cleanup unfinished.\n\nE. Whether the Decree Violates CERCLA Section 104(c)(3)\n\nThe state claims that the decree violates 42 U.S.C. § 9604(c)(3) which declares that EPA \"shall not provide any remedial action pursuant to this section . . . unless the State in which the release occurs first enters into a contract or cooperative agreement,\" thus setting up a joint federal-state cost-sharing and cleanup arrangement. Section 9604 deals with remedies provided by the President or his delegatee and financed by the Superfund.\n\nOn its face, however, the decree does not invoke section 9604. While EPA will continue operating the soil flushing and water extraction system after the remedial action will have attained Phase I TCL levels, those costs will be financed from the trust fund set up by the settling defendants through a consent decree based on section 9606, not section 9604. Cf. United States v. Northeastern Pharmaceutical \u0026 Chemical Co., Inc., 579 F. Supp. 823, 850 (W.D. Mo. 1984) (\"An action brought pursuant to sections 106(a) and 107(a) are [sic] independent and separate of the provisions authorizing use of the Superfund, sections 105(c)(3) and 111.\"); United States v. Reilly Tar \u0026 Chemical Co., 546 F. Supp. 1100, 1118 (D. Minn. 1983) (section 9604(c)(3)'s requirement of cooperative agreement before proceeding with a response is not applicable to private cost recovery actions under section 9607).\n\nWe recognize that there is no guarantee the money provided by defendants will be sufficient to operate the soil flushing and groundwater extraction systems until the remedial action is complete. See Consent Decree Section V(A) (\"Once the Settling Defendants have paid the total sum of Five Hundred Thousand Dollars ($500,000.00) into the trust fund, the Settling Defendants shall not be required to pay or contribute further to the trust fund.\"). Moreover, soil flushing may only be capable of attaining Phase I levels, thus perhaps forcing EPA to implement more expensive technology to finish the cleanup and requiring the use of Superfund monies after all allocated funds are exhausted.\n\nHowever, we believe that it is unlikely EPA will be required to use Superfund monies for any part of the cleanup from Phase I to Phase II TCLs. Defendants must thoroughly test the effectiveness of soil flushing, both in the lab and at the Site, before full implementation will occur. While defendants are only required to prove that soil flushing will attain Phase I TCLs within 10 years of implementation, EPA will have an early opportunity to determine to the maximum extent practicable whether that remedy will also attain Phase II TCLs and, if not, it can prepare an alternate remedy which is not only effective but also cost-efficient. If EPA determines that soil flushing will not attain even Phase I TCL levels, it will likely accept the proposed alternate remedy which is the cheapest to \"operate\" (even though it may be expensive to \"implement,\" a cost borne by defendants under the decree). Currently, among possible options are a soil vacuum extraction system, soil venting, heat injection, and incineration -- solutions which may or may not require monies in addition to the sum in the trust fund in order to operate after implementation and Phase I TCLs are attained. Finally, we should point out that EPA has filed suit to recover cleanup costs from other parties, United States v. American Renovating Co., No. 89CV71712 DT (E.D. Mich. June 6, 1989), litigation which will likely provide additional funds from which to help cover unexpected costs of the Rose Site cleanup.\n\nWe do not believe that Congress intended to give the states an absolute right to veto reasonable consent decrees [by refusing to enter into cost-sharing agreements] where a good faith effort has been made by EPA to put all of the cost on the PRPs but the possibility exists that Superfund monies will be necessary to finish the cleanup. The decree's safeguards and cleanup requirements satisfy the State of Michigan's interest in protecting the environment and the health of its citizens.\n\nThe main purpose of the decree and CERCLA, besides cleaning up the Rose Site, is to shift as much of the financial burden of the cleanup onto PRPs so that Superfund monies may be used elsewhere. Likewise, the purpose of section 9604's restriction on the use of Superfund money is \"to prevent improvident or disproportionate use of a limited fund to clean up only a few of the many sites for which no solvent, responsible parties can be found.\" United States v. Wade, 577 F. Supp. 1326, 1336 (E.D. Pa. 1983). The decree at issue complies with these goals. While the remedial action may eventually require federal funding, on its face the decree does not require application of section 9604. Therefore, compliance with that provision is not presently required.\n\nVIII. PREEMPTION OF STATE LAW CLAIMS\n\nUnder Counts V through VII of its complaint filed with the district court on February 14, 1989, the State of Michigan sought injunctive and declaratory relief pursuant to Michigan Water Resources Commission Act (\"WRCA\"), M.C.L. 323.1 et seq. (Count V); the Michigan Environmental Protection Act (\"MEPA\"), M.C.L. 691.1201 et seq. (Count VI); and Michigan's common law of public nuisance (Count VII). The district court held that these three counts of the state's complaint did not state a viable cause of action because they were preempted by CERCLA. According to the district court, Michigan sought relief which was inconsistent with the federal remedies embodied in the consent decree, and therefore the state could not pursue its own remedies. Akzo Coatings, 719 F. Supp. at 580.\n\nWe believe the district court correctly held that if remedies proposed by a state do not become embodied in the consent decree by virtue of the statute's provisions for incorporation of state ARARs, the state may only enforce against the PRPs the remedies adopted in the decree, and no others. We do not agree with the suggestion in the brief of the United States that a state may not obtain additional relief beyond the terms of a consent decree as initially presented by EPA, but we read the statute to say that whatever remedy is adopted in the final decree as entered by a federal court sets the parameters of relief available to the state against the PRPs. The state is still free of course to pursue additional remedies at its own expense, as long as those remedies do not conflict or interfere with the federally-approved cleanup.\n\n\"In determining whether a state statute is pre-empted by federal law and therefore invalid under the Supremacy Clause of the Constitution, our sole task is to ascertain the intent of Congress.\" California Fed. Sav. \u0026 Loan Ass'n. v. Guerra, 479 U.S. 272, 280, 93 L. Ed. 2d 613, 107 S. Ct. 683 (1987). Preemption can occur in three instances: when Congress, while acting within constitutional limits, preempts state law by stating so in express terms; when the federal regulation is sufficiently comprehensive to make it reasonable to infer that Congress left no room for supplementary state regulation; and in those areas where Congress has not completely displaced state regulation, federal law may preempt state law to the extent that the state law actually conflicts with the federal law. Id. at 280-81. The latter conflict may occur \"because 'compliance with both federal and state regulations is a physical impossibility,' Florida Lime \u0026 Avocado Growers, Inc. v. Paul, 373 U.S. 132, 142-43, 10 L. Ed. 2d 248, 83 S. Ct. 1210 (1963), or because the state law stands 'as an obstacle to the accomplishment and execution of the full purposes and objectives of Congress.' Hines v. Davidowitz, 312 U.S. 52, 67, 85 L. Ed. 581, 61 S. Ct. 399 (1941).\" California Fed. Sav. \u0026 Loan, 479 U.S. at 281.\n\nIn this case, the use of the term preemption is misleading, for CERCLA sets only a floor, not a ceiling, for environmental protection. Those state laws which establish more stringent environmental standards are not preempted by CERCLA. See 42 U.S.C. § 9621(d)(2)(A). However, the language of CERCLA and the legislative history of that act indicate that once the consent decree is entered by a federal court--giving the decree the force of law--alternative state remedies may not be pursued. See 42 U.S.C. § 9621(f). At that point, other remedies based on state law are in effect preempted by the federal and state law embodied in the decree through a mechanism incorporating the federal standards and any relevant more stringent state standards. Because it is the terms of the consent decree, and not the language of CERCLA, which preempt alternative state remedies, the use of the word preemption creates some confusion in this case.\n\nThe first two instances of preemption cited in California Fed. Sav. \u0026 Loan, supra, are clearly not present here. Congress has neither expressly stated that CERCLA preempts state environmental regulation, (beyond the obvious preemption of less stringent state standards), nor enacted so comprehensive a statute that we may infer an intent to displace all supplementary state regulation. Indeed, CERCLA states: \"Nothing in this chapter shall be construed or interpreted as preempting any State from imposing any additional liability or requirements with respect to the release of hazardous substances within the state.\" 42 U.S.C. § 9614(a). The provisions examined above in our discussion of the ARARs reflect Congress' special concern that state interests in the health and welfare of their citizens be preserved, even in the face of a comprehensive federal environmental statute. See New York v. Shore Realty Corp., 759 F.2d 1032 (2nd Cir. 1985) (injunction could be issued under state's public nuisance law against property owner responsible for CERCLA cleanup costs where EPA had taken no part in the matter).\n\nCERCLA's legislative history, like the text of the statute itself, indicates that Congress never intended state environmental laws to be ignored or preempted in the selection of federal remedies. Senator Stafford, an original cosponsor of CERCLA who played an active role in its passage and reauthorization, told his colleagues that the law \"establishes an admittedly complex, and very probably confusing, mechanism which allows for the preservation of these [state] laws and prevents unilateral action to override them.\" 132 Cong. Rec. S17136 (Oct. 17, 1986). The statute's provisions in section 9621, \"both in substance and procedure, . . . were painstakingly developed for the purpose of establishing a cleanup system which is required, by law, to accommodate itself to the requirements of Federal and State laws. . . .\" Id. \"Nowhere in section 121 [42 U.S.C. § 9621] is there authority for the Federal Government to preempt, for good reasons or bad, applicable and appropriate State law.\" Id.\n\nSenator Mitchell, also a key participant in the drafting of the 1986 SARA amendments to the statute, inserted his views on preemption in the Congressional Record on the day President Reagan signed the law.\n\nOne of the motivations for reauthorization was the opportunity to correct the Supreme Court ruling in Exxon v. Hunt, in which the Court held that New Jersey's Superfund was preempted. . . . None of our other environmental statutes, with a limited exception in the Clean Air Act, are preemptive. This is an issue of great importance to many of us, and we have stated repeatedly in this bill that there is no preemption. Any other conclusion is wholly without foundation.\n\n132 Cong. Rec. S17,212 (Oct. 17, 1986). Discussing the law's provisions for judicial review of consent decrees and other proposed settlements, Senator Mitchell stated, \"Clearly preserved, for example, are challenges to the selection or adequacy of remedies based on state nuisance law, or actions to abate the hazardous substance release itself, independent of federal response action.\" Id.\n\nCongress then, did not intend for EPA or federal courts to ignore state environmental standards when selecting or approving cleanup remedies. The mechanism for state involvement in the development of a remedial action plan functions as follows:\n\n(2)(A) At least 30 days prior to the entering of any consent decree, if the President proposes to select a remedial action that does not attain a legally applicable or relevant and appropriate standard, requirement, criteria, or limitation, under the authority of subsection (d)(4) of this section, the President shall provide an opportunity for the State to concur or not concur in such selection. If the State concurs, the State may become a signatory to the consent decree.\n\n(2)(B) If the State does not concur in such selection, and the State desires to have the remedial action conform to such standard, requirement, criteria, or limitation, the State shall intervene in the action under section 9606 of this title before entry of the consent decree, to seek to have the remedial action so conform. Such intervention shall be a matter of right. The remedial action shall conform to such standard, requirement, criteria, or limitation if the State establishes, on the administrative record, that the finding of the President was not supported by substantial evidence. If the court determines that the remedial action shall conform to such standard, requirement, criteria, or limitation, the remedial action shall be so modified and the State may become a signatory to the decree. If the court determines that the remedial action need not conform to such standard, requirement, criteria, or limitation, and the State pays or assures the payment of the additional costs attributable to meeting the standard, requirement, criteria, or limitation, the remedial action shall be so modified and the State shall become a signatory to the decree.\n\n(2)(C) The President may conclude settlement negotiations with potentially responsible parties without State concurrence.\n\n42 U.S.C. § 9621(f)(2).\n\nThe three counts of the State of Michigan's complaint which the district court found preempted were pled as alternative claims to be considered in event the district court had denied entry of the consent decree. The district court, in ruling on the state's motion to intervene, which was filed contemporaneously with the state's complaint, found that Counts V, VI and VII conflicted with the mechanics of CERCLA and the terms of the consent decree, and therefore failed to state viable claims. Transcript of district court proceedings at 51-55(5/4/89). We believe this finding was correct, not because an inherent conflict exists between Michigan law and CERCLA, but because the district court properly determined that the state's request for an alternative remedy was at odds with the terms of the consent decree as we explain hereafter.\n\nSection 9621(f)(2)(A) indicates that the State of Michigan was entitled to challenge the selection of the remedial action prior to the entry of the decree. That provision indicates that such a challenge is permitted only when a proposed remedy in a decree would fail to attain state ARARs. Here the very applicability of Michigan's laws--whether they are in fact ARARs--and whether the soil flushing remedy would attain the state standards, were open questions, and the district court properly allowed Michigan to intervene in order for the court to answer those questions. Because the district court determined that Michigan had failed to show by substantial evidence that the proposed remedial action as a whole would not attain all relevant and applicable state standards under Michigan's environmental laws, the important provision for state involvement in the selection of a remedy found in section 9621(f)(2)(B) did not come into play. It is that provision which protects more stringent state standards from being preempted by an EPA-proposed remedy, but the court need only incorporate state-proposed alternative relief if it determines by substantial evidence that EPA's proposed remedy will not attain the state ARARs, as explained in section 9621(f)(2)(A). Because we agree with the district court that the decree at issue will attain Michigan's applicable environmental standards, we similarly need not address the mechanism whereby alternative relief demanded by the state may be incorporated into the decree.\n\nThat mechanism is important however in showing how Congress has provided for state standards to become part of federal consent decrees, while preventing states from pursuing conflicting relief apart from the terms of a final decree. Under CERCLA, Michigan was free to argue that the decree as proposed by EPA would not attain the state's environmental requirements, and could offer the terms of the 1987 ROD as a possible substitute, which was done in the state's complaint of May, 1989. However, even had the district court, or our own court, found that the proposed decree would not have achieved Michigan's ARARs, we believe the district court would not have had jurisdiction to incorporate the relief demanded by the State of Michigan into the decree. Instead it would have been required to remand the decree to EPA with instructions to amend its proposed remedial action so as to attain the state ARARs. As the statute indicates, \"if the court determines that the remedial action shall conform to such standard, requirement, criteria, or limitation, the remedial action shall be so modified and the State may become a signatory to the decree.\" While the statute does not say so expressly, we believe this modification would have to be made by EPA, not the reviewing court, upon its determination that a state ARAR would not be attained.\n\nAs noted in our discussion of the standard of review, Congress has properly left to the President and EPA the task of developing fair and reasonable decrees. The district court therefore acted properly in ruling on May 4, 1989, over two months before approving the decree, that Michigan had failed to state viable claims in counts V-VII of its complaint. The district court correctly determined that even if it were later to determine that the proposed decree would not attain state ARARs, counts V-VII demanded relief-- i.e., reimposition of the 1987 ROD and its incineration remedy along with recovery of the state's cleanup costs\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e--which the court was not empowered to grant. Congress could not have intended that federal courts or the states be empowered to rewrite consent decrees to conform them to state ARARs. That is a task properly left to EPA. Once a court determines under section 9621(f)(2) that a proposed decree will not attain state ARARs, the court should remand the decree with orders to EPA to make appropriate changes using the agency's expertise and the guidelines of the state ARARs. The district court therefore properly dismissed the three counts which sought relief the court could not itself insert into the decree, even as the court allowed the state to intervene to assert that its ARARs would not be met. Because we agree with the district court that the ARARs will be attained by the decree, we need not remand to EPA with instructions for modifications to attain the state standards.\n\nOur reading of section 9621(f), a provision which as Senator Stafford noted, is \"admittedly complex, and very probably confusing,\" reconciles the earlier quoted statements of Senators Stafford and Mitchell that state environmental standards are not preempted by CERCLA, with the comment by Rep. Eckert, also a key figure in the 1986 reauthorization of CERCLA, who said, \"when a site is cleaned up in accordance with section 121, including requirements relating to State involvement, a State may not then bring a separate action in State court to impose additional or more stringent state standards.\" 132 Cong. Rec. H 9,576 (October 8, 1986). While our duty in interpreting statutes does not extend to reconciling all congressional comments concerning a law, we believe our interpretation is consistent with the comments of all three legislators, because we find that more stringent state environmental laws must be incorporated by EPA into federal consent decrees if relevant and applicable, but thereafter the state may not seek other remedies that are at odds with the terms of the decree.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nThe Tenth Circuit has recently held that states may not use CERCLA to obtain injunctive relief against polluters, apart from the terms of a valid consent decree. Colorado v. Idarado Mining Co., 916 F.2d 1486 (10th Cir. 1990). Our holding today is entirely consistent with the Tenth Circuit's reasoning, though we decline to decide the question specifically addressed there concerning the rights of states when EPA has taken no action at a site and the state seeks injunctive relief under CERCLA rather than under state statutes. The Tenth Circuit's opinion holds that 42 U.S.C. § 9621(e)(2), which states that \"[a] State may enforce any Federal or State standard, requirement, criteria, or limitation to which the remedial action is required to conform under this chapter . . .,\" refers only to those federal and state standards which are embodied in a consent decree or other settlement through the provisions for state participation found in section 9621(f)(2). The Tenth Circuit found that this interpretation recognizes Congress' intent to allow for state standards to be met when relevant and applicable, without allowing states to impose additional obligations on PRPs beyond the terms of a federal agreement. We agree, but confine our holding to the more limited context of this case in which EPA proposed a consent decree under CERCLA and Michigan filed claims for injunctive relief under state law.\n\nCERCLA does not preempt state environmental ARARs which set higher cleanup standards than the federal statute. Instead, it creates a mechanism whereby state environmental laws which are more stringent than federal standards are to be incorporated (unless justifiably waived) into a consent decree at the time a federal district court reviews the decree. Yet once the decree is entered, the state may not seek to impose additional penalties on the defendants for state and federal environmental violations adequately covered by the decree. This statutory mechanism accomplishes Congress' dual goal of allowing states with strong environmental laws to maintain the high cleanup standards their citizens desire, while preventing states from unduly delaying remedies properly entered by a federal court pursuant to CERCLA. We eschew use of the word preemption in this context because of the distinction between preemption of state ARARs, which CERCLA does not call for (unless less stringent than their federal counterparts), and preclusion of independent state remedies following entry of a consent decree, which we find CERCLA does require. Aside from this semantic distinction, we affirm the district court's dismissal of Counts V-VII of the State of Michigan's complaint.\n\nNothing in our holding today should be viewed as denying the State of Michigan the right under 42 U.S.C. § 9621(e)(2) to enforce the terms of the consent decree against the settling defendants. Additionally, the State of Michigan is entitled to spend its own money in an effort to clean up the Rose Site beyond the terms of the consent decree, as allowed by section 9621(f)(2)(B). The state may not however interfere with the proper implementation of the decree.\n\nIX. CONCLUSION\n\nIn summary, it is necessary to make some additional comments regarding the scope of our review. We have meticulously poured over the voluminous record and examined, in detail, all of the arguments made on appeal. Cf. Ethyl Corp., supra, 541 F.2d at 36 (\"The more technical the case, the more intensive must be the court's efforts to understand the evidence . . . [to] properly perform its appellate function.\"). We believe the consent decree adequately takes into account all of CERCLA's requirements.\n\nIn particular, we do not find that the adoption of soil flushing as a remedy for the Rose Site subsurface soils is an arbitrary and capricious choice. EPA's reversal of its original opinion on the effectiveness of soil flushing has been adequately explained. We further find that EPA would not have acted otherwise had that agency considered the Hayes affidavit. Allowing defendants to test soil flushing under EPA's supervision and pursuant to an established timetable is both fair and reasonable, especially given the fact that both EPA and the State of Michigan regard soil flushing as a cost-effective, proven technology.\n\nWe have found Michigan's anti-degradation law to be an ARAR. Nevertheless we conclude that EPA implicitly waived that ARAR, and that the state has not met its burden to show, by substantial evidence, that the waiver was unjustified. In essence, we agree with the district court that the remedial action as a whole can attain all federal and state ARARs. In addition, we point out that EPA has some flexibility in determining how to comply with Michigan's anti-degradation law. We cannot agree with amici that soil flushing, by definition, violates the state ARAR.\n\nWe also disagree with the state that the decree's covenant not to sue violates 42 U.S.C. § 9622(f)(3). That covenant takes effect only when defendants have completed their work and thus is valid. Moreover, under the factors of 42 U.S.C. § 9622(f)(4), the covenant not to sue is reasonable and in the public interest, especially when examined in light of its exceptions.\n\nAs the remedial action plan, on its face, is to be funded by defendants, it is irrelevant that the state has not entered into a cost-sharing agreement with EPA. The possibility that the Rose Site cleanup may eventually require Superfund monies is insufficient to give the State of Michigan veto power over entry and implementation of a valid consent decree designed to place the total cost of cleanup on the PRPs.\n\nFinally, we agree with the district court that counts V-VII of the State of Michigan's complaint were properly dismissed. Because the consent decree will attain Michigan's applicable standards, we need not consider alternative relief demanded by the state which conflicts with the terms of the decree.\n\nCERCLA and the revised NCP give EPA flexibility to pursue innovative, cost-effective remedies. Though the effectiveness of soil flushing at the Rose Site remains untested, EPA's inclusion of that remedy was not arbitrary or capricious and is fair and reasonable. We urge the settling defendants to start the testing phase promptly so that a thorough cleanup of the Rose Site may soon begin.\n\nAccordingly, the judgment of the district court is AFFIRMED.\n\nWELLFORD, Senior Circuit Judge, concurring:\n\nI am in accord with Judge Engel's thorough statutory review in part I, which sets out the background of the law relating to hazardous waste sites and the particular site in this case. Judge Engel has also carefully recited the pertinent facts of this case in part II, including background data concerning the proposed consent decree which is at issue. He has also described the complex issues before us in this appeal (part III), and has, in my view, correctly described the standard of review problem we encounter in assessing each of the issues on appeal as to the consent decree and the administrative record (part IV). I concur in all respects with parts I through IVA, inclusive.\n\nI disagree with the majority view expressed in part IVB because I am inclined to find that the district court did not err when it refused to consider Robert A. Hayes' affidavit which was offered by the State of Michigan. I believe the district court followed our admonition in Norwich Eaton Pharmaceuticals, Inc. v. Bowen, 808 F.2d 486 (6th Cir.), cert. denied, 484 U.S. 816, 98 L. Ed. 2d 32, 108 S. Ct. 68 (1987):\n\nThe District Court was required to review the agency's decision that Buprenex was approved in 1981 to determine whether that decision was \"arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with law,\" as specified in 5 U.S.C. § 706(2)(A). The scope of review under this section is narrow: \"In applying that standard, the focal point for judicial review should be the administrative record already in existence, not some new record made initially in the reviewing court.\" Camp v. Pitts, 411 U.S. 138, 142, 93 S. Ct. 1241, 1244, 36 L. Ed. 2d 106 (1973).\n\nAs this Court recently noted in Upjohn Mfg. Co. v. Schweiker, 681 F.2d 480 (6th Cir. 1982), de novo review of agency action is the exception rather than the rule, unless required by statute. \"' De novo review is appropriate only where there are inadequate factfinding procedures in an adjudicatory proceeding, or where judicial proceedings are brought to enforce certain administrative actions.'\" Id. at 483 (quoting Camp v. Pitts, 411 U.S. 138, 142, 93 S. Ct. 1241, 1244, 36 L. Ed. 2d 106 (1973)).\n\nThus, consideration of evidence outside the administrative record is proper under some circumstances, e.g., \"for background information . . . or for the limited purposes of ascertaining whether the agency considered all the relevant factors or fully explicated its course of conduct or grounds of decision.\" Id. (citations omitted).\n\nMoreover, the District Court stated in its Order that it based is decision upon its \"review of the administrative record, the memoranda and the arguments by counsel.\" Joint Appendix at 263. The Order does not reveal that the District Court used any evidence outside the administrative record in reaching its decision. Thus, we find that the District Court did not conduct a trial de novo and that the Government's contention that the District Court based its decision on information outside the administrative record is without merit.\n\nNorwich Eaton, 808 F.2d at 489.\n\nA court should admit affidavits that are not part of the record only for the limited purposes of providing \"background information,\" considering whether the agency fully explained \"its course of conduct\" or determining\" \"whether the agency considered all relevant factors.\" In Norwich Eaton, we affirmed the district court's decision because it was not based on outside-the-record information. I, therefore, conclude that Norwich Eaton does not mandate consideration of the Hayes' affidavit.\n\nI agree with the majority that judges are \"ill-equipped to engage in de novo review\" of the highly technical and complex matters involved in this proceeding. I further agree that \"if in the court's admittedly unscientific judgment, some new evidence which was unavailable to the agency seems so significant that the agency's original action now seems questionable, the reviewing court should remand the consent decree so that EPA's experts can consider the new information.\" (Emphasis added). To be considered for the limited purposes indicated, the proponent must prove that the additional evidence is new and the kind of evidence which was unavailable at the time of the agency's hearings and consideration of the consent decree.\n\nIn this case, during the course of monitoring compliance with the decree, there may be opportunities to present new evidence to the EPA for reconsideration of the efficacy of the steps taken to address this waste problem. If, as determined by the majority, the Hayes affidavit were to be considered for this limited purpose, I would agree with the majority's analysis, although its consideration is not mandated, in my view.\n\nI further concur in the conclusion in part V that the consent decree is neither arbitrary nor capricious. In sum, I agree that EPA's responses \"demonstrate[] the sufficiency of EPA's reconsideration of soil flushing as a potentially viable remedy,\" and that the consent decree presents a \"rational\" approach.\n\nI disagree with the conclusion reached in part VIIA that Michigan's anti-degradation law is an ARAR under 42 U.S.C. § 9621(d)(2)(A). To be legally enforceable and avoid a vagueness challenge, state ARARs, must be specific and definite so \"that ordinary people can understand what conduct is prohibited.\" Kolender v. Lawson, 461 U.S. 352, 357, 75 L. Ed. 2d 903, 103 S. Ct. 1855 (1983); see also Colten v. Kentucky, 407 U.S. 104, 32 L. Ed. 2d 584, 92 S. Ct. 1953 (1972). The majority concedes that Michigan's current implementing regulations to its WRCA fail to provide \"specific requirements\" since they merely forbid \"'degradations' of the 'local background groundwater quality.'\" Michigan's policies with regard to soil flushing are inconsistent, and I would find these laws to be unenforceable, vague and insufficient to be classified as ARARs. See Kelley v. United States, 618 F. Supp. 1103 (W.D. Mich. 1985).\n\nI agree with the rationale and result reached in part VIIA-1 and 2 that Michigan's laws, which are more stringent than federal standards, were properly promulgated despite my conclusion that they are not ARARs. I disagree, however, with the majority's conclusion that Michigan's anti-degradation law, under CERCLA or SARA, is legally applicable as an ARAR to the Rose Site or relevant and appropriate to the remedial action selected in the consent decree.\n\nIn sum, I am in agreement with the conclusion reached by the majority. My disagreement touches only a few steps or procedures in arriving at that conclusion.\n\n\u003cspan class=\"fn\"\u003e* The Honorable Harry W. Wellford assumed senior status on January 21, 1991.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The defendants are Akzo Coating of America, Inc., Chrysler Motors Corp., Detrex Corp., Fabricon Automotive Products, Federal Screw Works, Ford Motor Co., General Motors Corp., Hoechst Celanese Corp., Michigan Industrial Finishes, RPM, Inc., TRW, In. and Uniroyal, Inc. The State of Michigan itself did not join in the consent decree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \"Removal\" actions are typically short term or temporary cleanup measures. \"Remedial\" actions, on the other hand, are generally long term or permanent containment or disposal programs. The terms are further defined in 42 U.S.C. §§ 9601(23), 9601(24).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The NPL, established by rule by EPA pursuant to Section 105 of CERCLA, lists those hazardous waste sites at which the release of hazardous substances presents the greatest threat to public health, welfare and the environment. 40 C.F.R. Part 300, App. B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The factors to be considered by an agency conducting an RI/FS are detailed at 40 C.F.R. § 300.68(e)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"Groundwater is subsurface water that exists below a water table in soils, rocks, or geological formations that are fully saturated.\" The Protection of Groundwater and Public Drinking Supplies: Recent Trends in Litigation and Legislation, 42 Vand. L. Rev., 1649, 1649 (1989) [hereinafter The Protection of Groundwater ].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This involves, almost literally, a baking of the soil using electrically-powered rods.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Groundwater cleanup at the Rose Site is divided into Phase I and Phase II levels under the consent decree. Phase I levels correspond to a lifetime excess cancer risk of 1 in 100,000 due to continuous exposure to a particular chemical. Phase II levels generally are the ARAR levels, and correspond to a lifetime excess cancer rate of 1 in 1,000,000. Defendants are required to meet the Phase I levels, after which EPA will operate the groundwater extraction and soil flushing systems using a trust fund established by defendants until EPA is satisfied that Phase II levels have been achieved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The convenant not to sue does not cover: (1) liability arising from hazardous substances removed from the facility (with one exception not relevant here); (2) natural resource damages; (3) criminal liability; (4) claims based on a failure of the defendants to meet the requirements of the consent decree; and (5) liability for violations of federal law which occur during the implementation of the remedial action plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. M.C.L.A. § 323.1, et seq., (Michigan Water Resources Commission Act (\"WRCA\")), and Mich. Admin. Code R. 323.2201, et seq., (the \"Part 22, Groundwater Regulations\") are collectively referred to as Michigan's anti-degradation law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. \"In de novo review, the appellate court must review the record in light of its own independent judgment without giving special weight to the prior decision.\" United States v. Brian N., 900 F.2d 218, 220 (10th Cir. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The timing of the district court's review was proper here. While judicial review of citizen suits challenging the implementation of a remedial action plan under CERCLA may not occur until the cleanup has been completed, 42 U.S.C. § 9613(h)(4); see also Schalk v. Reilly, 900 F.2d 1091 (7th Cir. 1990); Alabama v. United States EPA, 871 F.2d 1548 (11th Cir. 1989), federal district courts do have jurisdiction over an \"action to enforce an order issued under section 9606(a),\" 42 U.S.C. § 9613(h)(2), as well as an \"action under section 9606 of this title in which the United States has moved to compel a remedial action.\" 42 U.S.C. § 9613(h)(5). The latter provisions do not contain a requirement that review must wait until the remedy is completed, as is found in the citizen suit provision, and therefore the district court had jurisdiction to consider entry of the consent decree when the decree was presented to the court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. An important exception to the limited scope of review allowed by CERCLA may arise when EPA has not taken its customary role in developing a remedial cleanup plan. If EPA plays only a limited role in formulating a plan, then the President cannot be deemed to have taken or ordered the remedy, and a reviewing court would not be bound by the administrative record and the arbitrary and capricious standard. See United States v. Allied-Signal Corp., 736 F. Supp. 1553 (N.D. Cal. 1990). There the court concluded that where the Navy, not EPA, had developed a remedial action plan, and the Navy was itself partially liable for the cleanup, de novo review was warranted and necessary in the district court. \"Had EPA reviewed and approved the remedial action plan devised by the Navy, this might be a different case.\" 736 F. Supp. at 1558.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. CERCLA, 42 U.S.C. § 9622: Settlements (d)(2) Public participation (A) Filing of proposed judgment--At least 30 days before a final judgment is entered under paragraph (1), [regarding consent decrees], the proposed judgment shall be filed with the court. (B) Opportunity for comment--The Attorney General shall provide an opportunity to persons who are not named as parties to the action to comment on the proposed judgment before its entry by the court as a final judgment. The Attorney General shall consider, and file with the court, any written comments, views, or allegations relating to the proposed judgment. The Attorney General may withdraw or withhold its consent to the proposed judgment if the comments, views, and allegations concerning the judgment disclose facts or considerations which indicate that the proposed judgment is inappropriate, improper, or inadequate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. EPA's regulations are in line with our conclusion on the appropriate standard of review for evidence submitted outside of the administrative record: The lead agency [EPA] is required to consider comments submitted by interested persons after the close of the public comment period [in front of EPA] only to the extent that the comments contain significant information not contained elsewhere in the administrative record file which could not have been submitted during the public comment period and which substantially support the need to significantly alter the response action. All such comments and any responses thereto shall be placed in the administrative record file. 40 C.F.R. § 300.825(c) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The 1987 RI/FS describes the site geology as \"a stratified sequence of sand layers, interbedded with lenses of silt clay overlying glacial till believed to be laterally continuous beneath the site.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See Exh. 3.22a, Amendment at 3. It is not clear how deep the excavation of PCBs will reach, but amici pointed out that under the original ROD excavation of PCB and VOC-contaminated soil would have varied between one and fourteen feet. The amended ROD provides only for excavation of PCB-contaminated soil, which is located at shallower depths than the VOCs, and thus it is unlikely the proposed excavation will reach much beyond five to seven feet. Nevertheless, the soil borings show that a lot of the clay is located within the first few feet of soil.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. According to EPA \"sandy soils may result in uncontrolled migration, and the inclusion of a clay-confining layer would be a desirable measure to control migration.\" Exh. 3.2, Technology Screening Guide for Treatment of CERCLA Soils and Sludges (EPA Sept. 1988). Thus, the real impediment to soil flushing's effectiveness at the Rose Site may be variable permeability, which can produce inconsistent flushing, rather than the presence of clay layers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Letter from Tom Mann, MDNR Geologist, to Bob Hayes, MDNR Geologist, Interoffice Communication, Jt. App. at 536 (May 15, 1989). No authority is cited for the proposition that geophysical logs are more accurate than drilling logs. Even assuming that claim is correct, Tom Mann's conclusions on the results of the geophysical logs do not help us determine the difference in the degree of accuracy between the two types of logs: Even where a single clay is encountered, the driller's log will show it as thicker and sandier than the geophysical log indicates; this is probably due to mixing of the cuttings. Thus, the geophysical logs are more accurate. Further, the geophysical logs suggest the clay zones are more competent. Id. (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The decree contains a number of other provisions designed to control the quality of the remedial work. Defendants, for example, must follow proper quality assurance procedures, including EPA's \"Interim Guidelines and Specifications for Preparing Quality Assurance Project Plans.\" Id. Further, \"all remedial action work to be performed by the Settling Defendants . . . shall be under the direction and supervision of a qualified professional engineer, architect or consultant . . . subject to disapproval for good cause. . . .\" Consent Decree VI(B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. As stated in the fact summary, supra, the ROD listed eight specific criteria EPA would consider before substituting soil flushing for incineration. Those criteria, i.e. economies of scale, community acceptance, cleanup time, land regulations, reliability of soil flushing, implementability, complete site remediation, and cost effectiveness, were considered either explicitly or implicitly in EPA's explanation of significant differences and the responsiveness summary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See, e.g., Exh. 3.3, Remedial Response at Hazardous Waste Sites -- Goose Farm, Pumstead, N.J., at 11-14 (Mar. 1984) (\"Analysis of the clays indicated that a high level of organics (30mg/g TOC) was seeping slowly through the clay layer;\" therefore, \"to facilitate flushing of the contaminants from the low permeability clay layer, the pressure injection system was operated with varying pressures by using on/off relays in order to create a pressure pulse.\"); Exh. 3.5, In Situ Flushing \u0026 Soils Washing Technologies For Superfund Sites -- Presented by EPA at RCRA/Superfund Engineering Technology Transfer Symposium, at 117 (\"In choosing the soil to be used in the tests, native soils at each of 10 Region II Superfund sites were identified to determine the most commonly occurring soil series,\" which was \"a fine-to-coarse loamy soil of humid climates, containing zones of clay accumulation.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. To the extent that soil flushing could be deemed \"innovative\" under CERCLA, EPA could still be required to develop such technologies if they offer the potential for \"comparable\" performance with \"proven\" technologies. 40 C.F.R. § 300.430(a)(1)(iii)(E).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Exh. 3.4, EPA Handbook -- Remedial Action at Waste Disposal Sites, at 9-46; White, EPA, Shively and Dunkel, CH2M Hill, and Cortese, Summary of Hazardous Waste Treatment at Superfund Site, Current Developments, Env't Rptr. (BNA) 1121 (Aug. 21, 1987); Exh. 3.21(j), Comments of John Iannone, Civil Engineer for Hart \u0026 Associates, Transcript of Public Forum Regarding Proposed Settlement Plan, at 17 (Dec. 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We find no merit to the state's claim that soil flushing violates section 9621(b) which gives preference to treatment \"which permanently and significantly reduces the volume, toxicity or mobility of the hazardous substances, pollutants and chemicals. . . .\" While soil flushing temporarily \"increases\" the mobility of contaminants, it does so with the goal of \"reducing\" their mobility permanently. Not only is the state's argument ironic in light of the fact that if legitimate it would apply to other decrees to which the state has consented, but also section 9621's directive is merely discretionary and emphasizes permanent, not temporary, results.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Faced with a complicated consent decree, a New York district court encountered a similar task in determining whether a decree was fair and in the best interest of the public: Weighing strongly in favor of approval is the fact that the plan can be implemented immediately. Rejection of the plan would result in the expenditure of considerable time, money, and effort in litigation. In the meantime, chemicals from the Site would continue to leach out and further contaminate the surrounding area. And, of course, as in any lawsuit, plaintiffs have no guarantee of ultimate success. The resources of the governmental parties are limited. If forced to prosecute, they might well extend inordinate amounts of these resources on this single Landfill Site, to the detriment of other areas in other parts of the country. We must keep in mind that the Hyde Park Landfill is only one of many such sites. Hooker Chemicals \u0026 Plastics Corp., 540 F. Supp. at 1080.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. As explained in greater detail below, the decree's covenant not to sue contains express exceptions for, among other events: natural resource damage; claims based on a failure by the settling defendants to meet the requirements of the consent decree; liability for violations of federal law which occur during implementation of the remedial action; and reimbursement to the government for the cost of any additional response action undertaken by EPA under CERCLA if (a) conditions at the site, previously unknown to the government are discovered after entry of the decree, or (b) information on previously unknown conditions indicates the remedial action is not protective of the human health and the environment. Consent Decree Section VII. The breadth of these exceptions ensures that whatever remedy defendants implement, they will do so carefully. See also 42 U.S.C. § 9607(a). Moreover, EPA has developed a Technical Assistance Grants (\"TAG\") program which provides monies to citizen groups with matching funds who wish to satisfy themselves that the cleanup is being conducted as agreed upon.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. At the end of the original ROD, one of EPA's Regional Administrators stated: In the event that, during the remedial design investigations on the Rose site waste, it is discovered that the cost of thermal destruction exceeds the cost estimate in the Feasibility Study by 50% or that thermal destruction will not be necessary to permanently treat the entire estimated volume of wastes, I will reconsider the Record of Decision to determine if the selected alternative still represents the cost-effective remedy and take appropriate action at that time. The State of Michigan will be consulted in the event that I reconsider my decision. ROD, Jt. App. at 331.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Without a settlement, the original ROD remedy would have cost EPA $34 million, of which it was willing to pay about $31 million, with the state paying the other $3 million. EPA, however, expressed concern that due to funding cuts by Congress the $31 million would no longer be available. Exh. 3.22b, Responsiveness Summary, at 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Moreover, if and when soil flushing is deemed inadequate under the decree, defendants are required to propose a new permanent technology within six months, thus preventing undue delays due to ineffective remedial action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. There are several kinds of applicable or relevant and appropriate environmental requirements (ARARs). ARARs may be chemical-specific (e.g., an established level for a specific chemical in groundwater), action-specific (e.g., a land disposal restriction for RCRA hazardous wastes), or location-specific (e.g., a restriction on actions that adversely affects wetlands). Thus, the concept is much broader than that of a specific cleanup level for a site. Starfield, The 1990 Nat'l. Contingency Plan -- More Detail and More Structure, But Still a Balancing Act, 20 ELR 10222, 10230 (June 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. According to EPA, in order for potential state ARARs to be \"legally enforceable\" they \"must be issued in accordance with state procedural laws or standards and contain specific enforcement provisions or be otherwise enforceable under state law.\" NCP, Final Rule, 55 Fed. Reg. at 8746. Defendants do not, and could not, contend that Michigan's anti-degradation law lacks specific enforcement provisions under state law. Section 6(c) of the WRCA, as drafted at the time of the consent decree, states that a violation of section 6(a) \"may be abated according to law in an action brought by the Attorney General in a court of competent jurisdiction.\" M.C.L.A. § 323.6(c). Moreover, section 10 of the WRCA provides for both civil remedies and criminal sanctions for violations of the WRCA or its accompanying administrative rules. M.C.L.A. § 323.10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See also Starfield, supra, 20 ELR at 10236 (\"If a state law sets forth an anti-degradation goal without regulations or direction as to how to achieve it, the Agency must decide whether the goal constitutes an ARAR (e.g., is it enforceable), and then may exercise flexibility in determining how to comply with the goal.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Defendants also contend that the vagueness and unenforceability of Michigan's anti-degradation law is evident in the inconsistency of its application. The state's claim before the lower court that section 6(a) of the WRCA and the Part 22 Rules provide cleanup standards with respect to the Rose Site is, according to defendants, inconsistent with their concurrence in a recent ROD stating just the opposite. In 1988, EPA's ROD for the U.S. Aviex Site in Niles, Michigan, adopted soil flushing as its primary remedy in the RAP. Although soil flushing would be used, the WRCA was found inapplicable because no \"discharges\" into the groundwater were proposed. Exh. 3.8, U.S. Aviex ROD, at 21. As discussed below, however, we believe that soil flushing, if implemented, would constitute a discharge into the groundwaters of the Rose Site but would also fall within an exception to the WRCA. EPA may not have adequately explained its position in the U.S. Aviex ROD, as its own regulations support our conclusion. See infra subsection B for a discussion of the Rose Site decree's compliance with Michigan's anti-degradation law. Moreover, while under CERCLA and ARAR's inconsistent application allows EPA to \"waive\" compliance with that ARAR, see section 9621(d)(4), it is not determinative of whether the state requirement is in fact an ARAR. Therefore, the fact that courts have required, according to defendants, differing levels of cleanup under the WRCA does not affect the determination of whether such a law is a state ARAR if that law is otherwise enforceable. Indeed, as local background groundwater quality naturally varies from acquifer to acquifer, some variation in cleanup requirements is to be expected.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The Final NCP, which is applicable to ongoing actions (NCP, Final Rule, 55 Fed. Reg. at 8795), deals with the potential applicability of both maximum contaminant levels (\"MCLs\") and maximum contaminant level goals (\"MCLGs\") as federal ARARs by providing that MCLGs that are greater than zero shall be attained where \"relevant and appropriate under the circumstances of the release.\" (Thus, it is expected that MCLG's above zero will generally be the cleanup level for actual and potential drinking water sources.) However, where the MCLG is set at zero (as it is for carcinogens), the relevant MCL would be used as the cleanup standard, where relevant and appropriate. Starfield, supra, 20 ELR at 10231 (citing 40 C.F.R. § 300.430(e)(2)(i)(B), (C). The parties have not asserted that any MCLG's for non-carcinogens are ARARs; moreover, \"the rule's requirement of 'substantial compliance' with potentially applicable NCP requirements affords private parties some latitude in meeting the full set of revised NCP provisions. NCP, Final Rule, 55 Fed. Reg. at 8795.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Compare Mich. Admin. Code R. 323.2202(m) with R. 323.2202(r), and R 323.2207(5)(c) with R 323.2207(5)(d), which distinguish between those two terms.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Under their interpretation of the Rules, defendants would not be required to clean up prior degradation because the \"existing groundwater quality\" would be the reference point for determining violations of Michigan's anti-degradation law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See Mich. Admin. Code R. 323.2202(g) (referring to \"degradation\" as changes in groundwater quality determined by the commission to be a deterioration in terms of the magnitude of the change and the importance of the parameters describing local background quality).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. \"Applicable requirements\" are those standards promulgated under federal or state law that specifically address a hazardous substance, pollutant, contaminant, remedial action, or other circumstance at a CERCLA site. In contrast, \"relevant and appropriate requirements\" are those standards which, while not applicable to a CERCLA remedial action, are promulgated under federal or state law and address problems or situations sufficiently similar to those encountered at a site that their use is well situated to that site. 300 C.F.R. § 300.6; Interim Guidance, 52 Fed. Reg. at 32497; NCP Final Rule, 55 Fed. Reg. at 8742.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See Brief of Amici at 12 n.3 (\"For purposes of this brief, the amici will assume that attainment of Target Cleanup Levels identified in the 1987 RI/FS and the 1987 Record of Decision will result in attainment of ARARs.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. If we held otherwise, EPA could effectively evade state participation in such cases where it had doubts whether a proposed remedial action met relevant ARARs but chose not to make and publish formal findings to that effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. While the district court correctly permitted the state to intervene in this case, it allowed the state to challenge the waiver of Michigan's anti-degradation law even though it found that the state had not established that EPA had ever made such a waiver. To eliminate future confusion on the mechanics of section 9621(f)(2)(B), we have methodically set forth in the text of the opinion what we believe is the correct procedure involved when a state intervenes under that provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See discussion supra at 39-40 \u0026 n.25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. As alluded to by its own regulations, the fact that (1) Michigan's anti-degradation law on its face requires no numerical standard of cleanup and (2) the state has not submitted to EPA any evidence determining the local background quality at the Rose Site, suggests that EPA has considerable flexibility in deciding how to comply with that ARAR.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. We note the difference between the argument that EPA must determine prior to implementation that soil flushing will attain the state ARAR's level of cleanup -- a determination which is not necessary here as we find that that ARAR was waived with regard to soil flushing -- and amici's contention that soil flushing when implemented will violate the ARAR (irrespective of whether it will eventually satisfy the requirement) because contaminants will be discharged into the groundwater.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The potential danger of undetected leaching of contaminants outside the immediate area to be cleaned is discussed at p. 31, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Defendants contend that this issue and also the one presented in the next subsection, i.e. whether the decree violates section 104(c)(3), were not timely preserved below. Our review of the record, however, does not enable us to either confirm or deny defendants' contention; in any event, we will reach the merits of these issues based on our duty to independently determine whether the decree is fair, adequate and reasonable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Most industries seek agreements which impose a definable cap on their potential liability. Uncertain potential liability seriously frustrates corporate planning and needed bank financing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Under 42 U.S.C. § 9607, Michigan may recover all of its costs or damages as a result of actions taken in response to the pollution at Rose Township, so state law remedies providing for cost recovery to the state are surplusage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See Starfield, supra, 20 ELR at 10243 (where a state-proposed remedy \"would conflict or be inconsistent with the EPA-selected remedy, it would not be appropriate to allow the state to proceed without EPA approval. Indeed, to do so would be tantamount to giving the states a veto power over EPA remedial action decisions\").\u003c/span\u003e\n\n",
    "body_length": 190783,
    "citedas": [
      "949 F.2d 1409"
    ],
    "attorneys": "FOR UNITED STATES OF AMERICA, Plaintiff-Appellee, Geneva S. Halliday, Asst. U.S. Attorney, BRIEFED, 313-237-4778, [NTC gvt], Office of the U.S. Attorney, 231 Lafayette Boulevard, Suite 817 Federal Building, Detroit, MI 48226, J. Carol Williams, ARGUED, 202-514-5313, [COR NTC gvt], U.S. Department of Justice, Land \u0026 Natural Resources Division, P.O. Box 23795, L'Enfant Plaza Station, Washington, DC 20026 FOR STATE OF MICHIGAN, Intervenor - Appellant, Cross Appellee, Jeremy M. Firestone, BRIEFED, 517-373-7780, [COR NTC gvt], Robert P. Reichel, Asst. Attorney Gen., ARGUED, BRIEFED, 517-373-7780, [COR LD NTC gvt], Office of the Attorney General of Michigan, 525 W. Ottawa Street, Suite 640 Law Building, P.O. Box 30212, Lansing, MI 48909, Stewart H. Freeman, 517-373-6096, [COR NTC gvt], Office of the Attorney General, Tort Defense Division, 401 S. Washington Square, Suite 1 Plaza One Building, P.O. Box 30217, Lansing, MI 48909 FOR AKZO COATINGS OF AMERICA, INC., Defendant - Appellee, Cross-Appellant, James F. Allen, 614-365-2700, [COR NTC ret], Squire, Sanders \u0026 Dempsey, 41 S. High Street, Suite 1300 Huntington Center, Columbus, OH 43215, J.K. MacKendree Day, [NTC ret], 300 S. Riverside Plaza, Chicago, IL 60606 FOR CHRYSLER MOTORS CORPORATION, Defendant - Appellee, Cross-Appellant, Michael Grice, 313-956-2075, [COR NTC ret] P.O. Box 1919, Detroit, MI 48288, Keith J. Lerminiaux, ARGUED \u0026 BRIEFED, 313-223-3500, [COR NTC ret], Dickinson, Wright, Moon, Van, Dusen \u0026 Freeman, 800 First National Building, Detroit, MI 48226-3555 FOR DETREX CORPORATION, Defendant - Appellee, Cross-Appellant, Robert A. Emmett, BRIEFED, 202-457-6144, [COR NTC ret], Reed, Smith, Shaw \u0026 McClay, 1200 18th Street, N.W., Washington, DC 20036, John A. Kruse, BRIEFED, 313-964-3100, [COR NTC ret], Harvey, Kruse, Westen \u0026 Milan, 660 Woodward, Suite 1590 First National Building, Detroit, MI 48226 FOR FABRICON AUTOMOTIVE PRODUCTS, Defendant - Appellee, Cross-Appellant, David Matthews, BRIEFED, [COR LD NTC ret], P.O. Box 779, Cincinnati, OH 45201 FOR FEDERAL SCREW WORKS, Defendant - Appellee, Cross-Appellant, Frank S. Galgan, BRIEFED, 313-528-3223, [COR NTC ret], 100 E. Big Beaver Road, Suite 900, Troy, MI 48083 FOR MOTOR COMPANY, Defendant - Appellee, Cross-Appellant, Mark D. Edie, BRIEFED, 313-390-1874, [COR NTC ret], 401 Parkland Towers, W., One Parklane Boulevard, Dearborn, MI 48126 FOR GENERAL MOTORS CORPORATION, Defendant - Appellee, Cross-Appellant, David L. Tripp, BRIEFED, 313-568-6748, [NTC ret], Dykema, Gossett, Spencer, Goodnow \u0026 Trigg, 400 Renaissance Center, 35th Floor, Detroit, MI 48243-1595 FOR HOECHST CELANESE CORPORATION, Defendant - Appellee, Cross-Appellant, Melinda R. Martinson, BRIEFED, 201-231-2000, [COR LD NTC ret], Hoechst Celanese Corporation, R.R. 202-206, N., Sommerville, NJ 08876-1258 FOR NATURAL RESOURCES DEFENSE COUNCIL, Amicus Curiae, Donald S. Strait, BRIEFED for all amici, 212-727-2700, [NTC ret], Rebecca E. Todd, 212-727-2700, [NTC ret], Natural Resources Defense, Council, Inc., 40 West 20th Street, New York, NY 10011 FOR ENVIRONMENTAL DEFENSE FUND, Amicus Curiae, Karen Florini, 202-387-3500, [NTC ret], Environmental Defense Fund, Inc., 1616 P. Street, N.W., Washington, DC 20036 FOR THE SIERRA CLUB, Amicus Curiae, A. Blakeman Early, 202-547-1141, [NTC ret], 408 C. Street, N.E., Washington, DC 20002 FOR MICHIGAN INDUSTRIAL FINISHES, Defendant - Appellee, Cross-Appellant, William J. Selinsky, 313-352-9080, Mark J. Rudolph, 313-352-9080, [COR NTC ret], Provizer, Eisenberg, Lichtenstein \u0026 Pearlman, 4000 Town Center, Suite 1240 N. Park Plaza, Southfield, MI 48075 FOR RPM, INC., Defendant - Appellee, Cross-Appellant, Thomas W.B. Porter, BRIEFED, 313-568-5423, [COR NTC ret], David L. Tripp, [COR NTC ret], Dykema, Gossett, Spencer, Goodnow \u0026 Trigg, 400 Renaissance Center, 35th Floor, Detroit, MI 48243-1595 FOR TRW, INC., UNIROYAL, INC., Defendant - Appellee, Cross-Appellant, Thomas P. Wilczak, 313-259-7110, [COR NTC ret], Barbara H. Anderson, 313-259-7110, [COR NTC ret], David L. Maurer, BRIEFED, 313-259-7110, [COR NTC ret], Pepper, Hamilton \u0026 Scheetz, 100 Renaissance Center, Suite 3600, Detroit, MI 48243",
    "category": [
      "251",
      "36"
    ],
    "judges": "Before: Jones, Circuit Judge; Engel and Wellford,*fn* Senior Circuit Judges. Engel, Senior Circuit Judge, delivered the opinion of the court, in which Jones, Circuit Judge, joined. Wellford, Senior Circuit Judge, delivered a separate concurring opinion.",
    "citation_count": 94
  }
}
