{
  "id": "qoU5P2YBTlTomsSBx_BH",
  "document": {
    "title": "Coalition for Government Procurement v. Federal Prison Industries",
    "full_title": "COALITION FOR GOVERNMENT PROCUREMENT, ET AL. v. FEDERAL PRISON INDUSTRIES, INC., ET AL. .",
    "jurisdiction": "Sixth Circuit",
    "date": "2004-04-12T00:00:00.000Z",
    "docket": "No. 01-2231",
    "body": "RECOMMENDED FOR FULL-TEXT PUBLICATION Pursuant to Sixth Circuit Rule 206\n\nELECTRONIC CITATION: 2004 FED App. 0101P (6th Cir.)\n\nArgued: February 6, 2003\n\nECONOMUS, D. J., delivered the opinion of the court, in which GILMAN, J., joined. GIBBONS, J., concurred in the judgment only.\n\nOPINION\n\nI. OVERVIEW\n\nThis appeal draws the court into the longstanding conflict between the government's policy of employing federal inmates in the manufacture of goods and the challenges faced by the private industries compelled to compete with inmate-produced wares. Nearly seven decades ago, the United States Supreme Court addressed the \"evil\" posed by \"the sale of convict-made goods in competition with the products of free labor,\" and opined, \"[F]ree labor, properly compensated, cannot compete successfully with the enforced and unpaid or underpaid convict labor of the prison.\" Whitfield v. Ohio, 297 U.S. 431, 439 (1936). Since Whitfield, the debate over the use of inmate labor largely has been reserved for the policymakers operating in the other branches of government. The role of the courts has been limited to examining whether the terms and conditions of inmate employment comply with constitutional and statutory standards. See generally Hope v. Pelzer, 536 U.S. 730 (2002) (examining liability of prison officials pursuant to 42 U.S.C. § 1983 where said officials disciplined an inmate for refusal to work on a \"chain-gang\"); Richardson v. McKnight, 521 U.S. 399, 405-06 (1999) (acknowledging that privately-operated prisons may be held liable for injuries suffered by inmates employed on \"chain gangs\" and \"work-farms\"). This appeal requires, however, that the court re-enter the conflict and examine whether the agency charged by Congress to manage inmate labor -- Federal Prison Industries, Inc. -- has acted within its administrative authority.\n\nSpecifically, the appellants-plaintiffs, the Coalition for Government Procurement (\"CGP\") -- a non-profit trade association representing manufacturers of office furniture -- and several CGP members,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e appeal the district court's award of summary judgment in favor of Federal Prison Industries, Inc. (\"FPI\" or \"UNICOR\"),\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and its Board of Directors (the \"Board\"), in this action brought pursuant to UNICOR's organic statute, 18 U.S.C. §§ 4121-4129 (2003), the judicial review provisions of the Administrative Procedures Act (\"APA\"), 5 U.S.C. §§ 701-706, and the Just Compensation Clause of the Fifth Amendment to the United States Constitution, U.S. Const. amend. V.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The Coalition asserts that UNICOR violated the foregoing provisions from 1991-1995 when it significantly expanded its production of office furniture without initiating the public notice and comment procedures required by section\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e 4122. The Coalition further asserts that the Board violated the organic statute and the APA when it authorized UNICOR's 1995-1996 requests to significantly expand production of office furniture. Finally, the Coalition contends that UNICOR's direct dealings with private manufacturers and purchasers of office furniture violate the organic statute and the APA.\n\nAs the issues raised in this appeal are matters of first impression among the courts of appeals, we begin our analysis with an extensive examination of the statutory and regulatory framework governing UNICOR's operations. We thereafter address the specific assignments of error.\n\nII.BACKGROUND\n\nA. The Historical Underpinnings of UNICOR's Organic Statute\n\nIn the words of one leading scholar, \"The history of the prison is in large measure a history of prison labor.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e While the issues underlying the instant appeal are steeped in this lengthy history, we narrow our focus to the historical events giving rise to UNICOR.\n\n1. Early Congressional Responses to Inmate-Labor Programs\n\nThe emergence of the penitentiary system at the end of the eighteenth century resulted in the states taking custody of large and restless inmate populations whose ward placed considerable pressures on state treasuries.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The states responded with efforts designed to reduce \"idle hands\" among the inmates while promoting the self-sufficiency of the penitentiary.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Central to these efforts were inmate-labor programs.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nAs the use of inmate-labor increased throughout the nineteenth and early-twentieth centuries, so too did the cries from the private enterprises, trade associations and labor unions that viewed such programs as threats to free markets and employment. State legislatures responded by enacting measures limiting the scope of inmate-manufactured products. See, e.g., Whitfield, 297 U.S. at 435-440 (examining an Ohio statute barring the sale of inmate goods manufactured outside of the state of Ohio). Similarly, Congress enacted a series of measures designed to curtail the interstate sale of inmate-produced goods.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nNotwithstanding the apparent hostility exhibited by the federal government to the states' use of inmate labor, Congress promoted inmate-labor programs within the federal penitentiary system. For instance, Congress authorized the Attorney General in 1918\n\nto establish, equip, maintain, and operate at the United States Penitentiary in Atlanta, Georgia, a factory or factories for the manufacture of cotton fabrics to supply the requirements of the War and Navy Departments, the Shipping Corporation, cotton duck suitable for tents and other army purposes and canvas for mail sacks and for the manufacture of mail sacks and other similar mail-carrying equipment for the use of the United States Government.\n\nAct of July 10, 1918, ch. 144, § 1, 40 Stat. 896, 896. Similarly, Congress authorized a factory to be constructed at the Leavenworth, Kansas federal penitentiary for the \"manufacture of shoes, brooms, and brushes.\" Act of April3, 1924, ch. 81, 43 Stat. 33, 44-45.\n\nCongress thereafter expanded the use of inmate labor to all federal penitentiaries. See Act of May 27, 1930, ch. 340 §1, 46 Stat. 391, 391 (hereinafter the \"1930 Act\") (\"[T]he Attorney General shall provide employment for all physically fit inmates in the United States penal and correctional institutions.\"). Congress expressly authorized the use of inmate labor in two areas. First, the Attorney General was \"to make available the services of United States prisoners\" for use by federal agencies and departments in the \"construction or repairing roads . . . ; clearing, maintaining, and reforesting public lands; building levees; and for constructing or repairing any public ways or works.\" Act of May 27, 1930, ch. 340 § 2, 46 Stat. at 391. Secondly, the Attorney General was \"to establish such industries as w[ould] produce articles and commodities for consumption in the United States penal and correctional institutions or for sale to the departments and independent establishments of the Federal Government.\" Act of May 27, 1930, ch. 340 § 3, 46 Stat. at 391. The 1930 Act also created a limited market for inmate-produced wares providing that, \"The several Federal departments and independent establishments and all other Government institutions of the United States shall purchase at not to exceed current market prices, such products of the industries herein authorized to be carried on their requirements and as may be available.\" Act of May 27, 1930, ch. 340 § 7, 46 Stat. at 392.\n\nCongress did not, however, authorize the unfettered use of inmate labor. It directed the Attorney General to establish only those industries \"as [would] give the inmates a maximum opportunity to acquire a knowledge and skill in trades and occupations which w[ould] provide them with a means of earning a livelihood upon release.\" Act of May 27, 1930, ch. 340 § 7, 46 Stat. at 392. Similarly, while the 1930 Act \"provide[d] employment for all physically fit inmates,\" it did so only in such \"diversified forms as [would] reduce to a minimum competition with private industry or free labor.\" Act of May 27, 1930, ch. 340 § 1, 46 Stat. at 391. Moreover, Congress explicitly directed that inmate-manufactured products were \"not for sale to the public in competition with private enterprise.\" Act of May 27, 1930, ch. 340 § 3, 46 Stat. at 391.\n\n2. The Creation of UNICOR\n\nFour years later, Congress charged the President \"to create a body corporate of the District of Columbia to be known as ‘Federal Prison Industries.'\" Act of June 23, 1934, ch. 736 §1, 48 Stat. 1211, 1211 (hereinafter the \"1934 legislation\").\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The 1934 legislation otherwise mirrored the 1930 Act with one significant addition: the creation of a board of directors (the \"board\"). Congress directed the President to appoint a five-member board of directors, with industry, labor, agriculture, retailers / consumers, and the Attorney General each represented by one member. See Act of June 23, 1934, ch. 736 § 2, 48 Stat. at 1211. While Congress vested UNICOR with broad discretion to manage inmate-operations, it empowered the board with the authority to balance such operations with the need to protect private industries. See Act of June 23, 1934, ch. 736 § 3, 48 Stat. at 1211 (\"It shall be the duty of the board of directors to diversify so far as practicable prison industrial operations and so operate the prison shops that no single private industry shall be forced to bear an undue burden of competition from the products of the prison workshops.\").\n\nOn December 11, 1934, President Franklin D. Roosevelt issued Executive Order 6917 (the \"Executive Order\"), see (J.A. 983),\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e creating UNICOR and appointing the board. The Executive Order expressly provided:\n\n[UNICOR] shall have power to determine in what manner and to what extent industrial operations shall be carried on in the several penal and correctional institutions of the United States and shall, so far as practicable, so diversify prison industrial operations that no single private industry shall be forced to bear an undue burden of competition with the products of prison workshops. It shall also have power to do all things it is authorized to do by said Act of June 23, 1934, and all things incident to or necessary or proper in the exercise of its functions.\n\nExec. Order No. 6917 ¶ 3. It further provided, \"The heads of the several executive departments, independent establishments and Government owned and Government controlled corporations shall cooperate with [UNICOR] in carrying out its duties and shall purchase, at not to exceed current market prices, the products or services of [UNICOR], to the extent required by law.\" Exec. Order No. 6917 ¶ 9.\n\nB. UNICOR's Organic Statute\n\n1. 18 U.S.C. §§ 4121-4129\n\nCongress incorporated the provisions of the 1930 Act, the 1934 legislation and the Executive Order as part of the enactment of Title 18 of the United States Code.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e See Act of June 25, 1948, Pub. L. No. 80-722, 62 Stat. 683, 851. With limited exception, the current version of UNICOR's organic statute maintains its historical underpinnings.\n\nTitle 18 of the United States Code, section 4121, establishes UNICOR as a \"government corporation of the District of Columbia . . . administered by a Board of six directors, appointed by the President to serve at the will of the President without compensation.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e 18 U.S.C. § 4121 (2003). Section 4122 (a)\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e vests UNICOR with broad discretion to manage inmate operations, providing, in pertinent part:\n\n[UNICOR] shall determine in what manner and to what extent industrial operations shall be carried on in Federal penal and correctional institutions for the production of commodities for consumption in such institutions or for sale to the departments or agencies of the United States, but not for sale to the public in competition with private enterprise.\n\n18 U.S.C. § 4122 (a).\n\nSection 4122(b)(1) delineates the duties of the board. Similar to the 1934 legislation, this subsection provides:\n\nIts board of directors shall provide employment for the greatest number of those inmates in the United States penal and correctional institutions who are eligible to work as is reasonably possible, diversify, so far as practicable, prison industrial operations and so operate the prison shops that no single private industry shall be forced to bear an undue burden of competition from the products of the prison workshops, and to reduce to a minimum competition with private industry or free labor.\n\n18 U.S.C. § 4122 (b)(1).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nSection 4123 of the organic statute mirrors the 1930 Act in that only those \"forms of employment shall be provided as will give inmates . . . a maximum opportunity to acquire a knowledge and skill in trades and occupations which will provide them with a means of earning a livelihood upon release.\" 18 U.S.C. § 4123. The section further limits UNICOR's operations so as to \"not curtail the production of any existing arsenal naval yard or other Government workshop.\" 18 U.S.C. § 4123.\n\nSection 4124 (a)\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e enshrines the mandatory obligation of federal agencies and departments to purchase, \"at not to exceed current market prices, such products [manufactured by UNICOR] as meet their requirements and may be available.\" 18 U.S.C. § 4124 (a). Subsection (b) creates a dispute resolution process whereby any \"[d]isputes as to the price quality, character, or suitability of [UNICOR] products shall be arbitrated by a board consisting of the Attorney General, the Administrator of General Services, and the President, or their representatives.\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e 18 U.S.C. § 4124 (b). The decisions of the dispute resolution board are \"final and binding on all parties.\" Id.\n\nThe current version of Section 4125, as in the 1930 Act, empowers the Attorney General\n\nto make available to the heads of the several departments, the services of United States prisoners under terms, conditions, and rates mutually agreed upon, for construction or repairing roads, clearing, maintaining, and reforesting public lands; building levees, and constructing or repairing any public ways or works financed wholly or in major part by funds appropriated by Congress.\n\n18 U.S.C. § 4125 (a).\n\nThe remaining provisions of the organic statute address UNICOR's financial and reporting requirements. Section 4126 requires UNICOR to place \"monies\" generated by its operations into the Treasury of the United States, see 18 U.S.C. § 4126 (a), and establishes accounting procedures relating to UNICOR's operations, see 18 U.S.C. § 4126 (b)-(f). Section 4127 requires the board to submit an annual report to Congress detailing UNICOR's operations.\n\n2. The 1988 Amendments and the Comprehensive Advanced Review Process (\"CARP\")\n\nGuided by its organic statute, UNICOR operated for decades below the legislative radar. The 1980's witnessed, however, a dramatic rise in the number of inmates confined to federal institutions.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e UNICOR therefore expanded its operations in order to provide employment \"for the greatest number of those inmates . . . who [were] eligible to work as [] reasonably possible.\" 18 U.S.C. § 4122(b)(1). Echoing the cries of a century earlier, this increased utilization of inmate labor drew calls from private industries seeking to curtail UNICOR's operations.\n\nCongress responded in 1988 by passing a series of amendments to UNICOR's organic statute. See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, §§ 7093- 7096, 102 Stat. 4181, 4411-14. Pertinent to the instant appeal, the amendments to section 4122 mandated that UNICOR \"conduct its operations so as to produce products on an economic basis, but avoid capturing more than a reasonable share of the market among Federal departments, agencies, and institutions for any specific product.\" See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4413 (codified at 18 U.S.C. § 4122(b)(2)). Additionally, the amended section 4122 directed UNICOR to \"concentrate on providing to the Federal Government only those products which permit employment of the greatest number of those inmates who are eligible to work as is reasonably possible.\" Id. Furthermore, Congress instructed UNICOR to \"diversify its products so that its sales are distributed among its industries as broadly as possible.\" See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4413 (codified at 18 U.S.C. § 4122(b)(3)).\n\nThe most sweeping provisions of the 1988 legislation were those limiting UNICOR's discretion to increase production levels. Congress required that \"[a]ny decision by [UNICOR] to produce a new product or to significantly expand the production of an existing product be made by the board.\" See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4413 (codified at 18 U.S.C. § 4122(b)(4)). Congress further required UNICOR and the board to initiate a notice and comment procedure prior to entering a new product area or significantly expanding UNICOR's existing operations. See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4414 (codified at 18 U.S.C. §4122(b)(4)-(5)).\n\nCongress's newly minted notice and comment procedure -- the comprehensive advanced review process (\"CARP\")--required the board to receive and consider a written analysis prepared by UNICOR detailing any proposed \"significant expansion's\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e potential impact on the private sector (the \"Comprehensive Impact Study\" or \"market study\")\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e . See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4414 (codified at 18 U.S.C. § 4122(b)(4)(A)). The CARP further required UNICOR to publicize the proposal within the affected sector, provide the Comprehensive Impact Study to the public, and solicit comments from the affected sector. See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4414 (codified at 18 U.S.C. § 4122(b)(4)(B)-(D)). Congress also afforded interested industry representatives with \"a reasonable opportunity\" to present comments directly to the board. See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4414 (codified at 18 U.S.C. § 4122(b)(4)(D)). The last stage of the CARP directed UNICOR to publicize the board's final decision \"in a publication designed to most effectively provide notice to potentially affected private vendors\" of the affected product. See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4414 (codified at 18 U.S.C. § 4122(b)(5)).\n\n3. The Guidelines\n\nNotwithstanding Congress's detailed attention to the CARP, the 1988 amendments did not define the term \"significantly expand.\" Therefore, on December 4, 1989, UNICOR published an interim definition of the term in Commerce Business Daily (\"CBD\"). See (J.A., 179-81, 434-36, 667-669, 1097 ¶ 4, 1484 ¶ 36). Representatives from private industry -- including CGP -- provided comments regarding the interim definition. See (J.A., 1008-1024, 1813-15).\n\nOn January 2, 1991, UNICOR published its final definition of \"significant expansion.\" See (J.A., 182-84, 437-38, 670-71, 1097 ¶ 5, 1639 ¶ 36). The final definition established a two-tiered approach (the \"Guidelines\") for identifying whether a planned increase in production required the initiation of the CARP. The first tier directed UNICOR to monitor \"proposed production increases . . . as part of [its] annual planning cycle,\" under the two scenarios where a significant expansion could arise:\n\n1. The specific product will be produced at a new factory and not offset by a corresponding reduction in production at another location; or\n\n2. The specific product will be produced at an existing factory or factories, and will be accompanied by at least a 10% increase in capacity resulting from expanding any of the following three inputs of production: a) Plant size; b) Equipment capacity; c) Inmate employment.\n\n(J.A., 11-12, 182-84, 437-38, 670-71, 1097 ¶ 6, 1484-85 ¶ 6.)\n\nWhere either of the above scenarios occurred, the second tier of the Guidelines required UNICOR to examine the federal government market for the specific product and develop an estimate of FPI's current and projected market share. See (J.A.,182-84, 437-38, 670-71, 1098 ¶ 7, 1485 ¶ 7). The Guidelines required UNICOR to pursue the CARP when its current market share position exceeded its \"allowable market share\" in accordance with the following sliding scale:\n\nUNICOR's Current Mrkt. ShareAllowable Mrkt. Share Increase\n\n0% - Less than 5 %Any increase, provided it does not cause FPI's market share to exceed 5%\n\n5% - Less than 10 %3%, provided it does not cause FPI's market share to exceed 10%\n\n10% - Less than 15%2% provided it does not cause FPI's market share to exceed 15%\n\n15% - Less than 20%1.5% provided it does not cause FPI's market share to exceed 20%\n\n20% - Less than 25%1% provided it does not cause FPI's market share to exceed 25%\n\nOver 25%Any increase in market share would be deemed \"significant\"\n\n(J.A., 182-84, 437-38, 670-71, 1098 ¶ 8, 1485 ¶ 8.)\n\nC. The Board's Significant Expansion Decisions\n\nFollowing the promulgation of the Guidelines, UNICOR pursued a policy of maintaining a relatively low market share in new product areas, rather than significantly expanding its existing operations. See (J.A., 351-52). Federal inmate populations continued, however, to increase throughout the early 1990's.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e This increase compelled UNICOR to shift its policy and request that the appellee-defendant, Board, authorize several significant expansions. See (J.A., 351-52).\n\n1. UNICOR's Significant Expansion of Dorm \u0026 Quarters Furniture Production\n\nUNICOR first proposed to significantly expand its production of dorm and quarters furniture (\"D \u0026 Q furniture\") from approximately $20 million in annual sales in 1995 to $35 million in annual sales by the year 2000 (hereinafter the \"D \u0026 Q furniture expansion\"). See Quarters Furniture Mfrs. Ass'n v. Federal Prison Indus., No. 95-2237 (D. D.C. Mem. Opinion filed Aug. 28, 1998) (hereinafter \"QFMA\") at 6. Shortly after presenting the proposal to the Board, UNICOR discovered several irregularities regarding its past compliance with the Guidelines. Id. The Board responded by ordering an internal investigation to determine the extent of these irregularities. Id.\n\nOn January 26, 1996, UNICOR issued a \"White Paper\" detailing its historical production of D \u0026 Q furniture. See (J.A., 1330-1341). The White Paper identified three occasions throughout 1991-1993 where UNICOR was obliged, but failed, to initiate the CARP.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e UNICOR explained that its failure to comply with the Guidelines was the result of the inherent difficulties in monitoring inmate employment levels, plant size, and equipment capacity, as well as interpretative difficulties with the definition of significant expansion. See (J.A., 1339-41). The White Paper offered two recommendations. First, it advised that, \"The definition of Significant Expansions needs to be reviewed, with input from the private sector, to make sure it is fair, clear and practical in its application.\" (J.A., 1341.) Secondly, \"[W]hatever factors are chosen as indicators of significant expansion, mechanisms must be put in place so that necessary data . . . is adequately collected.\" (J.A., 1341.) With respect to the second recommendation, the White Paper noted, \"Over the past year, formal direction has been given and a number of steps have been taken, to correct this deficiency.\" (J.A., 1341.)\n\nOn March 8, 1996, the Board partially authorized UNICOR's proposed significant expansion of D \u0026 Q furniture. See QFMA, at 6. In its decision, the Board acknowledged the violations chronicled in the White Paper. Id. The Board determined, however, that it would have approved these expansions had UNICOR presented the proposals in a timely manner. See QFMA, at 7. It further determined that UNICOR's then-current market share, the limited non-federal market for D \u0026 Q furniture, and the industry's domination by small businesses, required a lesser expansion than that sought by UNICOR. See QFMA, at 8-9. Accordingly, the Board approved a significant expansion to $26 million in annual sales by the year 2000, rather than the $35 million requested by UNICOR. See QFMA, at 8-9.\n\n2. UNICOR's Significant Expansion of Systems Furniture Production\n\nUNICOR meanwhile proposed to significantly expand its production of Office Furniture.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Specifically, UNICOR proposed to expand its existing systems furniture production from $70.5 million in annual sales in 1995 to $150 million in annual sales by the year 2000 (hereinafter the \"Systems Furniture Expansion\"). See (J.A., 203, 1102 ¶ 50). UNICOR's initial estimates indicated that the Systems Furniture Expansion would increase inmate employment by approximately eighty-six percent.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e See (J.A., 225). UNICOR further estimated that the proposed expansion would require the activation of a new systems furniture factory.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e See (J.A., 225). The market share analysis indicated that the Systems Furniture Expansion would increase UNICOR's federal market share from approximately fifteen percent in 1995 to approximately twenty-four percent in 2000. See (J.A., 203). As the Systems Furniture Expansion triggered each tier of the Guidelines, the Board initiated the CARP.\n\nUNICOR accordingly prepared a Comprehensive Impact Study regarding the potential impact of the Systems Furniture Expansion on the private sector (the \"Systems Impact Study\"). See (J.A., 200-49). It placed notice of the Systems Furniture Expansion in the CBD, see (J.A., 198-99, 1101¶¶ 37-39), and mailed notice to various vendors and trade associations, including Herman Miller, see (J.A., 185-95, 1101 ¶ 38).\n\nUNICOR thereafter provided the Systems Impact Study to requesting entities and received various comments. See (J.A., 249-69, 337-40, 1101 ¶¶ 41-42). CGP requested that the Board hold a public hearing on the proposed significant expansion.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e See (J.A., 251-69, 336-37).\n\nThe Board held a public hearing on December 7, 1995 where representatives from several trade associations -- CGP, the Business Products Industry Association (\"BPIA\"),\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and the Business and Institutional Furniture Manufacturer's Association (\"BIFMA\")\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e -- presented a coordinated opposition to the proposed significant expansion. See (J.A., 346-419).\n\nOn February 6, 1996, the Board authorized the Systems Furniture Expansion. See (J.A., 420-22). The Board determined:\n\nFPI has proposed that the corporation increase production of systems and ADP furniture to $150 million annually by FY 2000. After analyzing the material submitted, and reviewing the testimony heard on this matter, it is the finding of the Board of Directors that a somewhat reduced expansion is appropriate and would not result in FPI capturing more than a reasonable share of the market or constitute an undue burden on the systems and ADP furniture industry.\n\n(J.A.,420). With regard to its further judgment that \"the sales levels authorized . . . [would] not place an undue burden upon the systems and ADP furniture industry nor free labor,\" (J.A., 421), the Board emphasized four factors:\n\n(1) The majority of the firms in the industry were \"not heavily involved in the Federal market for systems and ADP furniture\" (J.A., 421.) Indeed, \"[f]or most of the companies listed on the GSA schedules for systems and ADP furniture, less than 4% of their total sales [went] to the Federal government.\" (J.A., 421.)\n\n(2) The total domestic market for systems furniture was large and projected to grow throughout the expansion thereby offsetting UNICOR's increased sales. See (J.A., 421).\n\n(3) The industry was dominated by a small number of large firms. See (J.A., 421-22).\n\n(4) UNICOR's alternative methods to address increased inmate populations (i.e., subcontracting, vertical integration, recycling, and sales to charitable organizations) failed to achieve UNICOR's statutory mandate to employ the maximum number of inmates. See (J.A., 422).\n\nThe Board authorized annual sales in the amount of $130 million by the year 2000, rather than the $150 million requested by UNICOR. See (J.A.,420-21). It \"encouraged FPI to pursue partnerships with members of the systems and ADP furniture industry in the effort to lessen FPI's impact on the private sector.\" (J.A., 422). The Board explained: \"Since [we have] determined that an FPI sales level less than requested is appropriate, [we] do[] so with the expectation that resulting partnerships should be substantial, in order to absorb significant FPI employment.\" (J.A., 422.)\n\n3. UNICOR's Significant Expansion of Office Seating Furniture Production and the Board's Retroactive Authorization of the 1991-1992 Unauthorized Expansions\n\nUNICOR further proposed to expand office seating furniture production from $54.4 million in annual sales in 1995 to $110 million in annual sales by 2001 (the \"Office Seating Expansion\"). See (J.A., 470). UNICOR's initial estimates indicated that the Office Seating Expansion would increase inmate employment between eighty-five to one hundred percent.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e See (J.A., 496). UNICOR further estimated that the proposed expansion would require the activation of three new office seating furniture factories.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e See (J.A., 496). Pursuant to the Guidelines, UNICOR conducted a market share analysis indicating that the Office Seating Expansion would increase UNICOR's federal market share from approximately twenty-one percent in 1995 to approximately thirty-four percent in 2001. See (J.A., 496). Consequently, the Board initiated the CARP.\n\nUNICOR prepared a Comprehensive Impact Study regarding the potential impact of the Office Seating Expansion on the private sector (the \"Office Seating Impact Study\"). See (J.A., 467-526). While preparing the Office Seating Impact Study, UNICOR again discovered that it failed to comply with the Guidelines, this time in 1991 and 1992. See (J.A., 470, 475-76, 1497 ¶¶ 106-08). Specifically, inmate employment levels increased more than ten percent in each year, but UNICOR did not conduct a market share analysis. UNICOR explained its failure in regard to the 1991 increase:\n\n[A]t the time, FPI focused most of its guidelines [sic] vigilance and analysis on the opening of new factories, and did not maintain an accurate tracking of inmates employed producing office seating. Furthermore, it was the belief of FPI staff that the corporation's share of the Federal market for office furniture was decreasing, due to a sharp increase in Federal procurements. Thus, the public involvement guideline process [the CARP] would not be required since there was no growth in FPI's market share.\n\n(J.A., 476.) In support of this explanation, UNICOR attached to the Office Seating Impact Study a chart from 1990 indicating its expected decline in market share during 1991.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e See (J.A., 514).\n\nWith respect to the 1992 increase in inmate employment, UNICOR conceded that the increase, coupled with its expected market share of 10.89%, required the initiation of the CARP. See (J.A., 476). UNICOR repeated the explanation that it failed to \"track the level of inmate employees for each product.\" (J.A., 476.) It reasoned, however, that \"It [was] likely that had an examination of FPI's [office] seating production taken place, FPI would have initiated the guidelines process at this time.\" (J.A., 476.) Therefore, \"[i]n light of the fact that FPI failed to initiate the industry involvement guidelines process in response to its expansion of production in FY 1992,\" (J.A., 477), UNICOR requested the Board to \"[R]atify the Corporation's expansion of office seating during that time, taking into consideration the relevant data for that point in time,\" (J.A., 477).\n\nUNICOR then pursued all of the relevant procedures under the CARP for the purposes of obtaining: (1) the Board's ratification of the 1991 and 1992 expansions; and (2) the Board's authorization of the proposed Office Seating Expansion. See (J.A., 439-567, 1107 ¶¶ 91-92). CGP and Knoll received versions of the Office Seating Impact Study, see (J.A., 527-28, 531); however, they declined to respond with any comments. BIFMA, a member of the CGP's board of directors, provided extensive written comments, as well as requested a hearing. See (J.A., 553-54, 561-63, 1108 ¶¶ 98-99); (App. to Br. of Defs.-Appellees).\n\nIn July, 1996, the Board held a public hearing regarding the Office Seating Expansion. See (J.A., 572-646). Representatives from, inter alia, BIFMA, Herman Miller, Haworth, and Knoll attended the hearing and jointly presented statements in opposition to the proposed significant expansion. See (J.A., 572-646, 1108 ¶¶ 101-103).\n\nIn September, 1996, the Board issued its decision: (1)retroactively ratifying the 1991-1992 unauthorized expansions; and (2) authorizing the proposed Office Seating Expansion. See (J.A., 654-59). With respect to the unauthorized expansions, the Board reasoned:\n\nIn connection with another earlier instance of unauthorized expansion, the Board has undertaken a review of expansion in all FPI product lines since implementation of the guidelines, being conducted by independent auditors.\n\nThe question, now, however, is how to deal with this situation in the context of office seating. Any analysis and decision must begin with FPI's statute, which provides that FPI should have no unreasonable share of the market, and should not unduly impact on any single private industry. Any remedial action will be predicated on what extent, if any, the statute has been violated in these two very important aspects.\n\n(J.A., 655.) The Board accordingly examined UNICOR's federal market share from1990-1994, as well as the private sector sales of office seating. The Board concluded, \"[B]ased on market performance since 1991 the industry has not been adversely affected, and that UNICOR's market share is reasonable. The Board therefore approves FPI's request to ratify its sales levels achieved, subsequent to and as a result of is expanded capacity during 1991 and 1992.\" (J.A. 656.)\n\nTurning to the proposed Office Seating Expansion, the Board authorized the proposal, resting its decision on four bases: (1) the federal office seating market was slightly over $1 billion, rather than the smaller figure advanced by BIFMA; (2) the federal market was projected to expand during the pertinent period, thereby minimizing UNICOR's increased market share; (3) the domestic office seating market was expected to expand, thereby increasing sales for the private sector manufacturers; and (4) UNICOR's proposed expansion would not affect private-sector employment as the impact of UNICOR's expansion would be dispersed throughout numerous manufacturers in the industry. See (J.A., 657-58).\n\n4. UNICOR's Significant Expansion of Office Case Goods Production\n\nUNICOR also proposed to significantly expand its production of office case goods from $30.3 million in annual sales in 1995 to $80 million in annual sales by 2001 (the \"Office Case Goods Expansion\"). See (J.A., 681). Similar to the prior proposed expansions of systems furniture and office seating, UNICOR projected that the Office Goods Expansion would result in an approximately fifty percent increase in inmate employment and require the activation of three new factories.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e See (J.A., 703). UNICOR further projected that its market share would increase from approximately thirteen percent in 1995 to approximately thirty percent in 2001. See (J.A., 703). Therefore, the Board initiated the CARP.\n\nUNICOR prepared a Comprehensive Impact Study regarding the potential impact of the Office Case Goods Expansion on the private sector (the \"Office Case Goods Impact Study\"). See (J.A., 678-722). UNICOR proceeded with the CARP, and the Coalition submitted comments on the proposed expansion. See (J.A., 723-94, 1111 ¶¶ 139-40).\n\nThe Board held a hearing on October 8, 1996 whereby BIFMA and others presented statements in opposition to the Office Case Goods Expansion. See (J. A. 796-890, 1111 ¶142).\n\nOn December 17, 1996, the Board issued its decision authorizing the Office Case Goods Expansion. See (J.A., 891-896). The Board rested its decision on the projected growth of the federal market, as well as the projected growth in the domestic market for sales of office case goods. The Board acknowledged, however, the large discrepancy between UNICOR's estimate regarding the size of the federal market and the private-sector's significantly lower estimate.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e See (J.A., 893). In an effort to account for the discrepancy, the Board authorized less than UNICOR's full expansion request -- authorizing a growth to $70 million by 2001. See (J.A., 892-93). Additionally, the Board directed UNICOR to convene an independent panel of experts to review its methodology for calculating the federal market, and agreed to consider any request to modify the expansion decision in the event the panel uncovered errors in UNICOR's methodology. See (J.A., 893-96).\n\nD. Quarters Furniture Mfrs. Ass'n v. Federal Prison Indus.\n\nShortly following the Board's 1996 significant expansions decisions, the Quarters Furniture Manufacturers' Association (\"QFMA\") -- an industry association comprised of private manufacturers of D \u0026 Q furniture -- filed a complaint in the United States District Court for the District of Columbia challenging the D \u0026 Q furniture significant expansion. See QFMA, at 1-27. Principally relying on the White Paper, QFMA alleged that UNICOR and the Board violated the APA by failing to initiate the CARP from 1992-1995. See QFMA, at 2. QFMA alternatively alleged that in the event the Guidelines allowed for such unauthorized expansions, the Guidelines themselves violated section 4122 and the APA. Id. QFMA's complaint requested declaratory relief, as well as an injunction \"prohibiting the defendants from continuing to violate the statute, and directing [UNICOR] to return to appropriate levels of production.\" Id.\n\nUNICOR conceded that it violated the Guidelines during 1992-1995, but asserted that \"[T]he Board's March 1996 decision [authorizing the significant expansion of D \u0026 Q Furniture] superceded and effectively moot[ed] plaintiff's case.\" See QFMA, at 10.\n\nThe court partially concurred in UNICOR's contention, opining that the failure on the part of QFMA to challenge UNICOR's current production levels precluded equitable relief in the form of a \"roll-back\" of current production. See QFMA, at 12-13. The court reasoned, however, that \"[W]here the agency wholly fails to comply with its regulations, and provides no record for its decision, the court should conclude that the agency acted unlawfully, and should vacate the decision with a remand to the agency.\" QFMA, at 16 (citations omitted). The court then acknowledged that \"[I]t could order the Board to adjust the future levels of FPI's production to return to the market that portion of the share that the Board decides crossed the line from reasonable to unreasonable.\" QFMA, at 12 (citation omitted). Accordingly, the court remanded the matter to the Board \"with directions that the Board must illicit [sic] comments with respect to the increases in FY 1991 to 1995 . . . make specific findings as to whether FPI obtained more than a reasonable share of the market . . . and ascertain what percent of the share was unreasonable.\" See QFMA, at 25.\n\nE. The Underlying Action\n\nMore than a year later, the Coalition filed the underlying action challenging UNICOR's significant expansions in Office Furniture production. See Coalition for Gov't Procurement v. Federal Prison Indus., 154 F. Supp. 2d 1140 (W.D. Mich 2001). The complaint specifically alleged seven classes of claims. The first class of claims (Counts I-III) alleged that UNICOR engaged in unauthorized significant expansions of systems furniture, office seating, and office case goods throughout 1991-1995 (hereinafter the \"unauthorized significant expansions\") in violation of section 4122 and the APA. The second class (Count IV) alleged that the Board's retroactive authorization of the 1991 and 1992 unauthorized expansions in office seating (hereinafter the \"retroactive authorization\") violated the APA and the organic statute. The third class (Count V) sought relief arising from the Board's purported violations of the organic statute and the APA in authorizing UNICOR's 1995-1996 requests to significantly expand its production of systems furniture, office seating, and office case goods (hereinafter the \"1996 significant expansion decisions\"). The fourth class (Count VI) presented a facial challenge to the Guidelines, whereas the fifth class (Count VII) alleged that UNICOR's unauthorized significant expansions in 1991-1995 constituted a compensable taking in violation of the Fifth Amendment. The final class of claims challenged two of UNICOR's practices with respect to the private sector. The first alleged that UNICOR's practice of promoting \"pass through\" furniture\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e violated the APA and organic statute (Count VIII). The second claim alleged that UNICOR's practice of selling Office Furniture directly to private subcontractors employed on federal projects violated the express prohibition of section 4121, as well as the APA (Count IX).\n\nFollowing lengthy discovery, the parties filed cross-motions for summary judgment. By order dated August 8, 2001, the district granted the defendants' motion in its entirety, while denying the Coalition's motion. See 154 F. Supp. 2d at 1156.\n\nThe instant appeal ensued.\n\nIII. STANDARD OF REVIEW\n\nThis Court reviews the grant of summary judgment de novo. See Brooks v. American Broadcasting Cos., 932 F.2d 495, 500 (6th Cir. 1991). Summary judgment is proper \"if the pleadings, depositions, answers to interrogatories, and admissions on file, together with the affidavits, if any, show that there is no genuine issue as to any material fact and that the moving party is entitled to a judgment as a matter of law.\" Fed. R. Civ. P. 56 (c). When confronted with a properly supported motion for summary judgment, the nonmoving party must set forth specific facts showing that there is a genuine issue for trial. A genuine issue for trial exists \"if the evidence is such that a reasonable jury could return a verdict for the nonmoving party.\" Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 248 (1986).\n\nThe Coalition advances its claims (with the exception of the takings claim) pursuant to UNICOR's organic statute and the APA. It is well-settled that UNICOR's organic statute does not authorize a private right of action. See Galvan v. Fed. Prison Indus., 199 F.3d 461, 465 (D.C. Cir. 1999) (\"Congress purposefully kept FPI out of the commercial world and limited its exposure to the courts.\"). However, the APA provides for judicial review of agency action.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e See 5 U.S.C. §§ 701-706.\n\nWhen reviewing an administrative agency's final decision under the APA, we review the district court's summary judgment decision de novo, while reviewing the agency's decision under the arbitrary and capricious standard. See Sierra Club v. Slater, 120 F.3d 623, 632 (6th Cir. 1997) (citation omitted). Thus, the agency's decision will be set aside \"only if it is arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with the law.\" Slater, 120 F.3d at 632 (citations omitted). Alternatively, when the issue is whether the agency followed the requisite legal procedure, our review is limited, but exacting. See Natural Res. Def. Council, Inc. v. Sec. \u0026 Exch. Comm'n, 606 F.2d 1031, 1045, 1048-49 (D.C. Cir. 1979). While de novo, we tailor our review to determine whether \"statutorily prescribed procedures have been followed.\" Id. at 1045.\n\nIV. THE CLAIMS CHALLENGING THE UNAUTHORIZED SIGNIFICANT EXPANSIONS, THE 1996 SIGNIFICANT EXPANSION DECISIONS, AND THE BOARD'S RETROACTIVE AUTHORIZATION\n\nThe Coalition's first three classes of claims -- those challenging the unauthorized significant expansions, the 1996 significant expansion decisions, and the Board's retroactive authorization (hereinafter collectively, the significant expansion claims) -- share common issues of fact and law.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Accordingly, we initially address these claims in their entirety.\n\nA. Jurisdictional and Procedural Challenges\n\n1. Mootness\n\nThe defendants, through amicus curiae, Correctional Vendors Association (\"CVA\"),\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e assert that the significant expansion claims are moot. We review questions of mootness de novo. See Craft v. United States, 233 F.3d 358, 373 (6th Cir. 2000). The heavy burden of demonstrating mootness rests on the party claiming mootness. See Friends of the Earth, Inc. v. Laidlaw Envtl. Servs. (TOC), Inc., 528 U.S. 167, 189 (2000).\n\nArticle III of the United States Constitution vests this court with jurisdiction to address actual cases and controversies. See U.S. Const. art. III, § 2. Under the \"case or controversy\" requirement, we lack authority to issue a decision that does not affect the rights of the litigants. See Southwest Williamson County Cmty. Assoc. v. Slater, 243 F.3d 270, 276 (6th Cir. 2001). Indeed, we have a \"continuing obligation\" to enquire whether there is a present controversy as to which effective relief can be granted. Id. at 276 (citing McPherson v. Mich. High Sch. Athletic Ass'n, Inc., 119 F.3d 453, 458 (6th Cir.1997)).\n\n\"‘The test for mootness is whether the relief sought would, if granted, make a difference to the legal interests of the parties.'\" Bowman v. Corr. Corp. of Am, 350 F.3d 537, 550 (6th Cir. 2003) (quoting McPherson, 119 F.3d at 458). An appeal becomes moot if events have taken place during the pendency of the appeal that make it \"impossible for the court to grant any effectual relief whatever . . . .\" Church of Scientology of California v. United States, 506 U.S. 9, 12 (1992) (quotation omitted).\n\nAmicus asserts that the significant expansion claims are moot because UNICOR has completed the challenged activity -- that is, all of the alleged unlawful increases in production have occurred and the sales have been consummated. However, completion of activity is not the hallmark of mootness. Rather, a case is moot only where no effective relief for the alleged violation can be given. See McPherson, 119 F.3d at 458.\n\nThe mootness question therefore turns on whether this court can award the Coalition \"any effectual relief.\" Church of Scientology, 506 U.S. at 12. Our analysis begins with an examination of the relief requested.\n\nAmicus construes the relief sought by the Coalition as follows: (1) a declaration that the defendants violated section 4122 and the APA by repeatedly failing to initiate CARP during 1991-1995; (2) a declaration that the Board's 1996 significant expansion decisions violated the organic statute and the APA; (3) an order rescinding the 1996 significant expansion decisions; and (4) a declaration that the Board's retroactive authorization violated the organic statute and the APA. See (Br. of Amicus Curiae Correctional Vendors Ass'n Supporting Appellee and Dismissal at 5-6).\n\nThe Coalition's multiple requests for declaratory relief warrant caution. We previously have recognized that declaratory judgment actions often require courts to face the difficult task of distinguishing \"between actual controversies and attempts to obtain advisory opinions on the basis of hypothetical controversies.\" Kardules v. City of Columbus, 95 F.3d 1335, 1343-44 (6th Cir. 1996) (citation omitted); see also Brennan v. Rhodes, 423 F.2d 706, 706-07 (6th Cir. 1970) (stating that the Declaratory Judgment Act, 28 U.S.C. §§2201-2202,\"does not broaden the jurisdiction granted to the federal courts by the Constitution and statutes enacted pursuant thereto,\" and that, consequently, \"there still must be a case or controversy before a federal court can assume jurisdiction and reach the merits of a [declaratory judgment action]\"). Thus, the Supreme Court has held that when considering the potential mootness of a claim for declaratory relief, \"the question is ‘whether the facts alleged, under all the circumstances, show that there is a substantial controversy, between parties having adverse legal interests, of sufficient immediacy and reality to warrant the issuance of a declaratory judgment.'\" Super Tire Eng'g Co. v. McCorkle, 416 U.S. 115, 122 (1974) (quoting Maryland Cas. Co. v. Pacific Coal \u0026 Oil Co., 312 U.S. 270, 275 (1941)).\n\nThe potential mootness of the claims challenging the unauthorized significant expansions\n\nAt first blush, the Coalition's request for an order declaring that UNICOR engaged in unauthorized significant expansions during 1991-1995 appears to lack the \"sufficient immediacy and reality\" necessary to escape the mootness doctrine. Standing alone, an order from this court declaring that UNICOR violated the organic statute and, or, the APA nearly a decade ago, would have little, if any, impact on the current legal interests of the parties. See City of Los Angeles v. Lyons, 461 U.S. 95 (1983); cf. Reeve Aleutian Airways, Inc. v. United States, 889 F.2d 1139, 1142 (D.C. Cir. 1989) (\"Past exposure to illegal conduct fails to establish a present controversy . . . without a showing of present adverse effects.\").\n\nA more searching review of the record reveals, however, that the Coalition has forged the requisite link between UNICOR's past practices and the current interests of the parties. Specifically, the Coalition contends that the Board predicated the 1996 significant expansion decisions on data reflecting UNICOR's purportedly unlawful production from 1991-1995. See (Br. of Pls.-Appellants at 53) (\"The 1996 decisions . . . were arbitrary and capricious for three reasons. First, the Board failed to consider the fundamental question of whether FPI's previously expanded Office Furniture production complied with its Guidelines and was appropriate.\"); (Br. of Amicus Curiae Correctional Vendors Ass'n Supporting Appellee and Dismissal at 5) (\"Plaintiffs posit that the earlier purported unauthorized significant expansions taint these subsequent expansions.\"); see also 154 F. Supp. 2d at 1151 (\"Plaintiffs also argue that the Board's decision on future increases failed to consider whether the then current production levels during 1996 were even legal.\"). As it is undisputed that the Board has authorized UNICOR's current production levels through the 1996 significant expansion decisions, see (J.A., 1198-1202), and the 1996 decisions, in turn, rest on UNICOR's allegedly unlawful production throughout 1991-1995, claims challenging the unauthorized significant expansions potentially impact UNICOR's current production levels. The Coalition transforms potential into an immediate reality by requesting this court to issue an order (1)\"directing FPI to roll back production to the levels authorized before the violations occurred\"; (2) \"giv[ing] back those sales FPI unlawfully took\"; or (3) \"capping FPI's production at current levels and requiring FPI's Board to fully account for the agency's past violations before undertaking future expansion proceedings.\" (Reply Br. of Pls.-Appellants at 27.)\n\nThe proposed relief sought demonstrates that the Coalition seeks more than a declaration that UNICOR unlawfully and significantly expanded from 1991-1995. The Coalition has argued throughout the litigation that the unauthorized significant expansions resulted in its loss of $450 million in sales. See, e.g., (J.A., 28, 1410-11). As a remedy for this purported loss, the Coalition persistently has sought an order restoring the lost sales to the current market -- a result the Coalition terms an \"equitable volume sales replacement remedy,\" see (J.A., 1471).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e While amicus interprets this requested relief as relating exclusively to the takings claim discussed infra, the Coalition conclusively has demonstrated that its \"equitable volume sales replacement remedy\" pertains to the unauthorized significant expansion claims.\n\nHaving discerned the thrust of the relief requested, we must now consider whether this court has the authority to award such relief. It is well-established that federal courts possess broad discretion to fashion equitable remedies. See United States v. R.W. Meyer, Inc., 932 F.2d 568, 572-73 (6th Cir. 1991) (observing the \"principle of equity that the chancellor has broad discretion to frame a decree\"). It also is established that we may craft declaratory and injunctive relief designed to preclude a federal agency from acting in contravention of its statutory and regulatory authority. See Howard v. Pierce, 738 F.2d 722, 730 (6th Cir. 1984) (holding that the court may award declaratory and injunctive relief in order to ensure that the Department of Housing and Urban Development adopted regulations consistent with its enabling statute). Furthermore, the court may require an agency to modify its current or future practices in order to account for past violations of its statutes or regulations. See Charter Township of Huron, Michigan v. City of Dearborn, Michigan, 997 F.2d 1168,1175 (acknowledging the court's authority to issue an injunction requiring the agency to conduct an environmental assessment notwithstanding the implementation of the completed action); Northwest Envtl. Def. Ctr. v. Gordon, 849 F.2d 1241, 1245 (9th Cir. 1988) (determining that claims asserted against federal agencies alleging that the agencies unlawfully authorized the overfishing of coho salmon during the 1986 season were not moot because the court could award awarding injunctive relief in the form of \"higher escapement provisions and lower quotas in 1989\").\n\nWe conclude, therefore, that this court has the broad discretionary authority to award relief in a manner akin to the \"equitable volume sales replacement remedy\" proposed by the Coalition. We neither must determine at this stage of the proceedings whether the Coalition ultimately is entitled to such relief, nor must we define the specific parameters of the relief. As we repeatedly have stated, the determinative factor in the mootness inquiry is whether the court possesses the authority to afford the Coalition any effectual relief. Because the response to this query is in the affirmative, the Coalition's claims challenging the unauthorized significant expansions present actual cases or controversies.\n\nThe potential mootness of the claim challenging the 1996 significant expansion decisions\n\nThe Coalition's claim challenging the 1996 significant expansion decisions also presents a justiciable case or controversy. As discussed supra, the production levels approved by the Board in 1996 are manifested in UNICOR's current production levels. It follows a fortiori that in the event the Board authorized the 1996 significant expansions in contravention of the organic statute and the APA, any equitable remedy for these violations necessarily would impact UNICOR's current production levels.\n\nAmicus attempts to escape this result by emphasizing that the Coalition's complaint did not request the \"equitable volume sales replacement remedy\" in regard to the 1996 significant expansion decisions. See (Br. of Amicus Curiae Correctional Vendors Ass'n Supporting Appellee and Dismissal at 5). Indeed, the complaint requested: (1) a declaration that the 1996 significant expansion decisions violated the organic statute and the APA; and (2) an injunction rescinding those decisions. Amicus contends that because the sales authorized by the 1996 significant expansion have been completed, any proposed recission of such sales is beyond this court's authority. See (Br. of Amicus Curiae Correctional Vendors Ass'n Supporting Appellee and Dismissal at 17) (\"Rescinding already accomplished expansions and consummated sales is not feasible.\") (Citation omitted).\n\nWhile it is beyond cavil that the Coalition initially requested a recission of the 1996 significant expansion decisions, the manner of relief requested before the district court, while relevant, is not determinative in examining whether the claim is moot on appeal.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Rather, the dispositive issue is whether this court possesses the authority to award any effectual relief. Church of Scientology, 506 U.S. at 12. The foregoing analysis reveals that the court has the authority to order a \"roll-back\" or \"capping\" of UNICOR's production. We may draw on this remedy in the event the Board unlawfully authorized the 1996 significant expansions that, in turn, impacted UNICOR's current production levels. Accordingly, the Coalition's claim challenging the 1996 significant expansion presents a justiciable case or controversy.\n\nThe potential mootness of the claim challenging the retroactive authorization\n\nOur conclusions as to the justiciable nature of the unauthorized significant expansion and 1996 significant expansion claims apply with equal force to the claim challenging the Board's retroactive authorization. Simply, in the event we determine that the Board lacked the authority to retroactively authorize a significant expansion occurring in 1991-1992, the inescapable conclusion is that UNICOR engaged in unauthorized significant expansions during those years. The potential remedy for the Board's unlawful conduct would be the \"equitable sales volume replacement remedy\" suitable for all other unauthorized significant expansions during the 1991-1995 period. Therefore, the Coalition's claim challenging the retroactive authorization is not moot.\n\n2. Issue Exhaustion\n\nNotwithstanding the existence of justiciable cases or controversies, the defendants assert that the administrative waiver doctrine bars judicial review of the unauthorized significant expansion and the retroactive authorization claims. The administrative waiver doctrine, commonly referred to as issue exhaustion, provides that it is inappropriate for courts reviewing agency decisions to consider arguments not raised before the administrative agency involved. See United States v. L.A. Tucker Truck Lines, Inc., 344 U.S. 33, 37 (1952) (\"Simple fairness . . . requires as a general rule that courts should not topple over administrative decisions unless the administrative body not only has erred but has erred against objection made at the time appropriate under its practice.\"); see also Michigan Dep't of Envtl. Quality v. Browner, 230 F.3d 181, 183 n.1 (6th Cir. 2000) (concluding that issues not raised during the agency's notice and comment period were waived for purposes of appellate review); Cellnet Communications, Inc. v. FCC, 149 F.3d 429, 442 (6th Cir. 1998) (ruling that the plaintiff's claim for judicial review was barred because it had not followed the Environmental Protection Agency's administrative review procedures). Courts decline to consider issues not raised before an agency because to do otherwise would \"deprive the [agency] of an opportunity to consider the matter, make its ruling, and state the reasons for its action.\" Unemployment Comp. Comm'n v. Aragon, 329 U.S. 143, 155 (1946).\n\nThe district court determined that the Coalition waived the unauthorized significant expansion and the retroactive authorization claims because it did not raise these challenges during the hearings before the Board. The district court opined:\n\nProcedural objections like those Plaintiffs bring in this case are precisely the type of issues appropriately raised before the Board during its comment period, and thus subject to waiver if not raised.\n\nThe Board of FPI provided an opportunity for Plaintiffs and other interested parties to raise the issue of procedural violations during three separate meetings of the Board during 1996. Plaintiffs were not only aware of the proceedings, but were aware of the issues to be raised at the hearings, and fully participated in the hearings.\n\n154 F. Supp. 2d at 1147 (citations omitted).\n\nNotably, the district court did not rely on Sims v. Apfel, 530 U.S. 103 (2000), where the Supreme Court set forth the contours of the issue exhaustion doctrine. The Court specifically confronted a scenario where the Social Security Administration (\"SSA\") denied the petitioner's claims for benefits, and the petitioner sought review before the Social Security Appeals Council (\"Appeals Council\"). See Sims, 530 U.S. at 105. The Appeals Council denied review, and the petitioner filed suit in district court, which rejected all of the petitioner's claims. See Sims, 530 U.S. at 105-06. The United States Court of Appeals for the Fifth Circuit thereafter declined to address arguments that the petitioner had not raised in her request for review by the Appeals Council. See 200 F.3d 229, 230 (5th Cir. 1998). The Supreme Court reversed, holding that the inquisitorial nature of the Social Security proceedings precluded the application of an issue exhaustion requirement. See Sims, 530 U.S. at 112.\n\nIn reaching its decision, the Court identified three scenarios giving rise to issue exhaustion. First, the Court observed that issue exhaustion requirements are \"largely creatures of statute,\" and determined that a party's failure to comply with a statutorily-imposed issue exhaustion requirement precluded the assertion of federal jurisdiction. Sims, 530 U.S. at 107 (citing Woelke \u0026 Romero Framing, Inc. v. NLRB, 456 U.S. 645 (1982)). The Court alternatively observed that an agency's regulations may impose the issue exhaustion requirement. See Sims, 530 U.S. at 108. \"And when regulations do so, courts reviewing agency action regularly ensure against the bypassing of that requirement by refusing to consider unexhausted issues.\" Id.\n\nThe Court went on to recognize a third scenario -- a judicially-imposed issue exhaustion requirement -- which it analogized \"to the rule that appellate courts will not consider arguments not raised before trial courts.\" Sims, 530 U.S. at 108-09. The Court reasoned that the degree to which such an analogy applies depends on whether the particular administrative proceeding is similar to traditional litigation -- that is, whether the proceeding before the administrative agency is sufficiently \"adversarial,\" as opposed to \"inquisitorial.\" Sims, 530 U.S. at 109-110 (\"[T]he desirability of a court imposing a requirement of issue exhaustion depends on the degree to which the analogy to normal adversarial litigation applies in a particular administrative proceeding.\") (Citations omitted). Therefore, where no statutory or regulatory requirement exists, a judicially-imposed requirement of issue exhaustion is based on the extent to which the particular administrative proceeding is analogous to \"normal adversarial litigation.\" Sims, 530 U.S. at 109.\n\nIn considering whether the district court properly imposed an issue exhaustion requirement in the case sub judice, we initially observe that such a requirement exists in neither UNICOR's organic statute nor its regulations. Accordingly, this court must determine whether the significant expansion hearings before the Board were sufficiently adversarial as to warrant the imposition of an issue exhaustion requirement.\n\nWhile no court has addressed the precise issue at bar, we observe that the Sims plurality\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e found several factors relevant in determining that the Social Security proceedings possessed an inquisitorial character. The plurality gave great weight to the responsibility vested in the Administrative Law Judge (\"ALJ\") and the Appeals Council -- rather than the claimant -- for investigating the facts and developing arguments both for and against granting benefits. See Sims, 530 U.S. at 111 (citing Richardson v. Perales, 402 U.S. 389, 400-01(1971)). The plurality further emphasized that no representative went before the ALJ on behalf of the Social Security Commissioner to oppose the claim for benefits, and there was \"no indication that the Commissioner oppose[d] claimants before the Appeals Council.\" Id. The plurality also noted that the agency's regulations expressly directed the Appeals Council to conduct the review process \"in an informal and non-adversarial manner.\" Id. (citing 20 C.F.R. § 404.900(b)). Indeed, the parties were permitted, but were not required, to file briefs with the Appeals Council. See Sims, 530 U.S. at 113-14 (O'Connor, J., concurring) (citing 20 C.F.R. § 404.975). The form on which the claimant requested review of her case provided only three lines for the claimant to state the details of her request for review. See Sims, 530 U.S. at 112 (citing 20 C.F.R. § 422.205(a)). An accompanying notice stated that the form should only take ten minutes for the claimant to complete.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Id. Finally, the Appeals Council possessed the authority to review any new material evidence outside of the record promulgated by the parties, and its plenary power vested it with authority to review cases without the applicant's approval. See Sims, 530 U.S. at 111 (citing 20 C.F.R. § 404.976(a)). The co-existence of the foregoing factors -- the broad investigatory authority vested to the decision-maker, the unilateral nature of the proceedings, and the express informality of the administrative process -- led the plurality to conclude that \"[T]he general rule of issue exhaustion makes little sense in this particular context.\" See Sims, 530 U.S. at 112 (quotation and citation omitted).\n\nIn contrast, this court has identified, albeit in a different context, the relevant factors when considering whether a proceeding is sufficiently adversarial. In Detroit Free Press v. Ashcroft, 303 F.3d 681 (6th Cir. 2002), a panel of this court held that \"[a] deportation proceeding, although administrative, is an adversarial, adjudicative process.\" Detroit Free Press, 303 F.3d at 696. The panel emphasized that \"[c]onsistent with the adversarial nature of judicial proceedings, a deportation proceeding is commenced with a ‘Notice to Appear,' a charging document or complaint-like pleading which vests jurisdiction with the immigration court.\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Detroit Free Press, 303 F.3d at 698 (citations omitted). Additionally, an evidentiary standard governed the deportation proceedings (i.e., the government was required to prove its allegations by clear and convincing evidence), and the agency's decision was to be predicated on \"reasonable, substantial, and probative evidence.\" See Detroit Free Press, 303 F.3d at 698 (citations omitted). Furthermore, all interested parties had the right to appear and be heard during the deportation proceedings, and the presiding immigration judge maintained an impartial role. See Detroit Free Press, 303 F.3d at 698-99 (citations omitted).\n\nSimilarly, the United States Court of Appeals for the Fifth Circuit placed similar emphasis on procedural elements in determining that proceedings before the Health and Human Services Departmental Appeals Board (\"DAB\") were of a sufficient adversarial character to require exhaustion of issues. See Delta Found., Inc. v. United States, 303 F.3d 551, 561-62 (5th Cir. 2002). In reaching its conclusion, the Fifth Circuit found four factors relevant: (1) the aggrieved party and the agency's representative appeared before the DAB; (2) each party participated in developing an appeal file; (3) each party could make oral presentations, submit briefs, and cross-examine witnesses; and (4) each party was afforded leave to submit post-hearing briefs. See Delta Found., 303 F.3d at 561 (citations omitted). The court concluded, \"[U]nlike the SSA proceedings in which the Appeals Council itself, and not the claimant, ha[d] the responsibility for identifying the claims and developing arguments, the parties appear before the DAB as adversaries, charged with presenting their arguments and supporting witnesses and effectively discrediting opposing parties through cross-examination.\" See Delta Found., 303 F.3d at 561-62.\n\nWith these principles in mind, we find that the Board's significant expansion hearings do not give rise to an issue exhaustion requirement. As with the proceedings before the Appeals Council, the rules governing the significant expansion hearings vest full fact-finding authority with the Board. For example, the rules provide:\n\nThe record before the Board is limited to the market study, comments and materials submitted in response to the market study (including the trade association's comments), corporate management recommendations, and material submitted by commenters in response to corporate management's recommendations. No new documentation or arguments from commenters will be received or heard at the presentation that have not been submitted in compliance with these rules, unless permitted by the Board.\n\nThe Board members may direct questions to a commenter to elicit further information, and may request that additional material be provided for the record.\n\n(J.A., 176-77, 431-432, 664-65.) The Board has explained its fact-finding role as follows:\n\nThe process is that upon hearing your [private industry's] information here, we'll take everything that you have to say. If there is something that is not clear, if there's a comment which you make that doesn't jive with the record as we know it, or is new information that we are hearing for the first time, then what we will do following this hearing is to ask [UNICOR] to provide us more information or go outside [UNICOR] to gather information ourselves.\n\n(J.A., 577.)\n\nFurthermore, the Board has the exclusive authority to solicit information and question the \"commenters.\" In the words of the Board's chairman during the Office Case Goods hearing, \"[This] is not a process that is a give-and -take where you ask questions of the board and we're in a position to respond. What we basically do here is listen to your presentation and then consider that material, plus all the material that is on the record, and make a decision.\" (J.A., 803.) The broad discretion vested in the Board is of particular import in that UNICOR does not present any proposal to the Board during the hearings. The significant expansion hearings are limited to presentations made by \"commenters,\" not including the agency, and there lacks any cross-examination, counter-arguments, or any type of discussion that reasonably can be defined as \"adversarial.\" Therefore, the significant expansion hearings bear the hallmarks of inquisitorial proceedings in that the Board dominates the fact-finding process and the agency is not present during the proceedings. Consequently, the Board's significant expansion hearings are not adversarial and do not warrant a judicially-imposed issue exhaustion requirement.\n\nAccordingly, the district court erred in determining that the Coalition waived judicial review of the unauthorized significant expansion and the retroactive authorization claims.\n\n3. Laches\n\nThe defendants nevertheless assert that the equitable doctrine of laches precludes judicial review of the Coalition's significant expansion claims.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\n\"Laches is the ‘negligent and unintentional failure to protect one's rights.'\" Nartron Corp. v. STMicroelectronics, 305 F.3d 397, 408 (6th Cir. 2002) (quoting Elvis Presley Enter., Inc. v. Elvisly Yours, Inc., 936 F.2d 889, 894 (6th Cir. 1991)). \"Laches consists of two elements: (1) unreasonable delay in asserting one's rights; and (2) a resulting prejudice to the defending party.\" Brown-Graves Co. v. Central States, Southeast \u0026 Southwest Areas Pension Fund, 206 F.3d 680, 684 (6th Cir. 2000).\n\nWith respect to the first element, there is a strong presumption that a plaintiff's delay in bringing suit is reasonable as long as the analogous statute of limitations has not lapsed. See Herman Miller, Inc. v. Palazzetti Imp. \u0026 Ex., Inc., 270 F.3d 298, 321 (6th Cir. 2001) (citing Tandy Corp. v. Malone \u0026 Hyde, Inc., 769 F.2d 362, 365-66 (6th Cir. 1985)). \"Only rarely should laches bar a case before the analogous statute has run.\" Tandy Corp., 769 F.2d at 366.\n\nIt is undisputed that the six-year statute of limitations for bringing civil actions against the United States governs this action. See 28 U.S.C. § 2401(a) (\"Every civil action commenced against the United States shall be barred unless the complaint is filed within six years after the right of action first accrues.\"). It is further undisputed that the statute of limitations commenced upon the Board's issuance of the 1996 significant expansion decisions.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Accordingly, the earliest date upon which the limitations period expired was February 6, 2002 -- six years following the issuance of the Board's system furniture significant expansion decision.\n\nThe Coalition filed its complaint well within the limitations period; therefore, a strong presumption arises that the claims were filed within a reasonable time. In an attempt to overcome this presumption, the defendants direct the court to the close ties between CGP and QMFA during the litigation challenging the D \u0026 Q furniture significant expansion. The defendants emphasize that CGP partially incurred the expense of the QFMA litigation. See (Br. of the Defs.- Appellees at 41-42); (J.A., 1004). Apparently, the defendants suggest that CGP had a concomitant obligation to file an action at the time of the QFMA litigation challenging the significant expansions of Office Furniture.\n\nEven considering CGP's role, if any, in the QFMA litigation, the defendants fail to overcome the strong presumption of reasonable delay. See, e.g., (J.A., 1004). The defendants fail to acknowledge that several Coalition members, including Knoll, did not manufacture D \u0026 Q furniture and were unaware of the QFMA litigation. See (J.A., 1585 ¶¶ 9, 12,15). Of greater pertinence, the Coalition contends that it was the factual information produced through the QFMA litigation that alerted it that UNICOR's purportedly unlawful activities extended to Office Furniture. Accordingly, the Coalition cannot be said to have unreasonably delayed in filing suit as it was unaware of UNICOR's potentially unlawful activities in regard to Office Furniture production. The defendants' laches defense therefore fails as a matter of law.\n\nB. The Coalition's Unauthorized Significant Expansion Claims\n\nHaving traversed the jurisdictional and procedural hinterlands, we arrive at the substantive allegations presented in the unauthorized significant expansion claims. The Coalition alleges that \"From 1991-1995, [UNICOR] repeatedly violated its statute by significantly expanding Office Furniture production without prior Board review and approval.\" See (Br. of Pls.-Appellants at 12). It further alleges that UNICOR \"[R]epeatedly violated the Guidelines by failing to undertake the required data collection internal analysis.\" See (Br. of Pls.-Appellants at 12).\n\nAs a threshold matter, we note that UNICOR cannot escape liability by asserting that the Guidelines establish a higher standard than that imposed by Congress in section 4122. It is a fundamental tenet of administrative law that \"an executive agency must be rigorously held to the standards by which it professes its action to be judged.\" Vitarelli v. Seaton, 359 U.S. 535, 546 (1959) (Frankfurter, J., concurring in part and dissenting in part). Thus, \"it is incumbent upon agencies to follow their own procedures . . . even where the internal procedures are possibly more rigorous than otherwise would be required.\" Morton v. Ruiz, 415 U.S. 199, 235 (1974) (citations omitted); see also Vitarelli, 359 U.S. at 546-47 (Frankfurter, J., concurring in part and dissenting in part) (\"[I]f [agency action] is based on a defined procedure, even though generous beyond the requirements that bind such agency, that procedure must be scrupulously observed . . . . He that takes the procedural sword shall perish with that sword.\").\n\nThe unauthorized significant expansion claims arise from UNICOR's purported violations of the Guidelines. Specifically, the Coalition avers that UNICOR violated the Guidelines on eighty-two occasions throughout 1991-1995. See (J.A., 1422). However, the record reveals that the vast majority of these violations are the cumulative and annual effects of ten core violations. We consider the core violations seriatim.\n\n1. The purported core violations occurring in UNICOR's systems furniture production during 1991-1995\n\nThe Coalition contends that two core violations occurred during UNICOR's production of systems furniture from 1991-1995. The first violation occurred in 1991 when the Board authorized the start-up of a new systems furniture factory to be located at FCI Schuykill without performing the requisite market share analysis. See (J.A., 912-13).\n\nUNICOR concedes that it was required to perform the market share analysis. See (J.A., 1100 ¶ 25, 1266-67, 1492 ¶¶77-78, 1643 ¶¶ 77-78). UNICOR asserts, however, that it was not required to initiate the CARP because a subsequent review of market share revealed an allowable increase from 10.8% in 1991 to 11.60% in 1992. See (J.A., 926, 1100 ¶¶ 18, 20).\n\nThe plain text of the APA supports UNICOR's position. The APA instructs reviewing courts to take \"due account ... of the rule of prejudicial error.\" 5 U.S.C. § 706. \"[T]his court applies a prejudicial error rule to APA cases, such that a mistake that has no bearing on the ultimate decision or causes no prejudice shall not be the basis for reversing an agency's determination.\" Slater, 120 F.3d at 637 (citation omitted). The rule eliminates the necessity of remand following judicial review when the error that the agency has made was not prejudicial and did not impinge on fundamental rights. See N.Y. Pub. Interest Research Group v. Whitman, 321 F.3d 316, 333 (2d Cir. 2003). It \"requires the party asserting error to demonstrate prejudice from the error.\" Air Canada v. Dep't of Trans., 148 F.3d 1142, 1156 (D.C. Cir. 1998).\n\nThe Coalition is unable to demonstrate prejudice arising from the opening of the systems furniture factory at FCI Schuykill. Simply, had UNICOR conducted the market share analysis in 1991 (when the Board authorized the opening of the Schuykill factory), UNICOR would have discovered an increase within the allowable market share from 10.8% to 11.6%. See (J.A., 926, 1099 ¶¶ 18, 20). UNICOR therefore was not required to initiate the CARP and no discernible prejudice was sustained by the Coalition as a result of UNICOR's violation of the Guidelines.\n\nWe need not draw on the prejudicial error rule in addressing the second purported core violation arising from UNICOR's production of systems furniture. Similar to the claim challenging the opening of the Schuykill factory, the Coalition alleges that the Board's 1994 authorization of a new systems furniture factory at FCC Coleman violated the Guidelines because UNICOR neither conducted the market share analysis nor initiated the CARP.\n\nThe district court rejected this claim, concluding:\n\nIt is true that FPI's increase in market share from 9.6% [in 1994] to 14.3% [in 1995] was over the [G]uidelines limit, even taking into account the prior years' market shares. The trigger prong, however, is not satisfied. Plaintiffs rely upon the fact that FPI was planning on increased capacity in a new factory at the Federal Corrections Facility in Coleman to satisfy the trigger requirement. That factory was not activated until February of 1996. No offsetting reduction in capacity, therefore, was necessary in FY 1994, and consequently the trigger prong was not met. When the Coleman factory was activated, FPI was under the increased production levels approved by the Board on February 6, 1996. Therefore, there was no unauthorized increase in systems furniture.\n\n154 F. Supp. 2d at 1148.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nThe record supports the district court's well-reasoned conclusion. While UNICOR initially intended to commence production at FCC Coleman in June, 1995, it continually delayed opening the factory until 1996.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e As indicated supra, the Systems Impact Study included the activation of FCC Coleman among the proposals ultimately approved by the Board. See (J.A., 225). As the 1995 Systems Furniture Expansion disclosed the planned activation of FCC Coleman, UNICOR opened the Coleman factory in accordance with the Guidelines and section 4122.\n\n2. The purported core violations occurring in UNICOR's office seating furniture production during 1991-1995\n\nA similar fate befalls the four core violations occurring within UNICOR's office seating furniture production during 1991-1995. The Coalition alleges that UNICOR failed to conduct the requisite market share analysis: (1) when the Board authorized an increase in employment levels from 888 employees in 1992 to 983 employees in 1993; (2) when the Board authorized the activation of new factories at FCI Seagoville and FCI Three Rivers in 1991; (3) when the Board authorized the activation of new factories at FCI Bastrop and FCI Florence in 1993; and (4) when the D \u0026 Q furniture factory at USP Leavenworth manufactured a special order of office seating furniture in 1995.\n\nThe district court correctly rejected these claims, again relying on its analysis that in each instance the Coalition had failed to demonstrate that each tier of the Guidelines had been triggered. See 154 F. Supp. 2d at 1148-49.\n\nFor example, UNICOR offset the $44,545 in 1995 sales at the Leavenworth factory with a corresponding decrease of $1.8 million in sales at four factories.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Therefore, the first tier of the Guidelines was not triggered in 1995. UNICOR also offset the opening of office seating factories at FCI Bastrop and FCI Florence in 1993 with decreases in production at five factories.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Notwithstanding this diminished capacity, UNICOR actually increased its sales in 1993 by $48,788 from the previous year. However, UNICOR's operating plan for 1993 estimated a $14 million decrease from 1992 sales. Because the Guidelines required UNICOR to review only \"proposed production increases,\" UNICOR was not required to perform the market share analysis. See (J.A., 1646 ¶ 108). Similarly, despite UNICOR's planned increase in inmate employment from 888 employees in 1992 to 983 employees in 1993, see (J.A., 900, 1497 ¶ 108, 1646 ¶ 108), UNICOR was not required to conduct the market share analysis because of the planned decrease in its 1993 production.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Therefore, the opening of the new factories and the increases in employment in 1993 did not trigger the first tier Guidelines. Thus, UNICOR was not required to conduct a market share analysis.\n\nUNICOR's activation of new factories at FCI Seagoville and FCI Three Rivers in 1991, furthermore, did not result in prejudice to the Coalition. As with the authorization of the Schuykill systems furniture factory in 1991, the activation of the Seagonville and Three Rivers office seating factories did not cause UNICOR to exceed its allowable market share. As discussed in the Office Seating Impact Study, UNICOR estimated it having a 8.86% market share in 1991 -- a planned decrease from its 10.06% market share in 1990. See (J.A., 514). While UNICOR's actual market share increased from 13.99% in 1990 to 14.6% in 1991, see (J.A., 1500 ¶¶ 124-25, 1649 ¶¶ 124-25), this actual increase fell within the allowable market share. Accordingly, UNICOR was not required to initiate the CARP.\n\n3. The purported core violation occurring in UNICOR's office case goods furniture production during 1991-1995\n\nThe seventh alleged core violation arose during UNICOR's production of office case goods during 1991-1992. During this period, the number of inmates employed in the production of office case goods increased from 1,066 in 1991 to 1,358 in 1992. See (J.A., 774, 1110 ¶¶ 117, 120). Meanwhile, UNICOR's share of the federal market increased from 12.9% to 15.2%. See (J.A., 1504 ¶ 147, 1651 ¶ 147).\n\nFaced with this apparent unauthorized significant expansion, the district court concluded:\n\nThe office case goods increase in FY 1992 was not a significant increase. Between FY 1991 and 1992 there was an inmate employment increase of over 10% (the trigger), and an increase in market share of 2.3%. These increases would normally be considered a significant increase. Plaintiffs fail to consider, however, that the [G]uidelines also require that \"the prior three years of production will be reviewed, to ensure that usual and/or abnormal fluctuations are taken into account and normalized.\" Inmate employment was 1,243 in 1990, 1,066 in 1991, and 1,358 in 1992. By 1995, inmate employment was 1,462. Taking the prior years into account, the Court finds that the spike in 1992 in inmate employment was a result of a low point of employment in 1991 rather than a significant increase by itself.\n\n154 F. Supp. 2d at 1148-49 (citation omitted).\n\nThe Coalition does not specifically challenge the district court's conclusion on appeal, and we find the reasoning of the district court well-supported by the facts and law. Accordingly, no violation occurred with respect to UNICOR's production of office case good furniture from 1991-1995.\n\n4. The core violation arising from UNICOR's failure \"to undertake the required data collection internal analysis.\"\n\nThe Coalition attempts to salvage the unauthorized significant expansion claims by relying on UNICOR's failure to collect data regarding plant size and equipment capacity throughout 1991-1995. UNICOR concedes that it did not collect information regarding plant size and equipment capacity as required by the Guidelines. It nevertheless asserts that the deficient data collection did not result in any prejudice to the Coalition.\n\nWhile we do not readily concur in an agency's failure to adhere to its own promulgated procedures, the limited facts of this case compel the conclusion that there is a lack of any prejudice suffered by the Coalition as a result of UNICOR's omissions. The Coalition has not presented any supporting evidence from which an inference can be drawn that either plant size or equipment capacity increased beyond the ten percent threshold in any given year. We acknowledge that the Guidelines place an affirmative duty on UNICOR to produce such evidence and that the agency should bear the consequences of not generating the requisite data. However, we cannot turn a blind eye to the uncontroverted and overwhelming evidence in the record demonstrating that the Coalition did not sustain any prejudice as a result of UNICOR's violations.\n\nFor example, the White Paper examined UNICOR's failure to monitor plant size and equipment capacity and presented several conclusions indicating that UNICOR did not expand these inputs of production beyond the ten percent threshold. Indeed, the White Paper concluded that \"[T]he amount of production space [] decreased by over 40%,\" (J.A., 1335), and \"[f]or the most part, [UNICOR] ha[d] made minimal purchases of additional production equipment,\" (J.A., 1338). While it is recognized that the White Paper examined UNICOR's production of D \u0026 Q furniture, rather than Office Furniture, the conclusions remain pertinent because a significant number of factories that produced D \u0026 Q furniture also produced Office Furniture.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nThe record further demonstrates that prejudice did not result from UNICOR's failure to track plant size and equipment capacity. Specifically, the foregoing analysis reveals that, in this case, the Coalition suffered prejudice only where plant size or equipment capacity exceeded a ten percent increase and UNICOR's market share increased beyond the allowable threshold. The Coalition's claims necessarily are limited to the four occasions during 1991-1995 where UNICOR's market share increased beyond the allowable limits: (1) the 1995 increase in systems furniture production from a 9.6% market share in 1994 to a 14.3% share in 1995; (2) the 1992 increase in office seating production from a 14.6% market share in 1991 to a 18.5% share in 1992; (3) the 1993 increase in office seating production from the 18.5% market share in 1992 to a 20.5% share in 1993; and (4) the 1992 increase in office case goods production from a 12.9% market share in 1991 to a 15.2% share in 1992.\n\nHowever, these four increases in Office Furniture production are attributable to identifiable factors other than increases in plant size or equipment capacity. For instance, the parties acknowledge that the 1992 increases in office seating and office case goods production derive from dramatic increases in inmate employment during that year.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Similarly, the 1995 market share increase in systems furniture was the result of a decrease in the size of the federal market and a dramatic drop in production in 1994.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Consequently, UNICOR's systems furniture production was at abnormally depressed levels in 1994, which in turn, exacerbated the data for 1995. With respect to the 1993 increases in office seating, assuming arguendo that an inference could be gleaned from the record that equipment capacity or plant size increased by ten percent or more during that year, as discussed supra, the planned decrease in production rendered the Guidelines inapplicable.\n\nThe lack of any evidence proffered by the Coalition, the direct evidence found in the White Paper showing that neither equipment capacity nor plant size increased from 1991-1995, and the uncontroverted evidence demonstrating that increases in UNICOR's production were caused by other factors, all compel the finding that the Coalition suffered no prejudice as a result of UNICOR's failure to collect data regarding plant and equipment capacity. Thus, the unauthorized significant expansion claims fail as a matter of law.\n\nC. The Claim Challenging the Retroactive Authorization\n\nThe claim challenging the Board's retroactive authorization parallels the foregoing claims in that the Coalition asserts that UNICOR significantly expanded its production of office seating furniture in 1991 and 1992 without initiating the CARP (the ninth and tenth core violations). The Coalition goes on to assert that the Board lacked the authority to retroactively authorize these purported significant expansions.\n\nAddressing the first issue -- whether UNICOR significantly expanded its production of office seating furniture in 1991 and 1992 -- the foregoing analysis reveals that the 1991 expansion was not significant under the Guidelines. While inmate employment increased more than ten percent, UNICOR estimated it having a 8.86% market share in 1991 -- a planned decrease from its 10.06% market share in 1990. See (J.A., 514). UNICOR's actual market share increased from 13.99% in 1990 to 14.6% in 1991. See (J.A., 1500 ¶¶124-25, 1649 ¶¶ 124-25). This actual increase also fell within the allowable market share. Accordingly, UNICOR was not required to initiate the CARP prior to expanding its production of office seating in 1991.\n\nUNICOR did concede in the Office Seating Impact Study that it significantly expanded its production of office seating furniture in 1992. See (J.A., 476-77). The issue before the Court, therefore, is whether the Board possessed the authority to retroactively authorize the 1992 significant expansion.\n\nOur analysis is governed by the familiar standards established in Chevron U.S.A. Inc. v. Natural Resources Defense Council, Inc., 467 U.S. 837 (1984). Under Chevron, we first determine \"whether Congress has directly spoken to the precise question at issue,\" id. at 842; if it has not, we enquire \"whether the agency's answer is based on a permissible construction of the statute,\" id. at 843.\n\nThe plain text of the organic statute is unequivocally prospective in nature. For instance, section 4122 requires the initiation of the CARP \"[b]efore the board of directors makes a final decision.\" 18 U.S.C. § 4122(b)(4). Furthermore, the section repeatedly refers to \"plans\" and \"proposals\" for significant expansions. 18 U.S.C. § 4122(b)(4)(B), (C). A construction of the statute that allows for retroactive authorization renders nugatory these multiple provisions delineating the prospective application of the CARP. Thus, it is with little hesitation that we determine that the Board lacks the authority to retroactively authorize prior significant expansions.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nAs a remedy for the unlawful significant expansion, the Coalition urges this court to adopt the approach utilized in QFMA.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e As discussed supra, the district court in that case remanded the matter to the Board \"with directions that the Board must illicit [sic] comments with respect to the increases in FY 1991 to 1995 . . . make specific findings as to whether FPI obtained more than a reasonable share of the market . . . and ascertain what percent of the share was unreasonable.\" See QFMA, at 25.\n\nIt is well-settled that when an agency makes an error of law in its administrative proceedings, a reviewing court should remand the case to the agency so that the agency may take further action consistent with the correct legal standards. See South Prairie Constr. Co. v. Local No. 627, Int'l Union of Operating Eng'rs, 425 U.S. 800, 806 (1976) (per curiam). However, an exception to this general rule exists where it is \"crystal-clear [that the] Board error renders a remand an unnecessary formality.\" NLRB v. Food Store Employees Union, 417 U.S. 1, 8 (1974).\n\nA critical distinction exists between QFMA and the case at bar that renders a remand \"an unnecessary formality.\" In QFMA, the district court emphasized that the Board had not provided prior notice of its intent to retroactively authorize the significant expansions in D \u0026 Q furniture production. See QFMA, at 17 (\"[I]t appears . . . that the 1996 notice, comment, and approval by the Board solicited information and comments on future production levels, not the prior production levels.\"). This lack of notice led the district court to conclude:\n\n[T]o the extent the [d]efendants rely on the White Paper and the March 1996 decision in support of their earlier decisions, these documents are nothing more than post hoc rationalizations for their earlier decisions . . . The difficulty with relying on post hoc decisions is that it ignores the fact that the agency may not have made the same decision had it received timely comments . . . Furthermore, as noted above, it is not clear from the record whether [p]laintiff was notified in 1995-1996 that the Board, in 1996, would be considering the past violations, and would entertain comments regarding the past violations. In the absence of evidence supporting the decision at the time it was made, the court must conclude that the decision was issued without observance of proper procedures, and therefore violated the APA.\n\nQFMA, at 18 (citations and footnote omitted).\n\nIn contrast, it is uncontroverted in the instant case that UNICOR disclosed the 1992 (as well as the purported 1991) significant expansions and publically requested the Board for retroactive authorization. The private sector responded by providing comments to UNICOR and testimony to the Board that expressly recognized UNICOR's request for retroactive authorization. See (J.A., 544, 562, 588, 1107 ¶¶ 99-100). Relying on this notice, the court below reasoned:\n\nThis [c]court adopts the reasoning of [QFMA] but comes to a different finding in the present case because the record indicates that Plaintiffs were given adequate notice that the Board would consider approving the past significant increases in office seating production. The office seating impact study made available to the public in advance of the Board's 1996 decision clearly identified the expansion problems experience in 1991 and 1992 with office seating. For both 1991 and 1992, the report states that increases in production should have triggered \"an analysis of market share\"to determine the necessity of initiating the guidelines process.\n\nPlaintiffs had proper notice of the Board's intent to consider retroactive approval of the significant increases in office seating production, as well as an opportunity to comment at that administrative hearing. Therefore the Board was within its authority to consider and decided the issue and in so doing did not violate the Administrative Procedures Act.\n\n154 F. Supp. 2d at 1150-51 (citations omitted).\n\nWhile we disagree with the district court's conclusion that the \"Board was within its authority\" to retroactively authorize the 1992 significant expansion for the reasons previously discussed, the notice provided to the Coalition, as well as the manner in which the Board authorized the prior significant expansion, weigh strongly against remanding this matter to the Board. Were we to remand the matter in accordance with QFMA, we would likely do so with instructions to \"illicit [sic] comments\" with respect to the 1992 significant expansions, \"to make specific findings as to whether [UNICOR] obtained more than a reasonable share of the market\" during 1992, and to \"ascertain what percent of the share was unreasonable.\" See QFMA, at 25. However, the Board has complied with these potential instructions. The Office Seating Impact Study solicited comments, the private sector responded, and the Board engaged in an analysis of the relevant factors concluding, \"[B]ased on market performance since 1991 the industry has not been adversely affected, and that UNICOR's market share is reasonable. The Board therefore approves FPI's request to ratify its sales levels achieved, subsequent to and as a result of its expanded capacity during 1991 and 1992.\" (J.A. 656.) Hence, it is \"crystal-clear\" that a remand to the Board would do little more than duplicate processes already undertaken. Food Store Employees Union, 417 U.S. at 8.\n\nMoreover, the facts of the instant appeal preclude ourawarding of the equitable sales volume replacement remedy.The Coalition has not provided any evidence to support itspurported $450 million in lost sales. It follows that theCoalition has not presented any evidence addressing onlythose sales lost as a result of the 1992 significant expansionin office seating. Furthermore, a remand to the district courtfor a damages hearing would likely confound, rather thanclarify the matter, in light of the Coalition's failure to presentany evidence of \"injury\" during the office seating furnitureexpansion hearings. The Coalition did not present anyevidence of lost sales during the 1996 expansion hearings.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e The Coalition likewise has not presented any verifiableevidence of lost sales during these proceedings. Therefore, itwould be an impermissible exercise in speculation for thiscourt to order the requested relief.\n\nAccordingly, we determine that the Board lacked the authority to retroactively authorize UNICOR's 1992 significant expansions of office seating furniture production. We further determine that a remand to the board is unnecessary. Moreover, the Coalition has not advanced sufficient evidence demonstrating an entitlement to its equitable volume sales replacement remedy.\n\nD. The Claim Challenging the Board's 1996 Expansion Decisions\n\nThe Coalitions relies on three factors allegedly demonstrating the \"arbitrary and capricious\" nature of the Board's 1996 expansion decisions:\n\nFirst, the Board failed to consider the fundamental question of whether FPI's previously expanded Office Furniture production complied with its Guidelines and was appropriate. Second, the determinations that FPI's seating and case goods production did not take an unreasonable share of the Federal markets for these products were based on a flawed and inaccurate market share methodology. Third, the decisions followed improper ex parte communications to which the private sector had no opportunity to address or rebut.\n\nSee (Br. of Pls.-Appellants at 53-54).\n\nThe APA establishes a scheme of \"reasoned decisionmaking.\" Motor Vehicle Mfrs. Ass'n of United States, Inc. v. State Farm Mut. Auto. Ins. Co., 463 U.S. 29, 52 (1983). \"Not only must an agency's decreed result be within the scope of its lawful authority, but the process by which it reaches that result must be logical and rational.\" Allentown Mack Sales and Service, Inc. v. National Labor Relations Bd., 522 U.S. 359, 374 (1998).\n\nAn agency's decision will be set aside \"only if it is arbitrary, capricious, an abuse of discretion, or otherwise not in accordance with the law.\" Slater, 120 F.3d at 632 (citations omitted). This arbitrary or capricious standard is the least demanding review of an administrative action. See Davis v. Kentucky Fin. Cos. Ret. Plan, 887 F.2d 689, 693 (6th Cir. 1989). It requires the party challenging the agency's action to \"show that the action had no rational basis or that it involved a clear and prejudicial violation of applicable statutes or regulations.\" McDonald Welding v. Webb, 829 F.2d 593, 595 (6th Cir. 1987). If there is any evidence to support the agency's decision, the agency's determination is not arbitrary or capricious. See Oakland County Bd. of Com''rs v. U.S. Dep't of Labor, 853 F.2d 439, 442 (6th Cir. 1998).\n\nHowever, deferential judicial review under the APA does not relieve the agency of its obligation to develop an evidentiary basis for its findings. To the contrary, the APA reinforces this obligation. See, e.g., Motor Vehicle Manufacturers Ass'n, 463 U.S. at 43 (\"[T]he agency must examine the relevant data and articulate a satisfactory explanation for its action including a rational connection between the facts found and the choice made.\") (quotation omitted); Securities \u0026 Exchange Comm'n v. Chenery Corp., 318 U.S. 80, 94 (1943) (\"The orderly function of the process of review requires that the grounds upon which the administrative agency acted are clearly disclosed and adequately sustained.\").\n\nThe Coalition's three challenges to the 1996 expansion decisions fall short of demonstrating arbitrary and capricious decision-making on the part of the Board. As a threshold matter, the Coalition's claim that the Board failed to consider UNICOR's past production levels is factually inaccurate. As the district court correctly determined:\n\nPlaintiffs also argue that the Board's decision on future increases failed to consider whether the then current production levels during 1996 were even legal. The record does not support Plaintiffs' contention. The Board itself recognized that certain increases had occurred without prior Board approval, and carefully considered those increases and the context in which they occurred before deciding that those increases did not violate FPI's governing statutes . . . Here, it is impossible to conclude from the evidence that the Board failed \"entirely\" to consider the problem of whether past increases exceeded the mandate of FPI because it specifically addressed those increases in its 1996 hearing.\n\n154 F.Supp. 2d 1150-51.\n\nAdditionally, the Coalition's assault on the methodology utilized by the Board in calculating the federal market ignores several key facts. During the period in question, there were two sources of data relating to the size of the federal market: (1) the General Services Administration Federal Supply Schedules (\"FSS\"); and (2) the Federal Procurement Data Center (\"FPDC\"). The FSS provided data for all federal government purchases except those relating to the Department of Defense, the United States Postal Service, the legislative and judiciary branches, credit card purchases and special orders. The FPDC maintained similar data, except that it did not account for purchases less than $25,000.\n\nUNICOR utilized the FSS in the Final Systems Impact Study's calculation of the federal market, noting \"It is difficult to determine the exact amount of Federal systems furniture buys from private vendors not captured by the [FSS].\" (J.A., 294.) The Coalition does not challenge UNICOR's use of the FSS. Rather, the Coalition objects to UNICOR's use of the FPDC data in the impact studies relating to office seating and office case good furniture. Specifically, the Coalition alleges that UNICOR made several adjustments to account for the sales not captured by the FPDC data that, in turn, exaggerated the size of the federal market.\n\nThe Coalition fails to acknowledge that UNICOR ceased its use of the FSS data because representatives from GSA would not verify the accuracy of the data. See (J.A., 1296, 1512 ¶189, 1654 ¶ 190, 1684 ¶ 189). The Coalition further fails to acknowledge that the Board recognized the potential for difficulties in calculating the federal market and convened a panel of independent experts to review its methodology as part of the office case goods decision. See (J.A., 892-93). The independent panel of experts -- the Methodology Review Panel -- approved of UNICOR's methodology. See (J.A., 918) (\"It is the consensus of the Methodology Review Panel that the basic methodology used by FPI to estimate Federal procurements is reasonable.\").\n\nConsequently, the Coalition's challenge to the methodology utilized by UNICOR to determine the size of the federal market does not suggest that evidence is lacking to support the Board's decision. Rather, it is a disagreement between the parties as to the ideal manner in which to calculate data that is not otherwise readily obtainable. In such circumstances, principles of deference to agency decision-making require that we uphold the approach utilized by the Board. See Marsh v. Oregon Natural Resources Council, 490 U.S. 360, 378 (1989) (holding that \"an agency must have discretion to rely on the reasonable opinions of its own qualified experts even if, as an original matter, a court might find contrary views more persuasive.\").\n\nIn a final attempt to demonstrate the arbitrary and capricious nature of the 1996 expansion decisions, the Coalition alleges that the Board engaged in ex parte communications with UNICOR's staff prior to, and immediately following, the expansion hearings. UNICOR readily admits that the Board requested information from UNICOR's staff that extended beyond that provided in the comprehensive impact studies, and that the Board directed the staff to memorialize the Board's final significant expansion decisions in writing. UNICOR contends, however, that this interaction between it and the Board was consistent with the organic statute.\n\nUNICOR and the Board's interpretation of section 4122 as permitting ex parte communications is entitled to deference to the extent that its is reasonable. See Washington State Dept. of Social and Health Servs. v. Guardianship Estate of Keffeler, 537 U.S. 371, 385 (2003) (holding that cogent \"administrative interpretations . . . not [the] products of formal rulemaking . . .warrant respect\"); Christensen v. Harris County, 529 U.S. 576, 587 (2000) (\"Interpretations such as those in . . . policy statements, agency manuals, and enforcement guidelines, all of which lack the force of law -- do not warrant Chevron-style deference.\"); accord, United States v. Mead Corp., 533 U.S. 218, 234 (2001). We \"normally accord particular deference to an agency interpretation of ‘longstanding' duration,\" Barnhart v. Walton, 535 U.S. 212, 220 (2002) (quoting North Haven Bd. of Ed. v. Bell, 456 U.S. 512, 522, n. 12 (1982)), recognizing that the agency's practices rest on \"‘a body of experience and informed judgment to which courts and litigants may properly resort for guidance,'\" Bragdon v. Abbott, 524 U.S. 624, 642 (1998) (quoting Skidmore v. Swift \u0026 Co., 323 U.S. 134, 139-140 (1944)).\n\nIt is reasonable to construe the organic statute as encouraging communications between the Board and UNICOR. Section 4121 provides: \"‘Federal Prison Industries', a government corporation of the District of Columbia, shall be administered by a board of six directors, appointed by the President to serve at the will of the President without compensation.\" 18 U.S.C. § 4121. \"Administer\" is \"[t]o manage or conduct . . . [or] to take charge of a business.\" Black's Law Dictionary44 (6th Ed. 1990). While the organic statute subsequently segregates the duties of UNICOR and the Board, section 4121 demonstrates the inter-relationship between the entities. Simply, the Board could not \"take charge\" of UNICOR without engaging in communications with its staff.\n\nFurthermore, the Coalition's assertion that section 4122, and more specifically the CARP, prescribe the exclusive process in which the Board and UNICOR may communicate is wholly devoid of merit.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e The statute provides no such limiting language. Rather, the text of the organic statute compels the conclusion that Congress envisioned close interaction between the Board and UNICOR's staff. Moreover, Congress established the Board as one serving \"without compensation\" and without staff. It therefore is reasonable to construe the statute as authorizing communications, even ex parte communications, between the Board and UNICOR's staff.\n\nWe cannot find that the Board's 1996 expansion decisions were \"arbitrary capricious or otherwise not in accordance with law.\" Slater, 120 F.3d at 632 (citations omitted). Indeed, we find the administrative record lengthy, detailed, and demonstrative of careful evaluation on the part of Board. Contrary to the assertions advanced by the Coalition, the Board did not passively authorize UNICOR's significant expansion requests. The Board demonstrated a willingness to authorize lower expansions than that requested when the evidence adduced required such reductions. Furthermore, when the Coalition challenged UNICOR's data (i.e. in the office case goods context), the Board convened a panel to evaluate the data and agreed to alter its decision if further information came to light. Thus, the Coalition's claim challenging the 1996 significant expansions decision fails as a matter of law. Accordingly, the Court therefore cannot hold that the Board's decisions were arbitrary and capricious.\n\nV. THE JUST COMPENSATION CLAUSE CLAIM\n\nThe Coalition \"constitutionalizes\" its unauthorized significant expansion claims by asserting that UNICOR's increased production during 1991-1995 constituted a \"taking\" pursuant to the Just Compensation Clause of the Fifth Amendment to the United States Constitution. The Just Compensation Clause does not prohibit the public taking of private property, but only taking \"without just compensation.\" U.S. Const. amend. V. The aim of the Clause is to prevent the government \"from forcing some people alone to bear public burdens which, in all fairness and justice, should be borne by the public as a whole.\" Armstrong v. United States, 364 U.S. 40, 49 (1960). A party challenging governmental action as an unconstitutional taking bears a substantial burden. See Eastern Enter.v. Apfel, 524 U.S. 498, 523 (1998)(citation omitted).\n\nA. Jurisdiction\n\nAs a threshold matter, UNICOR raises sovereign immunity as a bar to the Coalition's takings claim. Long-standing authority suggests that a suit against UNICOR is essentially a suit against the United States. See Galvan v. Fed. Prison Indus.,199 F.3d 461, 463-64 (D.C. Cir. 1999); Sprouse v. Fed. Prison Indus., 480 F.2d 1, 4-5 (5th Cir. 1973). On the basis of this authority, UNICOR asserts that it generally is immune from suit unless it otherwise consents to be sued. See United States v. Sherwood, 312 U.S. 584, 586 (1941).\n\nThe Coalition alleges that the APA expressly waives UNICOR's purported sovereign immunity. The APA's waiver of sovereign immunity applies to \"an action in a court of the United States seeking relief other than money damages.\" 5 U.S.C. § 702. In addition, the APA provides that judicial review of agency action is available only \"if there is no other adequate remedy in a court.\" 5 U.S.C. § 704.\n\nUNICOR contends that the APA's waiver is inapplicable to the case at bar because the Coalition's claim for $450 million in lost sales is monetary in nature. UNICOR further contends that jurisdiction over this case properly rests in the Court of Federal Claims.\n\nThe Tucker Act, 28 U.S.C. § 1491(a)(1), vests the Court of Federal Claims with exclusive jurisdiction to render judgment upon any claim against the United States for money damages exceeding $10,000 that \"is founded either upon the Constitution, or any Act of Congress or any regulation of an executive department, or upon any express or implied contract with the United States, or for liquidated or unliquidated damages in cases not sounding in tort.\" Id. It is well-established that \"[r]egardless of the nature of relief sought, the availability of the Tucker Act remedy renders premature any takings claim in federal district court.\"\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Eastern Enter., 524 U.S. at 521 (quotation omitted). Thus, a claim for just compensation asserted against the United States must be brought to the Federal Court of Claims in the first instance, unless Congress has otherwise withdrawn the Tucker Act grant of jurisdiction. See Eastern Enter., 524 U.S. at 520; see also United States v. Causby, 328 U.S. 256, 267 (1946) (\"[I]f there is a taking, the claim ‘is founded upon the Constitution' within the meaning of the Tucker Act.\"). Consequently, we initially must consider whether the Tucker Act's monetary remedy is available to the Coalition.\n\nIn Core Concepts of Fl. v. United States, 327 F.3d 1331 (Fed. Cir. 2003), the Court of Appeals for the Federal Circuit affirmed the dismissal of a Tucker Act suit brought against UNICOR in the Court of Federal Claims on jurisdictional grounds. Id. at 1335. Applying the non-appropriated funds doctrine (\"NAFI\"),\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e the court examined UNICOR's organic statute and determined:\n\n[UNICOR] does not operate with appropriated funds. It is a self-sufficient corporation whose funds are derived primarily from its product sales, and it receives no congressional appropriations . . . . [UNICOR] repaid its initial funding soon after its inception in 1934 and has never received any appropriations from Congress since that time.\n\nIn light of [UNICOR's] enabling legislation and legislative history, we conclude that Congress has clearly expressed its intention that [UNICOR's] funds are to be segregated from the general federal revenues, thereby providing a \"firm indication\" that it intended to absolve appropriated funds from liability for [UNICOR's] actions. Accordingly, we agree with the Court of Federal Claims' conclusion that [UNICOR] is a NAFI for which the United States is not financially answerable in that court.\n\nId. at 1335, 1337. The NAFI exception therefore precludes the Coalition from asserting Tucker Act claims against UNICOR in the Court of Federal Claims. Moreover, there is a substantial question as to whether a suit against UNICOR is essentially a suit against the United States for sovereign immunity purposes, as funds from the federal treasury are not implicated in the event a judgment is rendered against UNICOR. See Aaron v. United States, 51 Fed. Cl. 690, 694 n.2 (Fed. Cl. 2002) (\"Both courts held that the suits essentially were against the United States and that the United States had not, insofar as relevant there, waived sovereign immunity. The issue in those decisions was not the one resolved here [the NAFI] . . . we view the relevant language as dicta, and, in any event believe it to be inaccurate.\") (citing Sprouse, 480 F.2d 1 and Galvan, 199 F.3d at 463); see also Zhen Hua-Gao v. Jenifer, 185 F.3d 548, 554 (6th Cir. 1999) (\"The general rule is that a suit is against the sovereign if the judgment sought would expend itself on the public treasury or domain, or interfere with the public administration, or if the effect of the judgment would be to restrain the Government from acting, or to compel it to act.\").\n\nWe decline to resolve the conflicting authority as to whether UNICOR is entitled to sovereign immunity. It is sufficient for our purposes here that the Coalition could not advance its claim in the Court of Federal Claims.\n\nFurthermore, we do not concur in UNICOR's characterization of the relief sought by the Coalition. We acknowledge that a party cannot circumvent the Tucker Act \"by suing solely for declaratory or injunctive relief in a case where such relief is tantamount to a judgment for money damages.\" Veda v.United States Dep't of the Air Force, 111 F.3d 37, 39 (6th Cir. 1997). Where the complaining party's \"prime objective\" is simply to obtain money from the federal government, the case belongs in federal claims court. Id.\n\nHowever, as we repeatedly have stated supra, the Coalition seeks equitable, rather than monetary, relief in the form of a roll-back, capping, or future adjustment of UNICOR's production. Notwithstanding the patently equitable nature of the requested relief, UNICOR attempts to characterize this relief as seeking money from the U.S. Treasury. Specifically, UNICOR argues that in the event this court were to order the equitable volume sales replacement remedy, federal agencies and departments would be compelled to purchase Office Furniture from the private sector. Such purchases, UNICOR argues, necessarily draw on the federal treasury.\n\nThis court has rejected a similar argument, reasoning, \"‘The fact that a judicial remedy may require one party to pay money damages to another is not sufficient reason to characterize the relief as ‘money damages'.'\" Veda, 111 F.3d at 40 (quoting Bowen v. Mass., 487 U.S. 879, 893 (1988)). We likewise decline to construe the requested relief as seeking monetary damages; therefore, the district court properly asserted its jurisdiction over the Coalition's takings claim.\n\nB. Regulatory Takings\n\nThe United States Court of Appeals for the Federal Circuit, which has extensive expertise in federal-takings law in light of its specialized jurisdiction, has developed a two-part test \"to evaluate claims that a governmental action constitutes a taking of private property without just compensation.\" Maritrans Inc. v. United States, 342 F.3d 1344, 1352 (Fed. Cir. 2003) (citing M \u0026 J Coal Co. v. United States, 47 F.3d 1148, 1153-54 (Fed Cir. 1995)). First, the court must examine whether the claimant has established a cognizable \"property interest\" for the purposes of the Just Compensation Clause. Id.; accord, Raceway Park, Inc. v. Ohio, 356 F.3d 677 (6th Cir. 2004) (\"[T]here is no taking if there is no private property in the first place.\"). Secondly, where a cognizable property interest is implicated, the court must consider whether a taking occurred. Id.\n\nWith respect to the first step, the Constitution neithercreates nor defines the scope of property interestscompensable under the Just Compensation Clause. See Bd. ofRegents of State Colleges. v. Roth, 408 U.S. 564, 577 (1972). Rather, \"existing rules and understandings\" and \"backgroundprinciples\" derived from an independent source, such as state,federal, or common law, define the dimensions of therequisite property rights for purposes of establishing acognizable taking. Lucas v. S. C. Coastal Council, 505 U.S.1003, 1030 (1992).\n\nThe Coalition asserts that UNICOR's \"unauthorized expansions diminished Plaintiffs' collective property right in the competitive Federal Government Office Furniture market.\" (Br. of Pls.-Appellants at 61.) Federal government procurements of Office Furniture are governed by UNICOR's organic statute and the Federal Acquisition Regulations (\"FAR\"), 48 C.F.R. §§ 8.000 - 9905.506 (2003). Several provisions of the FAR mandate that federal agencies and departments purchase products from UNICOR. See, e.g., 48 C.F.R. § 8.002(a)(1)(iii) (2003) (\"[A]gencies shall satisfy requirements for supplies or services from . . . Federal Prison Industries, Inc.\"); 48 C.F.R. § 8.602(a) (\"Agencies shall purchase required supplies . . . made in Federal Penal and Correctional Institutions . . . .\"). Additionally, section 4124(a) requires \"Federal departments and agencies and all other Government institutions of the United States [to] purchase at not to exceed current market prices, such products\" manufactured by UNICOR \"as meet their requirements and may be available.\" 18 U.S.C. § 4124(a). Indeed, UNICOR is a \"mandatory source of supply\"of Office Furniture for federal agencies and departments. See (Br. of Pls. - Appellants at 5, 9); (Br. of Defs. - Appellees at 4).\n\nHowever, as discussed throughout this opinion, several provisions of UNICOR's organic statute ensure that UNICOR's operation do not \"undu[ly] burden\" a single private industry, 18 U.S.C. § 4122(b)(1), nor \"capture more than a reasonable share of the [federal] market,\" 18 U.S.C. § 4122(b)(2). Furthermore, federal agencies and departments may request waiver approval from UNICOR to purchase products other than UNICOR items in the event they deem that their specific product and, or reasonable delivery requirements cannot be met. See 48 C.F.R. § 8.605. Where UNICOR grants the waiver request, the federal agency or department may purchase the product from a private sector manufacturer through GSA's FSS program, or undertake a competitive process governed by federal procurement laws.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e See generally 10 U.S.C. §§ 2302-2332; 41 U.S.C. §§ 5-707. Relying on these provisions, the Coalition asserts: \"Federal law and regulations including the Competition in Contracting Act and the Federal Acquisition Regulations establish that private sector Office Furniture manufacturers have the right to compete for Federal Office Furniture procurements. [The Coalition is] listed on the GSA schedule as approved to sell Office Furniture to the Federal government . . . .\" (Br. of Pls.-Appellants at 61.)\n\nIt is well-settled that \"[t]he possibility of obtaining work from a listing in the [FSS] schedule has real business value, even if there [is] no guarantee of obtaining a certain amount of work.\" See ACE-Fed.Reporters, Inc. v. Barram, 226 F.3d 1329, 1331 (Fed. Cir. 2000); see also Locke v. United States, 283 F.2d 521, 523 (Ct. Cl. 1960) (\"We cannot believe that in this instance plaintiff bargained merely to have his name printed in the supply schedule. It appears more important that being in the schedule created a reasonable probability that business would be obtained.\"). Therefore, in this context, the Coalition has a property right in competing for Office Furniture sales to federal agencies. This property right is limited, however, to those sales not captured by UNICOR's mandatory preference either through the limitations present in UNICOR's organic statute, or those sales expressly waived by UNICOR.\n\nHaving established the Coalition's property right, the second tier of review requires an examination as to whether UNICOR's activities constituted a compensable taking. While compensable takings generally occur as a result of a physical invasion or confiscation, where \"a regulation goes too far it will be recognized as a taking.\" Pa. Coal Co. v. Mahon, 260 U.S. 393, 415 (1922). \"Real property, tangible property, and intangible property, all may be the subject of takings claims.\" Maritrans Inc., 342 F.3d at 1352 (citing Lucas, 505 U.S. at 1015; Andrus v. Allard, 444 U.S. 51, 65 (1984); and Ruckelshaus v. Monsanto Co., 467 U.S. 986, 1003-04 (1984)).\n\nRegulatory takings law incorporates both a \"categorical taking,\" where a regulation deprives property of all value, and a \"non-categorical\" taking, where property is deprived of some, but not all of its economic value, as a result of government regulation. See Anderson v. Charter Township of Ypsilanti, 266 F.3d 487, 493 (6th Cir. 2001) (citing Lucas, 505 U.S. at 1019 n.8). \"In the categorical-taking case, once it is proven that a regulation has deprived the land of all economic value, compensation is automatically required under the Fifth Amendment.\" Anderson 266 F.3d at 493 (citing Lucas, 505 U.S. at 1015).\n\nWhere, as here, the party alleges the presence of a non-categorical taking, the court employs an \"ad hoc, factual inquiry,\" into three significant factors: (1) the economic impact of the regulation on the claimant; (2) the extent to which the regulation has interfered with distinct investment-backed expectations; and (3) the character of the governmental action. Raceway Park, Inc., 356 F.3d at 677 (citing Connolly v. Pension Benefit Gty. Corp., 475 U.S. 211, 224 (1986)); see also Pa. Central Transp. Co. v. City of New York, 438 U.S. 104, 124 (1978).\n\nThe United States Court of Appeals for the District of Columbia Circuit has explained the Penn Central factors in detail:\n\nThe meaning of the three factors identified in Penn Central has been amplified by the Court, both in Penn Central and in later cases. The regulation's economic effect upon the claimant may be measured in several different ways. See Hodel v. Irving, 481 U.S. 704, 714 (1987) (looking to the market value of a property); Keystone Bituminous Coal Ass'n v. DeBenedictis, 480 U.S. 470, 495-96 (1987) (looking to whether the regulation makes property owner's coal operation \"commercially impracticable\"); Andrus, 444 U.S. at 66 (looking to the possibility of other economic use besides sale, which was prohibited by the challenged regulation); Penn Central Transp. Co., 438 U.S. at 136 (focusing on the ability to earn a reasonable rate of return). A reasonable investment-backed expectation \"must be more than a ‘unilateral expectation or an abstract need.'\" Ruckelshaus, 467 U.S. at 1005-06 (1984) (quoting Webb's Fabulous Pharmacies, Inc. v. Beckwith, 449 U.S. 155, 161(1980)). Claimants cannot establish a takings claim \"simply by showing that they have been denied the ability to exploit a property interest that they heretofore had believed was available for development.\" Penn Central Transp. Co., 438 U.S. at 130. And the character of the governmental action depends both on whether the government has legitimized a physical occupation of the property, see Loretto v. Teleprompter Manhattan CATV Corp., 458 U.S. 419, 434-35 (1982), and whether the regulation has a legitimate public purpose, see Keystone Bituminous Coal Ass'n, 480 U.S. at 485. Finally, under all three of these factors, the effect of the regulation must be measured on the \"parcel as a whole.\" See Penn Central Transp. Co., 438 U.S. at 130-31.\n\nDist. Intown Prop. Ltd. P'ship v. D.C., 198 F.3d 874, 879 (D.C. Cir. 1999) (internal citations modified).\n\nWhen viewed through the lens of Penn Central, a myriad of deficiencies in the Coalition's takings claim come into focus. While the Coalition has asserted that UNICOR's production during 1991-1995 resulted in $450 million in lost sales, it has failed to provide any supporting evidence for this assertion. In addition, it is axiomatic that the Coalition's investment-backed expectations are limited by UNICOR's exercise of its mandatory source of supply. As the Coalition acknowledges:\n\nWhile it may change from year to year, there is a fixed amount of Office Furniture that the Federal Government will purchase at any given time. Within this fixed market of Federal Office Furniture procurements is FPI's mandatory source preferences. Regardless of how much Office Furniture Defendant FPI produces in Federal penal and correction institutions, the Federal Government must buy every stick of it before it can purchase Office Furniture made by the [Coalition].\n\n(J.A., 1456.) This acknowledgment crystalizes the deficiency of the Coalition's takings claim. The Coalition continued:\n\nConcerned about the impact this regime could have on private manufacturers . . . Congress amended FPI's statute to ensure that it does not take more than a reasonable share of the Federal Office Furniture market without giving the affected private sector vendors who sell to the Federal government certain due process rights.\n\n(J.A., 1456.) Beyond recognizing that its reasonable investment-backed expectation is dependent on UNICOR's production of Office Furniture for any given year, the Coalition further recognizes the legitimacy of UNICOR's conduct -- the production of Office Furniture for the purposes of employing inmates. Indeed, the lone dispute concerning UNICOR's conduct during 1991-1995 is that UNICOR did not initiate the CARP prior to expanding production. Such claims sound in due process, rather than takings law. The Coalition concedes such by stating:\n\nCount 7 . . . alleges that by significantly increasing its production of Office Furniture from FY 1990-1995, without undertaking the statutorily required due process procedures outlined in their organic statute, FPI's illegal expansion of Office Furniture Production, FPI effectuated a regulatory taking in violation of the due process clause of the Fifth Amendment to the United States Constitution.\n\n(J.A. 1457) (internal errors in original).\n\nWe therefore agree that summary judgment was properly awarded to UNICOR with respect to the takings claim because the Coalition has failed to establish the three Penn Central factors: (1) that it lost $450 million in sales as a result of UNICOR's increased production; (2) that it had any strong investment backed expectations in light of UNICOR's mandatory source of supply; and (3) that its interests prevailed over of the legitimate interests of the federal government in employing federal inmates.\n\nVI. THE PASS-THROUGH FURNITURE CLAIM\n\nPrior to oral argument, UNICOR filed notice with the court indicating that the Board \"adopted a resolution directing that [UNICOR] cease using the ‘pass-through' practice.\" (Letter from Assistant U.S. Attorney Charles R. Gross, filed Nov. 18, 2002.) The notice asserted that as UNICOR had \"voluntarily ceased use of the [pass-through] practice,\" the issue was moot. Id.\n\nDuring oral argument, counsel for the Coalition agreed that the \"pass-through\" furniture claim was moot, but requested that the court vacate the district court's decision in that regard.\n\nWhether any opinion should be vacated on the basis of mootness is an equitable question. See U.S. Bancorp Mortg. Co. v. Bonner Mall P'ship, 513 U.S. 18, 26 (1994). When a civil case becomes moot pending appellate adjudication, \"the established practice . . . in the federal system . . . is to reverse or vacate the judgment below and remand with a direction to dismiss.\" United States v. Munsingwear, Inc., 340 U.S. 36, 39 (1950). Vacatur \"clears the path for future relitigation\" by eliminating a judgment the appellant could not oppose on direct review. Id. at 40. \"Vacatur is in order when mootness occurs through happenstance -- circumstances not attributable to the parties -- or, relevant here, the ‘unilateral action of the party who prevailed in the lower court.'\" Arizonans for Offical English v. Ariz., 520 U.S. 43, 71-72 (quoting U.S. Bancorp Mortgage Co., 513 U.S. at 23). \"[W]here mootness results from settlement, however, the losing party has voluntarily forfeited his right legal remedy by the ordinary processes of appeal or certiorari, thereby surrendering his claim to the equitable remedy of vacatur.\" U.S. Bancorp Mortgage Co., 513 U.S. at 25.\n\nBased upon this authority and the unilateral action of the Board, this claim has become moot. We therefore remand the matter to the district court with instruction to vacate its award of summary judgment on Count XIII of the complaint addressing UNICOR's \"pass-through\" furniture practice.\n\nVII. UNICOR'S ENFORCEMENT OF ITS MANDATORY SOURCE\n\nThe Coalition's final claim challenges UNICOR's practice of selling Office Furniture directly to private sector contractors employed on federal projects. In such instances, the private sector contractor has entered into a contract to construct a federal facility that includes the installation of Office Furniture. Occasionally, the private sector contractor will attempt to procure the Office Furniture from a private manufacturer instead of UNICOR. When UNICOR becomes aware of the scenario, it attempts to enforce its mandatory source of supply in three ways: (1) provide the federal agency or department with a waiver; (2) provide the Office Furniture directly to the federal agency or department that, in turn, will provide it to the private sector contractor; or (3) sell the furniture directly to the private sector contractor for installation within the federal facility. See (Br. of Defs.-Appellees at 8); (J.A., 1217-19, 1226b-h). The Coalition alleges that this third option violates UNICOR's express prohibition against selling goods \"to the public in competition with private enterprise.\" 18 U.S.C. § 4122 (a).\n\n1. Standing\n\nThe district court held that the Coalition lacked standing to challenge UNICOR's practice because the Coalition \"must show an actual or threatened harm beyond an imagined possibility of harm in order to have standing. Here, none of the Plaintiffs [were] able to allege any kind of personal injury-in-fact.\" 154 F. Supp. 2d at 1155.\n\nFailure to establish standing is a jurisdictional defect. See Lewis v. Casey, 518 U.S. 343, 349 n.1 (1996). To satisfy the requirements of Article III standing, \"a plaintiff must, generally speaking, demonstrate that he has suffered ‘injury in fact,' that the injury is ‘fairly traceable' to the actions of the defendants, and that the injury will likely be redressed by a favorable decision.\" Bennett v. Spear, 520 U.S. 154, 162 (1997) (citing Lujan v. Defenders of Wildlife, 504 U.S. 555, 560-61 (1992)).\n\nIn the instant matter, the district court failed to give appropriate consideration to the affidavit provided by Knoll's Vice President for Government Sales. See (J.A., 1583-88). The affidavit demonstrated four identifiable occasions where Knoll had been requested by general contractors employed in the construction of federal facilities to submit proposals for the sale of Office Furniture; it had incurred substantial expense in preparing its proposals; UNICOR subsequently enforced its mandatory source of supply on the general contractor; and the general contractor ultimately purchased Office Furniture from UNICOR, rather than Knoll. See (J.A., 1586-88). On at least one occasion, the general contractor \"advised Knoll, Inc. that [it] would have ordered systems furniture from Knoll, Inc. had they not been forced to procure systems furniture from [UNICOR].\" (J.A., 1587). Accordingly, Knoll had standing to challenge UNICOR's practice.\n\n2. Mootness\n\nPrior to oral argument, UNICOR filed another notice with the court, this time indicating that Congress had enacted legislation, Pub. L. No. 107-314, 116 Stat. 2458 (2002), that mooted the Coalition's claim. See (Letter from Assistant U.S. Attorney Charles R. Gross, filed Feb. 3, 2003.) The notice indicated that the legislation provided that private sector contractors employed on projects for the Department of Defense (\"DOD\")were \"permitted, but [] not required, to purchase products or services from UNICOR.\" Id.\n\nDuring oral argument, counsel for the Coalition disagreed that the claim was moot, alleging that its claim extended beyond the DOD context.\n\nWe agree. It is undisputed that UNICOR enforces its mandatory source of supply on all private sector contractors employed on federal projects where the agency has not received a waiver. A plain reading of the newly enacted legislation, as well as the implementing regulations, demonstrate that they limit UNICOR's practice solely in the context of DOD projects. See Defense Federal Acquisition Regulation Supplement; Competition Requirements for Purchases From a Required Source, 68 F.R. 64559 (Nov. 14, 2003). Consequently, the claim is not moot.\n\n3. UNICOR's Practice\n\nAs UNICOR enforces its mandatory source of supply on an ad hoc basis, see (J.A., 1225), we afford a pale of deference to its statutory and regulatory interpretations only to the extent they are reasonable. See Washington State Dept. of Social and Health Servs., 537 U.S. at 385. Notwithstanding the district court's conclusion as to standing, it went on to find UNICOR's practice reasonable, opining\n\nCongress has declared that federal agencies are required to purchase FPI products unless they procure a waiver from FPI. As Defendants and common sense demonstrate, the actual purchaser is not the contractor, but the federal agency for whom the contractor is constructing a facility. To allow a federal agency to escape the legal requirement of obtaining a waiver or purchasing furniture from FPI simply by purchasing furniture produced in the private sector using a subcontractor as a middle-man would subvert the will of Congress. Moreover, when FPI engages in this practice, it is not selling goods to the private sector because title for those goods passes directly to the federal agency for whom the facility is being constructed. Therefore, FPI's practice of requiring private contractors to purchase FPI furniture as part of a turn-key facility construction does not violate FPI's governing statutes.\n\n154 F. Supp. 2d at 1155-56.\n\nThe district court's straightforward response to the issue at bar is directly on target. The plain language of section 4122(a) prohibits sales \"to the public,\" but only \"in competition with private enterprise.\" 18 U.S.C. § 4122 (a). As discussed in the context of the Coalition's takings claim, the public competes for the federal Office Furniture market only to the extent UNICOR is not a mandatory source of supply. Therefore, a sale to a private sector contractor as a means to enforce its statutory and regulatory mandatory source of supply for federal agencies and departments necessarily falls within UNICOR's authority. As the district court definitively stated, \"common sense\" demonstrates that the actual purchaser in this context is the federal agency or department.\n\nThe Court recognizes the potential for abuse with UNICOR's practice, although no actual improprieties have been demonstrated in case sub judice. The Coalition's remedy rests not with the courts, but with the legislature.\n\nVIII. CONCLUSION\n\nFor the foregoing reasons, we AFFIRM the order of the district court, except those provisions concerning Count VIII of the complaint (the \"Pass-Through Furniture\" claim). With respect to Count VIII, we REMAND the matter to the district court with instructions to VACATE its decision consistent with our Opinion.\n\n\u003cspan class=\"fn\"\u003e1. The Honorable Peter C. Economus, United States District Judge for the Northern District of Ohio, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Herman Miller, Inc. (\"Herman Miller\"), Haworth, Inc. (\"Haworth\"), and Knoll, Inc. (\"Knoll\"). For ease of reference, the term \"Coalition\" as used throughout this Opinion shall refer collectively to CGP and the individual appellants-plaintiffs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. \"UNICOR\" is the commercial or \"trade\" name of Federal Prison Industries, Inc. See 29 C.F.R. § 345.11(a) (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The district court also awarded summary judgment to the appellees-defendants, Steve B. Schwalb (\"Schwalb\"), and the United States Attorney General. Schwalb is UNICOR's Assistant Director and Chief Operating Officer charged with supervising UNICOR's day-to-day operations. The Coalition brought suit against Schwalb in his official capacity. It is well-settled that \"[a] suit against a public employee in his or her official capacity is a suit against the agency itself.\" Mitchell v. Chapman, 343 F.3d 811, 822 (6th Cir. 2003). Accordingly, the Coalition's claims against Schwalb are actually claims against UNICOR. Similarly, the Coalition's official-capacity claims asserted against the Attorney General are claims against the United States.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. All references to the term \"section\" are to that of title 18 of the United States Code, unless otherwise noted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Stephen P. Garvey, Freeing Prisoners' Labor, 50 Stan. L. Rev. 339, 342 (1998). Prof. Garvey's article presents an insightful analysis of inmate labor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See id. at 340-70.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. State operated inmate-labor programs generally fell within four classifications -- lease, contract, piece-price, and state-use. See generally The Oxford History of the Prison: The Practice of Punishment in Western Society (Norval Morris et al. eds., 1997); David J. Rothman, The Discovery of the Asylum 82-85 (1971). The lease system placed inmates under the control of private-sector enterprises that compensated the state for the prisoners' services. Id. Under the contract-system, the private-sector contracted with the state for labor on a daily basis, provided the prison with materials and supervisors, and ultimately distributed the finished product. Id. However, the state retained control and custody of inmate laborers. Id. The piece-price system was a hybrid of the contract system, in that employers paid a stipulated price for each finished good rather than paying daily wages. Id. The fourth -- the state-use system -- enabled the state to control the manufacture of products that, in turn, were purchased by government agencies. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Hawes-Cooper Act, ch. 79, 45 Stat. 1084, divested inmate-manufactured goods of their interstate character thereby subjecting such goods to strict state regulation. See Hawes-Cooper Act, ch. 79, 45 Stat. 1084 (1929). The Ashurst-Sumners Act, ch. 412, 49 Stat. 494, enacted by Congress in 1935, made it a federal crime to knowingly transport inmate-manufactured goods into a state that prohibited their sale. See Ashurst-Sumners Act, ch. 412, 49 Stat. 494 (1935). Congress passed the Walsh-Healey Act, ch. 881, 49 Stat. 2036, in 1937, that prevented the contracting out of inmate labor for use in federal government contracts. See Walsh-Healey Act, ch. 881, § 1(d), 49 Stat. 2036, 2037 (1937) (codified as amended at 41 U.S.C. §§ 35-45). Furthermore, Congress amended the Ashurst-Sumners Act in 1940 to federally proscribe the interstate transportation and sale of inmate-made goods irrespective of state law. See Act of Oct. 14, 1940, ch. 872, 54 Stat. 1132 (codified as amended at 18 U.S.C. §§ 1761-1762).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The President was \"to transfer to [UNICOR] the duty of determining in what manner and to what extent industrial operations shall be carried on in the Federal penal and correctional institutions,\" as well as to transfer \"any part or all of the other powers or duties [then] vested in the Attorney General\" relating to inmate labor. Act of June 23, 1934, ch. 736 § 3, 48 Stat. at 1211.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Section 744 of the 1940 edition of the United States Code was the first codification of the Executive Order. See 18 U.S.C. § 744 (1940). See also Garza v. Miller, 688 F.2d 480, 485 (7th Cir. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Eightieth Congress's 1948 revision of the federal criminal code is the statutory forerunner of UNICOR's organic statute. See Act of June 25, 1948, Pub. L. No. 80-722, 62 Stat. at 851.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Congress expanded the board in 1948 to include a representative from the Secretary of Defense. See Act of June 29, 1948, Pub. Law. No. 821, § 3, 62 Stat. 1100, 1100.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Congress did not divide the 1948 version of section 4122 into subsections. With minor modification, the current versions of section 4122 (a) and (b)(1) are identical to the 1948 version of 4122. Compare Act of June 25, 1948, Pub. L. No. 80-722, 62 Stat. at 851 with 18 U.S.C. § 4122 (a), (b)(1). Subsections (c), (d) and (e) to the current version of section 4122 were enacted as part of the 1948-1949 amendments addressing inmates held by the Department of Defense and the Commissioner of the District of Columbia. See Act of June 29, 1948, ch. 719 §§ 1-2, 62 Stat. 1100, 1100; Act of May 11, 1948, ch. 276, 62 Stat. 230. These subsections are immaterial to our analysis. The remaining subsections found in the current version of 4122 are discussed infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. During the 1988 amendment process discussed infra, Congress amended the earlier statute's reference from \"all physically fit inmates,\" to \"the greatest number of those inmates . . . who are eligible to work as is reasonably possible.\" Compare Act of June 25, 1948, Pub. L. No. 80-722, 62 Stat. at 851 with 18 U.S.C. § 4122 (b)(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. As with section 4122, Congress did not divide the 1948 version of section 4124 into subsections. With minor modification, the current versions of section 4124 (a) and (b) are identical to the former 4124. Compare Act of June 25, 1948, Pub. L. No. 80-722, 62 Stat. at 851 with 18 U.S.C. § 4124 (a), (b). Added in 1990, subsection (c) of the current section 4124 prescribes the manner in which Federal agencies and departments must report purchases of UNICOR's products, see 18 U.S.C. § 4124 (c), while subsection (d) requires UNICOR to publish a catalog of its products, see 18 U.S.C. § 4124 (d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The 1948 version of section 4124 provided that the dispute resolution board was to be comprised of the \"Comptroller General of the United States, the Director of the Bureau of Federal Supply, Department of Treasury, and the Director of the Bureau of the Budget, or their representatives.\" See Act of June 25, 1948, Pub. L. No. 80-722, 62 Stat. at 851. The section has been amended over the years to account for changes within federal departments and agencies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See Alfred Blumstein \u0026 Allen J. Beck, Population Growth in U.S. Prisons, 1980-1996, 26 Prisons: Crime and Justice -- A review of Research 17 (1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. We limit our analysis to the provisions of the organic statute pertaining to \"significant expansion,\" as those are the issues raised by the parties to the instant appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Congress required that the Comprehensive Impact Study provide, at the minimum, information regarding: (i) the number of vendors currently meeting the requirements of the Federal Government for the product; (ii) the proportion of the Federal Government market for the product currently served by small businesses, small disadvantaged businesses, or businesses operating in labor surplus areas; (iii) the size of the Federal Government and non-Federal Government markets for the product; (iv) the projected growth in the Federal Government demand for the product; and (v) the projected ability of the Federal Government market to sustain both Federal Prison Industries and private vendors. See Anti-Drug Abuse Act of 1988, 100 Pub. L. No. 690, § 7096, 102 Stat. at 4414 (codified at 18 U.S.C. § 4122(b)(4)(A)(i)-(v)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See Blumstein \u0026 Beck, supra at 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The three instances were, as follows: (1) when FCI Sheridan began manufacturing D \u0026 Q furniture in 1991; (2) when production increased between 1991 and 1992; and (3) when production increased in 1993. See (J.A., 1334-1339).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The term \"Office Furniture\" refers to the class of goods at issue in this appeal. Included in Office Furniture are three sub-classes of goods: (1) systems furniture; (2) office seating furniture; and (3) office case goods. Systems furniture are products that typically fit or attach together to form multiple workstations such as panel systems, desking systems, as well as filing, storage, and shelving components. See (J.A., 1476 ¶ 1). Office seating furniture are products such as office chairs, task chairs, stools, sofas, and modular seating. See (J.A., 1477 ¶ 2). Office case goods are products typically associated with an individual user and include desks, credenzas, corner unit work surfaces, desk extensions, and storage units. See (J.A., 1477 ¶ 3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. UNICOR determined that its systems furniture operations employed 940 inmates in 1995. See (J.A., 225). UNICOR's preliminary projections revealed that the proposed expansion required an additional 810 employees. See (J.A., 225).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. UNICOR proposed to close its system furniture factory at FPC Duluth and transfer those 107 inmate jobs to a newly constructed factory at FCC Coleman. See (J.A., 225). It estimated that the factory at FCC Coleman would employ 600 inmates. See (J.A., 225).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In preparation for the hearing, UNICOR issued a final version of the Systems Impact Study in October, 1995 (the \"Final Systems Impact Study\") that, inter alia, incorporated and addressed the comments submitted by the private-sector. See (J.A., 287-335); see also (J.A., 270-86).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. BPIA is a trade association representing 175 office furniture manufacturers and 625 office furniture dealers. See (J.A., 372).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. BIFMA is a nonprofit trade association consisting of over 250 manufacturers of business, office and institutional furniture and their suppliers. See (J.A., 583).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. UNICOR determined that its office seating furniture processes employed 790 inmates in 1995. See (J.A., 496). UNICOR's preliminary projections revealed that the proposed expansion required an additional 600-800 employees. See (J.A., 496).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. UNICOR estimated that the Office Seating Expansion required the activation of factories at FCI Beckley, FCI Edgefield, and FCI Victorville. See (J.A., 496).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The chart indicated that UNICOR had an estimated 10.06% market share in 1990 and an expected market share of 8.86% in 1991. See (J.A., 514).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. UNICOR estimated that the Office Case Goods Expansion would employ an additional 500-750 inmates and require the activation of factories at Forrest City, AR, a high security prison in the mid-Atlantic region, as well as at a future site. See (J.A., 703).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The Board indicated that UNICOR estimated the size of the Federal office case goods market at $221.3 million, whereas the private industry estimate projected a market of $169.4 million. See (J. A., 893).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. \"Pass through\" furniture was furniture sold by UNICOR that was manufactured by non-prisoners. UNICOR acknowledged its use of \"pass through\" furniture in rare circumstances where it accepted an order and was unable to meet the federal agency's delivery requirements because of \"fires, inmate, lockdowns, work stoppages, adverse weather including fog, tooling problems within an internal factory, or as a result of a customer accelerated due date.\" (J.A., 1070.) In such cases, UNICOR purchased the product from a private sector manufacturer with whom it had a prior contractual relationship, and then re-sold the product to the federal agency. See (J.A., 1117).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Section 702 of the APA provides, in pertinent part: A person suffering legal wrong because of agency action, or adversely affected or aggrieved by agency action within the meaning of a relevant statute, is entitled to judicial review thereof. An action in a court of the United States seeking relief other than money damages and stating a claim that an agency or an officer or employee thereof acted or failed to act in an official capacity or under color of legal authority shall not be dismissed nor relief therein be denied on the ground that it is against the United States or that the United States is an indispensable party. 5 U.S.C. § 702.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The Coalition's facial challenge to the Guidelines (Count VI) also shares common issues of fact and law with the significant expansion claims. The district court determined, however, that UNICOR's promulgation of new guidelines in 1997 effectively mooted Count VI. See 154 F. Supp. 2d at 1152. Cf. Product Development and Production: Public Involvement Procedures, 62 Fed. Reg. 11465 (Mar. 12, 1997). The Coalition does not appeal this determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. CVA is a non-profit trade association incorporated in Washington, D.C. that represents over twenty-five vendors who sell products to UNICOR. More than half of CVA's members provide UNICOR with components used in the manufacture of Office Furniture.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. For example, the complaint requested \"injunctive relief to stop FPI from continuing its violation of the Constitution, the APA, FPI's organic statute, and its own regulations, and directing FPI to return to the competitive market sales equal to in excess of $450 million, the amount inappropriately taken.\" (J.A., 27-28.) Similarly, the Coalition requested in its motion for summary judgment that the \"[c]court, at this time, order FPI to reduce its planned Office Furniture sales volume, from FY 2002 through FY 2004 or any other period the [c]court deems reasonable, that FPI Office Furniture sales in FY 1990 through FY 1995 exceeded the appropriate FY 1989 levels.\" (J.A., 1474.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In any event, the Coalition requested that the district court grant \"any other such relief as necessary to establish a status quo in Federal Office Furniture sales and ensure that FPI no longer engages in illegal practices.\" (J.A., 1411.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The Court unanimously agreed in the aspects of Justice Thomas's majority decision delineating the issue exhaustion doctrine. See Sims, 530 U.S. at 115-16 (Breyer, J., dissenting) (\"[The majority] points out that the ordinary waiver rule as applied to administrative agencies ‘is an analogy to the rule that appellate court will not consider arguments not raised before trial courts.' And the plurality argues that the agency proceedings here at issue, unlike those before trial courts, are not adversarial proceedings. Although I agree with both propositions, I do not see how they lead to the plurality's conclusions.\") (Citations omitted). The Court reached different conclusions in the application of the doctrine to Social Security proceedings at issue. Compare Sims, 530 U.S. at 113 (O'Connor, J., concurring) (\"I write separately because, in my view, the agency's failure to notify claimants of an issue exhaustion requirement in this context is a sufficient basis for our decision.\") with 530 U.S. at 118-19 (Breyer, J., dissenting) (\"The Social Security Administration says that it does not apply its waiver rule where the claimant is not represented. And I cannot say it is ‘arbitrary capricious, or an abuse of discretion,' to apply the waiver rule when a claimant was represented before the Appeals Council, as was petitioner, by an attorney.\") (Citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. This fact led Justice O'Connor to conclude that the Appeals Council discouraged parties from providing reasons and proceeded without them. See Sims, 530 U.S. at 113-14 (O'Connor, J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The \"Notice to Appear\" provided notice to the non-citizen of the charges asserted and was served in accordance with applicable rules. See Detroit Free Press, 303 F.3d at 698 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The defendant raised the laches defense in their Answer and fully briefed the issue on summary judgment. See (J.A., 160, 940-47). The district court did not address the issue given its finding with respect to issue exhaustion. See 154 F. Supp. 2d at 1151. We may consider, however, this issue as part of our de novo review. See Abercrombie \u0026 Fitch Stores, Inc. v. Am. Eagle Outfitters, Inc., 280 F.3d 619, 629 (6th Cir. 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The defendants argued before the district court that claims arising before November 24, 1993 were barred as a matter of law. See (J.A., 945). The defendants have abandoned the argument on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Notwithstanding its holding in regard to issue exhaustion, the district court went on to consider the substantive allegations of the unauthorized significant expansion claims. See 154 F. Supp. 2d at 1147-51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. UNICOR's FY 1994 Operating Plan indicated an expected June,1995 \"Activation Date\" for the systems furniture factory at FCC Coleman. See (J.A., 902-03). The 1995 Operating Plan indicated a December, 1995 Activation Date. See (J.A., 905-11). The Systems Impact Study discussed in detail the transfer of equipment from the Duluth systems furniture factory to the new factory at FCC Coleman, to be opened in 1996. See (J.A., 225).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. UNICOR ceased production at the Texarkana factory and reduced production at its factories in Bastrop, Marianna and Three Rivers. See (J.A., 512).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The Bastrop and Florence factories produced approximately $3 million in aggregates sales in 1993 and approximately $12 million in aggregate sales in 1994. See (J.A., 512). UNICOR decreased production in 1993 at its Allenwood, La Tuna, Sheridan, Tallahassee and Three Rivers office seating factories by an aggregated $4.9 million in sales. See (J.A., 512). UNICOR continued to decrease production at those five factories in 1994, as well as decreased production at its Ashland, Marianna, and Texarkana factories, for a combined decrease of $14 million in sales. See (J.A., 512).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. In any event, UNICOR actually decreased by 110 the number of employees employed in the production of office seating during 1993. See (J.A., 1106 ¶ 77).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The White Paper indicated: \"[I]n most instances, the factories produced other lines in addition to D \u0026 Q. As a result, the same production space used to manufacture D \u0026 Q furniture was also used to produce FPI's Centurion office furniture line or FPI's metal racking and shelving, depending on the factory.\" (J.A., 1335.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Inmate employment in office seating production increased from 739 employees in 1991 to a high of 888 during 1992. See (J.A., 1105-06 17 74,77). Additionally, the \"spike\" in the number of inmates producing office case goods was the result of abnormally low levels of employment in 1991. See 154 F. Supp. 2d at 1148-49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The federal systems market declined from a record high of $452.2 million in 1993 to $433.6 in 1994. See (J.A., 208). Meanwhile, UNICOR's production decreased from $52,601,756 in sales in 1993 to $41,424,737 in 1994. See (J.A., 1100 1126, 28).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. We pause to note that the prejudicial error rule of the APA is inapplicable to UNICOR and the Board's violation of section 4122. As the United States Court of Appeals for the Second Circuit recently observed, \"The rule of prejudicial error informs our review of an agency's adherence to its statute and regulations; it has never been used to introduce discretion into actions made mandatory by Congress.\" Whitman, 321 F.3d at 334.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. As discussed during our analysis of the mootness question supra, the Coalition requested the equitable volume sales replacement remedy and declaratory relief in relation to the retroactive authorization claims. With respect to declaratory relief, it is acknowledged that UNICOR and the Board violated section 4122 by not initiating the CARP prior to the 1992 significant expansion in office seating. However, for the reasons discussed supra, the request for declaratory relief is moot. We further conclude that the retroactive authorization claim does not fall within the well-defined \"capable of repetition, yet evading review\" exception to the mootness doctrine. See Suster v. Marshall, 149 F.3d 523, 527 (6th Cir. 1998). This exception applies where \"(1) the challenged action [is] in its duration too short to be fully litigated prior to cessation or expiration, and (2) there [is] a reasonable expectation that the same complaining party [will] be subject to the same action again.\" Spencer v. Kemna, 523 U.S. 1, 17 (1998) (quotation omitted). Retroactive decision-making necessarily is too short in duration \"to be fully litigated prior to cessation.\" Id. However, the underlying facts of this appeal do not support the conclusion that the Coalition will likely be subject to this same action again. Our analysis focuses, therefore, on the equitable volume sale replacement remedy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. We clarify that the Coalition did not waive its request for relief by failing to present such evidence to the Board. The omission of such evidence in 1996, however, is relevant to the issue as to whether there is sufficient evidence for us to award the equitable volumes sales replacement remedy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Before the district court, the Coalition relied on 5 U.S.C. 557(d)(1) as the basis for its ex parte argument. Section 557(d)(1) is a broad provision that prohibits any ex parte communications relevant to the merits of an agency proceeding between \"any member of the body comprising the agency\" or any agency employee who \"is or may reasonably be expected to be involved in the decisional process\" and any \"interested person outside the agency.\" 5 U.S.C. § 557(d)(1)(A)-(B). The purpose of the ex parte communications prohibition is to ensure that \"agency decisions required to be made on a public record are not influenced by private, off-the-record communications from those personally interested in the outcome.\" Raz Inland Navigation Co. v. Interstate Commerce Comm'n, 625 F.2d 258, 260 (9th Cir. 1980) (quotation omitted). However, it applies to only communication with persons \"outside of the agency\"; therefore, it is patently inapplicable to the case at bar.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. An exception to the \"presumption of Tucker Act availability\" exists where the challenged regulation requires a \"direct transfer of funds mandated by the Government.\" Eastern Enter., 524 U.S. at 521. In such an instance, the aggrieved party may seek immediate equitable relief in the district court. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The NAFI is triggered by the fact that judgments rendered by the Court of Federal Claims \"shall be paid out of any general appropriation.\" 28 U.S.C. § 2517. [The Court of Federal Claims']Tucker Act jurisdiction may not be invoked with respect to transactions that \"involve agencies where the statutory authority for the activities [in suit] specifically limited liability or expenditures to non appropriated funds.\" In other words, the existence of the court's jurisdiction under the Tucker Act must be confined to cases in which appropriated funds can be obligated. Furash \u0026 Co. v. United States, 46 Fed. Cl. 518, 520 (2000), aff'd, 252 F.3d 1336 (Fed. Cir. 2001) (quoting L'Enfant Plaza Prop., Inc. v. United States, 668 F.2d 1211, 1212 (Cl. Ct. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. If UNICOR denies the request, the agency or department may appeal the decision through UNICOR's Ombudsman. See 48 C.F.R. §8.605; (J.A., 165). In the event this appeal is denied, the federal agency or department may appeal to decision to the dispute resolution board pursuant to section 4124(b). See also 48 C.F.R. § 8.605(c); (J.A., 165).\u003c/span\u003e\n\n",
    "body_length": 163575,
    "citedas": [
      "365 F.3d 435",
      "2004 Fed.App. 0101P"
    ],
    "attorneys": "Counsel Argued: Stephen M. Ryan, Manatt, Phelps \u0026 Phillips, Washington, D.C.,for Appellants. Charles R. Gross, United States Attorney, Grand Rapids, Michigan, forAppellees. ON Brief: Stephen M. Ryan, Michael T. Brown, Manatt, Phelps \u0026 Phillips,Washington, D.C., for Appellants. Charles R. Gross, United States Attorney, Grand Rapids, Michigan, forAppellees. David T. Ralston, Jr., Hopkins \u0026 Sutter, Washington, D.C., Philip A.Nacke, Foley \u0026 Lardner, Washington, D.C., for Amicus Curiae.",
    "category": [
      "124",
      "251",
      "75"
    ],
    "judges": "Before: Gilman and Gibbons, Circuit Judges; Economus, DistrictJudge.*fn1",
    "citation_count": 104
  }
}
