{
  "id": "IMwlYWYBTlTomsSBTKkV",
  "document": {
    "title": "12/22/87 STATE UTAH v. ELROY TILLMAN",
    "full_title": "STATE OF UTAH AND v. ELROY TILLMAN AND",
    "jurisdiction": "Utah Supreme Court",
    "date": "1987-12-22T00:00:00.000Z",
    "docket": "No. 19000",
    "body": "FACTS. - Tillman and his girlfriend entered victim's apartment, killed him, and started a fire. They then left and disposed of the evidence.\n\nPROCEEDINGS. - Girlfriend turned state's evidence, and Tillman ws convicted of first degree murder. He appealed.\n\nRESULT. - Affirmed. Stewart partly concurred and partly concurred in the result. Howe partly concurred and partly concurred in the result. Durham \u0026 Zimmerman partly concurred and partly Dissented.\n\nHELD. - Standard of review in death cases. Prosecutor's comments were not prejudicial error. Exclusion of polygraph results was not prejudicial error. Past convictions were properly considered as aggravating circumstances. Reasonable doubt instruction did not shift burden of proof. Use of voter registration list not shown to systematically underrepresent Hispanics on the jury.\n\nHALL, Chief Justice\n\nAfter a trial before a jury, defendant was convicted of first degree murder in violation of Utah Code Ann. § 76-5-202 (1978) (amended 1983, 1984 \u0026 1985) and sentenced to death. On appeal, he raises ten points of error.\n\nI. FACTS\n\nOn May 26, 1982, Mark Schoenfeld was found dead in his smoke-filled apartment. He was lying on a smoldering bed, and his body was badly burned. Experts determined that the fire had been deliberately started and that its point of origin was the victim's mattress. Although the victim had received several severe blows to the head, the primary cause of death was asphyxiation. The evidence indicated, however, that the blows to the victim's head could have produced fatal brain damage independent of the fire.\n\nDefendant's former girlfriend, Lori Groneman, had been dating the victim at the time of his death. Groneman had been with the victim earlier in the evening on the night he was killed. On the basis of information provided by Groneman, defendant was arrested by the police.\n\nAt trial, Groneman testified that she had known defendant for over five years and that after breaking off their relationship in January 1982, she had repeatedly received threatening phone calls from defendant and a female caller who did not identify herself. Groneman also said that defendant had followed her and the victim on at least three occasions and that defendant had further harassed and threatened her.\n\nCarla Sagers, defendant's girlfriend at the time of the murder, was picked up by the police a few days after the murder. Although she originally confirmed the alibi defendant had given the police, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Sagers later recanted her statement and became the State's key witness, for which she was granted immunity from prosecution. Apparently, Sagers recanted her initial statement after the police confronted her with the fact that Groneman had identified Sagers' voice as that of the female who had made the threatening calls.\n\nSagers testified at trial that she had been romantically involved with defendant and that she had made the calls to Groneman at his request. Sagers also testified that in March 1982, defendant began to talk about killing Groneman, but later decided to kill the victim instead. Sagers described how, at various times before the murder, defendant discussed a number of alternative means of killing the victim, including poisoning him or using a bomb. At defendant's request, Sagers purchased two handguns. Sagers also helped locate the victim's address and learn the physical layout of the victim's home. In March 1982, defendant and Sagers went to the victim's house to shoot him, but did not commit the crime.\n\nOn the night of May 25, however, defendant and Sagers again went to the victim's home intending to kill him. Both defendant and Sagers entered the house and sat in the dark near the victim's front door. After waiting for what Sagers estimated to be about an hour, defendant crept to the victim's bedroom door, slowly opened it, and after finding that it was too dark to see, went to the kitchen and briefly turned on a light. Defendant then went back to the bedroom and crawled inside. Once in the bedroom, defendant whispered for Sagers to again turn on the kitchen light. Then defendant hit the victim several times in the head with an ax. While the victim was still alive and after Sagers suggested that they start a fire to cover up the homicide, defendant ignited the victim's mattress and scattered cigarette butts around the room to create the impression that the fire had been caused by a burning cigarette. Defendant and Sagers then left the house and disposed of the evidence used in the crime: a towel (which was used to wipe blood off the wall) and an article of clothing (which had been placed over the victim's head) were burned; the ax was thrown into a river; and defendant's gloves were discarded. The two then returned to defendant's apartment.\n\nDuring the course of the homicide investigation, Sagers directed the police to the places where the evidence had been disposed of, and the police recovered the gloves, the burned towel, and the burned piece of clothing. The ax was never recovered.\n\nDefendant was tried and convicted of first degree murder and sentenced to death.\n\nII. SCOPE OF APPELLATE REVIEW IN DEATH PENALTY CASES\n\nThe State responds to a number of defendant's claims of reversible error by urging this Court not to consider or rule on such claims because they were inadequately preserved at trial. We decline to adopt that approach and instruct the State to hereafter brief all issues on their merits in death penalty cases.\n\nA general rule of appellate review in criminal cases in Utah is that a contemporaneous objection or some form of specific preservation of claims of error must be made a part of the trial court record before an appellate court will review such claim on appeal. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e As early as 1931, however, this Court recognized an exception to the general rule governing the scope of appellate review in criminal cases where the death penalty was imposed. In State v. Stenback, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e this Court reviewed errors not objected to at trial but complained of on appeal. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Similarly, in State v. Cobo, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e this Court noticed an error assigned on appeal which counsel for the defendant had failed to take exception to at trial. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e While this Court continues to review such cases pursuant to Utah Code Ann. § 76-3-206(2) (1978) \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and § 76-3-207(4) (Supp. 1987), \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e we do not abrogate a defendant's obligation or assume the role of an advocate by searching the entire record for each and every indication of possible or potential error. To do so would result in an impossible and inappropriate burden on this Court. Nevertheless, because of the serious and permanent nature of the penalty imposed in such cases, there needs to continue to be a death penalty exception to the contemporaneous objection rule. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Accordingly, this Court has customarily considered assignments of error which were not preserved at trial but were raised for the first time on appeal.\n\nIn this regard, we have in the last several years discussed the death penalty appellate scope of review in four decisions: State v. Pierre, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e State v. Codianna, \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e State v. Wood, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and State v. Norton. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Therein, while this Court did not assume the responsibility of reviewing the entire record searching for nonassigned error, we considered, reviewed, and analyzed arguments raised for the first time on appeal. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAlso, in Wood, this Court stated: \"On direct appeal in capital cases, it is the established rule that this Court will review an error, even though no proper objection was made at trial and even though the error was not raised on appeal, if the error was manifest and prejudicial.\" \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Neither Wood nor its progenitors support the contention that this Court will review the entire record for error, whether or not preserved at trial or assigned on appeal. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Rather, they uphold the correct and well-established proposition that, notwithstanding our rule in death penalty cases that we review all errors raised on appeal (whether or not objected to at trial or initially assigned as error), \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e we have the sua sponte prerogative in such cases to notice, consider, and correct manifest and prejudicial error which is not objected to at trial or assigned on appeal, but is palpably apparent on the face of the record. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Not only is such standard in keeping with controlling statutory and case law, but it also furthers the policy of safeguarding a defendant's right to a fair trial in a death penalty case by permitting review of the proceedings below even in the absence of compliance with procedural technicalities.\n\nTherefore, pursuant to the above analysis and rationale, this Court continues to uphold the established rule in death penalty cases as follows: This Court will review errors raised on appeal in death penalty cases, even though no proper objection was made at trial, but will reverse a conviction based upon such errors only if they meet the manifest and prejudicial error standard. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e In addition, this Court has the power to notice manifest (\"palpable\") error apparent in the record and correct a conviction based upon the same if the error is prejudicial, even though such error is not objected to at trial or assigned on appeal. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e This formulation best supports the past practices of this Court, as well as our continuing responsibility to insure that the sentence of death meets the concerns of Furman v. Georgia. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIII. PROSECUTOR'S COMMENTS\n\nDuring both the guilt and penalty phases of the trial, the prosecutor made comments which defendant failed to make contemporaneous objections to the prosecutor's allegedly improper comments, we have reviewed the record and determined that the comments do not warrant reversal of defendant's conviction and sentence.\n\nA. Comment on Defendant's Failure to Testify\n\nDefendant claims the prosecutor indirectly commented on his failure to testify at trial and suggested to the jury that defendant's silence implied guilt. First, defendant relies on comments made by the prosecutor in his summation to the jury during the guilt phase of trial. In discussing Sager's credibility and the defense theory that she was responsible for the murder, the prosecutor stated:\n\nNow, you saw Carla Sagers sit on the stand. Did you see anything about her or any evidence revealed about her that could show you that Carla Sagers, on her own, could take an ax or a hatchet... and beat to death a guy like Mark Schoenfeld in the fashion you have seen done between one and five times, crushing his skull, spraying blood on the walls, apparently on clothing, and then wrap up all the bloody shirts and stuff and set fire on the bed on her own and walk out? There has been no evidence to show that she has that kind of mentality....\n\nYou can rest assured of one thing, Carla Sagers didn't have the guts to get our of [the relationship with defendant] if Lori Groneman didn't. And Lori Groneman said on cross-examination..., \"I was scared to death of Elroy Tillman,\" and she's assertive. What do you think Carla Sagers was doing, or how she was feeling? And even after she's caught, even after extensive interrogation by myself... and others, she still doesn't say anything derogatory about Elroy or try to cast blame on him or call him names or anything else. Even though you may say to yourselves, \"Carla Sagers isn't any better than Elroy Tillman,\" she did have a heart and she did tell the truth and she didn't demand immunity, she didn't demand an attorney or all the other things indicative of guilt. She told Chapman what had happened. Even tried to protect him. She told Steve Chapman what had happened.\n\nNow remember this is two days after Elroy Tillman has already told Officer Chapman his alibi. What does he say about Carla Sagers when he's first talked to by Steve Chapman, and when I say \"he,\" i am referring to Elroy Tillman, When he's asked if he knows a girl named Carla, he says, \"Oh, yes, I sort of know a girl named Carla Sagers,\" and he spells it S-a-y-e-r-s. Now, a person who has gone with somebody for two years, taken them places... is either very dumb not to know how to spell the name or very cunning in not trying to give police officers a lead to Carla.\n\nAdditionally, during a Discussion of how it was possible for defendant to persuade Sagers to help him with the murder, the prosecutor commented:\n\nSome of us are fortunate enough no to meet a person who is capable of manipulating us for bad. Others of us are not so lucky and you have to pay that price and Carla Sagers, believe me, emotionally and otherwise, you could probably see her during the six and a half hours she was on the stand literally aging before you eyes and sometimes hell is worse than actually burning.\n\nYou have had a chance to look at Elroy Tillman during these proceedings. Detecting remorse? Detecting anything? You get a feel for people by what is said, what they do, how they react, and I hope you were paying attention to that as well. You can never make sense, ladies and gentlemen, out of this type of a crime unless you take it a step at a time. One little bit of involvement leads to another, leads to another. And in doing so human history is met.\n\nSecond, in response during the penalty phase to defense counsel's comments concerning Christianity, the Mosaic law, and religion in connection with the death penalty, the prosecutor noted:\n\nI am always, I suppose, repulsed by the contention that [defense counsel] raises of the fact that the system has failed. Well, you are part of the system, ladies and gentlemen. Those prior felony convictions are from jurors like yourselves who have had to sit tedius hour upon hour and listen to and sift through facts to arrive at those convictions. And there is not a system on the face of the Earth, including the Mosaic law or the law of Christianity, that will work unless the individual soul wishes it to work.\n\nIf that individual soul rebels against the most sacred of obligations, to protect human life, or chastity or the Ten Commandments, or all the other things that Elroy Tillman has broken along the way, no system in the world will work without the person himself humility - wise and with remorse saying, \"I want it to work,\" and you haven't heard Elroy Tillman say that.\n\nIn fact, if you have looked at Elroy Tillman you probably haven't seen one ounce of remorse other than to cast blame on the State's witnesses or the system or his being black or whatever else you want to characterize the blame as.\n\nDirect reference by a prosecutor to a defendant's decision not to testify is always a violation of the defendant's fifth amendment right against self-incrimination. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Indirect references to a defendant's failure to testify are constitutionally impermissible if the comments were manifestly intended to be or were of such a character that the jury would naturally and necessarily construe them to be a comment on the defendant's failure to testify. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAfter reviewing the initially cited remarks in context, it is clear that they were intended to bolster Sagers' credibility and were not intended to contrast her decision to testify with defendant's choice to remain silent. As to the remaining remarks, we believe the comments were intended to assess defendant's courtroom demeanor, particularly in relation to Sagers' demeanor while she was on the witness stand.\n\nMoreover, we do not believe that the comments would naturally and necessarily be construed by a juror as a comment on defendant's silence. However, assuming, arguendo, that the comments did constitute improper comment, the comments would not warrant reversal in this case.\n\nAssuming a petitioner has established that a prosecutor's comments constituted a constitutional violation, reversal is warranted only if the error was not harmless. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e \"n otherwise valid conviction should not be set aside if the reviewing court may confidently say, on the whole record, that the constitutional error was harmless beyond a reasonable doubt.\" \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIn the face of overwhelming evidence of defendant's guilt, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e together with the fact that the comments were isolated as opposed to extensive \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e and the fact that the trial Judge specifically instructed the jury \"that no presumption adverse to [defendant Tillman] is to arise from the mere fact that he does not place himself upon the witness stand,\" we do not hesitate in holding any error was harmless beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nB. Other Comments by the Prosecutor\n\nDefendant also complains that he was prejudiced by other statements made by the prosecutor. During closing argument following the guilt phase, the prosecutor remarked:\n\nAnd I consider it significant that the police from Bountiful [, Utah] who testified on the stand were getting between ten and fifteen reports of incidences daily from the Gronemans during 1982....\n\nDefendant points out that this comment is exaggerated and that the use of the phrase, \"I consider it significant,\" interjected the personal opinion of the prosecutor. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThis court has established a test to determine whether a prosecutor engaged in misconduct and whether that misconduct constitutes reversible error. A prosecutor's actions and remarks constitute misconduct that merits reversal if the actions or remarks call to the attention of the jurors matters they would not be justified in considering in determining their verdict and, under the circumstances of the particular case, the error is substantial and prejudicial such that there is a reasonable likelihood that in its absence, there would have been a more favorable result for the defendant. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Application of these principles to the prosecutor's comments convinces us that reversal is not warranted.\n\nAlthough the comment above exaggerated the facts, it concerned a point peripheral to the issue of defendant's guilt, and it would be impossible to identify it as unfairly prejudicing the jury with respect to the issue of defendant's guilt.\n\nAnother guilt phase comment that defendant asserts as prejudicial, placed in context, is as follows:\n\nI am not trying to tell you that I think Carla Sagers is a wonderful person. I think she's confused but she's not a killer and there has been nothing to refute what she said went on inside that house on May 25 and May 26. There has been nothing to rebut that. I kind of would like to wonder what would happen, for instance, if the Mormon Tabernacle Choir observed the whole killing, how would [defense counsel] attempt to discredit them? Think about that one. There's no better evidence, ladies and gentlemen, than eyewitness testimony, and we can't read people's minds. We don't know what they did or what they said or what they thought. The State isn't required by proof beyond a reasonable doubt to prove to you 100 percent of what went on. All we can do is submit to you facts and let you draw Conclusions from those facts, and I would certainly like to have a mind reader or the ability to mind read what goes on. But there is nothing whatsoever to refute the testimony of Carla Sagers and what occurred inside that house. And we know she was there because her identification and description of the crime fits. She wasn't taken back to the scene of the crime by Officer Chapman. She told what had happened and what had occurred....\n\n(Emphasis added.) The foregoing statement was made during the prosecutor's rebuttal of defense counsel's closing argument, in which a vigorous attack was made on Sagers' credibility. Although certainly unwise and hyperbolic, the remark cannot be construed as an attempt to inflame the jurors by appealing to their \"religious\" feelings.\n\nFinally, defendant claims that the following statements by the prosecutor in the penalty phase prejudiced his trial:\n\nAs I indicated to you in the guilt phase of this hearing, you have a responsibility as jurors to balance and weigh and to truthfully and candidly deliberate. You cannot do that out of fear or sympathy or capriciousness or throwing up of your hands attitude saying this is too heavy of a decision for me to make. If you are cowards and you must say to yourselves, \"The law has no meaning and we can randomly go about intentionally, knowingly killing people,[\"] and that is the signal that you will portray unless you find the appropriate sentence in this case and can live with it within your conscience knowing the risks associated with it, knowing the behavior and temperaments of Mr. Tillman, and your own common sense and experience and your past experience in this particular case.\n\nNow, I will have a chance to talk to you in brief rebuttal if I choose to do so. [Defense counsel] has a chance now to discuss with you the aspects of the sentence as he deems fit, and then you will have a chance to deliberate and you may say to yourselves, \"Well, it's easy for [the prosecutor] to say,\" but as he indicated to you in the first phase, you probably watched a man age, a 36-year-old man, in fact, I probably can't pass myself off as 36 like Elroy has done, but if I have conveyed to you any meaning other than the most serious and solemn of duties to present to you in this case, I apologize for that because it's a serious and solemn duty and I wouldn't be asking you for the penalty of death under any other circumstances or conditions than serious and solemn responsibilities and duties.\n\nDefendant claims that the above comments appealed to the passions of the jury and improperly interjected the prosecutor's personal appeal for the death penalty. Once again, we concede that the prosecutor resorted to unwise and unnecessary hyperbole in his comments, but we are unable to identify any prejudicial reference to improper factors for jury deliberation.\n\nWhile finding no reversible error in the above language, the ends of Justice are best served by prosecutors who confine their arguments in all criminal cases, and especially in death penalty cases, within the boundaries of scrupulous fairness. The State's obligation is to assure that Justice is done. That obligation does not include or authorize over-reaching, exaggeration, or any form of personalizing by the prosecutor in the deliberation process. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nIV. EXCLUSION OF POLYGRAPH RESULTS\n\nDefendant filed a motion in limine requesting that the results of the police department's polygraph examination of Sagers be admitted at trial. A separate request was made to admit the examination results during the penalty hearing. Both requests were denied, although the polygraph examiner was permitted to testify in the guilt phase about the content of his questions and Sagers' answers thereto, without indicating that the conversation was conducted pursuant to a polygraph examination. The testimony defendant claims was erroneously excluded involved the examiner's opinion that Sagers' responses about her degree of participation in the murder were deceptive. That opinion testimony was excluded at both the guilt and the penalty phases.\n\nAs support in arguing that such evidence should have been admitted, defendant cursorily submits for our review several \"policy considerations supporting admissibility.\" These include in part: defendant's constitutionally protected right of confrontation; his \"untrammeled right to produce exculpatory evidence\"; the policy of allowing \"wide latitude\" in cross-examination; law enforcement's widespread reliance upon polygraph evidence; the practice of basing prosecutorial discretion upon polygraph evidence; the irrevocable nature of the death penalty; and increased need in cases involving single eyewitness testimony. After extensive review of the record and defendant's arguments and contentions, our analysis of the evidence in the instant case persuades us that the trial court did not commit prejudicial error in excluding evidence of the polygraph test, the examination results, and the examiner's opinion.\n\nIn this regard, our case law has left open the question of whether polygraph test results may be admitted in the absence of a stipulation. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e While developments in the area of polygraph examinations may in the future progress to the point where polygraph tests should be held admissible irrespective of a stipulation, we have reviewed the record in the particular case and we do not find a sufficient foundation for assessing the reliability and probative value of the polygraph examination. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nMoreover, during the polygraph examination, the examiner employed by the Salt Lake City Police Department asked Sagers the following questions: (1) \"At the exact instant any of the blows [to the murder victim] were struck, were you holding the weapon?\"; and (2) \"Was the weapon ever in your possession when Mark was struck with it?\" Carla Sagers answered \"no\" to both of these questions. The examiner scored both responses as being deceptive, and two other licensed examiners also scored the responses as deceptive under a \"blind scoring\" system. The remainder of Sagers' responses during the examination, wherein she confirmed the same facts about the murder to which she testified at trial, were scored as being truthful. Therefore, at its strongest, the excluded testimony tended only to show that Carla Sagers may have been lying when she denied actually holding the ax or striking any of the blows, not that her testimony about defendant's acts was untrue. Thus, the testimony was not exculpatory as to defendant, but only potentially inculpatory as to Sagers.\n\nNotwithstanding the foregoing, defendant argues that the polygraph evidence would have had the effect of impeaching the credibility of Sagers as a witness, which would have been to his benefit since he argued at trial that she was lying about the murder. Because defendant was able to accomplish the same purpose through cross-examination of the polygraph examiner, albeit without reference to the polygraph test itself, exclusion of the proffered evidence does not constitute grounds for reversal. Indeed, it appears that there is no likelihood that the jury would have reached another Conclusion regarding defendant's guilt had it known that a polygraph examination showed Sagers to be deceptive about her participation in the murder. In this regard, the following testimony occurred during the guilt phase of the trial:\n\n[Question by defense counsel]: Would you, Officer, be so kind as to tell the jury and the Court the content of that conversation [with Sagers] as best you can recall, relating to your questions and her answers in response thereto?\n\n[Answer by police polygraph examiner]: The conversation regarded Carla's particular activities herself during the incident at Mark Schoenfeld's home. During that conversation at one point I told her that I did not believe her answers to my questions and told her that I believed she had in fact struck Mark and I made that accusation.\n\nQ.: Did she respond to that accusation?\n\nA.: Yes, she did.\n\nQ.: And what was her response?\n\nA.: Her response was, \"If you want me to say I hit him, I will.\"\n\nI then said, \"I don't want you to say that unless it's the truth. Tell me what happened.\"\n\nShe said, \"I will testify that I hit him if that's what you want.\"\n\nI then asked her, \"How many times did you hit him,\" and she responded, \"Twice.\"\n\nI then asked, \"Which side did you hit him?\"\n\nShe said, \"The left side.\"\n\nI then asked, \"Which side of the bed were you on?\"\n\nAnd she said, \"I don't recall.\"\n\nI then asked, \"Did Tillman hand you the weapon?\"\n\nHer response was, \"He must have.\"\n\nI then asked, \"Did Tillman tell you to hit Mark?\"\n\nHer response was, \"He must have.\"\n\nI then told her I didn't want to know what must have happened, I wanted to know what did happen. Her response was, \"I don't know why I am telling you this, it isn't true anyway. I didn't hit him.\"\n\nThat was the substance of that conversation.\n\nQ.: Did you have any further conversation with her?\n\nA.: Yes.\n\nQ.: Would you be able to recount that as best you can recall?\n\nA.: It was in regards to her location, her activities, what she did during the time that she and Tillman were at Mark's house.\n\nQ.: Was this in response to - to any question on your part?\n\nA.: Yes, it was.\n\nQ.: What was the question, if you can go through them and her answers?\n\nA.: On January 3rd the questions regarded her specific handling of the weapon, not where a point of the beginning of the evening , but having to do with her specific handling of the weapon herself.\n\nQ.: And her activities inside the house in that particular location?\n\nA.: Yes. At that specific location in the bedroom and after the event and just prior to.\n\nQ.: Was there any question and any answer from her in connection with whether or not she was in the room at the time of Mark Schoenfeld's death?\n\nA.: Yes, her response to me was that she had been in the room, in the bedroom but as to where it was at the exact time of death, there was no conversation regarding the time of death, but at the time blows were struck, that was the essence of the conversation.\n\nQ.: Had she indicated to you previously that she had not been in the room at the time the blows were struck?\n\nA.: Yes, she had told me previously she had not.\n\nThe witness also identified several other discrepancies in Sagers' statements at different times about the murder. Those statements concerned Sagers' presence in the victim's bedroom at the time the blows were struck, her possession of a weapon, and her knowledge of the location of the light switches in the victim's apartment. On cross-examination, the polygraph examiner also stated that there was never any indication from Sagers to the effect that defendant was not in the room at the time of the murder or that he was responsible for it. Additionally, the witness also testified that Sagers admitted to feeling responsible for the crime because she did not attempt to stop defendant or to turn him over to the police. Thus, the question of her own degree of culpability, the possibility that she was lying about her own participation, and the resulting implications as to her credibility generally were well developed for the jury's consideration. Also, Sagers' testimony concerning the circumstances surrounding the murder was corroborated by independent evidence. There was therefore no possibility that Sagers was fabricating her entire story; she clearly knew firsthand how the victim was killed. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe above rationale is also applicable to defendant's claims regarding exclusion of the polygraph evidence during the penalty phase. We agree that a defendant in a capital felony case is entitled under our present statute to present evidence as to \"any... fact in mitigation of the penalty.\" \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e However, as already noted, the polygraph evidence at issue entirely corroborated the extent and nature of defendant's participation in the crime, and the issues of Sagers' credibility and own degree of culpability had been well developed for the jury's deliberation and consideration. Thus, the evidence would have been of no use in mitigating the penalty. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Therefore, defendant's claims regarding failure to admit the polygraph evidence are without merit.\n\nV. DISCUSSION OF LIFE SENTENCE\n\nDefendant next assigns as reversible error the fact that the prosecutor suggested to the jury during the penalty phase that a life sentence, as opposed to the death penalty, would last only fifteen years. After careful review of the record, it is clear that prejudicial error did not occur in the sentencing proceeding. During defense counsel's closing argument, he stated:\n\n[Elroy Tillman] is 47 years old, ladies and gentlemen, he is not 30, and a life sentence, even in Utah which is relatively easy in the light sentence area, as I am informed to believe, is probably 15 or 20 years.\n\nThe Elroy Tillman you see today is not the Elroy Tillman that will be released from prison if he is released from prison and paroled again, which is highly unlikely in the event of his record at the end of 15 or 20 years. The man who is the threat about which [the prosecutor] has addressed to you so thoroughly is a 67-year-old man, not one of 47. His body won't be in the condition that it is now. He will have spent 15 or 20 years in confinement. He will be broken and old and incapable of causing damage to anyone.\n\nThus, it was defense counsel who first commented that in Utah, parole is a possibility under a life sentence and that based thereon defendant would probably spend fifteen to twenty years incarcerated under such a sentence.\n\nIn response to the above comments by defense counsel, the prosecutor stated:\n\nI am sure we're all, to some degree or other, scholars of the Bible, the Mosaic law, the law of Christianity and all the rest of the factors [defense counsel] brought out in his closing remarks to you. And if I might for a moment indulge in that, in discussing a little of the Mosaic law yourself, you recall as the chosen, as they were called, were traveling through the wilderness, they were much like Elroy Tillman. They didn't heed the many miraculous instances of being saved, they were rotten and it took them 40 years to purge their souls. Forty years, not fifteen years as a life imprisonment would mean...\n\nCan you honestly say to yourselves 15 years hence that a person showing the lack of remorse Mr. Tillman has shown is going to be a better person when he gets out or that he is not going to, as he said in the one statement to Lori Groneman, \"Don't you know I will kill you, bitch?\"\n\nDefendant contends that the prosecutor's comments to the jury were misleading and had the potential of improperly influencing its decision on the death penalty. While these remarks were arguably improper and prejudicial because the prosecutor misstated the law and made a representation of fact not supported by the evidence, \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e his comments, when placed within the context of his and defense counsel's entire arguments, fall within the ambit of permitted conduct.\n\nGenerally speaking, in argument to the jury, counsel for each side has considerable latitude and may discuss fully from their viewpoints the evidence and the inferences and deductions arising therefrom. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Defendant has not alleged and there is little evidence to support an argument that defense counsel's remarks (referring to the length of a life sentence) noted above were made in response to comments made by the prosecutor to the jury that its job was \"to make a risk assessment of Mr. Tillman in terms of his future life.\" In fact, defense counsel, in defendant's brief on appeal, admits that his comments opened the door to the prosecutor's remarks and were made in an attempt \"to demonstrate society's interests would be adequately served with a life sentence.\" \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nFurthermore, a careful review of the record in this case indicates that during closing argument, defense counsel saw fit to comment on the probable length of a life sentence. This prompted the prosecutor's comments urging the jury to make a thorough analysis of the facts and the man and particularly the possibility of future crimes which defendant could commit. Although it may have been unwise and hazardous for defense counsel to make comments concerning the length of a life sentence, he initially indicated to the jury that life sentence meant fifteen years, and in triggering rebuttal by the prosecutor, defense counsel may himself have invited error. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nIn this regard, we reemphasize this Court's past decisions wherein we stated that \"invited error\" is procedurally unjustified and viewed with disfavor, especially where ample opportunity has been afforded to avoid such a result. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Indeed, it is the rule that if improper statements are made by counsel during a trial, it is the duty of opposing counsel to register a contemporaneous objection thereto so that the court may make a correction by proper instruction and, if the offense is sufficiently prejudicial, declare a mistrial. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Instead, defense counsel in this case neither objected to the prosecutor's remarks nor moved on that basis for a mistrial. Fairness requires that it defendant objected to the prosecutor's argument, he, through his attorney, should have made such objection known at the earliest opportunity. A defendant should not be permitted to initiate an argument before a jury and make use of it, then wait until after the prosecutor has responded to it and complain it was improper on appeal. Otherwise, the possibility of invited error will become the general rule.\n\nInasmuch as defense counsel himself chose to initiate and argue these comments and failed to object to the prosecutor's response to the same, he should be deemed to have invited the error (if there was any) and waived any objection. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nNevertheless, when evaluating the possible prejudice to a defendant's case resulting from a prosecutor's comments, this Court assesses whether, absent the alleged prejudice, there is a reasonable likelihood of a more favorable result for the defendant. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e In doing so in the instant action, it is sufficient to say, without belaboring the semantic differences between the arguments of the prosecutor and defense counsel, that the prosecutor's rebuttal was in direct reply to the theory advanced by defense counsel in his final argument. We fail to see how the prosecutor's statement (that a sentence of fifteen years was insufficient to render defendant safe for release) was prejudicial given the fact that defense counsel had already stated to the jury the probable length of a life sentence. Nor was it improper for the prosecutor to remark about the risks attendant upon allowing defendant to live. This, too, was within the permissible bounds of closing argument. \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nFinally, instructions 5 and 12 given to this jury at the guilt stage had already provided the admonition that it was to be governed solely by the evidence introduced in the trial and the law as stated to it by the Judge and that it should neither consider nor be influenced by an statements or counsel as to what the evidence was, unless it was stated correctly nor by any statements of counsel of facts not shown in evidence. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nTherefore, in light of the above, the trial court correctly determined that the remarks did not improperly influence the verdict, and from the record there appears to be no abuse of discretion and substantial Justice appears to have been done. Accordingly, we hold that defendant's claimed errors are without merit and affirm his conviction on this ground.\n\nVI. DISPROPORTIONALITY OF SENTENCE\n\nDefendant's next point on appeal is that his sentence of death is disproportionate to the crime committed, the immunity granted his accomplice, and the sentences meted out in other first degree murder cases. We disagree.\n\nUtah Code Ann. § 76-1-104 (1978) provides:\n\nPurposes and principles of construction. -- The provisions of [the Utah Criminal Code] shall be construed in accordance with these general purposes.\n\n(1) Forbid and prevent the commission of offenses;\n\n(2) Define adequately the conduct and mental state which constitute each offense and safeguard conduct that is without fault from condemnation as criminal.\n\n(3) Prescribe penalties which are proportionate to the seriousness of offenses and which permit recognition or differences in rehabilitation possibilities among individual offenders.\n\n(4) Prevent arbitrary or oppressive treatment of persons accused or convicted of offenses.\n\nWe hold as a matter of law that under the facts of this case, the death penalty could be imposed on defendant. We also reject the contention that a case-by-case (comparative) proportionality review is required under the federal or the Utah constitution. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Moreover, neither Utah statutory law nor the language from Pierre, \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Wood, \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e or any of our other death penalty case laws requires a case-by-case proportionality review.\n\nWe further reject defendant's argument that the death penalty could not be imposed on him because his accomplice received immunity from prosecution. The evidence demonstrated vast discrepancies between the levels of their respective participation and culpability, and it is also apparent that without the grant of immunity to Sagers, the State would have been unable to prosecute and convict defendant. No unconstitutional choice was made by the State in prosecuting defendant and not Sagers. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nVII. USE OF GENERAL VERDICT RELYING ON ALTERNATIVE AGGRAVATING CIRCUMSTANCES: THE UNANIMITY RULE\n\nThe information in this case, as amended at the preliminary hearing, alleged first degree murder based upon the circumstances of burglary, aggravated burglary, arson, and aggravated arson.\n\nThe trial court's instruction to the jury on first degree murder stated:\n\nThe defendant has entered a plea of not guilty to the charge of Criminal Homicide, Murder, First Degree, a Capital Offense, as contained in the Information. By the plea of not guilty the defendant denied each and every one of the essential elements of the charge, which elements are as follows:\n\n1. That on or about May 26, 1982, in Salt Lake County, State of Utah, the defendant, Elroy Tillman, caused the death of Mark Schoenfeld; and\n\n2. That he acted intentionally or knowingly in causing the death of Mark Allen Schoenfeld; and\n\n3. That at the time the homicide was committed, the defendant was engaged in the commission of, or attempting to commit burglary or aggravated burglary, and/or arson or aggravated arson.\n\nIf you find the state has proven beyond a reasonable doubt each and every one of these elements, then it is your duty to find the defendant guilty of the offense of Criminal Homicide, Murder, First Degree, a Capital Offense. On the other hand, if you find the State has failed to prove any of these elements beyond a reasonable doubt then you must find the defendant not guilty of the offense of Criminal Homicide, Murder, First Degree, a Capital Offense, and you may then consider the lesser included offense of Criminal Homicide, Murder in the Second Degree, a first degree felony.\n\nThe Court also gave individual instructions on the elements of the crimes of burglary, aggravated burglary, arson, and aggravated arson. While the court did not specifically indicate that the jury had to unanimously find that at least one of the aggravating circumstances had been committed, the court did state that \"the unanimous concurrence of all jurors is required to find a verdict.\" Thereafter, the jury was given a general verdict form which it subsequently returned unanimously finding defendant guilty of first degree murder.\n\nAlthough defendant did not request a unanimity instruction as to the aggravating circumstances, and although defendant did not object to the instructions given the jury or request a special verdict form, he now argues that the instructions and the verdict form do not indicate whether there was jury unanimity on any one of the circumstances aggravating the murder upon which his conviction is based. While defendant couches his argument in terms of \"duplicity,\" \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e the argument actually is that the instructions and verdict forms allowed the jury to convict defendant without necessarily reaching agreement as to what acts he performed at the time he committed the murder -- thus depriving him of his right to a unanimous jury verdict guaranteed by article I, section 10 of the Utah Constitution and Utah Code Ann. § 77-35-21(b) (1982).\n\nHistorically, jurors in state courts have had to agree only on a defendant's guilt or innocence of the crime charged, not on a particular theory of that crime. This proposition is supported by a long line of cases enumerating the rule accepted in most states: that juries need not unanimously agree upon a particular statutory theory of the crime charged if there is sufficient evidence in the record to support either theory. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nThe landmark case on jury unanimity is People v. Sullivan. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e In Sullivan, the defendant was charged with first degree murder under two theories of the crime. The case was submitted to the jury with an instruction permitting it to convict the defendant if it found that he had committed either premeditated murder or felony murder. Sullivan appealed his conviction, apparently claiming that the instruction violated his right to a unanimous verdict. The court responded:\n\nThere was but a single crime charged in the indictment against the defendant, -- that of murder in the first degree; and the only issue to be determined by the jury was whether the defendant had been guilty of that crime. Under our statute (section 183, Pen. Code), so far as applicable to the case before us, proof either that the defendant killed the deceased with a deliberate and premeditated design to effect his death. or while the defendant was engaged in the commission of a felony, or an attempt to commit a felony, though without any design to take life, established his guilt of the crime charged. \"It is not necessary that a jury, in order to find a verdict, should concur in a single view of the transaction disclosed by the evidence. If the Conclusion may be justified upon either of two interpretations of the evidence, the verdict cannot be impeached by showing that a part of the jury proceeded upon one interpretation and part upon the other.\" So, in this case, it was not necessary that all the jurors should agree in the determination that there was a deliberate and premeditated design to take the life of the deceased, or in the Conclusion that the defendant was at the time engaged in the commission of a felony, or an attempt to commit one. It was sufficient that each juror was convinced beyond a reasonable doubt that the defendant had committed the crime of murder in the first degree as that offense is defined by the statute. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nSimilarly, in State v. Arndt, \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e the defendant was convicted of grand larceny for violating a welfare fraud statute. The jury instructions indicated that the jury could find the defendant guilty of grand larceny if it found that she\n\neither made a false statement or representation of material facts, conditions or circumstances affecting her eligibility of need for assistance, or that the defendant failed to reveal any material facts, conditions or circumstances affecting her eligibility of need for assistance, or that the defendant failed to promptly notify the county office in writing as required by law of any change in status with respect to resources or income or money contributions from whatever source derived. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nIn concluding that the statutory provision described above constituted a single offense, the Washington Supreme court relied on Sullivan to hold that \"it is unnecessary to a guilty verdict that there be more than unanimity concerning guilt as to the single crime charged, i.e., grand larceny, regardless of unanimity as to the means by which the crime is committed provided there is substantial evidence to support each of the means charged.\" \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e The jury in Arndt was instructed that guilt could be based on a finding that the defendant either made a false statement of material facts, failed to reveal material facts, or failed to promptly notify the appropriate agency of a change in status. In approving the instruction, the Washington Supreme Court recognized that there is a class of criminal statutes that define a specific crime and provide various circumstances or means under which the crime may be committed and another class or statutes that set forth several distinctive acts and make the commission of each a separate crime, all in one statute. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e Under the first class of statutes, it is unnecessary to a guilty verdict that there be more than unanimity concerning guilt as to the single crime charged, regardless of unanimity as to the means or circumstances under which the crime is committed, provided that substantial evidence exists to support each of the circumstances advanced. On the other hand, if the statute prohibits more than one crime, there must be unanimous verdict as to each separate crime proscribed. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nIn the instant case, the jury unanimously found that defendant intentionally or knowingly (the mens rea or culpable mental state required) caused the victim's death (the singular actus reus or conduct proscribed in the definition of the offense) under the objective aggravating circumstances set out in section 76-5-202. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e Defendant was convicted of only a single crime -- murder in the first degree; the only issue to be determined by the jury was whether defendant was guilty of that crime. Under our statute, so far as applicable to the case before us, proof beyond a reasonable doubt that defendant intentionally or knowingly killed the victim in connection with an aggravated arson or arson or burglary or aggravated burglary establishes guilt of the crime charged. Here, there was only one actus reus for the crime charged, causing the death of another. There are not alternatives for the actus reus of the charged crime. Rather, there are objective circumstances which evaluate and aggravate the singular actus reus. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\nThe aggravating circumstances portion of the statute reflects the fact that the legislative considered certain intentional killings to be especially reprehensible either because of the invasion of special societal interests, because of the status of the killer or the victim, because of the manner in which death occurred, and/or because the killer contemporaneously committed other serious acts. These circumstances are not only morally reprehensible, but also increase the risk of societal harm and additional crime and violence such that they presuppose the actor's cognizance of the creation and existence of significant homicidal risk. Since this increased risk is not reasonable or justifiable by any valid purpose that the individual's conduct serves, the legislature has seen fit to increase the criminal nature of the crime. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nFurthermore, although defense counsel did not request separate verdict forms \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e and the general verdict did not note the specific evaluative circumstance(s) the jury relied upon, the record contains ample evidence, both eyewitness testimony and physical evidence, to support a jury verdict that at the time of the commission of the homicide, defendant intentionally and knowingly caused the death of the victim under any one of the several objective aggravating circumstances at issue and specified in subsection 76-5-202(d). The jurors could have believed defendant committed the murder under any of the aggravating circumstances since each circumstance was supported by the evidence and the proof of any or all beyond a reasonable doubt satisfied the same circumstance requirement under the first degree murder offense. Where the evidence overwhelmingly supports a conviction under one variation of a crime submitted to the jury, we have already stated that we may not reverse a conviction even if there was erroneous instruction on another variation. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e Likewise, a defendant who makes \"'no request for an instruction which would enable him to know which theory the jury adopted' cannot complain of insufficiency of the evidence for one theory of first degree murder when there was ample evidence under either theory.\" \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e To allow the same would be to invite error. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nAlso, as long as the record reveals a sufficient evidentiary basis for the conviction of first degree murder as to insure that this Court can conduct a comprehensive review of the proceedings and insure that the death penalty was not arbitrarily and capriciously imposed, the concerns of Furman v. Georgia \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e are met. Hence, jury unanimity on the evaluating circumstances is not required so long as the evidence supports the conviction with the alternative circumstances aggravating the crime charged.\n\nThis Conclusion, in part, is supported by the recent decision of the Tenth Circuit Court of Appeals in Andrews v. Shulsen. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e On appeal from the United States District Court for the District of Utah, defendant Andrews argued that one of the aggravating circumstances submitted to the jury in his case, \"killing for personal gain,\" could not withstand scrutiny. Specifically, he contended that this aggravating circumstance was constitutionally overbroad because \"every deliberate homicide could be viewed as committed for the benefit of the perpetrator.\" \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e The Court of Appeals did not reach the merit of this contention because Andrews failed to preserve this claim in state court. However, the court noted:\n\nEven if the \"personal gain\" aggravating circumstance is constitutionally overbroad, we are required to sustain Andrews' death sentences because of the unimpeachable presence of two other statutory grounds. The case was submitted to this jury on six theories of aggravation.... Although the jury did not specify which of these aggravating circumstances it had found, the Eighth Amendment does not require a jury to identify the aggravating circumstances it has relied upon to convict a capital defendant under a statute such as Utah's. See Jurek, 428 U.S. at 265 n.1, 267-68, 96 S. Ct. at 2953 n.1, 2954. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\nWhile the jury in Andrews did not specify in writing the statutory aggravating circumstance(s) it relied upon, the Tenth Circuit held that the jury's determination was reliable notwithstanding the general verdict of guilt. In holding so, the court observed that Andrews' convictions rested upon at least two well-founded statutory aggravating circumstances \"which, under the Utah statute, place him in the restrictive class of defendant who may be sentenced to death.\" \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\n\nHere, the trial court instructed the jury as to the requirement of a unanimous verdict. The jury returned a unanimous verdict. The jury was polled, and each juror affirmed the verdict to be his or her own. therefore, defendant was convicted by a unanimous jury as required by the Utah Constitution. \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Accordingly, we should follow the Sullivan rule in cases where a defendant is convicted of a single offense and the jury is instructed disjunctively as to the alternative evaluating circumstances aggravating that offense. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e Article I, section 10 of the Utah Constitution and Utah Code Ann. § 77-35-21(b) should be interpreted to require only that a jury be unanimous in concluding beyond a reasonable doubt that a defendant committed the single offense proscribed in the statute. Such rule is supported by this Court's past handling of other cases wherein we were faced with a similar question. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nFinally, the approach utilized in the 1980 case of State v. Green, \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e cited by defendant, is inapposite to and simply not persuasive in this case. In Green, the defendant was charged with aggravated murder in the first degree, which as there charged required that the victim be killed in furtherance of or in the course of a rape or kidnapping. The Washington court, relying on Arndt, had previously held that it was permissible for the trial court not to have required unanimity as to the rape and kidnapping elements, provided substantial evidence of each alternative existed. \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e The court in Green, however, held that the state had failed to establish the element of kidnapping either by substantial evidence or beyond a reasonable doubt, and therefore, without some indication of jury unanimity on that critical issue, it was impossible to know if the jury had based the aggravated murder conviction on invalid grounds. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e Additionally, the Green court seemingly abandoned the Arndt position, holding that Arndt was inapposite because the offenses of rape and kidnapping (the alternative ways in that case of committing aggravated murder in the first degree) were themselves separate and distinct criminal offenses. It stated in dicta: \"Where, as here, the commission of a specific underlying crime is necessary to sustain a conviction for a more serious statutory criminal offense, jury unanimity as to the underlying crime is imperative.\" \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e In State v. Whitney, \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e the Washington Supreme Court, sitting en banc, expressly retreated from the dicta in Green and reaffirmed the principle of Arndt. Although defendant Whitney claimed that the alternative circumstances underlying his conviction for first degree rape involved separate crimes and therefore the jury must be unanimous as to the underlying crime in order to sustain his conviction, the court stated:\n\nGreen did not hold that in all cases of aggravated murder there must be separate jury verdicts regarding each method. That issue was not before the court.\n\n, we reject the implication in Green II that because the underlying elements are crimes they necessarily have import as distinct offenses. The result of such characterization is that defendants charged with the same offense could be treated differently depending on whether or not the particular alternative methods they are charged with are labeled crimes. We note that the reasoning of Johnson... aptly supports the Conclusion that first degree rape describes a single offense.\n\nWashington law requires a unanimous jury Conclusion that the defendant committed the crime charged in the information.... Because constitutionally sufficient evidence supports both charged alternatives, the lack of jury unanimity does not entail the danger present in Green II that any of the jury members may have bases their finding of guilt on an invalid ground. We agree that an instruction on jury unanimity as to the alternative method found is preferable because it eliminates potential problems which may arise when one of the alternatives is not supported by substantial evidence; however, we conclude that such an instruction was not required in this case.\n\nWe note that the Montana Supreme Court was likewise rejected the dicta in Green II and refuses to apply Green II in case where each alternative method is supported by sufficient evidence. Further, United States v. Payseno, 782 F.2d 832, 835 (9th Cir. 1986) provides: \"Normally, a general instruction on the requirement of unanimity suffices to instruct the jury that they must be unanimous on whatever specifications form the basis of the guilty verdict.\" \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\n\nSimilarly, review of the transcript herein reveals that there was substantial evidence to support all of the alternatives set forth in the instructions. Therefore, the lack of jury unanimity did not entail the same danger as was present in Green. \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\n\nVIII. MERGER DOCTRINE\n\nDefendant's next point in that because the burglary and arson which occurred in this case were only incidental to the homicide, they \"merged\" into the killing and may not properly be used as aggravating circumstances under our first degree murder statute. Not only are most of the cases defendant cites inapposite to this case because they deal with traditional felony-murder statutes, \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e but his basic premise is also incorrect.\n\nUtah Code Ann. § 76-5-202(1)(d) makes an intentional or knowing killing first degree murder if \"he homicide was committed while the actor was engaged in the commission of... aggravated arson, arson, aggravated burglary, burglary....\" Defendant argues that pursuant to this statutory language, the Utah Legislature intended that persons who commit murder only in furtherance of, or in order to facilitate or hide the enumerated felonies be exposed to the death penalty. The State, however, takes the position that in drafting this portion of our first degree murder statute, the legislature intended to enhance an intentional murder to a first degree offense when it is carried out by means of or coincidental to one of the enumerated felonies.\n\nIn deciding this issue, it is necessary for this Court to conclude from the context and history of our first degree murder statute and the course of the old felony-murder rule the most likely intent of the legislature in drafting and adopting this statute. A threshold question requiring clarification in this case is the nature and purpose of the so-called \"murder-felony\" circumstances found in Utah's first degree murder statute. \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e Utah's first degree murder statute is different from the common law felony-murder doctrine. Traditionally, the common law felony-murder rule treated an unintentional killing in the course of a felony as murder. This theory is somewhat similar to our second degree murder statute codified in Utah Code Ann. § 76-5-203(1)(d) (1978 \u0026 Supp. 1987). \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e\n\nUtah's first degree murder statute does not include traditional felony murder as an alternative means of committing first degree murder. The statutes explicitly requires that the actor intentionally or knowingly cause the death of another under any of several circumstances. No unintentional, negligent, or accidental killing, regardless of the circumstances, can be first degree murder. The existence of the aggravating circumstances in our statute serves to elevate an otherwise ordinary (second degree) intentional homicide to first degree homicide, thereby subjecting a defendant to a possible death sentence.\n\nMoreover, while the aggravating circumstances found in the 1973 version of the Utah first degree murder statute \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e may have been somewhat similar to those circumstances listed in the sentencing phase of the Model Penal Code provision, \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e Utah's first degree murder statutory scheme is strikingly different therefrom. In this regard, the Model Penal Code's death penalty provisions involve two stages, structured differently from the stages in Utah's statute. The first stage of the Model Penal Code scheme requires a determination of guilt regarding the killing. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e Thereafter, if the court does not impose a sentence of imprisonment, a further proceeding is initiated to \"determine whether a sentence of death should be imposed.\" \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e This subsequent stage narrows the pool of those defendants eligible for the death penalty by requiring a finding of one of the enumerated aggravating circumstances and a determination that no overriding mitigating factors exist. \u003cspan class=\"fnref\"\u003e89\u003c/span\u003e After both of these findings have been made, the death penalty can be imposed.\n\nIn contrast, Utah's statutory scheme incorporates the aggravating circumstances into the definition of the first degree murder offense, \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e thereby initially narrowing the pool of defendant eligible for the death penalty in the guilt phase, rather than in the penalty phase, of the trial. Thereafter, evidence of aggravating or mitigating circumstances is presented in a sentencing proceeding pursuant to Utah Code Ann. § 76-3-207 (Supp. 1987). Such approach, as suggested in part by the Model Penal Code commentary itself, is noticeably different from that utilized in section 210.6 of the Model Penal Code. Indeed, the drafters of the Model Penal Code, in discussing nationwide formulation of first degree murder statutes, stated:\n\nThe Discussion in the Advisory Committee reflected a strong sentiment in favor of tighter controls on the discretionary judgment, the proposal having the most support calling for proof of at least one of the enumerated aggravations to justify a capital sentence. This might be achieved by constructing a class of capital murder, subject to a discretionary death sentence, which lists the aggravating factors in Section 210.6(3) as part of the definition of the offense. Such an approach has the disadvantage, however, of according disproportionate significance to the enumeration of aggravating circumstances when what is rationally necessary is the balancing of any aggravation against any mitigation that appear. The object sought is better attained by requiring a finding that an aggravating circumstance is established and a finding that there is no substantial mitigating circumstance. Put in this way, the exclusion of cases where there is no aggravating circumstance is accomplished but the concept of a final judgment based upon a balancing of aggravations and of mitigations is maintained. This approach met the views of the Advisory Committee and was approved by the Council and the Institute. \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\n\nThe Utah legislature's adoption of a modified version of this former view supports the Conclusion that Utah Code Ann. § 76-5-202 and section 210.6 of the Model Penal Code are strikingly different. Furthermore, the applicable commentaries to the Model Penal Code do not support the argument that such code either restricts the \"while engaged in\" language in a death penalty statute such as Utah's or intends therein to include killings incidental to felonies and not felonies incidental to killings. Although it is possible to argue that undeveloped statements in the Model Penal Code commentary indicated that the drafters thereof intended a construction of the \"while engaged in\" language that would not result in an extension of the application of the felony-murder concept and that some courts required that the felony be \"independent\" of the homicide, such unsupported statements do not directly address the issue at hand and are, in this sense, unpersuasive. We also note that the merger doctrine, as applied in the cases cited by defendant, is by no means universally accepted. \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e\n\nFurthermore, as for the cases defendant cites in support of his proposition, review thereof seems to indicate that some of those courts expressed the concern that a broadening of the felony-murder rule to include those situations where the underlying felony is an integral part of the homicide would not further the deterrent purpose of the traditional felony-murder rule and would relieve the State of its burden of proving intent or malice aforethought in a murder case. \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e Such concerns are not present here. This is in part because the aggravating felony circumstances enumerated in Utah Code Ann. § 76-5-202(1)(d) are essentially enhancement factors rendering an intentional or knowing killing a capital offense, thereby serving a distinctly different purpose than does an underlying felony in the operation of the felony-murder rule. Finally, although defendant urges adoption of the California approach, it is neither relevant to nor controlling in the case at hand.\n\nIn Conclusion, state legislatures are afforded wide latitude in defining criminal conduct for their citizens. \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e Similarly, they enjoy considerable freedom in determining what criminal conduct warrants the death penalty, \u003cspan class=\"fnref\"\u003e95\u003c/span\u003e subject, of course, to certain constitutional limitations. \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e there exists no constitutional prohibition against a legislature's defining capital murder to include the situation where intentional or knowing murders are committed during the commission of certain felonies which are merely incidental to and not independent from the murder. Such definition does not describe all murders thereby providing no rational distinction between those murders for which the death penalty is appropriate and those for which it is not. \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e Rather, it is apparent from the language of the statute itself that the legislature recognized that intentional or knowing murders committed in conjunction with the enumerated circumstances are more heinous and egregious and thus should prescribe greater punishment and warrant consideration for the death penalty. \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\n\nAccordingly, the above analysis supports the Conclusion that under Utah Code Ann. § 76-5-202, which itself draws no distinction between felonies that are committed independent of the murder and those that are not, a defendant commits first degree murder if it is committed knowingly or intentionally in conjunction with the commission of any one of several enumerated felonies, even if the felony is an integral part of, or merely incidental to, the murder. Interpreting our first degree murder statute in this manner is consistent with \"potential constitutional considerations and legislative intent.\" \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e\n\nDefendant also contends that since burglary is a completed offense \"the moment entry is made with the requisite felonious intent,\" such circumstance, in this case, could not provide the basis for elevating the subsequent intentional killing to first degree murder. This contention, however, has been widely rejected in the felony-murder context where burglary is considered a \"continuing\" offense. \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e This Conclusion applies equally to burglary charged as an aggravating circumstance under Utah Code Ann. § 76-5-202.\n\nMoreover, the evidence in this case clearly supported the determination that defendant committed an intentional homicide while engaged in the commission of a burglary, which is defined in Utah as \"enter or remain unlawfully in a building or any portion of a building with intent to commit a felony or theft or commit an assault on any person.\" \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e Therefore, defendant's contention is without merit.\n\nIX. AGGRAVATING CIRCUMSTANCES IN THE PENALTY PHASE\n\nDefendant claims that section 76-3-207 is unconstitutional because it fails to limit the aggravating circumstances which may be relied upon by juries in imposing the death penalty. Subsection (2) of that statute states:\n\nIn these sentencing proceedings, evidence may be presented as to any matter the court deems relevant to sentence, including but not limited to the nature and circumstances of the crime, the defendant's character, background, history, mental and physical condition, and any other facts in aggravation or mitigation of the penalty. Any evidence the court deems to have probative force may be received regardless of its admissibility under the exclusionary rules of evidence.... Aggravating circumstances shall include those as outlined in 76-5-202.\n\nDefendant's challenge herein is specifically directed only at the introduction of evidence in the penalty phase regarding his past criminal convictions. He relies on the theory that such evidence may only be properly used by the State in rebuttal when a defendant relies upon and asserts the statutory mitigating circumstance that he has no significant history of prior criminal activity. \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e That theory is erroneous. \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e\n\nFurthermore, evidence of past criminal convictions is clearly within the scope of the statutory reference to \"the defendant's character, background, history.\" Thus, the evidence to which defendant objects was specifically authorized by the statute and did not fall within the category of \"any other facts in aggravation,\" which language defendant claims is constitutionally infirm. Therefore, because the evidence admitted related to a specific statutory category and because it was properly admitted, we need not reach the question of constitutional infirmity. \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e\n\nX. REASONABLE-DOUBT INSTRUCTIONS\n\nCounsel for defendant in substance requested and the trial court gave to the jury at the end of the guilt phase an instruction which defined \"reasonable doubt\" as follows:\n\nNow, by reasonable doubt in meant a doubt that is based on reason and one which is reasonable in view of all the evidence. Proof beyond a reasonable doubt is that degree of proof which satisfies the mind and convinces the understanding of those who are bound to act conscientiously upon it. A reasonable doubt is a doubt which reasonable men and women would entertain, and it must arise from the evidence or the lack of the evidence in this case.\n\nIf after an impartial consideration and comparison of all the evidence in the case you can candidly say that you are not satisfied of the defendant's guilt, you have a reasonable doubt. but it after such impartial consideration and comparison of all the evidence you can truthfully say that you have an abiding conviction of the defendant's guilt such as you would be willing to act upon in the more weighty and important matters relating to your own affairs, you have no reasonable doubt. A reasonable doubt must be a real, substantial doubt and not one that is merely possible or imaginary.\n\nDefendant now argues that the foregoing instruction impermissibly shifted the burden of proof in the guilt phase and the burden of persuasion in the penalty phase to him. His logic is unpersuasive. The above language clearly instructed that in making a determination, each juror must reach an \"abiding conviction\" of guilt and that the State must produce proof which \"satisfies the mind and convinces the understanding.\" We do not agree that the language in question in any way alters the State's burden of proof or shifts it to defendant. Legal definitions of standards of proof still pose communication problems for Judges and jurors, \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e but defendant has not come close to a showing of a denial of due process because of the language used at his trial.\n\nXI. REPRESENTATIVES OF JURY VENIRE\n\nFinally, defendant claims that the panel from which the jury was selected in this case did not contain a fair cross-section of the community. However, defendant did not raise this issue below, nor did he request a hearing to present evidence in support of his contentions. Therefore, no evidence exists in the record upon which we may adequately review his claims in this regard, and Utah Code Ann. § 77-35-18(c) (1) (ii) (1982) effectively precludes defendant's request for an evidentiary hearing at this time.\n\nNevertheless, defendant attempts on appeal to adopt by reference the argument, statistical information, and analysis presented on this issue by defense counsel in State v. Bishop, \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e a case now on appeal in this Court but not yet decided. This is a highly unorthodox procedure and one that should not be perpetuated. However, because this issue has been raised in several cases currently on appeal to this Court, we choose to decide it herein. In Bishop, the defendant contends that using voter registration lists as the exclusive source of selecting potential jurors leads to the systematic under-representation of racial and ethnic minorities, particularly Hispanics, on panels in Salt Lake County. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\n\nThe record in Bishop indicates that no dispute exists over whether the statutory procedure for the selection of jurors was properly followed. The Jury Selection and Service Act, as it read from its inception until sometime after both defendants' trials, required the jury commissioners of each county to randomly select prospective jurors from the official register of voters used in the most recent general election. \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e The names so chosen comprised the \"master jury wheel.\" \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e Subsequently, such names were drawn as was necessary, and the prospective jurors were sent qualification forms. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e Qualified jurors were then placed on the \"qualified jury wheel,\" from which names were randomly drawn and randomly assigned to panels. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e\n\nNeither defendant claimed that the alleged under-representation was due to purposeful discrimination, \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e and Utah Code Ann. § 78-46-2, \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e relied upon by Bishop, does not, standing alone, provide a foundation upon which a violation of the Act may be predicated pursuant to section 78-46-16. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e Moreover, Bishop's motion below did not refer to the Act. Accordingly, in light of the above, this issue must be analyzed outside the framework of the statute. \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e\n\nThe sixth amendment to the United States Constitution guarantees an accused a trial by an impartial jury. \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e The fourteenth amendment to the United States Constitution incorporates the sixth amendment's fair trial guarantees and makes them applicable to the states. \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e The selection of petit juries from a representative cross-section of the community is an essential component of the sixth amendment's right to a jury trial. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e\n\nThe use of voter registration lists as the sole source of obtaining prospective jurors is not impermissible absent a showing of some impropriety in the process. For example, such \"impropriety\" might be demonstrated if those lists resulted in the systematic exclusion of a cognizable group or class of citizens or if there was discrimination in the compilation of such lists. \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e Moreover, while jurors must be drawn from a source fairly representative of the community, each jury need not \"mirror\" the community: \"Defendants are not entitled to a jury of any particular composition.\" \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e\n\nA prima facie violation of the fair cross-section guarantee is established where a defendant shows:\n\n(1) hat the group alleged to be excluded is a \"distinctive\" group in the community; (2) that the representation of this group in venires from which juries are selected is not fair and reasonable in relation to the number of such persons in the community; and (3) that this under-representation is due to systematic exclusion of the group in the jury-selection process. \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e\n\nOnce a defendant has made such a showing, the State bears the burden of justifying the infringement by \"showing attainment of a fair cross section to be incompatible with a significant state interest.\" \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e\n\nAlthough Bishop claimed that all racial and ethnic minorities were excluded from Salt Lake County veneries, \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e defendants focus on appeal upon Hispanics. Bishop contends that Hispanics are distinctive because they are designated in a separate category in census figures and because they are \"segregated by religion, economic status and cultural background from the majority of county residents.\" \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e Similarly, the State would have us assume that Hispanics are a distinctive group for fair cross-section purposes. We believe such an assumption is too hastily made. For purposes of the equal protection clause, Hispanics may be a distinctive group. \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e But it does not necessarily follow that they are distinctive in Salt Lake County for fair cross-section purposes. \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e\n\nBishop relies upon People v. Harris, \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e wherein the California Supreme Court found that Hispanics were a distinctive group for purposes of fair cross-section analysis. \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e However, Harris is not persuasive on this point. Taylor v. Louisiana \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e and Duren v. Missouri \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e note that a particular group must be of sufficient numerosity and distinctiveness to be cognizable for fair cross-section purposes. \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e This standard certainly implies a factual determination which turns upon the relevant characteristics. of the particular community. \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e Therefore, although Hispanics may be a distinctive group in California for purposes of the sixth amendment, it does not follow that they constitute such a group in Utah.\n\nBishop was given the opportunity by the trial court to argue his motion and to present evidence to support his claim that Hispanics are a distinctive group in Salt Lake County. Bishop decided, however, to offer no evidence on this point, instead submitting the issue on argument along. Similarly, Tillman chose not to raise the issue below or present evidence to support the same. Failure to make such a showing is fatal to defendants' sixth amendment claim. Nevertheless, defendants' argument is flawed for additional reasons.\n\nTo satisfy the second prong of Duren, a defendant must establish that the representation (of the group alleged to be excluded) in panels from which juries are selected is not \"fair and reasonable in relation to the number of such persons in the community.\" \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e By comparing a benchmark percentage of a cognizable group appearing in the population with the percentage of the group appearing on jury panels, it is possible to obtain some measure of whether panels are being constituted in a manner representative of a fair cross-section of the community. \u003cspan class=\"fnref\"\u003e134\u003c/span\u003e\n\nThe parties in Bishop stipulated to the introduction of certain 1980 census data for Salt Lake County on which defendants rely to demonstrate the percentage of the community made up of the group alleged to be underrepresented. The document indicates that 30,867 persons, out of a total population in Salt Lake County in 1980 of 619,066 persons, were of \"Spanish origin.\" This results in a benchmark percentage of 4.99 percent. \u003cspan class=\"fnref\"\u003e135\u003c/span\u003e\n\nDefendants claim that the Salt Lake County clerk's office summoned 1,987 qualified jurors to Third District Court, presumably for criminal trials, from January 1, 1983, through March 31, 1983. The summoned jurors sat on 90 separate panels. Bishop argued that only 43 of the summoned people were Spanish. It is this latter figure that is fatal to defendants' claim. Bishop's counsel explained that the number was reached after a law clerk \"viewed\" a list of the names of the prospective jurors on each panel and, based upon \"common sense,\" wrote down the name of every panel member with a \"Spanish-sounding name.\" Later, the law clerk asked a Hispanic attorney to go over the list, and allegedly some corrections were made. \u003cspan class=\"fnref\"\u003e136\u003c/span\u003e Defendants contend therefrom that Hispanics only constituted 2.16 percent of jury panels. Thus, defendants argue that these statistics suggest that the master list does not survey a fair proportion of the general Hispanic population. \u003cspan class=\"fnref\"\u003e137\u003c/span\u003e\n\nAlthough the parties in Bishop focused their argument on whether the \"absolute disparity\" function or the \"comparative disparity\" function should be used by this Court in analyzing such claims, we hold that the methodology Bishop (and thus Tillman) used to determine the percentage of Hispanics called to sit on panels was simply too unreliable to satisfy Duren under any circumstances. Because the raw data was so unreliable, we need not decide which function (if either) or combination thereof need be used to demonstrate a prima facie Duren violation. \u003cspan class=\"fnref\"\u003e138\u003c/span\u003e\n\nSince defendants failed to establish the second prong of Duren, it follows that they also failed to establish Duren 's third requirement, that the jury selection process inherently leads to underrepresentation. \u003cspan class=\"fnref\"\u003e139\u003c/span\u003e Because defendants failed to establish a prima facie Duren violation, this point is without merit.\n\nWe have also reviewed defendant's other claims and find them to be without merit.\n\nDefendant's conviction and sentence are in all respects affirmed.\n\nSTEWART, Associate Chief Justice: (Concurring and Concurring in the Result)\n\nI concur in sections II, IV through VI, and IX through XI of the opinion authored by Chief Justice Hall, and I concur in the result in sections III, VII and VIII. Therefore, I vote to affirm the conviction and the sentence. I refer to the opinion of the Chief Justice as the majority or lead opinion for ease of reference because three or more Justices have concurred in sections II through VI and sections IX through XI. However, sections VII and VIII of the opinion do not command a majority of the Court. I write separately because I have a somewhat different view of the unanimity and merger issues as they are raised in this case from those expressed by the lead opinion and by Justice Durham's Concurring and Dissenting opinion.\n\nI. UNANIMITY OF THE JURY WITH RESPECT TO THE AGGRAVATING CIRCUMSTANCES\n\nSection VII of the lead opinion addresses defendant's contention that neither the jury instructions nor the verdict forms required the jury to find unanimously one or more of the aggravating circumstances charged -- i.e., burglary, aggravated burglary, arson, or aggravated arson -- as had to be found to raise the homicide to a capital offense. In my view, the jury was instructed to act with the requisite unanimity, but even if it were not, the error was harmless. In any event, my views on jury unanimity are different from those expressed in the lead opinion and Justice Howe's opinion and are essentially in accord with Justice Durham's and Justice Zimmerman's views, although my analysis leads me to a different result in this case than they reach on this issue. For that reason, I write separately.\n\nThe lead opinion and Justice Howe's opinion state that to convict of a capital crime, it is not necessary for the jury to agree unanimously on which particular statutory aggravating circumstance or circumstances defendant committed, as long as the jurors unanimously agree that the defendant committed at least one of the several aggravating circumstances charged against him, even though they disagree as to which aggravating circumstances have been proved beyond a reasonable doubt.\n\nI disagree with that proposition because I believe that it violates the Utah criminal code and contravenes an established constitutional right guaranteed by the federal and Utah Constitutions.\n\nAn aggravating circumstance is an indispensable element of the offense of first degree murder, and without proof of such an element beyond a reasonable doubt to the satisfaction of every juror, a homicide can only be a second degree murder. The criminal code, Utah Code Ann. § 76-1-501(2) (1978), defines the term \"element of the offense\" to be:\n\n(a) The conduct, attendant circumstances, or results of conduct proscribed, prohibited, or forbidden in the definition of the offense;\n\n(b) The culpable mental state required.\n\n(Emphasis added.) Section 76-1-501(2) also provides that every \"element of the offense\" must be proved beyond a reasonable doubt. In addition, Article I, Section 10 of the Utah Constitution requires that the jury be unanimous as to every element of a crime. In State v. Green, 78 Utah 580, 6 P.2d 177, 181 (1931), this Court stated: \"The provision of our State Constitution which grants accused persons the right to a trial by jury extends to each and all of the facts which must be found to be present to constitute the crime charged....\" The Due Process Clause of the Fourteenth Amendment to the United States Constitution requires the same. In re Winship, 397 U.S. 358 (1970). Aggravating circumstances are facts \"which must be found to be present to constitute the crime\" of first degree murder under Green and Article I, Section 10, and they also constitute an \"element of the offense\" of first degree murder under § 76-1-501(2). Without proof beyond a reasonable doubt of aggravating circumstances, an intentional homicide is at most a second degree murder.\n\nThe importance of preserving the principle of jury unanimity as to all \"elements of an offense\" can hardly be overstated. To dilute that principle by allowing jurors to disagree among themselves as to separate, alternative elements of the crime, even though they agree on the general Conclusion that the crime of first degree murder has in fact been committed, is to lose the value of the synergistic effect of jurors acting as a group in reconstructing the facts and applying the law. Nonunanimity permits a jury to refrain from coming to grips with determining precisely what the defendant did and then deciding whether that meets the legal standards that define the elements of the crime.\n\nNonunanimity as to alternative element of a crime can also deprive a defendant of a defense to the charge. Under the view taken by the Chief Justice and Justice Howe, if a defendant urges a defense that is valid as to one alternative element but not to another and the jury splits on which alternative the defendant committed, the jury is not forced to decide the validity of the defense.\n\nFurthermore, nonunanimity tends to subvert the proper operation of the lesser included offense doctrine, which is a constitutionally significant factor in capital homicide cases. See Beck v. Alabama, 447 U.S. 625 (1980). That is so because the jury may never have to consider that doctrine since it is not compelled to decide whether the defendant committed one or the other (or both) alternative elements in the definition of the crime. Finally, if the principle of jury unanimity is relaxed, all the vaunted protections of proof beyond a reasonable doubt will be threatened. Requiring juror unanimity as to the crime itself only, rather than each element of the crime, would permit a jury to render inconsistent and potentially irrational verdicts because they may be based on conflicting and even inconsistent determinations of the facts. That is no small erosion of a fundamental principle of our criminal Justice system.\n\nIt follows, I believe, that our Constitution, our case law, and our statute requires us to reject the rule of People v. Sullivan, 173 N.Y. 122, 65 N.E. 989 (1903), and the authority it has spawned, in connection with aggravating circumstances in capital homicide cases. Indeed, Sullivan deals with an entirely different kind of problem.\n\nFurthermore, State v. Russell, 733 P.2d 162 (Utah 1987), relied upon by the Chief Justice and Justice Howe, does not support the proposition that the requirement of jury unanimity can be disregarded with respect to aggravating circumstances. Russell dealt with a second degree murder charge. The jury in that case was instructed that the mental state required for proof of second degree murder could be demonstrated by proof that the defendant intentionally or knowingly caused the victim's death, intentionally caused serious bodily harm by an act clearly dangerous to human life, or acted with depraved indifference toward human life by creating a grave risk of death. The lead opinion in Russell did not command a majority, and the facts of the case were not analogous to the instant case. I wrote a Concurring opinion expressly limiting the scope of the rule to the mens rea, or mental state, element in second degree murder cases on the ground that statutory definitions of the pertinent mental states for the second degree murder were only variations of the common law mens rea, malice aforethought, and therefore merely different facets of the same mental state. Justice Durham also wrote a separate Concurring opinion limiting the rule applies, and Justice Zimmerman concurred in the result. Thus, the actual holding of Russell is very narrow and does not support nonunanimity with respect to particular aggravating circumstances that would support a conviction for first degree murder.\n\nNotwithstanding the foregoing Discussion, I do not believe that the principle of jury unanimity as I think it must be applied was violated in this case. The jury was instructed that it had to find each element of the offense by proof beyond a reasonable doubt, and the instructions were pellucid that an aggravating circumstance was an element of the crime that had to be proved beyond a reasonable doubt. The jury was instructed that in addition to finding an intentional killing, it must also find that defendant committed arson or aggravated arson and/or burglary or aggravated burglary. The instruction permitted the jury to find any one of these predicate offenses, or more than one, but it did not reasonably lend itself to the interpretation that some jurors could find one aggravating circumstance or offense, while other jurors disagreed on that finding and found some other aggravating circumstance or offense. State v. Rasmussen, 92 Utah 357, 68 P.2d 176 (1937). The instruction reads in toto\n\nThe defendant has entered a plea of not guilty to the charge of Criminal Homicide, Murder, First Degree, a Capital Offense, as contained in the Information. By the plea of not guilty the defendant denies each and every one of the essential elements of the charge, which elements are as follows:\n\n1. That on or about May 26, 1982, in Salt Lake County, State of Utah, the defendant, Elroy Tillman, caused the death of Mark Schoenfeld; and\n\n2. That he acted intentionally or knowingly in causing the death of Mark Allen Schoenfeld; and\n\n3. That at the time the homicide was committed, the defendant was engaged in the commission of, or attempting to commit burglary or aggravated burglary, and/or arson or aggravated arson.\n\nIf you find the State has proven beyond a reasonable doubt each and every one of these elements, then it is your duty to find the defendant guilty of the offense of Criminal Homicide, Murder, First Degree, a Capital Offense. On the other hand, if you find the State has failed to prove any of these elements beyond a reasonable doubt then you must find the defendant not guilty of the offense of Criminal Homicide, Murder, First Degree, a Capital Offense, and you may then consider the lesser included Offense of Criminal Homicide, Murder in the Second Degree, a first degree felony.\n\n(Emphasis added.)\n\nThe clear impact of the last quoted paragraph of the instruction, together with the general unanimity instruction given to the jury, is that the jury as a group had to find unanimously at least one aggravating circumstance. The word \"you\" in the last paragraph of the instruction rather clearly refers to the jurors collectively, as is apparent from the following language (in addition to other similar language): \"... you must find the defendant not guilty... and you may then consider the lesser included offense....\" Since the rule is that the jury is presumed to have followed the instructions given, I conclude that the jury did act unanimously with respect to each element of the offense, including the aggravating circumstances. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e See State v. Rasmussen, 92 Utah 357, 68 P.2d 176 (1937).\n\nDefendant argues that each aggravating circumstance should have been charged in a separate count and a separate verdict rendered on each charge. That clearly is a preferable course, in my view, because it focuses the jury's attention on the aggravating circumstances and facilitates appellate review for sufficiency of the evidence, if such a claim is made. However, the failure to give such instructions in this case is not, in my view, cause of reversal. In sum, I concur in the result reached by the lead opinion.\n\nII. THE MERGER DOCTRINE\n\nI write on the merger doctrine, although I agree in general with the lead opinion, because my views differ in certain particulars from the lead opinion and from Justice Durham's opinion.\n\nThe merger doctrine was founded in, and grew out of, the old common law felony-murder rule which imposed capital punishment on a person who accidentally or negligently killed someone during the course of committing a felony. The theory was that the intent to commit the felony could be \"transferred\" to the homicide to increase the punishment.\n\nThe doctrine of merger operated to temper the harshness of the felony-murder rule. Where the predicate felony, such an aggravated assault, was inherent in the act of the homicide, the law merged the two offenses so that the felony-murder rule could no longer apply. Indeed, logic required as much. E. g., State v. Essman, 98 Ariz. 228, 403 P.2d 540 (1965); People v. Ireland, 70 Cal. 2d 522, 450 P.2d 580, 75 Cal. Rptr. 188 (1969); State v. Clark, 204 Kan. 38, 460 P.2d 586 (1969); State v. Fisher, 120 Kan. 226, 243 P. 291 (1926); People v. Huther, 184 N.Y. 237, 77 N.E. 6 (1906); State v. Branch, 244 Or. 97, 415 P.2d 766 (1966); W. LaFave \u0026 A. Scott, Handbook on 547 (1972); R. Perkins, 40 (2d ed. 1969). See also Moreland, A Re-Examination of the Law of Homicide in 1971: The Model Penal Code, 59 Ky. L. J. 788, 803-04 (1971), which argues that the entire felony-murder rule should be abandoned in this country as it has been in Great Britain. See English Homicide Act 5 \u0026 6 Eliz. 2, c. 11, § 1 (1957). For a contrary view of merging aggravated assault with murder, see State v. Thompson, 88 Wash. 2d 13, 558 P.2d 202, appeal dismissed, 434 U.S. 898 (1977); State v. Harris, 69 Wash. 2d 928, 421 P.2d 662 (1966). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe Utah criminal code abandons the common law felony-murder rule as to capital homicide and retains it only as to second degree murder. As it pertains to this case, Utah Code Ann. § 76-5-202(1) (d) (1978) provides that for a homicide to be a murder in the first degree, the homicide must be committed while the defendant \"was engaged in the commission of, or an attempt to commit, or flight after committing or attempting to commit... aggravated arson, arson, aggravated burglary, burglary....\" In my view, the homicide in this case was literally committed while defendant \"was engaged in the commission of aggravated arson, arson, aggravated burglary, burglary.\"\n\nThe Dissenting opinion reads the language \"while... engaged in the commission of...\" to mean that a defendant must have an independent felonious purpose for committing a burglary or arson other than killing the victim in order for the homicide to be a first degree murder. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In other words if one unlawfully enters another's premises for an independent felonious purpose such as stealing, an intentional homicide which is committed during the burglary is a first degree murder, and the burglary is characterized as \"coincidental\" to the homicide. But if one unlawfully enters another's premises solely for the express purpose of killing someone within, that intentional killing, according to the Dissent, is second degree murder, and the burglary is deemed \"incidental.\"\n\nI have difficulty with that analysis for several reasons. First, I believe it would be anomalous to adopt a rule which in effect makes an intentional killing committed during the course of an \"incidental\" burglary (i.e., one committed for the purpose of killing another) a second degree murder, while an unintentional killing committed during the course of a burglary is also a second degree murder. See Utah Code Ann. § 76-5-203 (Supp. 1987) (second degree murder statute). Furthermore, one who commits a burglary to steal and intentionally kills to further that end would be guilty of first degree murder, while one who intentionally kills after entering unlawfully for that purpose would be guilty only of second degree murder. The distinction drawn by the Dissent does not, in my view, bear the weight of the differences placed on it. Rather, the distinction results in disparate treatment of an intentional murder committed in the course of an \"incidental\" burglary and an intentional murder committed during the course of a \"coincidental\" burglary, even though there is no substantial difference in moral culpability between these two homicides and the statutory language in § 76-5-202(1) does not require that result.\n\nSecond, the first degree murder statute is designed to provide added deterrence for specific types of conduct. Thus, subsection (1) (d) of the statute makes intentional killings done while one is \"engaged in the commission of\" certain felonies first degree murder. The statute also makes homicides first degree murder if they are accomplished by particular means, such as by poisoning, bombs, or explosives, or by or against particular persons.\n\nNevertheless, I agree with the reasoning of People v. Green, 27 Cal. 3d 1, 60-62, 609 P.2d 468, 505-06 164 Cal. Rptr. 1, 38-39 (1980), cited in Justice Durham's Dissent, that the special circumstances giving rise to first degree murder must provide a rational basis for distinguishing between murders which are capital murders and murders which are not capital murders. The aggravating circumstance provisions of the first degree murder statute may not be allowed to become so all-inclusive or so out of harmony with constitutional doctrine as to cause the sentencing of capital homicide to deteriorate into the capriciousness and arbitrariness held to be unconstitutional in Furman v. Georgia, 408 U.S. 238 (1972), and condemned in Gregg v. Georgia, 428 U.S. 153 (1976). It is therefore necessary, in my view, to apply the special circumstances specified in § 76-5-202 with care to avoid irrational results, as was done in People v. Green. Thus, the aggravating circumstance of burglary might yield capricious results in a case involving a constructive burglary or a burglary committed in some places other than a dwelling.\n\nIt does not, however, follow that there is capriciousness in imposing capital punishment on one who commits a burglary by stealth for the purpose of killing an inhabitant who is asleep. Of course, the purpose to kill is what makes the unlawful entry in this particular case a burglary. See Utah Code Ann. § 76-6-202(1) (a) (1978). But there is a legitimate reason for making an intentional murder committed after an unlawful entry into a home or residence a more severely punished crime than an intentional homicide that is only a second degree murder. The law traditionally has recognized certain areas, such as the home, where one should be able to feel secure and relax one's guard, and where people deserve special protection. Indeed, when one is asleep at home, as was the victim in the instant case when he was attacked by defendant, he is especially helpless in the face of an assault by others. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nClearly, the Legislature may decide that certain acts committed within the same or continuous transaction or course of action offend several different societal interests and thereby constitute separate offenses which are not subject to the doctrine of merger. See Williams v. Oklahoma, 358 U.S. 576 (1959); Gore v. United States 357 U.S. 386 (1958). The Legislature has acted to protect both the privacy of a residence and the sanctity of life. It has also decreed that the intentional taking of life by one \"engaged in the commission of, or attempt to commit... aggravated arson, arson, aggravated burglary, burglary...\" constitutes first degree murder. This Conclusion has been reached as far as I have been able to determine by every other court that has addressed the issue, except one. Thus, in Blango v. United States, 373 A.2d 885 (D.C. 1977), the District of Columbia Court of Appeals, on facts similar in essential respects to the instant case, held that a burglary committed for the purpose of committing a murder was a capital homicide. A number of states have adopted the same rule. See, e.g., State v. Miller, 110 Ariz. 489, 520 P.2d 1113 (1974); State v. Foy, 224 Kan. 558, 582 P.2d 281 (1978); Smith v. State, 499 So. 2d 750 (miss. 1986); State v. Reams, 292 Or. 1, 636 P.2d 913 (1981). Cf. People v. Miller, 32 N.Y.2d 157, 344 N.Y.S.2d 342, 297 N.E. 2d 85 (1973). Contra Parker v. State, 731 S.W.2d 756 (Ark. 1987).\n\nHOWE, Justice: (Concurring in the Result)\n\nI concur except I concur only in the result of parts VII and VIII.\n\nI concur in the result of Part VII on the basis of the analysis of the unanimity rule in State v. Russell, 733 P.2d 162 (Utah 1987). Although the instant case does not involve the defendant's mens rea as in State v. Russell, in that case we approved the rule of People v. Sullivan, 173 N.Y. 122, 65 N.E. 989 (1903), which held that the jury does not have to be unanimous on the precise manner in which the crime was committed, or by which of several alternative methods or modes, or under which interpretation of the evidence so long as there is substantial evidence to support each of the methods, modes, or manners charged. I cannot accept the implication in the majority opinion that had the defendant requested separate verdict forms requiring the jury to be unanimous as to what felony he was in the course of committing when the homicide took place, he would have been entitled to such a verdict. State v. Russell, (supra) , held that the defendant was not entitled to have the jury instructed that they must be unanimous as to the defendant's mens rea. That holding likewise applies here where we are concerned with the manner in which the filling occurred.\n\nAs to Part VIII, I base my concurrence on State v. Johnson, 740 P.2d 1264 (Utah 1987), where we employed the res gestae analysis which we adopted in State v. Weddle, 29 Utah 2d 464, 511 P.2d 733 (1973). Under that analysis, it is sufficient if the killing is directly associated with the felony as part of one continuous, interrelated occurrence. See the cases cited and discussed in State v. Johnson, supra, State v. Dudrey, 30 Wash. App. 447, 635 P.2d 750 (1981), and State v. Richmond, 112 Ariz. 228, 540 P.2d 700 (1975). The same reasoning applies to the arson which immediately followed the attack on the victim.\n\nDURHAM, Justice: (Concurring and Dissenting)\n\nAlthough I agree with parts I, II, III, IV, VI, IX, X, and XI of the majority opinion, I Dissent from parts V, VII, and VIII and therefore from the result.\n\nDiscussion of Life Sentence\n\n(Part V of Majority Opinion)\n\nNotwithstanding its rejection of the presumed waiver doctrine in appellate review of capital cases, the majority opinion dismisses defendant's claimed error in the penalty phase because he \"should be deemed to have invited the error (if there was any) and waived any objection.\" I disagree with this analysis.\n\nThe majority opinion, in allocating responsibility to defense counsel for mentioning the length of a \"life\" sentence, neglects the fact that it was the prosecutor who first raised the issue of what might happen if defendant were ever to be free. The prosecutor began his closing argument in the penalty phase by telling the jury members that their job was \"to make a risk assessment of Mr. Tillman in terms of his future life.\" He emphasized the future risk element repeatedly:\n\nt the same time you still have the obligations of the State and Mr. Tillman to weigh and balance and future risks that may be posed by Mr. Tillman's future conduct.\n\nSo we stand equal at this point in time with Mr. Tillman in balancing out and assessing those risks that you must take with you to the jury room.... ou can ask yourselves several things in assessing the risk of Mr. Tillman.\n\nNow you can turn your cheek once and twice and even seven times, but that's not going to bring back Mark Allen Schoenfeld and you have to ask yourselves, \"Do I want to run that risk again? Do I dare run that risk again?\"\n\nBut more importantly, we are talking about deterrence of one man, one man alone, and that's Elroy Tillman who we are going to say, \"If we execute this man we no longer run the risk associated with what he has done in the past and more specifically what he did to Mark allen Schoenfeld when he bludgeoned him to death with an ax and then to further disfigure him, set fire to him while he was still breathing.\"\n\nWe thank you in advance for your attention in this matter and... I know you believe in your hearts this will probably be the most important thing that you will remember for a good long time to come, and may you be able to live with that verdict and be able to say to yourselves, \"That was the appropriate verdict under the circumstances and I can rest assured for the future safety of society.\"\n\nIt was in response to the foregoing \"specific deterrence\" argument that defense counsel made his remarks estimating that defendant would be unlikely ever to receive parole or, if paroled, to be released from prison before becoming an old man. Thus, the prosecutor's \"rebuttal\" remarks about the length of a life sentence were made in the context of a debate, begun by the prosecutor himself, concerning the risks attendant upon allowing defendant to live. The prosecutor emphasized the extreme threat of violence that defendant represented and then told the jury that defendant would be free to perpetrate that violence in fifteen years if they did not impose the death penalty. That information was not an accurate statement of either the law or the facts. It was misleading, and it is not difficult to see how it could have had a substantial impact on the jurors' decision to impose the death penalty rather than a life sentence. It is quite clear from the prosecutor's entire argument that it was designed to influence them -- to convince them that the risks of letting defendant live were too great, that a life sentence would inevitably mean freedom.\n\nThe Court should not countenance such prosecutorial overreaching in the penalty phase of capital case. When the State seeks forfeiture of life as the penalty for a criminal act, it must do so without reliance upon any form of deception or exaggeration, deliberate or casual, intentional or inadvertent.\n\nThat the defendant acted in a reprehensible and even vicious manner cannot justify the state's departure from strict adherence to basic principles from strict adherence to basic principles of Justice. For our system of Justice to command the respect of society, the law must be applied, in all cases, in a judicious and even-handed manner.\n\nState v. Wood, 648 P.2d 71, 80 (Utah), cert. denied, 459 U.S. 988 (1982).\n\nThe sentencing procedure in capital cases in Utah is\n\nfundamentally different from the procedure in other criminal cases.... In non-capital cases, the trial Judge has broad discretion in selecting an appropriate punishment from among a number of alternatives,... and the sentence need not be based on evidence in addition to that adduced at trial. In capital cases, there must be a separate evidentiary hearing,... which is clearly adversarial and adjudicatory in nature. The sentence must be based on the evidence properly before the court, and the decision is a forced choice between one of only two alternatives.\n\nId. at 83 n.9 (emphasis added; citations omitted).\n\nThere was no evidence properly before the jury on the length of a \"life\" sentence in Utah, nor was the jury instructed by the court regarding the statutory meaning of such a sentence. Against the backdrop, the prosecutor based the major part of his appeal to the jury for a death sentence on the proposition that defendant was a risk to society if allowed to live, and then the prosecutor told the jury that a life sentence would mean incarceration for fifteen years, a misstatement of the law \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and a representation of fact not supported by the evidence. The \"forced choice\" offered this jury was tainted by inadequate information and by prosecutorial misrepresentation about the nature of one of the choices. Therefore, I believe that prejudicial error occurred in the sentencing proceeding and that the sentence of death should be vacated and the case remanded to the trial court for new sentencing proceedings.\n\nI also note that in my view it would be proper, if requested, for a jury to be instructed by the trial court on the law regarding life sentences in Utah. This is so, not only for reasons of fairness, but also by reason of the language of Utah Code Ann. § 76-3-207(3) (Supp. 1987): \"In all proceedings before a jury, under this section, it shall be instructed as to the punishment to be imposed upon a unanimous verdict for death and that to be imposed if a unanimous verdict for death is not found.\"\n\nIn King v. Lynaugh, 828 F.2d 257 (5th Cir. 1987), reh'g granted (Nov. 4, 1987), the defendant challenged the trial court's refusal to permit him to conduct voir dire aimed at determining whether potential jurors held misconceptions about Texas's parole law. The court held that such a voir dire should have been allowed \"ecause widely held misconceptions about the actual effect of imposing a life sentence raise an unacceptable risk that the death penalty may be imposed on some defendants largely on the basis of mistaken notions of parole law.\" Id. at 260. In its Discussion of jury instructions on the minimum duration of a life sentence, the court also stated:\n\n\"he state cannot channel the sentencer's discretion, but must allow it consider any relevant information offered by the defendant.\" Alternative sentences and what, in reality, they mean constitute just such relevant information and circumstances. Although such information does not relate directly to a defendant's character or record, it is an integral part of the calculus sentencers use to determine whether a life sentence will suffice to ensure that a particular defendant, convicted of a particular crime, will pose a continued threat to society.\n\nId. at 263 (quoting McCleskey v. Kemp, 481 U.S. , , 107 S. Ct. 1756, 1774, reh'g denied, 107 S. Ct. 3199 (1987)).\n\nMerely to instruct jurors that \"life imprisonment\" shall be imposed does not adequately inform them, since \"life\" is an ambiguous term in our statutory scheme. Whereas it might ordinarily be construed as referring to incarceration lasting the remainder of the natural life of the defendant (which is what it means in states which define it as \"life imprisonment without the possibility of parole\"), in Utah it simply means that the defendant will be permitted to live and will be incarcerated until paroled, if ever, by the Board of Pardons. Utah Code Ann. § 77-27-9(1) (Supp. 1987). The Board of Pardons develops its own guidelines and determines by internal rules and procedures when an inmate becomes eligible for parole release. A minimum eligibility threshold is not determined by statute.\n\nThe Unanimity Rule\n\n(Part VII of Majority Opinion)\n\nI disagree with the majority opinion's assertion that Utah's first degree murder statute and the Model Penal Code are \"strikingly different.\" Our first degree murder statute appears to be an amalgamation of the definitional portion of the Model Penal Code murder provisions and its death penalty sections. The aggravating circumstances found in the original version of Utah Code Ann. § 76-5-202 are quite similar to the aggravating circumstances listed in section 210.6(3) of the Model Penal Code. Under the Model Penal Code's death penalty provisions, there are two fact-finding stages. The first stage requires a finding of guilt respecting the killing. The second requires a finding of one of the enumerated aggravating circumstances and a finding that no mitigating factors exist calling for leniency. Only after both of these findings have been made can the death penalty be imposed. Our statutory scheme incorporates the aggravating circumstances directly into the definitional portion of the first degree murder statute, thus narrowing the pool of those eligible for the death penalty phase as does the Model Penal Code.\n\nThe State argues correctly that our first degree murder statute is analogous to California's scheme, although California utilizes a more straightforward Model Penal Code structural approach. Like the Model Penal Code, the California statute defines first degree murder as a premeditated killing or a killing in the course of certain felonies. Cal. Penal Code § 189 (West Supp. 1987). Moreover, similar to the Model Penal Code approach, a \"special circumstance proceeding\" is conducted in California after the guilt phase. Cal. Penal Code § 190.1 (West Supp. 1987). California's statute explicitly provides that this special circumstance proceeding demands the same standard of proof and unanimity as the crime charged (i.e., proof beyond a reasonable doubt and a unanimous jury verdict). See Cal. Penal Code § 190.4(a) (West Supp. 1987). The California Supreme Court discussed the applicability of the guilt phase's burden of proof and unanimity requirements to the special circumstance proceeding in People v. Garcia, 36 Cal. 3d 539, 684 P.2d 826, 205 Cal. Rptr. 265 (1984), cert. denied, 469 U.S. 1229 (1985). The court stated:\n\nWe have... noted the resemblance between a special circumstance proceeding and a trial to determine guilt.... \"In the California scheme the special circumstance is not just an aggravating factor: it is a fact or set of facts, found beyond reasonable doubt by a unanimous verdict..., which changes the crime from one punishable by imprisonment of 25 years to life to one which must be punished either by death or life imprisonment without possibility of parole. The fact or set of facts to be found in regard to the special circumstance is not less crucial to the potential for deprivation of liberty on the part of the accused than are the elements of the underlying crime which, when found by a jury, define the crime rather than a lesser included offense or component.\"\n\n36 Cal. 3d at 551-52, 684 P.2d at 832-33, 205 Cal. Rptr. at 271-72 (quoting People v. Superior Court (Engert), 31 Cal. 3d 797, 803, 647 P.2d 76, 183 Cal. Rptr. 800, 803 (1982)).\n\nUnder the Utah Constitution and the Utah Code, a unanimous jury verdict is required in all criminal cases. Utah Const. art. I, § 10; Utah Code Ann. § 77-35-21(b) (Supp. 1987). Moreover, the State must prove each element of the offense beyond a reasonable doubt. Utah Code Ann. § 76-1-501 (1978). \"Element of the offense\" refers to the mens rea or culpable mental state required by the statute and the actus reus or conduct that is proscribed in the definition of the offense. Id.\n\nIn State v. Russell, 733 P.2d 162 (Utah 1987), this Court applied the general rule that unanimity of the jury is not required on the alternative mens rea elements of our second degree murder statute. The majority opinion in Russell pointed out, however, that \"here are limitations on the rule.... If the statute under which the defendant is convicted actually defines more than one crime and not merely one crime which may be committed in several different ways, the defendant is entitled to jury unanimity on which crime he is guilty of committing.\" Id. at 166-67. This standard is consistent with the requirements of federal due process in criminal cases: \"he Due Process Clause protects the accused against conviction except upon proof beyond a reasonable doubt of every fact necessary to constitute the crime with which he is charged.\" In re Winship, 397 U.S. 358, 364 (1970) (emphasis added).\n\nIn a comprehensive Discussion of \"patchwork\" verdicts, one commentator has observed:\n\nWithin broad limits, the legislature has the power to declare how few facts must be found in order to convict the accused.\n\nTwo further points about reasonable doubt and patchwork verdicts should be made. First, as society's moral interest in avoiding a factually erroneous judgment increases, the criminal Justice system responds by trying to decrease the possibility of factual error. For instance, proof beyond a reasonable doubt is required in criminal but no in civil cases; a 5-1 verdict is sufficient in civil but not in criminal cases; criminal trial by jury is required only where six months' imprisonment can be imposed; and no state permits a non-unanimous conviction in a capital case.\n\nAccordingly, all other things being equal, patchwork verdicts should be least acceptable in capital cases and increasingly acceptable in felony, misdemeanor, and civil cases.\n\nTrubitt, \"Patchwork Verdicts, Different-Jurors Verdict, and American Jury Theory: Whether Verdicts are Invalidated By Juror Disagreement On Issues,\" 36 Okla. L. Rev. 473, 531-32 (1983) (emphasis added; citations omitted).\n\nThe foregoing analysis is logical; there should be few, if any, opportunities for the State to convict a defendant of a capital crime under circumstances where the jury need not be unanimous as to each and every legal and essential factual element of the crime. Our statute reads as follows:\n\n76-5-202. Murder in the first degree.\n\n(1) Criminal homicide constitutes murder in the first degree if the actor intentionally or knowingly causes the death of another under any of the following circumstances:\n\n(d) The homicide was committed while the actor was engaged in the commission of, or an attempt to commit, or flight after committing or attempting to commit,... aggravated arson, arson, aggravated burglary, burglary....\n\nThe only intentional killings that qualify as first degree (capital) murder are those accompanied by the specific facts set forth in the statutory list of aggravating circumstances. It is therefore inappropriate to argue that first degree murder is \"one crime which may be committed in several ways.\" Under our statutory scheme, there is no one \"abstract\" crime of capital murder; first degree murder is intentional killing plus \"A,\" intentional killing plus \"B,\" intentional killing plus \"C,\" and so on. \"A,\" \"B,\" and \"C\" are all different facts or circumstances. They are distinct factual and legal elements of the crime of first degree murder, each of which must be proved beyond a reasonable doubt, and concerning each of which the jury must render a unanimous verdict.\n\nIn this case, however, the problem of legislative specificity moves to yet a deeper level. One way to read our statute is that undertaken by the majority opinion, namely to determine that subparagraph (d) merely requires that the State prove that an intentional killing was committed in the course of any of certain serious felonies. The argument is that it does not matter whether the jury is unanimously convinced that the defendant was engaged in, for example, rape or kidnapping, so long as they are all convinced that it was one or the other, since both \"aggravate\" the killing in a similar fashion.\n\nThe majority of the cases articulating the foregoing rationale are cases in which there was a question about whether the jury had convicted on a theory of intentional murder or traditional (unintentional) felony-murder. See, e.g., State v. Encinas, 132 Ariz. 493, 647 P.2d 624 (1982); People v. Milan, 9 Cal. 3d 185, 507 P.2d 956, 107 Cal. Rptr. 68 (1973); State v. Wilson, 220 Kan. 341, 552 P.2d 931 (1976); Fitzpatrick v. State, 638 P.2d 1002 (Mont. 1981); State v. Anderson, 27 Utah 2d 276, 495 P.2d 804 (1972). These cases are not helpful because, like State v. Russell, they were essentially state of mind or intent cases: the jurors could legitimately decide whether the facts justified an inference of intentional killing or unintentional killing in the course of a felony. There was no reason to be concerned in those cases that the State might have failed to meet its burden of proof regarding the existence of the predicate felony. In fact, it did not matter if the State had not convinced all of the jurors of the predicate felony beyond a reasonable doubt, because the remainder of the jurors had to be convinced that the killing was intentional in order to vote for conviction. In other words, all of the jurors in these cases were convinced that the defendant killed either with the requisite intent or under circumstances which made intent irrelevant.\n\nUnder our first degree murder statute, the same reasoning does not apply. If a defendant is accused, for example, of intentionally killing while in the commission of rape and kidnapping, a patchwork general verdict permits the possibility that the State can obtain a conviction for \"intentional killing during rape\" and \"intentional killing during kidnapping\" without ever convincing all of the jurors that either a rape or a kidnapping occurred. Whereas it does not matter in the traditional felony-murder cases whether an individual juror finds that intent existed or that the felony was committed, it may matter a great deal whether one juror is convinced that there was a rape but no kidnapping (e.g., the victim accompanied the defendant willingly but did not consent to sex) or no rape but a kidnapping (e.g., the victim was abducted but thereafter consented to sex). It is not at all difficult, as the foregoing hypothetical suggests, to project a scenario where only six jurors are persuaded that the defendant committed a rape and only six are persuaded that the defendant committed a kidnapping, yet the defendant is eligible for the death penalty because, and only because, of those crimes, neither of which the State has been able to prove unanimously.\n\nThe majority opinion states that \"there was only one actus reus for the crime charged, causing the death of another. There are not alternatives for the actus reus of the charged crime.\" Although a unanimous jury may be convinced that a defendant committed the single actus reus, an intentional killing, if some members of the jury believe the defendant guilty under on \"theory\" and others under another, as the majority opinion permits, the State has proved only second degree murder (intentional killing) beyond a reasonable doubt to a unanimous jury. Thus, two quite different legal results -- second degree murder and an indeterminate term of five years to life or first degree murder and a possible death sentence -- may be associated with the single actus reus. In this case, the general verdict does not show that the State has proved any aggravating circumstance beyond a reasonable doubt to a unanimous jury, and therefore I assert that it is not entitled to a conviction of capital murder.\n\nIt is significant that the State concedes in its brief that\n\na compelling argument can be made that charging a felony circumstance under section 76-5-202(1) (d) is tantamount to charging the commission of the felony separately, and thus the state should have to operate under the same burden as it would in a regular trial on the felony -- i.e., proof beyond a reasonable doubt and jury unanimity on the defendant's guilt of the felony.\n\nHaving made that concession, the State has confined itself in the briefs to arguing that the general unanimity instruction given in this case was adequate and that if the failure to give a specific unanimity instruction was error, it was harmless. In that context, I do not understand the majority's willingness to go even farther than the State's position on the question of error.\n\nThe general instruction on jury unanimity given in this case was entirely inadequate to inform the jury of its obligation to decide unanimously regarding the charged arson and burglary. Error was therefore committed, and the only remaining question is whether it may be considered harmless. Because I believe there is no legal basis under the merger doctrine, discussed hereafter, for a first degree murder conviction on these facts, I do not reach the issue of harmless error.\n\nBased on the foregoing analysis, I believe that a unanimous verdict of the jurors on the specific felony charged is necessary to convict a defendant of first degree murder under section 76-5-202(1) (d) because (1) in capital cases, the consequence of error or ambiguity in the verdict is extreme and the need for certainty very high, and (2) the specific felony charged is an inherent part of the definition of the crime, and due process requires that each of its elements be established beyond a reasonable doubt. I agree with the following statement the Washington Supreme Court in State v. Green, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e 94 Wash. 2d 216, 233, 616 P.2d 628, 638 (1980):\n\nIn the instant case..., the alternative ways of committing aggravated murder in the first degree are themselves separate and distinct criminal offenses. In order to convict a defendant of either kidnapping or rape, the State must prove every statutory element of that crime beyond a reasonable doubt to a unanimous jury. Where, as here, the commission of a specific underlying crime is necessary to sustain a conviction for a more serious statutory criminal offense, jury unanimity as to the underlying crime is imperative.\n\nMerger Doctrine\n\n(Part VIII of Majority Opinion)\n\nDefendant argues that because the burglary and arson proved in this case were obviously only incidental to the homicide, they \"merge\" into the killing and may not properly be used as aggravating circumstances under our capital statute. Although I agree with the majority opinion that most of the cases defendant cites are inapposite because they deal with traditional felony-murder rules applicable only to unintentional killings. I think his basic premise is correct.\n\nThe issue is straightforward. Utah Code Ann. § 76-5-202(1) (d) makes an intentional killing first degree murder if \"he homicide was committed while the actor was engaged in the commission of... arson,... burglary.\" (Emphasis added.) Defendant argues that the legislature intended that persons who commit intentional killings in furtherance of, or in order to facilitate or hide, the enumerated felonies be exposed to the death penalty. The State takes the position that the legislature intended rather to enhance the penalty when any intentional killing is carried out by means of one of the felonies or coincidentally at the same time as the killing. Put another way, the issue is whether the killing was done to further, or in connection with, the felony, or whether the felony was committed to further, or in connection with, the killing.\n\nBoth positions have some basic in logic, and neither is clearly compelled by the statutory language \"while the actor was engaged in....\" It is necessary in this instance for the Court to infer the most likely intent of the legislature from the context and history of our capital punishment statute.\n\nAs I pointed out in my Discussion of the unanimity rule, Utah's death penalty statute parallels quite closely the design and language of the Model Penal Code, although the aggravating factors are set forth as part of the definition of first degree murder in the Utah statute, rather than separately in the penalty provisions as they are in the Model Penal Code. The language of Model Penal Code § 210.6 is virtually identical to that of our statute:\n\n(3) Aggravating Circumstances.\n\n(e) The murder was committed while the defendant was engaged... in the commission of... [certain enumerated felonies, all involving potential violence].\n\nThe only commentary on the section says:\n\n(e)... identif further in which the death penalty should be considered. concern murder committed in connection with designated felonies, each of which involves the prospect of violence to the person.\n\nII American Law Institute, Model Penal Code and Commentaries (Official Draft and Revised Comments), § 210.6, at 137 (1980) (emphasis added). There being no further explanation of the intent of the Code's authors regarding the \"while engaged in\" language in the death penalty provision, it is instructive to note that identical language is used in the \"felony-murder\" portion of the Model Penal Code, dealing with unintentional killings. Model Penal Code § 210.2 presumes the \"recklessness and indifference\" necessary to make an unintentional killing murder \"if the actor is engaged... in... [the same enumerated felonies as in death penalty provisions plus felonious escape].\" Since the authors used identical language, it is fair to conclude that they intended the language to be construed similarly in both sections. It is, furthermore, quite clear from the commentary to section 210.2 that the Model Penal Code's authors rejected any expansion of the traditional felony-murder rule and approved attempts made prior to the Model Code to restrict its application.\n\nBeyond the operation of this presumption [of recklessness and indifference], it is the submission of the Model Code that the felony-murder doctrine should be abandoned as an independent basis for establishing the criminality of homicide.\n\nId. § 210.2, at 30. In light of that submission, it is highly unlikely that the Model Penal Code drafters intended a construction of the \"while engaged in\" language that would result in an extension of the application of the felony-murder concept. The commentary cites the following historic developments in the felony-murder rule approval:\n\nOther judicial limitations on the rule were accomplished by several different methods. First, courts required that the felony be \"independent\" of the homicide. Under this theory, an assault with a deadly weapon could not support a conviction for felony murder because the assault is an offense included in the charge of homicide. Still other courts narrowly construed the period during which the felony was in the process of commission as a method of limiting the operation of the rule.\n\nThese limitations confine the scope of the felony-murder rule, but they do not resolve it essential illogic.\n\nId. § 210.2, at 34-36 (citations omitted). I conclude that the Model Penal Code language was intended to include killings incidental to felonies and not felonies incidental to killings.\n\nThe State concedes in its brief that the Utah death penalty statute is closely analogous to California's, which is also modeled on the Model Penal Code. The California statutory language is \"while the defendant was engaged in... the commission of,\" Language that is virtually identical to \"while the actor was engaged in the commission of,\" the Utah formulation. The construction given the California statute by the California Supreme Court is therefore relevant and helpful. In People v. Green, 27 Cal. 3d 1, 609 P.2d 468, 164 Cal. Rptr. 1 (1980), that court, discussing an earlier version of the California language which, although worded differently, had an identical meaning, said.\n\ne infer that the purpose of the Legislature was to comply insofar as possible with what it understood to be the mandate of Furman and Gregg et al. At the very least, therefore, the Legislature must have intended that each special circumstance provide a rational basis for distinguishing between those murderers who deserve to be considered for the death penalty and those who do not. The Legislature declared that such a distinction could be drawn, inter alia, when the defendant committed a \"willful, deliberate and premeditated\" murder \"during the commission\" of a robbery or other listed felony. [Former § 190.2 subd. (c)(3).] The provision thus expressed a legislative belief that it was not unconstitutionally arbitrary to expose to the death penalty those defendants who killed in cold blood in order to advance an independent felonious purpose, e.g., who carried out an execution-style slaying of the victim of or witness to a holdup, a kidnapping, or a rape.\n\nThe Legislature's goal is not achieved, however, when the defendant's intent is not to steal but to kill and the robbery is merely incidental to the murder... because its sole object is to facilitate or conceal the primary crime.... To permit a jury to decide who will live and who will die on the basis of whether in the course of committing a first degree murder the defendant happens to engage in ancillary conduct that technically constitutes robbery or one of the other listed felonies would be to revive \"the risk of wholly arbitrary and capricious action\" condemned by the high court plurality in Gregg. We conclude that regardless of chronology such a crime is not a murder committed \"during the commission\" of a robbery within the meaning of the statute.\n\n27 Cal. 3d at 61-62, 609 P.2d at 505-06, 164 Cal. Rptr. at 38-39 (citations omitted). It is logic to assume that the Utah Legislature intended similarly restrictive, rather than expansive, import to the phrase \"while engaged in the commission of.\" The use of the Model Penal Code language supports such a view, as does the reasoning used by the California Supreme Court in Green.\n\nThere is no question on this record that the felonies charged were committed to advance the killing, rather than vice versa. Therefore, what we have in this case is a murder coincidentally accomplished by means of burglary and arson. Absent some other legitimate aggravating factors (several of which may have been present here but were not charged or proved), defendant was improperly convicted of first degree murder, and the conviction should be reduced to a first degree felony.\n\nConclusion\n\nBecause of the operation the merger doctrine and the absence of a unanimous verdict on an aggravating circumstance, I would vacate defendant's first degree murder conviction. Because of prosecutorial misconduct, I would also vacate the death penalty. Defendant is entitled to a reduction of his conviction to second degree murder. Utah Code Ann. § 76-1-402(5) (1978); State v. Bolsinger, 699 P.2d 1214 (Utah 1985).\n\nZIMMERMAN, Justice (Concurring and Dissenting)\n\nI concur with the majority in parts I, II, III, IV, V, VI, IX, X, and XI. I Dissent from parts VII and VIII and join Justice Durham's opinion as it regards the analysis of the unanimity and merger questions. I also agree with her that with respect to the merger issue, the failure of the State to charge and prove legally sufficient aggravating circumstances requires that the death penalty be reversed, that the conviction be reduced to second degree murder, and that the matter be remanded for sentencing.\n\n\u003cspan class=\"fn\"\u003e1. Defendant told the police during a prearrest interview that he and Sagers had driven to Ogden, Utah, on the night of the murder and had returned to his apartment and spent the night together.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. State v. Hales, 652 P.2d 1290, 1292 (Utah 1982); Utah R. Evid. 103 (effective Sept. 1, 1983 (replacing rules 4 and 5 of the Utah Rules of Evidence (1971)); Boyce \u0026 Kimball, Utah Rules of Evidence 1983, 1985 Utah L. Rev. 63, 68. As it applies to criminal jury instructions, this principle is stated in Utah Rule of Criminal Procedure 19(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. 78 Utah 350, 2 P.2d 1050 (1931).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See id. at 362-65, 2 P.2d at 1056; see also id. at 378-79, 2 P.2d at 1062 (Cherry, C.J. Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. 90 Utah 89, 60 P.2d 952 (1936) (appeal from voluntary manslaughter conviction following trial for murder).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Id. at 100-02, 60 P.2d at 958.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Utah Code Ann. § 76-3-206(2) (1978) provides as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe judgment of conviction and sentence of death shall be subject to automatic review by the Utah State Supreme Court within 60 days after certification by the sentencing court of the entire record unless time is extended an additional period not to exceed 30 days by the Utah State Supreme Court for good cause shown. Such review by the Utah State Supreme Court shall have priority over all other cases and shall be heard in accordance with rules promulgated by the Utah State Supreme Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Utah Code Ann. § 77-35-26(8)-(10) (Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Utah Code Ann. § 76-3-207(4) (Supp. 1987) provides, in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUpon any appeal by the defendant where the sentence is of death, the appellate court, if it finds prejudicial error in the sentencing proceeding only, may set aside the sentence of death and remand the case to the trial court for new sentencing proceedings to the extent necessary to correct the error or errors. No error in the sentencing proceedings shall result in the reversal of the conviction of a capital felony. In cases of remand for new sentencing proceedings, all exhibits and a transcript of all testimony and other evidence properly admitted in the prior trial and sentencing proceedings shall be admissible in the new sentencing proceedings...\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See supra notes 2 through 6 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. 572 P.2d 1338 (Utah 1977), cert. denied, 439 U.S. 882 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. 573 P.2d 343 (Utah 1977), cert denied, 439 U.S. 882 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. 648 P.2d 71 (Utah 1981), cert. denied, 459 U.S. 988 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. 675 P.2d 577 (Utah 1983), cert. denied, 466 U.S. 942 (1984), overruled on other grounds, State v. Hansen, 734 P.2d 421, 427 (Utah 1986) (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Norton, 675 P.2d at 581; Codianna, 573 P.2d at 351; see also Wood, 648 P.2d at 77; Pierre, 572 P.2d at 1345 n.9, 1352.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. 648 P.2d at 77 (citing Pierre, 572 P.2d 1338; Cobo, 90 Utah 89, 60 P.2d 952; Stenback, 78 Utah 350, 2 P.2d 1050).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In a case involving appeal of an involuntary manslaughter conviction, this Court heretofore stated: \"It is not the duty nor prerogative of the appellate court to search the record or the instructions to find error.\" State v. Rasmussen, 92 Utah 357, 379, 68 P.2d 176, 186 (1937) (Larson, J., Concurring in part, Dissenting in part).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We also note that this Court has heretofore reviewed errors which were not specifically assigned as error, but were argued in the appellants' briefs. See, e.g., State v. Bleazard, 103 Utah 113, 115-16, 133 P.2d 1000, 1001 (1943) (appeal from conviction for involuntary manslaughter).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See Pierre, 572 P.2d at 1345 n.9; Stenback, 78 Utah at 378-79, 2 P.2d at 1056; see also Cobo, 90 Utah at 102, 60 P.2d at 958. Indeed, Wood was only enumerating that part of the death penalty appellate review standard which gives us the power (not the required duty) to notice and correct manifest and prejudicial errors apparent on the face of the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See supra notes 3-14 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Notwithstanding our standard or review in death penalty cases, this Court still views invited error with disfavor, and we continue to consider the existence of such error when deciding death penalty cases on appeal. See infra notes 40-41 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. 408 U.S. 238 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Griffin v. California, 380 U.S. 609, 615 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Hales, 652 P.2d at 1291.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See Chapman v. California, 386 U.S. 18, 23-24 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Delaware v. Van Arsdall, 475 U.S. 673, , 106 S. Ct. 1431, 1436 (1986); see also Rose v. Clark, 106 S. Ct. 3101, 3109 (1986); United States v. Hasting, 461 U.S. 499, 510 (1983) (plurality opinion); Chapman, 386 U.S. at 24. But see State v. Tucker, 709 P.2d 313, 316 (Utah 1985) (implying the \"reasonable likelihood\" standard is proper in disposing of federal constitutional error), overruled on other grounds, State v. Long, 721 P.2d 483, 487, 492 (Utah 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See Hasting, 461 U.S. at 512.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Cf. State v. Lairby, 699 P.2d 1187, 1206 (Utah 1984) (plurality opinion) (\"We conclude it is not reasonably probable that the error in question affected the reliability of the outcome of the trial. This is not a case where there were repeated efforts to elicit testimony regarding a defendant's silence.... \").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See Hales, 652 P.2d at 1292 (\"A curative instruction is often mentioned by courts as an important consideration in reviewing the constitutionality of prosecutorial comments.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. A prosecutor may not assert arguments he knows to be inaccurate. State v. Williams 656 P.2d 450, 454 (Utah 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See State v. Knight, 734 P.2d 913, 919 (Utah 1987); State v. Tucker, 727 P.2d 185, 187-88 (Utah 1986) (per curiam); State v. Banner, 717 P.2d 1325, 1335 \u0026 n.47 (Utah 1986); State v. Fontana, 680 P.2d 1042, 1048 (Utah 1984); State v. Hutchison, 655 P.2d 635, 637 (Utah 1982); accord State v. Jerry Velarde, 734 P.2d 449, 456 (Utah 1986); State v. Tarafa, 720 P.2d 1368, 1372 (Utah 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See Berger v. United States, 295 U.S. 78, 84-89 (1935).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See State v. Rebeterano, 681 P.2d 1265, 1268 (Utah 1984); State v. Collins, 612 P.2d 775, 777-78 (Utah 1980); State v. Abel, 600 P.2d 994, 998 (Utah 1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See Abel, 600 P.2d at 998. In making this determination, we do not decide whether evidence of a polygraph test is even admissible to impeach a prosecution witness. Nevertheless, for Discussion of the subject, see generally Commonwealth v. Moore, 379 Mass. 106, 112-14, 393 N.E.2d 904, 909-10 (1979) and cases cited therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. We also note that during cross-examination outside the presence of the jury, the examiner admitted that he could not unequivocally state that Sagers' test results were not a product of fear, guilt, or other \"things\" unrelated to her actual involvement with this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Utah Code Ann. § 76-3-207(2) (g) (Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Cf. State v. Maestas, 564 P.2d 1386, 1389 (Utah 1977) (\"Courts have found no prejudice where information that may be brought out by further questioning was already before the jury either from the testimony of others or by implication from the witness' own testimony.\") (footnote omitted); State v. Rammel, 721 P.2d 498, 500 (Utah 1986) (limiting further cross-examination was not prejudicial error because it would not have had a substantial influence in bringing about a different verdict).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The evidence does not reflect the average term served in Utah under a life sentence or whether the estimates made by the prosecutor or defense counsel were accurate. Also, the issue is not before us of whether juries should be questioned on their understanding or instructed on the law of what a sentence of life imprisonment means in Utah.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. State v. Gaxiola, 550 P.2d 1298, 1301 (Utah 1976); State v. Valdez, 30 Utah 2d 54, 60, 513 P.2d 422, 426 (1973); see also State v. Creviston, 646 P.2d 750, 754 (Utah 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Appellant's Brief at 54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See State v. Eagle, 611 P.2d 1211, 1214 (Utah 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. State v. Gleason, 17 Utah 2d 150, 151, 405 P.2d 793, 795 (1965); State v. Thompson, 110 Utah 113, 130-31, 170 P.2d 153, 162 (1946); see also State v. Stone, 18 Utah 289, 291, 422 P.2d 194, 195 (1967) (if the objector fails to preserve the record by calling attention to objections, one could easily invite error by silence).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See State v. Garcia, 100 Idaho 108, 110, 594 P.2d 146, 148 (1979) (second degree murder); Utah R. Evid. 103. Under the generally accepted rule, any error such as that claimed by defendant here is harmless. See State v. Dorton, 696 P.2d 1218, 1219 (Utah 1985) (per curiam); State v. Fisher, 680 P.2d 35, 37-38 (Utah 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See supra notes 41-42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. See supra note 30 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Our law permits trial counsel wide latitude in presenting closing arguments to the jury. This is because closing arguments are not evidentiary in nature; and at such arguments, counsel are permitted to comment on the evidence already introduced and to argue reasonable inferences therefrom. See supra note 38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. See Creviston, 646 P.2d at 754.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See generally Pulley v. Harris, 465 U.S. 37 (1984); Andrews v. Morris, 677 P.2d 81 (Utah 1983); Pierre v. Morris, 607 P.2d 812, 814 (Utah 1980); Andrews v. Morris, 607 P.2d 816 (Utah), cert. denied, 449 U.S. 891 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. 572 P.2d at 1345.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. 648 P.2d at 71.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See generally Palmes v. Wainwright, 725 F.2d 1511, 1524 (11th Cir.), cert. denied, 469 U.S. 873 (1984); State v. Lambright, 138 Ariz. 63, 76, 673 P.2d 1, 14 (1983) (en banc), cert. denied, 469 U.S. 892 (1984); Hopkinson v. State, 664 P.2d 43, 62-63 (Wyo.), cert. denied, 464 U.S. 908 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Duplicity is the joinder of two or more distinct and separate offenses in a single count. See United States v. UCO Oil Co., 546 F.2d 833, 835 (9th Cir. 1976), cert. denied, 430 U.S. 966 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. See State v. Russell, 733 P.2d 162, 165 (Utah 1987) (plurality opinion) (second degree murder); State v. James, 698 P.2d 1161, 1163 (Alaska 1985) (assault); see also State v. Whitney, 508 Wash. 2d 506, , 739 P.2d 1150, 1153 (1987) (en banc) (first degree rape).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. 173 N.Y. 122, 65 N.E. 989 (1903). The Sullivan rationale has been adopted in most other jurisdictions that have considered the issue. See, e.g., Wells v. Commonwealth, 561 S.W. 2d 85, 88 (Ky. 1978) and cases cited therein. In Wells, the defendant asserted that the instruction given the jury, by creating the possibility of a verdict that was not unanimous, violated his due process right because proof beyond a reasonable doubt was not assured on each element of the offense charged. Id. at 87. The court stated: \"The 6th and 14th amendments of the United States Constitution do not require a unanimous verdict in criminal cases tried in state courts, and lack of unanimity among jurors does not violate the requirement of proof beyond a reasonable doubt.\" Id. (citations omitted); see also State v. Encinas, 132 Ariz. 493, 496-97, 647 P.2d 624, 627-28 (1982) (en banc) (first degree murder); People v. Nye, 63 Cal. 2d 166, 403 P.2d 736, 741, 45 Cal. Rptr. 328, 333 (1965) (en banc) (first degree murder), cert. denied, 384 U.S. 1026 (1966); People v. Milan, 9 Cal. 3d 185, 194-95, 507 P.2d 956, 961-62, 107 Cal. Rptr. 68, 73-74 (1973) (en banc) (first degree murder); State v. Duncan, 312 N.W.2d 519, 523-24 (Iowa 1981) (burglary); People v. Fullwood, 51 Mich. App. 476, 481-82, 215 N.W.2d 594, 596-97 (1974) (first degree murder); Whitney, 508 Wash. 2d at , 739 P.2d at 1151-53; State v. Arndt, 87 Wash. 2d 374, 377, 384, 553 P.2d 1328, 1330, 1334 (1976) (en banc) (grand larceny); Holland v. State, 91 Wis. 2d 134, 280 N.W.2d 288, 293 (1979) (second degree murder), cert. denied, 445 U.S. 931 (1980); cf. United States v. Payseno, 782 F.2d 832, 835 (9th cir. 1986) (\"Normally, a general instruction on the requirement of unanimity suffices to instruct the jury that they must be unanimous on whatever specifications form the basis of the guilty verdict.\"). While many of the cited cases involve felony-murder situations, the rationale underlying the decisions is nonetheless persuasive to this case. See also (infra) note 60 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. 173 N.Y. at 127, 65 N.E. at 989-90 (citation omitted; emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. 87 Wash. 2d 374, 553 P.2d 1328.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. Id. at 376, 553 P.2d at 1329 (emphasis omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Id. at 377, 553 P.2d at 1330 (emphasis omitted; citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. See id.; see also Russell, 733 P.2d at 166-67. In Arndt, the court noted four factors to consider in deciding whether a statute defines and proscribes a single offense or multiple offenses: \"[1] the title of the act; [2] whether there is a readily perceivable connection between the various acts set forth; [3] whether the acts are consistent with and not repugnant to each other; and [4] whether the acts may inhere in the same transaction.\" 87 Wash. 2d at 379, 553 P.2d at 1331; see also Whitney, 108 Wash. 2d at , 739 P.2d at 1152-53. Similarly, in UCO Oil Co., 546 F.2d at 836-37, that court enumerated the factors as follows: (1) the language of that statute itself; (2) the legislative history; (3) the nature of the proscribed conduct; and (4) the appropriateness of multiple punishments for the conduct charged in the indictment. Applying these factors, it is clear that the Utah legislature has defined and proscribed a single offense in section 76-5-202, the intentional or knowing killing of an individual in connection with one or more aggravating circumstances. Also, there is no evidence that the Utah legislature intended, by section 76-5-202, to expose defendants to multiple punishments. Therefore, a single punishment was envisioned for a violation of the statute. See Bell v. United States, 349 U.S. 81 (1955) (absent contrary evidence, court assumed congress envisioned a single punishment for violation of statute at issue).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. 87 Wash. 2d at 377-78, 553 P.2d at 1330.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Cf. State v. Bolsinger, 699 P.2d 1214, 1219 (Utah 1985) (plurality opinion) (second degree murder); State v. Fontana, 680 P.2d at 1045 (second degree murder).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Cf. 699 P.2d at 1219; 680 P.2d at 1045. In State v. Souhrada, 122 Mont. 377, 385, 204 P.2d 792, 796 (1949) (manslaughter), the court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is not necessary that a jury, in order to find a verdict, should concur in a single view of the transaction disclosed by the evidence. If the Conclusion may be justified upon either of two interpretations of the evidence, the verdict cannot be impeached by showing that a part of the jury proceeded upon one interpretation and part upon another.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Cf. Model Penal Code § 210.2 comment 4, at 21 (1980) (criminal homicide constitutes murder when committed recklessly under circumstances manifesting extreme indifference to value of human life; recklessness presupposes awareness of creation of risk); Blango v. United States, 373 A.2d 885, 888-89 (D.C. 1977) (different societal interests served by the felony-murder and burglary statutes). The record reflects that at the time of the fire and the victim's death, two other individuals were living in the basement apartment of the victim's residence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. See State v. Anderson, 27 Utah 2d 276, 278, 495 P.2d 804, 805 (1972); see also Utah R. Crim. P. 21(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. See Fisher, 680 P.2d at 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Id. at 37-38 (quoting Anderson, 27 Utah 2d at 278, 495 P.2d at 805).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. See supra notes 41-42 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. 408 U.S. 238 (1972); see also Andrews, 607 P.2d at 823.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. 802 F.2d 1256 (10th Cir. 1986), cert. pending.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. 802 F.2d at 1263.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Id. (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. Id. at 1264.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See Utah Const. art. I, § 10; Utah R. Crim. P. 21(b); see also Wells, 561 S.W.2d at 87-88; State v. Hazelett, 8 Or. App. 44, , 492 P.2d 501, 502-03 (1972); State v. Reyes, 209 Or. 595, 621-23, 308 P.2d 182, 189-90 (1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Several cases have apparently used a multiple-part test in dealing with unanimity issues. Therein, where more than one mode of committing a crime is charged, the jury is not required to agree unanimously as to which alternative mode was used to commit the crime as long as the alternatives are not repugnant to each other and there is substantial evidence to support a conviction upon each of the alternative modes. Arndt, 87 Wash. 2d at 376, 553 P.2d at 1329-30; State v. Jones, 22 Wash. App. 506, 510, 591 P.2d 816, 818-19 (1979). When this test is met, there is no requirement that the jury verdict be unanimous as to the means used to commit the crime. Concerning this test, if a single offense can be committed by several different means, the several means are not repugnant unless proof of one disproves the other. See State v. Richardson, 24 Wash. App. 302, 305, 600 P.2d 696, 698 (1979) (citing State v. Parmenter, 74 Wash. 2d 343, 352, 444 P.2d 680, 686 (1968)). Even in regard to this test, it is clear in this case that proof of facts supporting a finding of one of the aggravating circumstances charged would not necessarily disprove facts concerning any of the other circumstances charged. The second part of this test requires that there be substantial evidence to support a conviction on each of the alternative modes. This requirement is satisfied if there is sufficient evidence from which the jury can reasonably infer the existence of a fact. Id. In this case, the evidence clearly indicates that the jury could reasonably infer the existence of each of the aggravating circumstances alleged in the jury instructions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. See Russell, 733 P.2d at 165; see also State v. Weddle, 29 Utah 2d 464, 466, 511 P.2d 733, 735 (1973); Thompson, 110 Utah 113, 170 P.2d 153; State v. Roedl, 107 Utah 538, 155 P.2d 741 (1945); Rasmussen, 92 Utah 357, 68 P.2d 176 (1937) (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. 94 Wash. 2d 216, 616 P.2d 628 (1980) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. See id. at 232, 616 P.2d at 638.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. 94 Wash. 2d at 230, 232, 616 P.2d at 636-38; see also 108 Wash. 2d at , 739 P.2d at 1151.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. 94 Wash. 2d at 233, 616 P.2d at 638.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. 108 Wash. 2d 506, 739 P.2d 1150.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. Id. at, 739 P.2d at 1152-53 (emphasis in original; citations omitted) (quoting in part State v. Franco, 96 Wash. 2d 816, 823-24, 639 P.2d 1320, 1324 (1982)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. While felony-murder cases cited in this opinion are persuasive in regard to the rationale and analysis underlying unanimity issues, see supra notes 53, 60, and accompanying text, cases involving felony-murder statutes are inapposite to the issue of whether our first degree murder (nonfelony-murder-type) statute itself requires application of the merger principle. See infra pages 34-39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. Utah Code Ann. § 76-5-202 (1978 \u0026 Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. See People v. Henderson, 19 Cal. 3d 86, 92, 560 P.2d 1180, 1183, 137 Cal. Rptr. 1, 4 (1977) (en banc); People v. Talbot, 64 Cal. 2d 691, 414 P.2d 633, 641-42, 51 Cal. Rptr. 417, 425-26 (1966) (en banc), cert. denied, 385 U.S. 1015 (1967), overruled on other grounds, People v. Wilson, 1 Cal. 3d 431, 442, 462 P.2d 22, 29, 82 Cal. Rptr. 494, 501 (1969) (en banc); C. Torcia, Wharton's § 145, at 201 (14th ed. 1979); Ledewitz, The New Role of Statutory Aggravating Circumstances in American Death Penalty Law, 22 Duq. L. Rev. 317, 327 (1984) (\"Classic felony murder does not concern intentional killings.... The major purpose of the crime of felony murder is to reach negligent or accidental killings that would not otherwise qualify as murder.\"); see also Wilson, 1 Cal. 3d at 440, 462 P.2d at 28, 83 Cal. Rptr. at 500; State v. Lashley, 233 Kan. 620, 631, 664 P.2d 1358, 1369 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. Utah Code Ann. § 76-5-202 (Supp. 1973); see also Utah Code Ann. § 76-5-202 (1978 \u0026 Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Model Penal Code § 210.6(3) (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Model Penal Code § 210.2 (1980); see also § 210.2 comment 7, at 42 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. Model Penal Code § 210.6 comment 7, at 142 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89.. Id.; see also § 210.6 comment 7, at 147-48 (1980); § 210.6 comment 5, at 135 (1980); § 210.2 comment 7, at 42 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. Utah Code Ann. § 76-5-202(1) (1978 § Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Model Penal Code § 210.6 comment 5, at 135 (1980) (footnote omitted; emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. See, e.g., Blango, 373 A.2d at 888-89; State v. Rupe, 226 Kan. 474, 478-79, 601 P.2d 675, 679 (1979); State v. Reams 292 Or. 1, 5-15, 636 P.2d 913, 915-21 (1981) (en banc); State v. Mercer, 34 Wash. App. 654, 661-62, 663 P.2d 857, 861 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. See, e.g., Wilson, 1 Cal. 3d at 440, 462 P.2d at 28, 82 Cal. Rptr. at 500.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. See McMillan v. Pennsylvania, 477 U.S. 79, , 106 S. Ct. 2411, 2417 (1986); see generally Hughes v. Mathews, 576 F.2d 1250, 1255 (7th Cir.), cert. dismissed, 439 U.S. 801 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. See Gregg v. Georgia, 428 U.S. 153, 175 (1976) (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. See, e.g., Hughes, 576 F.2d at 1255.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. See Wood, 648 P.2d at 77; Godfrey v. Georgia, 446 U.S. 420, 427-28 (1980) (plurality opinion) (quoting Gregg, 428 U.S. at 188; Furman, 408 U.S. at 313); see also State v. Spoon, 137 Ariz. 105, 110, 669 P.2d 83, 88 (1983) (en banc) (burglary predicated on intent to commit aggravated assault may serve as a basis for a felony-murder conviction); State v. Miniefield, 110 Ariz. 599, 602, 522 P.2d 25, 28 (1974) (en banc) (arson, although dependent to the homicide, provided the basis for a felony murder conviction); Strong v. State, 251 Ga. 540, 541, 307 S.E.2d 912, 913-14 (1983) (aggravated assault upon the homicide victim can support a finding of felony murder); Baker v. State, 236 Ga. 754, 757-58, 225 S.E.2d 269, 271-72 (1976) (merger doctrine rejected in felony-murder context even when underlying felony is integral part of homicide).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. See supra note 62 and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. Wood, 648 P.2d at 83. Utah Code Ann. § 76-5-202 should thus be read literally, not narrowly, in the absence of legislative intent to the opposite. See Fontana, 680 P.2d at 1046 (quoting Utah Code Ann. § 76-1-106 (1978)); See also Duncan v. State, 436 So. 2d 883, 904-05 (Ala. Crim. App. 1983), cert. denied, 464 U.S. 1047 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. See, e.g., State v. Richmond, 112 ARiz. 228, 231-32, 540 P.2d 700, 703-04 (1975) (en banc); State v. Dudrey, 30 Wash. App. 447, 450-55, 635 P.2d 750, 751-53 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. Utah Code Ann. § 76-6-202(1) (1978) (emphasis added); see also Roberts v. State, 252 Ga. 227, 241, 314 S.E.2d 83, 96 (1984); State v. McGuire, 131 Ariz. 93, 96, 638 P.2d 1339, 1342 (1981) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. Utah Code Ann. § 76-3-207(2)(a) (Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. Cf. Barclay v. Florida, 463 U.S. 939, 951 n.8 (1983) (plurality opinion) (defendant could not reasonably contend that United States Constitution forbids making criminal record an aggravating circumstance).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. See generally Zant v. Stephens, 462 U.S. 862 (1983); Gregg, 428 U.S. 163. At least one federal circuit court has made it clear that non-statutory aggravating circumstances may be used in capital sentencing without violating the federal constitution. See Henry v. Wainwright, 721 F.2d 990, 993-94 (5th Cir. 1983), cert. denied, 466 U.S. 993 (1984) (citing Barclay, 463 U.S. at 956); see also Zant, 462 U.S. at 885-86. Because defendant has not claimed that any non-statutory circumstances were considered other than those treated above, we need not address that issue, nor has the question ever been treated under our own constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. See generally, e.g., Kagehiro \u0026 Stanton, Legal vs. Quantified Definitions of Standards of Proof, 9 Law \u0026 Hum. Behav. 159 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. No. 19907 (Utah, filed Apr. 26, 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. Although the argument to the trial court in Bishop was somewhat confusing regarding which stage of the panel selection process Bishop was attacking, and although Tillman's argument on appeal is cursory at best, Bishop focuses his appeal on the initial stage of the system, the use of voter registration lists as the \"master list\"; in other words, he contends that voter registration lists fail to accurately survey a cross-section of the community of eligible jurors. Neither defendant has claimed that Hispanics are intentionally excluded from the process or that voter registration lists were unfairly compiled or represented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. Utah Code Ann. §§ 78-46-4(6), -11(1), (2) (Supp. 1985) (amended 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. Utah Code Ann. § 78-46-11(1), (3) (Supp. 1985) (amended 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. Utah Code Ann. § 78-46-12(2), (3) (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. Utah Code Ann. §§ 78-46-12(8), -13(1)-(2) (1987); see also Utah Code Ann. §§ 78-46-8(2) (1987) (persons not qualified for jury service), -15 (excuse from jury service).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. See Utah Code Ann. § 78-46-3 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. Utah Code Ann. § 78-46-2 (1987) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is the policy of this state that persons selected for jury service be selected of the population of the area served by the court, and that all qualified citizens have the opportunity in accordance with this act to be considered for jury service and have the obligation to serve as jurors when summoned for that purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. See Aripa v. Department of Social and Health Serv., 91 Wash. 2d 135, 139, 588 P.2d 185, 188 (1978) (en banc) (\"Statutory policy statements as a general rule do not give rise to enforceable rights and duties.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUtah Code Ann. § 78-46-16 (1987) provides, in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) Within seven days after the moving party discovered, or by the exercise of diligence could have discovered, the grounds therefore, and in any event before the trial jury is sworn to try the case, a party may move to stay the proceedings or to quash an indictment, or for other appropriate relief, on the ground of substantial failure to comply with this act in selecting a grand or trial jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) The procedures prescribed by this section are the exclusive means by which a person accused of a crime, the state, or a party in a civil case may challenge a jury on the ground that the jury was not selected in conformity with this act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. Section 78-46-16 appears to have been modeled somewhat after the Federal Jury Selection Act, 28 U.S.C. § 1867 (1982). In regard to the exclusivity provision of 28 U.S.C. § 1867(e) (corresponding to section 78-46-16(3) of the Utah Act), the senate report stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSubsection (e) makes clear that the procedures prescribed in this section are the exclusive means for challenging compliance with the statute. Challenge procedures existing under other laws are left intact for purposes of asserting rights created by other laws and for enforcing constitutional rights, but such other procedures may not be used to challenge compliance with this statute. Your committee feels constrained to recognize that these alternatives for raising rights created by other statutes and for raising constitutional challenges are not affected by the Act. This recognition is particularly apt in light of recent Supreme Court decisions indicating that the manner in which constitutional rights may be raised cannot be narrowly prescribed. See, e.g., Henry v. Mississippi, 379 U.S. 443, 447 (1965); Douglas v. Alabama, 380 U.S. 415, 422 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eS. Rep. No. 891, 90th Cong., 1st Sess. 35 (1967). We find this language persuasive in deciding, as we do, that constitutional challenges to panels should be brought outside the framework of the Act. See also Utah R. Crim. P. 18(c) (challenge to panels).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. Duncan v. Louisiana, 391 U.S. 145, 148-49 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. Id. at 149.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. See Duren v. Missouri, 439 U.S. 357, 363 (1979); Taylor v. Louisiana, 419 U.S. 522, 527-28 (1975); see also State v. Bankhead, 727 P.2d 216, 217 (Utah 1986) (per curiam).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. See People v. Harris, 36 Cal. 3d 36, 57, 679 P.2d 433, 445, 201 Cal. Rptr. 782, 794 (plurality opinion), cert. denied, 469 U.S. 965 (1984); United States v. Gordon, 493 F. Supp. 814, 820-21 (N.D.N.Y. 1980) and authorities cited therein, aff'd, 655 F.2d 478 (2d Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. Taylor, 419 U.S. at 538.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. Duren, 439 U.S. at 364.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. Id. at 368 (construing Taylor, 419 U.S. at 533-35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. At his hearing below, Bishop appears to have contended that various minorities could be grouped to satisfy Duren. This is not permissible. See, e.g., State v. Hilliard, 89 Wash. 430, 442, 573 P.2d 22, 29 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. Appellant Bishop's Opening Brief at 65-66, State v. Bishop, No. 19907.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. E. g., Hernandez v. Texas, 347 U.S. 475, 479-80 (1954). Even the Court in Hernandez warned that whether such a group did in fact exist was a question of fact in any given community. Id. at 478.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. United States v. Hanson, 472 F. Supp. 1049, 1052-53 (D. Minn. 1979), aff'd, 618 F.2d 1261 (8th Cir.), cert. denied, 449 U.S. 854 (1980). Some of the cases relied upon by the parties in Bishop arose pursuant to equal protection claims. Although fair cross-section claims are in certain respects analogous to discrimination claims under the equal protection clause of the fourteenth amendment, there are significant distinctions which must be observed. See, e.g., Duren, 439 U.S. at 368 n.26. For example, because in sixth amendment challenges the focus is on fair cross-section issues and not on the issue of discrimination, a defendant is not required to show bad faith, and a prima facie showing of systematic exclusion may not be rebutted by proof of a nondiscriminatory intent. United States v. Jenison, 485 F. Supp. 655, 660 (S. D. Fla. 1979). Additionally, standing exists regardless of the race or class of a defendant. Duren, 439 U.S. at 359 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. 36 Cal. 3d 36, 679 P.2d 433, 201 Cal. Rptr. 782.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. 36 Cal. 3d at 51, 679 P.2d at 441, 201 Cal. Rptr. at 790.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. 419 U.S. 522.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. 439 U.S. 357.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. 439 U.S. at 364, 370; 419 U.S. at 531.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. Willis v. Zant, 720 F.2d 1212, 1216 (11th Cir. 1983) (\"The distinctiveness and homogeneity of a group under the sixth amendment depends upon the time and location of the trial.\"), cert. denied, 467 U.S. 1256 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. 439 U.S. at 364\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134. 36 Cal. 3d at 49, 679 P.2d at 440, 201 Cal. Rptr. at 789.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135. The Court notes that defendants' benchmark statistic is premised upon the percentage of persons of Spanish origin in the total population rather than the percentage of Hispanics in the eligible population. With respect to the total population figure, again the general population is used.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis is true despite the availability of figures for persons 18 years of age and older in both the general population category and the Spanish origin category: 398,890 general population and 17,179 population of Spanish origin, resulting in a benchmark statistic of 4.31 percent. These figures were released in 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136. It is noted that no official list of recognized Spanish surnames was used, although such lists have been used in the past to generate census data. See U.S. Census of Population-1950, vol. IV, pt. 3, ch. C; see also United States Dep't of Justice, Immigration and Naturalization Serv. Spanish Name Book (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe prosecutor in Bishop argued below that three months was not a sufficient period in which to conduct this survey. In apparent response, Bishop states in his brief:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA complete examination of the county clerk's records for the period January 1, 1983 through December 31, 1983, showed that 5,074 were called to serve as veniremen in criminal cases in Third District Court. Based on the population makeup of Salt Lake County, 253 veniremen (4.98 %) during the period should have been of Spanish origin. However, only 107 Spanish-surnamed individuals (or 2.11 %) were in fact called as prospective jurors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137. See Hanson, 472 F. Supp. at 1052 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138. For Discussion of some models used by other courts, see State v. Lopez, 107 Idaho 726, 730-33,, 692 P.2d 370, 375-77 (Idaho Ct. App. 1984), and United States v. Test, 550 F.2d 577, 586-90 (10th Cir. 1976). Although Test was decided prior to Duren, the Tenth Circuit Court of Appeals has said that Duren reinforced the reasoning of Test. United States v. Yazzie, 660 F.2d 422, 426 (10th Cir. 1981), cert. denied, 455 U.S. 923 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139. See 439 U.S. at 364, 366.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Even if the principle of juror unanimity as to aggravating circumstances could have been violated under the instruction, the assumed error would clearly be harmless because there is no real dispute in this case that the defendant in fact committed arson, aggravated arson, burglary, and aggravated burglary. That evidence is not really contested.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Significantly, the Utah Legislature has excluded aggravated assault as a predicate offense from the first degree murder and second degree felony-murder provisions of Utah law. Therefore, aggravated assault is not a predicate felony upon which either first or second degree murder may not be based.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Burglary is defined by Utah Code Ann. § 76-6-202(1) (1978) as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA person is guilty of burglary if he enters or remains unlawfully in a building or any portion of a building with intent to commit a felony or theft or commit an assault on any person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAggravated burglary is defined by Utah Code Ann. § 76-6-203(1) (1978) as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA person is guilty of aggravated burglary if in attempting, committing, or fleeing from a burglary, the actor or another participant in the crime:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) Causes physical injury to any person who is not a participant in the crime; or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) Uses or threatens the immediate use of a dangerous or deadly weapon against any person who is not a participant in the crime; or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(c) Is armed with a deadly weapon or possesses or attempts to use any explosive or deadly weapon.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The great breadth of the burglary statute might well give rise to constitutional questions if prosecutors charge first degree murder on every possible application of that statute. See Utah Code Ann. §§ 76-2-201, 202 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The statutory provisions regarding eligibility for parole of persons convicted of first degree homicide and sentenced to life imprisonment are found in Utah Code Ann. § 77-27-9(1) (Supp. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 As the majority points out, the Washington Supreme Court in State v. Whitney, 108 Wash. 2d 506, 739 P.2d 1150 (1987), recently retreated from this language. However, I still believe that it represents a well-reasoned view of this issue.\u003c/span\u003e\n\n",
    "body_length": 176545,
    "citedas": [
      "750 P.2d 546",
      "72 Utah Adv. Rep. 6"
    ],
    "attorneys": "Martin Verhoef, James N. Barber, David E. Yocom, for Appellant. David L. Wilkinson, David B. Thompson, for Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Hall, Chief Justice; Stewart, Associate Chief Justice, Concurring and Concurring in the Result; Howe, Justice, Concurring in the Result; Durham, Justice, Concurring and Dissenting; Zimmerman, Justice, Concurring and Dissenting.",
    "citation_count": 3
  }
}
