{
  "id": "6oZfP2YBTlTomsSBnnBP",
  "document": {
    "title": "City of Watseka v. Illinois Public Action Council and American Civil Liberties Union",
    "full_title": "CITY OF WATSEKA, COUNTY OF IROQUOIS AND STATE OF ILLINOIS, A HOME RULE MUNICIPALITY, AND ERNEST A. GROVE, MAYOR OF WATSEKA, INDIVIDUALLY AND IN HIS OFFICIAL CAPACITY v. ILLINOIS PUBLIC ACTION COUNCIL AND AMERICAN CIVIL LIBERTIES UNION",
    "jurisdiction": "Seventh Circuit",
    "date": "1986-07-18T00:00:00.000Z",
    "docket": "No. 84-2605",
    "body": "Before WOOD, JR., and COFFEY, Circuit Judges, and GRANT , Senior District Judge.*fn*\n\nWOOD, Jr., Circuit Judge. The City of Watseka passed a solicitation ordinance which, among other provisions, limited door-to-door soliciting to the hours between 9:00 a.m. and 5:00 p.m., Monday through Saturday. The Illinois Public Action Council, whose activities the new ordinance affected, advised the city that it believed the ordinance violated the First and Fourteenth Amendments of the United States Constitution. The city filed this action seeking a declaratory judgment that the ordinance was constitutional. The district court held that the ordinance violated the First Amendment. We affirm.\n\nI. FACTS\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nOn October 15, 1979, the City of Watseka, Illinois (\"Watseka\") adopted the controversial ordinance regulating soliciting in the village. According to the ordinance preamble, Watseka adopted the solicitation regulation in response to numerous complaints from Watseka residents about solicitors or persons claiming to be solicitors making \"nuisances of themselves by disturbing and annoying the occupants, or by their acts and conduct have violated the right of the occupants to the quiet and peaceful enjoyment and security of their homes, and in some cases persons have sought admittance to a residence as a solicitor for the purpose of gaining information for some illegal purpose or to commit an illegal act.\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The ordinance defined soliciting\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and required all solicitors to register with the city clerk, who was directed to issue Certificates of Registration to all applicants except persons who had been convicted of a felony within five years of the date of the application for the Certificate of Registration, applicants who had been convicted of a violation of the solicitation ordinance, or any person whose Certificate of Registration had previously been revoked.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The ordinance further provided that residents could forbid solicitation at their residences by posting a sign.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The ordinance made it unlawful to solicit \"prior to 9:00 o-clock A.M. or after 5:00 o-clock P.M. of any weekday, or at anytime on a Sunday or on a state or national holiday.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nOn March 18, 1981, a representative of the Illinois Public Action Council (\"IPAC\") requested permission from Watseka to conduct a door-to-door political canvass from June 1 to July 31, 1981, between the hours of 4:00 p.m. and 9:00 p.m. IPAC is a not-for-profit Illinois corporation representing low and moderate income persons before Congress and the Illinois Legislature. IPAC canvasses to obtain new members, to educate the public, and to identify voters who will support its positions on issues of utility, energy, and tax policy and economic development. The mayor, Ernest Grove, replied in a letter dated March 20, 1981, the IPAC would be required to restrict its activities to the hours between 9:00 a.m. and 5:00 p.m. in accordance with the ordinance. IPAC informed the mayor that its normal working hours are 4:00 p.m. to 9:00 p.m., Monday through Friday, because IPAC found that more people were home during this period. Furthermore, IPAC advised Watseka that it believed that the First and Fourteenth Amendments of the United States Constitution protected IPAC's right to canvass, and that Watseka's restriction on the hours of solicitation violated IPAC's right. Watseka notified IPAC that it must comply with the city's ordinance regulating soliciting or run the risk of prosecution. On August 31, 1982, an attorney from the American Civil Liberties Union (\"ACLU\") representing IPAC informed Watseka of his opinion that the time limitation in the city's solicitation ordinance was unconstitutional.\n\nOn August 8, 1982, Watseka filed a complaint in Illinois state court seeking a declaratory judgment as to the constitutionality of the provision regulating hours of solicitation. IPAC and the ACLU, the named defendants,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e moved to have the case removed to federal court. Following removal, the defendants filed an answer asserting, inter alia, that their activities did not fall within the definition of soliciting in the ordinance\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and that the ordinance violated IPAC's First Amendment rights. The defendants also filed a Fed. R. Civ. P. 12(b) counterclaim requesting declaratory, injunctive, and monetary relief. The defendants claimed that the ordinance was unconstitutionally vague and overbroad and an impermissible restriction on speech. Both parties filed motions for summary judgment supported by affidavits.\n\nIn its motion, IPAC again contended that the ordinance was an unconstitutional abridgment of IPAC's First Amendment right to freedom of speech. In support of this contention, IPAC submitted affidavits stating that its activities included canvassing to obtain new members and citizen support for issues, mobilizing letter writing and other means of communication with public officials, and arranging public education programs. Additionally, an IPAC solicitor stated in his affidavit that, \"in my four years of canvassing experience, I have found it an unvarying rule that the number of citizens contacted increases with each hour of canvassing in a normal workday, i.e., from 4 p.m. to 9 p.m.\"\n\nCiting Village of Schaumburg v. Citizens for a Better Environment, 444 U.S. 620, 632, 63 L. Ed. 2d 73, 100 S. Ct. 826 (1980), and Association of Community Organizations for Reform Now v. City of Frontenac, 714 F.2d 813 (8th Cir. 1983), the district court found that, \"IPAC's canvassing and solicitation activities are clearly protected by the First Amendment to the United States Constitution,\" and although \"Watseka has the power to regulate the activities of canvassers and solicitors if the regulation is in furtherance of a legitimate governmental objective, \" the regulation of canvassing and soliciting must be undertaken \"with due regard for the reality that solicitation is characteristically intertwined with informative and perhaps persuasive speech-seeking support for particular causes or for particular views on economic, political, or social issues, and for the reality that without solicitation the flow of such information and advocacy would likely cease.\" The district court determined that the city bore the burden of establishing the statute's constitutionality because it allegedly infringed on the exercise of First Amendment rights. Relying on Heffron v. International Society for Krishna Consciousness, Inc., 452 U.S. 640, 69 L. Ed. 2d 298, 101 S. Ct. 2559 (1981), the district court determined that, \"the validity of regulation which infringes upon the exercise of First Amendment Freedoms will be sustained, 'only if the regulation is narrowly drawn to further a legitimate governmental objective unrelated to the restriction of communication, and if it does not unduly intrude upon the exercise of First Amendment rights.'\" The district court found that there were less restrictive alternatives available to Watseka to protect its citizens from unwanted canvasses.\n\nII. THE FIRST AMENDMENT AND DOOR-TO-DOOR SOLICITATION\n\nThe Supreme Court has recognized substantial First Amendment protection for door-to-door solicitors. See Wisconsin Action Coalition v. City of Kenosha, 767 F.2d 1248, 1251 (7th Cir. 1985) (cataloguing Supreme Court cases).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Simultaneously, the Court has recognized the right and power of a municipality to regulate solicitation, so long as the regulation is in furtherance of a legitimate governmental objective. See, e.g., Heffron, 452 U.S. at 647-48; see also Kenosha, 767 F.2d at 1251 (listing other Supreme Court cases). One such legitimate municipal objective is protecting the privacy of its citizens, including the quiet enjoyment of their homes. Kenosha, 767 F.2d at 1251-52 (\"peace and quiet in the home in the evening is a significant and commendable municipal objective deserving of every protection by constitutional means\"); see also Carey v. Brown, 447 U.S. 455, 471, 65 L. Ed. 2d 263, 100 S. Ct. 2286 (1980) (a municipality's \"interest in protecting the well-being, tranquility and privacy of the home is certainly of the highest order in a free and civilized society\"). Another legitimate municipal objective which will justify a properly drawn solicitation ordinance is the prevention of crime. Kenosha, 767 F.2d at 1252 n.2. Watseka intended its ordinance to advance both of these objectives. Although we conclude that Watseka constitutionally overreached, its good intentions are apparent and understandable.\n\nIt is therefore clear that IPAC has some First Amendment protection for its solicitation and Watseka has some power to regulate solicitation in furtherance of its objectives of protecting its citizens' privacy and preventing crime. The issue we must decide is whether Watseka's ban on solicitation from 5 p.m. to 9 p.m.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Monday through Saturday is consistent with the First Amendment. Watseka, as the proponent of an ordinance that allegedly infringes upon IPAC's First Amendment rights, has the burden of establishing that the statute is constitutional. Kenosha, 767 F.2d at 1252 (listing Supreme Court precedent).\n\nA. Standard of Review\n\nThe Supreme Court has never clearly articulated the proper legal standard for reviewing an ordinance placing time restrictions on solicitation. We acknowledged, but did not find it necessary to resolve, this issue in Wisconsin Action Coalition v. City of Kenosha, 767 F.2d 1248, 1252-57 (7th Cir. 1985) (discussing the Supreme Court's consideration of time, place, and manner restrictions in Village of Schaumburg v. Citizens for a Better Environment, 444 U.S. 620, 636-37, 63 L. Ed. 2d 73, 100 S. Ct. 826 (1980); Heffron v. International Society for Krishna Consciousness, Inc., 452 U.S. 640, 648, 69 L. Ed. 2d 298, 101 S. Ct. 2559 (1981); Clark v. Community for Creative Non-Violence, 468 U.S. 288, 82 L. Ed. 2d 221, 104 S. Ct. 3065, 52 U.S.L.W. 4986, 4987-89 (U.S. June 29, 1984); Members of City Council v. Taxpayers for Vincent, 466 U.S. 789, 804-12, 80 L. Ed. 2d 772, 104 S. Ct. 2118 (1984); Secretary of State v. Joseph H. Munson Co., 467 U.S. 947, 81 L. Ed. 2d 786, 104 S. Ct. 2839, 52 U.S.L.W. 4875, 4878-81 (U.S. June 26, 1984)). In Kenosha, we invalidated a city ordinance prohibiting charitable, religious, and political solicitation between 8:00 p.m. and 8:00 a.m.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e In so doing, we acknowledged the split in circuits between the Third Circuit standard, see Pennsylvania Alliance for Jobs \u0026 Energy v. Council of Munhall, 743 F.2d 182, 185 (3d Cir. 1984) (\"ample alternative channels of communication\" standard) and the Eighth Circuit standard, see Association of Community Organizations for Reform Now v. City of Frontenac, 714 F.2d 813, 818-19 (8th Cir. 1983) (\"less restrictive means\" standard); see also New York City Unemployed \u0026 Welfare Council v. Brezenoff, 677 F.2d 232, 237-39 (2d Cir. 1982) (least restrictive means); New York Community Action Network, Inc. v. Town of Hempstead, 601 F. Supp. 1066, 1070 (E.D.N.Y. 1984) (interpreting Brezenoff); West Virginia Citizens Action Group, Inc. v. Daley, 324 S.E.2d 713, 721-25 (W. Va. 1984) (resolving the split in favor of Frontenac standard). Although we expressed some preference for the Eighth Circuit approach in Kenosha, 767 F.2d at 1254-57, the statute in Kenosha failed both standards and thus it was not necessary for us to choose between the two. Id. at 1254.\n\nBefore considering the standard to be adopted, we note that, contrary to assertions by IPAC, the outcome of this case is not controlled by Kenosha. Numerous factual differences make this a more difficult case than Kenosha. For example, in Kenosha we pointed out that the city presented only the affidavit of the city attorney in support of its motion for summary judgment. 767 F.2d at 1250. We noted that \"the City's failure to present any evidence other than this affidavit in support of the ordinance severely impairs its position. Perhaps a stronger offer of evidence by the City could have produced a different result.\" Id. Watseka clearly made a better showing than Kenosha, offering multiple affidavits and statistics in support of its motion, as well as a prevention of crime rationale not asserted by Kenosha. See id. at 1252 n.2 The outcome of this case is therefore not controlled by Kenosha, although our decision is greatly aided by Kenosha's analysis.\n\nWe now find it appropriate to make the step which we discussed but stopped short of taking in Kenosha, i.e., determining the appropriate standard. Both the Third Circuit ample-alternative-channels-of-communication standard and the Eighth Circuit less-restrictive-means standard are thoughtful attempts to distill a consistent analysis from the various Supreme court cases that have considered time, place, and manner restrictions. Guided by these two approaches, and having the benefit of the recent Supreme Court decision in City of Renton v. Playtime Theatres, 475 U.S. 41, 89 L. Ed. 2d 29, 106 S. Ct. 925, 54 U.S.L.W. 4160 (U.S. Feb. 25, 1986), we see a four-part test developing. To sustain a time, place, and manner restriction on First Amendment activities, the government must show that the restriction (1) is content-neutral, (2) serves a legitimate governmental objective, (3) leaves open ample alternative channels of communication, and (4) is narrowly tailored to serve the governmental objective.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe Supreme Court has long held that regulations enacted for the purpose of restraining speech on the basis of its content presumptively violate the First Amendment. See Renton, 54 U.S.L.W. at 4161-62; Heffron, 452 U.S. at 648; Carey, 447 U.S. at 462-63 \u0026 n.7; Police Department of Chicago v. Mosley, 408 U.S. 92, 95, 98-99, 33 L. Ed. 2d 212, 92 S. Ct. 2286 (1972). For example, in the recent case of Regan v. Time, Inc., 468 U.S. 641, 82 L. Ed. 2d 487, 104 S. Ct. 3262, 52 U.S.L.W. 5084 (1984), the Court struck down a statute regulating the photographing of currency because the statute impermissibly discriminated on the basis of content. Id. at 5086-87 (statute permitted only \"philatelic, numismatic, educational, historical, or newsworthy\" photographs).\n\nIt is well-established that a content-neutral regulation that infringes upon speech protected by the First Amendment must be designed to serve a legitimate governmental objective. See Renton, 54 U.S.L.W. at 4161-62; Clark, 52 U.S.L.W. at 4987; Heffron, 452 U.S. at 649. Furthermore, the regulation must leave open ample alternative channels of communication. See Renton, 54 U.S.L.W. at 4161-62; Clark, 52 U.S.L.W. at 4987; Heffron, 452 U.S. at 648. So long as the amount of speech left open is ample, it is not fatal that the regulation diminishes the total quantity of speech. See Vincent, 466 U.S. at 803 n.23 (Court upheld ordinance despite \"assuming that the ordinance diminishes the total quantity of . . . speech\").\n\nThe Seventh Circuit has applied the ample alternative channels of communication standard stringently - we have required the government to that the alternatives to the prohibited activities are ample and adequate.\" See Kenosha, 767 F.2d at 1256 (criticizing the Third Circuit in Marshall for not adequately scrutinizing alleged alternatives). This is consistent with the approach taken by the Supreme Court in Vincent, where the Court looked at the adequacy of the alternative channels, noting that the appellees failed to show \"that the posting of political posters on public property is a uniquely valuable or important mode of communication, or that appellees' ability to communicate effectively is threatened by ever-increasing restrictions on expression.\" 466 U.S. at 812 (emphasis added).\n\nThe Supreme Court does not always spell out the \"narrowly tailored\" step as part of its standard for evaluating time, place, and manner restrictions. See, e.g., Renton, 54 U.S.L.W. at 4162 (\"the appropriate inquiry . . . is whether the . . . ordinance is designed to serve a substantial governmental interest and allows for reasonable alternative avenues of communication\"). Nevertheless, the Court has included this as part of its analysis in many cases. For example, in Renton Justice Rehnquist noted that \"the Renton ordinance is 'narrowly tailored' to affect only that category of theaters shown to produce the unwanted secondary effects, thus avoiding the flaw that proved fatal to the regulations in Schad v. Mount Ephraim, 452 U.S. 61, 68 L. Ed. 2d 671, 101 S. Ct. 2176 (1981), and Erznoznik v. City of Jacksonville, 422 U.S. 205, 45 L. Ed. 2d 125, 95 S. Ct. 2268 (1975).\" 54 U.S.L.W. at 4163. See also Clark, 52 U.S.L.W. at 4988 (\"the regulation narrowly focuses on the Government's substantial interest\"); Vincent, 466 U.S. at 808 (\"incidental restriction on expression\" must be \"narrowly tailored to serve [the government's legitimate] interest\"); Schad, 452 U.S. at 68-71; Grayned v. City of Rockford, 408 U.S. 104, 116-17, 33 L. Ed. 2d 222, 92 S. Ct. 2294 ; Mosley, 408 U.S. at 98-99. Because the Third Circuit standard in Munhall does not give sufficient weight to this element of the Supreme Court's analysis, that approach is incomplete. The Eighth Circuit's standard in Frontenac, the so-called less-restrictive-means standard, we consider to be more faithful to the Supreme Court's approach.\n\nAs we pointed out in Kenosha, if there is a less restrictive alternative to a challenged regulation, then the ordinance is not as precise and narrowly drawn as it could be, and the regulation unnecessarily interferes with First Amendment rights. 767 F.2d at 1255; see also Daley, 324 S.E.2d at 724-25 (\"Whether explicitly or implicitly, less restrictive alternatives must be considered in order to determine whether the challenged regulation is sufficiently narrow so as not to prohibit that which should be protected.\"). The Supreme Court has both emphasized the need for precision in the regulation of the exercise of First Amendment rights, see, e.g., Vincent, 466 U.S. at 801 (\"the application of the ordinance in this case responds precisely to the substantive problem with legitimately concerns the City\"), see also Kenosha, 767 F.2d at 1255 (listing other Supreme Court precedent), and considered the possibility of less restrictive means in analyzing particular solicitation regulations, see, e.g., Heffron, 452 U.S. at 654 (less restrictive alternative inadequate to advance government's interest); Schaumburg, 444 U.S. at 635-39 (the government's \"legitimate interest . . . can be better served by measures less intrusive than a direct prohibition on solicitation\"). In Vincent, the Supreme Court reiterated that government regulations affecting First Amendment rights are justified \"if the incidental restriction on alleged First Amendment freedoms is no greater than is essential to the furtherance of [the government's legitimate] interest.\" 466 U.S. at 805 (quoting United States v. O'Brien, 391 U.S. 367, 377, 20 L. Ed. 2d 672, 88 S. Ct. 1673 (1968)). We therefore conclude that the Supreme Court, when analyzing whether a regulation is narrowly tailored, requires the government to show both that there is a significant relationship between the regulation and the governmental interest, see Kenosha, 767 F.2d at 1257 (\"actual connection between the restriction and the served interest\"), and that less restrictive alternatives are inadequate to protect the governmental interest.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e To the extent that the Eighth Circuit less-restrictive-means standard accurately addresses all the concerns raised by the Supreme Court in the cases discussed above, we favor that standard over the less inclusive Third Circuit standard.\n\nB. Watseka's Ordinance\n\nHaving set out the standard we will apply, we turn to Watseka's ordinance. Watseka easily satisfied the first two parts. IPAC does not claim that Watseka's ordinance is not content-neutral. We have already noted that the protection of its citizens' peace and quite enjoyment of their homes, as well as the prevention of crime, are obviously legitimate municipal objectives. The remaining issues are (1) whether the Watseka ordinance leaves open ample alternative channels of communication and (2) whether the ordinance is narrowly tailored to serve Watseka's legitimate objectives.\n\nThe Watseka ordinance was a comprehensive attempt by the city to deal with the problems which the city perceived as arising from door-to-door solicitation. In addition to forbidding all solicitation except between the hours of 9 a.m. and 5 p.m. on Monday through Saturday, the ordinance also required all solicitors to register with the city clerk, who would issue Certificates of Registration. The ordinance also provided that citizens could forbid solicitation at their residences by posting a sign.\n\nIn its motion for summary judgment, Watseka explained that it passed the statute because of citizen complaints that solicitors, specifically solicitors calling at hours other than 9 a.m. to 5 p.m. violated the quite and peace of the citizens' homes. Watseka also claimed that solicitors had sought admittance to residences at hours other than 9 a.m. to 5 p.m. \"for illegal purposes or acts.\" Watseka contended that a substantial number of its work-force citizens were unavailable to be contacted between 6 p.m. and 9 p.m. and that a substantial number of the residents home in the evening were elderly and feared evening crime. Watseka also alleged that crime is more prevalent after 5 p.m. Finally, Watseka contended that solicitors coming door-to-door after 5 p.m. disturbed the enjoyment of Watseka residents' dinner hour.\n\nTo support its contentions, Watseka submitted a copy of the ordinance and several affidavits. The preamble to the ordinance states, in conclusory terms, that the city council had received complaints about solicitors and found it necessary to pass the ordinance.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In the affidavit of Mayor Ernest A. Grove, the mayor alleged that he was aware of problems with solicitors, in particular solicitors who operated at night when the city offices were closed so that the solicitors could fraudulently take orders and collect payments for nonexistent products. Mayor Grove and Mary Mull, who oversaw the Watseka Senior Citizens Center, asserted that Watseka has a large number of senior citizens, many of whom live alone. Both testified that several senior citizens (who were not identified) had expressed fear over strangers coming to their doors at night. Watseka presented the affidavits of three people involved in law enforcement, including the retired Watseka police chief, testifying that the incidence of crime is greater after dark. Watseka's final affidavit came from an officer of the Watseka Chamber of Commerce and asserted that the major employers in the Watseka area used three shifts for around-the-clock employment.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nAgainst this background we must determine whether Watseka's ordinance is narrowly tailored to serve Watseka's legitimate interests in protecting the privacy of its citizens, including the quiet enjoyment of their homes, and preventing crime. To be more specific, we must examine the incremental increase in the restriction of IPAC's First Amendment rights attributable to Watseka's ban on all solicitation after 5 p.m. to see whether there is a significant relationship between that particular restriction, in light of the other safeguards in the statute, and Watseka's interests.\n\nFirst, we examine whether the nighttime ban was sufficiently connected to Watseka's interest in preventing crime. Most of Watseka's evidence on the incidence of crime concerned crime after dark, not crime between 5 p.m. and 9 p.m.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Watseka did not (and could not) argue that 5 p.m. is synonymous with darkness year-round.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e During much of the spring, summer, and fall months, in view of daylight savings time, there are hours of daylight remaining after 5 p.m. available for sports, gardening, and numerous other outdoor activities, which is one of the purposes of daylight savings time. Although Watseka presented statistics of day crime rates and night crime rates, all statistics are statewide, and Watseka failed to present any evidence of its crime rate (or whether its nighttime crime rate went down during the three years the ordinance was in effect). Watseka failed to offer any evidence of its crime rate between 5 p.m. and 9 p.m. Watseka failed to in any link the evidence on nighttime crime to solicitation (i.e., there is no evidence either of any crime being perpetrated by alleged solicitors or of differences in crime rates when no solicitation takes place). Finally, Watseka failed to offer any evidence to substantiate its claim that the ordinance lessened the burden on its police force which it claimed unregulated soliciting caused. Watseka failed to offer any explanation why the people who came within the ordinance's definition of soliciting posed any greater burden on the police, or threat of crime, than the numerous other visiting strangers that the ordinance did not purport to cover. Someone with an illegitimate intent has options besides posing as a solicitor. Common ones, for example, are the pretense of looking for someone at the wrong address, the need for emergency use of the telephone, or a claim that entrance is needed to check for gas leaks, and so forth. Unfortunately, for the devious there is not shortage of opportunities.\n\nWatseka also failed to back up its assertion that the ordinance prevented fraud and embezzlement. The only evidence Watseka presented was Mayor Grove's bare assertion that \"it has been commonplace, from time to time, for persons purporting to be solicitors to call at residences after dark, purport to make installment sales of merchandise or services, take a substantial down payment, and then disappear from the community without later providing the product or service purchased.\" Such a conclusory assertion by an interested party, particularly when unsupported by any statistics or firsthand knowledge of any actual crimes, lends little if any support to Watseka's claim. Watseka's concern with fraud is not due to solicitation by legitimate organizations such as IPAC. It also implies that many residents of Watseka are easily duped, which we consider to be an exaggeration. Darkness can have little to do with the fraudulent sale of merchandise. Watseka fails to offer any evidence that such crime is more prevalent after 5 p.m. The general state-wide evidence of evening crime which Watseka presented concerned crimes such as rape and robbery, not fraud and embezzlement. We thus find no evidence of a relationship between Watseka's prevention of crime objective and the 5 p.m. to 9 p.m. ban on solicitation. Therefore, the ordinance is not narrowly tailored to achieve Watseka's legitimate interest in preventing crime.\n\nLikewise, Watseka fails to prove a significant relationship between protecting the quiet enjoyment and peace of its residents and the 5 p.m. to 9 p.m. ban. Another provision of the ordinance allows Watseka residents to protect themselves from all solicitors at all times simply by posting signs. The 5 p.m. to 9 p.m. ban is essentially an attempt by Watseka to substitute its judgment for that of its citizens. In Citizens for a Better Environment v. Village of Olympia Fields, 511 F. Supp. 104 (N.D. Ill. 1980), Judge Marovitz said:\n\nTo support the restrictions on this ground [of annoyance] is to derogate the First Amendment rights of plaintiffs and those of defendants' residents who would be willing recipients of plaintiffs' message during the evening hours to the nuisance concerns of those of their residents who would not be willing listeners during those hours, when the wishes of both groups can be easily accommodated.\n\nId. at 107. Watseka is attempting to roll up the front sidewalks of all its citizens at a very early hour. Even Girl Scouts will have a difficult time selling their cookies by 5 p.m. In a general way, the homeowner grants permission to the public, for appropriate purposes, to enter the homeowner's property at reasonable times and walk to the owner's front door and ring the bell that is there for that purpose. The resident then can make his or her own decision about whether or not to receive the caller.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nAs we pointed out above, Watseka has already provided unwilling listeners with a mechanism to ban all solicitors from their property at any time the listeners desire. A resident who does not want to be disturbed during dinner but is willing to talk to canvassers thereafter can post the sign during dinner and take it down once the table is cleared. Watseka can prosecute any solicitor who disturbs a resident posting a no solicitation sign. The only additional effect of the citywide 5 p.m. to 9 p.m. ban is to deprive willing listeners of the canvassers' message. This is inconsistent with Watseka's declared policy in the ordinance that \"the occupant or occupants of the residences in this City shall make the determination of whether solicitors shall be, or shall not be, invited to their respective residences.\" ยง 19-5. The ban is not sufficiently related to Watseka's legitimate objective of protecting its citizens' peace and quiet enjoyment of their homes. Because the 5 p.m. to 9 p.m. ban is not narrowly tailored to serve Watseka's legitimate interests, it is not a valid time, place, and manner restriction. Renton, 54 U.S.L.W. at 4163.\n\nThe ordinance also fails as a time, place, and manner restriction because Watseka had less restrictive means available to achieve its objectives. As we mentioned in Kenosha, the Supreme Court and other courts have noted approval for less restrictive alternatives to protect the homeowner's privacy interest. 767 F.2d at 1257 (citing Munson, 467 U.S. 947, 104 S. Ct. 2839, 2850 n.10, 81 L. Ed. 2d 786 ; Schaumburg, 444 U.S. at 638-39; Martin v. Struthers, 319 U.S. at 148; Frontenac, 714 F.2d at 819; New York Community Action Network, Inc. v. Town of Hempstead, 601 F. Supp. 1066, 1071 (E.D.N.Y. 1984); Village of Olympia Fields, 511 F. Supp. at 107; Daley, 324 S.E.2d at 72). For example, a city can enforce its trespass law against solicitors who enter or remain on private property after the owner has indicated the solicitor is not welcome. Id. Watseka had already provided that a homeowner can bar all solicitors by posting a sign, or any particular solicitor at any time by asking the solicitor to leave. Watseka also has in place a comprehensive registration scheme. Watseka made no effort to establish that a complete ban provided any greater protection of its citizens' privacy than the significantly less restrictive alternatives which Watseka is already using.\n\nWatseka also failed to offer evidence that its legitimate objective of preventing crime cannot be served satisfactorily be enforcing Watseka's application and registration requirements for solicitors, as well as by enforcing laws against trespass, fraud, burglary, and other offenses against a resident on his or her property. See Frontenac, 714 F.2d at 819; Daley, 324 S.E.2d at 725. Watseka's attempt to safeguard its citizens' privacy and protect them from crime is laudable, and the majority of the ordinance's provisions are narrowly tailored to promote Watseka's objectives with only minimal interference with First Amendment rights. Indeed, IPAC is more than willing to comply with Watseka's registration requirements and to honor all \"No Solicitors\" signs. It is only the 5 p.m. to 9 p.m. complete ban on solicitation that fails to pass constitutional muster, in light of the less restrictive alternatives Watseka has available to it, many of which Watseka has in fact already incorporated into the ordinance.\n\nFinally, Watseka failed to show that the alternatives left open to IPAC are ample and adequate. Watseka argues that IPAC can still canvass in public places, canvass during the daytime (9 a.m. to 5 p.m.), and canvass by mail or over the phone. Although the Third Circuit found similar alternatives to be sufficient in Munhall, 743 F.2d at 187-88, that decision was criticized by one judge on the panel, 743 F.2d at 193-95 (Becker, J., dissenting), and cited with disapproval in Kenosha, 767 F.2d at 1256. Other than allegations in its affidavits that some of Watseka's employers run three shifts, Watseka offered no evidence that the alternatives open to IPAC were ample and adequate. Watseka offered no evidence how many employees worked \"odd\" shifts, or what hours those shifts worked, or how any of that affected the number of residents home at various times. IPAC presented testimony that other methods, such as telephoning and mail, are more expensive and less effective that in-person solicitation at the citizen's residence. Watseka made no effort to rebut this testimony.\n\nIn granting First Amendment protection to door-to-door solicitation and canvassing, the Supreme Court has implicitly recognized that door-to-door communication has a special significance not duplicated by less personal forms of contact. Because Watseka has prohibited IPAC from soliciting during the hours when solicitation is most effective, and has failed to offer evidence that the alternatives left open to IPAC are ample and adequate, the ordinance is unconstitutional.\n\nTo summarize, Watseka has failed to offer evidence that its 5 p.m. to 9 p.m. ban on solicitation is narrowly tailored to achieve Watseka's legitimate objectives. Watseka failed to show both the necessary relationship between the ban and its objectives, and that it could not achieve its objectives by less restrictive means. Watseka also failed to offer evidence that the statute left open adequate and ample alternative channels of communication. The district court's decision to grant summary judgment for IPAC is affirmed.\n\nIII. DAMAGES\n\nWatseka challenges the amount of damages awarded by the trial court, arguing that at most IPAC is entitled to nominal damages. The district court determined that IPAC lost $5,500 is revenue because of its inability to canvass in Watseka from 1981 to 1983. The court reduced this amount to $3,300 to reflect IPAC's average overhead cost of forty percent. The court also awarded IPAC $5,000 to reasonably and fairly compensate IPAC for its loss of its First Amendment right. See Walsh v. Brewer, 733 F.2d 473, 474, 477 (7th Cir. 1984). The total award was $8,300.\n\nAs to the actual damages of $3,300, Watseka apparently does not dispute that this is a reasonable amount, but it claims that IPAC failed to mitigate the damages. Assuming arguendo that 42 U.S.C. ยง 1983 requires the mitigation of damages, see Berry v. Macon County Board of E ducation, 380 F. Supp. 1244, 1247-48 (M.D. Ala. 1971), we reject Watseka's argument that IPAC suffered no damages because it should have assigned its canvassers to another place instead of Watseka. IPAC sends out canvassers based upon the amount of territory it needs to cover, so it could not recoup the money it would have received from Watseka citizens. As for Watseka's argument that IPAC should have mitigated its damages by soliciting in accordance with the unconstitutional ordinance, Watseka made no attempt to dispute IPAC's evidence that an attempt to canvass on a Saturday in 1980 netted significantly lower revenues. Assuming IPAC had a duty to mitigate, it only needed to make reasonable attempts. We affirm the district court's award of actual damages.\n\nWatseka also challenged the award of $5,000 to IPAC to compensate it for injury to its First Amendment rights. In addition to the lost revenues discussed above, IPAC alleges as damages (1) its inability to recruit new members in Watseka, (2) its inability to disseminate its views to Watseka residents, and (3) its inability to encourage Watseka citizens to support IPAC positions on various issues by signing petitions or contacting local legislators. Watseka's principal argument is that a court can impose damages beyond lost revenue only for injury to reputation, or for mental or emotional injury.\n\nThe Supreme Court recently considered the proper standard for determining damages for the loss of First Amendment rights in Memphis Community School District v. Stachura, 477 U.S. 299, 91 L. Ed. 2d 249, 106 S. Ct. 2537, 54 U.S.L.W. 4771 (U.S. June 25, 1986). In Stachura, the Court held that a section 1983 plaintiff could not recover damages based upon the \"abstract 'value' or 'importance' of constitutional rights.\" Id. at 4774. The Court did not limit compensatory damages, however, even in cases where the monetary value of the particular injury is difficult to ascertain. Id. at 4774 n.14 (discussing with approval Nixon v. Herndon, 273 U.S. 536, 71 L. Ed. 759, 47 S. Ct. 446 (1927), a case holding that a plaintiff who was illegally prevented from voting in a state primary election suffered compensable injury). In discussing Nixon v. Herndon, the Court noted that\n\nThis holding did not rest on the 'value' of the right to vote as an abstract matter; rather, the Court recognized that the plaintiff had suffered a particular injury - his inability to vote in a particular election - that might be compensated through substantial money damages.\n\n54 U.S.L.W. at 4774 n.14. Judge Baker's order makes it clear that he was awarding IPAC damages because Watseka \"prevented [IPAC] from exercising its First Amendment rights in this case;\" he did not base the award on any abstract value of the constitutional right. The specific compensable, non-abstract harm to IPAC can be seen from the specific injuries alleged by IPAC which we noted above. The type of particular injury for which Judge Baker awarded IPAC $5,000 is indistinguishable from the particular injury for which the Court approved compensatory damages in Nixon v. Herndon. We thus affirm the district court's award of $3,300 for lost revenue and $5,000 for lost First Amendment rights, a total of $8,300. To the extent Watseka raises additional challenges to the district court decision, we find them to be without merit.\n\nIV. CONCLUSION\n\nWatseka's ordinance to the extent it imposes a ban no soliciting between 5 p.m. and 9 p.m., impermissibly infringes upon the First Amendment rights of IPAC, and others similarly situated, to canvass and solicit in Watseka. In finding a portion of the ordinance unconstitutional, we do not intent to discourage Watseka from amending its ordinance to constitutionally satisfy its legitimate concerns in reasonable balance with the rights of all citizens. The district court's award of $8,300 is reasonable compensation for the damages IPAC suffered.\n\nAFFIRMED.\n\nAPPENDIX\n\nSec. 19-5: (Policy on Soliciting) It is hereby declared to be the policy of this City that the occupant or occupants of the residences in this City shall made the determination of whether solicitors shall be, or shall not be, invited to their respective residence. If no determination is made as is provided in Section 19-6 hereof, then, in that event, registration is not required.\n\nSec. 19-6: (Notice Regulating Soliciting) Every person desiring to secure the protection of the regulations contained in this chapter shall comply with the following requirements, to-wit:\n\nNotice of the determination by the occupant of giving invitation to solicitors, or the refusal of invitation to solicitors, to any residence, shall be given by notice posted on the premises in the manner following:\n\n\"ONLY SOLICITORS REGISTERED IN WATSEKA, ILLINOIS, INVITED\" or \"NO SOLICITORS INVITED\"\n\nThe letters shall be at least two inches in height. For the purpose of uniformity, the cards shall be provided by the City to persons requesting them, at the cost thereof.\n\nSuch cards so exhibited shall constitute sufficient notice to any solicitor of the determination by the occupant of the residence of the information contained thereon.\n\nSec. 19-7: (Duty of Solicitors) It shall be the duty of every solicitor, upon going onto any premises in the City in which a residence is located, to examine and look for the notice provided for in Section 19-6 of this chapter, if any is posted, and be governed by the statement contained on the notice. If the notice states \"ONLY SOLICITORS REGISTERED IN WATSEKA, ILLINOIS, INVITED\" then any solicitor not possession a valid Certificate of Registration shall immediately and peacefully depart from the premises; and if the notice states \"NO SOLICITORS INVITED\", then the solicitor, whether registered or not, shall immediately and peacefully depart from the premises.\n\nAny solicitor who has gained entrance to any residence, whether invited or not, shall immediately and peacefully depart from the premises when requested to do so by the occupant.\n\nSec. 19-8: (Uninvited Soliciting Prohibited) It is hereby declared to be unlawful and shall constitute a nuisance for any person to go upon any premises and ring the doorbell upon or near any door, or create any sound in any other manner calculated to attract the attention of the occupant of such residence, for the purpose of securing an audience with the occupant thereof and engage in soliciting as herein defined in defiance of the provisions of Section 19-6 of this chapter.\n\nSec. 19-9: (Time Limit on Soliciting) It is unlawful and shall constitute a nuisance for any person, whether registered under this chapter or not, to go upon the premises and ring the doorbell upon or near any door of a residence located thereon, or rap or knock upon any door, or create any sound in any other manner calculated to attract the attention of the occupant of such residence, for the purpose of securing an audience with the occupant thereof and engage in soliciting as herein defined, prior to 9:00 o'clock A.M. or after 5:00 o'clock P.M. of any weekday, or at any time on a Sunday or on a state or national holiday.\n\nSec. 19-10: (Penalty) Any person violating any of the provisions of this chapter shall, upon conviction thereof, be subject to a fine or [sic] not less than Twenty-five Dollars ($25.00) nor more than Five Hundred Dollars ($500.00) for each offense.\n\nCOFFEY, Circuit Judge, dissenting. The majority interprets the \"narrowly tailored to serve the governmental objective\" prong of the analysis of time, place, and manner regulations under the First Amendment as meaning that the government must \"show both that there is a significant relationship between the regulation and the government interest . . . and that less restrictive alternatives are inadequate to protect the governmental interest.\" I cannot join the majority's holding because it confuses the \"narrowly tailored\" test with the \"less-restrictive-alternative\" analysis of the overbreadth doctrine and, as Justice White noted, \"the less-restrictive-alternative analysis . . . has never been a part of the inquiry into the validity of a time, place, and manner regulation.\" Regan v. Time, Inc., 468 U.S. 641, 104 S. Ct. 3262, 3271-72, 82 L. Ed. 2d 487 (1984). In reading overbreadth analysis into the test of time, place and manner regulations of speech, the majority not only imposes the strictest level of scrutiny to all time, place and manner regulations (in direct contravention of Supreme Court cases applying varying levels of scrutiny to time, place, and manner regulations in different types of forums, Perry Education Assn. v. Perry Local Educators' Assn., 460 U.S. 37, 45, 74 L. Ed. 2d 794, 103 S. Ct. 948 (1983)), but also disregards the Supreme Court's mandate that for a statute to be invalidated under the overbreadth doctrine, it must be substantially overbroad. Broadrick v. Oklahoma, 413 U.S. 601, 615, 37 L. Ed. 2d 830, 93 S. Ct. 2908 (1973); New York v. Ferber, 458 U.S. 747, 73 L. Ed. 2d 1113, 102 S. Ct. 3348 (1982). Moreover, the majority fails to even address the fundamental issue of whether the IPAC canvassers have a First Amendment right to access to residential property - private property that is not dedicated to public use. Cornelius v. NAACP Legal Def. \u0026 Educ. Fund, 473 U.S. 788, 105 S. Ct. 3439, 3449, 87 L. Ed. 2d 567 (1985) (\"As an initial matter a speaker must seek access to public property or to private property dedicated to public use to evoke First Amendment concerns . . .\"). My review of the Supreme Court cases addressing the question of whether a speaker has a First Amendment right to speak on the private property of another convinces me that even if the court were to assume that canvassers have a First Amendment right to ring a doorbell, a municipality's content - neutral time, place and manner regulation of the canvassing need only be reasonable to pass constitutional muster. I therefore dissent.\n\nA. \"Narrowly Tailored\" and \"Less-Restrictive-Alternatives\"\n\nThe First Amendment of the United States Constitution provides that \"Congress shall make no law . . . abridging the freedom of speech. . . .\" The First Amendment right to speak, however, is not an absolute right to engage in every form of speech whenever and wherever the speaker desires. Schenck v. United States, 249 U.S. 47, 52, 63 L. Ed. 470, 39 S. Ct. 247 (1919) (\"The most stringent protection of free speech would not protect a man in falsely shouting fire in a theater and causing panic.\"); Greer v. Spock, 424 U.S. 828, 836, 47 L. Ed. 2d 505, 96 S. Ct. 1211 (1976) (The guarantees of the First Amendment has never meant \"that people who want to propagandize protests or views have a constitutional right to do so whenever and however and wherever they please.\"). A review of the cases and commentary reveals that the Supreme Court applies varying levels of scrutiny to First Amendment cases. See Cornelius v. NAACP Legal Def. \u0026 Educ. Fund, 473 U.S. 788, 105 S. Ct. 3439, 3448-51, 87 L. Ed. 2d 567 (1985); Id. at 3448 (Blackmun, J., dissenting); United States v. Grace, 461 U.S. 171, 103 S. Ct. 1702, 1706-07, 75 L. Ed. 2d 736 (1983); Members of City Council of Los Angeles v. Taxpayers for Vincent, 466 U.S. 789, 104 S. Ct. 2118, 2128-29, 80 L. Ed. 2d 772 (1984) (comparing the analysis of viewpoint-specific regulations to the review of viewpoint-neutral regulations); Clark v. Community for Creative Non-Violence, 468 U.S. 288, 104 S. Ct. 3065, 3079, 82 L. Ed. 2d 221 (Marshall, J., dissenting); see generally Redish, Freedom of Expression, 87-125 (1984); Tribe, American Constitutional Law ยง 12-2 to 12-7, 12-20 (1978) (hereinafter \"Tribe\"). A statute regulating speech must pass a stricter test of vagueness. Hynes v. Mayor \u0026 Council of Oradell, 425 U.S. 610, 620, 48 L. Ed. 2d 243, 96 S. Ct. 1755 (1976) (\"Stricter standards of permissible statutory vagueness may be applied to a statute having a potentially inhibiting effect on speech; a man may the less be required to act at his peril here, because the free dissemination of his ideas may be the loser.\"). Restrictions on speech in public forums (those places which by long tradition or by government fiat have been devoted to assembly and debate, as contrasted with the Watseka ordinance dealing exclusively with private property) are subject to heightened and strict scrutiny under the First Amendment. Cornelius, 105 S. Ct. at 3448 (\"Because a principal purpose of traditional public fora is the free exchange of ideas, speakers can be excluded from a public forum only when the exclusion is narrowly drawn to achieve that interest . . .\"), Grace, 103 S. Ct. at 1707. \"Similarly, when the Government has intentionally designated a place or means of communication as a public forum speakers cannot be excluded without compelling governmental interest.\" Cornelius, 105 S. Ct. at 3448. Furthermore, \"additional restrictions such as an absolute prohibition on a particular type of expression will be upheld only if narrowly drawn to accomplish a compelling government interest.\" Grace, 103 S. Ct. at 1707 citing Perry Education Ass'n. v. Perry Local Educators' Ass'n., 460 U.S. 37, 103 S. Ct. 948, 955, 74 L. Ed. 2d 794 (1983) and Widmar v. Vincent, 454 U.S. 263, 70 L. Ed. 2d 440, 102 S. Ct. 269 (1981); see also Schad v. Mount Ephraim, 452 U.S. 61, 101 S. Ct. 2176, 68 L. Ed. 2d 671 (1981). A regulation that is viewpoint-specific is presumptively invalid: \"The First Amendment forbids the government from regulating speech in ways that favor some viewpoints or ideas at the expense of others.\" Taxpayers for Vincent, 104 S. Ct. at 2128; see, e.g., Regan v. Time, Inc., 468 U.S. 641, 104 S. Ct. 3262, 3267, 82 L. Ed. 2d 487 (1984). Moreover, a facially content-neutral regulation will likewise be subject to strict scrutiny if it vests standardless discretion in officials empowered to dispense permits for the use of public forums. See, e.g., Lovell v. City of Griffin, 303 U.S. 444, 82 L. Ed. 949, 58 S. Ct. 666 (1938); Hague v. CIO,\n\n307 U.S. 496, 83 L. Ed. 1423, 59 S. Ct. 954 (1939); Shuttlesworth v. City of Birmingham, 394 U.S. 147, 22 L. Ed. 2d 162, 89 S. Ct. 935 (1969). In addition, \"any [regulation imposing a] prior restraint on expression comes to this court with a 'heavy presumption' against its constitutional validity.\" Organization for a Better Austin v. Keefe, 402 U.S. 415, 419, 29 L. Ed. 2d 1, 91 S. Ct. 1575 (1971). Finally, a statute is subject to strict scrutiny under the \"overbreadth\" doctrine - i.e., \"a challenge to a statute that in all its applications directly restricts protected First Amendment activity and does not employ means narrowly tailored to serve a compelling governmental interest.\" Secretary of State of Maryland v. Joseph H. Munson Co., 467 U.S. 947, 104 S. Ct. 2839, 2852 n.13, 81 L. Ed. 2d 786 (1984) citing Village of Schaumburg v. Citizens for a Better Environment, 444 U.S. 620, 63 L. Ed. 2d 73, 100 S. Ct. 826 (1980); First National Bank of Boston v. Bellotti, 435 U.S. 765, 55 L. Ed. 2d 707, 98 S. Ct. 1407 (1978); Zwickler v. Koota, 389 U.S. 241, 19 L. Ed. 2d 444, 88 S. Ct. 391 (1967).\n\nA less stringent standard of review is applied to viewpoint-neutral, \"reasonable time, place, and manner restrictions\" to speech in limited public forums (i.e., a forum created by government designation intentionally opening a non-traditional forum for public discourse , Perry, 460 U.S. at 46):\n\n\"We have often approved restrictions of that kind provided that they are justified without reference to the content of the regulated speech, that they serve a significant governmental interest, and that in doing so they have open ample alternative channels for communication of the information.\"\n\nHeffron v. International Soc. for Krishna Consciousness, 452 U.S. 640, 647-48, 69 L. Ed. 2d 298, 101 S. Ct. 2559 (1981) (Examining restrictions on solicitation on the grounds of the Minnesota State Fair, a \"limited public forum.\" Id. at 655.) Moreover, \"access to a nonpublic forum . . . can be restricted as long as the restrictions are 'reasonable and [are] not an effort to suppress expression merely because public officials oppose the speaker's view.'\" Cornelius, 105 S. Ct. at 3448 quoting Perry, 460 U.S. at 46. Finally, content-neutral zoning ordinances regulating speech on the speaker's private property \"are acceptable so long as they are designed to serve a substantial governmental interest and do not unreasonably limit alternative avenues of communication.\" City of Renton v. Playtime Theatres, Inc., 475 U.S. 41, 106 S. Ct. 925, 928, 89 L. Ed. 2d 29 (1986) (applying a deferential level of scrutiny to a zoning ordinance prohibiting adult motion picture theaters from locating within 1,000 feet of any residential zone, single or multiple-family dwelling, church, park or school. See, id. at 937, Brennan, J., dissenting).\n\nWith these principles in mind, I turn to the majority's confusion of the \"narrowly tailored test\" of time, place, and manner regulations with the \"less-restrictive-means\" analysis under the overbreadth doctrine. The meaning of the \"narrowly tailored\" test was explained in Members of the City Council of Los Angeles v. Taxpayers for Vincent, 466 U.S. 789, 104 S. Ct. 2118, 2130-32, 80 L. Ed. 2d 772 (1984). The Court used Schneider v. State, 308 U.S. 147, 84 L. Ed. 155, 60 S. Ct. 146 (1939) to illustrate its explanation of the test. In Schneider, the Court addressed the constitutionality of a municipal ordinance absolutely barring all handbilling on the streets as a means of preventing littering. The Court identified the problem the ordinance sought to correct (litter) and the First Amendment right (\"to tender the written material to the passerby who may reject it or accept it, and who thereafter may keep it, dispose of it properly, or incur the risk of punishment if he lets it fall to the ground.\") Taxpayers for Vincent, 104 S. Ct. at 2131. The problem the statute sought to address, littering, was a by-product of the exercise of First Amendment rights, distributing leaflets. Id. at 2131-32. Because the municipality could directly address the littering problem without abridging protected expression merely by penalizing those who actually litter, the statute was not narrowly tailored. Id. The Court contrasted the Schneider ordinance with the Los Angeles ordinance prohibiting the posting of signs on public property. The plaintiff in Vincent posted campaign posters on utility poles and, after city employees removed the signs pursuant to the ordinance, sought an injunction against enforcement of the ordinance. The Court identified the problem the ordinance sought to solve as eliminating campaign signs. Id. at 2128-32. Unlike the situation in Schneider, the First Amendment communication (signs) was the direct source of the problem (visual clutter).\n\n\"In Schneider, an anti-littering statute could have addressed the substantive evil without prohibiting expressive activity, whereas application of the prophylactic rule actually employed gratuitously infringed upon the right of an individual to communicate directly with a willing listener. Here, the substantive evil - visual blight - is not merely a possible by-product of the activity, but is created by the medium of expression itself. In contract to Schneider, therefore, the application of ordinance in this case responds precisely to the substantive problem which legitimately concerns the City. The ordinance curtails no more speech than is necessary to accomplish its purpose.\"\n\nId. at 2132. Thus, a statute is narrowly tailored if it \"[does] no more than eliminate the exact source of the evil it sought to remedy,\" an evil that is \"not merely a possible by-product of the [First Amendment] activity but is created by the medium of expression itself.\" Id. at 2131, 2132. See also Clark v. Community for Creative Non-violence, 468 U.S. 288, 104 S. Ct. 3065, 3070, 82 L. Ed. 2d 221 (1984) (\"The regulation [forbidding camping] narrowly focuses on the government's substantial interest in maintaining the parks in the heart of our capitol in an attractive and intact condition . . . . To permit camping - using these areas as living accommodations - would be totally inimical to these purposes. . . .\"); Regan, 104 S. Ct. at 3288 n.27 (Brennan, J., concurring in part and dissenting in part); Cf., Metro Media, Inc. v. City of San Diego, 453 U.S. 490, 69 L. Ed. 2d 800, 101 S. Ct. 2882 (1981) (prohibition on billboards was narrowly tailored to the aesthetic wrongs San Diego sought to correct). In sum, a statute is \"narrowly tailored\" if it strikes directly at the source of the problem, i.e., a problem \"created by the medium of expression itself.\" Taxpayers for Vincent, 104 S. Ct. at 2132.\n\nThe \"less-restrictive-alternative\" test in only one of the elements of the overbreadth analysis. Redish, The Warren Court, the Burger Court and the First Amendment Overbreadth Doctrine, 78 Nw.U.L.Rev. 1031, 1035 n.28 (1983) (\"The Supreme Court, however, appears to view 'less drastic means' as merely one means of articulating the elements of overbreadth analysis.\")\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e (hereinafter \"Redish\"); Tribe at 722 (\"The conclusion that a statute if fatally overbroad . . . is often accompanied by an assumption that legislatures possess the ingenuity needed to develop statutory schemes essentially as effective as, but less sweeping . . . than, the law judged void. This presumption is often stated in the language of 'less restrictive alternatives.'\") (footnote omitted); see generally, Note , Less Drastic Means and the First Amendment, 78 Yale L.J. 464 (1969) (hereinafter \"Yale Note\"). \"The overbreadth doctrine postulates that the government may not achieve its concededly valid purpose by means that sweep unnecessarily broadly, reaching constitutionally protected as well as unprotected activity.\" Redish at 1034-35. The overbreadth doctrine may be viewed from two perspectives: \"On the one hand, the overbreadth doctrine may be perceived to invalidate a law that includes within its sweep individuals or situations that do not present the threat that the government is attempting to avoid [broad statutory sweep]. On the other hand, as the 'less drastic means' language implies, the doctrine may be thought to turn on the availability of means less invasive of First Amendment Rights that will accomplish the state's end [less drastic means].\" Id. at 1036. See, e.g., Village of Schaumburg v. Citizens for a Better Environment, 444 U.S. 620, 63 L. Ed. 2d 73, 100 S. Ct. 826 (1980) (invalidating ordinance prohibiting door-to-door or on-street solicitation of contributions by charitable organizations not using at least 75% of their receipts for \"charitable purposes.\") (broad statutory sweep-ordinance swept within its reach certain protected activities that did not present the asserted danger of fraud. Id. at 636-37; less drastic means - \"these interests [in protecting the public from fraud, crime and undue annoyance] are indeed substantial, but they are only peripherally promo; Redish at 1038. A less restrictive alternative analysis required the court to\n\n\"balance no more than the state's interest in the added effectiveness of the chosen means against the individual interest and the use of less drastic ones. . . . The Justices must estimate how much less effective various alternatives means would be, how much more they would cost - not merely in terms of the resources they would require, but also in terms of their effects upon other non-first amendment social values - and measure against accompanying gains these losses to expression, association, and belief.\"\n\nYale Note at 468. Adoption of a \"less-restrictive-alternative\" analysis imposes a high level of scrutiny and invariably leads to the invalidation of the statute because it is always possible to envisage alternative forms of regulations. Id. at 464. \"A judge would be unimaginative indeed if he could not come up with something a little less 'drastic' or little less 'restrictive' in almost any situation, and thereby enable himself to vote to strike legislation down.\" Illinois Elections Board v. Socialist Workers Party, 440 U.S. 173, 188-89, 59 L. Ed. 2d 230, 99 S. Ct. 983 (1979) (Blackman, J., concurring) (equal protection). An overbreadth challenge is to the statute on its face, rather than as applied to the aggrieved party in court. Taxpayers for Vincent, 104 S. Ct. at 2124-26. The overbreadth doctrine, therefore, is an exception to the traditional rule that \"a person to whom a statute may constitutionally be applied will not be heard to challenge that statute on the ground that it may conceivably be applied unconstitutionally to others, in other situations not before the Court.\" Broadrick v. Oklahoma, 413 U.S. 601, 610, 37 L. Ed. 2d 830, 93 S. Ct. 2908 (1973). In Broadrick, the Court noted that the traditional rule against asserting the rights of others reflects two cardinal principles: \"Constitutional rules are personal and may not be asserted vicariously\" and a prudential concern - \"under our constitutional system courts are not roving commissions assigned to pass judgment on the validity of the Nation's laws.\" Id. at 610-11. In addition, the traditional rule, that a party may not assert the rights of another, is grounded in the Article III limit on the jurisdiction of federal courts to actual cases and controversies. New York v. Ferber, 458 U.S. 747, 762 n.20, 73 L. Ed. 2d 1113, 102 S. Ct. 3348 (1982). Because of the weighty values underlying the traditional rule, the Court has limited the application of the overbreadth exception to situations in which the statute is \"substantially\" overbroad.\n\n\"The scope of the First Amendment overbreadth doctrine, like most exceptions to established principles, must be carefully tied to the circumstances in which facial invalidation of a statute is truly warranted. Because of the wide-reaching effects of striking down a statute on its face at the request of one whose one conduct may be punished despite the First Amendment, we have recognized that the overbreadth doctrine is 'strong medicine' and have employed it with hesitation, and then 'only as a last resort.' We have, in consequence, insisted that the overbreadth involved be 'substantial' before the statute involved will be invalidated on its face.\"\n\nId. at 769, quoting Broadrick, 413 U.S. at 613. A statute is substantially overbroad and may be struck down \"on its face\" if it is apparent to the court that any application of the legislation would create an unacceptable risk of the suppression of ideas. Secretary of State of Maryland v. Joseph H. Munson, Co., Inc., 467 U.S. 947, 104 S. Ct. 2839, 2852 n.13, 81 L. Ed. 2d 786 (1984). Because an overbreadth challenge is made to the statute to its face, the court's analysis usually does not involve the weighing of the evidence; \"overbreadth analysis ordinarily compares the statutory line defining burdened and unburdened conduct with the judicial line specifying activities protected and unprotected by the First Amendment; if the statutory line includes conduct with the judicial line protects, the statute is overbroad and becomes eligible for invalidation on that ground.\" Tribe at 710.\n\nAn examination of the cases the majority cites as support for applying a less-restrictive-alternative test to time, place, and manner analysis reveals that the courts relied on overbreadth precedent for justification. The Eighth Circuit \"less-restrictive-means\" standard was articulated in Association of Community Organizations for Reform Now v. City of Frontenac, 714 F.2d 813, 817-19 (8th Cir. 1983). The court's holding, \"the validity of a regulation that infringes upon the exercise of First Amendment freedoms will be sustained only if the regulation is narrowly drawn to further a legitimate governmental objective unrelated to the restriction of communication, and if it does not unduly, intrude upon the exercise of First Amendment rights,\" was supported by a lengthy quotation, in a footnote, from United States v. Robel, 389 U.S. 258, 19 L. Ed. 2d 508, 88 S. Ct. 419 (1967). 714 F.2d at 817 n.5. In Robel, the Supreme Court employed an overbreadth analysis to invalidate ยง 5(a)(1)(D) of the Subversive Activities Control Act of 1950, which made it a crime for a member of a so-called \"communist-action organization\" to engage in any employment in a defense facility. Commentators regard Robel as a classic example of an overbreadth case. See, e.g., Robel at 1037, 1044-49; Yale Note at 464-68; Tribe at 723. Furthermore, the Frontenac opinion's analysis of whether the statute was narrowly tailored cites to overbreadth cases such as Citizens for a Better Environment v. Village of Schaumburg, 444 U.S. 620, 63 L. Ed. 2d 73, 100 S. Ct. 826 (1980) and Schad v. Mt. Ephraim, 452 U.S. 61, 68 L. Ed. 2d 671, 101 S. Ct. 2176 (1981) (\"Because appellants' claims are rooted in the First Amendment, they are entitled to rely on the impact of the ordinance on the expressive activities of others as well as their own. 'Because overbroad laws, live vague ones, deter privileged activities, our cases firmly establish appellant's standing to raise an overbreadth challenge.'\" Id. at 66 quoting Grayned v. City of Rockford, 408 U.S. 104, 114, 33 L. Ed. 2d 222, 92 S. Ct. 2294 (1972)). Additionally, the Frontenac opinion relies upon cases imposing a strict level of scrutiny because of prior restraints or the investment of unbridled discretion to grant or deny a permit in a village official: Thomas v. Collins, 323 U.S. 516, 89 L. Ed. 430, 65 S. Ct. 315 (1945) (temporary restraining order constitutes a prior restraint on speech) and Cantwell v. Connecticut, 310 U.S. 296, 84 L. Ed. 1213, 60 S. Ct. 900 (1940) (permit to solicit for charitable causes). Indeed, the citation out of context of cases applying strict scrutiny, without justification for their citation, is apparent in all of the cases adopting the less-restrictive-alternatives analysis.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The majority merely perpetuates these courts' errors in relying on them for support for applying a \"less-restrictive-alternatives\" test to a content-neutral, time, place, and manner ordinance regulating the hours in which solicitors may call at private residences.\n\nThe majority articulates its less-restrictive-alternative analysis as an examination of \"the incremental increase in the restriction of IPAC's First Amendment rights attributable to Watseka's ban on all solicitation after 5 p.m. to see whether there is a significant relationship between that particular restriction, in light of the other safeguards in the statute, and Watseka's interests.\" As my discussion of the overbreadth doctrine makes clear, the analysis the majority employs is the less-restrictive-means element of overbreadth. Cf., Yale Note at 468. Under the narrowly tailored test, as properly applied, however, the court must identify the harm the statute seeks to regulate (protecting the privacy and security of Watseka residents) and the First Amendment right (canvassing) to determine whether the problem is caused by the medium of expression itself. It is immediately apparent that had the majority applied the proper narrowly tailored test as mandated by the Supreme Court in Taxpayers for Vincent, it would have determined that, for the privacy interest, the harm is indeed caused by the medium of expression, the solicitor's knock on the door. Furthermore, in applying an overbreadth analysis, the majority fails to determine whether the statute is substantially overbroad; thus, its standard of scrutiny is far more strict than that of the Supreme Court; for the majority, a mere determination of overbreadth is sufficient to invalidate the statute. Moreover, City of Renton v. Playtime Theatres, Inc., 475 U.S. 41, 106 S. Ct. 925, 89 L. Ed. 2d 29 (1986), on which the majority \"heavily relies,\" n.11 supra, does not justify applying a strict level of scrutiny; the Court applied a deferential standard of scrutiny in Renton. 106 S. Ct. at 937 (the characterization of the dissenting opinion of Justice Brennan). Indeed, applying this strict level of scrutiny to content-neutral time, place, and manner regulations directly contravenes and casts adrift the Supreme Court's holding that the level of scrutiny of time, place, and manner regulations varies depending upon the nature of the forum. Perry Education Assn. v. Perry Local Educators' Assn., 460 U.S. 37, 45, 74 L. Ed. 2d 794, 103 S. Ct. 948 (1983); Cornelius, 105 S. Ct. at 3448. Further, the majority faults the City for failing to meet a standard of proof, imposed by the majority, for justifying its statute. Contrary to the majority's belief, overbreadth usually does not involve the weighing of evidence, the court compares the statutory line defining burdened an unburdened conduct with the judicial line specifying activities protected and unprotected by the First Amendment. Once again, the majority attempts to improve upon a decision of the Supreme Court and applies a stricter standard of proof in its less-restrictive-means analysis than the nation's highest court applied in Renton to the municipality's proof of the substantiality of the interest protected by its time, place, and manner regulation. In Renton, the court held that \"the First Amendment does not require a city, before enacting such an ordinance, to conduct new studies or produce evidence independent of that already generated by other cities, so long as whatever evidence the city relies upon is reasonably believed to be relevant to the problem that the city addresses.\" 106 S. Ct. at 931. The majority on the other hand, rejects Watseka's statistical evidence because, \"all statistics were statewide, and Watseka failed to present any evidence of its own crime rate. . . .\"\n\nIn sum, the majority confuses the \"less-restrictive-alternative\" element of overbreadth analysis with the \"narrowly tailored\" test of time, place, and manner regulations and, in doing so, imposes a strict level of scrutiny to all time, place, and manner regulations despite the Supreme Court's ruling that the level of scrutiny varies according to the nature of the forum.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The courts on which the majority relies have cited First Amendment cases indiscriminately and out of context to justify imposing a strict level scrutiny to content-neutral, time, place, and manner regulations of door-to-door solicitation. I cannot join this conflation of two distinct tests and the improper imposition of strict level of scrutiny.\n\nB. The First Amendment Rights of Canvassers\n\nThe majority correctly notes that the Watseka ordinance regulates access to private property, the doorsteps of the town's residents. Since the statute only regulates access to private property, a difficult First Amendment issue is raised in this case in view of the rule that \"as an initial matter a speaker must seek access to public property or to private property dedicated to public use to evoke First Amendment concerns. . . .\" Cornelius, 105 S. Ct. at 3449. The general rule, \"the one seeking relief bears the burden of demonstrating that he is entitled to it,\" places on IPAC the burden of demonstrating that the First Amendment grants it a right to enter private, residential property to solicit residents:\n\n\"Although it is common to place the burden upon the Government to justify impingements on First Amendment interests, it is the obligation of the person desiring to engage in assertedly expressive conduct to demonstrate that the First Amendment even applies. To hold otherwise would be to create a rule that all conduct is presumptively expressive. In the absence of a showing that such a rule is necessary to protect vital First Amendment interests, we decline to deviate from the general rule that one seeking relief bears the burden of demonstrating that he is entitled to it.\"\n\nClark v. Community for Creative Non-Violence, 468 U.S. 288, 104 S. Ct. 3065, 3069 n.5, 82 L. Ed. 2d 221 (1984).\n\nIPAC concedes that the doorstep of a private residence is not a traditional public forum but argues that the city may not regulate private property to protect the privacy of Watseka residents' homes; according to IPAC, individual residents must take affirmative action to turn away solicitors: \"Simply, any Watseka citizen may restrict IPAC's exercise of its First Amendment rights on his or her own property - by posting a sign or turning away the canvasser. Lloyd Corp. does not empower Watseka to make that decision for all of its citizens.\" Thus, IPAC fails to delineate its alleged First Amendment right of access to private property; to the contrary, IPAC's argument rests on a foundation of quicksand, an unarticulated assumption that it has such a right. I note my disapproval of IPAC's failure to meet its obligation of demonstrating a First Amendment right and turn to the question, which IPAC bore the responsibility of answering, of whether solicitors have a First Amendment right of access to private, residential property.\n\nThe Supreme Court's analysis of whether there is a First Amendment right to speak on the private property of another was developed in a line of cases beginning with Marsh v. Alabama, 326 U.S. 501, 90 L. Ed. 265, 66 S. Ct. 276 (1946). In Marsh, a Jehovah's Witness was convicted of criminal trespass for distributing literature without a license on a sidewalk in Chickasaw, Alabama, a town wholly owned by the Gulf Shipbuilding Corporation. The private company in Marsh owned title to the town and posted a notice prohibiting soliciting in the windows of the town's company stores. The Court reasoned:\n\n\"Had the title to Chickasaw belonged not to a private but to a municipal corporation and had appellant been arrested for violating a municipal ordinance rather than a ruling by those appointed by the corporation to manage a company town it would have been clear that appellant's conviction must be reversed . . . [because] neither a state nor a municipality can completely bar the distribution of literature containing religious or political ideas on its streets, sidewalks or public places. . . . Our question then narrows down to this: Can those people who live in or come to Chickasaw be denied freedom of press and religion simply because a single company has legal title to all the town?\"\n\n326 U.S. at 504-505. The Court found the requisite state action in \"the State['s] . . . attempt[] to impose criminal punishment on appellant for undertaking to distribute religious literature in a company town. . . .\" Id. at 509. The Court denied that \"the corporation's right to control the inhabitants of Chickasaw is coextensive with the right of a homeowner to regulate the conduct of his guests,\" because \"the more an owner, for his advantage, opens up his property for use by the public in general, the more do his rights become circumscribed by the statutory and constitutional right of those who use it.\" Id. at 506. The Court concluded:\n\n\"In our view the circumstance that the property rights to the premises were the deprivation of liberty, here involved, took place, were held by others than the public, is not sufficient to justify the State's permitting a corporation to govern a community of citizens so as to restrict their fundamental liberties and the enforcement of such restraint by the application of a State statute.\"\n\nId. at 509.\n\nIn Amalgamated Food Employees Union v. Logan Valley Plaza, 391 U.S. 308, 20 L. Ed. 2d 603, 88 S. Ct. 1601 (1968), a case involving peaceful picketing within a shopping center, the Court reviewed the Marsh case in detail, emphasized the similarities between a shopping center and a company town and concluded that a shopping center is a \"functional equivalent\" of the business district of Chickasaw, Alabama. Based upon this \"functional equivalency,\" the Court held that picketers had a First Amendment right to picket within a shopping center. Four years after the Logan Valley decision, the Supreme Court addressed another private shopping center case in Lloyd Corporation, Ltd. v. Tanner, 407 U.S. 551, 33 L. Ed. 2d 131, 92 S. Ct. 2219 (1972). Although the Lloyd decision did not expressly overrule Logan Valley, the court rejected a functional equivalency argument, advanced by leafletters who had been evicted from the shopping center, because the private shopping center neither assumed the full spectrum of municipal powers nor stood in the shoes of the state, as did the company in Marsh. The Court held that, \"the First and Fourteenth Amendments safeguard the rights of free speech and assembly by limitations on state action, not on action by the owner of private property used nondiscriminatorily for private purposes only.\" 407 U.S. at 567 (emphasis in original). The Supreme Court noted that it \"has never held that a trespasser or an uninvited guest may exercise general rights of free speech on property privately owned and used nondiscriminatorily for private purposes only.\" Id. at 569. Eight years later, the Court acknowledged in Hudgens v. N.L.R.B., 424 U.S. 507, 47 L. Ed. 2d 196, 96 S. Ct. 1029 (1976), that Lloyd had overruled Logan Valley and affirmed that the holding in Lloyd controlled all regulations of speech at privately owned shopping centers, regardless of the subject matter of the speech. Hudgens, 424 U.S. at 518-21. Finally, in PruneYard Shopping Center v. Robins, 447 U.S. 74, 64 L. Ed. 2d 741, 100 S. Ct. 2035 (1980), the court addressed the question of whether state constitutional provisions permitting individuals to exercise free speech and petition rights on the property of a privately owned shopping center to which the public was invited violated the shopping center owner's rights under the taking clauses of the Fifth and Fourteenth Amendments or his free speech rights under the First and Fourteenth Amendments. The shopping center owner contended that the Lloyd decision prevented the state from requiring a private shopping center owner to provide access to persons exercising their state constitutional rights of free speech and petition when adequate alternative avenues of communication were available. PruneYard, 447 U.S. at 80. The Court distinguished its holding in Lloyd (\"when a shopping center owner opens his private property to the public for the purpose of shopping, the First Amendment to the United States Constitution does not thereby create individual rights and expression beyond those already existing under applicable law.\" 447 U.S. at 81) from the situation presented in PruneYard, because in Lloyd \"there was no state constitutional or statutory provision that had been construed to create rights to the use of private property by strangers.\" Id. The Court held that the California statute did not violate its Lloyd decision because \"a State in exercise of its police power may adopt reasonable restrictions on private property so long as the restrictions do not amount to a taking without just compensation or contravene any other federal constitutional provision.\" Id.\n\nAs my review of this series of cases reveals, the Supreme Court recognizes a First Amendment right to enter the private property of another only when the private property is \"dedicated to public use.\" (Emphasis added.) Several Supreme Court cases state in dicta that there is no First Amendment right to speak in the private residence of another contrary to the wishes of the owner. Nimmer, ยง 4.09[D][2][b][i] at 4-106 n.312; see, e.g., PruneYard, 447 U.S. at 100 n.4 (\"[A] law that required homeowners to permit speakers to congregate on their front lawns would be a massive and possibly unconstitutional intrusion into personal privacy and freedom of belief.\") (Powell, J. concurring); Rowan v. United States Post Office Dep't., 397 U.S. 728, 736-37, 25 L. Ed. 2d 736, 90 S. Ct. 1484 (1970) (the right to be free from unwanted mail sent to the home outweighs the right to send such mail; \"to hold less would tend to license a form of trespass\"); Garner v. Louisiana, 368 U.S. 157, 202, 7 L. Ed. 2d 207, 82 S. Ct. 248 (1961) (Harlan, J., concurring) (The right of freedom of speech 'would not surely encompass verbal expression in a private home if the owner has not consented.\"); Logan Valley, 391 U.S. at 324 (The right to freedom of speech contrary to the wishes of the property owner may not be asserted in 'a situation involving a person's home\"). Indeed, as the Court expressly stated in Hudgens :\n\n\"It is, of course a commonplace that the unconstitutional guarantee of free speech is a guarantee only against abridgment by government, federal or state. Thus, while statutory or common law may in some situations extend protection or provide redress against a private corporation or person who seeks to abridge the free expression of others, no such protection or redress is provided by the Constitution itself.\"\n\n424 U.S. at 513 (emphasis added.) Although the Court regards \"this elementary proposition [as] little more than a truism,\" it recognizes an exception to the state action rule - private property dedicated to public use. Cornelius, 105 S. Ct. at 3449; Hudgens, 424 U.S. at 513-21; Lloyd, 407 U.S. at 569. To date, the only case holding that private property was dedicated to public use is Marsh v. Alabama, 326 U.S. 501, 90 L. Ed. 265, 66 S. Ct. 276 (1946). In Lloyd, the Court noted that Marsh\n\n\"involved the assumption by a private enterprise of all attributes of a state-created municipality and the exercise by that enterprise of semi-official municipal functions as a delegate of the State. In effect, the owner of the company town was performing the full spectrum of municipal powers and stood in the shoes of the State.\"\n\n407 U.S. at 569. In sum, the private property owner has an absolute right to deny entry to would-be speakers unless the private property is dedicated to public use (i.e., the private owner performs the full spectrum of municipal powers and stands in the shoes of the State).\n\nA review of the Supreme Court cases fails to reveal any support for the proposition that the doorstep of a private residence is \"private property dedicated to public use.\" In Rowan v. United States Post Office Dept., 397 U.S. 728, 25 L. Ed. 2d 736, 90 S. Ct. 1484 (1970), the Supreme Court addressed the issue of whether a vendor has a constitutional right to send unwanted material into the home of another. In a decision authored by Chief Justice Burger, the Court held:\n\n\"The Court has traditionally respected the right of a householder to bar, by order of notice, solicitors, hawkers, and peddlers from his property. See Martin v. City of Struthers, supra; cf. Hall v. Commonwealth, 188 Va. 72, 49 S.E.2d 369, appeal dismissed, 335 U.S. 875, 69 S. Ct. 240, 93 L. Ed. 418 (1948). . . .\n\nTo hold less would tend to license a form of trespass and would make hardly more sense than to say that a radio or television viewer may not twist the dial to cut off an offensive or boring communication and thus bar its entering his home. . . . The ancient concept that 'a man's home is his castle' into which 'not even the king may enter' has lost none of its vitality, and none of the recognized exceptions includes any right to communicate offensively with another.\n\nWe therefore categorically reject the argument that a vendor has a right under the Constitution or otherwise to send unwanted material into the home of another. If this prohibition operates to impede the flow of even valid ideas, the answer is that no one has a right to press even 'good' ideas on an unwilling recipient. That we are often 'captives' outside the sanctuary of the home and subject to objectionable speech and other sound does not mean we must be captives everywhere. See Public Utilities Comm. of District of Columbia v. Pollak, 343 U.S. 451, 72 S. Ct. 813, 96 L. Ed. 1068 (1952). The asserted right of a mailer, . . . stops at the outer boundary of every person's domain.\"\n\nBased upon the Supreme Court's solicitude for the privacy of the home, I conclude that the homeowner has an absolute right to deny entry to would-be speakers; thus, IPAC has no First Amendment right to enter private, residential property without the consent of the homeowner.\n\nIPAC, however, argues that the First Amendment forbids the State to act on behalf of residents wishing to bar solicitors from their property. IPAC relies on the Supreme Court's affirmance of door-to-door soliciting's value to a free society in Martin v. Struthers, 319 U.S. 141, 87 L. Ed. 1313, 63 S. Ct. 862 (1943):\n\n\"While door to door distributors of literature may be either a nuisance or a blind for criminal activities, they may also be useful members of society engaged in the dissemination of ideas in accordance with the best tradition of free discussion. The widespread use of this method of communication by many groups espousing various causes atests [sic] its major importance. 'Pamphlets have proved most effective instruments in the dissemination of opinion, and perhaps the most effective way of bringing them to the notice of individuals in their distribution at the homes of the people.' Many of our most widely established religious organizations have used this method of disseminating their doctrines, and laboring groups have used it in recruiting their members. The federal government, in its current war bond selling campaign, encourages groups of citizens to distribute advertisements and circulars from house to house. Of course, as every person acquainted with political life knows, door to door campaigning is one of the most accepted techniques of seeking popular support, while the circulation of nominating papers would be greatly handicapped if they could not be taken to the citizens in their homes. Door to door distribution of circulars is essential to the poorly financed causes of little people.\"\n\nId. at 145-46. Since a canvasser cannot canvass in residential areas without entering the private property of another, Martin, which described solicitors as \"persons not specifically invited to go from home to home and knock on doors or ring doorbells to communicate ideas to the occupants . . ., 319 U.S. at 141, (emphasis added), appears to contradict the Supreme Court's statement in Lloyd that is \"has never held that a trespasser or an uninvited guest may exercise general rights of free speech on property privately owned and used nondiscriminatorily for private purposes only.\" Lloyd, 407 U.S. at 569 (emphasis added). Moreover, if Martin, in fact \"forbid[s] . . . municipal council[s] from modifying the rule that anyone may sound a call for the householder to attend his door,\" 319 U.S. at 156, Reed, J., dissenting, then it conflicts with the Court's holding in PruneYard \"that a State in the exercise of its police power may adopt reasonable restrictions on private property so long as the restrictions do not amount to a taking without just compensation or contravene any other federal constitutional provision.\" 447 U.S. at 81.\n\nI note that the continuing vitality of Martin is questionable. In Martin, the Court found that the following city ordinance violated the First Amendment:\n\n\"It is unlawful for any person distributing handbills, circulars or other advertisement to ring the doorbell, sound the door knocker, or otherwise summon the inmate or inmates of any residence to the door for the purpose of receiving such handbills, circulars or other advertisements they or any person with them may be distributing.\"\n\nId. at 142. The Court held that the absolute ban on soliciting violated not only the solicitor's First Amendment right to speak but also the First Amendment rights of residents who were willing to hear the solicitor's message:\n\n\"We are faced in the instant case with the necessity of weighing the conflicting interests of the appellant in the civil rights she claims, as well as the right of the individual householder to determine whether he is willing to receive her message, against the interest of the community which by this ordinance offers to protect the interests of all of its citizens, whether particular citizens want the protection of not. The ordinance does not control anything but the distribution of literature, and in that respect it substitutes the judgment of the community for the judgment of the individual householder. It submits the distributor to criminal punishment for annoying the person on whom he calls, even though the recipient of the literature distributed is in fact glad to receive it.\n\nFreedom to distribute information to every citizen wherever he desires to receive it is so clearly vital to the preservation of a free society that, putting aside reasonable police and health regulations of time and manner of distribution, it must be fully preserved. The dangers of distribution can so easily be controlled by traditional legal methods, leaving to each householder the full right to decide whether he will receive strangers as visitors, that stringent prohibition can serve no purpose but that forbidden by the Constitution, the naked restriction of the dissemination of ideas.\"\n\n319 U.S. at 143, 146-47. Justice Frankfurter construed the Court's opinion as striking the ordinance because it was invidiously discriminatory and limited his concurrence to the invidious discrimination ground. Id. at 154. The dissenting Justices disagreed with the Court's refusal to recognize not only the homeowner's right to privacy but also the municipality's power to protect their privacy in enacting an anti-solicitation ordinance. Id. at 154-57; 166-82.\n\n\"If the citizens of Struthers desire to be protected from the annoyance of being called to their doors to receive printed matter, there is to my mind no constitutional provision which forbids their municipal council from modifying the rule that anyone may sound a call for the householder to attend his door. It is the council which is entrusted by the citizens with the power to declare and abate the myriad nuisances which develop in a community. Its determination should not be set aside by this Court unless clearly and patently unconstitutional.\n\nNor am I convinced that we can have freedom of religion only by denying the American's deep-seated conviction that his home is a refuge from the pulling and hauling of the market place and the street. For a stranger to corner a man in his home, summon him to the door and put him in the position either of arguing his religion or of ordering one of unknown disposition to leave is a questionable use of religious freedom.\"\n\nId. at 156 and 181 (Reed, J. and Jackson, J., dissenting).\n\nEight years later, in Breard v. Alexandria, 341 U.S. 622, 95 L. Ed. 1233, 71 S. Ct. 920 (1951), the court held that a statute forbidding solicitors from going in or upon private residences without having been requested or invited to do so did not violate the First Amendment rights of the solicitor. In Breard, the court balanced the householder's desire for privacy and the First Amendment right of the solicitors and concluded that, \"it would be, it seems to us, a misuse of the great guarantees of free speech and free press to use those guarantees to force a community to admit the solicitors of publications to the home premises of its residents.\" Id. at 645. The Court has acknowledged that Martin is of questionable validity following the decision in Breard.\n\n\"On May 3, 1943, this Court held that cities and states could not enforce laws which impose flat taxes on the privilege of door-to-door sales of religious literature, Jones v. Opelika, 319 U.S. 103, 87 L. Ed. 1290, 63 S. Ct. 890; Murdock v. Com. of Pennsylvania, 319 U.S. 105, 63 S. Ct. 870, 87 L. Ed. 1292, or which make it unlawful for persons to go from home to home knocking on doors and ringing doorbells to invite occupants to religious, political or other kinds of public meetings. Martin v. Struthers, 319 U.S. 141, 63 S. Ct. 862, 87 L. Ed. 1313. Over strong dissents, these laws were held to invade liberty of speech, press and religion in violation of the First and Fourteenth Amendments. Today a new majority adopts the position of the former dissenters and sustains a city ordinance forbidding door-to-door solicitation of subscriptions to the Saturday Evening Post, Newsweek and other magazines. Since this decision cannot be reconciled with Jones, Murdock and Martin v. Struthers cases, it seems to me that good judicial practice calls for the forthright overruling.\"\n\nBreard, 341 U.S. at 649-50 (Black, J., dissenting); Minneapolis Star \u0026 Tribune v. Men Com'r. of Rev., 460 U.S. 575, 103 S. Ct. 1365, 1373 n.9, 75 L. Ed. 2d 295 (1983) (\"As the dissent in Breard recognized, the majority opinion substantially under cut . . . Martin. . . .\") Although IPAC contends that the Supreme Court has \"questioned the validity\" of Breard, (see Schaumburg, 444 U.S. at 632 n.7) I note that the Court cited Breard with approval in Minneapolis Star, 103 S. Ct. at 1373 n.9, a case decided three years after Schaumburg. Moreover, the Court's criticism of Breard is to its \"support for a 'commercial speech' exception to the First Amendment.\" Virginia State Bd. of Pharmacy v. Virginia Citizens Consumer Council, 425 U.S. 748, 758, 48 L. Ed. 2d 346, 96 S. Ct. 1817 (1976). Thus, in my view, the court's disapproval of Breard's adoption of a commercial speech exception to the First Amendment cannot, and should not, be loosely read or contrived to create a criticism of the court's proper and legitimate balancing of the homeowners' desire for privacy against the First Amendment rights of solicitors. Indeed, several Supreme Court cases recognize that a homeowner's privacy interest outweighs the First Amendment right of a would-be speaker. See, e.g., Schaumburg v. Citizens for a Better Environment, 444 U.S. 620, 639, 63 L. Ed. 2d 73, 100 S. Ct. 826 (1980) (ordinance requiring door-to-door solicitors to depart immediately when confronted with a no-solicitors sign described as a necessary measure 'to protect privacy'); Breard v. Alexandria, 341 U.S. 622, 644, 95 L. Ed. 1233, 71 S. Ct. 920 (1951) (\"This makes the constitutionality of Alexandria's ordinance [declaring it to be a nuisance for solicitors to go in or upon a private residence without having been requested or invited to do so] turn upon a balancing of the conveniences between some householders' desire for privacy and the publisher's right to distribute publications in the precise way that those soliciting for him bring the best results.\"); Logan Valley, 391 U.S. at 324 (Shopping center owners' right to prohibit any use of their property by others without their consent is \"unlike a situation involving a person's home [because] no meaningful claim to protection of a right of privacy can be advanced by [the shopping center owners]\"); PruneYard, 447 U.S. at 74 n.4. (Powell, J. concurring in part) (\"A law that required homeowners to permit speakers to congregate on their front lawns would be a massive and possibly unconstitutional intrusion into personal privacy and freedom of belief.\"); see generally Nimmer at ยง 4.09[D][2][b][I] at 4-107 n.316.\n\nMoreover, since the decision in Martin, the Supreme Court has recognized a constitutional right to privacy based in part on the guarantees in the Fourth and Fifth Amendments of the security and privacy of the home. See Mapp v. Ohio, 367 U.S. 643, 656, 6 L. Ed. 2d 1081, 81 S. Ct. 1684 (1967) (the Fourth Amendment protection against unreasonable searches and seizures creates a right to privacy in the home); PruneYard, 447 U.S. at 82 (the Fifth Amendment guarantee against the deprivation of property without due process of law: \"One of the essential sticks in the bundle of property rights is the right to exclude others.\"); Roe v. Wade, 410 U.S. 113, 152-54, 35 L. Ed. 2d 147, 93 S. Ct. 705 (1973) (a \"right to personal privacy, or a guarantee of certain areas or zones of privacy\" drawn from the penumbra of the First, Fourth and Fifth Amendments); Pacifica Foundation, 438 U.S. at 748 (a First Amendment-related right \"to be let alone\" - i.e., a right not to be held a captive to the expression of others).\n\nBased upon the questionable vitality of Martin following Breard, the Court's numerous indications that the right to free speech may not be asserted in a private home without the owner's consent, and upon the First, Fourth and Fifth Amendment right to privacy, I would hold that Martin does not require us to find that solicitors have a First Amendment right to enter private, residential property. In my view, Lloyd, Hudgens and Cornelius hold that solicitors do not have a First Amendment right to access to private, residential property. Moreover, PruneYard affirmed that the State may exercise its police power to regulate access to private property \"so long as the restrictions do not amount to a taking without just compensation or contravene any other federal constitutional provision.\" 447 U.S. at 81. Clearly, if the State forced residents to receive solicitors, it would violate the just compensation clause by denying the residents their right to exclude others and deprive them of their \"reasonable investment-backed expectation\" of privacy. See, id. at 82-4. On the other hand, if the State were to go to the opposite extreme and absolutely ban residential soliciting, it might deny the First Amendment rights of the residents interested in receiving the solicitor's message, a right recognized in Martin and reaffirmed in numerous cases. See, e.g., Lamont v. Postmaster General, 381 U.S. 301, 14 L. Ed. 2d 398, 85 S. Ct. 1493 (1965); Red Lion Broadcasting Co. v. FCC, 395 U.S. 367, 23 L. Ed. 2d 371, 89 S. Ct. 1794 (1979); Stanley v. Georgia, 394 U.S. 557, 22 L. Ed. 2d 542, 89 S. Ct. 1243 (1969). Thus, in my analysis, the underlying First Amendment issue presented in this case is whether the First Amendment requires Watseka to accommodate the rights of the willing listeners by requiring the residents who were unwilling to receive solicitors to post a \"No Soliciting\" sign during the hours between 5:00 p.m. and 9:00 a.m. However, because Martin has not been expressly overruled and because the Court continues to affirm the First Amendment right to solicit, see Schaumburg, 444 U.S. at 628-33, it is not clear whether the First Amendment rights of solicitors include a right of access to private residential property if the homeowner has not posted a sign forbidding solicitation. Nonetheless, I need not resolve this conflict between Martin and Lloyd and PruneYard because even if I were to assume for the sake of argument that canvassers have a limited right to enter private, residential property absent a sign forbidding their entry, (in effect, a \"speech easement\"), the right obviously has reasonable limitations and may be regulated by the municipality:\n\n\"In Margin, supra, 319 U.S. at 144, 63 S. Ct. at 864, 87 L. Ed. at 1317, Mr. Justice Black writing for the stated:\n\n'Ordinances of the sort now before us may be aimed at the protection of the householders from annoyance, including intrusion upon the hours of rest, and at the prevention of crime. Constant callers, whether selling pots or distributing leaflets, may lessen the peaceful enjoyment of a home as much as a neighborhood glue factory or railroad yard which zoning ordinances may prohibit. . . . In addition, burglars frequently pose as canvassers, either in order that they may have a pretense to discover whether a house is empty and hence ripe for burglary or for the purpose of spying out the premises in order that they may return later. Crime prevention may thus be the purpose of regulatory ordinances.'\n\nAs Mr. Justice Black suggested, the lone housewife has no way of knowing whether the purposes of the putative solicitor are benign or malignant, and even an innocuous caller 'may lessen the peaceful enjoyment of a home.' Ibid.\n\nProfessor Zechariah Chafee articulated something of the householder's right to be let alone, saying:\n\n'Of all the methods of spreading unpopular ideas, [house-to-house canvassing] seems the least entitled to extensive protection. The possibilities of persuasion are slight compared with the certainties of annoyance. Great as in the value of exposing citizens to novel views, home is one place where a man ought to be able to shut himself up in his own ideas if he desires.' Free Speech in the United States 406 (1954).\n\nThere is, of course, no absolute right under the Federal Constitution to enter on the private premises of another and knock on a door for any purpose, and the police power permits reasonable regulation for public safety. We cannot say, and indeed appellants do not argue, that door-to-door canvassing and solicitation are immune from regulation under the State's police power, whether the purpose of the regulation is to protect from danger or to protect the peaceful enjoyment of the home. See Rowan v. Post Office Dept., 397 U.S. 728, 735-738, 90 S. Ct. 1484, 1489, 25 L. Ed. 2d 736, 742-744 (1970).\"\n\nHynes v. Mayor and Council of Borough of Oradell, 425 U.S. 610, 619, 48 L. Ed. 2d 243, 96 S. Ct. 1755 (1976) (Burger, J.) (the court invalidated the ordinance for being unconstitutionally vague). The majority, in footnote 9, states that since Martin v. Struthers, supra, has not been overruled, it \"remains good law in situations such as the one before us.\" As previously noted in this dissenting opinion, the \"continuing vitality [of Martin ] is questionable.\" Eight years after the Martin decision, the Supreme Court in Breard held that a statute forbidding solicitors from entering onto private property without being invited to do so did not violate the First Amendment right of the solicitor. In citing the Breard case with approval, the Supreme Court in Minneapolis Star \u0026 Tribune recently stated, \"as the dissent to Breard recognized, the majority opinion substantially undercut . . . Martin . . . .\" 460 U.S. at 586-87 n.9, 103 S. Ct. at 1373 n.9 (1983). Further, since the Martin decision the Supreme Court has clearly recognized the constitutional right to privacy in one's own home based on the Fourth and Fifth Amendments. See, e.g., Roe v. Wade, 410 U.S. at 152 (\"the roots of [the right of personal privacy is found] in the First Amendment [and] . . . in the Fourth and Fifth Amendments . . . .\") I agree that Martin has not been completely overruled but according to the U.S. Supreme Court its applicability since the date of its decision has been greatly limited. Thus, the majority fails to delineate much less explain its legal reasoning in concluding that Martin \"remains good law\" under the facts of this particular case. I hasten to point out that the ordinance in Martin is not similar to the present ordinance under consideration as the Martin ordinance banned solicitation at all times, whereas in this case the Watseka ordinance banned solicitation on weekdays only during the hours from 5:00 p.m. to 9:00 a.m. and on Sundays. This total ban in Martin clearly distinguishes that case from the Watseka ordinance since, as discussed later in this opinion, the 5:00 p.m. to 9:00 a.m. ban is a reasonable time, place and manner restriction on door-to-door solicitation as \"this legislative enactment is . . . narrowly draw to express only the legitimate state interest[]\" (Roe, 410 U.S. at 155) of protecting their elderly citizens in the twilight years of their life from crime. If the majority is implying that Martin creates an absolute right on the part of solicitors to enter private property, I point out that this implication finds no support in the Martin decision which emphasized the First Amendment right of the property owner to receive the message and did not even discuss the right of the solicitor to deliver it. See Martin, 319 U.S. at 146-48. Further, as Chief Justice Burger made clear in the Hynes decision, the Supreme Court has yet to sanction an absolute right under the First Amendment for solicitors to enter private property to solicit:\n\n\"There is, of course, no absolute right under the Federal Constitution to enter on the private premises of another and knock on a door for any purpose, and the police power permits reasonable regulation for public safety.\"\n\nHynes, 425 U.S. at 619. As the Supreme Court recognized in Hynes and, in part, in PruneYard the state may regulate the solicitors in order to protect the homeowner's peaceful enjoyment of the home. The only logical conclusion that can be drawn is that solicitors have no First Amendment right to enter private property. The majority erroneously finds such a right and, because of this finding, employs an unduly strict level of scrutiny. The correct view is that the Watseka ordinance is a content-neutral, time, place and manner regulation. Accordingly, I turn to the question of the level of scrutiny to be applied to content-neutral, time, place, and manner regulations of door-to-door soliciting in residential areas.\n\nC. Level of Scrutiny\n\nThe Supreme Court's Cornelius decision illuminates the standard to be applied to the content-neutral statute that is neither vague nor overbroad and does not vest unbounded discretion in a municipal official to determine what messages residents will hear. Because the forum in Cornelius was public, the opinion fails to enunciate the test to be applied to government regulation of a speaker's access to a private forum that is not dedicated to public use. However, I note that the analysis of a nonpublic forum rests upon an analogy to private property:\n\n\"Recognizing that the Government ' no less than a private owner of property, has power to preserve the property under its control for the use to which it is lawfully dedicated,' the Court has adopted a forum analysis as a means of determining when the Government's interest in limiting the use of its property to its intended purposes outweighs the interest of those wishing to use the property for other purposes.\"\n\n105 S. Ct. at 3448 (emphasis added). The test to be applied to government regulation of access to a nonpublic forum is one of reasonableness:\n\n\"Access to a nonpublic forum . . . can be restricted as long as the restrictions are reasonable and [are] not an effort to suppress expression merely because public officials oppose the speaker's view.\n\nThe Government's decision to restrict access to a nonpublic forum need only be reasonable ; it need not be the most reasonable or the only reasonable limitation. . . . Nor is there a requirement that the restriction be narrowly tailored or that the Government's interest be compelling. The First Amendment does not demand unrestricted access to a nonpublic forum merely because use of that forum may be the most efficient means of delivering the speaker's message.\n\nThe reasonableness of the Government's restriction of access to a nonpublic forum must be assessed in the light of the purpose of the forum and all the surrounding circumstances.\"\n\n105 S. Ct. at 3448, 3453 (emphasis in original). Indeed, the Supreme Court's recent decision in Renton, upholding an ordinance regulating a speaker's exercise of his First Amendment rights on his own private property, supports my conclusion that the court should apply a deferential level of scrutiny. \"So-called 'content-neutral' time, place, and manner regulations re acceptable so long as they are designed to serve a substantial governmental interest and do not unreasonably limit alternative avenues of communication.\" 106 S. Ct. at 928 (emphasis added).\n\nD. The Constitutionality of the Watseka Ordinance\n\nBased on the Supreme Court's articulation in Cornelius of the test to be applied to regulations of access to nonpublic forums, the test I apply to Watseka's content-neutral, time, place, and manner regulation of the hours in which door-to-door soliciting in residential neighborhoods will be allowed is one of reasonableness. 105 S. Ct. at 3453. Watseka need not demonstrate: \"strict incompatibility between the nature of the speech or the identity of the speaker and the functioning of the [private] forum;\" that \"the restriction be narrowly tailored;\" or that \"the Government's interest be compelling.\" Id. Moreover, the regulation may not be invalidated on the ground that \"use of [the private] forum may be the most efficient means of delivering the speaker's message,\" so long as \"the speakers have access to alternative channels\" of communication.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Id. \"The reasonableness of the government's restriction of access to a [private forum, not dedicated to public use] must be assessed in the light of the purpose of the forum and all the surrounding circumstances.\" Id.\n\nTo evaluate the reasonableness of the Watseka ordinance, initially we must identify the conflicting interests. See Martin, 319 U.S. at 143. IPAC asserts a First Amendment right to solicit for its organization while Watseka seeks not only to control crime, but also to protect the privacy of its residents in limiting the hours in which IPAC can solicit. Watseka residents who wish to exclude solicitors have two \"privacy interests\": an interest in avoiding unwanted exposure to ideas (as well as gimmicks, sales pitches or promotions) and a desire not to be disturbed in the privacy of their homes, the last citadel of privacy for the weary and tired of body and mind, by the means of communication employed. On the other hand, \"the protection afforded [freedom of speech] is to the communication, to its source and to its recipients both.\" Virginia State Bd. of Pharmacy, 425 U.S. at 756. Because there is a \"First Amendment right to receive information and ideas,\" and freedom of speech \"necessarily protects the right to receive,\" id. at 757, the court must weigh and balance the First Amendment rights of Watseka residents who are willing to receive solicitors against the other residents' right to privacy in the confines of their private dwelling.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn weighing the interests of willing and unwilling audiences, courts must consider the degree to which an unwilling listener is a \"captive\" - i.e., the court must determine whether the unwilling listener can remove himself from the locus of the speech without undue hardship. Erznoznik v. Jacksonville, 422 U.S. 205, 209, 45 L. Ed. 2d 125, 95 S. Ct. 2268 (1975) (An audience is not regarded as \"captive\" unless the degree of captivity makes it impractical for the unwilling viewer or auditor to avoid exposure.) If the unwilling audience is truly captive, the speech regulation must be examined under the \"captive audience doctrine\" exception to the right of freedom of speech. The standard for balancing the interests of willing and unwilling audience members under the captive audience doctrine was announced in Cohen v. California, 403 U.S. 15, 21, 29 L. Ed. 2d 284, 91 S. Ct. 1780 (1971): \"The ability of government, consonant with the Constitution, to shut off discourse solely to protect others from hearing it is . . . dependent upon a showing that substantial privacy interests are being invaded in an essentially intolerable manner.\" The \"substantiality\" of the privacy interest turns upon the time and place of the unwanted communication; \"the privacy interest is, of course, strongest within the home, and it is there that the captive audience basis for vitiating a speaker's First Amendment right to communicate is most readily invoked.\" Nimmer at ยง 1.02[F][2][b]; see also Tribe at 677 n.13. \"[T]he homes of men, sometimes the last citadel of the tired, the weary, and the sick, can be protected by government from noisy, marching, tramping, threatening picketers and demonstrators. . . .\" Gregory v. Chicago, 394 U.S. 111, 22 L. Ed. 2d 134, 89 S. Ct. 946 (1969); \"Great as is the value of exposing citizens to novel views, home is one place where a man ought to be able to shut himself up in his own ideas if he desires.\" Hynes, 426 U.S. at 619 quoting Chafee, Free Speech in the United States 406 (1954). On the other hand, to protect the First Amendment rights of willing audience members to listen to the speech and of the speaker to reach willing listeners, the speech regulation must leave open ample alternative channels of communication with the willing audience. Heffron, 452 U.S. at 655 (\"The First Amendment protects the right of every citizen to 'reach the minds of willing listeners and to do so there must be opportunity to win their attention.'\"); cf., Schauer, Hudgens v. N.L.R.B. and the Problem of State Action in First Amendment Adjudication, 61 Minn.L.Rev. 433, 455 (1977) (\"Only to the extent that a state acquiesces in a private party's control over all forums for speech, as in Marsh [v. Alabama, 326 U.S. 501, 90 L. Ed. 265, 66 S. Ct. 276 (1946) (the company town case)], will the owner's ability to control the speakers and the content of speech on his property be subject to the first amendment restrictions.\") (emphasis in original). The speech regulation need only provide \" reasonable alternative avenues of communication.\" Renton, 106 S. Ct. at 932 (emphasis added). In sum, I analyze the Watseka ordinance to determine whether the unwilling listeners are truly \"captive\"; whether the privacy interest are \"substantial\"; and, whether the alternative avenues of communication are \"reasonable.\"\n\nIPAC argued (and the majority apparently agrees) that Watseka residents unwilling to be solicited between the hours of 5:00 p.m. and 9:00 a.m., Monday through Saturday, are not \"captive.\" IPAC relies on Bolger v. Youngs Drug Products Corp., 463 U.S. 60, 103 S. Ct. 2875, 77 L. Ed. 2d 469 (1983), in which the Supreme Court evaluated the constitutionality of a federal statute prohibiting the unsolicited mailing of contraceptive advertisements. However, I note that Bolger involved commercial speech, which is evaluated under an entirely separate and distinctively different standard, 103 S. Ct. at 2879-81, and stated that the homeowners' exposure to the communication was of a fleeting duration. Bolger, 103 S. Ct. at 2883 (\"The 'short, though regular, journey from mailbox to trash can . . . . is an acceptable burden, at least so far as the Constitution is concerned.'\"); see also, Consolidated Edison Co. v. Public Service Commission, 447 U.S. 530, 542, 65 L. Ed. 2d 319, 100 S. Ct. 2326 (1980) (\"The customer of Consolidated Edison may escape exposure to objectionable material simply by transferring the bill insert from envelope to waste basket.\"). In contrast to the fleeting exposure involved in communications by mail, the intrusion by a door-to-door solicitor is more burdensome on the homeowners' privacy and is not easily avoided:\n\n\"To the city council falls the duty of protecting its citizens against the practices deemed subversive of privacy and of quiet. A householder depends for protection on his city board rather than churlishly guarding his entrances with orders forbidding the entrance of solicitors. A sign would have to be a small billboard to make the differentiations between the welcome and unwelcome that can be written in an ordinance only cheaply for all homes.\"\n\nBreard, 341 U.S. at 640 (rejecting commerce clause claim). Indeed, to replicate the effect of the statute, the homeowner would be required to post a sign each and every day during the hours in which he wished to remain undisturbed. Moreover, the Supreme Court recognized the disruption to peace caused by solicitors in Breard : \"A doorbell cannot be disregarded like a handbill. It takes several minutes to ascertain the purpose of a propagandist and at least several more to get rid of him.\" 341 U.S. at 639 n.27. Thus, I would hold that the homeowners who were unwilling to be solicited between the hours of 5:00 p.m. to 9:00 a.m., Monday through Saturday are captive because the intrusion on the homeowner's privacy must be considered as substantial rather than fleeting and, as Breard teaches, may not be easily avoided by the homeowner.\n\nBreard also emphasized the homeowner's interest in privacy and the municipality's interest in preventing crime:\n\n\"House to house canvassing raises more serious problems. Of all the methods of spreading unpopular ideas, this seems the least entitled to extensive protection. The possibilities of persuasion are slight compared with the certainties of annoyance. Great as is the value of exposing citizens to novel views, home is one place where a man ought to be able to shut himself up in his own ideas if he desires. There he should be free not only from unreasonable searches and seizures but also from hearing uninvited strangers expound distasteful doctrines. A doorbell cannot be disregarded like a handbill. It takes several minutes to ascertain the purpose of a propagandist and at least several more to get rid of him.\n\nMoreover, hospitable housewives dislike to leave a visitor on a windy doorstep while he explains his errand, yet once he is inside the house robbery or worse may happen. So peddlers of ideas and salesmen of salvation in odd brands seem to call for regulation as much as the regular run of commercial canvassers.\n\nFreedom of the home is as important as freedom of speech.\"\n\nId. at 639 n.27. A substantial portion of this quotation from Professor Chafee's article was also reproduced in Hynes. 425 U.S. at 619. As the court noted in analyzing the commerce claim in Breard, \"It is only by regulating that knock [on the door] that the interest of the home may be protected by public as distinct from private action.\" 341 U.S. at 636-37.\n\nMoreover, the city of Watseka presented more than sufficient evidence to clearly establish its contention that it enacted the ordinance at the request of its residents not only to protect their interest in privacy, but also as a crime prevention measure, and lastly to reassure its elderly residents of security in their homes. The majority rejects the City's evidence because the statistics of day crime rates and night crime rates were statewide, rather than based on Watseka's experience with crime. I cannot accept the majority's conclusion that statewide statistics do not apply to a municipality in the state. Furthermore, I believe that the majority, in direct contradiction to the Supreme Court's holding in Renton, has \"imposed on the city an unnecessarily rigid burden of proof.\" 106 S. Ct. at 930. \"The First Amendment does not require a city, before enacting such an ordinance, to conduct new studies or produce evidence independent of that already generated by other cities, so long as whatever evidence the city relies upon is reasonably believed to be relevant to the problem that the city addresses.\" Id. at 931. Thus, I find the majority's rejection of the city's evidence unwarranted and without basis in law; thus I review the evidence to emphasize the fact that the ordinance advanced substantial interests - assuring the privacy of residences and preventing crime.\n\nThe time limitation was adopted because the incidence of crime increased at night; residents' interest in privacy were greater after 5:00 p.m.; it was impossible to verify the legitimacy of solicitors after 5:00 p.m. since offices were closed; and, because the elderly residents were more fearful of knocks on the door at night. That unregulated canvassing poses a risk of crime is well known: \"burglars frequently pose as canvassers, either in order that they may have a pretense to discover whether a house is empty and hence ripe for burglary, or for the purpose of spying out the premises in order that they may return later.\" Martin, 319 U.S. at 144. Furthermore, burglars are alerted to the fact that homeowners are away from the premises on vacation with the accumulation of pamphlets, circulars, newspapers and flyers left at the door by solicitors. Indeed, the statistics supplied by the Illinois law enforcement officials in support of the City's motion for summary judgment demonstrated that throughout the State of Illinois, the incidence of crime is much greater after 5:00 p.m. Statistics compiled on robbery, assault and burglary offenses in Illinois, excluding offenses committed in Chicago, revealed that 73% of all robberies and assaults and 63% of all burglaries were committed in the hours between 5:00 p.m. and 9:00 a.m. Distribution of Robbery, Assault and Burglary Offenses in Illinois by Hour of Occurrence: 1981, attached as Exhibit A to the affidavit of Larry Dykstra, Associate Director of the Police and Research Division of the Illinois Criminal Justice Information Authority. Moreover, the retired chief of police of Watseka testified in his affidavit:\n\n\"As a police officer and as Sheriff, he had occasion to and did observe the incidence of crime in the City of Watseka. The incidence of crime in said city was substantially greater after dark than in daylight hours. A greater number of police officers were required after dark than during daylight hours for the safety of the community [sic].\n\nThe victims most susceptible to criminal invasion and assault after dark were the elderly and young mothers who were alone with small children.\n\nIt has been commonplace, from time to time, for persons purporting to be solicitors to call at residences after dark, purport to make installment sales of merchandise or services, take a substantial down payment, and then disappear from the community without later providing the product or service purchased.\n\nThe patroling of residential areas in the evening hours is more difficult when solicitors are moving about in neighborhoods, requiring greater police patrols and ascertaining the identify [sic] of such persons.\"\n\nIn addition to the concern about burglary and violent home invasions, the Mayor testified in his affidavit that fraudulent solicitations were more likely to be successful after 5:00 p.m.:\n\n\"In the years Affiant has lived in Watseka, he has been aware of the practice of itinerant persons purporting to be solicitors misrepresenting their authority and their purpose of solicitation. It has been common practice for such persons to solicit at night when all offices would be closed and there would be no way to verify their authority or the agency they claim to represent. Local persons signing orders with such fictitious solicitors and making payments thereto would find, upon checking, that no such agency existed. As a result, there has [sic] been numerous complaints by local citizens directed to City authorities for help.\"\n\nBoth the Mayor and Mary Mull, the local chairman in charge of the Senior Citizens Center in Watseka, informed the court that Watseka has a large number of senior citizens, many of whom live alone. The Mayor and Mull testified that on numerous occasions, senior citizens had expressed their fear and apprehension of being harmed and attacked at night and of being frightened by unexpected knocks on their doors after dark. Indeed, the city's interest in preventing crime is particularly important to helpless older citizens, who are already prisoners in their homes and can no longer enjoy the beautiful country hillsides or the magic of the sky on a summer night. Thus, Watseka has established to the court with the introduction of clear and convincing evidence that (1) Watseka residents wished to protect the privacy of their homes by regulating solicitors; (2) in Illinois, crimes increased in the hours between 5:00 p.m. and 9:00 a.m.; and, (3) its elderly residents were frightened by knocks on their doors at night. Watseka, therefore, in contrast to the City of Kenosha, has sustained its evidentiary burden. In City of Kenosha, our court specifically noted the City's failure to present sufficient evidence to support its contention that its solicitation ordinance was enacted to protect its residents' privacy and peaceful enjoyment of their homes. Wisconsin Action Coalition v. City of Kenosha, 767 F.2d 1248, 1257 (7th Cir. 1985). (\"[T]he City did not present any evidence at all that the Ordinance would further the City's legitimate interest in protecting privacy and peaceful enjoyment of the home.\"). Thus, IPAC's reliance on City of Kenosha is misplaced and Kenosha's precedential relevance is not an issue before the court. I would hold that the provision of the ordinance prohibiting solicitation after 5:00 p.m. reasonably serves Watseka's interest in preventing crime.\n\nFurthermore, the prohibition of canvassing after 5:00 p.m. serves the town's interest in protecting the privacy of its residents. As the Supreme Court noted in Martin, \"constant callers, whether selling pots or distributing leaflets, may lessen the peaceful enjoyment of a home as much as a neighborhood glue factory or railroad yard . . .\" 319 U.S. at 144. The preamble to the solicitation ordinance revealed that the City had received \"numerous complaints . . . about persons who have gained, or sought to gain, admittance to their residences for the purposes of soliciting, [and have] made nuisances of themselves by disturbing and annoying the occupants, or by their acts and conduct have violated the right of the occupants to the quiet and peaceful enjoyment and security of their homes. . . .\" I would hold that the time limitation, which forbids solicitation when the homeowner's interest in privacy is at its greatest, during the dinner hour and afterward, clearly protects the privacy interest of Watseka residents.\n\nThus, the final point for consideration is whether the ordinance left open reasonable alternative channels of communication. Renton, 106 S. Ct. at 932; Cornelius, 105 S. Ct. at 3453. \"The First Amendment does not demand unrestricted access to a nonpublic forum merely because use of that forum may be the most efficient means of delivering the speaker's message.\" Cornelius, 105 S. Ct. at 3453. The Watseka ordinance is not an absolute ban on soliciting in view of the fact that the ordinance permits soliciting during the hours between 9:00 a.m. and 5:00 p.m., Monday through Saturday. Furthermore, the City submitted the affidavit of the Executive Secretary of the Watseka Chamber of Commerce, testifying to the fact that major employers in the City utilized around-the-clock employment, as demonstrating that numerous Watseka residents were at home during the hours in which solicitation was permitted. Moreover, IPAC has access to alternative channels including direct mail, in person solicitation outside the residence, and radio or television advertising. Cf., Cornelius, 105 S. Ct. at 3453.\n\nIn sum, my review of the First Amendment cases and literature has given me no other alternative, based upon a clear and logical reading of the decisions of the Supreme Court, than to reach the conclusion that a municipality's regulation of the hours of door-to-door solicitation of private residences need only be reasonable. The majority's imposition of a stricter level of scrutiny merely compounds the error made by other courts in indiscriminately citing First Amendment cases out of context. In ignoring Supreme Court mandates, the majority appoints itself as a \"roving commission[] assigned to pass judgment on the validity of the nation's [here, of the state's] laws.\" Broadrick, 413 U.S. at 611. Moreover, in adopting an overly intrusive review of solicitation ordinances, the majority lead us into metaphysical speculation as to what \"is a magically constitutional hour at which to prohibit soliciting. . . .\" See e.g., Kenosha, 767 F.2d at 1258. (\"The district court here said that 9:00 p.m. is not a 'magically constitutional hour at which to prohibit soliciting,' . . . but we recognize that the City's interest in protecting the privacy and peace of its residents increases (perhaps geometrically) with the lateness of the hour. It is not difficult to speculate that at some point it would support the Ordinance in the face of a challenge.\") Courts should confine themselves to the question of whether the ordinance reasonably accommodates the right of the speaker to reach willing audience members, the rights of the willing audience members to receive the message, and the rights of the unwilling audience members to remain undisturbed in the privacy of their homes. Municipal governments, rather than courts, are knowledgeable of their community's crime problems and their citizens' desire for privacy; the decision as to where to draw the line to protect homeowners' privacy and to prevent crime should be left with the municipality, so long as the accommodation of the First Amendment rights of these three groups (speakers, willing, and unwilling audience members) are reasonably accommodated.\n\nE. Damages\n\nFinally, the majority approves the district court's award of $5,000 in damages to IPAC for Watseka's alleged violation of IPAC's First Amendment rights on the grounds that IPAC's injury was \"indistinguishable from the particular injury for which the Court approved compensatory damages in Nixon v. Herndon.\" The injury compensated in the Nixon court case resulted from a violation of the plaintiff's First Amendment right to vote in a state primary election. I fail to see any similarity whatsoever between depriving a citizen of his time-honored First Amendment right to exercise his right to cast a ballot in favor of the candidate of his choice, and the deprivation of the alleged First Amendment right to solicit on private property that the majority mistakenly finds in this case. As the Supreme Court noted in Memphis Community School District v. Stachura, 477 U.S. 299, 91 L. Ed. 2d 249, 106 S. Ct. 2537, 54 U.S.L.W. 4771 (U.S. June 24, 1985), the cases providing compensation for violations of the right to vote \"involve nothing more than an award of presumed damages for a non-compensatory harm . . . . Thus, whatever the wisdom of these decisions in the context of the changing scope of compensatory damages . . . they do no support an award of non-compensatory damages,\" Id. at 4774 n.14 (emphasis added), such as that awarded by the district court and approved by the majority. The majority approves the $5,000 awarded in the district court on the basis of its perception of the abstract importance of a constitutional right, in contravention of the Supreme Court's clear language in Memphis that one \"could recover compensatory damages only if he proved actual injury caused by the denial of his constitutional rights.\" Id. at 4773. Moreover, the Supreme Court further explained that rights \"'constitutional and otherwise, do not exist in a vacuum. Their purpose is to protect persons from injuries to particular interests.' Where no injury was present, no 'compensatory' damages could be awarded.\" Id. at 4773 (quoting Carey v. Piphus, 435 U.S. 247, 254, 55 L. Ed. 2d 252, 98 S. Ct. 1042 (1978)) (citations omitted). Furthermore, \" no compensatory damages [can be] awarded for violation of [a constitutional right] absent proof of actual injury. Carey thus makes clear that the abstract value of a constitutional right may not form the basis\" for an award of compensatory damages. Thus, the majority by approving the district court's award of $5,000 for Watseka's alleged violation of IPAC's First Amendment right fails to consider, as the Supreme Court emphasized in Memphis, that\n\n\"history and tradition do not afford any sound guidance concerning the precise value that juries should place on constitutional protections. Accordingly, were such damages available, juries would be free to award arbitrary amounts without any evidentiary basis, or to use their unbounded discretion to punish unpopular defendants. Such damages would be too uncertain to be of any great value to plaintiffs, and would inject caprice into the determination of damages awards for the violation of constitutional rights.\"\n\nId. at 4774 (citations omitted). The majority's approval of the district court's award of $5,000 for the deprivation of IPAC's alleged First Amendment right to solicit on private property allows this very arbitrariness and capriciousness, to which the Supreme Court referred in contravention of the Supreme Court's mandate in Memphis, to enter into the award of damages in this case.\n\nFor the reasons set forth herein, I am forced to dissent.\n\n\u003cspan class=\"fn\"\u003e1. Judge Coffey, although he dissents from the result reached, kindly contributed to the first section of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Watseka, Ill., Rev. Ordinances ch. 19, ยงยง 19-1 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Id. ยง 19-1. The ordinance provided: \"Soliciting\" shall mean and include any one or more of the following activities: Seeking to obtain orders for the purchase of goods, wares, merchandise, food stuffs, services of any kind, character or description whatever, for any kind of consideration whatever; or Seeking to obtain subscriptions to books, magazines, periodicals, newspapers and every other type or kind of publication.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Id. ยง 19-3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Id. ยงยง 19-7 - 19-9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Id. ยง 19-9. Sections 19-5 through 19-10 of the ordinance are reprinted in the Appendix to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. For convenience sake, we will refer to the defendants jointly as IPAC, since the ACLU's role was apparently only as IPAC's legal counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Because the district court found that Watseka's ordinance was unconstitutional, the court did not reach the issue whether IPAC came within the ordinance's definition of solicitation. This issue was not raised on appeal and we do not consider it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Although the dissent attempts to challenge the validity of Martin v. Struthers, 319 U.S. 141, 87 L. Ed. 1313, 63 S. Ct. 862 (1943), our review of the case indicates that it remains good law in situations such as the one before us. As the dissent concedes, the Court has never overruled Martin. In Martin, the Court struck down a broad ordinance which prohibited all solicitation. Breard v. Alexandria, 341 U.S. 622, 95 L. Ed. 1233, 71 S. Ct. 920 (1951), in which the Court upheld an ordinance prohibiting unsolicited door-to-door magazine subscription sales, is distinguishable from Martin because of the Court's emphasis on the commercial nature of the speech in Breard. Id. at 641-44. See R. Rotunda, J. Nowak, \u0026 J. Young, Treatise on Constitutional Law ยง 20.28 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. IPAC challenges the prohibition only as applied from 5 p.m. to 9 p.m. As we noted in Kenosha, although 9 p.m. does not necessarily have a special constitutional significance, we are aware of no cases where solicitors have sought to solicit after 9 p.m. or a court has struck down a prohibition as applied after 9 p.m. 767 F.2d at 1258. IPAC has no objection to complying with the registration requirements and honoring \"No Solicitors\" signs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Kenosha ordinance provided: CHARITABLE, RELIGIOUS AND POLITICAL SOLICITATIONS. It shall be unlawful for any person, firm or corporation to solicit or cause to be solicited contributions of money, goods or services to be utilized for a charitable, religious or political purpose in a residentially zoned area without a prearranged appointment during the hours of 8:00 P.M. to 8:00 A.M. See 767 F.2d at 1249. The plaintiffs in Kenosha challenged the ordinance only as applied between 8:00 p.m. and 9:00 p.m. Id. at 1258.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Watseka spent most of its oral argument contending that this case is controlled by the public forum/private forum standards in Cornelius v. NAACP Legal Defense \u0026 Education Fund, 473 U.S. 788, 87 L. Ed. 2d 567, 105 S. Ct. 3439, 53 U.S.L.W. 5116 (U.S. July 2, 1985). This argument is meritless. The Supreme Court's analysis of government property turns upon the public forum/private forum distinction, but nothing in Cornelius suggests the Court intended to extend this distinction to time, place, and manner restrictions on private property. Indeed, the Supreme Court's recent decision in City of Renton v. Playtime Theatres, 475 U.S. 41, 89 L. Ed. 2d 29, 106 S. Ct. 925, 54 U.S.L.W. 4160 (U.S. Feb. 25, 1986), upon which we heavily rely here, followed the Court's traditional approach to time, place, and manner restrictions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. We do not believe that Justice White's opinion in Clark rejected the less restrictive means analysis. See 52 U.S.L.W. at 4989. Although the opinion rejects the lower court's less-restrictive-means holding, we read Justice White to say that the alternatives were not adequate. Although Justice White has elsewhere expressed his disapproval of the less-restrictive-means standard, see Regan v. Time, 52 U.S.L.W. at 5089, that view has never attracted a majority of the Court. See also Kenosha, 767 F.2d at 1255 n.4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The preamble to the ordinance provided: WHEREAS, numerous complaints have been received by the members of the governing body of this City from occupants of residences and dwelling units, about persons who have gained, or sought to gain, admittance to their residences for the purpose of soliciting, or, on the pretext of soliciting, have by their conduct made nuisances of themselves by disturbing and annoying the occupants, or by their acts and conduct have violated the right of the occupants to the quiet and peaceful enjoyment and security of their homes; and in some cases persons have sought admittance to a residence as a solicitor for the purpose of gaining information for some illegal purpose or to commit an illegal act; and WHEREAS, the City Council declares that the regulations established by this chapter are necessary for the safety, health, comfort, good order, protection, and welfare of those residents of this City who desire the protection of the regulations established by this chapter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Although Watseka presented more evidence, in terms of quantity, than the city in Kenosha, Watseka's evidence is not \"stronger offer of evidence\" which we suggested in Kenosha might suffice to support the ordinance. 767 F.2d at 1250. When a city like Watseka wants to pass an ordinance that will substantially limit First Amendment rights, the city must produce more than a few conclusory affidavits of city leaders which primarily contain unsubstantiated opinions and allegations. See In re Morris Paint and Varnish Co., 773 F.2d 130, 135 (7th Cir. 1985) (\"allegations in [appellant's] affidavit are so conclusory, and so devoid of specific factual content, that they are insufficient to create a material issue of fact\"); see also First Commodity Traders v. Heinold Commodities, 766 F.2d 1007, 1011 (7th Cir. 1985). Likewise, the only crime statistics submitted by Watseka are statewide, and Watseka makes no effort to tie them either to Watseka's own interests or to solicitation in general.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The only evidence Watseka presented about actual per-hour crime commission was two statewide studies. The first was a Department of Law Enforcement publication entitled \"Crime in Illinois 1981,\" which contained statewide rates and only covered robbery, assault, burglary, theft, and arson. The second was entitled \"Distribution of Robbery, Assault, and Burglary Offenses in Illinois By Hour of Occurrence: 1981.\" Watseka made no effort to tie these statistics to solicitation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. By our own rough calculation, the sun sets at 5 p.m. or earlier in Watseka less than three months out of the year (89 days, from October 26 to January 22). See R. Thomas, The Old Farmer's 1986 Almanac (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. At oral argument counsel for IPAC suggested that in their solicitation they should also have the unrestricted right to go around to the back door of a residence, or elsewhere in the yard if necessary. After dark in particular, that could demonstrate a serious lack of good judgment by the legitimate solicitor. In any event, this opinion addresses only the limited right of a solicitor to come to the front door of a residence, and should not be broadly interpreted as approving possible trespass on private property for solicitation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* The Honorable Robert A. Grant, Senior District Judge of the Northern District of Indiana, is sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Rejecting one commentator's assumption that the overbreadth and \"less drastic means\" doctrines are conceptually distinct. J. Nowak, R. Rotunda \u0026 J. Young, Handbook on Constitutional Law, 867, 873 (2d ed. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. West Virginia Citizens Action Group v. Daley, 324 S.E.2d 713, 721-25 (W.Va. 1984) simply adopts the overbreadth cases cited by the Frontenac court. Two cases (New York Community Action Network v. Town of Hempstead, 601 F. Supp. 1066, 1069 (E.D.N.Y. 1984) and Citizens for a Better Environment v. Village of Olympia Fields, 511 F. Supp. 104, 106 (N.D. Ill. 1980)) rely on Organization for a Better Austin v. Keefe, 402 U.S. 415, 29 L. Ed. 2d 1, 91 S. Ct. 1575 (1971) as support for invoking strict scrutiny; however, Keefe was a prior restraint case. Keefe, 402 U.S. at 419. (\"Any prior restraint on expression comes to this court with a 'heavy presumption' against its constitutional validity.\"). Moreover, Village of Olympia Fields relied on a vagueness case, Hynes v. Mayor of Oradell, 425 U.S. 610, 616, 48 L. Ed. 2d 243, 96 S. Ct. 1755 (1976), as support for the proposition that a time, place, and manner regulation must \"relate with narrow specificity to one or several legitimate governmental interests and not unduly intrude upon the rights of free speech.\" 511 F. Supp. at 106. Connecticut Citizens Action Group (CCAG) v. Town of Southington, 508 F. Supp. 43, 46 (D. Conn. 1980), relies on Schaumburg without providing a justification for relying on this overbreadth case. New York City Unemployed v. Brezenoff, 677 F.2d 232, 239 (2nd Cir. 1982) applied an overbreadth analysis to a time, place, and manner regulation of access to a nonpublic forum. The court not only failed to justify its reliance on overbreadth analysis, but also ignored the rule that time, place, and manner regulations of nonpublic forums need only be reasonable. United States Postal Service v. Council of Greenburgh Civic Associations, 453 U.S. 114, 69 L. Ed. 2d 517, 101 S. Ct. 2676 (1981); see also Cornelius v. NAACP Legal Def. and Ed. Fund, Inc., 473 U.S. 788, 105 S. Ct. 3439, 3453, 87 L. Ed. 2d 567 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Contrary to an assertion made in Wisconsin Action Coalition v. City of Kenosha, 767 F.2d 1248 (7th Cir. 1985), the opinion I authored in National Anti-Drug Coalition, Inc. v. Bolger, 737 F.2d 717 (7th Cir. 1984) did not apply a least-restrictive-means analysis to a content-neutral, time, place, and manner regulation. The panel in Kenosha contended: \"In Bolger we considered whether there were less restrictive means. In fact, we discussed the less restrictive regulation the Postal Service had actually tried and found wanting. 737 F.2d at 724-26. We also noted the administrative burden in trying to develop an individual plan for each of the 30,000 differently configured post offices across the country. Id. at 727 \u0026 n.8. It was only by such consideration that we could determine that the regulation was necessary and had been drawn with specificity and was narrowly tailored. This approach accords with our analysis in Village of Schaumburg, 590 F.2d at 225-26, where we considered less restrictive alternatives to the Village's anti-solicitation ordinance in order to determine that it was not drawn narrowly enough.\" 767 F.2d at 1256. The issue in Bolger was whether a postal service regulation prohibiting soliciting on postal service premises violated the First amendment rights of solicitors. Although the parties failed to present sufficient evidence to enable the court to determine whether the ingress/egress sidewalks located on postal service property were a traditional public forum, 737 F.2d at 722, or were a designated public forum, id. at 723, we assumed for the purpose of our discussion that the ingress/egress sidewalks were a public forum. Id. at 723. The test we applied to the postal regulation was whether it was content-neutral and was narrowly tailored to serve a significant governmental interest, and whether the regulation left open ample alternative channels of communication. Id. After concluding that the regulation was content-neutral, we turned to the question of whether there was a \"significant government interest to be served by prohibiting the solicitation of public contributions and the sale of literature on postal property.\" Id. at 724. The governmental interest we identified was the interest in providing prompt, reliable and efficient postal services. Id. at 724-27. The postal service's experience with prior regulations permitting soliciting was discussed as evidence supporting the postal service's contention that permitting soliciting on postal service property disrupted the conduct of postal business ; thus, the panel did not apply a \"least-restrictive-means\" analysis when discussing the prior regulation. To the contrary, we employed a \"narrowly-tailored\" analysis and concluded that the harm the regulation sought to prevent (disruption of postal services) was created by the medium of expression itself (solicitation of funds on postal property).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The \"ample alternative channels of communication\" test is entirely separate from the \"less restrictive means\" test \"[Less restrictive means] denotes an inquiry into whether there are other regulations which are less restrictive of protected activity but protect the governmental interest served by the challenged regulation. The 'ample alternative channels' inquiry focuses on methods of communication . . . .\" Kenosha, 767 F.2d at 1254 n.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The speaker's right to assert the interests of the audience is analogous to, but distinguishable from, third-party standing under the overbreadth doctrine. Under the overbreadth doctrine, \"the courts are inclined to disregard the normal rule against permitting one whose conduct may validly be prohibited to challenge the proscription as it applies to others because of the possibility that protected speech or associative activities may be inhibited by the overly broad reach of the statute.\" Village of Schaumburg, 444 U.S. at 634. On the other hand, a speaker is allowed to invoke the interests of the audience, not necessarily because of the chilling effect of the speech regulation, but simply because audience members are generally unlikely to bring a First Amendment action on their own behalf. Nimmer at ยง 1.02[F]. Thus, the courts' consideration of the audience interest is not an invocation of the overbreadth doctrine with strict scrutiny through the less-restrictive-means test.\u003c/span\u003e\n\n",
    "body_length": 145671,
    "citedas": [
      "796 F.2d 1547"
    ],
    "attorneys": "Ralph J. Swanson SEBAT SWANSON BANKS LESSEN \u0026 GARMAN 306 Adams Building Danville, IL 61832 for Plaintiff. Jane M. Whichy Roger Baldwin Fnd. of ACLU 220 South State Street Chicago, IL 60604 for Defendant.",
    "category": [
      "36"
    ],
    "judges": "Before WOOD, JR., and COFFEY, Circuit Judges, and GRANT , Senior District Judge.*fn*",
    "citation_count": 81
  }
}
