{
  "id": "zbQETWYBTlTomsSBwZA9",
  "document": {
    "title": "05/27/77 RESERVE MINING COMPANY v. ROBERT L. HERBST",
    "full_title": "RESERVE MINING COMPANY, ARMCO STEEL CORPORATION, REPUBLIC STEEL CORPORATION, UNITED STEELWORKERS OF AMERICA, AFL-CIO, CITY OF SILVER BAY, CITY OF BEAVER BAY, LAKE COUNTY, NORTHEASTERN MINNESOTA DEVELOPMENT ASSOCIATION, DULUTH AREA CHAMBER OF COMMERCE, CITY OF BABBITT, RANGE LEAGUE OF MUNICIPALITIES, LAX LAKE PROPERTY OWNERS ASSOCIATION, THE SILVER BAY CHAMBER OF COMMERCE, THE TOWNSHIP OF BEAVER BAY, AND ST. LOUIS COUNTY v. ROBERT L. HERBST, COMMISSIONER OF THE DEPARTMENT OF NATURAL RESOURCES, STATE OF MINNESOTA, MINNESOTA POLLUTION CONTROL AGENCY, WARREN SPANNAUS, ATTORNEY GENERAL, STATE OF MINNESOTA, SAVE LAKE SUPERIOR ASSOCIATION, SIERRA CLUB, MINNESOTA PUBLIC INTEREST RESEARCH GROUP, AND MINNESOTA ENVIRONMENTAL CONTROL CITIZENS ASSOCIATION",
    "jurisdiction": "Supreme Court of Minnesota",
    "date": "1977-05-27T00:00:00.000Z",
    "docket": "Nos. 47504, 47528, 47529, 47530, 47537, 47575",
    "body": "1. Where the district court is acting in an appellate capacity with respect to administrative agencies, the supreme court on appeal again scrutinizes the agency decision and accords the trial court only such deference as it would give to the opinions of other appellate jurisdictions.\n\n2. In reviewing the decisions of administrative agencies, the district court and the supreme court are governed by the provisions of the Administrative Procedure Act, Minn.St. 15.0425, and shall determine inter alia whether the agencies' findings are supported by substantial evidence and whether their conclusions are arbitrary and capricious.\n\n3. It is error for an administrative agency to designate as \"feasible and prudent\" an alternative site for a tailings basin dam under Minn.St. 116B.09, subd. 2, where the undisputed evidence indicates that the site selected by the mining company will support a safe structure.\n\n4. The designation of a tailings site within a national forest is not a feasible and prudent alternative to a site selected elsewhere by a mining company where the impact on natural resources at the two locations will not differ significantly and the intrusion of an industrial development into the national forest would be inconsistent with the purposes and uses permitted by Federal law.\n\n5. Standards of air quality adopted by the United States Court of Appeals for the Eighth Circuit in Reserve Mining Co. v. Environmental Protection Agency, 514 F.2d 492, 538-39 (1975), govern state and Federal administrative agencies and courts in establishing medically safe levels for the emission of carcinogenic fibers from the operation of taconite plants and tailings sites.\n\n6. Where the evidence compels a finding that projected amphibole fiber levels to be generated by a proposed on-land tailings site may be dangerous to the health of those in the proximity of the site, it is error for an administrative agency to designate a more remote site as a \"feasible and prudent alternative.\" Under such circumstances it is the duty of the agency to require the mining company which will use the site either to mitigate their processes further to achieve a safe level of emission or to terminate their operations altogether.\n\nOTIS, Justice.\n\nThese appeals arise from proceedings which were initiated on November 18, 1974, by Reserve Mining Company (Reserve) to obtain permits from the commissioner of the Department of Natural Resources (DNR) and the Minnesota Pollution Control Agency (PCA) for construction of an onland disposal site at Mile Post 7 near Silver Bay in Lake County in response to mandates of the Federal court to discontinue the use of Lake Superior for the disposal of tailings. Both agencies appointed as a hearing officer Wayne H. Olson, an attorney, previously commissioner of the Department of Natural Resources, who took testimony from June 23, 1975, to March 18, 1976, and on June 23, 1976. He made findings and on May 26, 1976, recommended against granting permits for Mile Post 7 in favor of an alternative site, preferably Midway, hereafter referred to as Mile Post 20. The PCA Board rejected these recommendations on June 15, 1976, but thereafter reversed its decision and on July 1, 1976, joined the DNR in accepting the hearing officer's recommendations. (See appendix for maps of alternative sites.)\n\nAn appeal was taken by Reserve to a three-judge panel of the District Court of Lake County which received additional evidence from November 3, 1976, to December 3, 1976. On January 28, 1977, the trial court filed orders on which judgments were entered on January 31, 1977, directing the DNR and PCA to issue permits to Reserve for Mile Post 7. Appeals to this court were begun on February 1 by the DNR and the attorney general, followed by appeals of the PCA and various other intervenors.\n\nOral arguments were presented to the full court on April 7, 1977. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e On April 8, 1977, the court rendered the following decision to which this opinion is addressed: \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\n\"The orders and judgments of the District Court of Lake County, Sixth Judicial District, from which appeals have been taken in the above entitled matters are affirmed by unanimous decision of the court subject to the conditions hereinafter set forth.\n\n\"The Commissioner of Natural Resources and the Minnesota Pollution Control Agency are accordingly directed to issue forthwith permits for an on-land disposal facility at Mile Post 7 for which Reserve Mining Company has applied. Such permits shall be subject to all of the conditions heretofore demanded by the Minnesota Pollution Control Agency and the Commissioner of Natural Resources, or both, which in all respects have been accepted by Reserve, Armco Steel Corporation, and Republic Steel Corporation, including the following:\n\n\"a) The permit shall be limited to a specific five-year term.\n\n\"b) Armco and Republic shall be copermittees with Reserve Mining Company.\n\n\"c) The permittees shall assume all risks and liabilities arising from the implementation of the Mile Post 7 on-land disposal site and system.\n\n\"d) The permittees shall be required to perpetually maintain the tailings basin site to insure the integrity of the basin structures and to prevent the deposited tailings from re-entering the air and water of the state.\n\n\"e) All tailings except those used for dam and dike construction shall be placed underwater in the tailings basin during operations to the maximum extent possible with all exposed tailings to be adequately vegetated as soon as possible. Upon termination, the entire tailings basin shall be totally vegetated as soon as possible using the then best available technology.\n\n\"f) All tailings shall be disposed of in the Mile Post 7 permitted on-land tailings disposal system facility. The permittees shall be prohibited from using or allowing any other person or governmental entity to use tailings for any other purpose.\n\n\"g) The permittees shall be required to apply the best available technology to maintain air quality and to comply with all applicable laws and regulations, specifically including Minn.Reg. APC 1 and APC 6 and such other standards which now or in the future may apply to the permittees' tailings. This technology shall include specifically, but not exclusively, the use of spray water and effective and non-polluting chemical binders and other dust retardants on all exposed surfaces of tailings and upon all access and haul roads. In addition, only containerized or indoor and totally covered tailings stockpiles shall be permitted outside the disposal area.\n\n\"h) The permittees shall be required to apply the best available technology to maintain water quality and to comply with all applicable laws and regulations, specifically including Minn.Reg. WPC 14 and such other standards which now or in the future may be applied to the permittees' tailings. This technology shall include specifically, but not exclusively, the following:\n\n\"1) The tailings disposal system shall be operated as a closed system including the collection of seepage and surface runoff for return to the basin.\n\n\"2) A dual pipeline system with required controls, spill detection devices, emergency catchment basins and other protective devices.\n\n\"3) Any water discharge from the tailings or catchment basin shall be treated to the extent necessary to conform to all present and future water quality standards.\n\n\"i) The permittees shall be required to monitor the Mile Post 7 basin structures and the air and water in and adjacent to the tailings disposal area for the purpose of enabling any reaction to any potentially hazardous condition. The permittees shall establish an air and water monitoring program to be approved by the Minnesota Pollution Control Agency and shall operate this monitoring program with the capability of providing information necessary for rapid response in applying mitigating measures and procedures. Such air and water monitoring shall include, but is not limited to, the identification and counting of fibers by such methods as x-ray diffraction, electron microscopy or any other methods as the PCA may specify.\n\n\"j) Reasonable costs for monitoring and analysis beyond the routine compliance monitoring conducted by the PCA or consultants directed by the PCA shall be borne by the permittees.\n\n\"k) Dam design, construction and operations consistent with the recommendations of the Minnesota Pollution Control Agency staff and the state's consultants. The reasonable costs of such consultants shall be borne by the permittees.\n\nl) Any other conditions to which the parties have agreed.\"\n\nThe basic issues which emerge on this appeal are as follows:\n\n1) What is the proper scope of review of decisions of the DNR and PCA by the district court and by this court?\n\n2) Does the evidence support a finding by the DNR and PCA that the use of Mile Post 7 as a tailings site would cause such pollution and so impair or destroy the air, water, land, and other natural resources of the state that the use of a site such as Mile Post 20 may be mandated as a feasible, prudent, and economical alternative consistent with reasonable requirements of the public health, safety, and welfare?\n\n3) In construing and enforcing statutes dealing with pollution control, environmental policy, and environmental rights as they affect tailings sites, with what degree of certainty must a state agency find that a potential hazard to public health and safety exists which outweighs the likelihood of seriously detrimental consequences to the economy of those affected by its decision?\n\n4) Are the conditions attached by the DNR, PCA, Federal court, and this court to granting permits for constructing and operating a tailings site adequate to insure compliance with environmental and pollution control statutes in the use of Mile Post 7?\n\nJurisdiction Exercised by the Federal Court\n\nUpon the depletion of high grade iron ore in the Mesabi Range, Reserve Mining Company in the year 1947 sought and obtained from the Water Pollution Control Commission and Department of Conservation (predecessors of the Pollution Control Agency and the Department of Natural Resources) permits to construct a taconite processing plant at Silver Bay on the shore of Lake Superior. Large quantities of lake water were necessary for the operation of the plant and resulted in some 67,000 tons of sludge being returned to the lake every day. The permits were issued on the theory that the tailings would settle in a trough some 900 feet deep in Lake Superior. At a public hearing on June 17, 1947, the concerns expressed by Minnesota Conservation Commissioner Chester S. Wilson proved to be prophetic when he stated to H. S. Taylor, a representative of Reserve:\n\n\"And you understand that if the permit should be granted and the discharge from the water from this plant should result in damaging consequences not contemplated, that the responsibility would be on your company or on the applicant company to take whatever action might be necessary to remedy those conditions.\"\n\nIn response, Mr. Taylor stated:\n\n\"Why yes, we can stand that risk in any event we have to take certain risks. * * * This company will be a responsible company and we will recognize our legal liabilities.\" United States v. Reserve Mining Co., 408 F. Supp. 1212, 1218 (D.Minn. 1976). After an expenditure of $350 million by Reserve, the plant began commercial operations in the year 1956.\n\nA conference of representatives of the United States and the States of Minnesota, Michigan, and Wisconsin convened by the Secretary of the Interior in September 1969 determined that Reserve's operation was polluting Lake Superior and asked the company to propose an abatement plan. In November 1969 the Secretary of the Interior approved standards of water quality for Lake Superior adopted earlier by the PCA. Reserve challenged the validity of those standards in the District Court of Lake County. The trial court held that Water Pollution Control Regulation 15(c)(6) was arbitrary and unreasonable as to Reserve because it prescribed a density too light for discharges to settle in the lake, but otherwise held it valid as amended. We affirmed that ruling but reversed so much of the decision as required the parties to negotiate for a variance. Reserve Mining Co. v. Minnesota PCA,294 Minn. 300, 308, 200 N.W.2d 142, 146 (1972).\n\nA plan submitted by Reserve to the Lake Superior Enforcement Conference in January 1971 designed to \"flocculate\" tailings (cause them to coalesce into small lumps) was rejected by the conference. The Attorney General of the United States was thereupon asked to commence an action against Reserve to enjoin further pollution of Lake Superior. The present on-going litigation in Federal court then began in 1972 and resulted in an order entered by the court on April 20, 1974, enjoining the discharge by Reserve of tailings into Lake Superior and amphibole fibers into the air as of the following day, April 21, 1974. United States v. Reserve Mining Co., 380 F. Supp. 11, 21 (D.Minn. 1974). On April 22, the court of appeals granted a brief stay and, after a further hearing on May 11, granted a 70-day stay on condition that Reserve take \"prompt steps to prepare and implement an appropriate plan for abatement.\" That stay was extended until a hearing on the merits was had. Reserve Mining Co. v. United States, 498 F.2d 1073 (8 Cir. 1974).\n\nThree applications to vacate the stay were presented to the United States Supreme Court and denied: July 9, 1974, 418 U.S. 911, 94 S. Ct. 3203, 41 L. Ed. 2d 1156 (1974); October 11, 1974, 419 U.S. 802, 95 S. Ct. 287, 42 L. Ed. 2d 33 (1974); and March 31, 1975, 420 U.S. 1000, 95 S. Ct. 1441, 43 L. Ed. 2d 758 (1975). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The court of appeals in its decision noted that \" June 8, 1973, the case was essentially a water pollution abatement case, but on that date the focus of the controversy shifted to the public health impact of Reserve's discharge of asbestiform particles into the air and water.\"498 F.2d 1073, 1074 (8 Cir. 1974). It held that whether such discharges resulted in detrimental health effects was unknown, the level of asbestiform fiber exposure was undetermined, and no substantial danger had been proved.\n\nIn response to the appeal court's remand to consider Reserve's abatement plan and to encourage a voluntary settlement, the trial court on October 18, 1974, entered a supplemental memorandum and order finding Reserve to be in violation of various Wisconsin and Minnesota pollution statutes and reserved consideration of the fines and penalties which it would impose. United States v. Reserve Mining Co., 394 F. Supp. 233 (D.Minn. 1974). The court of appeals, in reviewing on the merits the trial court's decision, resolved the issue of its jurisdiction over air pollution as distinguished from water pollution, Reserve Mining Co. v. Environmental Protection Agency, 514 F.2d 492, 522, note 55 (8 Cir. 1975), by stating: \"As to Minnesota's claims relating to air emissions, we believe this is an appropriate case in which to invoke pendent jurisdiction,\" citing Mine Workers v. Gibbs, 383 U.S. 715, 725, 86 S. Ct. 1130, 1138, 16 L. Ed. 2d 218, 227 (1966). The Federal court affirmed and retained jurisdiction to determine the question of air pollution under state law. The court of appeals concluded by holding that Reserve should be given a reasonable time to cease discharging its wastes into Lake Superior including the time necessary for the state to act on Reserve's application to dispose of tailings at Mile Post 7 or some other acceptable site. The court suggested that a final administrative decision should be reached within a year after a final appellate decision. If the state and Reserve were unable to agree on a site, Reserve was given a year to phase out its Silver Bay facilities. Thereafter, the chief judge of the district court imposed the following penalties against Reserve: \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e 1) $837,500 for violating the terms of its water discharge permits; 2) $200,000 for violating court rules and orders as to discovery; and 3) $22,290 to reimburse the city of Duluth for furnishing interim clean water facilities. United States v. Reserve Mining Co., 408 F. Supp. 1212 (D.Minn. 1976); United States v. Reserve Mining Co., 412 F. Supp. 705 (D.Minn. 1976). The court noted:\n\n\"The court has now determined all pending issues properly within its province. Remaining for resolution is agreement between the State of Minnesota and Reserve Mining Company as to an appropriate on-land taconite waste disposal site. Prompt accord on this issue hopefully will signal the end of this long pending, and often acrimonious, controversy so that Minnesota and its people can return to a normal and productive society with the environment preserved and public health protected.\" 412 F. Supp. 714.\n\nFinally, on July 7, 1976, the district court found:\n\n\"Now, after almost 16 months of study, discussion, negotiation, debate, extensive hearings and official actions by state agencies, no agreement has been reached: Reserve still demands Milepost 7 which Minnesota will not permit, and Minnesota offers Milepost 20 which Reserve does not want.\"\n\nUnited States v. Reserve Mining Co., 417 F. Supp. 789, 791 (D.Minn. 1976). Accordingly the court held:\n\n\" * * * Reserve and its parent corporations cease discharge of taconite tailings into Lake Superior one year from today, at midnight on July 7, 1977.\"\n\nThe court of appeals affirmed the district court's decision with a suggestion that if the on-land disposal controversy is settled by agreement or litigation in the state court, Reserve is \"not barred from seeking modification of the closure order from the district court.\" United States v. Reserve Mining Co., 543 F.2d 1210, 1212 (8 Cir. 1976). That modification was granted on May 26, 1977. However, the court of appeals expressly recognized that the question of arriving at an on-land disposal site was strictly a matter of state law over which the Federal courts would not assume jurisdiction.\n\nPresent Operations at Silver Bay and Proposed Plan for Mile Post 7\n\nReserve Mining Company is jointly owned by Armco Steel Corporation and Republic Steel Corporation. It presently extracts taconite ore from the Peter Mitchell Mine near Babbitt, Minnesota. Reserve \"beneficiates\" the ore (prepares it for smelting) by a process of crushing, grinding, and magnetic concentration, producing pellets of high grade ore which are transported on the Great Lakes to Armco and Republic Steel mills. The Silver Bay plant produces about 10.4 million tons of taconite pellets annually, representing 17 percent of the taconite produced in the United States and accounting for about 8 percent of the nation's iron ore consumption.\n\nAt the Babbitt mine site a crushing process begins which reduces the ore to rocks 4 inches or less in size. The ore is then transported 47 miles by railroad to Reserve's processing plant located at the city of Silver Bay. At the plant, further crushing occurs to reduce the size of rocks to less than three-fourths of an inch. In the concentrating process which follows, water is introduced into the system and the mixture is subjected to repeated grinding, magnetic and hydraulic separation, sizing, rejection of non-magnetic waste material as tailings, and removal of the water. The iron concentrate is then mixed with bentonite, dehydrated, and put into balling drums which produce pellets of approximately one-third of an inch in size. In the final stage, the pellets are subjected to extremely high temperatures, which hardens them and changes their chemical properties from magnetic oxide of iron to hematite.\n\nPresently not all of the tailings which are discharged into a delta in Lake Superior reach the trough at the bottom, and a substantial number, which remain buoyant, continue to circulate in the lake. This is the activity which the Federal court has enjoined if an on-land site is not completed by April 15, 1980.\n\nReserve proposes to spend over $300 million in building an on-land tailings disposal site at Mile Post 7 and in modifying its processing plant to abate the emission into the ambient air of amphibole material which may contain pathogenic fibers of amosite asbestos. The principal change in the processing of ore at Silver Bay will be the construction of facilities to produce what is called \"dry cobbing\" by which high intensity magnetic separators will isolate 22 percent of the ore into coarse tailings. These gravel-size tailings will be transported by conveyors to Reserve's railroad which will haul them 7 miles to a tailings basin to be located at Mile Post 7. Other coarse tailings, having the consistency of sand, will be treated in a similar manner. Fifty-nine percent of the tailings, consisting of fine silt, will remain and will be mixed with water and pumped approximately 5 miles in a 24-inch slurry pipeline to the tailings basin where the water will be recycled and returned to the plant by a separate pipeline. The dam which contains the tailings will be filled with water to a depth of approximately 10 feet to reduce the quantity of fugitive dust generated by the use of an on-land disposal site.\n\nFindings and Conclusions of Pollution Control Agency and Commissioner of Department of Natural Resources\n\nThe hearing officer appointed by PCA and DNR took testimony from 160 witnesses, received 1,000 exhibits, and generated an 18,000-page transcript in the 9 months during which Reserve's permit was being considered by him. His findings, conclusions, and recommendations were adopted by the agencies without further evidence and incorporated into resolutions and orders denying permits at Mile Post 7 and encouraging an application for permits at Mile Post 20.\n\nIn commenting on the dam to be erected at Mile Post 7, the hearing officer expressed the opinion that the possibility of errors and omissions in construction were increased by the passage of time, and that tailings dams are more difficult to build than conventional water storage dams and are more susceptible to faulty construction. He indicated a lack of confidence in the likelihood of \"close cooperation and mutual faith between the designer and the mining operator.\" The bedrock, he found, would present no problems in dam stability, and the clay samples in the area provided suitable foundation. However, Mile Post 7 would be a major, complex engineering project, resulting in one of the largest dams in the United States, and would be located 3 miles from Lake Superior and 600 vertical feet above it. He found a major failure of the dam would be catastrophic. In that event, eight residences below the dam would be affected and the tailings would be deposited in Lake Superior with no opportunity for recapture. As between Mile Post 7 and a damsite where the consequences of failure would not be so severe, the hearing officer concluded that prudence would dictate the choice of a safer site, \"even if the probability of dam failure is small.\"\n\nHe further found that two streams would be diverted at the Mile Post 7 site which would adversely affect their flow and turbidity. The amount of seepage through the dams would be relatively small, however. A rupture of the pipeline might adversely affect water in the area, although the system presented no unique or difficult problems and the flow would automatically be switched to a standby line in the event of such a rupture.\n\nThe hearing officer in dealing with air quality held that the findings of the Federal courts were binding on the proceedings before him, and he specifically adopted them. He found fugitive dust by construction activity, by transporting and moving coarse tailings, and by wind action could be reduced by sprinkling with water or chemical treatment but could not be eliminated. Because coarse tailings would be transferred a substantial distance from the plant to the basin, further fugitive dust emissions would be created. The hearing officer went on to find that there was no reliable evidence that air elutriation (a washing process to separate light from coarse particles) would significantly reduce such emissions. Although the estimates of emissions made by the state and Reserve were found to be \"optimistic\" and subject to error, the state's estimates were found adequate and were adopted as the best information available. PCA estimates of fiber content were significantly low but were found valid for comparing the projected impact on various population centers with respect to the alternative sites proposed. Testimony of Dr. Phillip M. Cook was held to be reliable and disclosed fiber contents estimated at 975,000 fibers per microgram of tailings dust, which might actually be as high as 2,900,000 fibers per microgram. The hearing officer concluded that Reserve was not justified in assuming a 50-percent reduction in total suspended particulates (TSP) at Silver Bay by air elutriation. He noted that the projected level of fibers in the air at Silver Bay was comparable to the levels found by the Federal court to be a potential health hazard.\n\nWith respect to other natural resources, the hearing officer found a low mineral potential at Mile Post 7; a modest amount of habitat for wildlife which would migrate to other areas; the destruction of 9.7 miles of trout streams; and the creation of turbidity in other streams, as well as a reduction in their flow. This would adversely affect anadromous fish in the lower Beaver River it was noted.\n\nIn discussing alternative sites, the hearing officer stated that Mile Post 20 would require a longer pipeline, more pumping stations, and longer haul roads, as well as dams which were longer but safer by reason of their location. The quality of water which would be destroyed was found to be lower elsewhere than at Mile Post 7. Alternative sites would require no diversion of streams or result in any degradation of other streams. However, the expected uncollected seepage would be lower at Mile Post 7 than at some alternative sites. The hearing officer stressed the fact that the increase at Silver Bay in total suspended particulates (TSP) and fibers from Mile Post 7 would be three times as great as the increase from Mile Post 20. With respect to the destruction of timber resources and damage to wildlife, it was felt there was little difference between Mile Post 7 and Mile Post 20.\n\nThe hearing officer found that energy consumption would be greater at the Mile Post 20 site than at Mile Post 7 because of the greater distance for transporting tailings. Although he noted that the area at Mile Post 20 had not been \"disturbed,\" neither had it been committed to any other land use, whereas Mile Post 7 was not suitable from a planning viewpoint because it was a major new industrial development and not an expansion of an existing industrial use in what was described as the \"North Shore corridor.\"\n\nThe hearing officer recognized that officials of Reserve were of the opinion its operations would shut down if a permit for Mile Post 7 was rejected, a decision based largely on economics. However, there was no evidence that the company had determined a cost level at which a shutdown would be triggered, nor in the hearing officer's opinion should that factor determine whether there was a feasible and prudent alternative to Mile Post 7. The hearing officer found that Reserve's financial analysis included future increases in its costs without considering increases in its prices and understated the economic benefits to Armco and Republic from the proposed operation at alternative sites. The cost of constructing a disposal site at Mile Post 20 was found to be $385,979,000 and the cost of construction at Mile Post 7 to be considerably less. While the production costs per ton of pellets at Mile Post 7 ranged from $19.17 to $21.37 and the costs at Mile Post 20 would range from $20.50 to $22.84, both sites were found to permit a profitable operation.\n\nFinally, proceeding on the assumption that Reserve's operations may be terminated if permits for Mile Post 7 are not granted, the hearing officer outlined the major detrimental effects which would result from a shutdown. Most of the population of Silver Bay and substantial elements of Babbitt, Ely, and other areas of Lake and St. Louis Counties would be directly affected. Reserve in 1974 employed 2,843 persons with a total payroll of $46,780,000. The company purchased materials and supplies in Minnesota amounting to $37 million. Its total tax liability to state and local units of government in 1974 was $7,775,000. Owners of the Peter Mitchell Mine received royalties in 1974 amounting to $16 million.\n\nThe hearing officer summed up the impact of a shutdown by observing that the social and psychological effects of unemployment could not be alleviated by unemployment compensation; that the possibilities of obtaining other employment in the area were remote; that the process of moving to other localities to seek employment would result in uprooting families and losing seniority, pension rights, and health and welfare benefits; that retraining would be required, all of which, combined with the decreased value of employees' homes, would constitute \"a bleak substitute for the relative security provided by the continuation of Reserve's operations.\"\n\nThe hearing officer concluded with the following recommendations:\n\n\"Based on the above Findings and Conclusions, the following Proposed Determination is recommended:\n\n\"1. Implementation of the proposal for tailings disposal at Mile Post 7 would cause pollution, impairment or destruction of the air, water, land and other natural resources located within the state and would substantially impair the interests of the public in lands and waters and the substantial beneficial public use thereof.\n\n\"2. There are feasible, prudent and economical alternatives to the proposed project which would be consistent with the reasonable requirements of the public health, safety and welfare and the state's paramount concern for the protection of its air, water, land and other natural resources from pollution, impairment or destruction.\n\n\"3. Reserve's application for permits for the construction and operation of facilities for on-land disposal of tailings at the Mile Post 7 location and to stabilize the tailings delta in Lake Superior should be denied.\n\n\"4. Reserve, Armco and Republic should be requested to submit applications for permits to construct and operate facilities for the on-land disposal of tailings at the Midway site.\n\n\"5. Reserve, Armco and Republic should be required to gather adequate data and submit a comprehensive plan for the stabilization of the tailings delta in Lake Superior.\n\n\"6. If application is made for permits for the Midway alternative, steps should be taken to develop the open and forthright relationship between Reserve and the state which will be necessary to implement on-land tailings disposal at Midway and accomplish such delta stabilization as will protect the public health and welfare.\n\n\"7. Existing environmental studies should be adopted for Midway to the greatest extent possible, with any additional studies strictly limited to specific areas not already addressed.\n\n\"8. The development of specific methods acceptable to both the state and Reserve should be explored which will insure termination of discharge to Lake Superior with the greatest possible speed without the necessity for ceasing operations during construction of on-land facilities.\"\n\nMemorandum Opinion of the Judges of the District Court of Lake County\n\nAppeals were taken to the District Court of Lake County from the decisions of the PCA and DNR by Reserve Mining Company. A three-judge panel was convened and received additional evidence in the PCA appeal between November 3, 1976, and December 3, 1976. On January 28, 1977, the court filed its opinion and entered an order reversing the July 1, 1976, decisions of the PCA and DNR and directing those agencies to issue permits for the use of Mile Post 7 as a disposal site by Reserve.\n\nAs to the PCA, the trial court applied Minn.St. 1974, ยง 115.05, subd. 7, and as to DNR, Minn.St. 105.47, in determining that its scope of review was whether or not the agencies' orders were \"lawful and reasonable\" and \"warranted\" or \"supported\" by the evidence. The court was of the opinion that applying this test was consistent with the Administrative Procedure Act set forth in Minn.St. 15.0425. Accordingly, the court held that it was required to engage in a \"thorough, probing, in-depth review * * * a searching judicial scrutiny of how and why the agency determinations were actually adopted.\"\n\nIn discussing the issues, the court prefaced its opinion by alluding to the hearing officer's \"concern with imaginary or speculative possibilities,\" suggesting that the agencies became \"preoccupied with remote contingencies.\" The court declined to pass on the constitutionality of statutory authority for taking additional evidence in the PCA appeal since it asserted the issue was not timely raised.\n\nWith respect to the possibility of dam failure at Mile Post 7, the court held that the agencies' findings and conclusions were based \"not only on unsubstantial evidence but on almost no evidence at all.\" All of the consulting firms retained by the agencies had concluded that the proposed dams would be safe, but the hearing officer required a showing of \"absolute\" safety, a standard which the trial court rejected. As to the use of Mile Post 20 as a prudent and feasible alternative, the trial court questioned its availability because much of it was held by the United States Forest Service. Since the PCA had the power and authority to monitor and oversee the construction and maintenance of the dam at Mile Post 7, the court was of the opinion that the health, safety, and welfare of the people would be secure.\n\nThe court discussed at some length the evidence concerning the effect of Mile Post 7 on the ambient air in the vicinity of Silver Bay. It was impressed by the fact that the evidence indicated it was not possible to arrive at an unequivocal prediction concerning total suspended particulate levels or the levels of asbestiform fibers; that no state or Federal air standard has been promulgated for amphibole fibers; and that the level of asbestiform fibers was essentially comparable in Silver Bay, Hibbing, Virginia, and other Iron Range communities. The court construed the hearing officer's findings as requiring the elimination of all fugitive dust by water sprinkling, chemicals, and vegetation, which the court held to be unreasonable. A PCA witness testified that contemplated plant emission control devices would reduce total suspended particulates (TSP) from 65 tons to less than 2 tons per day at the processing plant, the court noted, and the PCA staff was of the opinion that Mile Post 7 was reasonable as a tailings site if conditions imposed for water quality and air quality and fiber reduction were met and coarse tailings were submerged. The court went on to stress the inaccuracy of fiber-count techniques which allowed errors of at least nine times on the high side to one-ninth on the low side according to a Mayo Clinic witness in Federal court. In assessing the evidence bearing on the mass and size of fibers in the ambient air, the court was of the opinion that the hearing officer's findings were based on assumptions which did not constitute \"substantial evidence.\"\n\nThe trial court then dealt with the key issue of the impact on air quality in Silver Bay generated by construction and operation of a site at Mile Post 20 compared to the impact from Mile Post 7. It was undisputed that because of its proximity to Silver Bay the selection of Mile Post 7 would result in approximately three times the amount of fugitive dust in the populated area of Silver Bay that would result from the selection of Mile Post 20. However, the court relied strongly on the testimony of a state witness that a projected reduction in plant emissions of 97 percent, implemented by the air quality stipulation agreement together with the underwater storage of coarse tailings, would achieve a fiber level 75 percent less than existing levels.\n\nA decisive factor in arriving at the conclusion that there was no substantial evidence to justify the rejection of Mile Post 7 on the basis of air quality was the testimony of Dr. Chatten Cowherd, Jr., a witness for the state. At the agency hearing, Dr. Cowherd testified that his projection, on which the hearing officer relied, estimated that total suspended particulate levels for Silver Bay would increase by 1.75 micrograms per cubic meter as a result of the proposed use of Mile Post 7. An increase of 1.0 microgram from the use of Mile Post 20 was found to be acceptable by both the hearing officer and the PCA. When he testified before the trial court, Dr. Cowherd acknowledged his prior estimates had been erroneous. He revised his opinion to project 0.63 microgram of total suspended particulates per cubic meter at Silver Bay from the use of Mile Post 7. In short, the revised estimate of air pollution brought the level below a figure which had previously been found acceptable by the state. The court concluded by comparing the ultimate estimated levels of total suspended particulates in terms of micrograms per cubic meter at St. Paul as 65, Duluth, 52, and Silver Bay, 22. Because of the anticipated reduction in plant emissions and the steps to be taken in mitigating the generation of fugitive dust at the tailings site, factors which at one time prompted the PCA to approve issuance of a permit for Mile Post 7, the court was of the opinion there was no substantial evidence to reject Mile Post 7 on the basis of air quality.\n\nThe trial court, in discussing the impact on natural resources at the two sites, found only insignificant differences in the effect on streams, fish, animals, timber, and water. However, great emphasis was placed on the fact that testimony adduced by the state indicated the selection of Mile Post 20 was \"completely contrary to the principle of consolidation of land use activities * * * opening up a third area to mining activities.\" The court stressed the fact that Mile Post 7 was ancillary to an existing industrial facility and that it was \"not a new industry seeking to intrude into a natural resources recreational area but an on-going concern of many years.\" The court referred to the testimony of the executive director of the PCA who conceded that wherever the tailings site was located it would have a major impact on the environment, but that the differences would be small and that the environmental hazards at Mile Post 7 could be minimized by the best available technology to make it a feasible site.\n\nWith respect to economic factors, it was the opinion of the court that the hearing officer inadequately assessed the probability that Reserve would be shut down if denied permits for Mile Post 7. The dollar amounts for the year 1975 had increased to a total payroll of $55 million, purchases of material and supplies in Minnesota to $45 million, and state and local taxes payable by Reserve to nearly $16 million. Minn.St. 116.01, 116D.02, 116D.03, and 116.07, subd. 6, were cited as mandating greater consideration for \"business, commerce, trade, industry, traffic, and other economic factors\" than was accorded by the hearing officer. The court concluded by echoing the concern of the hearing officer that a shutdown would have a disastrous effect on the economic well-being of families dependent on Reserve for a livelihood.\n\nIn considering a \"feasible and prudent alternative\" pursuant to Minn.St. 116D.04, subd. 6, the trial court discussed in some detail the problems of acquisition of a site at Mile Post 20. That area is entirely within the Superior National Forest. The consultant who drafted the Environmental Impact Statement testified that nine major steps were necessary to acquire Federal forest land under Federal law. The court noted there was no assurance Mile Post 20 would become available, and that if it were ultimately acquired, a period of 6 years might elapse during which either the plant would be shut down or it would continue to discharge tailings into Lake Superior. Accordingly, the hearing officer's finding that Mile Post 20 is a feasible and prudent alternative was held not to be supported by substantial evidence.\n\nThe court found that the permit conditions imposed on Reserve for the construction and operation of a disposal site at Mile Post 7 had been unequivocally accepted by Reserve and by Armco and Republic, as set forth in our order of April 8, 1977, (supra) . The court held that those permit conditions were adequate \"to protect the health, welfare, and safety and all legitimate concerns of the public as a matter of law.\"\n\nOne of the issues presented to this court by Save Lake Superior Association and Sierra Club was the trial court's refusal to grant their motion to reopen. Those parties claimed to have obtained newly discovered evidence that wet-wall electrostatic precipitators which had been installed in Reserve's plant to eliminate emission of asbestos fibers were deteriorating and would not effect a 97-percent reduction in the fibers emitted by the plant, contrary to what the system was represented as being capable of achieving. Since this had to do with implementing the air quality stipulation agreement, the court held that it was a matter for future consideration between the parties.\n\nFinally, the trial court discussed at some length the influence of the Federal district court's so-called \"educational\" session on the hearing officer; the PCA director, staff, and board members; and the DNR staff. It criticized those procedures and the manner in which various other meetings were held by the PCA as not complying with the statutory requirement for open meetings.\n\nIt was the court's decision that the denial of permits for Mile Post 7 was unlawful, unreasonable, and not supported by substantial evidence; that permits be issued, subject to mutually agreeable conditions; that the plans submitted by Reserve together with the permit conditions were reasonable, practical, and adequately protected public safety and promoted public welfare; that no other feasible and economical method for mining taconite is reasonably available; and that the plan was otherwise in the public interest.\n\nScope of Review\n\nTwo issues are presented in determining the scope of judicial review of administrative agency decisions. First, when the district court is itself acting as an appellate tribunal with respect to an administrative agency, is it entitled to the same deference it receives when it is acting as a trial court, or does this court confine its scrutiny to the decision of the administrative agency, giving only such weight to the opinion of the district court as it would accord persuasive precedent or authority found in decisions of any other appellate jurisdiction? Second, to what extent can statutes dealing with appeals from decisions of the commissioner of the Department of Natural Resources and the statutes dealing with appeals from decisions of the Pollution Control Agency be reconciled with the appeal provisions of the Administrative Procedure Act?\n\nThe problem is complicated by the fact that before August 1976 the statute governing PCA appeals permitted the trial court to take additional evidence, whereas the DNR statute contained no such provision. In recognition of these differences, the trial court wrote separate opinions as to each agency although they were in most respects substantially identical.\n\nWe are of the opinion that in reviewing the decisions of administrative agencies this court performs essentially the same function as the district court and is governed by the same scope of review. Accordingly, the usual rule requiring deference to trial court decisions does not apply.\n\nThe statute which governs appeals from DNR decisions, Minn.St. 105.47, par. 4, states as follows:\n\n\"Upon such appeal being perfected, it may be brought on for trial as other civil actions, and shall then be tried by the court without a jury, and determined upon the record. At such trial the findings of fact made by the commissioner shall be prima facie evidence of the matters therein stated, and his orders shall be deemed prima facie reasonable. If the court shall determine that the order appealed from is lawful and reasonable, it shall be affirmed. If the court finds that the order appealed from is unjust, unreasonable, or not supported by the evidence, it shall make such order to take the place of the order appealed from as is justified by the record before it.\"\n\nThe statute which specifically applied to appeals from PCA decisions was Minn.St. 1974, ยง 115.05, subd. 7, which read as follows:\n\n\"The appeal shall be heard and determined by the court upon the issues raised by the notice of appeal and return according to the rules relating to the trial of civil actions, so far as applicable. The court of its own motion or on application of any party may, in its discretion, take additional evidence on any issue of fact or may try any or all such issues de novo, but no jury trial shall be had. If the court shall determine that the action of the agency appealed from is lawful and reasonable, and is warranted by the evidence in case an issue of fact is involved, the action shall be affirmed. Otherwise the court may vacate or suspend the action appealed from in whole or in part, as the case may require, and thereupon the matter shall be remanded to the agency for further action in conformity with the decision of the court.\"\n\nEffective at a date subsequent to the decision of the PCA, Minn.St. 1974, ยง 115.05, subd. 7, was repealed by L. 1976, c. 76, and such appeals thereafter are governed by the provisions of the Administrative Procedure Act, Minn.St. 15.0425, which reads as follows:\n\n\"In any proceedings for judicial review by any court of decisions of any agency as defined in section 15.0411, subdivision 2 (including those agencies excluded from the definition of agency in section 15.0411, subdivision 2) the court may affirm the decision of the agency or remand the agency or remand the case for further proceedings; or it may reverse or modify the decision if the substantial rights of the petitioners may have been prejudiced because the administrative finding, inferences, conclusion, or decisions are:\n\n\"(a) In violation of constitutional provisions; or\n\n\"(b) In excess of the statutory authority or jurisdiction of the agency; or\n\n\"(c) Made upon unlawful procedure; or\n\n\"(d) Affected by other error of law; or\n\n\"(e) Unsupported by substantial evidence in view of the entire record as submitted; or\n\n\"(f) Arbitrary or capricious.\"\n\nIn Brotherhood of Ry. \u0026 Steamship Clerks, Etc. v. State,303 Minn. 178, 229 N.W.2d 3 (1975), we reviewed a decision of the district court which affirmed the conclusions of a hearing examiner appointed by the commissioner of human rights. In affirming the district court, we referred to Minn.St. 15.0425 as relevant to the scope of review by the district court, but stated that our standard of review was whether the findings, conclusions, and order of the district court were \"clearly erroneous,\" citing In re Estate of Balafas, 293 Minn. 94, 198 N.W.2d 260 (1972). Since we were not reviewing a trial de novo as was done in the Balafas case, our reference to the \"clearly erroneous\" test was inadvertent and inappropriate. In reaching this conclusion, we find support in other jurisdictions where appellate courts have rejected the \"clearly erroneous\" standard in examining the propriety of agency decisions which have been appealed to the district court and there decided only on the record. Knox v. Finch, 427 F.2d 919(5 Cir. 1970); First Nat. Bank of Fayetteville v. Smith, 508 F.2d 1371 (8 Cir. 1974), certiorari denied, 421 U.S. 930,95 S. Ct. 1655, 44 L. Ed. 2d 86 (1975); O'Brien v. Workmen's Comp. Bureau, 222 N.W.2d 379 (N.D. 1974).\n\nWe have not heretofore squarely addressed the role of the trial court when we are considering its review of agency decisions. Where the district court is by statute required to grant a trial de novo in appeals from lower judicial or quasi-judicial tribunals, we have applied the \"clearly erroneous\" standard, since the trial court is then acting as a court of first impression. In a number of cases, (infra), we have sub silentio pursued a policy of examining agency decisions directly, without according any particular deference to the trial court's determination. What may seem a needless duplication of effort has been criticized and discussed by other courts but generally adhered to. In the Knox case, (supra) , the Court of Appeals of the Fifth Circuit said:\n\n\"When, as here, the appeal is from a judgment granting summary judgment to the Secretary, or affirming the decision of the Secretary, the functions of this Court are virtually the same as those already performed by the district court, but, nonetheless are to be performed independently and carefully and without any presumption that the decision of the district court is correct.\" Knox v. Finch, 427 F.2d 919, 920 (5 Cir. 1970).\n\nAn appeal in which the district court had reviewed an employee discharge by the Secretary of the Treasury was considered in Polcover v. Secretary of Treasury, 155 U.S. App.D.C. 338, 477 F.2d 1223 (1973). There the court held that in appeals from agency decisions where there was no trial de novo it was limited to the precise scope of review utilized by the trial court without paying specific deference to that court's decision. 155 U.S. App. D.C. 338, 477 F.2d at 1226. It observed in a footnote that \"all court of appeals decisions manifest a fresh look at the record and an independent judgment based thereon. Only on rare occasions is the opinion of the district court mentioned and even rarer is there a reference to whether the scope of review it utilized was correct.\" 477 F.2d at 1226, note 5. The Federal court went on to note that its review was identical with that of the district court, and that duplication, delay, expense, and \"despair for the employee litigant\" were inherent in such a system and that the interposition of the district court seemed to serve no viable purpose. However, the court declined to accord deference to the district court's review of the agency determination. To do so, the court said, would not be appropriate because \" 'rule' limiting our appellate review to a determination of whether the district court utilized the proper scope of review, or was clearly erroneous (by-passing questions of the difficulty of application) will most likely in application amount either to a rubber stamp - in which instance we will merely be shifting the needless delay from the district court to the court of appeals - or degenerate into the test we presently utilize.\" 477 F.2d at 1227.\n\nA number of state courts have expressly or by implication reached the same result. Wright v. State Insurance Commr., 252 Ore. 283, 449 P.2d 419 (1969); Farm Supply Distributors, Inc. v. Washington Utilities \u0026 Transp.Comm., 83 Wash.2d 446, 518 P.2d 1237 (1974); Guildner Way, Inc. v. Board of Adjustment, 35 Colo.App. 70, 529 P.2d 332(1974); Grace v. Oil Conservation Comm., 87 N.Mex. 205, 531 P.2d 939 (1975); Tripp v. Swoap, 17 Cal.3d 671, 131 Cal.Rptr. 789, 552 P.2d 749 (1976); Piper v. Neighborhood Youth Corps, S.D., 90 S.D. 443, 241 N.W.2d 868 (1976).\n\nWe are in accord with the views expressed by the cases cited and expressly adopt a rule which we have heretofore tacitly accepted, that it is our function to make an independent examination of an administrative agency's record and decision and arrive at our own conclusions as to the propriety of that determination without according any special deference to the same review conducted by the trial court.\n\nBefore discussing the precise standards which apply to review of administrative agency decisions as they have emerged from our prior decisions, it is appropriate to reiterate general principles which govern our courts in dealing with all such cases. The legislature may not constitutionally delegate to the judiciary duties which are essentially administrative in character. We have consistently viewed with disfavor statutes which specify trials de novo and which attempt to confer original jurisdiction on trial courts over policy matters which are the responsibility of the legislative and executive branches. The repeal of Minn.St. 1974, ยง 115.05, subd. 7, may have stemmed from recognition of that principle. We have repeatedly called attention to the danger of eroding the barriers which guarantee the separation of powers. Steenerson v. G.N.Ry.Co., 69 Minn. 353, 72 N.W 713 (1897); State v. G.N.Ry.Co., 130 Minn. 57,153 N.W. 247 (1915); State v. Duluth Mi. \u0026 I.R.Ry.Co.,246 Minn. 383, 75 N.W.2d 398 (1956). In the Steenerson case, we said on reviewing a rate decision of the Railroad and Warehouse Commission:\n\n\"If by this the legislature intended to provide that the court should put itself in the place of the commission, try the matter de novo, and determine what are reasonable rates, without regard to the findings of the commission, such intent cannot be carried out, as a statute which so provided would be unconstitutional. The fixing of rates is a legislative or administrative act, not a judicial one.\" Steenerson v. G.N.Ry.Co., 69 Minn. 353, 375, 72 N.W. 713, 716.\n\nAs applied to the instant case, the PCA appeal statute, now repealed, may have come perilously close to unconstitutionality by permitting the court to \"take additional evidence on any issue of fact or try any or all such issues de novo.\"\n\nWe also adhere to the fundamental concept that decisions of administrative agencies enjoy a presumption of correctness, and deference should be shown by courts to the agencies' expertise and their special knowledge in the field of their technical training, education, and experience. In Greater Boston Television Corp. v. F.C.C., 143 U.S.App.D.C. 383, 444 F.2d 841 (1970), certiorari denied, 403 U.S. 923, 91 S. Ct. 2229, 2233,29 L. Ed. 2d 701 (1971), the court was reviewing the license procedures of the Federal Communications Commission. It stated:\n\n\"Full allowance must be given not only for the opportunity of the agency, or at least its examiners, to observe the demeanor of the witnesses, but also for the reality that agency matters typically involve a kind of expertise - sometimes technical in a scientific sense, sometimes more a matter of specialization in kinds of regulatory programs. Expert discretion is secured, not crippled, by the requirements for substantial evidence, findings and reasoned analysis.\"444 F.2d at 850.\n\nThe court went on to observe that where there is a combination of danger signals which suggest the agency has not taken a \"hard look\" at the salient problems and \"has not genuinely engaged in reasoned decision-making\" it is the duty of the court to intervene. 444 F.2d at 851. On the other hand, if the agency has properly performed those functions, the court should exercise restraint and affirm, even if it might have reached a different conclusion had it been the factfinder or policymaker. The court concluded by stressing \"the need for conjunction of articulated standards and reflective findings, in furtherance of even-handed application of law, rather than impermissible whim, improper influence, or misplaced zeal.\" 444 F.2d at 852. We endorse the Federal court's views as to the circumstances under which a court may properly closely scrutinize an administrative decision, as well as its views on the need for exercising judicial restraint and for restricting judicial functions to a narrow area of responsibility, lest it substitute its judgment for that of the agency. See, Gibson v. Civil Service Board, 285 Minn. 123, 171 N.W.2d 712 (1969).\n\nTurning to the contentions of the parties here before us governing the judicial scope of review of the PCA and DNR decisions, the trial court, as we have noted, applied the \"substantial evidence\" test which it held was correct under either Minn.St. 15.0425 or Minn.St. 1974, ยง 115.05, subd. 7, and Minn.St. 105.47. The precise holding of the court was as follows:\n\n\"[The hearing officer's] findings involving policy determinations, risk analysis and predictions based on the frontiers of scientific knowledge must be subjected to the 'thorough, probing and in-depth review' provided for by the 'lawful and reasonable' statutory standard. While the Court must respect the decisions of the administrative agencies, nevertheless, a searching judicial scrutiny of how and why the agency determinations were actually adopted is required by the statute.\n\n\"We view that by the 'substantial evidence' test is meant: 1) such relevant evidence as a reasonable mind might accept as adequate to support a conclusion; 2) more than a scintilla of evidence; 3) more than 'some evidence'; 4) more than 'any evidence'; and 5) evidence considered in its entirety. There are correlative rules or principles that must be recognized by a reviewing court, such as: 1) unless manifestly unjust, inferences must be accepted even though it may appear that contrary inferences would be better supported; 2) a substantial judicial deference to the fact-finding processes of the administrative agency; and 3) the burden is upon the appellant to establish that the findings of the agency are not supported by the evidence in the record, considered in its entirety.\"\n\nAs an abstract definition of \"substantial evidence\" and as a recital of the general rules which apply in reviewing agency decisions, the trial court's statement of the law, in our opinion is correct. The PCA \"has no quarrel\" with this definition so far as it goes. The DNR agrees that the \"substantial evidence\" test and the other criteria set forth in Minn.St. 15.0425 are the correct standards for judicial review. Save Lake Superior Association and Sierra Club concur in that position. It is the contention of both PCA and DNR that in applying the appeal statutes to the facts of this case the trial court was limited to determining whether the agencies' conclusions were \"arbitrary and capricious.\" In addition, they take exception to the position of the trial court's opinion that \"predictions based on the frontiers of scientific knowledge\" are entitled to a more searching judicial scrutiny than other evidence on which the agencies' decisions were based. They argue that, with respect to predictive factfinding in the area of public health, deference to administrative agencies should be even greater.\n\nReserve equates the \"substantial evidence\" and \"reasonableness\" tests with one of \"lawfulness.\" It argues that Minn.St. 15.0425(e), which refers to \"substantial evidence\"; Minn.St. 105.47, alluding to orders \"not supported by the evidence\"; and Minn. St. 1974, ยง 115.05, subd. 7, governing agency action which is \"warranted by the evidence,\" were all properly applied by the trial court and conform to the \"substantial evidence\" rule which our decisions have approved.\n\nIn recent years this court has reviewed an increasing number of administrative agency decisions, including those of the Civil Service Board, the Public Service Commission, the Commissioner of Public Welfare, the Commissioner of Human Rights, the Environmental Quality Council, the DNR, the PCA, and the Water Resources Board. Gibson v. Civil Service Board, 285 Minn. 123, 171 N.W.2d 712(1969); Minneapolis Van \u0026 Whse. v. St.P. Terminal Whse.Co., 288 Minn. 294, 180 N.W.2d 175 (1970); Quinn Distributing Co.Inc. v. Quast Transfer, Inc., 288 Minn. 442,181 N.W.2d 696 (1970); Polk County Welfare Bd. v. Dept. of Public Welfare, 301 Minn. 513, 223 N.W.2d 137(1974); Mn.Pub.Int.Res. Group v. Mn.Env.Q.C., Minn., 306 Minn. 370, 237 N.W.2d 375 (1975); In re Application of Northwestern Bell Tel.Co., Minn., 310 Minn. 146, 246 N.W.2d 28 (1976); State v. City of White Bear Lake, Minn.,311 Minn. 146, 247 N.W.2d 901 (1976); St. Paul Area C. of C. v. Minnesota Pub.Serv.Comm., Minn., 312 Minn. 250,251 N.W.2d 350 (1977); Dakota County Abstract Co. v. Richardson (Human Rights Commr.), Minn., 312 Minn. 353, 252 N.W.2d 124 (1977); Markwardt v. Minn. Water Resources Bd., Minn., 254 N.W.2d 371(1977). In all of these cases we have expressly referred to the standard of review set forth in the Administrative Procedure Act, Minn.St. 15.0425, except in the Gibson and the City of White Bear Lake cases where the standards of the Administrative Procedure Act were in fact applied. The Minneapolis Van decision laid to rest confusion caused by Dahlen Transport Inc. v. Hahne, 261 Minn. 218, 112 N.W.2d 630 (1961), which seemed to apply a test of \"any evidence\" or a \"scintilla of evidence\" in reviewing agency factfinding. We said in Minneapolis Van that the provisions of Minn.St. 15.0425 of the Administrative Procedure Act, adopted by the legislature following the Dahlen case, evidenced an intent \"to make uniform the scope of judicial review of the decisions of all administrative factfinding agencies,\" including those expressly excluded from the definition of \"agency\" by Minn.St. 15.0411, subd. 2. However, even that definition does not exclude either the DNR or PCA. Our subsequent decisions have uniformly applied the \"substantial evidence\" rule with respect to findings of fact by administrative agencies. In the St. Paul Area Chamber of Commerce decision, (supra) , which was a rate case decided by the Public Service Commission, we reiterated with approval what we said in Minneapolis Van, distinguishing between judicial functions in reviewing factual maters and the more limited latitude allowed in reviewing legislative decisions of administrative agencies where social policy is involved. In both cases we held that Minn.St. 216.25 required the district court to determine whether the commission's order was \"lawful and reasonable\" and in both cases we found that statute and the Administrative Procedure Act to be compatible.\n\nMinn.St. 15.0425 permits the court to reverse or modify the decision of an agency if the substantial rights of the petitioners may have been prejudiced because the administrative finding, inferences, conclusion or decisions were affected by errors of law, unsupported by substantial evidence in view of the entire record as submitted, or arbitrary or capricious. Under Minn.St. 1974, ยง 115.05, subd. 7, which then governed the PCA, the court shall affirm if the action of the agency is \"lawful and reasonable, and is warranted by the evidence in case an issue of fact is involved.\" With respect to the DNR, Minn.St. 105.47 provides:\n\n\" * * * If the court shall determine that the order appealed from is lawful and reasonable, it shall be affirmed. If the court finds that the order appealed from is unjust, unreasonable, or not supported by the evidence, it shall make such order to take the place of the order appealed from as is justified by the record before it.\"\n\nReading these statutes together as we have heretofore construed them, we hold that the scope of review by the district court and by this court in the case before us is whether or not the decisions of the PCA and DNR are lawful and reasonable, a test which we equate with whether or not they are affected by errors of law; and whether or not their findings are unsupported by substantial evidence; and whether or not their conclusions are arbitrary or capricious.\n\nLegislative Policy\n\nIn recent years the legislature of Minnesota has created a number of agencies to establish comprehensive conservation policies within the state governing the activities of business, industry, individual citizens, and units of government. The attention devoted to improving the environment and preserving natural resources reflects a strongly held commitment by the state to protecting the air, water, wildlife, and forests from further impairment and encroachment. The Environmental Rights Law, Minn.St.c. 116B, sets forth its broad purposes as follows:\n\n\"The legislature finds and declares that each person is entitled by right to the protection, preservation, and enhancement of air, water, land, and other natural resources located within the state and that each person has the responsibility to contribute to the protection, preservation, and enhancement thereof. The legislature further declares its policy to create and maintain within the state conditions under which man and nature can exist in productive harmony in order that present and future generations may enjoy clean air and water, productive land, and other natural resources with which this state has been endowed. Accordingly, it is in the public interest to provide an adequate civil remedy to protect air, water, land and other natural resources located within the state from pollution, impairment, or destruction.\" Minn.St. 116B.01.\n\n\"Natural resources\" are defined in Minn.St. 116B.02, subd. 4, as follows:\n\n\"Natural resources shall include, but not be limited to, all mineral, animal, botanical, air, water, land, timber, soil, quietude, recreational and historical resources. Scenic and esthetic resources shall also be considered natural resources when owned by any governmental unit or agency.\"\n\nSubd. 5 of that section defines \"pollution, impairment or destruction\" as follows:\n\n\"'Pollution, impairment or destruction' is any conduct by any person which violates, or is likely to violate, any environmental quality standard, limitation, regulation, rule, order, license, stipulation agreement, or permit of the state or any instrumentality, agency, or political subdivision thereof which was issued prior to the date the alleged violation occurred or is likely to occur or any conduct which materially adversely affects or is likely to materially adversely affect the environment; provided that 'pollution, impairment or destruction' shall not include conduct which violates, or is likely to violate, any such standard, limitation, regulation, rules, order, license, stipulation agreement or permit solely because of the introduction of an odor into the air.\"\n\nThe responsibility of the state in its sovereign capacity is set forth in Minn.St.c. 116D and imposes among other duties the obligation to -\n\n\" for reclamation of mined lands and assure that any mining is accomplished in a manner compatible with environmental protection.\" Minn.St. 116D.02, subd. 2(o).\n\nThroughout the statutes are policy statements recognizing that often there are conflicts between preserving the environment and promoting the economy. Minn.St. 116D.03, subd. 2(c), states that all departments and agencies shall -\n\n\" and develop methods and procedures that will ensure that environmental amenities and values, whether quantified or not, will be given at least equal consideration in decision making along with economic and technical considerations.\"\n\nIn that vein, Minn.St. 116D.04, subd. 6, prohibits the issuance of a permit for natural resources management and development if it is likely to have an adverse impact on the environment \"so long as there is a feasible and prudent alternative.\" The section concludes by stating, \"Economic considerations alone shall not justify such conduct.\" This policy is echoed elsewhere in the statutes, Minn.St. 116B.04 and 116B.09, subd. 2.\n\nFinally, under Minn.St.c. 116, governing the Pollution Control Agency, the legislature in the following language imposes a duty on the agency to weigh the importance of the economy against the impairment of the environment:\n\n\"In exercising all its powers the pollution control agency shall give due consideration to the establishment, maintenance, operation and expansion of business, commerce, trade, industry, traffic, and other economic factors and other material matters affecting the feasibility and practicability of any proposed action, including, but not limited to, the burden on a municipality of any tax which may result therefrom, and shall take or provide for such action as may be reasonable, feasible, and practical under the circumstances.\" Minn.St. 116.07, subd. 6.\n\nClearly, it is the legislative policy of this state that permits of the kind here sought shall not be issued for industrial development if there is substantial evidence that the proposed activity \"is likely to materially adversely affect the environment.\" Minn.St. 116B.01 and 116B.02, subd. 5. In the case before us it is conceded by all parties that an industrial operation of the kind proposed by Reserve will \"adversely\" affect the environment wherever it is located, whether it be at Mile Post 7 or at Mile Post 20. The difficult threshold question which faced the hearing officer and the environmental agencies, and now faces us, is whether the contemplated operation of an on-land tailings site would not only \"adversely\" but also \"materially\" affect the air, water, land, and natural resources adjacent to Mile Post 7, and if so whether Mile Post 20 is a \"feasible and prudent\" alternative site. PCA and DNR have in effect held that although the state of the science is inexact, and the likelihood of danger to public health cannot be proved, if the impact of the project is ultimately found to have a materially adverse effect on the environment, it is more prudent to minimize that impact by diffusing it into a sparsely settled area than into one which is more densely populated. It therefore becomes our responsibility to examine the evidence on which these conclusions are based and determine whether they are well founded.\n\nThe Tailings Basin Dams\n\nThe tailings basin design for Mile Post 7 contemplates between 22,000 and 23,000 lineal feet of dams to enclose an area of some 5 square miles. One will be among the 30 largest dams in the world. To minimize the fugitive dust which will emanate from the basin, it will be covered with 10 feet of water. After 30 years of operation it is anticipated that the basin will be filled with tailings and only a small area of open water will remain. The rest of the basin dams and dikes will, by that time, be covered with vegetation which will be a part of an on-going technique for reducing air pollution by preventing wind and water erosion in the basin and on the dams and dikes. The basin will, in part, be contained by bedrock ridges of the Lake Superior highlands. At the main area of the largest dam the base will be 1,500 feet thick and 190 feet high at its peak. The dam slope will be at an angle of 6 horizontal feet to each vertical foot. The design calls for a safety margin of 1.5, which is to say there are 50 percent more resisting forces than activating forces. The basin itself will contain eight \"splitter\" dikes, each of which is intended to be self-contained and will minimize the likelihood that more than a fraction of the basin's contents will be released in the event of a breach.\n\nThe hearing officer found that coarse tailings which will be used in dam construction are suitable for that purpose; that at the site of the largest dam, 30 to 40 feet of clay will provide suitable foundation if the water is expelled and the clay consolidated; and that the bedrock underlying the basin will present no structural problems affecting dam stability. He expressed four principal concerns in addition to location: Foundation, design, construction material, and construction procedures. Nowhere, however, does the hearing officer specify any engineering problem which will increase the likelihood of dam failure beyond that which would face any such structure which is well located and well built. He does conclude that in the event of a catastrophe the damage to adjoining residences and to Lake Superior would be far greater at Mile Post 7 than at Mile Post 20, and consequently he concludes that prudence would dictate the choice of a safer site.\n\nDNR and PCA concede that if the dams are built according to design and if all unexpected contingencies are properly met the dams cannot fail. Both agencies share the hearing officer's misgivings with respect to Reserve's intention to perform according to design. Based on what they regard as Reserve's less than forthright behavior in the past, the agencies assert that the hearing officer was correct in preferring an alternative site such as Mile Post 20. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nUnder Minn.St. 116D.04, subd. 6, no permit will be granted where it is likely to cause impairment of natural resources \"so long as there is a feasible and prudent alternative.\" We are of the opinion that this statute has no application where the safety of the proposed structure is undisputed. In other words, if the design, construction, and maintenance of the dams make it unlikely that they will impair natural resources, there is no need to consider feasible and prudent alternatives. Nevertheless, we note in passing that there are substantial factors which militate against a dam's functioning more effectively at Mile Post 20 than one located at Mile Post 7. Mile Post 20 would require a structure some 53,000 feet in length compared to 23,000 feet at Mile Post 7. The terrain at Mile Post 20 is flatter than Mile Post 7, has fewer natural barriers, and the underlying soil is less impervious. The predicted uncollected seepage during its operation would be 750 gallons per minute compared to 180 gallons at Mile Post 7. Post-operation uncollected seepage is predicted at 10,000 gallons per minute at Mile Post 20 compared to 500 gallons at Mile Post 7. In the event of a major catastrophe at Mile Post 20, tailings and silt would be discharged into tributaries of both the Cloquet River and Lake Superior.\n\nNone of the experts for any of the parties testified that the dam as designed would be unsafe. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e We held in North Suburban Sewer Dist. v. Water Pollution Comm., 281 Minn. 524, 162 N.W.2d 249 (1968), that where the events which might lead to water pollution are contingencies remote and unlikely to occur, \"factors which counterbalance them prevail.\" The Federal court in Life of the Land v. Brinegar, 485 F.2d 460, 472 (9 Cir. 1973), ruling on a water pollution issue, held that there was no need to consider an alternative solution \"whose effect cannot be reasonably ascertained, and whose implementation is deemed remote and speculative,\" citing Natural Resources Defense Council, Inc. v. Morton, 148 U.S. App.D.C. 5, 458 F.2d 827, 834 (1972). Other courts have reached a similar result. Portland Cement Assn. v. Ruckelshaus, 158 U.S. App.D.C. 308, 486 F.2d 375 (1973); Carolina Environ. Study Group v. United States, 166 U.S.App.D.C. 416, 510 F.2d 796 (1975); No. Anna Env. Coalition v. U.S. Nuclear Reg.Comm., 174 U.S.App.D.C. 428, 533 F.2d 655 (1976). In the Carolina case it was undisputed that, although the probability of a nuclear accident was remote, its consequences would be catastrophic. The court there held:\n\n\"There is a point at which the probability of an occurrence may be so low as to render it almost totally unworthy of consideration. Neither we, nor the A.E.C. on this record, would treat lightly the horrible consequences of a Class 9 accident. Recognition of the minimal probability of such an event is not equatable with non-recognition of its consequences.\" Carolina Environ. Study Group v. United States, 166 U.S. App. D.C. 416, 510 F.2d 796 at 799 .\n\nThe court was also treating with a license for constructing a nuclear power plant in North Anna, supra. Objections were based in part on the possibility that filling a reservoir might trigger an earthquake. The agency appeal board found that the creation of the lake did not threaten to reactivate a fault under it, and that the site was a stable one. In affirming, the Federal court noted that the Federal statute and regulations do not require a totally risk-free siting but only \"adequate protection to the health and safety of the public.\" No. Anna Env. Coalition v. U.S. Nuclear Reg.Comm., 174 U.S. App. D.C. 428, 533 F.2d 655 at 665 . The court held that, although there was not an absolute guarantee that the fault would not be reactivated, \" risk-free siting is similar to other absolute positions and arguments that have been rejected by the courts.\"\n\nRelating the Federal rule to Minnesota law, it is significant that none of the provisions in our environmental statutes establishes a standard that guarantees \"absolute\" safety. Minn.St. 116.01 refers to a \"reasonable\" degree of purity of water, air, and land resources. Minn.St. 116.06, subd. 3, in defining air pollution, refers to contamination which would interfere \"unreasonably\" with the enjoyment of life or property. Minn.St. 116B.02, subd. 5, in defining pollution, refers to any conduct which \"materially\" and adversely affects or is likely to affect the environment. Minn.St. 116D.04, subd. 6, forbids state action which \"significantly\" affects the quality of the environment. As we construe the hearing officer's conclusions, adopted by the administrative agency, he required that the design and construction of the dam \"eliminate\" the risk of dam failure. There was no substantial evidence to support a finding that the location of the dam at Mile Post 7 presented a significant threat to public health or safety, and no such finding was made.\n\nIt is apparent from the findings and recommendations of the hearing officer that he lacked confidence in the candor, cooperation, and good faith of Reserve officials, and as we have noted, he questioned the likelihood of their building and maintaining the dam as designed. We have alluded to the Federal court's finding that Reserve was derelict in some of its dealings with that court. However, we are not prepared to assume that the company will risk the lives of innocent persons by casually disregarding its responsibility to construct a facility which will remain perpetually secure. The conditions imposed in issuing permits guarantee on-going monitoring and supervision by the state, and Reserve and its owners have assumed all risks and liabilities arising out of the operation of Mile Post 7. Under such circumstances, we hold that it was error to deny the permit at Mile Post 7 insofar as the agencies based their decision on a finding that, although a dam at Mile Post 7 would be safe, Mile Post 20 was a \"feasible and prudent alternative.\"\n\nImpact on Mineral Potential, Timber, Water, Wildlife, Fish, and Land Use\n\nIn considering the factors which are to be weighed in determining whether Mile Post 20 is a feasible and prudent alternative, the hearing officer found that Mile Post 7 would not interfere with any potential mineral development, that destruction of timber resources would be comparable whichever site was chosen, and the loss of wildlife habitat at Mile Post 7 would result in a migration to other areas. Only passing reference was made to wildlife without comparing the two sites. The agencies concede that both Mile Post 20 and Mile Post 7 were only fair habitat for wildlife.\n\nAlthough 7 out of 9.7 miles of streams at Mile Post 7 which would be destroyed have been officially designated as trout streams, compared to 5.1 miles of streams at Mile Post 20 which have not been so designated, the uncontradicted evidence indicated that only about 2 miles at Mile Post 7 actually afforded fishing of a quality which was even \"fair,\" while the remainder of the streams were described as \"very poor.\" The agencies contend that turbidity of downstream waters at Mile Post 7 would adversely affect anadromous fish in the Beaver River. Reserve counters by pointing out that a waterfall at Highway No. 61 prevents lake fish from spawning beyond that point.\n\nSome 39 acres of lakes would be lost or affected at Mile Post 7 without any such loss at Mile Post 20. On the other hand, the tailings basin drainage area at Mile Post 7 would be 9.1 square miles, removing 6.9 percent of the watershed, compared to 12.6 square miles at Mile Post 20, removing 36.2 percent of the watershed. The hearing officer concluded that the destruction, impairment, or pollution of water resources would be less at alternative sites than at Mile Post 7.\n\nThe most troublesome question concerning the impact on natural resources is the matter of land-use planning. The hearing officer found that in this respect Mile Post 7 was the least desirable alternative, assigning as one reason the fact that the operation of the mine would extend in time beyond the physical capacity of the basin, requiring the creation of another disposal site sometime in the future. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Of more immediate concern, however, was the opinion of the hearing officer that construction of a basin at Mile Post 7 would be within the so-called \"North Shore corridor\" and would be inconsistent with land-use development for that area. He concluded that the proposed development at Mile Post 7 would not simply be an expansion of an existing industrial use but would be the creation of a major new industrial facility. As to Mile Post 20, he found that it would not be incompatible with land-use principles because it has not been committed to any other use, conceding, however, that neither has it been disturbed.\n\nWhat has been described as the \"North Shore corridor\" enjoys no official recognition or protection by law or by regulation and is an area of unspecified dimensions. There are, of course, large industrial compounds now located on the shores of Lake Superior at Silver Bay, Two Harbors, and Duluth. Mile Post 7 is only 4 miles from the present taconite processing plant at Silver Bay, which is already an extremely large industrial facility. Mile Post 20, on the other hand, is remotely located from any existing industrial area and enjoys the protection afforded a national forest. Of the land at Mile Post 20, 7,320 acres, or 84 percent, is publicly owned, whereas 4,420 acres, or 45 percent, of Mile Post 7 is publicly owned. The agencies concede that Mile Post 20 would have the \"highest frequency of visual impact,\" which is to say it would be more obtrusive aesthetically compared to Mile Post 7, which is of lower visibility.\n\nThere was testimony on the part of the agencies' own witnesses that because Mile Post 20 would open up an entirely new area it would violate land-use principles. Those principles are set forth in the Midway Supplement to the Environmental Impact Statement prepared by Barton-Aschman Associates for the DNR and the PCA in February 1976 as follows:\n\n\"The following regional land use planning principles appear to be emerging:\n\n\"1. Encourage the consolidation of manageable regional land use activities.\n\n\"2. Minimize or eliminate further intrusion of man's activities into the natural resource recreational oriented areas.\n\n\"3. Eliminate or consolidate conflicting land use activities in the Voyageurs-BWCA and north shore prime recreation/scenic corridors.\n\n\"4. Minimize the development of resource oriented activity so as to maintain the natural and recreational character of the area.\n\n\"These principles have not been established specifically by public action but tend to be supported by past and emerging public actions. Applied, they would support the consolidation of mineral processing and industrial activities adjacent to existing concentrations. These principles support protection of the major recreational corridors from further encroachment to preserve future options for eliminating conflicting and incompatible utilization.\"\n\nWe hold that the finding of the DNR and PCA that \" of the Midway site as a tailings basin would not be incompatible with land use principles\" is unsupported by substantial evidence. Consequently, the conclusion that \" the standpoint of land use planning, Mile Post 7 is the least desirable of all the alternatives\" cannot be sustained.\n\nAs we have indicated, Mile Post 20 is located entirely within the Superior National Forest. The purposes for which national forests are established and administered are set forth in 16 U.S.C.A., ยง 475:\n\n\" * * * No national forest shall be established, except to improve and protect the forest within the boundaries, or for the purpose of securing favorable conditions of water flows, and to furnish a continuous supply of timber for the use and necessities of citizens of the United States; but it is not the purpose or intent of these provisions, or of said section, to authorize the inclusion therein of lands more valuable for the mineral therein, or for agricultural purposes, than for forest purposes.\"\n\nA supplemental statement of policy and purpose is found in 16 U.S.C.A., ยง 528, as follows:\n\n\"It is the policy of the Congress that the national forests are established and shall be administered for outdoor recreation, range, timber, watershed, and wildlife and fish purpose.\"\n\nWhereas Mile Post 7 is in relatively close proximity to the Silver Bay processing plant, Mile Post 20 is some 16 miles removed. Applying the land-use principles to which we have referred, the evidence compels a finding that Mile Post 7 is not, as the hearing officer held, a new industrial development, but rather it is the expansion of an existing industrial use.\n\nClearly the selection of Mile Post 20 does violence to the principle of consolidated land uses. A total of 7,320 acres of land would be removed from public use, requiring the construction of 7,000 feet of roads and 20,000 feet of railroad spurs. Wildlife habitat of 5,326 acres would be destroyed, removing cover for moose, timber wolf, spruce grouse, fisher, and marten, as well as affecting the habitat of bear, mink, muskrat, otter, hare, and woodcock. It is an area of which 20 or 25 percent is covered by hardwoods such as aspen, birch, maple, and oak, and roughly 35 or 40 percent conifers, consisting of balsam, white spruce, jackpine, white pine, and red pine. It has the lowest deforested area of the sites considered.\n\nThe operation of a tailings basin at Mile Post 20 would have a major noise impact on 3,400 acres, and somewhat less impact on approximately 2,900 acres. Such intrusions are entirely inconsistent with the purposes and policies for which national forests are created and maintained. What Judge Philip Neville said in Izaak Walton League of America v. St. Clair, 353 F. Supp. 698, 714 (D.Minn. 1973), where he was construing the Wilderness Act as it applies to the Boundary Waters Canoe Area, articulates a philosophy to which we subscribe. It supports land-use principles which minimize \"further intrusions of man's activities into the natural resources recreational oriented areas * * * to maintain the natural and recreational character of the area.\" Judge Neville observed:\n\n\"It is clear that wilderness and mining are incompatible. Wilderness exists because man has not yet intruded upon it. As the United States was settled and frontiers vanished, wilderness disappeared except for inaccessible or otherwise then commercially useless areas. As of today but few true wilderness areas remain. Once penetrated by civilization and man made activities, it cannot be regained for perhaps hundreds of years. The recovery period is meaningless for generations to come. The destruction is irreversible. So with mining, logging off and other activities, they are anathema to all wilderness values.\"\n\nThe Superior National Forest has been set aside by Congress to protect the forest for outdoor recreation, wildlife, and other conservation purposes. We have no hesitation in holding that the destruction or removal of 8,680 acres from such a relatively wild area in order to devote it to industrial development is totally incompatible with accepted land-use principles. We are confident the Federal government would adopt a similar view if a land exchange were sought.\n\nAir Quality\n\nOn February 2, 1972, the United States brought an action against Reserve Mining Company in Federal district court to enjoin the discharge of fugitive dust into the ambient air of Silver Bay and waste into the waters of Lake Superior. The States of Minnesota, Michigan, and Wisconsin and various environmental groups were later joined as parties. The plaintiffs alleged violations of Federal statutes governing rivers and water pollution, 33 U.S.C. ยงยง 407 and 1160. The court invoked jurisdiction under Federal statute 28 U.S.C. ยงยง 1345 and 1331.\n\nAfter the trial had been in progress for some time, on June 8, 1973, the emphasis of the litigation centered on the abatement of dust emissions in the air. The Federal court thereupon accepted, and continues to retain, pendent jurisdiction to enforce the laws of Minnesota governing air pollution. At the conclusion of the trial, which required 139 days of hearings, the court on April 20, 1974, enjoined Reserve from discharging wastes into Lake Superior and from discharging amphibole fibers into the air, effective on the following day. The court's injunction as to air pollution was to extend until Reserve showed compliance with all state regulations, including Air Pollution Control Regulation (APC) 17. That regulation now provides in part as follows:\n\n\"APC 17 Emission Standards for Asbestos\n\n\"(a) Definitions: The following definitions of words and phrases are controlling for the purposes of this regulation:\n\n\"(3) 'Asbestos' means any of six naturally occurring, hydrated mineral silicates: Actinolite, amosite, anthophyllite, chrysotile, crocidolite, and tremolite.\n\n\"(7) 'Manufacturing operation' means the processing of asbestos or the production of any product containing asbestos, with the exception of any process in which an asbestos containing material is sprayed.\n\n\"(8) 'Particulate matter' means any material, other than uncombined water, which exists in a finely divided form as a liquid or solid.\n\n\"(11) For purposes of this regulation a product shall be deemed to contain asbestos if a detectable amount of asbestos is present in the product or in any material that goes into the product. A detectable amount of asbestos is defined as that amount detectable by the methods of x-ray diffraction, petrographic optical microscopy, or other method approved by the Director.\"\n\nSince the effect of the order was to close the taconite plant, the court of appeals granted Reserve an immediate hearing, lifted the injunction, and granted a stay, the chronology of which proceedings are set forth above. This brings us then to the narrow question of the extent to which our functions are circumscribed by decisions already reached in the Federal court. On March 14, 1975, the court of appeals in a thorough and comprehensive opinion, rendered a decision on the merits of the air pollution issue which remains viable and enforceable. Reserve Mining Co. v. Environmental Protection Agency, 514 F.2d 492 (8 Cir. 1975). The parties to the litigation in this court are governed by that decision. Accordingly, it is appropriate to discuss in some detail the findings and standards which the court of appeals approved in order to have a better understanding of their relationship to the selection of an on-land tailings site, the judicial review of which is the responsibility of the state courts.\n\nThe plaintiffs in Federal court introduced evidence that the taconite ore mined by Reserve contained an asbestiform variety of the amphibole mineral cummingtonitegrunerite, and that in the processing of the ore there were emissions into the ambient air of fibers which had the properties of amosite asbestos. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e It is clear from the evidence that at some occupational levels of exposure the inhalation of asbestos increases the incidence of cancer. However, the court of appeals held that there was insufficient evidence of demonstrable danger to public health to justify closing the Silver Bay plant immediately. In discussing the medical evidence, the court noted that \"threshold values\" (which are the levels of exposure below which no adverse health effects occur) and \"does response relationships\" (which quantify the association between disease-producing levels of exposure and the incidence of the disease) are not ascertainable on the basis of existing data. 514 F.2d at 508. The court went on to say \"while the actual level of fibers in the air of Silver Bay is essentially unknown, it may be said that fibers are present at levels significantly higher than levels found in another Minnesota community removed from this air contamination.\" 514 F.2d at 511. The community referred to is the so-called control city of St. Paul, where the evidence presented to the Court indicated a concentration of 7,000 fibers per cubic meter in the to 62,600 fibers per cubic meter in the Silver Bay area. The court concurred in the trial court's finding that fibers similar or identical to amosite asbestos were contained in Reserve's discharges but noted it was uncertain whether the disease effects attributable to amosite may be extended to other fibers or whether different forms of asbestos possess different pathogenic properties. In either case, it was significant to the court that impartial testimony indicated Reserve's discharges present a threat to public health. The court of appeals went on to hold that the evidence supported a finding that Reserve was in violation of APC 1, APC 3, APC 5, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and Minn.St. 116.081, subd. 1. However, the court rejected the trial court's finding that APC 6 had been violated, and also held that APC 17 did not apply to the discharge of asbestos fibers occasioned by processing iron ore. Further violations were then expressly enjoined in the abatement order.\n\nAfter reviewing the evidence, the court of appeals held \"Reserve's air and water discharges pose a danger to the public health and justify judicial action of a preventive nature.\" 514 F.2d at 535. The court went on to say:\n\n\" * * * With respect to air, the assessment of the risk of harm rests on a higher degree of proof, a correlation between inhalation of asbestos dust and subsequent illness. But here, too, the hazard cannot be measured in terms of predictability, but the assessment must be made without direct proof. But, the hazard in both the air and water can be measured in only the most general terms as a concern for the public health resting upon a reasonable medical theory. Serious consequences could result if the hypothesis on which it is based should ultimately prove true.\n\n\"A court is not powerless to act in these circumstances. But an immediate injunction cannot be justified in striking a balance between unpredictable health effects and the clearly predictable social and economic consequences that would follow the plant closing.\n\n\"In addition to the health risk posed by Reserve's discharges, the district court premised its immediate termination of the discharges upon Reserve's persistent refusal to implement a reasonable alternative plan for on-land disposal of tailings. * * *\n\n\"During these appeal proceedings, Reserve has indicated its willingness to deposit its tailings on land and to properly filter its air emissions. At oral argument, Reserve advised us of a willingness to spend 243 million dollars in plant alterations and construction to halt its pollution of air and water. Reserve's offer to continue operations and proceed to construction of land disposal facilities for its tailings, if permitted to do so by the State of Minnesota, when viewed in conjunction with the uncertain quality of the health risk created by Reserve's discharges, weighs heavily against a ruling which closes Reserve's plant immediately.\" 514 F.2d at 536.\n\nThe court added the admonition that the potential for harm imparted \"a degree of urgency to this case.\" 514 F.2d at 538.\n\nBecause state and Federal agencies are expressly governed by the mandates of the court of appeals, the pertinent portions of the opinion are set out in detail as follows:\n\n\"Pending final action by Minnesota on the present permit application, Reserve must promptly take all steps necessary to comply with Minnesota law applicable to its air emissions, as outlined in this opinion.\n\n\"Reserve, at a minimum, must comply with APC 1 and 5. Furthermore, Reserve must use such available technology as will reduce the asbestos fiber count in the ambient air at Silver Bay below a medically significant level. According to the record in this case, controls may be deemed adequate which will reduce the fiber count to the level ordinarily found in the ambient air of a control city such as St. Paul.\n\n[Note begins.] We here order Reserve to meet a court-fashioned standard which may exceed the standards of existing air pollution control regulations, excepting APC 17. The Minnesota Pollution Control Agency may condition issuance of a permit for the emission of air contaminants or the operation of an emission facility, such as the Reserve plant, upon the prevention of air pollution. Minn. Stat.Ann. ยง 116.07(4a). Minnesota defines air pollution as * * * the presence in the outdoor atmosphere of any air contaminant or combination thereof in such quantity, of such nature and duration, and under such conditions as would be injurious to human health or welfare * * * . [Minn.Stat.Ann. ยง 116.06(3).] By this injunction we impose upon Reserve the duty not only to comply with APC 1 and 5 but also to take additional steps, if any are necessary, to abate its air pollution within the meaning of Minn. Stat.Ann. ยง 116.03(3). The broad remedial policy behind Minnesota's pollution control laws authorizes injunctive relief of this scope. See Minn. Stat.Ann. ยง 115.071(4). [Note ends.]\n\n\"We wish to make it clear that we view the air emission as presenting a hazard of greater significance than the water discharge. Accordingly, pending a determination of whether Reserve will be allowed to construct an on-land disposal site or will close its operations, Reserve must immediately proceed with the planning and implementation of such emission controls as may be reasonably and practically effectuated under the circumstances. We direct that the injunction decree incorporate P B2 of the stipulation between Reserve and Minnesota relating to air emissions, reading as follows:\n\n'However, if following final court or administrative agency action relating to the existing discharge to Lake Superior, Reserve decides to substantially suspend or reduce, or to discontinue, its pelletizing operations at Silver Bay then Reserve, upon giving reasonable notice, shall be relieved from further implementation of the compliance program scheduled in this Stipulation, provided that the Agency may reasonably retain such conditions of this Stipulation, or reasonably impose such other or modified conditions as may be appropriate in connection with such suspension, reduction or discontinuance of operations.'\n\n\"Assuming that Reserve is granted the necessary permits to build an on-land disposal site, the existing stipulation between Minnesota and Reserve relating to air emissions, subject to modification because of litigation delay to this date, shall serve as a general guideline for time requirements on air controls. If the parties are unable to come to an accord for a time-table for installation of emission controls based upon the stipulation agreement, either Minnesota or Reserve may apply to the district court for an appropriate order to supplement the injunction decree in conformity with the views expressed here. We reserve jurisdiction to review any such supplemental order.\n\n\"Upon remand, we suggest that the district court request Dr. Brown \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e to advise the court concerning new scientific or medical studies which may require a re-evaluation of the health hazard (either as more or less serious than as apprehended during this lawsuit) attributable to Reserve's discharges. A similar request should also be posed to Dr. Selikoff \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e and his group of researchers. Either party may apply for a modification of the time requirements specified herein should significant new scientific information justify a reassessment of the hazard to public health.\" 514 F.2d at 539.\n\nIn that opinion, as well as in two subsequent opinions, the Federal court expressly disclaimed any jurisdiction over the issue of selecting one among alternative on-land tailings disposal sites.\n\nA timetable of 3 years from the date of state approval of a tailings site was approved by the Federal court. In subsequent proceedings, Reserve Mining Co. v. Lord, 529 F.2d 181, 188, note 7 (8 Cir. 1976), the court of appeals directed the Federal district court to deal with the following issues:\n\n\"a) Supervision of any conflicts concerning abatement of air and water pollution, 514 F.2d at 539;\n\n\"b) Consideration of any new medical or scientific studies which may require re-evaluation of the health hazard attributable to Reserve's discharges upon which any of the parties may move for modification of time requirements for abatement. Id. at 540;\n\n\"d) Applications, if any, by the United States for additional relief if the State of Minnesota and Reserve are not moving with deliberate speed to facilitate Reserve's termination of its water discharge and air pollution. Id. at 538.\"\n\nFinally, as we have previously indicated, in United States v. Reserve Mining Co., 543 F.2d 1210 (8 Cir. 1976), the court of appeals affirmed the district court's decision to require that discharges into Lake Superior be terminated on July 7, 1977, now extended to April 15, 1980.\n\nIn assessing the effect of the Federal court decisions on the proceedings here for review, several significant matters should be borne in mind. First, the Federal court was dealing with water and air pollution problems arising out of the operation of the existing taconite plant at Silver Bay. It did not attempt to project the effect on air emissions of an on-land tailings site at Mile Post 7 or any alternative location. Second, although the levels of amphibole fibers at various sites in Silver Bay were used for comparison with the level in St. Paul, which was held permissible, the court of appeals did not confine its concern for the risk to public health to the citizens of Silver Bay. On the contrary, it required compliance with stipulation agreements between the parties and with existing air pollution control regulations and statutes, none of which suggested that different standards should be imposed for different sites. We construe the Federal court decision to establish, as the law quite clearly requires, a single standard for all plants causing air emissions which may be potentially dangerous to health, wherever they may be located in this state.\n\nIn our opinion, the mitigation measures which we hereafter discuss must be effective to meet the legal standards to which we refer and to bring the asbestos fiber count in the ambient air \"below a medically significant level\" as the Federal court directed, whether Mile Post 7 or Mile Post 20 or any other location is chosen. We cannot accept the proposition, which is implicit in the position of the state, that the emission of fibers dangerous to public health at Mile Post 20 renders it a feasible and prudent alternative site. Not only are those who reside closer to Mile Post 20 entitled to the same protection as the residents of Silver Bay, but it is inconceivable that the Federal government would tolerate the construction and maintenance of an industrial operation within its confines which would pose a serious health threat to those who use the forest for recreation and other purposes.\n\nWhile little or no mention is made in briefs or arguments concerning the broad effect of the Federal court's decision on other taconite operations, we hasten to point out that the standards imposed on Reserve are not unique to it. All other taconite plants having on-land tailings disposal sites face a shutdown if they fail to meet emission standards established by the state. No reason occurs to us for assuming that Reserve will have any greater difficulty complying with environmental laws than its competitors. Reserve stands ready to invest over $300 million in that effort. Mindful of the vigilance of state and Federal agencies who will not permit Reserve to operate if it is found to be a danger to public health, we are confident the mitigation efforts which are proposed will be entirely adequate.\n\nWhat we have said with respect to future compliance to some extent renders moot the principal issues litigated. The evidence adduced at the agency hearing and at the hearing before the district court was directed primarily at two matters: First, the level of asbestiform fibers in the ambient air emitted by the existing processing plant, and the level projected for the proposed tailings basin; and, second, a determination of the \"medically significant level\" of fiber concentration. The Federal court recognized, as we do, that neither of these matters is susceptible of precise scientific or medical determination under existing technology. As techniques improve, it is hoped that greater accuracy in measuring and in testing levels will be achieved. A brief summary of the applicable statutes, contentions of the parties, and the findings of the hearing officer and the district court, as they bear on these matters, follows.\n\nMinn.St. 116.01 states a policy designed to achieve a reasonable degree of purity of the air, and Minn.St. 116.06, subd. 3, defines air pollution as follows:\n\n\"'Air pollution' means the presence in the outdoor atmosphere of any air contaminant or combination thereof in such quantity, of such nature and duration, and under such conditions as would be injurious to human health or welfare, to animal or plant life, or to property, or to interfere unreasonably with the enjoyment of life or property.\"\n\nThe Environmental Rights Law, which also governs air quality, defines pollution as conduct which \"is likely to materially adversely affect the environment.\" Minn.St. 116B.02, subd. 5. Administrative permits shall not be granted which result in conduct likely to impair the quality of the air if there is a \"feasible and prudent alternative consistent with the reasonable requirements of the public health, safety, and welfare and the state's paramount concern for the protection of its air, water, land, and other natural resources from pollution, impairment, or destruction.\" Minn.St. 116B.09, subd. 2. These statutes are necessarily couched in general terms, leaving to the agencies who are responsible the duty of determining precisely what standards will fulfill the environmental policy enunciated by the legislature.\n\nThe hearing officer adopted the state's estimates of fugitive dust emissions and found the PCA estimates of fiber content valid for comparing the projected impact which would result from the use of alternative disposal sites. In so doing, the hearing officer rejected Reserve's estimate of a 50-percent reduction in total emissions by the application of air elutriation measures and improved dust collection facilities at the processing plant. The hearing officer held that projected levels of fibers at Silver Bay after mitigation has been applied would not meet the Federal court's standards. The increase in total suspended particulates (TSP) and potentially hazardous fibers from Mile Post 7 were found to be three times that which Silver Bay would experience from the use of Mile Post 20. The hearing officer concluded that \" no safe threshold level of exposure to asbestos fibers has been identified,\" no site is free from risk, and the best site is therefore the one which offers the least exposure.\n\nThe trial court also stressed the lack of standards but compared the TSP level of 65 micrograms per cubic meter in St. Paul with a predicted TSP level in Silver Bay of 22 micrograms. (There are 454 million micrograms to a pound.) The trial court found that no existing fiber-counting methods could serve as a regulatory tool. It was influenced by the fact that the division of air quality of the PCA had recommended at one time the issuance of a permit for Mile Post 7 with conditions attached to which Reserve had agreed. The court thereupon held that there was no substantial evidence with respect to air quality to justify the rejection of Mile Post 7 as a tailings site.\n\nThe Federal court has accepted the testimony of Dr. William F. Taylor of the Mayo Clinic, a court-appointed witness, who stated that the burden of fibers in the air at Silver Bay was 62,600 fibers per cubic meter. Although that estimate was subject to a ninefold margin of error and would not necessarily represent the average annual burden at Silver Bay, it was used to compare that fiber count with the fiber count of the control city of St. Paul. Although the Federal court had only the 7,000 figure before it, subsequent tests showed as much as 30,000 fibers per cubic meter in St. Paul. All of the evidence bearing on air quality which would result from the operation of the tailings site was of course based entirely on projected estimates of total fiber levels. The methods used by experts on both sides varied greatly and understandably reached results which were totally irreconcilable. The PCA and DNR relied on a five-step process. The first was to determine the number of fibers in a microgram of coarse tailings dust. The second step was to determine the amount of all fugitive dust, i.e., dust created by wind erosion and by the activity of machinery, which would be generated by the construction and operation of the basin. The third step was to determine the percentage of dust originating from coarse tailings. The fourth step was to determine the impact of fugitive dust, i.e., total suspended particulates, on population centers. For this purpose, a \"climatological dispersion model\" computer program was used, which employs such data as wind velocity, wind direction, precipitation, and emission rates. The last step is to multiply the figures obtained in steps one, three, and four to determine the number of fibers per cubic mater in the ambient air at Silver Bay. The result of this calculation was to predict that at Silver Bay there would be 132,000 positively identified amphibole fibers per cubic meter if Mile Post 7 were used, and 32,000 such fibers if Mile Post 20 were used. These results assumed that mitigating measures such as water sprinkling, the use of chemicals, and the planting of vegetation had been utilized.\n\nReserve, on the other hand, presented witnesses whose research and testimony, when applied to the conversion figures of one state expert, projected a level of 13,680 fibers per cubic meter at Silver Bay after mitigation, and when applied to the conversion figures of one of Reserve's experts, a level of 7,826 fibers. Both of these figures were well within the range of St. Paul's acceptable fiber level. Sierra Club attacks all of these computations as failing to adequately consider such factors as silt content, vehicular traffic on dams and dikes, activity of railroad cars in dumping tailings, acreage of exposed areas, the effect of mitigation measures, the volume of coarse tailings, and the rate of emissions from them. Sierra Club argues that a proper consideration of these factors would lead to a likely level at Silver Bay ranging from 620,800 fibers per cubic meter to 1,891,500 fibers.\n\nTo illustrate the enormous margin of error, there was testimony which acknowledged a margin of two orders of magnitude in fiber counting, representing a range of some 10,000 to 1,000,000, and frequent references to \"nine times on the high side to one-ninth on the low side.\" The air quality engineering chief of PCA, Tibor Kosa, testified that concentrations of fibers at Silver Bay are not known because of the inaccuracy of counting techniques. More significantly, the executive director of PCA, Peter L. Gove, repeatedly testified that predictions of total suspended particulate and asbestiform fiber levels at alternative sites were not possible because of deficiencies in data and the qualifications placed on emission projections. At one point, he wrote that there was no way of meeting the standards for Silver Bay fixed by the Federal court because \" do not have any good readings for the air in St. Paul.\" Mr. Gove further testified, \"The MPCA staff cannot at this time determine the significance of the difference in ambient asbestiform fiber levels at population centers with the coarse tailings submerged at all sites.\"\n\nGary S. Eckhardt, chief of technical services of the PCA division of air quality, testified that there were three methods used in fiber analysis: Electron microscopy, selected area diffraction, and energy dispersive X-ray detection. It was his opinion that there was not enough correlation from laboratory to laboratory to permit fiber analysis to be used as a reasonable regulatory tool. He referred to one study which showed approximately 10,000 fibers per cubic meter at Silver Bay and \"not too much difference from that, say, at other locations in the Iron Range and Duluth.\" Mr. Eckhardt concluded that none of the studies was designed properly, that the studies did not provide the needed data, and that all that could be said about the concentration of amphibole fibers in Silver Bay was that it was between 1,000 and 10,000,000 per cubic meter.\n\nTibor Kosa concurred in Mr. Eckhardt's view that fiber counts of the same samples of Silver Bay air could vary as much as from 1,000 to 10,000,000 per cubic meter. Gene Hollenstein, chief hydrologist and acting director of the DNR water division, agreed that his staff could not \"define the medical significance of the incremental damage, the incremental differences or dangers from this fiber at any given site.\" Dr. Phillip M. Cook, an Environmental Protection Agency research chemist and a consultant for the state, was of the same mind, testifying that differences in laboratory equipment, personnel, and technique can produce differences in fiber counts from identical samples at different laboratories showing a variation of at least as much as two orders of magnitude. Dr. Arnold Brown, on whom the Federal court placed great reliance, testified in that court that, based on scientific evidence, he could not predict the number of fibers in the air at Silver Bay or predict that cancer would be found there. Nor could he say what was a safe level with respect to a human carcinogen because that information was not available to anyone. Reserve Mining Co. v. Environmental Protection Agency, 514 F.2d 492, 513 (8 Cir. 1975).\n\nIn reaching the conclusion that the agencies were not justified in denying permits for Mile Post 7, we are impressed by the change of testimony given by Dr. Chatten Cowherd, Jr., Midwest Research Institute's principal environmental engineer called as a PCA witness. At the administrative hearing, he testified that the Mile Post 7 site would contribute 1.75 micrograms of total suspended particulates (TSP) per cubic meter to the ambient air at Silver Bay, whereas Mile Post 20 would contribute only 1.0 microgram. The difference would be caused by the distances to be traveled from each site. The agencies accepted the 1.0 microgram figure in approving Mile Post 20 and in rejecting Mile Post 7.\n\nAt the district court hearing, Dr. Cowherd acknowledged that in arriving at his estimates he had neglected to consider adequately the silt and moisture content of tailings and the degree of handling in depositing them into the basin. Consequently, he revised his estimates to conclude that Mile Post 7 would contribute .63 microgram of TSP, and Mile Post 20, .15 microgram to the air at Silver Bay. Notwithstanding the fact the agencies had previously approved an increase of 1.0 microgram for Mile Post 20, they now, after the administrative hearing, reject as impermissibly high a figure of .63 microgram.\n\nThe agencies advanced two reasons for these somewhat inconsistent positions. First, they argued that total suspended particulates have no significance unless the volume of asbestiform fibers contained in them has been established. This argument, however, runs afoul of the agencies' reliance on TSP as a factor in the fourth step of their fiber-projection process which produced a reading of 132,000 fibers per cubic meter at Mile Post 7.\n\nSecond, and more important, is the doctrine abbreviated into a phrase coined by DNR counsel that \"less is better than more\", that is to say, where fugitive dust is known to contain carcinogens in some amount, it is safer and more prudent to select a site which is the more remote from the populated area to be protected. In our opinion, this is not what is meant by a \"feasible and prudent alternative\" in our environmental statutes. What the application of the \"less is better than more\" doctrine overlooks is the fact that what is \"less\" for Silver Bay is \"more\" for the users of the Superior National Forest if Mile Post 20 is selected.\n\nUnless the state is to find a totally uninhabited and uninhabitable location as a tailings site, and Reserve's employees are there provided with special respiratory protection, if the agencies determine with some degree of precision that fugitive dust at Mile Post 7 has not been reduced below a medically significant level after all the proposed mitigation measures have been implemented, the solution is to require further mitigation or to close the plant. The alternative is not to substitute one community for another as a target for exposure to a health hazard if one is found to exist. But here, no risk has been proved by substantial evidence, no medically significant level of dust has been determined, and no standards for emission have been established. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe DNR acknowledges that the present state of the art of fiber analysis and medical science does not permit a specific determination of the medical significance of the incremental differences shown in exhibits which compare relative air-quality impacts to be anticipated from the various sites under consideration. PCA has taken the position that, given the present state of science in counting fibers and evaluating their effect on health, it is not possible to establish a standard that would attach a number to the amount of fibers which can safely exist in the ambient air. In light of the undisputed evidence that projections on which dust emission figures for Mile Post 7 have been reached are based on unreliable and imprecise data and are subject to immensely large margins of error, and in the absence of a determination of what constitutes medically significant levels of fugitive dust generated by Mile Post 7, we hold that the hearing officer's finding that the impact of air pollution on Silver Bay by the selection of Mile Post 20 makes it a preferable site is unsupported by the evidence. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nEconomic Impact on Silver Bay\n\nWe have discussed in some detail the hearing officer's sobering assessment of the adverse economic effects a plant shutdown would have on the employees of Reserve and on the welfare of other residents of Silver Bay. Officers of Reserve have publicly announced the intention of Reserve and its parent companies to close the Silver Bay plant if Mile Post 20 is selected. That intention has been formally confirmed by counsel for Reserve in open court in these proceedings and we must accept that premise, whatever doubts may be entertained by others.\n\nWe have previously indicated that state agencies and courts are required by statute to consider both the economic impact and the environmental impact in rendering decisions dealing with environmental matters. Minn.St. 116.07, subd. 6; 116B.04; 116B.09, subd. 2; 116D.02, subd. 1; 116D.03, subd. 2(c); 116D.04, subd. 6. Where, as here, the evidence of potential detriment to public health is unsubstantial and inconclusive, and there is evidence that effective measures to mitigate air pollution will be taken, we must take into consideration human factors which inevitably bear on a decision having serious personal consequences in the lives and well-being of those closest to the problem. As we construe the statutes, and apart from statute, if there were substantial evidence that Reserve's proposed tailings site at Mile Post 7 would have significantly adverse medical effects on the residents of Silver Bay, no further consideration would be given to the economic consequences of a total shutdown and the site would be rejected. We are not free to barter the health of residents at Silver Bay for their economic security, even if that were their intention, which it is not. It is only where the likelihood of danger to the public is remote and speculative that economic impacts which are devastating and certain may be weighed in the balance to arrive at an environmentally sound decision.\n\nAvailability\n\nAlthough we have directed the PCA and DNR to grant Reserve permits for the construction of a tailings basin at Mile Post 7, that order does not, of course, guarantee that the site is actually available for those purposes. Nor is there any assurance that if Mile Post 20 had been selected it would eventually be available. That site is located entirely within the Superior National Forest and would require an exchange of land. Evidence furnished by James F. Torrence, supervisor of the forest, indicated it would require at least 2 years, and more realistically 30 months, to conclude negotiations with the forest service. Reserve would first be obliged to find other property acceptable to both the forest service and the county boards affected. An environmental statement would be prepared by the forest service, and the Corps of Engineers would be consulted for their analysis. An appraisal would have to be made of both the offered land and the selected land. It would be necessary to conduct mineral and archeological surveys. The proposal would then be submitted to the National Forest Reservation Commission, which consists of the Secretary of the Army, the Secretary of the Interior, the Secretary of Agriculture, two United States Senators, and two United States Congressmen among others. Titles would then be examined by counsel for the Department of Agriculture and defects corrected so that title insurance could be obtained.\n\nThe Federal government is under no obligation to provide Reserve with a tailings site at Mile Post 20, and there is no assurance it would be inclined to do so. Supervisor Torrence testified that he had never heard of the government permitting a mining waste disposal site in a national forest and felt it was \"very questionable\" whether the forest would be available for that purpose. Reserve has no authority to condemn government property, and during the period of negotiations, the Silver Bay plant would either be shut down by the Federal court or would continue to discharge wastes into Lake Superior. As to Mile Post 7, the evidence indicated ownership divided as follows: Lands owned or controlled by Reserve, 3,115 acres; other privately-owned land, 1,880 acres; land in the state trust fund, 320 acres; land held by the state for conservation, 500 acres; and land which is tax forfeited and held for county use, 3,600 acres. Based on these figures, the state owns approximately 47 percent of the site, Reserve owns or controls approximately 33 percent of the site, and other private owners have title to the remaining 20 percent of the site. One of such owners, Dr. Rodney B. Nelson, owns 1,240 acres within and adjacent to the Mile Post 7 site, including all of Bear Lake which has an area of approximately 100 acres. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Dr. Nelson intends to resist eminent domain proceedings which will have to be instituted by Reserve to acquire part of his property. He contends that Minn.St. 117.46, which authorizes taconite mining companies to acquire private property by condemnation for use as a tailings site, unconstitutionally takes private property for private purposes. Although we intimate no opinion as to the merits of Dr. Nelson's contentions, we recognize that litigating the validity of the statute may well be time consuming. The remaining privately-owned property will also have to be acquired by negotiation or by condemnation.\n\nMinn. Const. Art. 11, ยง 10, authorizes proceedings for the exchange of public land for private purposes with the unanimous approval of the governor, the attorney general, and the state auditor. Minn.St. 94.341 designates these constitutional officers as the Minnesota Land Exchange Board. Minn.St. 9.011 creates the State Executive Council, which consists of the governor, lieutenant governor, secretary of state, state auditor, state treasurer, and the attorney general. It appears that state trust fund lands may be sold or exchanged only with the unanimous approval of the Land Exchange Board.\n\nIn order for Reserve to obtain state-acquired (conservation) land, the DNR commissioner must designate the property as no longer needed by the DNR. It is then reviewed by the commissioner of administration, who offers it to other state departments and agencies. If none accepts it, the State Executive Council must determine whether it is surplus state land which is available for exchange or sale to private purchasers. No requirement for unanimity of the State Executive Council is contained in the statute.\n\nTax forfeited lands are held by the state in trust for taxing districts where they are located. They too may be sold as surplus land under procedures provided in Minn.St. 94.09. Sales of tax forfeited land must be approved by the DNR commissioner as well as the commissioner of administration and the State Executive Council. The Environmental Impact Statement estimates that the exchange of state trust fund land would take from 6 months to a year; while the exchange or sale of state-acquired (conservation) land would take 6 months and the purchase of forfeited land, 4 months, assuming of course that all necessary administrative approval has been obtained.\n\nOne other procedural hurdle must be overcome before any site is finally approved. Because navigable streams emptying into Lake Superior will be affected, and warm water from the processing plant will be returned to the lake at the rate of over 100,000 gallons a minute, Reserve must receive permits from the U.S. Corps of Engineers pursuant to 33 U.S.C.A., ยงยง 1251 et seq., 1311, and 1344. That process may further delay the commencement of construction of the tailings site.\n\nWe cannot assess the relative merits of the two sites on the basis of availability beyond the obvious fact that, if it is so inclined, the state can make Mile Post 7 available more expeditiously than the Federal government is likely to act with respect to Mile Post 20. To the extent that the termination of discharges into Lake Superior will be hastened by the selection of Mile Post 7, we are of the opinion that Mile Post 20 would be the less desirable alternative.\n\nMitigation Agreements and Other Conditions Which Have Been Accepted by Reserve.\n\nOn January 8, 1973, the PCA entered into an air quality stipulation agreement with Reserve which was subsequently expanded and amended on May 21, 1975, and December 23, 1975. These agreements dealt with measures to be taken by Reserve to reduce particulate emissions and improve air quality. The agreements specify in detail the measures which Reserve must take to modify its plant operations to achieve a goal of 99.6 percent reduction in particulate emissions. In compliance with the court of appeals' decision Reserve agreed to install fabric filters on hood exhaust and waste gas stacks of its pelletizing machines, or to utilize wet-wall electrostatic precipitators or other devices to exploit the best technology which is economically feasible and available. In addition, Reserve agreed to furnish fabric filters on various other stacks, bins, and buildings with a view to complying with all state and Federal statutes, ordinances, and administrative regulations.\n\nOne of the appeals before us deals with the district court's refusal to reopen the record to receive newly discovered evidence concerning the malfunctioning of the wetwall electrostatic precipitators. Sierra Club asserts that this evidence lends support to the claim that the efficacy of these mitigating measures is open to serious doubt and tends to impeach the credibility of Reserve's witnesses who testified that the process would be effective.\n\nThe record before us includes Reserve's memorandum brief for the trial court fully disclosing the difficulties it experienced in experimenting with precipitators. Reserve advised the court that these problems indicated that additional research and development would be necessary to successfully operate proposed dust control facilities, and gave assurance that steps would be taken to overcome the maintenance problem which had arisen. Under these circumstances, whether or not the trial court properly exercised its discretion, we are of the opinion that the exclusion of additional evidence was not prejudicial since the trial court had already been made aware of facts which put in doubt the effectiveness of the precipitators.\n\nWe will not undertake to extend this opinion unduly by describing in detail all of the measures which Reserve has agreed to pursue to mitigate and minimize emissions of fugitive dust from the tailings site and the processing plant. Four major steps will be taken in efforts to contain dust emissions from roads, dikes, exposed dam areas, and deposits of coarse tailings and silt. These measures are water submerging, water sprinkling, chemical binding, and vegetation. As we have noted, all course tailings and fine silt will be submerged in 10 feet of water until the basin reaches its capacity. At that time and as dikes and dam structures are made permanent they will be vegetated to provide a permanent cover which will be designed to minimize dust emissions and soil erosion. There is evidence that coarse tailings can be successfully seeded and that they will ultimately revert to a state of nature. In the interim Reserve proposes to utilize a continual process of water sprinkling and binding with such chemicals as calcium chloride and a commercial product known as Coherex. There is evidence that the latter is biodegradable, non-toxic, and not injurious to plant life. Dr. Cowherd testified that increasing tailings moisture from 2 percent to 10 percent would lower the emission rate from .068 pounds per ton to .003 pounds per ton, a 95 percent reduction. As we have previously indicated, the pollution control equipment planned for abating emissions from stacks at the processing plant is expected to reduce the volume of such emissions from 65.8 tons per day to less than 2 tons per day.\n\nIn referring to the stipulation agreement governing air quality, Tibor Kosa, who made the above estimates, testified:\n\n\"In summary, the DAQ [PCA, Division of Air Quality] is of the opinion that Reserve Mining Company will install and start to operate on as technically tight a schedule as possible pollution control equipment for over three million cubic feet per minute contaminated air in their Silver Bay processing plant. This pollution control system represents the best available technology in our experience in this field. According to my knowledge, no other mining company in the world installed such efficient pollution control equipment for their pelletizing machines. At the present time, equipment installation is progressing on schedule on other sources.\n\n\"A very substantial reduction in particulate fiber emission from the processing plant will take place after all the control equipment is in operation.\"\n\nHaving in mind that the PCA Board initially rejected the hearing officer's recommendations by a vote of 5 to 4, we are of the opinion that the testimony of its director, Peter Gove, is particularly relevant:\n\n\"After extensive analysis by the PCA staff considering only the environmental parameters of all sites, Midway is the preferred alternative.\n\n\"The PCA staff recognizes, however, that the environmental benefits of a site must be analyzed in light of other considerations. If the Hearing Officer finds that there are no feasible and prudent alternatives to the Mile Post 7 site, pursuant to Minnesota Statutes Chapter 116(d).046, the MPCA staff, on the basis of available data, could recommend the issuance of a permit for Mile Post 7 with the conditions described in previous testimony.\n\n\"The Department of Natural Resources staff have recommended to the Hearing Officer that the Mile Post 7 site be rejected. The Mile Post 7 site is not the PCA's preferred site from an environmental standpoint. However, the MPCA staff does not recommend to the Hearing Officer that the Midway alternative or any of the other alternatives is more feasible and prudent than Reserve's modified Mile Post 7 plan.\n\n\"There are substantial differences between the sites under consideration with respect to certain parameters. There will be environmental impacts at all the sites under consideration. We believe when combining all parameters of the various sites, however, the differences between the sites are small.\n\n\"Our responsibilities pursuant to the Minnesota Environmental Policy Act require an evaluation of all parameters of each site. While we see certain environmental advantage at Midway and the Babbitt sites, at the same time we must recognize the additional cost for the company to construct at these sites. The MPCA staff concludes that subject to the conditions stated by the MPCA's water quality and air quality staffs and confirmation of the feasibility, safety and fiber reduction from placing the coarse tailings under water, that Mile Post 7 is a reasonable site for tailings deposition.\n\n\"We believe, however, that both Mile Post 7 and Midway could form the basis for resolution of this case. These sites are feasible sites for which we believe the environmental hazards can be minimized, providing that the best available technology is diligently applied. Selection of either of the sites can end the discharge into Lake Superior, an issue that has been paramount with our Agency since 1969.\"\n\nThe additional expense for locating at Mile Post 20 to which Mr. Gove referred was estimated by the state to be $80 million and by Reserve to be $140 million. Reserve is now prepared to spend over $300 million for an on-land tailings site at Mile Post 7, of which counsel for Reserve has represented to the court the company is committed to applying $42 million in reducing and containing fiber emissions from its processing plant. If it is permitted to proceed with construction, Reserve has given assurances that in 27 months 40 percent of its tailings will be removed from the lake and in 33 months all discharges will terminate.\n\nIt is difficult to conceive of more stringent conditions for guaranteeing acceptable air and water quality than those which have been imposed on Reserve, Armco, and Republic and to which they have formally agreed. The permits to be granted under Minn.St. 116.081 must be reviewed and renewed every 5 years. The three companies agree to assume all risks and liabilities arising out of the operation of Mile Post 7. They are committed to perpetual maintenance of the site to prevent tailings from reentering the air and water and have agreed to all of the mitigation measures we have discussed, using the best technology available. In addition, the companies agree to comply not only with existing laws and agency regulations but those which may be adopted in the future. Monitoring air and water for any potentially hazardous conditions will be conducted at company expense and will include fiber counting by X-ray diffraction, electron microscopy, or by any other method which PCA specifies.\n\nAlthough DNR and PCA question Reserve's sincerity and its capacity to achieve the mitigation goals it proposes, we are not persuaded that Reserve will risk an investment of over $300 million if it has any reason to believe that when the project is completed it will not have met standards required by state and Federal laws and regulations, and that consequently it will not be permitted to continue its operations at Silver Bay.\n\nOther issues have been raised by appellants and have been considered by the court. However, we find they do not affect the results or require further discussion.\n\nSummary\n\nThe resolution of the principal issues raised in this litigation may be summarized as follows:\n\n1. With the exception of testimony introduced at the district court hearing, because we are reviewing the agencies' decision and not that of the trial court, we have examined the record to determine only whether the hearing officer's findings are supported by the evidence or are affected by errors of law. We have not accorded the special deference to the court's findings to which it would be entitled were it acting as a court of first impression rather than as an appellate tribunal.\n\n2. We have read together the DNR, PCA, and APA statutes governing judicial review and find them to be consistent with one another as applied to this case. The scope of review in all such appeals will now be governed by the provisions of APA, Minn.St. 15.0425.\n\n3. Our decision is premised on the undisputed evidence that operation of Reserve's taconite processing plant at Silver Bay and the use of an on-land disposal site without adequate mitigation will generate carcinogenic amphibole fibers which are dangerous to the health of those who are exposed to them.\n\n4. In holding that PCA and DNR must issue to Reserve permits for the construction of a tailings basin at Mile Post 7 we do not suggest that Reserve will be permitted to conduct its mining operations in a manner which poses a threat to public health. On the contrary, it, will be held strictly to the conditions imposed by this court and to standards imposed by the Federal court, both state and Federal pollution laws, and by the Air Pollution Control Regulations.\n\n5. The standards, among others, to which Reserve shall adhere are set forth by the Federal court as (a) compliance with APC 1 and 5; and (b) a level of asbestos fibers in the ambient air at Silver Bay below a medically significant level; and (c) the level ordinarily found in the ambient air of the city of St. Paul; and (d) a level which is not of such a nature and duration as to be injurious to human health or welfare in violation of Minn.St. 116.07, subd. 4a. Subject to modification because of delay occasioned by litigation, the use of existing stipulations between the State of Minnesota and Reserve relating to air emissions shall be used as a guideline for time requirements.\n\n6. We have found no testimony which establishes the level at which fiber emissions constitute a medically significant danger to health. Nor was there reliable evidence of the number of fibers per cubic meter in the ambient air in the city of St. Paul. These critically important facts are yet to be determined with scientific and medical precision.\n\n7. In holding that there is no substantial evidence to support a finding that Mile Post 20 is less hazardous to public health than Mile Post 7, we do not rule on the nature or degree of potential danger created by emissions of asbestiform fibers at either site. We base our decision only on the principle that residents and users of both sites are entitled to equal protection against latent dangers and that neither group should have preference in avoiding them.\n\n8. Finally, we are of the opinion that the DNR and PCA should grant Reserve an opportunity to put into effect the mitigation measures we have described, without discrediting its effort to comply with the conditions to which it has agreed, and without causing the Silver Bay taconite plant to be shut down on the basis of imprecise and speculative projections, with all the hardships to residents of that community which would attend such a decision.\n\nNo costs or disbursements are allowed any of the parties.\n\nAffirmed.\n\nAPPENDIX\n\n\"APC 1 provides in part:\n\n\"(a) The 'primary' air quality standards are levels of air pollutants above which, on the basis of present knowledge, health hazards or impairment may be produced. Health hazards include not only production, aggravation or possible production of disease, but also interference with function. Health impairment includes sensory irritation and impairment of well being by such phenomena as odor. The 'secondary' air quality standards are levels which are desirable to protect the public welfare from any known or anticipated adverse effects, such as injury to agricultural crops and livestock, damage to or deterioration of property, annoyance and nuisance of person, sensory impairment and obstruction, or hazards to air and ground transportation.\n\nAPPENDIX - Continued\n\n\"(b) No person shall emit any pollutant in such an amount or in such a manner as to exceed any ambient air quality standard herein beyond such person's property line, without respect to whether emission regulations stated in other air pollution control regulations of the Agency are also being violated.\n\n\"APC 3 provides in part:\n\n\"(a) Installation and Operating Permits for Stationary Sources, Fuel-Burning Equipment, Refuse-Burning Equipment and Control Equipment.\n\n\"(2) Operating Permit\n\n\"(aa) No person shall operate any stationary process, fuel-burning equipment, refuse-burning equipment, or control equipment therefore without obtaining an operating permit in accordance with the provisions of Minnesota Laws 1971, Chapter 904.\n\n\"(bb) A person operating an existing installation which is a source of air contaminants and air pollution shall apply for an operating permit. New operating permits are not required for persons operating emission sources where an operating permit has been issued before January 31, 1972, unless said operating is in violation of Agency air quality rules, regulations and standards.\n\n\"APC 5 provides in part:\n\n\"(a) General Provisions.\n\n\"(1) This regulation applies to any operation, process, or activity except the burning of fuel for indirect heating where the products of combustion do not directly contact process materials, except refuse burning and process burning of salvageable material.\n\n\"(5) Any existing emission source which has particulate collection equipment with a collection efficiency of 99 percent by weight or any new emission source which is installed with particulate collection equipment of 99.7 percent efficiency by weight shall be considered as meeting the provisions of this regulation.\"\n\n[]\n\nYETKA, Justice (concurring specially).\n\nThe Federal courts have held already that it was a monumental environmental error to locate the plant at Silver Bay and to allow tailings to be dumped into Lake Superior. Of that there can be no doubt. Although the decision to permit the use of the lake was made 30 years ago, even in the light of knowledge at that time it seems in retrospect an incredible decision. For even in 1947 the State Conservation Department was limiting the use which landowners bordering along lakes and streams could make of their property, and by the 1950's it was extremely difficult for a cottage owner to even get a permit to place some sand on his beach, even one truckload. Yet Reserve was permitted to dump 67,000 tons of waste, amounting to thousands of truckloads, into the king of fresh waters each and every day. Lake Superior was sold 30 years ago - bartered away for dollars and jobs, albeit hundreds of millions of dollars and thousands of jobs.\n\nHowever, the fact is that Reserve was allowed to build and to use Lake Superior; and cities have since been built, thousands of people employed, and many have invested their lives and fortunes in their communities. All of the parties acknowledge those facts, and that is why it is apparent that no party to this lawsuit has indicated its desire to close down Reserve. The DNR at oral argument said that Reserve should be forced to use Mile Post 20, and if it closes down because it will not use that site, that is a consequence that must be faced. But counsel also added he did not think that such an event would happen and agrees that the result would be horrendous.\n\nNo, appellants do not come before us to argue that Reserve should be closed but to argue that Mile Post 20 is a more feasible location for a basin as an alternative to Mile Post 7. They ask that we reverse the district court finding that Mile Post 7 should be utilized. Mile Post 7 would best serve the people - the people who live and work within the area and all the people of this state.\n\nWere the only consideration the extra cost to Reserve in using Mile Post 20 in spite of its threat to shut down if forced to do so, then Mile Post 20 would be the preferable choice. However, cost is only one factor considered by this court, and not the primary factor. The primary reasons compelling a rejection of Mile Post 20 are:\n\n(1) Mile Post 20 would involve the use of lands inside the Superior National Forest, opening up lands never previously exposed to the ravages of mining operations.\n\n(2) Mile Post 20 would entail greater dam construction problems and result in seepage at least four times that contemplated from Mile Post 7.\n\n(3) Some 17 creeks, lakes, and rivers would be involved at Mile Post 20, and only 4 at Mile Post 7.\n\n(4) The headwaters of at least two river systems would be affected at Mile Post 20.\n\n(5) Mile Post 20 would involve 20 miles of rails and pipelines to haul the waste from Silver Bay to the tailings basin in all kinds of weather, summer or winter.\n\n(6) Mile Post 20 would use 327 billion more BTUs of energy each year than Mile Post 7, at a time when energy conservation is an absolutely crucial concern of state and national policy.\n\n(7) The cost and difficulty of monitoring the basin at Mile Post 20 is greater than at Mile Post 7.\n\n(8) The effect on wildlife is at least as great or greater at Mile Post 20 than at Mile Post 7.\n\n(9) The amount of fugitive dust is admittedly as great or greater at Mile Post 20 than at Mile Post 7. The argument was made, however, that there are fewer people living at Mile Post 20 who would be affected, and the disbursement of the dust in the air would result in lower levels at Silver Bay with the use of Mile Post 20 than if Mile Post 7 were used outside Silver Bay. It seems to me it is hardly a consolation to people living in the Mile Post 20 area to be told that they are less important than people living elsewhere.\n\n(10) The conditions listed in the granting of the permit are sufficient to grant whatever protection to the public health is needed.\n\n(11) If the standards of air quality which are required of Reserve pursuant to the court's decision cannot be met, it is doubtful any mining operation in northeastern Minnesota could comply with those standards because every such operation involves drilling, blasting, hauling, and crushing.\n\nIt is said that Reserve should not be able to dictate its own tailings site. That is hardly the case here. Reserve first proposed to continue to use Lake Superior and to dump its tailings into the deep trough offshore, and not to go to land disposal at all. Its second position was if it had to go on land it would use the Palisades site. The company finally was encouraged by administrative agencies of this state to consider Mile Post 7, and, when Reserve finally agreed to do so, very stringent conditions were placed on the use thereof. Following the company's acceptance of those conditions, it was told that still wasn't good enough and that it ought to now consider Mile Post 20.\n\nApplying all the factors above set forth, Mile Post 7 is the only selection which is economically and environmentally sound, and which can best protect the health - mental as well as physical - of the people on the North Shore most directly involved. The standard of review to be used by this court is really not an issue in this case. No matter what standard is urged on the court an impartial and reasoned application of the facts requires me to reach the conclusion that there is no substantial evidence to support any finding or recommendation that Mile Post 20 is a feasible site for a tailings basin. However, there is ample evidence to support the finding by the district court that Mile Post 7 is a feasible site.\n\nNot to be discounted is the fact that in 1974 the record shows that the PCA and Reserve were negotiating for the use of Mile Post 7, and terms and conditions were worked out; that as late as the spring of 1976 the PCA director, Peter L. Gove, did not oppose the use of Mile Post 7 but rather considered it acceptable. Mr. Gove's testimony before the hearing officer is adequate proof of that fact.\n\nThen what is the problem? Why all the dispute over selection of a site? We can only guess, because the record is not clear as to what happened. However, it is possible the agency staff, in attempting to undo what was done 30 years ago, was determined to be overly tough in this case to convince the public how serious Minnesota would be in its new environmental stance. It was easy to select Reserve as a target on this issue because Reserve had shown itself over the past 8 years to be more than willing to enter the courtroom arena and litigate, litigate, and litigate some more. They had, moreover, been found to be polluting the lake, violating the terms of their permit, and even hampering the trial of the issues by withholding vital evidence from the Federal district courts.\n\nBut the state cannot be said to be free of fault. Thirty years ago it encouraged Reserve to locate in Minnesota and allowed it to use Lake Superior. Moreover, it has shown the same zeal to litigate as Reserve, and the animosity between the state agencies and Reserve is ill-disguised. It is our duty, however, to ignore the animosities, ignore the mistakes of the past, and attempt to arrive at a reasonable decision today. I think the court has done that.\n\nJust as Reserve is not dictating the terms of its own permit, it cannot be said that the people of northeastern Minnesota should have the sole voice in determining the terms of a permit. However, the latter should have a greater voice in the final decision than either Reserve or people living elsewhere. The people of Silver Bay and of other northeastern Minnesota communities have been joined by labor, industry, and business leaders in a near united front seeking the use of Mile Post 7. Local steelworkers unions at Silver Bay and Babbitt hired their own experts to test the safety of the proposed site and the effect of its operation on its members, and they are satisfied that Mile Post 7 is a feasible site.\n\nThus, the wishes and desires of the people who work, live, and play in northeastern Minnesota should, if at all reasonable, be given great weight. Moreover, they are the ones who are going to have the plant and tailings basin in their backyard for many years.\n\nIt might appear attractive to some that no human life exist in northeastern Minnesota at all, so the area could be used as a playground and a recreational area to come and enjoy and then leave again to enjoy another day. But someone must be there to fight forest fires, pick up garbage and other debris, and pay taxes for the maintenance of the area. Thus, such an ideal is unrealistic.\n\nI feel compelled to comment on several other points: The district court indicated that Reserve may have grounds for claiming lack of due process. The years of litigation should point to at least one fact if nothing else - no one was denied due process in all these proceedings.\n\nReserve, by reason of the conditions of its original permits granted after the hearings in 1947, has polluted the water of Lake Superior, and as a result the water supplies of a number of communities that have drawn their water supplies from the lake have been affected. I believe it to be reasonable to expect that they be found responsible for the cleanup of Lake Superior and the water supplies of the various Minnesota municipalities that draw their water from the lake.\n\nThis case should serve as an example to future generations for several lessons:\n\n(1) Man has been a wasteful user of natural resources. He has been the most rapacious animal ever to walk the face of the earth. Greater controls must be exercised in the future in selecting the location for large industrial complexes.\n\n(2) There is an absolute necessity that there be established uniform national air and water quality standards, and that those standards be uniformly enforced throughout the nation to prevent industry from blackmailing one state into lowering its standards with the threat it will move elsewhere if the state fails to comply.\n\n(3) A decision other than that made in this case would not penalize Reserve as much as the public in general. If Reserve left the state, how would the lake cleanup begin? With the taxpayers footing the costs? Reserve is paying a heavy price for its past practices. It is being compelled to spend hundreds of millions of dollars for tailings disposal and to cease the use of Lake Superior as a dumping area. It can be forced to pay damages for any violation of its permits. It has had to accept a site originally strongly opposed by it and has had conditions imposed on its use of Mile Post 7 which are very stringent and will be constantly monitored. The permit is for an initial 5-year period only.\n\nThis is the fourth time in the past 5 years that the Reserve problem has been before this court: First in 1972, Reserve Mining Co. v. Minnesota PCA, 294 Minn. 300, 200 N.W.2d 142(1974); then in the early fall of 1976, over the question of a change of venue; and again later in the year, over the scope of review to be exercised by the trial court. This court has been briefed on the facts in dispute and on the issues raised by all appeals since the initial stages of the appeal from the administrative agencies in the summer of 1976. Due to the time limitations decreed in Federal orders, a large portion of the physical resources of this court has been diverted from our regular calendar to this case for a period of over 9 months so that we would be fully cognizant of all facets of the case prior to oral argument held on April 7 and be able to make an early decision. This court has done all that it can to apply law and reason to find a solution to this long drawn out and acrimonious dispute. In the clouds of smoke generated by all of the litigation, it appears at times that many have forgotten that the objective of getting Reserve out of Lake Superior onto a suitable on-land disposal site is within reach. I believe this decision is consistent with that objective.\n\n\u003cspan class=\"fn\"\u003e1. The Honorable J. Jerome Plunkett, a judge of the district court, sat as a member of this court in hearing the case pursuant to Minn. Const. Art. 6, and Minn.St. 2.724, subd. 2. The Chief Justice, Robert J. Sheran, took no part.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. By February 7, 1977, each member of the court had been furnished a copy of the trial briefs and the findings of the hearing officer and the trial court. In addition, the court was provided with copies of the transcripts of testimony taken at both hearings. All of the supplementary briefs, except reply briefs, were in the hands of the court by March 15, 1977. At the request of the parties, the case was advanced on the calendar for argument and briefing schedules were shortened. Five hours were devoted to oral argument at which ten lawyers made presentations. Because of the length of time which had been available to the court for consideration of the issues and the fact that the court was unanimous in reaching its decision, the result was announced by court order on the day following oral argument to permit the parties to deal with the Federal court deadline of July 7, 1977, when the use of Lake Superior for disposal of tailings was to terminate. On May 26, 1977 the Federal court extended the termination date to April 15, 1980.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Attached to the order of October 11, 1974, is a vigorous dissent by Mr. Justice Douglas.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In an opinion filed January 6, 1976, the trial judge was replaced by the court of appeals. Reserve Mining Co. v. Lord, 529 F.2d 181, 188 (8 Cir. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. These concerns are not entirely without support in the record. Judge Edward J. Devitt imposed a penalty of $200,000 against Reserve Mining for \"bad faith conduct\" in failing to respond \"truthfully and fully\" to interrogatories in the Federal court action against Reserve, and withholding information pertinent to alternative methods of disposal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. D. R. Casagrande, a DNR and PCA consultant, in a letter to a PCA staff engineer dated July 7, 1976, stated, \" * * * the redesigned dams are considerably less safe than the designs we investigated, it is utter nonsense to even speculate on the consequences of a failure because these dams would not fail.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. A dam consultant for Reserve, Earle Klohn, stated that with some modifications in design the Mile Post 7 basin could be made to hold tailings for 60 years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. A \"fiber\" is defined as any particle having a length-to-width ratio of 3 to 1. \"Amphibole\" denotes the mineral family made up by silicates of calcium and magnesium and, usually, one or more other metals (such as iron or manganese). Cummingtonite-grunerite is a general name for a \"suite\" of amphibole minerals which are essentially identical except for the relative quantities of iron and magnesium in them. The iron-rich members are sometimes referred to as grunerites, although the word cummingtonite is used to refer to the entire suite. \"Asbestos\" is a generic term for a number of hydrated silicates that, when crushed or processed, separate into flexible fibers made up of fibrils. The serpentine mineral, chrysotile and the amphiboles, actinolite, amosite, anthophyllite, crocidolite, and tremolite are all used commercially as asbestos.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Pertinent portions of those regulations are set forth in the appendix.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Dr. Arnold Brown is chairman of the Department of Pathology and Anatomy at the Mayo Clinic of Rochester, Minnesota. He served the court both in the capacity of a technical advisor and that of an impartial witness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Dr. Irving Selikoff is director of the Environmental Sciences Laboratory of Mt. Sinai School of Medicine. He is a nationally recognized authority in asbestos-induced disease and occupational diseases generally.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Federal court standard which specifies levels found at St. Paul has never been established with precision because it is conceded that no accurate tests are yet available, notwithstanding the agencies' claim of a low figure of 7,000 fibers per cubic meter at St. Paul and Reserve's reliance on a high figure of 30,000 fibers. It is of some significance that under the Occupational Safety and Health Act the Secretary of Labor has established as a permissible occupational exposure 5.0 fibers per cubic centimeter compared to a reading of .0626 at Silver Bay. Even assuming the ninefold margin of error accepted by Dr. William Taylor of the Mayo Clinic in his Federal court testimony, the Federal government's own occupational standard of 5.0 fibers per cc. is almost 10 times higher than the .0626 fibers per cc. at Silver Bay, which the Federal court has ordered reduced to a figure which the parties estimate to be between .007 and .03 fibers per cubic centimeter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The cases and statutes we have cited and discussed in dealing with dam safety, (supra) , apply with equal force to the resolution of the air quality issue. We do not find it necessary to cite again those authorities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Although it is not clear in the record how much of Dr. Nelson's land will actually be taken or damaged, he stands to lose many of the benefits of an isolated lakeshore retreat which he and his family have developed and enjoyed over a period of some 20 years. It may be appropriate to observe that we are not insensitive to the problems which confront him by construction of the basin.\u003c/span\u003e\n\n",
    "body_length": 160650,
    "citedas": [
      "256 N.W.2d 808"
    ],
    "attorneys": "Warren Spannaus, Atty.Gen., James M. Schoessler, Sp.Asst.Atty.Gen., St. Paul, Morris M. Sherman and Edward Moersfelder, Minneapolis, for Herbst, et al. Warren Spannaus, Atty.Gen., Richard Allyn, Sol.Gen., St. Paul, Eldon G. Kaul, Asst.Atty.Gen., Alan R. Mitchell and John-Mark Stensvaag, Sp.Asst.Attys.Gen., Roseville, for Mn.Poll. Control, etc. Dayton, Herman \u0026 Graham, Minneapolis, for Save Lake Superior Assoc. \u0026 Sierra Club. Elliot C. Rothenberg, Minneapolis, for Mn.Pub.Int. Group, et al. O. C. Adamson, II, Minneapolis, Edward T. Fride, Duluth, Maclay R. Hyde, William T. Egan, G. Alan Cunningham, Minneapolis, Wayne G. Johnson, Silver Bay, John G. Engberg, Minneapolis, for respondents. Gray, Plant, Mooty, Mooty \u0026 Bennett and Curtis D. Forslund, Minneapolis, amicus curiae for Rodney B. Nelson, for United States, Peter R. Taft, Asst.Atty.Gen., Edmund B. Clark, Alfred T. Ghiorzi, and John E. Varnum, Dept. of Justice, Washington, D.c., G. William Frick, Gen. Counsel, Pamela P. Quinn, Atty., Environmental Protection Agency, Washington, D.c., amicus curiae.",
    "category": [
      "251"
    ],
    "judges": "Considered and decided by the court en banc. Mr. Chief Justice Sheran took no part in the consideration or decision of this case.",
    "citation_count": 333
  }
}
