{
  "id": "goJQPmYBTlTomsSBEbS8",
  "document": {
    "title": "Greenville Women's Clinic v. Bryant",
    "full_title": "GREENVILLE WOMEN'S CLINIC; CHARLESTON WOMEN'S MEDICAL CLINIC, INCORPORATED; WILLIAM LYNN, MD, ON BEHALF OF THEMSELVES AND THEIR PATIENTS SEEKING ABORTIONS V. DOUGLAS E. BRYANT, IN HIS OFFICIAL CAPACITY AS COMMISSIONER OF SOUTH CAROLINA DEPARTMENT OF HEALTH AND ENVIRONMENTAL CONTROL; CHARLES M. CONDON, IN HIS OFFICIAL CAPACITY AS ATTORNEY GENERAL OF THE STATE OF SOUTH CAROLINA GOVERNOR OF SOUTH CAROLINA . GREENVILLE WOMEN'S CLINIC; CHARLESTON WOMEN'S MEDICAL CLINIC, INCORPORATED; WILLIAM LYNN, MD, ON BEHALF OF THEMSELVES AND THEIR PATIENTS SEEKING ABORTIONS V. GOVERNOR OF SOUTH CAROLINA AND DOUGLAS E. BRYANT, IN HIS OFFICIAL CAPACITY AS COMMISSIONER OF SOUTH CAROLINA DEPARTMENT OF HEALTH AND ENVIRONMENTAL CONTROL; CHARLES M. CONDON, IN HIS OFFICIAL CAPACITY AS ATTORNEY GENERAL OF THE STATE OF SOUTH CAROLINA . GREENVILLE WOMEN'S CLINIC; CHARLESTON WOMEN'S MEDICAL CLINIC, INCORPORATED; WILLIAM LYNN, MD, ON BEHALF OF THEMSELVES AND THEIR PATIENTS SEEKING ABORTIONS V. DOUGLAS E. BRYANT, IN HIS OFFICIAL CAPACITY AS COMMISSIONER OF SOUTH CAROLINA DEPARTMENT OF HEALTH AND ENVIRONMENTAL CONTROL; CHARLES M. CONDON, IN HIS OFFICIAL CAPACITY AS ATTORNEY GENERAL OF THE STATE OF SOUTH CAROLINA GOVERNOR OF SOUTH CAROLINA .",
    "jurisdiction": "Fourth Circuit",
    "date": "2000-08-15T00:00:00.000Z",
    "docket": "No. 99-1319, No. 99-1710 No. 99-1725",
    "body": "PUBLISHED\n\nArgued: January 27, 2000\n\nReversed by published opinion. Judge Niemeyer wrote the opinion, in which Judge Smalkin joined. Senior Judge Hamilton wrote a dissenting opinion.\n\nOPINION\n\nThis case presents the important question of whether South Carolina's regulation establishing standards for licensing abortion clinics -Regulation 61-12 of the South Carolina Department of Health and Environmental Control, S.C. Code Ann. Regs. 61-12 (eff. June 28, 1996) -- violates the Due Process Clause and the Equal Protection Clause of the Fourteenth Amendment by placing an undue burden on women's decisions to seek abortions and by distinguishing between clinics that perform a specified number of abortions and those that do not. Two abortion clinics and an abortion provider filed this action, on behalf of themselves and their patients, facially challenging the constitutionality of the Regulation. The district court concluded that the Regulation violated both of these clauses of the Fourteenth Amendment, declared the Regulation \"invalid,\" and enjoined its enforcement.\n\nAs amplified herein, we reverse this decision and uphold the constitutionality of Regulation 61-12 because (1) the Regulation serves a valid state interest and is little more than a codification of national medical- and abortion-association recommendations designed to ensure the health and appropriate care of women seeking abortions; (2) the Regulation does not \"strike at the [abortion] right itself,\" Planned Parenthood v. Casey, 505 U.S. 833, 874 (1992) (joint opinion of O'Connor, Kennedy, and Souter, JJ.); (3) the increased costs of abortions caused by implementation of the Regulation, while speculative, are even yet modest and have not been shown to burden the ability of a woman to make the decision to have an abortion; and (4) abortion clinics may rationally be regulated as a class while other clinics or medical practices are not.\n\nI.\n\nPrior to 1995, South Carolina regulated clinics at which secondtrimester abortions were performed. See S.C. Code Ann. §§ 44-41-20(b), -70(b) (Law. Co-op. 1985); S.C. Code Ann. Regs. 61-12 (1982) (entitled \"Minimum Standards for Licensing Clinics Performing Abortions\"). The regulation under this earlier statute contained chapters covering abortion-clinic management, laboratory facilities and procedures, medical records and reports, clinic design and construction, and patient-care areas. See S.C. Code Ann. Regs. 61-12 (1982).\n\nIn 1995, the South Carolina legislature amended its statute to require any \"facility in which any second trimester or five or more first trimester abortions are performed in a month\" to be licensed as an abortion clinic by the Department of Health and Environmental Control (\"DHEC\"). S.C. Code Ann. §§ 44-41-10(C), -75(A) (West Supp. 1999). In addition, it directed the DHEC to promulgate regulations concerning sanitation, housekeeping, maintenance, staff qualifications, emergency equipment and procedures to provide emergency care, medical records and reports, laboratory, procedure and recovery rooms, physical plant, quality assurance, infection control, and information on and access to patient follow-up care necessary to carry out the purposes of this section. Id. § 44-41-75(B).\n\nThe DHEC responded by promulgating Regulation 61-12, effective June 28, 1996. See S.C. Code Ann. Regs. 61-12 (West Supp. 1998) (hereinafter \"Regulation 61-12\" or \"the Regulation\").\n\nIn developing Regulation 61-12, the DHEC built on the pre-existing version of its Regulation 61-12, as well as other DHEC regulations covering different types of healthcare facilities. The DHEC also consulted various medical standards and guidelines issued by medicalcare organizations, including groups dedicated to protecting abortion rights. These sources included: (1) Standards for ObstetricGynecologic Services (7th ed. 1995), issued by the American College of Obstetricians and Gynecologists (\"the ACOG\"); (2) Manual of Medical Standards and Guidelines (1994), issued by Planned Parenthood, which the manual describes as encouraging affiliates \"to develop abortion services if such a need exists in the community and resources are available for conducting a safe and effective program\"; and (3) Standards for Abortion Care (1988), a set of standards, the \"purpose\" of which is \"to promote high quality care for all women seeking abortions\" and \"serve as a useful resource for local and state agencies charged with safeguarding the public's health,\" issued by the National Abortion Federation, which the standards describe as \"an organization specifically committed to the provision and accessibility of high quality abortion services for all women.\" The DHEC also reviewed abortion regulations from other states and referenced the Guidelines for Construction and Equipment of Hospital and Medical Facilities (1992-93), a document issued by the American Institute of Architects, which purports to provide \"model standards\" for \"constructing and equipping new medical facility projects\" and for \"renovation or replacement work.\"\n\nIn addition to consulting established sources, the DHEC conducted public hearings, during which it received suggestions from the abortion clinics that are parties to this case, incorporating some of them in new Regulation 61-12. The new Regulation, entitled \"Standards for Licensing Abortion Clinics,\" S.C. Code Ann. Regs. 61-12 (West Supp. 1998), contains ten parts which address a range of medical, safety, and administrative requirements:\n\nPart I, \"Definitions and Requirements for Licensure,\" defines an abortion clinic as \"[a]ny facility, other than a hospital . . . in which any second trimester or five or more first-trimester abortions per month are performed.\" Id. § 101(B). It makes the operation of an abortion clinic without a license illegal. See id. § 102(A). It provides for periodic inspections, including at least one annually, and grants inspectors the authority to copy all documents required in the course of inspections. See id. § 102(F). And it authorizes sanctions for noncompliance with the Regulation in the form of monetary penalties, as well as denial, suspension, or revocation of the license. See id. § 103.\n\nPart II, \"Administration and Management,\" requires every facility to formulate and review annually its policies and procedures. See id. § 201(B). It requires that each clinic maintain various administrative documents on file. See id. § 203. Every employee is required to complete in-service training and undergo a tuberculin skin test, see id. § 204(B), (F), and any employee diagnosed with a contagious disease is prohibited from performing certain work at the clinic, see id. § 204(D). It requires that every abortion be performed by a physician who is licensed by the State and requires that every clinic be affiliated with a physician who has admitting privileges at a local hospital. See id. § 205(C). A registered nurse must supervise all nursing care, and an ultrasound test may be conducted only by a person who has completed a course in ultrasonography. See id.§ 205(D), (F). Each facility must display a copy of a statement specifying patients' rights, including the rights to dignity, privacy, and safety. See id. § 209.\n\nPart III, \"Patient Care,\" provides that each facility must have certain written patient-care policies and procedures to ensure professional and safe care and that no clinic may serve patients whose needs exceed the clinic's resources and capabilities. See id. § 301. Specified drugs and tools must be present, see id.§ 303, and laboratory services must be available, either on site or through an arrangement with a laboratory, see id. § 304(A). A number of laboratory tests must be performed, including a urinalysis and testing for sexually transmitted diseases. See id. § 304(B), (C), (D). Staff at abortion clinics must have admitting privileges at a local hospital or have documented arrangements for emergency transfer to a hospital. See id. § 305(A). And facilities that perform abortions beyond the 14th week of pregnancy must meet additional requirements. See id . § 309.\n\nPart IV, \"Medical Records and Reports,\" requires that every abortion clinic maintain and retain for ten years specified categories of information and requires that the documents be treated as confidential. See id. § 401, 402. Abortion clinics must report to the DHEC all abortions performed, any fetal deaths meeting certain criteria, and any accidents or incidents. See id. § 403.\n\nPart V, \"Functional Safety and Maintenance,\" requires written safety policies and procedures and a disaster-preparedness plan and sets standards for maintenance, requiring that facilities be kept in good repair. See id. §§ 501-503.\n\nPart VI, \"Infection Control and Sanitation,\" requires certain daily sterilization procedures, see id. § 602, mandates proper laundering of linen and washable goods, see id. § 603, and requires the facility to be kept neat, clean, and free of insects, see id . § 604. Garbage and waste are required to be disposed of in a manner designed to prevent transmission of disease. See id. § 605. Outside areas must be maintained so as to minimize fire hazards, havens for insects and rodents, and unsafe conditions from accumulations of water, ice, and snow. See id. § 606.\n\nPart VII, \"Fire Protection and Prevention,\" requires clinics to have particular fire-fighting equipment and an evacuation plan and to conduct fire drills and inspections. See id.§ 701.\n\nPart VIII, \"Design and Construction,\" requires that each abortion clinic have facilities for the care of each patient that meet applicable design and construction laws. See id. §§ 801, 802. New buildings or additions must satisfy building code requirements. See id. §§ 803, 804. Each facility must provide an adequate number of examination or procedure rooms, and each procedure room must have a suitable table and other equipment. See id. § 807(A), (B). Recovery areas must meet particular requirements and there must be a room for temporary storage of waste, as well as an area to accommodate sterilization procedures. See id. § 807(E), (F).\n\nPart IX, \"Prerequisites for Initial Licensure,\" sets forth the necessary documentation for obtaining a license from the DHEC and the certification that must be acquired for various physical items.\n\nFinally, Part X states that conditions which arise and have not previously been addressed in the Regulation must be managed in accordance with the best practices as interpreted by the DHEC.\n\nOn June 27, 1996, one day before Regulation 61-12 was to take effect, the Greenville Women's Clinic, the Charleston Women's Medical Clinic, Inc., and Dr. William Lynn (collectively, the \"abortion clinics\") brought this action seeking a declaratory judgment that Regulation 61-12 is unconstitutional on its face because, among other things, it would violate their due process and equal protection rights, as well as those of their patients. They also sought an order enjoining enforcement of the Regulation and requesting attorneys fees and costs pursuant to 42 U.S.C. § 1988. The district court issued a temporary restraining order on June 19, 1996, which, by consent of the parties, was converted to a preliminary injunction. Finally, on February 5, 1999, the district court declared the Regulation invalid in its entirety. The Greenville Women's Clinic, which has operated in Greenville, South Carolina, since 1978, has two licensed physicians who perform a combined average of more than 2,700 abortions per year. The physicians at the clinic testified that even prior to the promulgation of Regulation 61-12, their clinic operated in substantial compliance with its requirements. They estimated that the additional cost of full compliance would be $22.68 per abortion. The district court found that, prior to the Regulation's promulgation, the cost of an abortion was between $325 and $480 if the abortion was not complicated and was performed during the first trimester. The court found that the additional cost of full compliance for Greenville Women's Clinic would be in the range of $23-$32 per abortion.\n\nThe Charleston Women's Medical Clinic, Inc., which has operated in Charleston, South Carolina, for about 28 years, performs, on average, more than 2,400 abortions per year. That clinic is operated by a licensed physician and a licensed practical nurse. The district court found that compliance with Regulation 61-12 by the Charleston Women's Medical Clinic would cost between $36 and $75 per abortion.\n\nDr. William Lynn, who is a licensed physician, has conducted his practice since 1980 from two locations -- in Beaufort, South Carolina (approximately 70 miles southwest of Charleston) and in Greenville, South Carolina. Dr. Lynn performs, on average, more than 900 abortions each year at the two sites. He testified that Regulation 61-12 would require him to undertake costly modifications to his Beaufort facility, and the district court found that his cost per abortion would increase by an amount between $116 and $368. The district court also concluded that the increased costs for Dr. Lynn's Beaufort facility would \"likely force [Dr. Lynn] to cease performing abortions in his Beaufort office.\" Greenville Women's Clinic v. Bryant, 66 F. Supp. 2d 691, 717 (D.S.C. 1999).\n\nThere was no direct evidence about how many other abortion clinics in South Carolina would be affected by the Regulation or about the extent of any such impact. No woman who wanted an abortion or who claimed to be threatened by Regulation 61-12 was made a party to the action or testified before the district court, and no survey evidence of women in South Carolina was presented to demonstrate the likely effect that Regulation 61-12 would have on their decisions to obtain an abortion.\n\nFollowing a bench trial, the district court concluded that the Regulation \"serve[s] no legitimate state interest . . . [g]iven the lack of evidence that the regulation will operate to improve the health care currently being received in this state.\" Greenville Women's Clinic, 66 F. Supp. 2d at 735. It continued that even if it did serve a valid purpose, the Regulation \"places a substantial obstacle in the path of women seeking first trimester abortions and, thereby, imposes an undue burden on the woman's fundamental right to choose to undergo the procedure.\" Id. The undue burden, the court found, resulted from increased costs, delays in the ability to obtain abortions, decreased availability of abortion clinics, increased distances to travel to clinics, unlimited inspections of clinics, and compromises to patient confidentiality. See id. at 735-36. Accordingly, the court held that Regulation 61-12 violated women's Fourteenth Amendment due process rights. See id. at 736. The district court also ruled that the Regulation violated the abortion clinics' equal protection rights under either a strictscrutiny or a rational-basis standard of review because the Regulation \"singles out physicians and clinics where abortions are performed regularly . . . and imposes upon them requirements which are not imposed upon comparable procedures and not even upon all physicians who perform first trimester abortions.\" Id. at 742. Finally, the district court, acting under 42 U.S.C. § 1988, awarded the abortion clinics attorneys fees and costs in the amount of $324,040.\n\nSouth Carolina appeals from the district court's judgment declaring Regulation 61-12 unconstitutional and enjoining its enforcement and from the award of attorneys fees.\n\nII.\n\nSouth Carolina contends first that the district court's due process analysis is supported by neither the record nor the law. It maintains that Regulation 61-12, which is based on national healthcare standards for abortions, is rationally related to protecting the health of women seeking abortions, \"even if such regulations might have the incidental [e]ffect of causing the price to obtain an abortion to increase.\" South Carolina notes that the abortion clinics and their experts agree as to the appropriateness of the national standards incorporated in the Regulation, and the Greenville Women's Clinic, the largest of the plaintiffs, admitted that it was already in substantial compliance with virtually all of the Regulation's requirements. The State argues that to the extent any clinic does not comply with Regulation 61-12, compliance will improve the quality of medical care for women seeking abortions. South Carolina also argues that the evidence does not support the conclusion that the increased cost of an abortion would impose a substantial obstacle for women in South Carolina seeking abortions.\n\nThe abortion clinics respond that the Regulation does not further a valid state interest because (1) it creates costly and unnecessary requirements which are more likely to harm than to protect the health of abortion patients and (2) the DHEC's drafting process indicates that the DHEC was not concerned with protecting the health of such women. The clinics acknowledge that the DHEC may have relied on standards and guidelines of national medical groups, but they argue that these are just that -- standards and guidelines -- and are neither designed to serve as mandatory directives nor appropriate for that purpose. Finally, the abortion clinics contend that, in any event, Regulation 61-12 imposes an undue burden on women seeking abortions in South Carolina because it would increase the price of abortions and force Dr. Lynn to cease performing abortions at his Beaufort facility.\n\nThe abortion clinics undertook a heavy burden in bringing a facial challenge to the constitutionality of Regulation 61-12. Because of the nature of facial challenges, they could not present the district court with a concrete factual circumstance -- a particular case or controversy -- to which to apply the Regulation. The clinics therefore must argue about the Regulation's impact generally and prospectively, the type of action typically undertaken by legislatures, not courts. Because a trial on a facial challenge can focus only on arbitrarily selected hypotheticals to which the Regulation might apply, a court is required to speculate about the Regulation's overall effect.\n\nIn this case, for example, the district court was not given -- and could not be given -- any data from South Carolina patients about the impact that particular costs had on their decision to seek an abortion. It was given only estimates by \"experts.\" Accordingly, the impact of the Regulation in any given situation could only have been anticipated. Such anticipation, however, is generally not an appropriate basis on which to strike down statutes and regulations. See Bowen v. Kendrick, 487 U.S. 589, 612-13 (1988) (noting that \"[i]t has not been the Court's practice\" to strike down a statute on a facial challenge \"in anticipation\" of particular circumstances, even if the circumstances would amount to a \"likelihood\").\n\nBecause of the conceptual difficulties that attend to ruling on the constitutionality of a statute in the abstract, the Supreme Court has held that \"[a] facial challenge to a legislative Act is, of course, the most difficult challenge to mount successfully, since the challenger must establish that no set of circumstances exists under which the Act would be valid.\" United States v. Salerno, 481 U.S. 739, 745 (1987); see also Rust v. Sullivan, 500 U.S. 173, 183 (1991) (a facial challenge will fail if an act \"can be construed in such a manner that [it] can be applied to a set of individuals without infringing upon constitutionally protected rights\").\n\nIn Planned Parenthood v. Casey, 505 U.S. 833 (1992), the Supreme Court ruled that a statute regulating abortion was invalid because \"in a large fraction of cases in which [it] is relevant, it will operate as a substantial obstacle to a woman's choice to undergo an abortion.\" Id. at 895 (majority opinion) (emphasis added). Whether this holding displaced the Salerno standard for facial challenges in abortion cases has been the subject of considerable debate among the circuits. Compare, e.g., Planned Parenthood v. Lawall, 180 F.3d 1022, 1025-27 (9th Cir. 1999) (applying Casey standard to facial challenge to abortion restriction); Women's Med. Prof'l Corp. v. Voinovich, 130 F.3d 187, 193-96 (6th Cir. 1997) (same); Jane L. v. Bangerter, 102 F.3d 1112, 1116 (10th Cir. 1996) (same); Planned Parenthood v. Miller, 63 F.3d 1452, 1456-58 (8th Cir. 1995) (same); Casey v. Planned Parenthood, 14 F.3d 848, 863 n.21 (3d Cir. 1994) (same), with Barnes v. Moore, 970 F.2d 12, 14 n.2 (5th Cir. 1992) (per curiam) (\"we do not interpret Casey as having overruled, sub silentio, longstanding Supreme Court precedent governing challenges to the facial constitutionality of statutes\"); see also Okpalobi v. Foster, 190 F.3d 337, 354 (5th Cir. 1999) (noting that subsequent Fifth Circuit decisions were arguably inconsistent with application of the Salerno standard). This circuit, sitting en banc, acknowledged the uncertainty as to which standard applies but declined to resolve the issue. See Planned Parenthood v. Camblos, 155 F.3d 352, 358-59 \u0026 n.1 (4th Cir. 1998) (en banc) (\"Because we conclude . . . that the [challenged abortion regulation] is facially constitutional under either the Salerno or the Casey standard, we need not, and do not, decide which of these two standards applies in facial challenges to abortion statutes\"). Previously, a panel of this court had stated its agreement with the Fifth Circuit position in Barnes v. Moore, observing that until the Supreme Court specifically overrules Salerno in the abortion-regulation context, \"this Court is bound to apply the Salerno standard as it has been repeatedly applied in the context of other abortion regulations reviewed by the Supreme Court . . . and in the context of challenges to legislative acts based on other constitutional grounds.\" Manning v. Hunt, 119 F.3d 254, 268 n.4 (4th Cir. 1997) (emphasis added).\n\nWhile we believe that the observation in Manning was part of the court's holding because application of Salerno was necessary to the ruling in that case and not dictum, we add the observation that the logic of the Salerno test is necessary to show deference to legislatures, particularly in light of the limitation imposed by Article III of the Constitution that the judiciary act only in cases and controversies. See U.S. Const. art. III, § 2. As we explain below, when the abortion clinics are confronted with Salerno's requirement that no set of circumstances exists under which Regulation 61-12 would be valid, they fail, if for no other reason, because the impact on the Greenville Women's Clinic is so modest. Even when we apply a less deferential standard than that articulated in Salerno, we nevertheless conclude in this case that the record provides no evidence from which to conclude that Regulation 61-12 would present a \"substantial obstacle\" to \"a large fraction\" of women in South Carolina who might seek an abortion at a clinic subject to Regulation 61-12. Casey, 505 U.S. at 895 (majority opinion).\n\nThe record contains evidence from several abortion providers, only one of which would be adversely affected in any significant way in providing abortion services, Dr. Lynn's Beaufort facility. Moreover, even for women in Beaufort, no evidence suggests that they could not go to the clinic in Charleston, some 70 miles away. Nor are we provided with evidence of the impact that Regulation 61-12 would have on other South Carolina abortion clinics. Thus, inherent in our discussion of the impact that Regulation 61-12 would have on women's abortion rights is the inability to decide a concrete case; we must speculate about the impact on all relevant women to determine, under the Casey standard, whether a large fraction would encounter a substantial obstacle to their choice to seek an abortion, an analysis that the record simply does not permit. Thus, on the abortion clinics' failure to present evidence that would satisfy either of the possible standards, we fall back on the Regulation's presumptive constitutionality.\n\nThe principles of the abortion right itself are now well-established. Beginning in 1973, women were found to have a fundamental right grounded in the Fourteenth Amendment to end a pregnancy by aborting the life of the fetus. See Roe v. Wade, 410 U.S. 113, 153-56 (1973); see also Maher v. Roe, 432 U.S. 464, 474 (1977). The Court in Roe stated that the \"right of privacy . . . is broad enough to encompass a woman's decision whether or not to terminate her pregnancy.\" Roe, 410 U.S. at 153.\n\nFollowing Roe, which recognized that the abortion-decision right was not absolute but subject to some regulation by the states, the Supreme Court decided numerous cases that uncovered difficulties in applying Roe and created widespread confusion. Accordingly, in 1992, the Court in Casey reexamined Roe and restated the applicable principles. In Casey, the Court rejected the trimester framework of Roe and adopted a revised \"undue burden\" standard to apply to challenged abortion regulations. Casey, 505 U.S. at 872-74 (joint opinion of O'Connor, Kennedy, and Souter, JJ.). But it reaffirmed the \"essential holding\" of Roe -- that a woman has a constitutional right to \"choose to have an abortion before viability and to obtain it without undue interference from the State.\" Id. at 846 (majority opinion). The scope of this right, however, is framed by the State's \"legitimate interests from the outset of the pregnancy in protecting the health of the woman and the life of the fetus that may become a child.\" Id.\n\nMost recently, in Stenberg v. Carhart, 530 U.S. ___, No. 99-830 (U.S. June 28, 2000), the Supreme Court reaffirmed the principles articulated in the joint opinion in Casey that: (1) a woman has a constitutional right \"to choose to terminate her pregnancy\" before viability of the fetus; (2) any State law that imposes an\"undue burden\" on the woman's right to choose to terminate her pregnancy before fetal viability is unconstitutional; and (3) a State may regulate postviability abortions \"except where [they are] necessary, in appropriate medical judgment, for the preservation of the life or health of the mother.\" 530 U.S. at ___, No. 99-830, slip op. at 2 (internal quotation marks and citations omitted).\n\nIn preserving the right of a woman to choose to have an abortion, the Court in Casey emphasized that the right is grounded in the liberty protected by the Fourteenth Amendment -- \"[t]he controlling word in the cases before us is `liberty.'\" 505 U.S. at 846 (majority opinion); see also id. at 871 (joint opinion of O'Connor, Kennedy, and Souter, JJ.) (\"The woman's right to terminate her pregnancy before viability is . . . a component of liberty\"). And the liberty so recognized is defined as the right of a woman herself-- not her husband, her parent, her doctor, or others -- to make the decision to have an abortion. Id. at 877 (joint opinion of O'Connor, Kennedy, and Souter, JJ.); see also Stenberg, 530 U.S. at ___, No. 99-830, slip op. at 27. Only when the State unduly burdens the ability of a woman to make the abortion decision \"does the power of the State reach into the heart of the liberty protected by the Due Process Clause.\" Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.).\n\nAccordingly, to the extent that state regulations interfere with the woman's status as the ultimate decisionmaker or try to give the decision to someone other than the woman, the Court has invalidated them. See Casey, 505 U.S. at 887-98 (majority opinion) (striking down provision which required a physician performing an abortion on a married woman to obtain a statement from her indicating that she had notified her husband); Thornburgh v. American College of Obstetricians and Gynecologists, 476 U.S. 747, 767 (1986) (invalidating reporting requirements that \"raise the specter of public exposure and harassment of women who choose to exercise their personal, intensely private, right, with their physician, to end their pregnancy\"); Bellotti v. Baird, 443 U.S. 622, 643 (1979) (plurality opinion) (ruling that \"if the State decides to require a pregnant minor to obtain one or both parents' consent to an abortion, it must also provide an alternative procedure whereby authorization for the abortion can be obtained\" (footnote omitted)); Planned Parenthood v. Danforth, 428 U.S. 52, 74 (1976) (holding that \"the State does not have the constitutional authority to give a third party an absolute, and possibly arbitrary, veto over the decision of the physician and his patient to terminate the patient's pregnancy\").\n\nOn the other hand, state regulations that do not\"reach into the heart\" of the protected liberty do not violate the abortion-decision right. Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.). If a regulation serves a valid purpose -- \"one not designed to strike at the right itself\" -- the fact that it also has \"the incidental effect of making it more difficult or more expensive to procure an abortion cannot be enough to invalidate it.\" Id. One such valid purpose is a State's effort to \"further the health or safety of a woman seeking an abortion.\" Id. at 878. Of course, if such health regulations are unnecessary and have the \"purpose or effect of presenting a substantial obstacle to a woman seeking an abortion,\" they will be found to \"impose an undue burden on the right.\" Id.\n\nIn maintaining the distinction between state regulations that trammel the woman's right to choose to have an abortion-- those that impose an undue burden -- and those that merely have an incidental effect on the woman's decision, the Court has upheld, both before Casey and in Casey, various regulations, the costs and effects of which, while amounting to interference and intrusion, did not reach the core of the protected liberty. See, e.g., Casey, 505 U.S. at 886 (majority opinion) (upholding 24-hour waiting period although it would require a woman to make two visits to a doctor and increase the woman's exposure to abortion protestors); id . at 900-01 (upholding a recordkeeping and reporting provision that would increase the cost of some abortions); Webster v. Reproductive Health Services, 492 U.S. 490, 530 (1989) (O'Connor, J., concurring) (regulation requiring medical tests is constitutional where\"the cost of examinations and tests that could usefully and prudently be performed . . . would only marginally, if at all, increase the cost of an abortion\"); Planned Parenthood v. Ashcroft, 462 U.S. 476, 490, 505 (1983) (upholding requirement for a pathology report that would impose a \"small cost\"). Only when the increased cost of abortion is prohibitive, essentially depriving women of the choice to have an abortion, has the Court invalidated regulations because they impose financial burdens. See Akron v. Akron Ctr. for Reproductive Health, 462 U.S. 416, 434-39 (1983) (holding unconstitutional a hospitalization requirement for certain abortions that more than doubled the cost of such abortions).\n\nIn the case before us, the South Carolina legislature directed the DHEC to promulgate regulations to address medical and safety aspects of providing abortions, as well as the recordkeeping and administrative practices of abortion clinics. As directed, the DHEC drafted Regulation 61-12, building on the existing regulation, which applied to second-trimester abortion clinics, and consulting abortion regulations from other states. The DHEC also obtained and incorporated guidelines for outpatient facilities published by the American Institute of Architects, as well as standards and guidelines issued by the ACOG, Planned Parenthood, and the National Abortion Federation. Indeed, Regulation 61-12 largely tracks these medical standards and guidelines.\n\nFor example, the National Abortion Federation requires that all medical staff at member facilities be proficient in CPR, and the ACOG recommends specific plans for training personnel in CPR; Regulation 61-12 requires that all professional staff members be certified to perform CPR. See S.C. Code Ann. Regs. 61-12, § 204(C). The National Abortion Federation recommends that nursing-care providers receive training and orientation; the Regulation requires that each facility have and execute a written orientation program. See id. § 203(E). The ACOG recommends that physicians who perform abortions in their offices provide for prompt emergency treatment or hospitalization; the Regulation requires that each facility have an agreement with a doctor who has hospital admitting privileges. See id. § 205(C)(2). The National Abortion Federation recommends that a registered nurse or physician be responsible for a variety of components of the abortion procedure and requires that a registered nurse monitor recovering patients if general anesthesia has been used; the Regulation requires that a licensed registered nurse supervise nursing care. See id. § 205(D)(1). The National Abortion Federation requires that emergency drugs be kept on hand to treat seven specific conditions; the Regulation requires the availability of drugs to treat the exact same conditions. See id. § 303(A)(1). The National Abortion Federation states that testing for gonorrhea and chlamydia may be routinely provided; the Regulation requires testing for gonorrhea and chlamydia prior to each abortion procedure. See id. § 304(C). The ACOG and the National Abortion Federation recommend that counseling be offered; the Regulation requires that arrangements be made for consultation. See id. § 307. The ACOG recommends retaining accurate medical records for each patient for the time period required by law; the Regulation requires that such records be retained for ten years. See id. § 401. The ACOG recommends specific plans and procedures for health and safety; the Regulation requires written policies and procedures for safety. See id. § 501. The ACOG recommends that the examining room contain facilities for sterilization; the Regulation sets out specific sterilization procedures. See id. § 602. The ACOG recommends procedures for disposing of contaminated waste supplies; the Regulation requires specific treatment of refuse and waste disposal. See id. § 605. The ACOG recommends procedures for proper use of fire equipment, and the National Abortion Federation recommends regular emergency drills; the Regulation requires firefighting equipment, alarm systems, and fire drills. See id. § 701. Planned Parenthood requires procedure rooms large enough to accommodate a stretcher or gurney, post-procedure recovery rooms, and dressing rooms, and the National Abortion Federation requires that the operating table be located in a room of adequate dimensions, illumination, and ventilation; the Regulation requires particular physical facilities at abortion clinics, such as procedure rooms with doors wide enough to accommodate a stretcher or wheelchair, recovery rooms, storage rooms, and a dressing room. See id.§ 807. Planned Parenthood requires a battery-operated light source for emergency backup; the Regulation requires emergency power and lighting. See id. § 809.\n\nThe national standards promulgated by such medical groups as the ACOG, the National Abortion Federation, and Planned Parenthood indisputably aim to protect the health of women seeking abortions and one states explicitly that it is intended to \"serve as a useful resource for local and state agencies charged with safeguarding the public's health.\" National Abortion Federation, Standards for Abortion Care (1998). In relying upon such standards, the DHEC was appropriately focused on ensuring that abortion is \"performed by medically competent personnel under conditions insuring maximum safety for the woman.\" Akron, 462 U.S. at 430 n.12 (quoting Connecticut v. Menillo, 423 U.S. 9, 11 (1975) (per curiam)). A witness for the abortion clinics testified that guidelines from organizations such as the ACOG and the National Abortion Federation \"provide our best current assessment as to what is appropriate care.\" The witness explained that the ACOG has \"only one interest,\" the healthcare of women, and if a doctor \"deviate[s] from [the ACOG guidelines and standards] without a documented reason for [the] deviation, in a court of law it will be construed as malpractice.\" The witness recognized that the ACOG's guidelines \"are commonly used and relied upon by obstetricians and gynecologists nationwide to determine the standard and the appropriate level of care for their patients,\" and that the National Abortion Federation standards are \"a distillate of extensive experience by highly skilled and experienced [abortion] providers.\"\n\nThis testimony on behalf of the abortion clinics should itself be sufficient to establish that Regulation 61-12 was reasonably designed to promote South Carolina's valid interest in women's health. But the DHEC was also entitled to draw support for its use of the standards from the observations made by the Supreme Court in abortion cases that the ACOG and National Abortion Federation standards indicate the \"general medical utility\" of a particular procedure. Ashcroft, 462 U.S. at 487 n.10; see also Akron, 462 U.S. at 435-37 (relying on changes in the ACOG standards, among others, to demonstrate lack of justification for hospitalization requirement); Simopoulos v. Virginia, 462 U.S. 506, 517 (1983) (upholding abortion regulations after noting that \"[o]n their face, the . . . regulations appear to be generally compatible with accepted medical standards governing outpatient second-trimester abortions\" (citing publications from groups including the ACOG)); see also Stenberg, 530 U.S. at ___, No. 99-830, slip op. at 18 (discussing the ACOG's \"medical opinion\" in analyzing the appropriateness of \"[m]edical treatments and procedures\"). Regulation 61-12 thus indisputably represents a reasonable attempt to further the health of abortion patients in South Carolina.\n\nThe abortion clinics argue that Regulation 61-12 exceeds and, in some cases, conflicts with the recommendations of these national groups. Further, they assert that the recommendations are just that -recommendations -- and that requiring clinics to follow them will not necessarily safeguard or improve the health of abortion patients. The abortion clinics also note that some officials of these medical groups do not support mandatory compliance with the recommendations.\n\nWhile Regulation 61-12 does in some instances exceed the standards of the ACOG, Planned Parenthood, and the National Abortion Federation, the bulk of the provisions comport with those guidelines, and any deviations are not substantial. Any contrary claim is belied by the abortion clinics' own testimony in this case. One of the doctors who owns the Greenville Women's Clinic, when asked whether Regulation 61-12 was \"consistent with what you would consider to be the appropriate standards for abortion practice,\" responded that \"[m]ost parts of the regulation we already comply with and do, but because it's good medical practice.\" Another abortion-clinic doctor testified that he complied with a number of the Regulation's provisions because \"any doctor that's licensed by the State of South Carolina and any doctor that's completed an OB/GYN residency successfully would do that in the normal operation.\" The fact that not all healthcare professionals agree with the adoption of each specific aspect of the Regulation is immaterial in light of South Carolina's \"considerable discretion\" in adopting licensing requirements aimed at the health of women seeking abortions. Simopoulos , 462 U.S. at 516 (\"In view of its interest in protecting the health of its citizens, the State necessarily has considerable discretion in determining standards for the licensing of medical facilities\").\n\nMoreover, contrary to the district court's suggestion, see Greenville Women's Clinic, 66 F. Supp. 2d at 732, there is no requirement that a state refrain from regulating abortion facilities until a public-health problem manifests itself. In Danforth, for example, the Court upheld health measures that \"may be helpful\" and\"can be useful.\" 428 U.S. at 80, 81. It cannot be gainsaid that a regulation incorporating the recommendations of the leading institutional authorities in the field of abortion provision aims to \"further the health or safety of a woman seeking an abortion.\" Casey, 505 U.S. at 878 (joint opinion of O'Connor, Kennedy, and Souter, JJ.). Because South Carolina's Regulation 61-12 \"appear[s] to be generally compatible with accepted medical standards governing . . . abortions,\" Simopoulos, 462 U.S. at 517, we cannot reasonably conclude that the Regulation was not directed at promoting South Carolina's valid interest in a woman's health.\n\nEven though Regulation 61-12 is directed at the valid objective of safeguarding the health of women seeking abortions, it may still be invalid if, in serving this objective, it unduly burdens \"a woman's ability to make th[e] decision\" to terminate a pregnancy. Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.). Thus, having determined that Regulation 61-12 serves a valid purpose, we must still consider whether the cost imposed by the lawfully directed regulation presents \"a substantial obstacle to a woman seeking an abortion.\" Id. at 878. But a regulation is not rendered invalid simply because it makes it \"more difficult or more expensive to procure an abortion,\" id. at 874, as \"[a]ll abortion regulations interfere to some degree with a woman's ability to decide whether to terminate her pregnancy,\" id. at 875. In making this undue-burden assessment, the Supreme Court has repeatedly emphasized that the focus must be aimed more directly at the ability to make a decision to have an abortion as distinct from the financial cost of procuring an abortion.\n\nThe district court found that enforcement of Regulation 61-12 would increase the cost of obtaining an abortion in varying amounts, depending on the abortion clinic. The Greenville Women's Clinic, which purports to follow national medical standards for providing abortions, indicated that it substantially complies with the requirements of Regulation 61-12 and that full compliance would cost about $23. At the Charleston Women's Medical Clinic, the cost increase would be between $36 and $75. On the other hand, Dr. Lynn, who operates abortion clinics in Beaufort and Greenville, testified that he would have to make so many changes to his Beaufort facility that compliance would require him to cease providing abortions at that facility.\n\nThe record does not contain information indicating the manner in which Regulation 61-12 would actually affect any South Carolina woman's decision to seek an abortion. This is not due to a failure of proof but a problem inherent in conducting a facial challenge to the Regulation. The most that the parties could do in a preenforcement case is to speculate about the Regulation's impact. While they can reasonably forecast some cost increases, they can only surmise how any cost increase would affect a particular woman's decision to seek an abortion.\n\nEven accepting the speculative figures relied upon by the district court, we believe the court erred in concluding that at the two major clinics in this case -- the Greenville Women's Clinic and the Charleston Women's Medical clinic -- the impact from the expense of implementing Regulation 61-12 was unduly burdensome. While the $23-$75 increased cost per abortion due to compliance might make it \"more difficult\" and would make it \"more expensive to procure an abortion,\" there is no evidence that it would impose an undue burden on \"a woman's ability to make th[e] decision to have an abortion.\" Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.). As to Dr. Lynn's Beaufort clinic, no evidence suggests that women in Beaufort could not go to the clinic in Charleston, some 70 miles away.\n\nBoth Casey and pre-Casey decisions support the conclusion that predicted costs to raise medical standards do not amount to an undue burden on a woman's choice to obtain an abortion. In Casey, the Court considered a mandatory 24-hour waiting period, which the lower court had found would often cause \"a delay of much more than a day because the waiting period requires that a woman seeking an abortion make at least two visits to the doctor\" and would increase the exposure of women seeking abortions to the \"harassment and hostility of anti-abortion protestors.\" 505 U.S. at 886 (joint opinion of O'Connor, Kennedy, and Souter, JJ.). As a result, the lower court concluded that the State regulation would especially burden women with the fewest financial resources, who had to travel long distances, and who needed to explain their absences to their husbands or to others. See id. Yet the Supreme Court upheld the provision, stating that \"on the record before us, and in the context of this facial challenge, we are not convinced that the 24-hour waiting period constitutes an undue burden.\" Id. at 887 (emphasis added). The Casey Court also upheld a recordkeeping and reporting provision, under which every facility that performed abortions had to file with the State a detailed report on every abortion, as well as quarterly statistical data. Because this information was a \"vital element of medical research,\" it could not \"be said that the requirements serve no purpose other than to make abortions more difficult,\" even though the provision \"might increase the cost of some abortions by a slight amount.\" Id. at 901 (majority opinion).\n\nSimilarly, in Ashcroft, the Court upheld a reporting requirement because, \"[o]n its face and in effect,\" it was reasonably related to accepted medical standards and constituted common medical practice, 462 U.S. at 487, 505, even though the provision raised the cost of an abortion, see id. at 490. In contrast, the Court in Akron struck down a provision requiring that all second-trimester abortions be performed in a hospital because the evidence indicated that the cost of an abortion would double and second-trimester abortions were \"rarely performed\" in hospitals. 462 U.S. at 435.\n\nIn the case before us, as in Casey, the district court found that the Regulation would \"caus[e] delays in the woman's financial ability to obtain an abortion\" and would \"increas[e] the distance a woman has to travel to obtain an abortion,\" thereby increasing the cost of an abortion. 66 F. Supp. 2d at 735. But again, in the context of a facial challenge and in the absence of any evidence in the record about how the cost would affect women's ability to make a decision, we conclude that the clinics have failed to demonstrate that the Regulation places any serious burden on a woman's ability to make an abortion decision.\n\nMoreover, the increased costs claimed by the three abortion providers are particularly modest when one considers that their purpose is to protect the health of women seeking abortions. And there is no evidence that the ability of any woman to obtain an abortion or to decide to obtain an abortion would be frustrated by these particularized costs. To conclude that any of the figures in this case would place an obstacle in the path of a woman's right to choose to have an abortion would necessitate the formulation of an arbitrary cost threshold beyond which a price increase may not pass. This would irrationally hamstring the State's effort to raise the standard of care in certain abortion clinics, the procedures and facilities of which do not adequately safeguard the health of their patients, simply because the clinics' performance falls so far below appropriate norms that the expense of upgrading their practices and equipment exceeds the arbitrarily defined amount.\n\nNor does it unduly burden a woman's right to decide to obtain an abortion that DHEC officials may inspect abortion clinics and copy necessary documents. Such inspections ensure compliance with health-care standards, an end which the copying provision also furthers. See Danforth, 428 U.S. at 79, 81 (noting that a statute which allowed medical records to \"be inspected and health data acquired by local, state, or national public health officers\" did not have a \"legally significant impact or consequence on the abortion decision or on the physician-patient relationship\" (internal quotation marks omitted)). This is particularly so in view of the Regulation's requirement that \"[a]ll records shall be treated as confidential,\" thereby respecting patients' privacy. See id. at 80 (noting that proper respect for patient's confidentiality was a factor in upholding reporting requirement); cf. Whalen v. Roe, 429 U.S. 589, 602 \u0026 n.29 (1977) (\"disclosures of private medical information to . . . public health agencies are often an essential part of modern medical practice even when the disclosure may reflect unfavorably on the character of the patient\").\n\nIn short, South Carolina Regulation 61-12 serves a valid purpose, \"one not designed to strike at the right itself,\" and it is not invalid simply because it has the incidental effect of making it modestly more difficult or more expensive to procure an abortion. Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.).\n\nIII.\n\nSouth Carolina also contends that the district court erred in finding that Regulation 61-12 violates the Equal Protection Clause. The Regulation applies to facilities that perform one second-trimester abortion or five or more first-trimester abortions per month, but does not apply to facilities that perform fewer than five abortions per month or that perform no abortions at all. South Carolina argues that this classification is rationally related to its interests in regulating those facilities that perform abortions on a regular basis and notes that an abortion is recognized to be \"a unique act fraught with consequences that go beyond mere medical complications.\"\n\nThe abortion clinics argue that because Regulation 61-12 \"targets abortion providers and their patients, treats them differently than providers and patients of comparable medical procedures, and directly impacts the exercise of the right to abortion,\" we must review the Regulation under a standard of strict scrutiny. The abortion clinics contend that, under the strict-scrutiny standard, the Regulation cannot be upheld because it is not narrowly drawn to protect the health of women seeking abortions since their safety \"is no more or less compelling than the safety of patients undergoing comparable procedures,\" which the State does not regulate. At its essence, the Equal Protection Clause requires that \"all persons similarly situated . . . be treated alike.\" Cleburne v. Cleburne Living Ctr., Inc., 473 U.S. 432, 439 (1985); Reed v. Reed, 404 U.S. 71, 77 (1971). But this directive does not deny States \"the power to treat different classes of persons in different ways.\" Reed, 404 U.S. at 75. Most regulations define groups to which they apply or to which benefits are conferred and when any such group is defined, of necessity, the regulation favors or disadvantages other groups. See Romer v. Evans, 517 U.S. 620, 631 (1996). To withstand scrutiny under the Equal Protection Clause, therefore, a classification generally \"must be reasonable, not arbitrary, and must rest upon some ground of difference having a fair and substantial relation to the object of the legislation.\" Reed, 404 U.S. at 76 (internal quotation marks and citation omitted). If, however, a regulation \"impinges upon a fundamental right protected by the Constitution,\" Perry Educ. Ass'n v. Perry Local Educators' Ass'n, 460 U.S. 37, 54 (1983), or\"operates to the peculiar disadvantage of a suspect class,\" Massachusetts Bd. of Retirement v. Murgia, 427 U.S. 307, 312 (1976), then the classification will be strictly scrutinized. While classifications in legislation ordinarily will be upheld against an equal protection challenge if\"there is any reasonably conceivable state of facts that could provide a rational basis for the classification,\" FCC v. Beach Communications, Inc., 508 U.S. 307, 313 (1993), a regulation subject to strict scrutiny will be upheld only if it is justified by a compelling state interest, see Roe, 410 U.S. at 155.\n\nIn Roe, the abortion-decision right was found to be fundamental. 410 U.S. at 154-55, 162-63; see also Maher v. Roe, 432 U.S. 464, 474 (1977). But following Casey, that conclusion may be in doubt. The Casey decision does not refer to the abortion-decision right as fundamental and does not apply the traditional strict-scrutiny standard which protects fundamental rights. Rather, the Court adopted an \"undue burden\" standard. Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.); see also Stenberg, 530 U.S. at ___, No. 99-830, slip op. at 2. Indeed, any regulation that does not \"strike at the [abortion] right itself\" is assessed by asking not whether it serves a compelling state interest, but whether it \"serves a valid purpose.\" Casey, 505 U.S. at 874 (joint opinion of O'Connor, Kennedy, and Souter, JJ.) (emphasis added). The dissenting opinion by Chief Justice Rehnquist characterizes the joint opinion in Casey as follows: Roe decided that a woman had a fundamental right to an abortion. The joint opinion rejects that view. Roe decided that abortion regulations were subject to \"strict scrutiny\" and could be justified only in the light of \"compelling State interests.\" The joint opinion rejects that view. Id. at 954 (Rehnquist, C.J., dissenting).\n\nBut because we have concluded in Part II that South Carolina's Regulation 61-12 does not place an undue burden on a woman's ability to make an abortion decision, there is no need to resolve whether it remains a fundamental right for an equal protection analysis and thus requires application of the strict-scrutiny standard. See Harris v. McRae, 448 U.S. 297, 312, 322 (1980) (having concluded that a law restricting federal funding for abortion violated no constitutionally protected right, the Court held it was unnecessary to analyze whether the law infringed a fundamental right for equal protection purposes). And likewise the equal protection analysis of a regulation applicable to abortion clinics, and not other medical clinics, would not be conducted under the strict-scrutiny standard. No authority exists to support a conclusion that abortion clinics or abortion providers have a fundamental liberty interest in performing abortions free from governmental regulation. See, e.g., Birth Control Centers, Inc. v. Reizen, 743 F.2d 352, 358 (6th Cir. 1984). Moreover, physicians as a group are not a suspect class. See Attorney Gen. of New York v. Soto-Lopez, 476 U.S. 898, 906 n.6 (1986) (recognizing suspect classifications to include those based on race, alienage, or national origin). Accordingly, because we are not considering a regulation that impinges on a fundamental right or that is directed at a suspect class, we review South Carolina Regulation 61-12 under the Equal Protection Clause by applying a rational-basis standard to determine whether the Regulation's classification of physicians who perform one second-trimester abortion or five or more first-trimester abortions per month is rationally related to a valid governmental purpose.\n\nThe rationality of distinguishing between abortion services and other medical services when regulating physicians or women's healthcare has long been acknowledged by Supreme Court precedent. Beginning with Roe itself, the Court recognized not only the special medical interest of the women seeking abortions but also the State's interest in protecting prenatal life. See 410 U.S. at 150. The long stream of cases that followed Roe has only heightened an awareness that for purposes of regulation, abortion services are rationally distinct from other routine medical services, if for no other reason than the particular gravitas of the moral, psychological, and familial aspects of the abortion decision. As the Court in Casey observed:\n\n[T]he abortion decision . . . is more than a philosophic exer cise. Abortion is a unique act. It is an act fraught with conse quences for others: for the woman who must live with the implications of her decision; for the persons who perform and assist in the procedure; for the spouse, family, and soci ety which must confront the knowledge that these proce dures exist, procedures some deem nothing short of an act of violence against innocent human life; and, depending on one's beliefs, for the life or potential life that is aborted. Casey, 505 U.S. at 852 (majority opinion).\n\nSimilarly in Harris, the Supreme Court noted that it was rational for Congress to authorize federal reimbursement for medical necessities, but not for medically necessary abortions: \"Abortion is inherently different from other medical procedures, because no other procedure involves the purposeful termination of a potential life.\" 448 U.S. at 325 (emphasis added). And again in Danforth, the Court rejected the argument that \"the State should not be able to impose any recordkeeping requirements [on abortion providers] that significantly differ from those imposed with respect to other, and comparable, medical or surgical procedures.\" 428 U.S. at 80-81. In the same case, the Court applied the identical analysis to uphold a provision requiring that a woman certify in writing that her consent to the abortion was freely given and not the result of coercion, \"[d]espite the fact that apparently no other . . . statute . . . requires a patient's prior written consent to a surgical procedure.\" Id. at 66-67.\n\nWe thus conclude that South Carolina has a rational basis for regulating abortion clinics while not regulating other healthcare facilities. See Williamson v. Lee Optical, 348 U.S. 483, 489 (1955) (\"The problem of legislative classification is a perennial one, admitting of no doctrinaire definition. . . . [T]he reform may take one step at a time, addressing itself to the phase of the problem which seems most acute to the legislative mind. . . . The legislature may select one phase of one field and apply a remedy there, neglecting the others\").\n\nThe only question remaining is whether the line drawn by Regulation 61-12 at five abortions per month is rationally related to its purpose of protecting the health of abortion patients. When it is recognized that the State interest is in regulating those facilities that are in the business of providing abortions, drawing the line at those performing five abortions per month is rational. While anyone could say that it is just as rational to draw the line at ten abortions per month or three abortions per month, this type of line-drawing is typically a legislative function and is presumed valid. See Murgia, 427 U.S. at 314. Indeed, line-drawing of this type is not only typical of legislation, it is necessary. Thus, the Americans With Disabilities Act provides that the right to be free from discrimination because of one's disability is granted to an employee of a company with 15 employees, but not to an employee of a company with only 14 employees. See 42 U.S.C. § 12111(5)(A). Similarly, Title VII of the Civil Rights Act of 1964 prohibits discrimination on the basis of race, color, religion, sex, or national origin by employers with 15 or more employees, but not employers with 14 or fewer employees. See 42 U.S.C. § 2000e(b). The statute books are filled with similar examples. See, e.g., the Family and Medical Leave Act, 29 U.S.C. § 2611(2) (giving rights only to employees employed 12 months or longer); the Comprehensive Crime Control Act of 1984, 18 U.S.C. § 3559(c)(1) (mandating a sentence of life imprisonment for persons convicted of three serious violent felonies). In a similar vein, South Carolina permits persons 16 years or older to obtain a driver's license, denying a license to persons 15 years or younger. See S.C. Code § 56-1-40; see also S.C. Const. art. XVII, § 14 (persons 18 years or older have \"full legal rights and responsibilities\"). In each of these instances, persons falling on one side of the line are treated differently from those on the other. But this result is inherent in legislation. Under rational-basis review, we need to determine only whether the line is drawn in a manner that reasonably furthers the legislative concern.\n\nIn this case, South Carolina elected to regulate the business of providing abortions and determined that five per month would distinguish the abortion clinic from the facility performing abortions incidental to another medical practice. The selection of this number is reasonably related to the State's legitimate interest in promoting and protecting the health of women visiting abortion clinics, and therefore the actual placement of the line is not a decision that the courts may second-guess. No more than the abortion regulations examined by the Supreme Court in Danforth and Harris does the South Carolina regulation before us contravene the limitations of the Equal Protection Clause.\n\nIV.\n\nIt is regrettable that our good colleague in dissent would rule on the basis that abortion is like any other simple medical procedure that is directed at injury or disease. Thought of in this way, it is understandable that he, like the district court, might find many of South Carolina's regulations unnecessary. Why have inspections, keep records, and minimize the medical risks for only the abortion procedure, when such a protocol is not mandated for comparable medical practices addressing injury and disease? But the importance of the deeply divided societal debate over the morality of abortion and the weight of the interests implicated by the decision to have an abortion can hardly be overstated. As humankind is the most gifted of living creatures and the mystery of human procreation remains one of life's most awesome events, so it follows that the deliberate interference with the process of human birth provokes unanswerable questions, unpredictable emotions, and unintended social and, often, personal consequences beyond simply the medical ones.\n\nIn adopting an array of regulations that treat the often relatively simple medical procedures of abortion more seriously than other medical procedures, South Carolina recognizes the importance of the abortion practice while yet permitting it to continue, as protected by the Supreme Court's cases on the subject. A woman in South Carolina who has determined to abort the life of a fetus can do so without significant interference from South Carolina's regulations and be assured thereby of a dignified and safe procedure. That these regulations impose a modest cost increase for increased medical safety and a modest compromise to privacy in the form of inspections and recordkeeping serves the complex public interests on the subject -- the interests expressed by both those who favor abortion and those who oppose it. Society's last word on this subject has not been spoken. But South Carolina's regulations incidental to the exercise of the abortion right should, in the meantime, be respected.\n\nV.\n\nBecause we reverse the district court's judgment finding Regulation 61-12 unconstitutional, we also reverse the district court's award of attorneys fees made under 42 U.S.C. § 1988 to the abortion clinics. The clinics are no longer prevailing parties. See Alexander S. v. Boyd, 113 F.3d 1373, 1388 (4th Cir. 1997); Clark v. Township of Falls, 890 F.2d 625, 626-27 (3d Cir. 1989).\n\nREVERSED\n\nA.\n\nPrior to 1995, the State of South Carolina only required licensing of physicians' offices or other facilities in which second trimester abortions were performed. See S.C. Code Ann.§§ 44-41-20(b), -70(b) (Law. Co-op. 1995). On January 3, 1995, the South Carolina legislature amended Chapter 41 of Title 44 to require licensing by the South Carolina Department of Health and Environmental Control (DHEC) of any non-hospital medical facility in which five or more first trimester abortions are performed in a month. See id. § 44-41-75(A) (West Supp. 1999). This legislation also required DHEC to promulgate regulations concerning \"sanitation, housekeeping, maintenance, staff qualifications, emergency equipment and procedures to provide emergency care, medical records and reports, laboratory, procedure and recovery rooms, physical plant, quality assurance, infection control, and information on and access to patient follow-up care necessary to carry out the purposes of this section.\" Id. § 44-41-75(B). Pursuant to this enabling legislation, DHEC promulgated a regulation, entitled \"Standards For Licensing Abortion Clinics,\" see S.C. Code Ann. Regs. 61-12 (Regulation 61-12), which sets forth detailed requirements that an abortion clinic\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e must comply with in order to obtain and maintain a license to perform abortions.\n\nOn June 27, 1996, the day before Regulation 61-12 temporarily went into effect, Greenville Women's Clinic (GWC) and Charleston Women's Medical Clinic, Inc. (CWMC), two medical clinics which offer first trimester abortion services in South Carolina, and Dr. William Lynn (Dr. Lynn), a physician that owns and operates medical practices in Beaufort and Greenville, South Carolina, brought this action against Douglas Bryant (Bryant) as the Commissioner of DHEC, the Governor of the State of South Carolina, and the Attorney General of the State of South Carolina challenging the constitutionality of Regulation 61-12. On the same day, the plaintiffs filed a motion for a temporary restraining order, or, in the alternative, for a preliminary injunction.\n\nOn July 19, 1996, the district court granted the plaintiffs' motion for a temporary restraining order and enjoined the defendants from enforcing Regulation 61-12, pending a hearing on the issuance of a preliminary injunction. The district court never held a hearing on the issuance of a preliminary injunction because, prior to the hearing date, the parties agreed to continue the injunction pending a decision by the district court on the merits.\n\nFollowing a six day bench trial, the district court, on February 5, 1999, held that Regulation 61-12 was constitutionally infirm on due process and equal protection grounds. See Greenville Women's Clinic v. Bryant, 66 F. Supp. 2d 691, 724-43 (D.S.C. 1999). The district court also held that, in light of both South Carolina law and the text of Regulation 61-12, Regulation 61-12 was not subject to the doctrine of severability. See id. at 743-44. On April 13, 1999, the district court awarded the plaintiffs $324,040.61 in costs and attorneys' fees. Bryant and the Attorney General of South Carolina appeal both the district court's decision on the merits and the order awarding costs and attorneys' fees. The Governor of South Carolina appeals only the district court's order awarding costs and attorneys' fees.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nB.\n\nLocated in Greenville, South Carolina, GWC provides gynecological services, including abortions through fourteen weeks of pregnancy measured from the pregnant woman's last menstrual period (lmp).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Drs. Terry Buffkin and Thomas Campbell, two physicians licensed to practice in South Carolina and board certified in obstetrics and gynecology, own and operate GWC. On average, GWC performs approximately 2,746 first trimester abortions per year.\n\nLocated in Charleston, South Carolina, CWMC also provides gynecological services, including abortions through 12.5 weeks of pregnancy measured from the pregnant woman's lmp. On average, CWMC performs 2,408 first trimester abortions per year.\n\nDr. Lynn owns and operates two medical practices, one in Beaufort, South Carolina, the other in Greenville, South Carolina. Dr. Lynn is licensed to practice medicine in South Carolina and is board certified in obstetrics and gynecology. As part of his practice, Dr. Lynn performs abortions through 13.9 weeks of pregnancy measured from the pregnant woman's lmp. On average, Dr. Lynn performs 407 first trimester abortions per year in his Beaufort office and 536 first trimester abortions per year in his Greenville office.\n\nAll of the abortions performed at GWC, CWMC, and Dr. Lynn's two practices are first trimester abortions. In fact, there are no abortion providers in South Carolina who perform elective abortions (those not associated with medical complications) in the second trimester of pregnancy.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe most common first trimester abortion procedure performed by the plaintiffs is the suction curettage procedure. The suction curettage procedure is also utilized for spontaneous miscarriages. Although not wholly without risks, it is undisputed that a suction curettage abortion during the first trimester of pregnancy is a safe and quick medical procedure performed between six and fourteen weeks after a woman's lmp.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e It involves dilating the cervix, inserting a suction catheter into the uterus, and applying suction to remove the contents of the uterus. Although the patient is usually in the procedure room for a total of ten minutes, the procedure itself only takes approximately two to five minutes. It involves no incision and a minimum of bleeding. The procedure is also performed under general anesthesia or by applying a numbing medicine around the cervix. After the procedure, patients usually walk to the recovery area, where their pulse and blood pressure are monitored, and they are checked for any abnormal bleeding. Possible complications from the suction curettage procedure are fainting from vasovagal response, uterine perforation, excessive bleeding, infection, and retained tissue in the uterus. However, while the total complication rate for the procedure is about one in one hundred, serious complications are rare. The rate for complications requiring hospitalization is only about one in 2000. And the mortality rate is one in 100,000, which is about twenty-five times less risky than carrying a pregnancy to term. There is no evidence in this case that a first trimester suction curettage abortion has ever resulted in a woman's death in South Carolina.\n\nPhysicians in South Carolina, including Dr. Buffkin and Dr. Campbell, also perform medical abortions to terminate pregnancies located outside the uterus (such as in the fallopian tube) during the first six to seven weeks of pregnancy. A medical abortion is an even safer procedure than the suction curettage procedure. It involves the performance of a routine blood test to measure the patient's hormone levels, followed by the injection of a drug (methotrexate) into the patient's arm. There is no recovery time after the injection, and only mild vaginal bleeding. Follow-up care consists of rechecking the patient's hormone levels several days after the injection, and rechecks thereafter at seven-day intervals. Although currently limited in use to the termination of ectopic pregnancies, methotrexate and a second drug, RU486, are currently being used in research protocols for use in terminating intrauterine pregnancies.\n\nC.\n\nCurrently, South Carolina does not require licensing of physicians' offices outside of the abortion context. Furthermore, physicians licensed to practice medicine in South Carolina are not subject to DHEC regulation, but rather are governed by the South Carolina State Board of Medical Examiners. See S.C. Code Ann. §§ 40-47-5 to 40-47-270 (West Supp. 1999). The State Board of Medical Examiners handles the examination and licensure of physicians within South Carolina, complaints against physicians, the suspension and revocation of licenses when appropriate, and the imposition of civil penalties and other sanctions against physicians. With the exception of standard building codes imposed by their particular locales, physicians' offices are not subject to any mandated design and construction requirements. Notably, unlike abortion clinics, physicians' offices that do not perform five or more abortions per month are not subject to the requirements of Regulation 61-12.\n\nRegulation 61-12 is divided into ten \"Parts.\" Part I of Regulation 61-12 sets forth \"Definitions\" and general\"Requirements for Licensure\" of abortion clinics. Part I defines an abortion as \"[t]he use of an instrument, medicine, drug, or other substance or device with intent to terminate the pregnancy of a woman, known to be pregnant, for reasons other than to increase the probability of a live birth, to preserve the life or health of the child after live birth, or to remove a dead fetus.\" S.C. Code Ann. Regs. 61-12, § 101(A). Part I defines an abortion clinic as \"[a]ny facility, other than a hospital . . . in which any second trimester or five or more first trimester abortions per month are performed.\" Id. § 101(B).\n\nIn order to operate an abortion clinic, the clinic must first obtain a license from DHEC. See id. § 102(A). Prior to the issuance of a license, the abortion clinic must undergo a pre-licensure inspection. See id. § 102(F). Once the initial license is obtained, the abortion clinic must be inspected annually in order to obtain renewal of the license. See id. §§ 102(F), (H). In addition, Regulation 61-12 provides that the abortion clinic is subject to unannounced inspections by DHEC, see id. § 102(F)(1), during which DHEC inspectors \"have access to all properties and areas, objects, records and reports, and shall have the authority to make photocopies of those documents required in the course of inspections or investigations.\" Id. § 102(F)(2).\n\nUpon a determination by DHEC that an abortion clinic is in violation of \"any statutory provision, rule or regulation relating to the operation or maintenance of such facility,\" DHEC may deny, suspend, or revoke the license. Id. § 103. In addition, DHEC may assess a monetary penalty up to $5,000 for each violation. See id. § 103(F). The amount of a penalty is based upon the specific provision at issue, which has been preassigned as either a Class I, II, or III violation, with a Class I violation being the most serious. See id.\n\nPart II concerns the \"Administration and Management\" of the abortion clinic. Section 201 requires an abortion clinic to develop and implement detailed written policies and procedures for the operation of the clinic, which must include, at a minimum, policies and procedures to assure compliance with all federal, state, and local laws which govern the clinic; the designation of a person to whom responsibility for operation and maintenance of the abortion clinic is delegated and the establishment of methods for holding the person responsible; personnel policies and procedures, including in-service training requirements; a facility-wide quality improvement program, including statistical summaries and a written plan of implementation; a policy and procedure for patient rights and grievance procedures; functional safety and maintenance policies and procedures; a policy and procedure for incident reporting; and policies and procedures for obtaining informed consent from the patient. See id. § 201(B). In addition, the abortion clinic's policies and procedures must include a provision for annual review and evaluation of the clinic's other policies and procedures, as well as for its management and operation. See id.\n\nSection 203 requires an abortion clinic to maintain on file all current policies and procedures concerning the operation of the clinic, memoranda of agreements and credentialing documentation, a copy of Regulation 61-12, annual elevator safety inspections, and annual heating, ventilation, and air conditioning inspection reports. See id. §§ 203(A)-(E).\n\nSection 204 sets forth detailed personnel requirements for each abortion clinic. The abortion clinic must obtain and verify professional and personal background information on every employee, see id. § 204(A), and must develop and implement a written orientation program for new staff members, to include orientation on the clinic's other policies and procedures, see id. § 204(E). A formal, in-service training program must also be planned and provided for all employees and volunteers, and records kept of attendance. See id. § 204(F). The in-service training of all employees and volunteers must include four specified areas--infection control, fire protection, confidentiality and patient rights, and licensing regulations. See id. Written job descriptions must be prepared and reviewed annually, see id. § 204(G), and a personnel file must be maintained on each employee and contain the employee's current job description that reflects the employee's responsibilities and work assignments, documentation of the employee's orientation, in-service education, appropriate licensure (if applicable) and tuberculin skin testing, see id.§ 204(H). Annually, each employee must have a tuberculin skin test or, if previously positive, a chest x-ray to determine whether tuberculosis is present. See id. § 204(B). If tuberculosis is diagnosed, the abortion clinic must provide treatment and investigate employee contacts. See id. Employees and volunteers are also banned from working if they have any infected wounds, boils, sores, acute respiratory infections, or any other contagious disease or illness. See id.§ 204(D). In addition, all professional and allied health care staff members must be certified by the American Red Cross or the American Heart Association as capable of performing CPR, although only one such certified person must be with patients when they undergo the abortion procedure and during the recovery period. See id. § 204(C).\n\nSection 205 sets forth requirements for the clinical staff of an abortion clinic, which encompasses all physicians, nurses, and allied health professionals. See id. § 205(A). Abortions may only be performed by physicians licensed to practice medicine in South Carolina and who are also \"properly qualified by training and experience to perform pregnancy termination procedures.\" See id. § 205(C). The abortion clinic must also obtain and maintain signed, written agreements with at least one physician board certified in obstetrics and gynecology who has admitting privileges at a local hospital which provides obstetrical and gynecological services. See id. All nursing care is required to be under the supervision of a registered nurse licensed in the State of South Carolina, regardless of the presence of a physician in the abortion clinic, and the registered nurse must be \"on duty to provide or supervise all nursing care\" during preparation, the procedure, recovery, and discharge. Id.§ 205(D). Licensed practical nurses may be employed so long as they work under the supervision and direction of a registered nurse. See id.§ 205(E). Ultrasounds may only be conducted by physicians or ultrasound technicians who have documented evidence of completion of a training course in ultrasonography. See id. § 205(F). Finally, the entire clinical staff must participate in quarterly meetings to review and analyze clinical experiences, and minutes must be kept and maintained of each meeting. See id. § 205(B).\n\nSection 209 requires an abortion clinic to \"have written policies and procedures to assure the individual patient the right to dignity, privacy, safety, and to register complaints with[DHEC].\" Id. § 209(A). A copy of the patient's rights must be conspicuously displayed, and a copy must be signed by each patient and included in the patient's medical record. See id. § 209(B).\n\nPart III of Regulation 61-12 sets forth requirements for \"Patient Care.\" Additional \"patient care policies and procedures designed to ensure professional and safe care for patients\" must be developed, id. § 301, and must include, but are not limited to, policies and procedures for admission criteria; physician and nurse responsibilities; details regarding the pre-operative procedures (including history and physical examinations, special examinations, lab procedures and consultations which will be required, and ultrasonography procedures); details regarding the actual abortion procedure (including the use of IVs, fluids, analgesia, anesthesia, and tissue examination and disposal); details regarding post-procedure care and recovery room care, including emergency care; provisions for education of the patient, family and others, as appropriate in pre- and post-procedure care; plans for follow-up care, including arrangements for a post-operative visit and specific instructions in the event of an emergency; procedures for the management and referral of high-risk conditions; procedures for the transfer of patients when needed; procedures for infection control and sanitation (including duties and responsibilities of an infection control committee which are, in turn, charged with the responsibility of developing and implementing specific patient care and administrative policies to investigate, control, and prevent infections in the clinic); and procedures for the registration of fetal death or death certificates. See id. §§ 301(A)-(K).\n\nSection 303 of Regulation 61-12 relates to an abortion clinic's pharmaceutical services. Section 303 requires every abortion clinic to maintain an emergency supply of drugs and medicines to treat, at a minimum, the following conditions: (1) cardiac arrest; (2) seizure; (3) asthmatic attack; (4) allergic reaction; (5) narcotic toxicity; (6) hypovolemic shock; and (7) vasovagal shock. See id. § 303(A). In addition, Section 303 mandates that the medicines must be prepared in an area that contains a sink and a counter. See id. § 303(D).\n\nSection 304 requires laboratory services to be performed in compliance with the requirements already mandated by the Clinical Laboratory Improvement Amendments of 1988 (CLIA-88), 42 U.S.C. § 263a.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See S.C. Code Ann. Regs. 61-12, § 304(A). It further requires the physician to perform a urine pregnancy test (unless fetal heart beats or movements are identified on physical examination), a urinalysis which includes albumin and glucose examination, and a hematocrit or hemoglobin test. See id. § 304(B). In addition, the physician must perform a test to determine Rh factor. See id. If the patient is Rh positive, an additional Du variant test is required. See id. Rh(D) immune globulin must be administered if the patient is determined to be Rh negative. See id. Testing for chlamydia and gonorrhea is mandatory, while testing for syphilis serology and performance of a Papanicolaou (pap) smear must be offered to the patient. See id. § 304(C).\n\nSection 305 provides additional requirements for emergency care. It requires that \"[a]ll staff and/or consulting physicians\" have admitting privileges at one or more local hospitals that provide appropriate obstetrical/gynecological services or have in place documented arrangements approved by DHEC for the transfer of emergency cases when hospitalization becomes necessary. Id.§ 305(A). The abortion clinic must maintain equipment and services to render emergency resuscitative and life-support procedures pending transfer. See id. § 305(B). And the abortion clinic must notify, in writing, the local ambulance service of the location of the clinic and the nature of the medical problems which may result from abortions. See id. § 305(C).\n\nSection 306 requires an abortion clinic to purchase and maintain specific equipment and supplies, including such items as \"[a] bed or recliner suitable for recovery,\" oxygen, mechanical suction, resuscitative equipment, emergency medications and intravenous fluids, \"[a] clock with a sweep second hand,\" sterile suturing equipment and supplies, an adjustable examination light, and soiled linen and waste containers. Id. §§ 306(A)-(I).\n\nSection 307 requires an abortion clinic to make\"[a]rrangements . . . for consultation or referral services in the specialties of obstetrics/gynecology, anesthesiology, surgery, psychiatry, psychology, clinical pathology and pathology, clergy, and social services, as well as any other indicated field, to be available as needed.\" Id. § 307.\n\nSection 308, entitled \"Quality Improvement,\" mandates a written plan for a quality improvement program for patient care and designation of an individual responsible for coordinating the program. See id. § 308(A). Specific requirements include ongoing monitoring and evaluation of \"patient care services, staffing, infection prevention and control, housekeeping, sanitation, safety, maintenance of physical plant and equipment, patient care statistics, and discharge planning services.\" Id. § 308(B). Evaluation of patient care is required to be \"criteria-based, so that certain actions are taken or triggered when specific quantified, predetermined levels of outcomes or potential problems are identified.\" Id. § 308(C). The process must incorporate a quarterly review of a minimum of five percent of the medical records per quarter, but not less than five records per quarter shall be reviewed, see id. § 308(D), and must include a means of obtaining input from families of patients if they are \"involved in the care and services provided by the facility.\" Id.§ 308(E). The abortion clinic administrator must review the findings of the program and ensure corrective actions are taken. See id. § 308(F). The program must also identify and establish indicators of quality care, specific to the abortion clinic, that must be monitored and evaluated. See id. § 308(G). Annual review of the results is also required. See id. § 308(H).\n\nPart IV of Regulation 61-12 sets forth requirements for \"Medical Records and Reports.\" Section 401 begins by setting forth detailed requirements for the preparation and maintenance of medical records, which must include, at a minimum, twenty categories of information. See id. § 401. Section 401 requires a face sheet with patient identification data, including but not limited to, the patient's name, address, telephone number, social security number, date of birth, the father and mother's name if the patient is a minor, the husband's name, and the name, address, and telephone number of a person to be notified in the event of an emergency. See id. § 401(A)(1). The records are required to be kept confidential by the abortion clinic (although no such requirement is imposed upon DHEC inspectors who obtain them) and must be stored for a minimum of ten years. See id. § 402.\n\nSection 403 requires the preparation of additional reports, including a record of every accident or incident occurring in the abortion clinic which involves patients, staff, or visitors. See id. § 403(B). If it results in serious injury, the accident or incident must be selfreported to DHEC. See id. Serious injuries\"include, but are not limited to,\" accidents and incidents that lead to hospitalization or death (other than of a fetus) and adverse drug reactions. Id.\n\nPart V of Regulation 61-12, entitled \"Functional Safety and Maintenance,\" requires additional policies and procedures, including, but not limited to, safety rules and practices for personnel, equipment, gases, liquids, drugs, supplies, and services; provisions for investigating accidents on the premises; provisions for disseminating safetyrelated information to employees and users of the abortion clinic; provisions for syringe and needle handling and storage; and provisions for managing infectious waste in accordance with another DHEC regulation already governing such matters. See id. §§ 501(A)-(B). In addition, the abortion clinic must prepare and post a disaster preparedness plan for evacuation in the event of a fire or other emergency. See id. § 502(A). All parts and portions of the abortion clinic are generically required to be kept \"in good repair and operating condition,\" and \"free of hazards.\" Id.§ 503(A). In addition, \"[a]ll wooden surfaces shall be sealed with a non-lead based paint, lacquer, varnish, or shellac that will allow sanitization.\" Id. A written preventive maintenance program must be developed and implemented for patient monitoring equipment and tested in accordance with manufacturer's specifications, but not less than annually. See id. § 503(B). Records of maintenance and testing must be kept. See id.\n\nPart VI of Regulation 61-12 is entitled \"Infection Control and Sanitation.\" Part VI requires policies and procedures be established in writing to assure safe and aseptic treatment and protection of all patients and personnel against cross-infection. See id. § 601(A). Part VI also sets forth specific requirements for sterilization, including daily testing of the autoclave and a log of results, as well as periodic calibration and preventative maintenance as necessary, but not less than annually. See id. §§ 602(B)-(C). This part of Regulation 61-12 also requires that the abortion clinic \"be kept neat, clean, and free from odors,\" id. § 604(A), mandates specific requirements for cleaning methods to be used and prohibits others, and imposes requirements for refuse and waste disposal, see id.§§ 604(A)-(C), 605. Section 606 requires that \"[a]ll outside areas, grounds and/or adjacent buildings shall be kept free of rubbish, grass, and weeds that may serve as a fire hazard or as a haven for insects, rodents and other pests,\" and that all \"[o]utside stairs, walkways, ramps and porches shall be maintained free from accumulations of water, ice, snow, and other impediments.\" Id. § 606.\n\nPart VII of Regulation 61-12, entitled \"Fire Protection and Prevention,\" provides detailed requirements for fire-fighting equipment and systems, an evacuation plan, training of employees in the evacuation plan, mandatory fire drills at least once every three months, maintenance of fire equipment, and maintenance of records proving compliance with the provisions. See id. §§ 701-03.\n\nPart VIII of Regulation 61-12 sets forth detailed requirements for the \"Design and Construction\" of abortion clinics. There is no grandfathering provision (unlike other DHEC regulations governing medical and patient care facilities)--rather, all abortion clinics must be in full compliance within two years. See id.§ 804. The requirements are set forth in detail, rendering a summary of them unproductive. Of note, Part VIII governs the number and size of procedure and recovery rooms, specifies the design and equipment required in toilet rooms, regulates the direction of the air flow within the sterilization rooms, mandates a minimum width for doors and corridors, sets forth specific requirements for heating and air conditioning (the unit must be capable of maintaining a temperature between seventy-two and seventy-six degrees), regulates the abortion clinic's air supply and exhaust, regulates design criteria for abortion clinic entrances, sets forth specific requirements for the janitor's closets, and specifies the corridor glazing materials, wall finishes, wall bases, and interior finish materials that must be present. See id.§§ 807(A)-(Y). Part IX of Regulation 61-12 sets forth additional\"Prerequisites for Initial Licensure\" of the abortion clinic, including plan and construction approval by DHEC, and specifies the documentation required to be submitted with the abortion clinic's initial application for licensure. See id. Part IX(A)-(B). Part X of Regulation 61-12, entitled \"General,\" states in its entirety that \"[c]onditions arising that have not been addressed in these regulations shall be managed in accordance with the best practices as interpreted by the Department.\" Id. Part X.\n\nD.\n\nAs noted earlier, prior to 1995, the State of South Carolina only required licensing of physicians' offices or other facilities in which second trimester abortions were performed. See S.C. Ann. §§ 44-41-20(b), -70(b) (Law. Co-op. 1995). Effective, January 3, 1995, Chapter 41 of Title 44 was amended as follows:\n\n(A) A facility in which any second trimester or five or more first trimester abortions are performed in a month must be licensed by [DHEC] to operate as an abortion clinic and must comply with the provisions of Article 3 [the Woman's Right to Know Act].\n\n(B) The department shall promulgate regulations concern ing sanitation, housekeeping, maintenance, staff quali fications, emergency equipment and procedures to provide emergency care, medical records and reports, laboratory, procedure and recovery rooms, physical plant, quality assurance, infection control, and infor mation on and access to patient follow-up care neces sary to carry out the purposes of this section. Id. § 44-41-75 (West Supp. 1999).\n\nPursuant to this enabling legislation, DHEC promulgated Regulation 61-12.\n\nAfter the legislation requiring licensure of abortion clinics was passed, Alan Samuels (Samuels) of DHEC was charged with the responsibility for supervising the drafting and promulgation of Regulation 61-12. Although Samuels has some experience in health care administration, he has received no formal medical training or education. Upon completion of his college education, Samuels served in the United States Army for twenty-four years, where he served with the adjutant general corps and the medical services corps as a personnel officer and hospital inspector. After leaving military service, Samuels began employment with DHEC, where his duties consisted of inspecting various types of health care facilities for compliance with existing regulations. He was eventually promoted to the position of director of DHEC's Health Licensing Division, and now is retired.\n\nAlthough Samuels provided some input and edits during the drafting process, he did not personally draft any portions of Regulation 61-12. Rather, he delegated the primary drafting responsibility to George Moore (Moore), who was the Director of Outpatient and Home Care within DHEC's Division of Health Licensing. Samuels testified that, when Regulation 61-12 was promulgated, he knew very little about abortion procedures or the differences between first trimester and second trimester abortions. The record reflects that Samuels conducted no meaningful study or research into the differences between a first and second trimester abortion, and conducted no meaningful inquiry into what regulatory requirements were appropriate for facilities performing only first trimester abortions.\n\nLike Samuels, Moore has some education and experience with hospital administration, but has received no formal medical training or education. After receiving an undergraduate degree, Moore joined the United States Army where he served twenty-five years. He spent the early part of his service in the adjutant general corps performing general administrative duties, after which time he transferred to the medical services corps where he performed administrative duties associated with health care facilities and hospitals. During his service, Moore received a master's degree in hospital administration. Upon his retirement from military service in 1988, Moore began employment with DHEC, inspecting hospitals and nursing homes for compliance with existing regulations. He was later promoted to Director of Outpatient and Home Care within the Division of Health Licensing, the position he held when Samuels asked him to assume primary responsibility for the drafting of Regulation 61-12.\n\nIn preparation for drafting Regulation 61-12, however, Moore took no meaningful steps to educate himself about first trimester abortions, how they differed from second trimester abortions, or what requirements would be appropriate for a facility which performed only first trimester abortions.\n\nFor assistance with Parts VII and VIII of Regulation 61-12, Moore turned to William Lafferty (Lafferty), who was the Director of Health Facilities Construction with DHEC. Like Samuels and Moore, Lafferty has received no formal medical training or education. In drafting these portions of the regulations, Lafferty made no effort to determine whether the requirements were medically appropriate for facilities performing only first trimester abortions. Lafferty also approached the design and construction requirements from the standpoint of new construction requirements and anticipated that existing facilities would be grandfathered. The decision to include a mandatory two-year compliance provision in that portion of Regulation 61-12 instead of a grandfather provision was not made by Lafferty.\n\nAccording to Moore, the pre-existing South Carolina regulation governing second trimester abortions was utilized as a starting point for the new regulation, and many of the additional provisions of Regulation 61-12 were simply adopted or derived from DHEC regulations governing other types of health care facilities. They included regulations governing ambulatory surgical centers, renal dialysis facilities, community residential care facilities, day care facilities for adults, outpatient facilities for chemically dependent persons, habitation centers for the mentally retarded, residential treatment facilities for children and adolescents, nursing homes, and facilities providing home health care and hospice services. According to the DHEC officials, DHEC sought to standardize its regulations governing medical facilities and medical care so that the licensing requirements would have consistent wording, and to codify existing departmental practices. According to the DHEC officials, this attempt to standardize its regulations and to codify existing practices included DHEC's desire to grant its inspectors the authority to copy medical records in all medical facilities. According to Moore, departmental practice currently allows the copying of medical records during a complaint investigation. Moreover, Moore testified that DHEC would maintain the confidentiality of the records even though there is no provision in Regulation 61-12 that mandates such confidentiality.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAlthough the DHEC officials testified that they primarily utilized existing South Carolina regulations as the basis for drafting Regulation 61-12, there is evidence in the record that the DHEC officials consulted other points of reference. First, Moore obtained copies of abortion regulations from North Carolina and Tennessee, though he did not speak with anyone in those states about the regulations or how they had affected maternal health. Second, Moore reviewed standards and guidelines issued by the Planned Parenthood Federation of America, Inc. (Planned Parenthood), the National Abortion Federation (NAF), and the American College of Obstetricians and Gynecologists (ACOG). The standards and guidelines published by Planned Parenthood, NAF, and ACOG are not mandated standards of care which can or should be imposed on licensed physicians. Rather, they are guidelines which should be followed with due regard for the medical judgment of the treating physician and the special needs of the patients that they serve.\n\nDuring the drafting process, the general counsel of ACOG wrote a letter to DHEC expressing concern that the requirements of Regulation 61-12 would not enhance patient well-being or safety and offering DHEC the assistance of ACOG in the drafting of an appropriate regulation. The DHEC drafters declined ACOG's assistance.\n\nAfter an initial draft of Regulation 61-12 was completed, Moore requested limited input and comments from two medical personnel associated with DHEC. The first, Dr. Richard Goodrich (Dr. Goodrich), is a licensed physician, board certified in obstetrics and gynecology, who practiced in Zanesville, Ohio until he retired. After his retirement, he moved to South Carolina and became a consultant with DHEC in the area of maternal and child health.\n\nDuring his medical practice, however, Dr. Goodrich performed only two abortions, both of which were due to medical complications. Furthermore, Dr. Goodrich was not asked to and did not draft any portion of Regulation 61-12. Rather, he was only asked to review discrete portions of the regulation dealing exclusively with medical events and medical testing, and he conducted no review of and provided no input on the majority of the regulatory requirements. Although he is of the opinion that the portions of Regulation 61-12 that he reviewed are appropriate medical standards of care, he testified that the same standards would be appropriate for physicians' offices in which comparable obstetrical and gynecological surgical procedures are performed. Dr. Goodrich further testified that he did not recommend Regulation 61-12's requirement of physician qualifications beyond state licensure, and acknowledged that he did not know how the required\"training and experience\" qualifications could be determined under the regulation. Dr. Goodrich also interpreted Regulation 61-12's requirement that a registered nurse be \"on duty\" as requiring that a registered nurse have ultimate responsibility, and not that a registered nurse should or needs to be on the premises at all times. Dr. Goodrich further testified that, while he has no specific experience with medical abortions, it would not be his intent to cover the provision of medical abortions under the regulation. He acknowledged, however, that the regulation as drafted would in fact cover such abortions. Finally, Dr. Goodrich testified that he is aware of no existing problem with abortion providers in South Carolina and has no opinion as to how the cost and availability of abortions affect women's health issues.\n\nMoore also sought some limited input from Robert Lawyer, R.N. (Lawyer), who was Director of Nursing for DHEC. Lawyer received his bachelor of science degree in nursing while in the United States Army, and later received a masters degree in health services management and business administration.\n\nHe has some experience with providing nursing care for first and second trimester abortions performed in a military hospital. After retiring from the Army in 1989, Lawyer began working with DHEC. He is currently nurse manager with the Division of Health Licensing, where his primary duty is the inspection of various health care facilities for compliance with existing regulations. He too was asked by Moore and Samuels to review and provide input concerning discrete portions of Regulation 61-12, primarily those governing nursing care. Lawyer is of the opinion that, for first trimester abortions, a registered nurse should either personally monitor the patient or supervise all patient care, unless the physician is present in the abortion clinic and available to come to the recovery room if necessary. Unlike Dr. Goodrich, however, he interprets Regulation 61-12 as requiring the \"on duty\" registered nurse to be on the premises. In formulating his opinion, Lawyer did not conduct any research on abortion practices in South Carolina, nor did he consult with nursing professionals who specialize in abortion procedures. Lawyer testified that while he is aware that Regulation 61-12 would apply to facilities performing only medical abortions, he has no knowledge of what nursing skills are required in the context of medical abortions or whether they would require a registered nurse as opposed to a licensed practical nurse.\n\nWith the exception of these limited consultations with medical personnel associated with DHEC, the drafters of Regulation 61-12 did not seek any input from medical professionals during the drafting process and rejected ACOG's offer of assistance. As some support for the text of Regulation 61-12, the defendants contend that the drafters conducted an inspection of Planned Parenthood's abortion clinic in Columbia, South Carolina and determined that the clinic met the great majority of Regulation 61-12's requirements. The evidence credited by the district court, however, reveals that the drafters simply toured the clinic and, during one such visit, may have spoken briefly to a Planned Parenthood physician. There is no evidence that the physician was asked to comment upon the regulatory requirements or whether they were medically necessary for first trimester abortions. Moreover, there is no evidence in the record to support a finding that DHEC received any meaningful input from Planned Parenthood physicians prior to or during the early stages of the drafting process.\n\nAfter the initial drafting process was concluded, DHEC issued a proposed regulation and held public hearings as mandated by South Carolina law. Some of the suggestions made during this public comment period resulted in changes to Regulation 61-12, including some suggestions made by Planned Parenthood and the plaintiffs in this case.\n\nOn January 23, 1996, DHEC submitted Regulation 61-12 to the South Carolina legislature for approval as required by South Carolina law. Because the legislature took no action on Regulation 61-12 within 120 days after its submission, it became effective automatically upon publication in the State Register on June 28, 1996.\n\nE.\n\nBased on the evidence presented at trial, the district court made detailed findings concerning Regulation 61-12 and its probable effect on the health of women in South Carolina, the cost of obtaining a first trimester abortion in South Carolina, and the availability for obtaining a first trimester abortion in South Carolina. First, based on the evidence in the record, the district court found that the first trimester suction curettage abortion is one of the safest surgical procedures that can be performed. The procedure lasts approximately two to five minutes and has a low overall complication rate. Suction curettage abortions can be, and are currently being, safely performed in physicians' offices and outpatient clinics, except where the patient has particular medical conditions that would require the procedure to be performed in an ambulatory surgical center or hospital. Medical abortions are also quick medical procedures that can be safely performed in a physician's office or outpatient clinic. See Greenville Women's Clinic, 66 F. Supp. 2d at 718.\n\nSecond, the district court found that physicians' offices and clinics that provide less than five first trimester abortions per month perform identical procedures to those which provide five or more first trimester abortions per month, and the risk to the patient undergoing the abortion procedure is identical. See id.\n\nThird, the district court found that first trimester suction curettage abortions are comparable in terms of risks, duration, and invasiveness to a variety of obstetrical and gynecological surgical procedures which are frequently performed in physicians' offices in South Carolina. These would include suction curettage procedures performed on women who have experienced an incomplete spontaneous abortion, dilation and curettage procedures, endometrial biopsies, hysteroscopies, and insertion of intrauterine devices for birth control. See id.\n\nFourth, the district court found that first trimester suction curettage abortions are also comparable in terms of risks, duration, and invasiveness to a variety of non-obstetrical/gynecological surgical procedures that are frequently performed in physicians' offices in South Carolina. These would include the removal of subcutaneous lipomas and cysts, minor breast biopsies, and the removal of implanted ports and catheters which have been inserted into large veins in the neck and collarbone region for use in administering chemotherapy and dialysis. See id.\n\nFifth, the district court found that South Carolina is not currently experiencing a public health problem related to the provision of first trimester abortions by licensed physicians, nor was the state experiencing such a problem when Regulation 61-12 was promulgated. The district court found no evidence that the plaintiffs or any other abortion providers in South Carolina are providing inadequate care to women seeking abortions or that the rate of complications from abortions performed in South Carolina is greater than the national average. On the contrary, the district court found that South Carolina has experienced a similar, if not lower, average complication rate. See id. at 718-19.\n\nSixth, the district court found that, although the principal draftsmen of Regulation 61-12 have some expertise in hospital and health care administration, they have no training or education in the provision of hands-on medical care and little knowledge of the medical needs of women seeking first trimester abortions in South Carolina. See id. at 719. The district court found that they engaged in virtually no research, investigation, or other efforts to determine what types of requirements would be necessary or advisable for the abortion procedure, or what types of requirements would further or hinder the state's interest in maternal health. Nor did DHEC officials possess or seek information concerning the present safety of first trimester abortions or the relative risks associated with the procedure. See id.\n\nSeventh, the district court found that, despite their admitted lack of medical knowledge in general and of abortion procedures in particular, the drafters of Regulation 61-12 sought only minimal input and assistance from knowledgeable medical experts during the drafting process, choosing to rely solely upon the limited review and advice of Dr. Goodrich and Lawyer as to discrete portions of the regulation. See id. Furthermore, DHEC either rejected or ignored an offer by ACOG to assist in the drafting process. Although DHEC was under no legal obligation to consult with ACOG or to accept their assistance during the drafting process, the district court found that ACOG is unanimously considered to be a well-respected medical organization dedicated to improving the standard of health care in the field of obstetrics and gynecology. See id. According to the district court, DHEC's rejection of ACOG's assistance further demonstrated DHEC's lack of interest in ensuring that Regulation 61-12 actually met the proffered goal of promoting maternal health and is consistent with the testimony of the DHEC witnesses that such a goal was not their primary motivation during the drafting process. See id.\n\nEighth, the district court found that, although it is uncontroverted that first trimester abortions are significantly less risky to the health of women than second trimester abortions, an existing South Carolina regulation governing second trimester abortions was utilized as a starting point for Regulation 61-12. With the exception of Section 309 of Regulation 61-12 which specifically pertains to second trimester abortions,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the DHEC drafters drew no distinction between first and second trimester abortions in the text of the regulation. In addition, the DHEC drafters admitted that virtually no such distinctions were considered during the drafting process. See id.\n\nNinth, the district court found that, instead of attempting to tailor Regulation 61-12 to the particularized medical needs of women seeking first trimester abortion services in South Carolina, DHEC's goal during the drafting process was to standardize its health care and facility regulations and to codify existing departmental practices. See id. at 719-20. According to the district court, to the extent this was done, it was done without any meaningful inquiry or assessment as to whether the requirements would further the state's interest in maternal health and without assessing whether first trimester abortions were comparable to the procedures performed in the other facilities regulated by DHEC. See id. at 720. The district court further found that clinics that provide first trimester abortions provide services that are significantly less risky, invasive, and lengthy than the services offered in ambulatory surgical centers, yet many of the requirements of Regulation 61-12 are as stringent, or in some respects more stringent, than those imposed upon ambulatory surgical centers.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See id.\n\nTenth, the district court found that Planned Parenthood, NAF, and ACOG standards and guidelines relied upon in part by DHEC are recommendations by the respective organizations and are not fairly characterized as mandated standards of care which can or should be imposed upon licensed physicians as regulatory requirements. Rather, they are guidelines which should be followed with due regard for the medical judgment of the treating physicians and the special needs of the patients they serve. Even if some of the existing guidelines could, in isolation, be appropriate matters for regulation, the district court found that Regulation 61-12 imposes requirements which greatly exceed the guidelines. See id.\n\nEleventh, the district court found that, in imposing the detailed requirements of Regulation 61-12, the DHEC drafters also failed to take any meaningful steps to evaluate the costs of compliance or its impact upon the availability of abortion services in South Carolina. See id. Based upon the evidence presented, the district court found that Regulation 61-12 will significantly increase the cost of abortion services in South Carolina. See id. The district court found that this increase in the cost of abortion services will delay a significant number of women from obtaining the procedure and, in some cases, result in their inability to obtain the procedure. See id. The district court further found that, as a pregnancy advances, the medical risks associated with abortion increase, and a full term pregnancy and childbirth is much more risky to the physical health of a woman than a first trimester abortion. See id.\n\nTwelfth, the district court found that Regulation 61-12 contained a myriad of detailed and costly provisions that were medically unnecessary and, thus, were neither designed to further the health of women seeking first trimester abortions nor likely to accomplish this goal. For example, with respect to Part I of Regulation 61-12, the district court observed that its definition of an \"abortion\" included medical abortions currently used to terminate ectopic pregnancies. See id. at 721. However, all of the evidence in the record, including the testimony of Dr. Goodrich, suggested that Regulation 61-12's stringent requirements were medically unnecessary for a physician or abortion clinic that performed only medical abortions.\n\nWith respect to Part II, the district court found that this portion of Regulation 61-12 is permeated with unnecessary requirements governing physician qualifications, staffing, and staff training. See id. The district court observed that Regulation 61-12 requires physicians and clinics to hire a registered nurse to supervise all nursing care in the abortion clinic regardless of the fact that a licensed physician is present in the clinic to supervise all medical care, including nursing care. See id. The district court found that it is within accepted medical practice, both within the abortion context and in physicians' offices performing comparable surgical procedures, for a physician to hire licensed practical nurses (who command a lower salary than registered nurses) so long as they act under the supervision of the attending physician. See id. The district court found that the defendants offered no persuasive reason why a physician could not supervise the nursing care of patients during the recovery process simply because the physician may be in another room for a brief period of time. See id. In making this finding, the district court recognized that even DHEC's own medical consultant, Dr. Goodrich, opined that a registered nurse need not be on the premises to supervise care--only that the nurse have overall supervisory duties. See id. Also with respect to Part II, the district court found that Part II's requirement that all abortion clinic health care personnel receive tuberculin skin testing is medically unnecessary in view of the fact that DHEC has not required such testing of all health care personnel and did not offer any justification for arbitrarily requiring this testing of all abortion care workers, but not all other health care workers. See id. at 722.\n\nThe district court also found that Regulation 61-12's requirement that all allied health care personnel in abortion clinics receive CPR training, as opposed to having one qualified person at the clinic at all times, was medically unnecessary in view of the fact that this requirement is imposed solely upon abortion providers who perform, according to all of the witnesses, one of the safest surgical procedures that is performed in this country, and DHEC did not offer any justification for arbitrarily imposing this requirement. See id.\n\nWith respect to Part III, the district court found that the level of policies and procedures required by this part, as well as the extensive in-service training requirements and other policies required in Part II, are costly endeavors unsubstantiated by a medical need. See id. The district court observed that such requirements may be appropriate for large medical care facilities with large staffs that do not interact on a daily basis. See id. However, according to the district court, Regulation 61-12 arbitrarily imposes it upon every clinic and every physician's office which performs five or more first trimester abortions per month--regardless of the number of staff or hours of operation. See id.\n\nThe district court also found that it was medically unnecessary to have every woman undergo (and pay for) testing for certain sexually transmitted diseases (but not others), without regard to whether such tests are medically indicated and indeed even when the physician determines that they are not, simply because the woman has chosen to obtain a first trimester abortion from a physician who performs them on a regular basis.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e See id. The district court further found that Section 307's requirement that abortion providers have \"consulting\" arrangements with various specialists before they can obtain a license to operate is medically unnecessary and unduly burdensome because no evidence was presented relating to why licensed physicians are not capable of exercising appropriate discretion in recognizing and acting upon the medical needs of their patients in this regard. See id. at 722-23.\n\nAlso with respect to Part III, the district court found that Regulation 61-12 inexplicably imposes requirements concerning access to emergency drugs which are not imposed upon any other physicians. See id. at 723. The district court also found that the equipment and supplies required by Regulation 61-12 will also increase the costs of providing abortions in South Carolina, and require equipment unnecessary for the safe performance of the first trimester abortion procedure. See id.\n\nWith respect to Part IV, the district court found that this part of Regulation 61-12 was particularly troubling. For example, the district court found that the requirement that a woman seeking an abortion provide the name of her spouse in addition to an emergency contact is a medically unnecessary requirement which imposes a substantial obstacle in the path of a woman who, for personal reasons, may not wish to disclose this information. See id. The district court also found that, although the abortion clinic was required to keep patient records confidential, nothing prohibited DHEC from publicizing these records once it obtained them pursuant to an inspection. See id. at 702.\n\nWith respect to Part VIII, the district court observed that this part of Regulation 61-12 imposed extensive and detailed design and construction requirements for abortion facilities, which far exceed building code requirements applicable to other physicians' offices, including those that perform identical and comparable procedures. See id. at 723. The district court found that these extensive requirements, while perhaps appropriate for a hospital or large ambulatory surgical center, are not justified by expected medical benefits to the women undergoing the relatively safe, first trimester suction curettage abortion in a small physician's office or clinic. See id.\n\nAlso with respect to Part VIII, the district court found that additional requirements, which were advanced as unique to the medical field, had no justification in medical necessity. For example, the district court found no evidence supporting a need for an abortion clinic to install additional bathroom equipment and emergency call buttons or that it have a recovery area separate from the procedure area. See id. at 724. The district court further found that no credible evidence was presented demonstrating that physicians should be required to widen their doors and corridors to a width sufficient to accommodate both an ambulance stretcher and a person walking alongside to perform cardiopulmonary resuscitation, particularly given the unanimous testimony that a first trimester abortion is a relatively safe procedure with infrequent complications. See id. The district court found no evidence that this need had ever arisen from the performance of a first trimester abortion in South Carolina or elsewhere. See id. Finally, the district court observed that physicians performing surgical procedures of comparable invasiveness and risk are not required to renovate their offices to meet a similar requirement. See id.\n\nWith respect to Part IX, the district court found that this part of Regulation 61-12 required numerous certifications and laboratory test results concerning various parts of the abortion clinic (such as the carpets and draperies) without any evidence that the these requirements would further the goal of protecting women's health in South Carolina. See id.\n\nWith respect to Part X, the district court observed that, in conjunction with Section 103(C), Part X grants to DHEC unfettered power to \"manage[ ]\" abortion providers \"in accordance with the best practices as interpreted by the Department,\" S.C. Code Ann. Regs. 61-12, Part X, and to cite providers with a Class III violation and penalty if DHEC observes a condition deemed to be \"against the best practices as interpreted by the Department,\" id.§ 103(C). The district court found that Part X imposed upon abortion providers the additional burden of determining and complying with standards or practices not specified in the regulation, but which DHEC may in the future find to be \"best\" for an abortion clinic. See Greenville Women's Clinic, 66 F. Supp. 2d at 724.\n\nFinally, the district court found that a first trimester suction curettage abortion in South Carolina currently costs between $325 and $480, depending on the gestational age, the type of sedation or anesthesia needed, and the medical testing indicated. See id. at 717. The district court further found that Regulation 61-12 would raise the cost of each abortion performed by the plaintiffs in the following ranges:\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\n(1) For CWMC, the cost will increase between $36.48 and $75.03;\n\n(2) For Dr. Lynn's Greenville practice, the cost will increase between $93.09 and $170.39;\n\n(3) For Dr. Lynn's Beaufort practice, the cost will increase between $115.67 and $367.50;\n\n(4) For GWC, the cost will increase between $22.68 and $32.39.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e See id.\n\nThe district court found that the substantial alterations that Dr. Lynn would have to undertake to bring his Beaufort practice in compliance with Regulation 61-12 will likely force him to close his practice, thereby eliminating the availability of abortions in this area of South Carolina.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e See id. The district court also found that the increased cost of providing abortions and/or the closure of the only abortion clinic in one area of a state resulting from Regulation 61-12 will prevent a significant number of women from obtaining an abortion or, at a minimum, delay them from obtaining the abortion, both of which carry increased risks to the health of women.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e See id. at 718. The district court found that, as a pregnancy advances, the medical risks associated with an abortion procedure increase, and a full term pregnancy is more risky to the physical health of a woman than a first trimester abortion. See id. at 720.\n\nF.\n\nBased on the findings of the district court summarized above, the district court concluded that Regulation 61-12 violated the Due Process and Equal Protection Clauses of the Fourteenth Amendment. See id. at 724-43. With respect to the Due Process Clause, the district court held that Regulation 61-12 failed to pass constitutional muster under either the facial invalidity standard set forth in United States v. Salerno, 481 U.S. 739 (1987), or the undue burden test set forth in Planned Parenthood v. Casey, 505 U.S. 833 (1992) (plurality joint opinion of O'Connor, Kennedy, and Souter, J.J.). See Greenville Women's Clinic, 66 F. Supp. 2d at 727-37. With respect to the undue burden standard set forth in Casey, the district court held that Regulation 61-12 did not serve and was not designed to serve the state's interest in maternal health. See id. at 730-35. To the contrary, the district court concluded that Regulation 61-12 would likely harm the health of women in South Carolina. See id. Accordingly, the district court concluded that Regulation 61-12 was unconstitutional under Casey. See id. at 735. The district court also concluded that even if Regulation 61-12 furthered the state's interest in maternal health, the burdens imposed by Regulation 61-12 upon abortion patients and providers constituted an undue burden on a woman's right to have an abortion prior to viability. See id. at 735-43. With respect to the standard set forth in Salerno, the district court concluded that Regulation 61-12 was unconstitutional in all of its applications and, therefore, could not stand under Salerno. See id. at 736-43.\n\nWith respect to the Equal Protection Clause, the district court held that Regulation 61-12 violated the Equal Protection Clause under both the strict scrutiny test and the more lenient rational basis test. See id. at 737-43. With respect to the rational basis test, the district court held that Regulation 61-12 failed that test because it singles out physicians and abortion clinics performing five or more first trimester abortions per month from other physicians and clinics performing four or less first trimester abortions per month and/or other virtually identical procedures and places additional and onerous burdens upon physicians and abortion clinics which are neither justified by actual differences nor rationally related to the state's legitimate interest in protecting the health and safety of women seeking first trimester abortions. See id. at 740-43. Finally, the district court concluded, in light of both South Carolina law and the text of Regulation 61-12, that Regulation 61-12 was not subject to the doctrine of severability.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e See id. at 743-44.\n\nII.\n\nA.\n\nThe Due Process Clause of the Fourteenth Amendment states that: \"nor shall any State deprive any person of life, liberty, or property, without due process of law.\" U.S. Const. amend. XIV, § 1. \"Although a literal reading of the Clause might suggest that it governs only the procedures by which a State may deprive persons of liberty, . . . the Clause has been understood to contain a substantive component as well, one barring certain government actions regardless of the fairness of the procedures used to implement them.\" Casey, 505 U.S. at 846 (plurality joint opinion of O'Connor, Kennedy, and Souter, J.J.) (citation and internal quotation marks omitted). A woman's right to have an abortion is recognized as a fundamental right protected by the substantive component of the Due Process Clause of the Fourteenth Amendment. See Roe v. Wade, 410 U.S. 113, 155-66 (1973); see also Manning v. Hunt, 119 F.3d 254, 259 (4th Cir. 1997).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIn Roe, the Supreme Court overturned a Texas statute prohibiting abortions unless an abortion was necessary to save the life of the mother. See 410 U.S. at 117-18. The Roe Court held that the right of personal privacy includes the right to have an abortion, but that the right \"is not unqualified and must be considered against important state interests in regulation.\" Id. at 154. The Court determined that because abortion is a fundamental right, state abortion regulations should be analyzed under the strict scrutiny standard of review, and are, therefore, valid only if the regulation can be justified by a compelling state interest and if the regulation was narrowly drawn to further only that legitimate state interest. See id. at 155. According to the Court, the state's interest in preserving and protecting the health of the mother and in protecting potential human life increase in substantiality as the woman approaches term, becoming compelling at some point in the pregnancy. See id. at 162-63.\n\nThe Roe Court found that during the first trimester of pregnancy the decision to abort must be left to the wishes of the mother and the judgment of the mother's physician; that during the time after the first trimester but before viability of the fetus, the state could regulate the abortion decision in ways reasonably related to maternal health; and that after viability, the state could regulate or proscribe abortion except when necessary to preserve the life or health of the mother. See id. at 164-65.\n\nSince Roe, the Court has struggled to formulate a precise standard for reviewing facial challenges to abortion regulations. In Salerno, the Court explained that\n\n[a] facial challenge to a legislative Act is, of course, the most difficult challenge to mount successfully, since the challenger must establish that no set of circumstances exists under which the Act would be valid. The fact that[an Act] might operate unconstitutionally under some conceivable set of circumstances is insufficient to render it wholly invalid, since we have not recognized an \"overbreadth\" doctrine out side the limited context of the First Amendment. 481 U.S. at 745.\n\nThus, under Salerno, a facial challenge to a statute will fail if the statute has any constitutional application. Following Salerno, the Supreme Court applied Salerno 's \"no set of circumstances\" test in a few pre-Casey cases involving abortion statutes. See, e.g., Rust v. Sullivan, 500 U.S. 173, 183 (1991).\n\nIn Casey, however, the Court held that an abortion law is unconstitutional on its face if, \"in a large fraction of the cases in which [the statute] is relevant, it will operate as a substantial obstacle to a woman's choice to undergo an abortion.\" 505 U.S. at 895. Although Casey did not expressly overrule Salerno, it is inconsistent with Salerno. Under Salerno, no factual showing of unconstitutional application can render a law unconstitutional if it has any constitutional application. Under Casey, a factual showing of unconstitutional application in \"a large fraction of the cases\" where the law applies can render a law unconstitutional, even if it has some constitutional application.\n\nIn Casey's wake, many circuit courts held that Casey displaced Salerno in the abortion context. See, e.g. , Planned Parenthood v. Lawall, 180 F.3d 1022, 1027 (9th Cir.) (\"In light of our previous suggestion, combined with the great weight of authority holding that Casey has overruled Salerno in the context of facial challenges to abortion statutes, we apply Casey's undue burden standard in determining the facial constitutionality of [the statute at issue].\"), amended by 193 F.3d 1042 (9th Cir. 1999); Women's Med. Prof'l Corp. v. Voinovich, 130 F.3d 187, 193-96 (6th Cir. 1997) (concluding that Salerno is inapplicable to facial challenges to abortion regulations and applying Casey's undue burden standard), cert. denied, 523 U.S. 1036 (1998); Jane L. v. Bangerter, 102 F.3d 1112, 1116 (10th Cir. 1996) (noting the difference between Casey and Salerno and applying Casey's undue burden standard to facial abortion challenge); Planned Parenthood v. Miller, 63 F.3d 1452, 1458 (8th Cir. 1995) (choosing to follow \"what the Supreme Court actually did--rather than what it failed to say--and apply the undue-burden test\" to facial abortion challenge); Casey v. Planned Parenthood, 14 F.3d 848, 863 n.21 (3d Cir. 1994) (noting that Supreme Court in Casey \"set a new standard for facial challenges to pre-viability abortion laws\"). The Fifth Circuit has applied the Salerno test to a facial abortion challenge after Casey, see Barnes v. Moore, 970 F.2d 12, 14 (5th Cir. 1992), but its application of Salerno has not been consistent, see Sojourner T. v. Edwards, 974 F.2d 27, 29-31 (5th Cir. 1992) (striking down statute banning abortions as clearly unconstitutional under Casey, even though it permitted abortions to save the life of the mother and, therefore, arguably passed constitutional muster under Salerno), and the Fifth Circuit has yet to resolve the inconsistency. See Okpalobi v. Foster, 190 F.3d 337, 354 (5th Cir. 1999) (noting inconsistency but declining to address it because challenged law failed under both Casey and Salerno).\n\nHowever, our circuit never resolved the Salerno /Casey question, despite what the majority might have one believe. See ante at 12-13. In Manning, we applied the Salerno standard of review to an abortion statute, but the plaintiffs did not challenge its applicability. See 119 F.3d at 268 n.4. In dicta, however, the court suggested that we would nonetheless apply the Salerno standard until the Supreme Court explicitly overruled it, stating that\n\n[i]t is not the province of the court of appeals to predict how the Supreme Court will ultimately rule on an issue. Casey does not specifically overrule Salerno. At the moment, the most that can be said is that three Justices have indicated a desire to do so. Until the Supreme Court specifically does so, though, this Court is bound to apply the Salerno standard as it has been repeatedly applied in the context of other abortion regulations reviewed by the Supreme Court. Id.; see also Planned Parenthood v. Camblos, 155 F.3d 352, 381 n.14 (4th Cir. 1998) (en banc) (noting the Manning dicta but not deciding the question), cert. denied, 525 U.S. 1140 (1999); id. at 389 n.2 (Michael, J., concurring in the judgment) (asserting that Casey's undue burden test must be applied to facial challenges to abortion restrictions).\n\nThe Salerno/Casey question was finally resolved by the Supreme Court in Stenberg v. Carhart, No. 99-830, 2000 WL 825889 (U.S. June 28, 2000). In that case, a Nebraska physician brought a facial challenge to Nebraska's \"partial birth\" abortion statute. As interpreted by the Supreme Court, the Nebraska statute banned the performance of second trimester dilation and extraction (D \u0026 X) abortions, commonly referred to as \"partial birth abortions,\" and the performance of dilation and evacuation (D \u0026 E) abortions, the most commonly used method for performing previability second trimester abortions. The Supreme Court applied Casey and concluded that the Nebraska statute was unconstitutional for two independent reasons. First, the Court concluded that the Nebraska statute was unconstitutional because the statute lacked any exception for the preservation of the health of the mother and the record evidence disclosed that, in some circumstances, a D \u0026 X abortion would be the safest abortion. See Stenberg, No. 99-830, 2000 WL 825889, at *10-14. Second, the Court concluded that, because the Nebraska law applied to the performance of D \u0026 E abortions, the most commonly used method for performing previability second trimester abortions, the resulting fear of prosecution, conviction, and imprisonment felt by physicians who perform D \u0026 E abortions amounted to an undue burden on a woman's right to have an abortion. See id. at *15-19.\n\nIn this case, the district court did not resolve the Salerno/Casey question. See Greenville Women's Clinic, 66 F. Supp. 2d at 726-27. Instead, the district court analyzed Regulation 61-12 under both standards and held that Regulation 61-12 failed to pass constitutional muster under either the Salerno or Casey standard. See id. at 727-37. Here, being bound by Stenberg, I only need to evaluate Regulation 61-12 under the principles set forth in Casey , as contrary to the majority's intimation, see ante at 12-13, Salerno, in the abortion context, is not recognized as the law by the current Supreme Court.\n\nIn Casey, the Supreme Court established the undue burden test for determining whether a statute restricting abortions could pass constitutional muster. Under Casey, a statute is invalid on its face if it places an undue burden on a woman's right to have an abortion before the fetus attains viability. See 505 U.S. at 878. An undue burden exists if the state regulation has the effect of placing a substantial obstacle in the path of a woman's choice to obtain an abortion before the fetus attains viability. Id. at 877-78. A statute that creates a substantial obstacle for a large fraction of those women affected by the regulation creates an undue burden and is facially unconstitutional. See id. at 894-95. Thus, in Casey, the Court rejected Roe's trimester framework, but left intact a woman's fundamental right \"to choose to have an abortion before viability and to obtain it without undue interference from the state.\" Id. at 846. In reaching this conclusion, the Court recognized that the state's interests prior to viability \"are not strong enough to support a prohibition of abortion or the imposition of a substantial obstacle to the woman's effective right to elect the procedure.\" Id.\n\nIn Casey, the Supreme Court was presented with constitutional challenges to various provisions in a Pennsylvania statute governing informed consent, parental consent, record-keeping and reporting requirements, and a medical emergency exception. See id. at 844. Thus, the plurality opinion primarily focused on the state's legitimate interests in the potentiality of human life--holding that to promote this \"profound interest in potential life, throughout pregnancy the State may take measures to ensure that the woman's choice is informed, and measures designed to advance this interest will not be invalidated so long as their purpose is to persuade the woman to choose childbirth over abortion\" and they do not impose an \"undue burden on the right.\" Id. at 878.\n\nNevertheless, the Casey plurality also provided guidance by addressing the state's concomitant, and equally legitimate, interest in preserving and protecting the health of women seeking abortion services--of particular relevance to the challenge in this case. Specifically, the Casey plurality held that as\n\nwith any medical procedure, the State may enact regulations to further the health or safety of a woman seeking an abor tion. Unnecessary health regulations that have the purpose or effect of presenting a substantial obstacle to a woman seeking an abortion impose an undue burden on the right. Id. at 878 (emphasis added).\n\nThe types of burdens that may be imposed by state regulation are varied in nature, but clearly include financial burdens which restrict or prohibit the exercise of the right. As noted by the Casey plurality:\n\nNumerous forms of state regulation might have the inciden tal effect of increasing the cost or decreasing the availability of medical care, whether for abortion or any other medical procedure. The fact that a law which serves a valid purpose, one not designed to strike at the right itself, has the inciden tal effect of making it more difficult or more expensive to procure an abortion cannot be enough to invalidate it. Only where the state regulation imposes an undue burden on a woman's ability to make the decision does the power of the State reach into the heart of the liberty protected by the Due Process Clause. Id. at 874; see also id. at 901. Furthermore, \"[n]ot all burdens on the right to decide whether to terminate a pregnancy will be undue.\" Id. at 876. As the Casey plurality noted:\n\nA finding of an undue burden is a shorthand for the conclu sion that a state regulation has the purpose or effect of plac ing a substantial obstacle in the path of a woman seeking an abortion of a nonviable fetus. A statute with this purpose is invalid because the means chosen by the State to further the interest in potential life must be calculated to inform the woman's free choice, not to hinder it. And a statute which, while furthering the interest in potential life or some other valid state interest, has the effect of placing a substantial obstacle in the path of a woman's choice cannot be consid ered a permissible means of serving its legitimate ends. Id. at 877.\n\nAccordingly, the court must first determine whether Regulation 61-12 furthers the state's interest in maternal health, which is the state interest the defendants contend Regulation 61-12 was designed to serve. See id.; id. at 900-01 (\"The collection of information with respect to actual patients [which, under the statute at issue, will remain confidential] is a vital element of medical research, and so it cannot be said that the requirements serve no purpose other than to make abortions more difficult.\"). If Regulation 61-12 furthers the state's interest in maternal health, the court must next determine whether Regulation 61-12 imposes an undue burden on a woman's right to seek an abortion. See id. at 877, 901.\n\nIn this case, a careful review of the record discloses that Regulation 61-12 does not further the state's interest in maternal health. With respect to whether Regulation 61-12 furthers the state's interest in maternal health, I note that the Supreme Court has not provided much guidance in this area. However, several pre-Casey cases do provide some insight. For example, in Roe's companion case, Doe v. Bolton, the Court invalidated a Georgia law requiring that all first trimester abortions be performed in a licensed hospital where the state failed to show that only the hospital environment could ensure the quality of the operation and the protection of the patients. See 410 U.S. at 195.\n\nIn Akron v. Akron Center for Reproductive Health, Inc., 462 U.S. 416 (1983), the Supreme Court was presented with a challenge to an Ohio ordinance which, among other things, required all second trimester abortions to be performed in a hospital. See id. at 422. Reaffirming the prohibition against over regulation of a relatively safe surgical procedure, the Court held that the\n\n[s]tate's discretion to regulate on [the basis of maternal health] does not . . . permit it to adopt abortion regulations that depart from accepted medical practice. . . . If a State requires licensing or undertakes to regulate the performance of abortions during this period, the health standards adopted must be legitimately related to the objective the State seeks to accomplish. Id. at 431 (citation and internal quotation marks omitted).\n\nThe Court then invalidated the ordinance, holding that it\"imposed a heavy, and unnecessary, burden on a woman's access to a relatively inexpensive, otherwise accessible, and safe abortion procedure.\" Id. at 438.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nFrom the above discussion, it is evident that the State of South Carolina has a legitimate interest from the outset of pregnancy in protecting the health of women seeking abortions, and that this interest is sufficiently important to allow the state to regulate abortion providers, including providers that limit their services to abortions during the first trimester. See Casey, 505 U.S. at 876. Furthermore, this interest allows the state to regulate, within the boundaries of Casey and its predecessors, such matters as the qualifications of the person performing the procedure, the facilities in which the abortions are performed, and the availability of medical care after the procedure and in the event of an emergency. See Roe, 410 U.S. at 149-50. However, Casey and its predecessors teach us that health regulations which are unnecessary, i.e., not reasonably related to maternal health or which depart from accepted medical practice, cannot withstand constitutional scrutiny and must be invalidated. See Casey, 505 U.S. at 878; Akron, 462 U.S. at 431.\n\nIn my view, Regulation 61-12 is riddled with unnecessary requirements, i.e., requirements not reasonably related to maternal health or which depart from accepted medical practice. For example, Regulation 61-12's requirement that each abortion patient be tested for particular sexually transmitted diseases is not an accepted medical practice where there are no symptoms or other accepted medical reasons or risk factors to justify such a test.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Also, Regulation 61-12 requires an abortion clinic to perform urine pregnancy tests on all abortion patients, including those whose pregnancy have been confirmed by other means, e.g., ultrasound. In addition, Regulation 61-12 places medically unnecessary administrative requirements on abortion clinics which are clearly inappropriate to medical offices of such small sizes as the plaintiffs' offices. For example, DHEC has mandated--without regard to the number of staff or size of the abortion clinic--the development of extensive policies and procedures, frequent staff meetings, formal in-service training and required staff certifications, and medical testing of employees which, while probably appropriate for a hospital or a large outpatient surgical center, are unnecessary in a small physician's office or clinic. Furthermore, there is no evidence in the record demonstrating how Regulation 61-12's construction and design requirements will further the health of women seeking abortions in South Carolina, and no explanation is offered as to why all of these requirements are so much greater for these clinics than they are for other physicians' offices performing the same type of procedures.\n\nAnother requirement which is not an accepted medical practice is Regulation 61-12's requirement that a registered nurse, as opposed to a licensed physician, supervise nursing care. There is no evidence in the record to suggest that a physician is not capable of supervising nursing care. In addition, Regulation 61-12 requires that an abortion clinic \"be kept . . . free from odors\" and that all outside areas \"be kept free of rubbish, grass, and weeds that may serve . .. as a haven for insects, rodents and other pests.\" S.C. Code Ann. Regs. 61-12, §§ 604 and 606. However, there is no evidence in the record suggesting that these requirements would ensure the quality of a first trimester abortion procedure or the protection of patients.\n\nThe same can be said about Part X of Regulation 61-12 which grants DHEC the authority to impose penalties for any condition which, while not mandated or prohibited by Regulation 61-12, DHEC deems to be \"against the best practices\" as later defined by DHEC. Id. Part X. Obviously, Part X of Regulation 61-12 subjects physicians to unnecessary uncertainty in the operation of their practices and invites arbitrary enforcement. Finally, it is not an accepted medical practice to permit a state agency, such as DHEC, to enter an abortion clinic, copy records, and disseminate them publicly, but this is precisely what Regulation 61-12 allows.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e In summary, Regulation 61-12 does not further the state interest of protecting maternal health. In fact, Regulation 61-12 has the opposite effect. As found by the district court, Regulation 61-12 will substantially increase the cost of abortions in South Carolina because Regulation 61-12 requires unnecessary tests be performed, unnecessary staff be hired, and, in some cases, extensive renovations to existing facilities be made. Because Regulation 61-12 will result in a substantial increase in the cost of obtaining an abortion in South Carolina, a significant number of women will be forced to either delay having an abortion, or forego having one altogether. This, in turn, will result in increased health risks to women seeking abortions. Accordingly, Regulation 61-12 serves no other purpose than to make abortions more difficult to obtain, and, therefore, Regulation 61-12 violates the Due Process Clause of the Fourteenth Amendment. See Casey, 505 U.S. at 877; id. at 900-01.\n\nThe majority concludes that Regulation 61-12 was designed to further the State of South Carolina's interest in maternal health largely on the basis that Regulation 61-12 is generally compatible with accepted medical practice governing abortions, more specifically, the guidelines promulgated by ACOG and NAF. See ante at 17-20. The majority's analysis ignores the significant departures that Regulation 61-12 makes from those guidelines, the attendant costs associated with those departures, and the effect of those costs on the availability of abortions in the State of South Carolina. Regulation 61-12 goes far beyond the recommendations of ACOG and NAF, and, in some cases conflicts with them. Thus, while the ACOG and NAF guidelines address physical plant and equipment needs in abortion clinics, they do not suggest or support the extensive plant and equipment requirements (such as mandating numerous separate rooms or areas, utility sinks, and specific air exchanges, sheltered entryways, special janitor's closets) included in Regulation 61-12. Similarly, the ACOG and NAF guidelines do not contain any recommendations supporting the staffing requirements imposed by Regulation 61-12. For example, none of the guidelines require that a registered nurse supervise nursing care in an abortion facility if the attending physician is able to supervise that care. In addition, the ACOG and NAF guidelines do not support the testing requirements imposed by Regulation 61-12; specifically, they do not call for any routine testing of abortion patients other than for Rh factor and anemia, and they state that sexually transmitted disease testing should be performed on the basis of risk factors. Likewise, while the ACOG guidelines address the administration of abortion clinics, they do not require the extensive written policies, procedures, and formal meetings required by Regulation 61-12. Also, the ACOG and NAF guidelines forbid the release of any medical information from a patient's record without the prior consent of the patient, thus conflicting with Regulation 61-12's mandate that abortion providers permit DHEC to copy and remove patient records. In addition, while the ACOG and NAF guidelines recommend that counseling be offered, Regulation 61-12 requires something very different. It mandates the establishment of relationships with outside specialists in various areas to whom patients can be referred. Finally, it should be noted that the district court found as a fact that the ACOG and NAF guidelines were just that, guidelines. They are not mandates.\n\nThe upshot of this discussion is that the departures from the ACOG and NAF guidelines listed above, coupled with many others not discussed, result in a substantial increase in the cost of obtaining an abortion in the State of South Carolina. As noted above, because Regulation 61-12 will result in a substantial increase in the cost of obtaining an abortion in South Carolina, a significant number of women will be forced to either delay having an abortion, or forego having one altogether. Also, the costs will likely force the closure of Dr. Lynn's Beaufort office, which will result in the elimination of abortion services in that part of South Carolina. Under such circumstances, one must conclude that Regulation 61-12 does not further the State of South Carolina's interest in maternal health.\n\nEven if Regulation 61-12 furthers the state interest of protecting and preserving the health of women seeking abortions, Regulation 61-12 cannot stand if it imposes an undue burden on a woman's fundamental right to obtain an abortion, see id. at 877-78, as a regulation which has \"the effect of placing a substantial obstacle in the path of a woman's choice cannot be considered a permissible means of serving its legitimate ends.\" Id. at 877. A review of the record makes it clear that Regulation 61-12 will impose an undue burden on the right to obtain an abortion prior to viability. As noted earlier, a first trimester suction curettage abortion in South Carolina currently costs between $325 and $480, depending on the gestational age, the type of sedation or anesthesia needed, and the medical testing indicated. Based on the costs of complying with Regulation 61-12, the district court found that Regulation 61-12 would raise the cost of each abortion performed by the plaintiffs in the following ranges: (1) for CWMC, the cost will increase between $36.48 and $75.03; (2) for Dr. Lynn's Greenville practice, the cost will increase between $93.09 and $170.39; (3) for Dr. Lynn's Beaufort practice, the cost will increase between $115.67 and $367.50; and (4) for GWC, the cost will increase between $22.68 and $32.39. See Greenville Women's Clinic, 66 F. Supp. 2d at 717. A significant increase in the cost of obtaining an abortion alone can constitute an undue burden on the right to have an abortion. See Casey, 505 U.S. at 901 (\"While at some point increased cost could become a substantial obstacle, there is no such showing on the record before us.\"). It follows that the decreased availability of abortions due to the closure of the only abortion clinic in one area of a state also constitutes an undue burden on the right to have an abortion, as it increases the distance a woman has to travel to obtain an abortion, thereby significantly increasing the time and the cost to obtain an abortion.\n\nRegulation 61-12 will impose a significant increase in the cost of obtaining an abortion in South Carolina, which, in turn, will prevent woman from obtaining abortions. For example, for a woman in Beaufort, South Carolina, the cost of a first trimester abortion will increase, at a minimum, $115.67, or, if Dr. Lynn's Beaufort practice closes because of Regulation 61-12, it may result in the elimination of abortion services in that part of the state altogether. Also the increased costs of providing abortions resulting from Regulation 61-12 at other facilities throughout South Carolina will prevent a significant number of women from obtaining an abortion or, at a minimum, delay them from obtaining an abortion, thus, resulting in increased health risks to women in South Carolina.\n\nRegulation 61-12 also imposes additional burdens, unrelated to cost, on the right to obtain an abortion. For example, Regulation 61-12 grants DHEC inspectors the right to inspect abortion clinics at will and without limitation; such inspections can be initiated by anonymous complaints. During any such inspection, DHEC inspectors are granted the right to copy confidential patient records, and Regulation 61-12 does not ensure that DHEC will keep these records confidential. Obviously, this requirement would have a chilling effect on a woman's freedom to choose to have, and a physician's willingness to preform, an abortion. Another example is Regulation 61-12's requirement that a married abortion patient disclose her husband's name. Obviously, this requirement is not necessary for the provision of safe medical care, and there are a host of reasons why a married patient would prefer not to disclose her husband's name. Cf. Casey, 505 U.S. at 893-98 (holding that Pennsylvania law requiring spousal notification prior to abortion imposes an undue burden on the right to have an abortion). Thus, this requirement also hinders a woman from obtaining an abortion. Finally, physicians performing five or more first trimester abortions per month must be licensed by the State of South Carolina and be \"properly qualified by training and experience to perform\" abortions. S.C. Code Ann. Regs. 61-12, § 205(C). However, Regulation 61-12 provides no guidance on the additional credentials required beyond that of a medical license to meet this qualification standard. Thus, physicians who perform five or more first trimester abortions per month operate under a constant fear that they will be declared \"unqualified\" by DHEC under some vague and amorphous standard. Obviously, this readily apparent fear would have a chilling effect on a physician's willingness to perform an abortion, thus, resulting in an adverse impact on a woman's ability to obtain an abortion. Cf. Stenberg, No. 99-830, 2000 WL 825889, at *19 (\"In sum, using this law some present prosecutors and future Attorneys General may choose to pursue physicians who use D \u0026 E procedures, the most commonly used method for performing previability second trimester abortions. All those who perform procedures using that method must fear prosecution, conviction, and imprisonment. The result is an undue burden upon a woman's right to make an abortion decision.\"). Under these circumstances, I am simply constrained to conclude that Regulation 61-12 imposes an undue burden on a woman's fundamental right to obtain an abortion. Cf. Ragsdale v. Turnock, 841 F.2d 1358, 1373-74 (7th Cir. 1988) (invalidating portions of a similar licensure regulation which mandated, among other things, detailed physical plant requirements, policies and procedures, and staffing requirements); Birth Control Ctrs., Inc. v. Reizen, 743 F.2d 352, 364-65 (6th Cir. 1984) (invalidating detailed, specific regulatory criteria governing the physical layout of abortion facilities, staffing requirements, and equipment requirements).\n\nIn its opinion, the majority concludes that Regulation 61-12 does not constitute an undue burden on a woman's right to obtain an abortion. See ante at 20-24. The pillar supporting the majority's holding is its observation that the plaintiffs failed to produce evidence demonstrating that the cost increases resulting from the promulgation of Regulation 61-12 would have an adverse effect on a women's ability to obtain an abortion in South Carolina. See ante at 22-23. This pillar is a transparent facade, at best.\n\nIn part, the district court's finding of an undue burden was premised on the testimony of the plaintiffs' expert, Dr. Stanley Henshaw. Dr. Henshaw testified that an increase of just $25 can be expected to prevent one or two out of every 100 low-income women seeking an abortion from being able to obtain one. Under Supreme Court case law, this constitutes an undue burden on a woman's right to obtain an abortion. See Casey, 505 U.S. at 894-95 (invalidating law that imposed substantial obstacle on a large fraction of the one percent of abortion patients who are married and do not voluntarily notify their spouses of the abortion).\n\nMoreover, the cost increases resulting from Regulation 61-12 will likely force Dr. Lynn to close his Beaufort practice. While traveling seventy miles on secondary roads may be inconsequential to my brethren in the majority who live in the urban sprawl of Baltimore, as the district court below and I conclude, such is not to be so casually addressed and treated with cavil when considering the plight and effect on a woman residing in rural Beaufort County, South Carolina.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nB.\n\nThe Equal Protection Clause states in relevant part that no state shall \"deny to any person within its jurisdiction the equal protection of the laws.\" U.S. Const. amend. XIV, § 1. The Equal Protection Clause requires that \"all persons similarly situated should be treated alike.\" City of Cleburne v. Cleburne Living Ctr., Inc., 473 U.S. 432, 439 (1985). However, the Equal Protection Clause's\"promise that no person shall be denied the equal protection of the laws must coexist with the practical necessity that most legislation classifies for one purpose or another, with resulting disadvantage to various groups or persons.\" Romer v. Evans, 517 U.S. 620, 631 (1996). Accordingly, \"if a law neither burdens a fundamental right nor targets a suspect class,\" the legislation will be upheld \"so long as it bears a rational relation to some legitimate end.\" Id.\n\nInitially, it must be determined what level of scrutiny should be applied to the classifications at issue, which are physicians and abortion clinics that perform five or more abortions per month. The plaintiffs urge the court to apply strict or heightened scrutiny because the classifications penalize the exercise of the fundamental right to have an abortion or, at a minimum, target a suspect or quasi-suspect class. On the other hand, the defendants contend that physicians do not constitute a suspect class for equal protection purposes and do not have a fundamental right to perform abortions. Accordingly, the defendants argue that the court should apply the rational basis test.\n\nCourts addressing the constitutionality of similar types of health care regulations have reached various conclusions under different tests. For example, in Friendship Medical Center, Ltd. v. Chicago Board of Health, 505 F.2d 1141 (7th Cir. 1974), the court invalidated abortion service regulations promulgated by the Chicago Board of Health which sought to regulate such things as the design of the medical facility, the type of medical staff and its training, the maintenance of equipment, supplies, and medications, the content of medical records, and the types of medical tests which must be administered to abortion patients. See id. at 1152-53. Applying strict scrutiny, the court invalidated the regulation on both due process and equal protection grounds, because fundamental rights were involved. See id. at 1148-52. With regard to the equal protection analysis, the court held as follows:\n\nGiven the Supreme Court's acceptance of the medical fact that the mortality rate of women receiving legal abortions is \"as low as or lower than the rates of normal childbirth,\" . . .\n\nthere would seem to be little justification for extensive gov ernmental regulations, purportedly based on health consider ations, for one procedure than the other. . . .\n\nThe Chicago Board of Health's Rules on Abortion Services regulate comprehensively physicians who perform abor tions, while at the same time leaving other medical proce dures, often much more complex and dangerous in terms of the patient's health, up to the good judgment of the physi cian. Id. at 1152 (quoting Roe, 410 U.S. at 149).\n\nBecause the defendants offered no sufficiently compelling reason to justify the difference in treatment, the court invalidated the regulations. See id. at 1153. It had previously noted, however, that \"on the record before th[e] court there is no basis for determining whether the regulations are even reasonably related to a valid state concern.\" Id. at 1150.\n\nThe Sixth Circuit has also been called upon to address comprehensive health regulations on several occasions. First, in Mahoning Women's Center v. Hunter, 610 F.2d 456 (6th Cir. 1979), vacated on other grounds, 447 U.S. 918 (1980), the court affirmed the district court's decision to invalidate, under the strict scrutiny test, a city ordinance imposing costly medical and building code requirements on first trimester abortion clinics, while leaving unregulated the performance of other medical and surgical procedures. See id. at 460-61.\n\nNext, the Sixth Circuit addressed the constitutionality of a Michigan licensing scheme which required all free-standing surgical outpatient facilities (FSOFs) to comply with staffing, structural, equipment, counseling, consent, and record-keeping requirements in order to obtain a license to operate. See Birth Control Ctrs., Inc., 743 F.2d at 357. Because the licensing scheme applied to abortion clinics, albeit not exclusively, four abortion clinics challenged the scheme on equal protection grounds because it exempted private physicians' offices where abortions were performed. See id. at 356-57. The court affirmed the district court's application of the rational basis test as the appropriate standard of review, because the \"differentiation between FSOFs and physicians' private offices did not involve any suspect class nor implicate any fundamental right.\" Id. at 358. In particular, the court held that \"no suspect classification was involved . . . since the state ha[d] chosen to regulate all FSOFs, not just abortion clinics,\" and distinguished Mahoning on this basis. Birth Control Ctrs., Inc., 743 F.2d at 358 \u0026 n.4.\n\nFinally, in Women's Health Center of West County, Inc. v. Webster, 871 F.2d 1377 (8th Cir. 1989), the Eighth Circuit, applying the rational basis test, upheld an abortion regulation which required emergency backup care against an equal protection challenge. See id. at 1381. The court noted that, although the regulation applied only to abortion providers, the state already required such backup care for all patients undergoing any outpatient surgery. See id. Thus, the regulation was a reasonable means of insuring the health of women seeking abortions and did not impose a special requirement upon abortion providers. See id. It is unnecessary for me to decide whether the strict scrutiny test or the rational basis test should be applied in this case because Regulation 61-12 is constitutionally infirm under the more lenient rational basis test. Under the rational basis test, the court must determine the relation between the classification adopted and the objective to be attained. Romer, 517 U.S. at 632. \"The search for the link between classification and objective gives substance to the Equal Protection Clause; it provides guidance and discipline for the legislature, which is entitled to know what sorts of laws it can pass; and it marks the limits of our own authority.\" Id. \"By requiring that the classification bear a rational relationship to an independent and legitimate legislative end, we ensure that classifications are not drawn for the purpose of disadvantaging the group burdened by the law.\" Id. at 633. Furthermore, even if the disadvantaged group does not rise to the level of a suspect class entitled to the application of strict scrutiny, the court must closely scrutinize laws that disadvantage a politically unpopular group because such laws \"raise[ ] the inevitable inference that the disadvantage imposed is born of animosity toward the class of persons affected.\" Id. at 634. \"`[I]f the constitutional conception of \"equal protection of the laws\" means anything, it must at the very least mean that a bare . . . desire to harm a politically unpopular group cannot constitute a legitimate governmental interest.'\" Id. at 634-35 (quoting Department of Agric. v. Moreno, 413 U.S. 528, 534 (1973)).\n\nThe defendants contend that Regulation 61-12 does not violate the Equal Protection Clause because its provisions are rationally related to the legitimate state interest of protecting the health and welfare of women seeking abortions in the state. I disagree.\n\nObviously, South Carolina has a legitimate interest in protecting the health and welfare of women seeking abortions in the state. South Carolina also has a legitimate interest in promulgating uniform, minimum standards for the performance of surgical procedures, including first trimester abortions. And South Carolina could constitutionally require that abortions only be lawfully performed by physicians licensed by the State Board of Medical Examiners to practice medicine pursuant to such uniform, minimum standards, thereby addressing any concern that unqualified, unlicenced physicians will come within its borders and establish unregulated abortion clinics performing unsafe abortion procedures. However, as the district court noted,\n\n[t]he regulation singles out physicians and clinics where abortions are performed regularly, as part of the normal course of business and in relatively large numbers, and imposes upon them requirements which are not imposed upon comparable procedures and not even upon all physi cians who perform first trimester abortions. In addition, the regulation's requirements reach far beyond those justified by actual differences in the procedure, or by the medical nature and risks of the procedure. . . .\n\nFurthermore, defendants have offered no satisfactory expla nation as to why the state standards applied to physicians' offices and clinics performing comparable procedures would not suffice to regulate first trimester abortion providers or ensure the health, safety and welfare of patients seeking abortions--much less an acceptable basis for excluding phy sicians and facilities which perform first trimester abortions on a more infrequent basis. . . .\n\nRegulation 61-12 singles out all physicians and clinics who perform more than the occasional first trimester abortion and requires of them a license to operate their office or clinic. To obtain the license, the physicians and clinics must comply with comprehensive mandates governing the physi cal layout of the clinic or office, the medical equipment which must be purchased and maintained, the cleaning, maintenance, and operation of the clinic and the requisite equipment, the management and training of the staff, and the type of medical care and tests which must be adminis tered and offered to the patients. The onerous, and largely unnecessary, requirements of this regulation are neither \"narrow enough in scope [nor] grounded in a sufficient fac tual context for [the court] to ascertain that there existed some relation between the classification and the purpose it is now alleged to serve.\" Greenville Women's Clinic, 66 F. Supp. 2d at 742-43 (quoting Romer, 517 U.S. at 632-33).\n\nIn summary, Regulation 61-12 singles out and places additional and onerous burdens upon abortion providers which are neither justified by actual differences nor rationally related to the state's legitimate interest in protecting the health and safety of women seeking first trimester abortions. Rather, \"its sheer breadth is so discontinuous with the reasons offered for it that [Regulation 61-12] seems inexplicable by anything but animus toward the class that it affects.\" Romer, 517 U.S. at 632. The fact that Regulation 61-12 was directed towards a politically unpopular group in the absence of any existing public health problem only bolsters this conclusion.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e See id. at 632-34.\n\nIII.\n\nThe only remaining issue in the case is the question of severability. The defendants contend that the district court erred in refusing to sever the unconstitutional portions of Regulation 61-12 from the constitutional portions. This argument is without merit. Whether Regulation 61-12 is subject to the doctrine of severability is a question of state, rather than federal, law. See Department of Treasury v. Fabe, 508 U.S. 491, 509-10 (1993). Under South Carolina law,\n\n[t]he test for severability is whether the constitutional por tion of the statute remains complete in itself, wholly inde pendent of that which is rejected, and is of such a character as it may fairly be presumed that the Legislature would have passed it independent of that which is in conflict with the Constitution. Thayer v. South Carolina Tax Comm'n, 413 S.E.2d 810, 815 (S.C. 1992) (citation and internal quotation marks omitted). Moreover, if the statutory or regulatory scheme does not contain a specific severability clause, the legislature or agency is presumed to have \"intended the act to be effected as an entirety or not at all.\" South Carolina Tax Comm'n v. United Oil Marketers, Inc., 412 S.E.2d 402, 405 (S.C. 1991).\n\nApplying this standard, I conclude that Regulation 61-12 is not a proper candidate for severance. Regulation 61-12 does not contain a severability provision, despite the fact that other DHEC regulations have included such provisions. See, e.g., S.C. Code Ann. Regs. 61-4, Part VI, § 601 (controlled substances regulation); S.C. Code Ann. Regs. 61-21, § T (sexually transmitted diseases). The absence of a severability clause is consistent with the scheme of the enabling legislation and the nature of the regulation. It is apparent that the South Carolina legislature intended for DHEC to create a comprehensive licensing scheme for abortion providers, as Regulation 61-12 sets forth areas to be addressed by the regulation as a whole, and the text of the regulation is comprehensive and interdependent, reflecting a similar intent that it stand or fall as a whole. In other words, because the South Carolina legislature directed DHEC to promulgate a comprehensive set of regulations governing virtually every aspect of the abortion procedure, it is evident that the South Carolina legislature intended for all of Regulation 61-12 to be enforced or none of it. Finally, I note that severance is simply not possible, as I am simply unable to \"untangle the constitutional from the unconstitutional provisions.\" Ragsdale, 841 F.2d at 1375.\n\nIV.\n\nI have some final comments concerning Part IV of the majority opinion. The accusatory tone of this portion of the majority opinion, aimed at me and the district judge who decided the case below, can only evince a majority which refuses to recognize that current Supreme Court precedent mandates that a woman still has the fundamental right to obtain an abortion. In its eagerness to uphold any impediment to a woman's fundamental right to a previability abortion, the majority, interjecting the emotional and psychological aspect of a woman's decision, would desensitize the real and basic issue to be addressed when evaluating such regulations--that is, whether the regulations are medically necessary and, if so, whether the regulations impose an undue burden on a woman's fundamental right to have an abortion at the previability stage of pregnancy. There is no doubt that the State of South Carolina can, within limits, treat abortions differently from other medical procedures. But to resolve the question of whether regulations governing abortions are medically necessary, some reference to comparable procedures is necessary, if not inevitable.\n\nWhen considering the majority's analysis based on its chosen and carefully selected facts, ignoring the findings of fact by the district court, it can only be concluded that the majority's opinion is based on its view of the law as it would like to see it and, perhaps more significantly, on not what the current law would dictate, but only what the majority prophecies the law will be if and when this case reaches the Supreme Court. This is simply unacceptable; cases are to be decided on what the law is. It's just that simple.\n\nTo sum up, Regulation 61-12 is violative of the Due Process and Equal Protection Clauses of the Fourteenth Amendment, and, under South Carolina law, Regulation 61-12 is not subject to the doctrine of severability. Accordingly, I would affirm the judgment of the district court.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nHAMILTON, Senior Circuit Judge, dissenting:\n\nAfter a six-day bench trial, the district judge, who presently is a judge on this court, wrote a ninety-four page decision setting forth innumerable factual findings which lead inexorably to the legal conclusions that South Carolina Code Annotated Regulation 61-12 violates both the Due Process and Equal Protection Clauses of the United States Constitution and that the unconstitutional portions of Regulation 61-12 are not severable from the constitutional portions. Cavalierly, the majority today sets aside this thorough and meticulous decision rendered by our esteemed colleague without identifying a single finding of fact made by him as being clearly erroneous. To accomplish this tour de force, the majority is compelled to set up and defeat a lack of evidence straw man. Unlike the majority, I believe the exhaustive and detailed factual findings made by the district judge amply support, more accurately compel, the decision rendered by him. Because I am in complete agreement with the district judge's holdings that South Carolina Code Annotated Regulation 61-12 violates both the Due Process and Equal Protection Clauses of the United States Constitution and that the unconstitutional portions of Regulation 61-12 are not severable from the constitutional portions, I dissent.\n\nI.\n\nThe constitutional issues presented in this case were hotly contested by the parties at trial, with each side putting forth extensive evidence in support of their respective positions. Based on the evidence presented, the district court resolved many factual disputes by making detailed findings of fact. Because many of the district court's factual findings are completely ignored by the majority, I set forth below the procedural history and facts of this case.\n\n\u003cspan class=\"fn\"\u003e1. An abortion clinic is defined as\"[a]ny facility, other than a hospital . . . in which any second trimester or five or more first trimester abortions per month are performed.\" S.C. Code Ann. Regs. 61-12, § 101(B). Accordingly, the definition of abortion clinic includes any physician's office in which five or more first trimester abortions per month are performed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Although the Governor of South Carolina appeals only the district court's order awarding costs and attorneys' fees, for ease of reference, I will refer to Bryant, the Governor of South Carolina, and the Attorney General of South Carolina as the defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Pregnancy is measured either from the date of a woman's lmp or from conception, which is generally considered to occur two weeks after a woman's lmp. Accordingly, eight weeks after the lmp is equivalent to six weeks from the date of conception. Under Regulation 61-12, the first trimester of pregnancy ends at fourteen weeks after the lmp. See S.C. Code Ann. Regs. 61-12, § 103(S).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Because the plaintiffs in this case only provide abortions during the first trimester of pregnancy, the plaintiffs' challenge to Regulation 61-12 is limited to its application to providers of first trimester abortions in South Carolina. Accordingly, I express no opinion as to the constitutionality of Regulation 61-12 as applied to facilities that may seek to perform second trimester abortions in the future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. By way of comparison, according to one of the plaintiffs' experts whose testimony was credited by the district court, having a first trimester suction curettage abortion is safer than having a shot of penicillin in a physician's office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. CLIA-88 has been amended, see 42 U.S.C.A. § 263a (West 1999). This amendment has no relevance to this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Interestingly, DHEC's regulation governing ambulatory surgical centers contains a specific provision protecting the confidentiality of medical records. See S.C. Code Ann. Regs. 61-91,§ 1001(E) (providing that records may only be removed from the premises by subpoena or court order).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Section 309 mandates additional qualifications which the performing physician must possess, additional equipment which must be on hand, and additional medical tests which must be administered for second trimester abortions. See S.C. Code Ann. Regs. 61-12, §§ 309(A)-(D).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In fact, Regulation 61-12 recognizes that the risks and potential complications of surgical procedures typically performed in ambulatory surgical centers are significantly higher than those associated with first trimester abortions. Under Regulation 61-12, licensed abortion clinics are restricted to performing abortions through eighteen weeks of pregnancy measured from the pregnant woman's lmp. See S.C. Code Ann. Regs. 61-12, § 302(A). Abortion clinics performing abortions beyond fourteen weeks of pregnancy measured from the pregnant woman's lmp must meet the additional patient requirements in Section 309 of Regulation 6112, which requires additional physician qualifications, medical equipment, and mandatory laboratory tests. See id. § 302(B). Abortions beyond eighteen weeks of pregnancy measured from the pregnant woman's lmp must be performed in a hospital, although a licensed ambulatory surgical center that is also licensed as an abortion clinic may perform abortions on patients through twenty-six weeks of pregnancy measured from the pregnant woman's lmp. See id. § 302(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Of note, the district court found that the defendants presented insufficient evidence to support a finding that sexually transmitted diseases are more prevalent in woman seeking abortions or that abortion clinics present a public health problem in this regard. See Greenville Women's Clinic, 66 F. Supp. 2d at 733 n.16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The lowest figure represents the defendants' revision of the plaintiffs' estimates of complying with Regulation 61-12. The highest figure represents the plaintiffs' estimate. The district court observed that neither figure, however, takes into account the standard 15% profit factor which the plaintiffs' accountant testified would be appropriate. See Greenville Women's Clinic, 66 F. Supp. 2d at 717 n.10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. At trial, the parties entered into several notable stipulations concerning the cost of complying with certain specific provisions of Regulation 61-12: (1) When directly billing physicians, laboratories in South Carolina generally charge between $20 and $40 per sample to perform a combined test for chlamydia and gonorrhea. (2) When directly billing physicians, laboratories in South Carolina generally charge between $17 and $30 per sample to test for the Du variant. (3) When directly billing physicians, laboratories in South Carolina charge between $7 and $20 per sample to perform a test for syphilis and between $10 and $22 to perform a test from a pap smear.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. At trial, the plaintiffs presented evidence that, to comply with Regulation 61-12, CWMC would require renovations costing approximately $27,235, that Dr. Lynn's Greenville practice would require renovations costing approximately $2,700, that Dr. Lynn's Beaufort office would need renovations costing approximately $12,256, and that GWC would need renovations costing approximately $3,700.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The district court's finding in this regard was premised on the testimony of the plaintiffs' expert, Dr. Stanley Henshaw, who is currently deputy director of research at the Alan Guttmacher Institute in New York, where he conducts studies relating to family planning and abortion services. Dr. Henshaw testified that an increase in the price of abortion procedures prevents a number of women from obtaining abortions and causes other women to delay their abortions until further along into their pregnancies. Dr. Henshaw also testified that relatively small increases in the cost of an abortion will have this effect, and that an increase of just $25 can be expected to prevent one or two out of every 100 low-income women seeking an abortion from being able to obtain one. Dr. Henshaw also testified that a decrease in the number of abortion providers in South Carolina will result in a decrease in the number of women who are able to obtain an abortion in the state, and a corresponding increase in the number of women who must travel to obtain the procedure, e.g., from Beaufort to Savannah, Georgia and/or Charleston, South Carolina. Such a need to travel will, in turn, reduce the ability to obtain an abortion or result in a delay in obtaining the abortion. And the need to travel carries its own costs, which will increase the overall cost of obtaining the abortion and compound the financial problem.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In light of its ruling that Regulation 61-12 violated the Due Process and Equal Protection Clauses of the Fourteenth Amendment, the district court declined to address the plaintiffs' remaining claims that Regulation 61-12: (1) was unconstitutionally vague; (2) violated the abortion patients' confidentiality rights; and (3) violated the Establishment Clause of the First Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Because Regulation 61-12 applies to first trimester abortion providers, the plaintiffs have standing to challenge the constitutionality of the regulation. See Virginia v. Am. Booksellers Ass'n, 484 U.S. 383, 392 (1988); Doe v. Bolton, 410 U.S. 179, 188 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Supreme Court in Casey overruled only those parts of Akron that were \"inconsistent with Roe's statement that the state has a legitimate interest in promoting the life or potential health of the unborn.\" Casey, fn505 U.S. at 870. Thus, the Akron decision continues to inform us as to the propriety of regulations purportedly enacted to further the state's interest in maternal health.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In the district court, the defendants argued that selected diseases are more prevalent in women seeking abortions or that abortion clinics present a public health problem in this regard. However, the district court found insufficient credible evidence to support such a finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The majority implies that Regulation 61-12 requires DHEC to treat all abortion patient records as confidential. See ante at 23-24. However, Regulation 61-12 imposes no such requirement on DHEC. Rather, under Regulation 61-12, only the abortion clinic must treat patient records as confidential. See S.C. Code Ann. Regs. 61-12, § 402. Succinctly put, Regulation 61-12 allows DHEC to enter an abortion clinic, inspect its records, and make photocopies of these records, see id. § 102(F), and Regulation 61-12 places no limitation on DHEC's use of the records once photocopies are made. Thus, Regulation 61-12 differs markedly from the provisions upheld by the Supreme Court in Whalen v. Roe, 429 U.S. 589 (1977), and Planned Parenthood v. Danforth, 428 U.S. 52 (1976), two cases cited by the majority. See ante at 23-24. In each of these cases, the statute at issue required the state agency which had access to the patient records to treat the records as confidential and/or significantly limited the state agency's use of the patient records. See Whalen, 429 U.S. at 594 (New York statute had extensive measures to insure records remained confidential and provided that the public disclosure of the identity of patients was expressly prohibited); Danforth, 428 U.S. at 79-81 (Missouri statute mandated that patient information required on patient forms was confidential and to be used only for statistical purposes). In my view, Regulation 61-12 is more akin to a provision of a Pennsylvania statute rejected by the Supreme Court in Thornburgh v. American College of Obstetricians and Gynecologists, 476 U.S. 747 (1986); in that case, even though the Pennsylvania law under review stated that patient reports were not public records, Pennsylvania law permitted the reports, which contained both information about the women who obtained abortions and information about the doctors who performed them, to be made public and also did not limit the Commonwealth's use of patient information. See id. at 764-68. One other point on the issue of confidentiality is worth noting. Both the guidelines of the NAF and ACOG prohibit the release of any medical record without the patient's consent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The majority seems to intimate that an increase in the cost of obtaining an abortion effectuated by the promulgation of a health regulation is irrelevant to the undue burden calculus. See ante at 22. According to the majority, to hold otherwise \"would necessitate the formulation of an arbitrary cost threshold beyond which a price increase may not pass.\" Id. at 23. This, in turn, \"would irrationally hamstring the State's effort to raise the standard of care in certain abortion clinics . .. simply because the clinics' performance falls so far below appropriate norms that the expense of upgrading their practices and equipment exceeds the arbitrarily defined amount.\" Id. at 23. Unlike the majority, I believe that an increase in the cost of having an abortion effectuated by the promulgation of a health regulation is highly relevant to the undue burden inquiry. First, in Casey, the Supreme Court noted that a significant increase in the cost of obtaining an abortion alone can constitute an undue burden on the right to have an abortion. See Casey, 505 U.S. at 901 (\"While at some point increased cost could become a substantial obstacle, there is no such showing on the record before us.\"). Second, the Supreme Court stated in Casey that a statute which, while furthering a state interest, has the effect of placing a substantial obstacle in the path of a woman's choice cannot be considered a permissible means of serving its legitimate ends. See id. at 877.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Although the South Carolina legislature directed DHEC to regulate abortion facilities which performed five or more first trimester abortions per month, while leaving other licensed physicians under the exclusive supervision of the Board of Medical Examiners, it is undisputed that DHEC retained the discretion to refrain from treating abortion clinics and abortions differently than comparable facilities and procedures. For example, DHEC could have treated abortion clinics like other physicians' offices and clinics by promulgating regulations consistent with what is already required in physicians' offices by other laws and accepted standards. As to the physical plant requirements of Regulation 61-12, DHEC could have adopted regulations requiring the abortion clinic to meet all applicable building codes. As to staff qualifications and medical records, DHEC could have required the supervising physician to hire staff and maintain medical records that, in his or her professional discretion, would appropriately provide for the needs and rights of the patients. On the other hand, with regard to needs unique to the abortion procedure, DHEC could have treated abortion providers differently from other physicians' offices and clinics, but only based on actual differences between those facilities. Instead, DHEC placed onerous burdens upon abortion providers which are neither justified by actual differences nor rationally related to the state's legitimate interest in protecting the health and safety of women seeking first trimester abortions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. With regard to the argument of the defendants attacking the district court's award of attorneys' fees, the argument is without merit.\u003c/span\u003e\n\n",
    "body_length": 190769,
    "citedas": [
      "222 F.3d 157"
    ],
    "attorneys": "CounselArgued: Floyd Matlock Elliott, Haynsworth, Marion, Mckay \u0026 Guerard, L.L.P.,Greenville, South Carolina, for Appellants. Bonnie Scott Jones, The CenterFor Reproductive Law \u0026 Policy, New York, New York, for Appellees. ON Brief:George Dewey Oxner, Jr., Boyd Benjamin Nicholson, Jr., Haynsworth, Marion,Mckay \u0026 Guerard, L.L.P., Greenville, South Carolina; Nancy Staats Layman,Legal Division, Department OF Health And Environmental Control, Columbia,South Carolina; Charles Molony Condon, James Emory Smith, Jr., Office OFThe Attorney General, Columbia, South Carolina; Charles E. Carpenter, Jr.,Donald V. Richardson, III, S. Elizabeth Brosnan, Richardson, Plowden,Carpenter \u0026 Robinson, P.A., Columbia, South Carolina, for Appellants.Randall Hiller, Greenville, South Carolina, for Appellees.",
    "category": [
      "36"
    ],
    "judges": "Before Niemeyer, Circuit Judge, Hamilton, Senior Circuit Judge, andFrederic N. Smalkin, United States District Judge for the District ofMaryland, sitting by designation.",
    "citation_count": 29
  }
}
