{
  "id": "vaV7SGYBTlTomsSBbobq",
  "document": {
    "title": "Nizzardo v. State Traffic Commission",
    "full_title": "MAURICE NIZZARDO v. STATE TRAFFIC COMMISSION ET AL.",
    "jurisdiction": "Supreme Court of Connecticut",
    "date": "2002-01-29T00:00:00.000Z",
    "docket": "SC 16239",
    "body": "Argued September 19, 2000\n\nOpinion\n\nThe issues in this certified appeal are whether: (1) the denial of a notice of intervention filed in an administrative proceeding pursuant to General Statutes § 22a-19, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e is a ''final decision,'' within the meaning of General Statutes § 4-183 (a), \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e for purposes of filing an administrative appeal to the Superior Court; and (2) the plaintiff in this case had standing, pursuant to § 22a-19, to intervene in the administrative proceeding in question to raise environmental issues. Following our grant of certification to appeal, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e the plaintiff, Maurice Nizzardo, appeals from the judgment of the Appellate Court affirming the trial court's judgment denying him intervenor status. We conclude that: (1) the denial by the named defendant, the state traffic commission (commission), \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e of the plaintiff's request to intervene was not a final decision requiring an appeal within forty-five days pursuant to § 4-183 (c); (2) our decisions in Connecticut Fund for the Environment, Inc. v. Stamford, 192 Conn. 247, 250, 470 A.2d 1214 (1984), and Middletown v. Hartford Electric Light Co., 192 Conn. 591, 597, 473 A.2d 787 (1984), that § 22a-19 does not expand the jurisdictional authority of an administrative agency accurately interpreted that statute; and (3) the plaintiff lacked standing to intervene in the administrative proceeding in question because the commission lacks jurisdiction to consider any of the environmental issues that can be raised under § 22a-19. Accordingly, we affirm the judgment of the Appellate Court.\n\nThe following procedural history is relevant to the appeal before us. The defendant First Stamford Corporation (First Stamford) sought a certificate of operation from the commission pursuant to General Statutes § 14311 \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e in connection with a proposed commercial development project. The plaintiff, who owned property in the vicinity of the proposed project, filed a request to intervene pursuant to § 22a-19, which the commission denied. Following the commission's grant of the certificate of operation to First Stamford, the plaintiff appealed to the trial court pursuant to § 4-183. See footnote 3 of this opinion. The trial court granted, in part, First Stamford's motion to dismiss the appeal and, following a trial to the court, dismissed the remainder of the appeal. The plaintiff appealed from the judgment of the trial court to the Appellate Court, which affirmed the judgment; Nizzardo v. State Traffic Commission, 55 Conn. App. 679, 739 A.2d 744 (1999); and this appeal followed. See footnote 4 of this opinion.\n\nThe following additional facts and procedural history are undisputed. In April, 1996, First Stamford filed an application for a certificate of operation with the commission in connection with a shopping center that First Stamford proposed to erect in Stamford near the Greenwich-Stamford town line. On November 27, 1996, the plaintiff, pursuant to § 22a-19, filed with the commission a verified ''Notice of Intervention.'' The plaintiff's notice specifically referred to First Stamford's application, asserted that the application concerned ''an administrative proceeding which involves conduct which is reasonably likely to have the effect of unreasonably polluting, impairing or destroying the public trust in the air, water, wildlife or other natural resources of the State,'' and requested ''status as [an] intervening party for participation in the administrative proceeding before the [commission].'' On December 2, 1996, the commission denied the plaintiff's request for intervenor status pursuant to § 22a-19. The commission gave two independent reasons for its actions: (1) the petition was ''inadequate'' because it ''fail[ed] to articulate how and in what manner the issuance of a [certificate of operation] would unreasonably pollute, impair or destroy any natural resource of the State within the contemplation of [§] 22a-19 (a)''; and (2) the commission ''has no jurisdiction over environmental issues and, therefore, has no authority to address such issues.'' \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The commission also noted, however, that the plaintiff would be given notice of when the commission would meet to consider the application, and that the plaintiff would be permitted to present his position on the application, limited, however, ''to those issues which fall under the jurisdiction of the [commission]--that is, traffic operations and highway safety.'' \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nOn January 17, 1998, the commission granted First Stamford's application for a certificate of operation. Thereafter, within forty-five days of that action, the plaintiff filed this administrative appeal in the trial court pursuant to § 4-183 (c). The plaintiff claimed two bases for aggrievement: (1) that the commission improperly had denied him environmental intervenor status pursuant to § 22a-19; and (2) that he was classically aggrieved, on the basis of which he challenged the merits of the commission's grant of the certificate.\n\nFirst Stamford moved to dismiss the appeal for lack of subject matter jurisdiction, claiming that the plaintiff's appeal based on aggrievement under § 22a-19 was untimely because it had not been filed within forty-five days of the denial by the commission of his request to intervene, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and that the plaintiff was not classically aggrieved. The trial court dismissed the appeal with respect to the denial of the plaintiff's request to intervene, reasoning that the denial constituted a final decision from which he had been required to appeal within forty-five days, and denied the motion to dismiss with respect to the plaintiff's challenge to the merits of the commission's action, subject to the plaintiff's later proof of classical aggrievement. After the hearing on the merits of the appeal, the trial court found that the plaintiff was not classically aggrieved, and rendered judgment dismissing the appeal.\n\nThe plaintiff appealed to the Appellate Court, which affirmed the trial court's judgment. The Appellate Court held that the plaintiff had not timely filed his appeal from the commission's denial of his request for intervenor status and that the trial court's factual determination that he was not classically aggrieved was supported by the evidence. Nizzardo v. State Traffic Commission, supra, 55 Conn. App. 685-86. This certified appeal followed. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nI.\n\nThe plaintiff first claims that the Appellate Court improperly concluded that the commission's denial of his request for intervention pursuant to § 22a-19 was a final decision within the meaning of § 4-183, and that, therefore, contrary to the Appellate Court's conclusion, he was not required to file his appeal challenging that denial within forty-five days thereafter. We agree. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nSection 4-183 (a) provides: ''A person who has exhausted all administrative remedies available within the agency and who is aggrieved by a final decision may appeal to the Superior Court as provided in this section. The filing of a petition for reconsideration is not a prerequisite to the filing of such an appeal.'' (Emphasis added.) Section 4-183 (c) requires that such an appeal be filed within forty-five days of the final decision. See footnote 3 of this opinion. Whether the denial of a request to intervene pursuant to § 22a-19 is a final decision within the meaning of § 4-183 presents a question of statutory interpretation.\n\n''The process of statutory interpretation involves a reasoned search for the intention of the legislature. Frillici v. Westport, 231 Conn. 418, 431, 650 A.2d 557 (1994). In other words, we seek to determine, in a reasoned manner, the meaning of the statutory language as applied to the facts of this case, including the question of whether the language actually does apply. In seeking to determine that meaning, we look to the words of the statute itself, to the legislative history and circumstances surrounding its enactment, to the legislative policy it was designed to implement, and to its relationship to existing legislation and common law principles governing the same general subject matter. . . . Id.; Carpenteri-Waddington, Inc. v. Commissioner of Revenue Services, 231 Conn. 355, 362, 650 A.2d 147 (1994); United Illuminating Co. v. Groppo, 220 Conn. 749, 755-56, 601 A.2d 1005 (1992). . . . Bortner v. Woodbridge, 250 Conn. 241, 258-59, 736 A.2d 104 (1999).'' (Internal quotation marks omitted.) Burke v. Fleet National Bank, 252 Conn. 1, 11, 742 A.2d 293 (1999).\n\nWe begin with the language of the relevant statutes. As used in the Uniform Administrative Procedure Act (UAPA); see footnote 11 of this opinion; and at issue in this case, '' '[f]inal decision' means (A) the agency determination in a contested case .... Theterm does not include a preliminary or intermediate ruling or order of an agency . . . .'' General Statutes § 4-166 (3). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Furthermore, and as relevant to this case, a '' '[c]ontested case' means a proceeding, including but not restricted to rate-making, price fixing and licensing, in which the legal rights, duties or privileges of a party are required by statute to be determined by an agency after an opportunity for hearing or in which a hearing is in fact held . . . .'' General Statutes § 4-166 (2). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In addition, '' '[p]arty' means each person (A) whose legal rights, duties or privileges are required by statute to be determined by an agency proceeding and who is named or admitted as a party, (B) who is required by law to be a party in an agency proceeding or (C) who is granted status as a party under subsection (a) of section 4-177a . . . .'' General Statutes § 4-166 (8). General Statutes § 4-177a (a) (2) \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e provides that a ''person,'' as specifically and broadly defined in § 4-166 (9), \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e shall be made a ''party'' in a contested case if the person timely files a petition that ''states facts that demonstrate that the petitioner's legal rights, duties or privileges shall be specifically affected by the agency's decision in the contested case.'' By contrast, § 4-177a (b) \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e permits the presiding officer to grant ''any person status as an intervenor,'' if certain criteria are met.\n\nAlthough the language of these various statutes is not conclusive, taken together, that language strongly suggests that the denial by the agency of the plaintiff's request to intervene was not a final decision within the meaning of §§ 4-183 and 4-166 (3). First, the reference in § 4-166 (3) to ''the agency determination in a contested case''; (emphasis added); juxtaposed with the caution that the term final decision ''does not include a preliminary or intermediate ruling or order of an agency,'' suggests that ordinarily there would be but one final decision, and that the denial of a petition to intervene would more likely be considered to be a ''preliminary . . . ruling or order'' of the agency. General Statutes § 4-166 (3). Second, the linkage, by virtue of § 4-166 (2) and (3), of the definition of ''final decision'' to the definition of ''contested case'' suggests that, in order for a decision to be final, it must determine ''the legal rights, duties or privileges of a party . . . .'' (Emphasis added.) General Statutes § 4-166 (2). Third, under the definition of ''party'' in § 4-166 (8), taken together with the provisions of § 4-177a (a) and (b), a person, like the plaintiff in the present case, who unsuccessfully seeks intervention, cannot be considered a ''party'' within the meaning of § 4-166 (8). Therefore, the denial of a petition to intervene cannot be considered a ''final decision,'' because it is not ''the agency determination in [the] contested case''; General Statutes § 4-166 (3); because, in turn, it does not determine ''the legal rights, duties or privileges of a party . . . .'' General Statutes § 4-166 (2). It is more properly considered, instead, as a preliminary or intermediate ruling of the agency.\n\nBoth our precedent and the policy behind the finality doctrine under the UAPA support this linguistic analysis. ''In determining whether an administrative decision is final for the purposes of § 4-183 (a), we look first to our statutes governing such determinations. General Statutes § 4-166 (3) states that a final decision is an agency determination in a contested case, but the term does not include a preliminary or intermediate ruling or order of an agency, or a ruling of an agency granting or denying a petition for reconsideration. A contested case is further defined as 'a proceeding . . . in which the legal rights, duties or privileges of a party are required by statute to be determined by an agency after an opportunity for hearing or in which a hearing is in fact held .... General Statutes § 4-166 (2)....\n\n''The considerations underlying the requirement of finality of an agency decision as a prerequisite to judicial review are akin to those involved in the ripeness doctrine as applied to administrative rulings. [I]ts basic rationale is to prevent the courts, through avoidance of premature adjudication, from entangling themselves in abstract disagreements over administrative policies, and also to protect the agencies from judicial interference until an administrative decision has been formalized and its effects felt in a concrete way by the challenging parties. Abbott Laboratories v. Gardner, 387 U.S. 136, 148-49, 87 S. Ct. 1507, 18 L. Ed. 2d 681 (1967). The cases dealing with judicial review of administrative actions have interpreted the finality element in a pragmatic way. Id., 149. [T]he relevant considerations in determining finality are whether the process of administrative decisionmaking has reached a stage where judicial review will not disrupt the orderly process of adjudication and whether rights or obligations have been determined or legal consequences will flow from the agency action. Port of Boston Marine Terminal Assn. v. Rederiaktiebolaget Transatlantic, 400 U.S. 62, 71, 91 S. Ct. 203, 27 L. Ed. 2d 203 (1970). . . . New Haven v. New Haven Police Union Local 530, 210 Conn. 597, 604, 557 A.2d 506 (1989). Another significant consideration is whether the agency intended its decision to be final. We have stated that [s]o long as the agency intends to render a final decision and the person taking the appeal is aggrieved by the decision rendered, the fact that other related issues are reserved for later adjudication does not necessarily detract from its finality. Id., 606.'' (Internal quotation marks omitted.) State v. State Employees' Review Board, 231 Conn. 391, 403-404, 650 A.2d 158 (1994).\n\nApplication of these standards to the present case supports the conclusion that the denial of the plaintiff's petition to intervene was not a final decision of the commission. Requiring a person whose request to intervene was denied to file an immediate appeal would disrupt the orderly adjudication of the administrative decision-making process. It would, as a practical matter, require the agency to suspend its adjudication of the matter before it--in this case, First Stamford's application--until the judicial process is completed.\n\nFurthermore, no rights or obligations of a party were adjudicated by the denial of the request to intervene. In State Employees' Review Board, as one of the relevant considerations of finality, we pointed to ''whether rights or obligations have been determined or legal consequences will flow from the agency action.'' (Internal quotation marks omitted.) Id., 403. That language must be read in light of the statutory language to which it obviously refers, namely, the portion of the definition of a contested case as ''a proceeding . . . in which the legal rights, duties or privileges of a party are required by statute to be determined . . . .'' General Statutes § 4-166 (2). Thus, consistent with our conclusion from the language of the UAPA, this consideration of finality must be taken as referring to the rights or obligations of, or legal consequences to, a party to the administrative proceeding, rather than to one with other than party status, such as an unsuccessful intervenor.\n\nFinally, the commission opposed First Stamford's motion to dismiss in the trial court on the ground that the ultimate decision of the commission on First Stamford's application, not the denial of the plaintiff's request to intervene, was the commission's final decision. See footnote 9 of this opinion. This indicates that the commission did not intend the denial of the request to intervene to be its ''final decision'' in the matter before it. Indeed, even in this court the commission refrains from arguing that the denial of the request to intervene was a final decision under the UAPA.\n\nThe policy behind the statutory finality doctrine, as we articulated it in State v. State Employees' Review Board, supra, 231 Conn. 403, supports our conclusion. If the denial of a request to intervene pursuant to § 22a19 (a) were deemed to be a final decision, thus requiring the aggrieved petitioner to appeal in order to protect his claimed rights, it would involve the courts in premature adjudication, and would not protect the agency from judicial interference prior to its administrative decision being formalized and its effects felt in a concrete way. See id. Indeed, until the commission in the present case ultimately granted First Stamford's application for a certificate of operation, the plaintiff had no way of knowing whether the environmental concerns that he sought to raise were in fact threatened, because had the commission denied First Stamford's application, those concerns would have been moot.\n\nFirst Stamford, echoing the reasoning of the Appellate Court, argues in its brief that the denial of the request to intervene was, nonetheless, a final decision requiring the plaintiff to appeal within forty-five days because ''[t]he test for determining whether an order denying a motion to intervene constitutes a final judgment [for purposes of appeal] is whether the would-be intervenor can make a colorable claim to intervention as a matter of right''; (internal quotation marks omitted) Winslow v. Lewis-Shepard, Inc., 216 Conn. 533, 536, 582 A.2d 1174 (1990); and because ''[§] 22a-19 (a) makes intervention a matter of right.'' Red Hill Coalition, Inc. v. Town Plan \u0026 Zoning Commission, 212 Conn. 727, 734, 563 A.2d 1347 (1989). This argument is flawed by its reliance on Winslow.\n\nWinslow defines the contours of finality for purposes of appeal pursuant to General Statutes § 52-263 \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e from a trial court's denial of a motion to intervene in a judicial proceeding. It does not define the meaning of final decision under the UAPA. That term is a statutory term of art applicable under the UAPA, which supplies its own lexicon of meanings. See General Statutes § 4-166 (3). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Therefore, whether an agency ruling constitutes a final decision for purposes of appeal under the UAPA is determined by the definitions and principles of finality contained in and applicable to that statutory scheme. It is not determined by the different body of finality jurisprudence applicable to trial court judgments.\n\nII.\n\nThe principal dispute between the parties concerns whether § 22a-19 (a) permits a party to intervene in an administrative proceeding to raise environmental issues regardless of whether that agency has jurisdictional authority over the environmental issues the party seeks to raise. The plaintiff claims that he had standing pursuant to § 22a-19 (a) to raise environmental issues before the commission and that, therefore, the commission improperly denied his request to intervene. First Stamford and the commission claim, to the contrary, that the commission properly denied the request to intervene because neither § 22a-19 (a) nor any of the statutes defining the jurisdiction of the commission permits it to consider environmental issues and, therefore, the plaintiff had no standing to raise such issues before the commission. We reaffirm our interpretation of § 22a-19 enunciated in Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 250, and Middletown v. Hartford Electric Light Co., supra, 192 Conn. 591, and conclude that § 22a-19 grants standing to intervenors to raise only those environmental concerns that are within the jurisdiction of the particular administrative agency conducting the proceeding into which the party seeks to intervene.\n\nThe issue of whether § 22a-19 permits intervention into an administrative proceeding to address environmental concerns regardless of whether that agency has jurisdictional authority over the environmental concerns the party seeks to raise presents a question of statutory construction. As we stated in part I of this opinion, statutory construction ''presents a question of law over which our review is plenary. . . . [O]ur fundamental objective is to ascertain and give effect to the intent of the legislature. . . . [W]e look to the words of the statute itself, to the legislative history and circumstances surrounding its enactment, to the legislative policy it was designed to implement, and to its relationship to existing legislation and common law principles governing the same general subject matter.'' (Internal quotation marks omitted.) Polizos v. Nationwide Mutual Ins. Co., 255 Conn. 601, 607, 767 A.2d 1202 (2001).\n\nWith these legal principles in mind, we turn to the text of the statute at issue in this case. Section 22a-19 (a) provides in relevant part: ''In any administrative . . . proceeding . . . any person, partnership, corporation, association, organization or other legal entity may intervene as a party on the filing of a verified pleading asserting that the proceeding . . . involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state.'' See footnote 2 of this opinion for the full text of § 22a-19. Section 22a-19 (a) was adopted as part of the Environmental Protection Act of 1971 (act). \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe plaintiff asserts that the plain language of § 22a19 (a) allows any party to intervene in an administrative proceeding to raise environmental issues, regardless of whether that agency has jurisdictional authority over those environmental issues. In response, the defendants claim that it is necessary to read § 22a-19 (a) in conjunction with the legislation that defines the authority of the administrative agency conducting the proceedings into which the party seeks to intervene. We agree with the defendants.\n\nOn two previous occasions this court has been asked to decide whether § 22a-19 expands the jurisdictional authority of an administrative body when an intervenor raises environmental issues outside the scope of the agency's statutory jurisdiction. In 1984, we addressed the question of environmental standing under § 22a19 in Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 247. In that case, the plaintiffs appealed to the Superior Court from the action of the Stamford environmental protection board (board) approving the application of the defendants for the development of a large tract of land to be used as a regional postal facility. The board was the city agency responsible for the regulation of activities affecting the wetlands and watercourses in Stamford pursuant to the Inland Wetlands and Watercourses Act, General Statutes §§ 22a-36 through 22a-45. Because the land in question was located within a wetlands area, the defendants were required to obtain a permit from the board before developing the land. Id., 248.\n\nAt the administrative hearing before the board, one plaintiff, the Better Neighborhood Association of Stamford (neighborhood association), intervened pursuant to § 22a-19. Id. On appeal, the plaintiffs claimed that the board had excluded at the hearing evidence offered by the plaintiffs that was environmental in nature. Id., 249. The plaintiffs conceded that the proffered evidence was not related to inland wetlands. Id. Specifically, the evidence offered by the plaintiff, and excluded by the board, involved air and noise pollution, and other environmental problems that the plaintiffs argued would have been created by the proposed postal facility. Id., 251. The trial court dismissed the appeal and the plaintiffs, including the neighborhood association, appealed from the judgment of dismissal.\n\nIn affirming the trial court's judgment, this court reasoned: ''The municipal inland wetland agency is authorized to establish the boundaries of inland wetlands and watercourse areas within its jurisdiction. Once such boundaries are established pursuant to procedures set forth in [General Statutes] § 22a-42a, no regulated activity shall be conducted within such boundaries without a permit issued by the local agency.\n\n''It is apparent from the foregoing that local inland wetland bodies are not little environmental protection agencies. Their environmental authority is limited to the wetland and watercourse area that is subject to their jurisdiction. They have no authority to regulate any activity that is situated outside their jurisdictional limits. Although in considering an application for a permit to engage in any regulated activity a local inland wetland agency must, under [General Statutes] § 22a-41, take into account the environmental impact of the proposed project, it is the impact on the regulated area that is pertinent, not the environmental impact in general.'' (Emphasis added.) Id., 250.\n\nThe court in Connecticut Fund for the Environment, Inc., held further that ''[§] 22a-19, which authorizes any person to intervene in any administrative proceeding and to raise therein environmental issues must be read in connection with the legislation which defines the authority of the particular administrative agency. Section 22a-19 is not intended to expand the jurisdictional authority of an administrative body whenever an intervenor raises environmental issues.\n\nThus, an inland wetland agency is limited to considering only environmental matters which impact on inland wetlands. Other environmental impacts must be raised before other appropriate administrative bodies, if any, or in their absence by the institution of an independent action pursuant to [General Statutes] § 22a16.'' (Emphasis added.) Id., 250-51.\n\nLater that same year, this court again addressed the act in Middletown v. Hartford Electric Light Co., supra, 192 Conn. 591. In an action brought under § 22a-16, the plaintiffs, the city of Middletown and its zoning enforcement officer, sought to enjoin the defendant electric light company and its parent company from burning certain toxic substances at its generating plant in Middletown. Id., 593. The defendants had obtained approvals for the burning from the federal Environmental Protection Agency and the state department of environmental protection. Id., 593-94. In their independent action under § 22a-16, the plaintiffs claimed that the defendants had failed to obtain certain other licenses and approvals that the plaintiffs claimed were required under a variety of state statutes. Id., 595.\n\nAlthough Middletown did not involve intervention under § 22a-19, but, rather, an independent action under § 22a-16, this court reaffirmed the principles established in Connecticut Fund for the Environment, Inc., in affirming the trial court's conclusion that the plaintiffs lacked environmental standing under the act. Writing for a unanimous court in Middletown, then Chief Justice Peters reasoned: ''The [plaintiffs'] alternate claim of standing rests on [their] statutory claim under the [act], General Statutes § 22a-16. This statute permits any private party, including a municipality, to seek injunctive relief 'for the protection of the public trust in the air, water and other natural resources of the state from unreasonable pollution, impairment or destruction.' We have recently concluded, however, as did the trial court herein, that invocation of the [act] is not an open sesame for standing to raise environmental claims with regard to any and all environmental legislation. In Connecticut Fund for the Environment, Inc. v. Stamford, [supra, 192 Conn. 247], we held that § 22a-19 of the [act], which permits any person, on the filing of a verified pleading, to intervene in any administrative proceeding and to raise therein environmental issues 'must be read in connection with the legislation which defines the authority of the particular administrative agency. Section 22a-19 is not intended to expand the jurisdictional authority of an administrative body when ever an intervenor raises environmental issues. Thus, an inland wetland agency is limited to considering only environmental matters which impact on inland wetlands. Other environmental impacts must be raised before other appropriate administrative bodies, if any, or in their absence by the institution of an independent action pursuant to § 22a-16.' Id., 250-51. These same principles apply to bar the [plaintiffs'] standing under the licensing statutes. The trial court was therefore correct in concluding that § 22a-16 did not provide the plaintiffs with standing under any statute other than the [act] itself.'' (Emphasis added.) Middletown v. Hartford Electric Light Co., supra, 192 Conn. 596-97.\n\nIn 1987, this court again reaffirmed the reasoning of Connecticut Fund for the Environment, Inc., inConnecticut Water Co. v. Beausoleil, 204 Conn. 38, 526 A.2d 1329 (1987). ''In Middletown v. Hartford Electric Light Co., [supra, 192 Conn. 596], and Connecticut Fund for the Environment, Inc. v. Stamford, [supra, 192 Conn. 250], we recognized that . . . § 22a-19 does not expand the jurisdictional authority of an administrative body acting pursuant to a separate act of title 22a to hear any and all environmental matters, but rather, limits an intervenor to the raising of those environmental matters which impact on the particular subject of the act pursuant to which the commissioner is acting. Middletown v. Hartford Electric Light Co., supra, 597; Connecticut Fund for the Environment, Inc. v. Stamford, supra, 250-51.'' (Emphasis in original.) Connecticut Water Co. v. Beausoleil, supra, 46. This court's reasoning in Beausoleil rested in part on the limited nature of intervention. ''Intervention allows one who was not a party in an original action to become a party upon his request. He has a derivative role by virtue of an action already shaped by the original parties. He takes the controversy as he finds it and may not introduce his own claims to restyle the action. Manter v. Manter, 185 Conn. 502, 506, 441 A.2d 146 (1981). This is all the more true where a statute allows intervention for a specified purpose.'' Connecticut Water Co. v. Beausoleil, supra, 48.\n\nThese three cases clearly and consistently established the principle that § 22a-19 does not authorize an intervenor to raise environmental issues that are outside the jurisdiction of the agency conducting the proceeding into which the party seeks to intervene. The intervenor therefore is limited to raising environmental issues that are within the jurisdiction of the agency in question.\n\nSince the first of these rulings in 1984, the legislature has not amended § 22a-19 in response to our decisions in Connecticut Fund for the Environment, Inc., and Middletown. ''While we are aware that legislative inaction is not necessarily legislative affirmation . . . we also presume that the legislature is aware of [this court's] interpretation of a statute, and that its subsequent non-action may be understood as a validation of that interpretation.'' (Citation omitted; internal quotation marks omitted.) State v. Hodge, 248 Conn. 207, 262-63, 726 A.2d 531, cert. denied, 528 U.S. 969, 120 S. Ct. 409, 145 L. Ed. 2d 319 (1999). The legislature's inaction in the seventeen years since our decisions determining that § 22a-19 was not intended to expand the jurisdictional authority of the administrative bodies can be understood as the legislature's validation of our interpretation of § 22a-19 in Connecticut Fund for the Environment, Inc., and Middletown.\n\nWe see no reason to revisit our conclusion in Connecticut Fund for the Environment, Inc., and Middletown. The rulings in those cases embody an accurate interpretation of § 22a-19 that is faithful to the language of the act as a whole and to the principles of statutory construction. First, our interpretation of § 22a-19 is true to the language of the act as a whole, \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e which demonstrates that the legislature had existing administrative procedures in mind when it enacted § 22a-19 and never intended § 22a-19 to override existing statutes that define the limited jurisdiction of administrative agencies. One section of the act, General Statutes § 22a-20, specifically provides in relevant part: ''Sections 22a-14 to 22a-20, inclusive, shall be supplementary to existing administrative and regulatory procedures provided by law . . . .'' (Emphasis added.) Black's Law Dictionary defines supplemental as ''[s]upplying something additional; adding what is lacking . . . .'' Black's Law Dictionary (7th Ed. 1999). \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e ''Supplemental act'' is defined as ''[t]hat which supplies a deficiency, adds to or completes, or extends that which is already in existence without changing or modifying the original. Act designed to improve an existing statute by adding something thereto without changing the original text.'' (Emphasis added.) Black's Law Dictionary (6th Ed. 1990). It is well established that an administrative agency ''possesses no inherent power. Its authority is found in a legislative grant, beyond the terms and necessary implications of which it cannot lawfully function.'' Adam v. Connecticut Medical Examining Board, 137 Conn. 535, 537-38, 79 A.2d 350 (1951). Because § 22a20 provides that the act is supplemental to existing administrative procedures, we must conclude, there fore, that the legislature intended that the scope of an individual's right to intervene in an administrative proceeding under § 22a-19 must be limited by the jurisdictional authority of the administrative agency conducting the proceeding into which the party seeks to intervene.\n\nThe plaintiff contends that § 22a-19 requires an administrative agency, even one not given the authority in its enabling legislation, to address all environmental claims raised under § 22a-19. The plaintiff claims, therefore, that § 22a-19 expands the jurisdictional scope of administrative agencies beyond that which is established in their enabling legislation. We disagree.\n\n''An administrative agency, as a tribunal of limited jurisdiction, must act strictly within its statutory authority.'' (Internal quotation marks omitted.) State v. State Employees' Review Board, supra, 231 Conn. 406. ''It is a familiar principle that [an administrative agency] which exercises a limited and statutory jurisdiction is without jurisdiction to act unless it does so under the precise circumstances and in the manner particularly prescribed by the enabling legislation. . . . [Castro v. Viera, 207 Conn. 420, 427-28, 541 A.2d 1216 (1988)].'' (Internal quotation marks omitted.) Hall v. Gilbert \u0026 Bennett Mfg. Co., 241 Conn. 282, 291, 695 A.2d 1051 (1997). The plaintiff urges us to conclude that § 22a-19 trumps the statutes that limit the jurisdictional authority of administrative agencies by requiring an administrative agency to consider any and all environmental issues that an intervenor can raise under § 22a-19, regardless of whether that agency has jurisdictional authority over the environmental issue the intervenor wishes to raise. Such a conclusion would fly in the face of one of our most fundamental tenets of statutory construction, namely, that we must, if possible, construe two statutes in a manner that gives effect to both, eschewing an interpretation that would render either ineffective.\n\nIn construing two seemingly conflicting statutes, ''we are guided by the principle that the legislature is always presumed to have created a harmonious and consistent body of law . . . .'' (Internal quotation marks omitted.) State v. Ledbetter, 240 Conn. 317, 336, 692 A.2d 713 (1997). ''Legislation never is written on a clean slate, nor is it ever read in isolation or applied in a vacuum. Every new act takes its place as a component of an extensive and elaborate system of written laws. . . . Construing statutes by reference to others advances [the values of harmony and consistency within the law]. In fact, courts have been said to be under a duty to construe statutes harmoniously where that can reasonably be done.'' 2B J. Sutherland, Statutory Construction (6th Ed. Singer 2000) § 53:01, pp. 322-24. Accordingly, ''[i]f two statutes appear to be in conflict but can be construed as consistent with each other, then the court should give effect to both.'' (Internal quotation marks omitted.) Wilson v. Cohen, 222 Conn. 591, 598, 610 A.2d 1117 (1992); see Hirschfeld v. Commission on Claims, 172 Conn. 603, 607, 376 A.2d 71 (1977). ''If a court can by any fair interpretation find a reasonable field of operation for two allegedly inconsistent statutes, without destroying or preventing their evident meaning and intent, it is the duty of the court to do so. Knights of Columbus Council v. Mulcahy, 154 Conn. 583, 590, 227 A.2d 413 (1967); Shanley v. Jankura, 144 Conn. 694, 702, 137 A.2d 536 (1957).'' Windham First Taxing District v. Windham, 208 Conn. 543, 553, 546 A.2d 226 (1988). Therefore, ''[w]e must, if possible, read the two statutes together and construe each to leave room for the meaningful operation of the other.'' State v. West, 192 Conn. 488, 494, 472 A.2d 775 (1984). In addition, ''[i]f two constructions of a statute are possible, we will adopt the one that makes the statute effective and workable . . . .'' (Internal quotation marks omitted.) State v. Scott, 256 Conn. 517, 538, 779 A.2d 702 (2001). ''Moreover, statutes must be construed, if possible, such that no clause, sentence or word shall be superfluous, void or insignificant . . . .'' (Internal quotation marks omitted.) State v. Gibbs, 254 Conn. 578, 602, 758 A.2d 327 (2000).\n\nWe must presume that in enacting § 22a-19, the legislature was aware of those statutes that define and limit the jurisdictional authority of state and local agencies. We must further presume that the legislature intended to create a harmonious and consistent body of law and we must interpret § 22a-19 together with statutes establishing the jurisdictional limits of administrative agencies. The interpretation of § 22a-19 urged by the plaintiff would vitiate those statutes that establish the limited jurisdiction of an administrative agency. We conclude that we were correct when we held in Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 250, that ''[§] 22a-19 . . . must be read in connection with the legislation which defines the authority of the particular administrative agency . . . [and was] not intended to expand the jurisdictional authority of an administrative body whenever an intervenor raises environmental issues.'' Such a construction of § 22a-19 gives effect to its provisions and to the legislation that defines the scope of authority of an administrative agency.\n\nThe act's provision for a broad, independent cause of action in § 22a-16 \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e further reinforces the accuracy of our conclusion in Connecticut Fund for the Environment, Inc., and Middletown. Section 22a-16 establishes an independent cause of action against, inter alia, the state, a municipality or an agency of either to raise a claim of unreasonable pollution. In Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 250-51, we determined that ''[o]ther environmental impacts must be raised before other appropriate administrative bodies, if any, or in their absence by the institution of an independent action pursuant to § 22a-16.'' In doing so, we implicitly recognized that the existence of a separate action under § 22a-16 evidences the legislature's intent to provide a mechanism for addressing environmental concerns without expanding the limited jurisdictional authority of administrative agencies. Section 22a-16 was enacted at the same time as § 22a-19, as part of the act. The broad statutory language of § 22a-16 allows a party to ''maintain an action . . . for declaratory and equitable relief . . . for the protection of the public trust in the air, water and other natural resources of the state from unreasonable pollution, impairment or destruction . . . .'' General Statutes § 22a-16. The establishment of the right to bring an independent action to address environmental concerns lends credence to our conclusion that the issues appropriately raised by intervention pursuant to § 22a-19 are limited to those within the jurisdiction of the particular agency. If a party wants to raise environmental concerns that are beyond the scope of authority of a particular agency, the act provides a means for doing so, namely, instituting an independent action pursuant to § 22a-16.\n\nThe plaintiff contends that this court previously has concluded that § 22a-19 (a) allows agencies to examine environmental issues that are not within the scope of their jurisdictional authority. In support of its argument, the plaintiff cites Red Hill Coalition, Inc. v. Town Plan \u0026 Zoning Commission, supra, 212 Conn. 727. In that case, the defendant plan and zoning commission approved a subdivision application filed by the defendant development corporation for a thirty lot subdivision in Glastonbury. The plaintiffs, some of which had intervened in the subdivision application proceedings pursuant to § 22a-19 (a), appealed from the subdivision approval to the trial court, which rendered judgment for the defendants. Id., 729-31. The plaintiffs were granted certification for a further appeal. Id., 731. On appeal, the defendants claimed that § 22a-19 did not authorize intervention in a subdivision application proceeding before a municipal planning commission. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Id., 732.\n\nAlthough this court agreed with the plaintiffs in Red Hill Coalition, Inc., that § 22a-19 (a) authorized intervention in a subdivision application proceeding conducted by a municipal planning commission, the court did not decide whether § 22a-19 (a) expands the jurisdictional authority of an administrative agency because, unlike in the present case, there was no challenge to the plan and zoning commission's jurisdiction on the basis that the plaintiffs' specific environmental claims were outside the jurisdiction of the planning commission. This court simply concluded, in three paragraphs bereft of any detailed analysis, that § 22a-19 authorized intervention in a subdivision review proceeding. The impact of § 22a-19 on the scope of an administrative agency's jurisdiction was neither raised nor decided in Red Hill Coalition, Inc. Instead, the crux of the court's analysis focused on the second issue raised on appeal, whether the legislature intended agricultural land to be a natural resource for the purposes of § 22a-19. Id., 735-40. Red Hill Coalition, Inc., therefore, has no bearing on the issue before us in the present case. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIII.\n\nWe next examine whether the plaintiff in the present case had standing to intervene in the proceeding before the commission. The plaintiff sought to intervene in the proceeding before the commission in which First Stamford sought a certificate of operation pursuant to § 14-311. See footnote 6 of this opinion. Such certificates are required for all proposed developments that would generate large volumes of traffic. General Statutes § 14-311 (a). First Stamford argues that the plaintiff failed to meet his burden of alleging in his request for intervention, any ''facts setting forth how traffic safety on the public highway would in any way impact the environment. His pleading merely tracked the generic language of the statute.'' First Stamford contends that this was legally insufficient for intervention. We agree and conclude that the plaintiff's request to intervene did not constitute a ''verified pleading'' as required in § 22a-19 because it failed to set forth the facts on which his environmental claim was based.\n\nThe plaintiff's request to intervene was framed in the broad language of § 22a-19. He alleged only that First Stamford's application concerned ''an administrative proceeding which involves conduct which is reasonably likely to have the effect of unreasonably polluting, impairing or destroying the public trust in the air, water, wildlife or other natural resources of the State ....'' He provided no specific factual allegations relating to his environmental concerns.\n\nWe begin with the statutory language in issue. Section 22a-19 (a) provides in relevant part: ''In any administrative . . . proceeding . . . any person . . . may intervene as a party on the filing of a verified pleading asserting that the proceeding . . . involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state.'' (Emphasis added.)\n\nThe words ''verified pleading'' are not defined in § 22a-19 or elsewhere in the act. We recognize these words as technical words that have a particular meaning in the law. See General Statutes § 1-1 (a). \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The word ''pleading'' is defined as ''[a] formal document in which a party to a legal proceeding . . . sets forth or responds to allegations, claims, denials, or defenses.'' (Emphasis added.) Black's Law Dictionary (7th Ed. 1999). In a civil proceeding, a pleading must contain ''a plain and concise statement of the material facts on which the pleader relies . . . .'' Practice Book § 10-1. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e ''Verify'' is defined as ''[t]o confirm or substantiate by oath or affidavit; to swear to the truth of.'' Black's Law Dictionary (7th Ed. 1999).\n\nBoth the Black's Law Dictionary definition of ''pleading'' and Practice Book § 10-1 support First Stamford's contention that the intervention request or petition must set forth facts constituting the intervenor's claim. This interpretation is further reinforced by the legislature's decision to require in § 22a-19 that the pleading be ''verified.'' The requirement of verification evinces the legislature's determination that the intervention petition set forth the factual basis for the intervention because only facts can be sworn to by affidavit or verification. Swearing to the truth of general statutory language would be meaningless. Any interpretation of the term ''verified pleading'' as not requiring factual allegations would negate the meaning of verified, in violation of our rule of statutory construction that ''statutes must be construed, if possible, such that no clause, sentence or word shall be superfluous, void or insignificant . . . .'' (Internal quotation marks omitted.) State v. Gibbs, supra, 254 Conn. 602.\n\nOur interpretation of the requirement of a verified pleading in § 22a-19 is further informed by an analogous statutory provision requiring a ''verified complaint'' for the issuance of a temporary injunction without notice to the adverse party. General Statutes § 52-473 (b) provides in relevant part that ''[n]o temporary injunction may be granted without notice to the adverse party unless it clearly appears from the specific facts shown by affidavit or by verified complaint that irreparable loss or damage will result . . . .'' (Emphasis added.) Section 52-473 (b), by its plain language, contemplates that a ''verified complaint'' contains ''specific facts.'' In addition, consistent with the general definition of ''verify'' set forth previously, § 52-473 (b) clearly equates a verified complaint with an affidavit. An ''affidavit'' is a sworn ''declaration of facts . . . .'' Black's Law Dictionary (7th Ed. 1999).\n\nOur conclusion that § 22a-19 requires factual specificity in intervention petitions is further supported by the well established canon of statutory construction that ''[i]n construing a statute, common sense must be used and courts must assume that a reasonable and rational result was intended.'' (Internal quotation marks omitted.) Schreck v. Stamford, 250 Conn. 592, 596-97, 737 A.2d 916 (1999). Our construction of the pleading requirement of § 22a-19 is reasonable and consistent with our conclusion that intervention under that statute must implicate an environmental issue within the agency's jurisdiction. By requiring that intervention petitions under § 22a-19 allege facts setting forth the environmental claim that the intervenor intends to raise, we ensure that the agency will have the ability to determine upon a review of the petition whether the agency properly has jurisdiction over that environmental issue.\n\nFinally, we note that a requirement of factual specificity in intervention petitions under § 22a-19 is not a novel construction. Indeed, in the present case, the town specified in its petition to intervene the facts supporting its environmental claim. See footnote 8 of this opinion. Similarly, the intervenors in Paige v. Plan \u0026 Zoning Commission, 235 Conn. 448, 451, 668 A.2d 340 (1995), factually identified the specific environmental issue that they wished to have the planning and zoning commission address.\n\nWe thus conclude that a petition for intervention filed under § 22a-19 must contain specific factual allegations setting forth the environmental issue that the intervenor intends to raise. The facts contained therein should be sufficient to allow the agency to determine from the face of the petition whether the intervention implicates an issue within the agency's jurisdiction.\n\nAt this stage in our analysis, we typically would compare the factual allegations set forth in the intervenor's petition to the jurisdictional authority of the commission to determine whether the commission can properly entertain the environmental issues raised in the petition. In this case, however, the plaintiff's petition does not contain allegations sufficiently specific for this court to make that determination. We conclude, however, that the commission does not have jurisdiction to consider any environmental issues and we therefore need not afford the plaintiff the opportunity to amend his petition.\n\nThe scope of the commission's authority in deciding whether to issue a certificate of operation is set forth in § 14-311 (d). That statute provides in relevant part: ''In determining the advisability of such certification, the State Traffic Commission shall include, in its consideration, highway safety, the width and character of the highways affected, the density of traffic thereon, the character of such traffic and the opinion and findings of the traffic authority of the municipality wherein the development is located. . . .'' General Statutes § 14311 (d).\n\nIn his request to intervene pursuant to § 22a-19 (a), the plaintiff alleged that the proceeding before the commission involved conduct that would have the effect of ''polluting, impairing or destroying the public trust in the air, water, wildlife or other natural resources of the State . . . .'' Nothing in the plain language of § 14-311 authorizes the commission to consider the environmental impact of a certificate of operation on the air, water, wildlife or other natural resources of the state. Section 14-311 (d) explicitly requires that, in determining whether to issue a certificate, the commission must consider ''highway safety, the width and character of the highways affected, the density of traffic thereon, the character of such traffic and the opinion and findings of the traffic authority of the municipality wherein the development is located. . . .'' The commission also has the authority to determine whether changes such as pavement widening are required ''to handle traffic safely and efficiently . . . .'' General Statutes § 14-311 (d). These considerations are consistent with the composition and role of the commission as set forth in General Statutes § 14-298. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Section 14-298 provides that the commission is established within the state department of transportation and is composed of three members: the commissioner of transportation, the commissioner of public safety and the commissioner of motor vehicles. ''Taking into consideration the public safety and convenience,'' the commission is responsible for adopting regulations (1) establishing a uniform system of traffic control signals, devices, signs and markings for use upon the public highways, (2) governing the use of state highways and roads on state-owned properties and the operation of vehicles thereon, and (3) governing truck traffic on streets and highways within cities or towns in the state ''for the protection and safety of the public.'' General Statutes § 14-298.\n\nIt is apparent from an examination of §§ 14-298 and 14-311 that the commission's principal statutory responsibility is for public safety on the highways and streets within the state. No provision in either § 14-298 or § 14311 or any other section within chapter 249 of the General Statutes authorizes the commission to consider any environmental issues whatsoever. In addition, the regulations promulgated to implement § 14-311 do not authorize the commission to consider any questions relating to pollution of the air, water, wildlife or other natural resources of the state in a proceeding concerning a certification pursuant to § 14-311. We conclude, therefore, that the commission does not have jurisdiction to address any environmental concerns that could be raised by the plaintiff in his request to intervene and, accordingly, the plaintiff lacked standing to intervene in the proceeding before the commission. We therefore affirm the judgment of the Appellate Court upholding the dismissal of the appeal, although we do so on different grounds.\n\nThe judgment of the Appellate Court is affirmed.\n\nIn this opinion SULLIVAN, C. J., and ZARELLA and RONAN, Js., concurred.\n\nBORDEN, J., with whom NORCOTT and PALMER, Js., join, concurring and dissenting.\n\nI agree with and join part I of the majority opinion, in which the court concludes that a denial of a request for intervention pursuant to General Statutes § 22a-19 (a) \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e was not a ''final decision'' within the meaning of General Statutes § 4-183. I disagree with the reasoning of part II of the majority opinion, in which the court reaffirms the holdings of Connecticut Fund for the Environment, Inc. v. Stamford, 192 Conn. 247, 470 A.2d 1214 (1984), and Middletown v. Hartford Electric Light Co., 192 Conn. 591, 473 A.2d 787 (1984), and concludes that § 22a-19 permits intervention into an administrative proceeding only regarding particular environmental concerns that otherwise are within the subject matter jurisdiction of the administrative agency. As I indicate in this concurring and dissenting opinion, I conclude that intervention under § 22a-19 is not limited in that fashion. Finally, I disagree with the conclusions set forth in part III of the majority opinion, namely, that: (1) § 22a-19 requires that the intervenor set forth in his petition to intervene the specific facts on which his environmental claim is based; and (2) in the present case, the named defendant, the state traffic commission (traffic commission), has no power to consider any environmental concerns that could be raised by the plaintiff, Maurice Nizzardo, pursuant to his request to intervene. I conclude, to the contrary, that: (1) § 22a-19 contains no such fact specific pleading requirement; and (2) there are obvious environmental concerns, such as air quality, that § 22a19 confers on the traffic commission upon the filing of a proper petition to intervene. In my view, the plaintiff has demonstrated his right to intervene by filing a proper petition pursuant to § 22a-19, and there should be further proceedings before the traffic commission regarding the merits of his environmental objections. I would, therefore, reverse the Appellate Court's judgment.\n\nIn part II of the majority opinion, the court concludes that Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 250, and Middletown v. Hartford Electric Light Co., supra, 192 Conn. 591, control the present case, and require the conclusion that § 22a-19 ''grants standing to intervenors to raise only those environmental concerns that are within the jurisdiction of the particular administrative agency conducting the proceeding into which the party seeks to intervene,'' in this case, the traffic commission. In my view, both Connecticut Fund for the Environment, Inc., and Middletown are fundamentally flawed, are inconsistent with both the language and purpose of the Environmental Protection Act of 1971 (act), of which § 22a-19 is a part, and are inconsistent with our prevailing jurisprudence under § 22a-19, both before and after those decisions. Furthermore, both the language of § 22a-19 and purpose of the act, and that prevailing jurisprudence, compel the conclusion that the plaintiff was improperly denied the right to intervene in the present case.\n\nWhether the plaintiff was entitled to intervene pursuant to § 22a-19 (a) presents a question of statutory interpretation. ''The process of statutory interpretation involves a reasoned search for the intention of the legislature. . . . In other words, we seek to determine, in a reasoned manner, the meaning of the statutory language as applied to the facts of this case, including the question of whether the language actually does apply. In seeking to determine that meaning, we look to the words of the statute itself, to the legislative history and circumstances surrounding its enactment, to the legislative policy it was designed to implement, and to its relationship to existing legislation and common law principles governing the same general subject matter.'' (Citation omitted; internal quotation marks omitted.) Burke v. Fleet National Bank, 252 Conn. 1, 11, 742 A.2d 293 (1999).\n\nI begin with the language of § 22a-19 (a), which provides in relevant part: ''In any administrative . . . proceeding . . . any person, partnership, corporation, association, organization or other legal entity may intervene as a party on the filing of a verified pleading asserting that the proceeding . . . involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state.'' (Emphasis added.) See footnote 1 of this concurring and dissenting opinion for the full text of § 22a-19 (a). There are two significant aspects of this language. First, it applies to ''any administrative . . . proceeding . . . .'' (Emphasis added.) General Statutes § 22a-19 (a). There is no linguistic limitation imposed on that application. Second, it focuses on the assertion by the intervenor that ''the proceeding [into which intervention is sought] involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting'' our natural resources. (Emphasis added.) General Statutes § 22a-19 (a). This focus is not on the jurisdiction of the agency conducting the proceeding. The focus, instead, is on whether the proceeding before the agency ''involves conduct'' that is reasonably likely to pollute. This language, therefore, strongly suggests that the court, in determining whether an individual, official or entity seeking to intervene under the statute may do so, should look, not at the jurisdiction of the agency, but at the nature of the conduct involved in the proceeding before the agency.\n\nThis interpretation of § 22a-19 (a) is consistent with the main thrust of our long-standing jurisprudence regarding standing and intervention under the statute. A careful review of this jurisprudence leads me to conclude that: (1) we have not always been perfectly consistent in deciding questions of standing and intervention under that statute; but (2) our jurisprudence has been more expansive in its interpretation of the statute than we had envisioned in both Connecticut Fund for the Environment, Inc., and Middletown, and is more faithful to its language and purpose. Under that jurisprudence, the plaintiff's request to intervene should have been granted.\n\nSection 22a-19 (a) is part of the act. See General Statutes § 22a-14. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e General Statutes § 22a-15 of the act provides: ''It is hereby found and declared that there is a public trust in the air, water and other natural resources of the state of Connecticut and that each person is entitled to the protection, preservation and enhancement of the same. It is further found and declared that it is in the public interest to provide all persons with an adequate remedy to protect the air, water and other natural resources from unreasonable pollution, impairment or destruction.''\n\nIn Belford v. New Haven, 170 Conn. 46, 364 A.2d 194 (1975), overruled in part by Manchester Environmental Coalition v. Stockton, 184 Conn. 51, 57 n.7, 441 A.2d 68 (1981), this court discussed the question of standing under the act to raise environmental concerns in what was arguably a nonenvironmental proceeding. In that case, the plaintiffs had sought to enjoin the city from constructing a rowing course in two city parks. Belford v. New Haven, supra, 46-47. Among the plaintiffs' claims was that the rowing course would pollute and destroy the city's natural resources. Id., 51. In discussing the plaintiffs' statutory standing to raise environmental issues, we stated: ''The plaintiffs make the claim that they have statutory standing to maintain this action by authority of the [act], which is chapter 439 of the General Statutes. The purpose of the act is contained in § 22a-15. The broad language of the act gives any person the right to bring an action for declaratory and equitable relief against pollution. It is clear that one basic purpose of the act is to give persons standing to bring actions to protect the environment. Johnson, 'The Environmental Protection Act of 1971,' 46 Conn. B.J. 422 [1972]; see 61 Am. Jur. 2d, Pollution Control, § 4.'' (Emphasis added.) Belford v. New Haven, supra, 53-54. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nWe next considered the questions of intervention and standing pursuant to § 22a-19 in Mystic Marinelife Aquarium, Inc. v. Gill, 175 Conn. 483, 400 A.2d 726 (1978). In that case, the plaintiff filed an administrative appeal from the action of the commissioner of environmental protection granting an application to construct a floating dock and other structures in the Mystic River. Id., 484-85. We stated: ''[The plaintiff] claims that all the issues, environmental and nonenvironmental, it raises are required to be given judicial review. This is not so. It is clear that one of the basic purposes of the [act] is to give persons standing to bring actions to protect the environment and standing is conferred only to protect the natural resources of the state from pollution or destruction. Belford v. New Haven, [supra, 170 Conn. 53-54]. Belford was properly applied to limiting [the plaintiff] to raising only environmental issues.'' (Emphasis added.) Mystic Marinelife Aquarium, Inc. v. Gill, supra, 499-500.\n\nWe next commented on § 22a-19, albeit indirectly, in Manchester Environmental Coalition v. Stockton, supra, 184 Conn. 51. In that case, the plaintiffs had brought an action to enjoin the state commerce commissioner from approving a project plan for an industrial park in Manchester. Id., 53. In rejecting a challenge to the plaintiffs' standing, we stated: ''The plaintiffs alleged a violation of the [act]. General Statutes §§ 22a-14 through 22a-20. This act expands the class of plaintiffs who are empowered to institute proceedings to vindicate the public interest. The act creates both procedural and substantive rights. Similar acts have been passed in many states. They are best known for eliminating standing barriers prevalent in traditional litigation.\n\n''In their action, the plaintiffs sought to enjoin 'unreasonable pollution, impairment or destruction' of the air which would result from the automobile traffic generated by the expected employment at the industrial site of 2000 full-time and 600 part-time workers. It is clear, and the trial court so found, that the plaintiffs have standing under [General Statutes] § 22a-16 which confers standing upon 'any person' to sue 'any person' for 'the protection of the public trust in the air, water and other natural resources of the state from unreasonable pollution, impairment or destruction.' Statutes such as the [act] are remedial in nature and should be liberally construed to accomplish their purpose.\n\n''The trial court ruled that the plaintiffs' standing and their burden of proof at the trial comprise one and the same thing. That is not the case. Standing is automatically granted under the [act] to 'any person.' The plaintiffs need not prove any pollution, impairment or destruction of the environment in order to have standing.'' (Emphasis added.) Id., 55-57.\n\nThis court next addressed the question of environmental standing in Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 247. In that case, the plaintiffs challenged the issuance of a permit to place a large postal facility within a wetlands area by the city of Stamford's environmental protection board (board). Id., 248. The board was the city agency responsible for regulating activities in wetlands and watercourses under the state Inland Wetlands and Watercourses Act. Id., 248 n.1. At the administrative hearing before the board, one plaintiff, namely, the Better Neighborhood Association of Stamford (association), intervened pursuant to § 22a-19 (a). Id., 248 and n.2. At that hearing, the board had excluded evidence offered by the plaintiffs that was environmental in nature, but was not related to inland wetlands. Id., 249. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The plaintiffs filed an administrative appeal to the trial court, which dismissed the appeal. The plaintiffs, including the association, appealed to this court.\n\nIn affirming the trial court's judgment, we stated: ''The municipal inland wetland agency is authorized to establish the boundaries of inland wetlands and watercourse areas within its jurisdiction. Once such boundaries are established pursuant to procedures set forth in [General Statutes] § 22a-42a, no regulated activity shall be conducted within such boundaries without a permit issued by the local agency.\n\n''It is apparent from the foregoing that local inland wetland bodies are not little environmental protection agencies. Their environmental authority is limited to the wetland and watercourse area that is subject to their jurisdiction. They have no authority to regulate any activity that is situated outside their jurisdictional limits. Although in considering an application for a permit to engage in any regulated activity a local inland wetland agency must, under [General Statutes] § 22a-41, take into account the environmental impact of the proposed project, it is the impact on the regulated area that is pertinent, not the environmental impact in general.\n\n''Section 22a-19, which authorizes any person to intervene in any administrative proceeding and to raise therein environmental issues must be read in connection with the legislation which defines the authority of the particular administrative agency. Section 22a-19 is not intended to expand the jurisdictional authority of an administrative body whenever an intervenor raises environmental issues. Thus, an inland wetland agency is limited to considering only environmental matters which impact on inland wetlands. Other environmental impacts must be raised before other appropriate administrative bodies, if any, or in their absence by the institution of an independent action pursuant to § 22a16.'' (Emphasis added.) Id., 250-51.\n\nConnecticut Fund for the Environment, Inc., was followed by Middletown v. Hartford Electric Light Co., supra, 192 Conn. 591. In that case, the plaintiff city of Middletown sought to enjoin the defendant electric light company from burning certain toxic substances, namely, polychlorinated biphenyls, contained in mineral oils to be burned at the defendant's generating plant in Middletown. Id., 592-93. The plaintiff claimed that the defendant had failed to obtain certain licenses and approvals that, the plaintiff asserted, were required under a variety of state statutes. Id., 595.\n\nIn affirming the trial court's conclusion that the plaintiff lacked environmental standing under the act, we stated: ''The city's alternate claim of standing rests on its statutory claim under the [act], General Statutes § 22a-16. This statute permits any private party, including a municipality, to seek injunctive relief 'for the protection of the public trust in the air, water and other natural resources of the state from unreasonable pollution, impairment or destruction.' We have recently concluded, however, as did the trial court herein, that invocation of the [act] is not an open sesame for standing to raise environmental claims with regard to any and all environmental legislation. In Connecticut Fund for the Environment, Inc. v. Stamford, [supra, 192 Conn. 247], we held that § 22a-19 of the [act], which permits any person, on the filing of a verified pleading, to intervene in any administrative proceeding and to raise therein environmental issues 'must be read in connection with the legislation which defines the authority of the particular administrative agency. Section 22a-19 is not intended to expand the jurisdictional authority of an administrative body whenever an intervenor raises environmental issues. Thus, an inland wetland agency is limited to considering only environmental matters which impact on inland wetlands. Other environmental impacts must be raised before other appropriate administrative bodies, if any, or in their absence by the institution of an independent action pursuant to § 22a16.' Id., 250-51. These same principles apply to bar the city's standing under the licensing statutes. The trial court was therefore correct in concluding that § 22a16 did not provide the plaintiffs with standing under any statute other than the [act] itself.'' (Emphasis added.) Middletown v. Hartford Electric Light Co., supra, 192 Conn. 596-97.\n\nThese latter two cases imposed restrictions on standing, pursuant to the act, to raise environmental issues that had not theretofore been recognized. Both in their holdings on their specific facts and their language, they evinced a more restrictive judicial attitude toward such standing than had been articulated in the prior cases.\n\nIn Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 251, the court held that the association, which had intervened pursuant to § 22a-19 in the administrative proceeding at issue, could not raise, before the board, environmental issues of air and noise pollution, and other unspecified environmental concerns, purportedly generated by the development of a large tract of land for a regional postal facility. The court stated: ''[S]uch general environmental matters were not relevant to the proceedings before [the board] and therefore its refusal to entertain comment or evidence of a noninland wetland nature was appropriate.'' Id.\n\nIn Middletown v. Hartford Electric Light Co., supra, 192 Conn. 597, the court held that the plaintiffs, which had brought an independent action pursuant to § 22a16, did not have standing in that action to raise environmental claims purportedly raised by the defendant's failure to secure licenses and approvals under certain state statutes. We stated that the principles articulated in Connecticut Fund for the Environment, Inc., applied to bar the plaintiffs' standing, and ''that § 22a-16 did not provide the plaintiffs with standing under any statute other than the [act] itself.'' Id.\n\nWe reaffirmed this reasoning in Connecticut Water Co. v. Beausoleil, 204 Conn. 38, 526 A.2d 1329 (1987). In that case, the plaintiff water company, which owned a reservoir and land being developed for a subdivision, sued the defendant in nuisance. Id., 40. There had been a prior action against the defendant by the attorney general, however, on behalf of the commissioner of the department of environmental protection, under General Statutes §§ 22a-432 and 22a-435, to enjoin the defendant from polluting the waters of the state. Id., 40-42. That action had itself followed an administrative proceeding by the commissioner to require the defendant to take certain remedial actions. Id. The plaintiff had intervened in that prior action, which ultimately resulted in a stipulated judgment requiring the defendant to take certain measures to prevent pollution and erosion. Id., 43.\n\nOn appeal in this court in the nuisance action, the defendant claimed that the plaintiff was barred by the doctrine of res judicata because it could have sought damages for nuisance in the prior action in which it had intervened. In rejecting that claim, we stated: ''In Middletown v. Hartford Electric Light Co., [supra, 192 Conn. 591], and Connecticut Fund for the Environment, Inc. v. Stamford, [supra, 192 Conn. 247], we recognized that General Statutes § 22a-19 does not expand the jurisdictional authority of an administrative body acting pursuant to a separate act of title 22a to hear any and all environmental matters, but rather, limits an intervenor to the raising of those environmental matters which impact on the particular subject of the act pursuant to which the commissioner is acting. Middletown v. Hartford Electric Light Co., supra, 597; Connecticut Fund for the Environment, Inc. v. Stamford, supra, 250-51.'' (Emphasis in original.) Connecticut Water Co. v. Beausoleil, supra, 204 Conn. 46. We therefore concluded that the plaintiff ''was limited to raising environmental matters relating to'' the water pollution control act and, therefore, could not have sought damages in that prior action. Id., 47.\n\nThis remained the state of our law on matters of environmental standing, until this court's two companion decisions in Red Hill Coalition, Inc. v. Conservation Commission, 212 Conn. 710, 563 A.2d 1339 (1989) (Red Hill I), and Red Hill Coalition, Inc. v. Town Plan \u0026 Zoning Commission, 212 Conn. 727, 563 A.2d 1347 (1989) (Red Hill II). I emphasize that there were two Red Hill decisions, because in my view reading them together makes it even clearer that, contrary to the assertion of the majority, the intervention question that we decided in Red Hill II was precisely the same as is presented in the case here, namely, whether intervention pursuant to § 22a-19 (a) is to be considered irrespective of the particular subject matter jurisdiction of the administrative agency involved.\n\nIn Red Hill I, supra, 212 Conn. 711-12, the defendant conservation commission, acting as the inland wetlands and watercourses agency of the town of Glastonbury, had considered an application for an inland wetlands permit by another defendant, Red Hill Development Corporation (corporation), in connection with a proposed subdivision. The named plaintiff, Red Hill Coalition, Inc. (coalition), had intervened in the administrative proceedings pursuant to § 22a-19 (a). Id., 713. After the commission granted the application, the coalition and the other plaintiffs appealed to the trial court, which determined that the coalition had standing to appeal. Id., 714. On appeal to this court, we rejected the commission's contention that the trial court had ''erred in finding that the plaintiffs [including the coalition] had standing to appeal the wetlands issue pursuant to § 22a-19 (a).'' (Emphasis added.) Id. In doing so, we first quoted the broad language of § 22a-19 (a): ''Section 22a-19 (a) allows 'any person, partnership, corporation, association, organization or other legal entity' to 'intervene as a party' in any 'administrative, licensing or other proceeding, and in any judicial review thereof' that 'involves conduct which has, or is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state.' '' Id., 715.\n\nWe then stated, in broad terms: ''General Statutes § 22a-19 (a) is part of the [act]. General Statutes § 22a14 et seq. The purpose of the [act] is 'to give private citizens a voice in ensuring that the air, water and other natural resources of the state remain protected, preserved and enhanced, and to provide them with ''an adequate remedy to protect the air, water and other natural resources from unreasonable pollution, impairment or destruction.'' General Statutes § 22a-15.' Connecticut Water Co. v. Beausoleil, [supra, 204 Conn. 44]; see also Mystic Marinelife Aquarium, Inc. v. Gill, supra, [175 Conn.] 489; Belford v. New Haven, [supra, 170 Conn. 53-54]. By permitting intervention under § 22a-19 (a), the [act] allows private persons to 'intervene in an existing judicial review of an agency action or to initiate an independent declaratory or injunctive action.' Connecticut Water Co. v. Beausoleil, supra, 44- 45. An intervening party under § 22a-19 (a), however, may raise only environmental issues. Id., 45; Mystic Marinelife Aquarium, Inc. v. Gill, supra, 490.\n\n''Because the coalition filed a notice of intervention at the commission hearing in accordance with § 22a-19 (a), it doubtless had statutory standing to appeal from the commission's decision for that limited purpose. Mystic Marinelife Aquarium, Inc. v. Gill, supra, [175 Conn.] 499.'' Red Hill I, supra, 212 Conn. 715.\n\nIn Red Hill II, supra, 212 Conn. 729, the defendant plan and zoning commission had considered the subdivision application by the same corporation for the same thirty-three lot subdivision in Glastonbury. The plaintiffs intervened in the administrative proceedings before the plan and zoning commission pursuant to § 22a-19 (a). Id. After the plan and zoning commission approved the subdivision application, the plaintiffs appealed to the trial court, which rendered judgment for the defendants. Id., 731. The plaintiffs thereupon appealed to this court. Id.\n\nIn this court, the plaintiffs claimed that: (1) they had a right to intervene pursuant to § 22a-19 (a); and (2) because the agricultural land on which the subdivision had been approved was a natural resource of the state, under § 22a-19 (b) the plan and zoning commission was required to explore all feasible and prudent alternatives before granting the subdivision application. Id., 731-32. The defendants contended, to the contrary, that: (1) ''the appeals of those plaintiffs whose standing is based solely upon their status as petitioners under § 22a-19 (a) should be dismissed because . . . the statute does not authorize intervention in a subdivision proceeding conducted by a municipal planning commission''; id., 732; and (2) agricultural land is not a natural resource of the state within the meaning of § 22a-19 (b). Id.\n\nWe ultimately agreed with the defendants and held that agricultural land was not a ''natural resource'' within the meaning of the act. Red Hill II, supra, 212 Conn. 739-40. Contrary to the statement of the majority in the present case, however, that ''the crux of the court's analysis focused on the second issue raised on appeal, whether the legislature intended agricultural land to be a natural resource for the purposes of § 22a19,'' that was one of two separate--and analytically distinct--issues before this court. The other, of course, was the issue in the present case, namely, irrespective of and antecedent to that question, whether the intervenor had the right to intervene under § 22a-19 (a) to raise environmental concerns in a subdivision application proceeding.\n\nIn deciding the intervention and standing question posed by the parties' contentions regarding § 22a-19 (a), we stated: ''Contrary to the defendants' position, § 22a19 (a) does authorize intervention in a subdivision review proceeding conducted by a municipal planning commission. It plainly provides that intervention is authorized in any administrative, licensing or other proceeding, and in any judicial review thereof made available by law. . . . Proceedings before planning and zoning commissions are classified as administrative. See, e.g., Vose v. Planning \u0026 Zoning Commission, 171 Conn. 480, 483, 370 A.2d 1026 (1976). Accordingly, the plain and unambiguous language of § 22a-19 (a) permits intervention in proceedings conducted by a municipal planning commission. Connecticut Hospital Assn. v. Commission on Hospitals \u0026 Health Care, 200 Conn. 133, 141, 509 A.2d 1050 (1986). It is well settled that a statute must be applied as its words direct. . . . Where the language used is clear and unambiguous, we will not speculate as to some supposed intention.... Id.\n\n''The defendants' additional argument that the plaintiffs were not entitled to intervene pursuant to § 22a19 (a) because agricultural land is not a natural resource puts the cart before the horse. Section 22a-19 (a) makes intervention a matter of right once a verified pleading is filed complying with the statute, whether or not those allegations ultimately prove to be unfounded. We have declared that the statute permits any person, on the filing of a verified pleading, to intervene in any administrative proceeding for the limited purpose of raising environmental issues. Connecticut Fund for the Environment, Inc. v. Stamford, [supra, 192 Conn. 248 n.2]. In Mystic Marinelife Aquarium, Inc. v. Gill, [supra, 175 Conn. 490], we concluded that one who filed a verified pleading under § 22a-19 (a) became a party to an administrative proceeding upon doing so and had statutory standing to appeal for the limited purpose of raising environmental issues. It is clear that one basic purpose of the act is to give persons standing to bring actions to protect the environment. Belford v. New Haven, [supra, 170 Conn. 53-54].\n\n''We agree with the trial court that the plaintiffs, being entitled under § 22a-19 (a) to intervene for the purpose of raising environmental issues on the basis of the allegations of their verified pleadings, had standing to appeal from the action of the [plan and zoning commission] in approving the subdivision application.'' (Emphasis altered; internal quotation marks omitted.) Red Hill II, supra, 212 Conn. 733-34.\n\nFurthermore, contrary to the contention of the majority that, in ruling as we did, ''[t]he impact of § 22a-19 on the scope of an administrative agency's jurisdiction was neither raised nor decided'' in Red Hill II, an examination of the plan and zoning commission's brief in this court makes it clear that it did raise that issue in substance, and that, in ruling as we did, we were responding to that claim. The plan and zoning commission asserted in its brief that ''[t]he subdivision review process . . . does not involve conduct covered by § 22a-19 (a) as it is not a permit procedure or process. Thus, plaintiffs' intervention in the [plan and zoning commission] proceedings was inappropriate.'' Red Hill Coalition, Inc. v. Town Plan \u0026 Zoning Commission, Supreme Court Records \u0026 Briefs, June Term, 1989, Defendant's Brief, p. 16. It also argued that, ''[b]ecause the . . . plan and zoning commission, in exercising its function of reviewing a particular subdivision application, has no power to make, amend or repeal existing zoning regulations or zoning boundaries . . . it is obligated to approve the application if the conditions stated in the applicable regulations have been met. . . . Thus, [the] plaintiffs' claim that the subdivision would unreasonably pollute, impair or destroy the public trust in the air, water and other natural resources of the site is not within the province of the [plan and zoning commission], the issue was not properly before it and this matter should not be reviewed by this court.'' (Citations omitted; emphasis added; internal quotation marks omitted.) Id., pp. 17-18.\n\nIndeed, the plan and zoning commission then referred specifically to the companion proceedings before the conservation commission, which had involved the same inland wetlands concerns that the coalition, and the other intervening plaintiffs, had raised before both the conservation commission, acting as the town's inland wetlands agency, and the plan and zoning commission, passing on the subdivision application. The plan and zoning commission argued that ''any objection to the inland wetland agency decision should and can be made during that agency's hearings,'' which was ''the proper forum [in which] to raise them,'' that ''the inland wetlands agency is a specialized group of individuals with technical expertise in the wetlands area and permitting renewed consideration of these issues . . . may lead to undesirable environmental results,'' and that ''the plaintiffs had no right to intervene in the [plan and zoning commission] subdivision review process'' because ''[t]heir remedy was with the . . . conservation commission acting as inland wetlands agency.'' Id., pp. 19-20. Thus, although in Red Hill II the plan and zoning commission in its brief in this court did not rely specifically on either Connecticut Fund for the Environment, Inc., orMiddletown, it did so in substance, by arguing that the plan and zoning commission was not the proper forum in which to raise environmental concerns, and that those concerns were within the province of the inland wetlands agency.\n\nFurthermore, it is clear from the record in Red Hill II that the environmental issues raised by the intervening coalition went far beyond the inland wetlands issues raised in Red Hill I. Although our opinion did not discuss the nature of the environmental concerns that the plaintiffs had raised, I have reviewed the record and briefs of the parties in Red Hill II. That review discloses that the plaintiffs, in support of their allegations that the proposed subdivision would cause unreasonable detriment to the natural resources of the state, had introduced evidence before the plan and zoning commission that: the development containing roads, houses, sewer systems and sidewalks, would impair the soil for agricultural use; vegetation and wetlands on the site would be impaired, and a natural pond eliminated; the site's vegetation and wildlife would be impaired by street drainage; and a stressed ecosystem would be injured further by a new predominance of weedy species. Id., Plaintiff's Brief, p. 4 n.2.\n\nSignificantly, none of these environmental concerns ordinarily would be within the purview of a proceeding on a subdivision application. Nonetheless, we held that the plaintiffs had the right to intervene in the subdivision proceedings to raise them.\n\nThis discussion brings two facts into clear focus. First, in both Red Hill decisions we did not make the right of the plaintiffs to intervene depend on whether the nature of the allegations of their verified petition to intervene raised concerns that otherwise were within the jurisdictional purview of the agency. Instead, we focused on the language of § 22a-19 (a) and the purpose of the act. In light of that language and purpose, we concluded, specifically in Red Hill II, supra, 212 Conn. 733-34, that the plaintiffs had the right to intervene in order to raise environmental claims, irrespective of the lack of connection between the nature of those claims and the statutory jurisdiction of the plan and zoning commission in ruling on a subdivision application. Sec ond, that holding was made on a record that fully disclosed that environmental concerns had been raised by an intervenor that went beyond the traditional jurisdiction of the plan and zoning commission passing on a subdivision application, and in the face of arguments that the subdivision proceeding was not the proper forum for such concerns. Thus, contrary to the majority's assertion that Red Hill II ''has no bearing on the issue before us in the present case,'' in fact the majority has overruled Red Hill II sub silentio, and without giving any rationale for such an action that is rooted in the doctrine of stare decisis. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Red Hill II was followed by our decision in Paige v. Town Plan \u0026 Zoning Commission, 235 Conn. 448, 668 A.2d 340 (1995).\n\nIn that case, Fairfield University had filed an application with the town plan and zoning commission to resubdivide certain wooded acreage into forty building lots, along with an application for a special permit to excavate and fill the land. Id., 450-51. The plaintiffs filed a notice of intervention pursuant to § 22a-19 (a) alleging that development of the proposed subdivision would require clear-cutting of the acreage, thereby causing unreasonable pollution, impairment or destruction of the public trust in the air, water, wildlife and other natural resources of the state. Id., 451. After the plan and zoning commission approved the application, with certain conditions; id.; the plaintiffs appealed to the trial court pursuant to General Statutes § 8-8 (b), claiming that the clear-cutting of the acreage would unreasonably destroy a natural resource, namely, the trees, and the wildlife that inhabited the area, and that, therefore, the commission was required to consider feasible and prudent alternatives. Id., 452.\n\nThe trial court dismissed the appeal, holding that trees and wildlife are not natural resources within the meaning of § 22a-19 (a), and reasoning that to hold to the contrary potentially would require environmental alternatives to be considered for every subdivision application in the state. Id. The Appellate Court affirmed the judgment of the trial court reasoning that the term ''natural resource'' in § 22a-19 (a) means a resource that, when extracted from its native state, has economic value, such as timberland, oil, gas and other ore deposits, and also including economic value from tourism and research. Paige v. Town Plan \u0026 Zoning Commission, 35 Conn. App. 646, 651, 646 A.2d 277 (1994). The Appellate Court determined that there was no evidence that the trees and wildlife in question had economic value and, therefore, they were not natural resources within the meaning of § 22a-19 (a). Id., 652.\n\nIn the subsequent certified appeal, we reversed the Appellate Court because we disagreed with its construction of the statutory term ''natural resource,'' holding instead that ''trees and wildlife are natural resources regardless of their economic value ....''Paige v. Town Plan \u0026 Zoning Commission, supra, 235 Conn. 454. Accordingly, we remanded the case ''for consideration by the trial court on the question of whether the commission properly applied § 22a-19.'' Id.\n\nIn arriving at those conclusions, moreover, we did not question the right of the plaintiffs to intervene, under § 22a-19 (a), in order to raise environmental concerns in a municipal subdivision proceeding. To be sure, insofar as the Appellate Court's and this court's opinions disclose, that question was not presented. Nonetheless, standing to intervene, whether based on statute or common law, is ordinarily a matter of subject matter jurisdiction, which does not depend on whether it is raised by a party. See Stamford Hospital v. Vega, 236 Conn. 646, 656, 674 A.2d 821 (1996); Weidenbacher v. Duclos, 234 Conn. 51, 54 n.4, 661 A.2d 988 (1995). Thus, although it is not determinative, the fact that we did not question the subject matter jurisdiction of the trial court over the plaintiffs' appeal suggests, at least, that it existed. Furthermore, in this connection, as in both Red Hill decisions, we did not inquire into the connection between the plaintiffs' environmental allegations and the statutory jurisdiction of the commission.\n\nMore significantly, however, we explicitly returned to the expansive view of the act that we had expressed prior to our decisions in Connecticut Fund for the Environment, Inc., and Middletown. We referred to ''the broad policy language found in General Statutes § 22a36 . . . .'' Paige v. Town Plan \u0026 Zoning Commission, supra, 235 Conn. 456. We referred to that part of the legislative history of the act in which it was explained that the act ''would expand the right of a person to have access to the courts when property which we might say belongs to all of the public is jeopardized by the alleged polluting activity.'' (Internal quotation marks omitted.) Id., 459. We stated that ''[i]t is clear that § 22a-19, consistent with the rest of the act, was intended, not as a mere impediment to developers, but rather as a means to protect the environment from unreasonable adverse impact.'' Id., 462.\n\nIn addition, we specifically noted the ''fear that consideration of alternatives pursuant to § 22a-19 (b) for every subdivision in the state; Paige v. Town Plan \u0026 Zoning Commission, supra, 35 Conn. App. 652; would be required . . . .'' (Internal quotation marks omitted.) Paige v. Town Plan \u0026 Zoning Commission, supra, 235 Conn. 462. We responded by noting our belief ''that those fears are unfounded. By requiring the commission to apply the reasonableness standard set forth in § 22a19 (a), we do not anticipate a sudden influx of citizen intervenors in subdivision applications. Nor do we expect that alternative plans will be required in each case any more than if we were to adopt the economic test espoused by the Appellate Court. By its plain terms, General Statutes § 22a-19 (b) requires the consideration of alternative plans only where the commission first determines that it is reasonably likely that the project would cause unreasonable pollution, impairment or destruction of the public trust in the natural resource at issue. See Red Hill [II, supra, 212 Conn.] 734-35; Mystic Marinelife Aquarium, Inc. v. Gill, [supra, 175 Conn. 499]; Fromer v. Boyer-Napert Partnership, 42 Conn. Sup. 57, 69-71, 599 A.2d 1074 [1990], aff'd, 26 Conn. App. 185, 599 A.2d 398 (1991); 14 H.R. Proc., Pt. 2, 1971 Sess., pp. 737, 741-42. In view of the factors and standards that govern the determination in each case, any fear that a broad definition will cause alternative plans to be required in virtually every case is plainly unwarranted. . . . Paige v. Town Plan \u0026 Zoning Commission, supra, [35 Conn. App.] 672-73 (Schaller, J., dissenting).'' (Emphasis in original; internal quotation marks omitted.) Paige v. Town Plan \u0026Zoning Commission, supra, 235 Conn. 462-63.\n\nIn both Red Hill II and Paige, therefore, we read the act as imposing on municipal town plan and zoning commissions the obligation, in exercising their statutory jurisdiction to pass upon subdivision applications, to consider environmental concerns that otherwise would not be within that jurisdiction. We did so, moreover, on the basis of the broad and explicit language of the act, and its underlying purpose to protect the natural resources of the state. Neither decision, however, can be squared with Connecticut Fund for the Environment, Inc., and Middletown, either on the facts or the reasoning. The question, therefore, is which line of cases is to be followed.\n\nI would conclude that Red Hill II and Paige are more faithful to the language and purpose of the act. First, both those cases focus on the broad language of the act permitting intervention, and explain why a plain reading of that language comports with the act's basic purpose. Second, both cases more closely echo the reasoning of those cases decided prior to Connecticut Fund for the Environment, Inc., and Middletown, namely, Belford, Mystic Marinelife Aquarium, Inc., and Manchester Environmental Coalition. Third, since Red Hill II, our courts have recognized its holding and, either explicitly or implicitly, have approved intervention under § 22a-19 (a) in administrative proceedings that, on their face, did not involve environmental issues. See, e.g., Christian Activities Council, Congregational v. Town Council, 249 Conn. 566, 735 A.2d 231 (1999) (intervention under § 22a-19 [a] in affordable housing proceeding); Paige v. Town Plan \u0026 Zoning Commission, supra, 235 Conn. 448 (intervention under § 22a19 [a] in application for resubdivision and special permit proceedings); Keiser v. Zoning Commission, 62 Conn. App. 600, 771 A.2d 959 (2001) (intervention under § 22a19 [a] in special permit and site plan approval proceedings); Dietzel v. Planning Commission, 60 Conn. App. 153, 758 A.2d 906 (2000) (intervention under § 22a-19 [a] in subdivision and settlement proceedings). In addition, we have cited Red Hill I with approval of its broad proposition regarding the standing of an intervenor under § 22a-19 (a). See Branhaven Plaza, LLC v. Inland Wetlands Commission, 251 Conn. 269, 276 n.9, 740 A.2d 847 (1999) (in denying motion to dismiss appeal for lack of standing by intervenor, court stated: ''The motion to dismiss is denied. Section 22a-19 [a] allows any person to intervene so that private citizens are provided a voice in ensuring that the natural resources of the state remain protected. Because the plaintiffs filed a notice of intervention at the commission hearings in accordance with § 22a-19 [a], they had standing to appeal the environmental issues associated with that commission's decision. See Red Hill [I, supra, 212 Conn. 715].''). \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nApplication of the standards articulated in Red Hill II and Paige to the facts of the present case leads me to conclude that the plaintiff's request to intervene should have been granted. The plaintiff filed a verified application, complying with § 22a-19 (a), alleging that the proceeding involved conduct reasonably likely to have the effect of unreasonably polluting, impairing or destroying the public trust in the air, water, wildlife or other natural resources of the state. This conferred on the plaintiff the right to intervene.\n\nI recognize that this conclusion may be counterintuitive, in that it imposes the duty to inquire into environmental issues, upon the presentation of appropriate evidence, upon agencies, such as the traffic commission in the present case, that may have no environmental expertise. That, however, is the result of the broad language and fundamental policy of the act, which presumably the legislature took into account in stating that such intervention was permitted ''[i]n any administrative, licensing or other proceeding, and in any judicial review thereof made available by law . . . [that] involves conduct''; (emphasis added) General Statutes § 22a-19 (a); which may unreasonably pollute natural resources. Indeed, it is difficult to see why a town plan and zoning commission passing on a subdivision application would have any more expertise regarding the environmental impact of the subdivision on vegetation, wildlife, new weedy species and impairment of wetlands; see Red Hill II, supra, 212 Conn. 727; or why such a commission passing on the same kind of application would have any more such expertise regarding the environmental impact on trees and wildlife; see Paige v. Town Plan \u0026 Zoning Commission, supra, 235 Conn. 448; than the present traffic commission would have regarding the environmental concerns to be raised by the plaintiff here. Put another way, we resolved that purported dilemma in Red Hill II and Paige in favor of intervention, based upon the language and policy of the act. The same resolution is required in the present case.\n\nThe majority relies heavily on Connecticut Fund for the Environment, Inc., and Middletown. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e I acknowledge that the application of the facts and reasoning of those two cases, if applied to the present case without regard to the jurisprudence that preceded them and without regard to our subsequent decisions in Red Hill II and Paige, would support the defendants' position. I take this opportunity, therefore, to explain what I perceive to be the analytical flaws in those cases.\n\nI first note that neither case even purported to analyze the broad language and purpose of the act. In both, the court simply asserted the jurisdictional limit, which had never before been adverted to, without any reference to that language or purpose.\n\nConnecticut Fund for the Environment, Inc., and Middletown established two propositions. First, standing for environmental intervention pursuant to § 22a19 of the act is limited to environmental matters that ''impact on'' the statutory subject matter of the administrative agency into whose proceedings the purported intervenor seeks to intervene. Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 250. Although we did not define precisely what it means to say that an agency may consider environmental concerns that ''impact'' on its statutory grant of jurisdiction, I take this proposition to mean that, if an agency has statutory jurisdiction that in some fashion already encompasses environmental concerns, e.g., inland wetlands, the function of § 22a-19 (a) is limited to conferring standing on persons or entities to intervene before that agency in order to raise those environmental concerns, but only those environmental concerns, without those persons or entities having to meet the traditional standing requirements that otherwise would be required for intervention. See, e.g., Crone v. Gill, 250 Conn. 476, 480, 736 A.2d 131 (1999) (fundamental test for establishing classical aggrievement). The analytical difficulty with this proposition, however, is that it cannot be squared with the broad and explicit language of § 22a19 (a), granting the right to intervene in ''any administrative, licensing or other proceeding . . . [that] involves conduct which'' may unreasonably pollute, considered in light of the basic purpose of the act to protect the natural resources of the state. (Emphasis added.)\n\nThe second proposition established by those two cases is that § 22a-16, which is an independent action counterpart to § 22a-19, does ''not provide [a plaintiff] with standing under any statute other than the [act] itself.'' Middletown v. Hartford Electric Light Co., supra, 192 Conn. 597. Put another way, standing to bring an independent action pursuant to § 22a-16 of the act is limited to those instances or cases brought pursuant to the act itself.\n\nThe analytical difficulty with this latter proposition, which the claims of the plaintiff in the present case highlight, is that, for all practical purposes, the act does no more than: (1) state the public policy of the state with regard to its natural resources; General Statutes § 22a-15; \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e and (2) create general remedies of both independent judicial actions, and judicial and administrative intervention, to enforce that public policy. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Thus, it was self-contradictory to hold, as we did in Middletown, that one has standing under § 22a-16 to raise environmental concerns only under the act itself, and that, when one attempts to bring such an independent action, one has no standing to do so. In other words, it is difficult to see why the action that was held to be without standing in Middletown was not an action under the act itself. The majority, in relying on and reaffirming the holding of Middletown, does not explain this self-contradiction.\n\nThus, on close examination, it is difficult to divine what, if anything, was left by those two cases of the holdings and language of the court in interpreting the act prior to those two cases. Certainly, those latter two cases were in tension with the earlier cases. Furthermore, if under Connecticut Fund for the Environment, Inc., one only could intervene in an administrative proceeding to raise environmental concerns that already were within the administrative agency's jurisdiction, it is difficult to see what, if anything, was left to § 22a-19 (a) of the act providing for standing of private parties \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e to intervene in ''any administrative . . . proceeding . . . .'' (Emphasis added.) Similarly, if under Middletown one had no standing to bring an independent action against another person whose conduct, allegedly illegal under other state licensing statutes, was claimed to violate the act, it is difficult to see what, if anything, was left to § 22a-16 providing for the right to bring independent actions under the act. This analysis leads me to conclude, therefore, that neither Connecticut Fund for the Environment, Inc., nor Middletown should apply to bar the plaintiff's standing to intervene in the present case.\n\nNonetheless, the majority relies on what it perceives as legislative approval by silence of those two cases. That reliance is, in my view, misplaced. First, the two Red Hill decisions have been on the books for twelve years, and the legislature has been equally silent with regard to them, even in the face of their subsequent application in several appellate cases. Second, Paige has been on the books for six years, followed by a similar legislative silence. Third, the body of precedent that antedated Red Hill II and Paige, which by its language strongly suggested that § 22a-19 (a) has broad, rather than narrow, contours, has been on the books for twenty-six years, followed by a similar legislative silence. Thus, contrary to the contention of the majority, I do not think that we can draw any reliable inferences from the legislature's silence following Connecticut Fund for the Environment, Inc., and Middletown.\n\nThe majority also relies on the presumptions that the legislature is aware of statutory jurisdictional limits on state and local agencies, and that the legislature intends to create a harmonious body of law. I have no dispute with either presumption. I do dispute, however, the majority's assertion that the interpretation of § 22a-19 (a) that I advance ''would vitiate those statutes that establish the limited jurisdiction of an administrative agency,'' and its suggestion that such an interpretation somehow would create a disharmonious body of law.\n\nThere is nothing vitiating about the legislature, for strong reasons of public policy embodied in the act, supplementing an agency's usual jurisdiction by requiring it to consider, in specific cases, the environmental evidence presented by an environmental intervenor under § 22a-19 (a). That is all that § 22a-19 (a) does. Indeed, under the majority's reasoning, there is very little, if anything, left to the language of § 22a-19 (a) permitting intervention in ''any administrative, licensing or other proceeding . . . [that] involves conduct . . . [that] is reasonably likely to [pollute]''; (emphasis added); because under the majority's interpretation that language means in effect, ''any administrative or other proceeding that is already devoted to certain environmental issues.'' (Emphasis added.) In this connection, I note that, although the majority rests its analysis, in part at least, on the process of statutory interpretation, nowhere does it suggest, either by reference to legislative history or the purpose of the act, why the language ''any administrative, licensing or other proceeding'' contained in § 22a-19 should be implicitly amended to have the meaning that the majority attributes to it. Furthermore, there is nothing disharmonious about the legislature supplementing an agency's usual jurisdiction in certain, specified cases for strong reasons of public policy, which is all that § 22a-19 (a) does.\n\nI am particularly puzzled by the majority's concomitant assertion that ''[i]f a party wants to raise environmental concerns that are beyond the scope of authority of a particular agency, the act provides a means for doing so, namely, instituting an independent action pursuant to § 22a-16.'' That, however, is precisely what this court barred the plaintiff from doing in Middletown, which the majority both relies on and reaffirms. Thus, the majority's opinion will, I suggest, engender confusion about the efficacy of independent actions filed pursuant to § 22a-16.\n\nThe traffic commission, although not the majority in the present case, argues that the interpretation of the act that I propose, and as was explicitly adopted in Red Hill II, would ''[prove] too much,'' because it would mean that if, for example, ''the department of motor vehicles . . . issues licenses to drive, and driving a car can contribute to air pollution, then [the act] permits a third party to intervene in motor vehicle operator licensing proceedings to object to the licenses on the basis of the potential of increased air pollution.'' I am not persuaded.\n\nI acknowledge that this interpretation of § 22a-19, if taken to its logical extreme, could lead to this bizarre result, and that we do not interpret statutes to yield bizarre results. See, e.g., Rich-Taubman Associates v. Commissioner of Revenue Services, 236 Conn. 613, 621, 674 A.2d 805 (1996). That does not necessarily mean, however, that, having interpreted the act in this way in the present case, we would be required in the future to carry that interpretation through to such a result. Just as legislative language has its limits; see, e.g., Fahy v. Fahy, 227 Conn. 505, 513-14, 630 A.2d 1328 (1993); so does any judicial interpretation of such language. Thus, although a court should not interpret statutory language to yield bizarre results, it also should not avoid an otherwise reasonable interpretation, appropriately arrived at by analyzing the language and purposes of the statute, solely because that interpretation might lead to such a result in an extreme case. That case appropriately may be dealt with, when and if it arises, by resort to other sound principles of statutory interpretation, one of which, for example, requires resort to common sense. See, e.g., Berkley v. Gavin, 253 Conn. 761, 774, 756 A.2d 248 (2000). Thus, if the claimed intervention rests on a premise that is simply so attenuated in its environmental basis that it offends common sense, it is unlikely that it would fall within even the broad remedial purposes of the act.\n\nThis brings me to the final part of the majority opinion, in which it concludes that: (1) a request to intervene pursuant to § 22a-19 (a) must set forth the specific facts on which the intervenor's request is based; and (2) in the present case, the traffic commission had no environmental jurisdiction and, therefore, there are no allegations that the plaintiff could have made in support of his request. I disagree with both of these conclusions.\n\nWith respect to the sufficiency of the plaintiff's pleading under § 22a-19 (a), his request to intervene was framed in the language of the statute. It asserted that the application of the defendant First Stamford Corporation (First Stamford) concerned ''an administrative proceeding which involves conduct which is reasonably likely to have the effect of unreasonably polluting, impairing or destroying the public trust in the air, water, wildlife or other natural resources of the state.'' That is as much specificity as § 22a-19 requires. The statute provides that, with respect to any administrative or other proceeding, one ''may intervene as a party on the filing of a verified pleading asserting that the proceeding or action for judicial review involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state.'' (Emphasis added.) General Statutes § 22a19 (a).\n\nFurthermore, it is significant that, in the present case, the plaintiff sought to intervene in an administrative, as opposed to a judicial, proceeding. Section 22a-19 sets the standard for intervention into both. We have recognized that administrative proceedings are ordinarily designed to function with less formality than judicial proceedings, so that often citizens may participate without the practical necessity of representation by counsel. See, e.g., Concerned Citizens of Sterling v. Sterling, 204 Conn. 551, 529 A.2d 666 (1987); Welch v. Zoning Board of Appeals, 158 Conn. 208, 212-13, 257 A.2d 795 (1969); Village Builders, Inc. v. Town Plan \u0026 Zoning Commission, 145 Conn. 218, 220-21, 140 A.2d 477 (1958). That recognition supports an interpretation of § 22a-19 (a), contrary to that of the majority, that the statute means what it says and does not have an implied factual specificity requirement in order to accommodate the less formal setting of administrative proceedings.\n\nThus, once the plaintiff filed his request for intervention framed in the language of the statute, he was entitled to intervene as a party. This does not mean, however, that either the traffic commission or First Stamford was powerless to require him to make his environmental claims more factually specific, so that either could properly respond to them. It merely means that denial of his request for intervention was improper. Once he had been permitted to intervene, either the traffic commission or First Stamford, or both, could have requested that he make his request more factually specific and, if he refused to do so, appropriate sanctions, including revocation or dismissal, could be imposed by the traffic commission.\n\nRequiring factual specificity in the request to intervene is inconsistent with the plain language of § 22a-19 (a), and with the nature of administrative proceedings in general and with the broad remedial purpose of the act in particular. The majority's reliance on Practice Book § 10-1 \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e and General Statutes § 52-473 (b) \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e does not compel a different result. Practice Book § 10-1 is not instructive because it applies only to judicial proceedings, and § 22a-19 permits intervention into both administrative and judicial proceedings. I see no reason to impose judicial pleading standards on intervention into an administrative proceeding, such as the one at issue in the present case. Furthermore, the implied factual specificity requirement adopted by the majority imposes a higher burden with respect to pleading than even Practice Book § 10-1 itself. That rule of judicial, as opposed to administrative, procedure provides that, if the pleading is not factually sufficient, ''the judicial authority may order a fuller and more particular statement . . . .'' Practice Book § 10-1. Thus, the remedy for any lack of factual particularity is not outright dismissal, as the majority concludes; rather, it is, as I suggested previously, an appropriate request for a more specific factual statement. Likewise, § 52-473 (b) is not informative, even by analogy. That provision governs the judicial pleading requirements antecedent to an ex parte temporary injunction, and by its very terms requires that the pleading states ''specific facts.'' Section 22a-19 (a), by contrast, applies to administrative as well as judicial proceedings, does not operate in an ex parte fashion, and contains no such language requiring factual specificity.\n\nWith respect to whether the plaintiff could have supplemented his generally phrased request for intervention with supporting facts, I also disagree with the majority. It is undisputed that traffic density is within the jurisdiction of the traffic commission under the certification proceeding involved in the present case. Traffic density undoubtedly involves issues of air pollution. One need not have a degree in chemistry to know that cars emit carbon, among other pollutants, into the air, and that the more cars there are in a given place and time the more carbon and other polluting emissions there will be. This is precisely why § 22a-19 (a) permits intervention into ''any administrative, licensing or other proceeding . . . [that] involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air''; (emphasis added); and is precisely why Red Hill II held that, once such an allegation has been made, intervention is a matter of right.\n\nI would, therefore, reverse the judgment of the Appellate Court, and direct that the plaintiff's appeal to the trial court be sustained.\n\n\u003cspan class=\"fn\"\u003e1. This case was first argued on September 19, 2000, before a panel of this court consisting of Justices Borden, Norcott, Palmer, Vertefeuille and Ronan. Thereafter, the court pursuant to Practice Book § 70-7 (b), sua sponte, ordered that the case be considered en banc. Chief Justice Sullivan and Justice Zarella were added to the panel on May 2, 2001, and they have read the record, briefs and transcripts of the original oral argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. General Statutes § 22a-19 provides: ''(a) In any administrative, licensing or other proceeding, and in any judicial review thereof made available by law, the Attorney General, any political subdivision of the state, any instrumentality or agency of the state or of a political subdivision thereof, any person, partnership, corporation, association, organization or other legal entity may intervene as a party on the filing of a verified pleading asserting that the proceeding or action for judicial review involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state. ''(b) In any administrative, licensing or other proceeding, the agency shall consider the alleged unreasonable pollution, impairment or destruction of the public trust in the air, water or other natural resources of the state and no conduct shall be authorized or approved which does, or is reasonably likely to, have such effect so long as, considering all relevant surrounding circumstances and factors, there is a feasible and prudent alternative consistent with the reasonable requirements of the public health, safety and welfare.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. General Statutes § 4-183 provides in relevant part: ''(a) A person who has exhausted all administrative remedies available within the agency and who is aggrieved by a final decision may appeal to the Superior Court as provided in this section. The filing of a petition for reconsideration is not a prerequisite to the filing of such an appeal. ''(b) Aperson may appeal a preliminary, procedural or intermediate agency action or ruling to the Superior Court if (1) it appears likely that the person will otherwise qualify under this chapter to appeal from the final agency action or ruling and (2) postponement of the appeal would result in an inadequate remedy. ''(c) Within forty-five days after mailing of the final decision under section 4-180 or, if there is no mailing, within forty-five days after personal delivery of the final decision under said section, a person appealing as provided in this section shall serve a copy of the appeal on the agency that rendered the final decision at its office or at the office of the Attorney General in Hartford and file the appeal with the clerk of the superior court for the judicial district of New Britain or for the judicial district wherein the person appealing resides or, if that person is not a resident of this state, with the clerk of the court for the judicial district of New Britain. Within that time, the person appealing shall also serve a copy of the appeal on each party listed in the final decision at the address shown in the decision, provided failure to make such service within forty-five days on parties other than the agency that rendered the final decision shall not deprive the court of jurisdiction over the appeal. Service of the appeal shall be made by (1) United States mail, certified or registered, postage prepaid, return receipt requested, without the use of a state marshal or other officer, or (2) personal service by a proper officer or indifferent person making service in the same manner as complaints are served in ordinary civil actions. If service of the appeal is made by mail, service shall be effective upon deposit of the appeal in the mail.... We note that since 1997, when the administrative appeal in this case was filed, § 4-183 has been amended several times. See Public Acts 1999, Nos. 99-39 and 99-215, § 24; Public Acts 2000, No. 00-99, § 20. Those amendments made minor technical changes that are not relevant to this appeal. For purposes of clarity, references herein are to the current revision of the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We granted the plaintiff's petition for certification to appeal, limited to the following issues: ''(1) Did the Appellate Court properly conclude that the plaintiff's appeal from the denial of his intervenor status before the defendant state traffic commission was untimely?''; and ''(2) Did the plaintiff have standing to raise environmental issues before the defendant state traffic commission?'' Nizzardo v. State Traffic Commission, 252 Conn. 943, 747 A.2d 520 (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The other defendants are: James Sullivan, the commissioner of the department of transportation and chair of the commission; Richard J. Howard, the executive director of the commission; and First Stamford Corporation, the applicant before the commission. We refer herein to the commission, Sullivan and Howard collectively as the commission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. General Statutes § 14-311 provides: ''(a) No person, firm, corporation, state agency, or municipal agency or combination thereof shall build, expand, establish or operate any open air theater, shopping center or other development generating large volumes of traffic, having an exit or entrance on, or abutting or adjoining, any state highway or substantially affecting state highway traffic within this state until such person or agency has procured from the State Traffic Commission a certificate that the operation thereof will not imperil the safety of the public. ''(b) No local building official shall issue a building or foundation permit to any person, firm, corporation, state agency or municipal agency to build, expand, establish or operate such a development until the person, firm, corporation or agency provides to such official a copy of the certificate issued under this section by the commission. If the commission determines that any person, firm, corporation, or state or municipal agency has (1) started building, expanding, establishing or operating such a development without first obtaining a certificate from the commission or (2) has failed to comply with the conditions of such a certificate, it shall order the person, firm, corporation or agency to (A) cease constructing, expanding, establishing or operating the development or (B) comply with the conditions of the certificate within a reasonable period of time. If such person, firm, corporation or agency fails to (i) cease such work or (ii) comply with an order of the commission within such time as specified by the commission, the commission may make an application to the superior court for the judicial district of Hartford or the judicial district where the development is located enjoining the construction, expansion, establishment or operation of such development. ''(c) The State Traffic Commission shall issue its decision on an application for a certificate under subsection (a) of this section not later than one hundred twenty days after it is filed, except that, if the commission needs additional information from the applicant, it shall notify the applicant in writing as to what information is required and (1) the commission may toll the running of such one-hundred-twenty-day period by the number of days between and including the date such notice is received by the applicant and the date the additional information is received by the commission and (2) if the commission receives the additional information during the last ten days of the one-hundred-twenty-day period and needs additional time to review and analyze such information, it may extend such period by not more than fifteen days. The State Traffic Commission may also, at its discretion, postpone action on any application submitted pursuant to this section or section 14-311a until such time as it is shown that an application has been filed with and approved by the municipal planning and zoning agency or other responsible municipal agency. ''(d) In determining the advisability of such certification, the State Traffic Commission shall include, in its consideration, highway safety, the width and character of the highways affected, the density of traffic thereon, the character of such traffic and the opinion and findings of the traffic authority of the municipality wherein the development is located. If the State Traffic Commission determines that traffic signals, pavement markings, channelization, pavement widening or other changes or traffic control devices are required to handle traffic safely and efficiently, one hundred per cent of the cost thereof shall be borne by the person building, establishing or operating such open air theater, shopping center or other development generating large volumes of traffic, except that such cost shall not be borne by any municipal agency. The Commissioner of Transportation may issue a permit to said person to construct or install the changes required by the State Traffic Commission. ''(e) Any person aggrieved by any decision of the State Traffic Commission hereunder may appeal therefrom in accordance with the provisions of section 4-183, except venue for such appeal shall be in the judicial district in which it is proposed to operate such establishment. The provisions of this section except insofar as such provisions relate to expansion shall not apply to any open air theater, shopping center or other development generating large volumes of traffic in operation on July 1, 1967.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The commission suggested that the plaintiff submit his environmental concerns ''to those town, state or federal agencies having jurisdiction over the particular environmental resources that you believe may be adversely affected by the development.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It is true, as the plaintiff points out, that on December 31, 1996, the commission granted to the town of Greenwich (town) ''intervenor status pursuant to [§] 22a-19 . . . for the limited purpose of raising environmental issues relevant to the [commission's] consideration of [First Stamford's] application . . . .'' The town's verified notice of intervention and request for intervenor status pursuant to § 22a-19 had specified the particular environmental issues that it sought to address. Subsequently, however, on January 13, 1997, after the town had submitted certain material regarding environmental issues, the commission informed the town that, except for certain drainage issues that would be considered by the commission as relevant to the ''state highway drainage system'' and therefore also ''relevant to traffic control or highway safety,'' the environmental questions that the town sought to raise ''do not come under the statutory jurisdiction of the [commission] . . . [and the commission] is not empowered to act on them.'' The commission adhered to this position when it considered First Stamford's application on the merits, by ruling that the town's proposed environmental evidence was inadmissible. Thus, ultimately, the commission's position with respect to the town's request to intervene pursuant to § 22a-19 was consistent with its position with respect to that of the plaintiff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The commission, however, opposed this basis of the motion, arguing that the appeal had been timely taken because it was filed within forty-five days of the commission's decision granting First Stamford's application.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. As our grant of certification indicates; see footnote 4 of this opinion; this appeal involves neither the trial court's determination that the plaintiff was not classically aggrieved nor the Appellate Court's conclusion affirming that determination. This appeal is limited to the questions concerning the plaintiff's claims of intervenor status pursuant to § 22a-19 to raise environmental issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The parties do not dispute, nor do we, that an appeal to the Superior Court lies from the commission's decision granting the certificate of operation, despite the fact that the statute governing the administrative proceeding in question does not require a hearing. Ordinarily, under § 4-183 of the Uniform Administrative Procedure Act (UAPA); General Statutes § 4-166 et seq.; in order for an administrative decision to qualify as a final decision in a contested case under the UAPA, and therefore be appealable, there must have been a hearing that was required by statute. General Statutes § 4166 (2); see also Summit Hydropower Partnership v. Commissioner of Environmental Protection, 226 Conn. 792, 811, 629 A.2d 367 (1993). In the present case, however, there is nothing in § 14-311 requiring that a hearing be held on an application for a certificate of operation. See footnote 6 of this opinion. Nonetheless, that statute specifically provides that ''[a]ny person aggrieved by any decision of the State Traffic Commission hereunder may appeal therefrom in accordance with the provisions of section 4-183 ....'' General Statutes § 14-311 (e). If we were to read that provision as encompassing the usual requirement of a hearing required by statute, the provision would be meaningless, because the very statute to which it refers does not require a hearing. Thus, there would never be a permissible appeal thereunder. We therefore construe that provision to mean that an aggrieved party may appeal from a decision of the commission notwithstanding the usual requirement of a statutorily required hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. General Statutes § 4-166 (3) provides: '' 'Final decision' means (A) the agency determination in a contested case, (B) a declaratory ruling issued by an agency pursuant to section 4-176 or (C) an agency decision made after reconsideration. The term does not include a preliminary or intermediate ruling or order of an agency, or a ruling of an agency granting or denying a petition for reconsideration ....'' This case does not implicate the meaning of either subdivision (B) or (C) of § 4-166 (3), or of the language ''a ruling of an agency granting or denying a petition for reconsideration'' included in that subsection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. General Statutes § 4-166 (2) provides: '' 'Contested case' means a proceeding, including but not restricted to rate-making, price fixing and licensing, in which the legal rights, duties or privileges of a party are required by statute to be determined by an agency after an opportunity for hearing or in which a hearing is in fact held, but does not include proceedings on a petition for a declaratory ruling under section 4-176 or hearings referred to in section 4-168 ....''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. General Statutes § 4-177a (a) provides: ''The presiding officer shall grant a person status as a party in a contested case if that officer finds that: (1) Such person has submitted a written petition to the agency and mailed copies to all parties, at least five days before the date of hearing; and (2) the petition states facts that demonstrate that the petitioner's legal rights, duties or privileges shall be specifically affected by the agency's decision in the contested case.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. General Statutes § 4-166 (9) provides: '' 'Person' means any individual, partnership, corporation, limited liability company, association, governmental subdivision, agency or public or private organization of any character, but does not include the agency conducting the proceeding ....''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. General Statutes § 4-177a (b) provides: ''The presiding officer may grant any person status as an intervenor in a contested case if that officer finds that: (1) Such person has submitted a written petition to the agency and mailed copies to all parties, at least five days before the date of hearing; and (2) the petition states facts that demonstrate that the petitioner's participation is in the interests of justice and will not impair the orderly conduct of the proceedings.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. General Statutes § 52-263 provides: ''Upon the trial of all matters of fact in any cause or action in the Superior Court, whether to the court or jury, or before any judge thereof when the jurisdiction of any action or proceeding is vested in him, if either party is aggrieved by the decision of the court or judge upon any question or questions of law arising in the trial, including the denial of a motion to set aside a verdict, he may appeal to the court having jurisdiction from the final judgment of the court or of such judge, or from the decision of the court granting a motion to set aside a verdict, except in small claims cases, which shall not be appealable, and appeals as provided in sections 8-8 and 8-9.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See footnote 12 of this opinion for the text of § 4-166 (3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The act is codified at General Statutes §§ 22a-14 through 22a-20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. General Statutes §§ 22a-14 through 22a-20; see footnote 19 of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The terms ''supplemental'' and ''supplementary'' are synonymous. Webster's Third New International Dictionary defines supplemental as ''serving to supplement: of the character of a supplement: supplementary ....''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. General Statutes § 22a-16 provides: ''The Attorney General, any political subdivision of the state, any instrumentality or agency of the state or of a political subdivision thereof, any person, partnership, corporation, association, organization or other legal entity may maintain an action in the superior court for the judicial district wherein the defendant is located, resides or conducts business, except that where the state is the defendant, such action shall be brought in the judicial district of Hartford, for declaratory and equitable relief against the state, any political subdivision thereof, any instrumentality or agency of the state or of a political subdivision thereof, any person, partnership, corporation, association, organization or other legal entity, acting alone, or in combination with others, for the protection of the public trust in the air, water and other natural resources of the state from unreasonable pollution, impairment or destruction provided no such action shall be maintained against the state for pollution of real property acquired by the state under subsection (e) of section 22a-133m, where the spill or discharge which caused the pollution occurred prior to the acquisition of the property by the state.'' (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See footnote 2 of this opinion for the text of § 22a-19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The dissent and concurring opinion relies on its review of the briefs in Red Hill Coalition, Inc. v. Town Plan \u0026 Zoning Commission, supra, 212 Conn. 727, to buttress its conclusion that the two Red Hill Coalition, Inc., cases--Red Hill Coalition, Inc. v. Conservation Commission, 212 Conn. 710, 563 A.2d 1339 (1989) (Red Hill I), and Red Hill Coalition, Inc. v. Town Plan \u0026 Zoning Commission, supra, 727 (Red Hill II)--decided the same issue that is presented in the present case, namely, whether § 22a-19 (a) expands the jurisdictional authority of an agency. We disagree with the interpretation in the dissenting and concurring opinion of the issues addressed in those briefs. Moreover, we rely on the text of the unanimous opinions in both cases as the best evidence of the issues that were decided by the court. Close scrutiny of the text of both decisions reveals that neither addressed whether § 22a-19 (a) should be interpreted as expanding the otherwise limited authority of an agency. Likewise, we find no discussion of that issue in Paige v. Town Plan \u0026 Zoning Commission, 235 Conn. 448, 668 A.2d 340 (1995), another case cited in the dissenting and concurring opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. General Statutes § 1-1 (a) provides: ''In the construction of the statutes, words and phrases shall be construed according to the commonly approved usage of the language; and technical words and phrases, and such as have acquired a peculiar and appropriate meaning in the law, shall be construed and understood accordingly.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Practice Book § 10-1 provides: ''Each pleading shall contain a plain and concise statement of the material facts on which the pleader relies, but not of the evidence by which they are to be proved, such statement to be divided into paragraphs numbered consecutively, each containing as nearly as may be a separate allegation. If any such pleading does not fully disclose the ground of claim or defense, the judicial authority may order a fuller and more particular statement; and, if in the opinion of the judicial authority the pleadings do not sufficiently define the issues in dispute, it may direct the parties to prepare other issues, and such issues shall, if the parties differ, be settled by the judicial authority.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. General Statutes § 14-298 provides: ''There shall be within the Department of Transportation a State Traffic Commission. Said Traffic Commission shall consist of the Commissioner of Transportation, the Commissioner of Public Safety and the Commissioner of Motor Vehicles. For the purpose of standardization and uniformity, said commission shall adopt and cause to be printed for publication regulations establishing a uniform system of traffic control signals, devices, signs and markings consistent with the provisions of this chapter for use upon the public highways. The commissioner shall make known to the General Assembly the availability of such regulations and any requesting member shall be sent a written copy or electronic storage media of such regulations by the commissioner. Taking into consideration the public safety and convenience with respect to the width and character of the highways and roads affected, the density of traffic thereon and the character of such traffic, said commission shall also adopt regulations, in cooperation and agreement with local traffic authorities, governing the use of state highways and roads on state-owned properties, and the operation of vehicles including but not limited to motor vehicles, as defined by section 14-1, and bicycles, as defined by section 14-286, thereon. A list of limitedaccess highways shall be published with such regulations and said list shall be revised and published once each year. The commissioner shall make known to the General Assembly the availability of such regulations and list and any requesting member shall be sent a written copy or electronic storage media of such regulations and list by the commissioner. A list of limitedaccess highways opened to traffic by the Commissioner of Transportation in the interim period between publications shall be maintained in the office of the State Traffic Commission and such regulations shall apply to the use of such listed highways. Said commission shall also make regulations, in cooperation and agreement with local traffic authorities, respecting the use by through truck traffic of streets and highways within the limits of, and under the jurisdiction of, any city, town or borough of this state for the protection and safety of the public. If said commission determines that the prohibition of through truck traffic on any street or highway is necessary because of an immediate and imminent threat to the public health and safety and the local traffic authority is precluded for any reason from acting on such prohibition, the commission, if it is not otherwise precluded from so acting, may impose such prohibition. Said commission may place and maintain traffic control signals, signs, markings and other safety devices, which it deems to be in the interests of public safety, upon such highways as come within the jurisdiction of said commission as set forth in section 14-297. The traffic authority of any city, town or borough may place and maintain traffic control signals, signs, markings and other safety devices upon the highways under its jurisdiction, and all such signals, devices, signs and markings shall conform to the regulations established by said commission in accordance with this chapter, and such traffic authority shall, with respect to traffic control signals, conform to the provisions of section 14-299.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. General Statutes § 22a-19 provides: ''(a) In any administrative, licensing or other proceeding, and in any judicial review thereof made available by law, the Attorney General, any political subdivision of the state, any instrumentality or agency of the state or of a political subdivision thereof, any person, partnership, corporation, association, organization or other legal entity may intervene as a party on the filing of a verified pleading asserting that the proceeding or action for judicial review involves conduct which has, or which is reasonably likely to have, the effect of unreasonably polluting, impairing or destroying the public trust in the air, water or other natural resources of the state. ''(b) In any administrative, licensing or other proceeding, the agency shall consider the alleged unreasonable pollution, impairment or destruction of the public trust in the air, water or other natural resources of the state and no conduct shall be authorized or approved which does, or is reasonably likely to, have such effect so long as, considering all relevant surrounding circumstances and factors, there is a feasible and prudent alternative consistent with the reasonable requirements of the public health, safety and welfare.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. General Statutes § 22a-14 provides: ''Short title: Environmental Protection Act of 1971. Sections 22a-14 to 22a-20, inclusive, shall be known and may be cited as the 'Environmental Protection Act of 1971'.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The court then affirmed the trial court's conclusions that the act did not give the plaintiffs standing to challenge either proposed changes in the parks or the failure to repair tidal gates, and that the plaintiffs, who had been afforded standing to raise issues of pollution, had not proven their claims under the act. Belford v. New Haven, supra, 170 Conn. 54-55. In Manchester Environmental Coalition v. Stockton, supra, 184 Conn. 57, we stated: ''[T]he plaintiffs have standing under § 22a-16 which confers standing upon any person to sue any person for the protection of the public trust in the air, water and other natural resources of the state from unreasonable pollution, impairment or destruction.'' (Internal quotation marks omitted.) We overruled Belford to the extent that it had held otherwise. Id., 57 n.7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. More specifically, the evidence offered and excluded involved air and noise pollution, and other environmental problems, that presumably would have been created by the postal facility involved in the wetlands permit being considered by the board. Connecticut Fund for the Environment, Inc. v. Stamford, supra, 192 Conn. 251.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The majority does not take issue with the technique of examining the briefs in both Red Hill cases as a partial support for my conclusion that Red Hill II implicitly held that one may intervene under § 22a-19 (a) even though the agency has no specific environmental jurisdiction. Like the majority, however, I also rely on the text of those opinions. I suggest, moreover, that the majority's conclusion, namely, that Red Hill II ''has no bearing on the issue before us in the present case,'' can only be reached by disregarding both those briefs and that text, particularly the text, quoted in this dissenting opinion, specifically discussing environmental intervention under § 22a-19 (a) into a municipal planning and zoning commission proceeding. See Red Hill II, supra, 212 Conn. 733-34. Furthermore, the majority does not respond to the argument that both Red Hill cases, as well as Paige v. Town Plan \u0026 Zoning Commission, 235 Conn. 448, 668 A.2d 340 (1995), on their stated facts and law, explicitly rejected challenges to standing to intervene pursuant to § 22a-19 (a), where the agencies involved had no environmental jurisdiction as a matter of law. The necessary implication of the majority's cramped reading of those cases is that, despite what the texts of those cases disclose, we simply did not know what we were doing, subject matter jurisdictionally speaking, in rejecting those challenges. I give us more credit than that.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Indeed, the relatively small number of cases that have risen to the appellate level since Red Hill I and Red Hill II suggests that, contrary to what may be lurking behind the majority's reasoning, permitting intervention under § 22a-19 (a) upon the filing of a proper request will not open the proverbial floodgates of intervention requests. We expressly rejected that contention, however, in Paige. Furthermore, as we recognized in Paige, once having intervened, the intervenor still retains a significant burden to establish an unreasonable level of impairment of our natural resources. Therefore, there is a significant economic disincentive to the filing and pursuing of baseless requests for intervention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The majority also relies on Connecticut Water Co. v. Beausoleil, supra, 204 Conn. 38. To the extent, however, that that case conflicts with my conclusion in the present case, it is only with respect to its application of the holdings in Connecticut Fund for the Environment, Inc., and Middletown to the claim of res judicata in that case. I have no quarrel with the holding of Connecticut Water Co., that an environmental intervenor under § 22a-19 (a) could not expand his claims to encompass money damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. General Statutes § 22a-15 provides: ''Declaration of policy. It is hereby found and declared that there is a public trust in the air, water and other natural resources of the state of Connecticut and that each person is entitled to the protection, preservation and enhancement of the same. It is further found and declared that it is in the public interest to provide all persons with an adequate remedy to protect the air, water and other natural resources from unreasonable pollution, impairment or destruction.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The act consists of General Statutes §§ 22a-14 through 22a-20. See General Statutes § 22a-14. Section 22a-15 articulates the public policy. Section 22a-16 provides for an independent judicial action, by broad categories of persons, including the attorney general, for the protection of the state's natural resources. General Statutes § 22a-16a provides for alternative judicial remedies in cases brought by the attorney general pursuant to § 22a-16. General Statutes § 22a-17 provides for the appointment of a special master by the court in cases brought pursuant to § 22a-16. General Statutes § 22a18 outlines the broad powers of the court under the act. Section 22a-19 provides for intervention in certain administrative and judicial proceedings, and for the remedies available in such cases. General Statutes § 22a-20 provides that the provisions of the act are supplementary to other administrative and regulatory procedures provided by law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Neither Connecticut Fund for the Environment, Inc., nor Middletown involved an action or intervention by the attorney general. Nonetheless, I see no basis on which the standing of the attorney general to intervene under § 22a-19 (a) may be broader than that of a private individual. Thus, the majority's interpretation of the scope of that intervention presumably would apply to the attorney general as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Practice Book § 10-1, entitled ''Fact Pleading,'' provides: ''Each pleading shall contain a plain and concise statement of the material facts on which the pleader relies, but not of the evidence by which they are to be proved, such statement to be divided into paragraphs numbered consecutively, each containing as nearly as may be a separate allegation. If any such pleading does not fully disclose the ground of claim or defense, the judicial authority may order a fuller and more particular statement; and, if in the opinion of the judicial authority the pleadings do not sufficiently define the issues in dispute, it may direct the parties to prepare other issues, and such issues shall, if the parties differ, be settled by the judicial authority.''\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. General Statutes § 52-473 (b) provides: ''No temporary injunction may be granted without notice to the adverse party unless it clearly appears from the specific facts shown by affidavit or by verified complaint that irreparable loss or damage will result to the plaintiff before the matter can be heard on notice. It shall be sufficient, on such application for a temporary injunction, to present to the court or judge the original complaint containing the demand for an injunction, duly verified, without further complaint, application or motion in writing.''\u003c/span\u003e\n\n",
    "body_length": 150528,
    "citedas": [
      "259 Conn. 131",
      "788 A.2d 1158"
    ],
    "attorneys": "Steven R. Smart, with whom was Dominick M. Uva, for the appellant(plaintiff).Robert D. Snook, assistant attorney general, with whom, on the brief, wasRichard Blumenthal, attorney general, for the appellees (named defendant etal.).Karen K. Clark, with whom was Gordon R. Paterson, for the appellee(defendant First Stamford Corporation).Karyl Lee Hall filed a brief for the Connecticut Fund for the Environmentas amicus curiae.",
    "category": [
      "242",
      "243"
    ],
    "judges": "Sullivan, C. J., and Borden, Norcott, Palmer, Vertefeuille, Zarella andRonan, Js. *fn1",
    "citation_count": 39
  }
}
