{
  "id": "UrhmTmYBTlTomsSBVao_",
  "document": {
    "title": "State v. Novembrino",
    "full_title": "STATE OF NEW JERSEY v. OTTAVIO NOVEMBRINO",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1987-01-07T00:00:00.000Z",
    "docket": "No. A-76",
    "body": "Since 1961, when the United States Supreme Court decided Mapp v. Ohio, 367 U.S. 643, 81 S. Ct. 1684, 6 L. Ed. 2d 1081, New Jersey and her sister states have been compelled by the federal constitution to exclude from the State's case-in-chief evidence obtained in violation of the fourth amendment. The so-called \"exclusionary rule\" has been applied in federal criminal cases since 1914 when the rule was first adopted to protect the rights secured by the fourth amendment.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Weeks v. United States, 232 U.S. 383, 34 S. Ct. 341, 58 L. Ed. 652. Justice Day, writing for a unanimous Court, observed that without an exclusionary rule \"the 4th Amendment * * * is of no value, and * * * might as well be stricken from the Constitution.\" Id. at 393, 34 S. Ct. at 344, 58 L. Ed. at 656.\n\nFor the first time since the Weeks decision, the Court in 1984 modified the exclusionary rule's application to the government's case-in-chief. In United States v. Leon, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677, the Court held that evidence seized pursuant to a warrant issued without probable cause need not be excluded if the police officer who executed the warrant, judged by the objective standard of a reasonably well-trained police officer, relied in good faith on the defective warrant in gathering the evidence. In this case, we are asked by the Attorney General and the Hudson County Prosecutor to decide if article I, paragraph 7 of the New Jersey Constitution, which\n\nincorporates almost verbatim the protection against unreasonable searches and seizures set forth in the fourth amendment, will tolerate a modification of the exclusionary rule that recognizes the good-faith exception established by the United States Supreme Court in Leon.\n\nWe approach the issue posed here mindful of the controversy that has engulfed the exclusionary rule since its inception.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e As Justice Blackmun acknowledged in United States v. Janis, 428 U.S. 433, 446, 96 S. Ct. 3021, 3028, 49 L. Ed. 2d 1046, 1056 (1976), \"The debate within the Court on the exclusionary rule has always been a warm one.\"\n\nCharacteristic of the sharp criticism the exclusionary rule has provoked are the observations of Chief Justice Burger, dissenting in Bivens v. Six Unknown Named Agents of Fed. Bureau of Narcotics, 403 U.S. 388, 419-20, 91 S. Ct. 1999, 2016-17, 29 L. Ed. 2d 619, 640 (1971):\n\nI submit that society has at least as much right to expect rationally graded responses from judges in place of the universal \"capital punishment\" we inflict on all evidence when police error is shown in its acquisition. Yet for over 55 years, and with increasing scope and intensity * * * our legal system has treated vastly dissimilar cases as if they were the same. Our adherence to the exclusionary rule, our resistance to change, and our refusal even to acknowledge the need for effective enforcement mechanisms bring to mind Holmes' well-known statement:\n\n\"It is revolting to have no better reason for a rule of law than that so it was laid down in the time of Henry IV. It is still more revolting if the grounds upon which it was laid down have vanished long since, and the rule simply persists from blind imitation of the past.\" Holmes, The Path of the Law, 10 Harv L Rev 457, 469 (1897).\n\nIn characterizing the suppression doctrine as an anomalous and ineffective mechanism with which to regulate law enforcement, I intend no reflection on the motivation of those members of this Court who hoped it would be a means of enforcing the Fourth Amendment. Judges cannot be faulted for being offended by arrests, searches, and seizures that violate the Bill of Rights or statutes intended to regulate public officials. But we can and should be faulted for clinging to an unworkable and irrational concept of law.\n\nIn sharp contrast is the perception of the exclusionary rule articulated by Justice Clark in Mapp v. Ohio, supra:\n\nThere are those who say, as did Justice (then Judge) Cardozo, that under our constitutional exclusionary doctrine \"[t]he criminal is to go free because the constable has blundered.\" People v. Defore, 242 NY [13], at 21, 150 NE [585], at 587 [1926]. In some cases this will undoubtedly be the result. But, as was said in Elkins, \"there is another consideration -- the imperative of judicial integrity.\" [ Elkins v. U.S. ] 364 U.S. [206], at 222 [80 S. Ct. 1437, at 1447, 4 L. Ed. 2d 1669 (1960)]. The criminal goes free, if he must, but it is the law that sets him free. Nothing can destroy a government more quickly than its failure to observe its own laws, or worse, its disregard of the charter of its own existence. As Mr. Justice Brandeis, dissenting, said in Olmstead v United States, 277 U.S. 438, 485, 72 L. Ed. 944, 959, 48 SCt 564, 66 ALR 376 (1928): \"Our Government is the potent, the omnipresent teacher. For good or for ill, it teaches the whole people by its example. . . . If the Government becomes a lawbreaker, it breeds contempt for law; it invites every man to become a law unto himself; it invites anarchy.\"\n\nThe ignoble shortcut to conviction left open to the State tends to destroy the entire system of constitutional restraints on which the liberties of the people rest. Having once recognized that the right to privacy embodied in the Fourth Amendment is enforceable against the States, and that the right to be secure against rude invasions of privacy by state officers is, therefore, constitutional in origin, we can no longer permit that right to remain an empty promise. Because it is enforceable in the same manner and to like effect as other basic rights secured by the Due Process Clause, we can no longer permit it to be revocable at the whim of any police officer who, in the name of law enforcement itself, chooses to suspend its enjoyment. Our decision, founded on reason and truth, gives to the individual no more than that which the Constitution guarantees him, to the police officer no less than that to which honest law enforcement is entitled, and, to the courts, that judicial integrity so necessary in the true administration of justice. [367 U.S. at 659-60, 81 S. Ct. at 1963-64, 6 L. Ed. 2d at 1092-93 (footnote omitted).]\n\nThe question before us requires an appreciation of the conflicting views of the purpose and effectiveness of the exclusionary rule and the necessity and wisdom of the \"good-faith\" exception recognized by the Court in Leon. Moreover, we address this issue in the context of a federalist system in which \"enforcement of criminal laws in federal and state courts, sometimes involving identical episodes, encourages application of uniform rules governing search and seizure,\" State v. Hunt, 91 N.J. 338, 345 (1982), yet mindful that because a state\n\nconstitution may afford enhanced protection for individual liberties, we \"should not uncritically adopt federal constitutional interpretations for the New Jersey Constitution merely for the sake of consistency,\" id. at 355 (Pashman, J., concurring).\n\nI\n\nDefendant, Ottavio Novembrino, was indicted for possession of controlled dangerous substances contrary to N.J.S.A. 24:21-20(a)(1), (4), and possession of controlled dangerous substances with intent to distribute in violation of N.J.S.A. 24:21-19(a)(1). A motion to suppress evidence was filed pursuant to Rule 3:5-7.\n\nThe suppression hearing resulted in sharply conflicting accounts of the circumstances surrounding defendant's arrest and the subsequent search of his service station. According to Detective Higgins, whose affidavit led to the issuance of the disputed search warrant, defendant was stopped by two officers from the Bayonne Police Department at about 6:15 p.m. on June 2, 1983. The stop occurred shortly after Novembrino closed his service station and was proceeding home by automobile. One officer conducted a pat-down search, while the other officer conducted a limited inspection of the interior of defendant's automobile. Defendant agreed to go with the officers to police headquarters. He drove to the station in his own car, accompanied by one of the officers. Detective Higgins testified that Novembrino was not placed under arrest and was free to leave, although neither officer advised him of his right to do so.\n\nAfter being advised of his Miranda rights, Novembrino refused to consent to a search of his station. At about 6:30 p.m., Detective Higgins left a message requesting that the Bayonne municipal court judge telephone him. He then began to type an affidavit in support of a search warrant. Detective Higgins conceded that this was the first such affidavit he had ever prepared and estimated that its preparation took approximately ten or fifteen minutes. When the municipal court judge\n\ntelephoned, Detective Higgins arranged to meet him at a shopping center. They met at approximately 6:50 p.m. The judge reviewed the affidavit and signed the warrant. Detective Higgins spoke with Detective Kelly by radio, and proceeded to the gas station where he met defendant and Detective Kelly. After Novembrino was shown the warrant, he unlocked the door to the service station and pointed out the location of the contraband.\n\nNovembrino's testimony was substantially different. He stated that the officers pulled him over at approximately 6:45 p.m. Immediately, one officer searched him while the other searched his car. He was then taken to police headquarters where he was strip-searched. Detectives Kelly and Higgins then drove him back to his gas station. Novembrino testified that Higgins never left police headquarters and therefore could not have met a municipal court judge before returning to the service station. According to Novembrino, Officer Kelly took defendant's key and unlocked the door. The officers searched the station and discovered the contraband. Defendant testified that although he asked the police if they had a warrant, he was not shown a search warrant until approximately eleven o'clock that night.\n\nAt the suppression hearing, defendant argued that the affidavit did not establish probable cause and that the warrant was issued after the evidence had been seized. The trial court initially declined to consider whether the warrant was issued before or after the search, but suppressed the evidence on the ground that the affidavit submitted in support of the warrant failed to establish probable cause. On appeal, the Appellate Division remanded the matter for a hearing to determine when the warrant was issued. After hearing testimony, the trial court determined that the officers had obtained the search warrant prior to the search of the service station. The Appellate Division affirmed that finding on the basis that it was supported by sufficient credible evidence.\n\nIn the Appellate Division, the State argued that the Higgins affidavit was sufficient to establish probable cause. The critical portion of the affidavit alleged:\n\nI received information from an informant who has proven reliable in several investigations (with the information he supplied), that 'Otto' above description, is engaged in the illegal sales of cocaine and marijuana. My informant stated that Otto usually keeps the drugs in his gas station at above location. He (informant) also stated that he witnessed 'Otto' dealing drugs from his gas station. I, along with Det. Ralph Scianni, conducted a surveillance of subject and his station on Thurs., 6/2/83, between the hours of 3:00 PM and 7:00 PM, and observed Otto meeting with several persons, after leaving his station and making what we believed to be drug transactions. During the surveillance, we observed one person making a transaction with Otto and checked on his vehicle and called the narcotics squad to inquire on his relationship with drugs. They told us that said person has been arrested for cocaine and other violations and they felt that Otto and the other person are involved in drug activity. From the information received from our informant and from our observations, we do feel that a search of Otto's gas station should be conducted for illegal contraband. We checked on ownership of the station and it belongs to Otto who we have presently in headquarters on this investigation. Otto was advised of his rights and refused a search of his station but appeared to be very nervous.\n\nThe Appellate Division concluded that the affidavit failed to establish probable cause:\n\nThe affidavit here involved simply revealed that a police informant concluded for unknown reasons that defendant was a drug dealer, that a person previously arrested for possession of cocaine was seen at defendant's gas station engaged in some unspecified activities which caused a detective, whose education, training and experiences are unknown, to conclude that criminal activities in the form of violations of Title 24 were taking place at the gas station. The totality of the circumstances spelled out in the affidavit failed to contain a single objective fact tending to engender a \"well grounded suspicion\" that a crime was being committed. * * * We conclude, therefore, that probable cause was not established. [ State v. Novembrino, 200 N.J. Super. 229, 236 (1985) (citation omitted).]\n\nThe State also argued that if probable cause was not established, the evidence should nevertheless be admissible on the basis of the good-faith exception recognized by the United States Supreme Court in Leon. The Appellate Division acknowledged that if Leon were followed in New Jersey, it would apply retroactively and thereby determine the admissibility of the evidence obtained at defendant's station. A majority of the Appellate Division was also satisfied that Detective Higgins\n\nhad objectively and reasonably relied upon the warrant, which had been issued by a detached and neutral judge. Accordingly, the Appellate Division majority found that the record adequately raised the issue whether the good-faith exception should be applied under our State Constitution.\n\nA majority of the Appellate Division panel determined that New Jersey should not recognize the good-faith exception because it would undermine the constitutional requirement of probable cause. 200 N.J. Super. at 244. In a concurring opinion, Judge Simpson agreed that probable cause had not been established. Id. at 245. However, he concluded that the applicability of the Leon doctrine was inappropriately considered by the majority, since no record had been made by the trial court as to whether the officer had relied in good faith on the search warrant. Id. at 245-46. We granted the State's motion for leave to appeal, 101 N.J. 305 (1985).\n\nII\n\nThe first issue we confront concerns the sufficiency of the affidavit that prompted the issuance of the warrant. The standard by which we measure the affidavit is probable cause, the standard imposed by both the fourth amendment and article I, paragraph 7 of the New Jersey Constitution. Unlike the exclusionary rule, derided by critics as judge-made and not mandated by the constitution,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e probable cause is the constitutionally-imposed standard for determining whether a search and seizure is lawful.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Accordingly, it occupies a position of indisputable\n\nsignificance in search and seizure law. As the Supreme Court noted in Henry v. United States:\n\nThe requirement of probable cause has roots that are deep in our history. The general warrant, in which the name of the person to be arrested was left blank, and the writs of assistance, against which James Otis inveighed, both perpetuated the oppressive practice of allowing the police to arrest and search on suspicion. Police control took the place of judicial control, since no showing of \"probable cause\" before a magistrate was required. The Virginia Declaration of Rights, adopted June 12, 1776, rebelled against that practice.\n\nThat philosophy later was reflected in the Fourth Amendment. And as the early American decisions both before and immediately after its adoption show, common rumor or report, suspicion, or even \"strong reason to suspect\" was not adequate to support a warrant for arrest. And that principle has survived to this day.\n\nEvidence required to establish guilt is not necessary. On the other hand, good faith on the part of the arresting officers is not enough. Probable cause exists if the facts and circumstances known to the officer warrant a prudent man in believing that the offense has been committed. It is important, we think, that this requirement be strictly enforced, for the standard set by the Constitution protects both the officer and the citizen. [361 U.S. 98, 100-02, 80 S. Ct. 168, 170-71, 4 L. Ed. 2d 134, 137-38 (1959) (footnotes omitted, citations omitted).]\n\nAny nonconsensual search of a person or his property is a significant invasion of fundamental privacy rights. Nevertheless, enforcement of the criminal laws requires that the police employ searches to obtain proof of crime. The probable-cause requirement is the constitutionally-prescribed standard for distinguishing unreasonable searches from those that can be tolerated in a free society:\n\nThese long-prevailing standards seek to safeguard citizens from rash and unreasonable interferences with privacy and from unfounded charges of crime. They also seek to give fair leeway for enforcing the law in the community's\n\nprotection. Because many situations which confront officers in the course of executing their duties are more or less ambiguous, room must be allowed for some mistakes on their part. But the mistakes must be those of reasonable men, acting on facts leading sensibly to their conclusions of probability. The rule of probable cause is a practical, nontechnical conception affording the best compromise that has been found for accommodating these often opposing interests. Requiring more would unduly hamper law enforcement. To allow less would be to leave law-abiding citizens at the mercy of the officers' whim or caprice. [ Brinegar v. United States, 338 U.S. 160, 176, 69 S. Ct. 1302, 1311, 93 L. Ed. 1879, 1890-91 (1949).]\n\nThis Court has steadfastly recognized the historical significance of probable cause as the indispensable criterion for determining the validity of a search. In State v. Macri, 39 N.J. 250 (1963), Justice Jacobs unequivocally confirmed our insistence that warrants issued without probable cause would not be tolerated in New Jersey:\n\nThe requirement for [a] search warrant is not a mere formality but is a great constitutional principle embraced by free men and expressed in substantially identical language in both our federal and state constitutions. It has its roots deep in English and colonial history. The highly abusive infringements of freedom and privacy which were the incidents of general warrants and writs of assistance allowing arrests and searches on suspicion alone were only too well-known to the American settlers. They wisely insisted on the inclusion, in the Bill of Rights, of the provision in the Fourth Amendment that the right of the people to be secure against unreasonable searches and seizures shall not be violated and that \"no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" * * *\n\nThe [Fourth] Amendment sets a firm standard with respect to the essentials of a search warrant. Under its terms the search warrant is not to issue except upon probable cause, supported by oath or affirmation. The crucial determination is to be made not by the police officer but by a neutral issuing judge. Before the judge is in a position to make his determination for issuance, he must properly be made aware of the underlying facts or circumstances which would warrant a prudent man in believing that the law was being violated.\n\nOur recent Rules Governing Search Warrants * * * expressly recognize, as they must, the constitutional need for a verified showing of probable cause before the issuing magistrate; and they implicitly acknowledge the basic requirement, which the federal cases have repeatedly asserted, that the showing be not merely of belief or suspicion, but of underlying facts or circumstances which would warrant a prudent man in believing that the law was being violated. Even if we are at liberty to do so, we have no inclination whatever to\n\nrestrict or undermine the great force or uniform applicability of that safeguarding requirement. [ Id. at 255-57, 260-61 (citation omitted).]\n\nBefore we examine the sufficiency of the affidavit relied on by the judge in this case, we shall review both the federal and state case law in order to determine the standard to be used in evaluating whether probable cause was established by Detective Higgins' affidavit.\n\nA. Probable Cause -- Federal Case Law\n\nThe evolution of federal case law applying the probable-cause standard to specific search warrants has not been distinguished by clarity and consistency. See Amsterdam, \"Perspectives on the Fourth Amendment,\" 35 Minn.L.Rev. 349, 349 (1974).\n\nIn one of its most recent and significant probable-cause decisions, the Supreme Court observed that\n\nperhaps the central teaching of our decisions bearing on the probable-cause standard is that it is a \"practical, nontechnical conception.\" \"In dealing with probable cause, . . . as the very name implies, we deal with probabilities. These are not technical; they are the factual and practical considerations of everyday life on which reasonable and prudent men, not legal technicians, act.\" [ Illinois v. Gates, 462 U.S. 213, 231, 103 S. Ct. 2317, 2328, 76 L. Ed. 2d 527, 544 (1983) (quoting Brinegar v. United States, 338 U.S. 160, 175-76, 69 S. Ct. 1302, 1310-11, 93 L. Ed. 1879 (1949)).]\n\nThe Court's characterization of probable cause as a practical, nontechnical concept has been frequently repeated, even in cases in which the Court was sharply divided as to whether probable cause had been established. See, e.g., Massachusetts v. Upton, 466 U.S. 727, 730-33, 104 S. Ct. 2085, 2087-88, 80 L. Ed. 2d 721, 726-27 (1984); United States v. Harris, 403 U.S. 573, 577, 91 S. Ct. 2075, 2079, 29 L. Ed. 2d 723, 730 (1971); Spinelli v. United States, 393 U.S. 410, 419, 89 S. Ct. 584, 590-91, 21 L. Ed. 2d 637, 645 (1969); United States v. Ventresca, 380 U.S. 102, 108, 85 S. Ct. 741, 745-46, 13 L. Ed. 2d 684, 689 (1965); Draper v. United States, 358 U.S. 307, 313, 79 S. Ct. 329, 333, 3 L. Ed. 2d 327, 332 (1959). Justice Potter Stewart attempted to explain why the judiciary's application of the probable cause standard -- practical and nontechnical though it\n\nmay be -- has generated such markedly divergent views as to its mandate:\n\nThe fourth amendment is no \"technicality.\" The occupation of a judge requires application of its sweeping language to cases presenting the infinite variety of factual situations that arise in real life. The art of being a judge, if there is such an art, is in announcing clear rules in the context of these infinitely varied cases, rules that can be understood and observed by conscientious government officials. If the outcome of fourth amendment cases has come to be regarded as turning on \"technicalities,\" it is in part because of the inevitable human shortcomings of judges faced with the task of articulating fourth amendment principles applicable in a broad range of situations while doing justice in a particular case. Most judges do their best, but that is not always good enough. [\"The Road to Mapp v. Ohio and Beyond: The Origins, Development and Future of the Exclusionary Rule in Search-and-Seizure Cases,\" 83 Colum.L.Rev. 1365, 1393 (1983).]\n\nApart from the central theme that probable cause is a nontechnical concept, the Supreme Court's probable-cause decisions have generated few sustaining principles. One such principle is that probable cause is not established by a conclusory affidavit that does not provide a magistrate with sufficient facts to make an independent determination as to whether the warrant should issue. The leading case for this proposition is Nathanson v. United States, 290 U.S. 41, 54 S. Ct. 11, 78 L. Ed. 159 (1933). There, the challenged warrant recited that a federal officer\n\nhas stated under his oath that he has cause to suspect and does believe that certain merchandise, to wit: Certain liquors of foreign origin a more particular description of which cannot be given, upon which the duties have not been paid, or which has otherwise been brought into the United States contrary to law, and that said merchandise is now deposited and contained within the premises of J.J. Nathanson said premises being described as a 2 story frame dwelling located at 117 No. Bartram Ave. [ Id. at 44, 54 S. Ct. at 12, 78 L. Ed. at 160.]\n\nThe Court held that the warrant had been issued without probable cause, observing that\n\nnothing * * * indicates that a warrant to search a private dwelling may rest upon mere affirmance of suspicion or belief without disclosure of supporting facts or circumstances. [ Id. at 47, 54 S. Ct. at 13, 78 L. Ed. at 161.]\n\nNathanson has consistently been followed by the Court, whether the conclusory allegations are asserted by the officer or by an informant whose observations are incorporated in the\n\nofficer's affidavit. See Whiteley v. Warden of Wyoming State Penitentiary, 401 U.S. 560, 564, 91 S. Ct. 1031, 1034-35, 28 L. Ed. 2d 306, 311 (1971); Spinelli v. United States, supra, 393 U.S. 410, 89 S. Ct. 584, 21 L. Ed. 2d 637; United States v. Ventresca, supra, 380 U.S. 102, 85 S. Ct. 741, 13 L. Ed. 2d 684; Beck v. Ohio, 379 U.S. 89, 85 S. Ct. 223, 13 L. Ed. 2d 142 (1964); Aguilar v. Texas, 378 U.S. 108, 84 S. Ct. 1509, 12 L. Ed. 2d 723 (1964); Rugendorf v. United States, 376 U.S. 528, 84 S. Ct. 825, 11 L. Ed. 2d 887 (1964); Jones v. United States, 362 U.S. 257, 80 S. Ct. 725, 4 L. Ed. 2d 697 (1960), overruled on other grounds, United States v. Salvucci, 448 U.S. 83, 100 S. Ct. 2547, 65 L. Ed. 2d 619 (1980); Giordenello v. United States, 357 U.S. 480, 78 S. Ct. 1245, 2 L. Ed. 2d 1503 (1958).\n\nThe Court's insistence that an officer's affidavit allege specific facts and not conclusions is based on the principle that\n\nthe inferences from the facts which lead to the complaint \"[must] be drawn by a neutral and detached magistrate instead of being judged by the officer engaged in the often competitive enterprise of ferreting out crime.\" The purpose of the complaint, then, is to enable the appropriate magistrate, here a Commissioner, to determine whether the \"probable cause\" required to support a warrant exists. The Commissioner must judge for himself the persuasiveness of the facts relied on by a complaining officer to show probable cause. He should not accept without question the complainant's mere conclusion that the person whose arrest is sought has committed a crime. [ Giordenello v. United States, supra, 357 U.S. at 486, 78 S. Ct. at 1250, 2 L. Ed. 2d at 1509 (quoting Johnson v. United States, 333 U.S. 10, 14, 68 S. Ct. 367, 369, 92 L. Ed. 436, 440 (1948)).]\n\nAnother entrenched principle is that not only may a magistrate consider hearsay in determining probable cause, but hearsay alone can provide a sufficient basis for the warrant. Although the Court had impliedly accepted hearsay as a basis for probable cause in prior cases, see Draper v. United States, supra, 358 U.S. 307, 79 S. Ct. 329, 3 L. Ed. 2d 327 and Brinegar v. United States, supra, 338 U.S. 160, 69 S. Ct. 1302, 93 L. Ed. 1879, it expressly held in Jones v. United States, supra, 362 U.S. 257, 80 S. Ct. 725, 4 L. Ed. 2d 697, that an officer's affidavit could rely on information provided by an informant:\n\nThe question here is whether an affidavit which sets out personal observations relating to the existence of cause to search is to be deemed insufficient by\n\nvirtue of the fact that it sets out not the affiant's observations but those of another. An affidavit is not to be deemed insufficient on that score, so long as a substantial basis for crediting the hearsay is presented. [ Id. at 269, 80 S. Ct. at 735, 4 L. Ed. at 707.]\n\nIn Jones the Court did not attempt to set standards for determining what constitutes \"a substantial basis for crediting the hearsay.\" That task was undertaken by the Court in Aguilar v. Texas, supra, 378 U.S. 108, 84 S. Ct. 1509, 12 L. Ed. 2d 723, and in Spinelli v. United States, supra, 393 U.S. 410, 89 S. Ct. 584, 21 L. Ed. 2d 637. These two decisions, superseded in 1983 by Illinois v. Gates, supra, 462 U.S. 213, 103 S. Ct. 2317, 76 L. Ed. 2d 527, have for the past two decades been at the center of the debate concerning the sufficiency of an informant's observations in establishing probable cause.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn Aguilar, a warrant to search for narcotics in the defendant's home was issued on the basis of an affidavit that alleged:\n\nAffiants have received reliable information from a credible person and do believe that heroin, marijuana, barbiturates and other narcotics and narcotic paraphernalia are being kept at the above described premises for the purpose of sale and use contrary to the provisions of the law. [378 U.S. at 109, 84 S. Ct. at 1511, 12 L. Ed. 2d at 725.]\n\nIn sustaining the challenge to the admissibility of the evidence seized by the execution of the warrant, the Court established a \"two-pronged test\" to determine the sufficiency of an informant's tip. First, the tip must include information that apprises the magistrate of the basis for the informant's allegations (the \"basis-of-knowledge\" prong); and, second, the affiant must\n\ninform the magistrate of the basis for his reliance on the informant's credibility (the \"veracity\" prong). See Illinois v. Gates, supra, 462 U.S. at 267, 103 S. Ct. at 2347-48, 76 L. Ed. 2d at 567 (White, J., concurring). Concluding that the affidavit did not meet these conditions, the Court determined that the warrant should not have issued:\n\nAlthough an affidavit may be based on hearsay information and need not reflect the direct personal observations of the affiant, the magistrate must be informed of some of the underlying circumstances from which the informant concluded that the narcotics were where he claimed they were, and some of the underlying circumstances from which the officer concluded that the informant, whose identity need not be disclosed, was \"credible\" or his information \"reliable.\" Otherwise, \"the inferences from the facts which lead to the complaint\" will be drawn not \"by a neutral and detached magistrate,\" as the Constitution requires, but instead, by a police officer \"engaged in the often competitive enterprise of ferreting out crime,\" or, as in this case, by an unidentified informant. [ Aguilar v. Texas, supra, 378 U.S. at 114-15, 84 S. Ct. at 1514, 12 L. Ed. 2d at 729 (quoting Giordenello v. United States, 357 U.S. at 486, 78 S. Ct. at 1250, 2 L. Ed. 2d at 1509; Johnson v. United States, 333 U.S. at 14, 68 S. Ct. at 369, 92 L. Ed. at 440) (footnote omitted, citations omitted).]\n\nFive years later, in Spinelli v. United States, supra, 393 U.S. 410, 89 S. Ct. 584, 21 L. Ed. 2d 637, the Court sought to clarify Aguilar by delineating the manner in which the \"two-pronged test\" should be applied when the informant's allegations, although inadequate standing alone, are partially verified by police investigation. The affidavit in Spinelli stated that a reliable informant had advised the FBI that \"Spinelli is operating a handbook and accepting wagers and disseminating wagering information by means of the telephones which have been assigned the numbers WYdown 4-0029 and WYdown 4-0136.\" Id. at 414, 89 S. Ct. at 588, 21 L. Ed. 2d at 642. To corroborate the informant's tip, the affidavit recited that Spinelli was observed for a period of five days, during four of which he traveled from Illinois to Missouri, parking in a lot adjacent to an apartment house and entering an apartment whose occupant possessed telephones assigned the same phone numbers as those provided by the informant. Although concluding that the FBI affidavit was insufficient to establish probable cause, the\n\nCourt suggested that deficiencies in a search warrant affidavit incorporating information from an informant could be remedied both with respect to \"basis-of-knowledge\" and \"veracity\":\n\nIf the tip is found inadequate under Aguilar, the other allegations which corroborate the information contained in the hearsay report should then be considered. At this stage as well, however, the standards enunciated in Aguilar must inform the magistrate's decision. He must ask: Can it fairly be said that the tip, even when certain parts of it have been corroborated by independent sources, is as trustworthy as a tip which would pass Aguilar's tests without independent corroboration? [ Id. at 415, 89 S. Ct. at 588, 21 L. Ed. 2d at 643.]\n\nThe majority in Spinelli observed that if an affidavit is deficient in its recitation as to the basis of the informant's knowledge, the self-verifying details of the informant's tip can overcome this deficiency:\n\nIn the absence of a statement detailing the manner in which the information was gathered, it is especially important that the tip describe the accused's criminal activity in sufficient detail that the magistrate may know that he is relying on something more substantial than a casual rumor circulating in the underworld or an accusation based merely on an individual's general reputation. [ Id. at 416, 89 S. Ct. at 589, 21 L. Ed. 2d at 644.]\n\nThe Court also acknowledged that the informant's veracity, if inadequately documented in the officer's affidavit, could be bolstered by a corroborative investigation, but concluded that the veracity of the Spinelli informant had not sufficiently been established:\n\nNor do we believe that the patent doubts Aguilar raises as to the report's reliability are adequately resolved by a consideration of the allegations detailing the FBI's independent investigative efforts. At most, these allegations indicated that Spinelli could have used the telephones specified by the informant for some purpose. This cannot by itself be said to support both the inference that the informer was generally trustworthy and that he had made his charge against Spinelli on the basis of information obtained in a reliable way. Once again, Draper provides a relevant comparison. Independent police work in that case corroborated much more than one small detail that had been provided by the informant. There, the police, upon meeting the inbound Denver train on the second morning specified by informer Hereford, saw a man whose dress corresponded precisely to Hereford's detailed description. It was then apparent that the informant had not been fabricating his report out of whole cloth; since\n\nthe report was of the sort which in common experience may be recognized as having been obtained in a reliable way, it was perfectly clear that probable cause had been established. [ Id. at 418, 89 S. Ct. at 590, 21 L. Ed. 2d at 644.]\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn Illinois v. Gates, supra, the Court abandoned its exclusive reliance on the Aguilar-Spinelli two-pronged test for evaluating information provided by an informant, adopting in its place \"the totality-of-the-circumstances analysis that traditionally has informed probable cause determinations.\" 462 U.S. at 238, 103 S. Ct. at 2332, 76 L. Ed. 2d at 548. However, the Court took pains to point out that\n\nan informant's \"veracity,\" \"reliability,\" and \"basis of knowledge\" are all highly relevant in determining the value of his report. We do not agree, however, that these elements should be understood as entirely separate and independent requirements to be rigidly exacted in every case * * *. Rather, * * * they should be understood simply as closely intertwined issues that may usefully illuminate the commonsense, practical question whether there is \"probable cause\" to believe that contraband or evidence is located in a particular place. [ Id. at 230, 103 S. Ct. at 2328, 76 L. Ed. 2d at 543.]\n\nGates involved the sufficiency of an affidavit offered in support of a search warrant authorizing the search of the defendants' car and house. The application for the warrant was triggered by an anonymous, handwritten letter sent to the Bloomingdale, Illinois Police Department that alleged:\n\n\"This letter is to inform you that you have a couple in your town who strictly make their living on selling drugs. They are Sue and Lance Gates, they live on Greenway, off Bloomingdale Rd. in the condominiums. Most of their buys are done in Florida. Sue his wife drives their car to Florida, where she leaves it to be loaded up with drugs, then Lance flys down and drives it back. Sue flys back after she drops the car off in Florida. May 3 she is driving down there again and Lance will be flying down in a few days to drive it back. At the time Lance drives the car back he has the trunk loaded with over $100,000.00 in drugs. Presently they have over $100,000.00 worth of drugs in their basement.\n\n\"They brag about the fact they never have to work, and make their entire living on pushers.\n\n\"I guarantee if you watch them carefully you will make a big catch. They are friends with some big drug dealers, who visit their house often.\n\n\"Lance \u0026 Susan Gates\n\n\"Greenway\n\n\"in Condominiums\" [ Id. at 225, 103 S. Ct. at 2325, 76 L. Ed. 2d at 540.]\n\nDetective Mader of the Bloomingdale Police Department investigated the anonymous tip and learned that an Illinois driver's license had been issued to Lance Gates of Bloomingdale. He also learned that an individual named \"L. Gates\" had a reservation on a flight to West Palm Beach, Florida, departing from Chicago on May 5th. At Mader's request, an agent of the Drug Enforcement Administration conducted a surveillance and observed Gates board a flight destined for West Palm Beach. He also reported that federal agents in Florida had observed Gates' arrival in West Palm Beach and confirmed that he had traveled from the airport by taxi to a nearby motel. The agents reported that Gates had entered a room in the motel\n\nregistered to Susan Gates. The next morning Gates and an unidentified woman left the motel in a Mercury automobile with Illinois license plates. They drove northbound on an interstate highway generally used by travelers bound for Chicago. The license plate number on the Mercury was identified by the federal agents as one registered to a station wagon owned by Gates.\n\nDetective Mader prepared an affidavit that incorporated the details learned during the investigation. He submitted the affidavit, along with a copy of the anonymous letter, to a county court judge. The judge issued a search warrant that authorized the searches of the Gates' residence and automobile. On May 7, when Lance Gates and his wife returned to their home in Bloomingdale, the Bloomingdale police searched the trunk of the Mercury and discovered approximately 350 pounds of marijuana. During a search of the Gates' home the officers found marijuana, weapons, and other contraband.\n\nThe Illinois Circuit Court suppressed the evidence on the ground that the affidavit submitted in support of the search warrant did not establish probable cause. That decision was affirmed by the Illinois Appellate Court, 82 Ill.App. 3d 749, 38 Ill.Dec. 62, 403 N.E. 2d 77 (1980), and by the Supreme Court of Illinois, 85 Ill. 2d 376, 53 Ill.Dec. 218, 423 N.E. 2d 887 (1981).\n\nRelying on the two-pronged analysis derived from Aguilar and Spinelli, the Illinois Supreme Court concluded that the anonymous letter, supplemented by Detective Mader's affidavit, did not satisfy either the \"veracity\" or the \"basis-of-knowledge\" prong established by Aguilar. The court concluded that there was no basis for determining that the anonymous letter writer was credible, and that the corroboration by police of innocent details contained in the letter could not satisfy the \"veracity\" requirement. Id. at 384-90, 53 Ill.Dec. at 222-24, 423 N.E. 2d at 891-93. In addition, the court observed that the anonymous letter did not reveal the source of its author's knowledge and concluded that the detail set forth in the letter\n\nwas not sufficient to justify an inference that the contents of the letter had been obtained from a reliable source. Id.\n\nJustice Rehnquist, writing for the Gates majority, agreed with the Illinois Supreme Court that the anonymous letter, standing alone\n\nprovides virtually nothing from which one might conclude that its author is either honest or his information reliable; likewise, the letter gives absolutely no indication of the basis for the writer's predictions regarding the Gateses' criminal activities. Something more was required, then, before a magistrate could conclude that there was probable cause to believe that contraband would be found in the Gateses' home and car. [462 U.S. at 227, 103 S. Ct. at 2326, 76 L. Ed. 2d at 541.]\n\nRejecting the Illinois Supreme Court's reliance on Aguilar and Spinelli, the Court determined that the independent investigation by the federal agents and the Bloomingdale police adequately verified the reliability of the informant's tip. The Court observed that the Aguilar-Spinelli two-pronged analysis was overly technical and ill-suited to guide determinations of probable cause:\n\n[T]he \"two-pronged test\" directs analysis into two largely independent channels -- the informant's \"veracity\" or \"reliability\" and his \"basis of knowledge.\" There are persuasive arguments against according these two elements such independent status.\n\nThe rigorous inquiry into the Spinelli prongs and the complex superstructure of evidentiary and analytical rules that some have seen implicit in our Spinelli decision, cannot be reconciled with the fact that many warrants are -- quite properly -- issued on the basis of nontechnical, common-sense judgments of laymen applying a standard less demanding than those used in more formal legal proceedings. Likewise, given the informal, often hurried context in which it must be applied, the \"built-in subtleties,\" of the \"two-pronged test\" are particularly unlikely to assist magistrates in determining probable cause. [ Id. at 233, 235-36, 103 S. Ct. at 2329, 2331, 76 L. Ed. 2d at 546 (citations omitted).]\n\nNevertheless, in formulating the elements of the totality-of-the-circumstances analysis, the Court recognized the continued relevance of an informant's veracity and basis of knowledge:\n\nThe task of the issuing magistrate is simply to make a practical, common-sense decision whether, given all the circumstances set forth in the affidavit before him, including the \"veracity\" and \"basis of knowledge\" of persons supplying hearsay information, there is a fair probability that contraband or evidence of\n\na crime will be found in a particular place. * * * We are convinced that this flexible, easily applied standard will better achieve the accommodation of public and private interests that the Fourth Amendment requires than does the approach that has developed from Aguilar and Spinelli. [ Id. at 233, 238-39, 103 S. Ct. at 2329, 2332, 76 L. Ed. 2d at 545, 548 (emphasis added, citations omitted).]\n\nThe Gates majority also observed that the totality-of-the-circumstances test provided magistrates with wider discretion to grant or refuse warrants than had been permitted under the Aguilar-Spinelli rules:\n\nNothing in our opinion in any way lessens the authority of the magistrate to draw such reasonable inferences as he will from the material supplied to him by applicants for a warrant; indeed, he is freer than under the regime of Aguilar and Spinelli to draw such inferences, or to refuse to draw them if he is so minded. [Id. at 240, 103 S. Ct. at 2333, 76 L. Ed. 2d at 549 (emphasis added).]\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFinally, the Court explicitly limited the permissible scope of appellate review of the probable cause determination made by the warrant-issuing judge, holding that the fourth amendment did not require de novo review as to the validity of the warrant:\n\n[W]e have repeatedly said that after-the-fact scrutiny by courts of the sufficiency of an affidavit should not take the form of de novo review. A magistrate's \"determination of probable cause should be paid great deference by reviewing courts.\" \"A grudging or negative attitude by reviewing courts towards warrants,\" is inconsistent with the Fourth Amendment's strong preference for searches conducted pursuant to a warrant; \"courts should not invalidate warrant[s] by interpreting affidavit[s] in a hypertechnical, rather than a commonsense, manner.\"\n\nReflecting this preference for the warrant process, the traditional standard for review of an issuing magistrate's probable-cause determination has been that so long as the magistrate had a \"substantial basis for . . . conclud[ing]\" that a search would uncover evidence of wrongdoing, the Fourth Amendment requires no more. [ Id. at 236, 103 S. Ct. at 2331, 76 L. Ed. 2d at 546-47 (quoting Spinelli\n\nv. United States, 393 U.S. 410, 419, 89 S. Ct. 584, 590-91, 21 L. Ed. 2d 637; United States v. Ventresca, 380 U.S. 102, 108-09, 85 S. Ct. 741, 745-46, 13 L. Ed. 2d 684; Jones v. United States, 362 U.S. 257, 271, 80 S. Ct. 725, 736, 4 L. Ed. 2d 697).]\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nTo sum up, the impact of Gates on fourth amendment probable-cause determinations is two-fold. First, by adopting the totality-of-the-circumstances analysis, it signals a reemphasis of the \"practical, nontechnical conception\" of probable cause endorsed in Brinegar v. United States, supra, 338 U.S. 160, 69 S. Ct. 1302, 93 L. Ed. 1879, but does so without repudiating the relevance of \"veracity\" and \"basis-of-knowledge\" inquiries with respect to allegations by informants. Second, it limits the scope of federal appellate review mandated by the fourth amendment as to probable-cause determinations by the warrant-issuing magistrate.\n\nB. Probable Cause -- New Jersey Case Law\n\nThis Court's decisions in cases concerning probable cause have been relatively uncontroversial. As would be expected,\n\nmany of our opinions emphasize the same principles that have been recognized by decisions in the federal courts. We have consistently characterized probable cause as a common-sense, practical standard for determining the validity of a search warrant. In State v. Kasabucki, 52 N.J. 110, 116 (1968), we said:\n\nProbable cause is a flexible, nontechnical concept. It includes a conscious balancing of the governmental need for enforcement of the criminal law against the citizens' constitutionally protected right of privacy. It must be regarded as representing an effort to accommodate those often competing interests so as to serve them both in a practical fashion without unduly hampering the one or unreasonably impairing the significant content of the other.\n\nSee State v. Davis, 50 N.J. 16, 24 (1967), cert. denied, 389 U.S. 1054, 88 S. Ct. 805, 19 L. Ed. 2d 852 (1968); State v. Laws, 50 N.J. 159, 173 (1967), cert. denied, 393 U.S. 971, 89 S. Ct. 408, 21 L. Ed. 2d 384 (1968); State v. Mark, 46 N.J. 262, 271 (1966); State v. Contursi, 44 N.J. 422, 428-29 (1965); State v. Boyd, 44 N.J. 390, 393 (1965).\n\nThis Court has also been unwavering in its insistence that affidavits submitted in support of a warrant application allege specific facts so that the issuing judge can determine independently whether or not probable cause has been established:\n\nThe crucial determination is to be made not by the police officer but by a neutral issuing judge. Before the judge is in a position to make his determination for issuance, he must properly be made aware of the underlying facts or circumstances which would warrant a prudent man in believing that the law was being violated. Legal proof sufficient to establish guilt is, of course, not required; but suspicion and good faith on the officer's part, without more, will not suffice. As the Supreme Court succinctly put it in Nathanson v. United States, a search warrant may not issue unless the issuing magistrate can find probable cause from the facts or circumstances presented to him under oath or affirmation -- \"Mere affirmance of belief or suspicion is not enough.\" [ State v. Macri, supra, 39 N.J. at 257 (quoting Nathanson v. United States, 290 U.S. 41, 47, 54 S. Ct. 11, 13, 78 L. Ed. 159 (1933)).]\n\nSee State v. Fariello, 71 N.J. 552, 564-65 (1976); State v. Ebron, 61 N.J. 207, 212 (1972); State v. Mark, supra, 46 N.J. at 273; State v. Moriarty, 39 N.J. 502, 503 (1963); State v. Burrachio, 39 N.J. 272, 275-76 (1963).\n\nLike the federal courts, we have permitted reliance on hearsay for the purpose of establishing probable cause, but have\n\ninsisted that the officer's affidavit provide the warrant-issuing judge with a substantial basis for crediting the hearsay. State v. Ebron, supra, 61 N.J. at 212; State v. Perry, 59 N.J. 383, 394 (1971); State v. Burrachio, supra, 39 N.J. at 275; State v. Macri, supra, 39 N.J. at 262; State v. Southard, 144 N.J. Super. 501, 504 (App.Div.1976).\n\nWe have infrequently been required to consider the validity of warrants based on hearsay in the context of the Aguilar-Spinelli two-pronged test. In State v. Perry, supra, 59 N.J. 383, the affidavit was based on information \"from a reliable informant, who ha[d] in the past given reliable information leading to arrests,\" that stolen property consisting of \"monies, jewelry, doctor's bag, narcotics barbitubates [sic], and narcotics paraphernalia\" could be found in the defendant's apartment. Id. at 387. We held that the informant's veracity was adequately established by the officer's reference to his past reliability. As to the \"basis-of-knowledge\" prong, we noted that\n\nthe information contained in the informant's tip is of such a detailed nature that it could reasonably lead a magistrate to infer that the informant had probably observed the items himself which he knew to be stolen, or had gained his information in a reliable way. * * * We think the detailed description in this case * * * is of the type which the Spinelli Court regarded as sufficient to establish that the information was obtained in a reliable way. [ Id. at 392.]\n\nIn State v. Ebron, supra, 61 N.J. 207, the officer's allegation that defendant was selling narcotics from his mother's home was based in part on information from an \"informant who ha[d] prove[n] reliable in the past\"\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and in part on a surveillance of the residence by police over a three-day period. We concluded that the officer's assertions as to the informant's past reliability satisfied the veracity prong of Aguilar-Spinelli, but that the \"basis-of-knowledge\" prong had not been satisfied. Id. at 212. Nevertheless, the warrant was sustained on the ground that although the informant's tip did not satisfy the \"basis-of-knowledge\" prong, it could be supplemented by the \"totality of the\n\nproofs submitted to the issuing magistrate,\" id., including the facts established by the officers during their surveillance of defendant's residence.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We held that \"[w]hen the informant's statement fails to meet this 'two-pronged test,' the affidavit may nevertheless be sufficient if elsewhere in the application there is enough to 'permit the suspicions engendered by the informant's report to ripen into a judgment that a crime was probably being committed.' We think the affidavit before us meets this test.\" 61 N.J. at 212 (quoting Spinelli v. United States, 393 U.S. 410, 418, 89 S. Ct. 584, 590, 21 L. Ed. 2d 637).\n\nC. Validity of the Warrant\n\nAs a preliminary matter, and for guidance to trial and appellate courts and law enforcement officials, we acknowledge our intention to apply a totality-of-the-circumstances test analogous to that set forth in Illinois v. Gates, supra, 462 U.S. at 238, 103 S. Ct. at 2332, 76 L. Ed. 2d at 548, to test the validity of search warrants under the probable-cause standard set forth in article I, paragraph 7 of the New Jersey Constitution.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e We note that those commentators who have focused on the decision differ in their assessment of its significance. Compare Kamisar,\n\n\"Gates, 'Probable Cause,' 'Good Faith,' and Beyond,\" 69 Iowa L.Rev. 551, 578 (1984) (interpreting Gates as dismantling the two-pronged test), with LaFave, \"Fourth Amendment Vagaries of Improbable Cause, Imperceptible Plain View, Notorious Privacy, and Balancing Askew),\" 74 Crim.L. \u0026 Criminology 1171, 1195 (1983), and Moylan, \"Illinois v. Gates: What It Did and What It Did Not Do,\" 20 Crim.L.Bull. 93, 115 (1984) (both interpreting Gates as consistent with continued application of the Aguilar-Spinelli factors in evaluating informants' tips). In our view, the Gates totality-of-the-circumstances analysis is consistent with the approach this Court has traditionally employed in resolving probable-cause issues. See State v. Ebron, supra, 61 N.J. 207; State v. Kasabucki, supra, 52 N.J. 110; State v. Laws, supra, 50 N.J. at 173. As the majority in Gates conceded, search-warrant applications that rely in part on an informant's tip will continue to require thorough scrutiny of the informant's veracity and basis of knowledge in the context of the totality of the facts contained in the officer's showing of probable cause. Illinois v. Gates, supra, 462 U.S. at 238-39, 103 S. Ct. at 2332, 76 L. Ed. 2d at 548. We would also note, as illustrated by the affidavit in this case, that the Aguilar-Spinelli analysis -- useful though it may be in assessing the weight to be accorded to an informant's tip -- does not necessarily end the inquiry as to an affidavit's sufficiency in establishing probable cause.\n\nIn this case Detective Higgins' affidavit relies in part on information obtained from an unidentified informant. The affidavit's reference to the informant appears to comply with both prongs of the Aguilar-Spinelli test. The informant's veracity is supported by Detective Higgins' unvarnished statement that he \"has proven reliable in several investigations (with the information he supplied).\" We have in the past accepted a similarly undetailed endorsement of an informant as satisfying the veracity requirement. State v. Perry, supra, 59 N.J. at 390; compare Stanley v. State, 19 Md.App. 507, 512-13, 313 A.2d 847, 851 (1974) (where informant satisfied Aguilar 's veracity\n\nprong with \"flying colors.\"). Similarly, the informant's \"basis of knowledge\" is clearly established by the assertion that \"he witnessed 'Otto' dealing drugs from his gas station.\"\n\nAlthough the affidavit's reference to the informant satisfies the Aguilar-Spinelli test, the substantive information obtained from the informant is meager indeed. One critical deficiency is that the affidavit furnishes no information whatsoever as to when the informant allegedly \"witnessed\" the drug sales. Consequently, the informant's allegations, standing alone, were inadequate to provide a neutral judicial officer with a reasonable basis for suspicion that a present search of Novembrino's premises would yield evidence of criminal activity. In Rosencranz v. United States, 356 F.2d 310 (1st Cir.1966), the court rejected a similar affidavit, which contained no time reference other than the fact that the affidavit was phrased in the present tense. In holding the warrant invalid, the court cautioned:\n\nThe present tense is suspended in the air; it has no point of reference. It speaks, after all, of the time when an anonymous informant conveyed information to the officer, which could have been a day, a week, or months before the date of the affidavit. To make a double inference, that the undated information speaks as of a date close to that of the affidavit and that therefore the undated observation made on the strength of such information must speak as of an even more recent date would be to open the door to the unsupervised issuance of search warrants on the basis of aging information. Officers with information of questionable recency could escape embarrassment by simply omitting averments as to time, so long as they reported that whatever information they received was stated to be current at that time. Magistrates would have less opportunity to perform their \"neutral and detached\" function. Indeed, if the affidavit in this case be adjudged valid, it is difficult to see how any function but that of a rubber stamp remains for them. [ Id. at 316-17.]\n\nAccord United States v. Boyd, 422 F.2d 791 (6th Cir.1970); United States v. Elliott, 576 F. Supp. 1579 (S.D.Ohio 1984); State in Interest of R.B.C., 183 N.J. Super. 121 (J.D.R.C.1981); see 1 W. LaFave, Search and Seizure: A Treatise on the Fourth Amendment,  3.7(b) at 693 (1978) (hereinafter LaFave, Search and Seizure).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIn addition, the unidentified informant's conclusory allegations that \"Otto usually keeps the drugs in the gas station\" and that he \"witnessed Otto dealing drugs\" are unsupported by any specific facts from which a neutral judge could independently derive a reasonable suspicion that a search would yield evidence of criminal activity. The fact that a police officer may be willing to believe the tip of an informant -- particularly one who has been helpful on prior occasions -- does not lessen the judge's duty to scrutinize the substance of the tip in order to weigh its sufficiency against the practical standard of probable cause. As Justice Jacobs observed in State v. Macri, supra, \"Before the judge is in a position to make his determination for issuance, he must properly be made aware of the underlying facts or circumstances which would warrant a prudent man in believing that the law was being violated.\" 39 N.J. at 257. Here, the informant's tip is a bald conclusion, allegedly based on personal observation, but unsupported by any reference to dates, events, or circumstances.\n\nBecause the informant's allegations, standing alone, are insufficient to establish probable cause, we focus on the independent observations made by Detectives Higgins and Scianni to determine if they adequately supplement the informant's\n\nallegations.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e We first observe that the affidavit is silent with regard to the officers' experience in investigating and apprehending drug dealers. Although we acknowledge that a police officer's experience with specific forms of criminal activity is entitled to consideration in assessing whether probable cause has been established, see Texas v. Brown, 460 U.S. 730, 742-43, 103 S. Ct. 1535, 1543-44, 75 L. Ed. 2d 502, 514 (1983); United States v. Cortez, 449 U.S. 411, 421-22, 101 S. Ct. 690, 697, 66 L. Ed. 2d 621, 631 (1981); State v. Kasabucki, supra, 52 N.J. at 117; State v. Sainz, 210 N.J. Super. 17, 22 (App.Div.), certif. granted, 104 N.J. 453 (1986), nothing in this affidavit suggests that any of the investigating officers had a particular familiarity with drug transactions.\n\nThe crux of the officers' direct observations is summarized by one sentence in the affidavit:\n\nI, along with Det. Ralph Scianni, conducted a surveillance of subject and his station on Thurs., 6/2/83, between the hours of 3:00 PM and 7:00 PM, and observed Otto meeting with several persons, after leaving his station and making what we believed to be drug transactions.\n\nThe critical phrase is that the officers observed Otto \"making what we believed to be drug transactions.\" If the officers had a reasonable suspicion that they were in fact witnessing drug transactions, they would have been authorized to arrest defendant on the spot. Adams v. Williams, 407 U.S. 143, 148-49, 92 S. Ct. 1921, 1924-25, 32 L. Ed. 2d 612, 618 (1972); Beck v. Ohio, 379 U.S. 89, 91,\n\n85 S. Ct. 223, 225, 13 L. Ed. 2d 142, 145 (1964); State v. Macuk, 57 N.J. 1, 8 (1970); State v. Doyle, 42 N.J. 334, 349 (1964). The officers in this case requested defendant to accompany them to police headquarters but, pointedly, did not place him under arrest.\n\nAdditionally, the affidavit is utterly devoid of specific facts witnessed by the officers from which the judge could have independently concluded that their suspicions were reasonable. The affidavit does not state with particularity what the officers observed or why the officers believed that drugs were being sold. It does not inform the judge in what respect the transactions observed by the officers differed from routine service station transactions. The only specific allegation offered is that an identification check was made with respect to one vehicle that entered the service station that day -- after its occupant completed \"a transaction\" with defendant -- and the check revealed that the vehicle's owner had been arrested on charges related to drugs. That factual insertion is insufficient to overcome the deficiencies in detail and substance to which we have averted.\n\nIn his concurrence in Spinelli v. United States, supra, 393 U.S. 410, 89 S. Ct. 584, 21 L. Ed. 2d 637, Justice White emphasized that an affidavit must include specific facts to support a police officer's suspicions:\n\nIf an officer swears that there is gambling equipment at a certain address, the possibilities are (1) that he has seen the equipment; (2) that he has observed or perceived facts from which the presence of the equipment may reasonably be inferred; and (3) that he has obtained the information from someone else. If (1) is true, the affidavit is good. But in (2), the affidavit is insufficient unless the perceived facts are given, for it is the magistrate, not the officer, who is to judge the existence of probable cause. With respect to (3), where the officer's information is hearsay, no warrant should issue absent good cause for crediting that hearsay. [393 U.S. at 423-24, 89 S. Ct. at 592-93, 21 L. Ed. 2d at 648 (citations omitted).]\n\nWe are in complete agreement with the trial court and the Appellate Division that this affidavit, read tolerantly and nontechnically, simply does not pass constitutional muster. Our dissenting colleague, Justice Garibaldi, agrees that the affidavit\n\ndoes not establish probable cause. The conclusory allegations of the officers are even less certain and less persuasive than the conclusory and vague allegations of the informant. Our common-sense review of these circumstances leads to the conclusion that the officers, after an abbreviated investigation, were uncertain whether they had seen drug sales and their informant was vague about what he had seen and silent as to when he had seen it. Read together, the allegations of the informant and of the officers did not provide the issuing judge with sufficient facts on which to base an independent determination as to the existence of probable cause.\n\nWe emphasize that our conclusion as to the inadequacy of the affidavit, notwithstanding its literal compliance with both prongs of Aguilar-Spinelli, is thoroughly consistent with our application, as a matter of state-constitutional law, of a totality-of-the-circumstances test. As Justice Rehnquist observed in Gates, under that standard the issuing judge \"is freer than under the regime of Aguilar and Spinelli to draw such inferences, or to refuse to draw them if he is so minded.\" 462 U.S. at 240, 103 S. Ct. at 2333, 76 L. Ed. 2d at 549. In our view, the judge in this case was not presented with facts sufficient to permit the inference of the existence of probable cause and, therefore, the warrant was improperly issued.\n\nOne might assume from the sparseness of the allegations submitted to the judge that these officers may have observed additional facts that simply were omitted from the body of the affidavit. It is not sufficient that police officers are aware of facts adequate to support a warrant if they fail to communicate these facts to the issuing judge. Any such facts, if offered as testimony to the judge and recorded contemporaneously, could be considered by the judge as supplementing the contents of the affidavit. State v. Fariello, supra, 71 N.J. at 558-63. Nothing in the record before us suggests that Detective Higgins supplemented his affidavit with testimony when he appeared before the judge to obtain the warrant.\n\nIndependent of our conclusion as to the affidavit's insufficiency to establish probable cause, we note that the affidavit was prepared hastily -- the time for its preparation was estimated to be ten or fifteen minutes -- and that it was the officer's first experience in preparing an affidavit in support of a search warrant. Although the affidavit antedates the Attorney General's 1985 Policy Statement,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e which requires the review of search warrant affidavits by either the Attorney General's or the county prosecutor's staff, the record in this case reflects that the affidavit was not reviewed by any of the officer's superiors in the Bayonne Police Department. Our observations as to the officer's experience, the time spent in preparing the affidavit, and the absence of any review reflect our conviction that an affidavit in support of a search warrant must be carefully prepared and reviewed to assure that it faithfully reflects the results of the police investigation and provides a judge with sufficient detail to enable him to perform his constitutionally-mandated review. As we have stated, the standards for preparation of an adequate affidavit are more practical than technical, and the necessary skills can readily be acquired by a well-trained police officer. We perceive no incompatibility between the skills and objectives of law-enforcement officials and the constitutional requirement that warrants issue only upon probable cause.\n\nIII\n\nIn view of our conclusion that the search warrant was issued without probable cause, we now consider the State's contention that we hold the evidence to be admissible by construing article I, paragraph 7 of the New Jersey Constitution to permit recognition of the \"good-faith\" modification of the exclusionary rule\n\nset forth in United States v. Leon, supra, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nPreliminarily, we note that the concurring opinion in the Appellate Division cautions that review of the good-faith exception in this case may be inappropriate. 200 N.J. Super. at 245. That opinion observed that retroactive application of Leon is \"doubtful\" and that, unlike Leon, the trial court in this case made no finding that the officer reasonably relied in good faith on the warrant in searching defendant's service station. Id. at 246. Although both the search and the hearing on the suppression motion in this case antedate Leon, we assume without deciding the question that the decision in Leon was intended to apply retroactively. As the Eighth Circuit noted in United States v. Sager, 743 F.2d 1261, 1264-65 (1984), cert. denied, 469 U.S. 1217, 105 S. Ct. 1196, 84 L. Ed. 2d 341 (1985), on the day Leon was decided the Supreme Court granted certiorari and vacated the judgments in several fourth-amendment cases, remanding them for further consideration in light of Leon.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nMoreover, those federal circuit courts that have addressed the issue have uniformly concluded that Leon has retroactive application. See United States v. Merchant, 760 F.2d 963, 968-69 (9th Cir.1985), cert. granted, U.S. , 106 S. Ct. 3293, 92 L. Ed. 2d 708 (1986); United States v. Sager, supra, 743 F.2d at 1264-65; United States v. Hendricks, 743 F.2d 653, 656 (9th Cir.1984), cert. denied, 470 U.S. 1006, 105 S. Ct. 1362, 84 L. Ed. 2d 382 (1985).\n\nAs to the issue of the officers' objective good-faith reliance on the warrant, the Court's opinion in Leon would apply the good-faith exception whenever \"an officer acting with objective good faith has obtained a search warrant from a judge or magistrate and acted within its scope.\" 468 U.S. at 920, 104 S. Ct. at 3420, 82 L. Ed. 2d at 697.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Accordingly, assuming that the magistrate did not abandon his detached and neutral role, Leon would permit suppression \"only if the officers were dishonest or reckless in preparing their affidavit or could not have harbored an objectively reasonable belief in the existence of probable cause.\" Id. at 926, 104 S. Ct. at 3423, 82 L. Ed. 2d at 701. No testimony at the suppression hearing in this case suggested that the affidavit was false. Despite our conclusions as to its insufficiency, its defects are not so blatant as to preclude an objectively reasonable reliance on the validity of the warrant.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe Appellate Division majority was satisfied from its examination of the record that Detective Higgins' reliance on the warrant was objectively reasonable. 200 N.J. Super. at 237. Our dissenting colleague, however, cautions that without further police investigation and competent review of the warrant application, she would not in future cases consider police reliance on a warrant issued under these circumstances to be objectively reasonable. Post at 186-88. For the purpose of our discussion of the good-faith exception to the exclusionary rule, and in view of our disposition of the issue, we adopt, without conceding its correctness, the conclusion of the Appellate Division majority on the issue of the officer's objectively reasonable reliance on the warrant.\n\nA. The Exclusionary Rule: Development and Modifications Prior to United States v. Leon\n\nOur consideration of the \"good-faith\" modification recognized in Leon can be undertaken only in the context of the history and application of the exclusionary rule prior to the Leon decision.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Although the origin of the exclusionary rule can be traced to Boyd v. United States, 116 U.S. 616, 6 S. Ct. 524, 29 L. Ed. 746 (1886),\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e the first criminal case in which the rule was applied was Weeks v. United States, supra, 232 U.S. 383, 34\n\nS. Ct. 341, 58 L. Ed. 652. The defendant in Weeks was tried for and convicted of illegal gambling. Before trial he had moved for the return of incriminating records and letters that had been seized by government officials during a warrantless search of his home. The Court reversed the conviction, holding that the fourth amendment barred the use of the illegally-seized evidence:\n\nIf letters and private documents can thus be seized and held and used in evidence against a citizen accused of an offense, the protection of the 4th Amendment, declaring his right to be secure against such searches and seizures, is of no value, and so far as those thus placed are concerned, might as well be stricken from the Constitution. * * * To sanction such proceedings would be to affirm by judicial decision a manifest neglect, if not an open defiance, of the prohibitions of the Constitution, intended for the protection of the people against such unauthorized action. [ Id. at 393-94, 34 S. Ct. at 344-45, 58 L. Ed. at 656.]\n\nThe scope of the exclusionary rule was expanded in the early 1920's when the Court decided Silverthorne Lumber v. United States, 251 U.S. 385, 40 S. Ct. 182, 64 L. Ed. 319 (1920), and Gouled v. United States, 255 U.S. 298, 41 S. Ct. 261, 65 L. Ed. 647 (1921). In Silverthorne, federal officers illegally raided the office of a lumber company. After copying the books and papers seized, the agents returned them to the company. A subpoena then issued to compel the production of the documents. The company refused to comply with the subpoena and was found guilty of contempt. The Court reversed the conviction, rejecting the government's contention that the Weeks decision compelled only the return of the illegally-seized evidence, but did not preclude the government from using information obtained in the course of the search:\n\nThe proposition could not be presented more nakedly. It is that although of course its seizure was an outrage which the government now regrets, it may study the papers before it returns them, copy them, and then may use the knowledge that it has gained to call upon the owners in a more regular form to produce them; that the protection of the Constitution covers the physical possession, but not any advantages that the government can gain over the object of its\n\npursuit by doing the forbidden act. * * * In our opinion such is not the law. It reduces the 4th Amendment to a form of words. The essence of a provision forbidding the acquisition of evidence in a certain way is that not merely evidence so acquired shall not be used before the court, but that it shall not be used at all. [251 U.S. at 391-92, 40 S. Ct. at 182-83, 64 L. Ed. at 321 (citations omitted).]\n\nIn Gouled, supra, 255 U.S. 298, 41 S. Ct. 261, 65 L. Ed. 647, the Court held that the exclusionary rule would be applied even though the defendant did not seek the return of the seized evidence before trial, effectively overruling the Court's earlier decision in Adams v. New York, 192 U.S. 585, 24 S. Ct. 372, 48 L. Ed. 575 (1904).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIt was not until 1949, in Wolf v. Colorado, 338 U.S. 25, 69 S. Ct. 1359, 93 L. Ed. 1782, that the Court was called upon to decide whether the due-process clause of the fourteenth amendment required state courts to apply and enforce the exclusionary rule. Although concluding that the critical interest protected by the fourth amendment -- \"the security of one's privacy against arbitrary intrusion by the police,\" id. at 27, 69 S. Ct. at 1361, 93 L. Ed. at 1785 -- was enforceable against the states through the due process clause, the Court refused to impose the exclusionary rule on the states, observing that the states were free to rely on other methods that \"would be equally effective,\" id. at 31, 69 S. Ct. at 1363, 93 L. Ed. at 1787.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The opinion in Wolf noted that courts in seventeen states had determined to follow the holding in Weeks and courts in thirty states had declined to follow it.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e In dissent, Justice Murphy rejected the\n\nmajority's suggestion that remedies other than exclusion could be equally effective:\n\nImagination and zeal may invent a dozen methods to give content to the commands of the Fourth Amendment. But this Court is limited to the remedies currently available. It cannot legislate the ideal system. If we would attempt the enforcement of the search and seizure clause in the ordinary case today, we are limited to three devices: judicial exclusion of the illegally obtained evidence; criminal prosecution of violators; and civil action against violators in the action of trespass.\n\nAlternatives are deceptive. Their very statement conveys the impression that one possibility is as effective as the next. In this case their statement is blinding. For there is but one alternative to the rule of exclusion. That is no sanction at all. [ Id. at 41, 69 S. Ct. at 1369, 93 L. Ed. at 1793.]\n\nThe impact of Wolf was to be relatively short-lived. In Rochin v. California, 342 U.S. 165, 72 S. Ct. 205, 96 L. Ed. 183 (1952), the Court applied the exclusionary rule to a state criminal prosecution to exclude evidence obtained by police misconduct \"so brutal and so offensive to human dignity\" that it \"shocks the conscience.\"\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Id. at 174, 172, 72 S. Ct. at 210, 209, 96 L. Ed. at 191, 190. Then, in Irvine v. California, 347 U.S. 128, 74 S. Ct. 381, 98 L. Ed. 561 (1954), the Court, in a 5-4 decision, upheld a bookmaking conviction based in part on testimony reciting the defendant's incriminating statements that were overheard by means of a microphone that had been illegally planted by police in a closet in defendant's residence. Justice Frankfurter, the author of Wolf, dissented, and Justice Clark, although disagreeing with the Wolf decision, concurred in the judgment on the basis of Wolf, which he followed with \"great reluctance.\" Id. at 139, 74 S. Ct. at 387, 98 L. Ed. at 572.\n\nA further erosion of Wolf occurred in Elkins v. United States, 364 U.S. 206, 80 S. Ct. 1437, 4 L. Ed. 2d 1669 (1960), when the Court rejected the so-called \"silver platter\" doctrine, thereby precluding evidence unlawfully seized by state police from being used in federal prosecutions. Id. at 208, 80 S. Ct. at 1439, 4 L. Ed. 2d at 1672. Ultimately, in Mapp v. Ohio, supra, 367 U.S. 643,\n\n81 S. Ct. 1684, 6 L. Ed. 2d 1081, the Court overruled Wolf. Recognizing \"[t]he obvious futility of relegating the Fourth Amendment to the protection of other remedies,\" the Court held that the exclusionary rule, as \"an essential part of both the Fourth and Fourteenth Amendments,\" was enforceable against the states through the due process clause. Id. at 655-57, 81 S. Ct. at 1691-93, 6 L. Ed. 2d at 1090-91.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nSince Mapp, however, the scope of the exclusionary rule has been steadily eroded. In Alderman v. United States, 394 U.S. 165, 89 S. Ct. 961, 22 L. Ed. 2d 176 (1969), the Court held that defendants whose fourth-amendment rights had not been violated did not have standing to object to evidence obtained in violation of the rights of others. The Court for the first time advanced the view that application of the exclusionary rule should depend on a cost-benefit analysis: \"[W]e are not convinced that the additional benefits of extending the exclusionary rule to other defendants would justify further encroachment upon the public interest in prosecuting those accused of crime and having them acquitted or convicted on the basis of all the evidence which exposes the truth.\" Id. at 174-75, 89 S. Ct. at 967, 22 L. Ed. 2d at 187.\n\nAnother significant incursion occurred in United States v. Calandra, 414 U.S. 338, 94 S. Ct. 613, 38 L. Ed. 2d 561 (1974), where a divided Court held that a grand-jury witness could not invoke the rule to refuse to answer questions based on evidence seized pursuant to a defective search warrant. Holding that\n\nthe purpose of the rule \"is not to redress the injury to the privacy of the search victim [but rather] to deter future unlawful police conduct,\" id. at 347, 94 S. Ct. at 619, 38 L. Ed. 2d at 571, the Court declined to apply the rule in a context that \"would achieve a speculative and undoubtedly minimal advance in the deterrence of police misconduct at the expense of substantially impeding the role of the grand jury,\" id. at 351-52, 94 S. Ct. at 621, 38 L. Ed. 2d at 573.\n\nSubsequent to Calandra the Court has invoked the same balancing test to permit illegally-seized evidence to be used during cross-examination to impeach the defendant's testimony, United States v. Havens, 446 U.S. 620, 627-28, 100 S. Ct. 1912, 1916-17, 64 L. Ed. 2d 559, 566 (1980), and to admit into evidence in a federal civil tax proceeding wagering records that had been seized by state police pursuant to a defective search warrant, United States v. Janis, 428 U.S. 433, 454, 96 S. Ct. 3021, 3032, 49 L. Ed. 2d 1046, 1061 (1976). In United States v. Peltier, 422 U.S. 531, 95 S. Ct. 2313, 45 L. Ed. 2d 374 (1975), the Court found the exclusionary rule to be unavailable to the defendant in a narcotics prosecution by declining to give retroactive effect to an earlier decision holding warrantless automobile searches by the border patrol to be violative of the fourth amendment: \"If the purpose of the exclusionary rule is to deter unlawful police conduct, then evidence obtained from a search should be suppressed only if it can be said that the law enforcement officer had knowledge * * * that the search was unconstitutional under the Fourth Amendment.\" Id. at 542, 95 S. Ct. at 2320, 45 L. Ed. 2d at 384. Invoking the same cost-benefit analysis, the Court declined to afford federal habeas corpus relief to a state prisoner who had a \"full and fair opportunity\" to litigate his fourth-amendment claim in a state criminal proceeding. Stone v. Powell, 428 U.S. 465, 493-94, 96 S. Ct. 3037, 3051-52, 49 L. Ed. 2d 1067, 1087-88 (1976).\n\nDespite the Court's gradual compression of the scope of the exclusionary rule, no decision prior to United States v. Leon expressly contradicted the established principle that evidence\n\nillegally obtained was inadmissible in the government's case-in-chief in criminal prosecutions. In this respect, Leon constitutes the most significant limitation of the exclusionary rule since its genesis in Weeks.\n\nB. United States v. Leon\n\nAlthough the holding in Leon is described as the \"good faith exception\" to the exclusionary rule, that characterization substantially understates the breadth of the Court's decision. Two passages from Justice White's majority opinion are illustrative of its potential scope:\n\nWe * * * conclude that suppression of evidence obtained pursuant to a warrant should be ordered only on a case-by-case basis and only in those unusual cases in which exclusion will further the purposes of the exclusionary rule.\n\nWe have now re-examined the purposes of the exclusionary rule and the propriety of its application in cases where officers have relied on a subsequently invalidated search warrant. Our conclusion is that the rule's purposes will only rarely be served by applying it in such circumstances. [468 U.S. at 918, 926, 104 S. Ct. at 3419, 3423, 82 L. Ed. 2d at 695, 700 (emphasis added).]\n\nAccording to Justice White's formulation, in suppression cases involving warrants the application of the exclusionary rule will be the exception, and recognition of the good-faith \"exception\" will be the prevailing standard.\n\nIn Leon, searches were made of defendants' persons, residences, and automobiles by police officers who relied on a facially valid search warrant issued by a California superior court judge. Large quantities of drugs were discovered during the course of the searches. Defendants were indicted by a federal grand jury and were charged with conspiracy to possess and distribute cocaine as well as other substantive offenses. Motions to suppress the evidence seized pursuant to the warrant were filed. The government argued that the extensive search-warrant application, prepared by a police officer experienced in narcotics investigations and reviewed by several deputy district attorneys, adequately established probable cause. The application relied in part on a stale tip from an informant of unproven reliability, but was supplemented by the facts gleaned\n\nfrom substantial police surveillance of the premises to be searched. The federal district court concluded that the warrant had been issued without probable cause. The court acknowledged that the officer conducting the search had relied in good faith on the warrant but declined the government's suggestion that it recognize an exception to the exclusionary rule. Id. at 904, 104 S. Ct. at 3411, 82 L. Ed. 2d at 686.\n\nA divided panel of the Ninth Circuit affirmed, concluding that the informant's information was stale, that his reliability was unverified, and that the officer's independent investigation \"neither cured the staleness nor corroborated the details of the informant's declarations.\" Id. at 904, 104 S. Ct. at 3411, 82 L. Ed. 2d at 686. The Court of Appeals also declined to establish a good-faith exception to the exclusionary rule.\n\nThe Government's petition for certiorari did not seek review of the lower court's decision that probable cause for the warrant had not been established. The Supreme Court's grant of certiorari was limited to the issue advanced by the Government: \"'[w]hether the Fourth Amendment exclusionary rule should be modified so as not to bar the admission of evidence seized in reasonable, good faith reliance on a search warrant that is subsequently held to be defective.'\" Id. at 905, 104 S. Ct. at 3412, 82 L. Ed. 2d at 686-87.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe major premise of the Court's holding in Leon is that the exclusionary rule is not required by the fourth amendment but rather operates as \"'a judicially created remedy designed to safeguard Fourth Amendment rights generally through its deterrent effect, rather than a personal constitutional right of\n\nthe person aggrieved.'\" 468 U.S. at 906, 104 S. Ct. at 3412, 82 L. Ed. 2d at 687 (quoting United States v. Calandra, 414 U.S. 338, 348, 94 S. Ct. 613, 620, 38 L. Ed. 2d 561 (1974)). The opinion observes that in view of the rule's function as a deterrent of police misconduct, its application in particular cases \"must be resolved by weighing the costs and benefits of preventing the use in the prosecution's case-in-chief of inherently trustworthy tangible evidence obtained in reliance on a search warrant issued by a detached and neutral magistrate that ultimately is found to be defective.\" Id. at 906-07, 104 S. Ct. at 3412-13, 82 L. Ed. 2d at 688.\n\nThe majority, after citing examples of the Court's prior application of the cost-benefit analysis to the exclusionary rule, concluded that there is little likelihood that the exclusion of evidence obtained pursuant to a subsequently invalidated search warrant will have a deterrent effect on law-enforcement officers:\n\nOne could argue that applying the exclusionary rule in cases where the police failed to demonstrate probable cause in the warrant application deters future inadequate presentations or \"magistrate shopping\" and thus promotes the ends of the Fourth Amendment. Suppressing evidence obtained pursuant to a technically defective warrant supported by probable cause also might encourage officers to scrutinize more closely the form of the warrant and to point out suspected judicial errors. We find such arguments speculative.\n\nBut even assuming that the rule effectively deters some police misconduct and provides incentives for the law enforcement profession as a whole to conduct itself in accord with the Fourth Amendment, it cannot be expected, and should not be applied, to deter objectively reasonable law enforcement activity.\n\nThis is particularly true, we believe, when an officer acting with objective good faith has obtained a search warrant from a judge or magistrate and acted within its scope. In most such cases, there is no police illegality and thus nothing to deter. It is the magistrate's responsibility to determine whether the officer's allegations establish probable cause and, if so, to issue a warrant comporting in form with the requirements of the Fourth Amendment. In the ordinary case, an officer cannot be expected to question the magistrate's probable-cause determination or his judgment that the form of the warrant is technically sufficient. \"[O]nce the warrant issues, there is literally nothing more the policeman can do in seeking to comply with the law.\" Penalizing the\n\nofficer for the magistrate's error, rather than his own, cannot logically contribute to the deterrence of Fourth Amendment violations. [ Id. at 918-21, 104 S. Ct. at 3419-20, 82 L. Ed. 2d at 695-97 (quoting Stone v. Powell, 428 U.S. 465, 498, 96 S. Ct. 3037, 49 L. Ed. 2d 1067).]\n\nBecause the application of the rule is unlikely to deter police misconduct when an officer has relied in good faith on an invalid warrant, the Court concluded that there are no \"benefits\" to suppression that justify the substantial \"costs\" of excluding the evidence. Accordingly, the Court held that \"[i]n the absence of an allegation that the magistrate abandoned his detached and neutral role, suppression is appropriate only if the officers were dishonest or reckless in preparing their affidavit or could not have harbored an objectively reasonable belief in the existence of probable cause.\" Id. at 926, 104 S. Ct. at 3423, 82 L. Ed. 2d at 700-01.\n\nJustice Blackmun, emphasizing what he described as the \"unavoidably provisional nature of [the] decision[s],\" id. at 927, 104 S. Ct. at 3424, 82 L. Ed. 2d at 701, concurred with the majority but cautioned that experience with the good-faith exception might require the Court to reconsider its holding:\n\n[T]he assumptions on which we proceed today cannot be cast in stone. To the contrary, they now will be tested in the real world of state and federal law enforcement, and this Court will attend to the results. If it should emerge from experience that, contrary to our expectations, the good faith exception to the exclusionary rule results in a material change in police compliance with the Fourth Amendment, we shall have to reconsider what we have undertaken here. The logic of a decision that rests on untested predictions about police conduct demands no less. [ Id. at 928, 104 S. Ct. at 3424, 82 L. Ed. 2d at 702.]\n\nJustice Brennan, dissenting, sharply attacked the majority's view that the fourth amendment's mandate is limited to the prohibition of illegal searches and does not require that the courts exclude the evidence obtained. In his view, there exists an inextricable relationship between the admission of illegally obtained evidence and an unlawful search and therefore, \"by admitting unlawfully seized evidence, the judiciary becomes a part of what is in fact a single governmental action prohibited by the terms of the Amendment.\" Id. at 933, 104 S. Ct. at 3432,\n\n82 L. Ed. 2d at 705. Summarizing his basic disagreement with the majority he observed that\n\n[t]he Court evades this principle by drawing an artificial line between the constitutional rights and responsibilities that are engaged by actions of the police and those that are engaged when a defendant appears before the courts. According to the Court, the substantive protections of the Fourth Amendment are wholly exhausted at the moment when police unlawfully invade an individual's privacy and thus no substantive force remains to those protections at the time of trial when the government seeks to use evidence obtained by the police.\n\nI submit that such a crabbed reading of the Fourth Amendment casts aside the teaching of those Justices who first formulated the exclusionary rule, and rests ultimately on an impoverished understanding of judicial responsibility in our constitutional scheme. For my part, \"[t]he right of the people to be secure in their persons, houses, papers and effects, against unreasonable searches and seizures\" comprises a personal right to exclude all evidence secured by means of unreasonable searches and seizures. The right to be free from the initial invasion of privacy and the right of exclusion are coordinate components of the central embracing right to be free from unreasonable searches and seizures. [ Id. at 935, 104 S. Ct. at 3433, 82 L. Ed. 2d at 706.]\n\nBecause of this fundamental difference with the majority as to the scope of the fourth amendment, Justice Brennan rejected the concept that the exclusionary rule's sole purpose is \"deterrence\" and that its application in particular cases depends on an empirical analysis that attempts to compare the \"cost\" and \"benefits\" of excluding illegally-seized evidence:\n\nBy remaining within its redoubt of empiricism and by basing the rule solely on the deterrence rationale, the Court has robbed the rule of legitimacy. A doctrine that is explained as if it were an empirical proposition but for which there is only limited empirical support is both inherently unstable and an easy mark for critics. The extent of this Court's fidelity to Fourth Amendment requirements, however, should not turn on such statistical uncertainties. I share the view, expressed by Justice Stewart for the Court in Faretta v California, that \"[p]ersonal liberties are not based on the law of averages.\" Rather than seeking to give effect to the liberties secured by the Fourth Amendment through guesswork about deterrence, the Court should restore to its proper place the principle framed 70 years ago in Weeks that an individual whose privacy has been invaded in violation of the Fourth Amendment has a right grounded in that Amendment to prevent the government from subsequently making use of any evidence so obtained. [ Id. at 943, 104 S. Ct. at 3438, 82 L. Ed. 2d at 712 (citations omitted).]\n\nIn a separate dissent, Justice Stevens emphasized that the majority's \"good faith\" exception, in according a preferred status to evidence seized in reliance on an invalid warrant,\n\ndirectly contradicted the intentions of the framers of the fourth amendment.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e He characterized the adoption of the \"good faith\" exception as the product of \"constitutional amnesia.\" Id. at 972, 104 S. Ct. at 3453, 82 L. Ed. 2d at 731.\n\nThe precise problem that the Amendment was intended to address was the unreasonable issuance of warrants. As we have often observed, the Amendment was actually motivated by the practice of issuing general warrants -- warrants which did not satisfy the particularity and probable cause requirements. The resentments which led to the Amendment were directed at the issuance of warrants unjustified by particularized evidence of wrongdoing. Those who sought to amend the Constitution to include a Bill of Rights repeatedly voiced the view that the evil which had to be addressed was the issuance of warrants on insufficient evidence. As Professor Taylor has written:\n\n\"Our constitutional fathers were not concerned about warrantless searches, but about overreaching warrants. It is perhaps too much to say that they feared the warrant more than the search, but it is plain enough that the warrant was the prime object of their concern. Far from looking at the warrant as a protection against unreasonable searches, they saw it as an authority for unreasonable and oppressive searches. . . .\"\n\nIn short, the Framers of the Fourth Amendment were deeply suspicious of warrants; in their minds the paradigm of an abusive search was the execution of a warrant not based on probable cause. The fact that colonial officers had magisterial authorization for their conduct when they engaged in general searches surely did not make their conduct \"reasonable.\" The Court's view that it is consistent with our Constitution to adopt a rule that it is presumptively reasonable to rely on a defective warrant is the product of constitutional amnesia. [ Id. at 971-72, 104 S. Ct. at 3453, 82 L. Ed. 2d at 730-31 (quoting T. Taylor, Two Studies in Constitutional Interpretation 41 (1969)).]\n\nIV\n\nThe New Jersey Constitution of 1947, Article I, Paragraph 7\n\nIt is an established principle of our federalist system that state constitutions may be a source of \"individual liberties more expansive than those conferred by the Federal Constitution.\"\n\nPruneyard Shopping Center v. Robins, 447 U.S. 74, 81, 100 S. Ct. 2035, 2040, 64 L. Ed. 2d 741, 752 (1980); see Oregon v. Haas, 420 U.S. 714, 718, 95 S. Ct. 1215, 1218-19, 43 L. Ed. 2d 570, 575 (1975); State v. Gilmore, 103 N.J. 508, 522 (1986); \"Symposium: The Emergence of State Constitutional Law,\" 63 Tex.L.Rev. 959 (1985); Pollock, \"State Constitutions as Separate Sources of Fundamental Rights,\" 35 Rutgers L.Rev. 707 (1983); \"Developments in the Law -- The Interpretation of State Constitutional Rights,\" 95 Harv.L.Rev. 1324 (1982); Brennan, \"State Constitutions and the Protection of Individual Rights,\" 90 Harv.L.Rev. 489 (1977); Note, \"The New Jersey Supreme Court's Interpretation and Application of the State Constitution,\" 15 Rutgers L.J. 491 (1984).\n\nThis Court has frequently resorted to our own State Constitution in order to afford our citizens broader protection of certain personal rights than that afforded by analogous or identical provisions of the federal Constitution. State v. Williams, 93 N.J. 39 (1983); Right to Choose v. Byrne, 91 N.J. 287 (1982); State v. Hunt, supra, 91 N.J. 338; State v. Alston, 88 N.J. 211 (1981); State v. Schmid, 84 N.J. 535 (1980), appeal dismissed sub nom. Princeton Univ. v. Schmid, 455 U.S. 100, 102 S. Ct. 867, 70 L. Ed. 2d 855 (1982); State v. Johnson, 68 N.J. 349 (1975). Although the language of article I, paragraph 7 of the New Jersey Constitution is virtually identical with that of the fourth amendment, we have held in other contexts that it affords our citizens greater protection against unreasonable searches and seizures than does the fourth amendment. See State v. Hunt, supra, 91 N.J. 338 (individual has protectible interest in telephone toll billing records under article I, paragraph 7 of the New Jersey Constitution); State v. Alston, supra, 88 N.J. 211 (possessory interest in property sufficient to confer standing to challenge validity of automobile search); State v. Johnson, supra, 68 N.J. 349 (validity of consent to search depends on knowledge of the right to refuse consent).\n\nIn this case, defendant urges that we construe our state-constitutional protection against unreasonable searches and seizures to preclude recognition of the good-faith exception to the exclusionary rule established in Leon. The Attorney General and the Hudson County Prosecutor argue that we should follow the Supreme Court's modification of the exclusionary rule and construe article I, paragraph 7 of our Constitution in a manner consistent with the good-faith exception. Our conclusion as to which of these courses to follow is strongly influenced by what we perceive to be the likely impact of our decision on the privacy rights of our citizens and the enforcement of our criminal laws, matters of \"particular state interest\" that afford an appropriate basis for resolving this issue on independent state grounds. See State v. Hunt, supra, 91 N.J. at 366 (Handler, J., concurring) (\"A state constitution may also be employed to address matters of particular state interest.\")\n\nThe State interest in the resolution of the issue before us is clarified to some extent by a historical perspective. Although our Constitution of 1776 did not include provisions equivalent to the Bill of Rights,\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e this was remedied in our Constitution of 1844, which incorporated a protection against unreasonable searches and seizures virtually identical to the fourth amendment and to article I, paragraph 7 of the 1947 Constitution.\n\nN.J. Const. of 1844 art. VI, para. 6; State v. Macri, supra, 39 N.J. at 256; Eleuteri v. Richman, 26 N.J. 506, 511, cert. denied, 358 U.S. 843, 79 S. Ct. 52, 3 L. Ed. 2d 77 (1958).\n\nPrior to the Supreme Court's decision in Mapp v. Ohio, supra, 367 U.S. 643, 81 S. Ct. 1684, 6 L. Ed. 2d 1081, New Jersey did not apply the exclusionary rule, adhering instead to a policy decision that \"competent proof shall be available for the prosecution of the offense notwithstanding illegality in the seizure.\" Eleuteri v. Richman, supra, 26 N.J. at 509-10; see State v. Alexander, 7 N.J. 585, 594 (1951), cert. denied, 343 U.S. 908, 72 S. Ct. 638, 96 L. Ed. 1326 (1952); State v. Guida, 118 N.J.L. 289, 297 (Sup.Ct.1937), aff'd, 119 N.J.L. 464 (E. \u0026 A. 1938); State v. Merra, 103 N.J.L. 361 (E. \u0026 A. 1927); State v. Cortese, 104 N.J.L. 447 (E. \u0026 A. 1927), aff'g, 4 N.J. Misc. 683 (Sup.Ct.1926); State v. Lyons, 99 N.J.L. 301 (E. \u0026 A. 1923).\n\nIt is also noteworthy that during the Constitutional Convention of 1947 an amendment to article I, paragraph 7 was proposed that would have incorporated the exclusionary rule into the Constitution: \"Nothing obtained in violation thereof shall be received into evidence.\" Although the amendment was defeated, the debate included discussion of both the merits of the federal rule and the propriety of incorporating the rule into the constitutional guarantee. In his opinion in Eleuteri v. Richman, supra, Chief Justice Weintraub, an outspoken opponent of the exclusionary rule, accurately summarized the Convention proceedings:\n\nThe issue was debated, with specific reference to the merits of the federal rule. One delegate added that in any event he questioned the advisability of incorporating an answer either way in organic law. The amendment was defeated by a vote of 46 to 25. 1 Convention Proceedings Record, 598, 608. We do not infer that the delegates intended thereby to embed our case law, but it is equally clear that the rule of exclusion is not the unmistakable wake of the constitutional provision. [26 N.J. at 511.]\n\nThis Court first had occasion to apply the exclusionary rule in State v. Valentin, 36 N.J. 41 (1961). There, the defendant's motion to suppress evidence in a prosecution alleging that he possessed a shotgun without a permit had been denied without\n\nany offer of proof by the prosecutor as to the legality of the search and seizure.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e While the appeal was pending before us, the Supreme Court decided Mapp v. Ohio, supra, holding the exclusionary rule applicable to the states through the due process clause of the fourteenth amendment. Accordingly, we remanded the matter to the trial court to permit reconsideration of the suppression motion in the context of \"all relevant proof on the new issue generated by Mapp.\" 36 N.J. at 44.\n\nSince State v. Valentin, supra, the exclusionary rule has become imbedded in our jurisprudence. During the past twenty-five years it has consistently been applied to exclude from the State's case-in-chief evidence illegally obtained through warrantless searches or in reliance on defective warrants. E.g. State v. Valencia, 93 N.J. 126, 141 (1983) (evidence obtained as a result of telephone-authorized search would be suppressed where State failed to prove minimal procedural requirements to assure reliability); State v. Fariello, supra, 71 N.J. 552 (requiring suppression of evidence of narcotics possession where affidavit was insufficient to show probable cause and issuing judge made no transcription or summary of officer's testimony); State v. Macri, supra, 39 N.J. at 265-66 (mandating suppression of illegally seized evidence of bookmaking activities and rejecting State's argument in support of a good faith exception: \"The good faith of the officer would not be sufficient in a federal proceeding nor should it be viewed as sufficient here.\"); State v. Moriarity, 39 N.J. 502 (1963) (evidence that defendant conducted bookmaking and lottery was suppressed where affidavit did not show probable cause and officer's testimony to issuing judge not given under oath).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e We also take note that our legislature in 1968 incorporated the exclusionary rule into its enactment of the New Jersey Wiretapping and Electronic Surveillance Control Act, N.J.S.A. 2A:156A-1 to -26. That statute expressly provides for suppression of evidence derived from any intercepted wire or oral communication if the interception was unauthorized or inconsistent with the statute, or if the order of authorization was insufficient. N.J.S.A. 2A:156A-21. Significantly, an officer's good-faith reliance on a court order authorizing the interception constitutes a defense to any civil, criminal or administrative proceeding instituted against the officer, N.J.S.A. 2A:156A-25, but does not avoid the suppression of evidence derived from an improper interception. N.J.S.A. 2A:156A-21.\n\nNew Jersey's law-enforcement agencies have taken steps to enhance the quality of the search-warrant application process in order to assure compliance with the constitutionally-mandated probable-cause standard. Two recent initiatives are of particular significance. In July 1984 a special county grand jury issued a presentment concerning deficiencies in the procedure followed by a local police department in applying for and executing a search warrant resulting in the search and seizure of property without probable cause. The presentment noted that \"the execution of a search warrant is the most intrusive invasion of privacy permitted by government agents,\" and set forth the grand jury's finding \"that the group of citizens affected by the execution of the warrants * * * did not receive the protection of law afforded by the Constitution.\" Presentment, Special Union County Grand Jury, Panel No. 6, March Stated Session 1984 Term.\n\nPrompted in part by the findings of the grand jury presentment, the Attorney General and the County Prosecutors Association adopted in February 1985 a joint policy statement intended to achieve the \"institutionalization of a systematic search warrant review procedure in New Jersey.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The policy statement, which applies to all State, County, and municipal officers, requires that \"[a]ll applications for search warrants shall be reviewed by the Attorney General or his designees, or the appropriate County Prosecutor, or his designees, prior to their submission to the Courts for authorization.\" The Court has been informed, in response to its direct inquiry, that this policy statement has been implemented without exception in every county in the State.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e We are also cognizant of the significant and recurring search warrant training programs offered regularly to municipal court judges throughout the state. We\n\nassume that the likely effect of such a statewide policy requiring competent legal review of search warrant applications, combined with the training programs for municipal judges, would be to enhance the extent of compliance with the probable-cause standard and minimize the incidents of suppression of evidence because of defectively-issued warrants.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIn this connection, a survey performed by the Administrative Office of the Courts with respect to suppression motions in ten\n\ncounties during the six-month period of December 1, 1985, to May 31, 1986, reveals that of the 1082 motions filed, 540 motions have been resolved. Of these, 38 were granted and all of the granted motions involved warrantless searches. In addition, the study examined all of the granted suppression motions in three of the ten counties for an additional six-month period and in two additional counties during a twelve-month period. Out of 44 granted motions, only one suppression order involved a search warrant defective for lack of probable cause. Administrative Office of the Courts, Report on Suppression Motions, July 30, 1986.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e This survey was not statewide and examined a limited sample of suppression motions. Nevertheless, its results suggest that currently in New Jersey the grant of motions to suppress evidence obtained pursuant to defective search warrants is relatively uncommon and apparently poses no significant obstacle to law-enforcement efforts.\n\nWe note that one of the most frequently recurring themes in the criticism that has been directed at the Leon decision\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e is that it will tend to undermine the motivation of law-enforcement officers to comply with the constitutional requirement of probable cause. Professor LaFave makes the argument cogently:\n\nUnder the pre- Leon version of the exclusionary rule, police had finally come to learn that it was not enough that they had gotten a piece of paper called a warrant. Because that warrant was subject to challenge at the later motion to suppress, it was important to the police that the warrant be properly issued or that the warrant request be turned down at a time when it might be possible to acquire necessary additional information without compromising the investigation. Consequently, there had developed in many localities the very sound practice of going through the warrant-issuing process with the greatest of care, often by having the affidavit reviewed by individuals other than the magistrate. * * * But under Leon there is no reason to go through such cautious procedures and every reason not to. Why take the risk that some conscientious prosecutor or police supervisor will say the application is insufficient when, if\n\nsome magistrate can be induced to issue a warrant on the basis of it, the affidavit is thereafter virtually immune from challenge? There is thus no escaping the fact that, as the Leon dissenters put it, the \"long-run effect\" of that case \"unquestionably will be to undermine the integrity of the warrant process.\" [1 LaFave, Search and Seizure, supra (1986 Pocket Part),  1.2, at 20.]\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nWe find this criticism of the \"good-faith\" exception to be persuasive. One obvious consequence of the application of the exclusionary rule in New Jersey has been the encouragement of law-enforcement officials to comply with the constitutionally-mandated probable-cause standard in order to avoid the suppression of evidence. The Leon rule avoids suppression of evidence even if the constitutional standard is violated, requiring only that the officer executing the defective warrant have an objectively reasonable basis for relying on it. Whatever else may be said for or against the Leon rule, the good-faith exception will inevitably and inexorably diminish the quality of evidence presented in search-warrant applications. By eliminating any cost for noncompliance with the constitutional requirement of probable cause, the good-faith exception assures us that the constitutional standard will be diluted.\n\nWe note that Justice White, author of the Leon opinion, expressed concerns very similar to these in his dissent in I.N.S. v. Lopez-Mendoza, 468 U.S. 1032, 104 S. Ct. 3479, 82 L. Ed. 2d 778 (1984), decided the same day as Leon, a case in which the Court held that the exclusionary rule need not be applied in civil deportation proceedings. Responding to the majority's observation that the training of immigration officers in fourth-amendment principles made application of the exclusionary rule unnecessary, Justice White noted:\n\n[I]mmigration officers are instructed and examined in Fourth Amendment law, and it is suggested that this education is another reason why the exclusionary rule is unnecessary. A contrary lesson could be discerned from the existence of these programs, however, when it is recalled that they were instituted during \"a legal regime in which the cases and commentators uniformly sanctioned the\n\ninvocation of the rule in deportation proceedings.\" Thus, rather than supporting a conclusion that the exclusionary rule is unnecessary, the existence of these programs instead suggests that the exclusionary rule has created incentives for the agency to ensure that its officers follow the dictates of the Constitution. Since the deterrent function of the rule is furthered if it alters either \"the behavior of individual law enforcement officers or the policies of their departments,\" it seems likely that it was the rule's deterrent effect that led to the programs to which the Court now points for its assertion that the rule would have no deterrent effect. [ Id. at 1055, 104 S. Ct. at 3492-93, 82 L. Ed. 2d at 796 (quoting Leon, supra, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677).]\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nOur view that the good-faith exception will ultimately reduce respect for and compliance with the probable-cause standard that we have steadfastly enforced persuades us that there is a strong state interest that would be disserved by adopting the Leon rule. We acknowledge the virtue of consistency between federal and state courts in the administration of the criminal laws, although we note that from the decision in Weeks, supra, in 1914 until Mapp v. Ohio, supra, in 1961, the exclusionary rule applied in the federal courts but was not constitutionally compelled in the states. Although there is irony in the reversal of these roles, there is ample precedent for the view that uniformity between federal and state courts is not essential with regard to the exclusionary rule. See Wolf v. Colorado, supra, 338 U.S. at 28-33, 69 S. Ct. at 1361-64, 93 L. Ed. at 1786-88. In this connection, we observe that Leon has generated significant debate in other jurisdictions.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Ultimately, we focus on the inevitable tension between the proposed good-faith exception and the guarantee contained in our State Constitution that search warrants \"shall not issue except upon probable cause.\" In the twenty-five years during which we have applied the exclusionary rule in New Jersey, we have perceived no dilution of our probable-cause standard; rather, efforts to comply with the constitutional mandate have been enhanced. Nor do we perceive that application of the exclusionary rule has in any significant way impaired the ability of law-enforcement officials to enforce the criminal laws. The statistical evidence is to the contrary.\n\nWe recognize that the exclusionary rule may pose a greater obstacle to law enforcement in other jurisdictions where nonlawyer magistrates are authorized to issue search warrants and police officers' affidavits are not subjected to review by trained prosecutors. Illinois v. Gates, supra, 462 U.S. at 235, 103 S. Ct. at 2330-31, 76 L. Ed. 2d at 546; Shadwick v. City of Tampa, 407 U.S. 345, 92 S. Ct. 2119, 32 L. Ed. 2d 783 (1972); see Wasserstrom \u0026 Mertens, supra note 26, at 106-11. The incidence of defective search warrants in other jurisdictions may partially explain the Supreme Court's adoption of a less restrictive federal standard for testing the admissibility of evidence thus obtained. Plainly, the same considerations do not apply in New Jersey.\n\nIn the face of evidence that New Jersey's criminal justice system is not impaired by the constitutional guarantee of probable cause, our dissenting colleague nevertheless urges us to adopt the good-faith exception promulgated in Leon because she perceives \"that the public will view the good-faith exception to the exclusionary rule as a sensible accommodation between protecting an individual's constitutional rights and punishing the guilty.\" Post at 187. We have little doubt that the dissent is accurate in this assessment, particularly at a time when widespread drug use and drug-related law enforcement are issues that dominate the national consciousness. The public is likely to have little short-term tolerance for any rule that encumbers even minimally the prosecution of drug-related crime.\n\nOur concern, however, is with the Constitution and with the basic and fundamental guarantees that that document was intended to afford to all our citizens, particularly in times of public ferment. In our view, the citizen's right to be free from unreasonable searches and seizures conducted without probable cause is just such a fundamental principle, to be preserved and\n\nprotected with vigilance. In our tripartite system of separate governmental powers, the primary responsibility for its preservation is that of the judiciary.\n\nThe exclusionary rule, by virtue of its consistent application over the past twenty-five years, has become an integral element of our state-constitutional guarantee that search warrants will not issue without probable cause. Its function is not merely to deter police misconduct. The rule also serves as the indispensable mechanism for vindicating the constitutional right to be free from unreasonable searches.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Because we believe that the good-faith exception to the exclusionary rule adopted in\n\nLeon would tend to undermine the constitutionally-guaranteed standard of probable cause, and in the process disrupt the highly effective procedures employed by our criminal justice system to accommodate that constitutional guarantee without impairing law enforcement, we decline to recognize a good-faith exception to the exclusionary rule.\n\nIn reaching this result, we can hardly ignore the ebb and flow of federal search-and-seizure law during this century. The\n\nreversal of the Wolf decision in Mapp v. Ohio, the impact of Gates on the Aguilar-Spinelli test, and the erosion of the exclusionary rule during the past two decades counsel us against the assumption that the decision in Leon is to be a permanent star in the judicial firmament. Justice Blackmun, concurring in Leon, cautioned us as to the \"unavoidably provisional nature\" of the decision, 468 U.S. at 927, 104 S. Ct. at 3424, 82 L. Ed. 2d at 701, and warned that if \"the good faith exception to the exclusionary rule results in a material change in police compliance with the Fourth Amendment, we shall have to reconsider what we have undertaken here,\" id. at 928, 104 S. Ct. at 3424, 82 L. Ed. 2d at 702. We suspect that Justice Blackmun's forebodings may be prophetic indeed. In our view, erosion of the probable-cause guarantee will be a corollary to the good-faith exception. We think it quite possible that the damage to the constitutional guarantee may reach such a level as to cause the Court to reconsider its experiment with the fourth amendment.\n\nWe see no need in New Jersey to experiment with the fundamental rights protected by the fourth-amendment counterpart of our State Constitution. We will not subject the procedures that vindicate the fundamental rights guaranteed by article I, paragraph 7 of our State Constitution -- procedures that have not diluted the effectiveness of our criminal justice system -- to the uncertain effects that we believe will inevitably accompany the good-faith exception to the federal exclusionary rule.\n\nThe judgment of the Appellate Division is affirmed.\n\nHANDLER, J., concurring.\n\nDefendant, Ottavio Novembrino, was indicted for possession of controlled dangerous substances and possession of controlled\n\ndangerous substances with intent to distribute. He filed a motion to suppress evidence and, as noted in the majority opinion, the suppression hearing resulted in sharply conflicting accounts of the circumstances surrounding defendant's arrest and the subsequent search of his service station. The trial court, however, credited the State's evidence, as did the Appellate Division, and, now, this Court. In spite of the fact that every judge who reviewed the issuance of the search warrant and examined the evidence surrounding the search and seizure in this case accepted the State's version, each reached the same conclusion -- that the State failed to demonstrate probable cause to justify the issuance of the search warrant.\n\nI concur in the unanimous determination that there was no probable cause in this case. Further, I join the majority in its conclusion that evidence seized pursuant to a search warrant issued without probable cause must be excluded notwithstanding the executing officer's subjective good faith in relying upon the warrant; in a case such as this, the judicially-devised exclusionary rule must be applied to vindicate the underlying constitutional interest. However, I break rank with the Court when it expresses an additional reason for reaching this result, namely, that the exclusionary rule itself is a constitutional right directly protected under the State Constitution.\n\nI.\n\nBefore explaining my reasons for disagreeing with the majority as to the conceptual basis for applying the exclusionary rule, some observations concerning the antecedent issues in this case are pertinent. These relate to both the non-controverted question of probable cause and the highly-controverted issue of the relevance of the executing officer's subjective good faith.\n\nAs to probable cause, in view of the unanimity of opinion, I see no necessity for the Court's extensive exposition of this issue. I would be content in this case simply to adopt the sound position of the Appellate Division that the affidavit and circumstances\n\nsurrounding the issuance of the search warrant failed to demonstrate adequate probable cause:\n\nThe affidavit here involved simply revealed that a police informant concluded for unknown reasons that defendant was a drug dealer, that a person previously arrested for possession of cocaine was seen at defendant's gas station engaged in some unspecified activities which caused a detective, whose education, training and experiences are unknown, to conclude that criminal activities in the form of violations of Title 24 were taking place at the gas station. The totality of the circumstances spelled out in the affidavit failed to contain a single objective fact tending to engender a \"well grounded suspicion\" that a crime was being committed. * * * We conclude, therefore, that probable cause was not established. [ State v. Novembrino, 200 N.J. Super. 229, 236 (1985) (citations omitted).]\n\nThis is so particularly in light of the Court's ruling that a totality-of-the-circumstances formula analogous to that set forth in Illinois v. Gates, 462 U.S. 213, 103 S. Ct. 2317, 76 L. Ed. 2d 527 (1983), is now to be used to assess the validity of search warrants under the probable cause standard set forth in Article I, paragraph 7 of the New Jersey Constitution. Ante at 122.\n\nWith respect to the relevance of the executing police officer's subjective good faith, the Court rejects the proposition that if probable cause for the issuance of a search warrant is lacking, seized evidence should nevertheless be admissible on the basis of the good-faith exception recognized by the Supreme Court in United States v. Leon, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677 (1984). I concur in this determination.\n\nI agree with the majority that the good-faith test effectively dilutes probable cause -- the indispensable constitutional foundation for a reasonable search and seizure -- by eliminating the necessity for demonstrating reasonable grounds to make a search before evidence obtained therefrom will be admissible in evidence. This conclusion is based on the fact that operation of the exclusionary rule serves to deter not only intentional official misconduct but also mistaken official misdeeds.\n\nIn addition, the test proffered under Leon is not simply subjective good faith as such. Rather, the test is objective-subjective good faith: whether the actual, \"subjective\" good faith of the executing police officer itself can be considered \"objectively\"\n\nreasonable as a basis for undertaking -- and validating -- a search in reliance upon the warrant. We have generally eschewed the relevance or significance of the actual state of mind of the executing officer. In recent cases we have been emphatic and consistent in our adherence to the proposition that probable cause must be demonstrated by reference to objective circumstances -- what an informed, trained and reasonably experienced police officer under all of the circumstances would have understood in terms of whether there is probable cause. See State v. Bruzzese, 94 N.J. 210 (1983) (police officer's search and seizure would be considered reasonable only if it conformed to objectively reasonable police standards); see also State v. Guerra, 93 N.J. 146, 152 (1983) (\"if the validity of a search can be sustained independently on objective grounds demonstrating reasonableness, the existence of other defects that do not derogate from the overall objective reasonableness of the search or impugn the integrity of the judicial process should not be relied upon to invalidate the search.\") (emphasis added); State v. Ercolano, 79 N.J. 25, 71 (1979) (dissenting opinion).\n\nThe problem is that the objective-subjective good faith test of Leon is inconsistent with the requirement of objective probable cause. As put by Justice Brennan dissenting in United States v. Leon:\n\nit is virtually inconceivable that a reviewing court, when faced with a defendant's motion to suppress, could first find that a warrant was invalid, under the new [ Illinois v. ] Gates standard, but then, at the same time, find that a police officer's reliance on such an invalid warrant was nevertheless \"objectively reasonable\" under the [Leon] test. Because the two standards overlap so completely, it is unlikely that a warrant could be found invalid under Gates and yet the police reliance upon it could be seen as objectively reasonable; otherwise, we would have to entertain the mind-boggling concept of objectively reasonable reliance upon an objectively unreasonable warrant.\" (citing Kamisar, supra, note 5, at 588-89; Wasserstrom, \"The Incredible Shrinking Fourth Amendment,\" 21 Am.Crim.L.Rev. 257 (1984); LaFave, \"The Fourth Amendment in an Imperfect World: On Drawing 'Bright Lines' and 'Good Faith,'\" 43 U.Pitt.L.Rev. 307, 333-59 (1982). [468 U.S. at 958-59, 104 S. Ct. at 3445-46, 82 L. Ed. 2d at 721-22.]\n\nJustice Brennan concluded that the subjective good-faith test would virtually eviscerate the constitutional requirement of\n\nprobable cause. I could not agree more, and on this point I am confident that the majority of this Court concurs, particularly in view of its extended emphasis upon the paramountcy of probable cause as the quintessential basis for a reasonable search and seizure and its rejection of the objective-subjective good faith test of Leon. Ante at 157.\n\nII.\n\nMy major difference from the Court has not to do with its test of probable cause or its rejection of the good-faith exception. Therefore, under the circumstances of this case, I agree with the Court's application of the exclusionary rule. The effect of our judgment in this case is to sanction the exclusion of evidence derived from a search and seizure based upon a warrant that was not supported by probable cause -- on objective grounds -- notwithstanding the subjective good faith of the executing officer in relying upon the search warrant.\n\nMy departure from the Court is occasioned by its characterization of the exclusionary rule as it is applied in this case. The majority has decided that the exclusionary rule -- the exclusion of evidence derived from an objectively unreasonable search and seizure -- itself is a constitutional right. I do not believe that it is a constitutional right as such. Rather, it is a remedial rule that is ancillary or incidental to the central constitutional right of the citizen to be free from unreasonable searches and seizures. That the exclusionary rule is a remedial rule ancillary to the constitutional right in no way denigrates the singular importance of the rule or detracts from its legal potency. See State v. Hartley, 103 N.J. 252, 290 (1986) (concurring opinion). I am satisfied that the exclusionary rule is vitally necessary to protect the underlying constitutional right on the part of individuals to be free from unreasonable searches and seizures and should be continued as a court-created remedy as a matter of our state common law. While this conceptual disagreement has no practical consequences in this case, it may have enormous ramifications in other situations.\n\nI am constrained to state my difference from the Court because I cannot subscribe to its analysis or reasoning concerning the constitutional basis of the exclusionary rule. The Court's determination is borne out neither by the decisional law that has served to explicate our legal traditions relative to the exclusionary rule, nor by state constitutional history relevant to the exclusionary rule, nor by considerations of a sound public policy -- factors that we generally consider in expounding and interpreting our state constitution. State v. Gilmore, 103 N.J. 508 (1986); State v. Williams, 93 N.J. 39 (1983); State v. Hunt, 91 N.J. 338 (1982) (concurring opinion).\n\nA.\n\nA review of our decisional law shows that, even after Weeks v. United States, 232 U.S. 383, 34 S. Ct. 341, 58 L. Ed. 652 (1914), in which the exclusionary rule was first applied under the fourth amendment, New Jersey did not apply the exclusionary rule. Rather, this state adhered to the rule that \"competent proof shall be available for the prosecution of the offense notwithstanding illegality in the seizure.\" Eleuteri v. Richman, 26 N.J. 506, 509-10 (1958); see State v. Alexander, 7 N.J. 585, 594 (1951), cert. denied, 343 U.S. 908, 72 S. Ct. 636, 96 L. Ed. 1326 (1952); State v. Guida, 119 N.J.L. 464 (E. \u0026 A.1938); State v. Merra, 103 N.J.L. 361 (E. \u0026 A.1927); State v. Cortese, 104 N.J.L. 447 (E. \u0026 A.1927), aff'g 4 N.J.Misc. 683 (Sup.Ct.1926); State v. Lyons, 99 N.J.L. 301 (E. \u0026 A.1923); State v. MacQueen, 69 N.J.L. 522, 528 (1903).\n\nIn 1958, we had an opportunity to re-examine the constitutional significance of this settled rule. In Eleuteri v. Richman, supra, 26 N.J. 506, search warrants were invalidated because the issuing magistrate was without power to authorize a search beyond the territorial limits of his court. Id. at 508. The issue was whether the fruit of that unlawful search was nevertheless admissible in evidence. The Court observed that:\n\nThe exclusionary rule rests upon two propositions. The first is that government should not stoop to the \"dirty business\" of a criminal in order to catch\n\nhim. The second is that civil and criminal remedies against the offending officer are as a practical matter ineffective, and hence the rule of exclusion is the only available remedy to protect society from the excesses which led to the constitutional right. Id. at 512.\n\nAnd further:\n\nthe exclusionary rule has the role of a deterrent -- a device to compel respect for the [constitutional] guarantee by removing an incentive to disregard it. It is calculated to prevent; not to repair. The postulate is an enforcement official indifferent to basic rights. Id. at 513, 141 A.2d 46 (emphasis added).\n\nEven after Mapp v. Ohio, 367 U.S. 643, 81 S. Ct. 1684, 6 L. Ed. 2d 1081 (1961), by which the federal adoption of the exclusionary rule as a remedial device to vindicate the fourth amendment guaranty against unreasonable searches became applicable to states under the fourteenth amendment, we consistently recognized that the exclusionary rule served the primary purpose of deterrence. Moreover, we initially held that the rule should be applied only to redress culpable police misconduct. See State v. Gerardo, 53 N.J. 261, 267 (1969) (holding that exclusion of evidence is not mandated by the fourth amendment, since \"important as it is in our society, [it] does not call for imposition of judicial sanctions where enforcing officers have followed the law with such punctilious regard as they have here\"); State v. Zito, 54 N.J. 206, 211 (1969) (holding that \"the product of a search should not be suppressed when a search is made in good faith upon the strength of a statute later declared unconstitutional); State v. Bisaccia, 58 N.J. 586, 589-91 (1971). (\"It is puzzling that the suppression rule was not anchored to the reason for its creation. The evil sought to be ended was insolence in office.\")\n\nThe majority here asserts that at least since the decision in State v. Valentin, 36 N.J. 41 (1961), \"the exclusionary rule has become imbedded in our jurisprudence.\" Ante at 148. It states that the exclusionary rule has consistently been applied to exclude from the State's case-in-chief evidence illegally obtained through warrantless searches or in reliance upon defective warrants. The cases it cites all reflect a judicial concern with, and reaction to, evidence that was seized in violation of\n\nstandards and rules designed to assure the reasonableness of the search and seizure. E.g. State v. Valencia, 93 N.J. 126, 141 (1983) (evidence obtained as a result of telephone-authorized search would be suppressed where State failed to prove minimal procedural requirements to assure reliability); State v. Fariello, 71 N.J. 552 (1976) (requiring suppression of evidence of narcotics possession where affidavit was insufficient to show probable cause and issuing judge made no transcription or summary of officer's testimony); State v. Moriarity, 39 N.J. 502 (1963) (evidence that defendant conducted bookmaking and lottery was suppressed where affidavit did not show probable cause and officer's testimony to issuing judge not given under oath); State v. Macri, 39 N.J. 250, 265-66 (1963) (mandating suppression of illegally seized evidence of bookmaking activities and rejecting State's argument in support of a good faith exception).\n\nIt may not be amiss to characterize these decisions as \"embedd[ing]\" the exclusionary rule in our jurisprudence. Their significance, however, is not so much a consistent reliance upon the exclusionary rule but a judicial expansion of the scope of the rule. In effect, these decisions extend the deterrent purpose of the exclusionary rule to encompass cases of unreasonable official misconduct that was simply misguided or mistaken, as well as intentional or malicious. It cannot be overemphasized, however, that this Court, in extending and applying the exclusionary rule, has consistently and unfailingly stressed its deterrent purpose and its origins as a court-created remedy designed to discourage improper police conduct.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e E.g., State v.\n\nGerardo, supra, 53 N.J. at 267 (\"The doctrine of suppression is judge-made, a device adopted upon the belief that there was no effective remedy for a violation of [the fourth amendment]. Suppression is ordered, not to rectify a wrong already done, but to deter future violations.\"). The Court has not given similar weight to the notion that the rule is designed to make the frequently-guilty defendant constitutionally \"whole\" by negating the use of the fruit of an unreasonable search. Thus, while the rule is part of our \"jurisprudence,\" it is the Court's unswerving endorsement of its deterrent purpose that accounts for this. It is therefore an exaggeration to say that the rule, though markedly broadened, has acquired constitutional stature.\n\nIt might be argued (though not by the majority) that the exclusionary rule is constitutional because it is directly related to \"judicial integrity.\" We, however, have not subscribed to the view that \"judicial integrity\" is the purpose served by the exclusionary rule, although in particular cases \"judicial integrity\" may be threatened by certain kinds of police misconduct and itself would justify application of the rule. See, e.g., Franks v. Delaware, 438 U.S. 154, 98 S. Ct. 2674, 57 L. Ed. 2d 667 (1978); State v. Howery, 80 N.J. 563 (1979) (holding that the fourth amendment requires that a defendant be allowed an opportunity to challenge the veracity of an affidavit supporting a search warrant). Just last term we reiterated the position that the function of the exclusionary rule is deterrence. In Delguidice v. New Jersey Racing Com'n., 100 N.J. 79 (1985), we held that \"[d]eterrence of future unlawful police conduct is the 'prime purpose' of the exclusionary rule, 'if not the sole one.'\" Id. at 85 (citations omitted). We rejected the argument that \"judicial integrity\" mandates that the courts exclude all\n\nevidence that has been unlawfully seized. The Court held that in most suppression cases\n\nthe evidence is unquestionably accurate and the wrong is complete by the time the evidence reaches the court. Therefore, the analysis is narrowed to the question of whether admitting the evidence would encourage future improper law enforcement actions. . . . [T]his inquiry is substantially the same as the question of whether exclusion would serve a deterrent purpose. [ Id. at 89 (citations omitted).]\n\nIn sum, the exclusionary rule as developed and applied in this jurisdiction has evolved from one focusing essentially on callous, willful or insolent police misbehavior to one that encompasses official misconduct reflecting no more than ignorance, mistake, or inexperience. In either of these situations, the result to the victim is the same -- an objectively unreasonable search and seizure. And, therefore, the application of the rule is the same -- to exclude ill-found evidence in order to discourage the offending officials. Thus, it is the judicial understanding of what is \"improper\" police misconduct that has changed over the years, not the purpose of the rule. The genetic thread that connects our decisions is the central design of the exclusionary rule to deter improper official conduct. To reiterate, the purpose is not solely or primarily to punish the offending police officer or to compensate the defendant or even to assure judicial integrity. Consequently, this stream of decisional law erodes rather than supports the foundation upon which the Court now raises the exclusionary rule to a constitutional right.\n\nB.\n\nThe decisional law does not clearly reflect strong legal traditions that suggest the exclusionary rule is itself of constitutional stature. Hence, our decisions do not provide the basis from which to reason that the exclusionary rule has now evolved into a constitutional doctrine. Moreover, the relevant and express constitutional history in this area militates against the conclusion that the exclusionary rule itself has acquired the status of\n\na constitutional right. On this point I agree with the analysis of the dissenting opinion. Post at 168.\n\nAs noted, the early prevailing rule in our jurisdiction allowed into evidence the fruits of an illegal search and seizure. Supra at 164. This rule of admissibility was firmly in place when the delegates to New Jersey's Constitutional Convention assembled in the summer of 1947. The constitutional provision guaranteeing the citizens' right to be free of unreasonable searches and seizures, like its federal fourth amendment counterpart, provides:\n\nThe right of the people to be secure in their persons, houses, papers and effects, against unreasonable searches and seizures, shall not be violated; and no warrant shall issue except upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched and the papers and things to be seized. [ N.J. Const. (1947) art. I, para. 7.]\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAn amendment proposed at the Convention would have added the following sentence to Article I, paragraph 7: \"Nothing obtained in violation hereof shall be received into evidence.\" In effect, it was proposed that the exclusionary rule be made an express constitutional right. The delegates defeated the proposed amendment by a final vote of 46 to 25. See 1 Convention Proceedings Record 598-608 (August 19, 1947).\n\nThe debate leading to the defeat of the amendment included discussion of both the merits of the federal exclusionary rule and the propriety of incorporating such a rule into the constitutional guarantee. The Court in Eleuteri v. Richman, supra, summarized the Convention proceedings:\n\nThe issue was debated, with specific reference to the merits of the federal rule. One delegate added that in any event he questioned the advisability of incorporating an answer either way in organic law. The amendment was defeated by a vote of 46 to 25. 1 Convention Proceedings Record, 598, 608. We do not infer that the delegates intended thereby to embed our case law, but it is equally clear the the rule of exclusion is not the unmistakable wake of the constitutional provision. [26 N.J. at 511]\n\nIt may be, as the Court in Eleuteri acknowledged, that the defeat of the exclusionary-rule amendment at the Constitutional Convention left the rule amenable to judicial treatment and development, perhaps even to the point of someday recognizing it as a standard of constitutional dimension. It seems equally clear, however, that our case-law has not brought us to this point. The rule remains, as it has always been, a judicial remedy. Though the rule has achieved broadened scope and application, it is designed to protect the central constitutional right of citizens to be free from unreasonable searches and seizures by deterring unlawful official conduct that otherwise undermines this constitutional right. It is thus fair to conclude that (1) the exclusionary rule is expressly not a part of the New Jersey Constitution and (2) the decisional law does not by express holdings or clear implication furnish a basis for determining that the exclusionary rule has become an integral part of the State Constitution.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nC.\n\nThe Court offers no reason why the judicially-fashioned exclusionary rule cannot satisfactorily be regarded as a common-law principle and remain fully efficacious in vindicating the underlying constitutional right. Indeed, rights and interests that are vital to the individual have been anchored firmly in our common law. E.g. State v. Hartley, supra, 103 N.J. 252 (privilege against self-incrimination). It therefore seems to me unwise -- because unnecessary -- for this Court to metamorphose an ancillary rule such as the exclusionary rule from a common-law doctrine into a constitutional right. To do so forever blocks\n\nany future development of the rule and effectively forecloses the possibility of alternative approaches that might serve to enforce the basic constitutional right.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nMoreover, permitting the exclusionary rule to be incorporated into our Constitution effectively prevents the other branches of government from exercising their own responsibility to protect a citizen's right to be free from unreasonable searches and seizures. For at least a generation we have, until today, expressed confidence in the role of the other branches of government with respect to the citizen's constitutional right to be secure against unlawful searches and seizures. Compare Eleuteri v. Richman, supra, 26 N.J. at 514-16 (\"The judiciary, of course, is not the sole guardian of the Constitution. The executive branch is equally sworn to uphold it.\") with Delguidice v. New Jersey Racing Com'n, supra, 100 N.J. at 92 (\"There comes a point at which courts, consistent with their duty to administer the law, cannot continue to create barriers to law enforcement in the pursuit of a supervisory role that is properly the duty of executive and legislative branches. We find ourselves at that point in this case.\") We would be remiss if we failed to comprehend that the other branches of government have direct responsibilities with respect to the effective enforcement\n\nof the constitutional guarantee against unreasonable searches and seizures.\n\nThe majority itself stresses the constructive measures taken by the Attorney General and other law enforcement authorities to adopt procedures to assure the reasonableness of searches and seizures. Ante at 150-151. It also quite aptly acknowledges the Legislature, which specifically incorporated the exclusionary rule into its enactment of the New Jersey Wiretapping and Electronic Surveillance Control Act, N.J.S.A. 2A:156A-1 to -26.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In providing for a statutory rule of exclusion, N.J.S.A. 2A:156A-21, the Legislature specifically recognized the availability of supplementary forms of relief and, significantly, provided that an officer's good faith reliance on a court order authorizing the interception constitutes a defense to any civil, criminal, or administrative proceeding instituted against the officer, N.J.S.A. 2A:156A-25, but does not avoid the suppression of evidence derived from an improper interception. N.J.S.A. 2A:156A-21. In State v. Molinaro, 117 N.J. Super. 276 (Essex Cty.Ct.1971), rev'd on other grounds, 122 N.J. Super. 181 (App.Div.1973), the court noted that: \"In the adoption of the New Jersey Wiretapping and Electronic Surveillance Control Act, the New Jersey Legislature attempted to be scrupulous about the protections which it fashioned for individual privacy.\" Id. at 287. The court then held:\n\nWhere evidence has been seized unlawfully, suppression of that evidence at trial ordinarily follows. This doctrine of suppression is a court-authored remedy. Where, however, evidence stems from an unlawful wiretap, suppression of such evidence is the remedy selected specifically by the Legislature. Id. at 294. (citations omitted).\n\nThe court also stated:\n\nArguably, the judiciary in a different setting could abandon or modify the exclusionary doctrine since this rule originated with the courts. It has been\n\nsuggested, however, that it is also within the power of a legislative body to adopt or negate a rule of suppression. With respect to evidence derived from an unlawful electronic surveillance, the New Jersey Legislature by N.J.S.A. 2A:156A-21 has instituted such a rule. Id. at 295, 284 A.2d 385. (citations omitted).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe Wiretapping Act instructs us that when a threatened privacy interest is deemed sufficiently important, the Legislature will not hesitate to devise effective remedies, including the exclusionary rule, to protect this interest.\n\nThe \"bottom line\" for the majority seems to be its despair that there can ever be any effective alternative to the exclusionary rule and, therefore, we might as well give it permanency. It is certainly fair to observe that existing alternatives to the exclusionary rule are largely inadequate. E.g. Monroe v. Pape, 365 U.S. 167, 81 S. Ct. 473, 5 L. Ed. 2d 492 (1961) (An individual whose fourth amendment rights have been violated by a state law enforcement official has a cause of action under 42 U.S.C.  1983); Bivens v. Six Unknown Fed. Narcotics Agents, 403 U.S. 388, 91 S. Ct. 1999, 29 L. Ed. 2d 619 (1971) (A cause of action for damages arises under the fourth amendment itself when its provisions are violated by federal officials). Nevertheless, this Court need not, and should not, itself end the search for effective solutions. The debate over possible alternatives to the exclusionary rule has gone on for a long time, and has taken on an increased vigor since the Supreme Court's decision in United States v. Leon, supra, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677. Chief Justice Burger has suggested a comprehensive remedy in his dissent in Bivens, supra, 403 U.S. at 422-23, 91 S. Ct. at 2017-18, 29 L. Ed. at 642. This proposal is similar to those that have been suggested from time to time by legal commentators. See, e.g., Gangi, The Exclusionary Rule:\n\nA Case Study in Judicial Usurpation, 34 Drake L.Rev. 33 (1984-85);\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Berner, Fourth-Amendment Enforcement Models: Analysis and Proposal, 16 Val.U.L.Rev. 215 (1981); Wilkey, Enforcing the Fourth Amendment by Alternatives to the Exclusionary Rule, 95 F.R.D. 211 (1982). I would leave to the sound judgment of the Legislature and the Executive whether there can be developed other ways to preserve the constitutional right of citizens to be secure against unreasonable searches and seizures. Of course, this Court reserves the power to pass upon the constitutionality of any action undertaken by the other branches of government. See Hills Dev. Co. v. Bernards Tp. in Somerset Cty., 103 N.J. 1 (1986). In the meantime, I continue to believe strongly in the significance of the exclusionary rule in serving the constitutional right of citizens to be free from unreasonable searches and seizures and would not hesitate to recognize and apply the exclusionary rule to this end as a matter of state common law.\n\nIV.\n\nFor the reasons stated, I concur in the judgment of the Court.\n\nGARIBALDI, J., concurring in part and dissenting in part.\n\nI concur with the majority's adoption of the Illinois v. Gates, 462 U.S. 213, 103 S. Ct. 2317, 76 L. Ed. 2d 527, reh'g denied, 463 U.S. 1237, 104 S. Ct. 33, 77 L. Ed. 2d 1453 (1983), totality-of-the-circumstances test to determine the validity of a search warrant under Article I, paragraph 7 of the New Jersey Constitution. I dissent from the majority's failure to recognize, as a matter of state law, the \"good faith\" exception to the exclusionary rule\n\nset forth in United States v. Leon, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677 (1984).\n\nI consider the dominant justification of the exclusionary rule to be the deterrence of police conduct that violates Article I, paragraph 7 of the New Jersey Constitution. The majority, however, transforms this judicially-created remedy into a state constitutional right. It fears that adoption of a good faith exception to the exclusionary rule will undermine the constitutionally-guaranteed standard of probable cause. This position strikes an improper balance between the valid goal of protecting individual rights under the state constitution and the public's right to have those who transgress the law brought to justice. \"The criminal is to go free because the constable has blundered.\" Eleuteri v. Richman, 26 N.J. 506, 512 (1958), quoting People v. Defore, 242 N.Y. 13, 21, 150 N.E. 585, 587 (Ct.App.), cert. den., 270 U.S. 657, 46 S. Ct. 353, 70 L. Ed. 784 (1926). A limited good faith exception more properly accommodates the legitimate interests of the public in an effective criminal justice system without sacrificing the individual rights protected by our Constitution. Adopting the good faith exception to the exclusionary rule reflects not a lesser concern with safeguarding an individual's constitutional rights but a deeper appreciation of the high costs incurred when probative, reliable evidence is barred because of investigative error.\n\nMoreover, while it is undisputed that a state may provide greater protection to individual rights than is found in the United States Constitution, a departure from the federal constitution should be supported by sound historical or policy reasons. State v. Hunt, 91 N.J. 338, 345 (1982). Consistent state and federal rulings are crucial to the rational development of criminal law and the guidance of our law-enforcement officials. Only a strong state purpose would justify divergence in this very sensitive area. An examination of the New Jersey Constitution, statutes, and cases reveals no such purpose, and in fact leads to the conclusion that adoption of the Leon and Sheppard limited good faith exception is consistent with New Jersey law.\n\nI\n\nSince Mapp v. Ohio, 367 U.S. 643, 81 S. Ct. 1684, 6 L. Ed. 2d 1081 (1961), the Supreme Court, recognizing the high cost to the criminal justice system of indiscriminately suppressing all probative evidence, has applied a balancing approach that has gradually eroded the scope of the exclusionary rule. See Stone v. Powell, 428 U.S. 465, 96 S. Ct. 3037, 49 L. Ed. 2d 1067 (1976); United States v. Peltier, 422 U.S. 531, 95 S. Ct. 2313, 45 L. Ed. 2d 374 (1975); United States v. Calandra, 414 U.S. 338, 94 S. Ct. 613, 38 L. Ed. 2d 561 (1974); Alderman v. United States, 394 U.S. 165, 89 S. Ct. 961, 22 L. Ed. 2d 176, reh'g denied, 394 U.S. 939, 89 S. Ct. 1177, 22 L. Ed. 2d 475 (1969). In those cases, the Court held that the exclusionary rule is a judicial remedy that must be sensitive to the costs and benefits of its imposition. In United States v. Leon, supra, 468 U.S. 897, 104 S. Ct. 3405, 82 L. Ed. 2d 677, and its companion case, Massachusetts v. Sheppard, 468 U.S. 981, 104 S. Ct. 3424, 82 L. Ed. 2d 737 (1984), the Court specifically adopted a good faith exception to the exclusionary rule.\n\nIn United States v. Leon, supra, 468 U.S. at 922, 104 S. Ct. at 3421, 86 L. Ed. 2d at 698, the Court concluded that the \"marginal or nonexistent benefits produced by suppressing evidence obtained in objectively reasonable reliance on a subsequently invalidated search warrant cannot justify the substantial costs [to the criminal justice system] of exclusion.\" To understand fully the impact of the exclusionary rule in search and seizure cases one must recognize that unlike other exclusionary rules involving the fifth and sixth amendments -- which often implicate concerns about the inherent reliability and truthworthiness of the excluded evidence -- this rule excludes evidence that is typically reliable and often the most probative information bearing on the guilt or innocence of the defendant. As Justice Black emphasized in his dissent in Kaufman v. United States, 394 U.S. 217, 237, 89 S. Ct. 1068, 1079, 22 L. Ed. 2d 227, 243 (1969):\n\nA claim of illegal search and seizure under the Fourth Amendment is crucially different from many other constitutional rights; ordinarily the evidence seized can in no way have been rendered untrustworthy by the means of its seizure and indeed often this evidence alone establishes beyond virtually any shadow of a doubt that the defendant is guilty.\n\nIn Leon, the Court acknowledged some of the substantial social costs of applying the exclusionary rule: the rule impedes the truth-finding functions of the jury and judges; allows some guilty defendants to go free or receive reduced sentences due to plea bargains; and, through its indiscriminate application, may generate disrespect for the administration of justice.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e 468 U.S. at 906-09, 104 S. Ct. at 3412-14, 82 L. Ed. 2d at 688-89. The Court stated:\n\nParticularly when law enforcement officers have acted in objective good faith or their transgressions have been minor, the magnitude of the benefit conferred on such guilty defendants offends basic concepts of the criminal justice system. [Id.]\n\nThe good faith exception seeks to rectify this disparity between the error committed by the police officer and the windfall afforded a guilty defendant.\n\nRecognizing the extreme importance of protecting an individual's right to be free from unreasonable seizures, the Court in Leon did not abolish, but merely modified, the exclusionary rule to provide that\n\n[s]uppression . . . remains an appropriate remedy if the magistrate or judge in issuing a warrant was misled by information in an affidavit that the affiant knew was false or would have known was false except for his reckless disregard of the truth. . . . The exception . . . will also not apply in cases where the issuing magistrate wholly abandoned his judicial role . . .; in such circumstances, no reasonably well-trained officer should rely on the warrant. Nor would an officer manifest objective good faith in relying on a warrant based on an affidavit \"so lacking in indicia of probable cause as to render official belief in its existence entirely unreasonable.\" . . . Finally, depending on the circumstances of the particular case, a warrant may be so facially deficient -- i.e., in failing to particularize the place to be searched or the things to be seized -- that the executing officers cannot reasonably presume it to be valid. [citations omitted.] [468 U.S. at 923-24, 104 S. Ct. at 3421-22, 82 L. Ed. 2d at 698-99.]\n\nThe Court concluded that suppression of evidence obtained pursuant to a warrant should be ordered only on a case-by-case basis. In each instance, the court must weigh the costs and benefits of applying the rule. In short, probative evidence should not be suppressed where its exclusion will serve no useful, recognized purpose.\n\nThe foundation of the majority's decision is its assumption that Leon's limited good faith exception will tend to undermine the motivation of law-enforcement officers to comply with the constitutional requirement of probable cause. The majority fails to recognize that indiscriminate application of the exclusionary rule may actually hinder the educative and deterrent functions of the suppression remedy. See Kaplan, \"The Limits of the Exclusionary Rule,\" 26 Stan.L.Rev. 1027, 1050 (1974) (\"Instead of disciplining their employees, police departments generally have adopted the attitude that the courts cannot be satisfied, that the rules are hopelessly complicated and subject to change, and that the suppression of evidence is the courts' problem and not the departments'.\").\n\nThe good-faith exception fashioned in Leon does not reduce a police officer's incentive to respect the Constitution, because it\n\nis triggered only when an officer's conduct is objectively reasonable.\n\nIf evidence is suppressed only when a law enforcement officer should have known that he was violating the Fourth Amendment, police departments may look more seriously at the officer's misconduct when suppression is invoked. Moreover, by providing that evidence gathered in good-faith reliance on a reasonable rule will not be excluded, a good-faith exception creates an incentive for police departments to formulate rules governing activities of officers in the search-and-seizure area. Many commentators, including proponents of the exclusionary sanction, recognize that the formulation of such rules by police departments, and the training necessary to implement these guidelines in practice, are perhaps the most effective means of protecting Fourth Amendment rights. See K. Davis, Discretionary Justice (1969); McGowan, \"Rule-Making and the Police,\" 70 Mich.L.Rev. 659 (1972); Amsterdam, \"Perspectives on the Fourth Amendment,\" 50 Minn.L.Rev. 349, 416-431 (1974).\n\n[ Illinois v. Gates, supra, 462 U.S. at 260-61 n. 15, 103 S. Ct. at 2344-45 n. 15, 76 L. Ed. 2d at 563 n. 15 (White, J., concurring).]\n\nIf a police officer acting in an objectively reasonable manner secures a warrant from a judge and in good faith believes he has complied with constitutional requirements, what more can we expect of him? Law-enforcement officers must constantly make judgments about whether there is probable cause to make an arrest.\n\nIs there reasonable ground to believe that a crime has been committed and that a particular suspect has committed it? Sometimes the historical facts are disputed or are otherwise in doubt. In other situations the facts may be clear so far as they are known, yet the question of probable cause remains. In still others there are special worries about the reliability of secondhand information such as that coming from informants. In any of these situations, which occur repeatedly, when the officer is convinced that he has probable cause to arrest he will very likely make the arrest. [ Stone v. Powell, supra, 428 U.S. at 538-39, 96 S. Ct. at 3073, 49 L. Ed. 2d at 1113 (White, J., dissenting).]\n\nIn most of these decisions, the police officer determines that there is sufficient probable cause to make an arrest. This is the case particularly when a warrant is issued and reviewed by an officer's superiors, as now required in New Jersey, and by a judge. Nevertheless, one need consider only the many difficulties the courts themselves have had in defining standards for what constitutes \"probable cause\" and the scope of the exclusionary rule to realize that there will be occasions when the police officer, his superiors, and the judge will guess wrong.\n\n[T]here will be those occasions where the trial or appellate court will disagree [with the police officer] on the issue of probable cause, no matter how reasonable the grounds for arrest appeared to the officer and though reasonable men could easily differ on the question. It also happens that after the events at issue have occurred, the law may change, dramatically or ever so slightly, but in any event sufficiently to require the trial judge to hold that there was not probable cause to make the arrest and to seize the evidence offered by the prosecution.\n\nIt is true that in such cases the courts have ultimately determined that in their view the officer was mistaken; but it is also true that in making constitutional judgments under the general language used in some parts of our Constitution, including the Fourth Amendment, there is much room for disagreement among judges, each of whom is convinced that both he and his colleagues are reasonable men. Surely when this Court divides five to four on issues of probable cause, it is not tenable to conclude that the officer was at fault or acted unreasonably in making the arrest.\n\n[ Stone v. Powell, supra, 428 U.S. at 539-40, 96 S. Ct. at 3073, 49 L. Ed. 2d at 1114 (White, J., dissenting).]\n\nIn such circumstances police officers have acted as reasonable officers would and should act, and as the public expects them to act. When it turns out that they have acted mistakenly, but in good faith and on reasonable grounds, the exclusion of such evidence cannot act as a deterrent. \"The officers, if they do their duty, will act in similar fashion in similar circumstances in the future. . . .\" Id. at 540, 96 S. Ct. at 3073, 49 L. Ed. 2d at 1114. In such cases, application of the exclusionary rule will result only in keeping relevant and probative evidence from the jury, thereby substantially impairing or aborting the trial.\n\nI do not share the fears of the opponents of the good faith exception that law-enforcement officers will lack necessary motivation to secure sufficient information to issue warrants for probable cause and that judges, in reviewing such warrants, will act as mere rubber stamps. A warrant from a judge is a safeguard designed to protect individual rights and insure that a reasonable basis for a search exists. See State v. Kasabucki, 52 N.J. 110, 115 (1968). It makes no sense to suggest that a police officer would deliberately appear before a judge with an\n\ninadequate affidavit, knowing that the warrant, even if granted in the first instance, might fail to withstand a later challenge before a second judge. Succinctly stated, the warrant requirement is based on the assumption that the judge will act properly and in so doing will cause law-enforcement authorities to act properly.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nI do not presume that either the law-enforcement officers or the judges of the State of New Jersey will abdicate their responsibility to apply the law. The \"Policy Statement of the Attorney General of New Jersey and County Prosecutors Association of New Jersey Regarding Prosecutorial Review of Search Warrant Applications,\" issued in February 1985, should dispel such concerns. The Policy Statement was issued after the Gates and Leon decisions, refuting any suggestion that these cases will reduce scrutiny of search warrants by law enforcement personnel.\n\nI think that the majority's fears of the good faith exception in this regard are unfounded. Nonetheless,\n\n[i]f it should emerge from experience that, contrary to our expectations, the good faith exception to the exclusionary rule results in a material change in police compliance with the Fourth Amendment, we shall have to reconsider what we have undertaken here. [ United States v. Leon, supra, 468 U.S. at 928, 104 S. Ct. at 3424, 82 L. Ed. 2d at 702 (Blackmun, J., concurring).]\n\nNo such change in police behavior has yet occurred. Until it does, I believe it is better to allow the admission of evidence seized by an officer acting with an objectively reasonable good\n\nfaith belief that his conduct satisfied constitutional requirements. In such a case, the deterrent effect of the exclusionary rule is \"so minimal, if not nonexistent, that the balance clearly favors the rule's modification.\" Illinois v. Gates, supra, 462 U.S. at 261, 103 S. Ct. at 2344, 76 L. Ed. at 563 (White, J., concurring).\n\nII\n\nThere are no independent state constitutional grounds to justify our divergence from federal law in this area. In fact, the \"divergence criteria\" developed in State v. Hunt, supra, 91 N.J. at 364-68 (Handler, J., concurring), and adopted in State v. Williams, 93 N.J. 39 (1983), offer compelling reasons why the good faith exception is consistent with New Jersey precedents, practice, and traditions. Furthermore, the underlying reasons expressed by the Court in Leon for adopting the good faith exception have long been part of New Jersey law.\n\nInitially, New Jersey courts were outspoken in their disregard for the exclusionary rule. From the rule's inception, we have recognized that its dominant purpose is to deter over-zealous law-enforcement officers from making unreasonable searches and seizures.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Nevertheless, the courts early recognized that the practical effect of the federal rule \"is not to punish the individual who has violated the constitutional provision by making an unreasonable search and seizure, but to shield the criminal and penalize the people of this state by suppressing evidence tending to prove an offense 'against its peace and dignity.'\" State v. Black, 5 N.J.Misc. 48, 50 (Quarter Sessions 1926). In Black, the court drew heavily from\n\nProfessor Wigmore's scathing criticism of the rule, which labeled the exclusionary remedy \"indirect and unnatural.\" According to Wigmore, \"Our [federal courts'] way of upholding the constitution is not to strike at the man who breaks it, but to let off somebody else who broke something else.\" 4 J. Wigmore, Evidence (2d ed.)  2183, 2184, 2259(b), 2264, quoted in Black, supra, 5 N.J. Misc. at 51. Since \"[t]he administration of the law in New Jersey has always been practical and never over-sensitive to shield an accused,\" id. at 52, the court in Black refused to adopt the \"new exception\" to the general rule of admissibility.\n\nThe rule of admissibility was thus firmly in place when the delegates to New Jersey's Constitutional Convention assembled in the summer of 1947. An amendment proposed at the Convention would have added the following sentence to Article I, paragraph 7:\n\nNothing obtained in violation hereof shall be received into evidence.\n\nThe delegates debated the merits of the exclusionary rule based on the federal experience, and defeated the proposed amendment by a final vote of 45 to 26. See 1 Convention Proceedings Record 598-608 (August 19, 1947). While the legislative history of the fourth amendment\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e is silent with respect to the exclusionary rule, the rule was specifically rejected by the Framers of the New Jersey Constitution. This is compelling evidence that the rule is not a part of our constitution but at most a judicial remedy.\n\nEven after Wolf v. Colorado, 338 U.S. 25, 69 S. Ct. 1359, 93 L. Ed. 1782 (1949), the Court rejected the exclusionary rule and continued to rely on the general rule of admissibility. In Eleuteri v. Richman, supra, 26 N.J. at 513, Chief Justice Weintraub, writing for a unanimous Court, emphasized that the dominant purpose of the rule is to deter unreasonable searches\n\nand seizures. We expressed the same concerns as those expressed by the Supreme Court in Leon about the high cost of the exclusionary rule:\n\nThe issue arises only when the evidence is incriminating and thus, in its immediate impact, the rule of exclusion benefits only the guilty. Unlike the extorted confession, to which an analogy is frequently drawn, the evidence illegally seized is not the fruit of official wrong; it is the criminal's own work product which could have been seized lawfully and used against him. If such evidence and \"the fruit of the poisonous tree\" are suppressed, \"The criminal is to go free because the constable has blundered.\" People v. Defore, 242 N.Y. 13, 150 N.E. 585, 587 (Ct.App.1926), certiorari denied, 270 U.S. 657, 46 S. Ct. 353, 70 L. Ed. 784 (1926). Two wrongs go unpunished at the expense of society. 8 Wigmore, supra,  2184, p. 40. Unlike the Federal Government for which the exclusionary rule was conceived, the states must contend with many more crimes of violence. The stakes are different.\n\n[26 N.J. at 512.]\n\nWe have long recognized that the exclusionary rule should be applied only in the presence of culpable police misconduct. See Eleuteri v. Richman, supra, 26 N.J. at 514 (\"It is one thing to condemn the product of an arrogant defiance of the Constitution; it is another to impose the sanction when the official intends to respect his oath of office but is found to be mistaken, let us say, by the margin of a single vote.\"); State v. Gerardo, 53 N.J. 261, 267 (1969) (holding that exclusion was not mandated by the fourth amendment since, \"important as it is in our society, [it] does not call for imposition of judicial sanctions where enforcing officers have followed the law with such punctilious regard as they have here\"); State v. Zito, 54 N.J. 206, 211, 213 (1969) (concluding that an officers' reliance on a statute providing that a person's inability to \"give a good account of himself\" is prima facie evidence of illegal purpose was not \"unreasonable\" within the meaning of the fourth amendment. \"Surely,\" the court noted, \"it is not arrogant of an officer to abide by the statutes of his State. On the contrary, it would be presumptuous of him to sit in constitutional judgment.\" In the circumstances the court found that suppression of the fruits \"would be a windfall to the criminal, and serve no laudable end. . . .\"); State v. Bisaccia, 58 N.J. 586, 589, 591 (1971) (a deliberately false judgment of acquittal\n\n\"debases the judicial process\" and breeds contempt for the deterrent thrust of the criminal law. \"To justify so serious an insult to the judicial process, some compensating gain should be incontestable.\" Moreover, we remained skeptical as to whether the rule has any genuine deterrent effect at all, but especially where, as in that case, the police had acted in good faith and \"without a trace of insolence.\").\n\nIn State v. Bruzzese, 94 N.J. 210 (1983), we recently reaffirmed that the touchstone of the fourth amendment is reasonableness. We held that a police officer's search and seizure would be considered reasonable only if it conformed to objectively reasonable police standards. This is the same test established by the Court in Leon. Likewise, in Bruzzese we emphasized that the application of an objective standard is necessary to safeguard the privacy rights of our citizens, since the \"requirement of reasonableness is not one without teeth.\" Id. at 226; see also State v. Guerra, 93 N.J. 146, 152 (1983) (\"[I]f the validity of a search can be sustained independently on objective grounds demonstrating reasonableness, the existence of other defects that do not derogate from the overall objective reasonableness of the search or impugn the integrity of the judicial process should not be relied upon to invalidate the search.\") (emphasis added).\n\nMoreover, we have recognized, as did the Court in Leon, that the reasonableness of a police officer's conduct is to be evaluated in a practical and realistic manner. We have long acknowledged the difficult problems law-enforcement officials face concerning probable cause and realized that\n\n[t]he officer's statements must be looked at in a common sense way without a grudging or negative attitude. There must be an awareness that few policemen have legal training and that the material submitted to demonstrate probable cause may not be described with the technical nicety one would expect of a member of the bar. Moreover, the judge should take into account the specialized experience and work-a-day knowledge of policemen. State v. Contursi, 44 N.J. 422, 431 (1965). The facts asserted must be tested by the practical considerations of everyday life on which reasonably prudent and experienced police officers act.\n\n[ State v. Kasabucki, supra, 52 N.J. at 117.]\n\nWe encourage police officers to seek warrants, since the review of a warrant by a neutral and detached judge offers a further safeguard to the public against unreasonable police action. As Justice Francis eloquently wrote in State v. Kasabucki, supra, 52 N.J. at 115-16:\n\nWhen the police officer does not rely on his own evaluation of facts, but submits them to the independent judgment of a judicial officer for a determination as to whether they add up to probable cause, a search pursuant to a warrant issued by a judge cannot be equated with \"insolence in office\" or abuse of the officer's police power, nor can it be said reasonably that the citizen's Fourth Amendment security rests only in the discretion of the police. Thus when the adequacy of the facts offered to show probable cause is challenged after a search made pursuant to a warrant, and their adequacy appears to be marginal, the doubt should ordinarily be resolved by sustaining the search. That is because the warrant provides clear evidence of the legitimacy of the officer's purpose. The decisions bespeak the preference accorded a search authorized after the facts and inferences therefrom have been subjected to neutral judicial consideration and found to constitute probable cause for it. [Citations omitted.]\n\nThe foregoing review of New Jersey case law demonstrates that New Jersey has no historical attachment to the exclusionary rule. In fact, the cases show that we have, in essence, long recognized a good faith exception to the exclusionary rule. Thus, I disagree with the majority that the exclusionary rule has been embedded in our jurisprudence for the last twenty-five years. Ante at 149.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nI do not think that the public or law-enforcement personnel will perceive that the Court is reducing its vigilance in protecting the state constitutional rights of an individual if a prosecutor\n\nis allowed to introduce evidence obtained by an officer acting in reasonable reliance on a search warrant issued by a neutral and detached judge, but ultimately found to be unsupported by probable cause. Indeed, unless the officer and the judge act in a reasonably objective matter, the evidence will be suppressed. In a sense, the good faith exception is a contest not between the state and the individual, but between two individuals -- one seeking protection against a police officer's overzealous conduct in conducting an unreasonable search and the other seeking a police officer's protection from criminal attack. I perceive that the public will view the good faith exception to the exclusionary rule as a sensible accommodation between protecting an individual's constitutional rights and punishing the guilty.\n\nIII\n\nWe turn now to an application of the good faith exception to this case. Whether the policeman's conduct here was that of an objectively reasonable policeman is a very close question. He was a new officer, drafting his first warrant, which was not reviewed by any of his superiors. He and another detective conducted an independent investigation for three hours. Certainly, under the present Policy Statement of the Attorney General and County Prosecutors Association of New Jersey, there would have to be an internal screening of the warrant by either the Attorney General's or the County Prosecutor's Staff. Moreover, considering the scope of the independent investigation done by the officers in Leon, there is serious question whether there was sufficient independent investigation in this case. Nevertheless, the courts below, as well as the majority, believe that the officer acted in good faith and in an objectively reasonable manner. I would abide by their decision and therefore reverse the judgment of the Appellate Division and permit introduction of the evidence under the good faith exception to the exclusionary rule. In the future, however, in the absence of a significant independent investigation and pre-application\n\nscreening, I would not hold similar conduct by a police officer to be objectively reasonable.\n\n\u003cspan class=\"fn\"\u003e1. For a discussion of several theories that have been proffered concerning the purpose of the exclusionary rule see Stewart, \"The Road to Mapp v. Ohio and Beyond: The Origins, Development and Future of the Exclusionary Rule in Search-and-Seizure Cases,\" 83 Colum.L.Rev. 1365, 1380-85 (1983), and Kamisar, \"Does (Did) (Should) the Exclusionary Rule Rest on a 'Principled Basis' Rather than an 'Empirical Proposition'?,\" 16 Creighton L.Rev. 565 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See Mertens \u0026 Wasserstrom, \"The Good Faith Exception to the Exclusionary Rule: Deregulating the Police and Derailing the Law,\" 70 Geo.L.J. 365, 365-66 \u0026 nn. 4-6 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., Wilkey, \"The Exclusionary Rule: Why Suppress Valid Evidence?,\" 62 Judicature 215 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The fourth amendment to the United States Constitution provides: The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated; and no Warrants shall issue but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized. Article I, paragraph 7 of the New Jersey Constitution provides: The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated; and no warrant shall issue except upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched and the papers and things to be seized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. See Kamisar, \"Gates, 'Probable Cause,' 'Good Faith,' and Beyond,\" 69 Iowa L.Rev. 551 (1984); Mascolo, \"Probable Cause Revisited: Some Disturbing Implications Emanating from Illinois v. Gates,\" 6 W. New Eng.L.Rev. 331 (1983); LaFave, \"Fourth Amendment Vagaries (of Improbable Cause, Imperceptible Plain View, Notorious Privacy, and Balancing Askew),\" 74 J. of Crim.L. \u0026 Criminology 1171 (1983); Livermore, \"The Draper-Spinelli Problem,\" 21 Ariz.L.Rev. 945 (1979); Rebell, \"The Undisclosed Informant and the Fourth Amendment: A Search for Meaningful Standards,\" 81 Yale L.J. 703 (1971); Note, \"Probable Cause and the First-Time Informer,\" 43 U. of Colo. L.Rev. 357 (1972); Mather, \"The Informer's Tip as Probable Cause for Search or Arrest,\" 54 Cornell L.Rev. 958 (1969); Comment, \"Informer's Word as the Basis for Probable Cause in the Federal Courts,\" 53 Calif.L.Rev. 840 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The question whether independent police investigation can also remedy a deficiency in the informant's \"basis of knowledge\" has been the subject of sharp academic debate. Maryland Appellate Judge Charles Moylan, an acknowledged fourth-amendment authority, concludes that police investigation is irrelevant to the informant's basis of knowledge: The \"basis of knowledge\" prong assumes an informant's \"veracity,\" and then proceeds to probe and test his conclusion: (\"What are the raw facts upon which the informant based his conclusion?\" \"How did the informant obtain those facts?\" \"What precisely did he see or hear or smell or touch firsthand?\" \"If he heard the facts from someone else, what makes that third person 'credible' and how did that third person come by the knowledge?\"). The judge must ascertain the source for the raw data -- the product of someone's senses -- and then weigh that data for himself. He is concerned not with that part of an affidavit or testimony which provides information about the informant but with the recitation of the story coming from the informant. [T]he \"independent verification\" technique cannot repair a defect in the \"basis of knowledge\" prong. Verifying the truth of part of a story does nothing either to ascertain the story's source or to check the informant's perhaps invalid conclusions. [ Stanley v. State, 19 Md.App. 507, , 313 A.2d 847, 861-62 (1974).] See 1 W. LaFave, Search and Seizure: A Treatise on the Fourth Amendment,  3.3(f) at 562 (1978); Illinois v. Gates, supra, 462 U.S. at 281-82, 103 S. Ct. at 2355, 76 L. Ed. 2d at 576-77 (Brennan, J., dissenting). But cf. id. at 270 n. 22, 103 S. Ct. at 2349-50 n. 22, 76 L. Ed. 2d at 569 n. 22 (White, J., concurring) (if police corroborate \"information from which it can be inferred that the informant's tip was grounded on inside information, this corroboration is sufficient to satisfy the basis of knowledge prong\" as well as the veracity prong); Kamisar, supra note 5, at 558 (\"I share Justice White's view that independent police corroboration can 'cure' a deficiency in either or both prongs.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Justice Stevens, dissenting, believed that the warrant was defective even under the newly-adopted totality-of-the-circumstances test. Id. at 291-94, 103 S. Ct. at 2360-62, 76 L. Ed. 2d at 582-85. Justices Brennan and Marshall dissented on the basis that repudiation of the Aguilar-Spinelli rules was unwise and unnecessary. 462 U.S. at 286-91, 103 S. Ct. at 2357-60, 76 L. Ed. 2d at 579-82. Justice White, concurring, believed that the warrant was valid under the Aguilar-Spinelli standard, which he thought should be clarified but not abandoned. Id. at 267-73, 103 S. Ct. at 2347-51, 76 L. Ed. 2d at 567-71.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This aspect of Gates was reaffirmed by the Court in Massachusetts v. Upton, 466 U.S. 727, 104 S. Ct. 2085, 80 L. Ed. 2d 721 (1984). The standard of review established in Gates and endorsed in Upton appears to contradict the Court's formulation in Ker v. California, 374 U.S. 23, 83 S. Ct. 1623, 10 L. Ed. 2d 726 (1963). Justice Clark, writing for the majority in Ker, approved de novo review when it is necessary to vindicate constitutionally-mandated standards: [T]he reasonableness of a search is in the first instance a substantive determination to be made by the trial court from the facts and circumstances of the case and in the light of the \"fundamental criteria\" laid down by the Fourth Amendment and in opinions of this Court applying that Amendment. Findings of reasonableness, of course, are respected only insofar as consistent with federal constitutional guarantees. As we have stated above and in other cases involving federal constitutional rights, findings of state courts are by no means insulated against examination here. While this Court does not sit as in nisi prius to appraise contradictory factual questions, it will, where necessary to the determination of constitutional rights, make an independent examination of the facts, the findings, and the record so that it can determine for itself whether in the decision as to reasonableness the fundamental -- i.e., constitutional -- criteria established by this Court have been respected. [ Id. at 33-34, 83 S. Ct. at 1629-30, 10 L. Ed. 2d at 738 (citations omitted).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The detective's affidavit is set forth verbatim in the opinion of the Appellate Division, 113 N.J. Super. 152, 154-55 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Attorney General cites the Ebron analysis for its similarity to the totality-of-the-circumstances test adopted in Illinois v. Gates, supra. To the extent that Ebron acknowledges that an informant's tip that neither discloses the basis of the informant's knowledge nor contains self-verifying detail can be supplemented by collateral facts to sustain a warrant, the holding in Ebron indeed resembles the analysis relied on by the Supreme Court's majority in Gates. We also acknowledged in Ebron that the propriety of supplementing an informant's tip that fails one or both prongs of Aguilar with corroborating details in an officer's affidavit was specifically recognized by the Court's opinion in Spinelli v. United States, supra, 393 U.S. at 418, 89 S. Ct. at 590, 21 L. Ed. 2d at 645.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The \"totality-of-the-circumstances\" test that we endorse and apply in this case is a principle of state constitutional law used to test determinations of probable cause pursuant to article I, paragraph 7 of the New Jersey Constitution. We assume that the application of this standard will be substantially consistent with the criteria set forth in Illinois v. Gates, supra, 462 U.S. at 238, 103 S. Ct. at 2332, 76 L. Ed. 2d at 548.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The affidavit at issue in this case is substantially less specific as to time than the affidavit construed in State v. Blaurock, 143 N.J. Super. 476 (App.Div.1976). In that case the Appellate Division refused to suppress evidence where the affidavit was challenged on \"staleness\" grounds. Relying on United States v. Harris, 482 F.2d 1115, 1119 (3d Cir.1973), and United States v. Johnson, 461 F.2d 285, 287 (10th Cir.1972), the court concluded that the question of the staleness of probable cause depends not merely on the recitation in the affidavit of particular dates and times, but upon a careful assessment of the nature of the allegedly unlawful activity. In reaching its conclusion, the court considered the fact that 18 days had passed between the last reported surveillance and the date of the affidavit to be inconsequential because the affidavit included a detailed description of the defendant's drug-related activities. Cf. Sgro v. United States, 287 U.S. 206, 210-11, 53 S. Ct. 138, 140, 77 L. Ed. 260, 263 (1932) (\"[I]t is manifest that the proof [of probable cause] must be of facts so closely related to the time of the issue of the warrant as to justify a finding of probable cause at that time. Whether the proof meets this test must be determined by the circumstances of each case.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. A lucid explanation of the role of police observations in supplementing an informant's allegations to establish probable cause is found in Stanley v. State, supra, 19 Md.App. at 528, 313 A.2d at 860: Such observations serve two purposes. They have a primary function, of course, bearing directly on the establishment of probable cause. When such observations are sufficient in themselves to demonstrate probable cause, the final problem is thereby solved and all information both from and about the informant becomes a redundancy; probable cause is established without necessary resort to the hearsay. Similarly, direct observations, insufficient unto themselves to establish probable cause, may nevertheless be added to trustworthy hearsay, which meets Aguilar's standards but is also insufficient unto itself, so that the combination of incriminatory elements may establish the probable cause which neither alone quite demonstrates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. \"Policy Statement of the Attorney General of New Jersey and the County Prosecutors Association of New Jersey Regarding Prosecutorial Review of Search Warrant Applications,\" New Jersey Prosecutors Manual, at 46-1 to 46-4 (February 1985). See discussion infra at 150-151.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In a companion case, Massachusetts v. Sheppard, 468 U.S. 981, 104 S. Ct. 3424, 82 L. Ed. 2d 737 (1984), the Court applied the good-faith exception to the exclusionary rule to overturn the suppression of evidence obtained pursuant to a search warrant that was \"technically\" defective because the issuing magistrate had made a clerical error in failing adequately to alter the form of the warrant. Justice Stevens, concurring in the judgment, maintained that the good-faith exception was not necessary to decide the case because it was clear that the warrant issued on probable cause and that the objects seized during the search were consistent with the limitations contained in the affidavit submitted in support of the warrant. Id. at 991, 104 S. Ct. at 3430, 82 L. Ed. 2d at 745 (citing United States v. Leon, supra, 468 U.S. at 963-66, 104 S. Ct. at 3448-50, 82 L. Ed. 2d at 725-27). Although the issue posed by Sheppard is not involved in this case, our Court Rules deal specifically with \"technically defective\" search warrants. See R. 3:5-7(g): \"In the absence of bad faith, no search or seizure made with a search warrant shall be deemed unlawful because of technical insufficiencies or irregularities in the warrant or in the papers or proceedings to obtain it, or in its execution.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. United States v. Cassity, 468 U.S. 1212, 104 S. Ct. 3581, 82 L. Ed. 2d 879 (1984); United States v. Tate, 468 U.S. 1206, 104 S. Ct. 3575, 82 L. Ed. 2d 873 (1984); United States v. Crozier, 468 U.S. 1206, 104 S. Ct. 3575, 82 L. Ed. 2d 873 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Recognizing that \"[m]any objections to a good-faith exception assume that the exception will turn on the subjective good-faith of individual officers,\" the Court emphasized that the standard of reasonableness adopted in Leon was an objective one. 468 U.S. at 919 n. 20, 104 S. Ct. at 3420 n. 20, 82 L. Ed. 2d at 696 n. 20. The Court added, \"The objective standard we adopt, moreover, requires officers to have a reasonable knowledge of what the law prohibits.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. But see United States v. Leon supra, 468 U.S. at 958-59, 104 S. Ct. at 3445-46, 82 L. Ed. 2d at 721-22 (Brennan, J., dissenting) (\"Given such a relaxed standard, it is virtually inconceivable that a reviewing court, when faced with a defendant's motion to suppress, could first find that a warrant was invalid under the new Gates standard, but then, at the same time, find that a police officer's reliance on such an invalid warrant was nevertheless \"objectively reasonable\" under the [Leon] test. Because the two standards overlap so completely, it is unlikely that a warrant could be found invalid under Gates and yet the police reliance upon it could be seen as objectively reasonable; otherwise, we would have to entertain the mind-boggling concept of objectively reasonable reliance upon an objectively unreasonable warrant.\" (citing Kamisar, supra note 5, at 588-89; Wasserstrom, \"The Incredible Shrinking Fourth Amendment,\" 21 Am.Crim.L.Rev. 257 (1984); LaFave, \"The Fourth Amendment in an Imperfect World: On Drawing 'Bright Lines' and 'Good Faith,'\" 43 U.Pitt.L.Rev. 307, 333-59 (1982)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. For an excellent discussion of the history and development of the exclusionary rule see Stewart, supra note 1, at 1372-92, and Mertens and Wasserstrom, supra note 2, at 373-89.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Boyd concerned a civil forfeiture proceeding in which the government, by subpoena, sought the production of invoices for goods in order to prove their quantity and value. The defendants complied with the subpoena but appealed the judgment on the ground that the compelled production violated their fourth and fifth-amendment rights. In an impassioned opinion, Justice Bradley emphasized that opposition to unreasonable searches was a primary cause of the effort to achieve independence from England: In order to ascertain the nature of the proceedings intended by the Fourth Amendment to the Constitution under the terms \"unreasonable searches and seizures,\" it is only necessary to recall the contemporary or then recent history of the controversies on the subject, both in this country and in England. The practice had obtained in the Colonies, of issuing writs of assistance to the revenue officers, empowering them, in their discretion, to search suspected places for smuggled goods, which James Otis pronounced \"the worst instrument of arbitrary power, the most destructive of English liberty and the fundamental principles of law, that ever was found in an English law book;\" since they placed \"the liberty of every man in the hands of every petty officer.\" This was in February, 1761, in Boston, and the famous debate in which it occurred was perhaps the most prominent event which inaugurated the resistance of the colonies to the oppressions of the mother country. \"Then and there,\" said John Adams, \"then and there was the first scene of the first act of opposition to the arbitrary claims of Great Britain. Then and there the child Independence was born.\" [116 U.S. at 624-25, 6 S. Ct. at 528-29, 29 L. Ed. at 749 (footnote omitted).] Justice Bradley referred to Lord Camden's famous opinion in Entick v. Carrington, State Trials, XIX, 1029 (1765), as the source of the principles embodied in the fourth amendment: The principles laid down in this opinion affect the very essence of constitutional liberty and security. They reach farther than the concrete form of the case then before the court, with its adventitious circumstances; they apply to all invasions, on the part of the Government and its employees, of the sanctity of a man's home and the privacies of life. It is not the breaking of his doors and the rummaging of his drawers that constitutes the essence of the offense; but it is the invasions of his indefeasible right of personal security, personal liberty and private property, where that right has never been forfeited by his conviction of some public offense; it is the invasion of this sacred right which underlies and constitutes the essence of Lord Camden's judgment. Breaking into a house and opening boxes and drawers are circumstances of aggravation; but any forcible and compulsory extortion of a man's own testimony or of his private papers to be used as evidence to convict him of crime or to forfeit his goods is within the condemnation of that judgment. In this regard the Fourth and Fifth Amendments run almost into each other. [116 U.S. at 630, 6 S. Ct. at 535, 29 L. Ed. at 751.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In its opinion in Weeks, the Court distinguished the Adams case on the ground that Weeks had applied for the return of his papers before trial. 232 U.S. at 396, 34 S. Ct. at 345-46, 58 L. Ed. at 657.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Wolf marked the first occasion that the Court advanced the rationale of deterrence as a basis for the exclusionary rule. 338 U.S. at 31, 69 S. Ct. at 1362-63, 93 L. Ed. at 1787.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In an appendix to the opinion, the Court included New Jersey among the states that had declined to follow Weeks. 338 U.S. at 33-39, 69 S. Ct. at 1364-67, 93 L. Ed. at 1788-91 (citing State v. Black, 5 N.J.Misc. 48 (Cty.Ct.1926)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In Rochin, the police officers used a stomach pump to recover two capsules of morphine that the defendant had swallowed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Although the Court in Mapp expressly rejected the reasoning in Wolf that the states were free to rely on \"equally effective\" methods other than the exclusionary rule to enforce the fourth amendment, members of the Court periodically endorse the possibility of alternative means to vindicate the constitutional guarantee. See Burger, C.J., dissenting in Bivens v. Six Unknown Narcotics Agents, supra, 403 U.S. at 421-24, 91 S. Ct. at 2017-19. 29 L. Ed. 2d at 641-43. This term in Malley v. Briggs, 475 U.S. 335, 106 S. Ct. 1092, 89 L. Ed. 2d 271 (1986), the Court upheld a  1983 civil-damage judgment against a state police officer who had obtained arrest warrants against plaintiffs without probable cause. For a discussion of this issue see Stewart, supra note 1, at 1385-89.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In his dissent in Leon, Justice Stevens noted that Illinois v. Gates was decided after the Ninth Circuit held that the Leon warrant lacked probable cause and that it was \"probable, though admittedly not certain, that the Court of Appeals would now conclude that the warrant in Leon satisfied the Fourth Amendment if it were given the opportunity to reconsider the issue in the light of Gates.\" 468 U.S. at 961, 104 S. Ct. at 3447, 82 L. Ed. 2d at 724. See Wasserstrom \u0026 Mertens, \"The Exclusionary Rule on the Scaffold; But Was it a Fair Trial?,\" 22 Amer.Crim.L.Rev. 85, 98 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. For a general discussion of the genesis of the fourth amendment see J. Landynski, Search and Seizure and the Supreme Court, 19-48 (1966), and N. Lasson, \"The History and Development of the Fourth Amendment to the United States Constitution,\" 55 Johns Hopkins University Studies in Historical and Political Science No. 2, 13-78 (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. One of the reasons for convening the Constitutional Convention in 1844 was the lack of a comprehensive bill of rights in the 1776 Constitution. The absence of a bill of rights has been attributed to the fact that New Jersey's was one of the earliest State Constitutions and was written in some haste: New Jersey was the third colony to adopt a constitution. The document was necessarily drawn in haste and practically without the benefit of earlier state constitutions to serve as models. It is assumed that this brief constitution was largely the work of one man; although there is dispute as to which member of the drafting committee of ten he was. In any event, the constitution became the law of the \"colony\" by vote of the provincial congress only eight days after the appointment of the committee. This haste may have been due partly to the arrival of the British fleet off Sandy Hook. [Proceedings of the New Jersey State Constitutional Convention of 1844, pp. x and xiii (footnote omitted).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The opinion in Valentin notes that the prosecutor's failure to offer evidence as to the circumstances of the search was in reliance \"on the long established rule in New Jersey\" that evidence was admissible irrespective of the legality of the search. 36 N.J. at 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Justice Garibaldi's dissenting opinion cites a number of post- Mapp cases, post at 184-85, for the proposition that \"New Jersey has no historical attachment to the exclusionary rule\" and that \"we have, in essence, long recognized a good-faith exception to the exclusionary rule.\" Post at 186. Each of these cases was decided on the basis of factors collateral to the exclusionary rule. In State v. Gerardo, 53 N.J. 261 (1969), the evidence in issue was obtained by federal authorities pursuant to duly issued search warrants but the federal prosecutions were dismissed on the basis that the fifth-amendment privilege against self-incrimination precluded prosecution under the federal wagering statute for failure to register before engaging in the business of gambling. Defendants sought suppression of the evidence in a state prosecution for violating the lottery laws. The issue was whether the dismissal of the federal indictment, in anticipation of which the search warrant had issued, barred the use of the evidence in the state prosecution. The Court affirmed the denial of the suppression motion. State v. Zito, 54 N.J. 206 (1969), concerned the validity of a warrantless search pursuant to an arrest in reliance on a statute challenged as unconstitutional. The Court held the statute to be valid and also concluded that the police had grounds independent of the statute for arresting the defendant. The applicability of the exclusionary rule was not an issue. State v. Bisaccia, 58 N.J. 586 (1971), involved a search pursuant to a warrant where both the warrant and affidavit incorrectly stated the address of the place to be searched as 371 rather than 375 10th Street. However, the affidavit in support of the warrant contained a detailed description of the sign on the front of the building. The issue did not concern our recognition of the exclusionary rule but rather the propriety of the officer's reliance on his affidavit in executing the warrant. State v. Bruzzese, 94 N.J. 210 (1983), cert. denied, 465 U.S. 1030, 104 S. Ct. 1295, 79 L. Ed. 2d 695 (1984), concerned the objective reasonableness of a warrantless search and did not involve New Jersey's recognition of the exclusionary rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Supra note 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Letter dated July 10, 1986, from Donald R. Belsole, First Assistant Attorney General, to Stephen W. Townsend, Clerk, New Jersey Supreme Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In his dissenting opinion in Leon, Justice Brennan emphasized that statistical studies on a national basis also suggest that the \"costs\" of the exclusionary rule are minimal: [I]ndeed, as the Court acknowledges, recent studies have demonstrated that the \"costs\" of the exclusionary rule -- calculated in terms of dropped prosecutions and lost convictions -- are quite low. Contrary to the claims of the rule's critics that exclusion leads to \"the release of countless guilty criminals,\" Bivens v Six Unknown Federal Narcotics Officers, 403 U.S. 388, 416, 29 L Ed 2d 619, 91 S Ct 1999 [2014] (Burger, C.J., dissenting), these studies have demonstrated that federal and state prosecutors very rarely drop cases because of potential search and seizure problems. For example, a 1979 study prepared at the request of Congress by the General Accounting Office reported that only 0.4% of all cases actually declined for prosecution by federal prosecutors were declined primarily because of illegal search problems. Report of the Comptroller General of the United States, Impact of the Exclusionary Rule on Federal Criminal Prosecutions 14 (1979). If the GAO data are restated as a percentage of all arrests, the study shows that only 0.2% of all felony arrests are declined for prosecution because of potential exclusionary rule problems. See Davies, A Hard Look at What We Know (and Still Need to Learn) About the \"Costs\" of the Exclusionary Rule: The NIJ Study and Other Studies of \"Lost\" Arrests, 1983 Am. Bar Found.Res.J. 611, 635. Of course, these data describe only the costs attributable to the exclusion of evidence in all cases; the costs due to the exclusion of evidence in the narrower category of cases where police have made objectively reasonable mistakes must necessarily be even smaller. The Court, however, ignores this distinction and mistakenly weighs the aggregated costs of exclusion in all cases, irrespective of the circumstances that led to exclusion against the potential benefits associated with only those cases in which evidence is excluded because police reasonably but mistakenly believe that their conduct does not violate the Fourth Amendment. When such faulty scales are used, it is little wonder that the balance tips in favor of restricting the application of the rule. [ United States v. Leon, supra, 468 U.S. at 950-51, 104 S. Ct. at 3441-42, 82 L. Ed. 2d at 716-17 (Brennan, J., dissenting).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Counsel have been furnished a copy of this report and were afforded an opportunity to comment on its findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. See Dripps, \"Living with Leon,\" 95 Yale L.J. 906 n.5 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Other commentators have expressed similar concerns. See Wasserstrom \u0026 Mertens, supra note 26, at 109-10, 114-15; Kamisar, supra note 1, at 662-63.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. It should be noted that Justice White assumes that the application of the exclusionary rule in deportation proceedings would nevertheless be accompanied by a good-faith exception.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Compare McFarland v. State, 284 Ark. 533, , 684 S.W. 2d 233, 243 (1985) (adopting modification to exclusionary rule as set forth in Leon); McCary v. Commonwealth, 228 Va. 219, 231-33, 321 S.E. 2d 637, 644 (1984) (\"embracing\" the good-faith exception announced in Leon); State v. Bolt, 142 Ariz. 260, 269, 689 P. 2d 519, 528 (1984) (holding that \"exclusionary rule to be applied as a matter of state law is no broader than the federal rule\"); State v. Welch, 316 N.C. 578, 588-89, 342 S.E. 2d 789, 795 (1986) (declining \"to apply exclusionary rule to good-faith violation of the fourth amendment\" where search warrant was required but police officer reasonably relied on court order authorizing seizure of blood sample); People v. Stewart, 104 Ill. 2d 463, 477-79, 85 Ill.Dec. 422, 428, 473 N.E. 2d 1227, 1233 (1984) (dictum) (warrants found valid, but court concluding that even assuming defect in affidavits, FBI agents' reasonable and good-faith belief that a search was authorized would \"insulate\" the searches from a suppression motion), cert. denied, 471 U.S. 1120, 105 S. Ct. 2368, 86 L. Ed. 2d 267 (1985); Blalock v. State, Ind. , , 483 N.E. 2d 439, 444 (1985) (dictum) (court finding probable cause exists but concluding that even if affidavit found deficient, the good-faith exception articulated in Leon would render evidence admissible); and State v. Sweeney, 701 S.W. 2d 420, 426 (Mo.1985) (dictum) (assuming arguendo that search warrant was invalid, the exclusionary rule would not bar the introduction of evidence seized by officers who reasonably relied on warrant issued by detached and neutral judge), with People v. Sundling, 153 Mich.App. 277, 290-91, 395 N.W. 2d 308, 314 (Mich.Ct.App.1986) (refusing to incorporate the good-faith exception into the Michigan constitution on the ground that it would render the probable-cause requirement \"a nullity\"); People v. Bigelow, 66 N.Y. 2d 417, 488 N.E. 2d 451, 458, 497 N.Y.S. 2d 630, 637 (1985) (declining to adopt good-faith exception on state constitutional grounds because \"if the People are permitted to use the seized evidence, the exclusionary rule's purpose is completely frustrated, a premium is placed on illegal police action and a positive incentive is provided to others to engage in similar lawless acts in the future\"); Commonwealth v. Upton, 394 Mass. 363, 368-71 and n.5, 476 N.E. 2d 548, 553-54 and n.5 (1985) (discussing Leon but concluding that state statutes bar any judicial consideration of admitting evidence seized pursuant to search warrant issued in the absence of probable cause); and State v. Grawien, 123 Wis. 2d 428, 430-33, 367 N.W. 2d 816, 817-18 (Ct.App.1985) (adopting a good-faith exception to the exclusionary rule would be violative of state constitutional jurisprudence); see also Stringer v. State, Miss. , , 491 So. 2d 837, 841-51 (1986) (where Justice Robertson, concurring, rejects Leon on state constitutional grounds, maintaining that where State fails to establish probable cause under the Illinois v. Gates analysis, the objects seized by virtue of the authority conferred by the search warrant may not be received into evidence).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Our colleague, Justice Handler, argues that we should not \"metamorphose * * * the exclusionary rule from a common-law doctrine into a constitutional right\" since to do so \"effectively forecloses the possibility of alternative approaches that might serve to enforce the basic constitutional right.\" Post at 170. We would first observe that the application of the exclusionary rule in New Jersey has never been based on common-law doctrine. Rather, it was mandated by the decision in Mapp v. Ohio, supra, 367 U.S. 643, 657, 81 S. Ct. 1684, 1692-93, 6 L. Ed. 2d 1081, 1091, holding that \"the exclusionary rule is an essential part of the Fourth and Fourteenth Amendments\" and thus enforceable against the states through the due process clause. Until today the fourth amendment, applied to the states by the Mapp decision, has been the source of New Jersey's exclusionary rule. Because the Court in Leon has diluted the rule by recognizing the good-faith exception, New Jersey's continued application of the exclusionary rule unmodified by the good-faith exception requires a source independent of the fourth amendment. Our holding that the rule is an \"integral element of our state-constitutional guarantee that search warrants will not issue without probable cause,\" supra at 157, is nothing more than a candid acknowledgment of the lessons of one hundred years of fourth-amendment jurisprudence beginning with Boyd v. United States, supra, 116 U.S. 616, 6 S. Ct. 524, 29 L. Ed. 746. Justice Handler's suggestion that we adopt the exclusionary rule as a common-law principle so as not to \"foreclose the possibility of alternative approaches\" raises the issue that divided the Court in Wolf v. Colorado, supra, 338 U.S. 25, 69 S. Ct. 1359, 93 L. Ed. 1782. There, the Court left the states free to rely on other methods to enforce the fourth amendment that \"would be equally effective,\" id. at 31, 69 S. Ct. at 1363, 93 L. Ed. at 1787, ignoring Justice Murphy's admonition that \"there is but one alternative to the rule of exclusion. That is no sanction at all.\" Id. at 41, 69 S. Ct. at 1369, 93 L. Ed. at 1793. In Mapp, the Court, reconsidering the issue, recognized that \"[t]he experience of California that such other remedies have been worthless and futile is buttressed by the experience of other States,\" and concluded that the exclusionary rule is the only satisfactory remedy to vindicate fourth-amendment interests. 367 U.S. at 652-54, 81 S. Ct. at 1690-91, 6 L. Ed. 2d at 1088-90. This view was persuasively endorsed by Justice Potter Stewart: Taken together, the currently available alternatives to the exclusionary rule satisfactorily achieve some, but not all, of the necessary functions of a remedial measure. They punish and perhaps deter the grossest of violations, as well as governmental policies that legitimate these violations. They compensate some of the victims of the most egregious violations. But they do little, if anything, to reduce the likelihood of the vast majority of fourth amendment violations -- the frequent infringements motivated by commendable zeal, not commendable malice. For those violations, a remedy is required that inspires the police officer to channel his enthusiasm to apprehend a criminal toward the need to comply with the dictates of the fourth amendment. There is only one such remedy -- the exclusion of illegally obtained evidence. [Stewart, supra, 83 Colum.L.Rev. at 1388-89.] Accordingly, we view our conclusion that the exclusionary rule is an integral element of the citizen's freedom from unreasonable searches as reflecting the overwhelming weight of the experience of federal and state courts in attempting to enforce the rights guaranteed by the fourth amendment. Nevertheless, the application of a constitutional principle need not be immutable. Although our concurring colleague perceives it as \"paradoxical,\" post at 170 n.3, we acknowledge the obligation of the judiciary to evaluate carefully the effect of any legislative or executive initiative intended to afford a source of enforcement distinct from or supplementary to the exclusionary rule. Cf. Miranda v. Arizona, 384 U.S. 436, 467, 86 S. Ct. 1602, 1624, 16 L. Ed. 2d 694, 720 (1966) (\"Our decision in no way creates a constitutional straitjacket which will handicap sound efforts at reform, nor is it intended to have this effect. We encourage Congress and the States to continue their laudable search for increasingly effective ways of protecting the rights of the individual * * *.\"). The fact that no effective alternative has yet been developed, either at the federal or state level, is what impels our conclusion today that the exclusionary rule is required to enforce the guarantee against unreasonable searches and seizures secured by our State Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. It is noteworthy that, in terms of the fourth amendment, since Mapp the scope of the exclusionary rule has steadily shrunk. See, e.g., Alderman v. United States, 394 U.S. 165, 174-75, 89 S. Ct. 961, 967, 22 L. Ed. 2d 176, 187 (1969) (defendants whose fourth-amendment rights had not been violated did not have standing to object to evidence obtained in violation of the rights of others; application of the exclusionary rule should depend on a cost-benefit analysis); United States v. Calandra, 414 U.S. 338, 351, 94 S. Ct. 613, 621, 38 L. Ed. 2d 561, 573 (1984) (grand-jury witness could not invoke the rule to refuse to answer questions based on evidence seized pursuant to a defective search warrant; the purpose of the rule \"is not to redress the injury to the privacy of the search victim [but rather] to deter future unlawful police conduct.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The text of the fourth amendment to the United States Constitution and Article I, paragraph 7 of the New Jersey Constitution are nearly identical. Neither contains any reference to the exclusionary rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We can appropriately consider the exclusionary rule to have become a part of what one commentator labels the \"constitutional common law,\" \"a substructure of substantive, procedural and remedial rules drawing their inspiration and authority from, but not required by, various constitutional provisions [, rules that are] . . . subject to amendment, modification or even reversal by [the legislature].\" Monaghan, \"Forward: Constitutional Common Law,\" 89 Harv.L.Rev. 1, 2-3 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Paradoxically, the majority professes a willingness to \"evaluate carefully\" any legislative attempt to develop remedies to preserve the constitutional right. This may imply that if the Legislature ultimately develops a suitable and effective alternative to the exclusionary rule, then this Court has the power to modify or even abandon the rule that it now claims is \"constitutional.\" Ante at 157, n. 39. This proposition undermines, if it does not directly contradict, the view that the exclusionary rule has attained the permanence of a constitutional right. The majority, in effect, recognizes the intrinsic nature of the exclusionary rule as a court-crafted remedy designed to deter improper official conduct, and impliedly acknowledges that the remedy can expand or contract in light of changing perceptions of the kind of conduct to which it should be applied. These considerations, I suggest, support the proposition that the exclusionary rule, while it serves a constitutional right, itself is not a constitutional right, but a common-law doctrine, which is always amenable to change and subject to legislative and executive attention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. That statute expressly provides for suppression of evidence derived from any intercepted wire or oral communication if the interception was unauthorized or inconsistent with the statute, or if the order of authorization was insufficient. N.J.S.A. 2A:156A-21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This position was substantially affirmed in State v. Catania, 85 N.J. 418 (1981), in which the Court stressed that the Legislature has enacted a strict remedy for failure on the part of police officers to minimize the scope of a wiretap -- the exclusionary rule. Catania further overruled the earlier case of State v. Dye, 60 N.J. 518 (1972), which had determined that the legislative exclusionary rule should be given a narrow rather than broad interpretation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The common thread supporting these proposals is that \"[t]he task of overseeing and remedying Bill of Rights violations ultimately is a legislative one, and no legal obstacle exists today to prevent the rule's legislative repeal or modification.\" Gangi, The Exclusionary Rule: A Case Study in Judicial Usurpation, supra, 34 Drake L.Rev. at 35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Empirical data on the effects of the exclusionary rule on the disposition of felony warrants are inconclusive. See United States v. Leon, supra, 468 U.S. at 907-08 n. 6, 104 S. Ct. at 3413 n. 6, 82 L. Ed. 2d at 688 n. 6; 468 U.S. at 949-52, 104 S. Ct. at 3441-42, 82 L. Ed. 2d at 716-17 (Brennan, J., dissenting). A survey conducted by the Administrative Office of the Courts with respect to suppression motions in ten New Jersey counties during the six-month period of December 1, 1985, to May 31, 1986 discloses that during this period, 80% of the 1082 motions filed involved controlled dangerous substances and 10% involved weapons. Of all the motions filed, 540 or roughly half were disposed of in the following manner: 49% were withdrawn (usually after a plea that mooted the suppression issue); 40% were denied; 4% were dismissed; and 7% were granted (all of which involved searches made without a warrant). The evidence seized in these cases included controlled dangerous substances in 75% of the cases, weapons in 17.1%, and alcohol in the remaining 7.3%. The study suggests that of the estimated 4,500 motions filed in New Jersey annually, approximately 300 are granted. The study also analyzed the granted motions in five of the ten counties for an additional six-month period and in two of the counties for an additional one-year period. Only one of the 44 suppression motions that were granted during this period involved a search made pursuant to a warrant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The survey conducted by the Administrative Office of the Courts regarding suppression motions, supra at 177 n.1, supports the assumption that judges, in reviewing and granting search warrants, are effectively protecting the constitutional rights of private citizens. The study examined the files on 82 suppression motions that were granted. Only one of these cases involved a search executed with a warrant. The majority interprets these statistics to indicate that the exclusionary rule \"poses no significant threat to law-enforcement efforts\" Ante at 152. I interpret these statistics to indicate that judges are acting properly in reviewing search warrant applications. Under such circumstances there is no reason to think that a good faith exception will encourage judges to ignore the law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. For recent cases reaffirming this principle, see Delguidice v. New Jersey Racing Comm., 100 N.J. 79, 85 (1985) (\"Deterrence of future unlawful police conduct is the 'prime purpose' of the exclusionary rule, 'if not the sole one,'\" quoting Immigration and Naturalization Serv. v. Lopez-Mendoza, 468 U.S. 1032, 104 S. Ct. 3479, 82 L. Ed. 2d 778 (1984); State v. Burstein, 85 N.J. 394, 406 (1981) (the exclusionary rule is \"meant solely to deter illegal police conduct\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The text of the fourth amendment and Article I, paragraph 7, of the New Jersey Constitution are nearly identical. Neither contains any reference to the exclusionary rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. State v. Macri, 39 N.J. 250 (1963), and State v. Valentin, 36 N.J. 41 (1961), are cited by the majority as support for this position. In State v. Macri, Justice Weintraub, in his concurring opinion, pointed out that the affidavit was so palpably devoid of any basis for evaluation that the magistrate's order was no more than a rubber stamp of the police officer's action. Hence, the good faith exception would not be applicable. In State v. Valentin, we remanded the case for reconsideration of a motion to suppress a shotgun recovered in a warrantless search so that the prosecutor who had not submitted proof respecting the circumstances surrounding the search and seizure could do so, because \"whether a particular search and seizure are unreasonable depends upon the circumstances under which the police officers acted.\" Id. at 43.\u003c/span\u003e\n\n",
    "body_length": 216695,
    "citedas": [
      "519 A.2d 820",
      "105 N.J. 95"
    ],
    "attorneys": "James E. Flynn, First Assistant Prosecutor, argued the cause for appellant (Harold J. Ruvoldt, Jr., Hudson County Prosecutor, attorney). Joseph Charles argued the cause for respondent (Ashley and Charles, attorneys). Allan J. Nodes, Deputy Attorney General, argued the cause for amicus curiae Attorney General of New Jersey (W. Cary Edwards, Jr., Attorney General, attorney). Anderson D. Harkov, Assistant Deputy Public Defender, argued the cause for amicus curiae Office of the Public Defender of New Jersey (Thomas S. Smith, Jr., Acting Public Defender, attorney). Jeffrey E. Fogel, Executive Director, submitted a brief on behalf of amicus curiae American Civil Liberties Union of New Jersey. Joseph A. Hayden, Jr., submitted a brief on behalf of amicus curiae Association Criminal Defense Lawyers of New Jersey (Joseph A. Hayden, Jr., attorney; Harvey Weissbard and Judith Margulies Katz, on the brief).",
    "category": [
      "36",
      "75"
    ],
    "judges": "For affirmance -- Chief Justice Wilentz, and Justices Clifford, Handler, Pollock, O'Hern and Stein. Concurring in part and dissenting in part -- Justice Garibaldi. The opinion of the Court was delivered by Stein, J. Handler, J., concurring. Garibaldi, J., concurring in part and dissenting in part.",
    "citation_count": 218
  }
}
