{
  "id": "K4TQPmYBTlTomsSBTnkd",
  "document": {
    "title": "United States v. Branch",
    "full_title": "UNITED STATES OF AMERICA v. BRAD EUGENE BRANCH, KEVIN WHITECLIFF, JAIME CASTILLO, RENOS LENNY AVRAAM, PAUL FATTA AND GRAEME LEONARD CRADDOCK .",
    "jurisdiction": "Fifth Circuit",
    "date": "1996-08-02T00:00:00.000Z",
    "docket": "No. 94-50437",
    "body": "HIGGINBOTHAM, Circuit Judge:\n\nThis is an appeal of six defendants convicted of federal crimes for their role in the dramatic and tragic events at Mount Carmel outside Waco, Texas during the early months of 1993. A firefight erupted when federal agents from the Bureau of Alcohol, Tobacco, and Firearms attempted to execute a search and arrest warrant on February 28, 1993. Four agents and three residents of the compound lost their lives. Each defendant now challenges his conviction and sentence.\n\nI.\n\nThe Branch Davidians are a 65-year-old sect originally affiliated with the Seventh Day Adventist Church. Their faith urges a life of Bible study with emphasis on an imminent, apocalyptic confrontation between the Davidians and the \"beast\". The group's leader, Vernon Howell, instructed members to arm themselves in preparation for the final battle. Howell changed his name to David Koresh in 1990 and preached that \"if you can't kill for God, you can't die for God.\" He told his followers that the \"beast\" included the U.S. Government and, specifically, the ATF.\n\nKoresh and other Davidians stockpiled weapons and ammunition. They fortified the compound called Mount Carmel, building a two-foot high concrete barrier and an underground bunker. Koresh used \"Bible studies\" to instruct the residents in the use of firearms. In short, the Davidians turned Mount Carmel into a small fortress.\n\nThe ATF discovered that the Davidians had amassed weapons, including fully automatic machineguns and hand grenades. On February 25, 1993, ATF agents obtained an arrest warrant for Koresh and a search warrant for the Mount Carmel compound.\n\nThe ATF decided to execute the search and arrest warrant on February 28, 1993, but, as it was to learn, the element of surprise had been lost. Around 8:00 A.M., an undercover ATF agent, Roberto Rodriguez, visited the Davidian compound and spoke with Koresh. During the conversation, Koresh took a phone call. When he returned, a visibly shaken Koresh told Rodriguez, \"Robert, neither the AFT or National Guard will ever get me. They got me once, they'll never get me again.\" Koresh then walked over to the windows and looked toward the farmhouse used by the undercover ATF agents. He turned to Rodriguez and said, \"They're coming, Robert. The time has come.\" Rodriguez left the compound around 9:00 A.M. and advised the ATF that Koresh had learned of the raid at least forty-five minutes earlier. The ATF decided to proceed with the arrest and search warrants.\n\nWhen the ATF's decision to continue was made, approximately 115 men, women, and children, ranging in age from 6 months to 70 years, resided at Mount Carmel. The ATF plan called for ATF agents, who were transported to the compound in two cattle trailers, to quickly unload and encircle the compound, while National Guard helicopters conducted a diversionary raid on the rear of the Mount Carmel compound.\n\nThe plan quickly went awry. The helicopters did not arrive until after the ATF agents had begun unloading from the cattle trailers. As the agents unloaded, gunfire erupted from the compound. The agents returned fire. In the ensuing gunbattle, four agents and three Davidians were killed. Twenty-two ATF agents and four Davidians were wounded.\n\nThe FBI then surrounded the compound, and, for 51 days, law enforcement and the Davidians were at a stand-off. During the stand-off, approximately 30 Davidians left the compound and were taken into custody. On April 19, FBI agents attempted to end the stand-off by flooding the compound with gas, but the Davidians did not leave. Around noon, the Davidians set the compound on fire. Seventy-five of the remaining 84 occupants perished in the blaze.\n\nOn August 3, 1993, a grand jury returned a superseding 10-count indictment against twelve of the surviving Davidians. The counts relevant to this appeal are:\n\nCount 1: From on or before February 19, 1992, to April 19, 1993, conspiracy to murder federal officers and employees engaged in the performance of their official duties in violation of 18 U.S.C. § 1117.\n\nCount 2: On or about February 28, 1993, aiding and abetting the murder of four agents of the Bureau of Alcohol, Tobacco \u0026 Firearms (ATF) while said agents were engaged in the performance of their official duties, in violation of 18 U.S.C. §§ 1111(a), 1114 and 18 U.S.C. § 2.\n\nCount 3: On or about February 28, 1993, using or carrying of a firearm during and in relation to a crime of violence, to wit, Count 1, in violation of 18 U.S.C. § 924(c)(1).\n\nCount 7: On or about April 19, 1993, knowing and unlawful possession of a firearm, namely an explosive grenade, in violation of 26 U.S.C. § 5861(d).\n\nCount 9: From on or about February 19, 1992 to February 1993, a conspiracy to unlawfully manufacture and possess machineguns in violation of 18 U.S.C. § 371 and 18 U.S.C. § 922(o).\n\nCount 10: In February 1992 to February 19, 1993, aiding and abetting in the unlawful possession of machineguns in violation of 18 U.S.C. §§ 2, 922(o).\n\nThe Government dismissed the charges against one of the twelve Davidians, Kathryn Schroeder, pursuant to a plea bargain. After a jury trial lasting nearly two months, the jury acquitted four of the Davidians on all counts on which they were charged. The jury also acquitted all eleven of the Davidians on Count 1, which alleged a conspiracy to murder federal agents. However, the jury found seven of the Davidians, Renos Avraam, Brad Branch, Jaime Castillo, Graeme Craddock, Livingstone Fagan, Ruth Riddle, and Kevin Whitecliff, guilty on Count 3 for using or carrying a firearm during a crime of violence. The jury acquitted all eleven of the defendants on Count 2 for aiding and abetting the murder of federal agents but convicted Avraam, Branch, Castillo, Fagan, and Whitecliff on the lesser-included offense of aiding and abetting the voluntary manslaughter of federal agents. Finally, the jury convicted Craddock on Count 7 for unlawful possession of a hand grenade and convicted Paul Fatta on Counts 9 and 10 for conspiring to manufacture and possess machineguns and for aiding and abetting the unlawful possession of machineguns, respectively.\n\nThe district court sentenced the defendants to prison terms ranging from 15 to 40 years, along with fines and restitution. Six of the eight Davidians are now before us, appealing both their convictions and sentences. They have raised a host of contentions. We first address the constitutionality of Fatta's firearms convictions. We then turn to the arguments concerning the jury instructions and the district court's conduct of the trial. We then address the sufficiency of the evidence. Finally, we review the sentences imposed by the district court.\n\nII.\n\nThe jury convicted Fatta of conspiring to unlawfully manufacture and possess machineguns (Count 9) and aiding and abetting the unlawful possession of machineguns (Count 10), both in violation of 18 U.S.C. § 922(o). On the eve of trial, Fatta moved to dismiss the indictment on both counts. He argued that § 922(o) exceeded Congress' powers under the Commerce Clause. The district court disagreed, noting that several other circuits had upheld the constitutionality of § 922(o). See United States v. Hale, 978 F.2d 1016 (8th Cir. 1992), cert. denied, 507 U.S. 997, 123 L. Ed. 2d 174, 113 S. Ct. 1614 (1993); United States v. Evans, 928 F.2d 858 (9th Cir. 1991). We review de novo the district court's ruling.\n\n18 U.S.C. § 922(o) prohibits, subject to two, narrow exceptions not relevant here, any person from transferring or possessing a machinegun. There is no requirement that the machinegun have been in interstate commerce. Subsequent to the district court's ruling, we held in United States v. Kirk, 70 F.3d 791 (5th Cir. 1995), that § 922(o) did not exceed Congress' power under the Commerce Clause. That panel decision has been vacated, and the case is currently pending before the en banc court. 78 F.3d 160 (5th Cir. 1996).\n\nThe en banc court's resolution of this issue will govern the ultimate validity of Fatta's convictions on Counts 9 and 10. Under pre-Kirk caselaw now binding this panel, we must reject this contention. We will, however, hold the mandate pending decision in Kirk.\n\nIII.\n\nThe district court instructed the jury that to convict the defendants of murder under Count 2, it had to find beyond a reasonable doubt that \"the Defendant under consideration did not act in self-defense or defense of another.\" The court explained self-defense and the defense of another, and then turned to the lesser-included offense of voluntary manslaughter.\n\nAvraam, Branch, Castillo, and Whitecliff argue that self-defense is also a defense to voluntary manslaughter. The Davidians requested an instruction to that effect and objected at the charge conference to its omission.\n\nA.\n\nWe review the district court's refusal to give the proposed instruction for abuse of discretion. United States v. Correa-Ventura, 6 F.3d 1070, 1076 (5th Cir. 1993). \"As a general proposition a defendant is entitled to an instruction as to any recognized defense for which there exists evidence sufficient for a reasonable jury to find in his favor,\" Mathews v. United States, 485 U.S. 58, 63, 99 L. Ed. 2d 54, 108 S. Ct. 883 (1988), and we presume an abuse of discretion \"where the district court 'refuses a charge on a defense theory for which there is an evidentiary foundation and which, if believed by the jury, would be legally sufficient to render the accused innocent.\" Id. (quoting United States v. Rubio, 834 F.2d 442, 446 (5th Cir. 1987)). The court may, however, refuse to give a requested instruction that lacks sufficient foundation in the evidence. United States v. Tannehill, 49 F.3d 1049, 1057 (5th Cir.), cert. denied, 133 L. Ed. 2d 109, 116 S. Ct. 167 (1995).\n\nWe review the record cognizant that the \"merest scintilla of evidence\" in the defendant's favor does not warrant a jury instruction regarding an affirmative defense for which the defendant bears the initial burden of production. United States v. Jackson, 726 F.2d 1466, 1468 (9th Cir. 1984). Under Mathews, there must be \"evidence sufficient for a reasonable jury to find in [the defendant's] favor.\" We have insisted that the evidence be sufficient to raise a factual question for a reasonable jury. See United States v. Lucien, 61 F.3d 366, 374-77 (5th Cir. 1995); United States v. Jones, 839 F.2d 1041, 1053 (5th Cir.), cert. denied, 486 U.S. 1024, 100 L. Ed. 2d 230, 108 S. Ct. 1999 (1988).\n\nOur decisions leave no doubt that while a particular piece of evidence standing alone may support inferences that warrant an instruction, those inferences may evaporate after reviewing the entire record. For example, in United States v. Ivey, 949 F.2d 759, 768-69 (5th Cir. 1991), cert. denied, 506 U.S. 819 (1992), we affirmed the district court's refusal to instruct the jury on the defense of entrapment. We explained that evidence supporting entrapment was overwhelmed by other evidence in the record and there was no need to instruct the jury regarding it. Id. ; see also United States v. Pruneda-Gonzalez, 953 F.2d 190, 197 (5th Cir.) (holding evidence of entrapment was insufficient to shift burden of persuasion to government), cert. denied, 504 U.S. 978 (1992); United States v. Stanley, 765 F.2d 1224, 1234-35 (5th Cir. 1985) (same). The requirement that the evidence be sufficient to persuade a reasonable juror is not limited solely to the defense of entrapment but extends to all defenses for which the defendant bears the initial burden of production. See United States v. Liu, 960 F.2d 449, 454 (5th Cir.) (duress), cert. denied, 506 U.S. 957 (1992). A district court cannot refuse to give an instruction for which there is sufficient evidence in the record for a reasonable juror to harbor a reasonable doubt that the defendant did not act in self defense, but the district court is not required \"to put the case to the jury on a basis that 'essentially indulges and even encourages speculations.'\" United States v. Collins, 690 F.2d 431 (5th Cir. 1982) (affirming refusal to give lesser-included offense instruction), cert. denied, 460 U.S. 1046, 75 L. Ed. 2d 801, 103 S. Ct. 1447 (1983).\n\nThe Dissent measures the evidence in the record by an incorrect standard, misled by our statements in Perez v. United States, 297 F.2d 12 (5th Cir. 1961), and Strauss v. United States, 376 F.2d 416 (5th Cir. 1967), that the district court must instruct the jury on a defense for which there is \"any foundation in the evidence.\" The measure of \"any evidence\" never commanded allegiance. See United States v. Andrew, 666 F.2d 915, 922-24 \u0026 nn.10,11 (5th Cir. 1982) (quorum) (noting intracircuit split on the issue). To the contrary, panels of this court were chary of literally applying Perez and Strauss. See United States v. Fischel, 686 F.2d 1082, 1086 n.2 (5th Cir. 1982) (refusing to resolve split); United States v. Leon, 679 F.2d 534, 539 n.5 (5th Cir. 1982) (same). If the matter rested there, the Dissent would, perhaps, be justified in exploiting this dissonance. Mathews, however, resolved the matter. Indeed, in United States v. Stowell, 953 F.2d 188 (5th Cir.), cert. denied, 503 U.S. 908, 117 L. Ed. 2d 497, 112 S. Ct. 1269 (1992), and cert. denied, 506 U.S. 902 (1992), we explained:\n\nAlthough we have on several occasions before and after Mathews observed that the court must charge the jury on a defense theory when there is any evidence to support it, this language is admittedly incomplete. Its shorthand implies that a mere scintilla of evidence in support of a defense theory requires the giving of an instruction on that theory at the defendant's request. Of course, any evidence in support of a defensive theory must be sufficient for a reasonable jury to rule in favor of the defendant on that theory. This is what we meant when we stated in this case that a court may decide as a matter of law that the evidence . . . fails to raise a factual question for the jury.\n\nId. at 189 (citations omitted). Similarly, Judge Posner in United States v. Perez, 86 F.3d 735, 736 (7th Cir. 1996), interpreted Mathews as rejecting the notion that \"any evidence,\" no matter how weak or insufficient, entitled the defendant to an instruction on an affirmative defense. Not surprisingly, all but one of the decisions reiterating the \"any evidence\" standard of Perez and Strauss came prior to Mathews. And United States v. Kim, 884 F.2d 189, 193 (5th Cir. 1989), the only decision in this circuit to cite either Perez or Strauss after Mathews, did not involve the question whether there was sufficient evidence to warrant the requested jury instruction.\n\nThe Dissent relies upon dicta from the century-old decision of Stevenson v. United States, 162 U.S. 313, 40 L. Ed. 980, 16 S. Ct. 839 (1896), but that reliance is mistaken. Stevenson, which addressed the evidence needed to trigger a jury instruction regarding a lesser-included offense, did not embrace the proposition that even a scintilla of evidence warrants a jury instruction. To the contrary, Stevenson expressly noted that \"there might be cases where the uncontradicted evidence was so clear and overwhelming\" to justify refusing to instruct the jury on the lesser-included offense. Id. at 321. Indeed, the Court in Stevenson referred with approval to its earlier decision in Sparf v. United States, 156 U.S. 51, 39 L. Ed. 343, 15 S. Ct. 273 (1895), in which the Court explained that even if there is \"some evidence bearing upon a particular issue in a cause, but it is so meagre as not, in law, to justify a verdict in favor of the party producing it, the court is in the line of duty when it so declares to the jury.\" Id. at 99-100; see also Andersen v. United States, 170 U.S. 481, 496-98 n.1, 510-11, 42 L. Ed. 1116, 18 S. Ct. 689 (1898) (holding that evidence did not warrant lesser-included offense instruction, despite the fact that the defendant testified that he killed the deceased out of fear for his life).\n\nDecisions rendered in the century since Stevenson dispelled any doubt regarding that case's meaning and the quantum of evidence obliging the court to instruct the jury. Despite any uncertainty in our decisions before it, Mathews broke no new ground. The Supreme Court had earlier rejected the argument that any evidence, even a scintilla, warranted a jury instruction on an affirmative defense or lesser-included offense. In Keeble v. United States, 412 U.S. 205, 208, 36 L. Ed. 2d 844, 93 S. Ct. 1993 (1973), the Court explained that a court must instruct a jury on a lesser-included offense only \"if the evidence would permit a jury rationally to find him guilty of the lesser offense and acquit him of the greater.\" See also Schmuck v. United States, 489 U.S. 705, 716 n.8, 103 L. Ed. 2d 734, 109 S. Ct. 1443 (1989) (reiterating Keeble standard); Beck v. Alabama, 447 U.S. 625, 635, 65 L. Ed. 2d 392, 100 S. Ct. 2382 (1980) (same); Patterson v. New York, 432 U.S. 197, 231 \u0026 n.18, 53 L. Ed. 2d 281, 97 S. Ct. 2319 (1977) (Powell, J., Dissenting) (noting that an issue such as self-defense will not be submitted to the jury where the defendant's evidence does not justify a reasonable doubt regarding the issue). Mathews followed this consistent line.\n\nIn short, it is not enough that an item of evidence viewed alone and unweighed against all the evidence supports an inference that a defendant acted in self defense. See United States v. Harrison, 55 F.3d 163, 167 (5th Cir.) (holding that evidence if viewed in isolation warranted lesser-included offense instruction but not if viewed in context of the entire record), cert. denied, 133 L. Ed. 2d 225, 116 S. Ct. 324 (1995). The critical distinction is that a single item of evidence can be overwhelmed by other evidence in the record. Id.\n\nThe distinction is neither academic nor prissy; it defines the character of appellate review of the criminal trial, reflecting our effort to curb any tendency of criminal appeals to become a lawyer's sporting search for \"error.\" The jury plays a central role at trial, but the threshold to the jury room has never been so low as the Dissent would have it. This is not word play; there is a vast difference in concept between the requirement of sufficient evidence and a scintilla. There is an equally large difference in their application. This difference is central to the Dissent, leading it to rely upon snapshots of evidence that lose their image when placed on the dynamic screen of the entire record, as we think they must be. Cf. United States v. Browner, 889 F.2d 549, 554-55 (5th Cir. 1989). Few verdicts reached after lengthy trials could survive such an appellate role. In short, a scintilla rule can, in application, turn a criminal trial and the review of a conviction into a sporting contest for lawyers. Cf. Harrison, 55 F.3d at 168 (noting that evidence must be sufficient to warrant instruction lest the instruction serve \"merely as a device for defendant to invoke the mercy-dispensing prerogative of the jury\"). When the contended-for inference becomes an absurdity in light of all the facts adduced at trial, we invade no province of the jury in refusing to pretend it has probative value. See Sparf, 156 U.S. at 64-106.\n\nNone of this diminishes the role of the jury. This country from the beginning has prized the role of the jury. That rich history has also recognized that trial Judges have roles and responsibilities too. Id. Of course, our able brother in Dissent contends for none of these untoward results. In our view, however, these realities lie behind and are reflected in our insistence that evidence be more than a scintilla, that it be sufficient to create a reasonable doubt that the defendants did not act in self defense.\n\nWe hold that the district court was not obligated to give the proposed self-defense instruction and did not err in the instruction it gave. It is true, as a general proposition, that self-defense and the related defense of another are affirmative defenses to both murder and voluntary manslaughter.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e However, these general principles must accommodate a citizen's duty to accede to lawful government power and the special protection due federal officials discharging official duties. See United States v. Feola, 420 U.S. 671, 679, 43 L. Ed. 2d 541, 95 S. Ct. 1255 (1975). \"We do not need citizen avengers who are authorized to respond to unlawful police conduct by gunning down the offending officers.\" United States v. Johnson, 542 F.2d 230, 233 (5th Cir. 1976). Other, non-violent remedies are available. Id.\n\nWe need not explore the law of self-defense in confrontations between citizens and law enforcement officers to answer the question asked in this case. As we will explain, a reasonable juror could not doubt that the defendants knew their targets were federal agents. Equally, the defendants responded to the agents' lawful force with a deadly barrage of gunfire. Given the extraordinary amount of automatic and large-caliber gunfire that the defendants rained upon persons they knew were federal agents, the law offers no shelter for pleas that the defendant used only force that was \"responsive to excessive force.\" The legal claim simply has no factual leg.\n\nThat the district court allowed self-defense to the murder charges is nothing about which the defendants can complain. Whether correct or not, we need not decide. That instruction regarding murder seeds no right to a similar plea of self-defense to voluntary manslaughter. Our issue is error, not symmetry.\n\nIn sum, the evidence did not require the proposed self-defense instruction. Of course, the defendants may have feared for their life once gunfire erupted, but that fear does not warrant a self-defense instruction. There must be sufficient evidence from which a reasonable juror might infer, at a minimum, either that 1) the defendants did not know the ATF agents' identity, see United States v. Morton, 999 F.2d 435, 437-38 (9th Cir. 1993), or that 2) the ATF agents' use of force, viewed from the perspective of a reasonable officer at the scene, was objectively unreasonable under the circumstances. See United States v. Span, 970 F.2d 573, 577 (9th Cir. 1992), cert. denied, 507 U.S. 921, 122 L. Ed. 2d 676, 113 S. Ct. 1283 (1993). That evidence was not adduced at trial.\n\nB.\n\nThe record belies the defendants' contention that they did not know the identity of the ATF agents outside the compound on February 28th. In addition to their long preparation for the arrival of law officers, Koresh and the defendants had specific knowledge well in advance that the raid of February 28th was coming. On the morning of the raid, Koresh told the ATF's undercover agent, Roberto Rodriguez, who briefly visited the Davidians that morning, that \"neither the ATF or National Guard will ever get me. They got me once and they'll never get me again.\" Koresh repeatedly said, \"They're coming, Robert. They're coming.\" Several Davidians overheard Koresh's remarks. Other residents also learned of the impending ATF raid. Craddock, for example, learned that David Jones had heard that seventy-five ATF agents had arrived at the airport and that there might be a raid.\n\nEven if we assume that not every defendant had been forewarned of this specific raid, the record demonstrates beyond doubt that by the time the agents arrived at the compound, defendants knew the agents' identity as federal law enforcement officers. ATF Special Agent Roland Ballesteros, who was one of the first agents to approach the front of the compound after the raid began, testified that as he ran toward the front door of the compound, he saw David Koresh standing in the open front doorway. Ballesteros yelled loudly \"Police! Lay down!\" and \"Search Warrant!\" to Koresh several times. Koresh responded by asking \"What's going on?\" and Ballesteros again yelled \"Search Warrant! Lay Down!\" As Ballesteros approached the doorway, Koresh \"made some kind of smirk\" and then closed the door. Ballesteros testified that \"there was no doubt in my mind that [Koresh] knew who we were and what we were there for.\" Other agents also testified that they heard shouts of \"Police\", \"Search Warrant,\" and \"Federal agents\" as they exited the cattle trailers and approached the compound.\n\nEven though a reasonable juror could doubt that the Davidians heard the repeated cries of \"police\" and \"search warrant\", a reasonable juror could not overlook the visible indicators of the agents' identity. The Davidians point out that neither the cattle trailers nor the helicopters had government markings on them. However, most of the ATF agents, including the first agents to approach the compound, wore \"full raid gear.\" This gear included military-style helmets and black, bullet-resistant vests. Significantly, the vests had a large, gold ATF badge and the words \"ATF\" and \"Police\" inscribed in bright yellow, inch-high letters on their fronts. \"ATF\" and \"Police\" were also emblazoned on the back of the vests in large, yellow letters visible at a distance. Some agents wore \"baseball\" hats with a large yellow badge on the front. These markings were plainly visible in the broad daylight that morning and informed anyone who looked that these were federal law enforcement officials. This was not the garb of unidentified assailants. The notion that this was some alien and unidentified army is beyond the pale.\n\nThe defendants point to the testimony of Kathryn Schroeder, a Davidian present in the compound during the raid who later testified on behalf of the Government. She testified that she did not see the ATF markings on the uniforms nor did she hear the agents announce their purpose or identity as they approached the residence.\n\nSchroeder's view of the agents, however, was obstructed by a four-and-a-half foot high, wooden fence in front of her first-floor window. In contrast, the Davidians in the front foyer and on the second floor--the location from which most of the gunfire came--had an unobstructed view of the approaching ATF agents. Schroeder acknowledged that she assumed that the individuals approaching the compound were government officials. Indeed, Koresh had long taught that the Government--the \"beast\"--would come. Finally and most importantly, Schroeder's testimony does not suggest that the defendants did not know the agents' identity and purpose. That one Davidian, who did not participate in the gun battle, who remained under her bed for the duration of it, and who did not confirm the identity she assumed, says nothing about the knowledge of those armed and participating in the battle. Not even Schroeder will deny that the Davidians knew the agents' identity. See United States v. Jackson, 726 F.2d 1466, 1468 (9th Cir. 1984) (noting that witnesses' testimony that they heard no police warning \"is not evidence that the officers did not identify themselves\").\n\nViewing the record as a whole and in the light most favorable to the defendants, we are not persuaded that a reasonable jury could harbor a reasonable doubt that the defendants knew the approaching ATF agents' identity. To the contrary, the evidence in the record fits well with other cases affirming the refusal to give a self-defense or knowledge of official identity instruction. See, e.g., United States v. Streit, 962 F.2d 894, 898 (9th Cir.) (noting that \"record contains ample evidence indicating that the men clearly identified themselves as FBI agents and that Streit was aware of their official status\"), cert. denied, 506 U.S. 962, 121 L. Ed. 2d 352, 113 S. Ct. 431 (1992); Alvarez, 755 F.2d at 844-45 \u0026 n.15 (noting that \"agents who converged on the motel loudly announced their presence and identity\"); see also United States v. Ochoa, 526 F.2d 1278, 1282 \u0026 nn.4,5 (5th Cir. 1976) (rejecting the defendant's claim that he did not know the agents' identity where, like here, the evidence in the record indicated that the agents had announced their identity and wore official raid jackets with insignia visible).\n\nC.\n\nThe record also belies the contention that the ATF agents used excessive force. The defendants raise three arguments: First, that the ATF fired the first shots on February 28; second, that regardless of who fired first, the ATF fired indiscriminately into the compound, endangering the lives of women and children; and, third, that excessive force was inherent in the nature of the raid ATF conducted. The evidence in the record does not support any of these claims.\n\n1.\n\nThe evidence does not permit any reasonable inference but that the Davidians fired the first shots that morning. Agent after agent testified that the first shots they heard on February 28 came from the compound. In addition to the testimony of the ATF agents, reporters for the local newspaper and television station who witnessed the gunfight testified that the first shots were fired from the compound.\n\nIn response to this evidence, the defendants point to three pieces of evidence. First, the Davidians point to a statement given by Agent Ballesteros to the Texas Rangers shortly after the February 28 raid. In that statement, Ballesteros reported that he assumed that the first shots that he heard came from the ATF \"dog team\" shooting the Davidians' guard dogs.\n\nAt trial, however, Ballesteros testified that he no longer believed his earlier assumption. Rather, he testified that the first shots originated from the compound. Moreover, the evidence at trial contradicted the foundation for his earlier assumption. The \"dog team\" never shot the dogs in the compound, as it was assigned to do.\n\nSecond, the defendants point to the testimony of Jack Zimmermann, but his testimony sheds no light on who fired first. Zimmermann, an attorney for one of the Davidians, visited the compound on April 1, more than a month after the ATF raid. Zimmermann testified that he observed bullet holes in the front door and walls of the compound. In his opinion, the holes had been caused by shots coming from outside the compound. However, Zimmermann acknowledged that he could not tell who fired first. At most, his testimony indicates that gunfire was exchanged.\n\nThird, the defendants rely on a statement that defendant Castillo gave to the Texas Rangers after he exited the compound on April 19. In that statement, Castillo described the scene at the front door of the compound on February 28 as the ATF agents unloaded from the cattle trailers and approached the residence. According to Castillo, Koresh held the front door ajar and said, \"Wait a minute, there's women and children in here.\" Castillo claimed that gunfire immediately erupted through the door from the outside, injuring Koresh.\n\nThis self-serving, post-arrest statement, however, is not sufficient to warrant the requested instruction.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e It stands alone against the uniform and overwhelming testimony of numerous agents and members of the media and, significantly, against the undisputed physical facts. That every ATF agent and member of the media who testified under oath at trial disputed this version of the facts, which Castillo related in an unsworn post-arrest statement, is perhaps powerful enough, but we do not rest there.\n\nCastillo's unsworn observation cannot be squared with undisputed facts. The ATF agents testified that as they approached the residence, they heard gunfire coming from the front of the compound. Agent Ballesteros was one of the first agents out of the cattle trailer that stopped in front of the compound. The agents who followed Ballesteros out of the trailer came under large caliber and automatic gunfire. As Ballesteros ran to his assigned position at the front door, he saw Koresh standing in the foyer holding one of the double front doors open. According to Castillo's post-arrest statement, Koresh announced that there were women and children in the compound; after that announcement, gunfire came through the door and, he \"believed,\" Koresh was hit. At that time, Ballesteros was either at or near the front door. Ballesteros was carrying a shotgun loaded with oo-buckshot at the ready position. If fired, the shotgun blast would have been conspicuous. Its telling signature was absent as demonstrated by photographs of the gunbattle at the front of the compound. Rather, Ballesteros, who was hit after Koresh closed the door, took cover in the dog pen next to the front door, where he remained, pinned down, for the duration of the gunbattle. In other words, to accept Castillo's unsworn recollection of events, a reasonable juror would have had to believe either that Ballesteros shot at Koresh at the front door or that some other ATF agent fired through Ballesteros to the front door. Neither version works. Castillo's unsworn recollection is no more than a scintilla of evidence that, when viewed in light of the testimony and evidence in this six-week-long trial, does not support the contested-for inference.\n\nEven if it did, Castillo, the sole defendant capable of claiming the inferential benefit of his post-arrest statement,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e would be not entitled to the self-defense instruction as a matter of law. It is a necessary precondition to the claim of self-defense that the defendants be free from fault in prompting the ATF's use of force. Wallace v. United States, 162 U.S. 466, 472, 40 L. Ed. 1039, 16 S. Ct. 859 (1896); see also Melchior v. Jago, 723 F.2d 486, 493 (6th Cir. 1983) (noting that under Ohio law, \"it is a necessary condition of the right to claim self defense that the accused killer be without fault\"), cert. denied, 466 U.S. 952, 80 L. Ed. 2d 542, 104 S. Ct. 2156 (1984). \"One cannot provoke a fight and then rely on a claim of self-defense when that provocation results in a counterattack, unless he has previously withdrawn from the fray and communicated this withdrawal.\" Harris v. United States, 124 U.S. App. D.C. 308, 364 F.2d 701 (D.C. Cir. 1966) (per curiam); see also Andersen, 170 U.S. at 508 (noting that self-defense is unavailable where accused \"brings on the difficulty for the purpose of killing the deceased, or violation of law on his part is the reason of his expectation of an attack\"); Addington v. United States, 165 U.S. 184, 187-88, 41 L. Ed. 679, 17 S. Ct. 288 (1897) (same); Gourko v. United States, 153 U.S. 183, 191, 38 L. Ed. 680, 14 S. Ct. 806 (1894) (same); Rowe v. United States, 125 U.S. App. D.C. 218, 370 F.2d 240, 241 (D.C. Cir. 1966) (per curiam) (same). Judge Spottswood Robinson explained in United States v. Peterson, 157 U.S. App. D.C. 219, 483 F.2d 1222 (D.C. Cir. 1973), cert. denied, 414 U.S. 1007, 38 L. Ed. 2d 244, 94 S. Ct. 367 (1973):\n\nIt has long been accepted that one cannot support a claim of self-defense by a self-generated necessity to kill. The right of homicidal self-defense is granted only to those free from fault in the difficulty; it is denied to slayers who incite the fatal attack, encourage the fatal quarrel or otherwise promote the necessitous occasion for taking life. The fact that the deceased struck the first blow, fired the first shot or made the first menacing gesture does not legalize the self-defense claim if in fact the claimant was the actual provoker.\n\n483 F.2d at 1231 (footnotes omitted) (emphasis added).\n\nWe need not define precisely the line separating lawful conduct from unlawful provocation to hold that Castillo's conduct falls on the impermissible side of the line. Although we agree that engaging in unlawful conduct requiring law enforcement officials to investigate does not, by itself, constitute provocation, \"an affirmative unlawful act reasonably calculated to produce an affray foreboding injurious or fatal consequences is an aggression which, unless renounced, nullifies the right of homicidal self-defense.\" Id. at 1233 (footnotes omitted).\n\nWe are not persuaded that Castillo was entitled to any self-defense instruction even if the events occurred as he related them in his post-arrest statement. In United States v. Thomas, 34 F.3d 44, 48 (2d Cir.), cert. denied, 115 S. Ct. 527 (1994), and cert. denied, 115 S. Ct. 527 (1994), and cert. denied, 115 S. Ct. 683 (1994), and cert. denied, 115 S. Ct. 774 (1995), and cert. denied, 115 S. Ct. 1134 (1995), the Second Circuit held that defendants who had been convicted of murder were not entitled to a self-defense instruction where the jury had also convicted the defendants of the attempted robbery of the deceased. The court explained that the defendants' \"need to defend themselves arose out of their own armed aggression.\" Id. Similarly, in Laney v. United States, 54 App. D.C. 56, 294 F. 412, 413 (D.C. Cir. 1923), the court affirmed the manslaughter conviction of a defendant who successfully fled a race riot but then left his safe haven in search of the rioters. The court explained that \"when [the defendant] adjusted his gun and stepped out in the areaway, he had every reason to believe that his presence there would provoke trouble. We think his conduct in adjusting his revolver and going into the areaway was such as to deprive him of any right to invoke the plea of self-defense.\" 294 F. at 414.\n\nThe jury convicted Castillo of using or carrying a firearm during a crime of violence. The predicate crime of violence was conspiracy to murder federal agents. This included stockpiling military-type weapons and preparing for the fight with the \"beast\". Moreover, according to Castillo's own description of the events in his post-arrest statement, he donned battle dress upon learning of the impending ATF raid. He retrieved his assault rifle and raced to the front door. We are persuaded that Castillo's retrieval of an assault rifle and his preparation for a gunbattle, all occurring as part of the conspiracy to murder federal agents that the jury necessarily found him guilty of as part of its verdict on the 18 U.S.C. § 924(c)(1) weapons charge, deprived Castillo of any claim of self-defense. A member of a conspiracy to murder federal agents, who dresses for combat, retrieves an assault rifle, and proceeds to the front door to confront government agents executing a lawful warrant, is not entitled to claim the benefit of self-defense when the hoped-for confrontation with the agents occurs.\n\nNor may Castillo claim the benefit of the \"imperfect\" version of self-defense. Some contend that a defendant who played a role in creating the confrontation that led to a homicide may not escape culpability altogether but may nevertheless reduce his crime from murder to manslaughter. See 2 W. LaFave \u0026 A. Scott, Substantive Criminal Law § 7.11(a) (1986); see also Wallace, 162 U.S. at 472-73. We need not enter this academic debate, however. The trial Judge avoided it by giving the self-defense instruction to the murder charge. Castillo was convicted of manslaughter; his failure to be free from fault, at the least, negates his plea of self-defense to the charge of manslaughter.\n\nIn short, these pieces of evidence, even when considered together in the light most favorable to the defendants, do not support an inference that the agents fired the first shot. Moreover, even evidence that the ATF agents fired the first shot would not have been sufficient by itself to warrant the self-defense instruction. The ATF agents testified that ATF policy and training directed agents to fire only if they saw an individual threatening the agent's or someone else's life. Initiating gunfire in those circumstances would not be unreasonable. Although the defendants contend that the ATF did not follow its own policy but fired indiscriminately into the compound, that argument proves the point: evidence that the ATF fired first without evidence that such fire was indiscriminate or otherwise excessive does not warrant a self-defense instruction.\n\n2.\n\nThe Davidians point out that several ATF agents testified that firing through walls and into windows in which there was no discernable threat would be unreasonable because of the danger to innocents and the possibility for escalation. Seizing on this, the Davidians point to Kathryn Schroeder's testimony that gunfire came through the window in her room at the beginning of the raid. In addition, the Davidians and Whitecliff in particular highlight Marjorie Thomas' video deposition in which she stated that a gunshot shattered the window in her loft on the third floor as she watched the helicopters approach the compound at the beginning of the raid.\n\nThis testimony will not support an inference that the ATF agents used excessive force. The pilots of the helicopters all testified that no shots were fired from the helicopters. Significantly, the unchallenged testimony is supported by the physical facts. The helicopters were unarmed, and the doors on the aircraft were closed, thereby preventing agents inside from firing on the compound. Thomas herself acknowledged that she did not know if the bullet that shattered her window came from the helicopter.\n\nRegardless, there was no evidence that any of the defendants either came under indiscriminate, unprovoked fire or knew that such fire was taking place. Even if, for example, the National Guard helicopters did fire, the contended-for inference that the four defendants acted in self-defense by letting loose a volley of fire upon the ATF agents on the other side of the large compound is untenable.\n\nThe Dissent's focus upon the testimony of Kathryn Schroeder and Marjorie Thomas forgets that neither is among those convicted of the voluntary manslaughter of federal agents. That Schroeder or Thomas may have been, if charged, entitled to the self-defense instruction does not mean that the four defendants convicted of voluntary manslaughter are so entitled. The question is whether there is sufficient evidence from which a reasonable juror could infer that one of the four defendants, not an uncharged resident present somewhere in the compound, acted in response to excessive force. There are no vicarious defenses.\n\nOur refusal to attribute Schroeder's and Thomas' experiences and knowledge to all the residents of the compound highlights a fundamental difference between the majority and the Dissent in their approach to the evidence. We agree that \"each defendant is entitled to individual consideration of the charges against him and his defenses.\" See post at 7. It is also the case, we think, that the knowledge of one resident cannot simply be imputed to all who are at the compound. Defendants need not testify regarding their own knowledge, but there must be sufficient evidence to reasonably infer that the defendants knew of and were responding to excessive force. Here, there was none. Neither Thomas nor Schroeder testified that they told any of the defendants about the gunfire they witnessed. Indeed, Schroeder remained in her room, never relating her experience during the gunfight to others. Nor is there evidence that any defendant could otherwise have had that knowledge in this large, multi-building compound, particularly during the raging gunbattle that the defendants own actions provoked.\n\n3.\n\nFinally, the Davidians argue that excessive force was inherent in the nature of the ATF raid. According to the defendants, sending over seventy well-armed agents to arrest Koresh and execute a search warrant for a residence housing women and children was excessive. We disagree.\n\nThe execution of search and arrest warrants necessarily involves some degree of force. Graham, 490 U.S. 386 at 396, 104 L. Ed. 2d 443, 109 S. Ct. 1865; Streit, 962 F.2d at 899. The ATF had cause to believe that the Davidians had amassed a large supply of weaponry, including grenades and fully automatic assault rifles. In light of this knowledge and the concern that other methods would endanger the lives of residents of the center, the ATF concluded that a \"dynamic entry\" raid was the proper method to execute the search and arrest warrants. This evidence will not support an inference of unreasonable force.\n\nNor is there evidence that the agents possessed an excessive amount of firepower under the circumstances. All of the agents carried 9 millimeter pistols and a limited supply of ammunition. Of the seventy-plus agents participating in the raid, only six agents carried AR-15 semiautomatic rifles capable of shooting rounds that could penetrate a wall. None of the weapons were fully automatic, though some could fire in two-round bursts. Indeed, as events bore out, the ATF possessed too little, not too much, firepower.\n\nSurely, a citizen may not initiate a firefight solely on the ground that the police sent too many well-armed officers to arrest him. The suggestion that a defendant would be entitled to claim self-defense simply by pointing to the police's tactical decision to send twenty heavily-armed officers instead of two lightly-armed ones is untenable. We reject this invitation for individuals to forcibly resist arrest and then put their arresters on trial for the reasonableness of their tactical decisions.\n\nWe conclude that the district court did not err in refusing to instruct the jury on self-defense and the defense of another with regard to the voluntary manslaughter charge.\n\nIV.\n\nA.\n\nAfter several days of deliberations, the jury returned its verdict acquitting all of the Davidians on Count 1 for conspiring to murder federal agents. The jury convicted Avraam, Branch, Castillo, Craddock, and Whitecliff on Count 3 for using or carrying a firearm during and in relation to the crime charged in Count 1. Believing that the two verdicts were inconsistent, the district court summoned the attorneys to the bench before announcing the verdict. The Government suggested sending the jury back for more deliberations to resolve the perceived inconsistency. The defense attorneys opposed that suggestion and asked the court to render a verdict of not guilty on Count 3. Apparently agreeing with the defense, Judge Smith stated that \"I don't see anyway [the jury] can correct their mistake except by a finding of not guilty on Count Three.\" Judge Smith ended the bench conference without announcing a ruling. The jury's verdict was announced. Judge Smith asked whether anyone desired to poll the jury. No attorney responded. Judge Smith discharged the jury.\n\nAfter the jury had left, Judge Smith announced his intention to issue a written order setting aside the guilty verdict on Count 3:\n\nThe guilty finding as to Count Three will have to be set aside, because, of necessity, the jury could not find a Defendant guilty of that offense without first having found that Defendant guilty of the Conspiracy offense alleged in Count One, and the jury found all Defendants not guilty of that offense. So, that portion of the verdict simply cannot stand. There seemed to be no point in asking the jury to retire and reconsider it, because the only decision they could have made was to change that finding to not guilty, so the Court will set that finding aside.\n\nTwo days later, the Government moved to reinstate the jury's verdict on Count 3. The Government argued that the jury's decision to acquit the defendants on the predicate offense charged in Count 1 did not require an acquittal on the compound offense charged in Count 3. The Davidians responded, arguing that reinstatement of the jury's verdict would violate their double jeopardy and due process rights. The district court rejected the Davidians' arguments and reinstated the jury's guilty verdict on Count 3 on March 9, 1994.\n\nJudge Smith acknowledged that there was no necessary inconsistency in the jury's verdicts on Counts 1 and 3. See United States v. Munoz-Fabela, 896 F.2d 908, 911 (5th Cir.) (noting that \"it is only the fact of the offense, and not a conviction, that is needed to establish the required predicate\" under § 924(c)), cert. denied, 498 U.S. 824 (1990); United States v. Ruiz, 986 F.2d 905, 911 (5th Cir.) (holding that acquittal on predicate offense does not bar conviction under § 924(c)), cert. denied, 114 S. Ct. 145 (1993); see also United States v. Powell, 469 U.S. 57, 67-69, 83 L. Ed. 2d 461, 105 S. Ct. 471 (1984). On appeal, most of the Davidians appear to accept that much.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Rather, the Davidians reurge their double jeopardy and due process arguments.\n\nRegarding double jeopardy, the Davidians claim that the district court's comments at the side-bar conference constituted a pre-verdict judgment of acquittal on Count 3. According to the defendants, reversal of a pre-verdict judgment of acquittal constitutes double jeopardy. We disagree.\n\nThe district court did not announce any formal ruling at the side-bar conference before receiving the jury's verdict. To the contrary, he ended the bench conference without comment and ordered the clerk to read the jury's verdict, including the verdict on Count 3. Even one of the defense attorneys inquired after the publication of the verdict \"what the Court was going to do\" on Count 3. The jury's verdict became final when it was announced in open court and the defendants were given the opportunity to poll the jury. United States v. White, 972 F.2d 590, 595 (5th Cir. 1992), cert. denied, 507 U.S. 1007, 123 L. Ed. 2d 272, 113 S. Ct. 1651 (1993), and cert. denied, 507 U.S. 1007, 123 L. Ed. 2d 272, 113 S. Ct. 1651 (1993).\n\nEven were we to construe the comments at the bench conference as a formal ruling setting aside the jury's verdict on Count 3, it would not be a judgment of acquittal. \"[A] defendant is acquitted only when 'the ruling of the Judge, whatever its label, actually represents a resolution [in the defendant's favor], correct or not, of some or all of the factual elements of the offense charged.'\" United States v. Scott, 437 U.S. 82, 97, 57 L. Ed. 2d 65, 98 S. Ct. 2187 (1978) (quoting United States v. Martin Linen Supply Co., 430 U.S. 564, 571, 51 L. Ed. 2d 642, 97 S. Ct. 1349 (1977)). That the district court rendered a decision in favor of the defendants prior to the publication of the jury's verdict does not bar the Government from seeking to overturn that decision, either at the district court or on appeal, unless the decision rests on a determination that the Government's evidence is legally insufficient to sustain a conviction. Scott, 437 U.S. at 97, 100.\n\nThe record is clear that Judge Smith did not direct his comments at the bench conference to the sufficiency of the evidence on Count 3. Rather, he shared with counsel a misapprehension regarding the validity of inconsistent jury verdicts. The record establishes that it is solely that misapprehension, understandable in that tension-filled moment, and not any doubt regarding the sufficiency of the evidence that led Judge Smith to set aside the jury's verdict.\n\nThe district court's post-verdict decision to set aside the jury's verdict gives defendants no comfort. The Fifth Amendment does not bar the government from appealing post-verdict judgments of acquittal. United States v. Boyd, 566 F.2d 929, 932 (5th Cir. 1978); Government of the Virgin Islands v. Christensen, 673 F.2d 713, 718-19 (3d Cir. 1982). A fortiori, the district court's own reinstatement of a final jury verdict of guilt--or, stated another way, the district court's decision to reverse its earlier decision--does not twice put defendants in jeopardy. United States v. LaSpesa, 956 F.2d 1027, 1034 (11th Cir. 1992).\n\nThe Davidians also claim that reinstating the guilty verdict denied them due process. The Davidians argue that they relied on the Judge's comments at the bench conference suggesting that he agreed that the guilty verdict on Count 3 had to be set aside and did not ask Judge Smith to instruct the jury to render a directed verdict of not guilty on Count 3 or, alternatively, to order the jury to resume deliberations to resolve the inconsistent verdicts. In essence, the Davidians contend that they were \"sandbagged\" by the district court.\n\nNeither the Constitution nor general principles of federal criminal law require a district court, when confronted with inconsistent jury verdicts, to instruct the jury to return a verdict of not guilty on all counts. In Harris v. Rivera, 454 U.S. 339, 348, 70 L. Ed. 2d 530, 102 S. Ct. 460 (1981), the Supreme Court rejected a due process challenge to a conviction based on an inconsistent verdict. \"Inconsistency in a verdict is not a sufficient reason for setting it aside.\" Id. at 345. What Harris established as a matter of constitutional law, United States v. Powell, 469 U.S. 57, 65, 83 L. Ed. 2d 461, 105 S. Ct. 471 (1984), reaffirmed as a matter of federal criminal law. In short, the district court was under no duty, constitutional or otherwise, to instruct the jury to return a verdict of not guilty on Count 3. To the contrary, Powell precluded that option.\n\nSimilarly, the district court was not obligated to return the jury for further deliberations, to resolve the inconsistent verdicts. Powell may mandate, and certainly points the district court to accept inconsistent verdicts. 469 U.S. at 69. As a practical matter, pushing a jury to continue its work when it has a final verdict risks other difficulties. See United States v. Straach, 987 F.2d 232, 242-43 (5th Cir. 1993) (noting that \"a Judge errs in instructing the jury to deliberate further if the jury has reached a final verdict\"); White, 972 F.2d at 594-95 (same).\n\nEven if the Davidians were \"due\" this option, the district court did not deprive them of it. At the bench conference, the Government recommended that the jury be sent back to continue deliberating, but defense counsel adamantly opposed that suggestion.\n\nCastillo separately contends that the district court's reinstatement of the jury's guilty verdict on Count 3 deprived the Davidians of the opportunity to poll the jury. Rule 31(d) of the Federal Rules of Criminal Procedure provides that, before the verdict is recorded, \"the jury shall be polled at the request of any party or upon the court's own motion.\" A defendant can waive his right to a jury poll by failing to request the court to poll the jury. United States v. Beldin, 737 F.2d 450, 455 (5th Cir.), cert. denied, 469 U.S. 1075, 83 L. Ed. 2d 512, 105 S. Ct. 572 (1984).\n\nThe Davidians waived their right to have the jury polled by failing to make a timely request. After the clerk read the jury's verdict, Judge Smith asked whether anyone desired that the jury be polled, and seeing no response, remarked, \"I take it not.\" He then discharged the jury. That the Davidians misapprehended the need to poll the jury on Count 3 due to their mistaken belief that Judge Smith had set aside the guilty verdict does not excuse their failure to request the poll. Indeed, even after the Government moved to reinstate the jury's verdict on Count 3, the Davidians did not specifically complain that reinstatement would violate their right to have the jury polled.\n\nFinally, Craddock separately contends that the district court's reinstatement of the jury's verdict violates his Sixth Amendment right to counsel because his attorney was not called to participate in the bench conference after the jury returned with its verdict.\n\nThe Sixth Amendment entitles the defendant to the assistance of counsel at all \"critical stages\" of a criminal proceeding. Tucker v. Day, 969 F.2d 155, 159 (5th Cir. 1992). The pre-verdict bench conference was not a critical stage of the Davidians' trial, however. The district court rendered no decision regarding the inconsistent verdicts at the bench conference. To the contrary, the bench conference was a brief, \"informational meeting\" at which the district court informally advised counsel of the jury's verdict and at which no prejudicial action was taken. Cf. People v. Hardy, 2 Cal. 4th 86, 825 P.2d 781, 849 (Cal.), cert. denied, 506 U.S. 987 (1992), and cert. denied, 506 U.S. 1056 (1993); Roker v. State, 262 Ga. 220, 416 S.E.2d 281, 283 (Ga. 1992). After the jury's verdict was announced, Craddock's counsel had the opportunity to poll the jury, to address the district court regarding the inconsistent verdicts, and, eventually, to respond to the Government's motion to reinstate the jury's verdict. We are not persuaded that the district court's failure to call Craddock's counsel to the pre-verdict bench conference violated Craddock's Sixth Amendment right to counsel.\n\nIn short, the district court's decision to reinstate the jury's guilty verdict on Count 3 was correct.\n\nB.\n\nThe district court sua sponte ordered the use of an anonymous jury. Whitecliff, along with Avraam and Branch, objected to the court's order, claiming that the use of an anonymous jury violated their right to a fair trial before an impartial jury. Fatta approved the anonymous jury.\n\nOn appeal, Whitecliff argues that the use of an anonymous jury hindered the selection of an impartial jury and led jurors to believe that defendants posed some threat of harm to them, thereby undermining the presumption of innocence. Pointing out that most cases upholding the use of anonymous juries have involved organized crime or violent drug syndicates threatening to disrupt the judicial process, the Davidians argue that, to justify an anonymous jury, it is \"crucial\" that there be evidence that the defendants or their associates pose some threat to the judicial process and that there was no evidence that any of the defendants or individuals associated with them was a threat to the jury.\n\nReferring to the jury as \"anonymous\" is misleading. Anonymity has long been an important element of our jury system. Jurors are randomly summoned from the community at large to decide the single case before them and, once done, to \"inconspicuously fade back into the community.\" United States v. Scarfo, 850 F.2d 1015, 1023 (3d Cir.), cert. denied, 488 U.S. 910, 102 L. Ed. 2d 251, 109 S. Ct. 263 (1988); see also 3 William Blackstone, Commentaries * 378. \"Anonymous jury\" has come to mean something different in recent years, signaling the district court's decision to withhold certain biographical information about potential jurors from the parties involved. That said, we should be wary of painting with too broad a brush. \"Anonymous\" juries include those about whom more has been concealed than here. See, e.g., United States v. Ross, 33 F.3d 1507, 1519 (11th Cir. 1994) (withholding names, addresses, places of employment, and spouses' names and places of employment), cert. denied, 132 L. Ed. 2d 812, 115 S. Ct. 2558 (1995). The jurors here were not \"anonymous\" except in the most literal sense. The district court ordered only the jurors' names and addresses be withheld from the parties. Otherwise, the court provided the defendants with a wealth of information about the venire, including occupations and names of employers. The decision to withhold biographical information about the jurors from the parties in a criminal prosecution is weighty, its validity turning on the individual, fact-specific circumstances of each case. Deciding to withhold even the name and address of a member of the venire \"requires a trial court to make a sensitive appraisal of the climate surrounding a trial and a prediction as to the potential security or publicity problems that may arise during the proceedings.\" United States v. Childress, 313 U.S. App. D.C. 133, 58 F.3d 693, 702 (D.C. Cir. 1995), cert. denied, 133 L. Ed. 2d 768, 116 S. Ct. 825 (1996). Accordingly, we review such a district court decision for abuse of discretion. United States v. Krout, 66 F.3d 1420, 1426 (5th Cir. 1995), cert. denied, 116 S. Ct. 963 (1996), and cert. denied, 116 S. Ct. 963 (1996).\n\n\"'The use of an anonymous jury is constitutional when there is strong reason to believe the jury needs protection and the district court takes reasonable precautions to minimize any prejudicial effects on the defendant and to ensure that his fundamental rights are protected.'\" Id. at 1427 (quoting United States v. Wong, 40 F.3d 1347, 1376 (2d Cir. 1994)) (internal quotation marks omitted). We have listed some of the usual considerations:\n\n(1) the defendants' involvement in organized crime; (2) the defendants' participation in a group with the capacity to harm jurors; (3) the defendants' past attempts to interfere with the judicial process or witnesses; (4) the potential that, if convicted, the defendants will suffer a lengthy incarceration and substantial monetary penalties; and, (5) extensive publicity that could enhance the possibility that jurors' names would become public and expose them to intimidation and harassment.\n\nId. (citations omitted).\n\nWe did not suggest, however, that these or some aggregate must be established on pain of reversal. Rather, these are concerns commonly present in cases, such as Krout, where courts have upheld the use of an anonymous jury. Other circumstances may also justify its use. Indeed, while evidence that the defendant has in the past or intends in the future to tamper with the jury may be sufficient to warrant an anonymous jury, it is by no means necessary. United States v. Edmond, 311 U.S. App. D.C. 235, 52 F.3d 1080, 1091 (D.C. Cir.), cert. denied, 133 L. Ed. 2d 443, 116 S. Ct. 539 (1995), and cert. denied, 133 L. Ed. 2d 443, 116 S. Ct. 539 (1995). District courts should look to the \"totality of the circumstances.\" Ross, 33 F.3d at 1521 n.26.\n\nThe district court reasoned that an anonymous jury was appropriate because of the \"enormous amount of world-wide media attention\" generated by the case and the emotionally charged atmosphere surrounding it. Not all celebrated trials merit an anonymous jury, but \"the prospect of publicity militates in favor of jury anonymity to prevent exposure of the jurors to intimidation or harassment.\" United States v. Wong, 40 F.3d 1347, 1377 (2d Cir. 1994), cert. denied, 115 S. Ct. 1968 (1995), and cert. denied, 115 S. Ct. 1968 (1995), and cert. denied, 115 S. Ct. 2568 (1995), and cert. denied, 133 L. Ed. 2d 127, 116 S. Ct. 190 (1995); United States v. Vario, 943 F.2d 236, 240 (2d Cir. 1991), cert. denied, 502 U.S. 1036, 116 L. Ed. 2d 786, 112 S. Ct. 882 (1992). It is not just the media attention. This trial aroused deep passions. The district court feared the potentially disruptive effects of such public attention on the trial in general and the jurors in particular. That several jurors received mail regarding the case during the trial only confirmed the concern of the district court. Cf. United States v. Sanchez, 74 F.3d 562, 565 (5th Cir. 1996) (rejecting anonymous jury where \"there was no indication that the jurors in this case would be subjected to the type of extensive publicity that might bring about intimidation and harassment\"). The court was also concerned that persons bent on mischief might confuse the Davidian jurors with jurors in a high-profile trial involving organized crime figures occurring at the same time in the same courthouse. These concerns justified the district court's decision to use an anonymous jury.\n\nSignificantly, there is no showing that refusing to release the names and addresses of the jury prejudiced the defendants' ability to select an impartial jury. The court furnished the defendants with answers to 80 detailed questions submitted by the district court to prospective jurors. No defendant argues to us that the information obtained from these questionnaires was deficient. See Childress, 58 F.3d at 704 (upholding anonymous jury where \"court conducted a searching voir dire and gave jurors an extensive questionnaire, the scope of which appellants do not challenge\").\n\nWe also emphasize that at voir dire, the court asked the defendants' proposed questions and elicited additional information regarding potential juror bias. See Wong, 40 F.3d at 1377 (upholding anonymous jury where \"extensive\" voir dire adequately explored prospective juror bias). In short, the contention that the use of the anonymous jury hindered the Davidians' ability to select an impartial jury sorely underestimates the ability of counsel to use the available \"arsenal of information\" about each prospective juror. United States v. Barnes, 604 F.2d 121, 142 (2d Cir. 1979), cert. denied, 446 U.S. 907, 64 L. Ed. 2d 260, 100 S. Ct. 1833 (1980).\n\nSimilarly, the use of an anonymous jury did not undermine the defendants' presumption of innocence. At heart, the Davidians' argument rests on a speculative inference that the jurors were more likely to render a guilty verdict because of their belief that the defendants were dangerous. Such speculation is unwarranted. Indeed, it may be that \"[a] juror who fears a defendant's retaliation might be more apt to return a guilty verdict despite such fears rather than because of them.\" Scarfo, 850 F.2d at 1026.\n\nIn any event, the district court instructed the jury regarding the non-defendant-related need for anonymity and the presumption of innocence. Moreover, at voir dire, Judge Smith explained his decision to use an anonymous jury because of the public attention surrounding the case and the fear that the jury would be confused with the jury in the organized crime case being conducted at the same time down the hall. Judge Smith then cautioned:\n\nNow, that's why we're doing this. But I need to make certain that's not--that's not going to have any negative impact in your minds towards the Defendants. I have no indication whatsoever that any of these Defendants or their families or friends would be any threat to any juror selected in this case, and I want to be sure you fully understand that.\n\nJudge Smith asked whether anyone had \"negative feelings\" toward the defendants because of the use of an anonymous jury. No one responded. In addition, Judge Smith instructed the jury on the presumption of innocence both at voir dire and in the final charge. These cautionary instructions, which compare favorably to those used in other cases in which the use of an anonymous jury has been upheld, ensured that the defendants' presumption of innocence was not compromised. See United States v. Riggio, 70 F.3d 336, 340 \u0026 n. 23 (5th Cir. 1995) (upholding use of anonymous jury where the district court \"took effective steps to minimize any prejudicial effects associated with an anonymous jury\"), cert. denied, 134 L. Ed. 2d 531,, 116 S. Ct. 1366, (1996); United States v. Darden, 70 F.3d 1507, 1533 (8th Cir. 1995) (same), cert. denied, S. Ct. (1996); Edmond, 52 F.3d at 1093; United States v. Thomas, 757 F.2d 1359, 1364-65 \u0026 n.1 (2d Cir.), cert. denied, 474 U.S. 819 (1985), and cert. denied, 474 U.S. 819 (1985), and cert. denied, 479 U.S. 818 (1986); United States v. Tutino, 883 F.2d 1125, 1133 (2d Cir. 1989), cert. denied, 493 U.S. 1081, 107 L. Ed. 2d 1044, 110 S. Ct. 1139 (1990), and cert. denied, 493 U.S. 1082 (1990).\n\nWe conclude that the decision to not disclose the names and addresses of the jurors did not violate the Davidians' constitutional rights to a fair trial before an impartial jury. To the contrary, the district court's decision reflected great care.\n\nC.\n\nOn April 19, 1993, the Texas Rangers arrested Castillo after he fled the blazing compound. Later that day, Castillo gave a statement to Texas Ranger Gerardo de los Santos, who prepared a written report of the interview.\n\nDuring the trial, the Government moved for an order precluding Castillo from offering into evidence exculpatory statements in the report. The Government argued that such statements were inadmissible hearsay. Anticipating Castillo's response to the motion, the Government also argued that Rule 106 of the Federal Rules of Evidence did not require their admission if the Government introduced other, inculpatory statements in the report. The district court granted the Government's motion in part.\n\nAt trial, the Government called Ranger de los Santos to testify regarding certain portions of Castillo's post-arrest statement, particularly those concerning the events on February 28, the day of the ATF raid. The actual report was not introduced into evidence. During the direct examination of Ranger de los Santos, the district court denied Castillo's attempt to introduce the following underlined, exculpatory statements contained in the Ranger's report of the post-arrest interview:\n\n7. The following was ascertained from Castillo reference his knowledge and participation reference the initial raid by ATF on 02-28-93:\n\nA. That on Sunday, 02-28-93, in the early morning hours, CASTILLO woke up, got dressed in camouflage style clothes, and went outside to work on the concrete slab being built over the bunker that is supposed to be a tornado shelter. After going outside, CASTILLO stated that it was too cold, and he decided to go back in and go to bed.\n\nB. CASTILLO stated that after he laid down, he heard someone say that something was going to happen. CASTILLO got up and got dressed again. This time he dressed in a black shirt and black pants. CASTILLO commented, \"I looked like the ATF.\" CASTILLO also put on a vest that was capable of holding eight (8) ammunition magazines of an AR-15 that he was given before 02-28-93.\n\nC. CASTILLO doesn't remember the exact time, but stated he looked out the window of his room facing the front area of the compound and saw two (2) cattle trucks driving up to the compound. CASTILLO identified his room as being the third room facing the front from the entrance door.\n\nD. After seeing the cattle trucks, CASTILLO went out into the hallway and saw Vernon HOWELL. He told HOWELL what he had seen and accompanied HOWELL to the front door. CASTILLO was carrying an AR-15 rifle. That HOWELL was wearing regular clothes and unarmed.\n\nE. CASTILLO stated that when they got to the front door, HOWELL opened the door and yelled out, \"Wait a minute. There's women and children in here.\" Then all of a sudden shots were fired at the front door where he believes HOWELL was shot. At this time CASTILLO stated he tried to chamber a round in his rifle, but that it jammed. That Perry JONES was also in the foyer unarmed and several other men that CASTILLO states he can't remember who they were, nor if they were armed or not.\n\nF. After his rifle failed, CASTILLO states that he ran down the hallway and back into his room where he picked up his own 9mm Beretta handgun. CASTILLO then ran out, continuing down the hallway toward the other end of the compound, and went into a room that is located second to the last on the west side of the compound facing the front of the compound.\n\nG. As CASTILLO was about to enter said room, he looked into the room located directly across and observed \"Winston\" laying on the floor dead with a gunshot wound to the head.\n\nH. CASTILLO went into the room identified as McBEAN, SUMMERS, and HIPSMAN'S room. CASTILLO stated he took cover during the shooting, never firing a shot. CASTILLO also stated no one in his room fired a round. CASTILLO claims that he doesn't know who fired a weapon inside.\n\nI. That after a while, CASTILLO heard someone running down the hallway yelling cease fire. According to CASTILLO, this person sounded like Brad BRANCH.\n\nJ. After the cease fire, CASTILLO went to the kitchen area and picked up an AK-47 rifle that was laying on a table. CASTILLO observed Adebowado \"DaBo\" DAVIES in the kitchen area armed with an AR-15 rifle. CASTILLO looked out the kitchen door facing the pool and observed a wounded ATF Agent on the chapel roof. He then observed four ATF Agents, 3 men and 1 black female approach to remove another agent. CASTILLO stated that he never aimed his rifle at these agents.\n\nK. CASTILLO stated that he doesn't remember anything else after this date. CASTILLO did state that during the standoff he was assigned guard duty at the chapel along with \"DaBo.\" CASTILLO'S shift was from 6:00 P.M. to 12:00 midnight during these days. CASTILLO was requested to give a written statement, but stated he would think about it.\n\n8. According to CASTILLO, he was given the AR-15 weeks prior to 02-28-93, along with three (3) or four (4) magazine clips and ammunition. CASTILLO doesn't remember who gave him the rifle.\n\n10. CASTILLO states that he heard that Winstom, HIPSMAN, Peter GENT, Perry JONES, and Jaydean WENDEL had been killed. That WENDEL was asleep in bed when she was shot. That GENT had been killed by the helicopters and JONES had been shot in the legs and stomach. That the dead had been taken to the bunker area because they started to smell bad. That he didn't participate in the removal or burial of the dead.\n\n11. CASTILLO states that he never received firearms training by anybody, but did shoot his weapons a couple of times in the past. That he fired his weapons only a couple of times into bales of hay in the gym area and assumes the women also did this.\n\n12. CASTILLO states that there was a lot of ammo kept in the compound and he personally observed one or two grenades at one time.\n\n16. In reference to the undercover ATF Agents that moved in across the compound, CASTILLO claims that they knew they were agents because they were too old to be students and drove expensive vehicles.\n\n17. CASTILLO'S duties at the compound were to help construct the tornado shelter, play drums, and study the Bible.\n\nWe review the district court's decision for abuse of discretion. United States v. Abroms, 947 F.2d 1241, 1250 (5th Cir. 1991), cert. denied, 505 U.S. 1204, 120 L. Ed. 2d 869, 112 S. Ct. 2992 (1992). Rule 106 provides:\n\nWhen a writing or recorded statement or part thereof is introduced by a party, an adverse party may require the introduction at that time of any other part or any other writing or recorded statement which ought in fairness to be considered contemporaneously with it.\n\nFed.R.Evid. 106. This rule partially codifies the common-law \"rule of completeness.\" Beech Aircraft Corp. v. Rainey, 488 U.S. 153, 172, 102 L. Ed. 2d 445, 109 S. Ct. 439 (1988). Its purpose is \"to permit the contemporaneous introduction of recorded statements that place in context other writings admitted into evidence which, viewed alone, may be misleading.\" United States v. Jamar, 561 F.2d 1103, 1108 (4th Cir. 1977).\n\nThe Government first argues that Rule 106 does not apply to Castillo's post-arrest statement. Noting that the rule by its terms only applies to \"a writing or recorded statement\", the Government points out that Ranger de los Santos' report of Castillo's post-arrest statement was not introduced into evidence. Rather, Ranger Santos testified based on his own recollection of the post-arrest interview.\n\nThe advisory committee's note to Rule 106 distinguishes between writings and recorded statements, on the one hand, and conversations, on the other. See Fed.R.Evid. 106 advisory committee's note (noting that rule \"does not apply to conversations\"). Other circuits have held that Rule 106 does not apply to testimony regarding conversations, see United States v. Haddad, 10 F.3d 1252, 1258 (7th Cir. 1993); United States v. Castro, 813 F.2d 571, 576 (2d Cir.), cert. denied, 484 U.S. 844, 98 L. Ed. 2d 94, 108 S. Ct. 137 (1987), though they have held that Rule 611(a) imposes an obligation for conversations similar to what Rule 106 does for writings. Haddad, 10 F.3d at 1258; Castro, 813 F.2d at 576.\n\nAssuming but not deciding that the government used the recorded statement at trial in a manner that brought it under Rule 106, we agree with the Government that Rule 106 does not require the admission of the excluded portions of Castillo's post-arrest statement. Although different circuits have elaborated Rule 106's \"fairness\" standard in different ways, compare United States v. Li, 55 F.3d 325, 329 (7th Cir. 1995) with Marin, 669 F.2d 73 at 84, common to all is the requirement that the omitted portion be relevant and \"necessary to qualify, explain, or place into context the portion already introduced.\" United States v. Pendas-Martinez, 845 F.2d 938, 944 (11th Cir. 1988); United States v. Crosby, 713 F.2d 1066, 1074 (5th Cir.), cert. denied, 464 U.S. 1001, 78 L. Ed. 2d 696, 104 S. Ct. 506 (1983). Castillo has failed to show how any of the five, excluded portions of his post-arrest statement qualify, explain, or place into context other portions about which Ranger de los Santos testified. We address each excluded statement in turn.\n\nCastillo first argues that the district court improperly excluded paragraph 7G of Ranger de los Santos' report: \"As CASTILLO was about to enter said room, he looked into the room located directly across and observed 'Winston' laying on the floor dead with a gunshot wound to the head.\" According to Castillo, this statement explains why later, after the cease-fire had been declared, he went to the kitchen and picked up an AK-47. The district court excluded the statement as irrelevant to any of the issues in the trial.\n\nWhile we think that the excluded portion was relevant, we are not persuaded that it was necessary to qualify, explain, or place into context Castillo's statement regarding his actions after the cease-fire had been declared. The excluded portion referred to events that occurred in the opening moments of the gun battle on February 28. The cease-fire was declared several hours later. We find no abuse of discretion in the trial court's judgment calls regarding completeness and context.\n\nCastillo next challenges the district court's exclusion of paragraph 7H: \"CASTILLO went into the room identified as McBEAN, SUMMERS, and HIPSMAN'S room. CASTILLO stated he took cover during the shooting, never firing a shot. CASTILLO also stated no one in his room fired a round. CASTILLO claims that he doesn't know who fired a weapon inside.\" According to Castillo, this statement corrects the impression that he fired a gun that day, an impression allegedly created by his earlier statement that he returned to his room and picked up his own 9mm Beretta handgun. The district court excluded the statement as \"a self-serving inculpatory [sic] statement that does not contradict, explain, or qualify the rest of the statement.\" We find no abuse of discretion.\n\nRanger de los Santos testified that Castillo said that he went to his room, picked up his 9mm Beretta handgun, and ran down the hall to another room. The cold fact that he went into his room and picked up his handgun remains unqualified and unexplained. We do not doubt the exculpatory nature of the excluded statement, but that does not require its admission under Rule 106. United States v. Smith, 794 F.2d 1333, 1335 (8th Cir.), cert. denied, 479 U.S. 938 (1986).\n\nCastillo next contests the district court's exclusion of paragraph 10:\n\nCASTILLO states that he heard that Winstom, HIPSMAN, Peter GENT, Perry JONES, and Jaydean WENDEL had been killed. That WENDEL was asleep in bed when she was shot. That GENT had been killed by the helicopters and JONES had been shot in the legs and stomach. That the dead had been taken to the bunker area because they started to smell bad. That he didn't participate in the removal or burial of the dead.\n\nAccording to Castillo, this statement explains why he stood guard in the chapel after February 28. The district court excluded that statement as \"inadmissible hearsay that does not qualify or explain the subject matter of the portion offered by the Government.\" We find no abuse of discretion.\n\nExcluding Castillo's statement about his learning of the deaths of other Davidians did not mislead the jury about Castillo's admission that he had stood guard in the chapel area after February 28. The excluded statement did not tie Castillo's learning of the deaths of the other Davidians and his decision to stand guard after the 28th. The statement does not specify when Castillo learned of the deaths. From the Ranger's report, it appears that Castillo learned of the deaths after he began guard duty.\n\nCastillo next challenges the exclusion of the first sentence of paragraph 11: \"CASTILLO states that he never received firearms training by anybody, but did shoot his weapons a couple of times in the past.\" According to Castillo, this statement was erroneously excluded, while testimony regarding the remainder of paragraph 11 and all of paragraph 12 was admitted. In its amended order, the district court ruled that the statement was excludable as inadmissible hearsay that does not qualify or explain the remainder of paragraph 11.\n\nWe do not reach the merits of the district court's ruling. At trial, Ranger de los Santos did not testify about Castillo's statement, contained in paragraph 11, that he had fired his weapons only a couple of times into bales of hay. Therefore, there was no prejudicial omission for Rule 106 to correct.\n\nFinally, Castillo challenges the exclusion of paragraph 17: \"CASTILLO'S duties at the compound were to help construct the tornado shelter, play drums, and study the Bible.\" According to Castillo, this statement counters the impression that Castillo was part of a conspiracy to murder federal agents. The district court excluded the statement as irrelevant and as inadmissible hearsay that does not clarify or explain any other statement. We agree on both counts. Castillo fails to explain how any of Ranger de los Santos' testimony misled the jury and required the admission of paragraph 17.\n\nIn short, the district court did not abuse its discretion in refusing to admit these portions of Castillo's post-arrest statement pursuant to Rule 106. We acknowledge the danger inherent in the selective admission of post-arrest statements. United States v. Walker, 652 F.2d 708, 713 (7th Cir. 1981). Neither the Constitution nor Rule 106, however, requires the admission of the entire statement once any portion is admitted in a criminal prosecution. See United States v. Mulligan, 573 F.2d 775, 778 (2d Cir.) (rejecting all-or-nothing approach), cert. denied, 439 U.S. 827, 58 L. Ed. 2d 120, 99 S. Ct. 99 (1978). We do no violence to criminal defendants' constitutional rights by applying Rule 106 as written and requiring that a defendant demonstrate with particularity the unfairness in the selective admission of his post-arrest statement. See Wright \u0026 Graham, Federal Practice and Procedure: Evidence § 5077 at 370. This, Castillo failed to do.\n\nV.\n\nEach Davidian contests the sufficiency of the evidence to support his conviction on the various counts. We review the evidence in the record in the light most favorable to the Government and draw all reasonable inferences in favor of the jury's verdict. United States v. Ruggiero, 56 F.3d 647, 654 (5th Cir.), cert. denied, 116 S. Ct. 397 (1995), and cert. denied, 133 L. Ed. 2d 413, 116 S. Ct. 486 (1995). Our review is limited to the determination of whether a reasonable trier of fact could find the evidence established the defendant's guilt beyond a reasonable doubt. United States v. Jaramillo, 42 F.3d 920, 922-23 (5th Cir.), cert. denied, 131 L. Ed. 2d 1013, 115 S. Ct. 2014 (1995). We address the convictions on each count in turn.\n\nA.\n\nThe jury convicted Avraam, Branch, Castillo, and Whitecliff of aiding and abetting the voluntary manslaughter of federal agents in violation of 18 U.S.C. §§ 2, 1112. Significantly, the Davidians do not contest the sufficiency of the evidence establishing that the four ATF agents were killed by gunfire coming from inside the compound. Rather, the Davidians challenge the sufficiency of the evidence that each of them aided and abetted that killing. The gravamen of the defendants' argument is that the Government failed to prove that they participated in the gunbattle or assisted those who killed the four ATF agents on February 28. We disagree.\n\nThe Government must prove that each defendant 1) associated with the criminal venture, 2) participated in the venture, and 3) sought by action to make the venture succeed. Nye \u0026 Nissen v. United States, 336 U.S. 613, 619, 93 L. Ed. 919, 69 S. Ct. 766 (1949); United States v. Menesses, 962 F.2d 420, 427 (5th Cir. 1992). \"To aid and abet simply means to assist the perpetrator of a crime while sharing the requisite criminal intent.\" Jaramillo, 42 F.3d at 923. We have cautioned, however, that \"mere presence and association alone are insufficient to sustain a conviction for aiding and abetting.\" United States v. Martiarena, 955 F.2d 363, 366-67 (5th Cir. 1992).\n\nRenos Avraam\n\nTwo witnesses testified regarding Avraam's activity on February 28. Kathryn Schroeder, a Davidian, testified on behalf of the Government as part of a plea bargain. Several days after the ATF raid, she spoke with Avraam regarding his actions on February 28. He said that he had fired his weapon that morning. She also testified that when she distributed ammunition to the Davidians standing guard after the raid, Avraam told her that he had a .50 caliber rifle with ammunition in the gymnasium near the rear of the compound. She did not see the rifle, but another Davidian confirmed that Avraam had the gun.\n\nBradley Rogans, Avraam's cellmate in the Coryell County jail after his arrest, testified that he spoke with Avraam regarding the events at Mount Carmel on February 28. Avraam told Rogans that he had hid behind a safe during the gunbattle. When Rogans asked whether he had shot at the agents, Avraam responded that he had not. Avraam then laughed, however, and added, \"Well, I'm not a bad shot.\" In addition, Avraam told Rogans that he had a fully automatic gun while he was at the compound.\n\nAvraam admitted to Schroeder that he had fired his weapon during the gunbattle, and Avraam's tongue-and-cheek statement to Rogans that he was a \"good shot\" lent credence to this testimony. Moreover, numerous ATF agents testified that they heard .50 caliber gunfire during the raid. There were only two .50 caliber rifles owned by the Davidians. Schroeder's testimony linked one of the two to Avraam. Based on this evidence, a reasonable jury could find that Avraam aided and abetted the voluntary manslaughter of the federal agents.\n\nBrad Branch\n\nAll three Davidians who were present at the compound on February 28 and who testified at trial witnessed Branch participating in the gunbattle that morning. Victorine Hollingsworth was near her room on the second floor of the compound when gunfire erupted. Early into the gunbattle, she saw Branch on the second floor armed with a rifle. According to Hollingsworth, he ran from room to room, firing in each. At one point, she overheard Branch, who was in a room facing the front of the compound where the ATF agents were, exclaim, \"He nearly got me and I got one.\"\n\nMarjorie Thomas confirmed Hollingsworth's account. Thomas saw Branch with a gun on the second floor moving from room to room. After the gunbattle, Thomas guarded the chapel with Branch, Whitecliff, and another Davidian. At one point, she overheard Branch tell the others that he had shot someone on the outside during the ATF raid. In addition, Kathryn Schroeder, who remained in her room on the first floor at the front of the compound during the gunbattle, testified that she heard Branch \"yelling, running around the hallways, very hyper.\" Based on this evidence, a reasonable jury could find that Branch actively participated in the gunbattle on February 28.\n\nJaime Castillo\n\nThe most incriminating evidence against Castillo came from Castillo himself. According to his own post-arrest statement, Castillo awoke very early in the morning on February 28. He got dressed in camouflage clothing and went outside to begin working on the underground bunker the Davidians were constructing. The cold morning air prompted him to return to bed. Sometime later, he heard someone say something was going to happen that morning. He got out of bed again but, this time, got dressed in black clothing. He put on a vest holding eight magazines of ammunition and retrieved his AR-15 assault rifle. Looking out the window of his room on the front of the compound, he saw two cattle trailers approaching the compound. He joined Koresh and others at the front door. After gunfire erupted through the door, he attempted to chamber a round in his rifle, but it jammed. He returned to his room, retrieved a 9mm Beretta pistol he had purchased himself, and went down the hall to another room on the first floor facing the front of the compound.\n\nAccording to his statement, after the cease-fire was declared, Castillo went to the kitchen area toward the rear of the compound. He grabbed an AK-47 lying on the kitchen table and proceeded to the rear door of the compound. He observed two wounded ATF agents, one on the roof and one on the ground. In addition, he saw four agents searching for the wounded agents.\n\nOther witnesses corroborated and supplemented Castillo's account of his actions during the gunbattle. Marjorie Thomas witnessed Castillo with a gun on the second floor of the compound during the gunfight. According to Thomas, he looked around and then left. Kathryn Schroeder testified that, after the gunbattle, Castillo informed her that he had been at the front door with Koresh but had returned to his room.\n\nSpecial Agent Bernadette Griffin, one of the four agents sent to rescue ATF agent King at the rear of the compound, confirmed Castillo's presence at the rear of the compound during the cease-fire. She saw an individual at the rear door of the compound with a gun, who she later identified as Castillo. According to Griffin, Castillo watched the agents and briefly aimed his weapon at her while they were rescuing Agent King.\n\nFinally, during the subsequent stand-off with the FBI, Schroeder asked Castillo about his weapon and need for ammunition. Castillo informed her that he had an AK-47, along with ammunition for it. Schroeder offered more ammunition, but Castillo refused, stating, \"Well, I don't want more, I don't want any more than what I've got.\"\n\nBased on this evidence, a reasonable jury could find that Castillo actively participated in the gunbattle on February 28. His actions were not those of a passive witness but rather evince an active role in the firefight. The jury could reasonably infer the intent to repel the ATF agents with deadly force from his dress, his attempt to chamber a round at the front door, and his immediate flight to his room to retrieve another weapon. Moreover, despite the absence of direct evidence that he fired his weapon that morning, the jury could reasonably find that he did shoot at the ATF agents. Numerous ATF agents testified regarding the large volume of gunfire coming from the rooms at the front of the compound, and Castillo admitted that he was in a room at the front, armed with a gun, during the gunbattle.\n\nKevin Whitecliff\n\nKathryn Schroeder testified that, after the gunbattle, Whitecliff told her that he had fired at the helicopters approaching from the north. In addition, Whitecliff stood guard in the chapel with Marjorie Thomas after the gunbattle. During that time, Thomas overheard Whitecliff claim that he had shot someone outside the compound during the ATF raid. Based on this evidence, a reasonable jury could conclude that Whitecliff actively participated in the gunbattle on February 28. Indeed, on appeal, Whitecliff concedes that he was shooting towards the helicopters to the north.\n\nFinally, in response to this evidence showing their participation in the gunbattle, the defendants argue that the Government did not prove who actually killed the agents and that each one of them assisted those individuals or small group of individuals. According to the Davidians, mere participation in the gunbattle itself is insufficient to convict them of aiding and abetting the voluntary manslaughter of federal agents killed during the gunbattle. Along this line, Whitecliff emphasizes that he shot toward the helicopters to the north of the compound, while the four ATF agents were killed on the other side of the compound. We are not persuaded.\n\nIn a prosecution for aiding and abetting a crime, the Government need not identify a specific person or group of individuals as the principal. United States v. Campa, 679 F.2d 1006, 1013 (1st Cir. 1982); Hendrix v. United States, 327 F.2d 971, 975 (5th Cir. 1964). To the contrary, the Government need only show that \"the substantive offense had been committed by someone and that the defendant aided and abetted him.\" Campa, 679 F.2d at 1013; see also United States v. Yost, 24 F.3d 99, 104 (10th Cir. 1994) (\"All that is required for a conviction based on 18 U.S.C. § 2 is a finding that [the defendant] aided someone in committing the crime.\") (emphasis in original). The Government never claimed to be able to prove who fired the specific rounds that killed the four ATF agents. The inability to identify the actual gunmen, however, does not negate the evidence proving that someone in the compound killed the agents.\n\nMoreover, the defendant need not fire a weapon to aid and abet murder or manslaughter. Cf. United States v. Villarreal, 963 F.2d 725, 730 (5th Cir.) (holding that subduing victim aided and abetted murder), cert. denied, 506 U.S. 927, 121 L. Ed. 2d 267, 113 S. Ct. 353 (1992). We find no difficulty in holding that actively participating in a gunbattle in which a gunmen kills a federal officer can aid and abet that killing.\n\nWe affirm the convictions on Count 2.\n\nB.\n\nThe jury convicted Avraam, Branch, Castillo, Craddock, and Whitecliff of using or carrying a firearm during and in relation to the commission of a crime of violence in violation of 18 U.S.C. § 924(c)(1). The jury acquitted Fatta on this count.\n\nTo sustain the Davidians' convictions under 18 U.S.C. § 924(c)(1), the Government must prove that the defendant \"used or carried a firearm\" and that the use or carrying was \"during and in relation to\" a \"crime of violence.\" Smith v. United States, 508 U.S. 223, 113 S. Ct. 2050, 2053, 124 L. Ed. 2d 138 (1993); United States v. Harris, 25 F.3d 1275, 1279 (5th Cir.), cert. denied, 130 L. Ed. 2d 366, 115 S. Ct. 458 (1994). The Davidians contend that there is insufficient evidence of the three elements. We address each element in turn, beginning with the last.\n\n1.\n\nThe predicate crime of violence charged in the indictment was conspiracy to murder federal agents in violation of 18 U.S.C. § 1117 as charged in Count 1. The crime of conspiracy contains three elements: 1) two or more people agreed to pursue an unlawful objective; 2) the individual defendant voluntarily agreed to join the conspiracy; and 3) one or more of the members of the conspiracy performed an overt act to further the objectives of the conspiracy. United States v. Baker, 61 F.3d 317, 325 (5th Cir. 1995). When the object of the conspiracy is second-degree murder, the Government must additionally prove that the individual defendant conspired to kill with malice aforethought. United States v. Chagra, 807 F.2d 398, 401, 403 (5th Cir. 1986), cert. denied, 484 U.S. 832, 98 L. Ed. 2d 66, 108 S. Ct. 106 (1987); United States v. Harrelson, 754 F.2d 1153, 1172-73, reh'g denied, 766 F.2d 186, 189 (5th Cir.), cert. denied, 474 U.S. 908, 88 L. Ed. 2d 241, 106 S. Ct. 277 (1985), and cert. denied, 474 U.S. 1034, 88 L. Ed. 2d 578, 106 S. Ct. 599 (1985).\n\nThe Davidians argue that, even if a conspiracy to murder federal agents existed, there is insufficient evidence showing that each voluntarily joined that conspiracy. According to the Davidians, they were each excluded from Koresh's inner circle and knew nothing of his murderous plans. We are not persuaded.\n\nThat the jury acquitted the defendants of the predicate crime of conspiracy to murder federal agents as charged in Count 1 did not negate the jury's guilty verdict on Count 3. \"It is only the fact of the offense, and not a conviction, that is need to establish the required predicate.\" Munoz-Fabela, 896 F.2d at 910-11; Ruiz, 986 F.2d at 911 (holding that acquittal on predicate offense does not bar conviction under 18 U.S.C. § 924(c)).\n\nThe record is replete with evidence of a conspiracy to murder federal agents and each individual defendant's membership in that conspiracy. In \"Bible studies,\" Koresh taught that there would be a battle between the \"beast\" and the Davidians. There was no doubt that the \"beast\" was the ATF and FBI. Indeed, residents watched a film entitled \"Breaking the Law in the Name of the Law: The ATF Story,\" an unfavorable portrayal of the ATF. Koresh also told the women to become strong so as to prevent the U.S. Army from raping them.\n\nThe evidence in the record also shows how Koresh expected the residents to respond if the \"beast\" approached the compound. Koresh instructed the Davidians to kill the \"enemy\", an instruction driven home by Koresh's admonition that \"if you can't kill for God, you can't die for God.\" Indeed, final salvation and deliverance to Heaven--or \"translation\" as the Davidians called it--could occur either through immediate delivery to Heaven or through death in battle.\n\nKoresh and the Davidians began preparing for this final battle. The Davidians fortified the compound, building an underground shelter. Koresh, along with Paul Fatta and Mike Schroeder, purchased large amounts of weapons and ammunition. Koresh incorporated firearms into his apocalyptic message. Weapons were often passed out at Bible studies, while Koresh instructed the Davidians in their use and maintenance. Residents practiced shooting, at times aiming at a target head. The women sewed vests and black pants capable of holding multiple ammunition magazines for all of the men. At Passover in the Spring of 1992, Koresh announced that it would be the last Passover, that the end was coming. In short, there was a climate of both fear and aggression at Mount Carmel prior to February 28.\n\nAt the least, the conspiracy to murder federal agents matured on February 28. The defendants' conduct on that day more than suffices to demonstrate both the existence of the conspiracy and their membership in it.\n\nShortly before the raid, ATF undercover agent Roberto Rodriguez visited the compound and spoke with Koresh. During their conversation, Koresh was informed that he had a phone call and left the room. When Koresh returned, he was \"literally shaking.\" Koresh told Rodriguez, \"Robert, neither the ATF or National Guard will ever get me. They got me once and they'll never get me again.\" Koresh looked out the front windows and repeatedly exclaimed, \"They're coming, Robert. The time has come.\"\n\nAfter Rodriguez left, the evidence shows that Koresh and the other Davidians began preparing for the ATF raid. Sometime during the morning, both Kathryn Schroeder and Victorine Hollingsworth learned that all the women were to go to the chapel. When they got there, they noticed that no men were present. Koresh later came into the chapel and told the women to get back to their rooms and \"watch\". According to Schroeder, Koresh was wearing a black, magazine vest and carrying an AK-47. Other men at the compound were also dressed in black clothing and carried weapons, and Kathryn Schroeder testified that the Davidians loaded ammunition prior to the raid.\n\nContrary to the defendants' arguments, the evidence supports the jury's Conclusion that each was a member of this conspiracy, that each was a \"Member of the Message.\" Koresh's \"Bible studies\" were an integral part of the conspiracy. As both Kathryn Schroeder and Victorine Hollingsworth testified, all adult Davidians were expected to attend these studies and usually did. Hollingsworth confirmed that Craddock usually attended Koresh's studies.\n\nThe actions of each defendant on the morning of the ATF raid and thereafter signal membership in this conspiracy. To repeat: Each defendant actively participated in the gunbattle. Branch roamed the second floor, firing in each room. Whitecliff shot at the helicopters. Castillo attempted to shoot while he was at the front door with Koresh; he later kept armed watch over the four ATF agents rescuing Agent King. Although no one saw Avraam fire during the gunbattle, Avraam told Schroeder afterwards that he had done so.\n\nThe evidence also shows that Craddock, who was acquitted of aiding and abetting the voluntary manslaughter of federal agents, was a member of the conspiracy to murder the agents. On April 19, after fleeing the blazing compound, Craddock gave a post-arrest statement and, the next day, testified before a grand jury. Craddock's post-arrest statement and grand jury testimony belie his claim of innocence.\n\nCraddock arrived at Mount Carmel almost a full year before the ATF raid. He received firearms training, and, two weeks before the ATF raid, he was issued a pistol and an AR-15, which he kept in his room. On February 28, Craddock learned of the impending ATF raid. He saw Rodriguez meeting with Koresh and overheard Koresh say, \"They're coming. Whether the BATF or FBI or whatever, they are coming.\" Peter Hipsman confirmed the likelihood of an ATF raid later that morning, telling Craddock that David Jones had been outside the compound and had heard that approximately 75 ATF agents had arrived at the Waco airport. Tellingly, after learning of the impending ATF raid, Craddock returned to his room and retrieved his AR-15. He got dressed in black clothing and donned his ammunition vest. Later, he went to the kitchen to get ammunition for his 9mm handgun, which he loaded. When asked why he did these things, Craddock responded, \"I did what I think was expected of me.\" Even in spite of Craddock's self-serving claim that he did not shoot at the ATF agents that morning, a reasonable jury could find that he was a member of the conspiracy to murder federal agents.\n\nA reasonable jury could also have found that this conspiracy continued long after the February 28 raid. After the cease-fire, the Davidians developed a plan to exit the compound, fire at the agents, and die in the ensuing battle. Although the Davidians did not execute that plan, the remaining residents engaged in a stand-off with the FBI for over fifty days. Whitecliff and Branch stood guard in the chapel with an FN-FAL and M-1A, respectively. Castillo stood guard with an AK-47 in his room on the first floor. Craddock, who had an AR-15, kept his armed vigil in Kathryn Schroeder's bedroom on the first floor. Avraam stood guard above the gym or chapel with a .50 caliber rifle. As Kathryn Schroeder and Marjorie Thomas, both of whom also stood guard, testified, the Davidians were instructed to open fire if the FBI attempted to enter the compound. Craddock maintained an electrical generator and kept the telephone line in working order.\n\nThe compound residents were free to leave Mount Carmel at any time. The Davidians chose to remain, to stand guard against the FBI, and, if necessary, to use deadly force to repel the FBI.\n\nThe defendants argue that this evidence only shows that they were present at Mount Carmel and associated with some of the residents there. See United States v. Espinoza-Seanez, 862 F.2d 526, 538-39 (5th Cir. 1988) (reversing conspiracy conviction based on mere association with conspirators and presence in foul climate). But a reasonable juror could see an entirely different picture, not innocent individuals caught \"in the wrong place, at the wrong time,\" but active participants in an armed camp, willing to defend that camp with deadly force and to die with the firm belief that eternal salvation was their divine reward.\n\nCraddock separately argues that there was insufficient evidence that he conspired to murder federal agents with malice aforethought. In particular, Craddock emphasizes that he did not fire a shot the day of the ATF raid and, therefore, cannot have had the requisite mental state. Even accepting this self-serving factual assertion, we disagree with the legal Conclusion Craddock draws from it.\n\nMalice aforethought means \"an intent, at the time of a killing, wilfully to take the life of a human being, or an intent wilfully to act in callous and wanton disregard of the consequences to human life; but 'malice aforethought' does not necessarily imply any ill will, spite or hatred towards the individual killed.\" Harrelson, 766 F.2d at 189 n.5 (quoting 2 E. Devitt \u0026 C. Blackmar, Federal Jury Practice and Instructions 215 (1977)). The evidence shows that Craddock attended Bible studies, at which Koresh preached of the need to kill the enemy; that Craddock received several firearms and participated in firearms training; that, upon learning of the impending ATF raid on February 28, he changed clothing and retrieved his weapons; and that, after the raid, he chose to remain in the compound during the stand-off, despite the possibility of further bloodshed. Cf. Chagra, 807 F.2d at 404 (rejecting non-gunman's insufficiency of evidence challenge to conviction for conspiracy to murder).\n\nBased on this evidence, a reasonable jury could find that a conspiracy to murder federal agents existed and that each of the five defendants voluntarily joined that conspiracy with the requisite mental state.\n\n2.\n\nWe are also persuaded that sufficient evidence supports the conviction for using or carrying a firearm during the conspiracy. In Bailey v. United States, 133 L. Ed. 2d 472, 116 S. Ct. 501, 509 (1995), the Supreme Court reversed the § 924(c)(1) gun convictions of two defendants, one of whom had kept an undisclosed firearm in a footlocker in a bedroom closet and the other of whom had concealed an undisclosed firearm in the trunk of his car. The Court explained that \"use\" required more than \"mere possession\" of a firearm by the defendant. 116 S. Ct. at 506. Rather, the Government must show \"active employment\" of the firearm. Id.\n\nThe \"active employment\" requirement is not an overly taxing one. The Court gave several examples of conduct constituting \"active employment,\" among them, \"brandishing, displaying, bartering, striking with, and most obviously, firing or attempting to fire, a firearm.\" Id. at 508. While the Court held that storing a concealed weapon nearby for potential use did not constitute \"active employment,\" it noted that \"an offender's reference to a firearm in his possession could satisfy § 924(c)(1).\" Id. Finally, the Court held out the possibility that the \"carry\" prong of § 924(c)(1) reached conduct that the \"use\" prong did not. Id. at 509.\n\nLike the Supreme Court in Bailey, we need not address whether the evidence suffices to establish that the defendants \"carried\" a firearm during the conspiracy. The evidence is overwhelming that each of the five defendants \"used\" a firearm as the Supreme Court has defined the term. The evidence demonstrates that Branch and Whitecliff fired their weapons on the 28th. By his own admission, Castillo attempted to chamber a round at the front door and, after the cease-fire, brandished a weapon while the ATF rescued one of its injured agents. Similarly, according to his own statements, Craddock retrieved his AR-15 assault rifle, loaded ammunition into his handgun, and awaited instructions. Finally, Avraam admitted to Schroeder that he had fired a weapon on February 28.\n\nThere was also evidence that after the ATF raid, all of the defendants stood watch in the compound with loaded firearms. In particular, FBI Special Agent Toulouse witnessed a .50 caliber rifle protruding from a hole in wall of the compound near the rear. Avraam reportedly stood guard in that area with one of the Davidians' two .50 caliber rifles. Based on this evidence, a reasonable jury could find that the defendants used a firearm during the conspiracy.\n\n3.\n\nLastly, the defendants claim that the evidence is insufficient to show that each used a firearm \"during and in relation\" to the conspiracy to murder federal agents. In particular, Branch argues that the evidence only indicates that he used his firearm in self-defense. We disagree.\n\nThere is no question that each defendant used his firearm \"during\" the conspiracy. See Smith, 113 S. Ct. at 2058. Nor is there any question that each used his firearm \"in relation\" to the conspiracy. In Smith, the Supreme Court explained that § 924(c)(1)'s requirement that the firearm be used \"in relation to\" the predicate offense ensures that the firearm must have \"some purpose or effect with respect to\" the predicate offense, that it \"facilitate or have the potential of facilitating\" that crime. Id. at 2059 (alterations omitted). Stated negatively, the firearm's presence or involvement \"cannot be the result of accident or coincidence.\" Id.\n\nThe use of the firearms during and after February 28 was not accidental; it was part and parcel of the conspiracy to murder federal agents. We have affirmed § 924(c)(1) convictions where the relationship between the firearm and the predicate offense has been far more attenuated than here. See United States v. Wilson, 884 F.2d 174, 177 (5th Cir. 1989).\n\nFinally, Whitecliff's argument that the evidence does not show that he used his firearm during and in relation to the conspiracy to murder the federal agents \"at the front door\" misapprehends the scope of the conspiracy. The conspiracy to murder federal agents did not end with the death of the four agents on February 28. Rather, there was evidence that beginning prior to February 28 and continuing for almost two months after the ATF raid, the defendants conspired to kill any federal agent who attempted to approach the compound. Firing at the National Guard helicopters approaching the compound and standing guard during the ensuing stand-off was Whitecliff's contribution to that conspiracy.\n\nIn sum, we are persuaded that the evidence supports the Davidians' convictions for violating § 924(c)(1). We affirm the convictions on Count 3.\n\nC.\n\nThe jury convicted Fatta of conspiring to unlawfully manufacture and possess machineguns and of aiding and abetting the unlawful possession of machineguns, both in violation of 18 U.S.C. § 922(o). We address both counts jointly.\n\nWhether the object of the conspiracy is murder or the unlawful manufacture and possession of machineguns, the Government must prove the same three elements: 1) two or more people agreed to pursue the unlawful objective; 2) the individual defendant voluntarily agreed to join the conspiracy; and 3) one or more of the members of the conspiracy performed an overt act to further the objectives of the conspiracy. Baker, 61 F.3d at 325. Similarly, whether the crime is voluntary manslaughter or possession of machineguns, the Government must prove that each defendant 1) associated with the criminal venture, 2) participated in the venture, and 3) sought by action to make the venture succeed. Nye \u0026 Nissen, 336 U.S. at 619; Menesses, 962 F.2d at 427.\n\nFatta argues that there is no evidence showing that he knew of or voluntarily agreed to join the conspiracy to manufacture and possess machineguns. According to Fatta, the evidence shows only that he lawfully purchased firearms, ammunition, and accessories. He emphasizes that other Davidians, not he, purchased the parts and tools for converting semiautomatic weapons to fully automatic ones. Finally, Fatta argues that there is no evidence that he assisted Koresh in possessing machineguns.\n\nThe evidence at trial supports the jury's verdict on both counts. After Koresh began preaching about the upcoming confrontation with the \"beast\", Paul Fatta began traveling to gun shows and purchasing weapons. Firearm records indicated that Fatta purchased a large number of firearms and related accessories in the two years prior to the ATF raid. Included among Fatta's purchases were semiautomatic AK-47 and .308 caliber FN-FAL assault rifles, magazines, and cases of ammunition. In December 1991, Fatta traveled with Koresh to Indiana to purchase guns. On that trip, Koresh and Fatta together bought approximately $25,000 worth of firearms.\n\nThe evidence also demonstrates that the Davidians were engaged in the conversion of semiautomatic firearms to fully automatic firearms. Kathryn Schroeder testified that fully automatic guns were made at the compound and that the residents knew about it. According to Schroeder, Koresh announced at a Bible study that \"we're going to take a gun that goes rat-tat-tat and make it into a gun that goes rata-tat-tat.\" Indeed, numerous fully-automatic weapons were recovered from the ruins of Mount Carmel after April 19.\n\nInvoices from firearm suppliers confirmed Schroeder's testimony. The Davidians had ordered parts and tools used in manufacturing fully automatic weapons. These items were shipped to the Mag Bag, a garage located a short distance from the compound used by the Davidians for the buying and selling of firearms. In particular, conversion kits, along with books and videotapes on how to convert semiautomatic weapons into fully automatic machineguns, were shipped to the Mag Bag.\n\nThe evidence left no doubt as to Fatta's involvement in the Davidians' automatic weapons operations. Two of the fully automatic weapons recovered from the ruins of Mount Carmel had been purchased by Fatta as semiautomatic weapons and later converted. Fatta's personal checks were discovered in the machine room where the Davidians manufactured machineguns and silencers.\n\nMoreover, the evidence demonstrated Fatta's involvement with the Mag Bag. Fatta procured a Texas Sales/Use Tax Permit in February 1992 for the Mag Bag. The application for the permit listed Fatta as the owner of the Mag Bag, and, contrary to Fatta's suggestion that the Mag Bag was simply an automotive repair shop, it indicated that \"gun and firearm accessories\" were the \"primary product\" sold by the Mag Bag. Numerous firearm purchase invoices and related documentation also confirmed Fatta's association with the Mag Bag. In fact, among the items found in a search of the Mag Bag was a phone bill addressed to the Mag Bag listing Fatta as the account name. Based on this evidence, a reasonable jury could find that Fatta voluntarily joined the conspiracy to manufacture and possess machineguns.\n\nIn response, Fatta argues that, even so, there is no direct evidence of his knowledge that the weapons were machineguns. Even more brazenly, Fatta claims that the Government must prove that he knew his conduct was illegal, relying on Ratzlaf v. United States, 510 U.S. 135, 126 L. Ed. 2d 615, 114 S. Ct. 655 (1994). We disagree with both arguments.\n\nThe Government may prove Fatta's knowledge through either direct or circumstantial evidence. Staples v. United States, 511 U.S. 600, 128 L. Ed. 2d 608, 114 S. Ct. 1793, 1802 n.11 (1994) (noting that knowledge of machinegun's status as such \"can be inferred from circumstantial evidence\"). There was abundant circumstantial evidence of Fatta's knowledge that machineguns were being manufactured and possessed by Koresh and the other Davidians. See United States v. Tylkowski, 9 F.3d 1255, 1260 (7th Cir. 1993).\n\nNor must the Government prove Fatta knew his conduct to be illegal. Cheek v. United States, 498 U.S. 192, 111 S. Ct. 604, 609, 112 L. Ed. 2d 617 (1991); Staples, 114 S. Ct. at 1805 n.3 (Ginsburg, J., Concurring in the judgment). Fatta's reliance on Ratzlaf is misplaced. Ratzlaf was a prosecution under 31 U.S.C. § 5322(a) for structuring a financial transaction for the purpose of evading currency reporting requirements. There, the Supreme Court found that Congress in that particular statute had chosen to depart from the general rule that ignorance of the law is no defense to a criminal charge. Id. at 663. Fatta offers no argument based on statutory text, legislative history, or case law suggesting that Congress has acted in a similar fashion with regard to § 922(o). Nor could he. See United States v. Farrell, 69 F.3d 891, 893 (8th Cir. 1995) (holding that § 922(o) does not require knowledge of law or intent to violate it), cert. denied, 134 L. Ed. 2d 228, 116 S. Ct. 1283 (1996).\n\nIn sum, a reasonable jury could find that Fatta willingly joined a conspiracy to manufacture and possess machineguns. In addition, the jury could find that he aided and abetted Koresh in possessing machineguns.\n\nVI.\n\nThe district court sentenced Avraam, Branch, Castillo, and Whitecliff to the statutory maximum of 10-years imprisonment on Count 2 and to 30-years imprisonment on Count 3, such terms to be served consecutively; Craddock to 10-years imprisonment on Count 3 and to 10-years imprisonment on Count 7, such terms to be served consecutively; and Fatta to consecutive prison sentences of 5 years for Count 9 and 10 years for Count 10. In addition, the district court ordered all of the Davidians to pay restitution of over $1.1 million.\n\nWe first address the defendants' challenge to their sentences on Count 3 for using or carrying a firearm during and in relation to a crime of violence. We then turn to the defendants' individual sentencing claims. We conclude our review with the restitution order.\n\nA.\n\n18 U.S.C. § 924(c)(1) defines both the crime and the applicable sentence. It provides:\n\nWhoever, during and in relation to any crime of violence or drug trafficking crime . . ., uses or carries a firearm, shall, in addition to the punishment provided for such crime of violence or drug trafficking crime, be sentenced to imprisonment for five years, and if the firearm is a short-barreled rifle, short-barreled shotgun, or semiautomatic assault weapon, to imprisonment for ten years, and if the firearm is a machinegun, or a destructive device, or is equipped with a firearm silencer or firearm muffler, to imprisonment for thirty years.\n\nFinding that each of the five defendants had used or were criminally responsible for someone who had used a machinegun during the conspiracy, the district court sentenced Avraam, Branch, Castillo, and Whitecliff to 30-years imprisonment. Although the district court found that Craddock was also subject to the 30-year sentence, it departed downward from the mandatory statutory term and sentenced Craddock to only 10-years imprisonment on Count 3. The United States has not cross-appealed Craddock's sentence on this count.\n\nThe Davidians claim that the district court improperly enhanced their sentences for using a machinegun. The Davidians point out that the indictment did not allege nor did the jury find that each had used a machinegun. Rather, the indictment alleged and the jury found only that each had used a \"firearm\". According to the Davidians, the determination whether the defendant used one of the aggravating firearms enumerated in § 924(c)(1) lies with the jury, not the court at sentencing. Consequently, the Davidians ask us to vacate their sentence on that count and remand with instructions to impose only a 5-year prison sentence on Count 3.\n\nThe validity of the district court's action turns upon whether § 924(c)(1)'s machinegun provision creates a separate, independent offense or is a sentence-enhancement provision. This question is one of first impression. The United States and the Davidians rely on the case law, waging a war of dicta. We begin with first principles.\n\nWhether § 924(c)(1)'s machinegun provision \"creates an independent federal offense or is merely a sentence-enhancement provision is a matter of legislative intent.\" United States v. Jackson, 891 F.2d 1151, 1152 (5th Cir. 1989) (per curiam), cert. denied, 496 U.S. 939, 110 L. Ed. 2d 668, 110 S. Ct. 3221 (1990). In prior cases, we have suggested that four factors are illuminating: 1) whether the statute predicates punishment upon conviction under another section; 2) whether the statute multiplies the penalty received under another section; 3) whether the statute provides guidelines for the sentencing hearing; and 4) whether the statute is titled as a sentencing provision. Id. These factors, however, complement and do not substitute for our traditional tools of statutory interpretation, namely, the statute's text and legislative history. See United States v. Davis, 801 F.2d 754, 755 (5th Cir. 1986) (enumerating four factors but explaining that statute's text is \"primary guide to congressional intent\").\n\nSection 924(c)(1) defines a crime whose existence turns upon the commission of another crime. The statute requires another offense--either a \"crime of violence or drug trafficking crime\"--though, as we have made clear, the defendant need not be charged or convicted of that predicate offense. The relationship between § 924(c)(1) and the predicate crime of violence or drug trafficking crime is not at issue here. Decisions discussing that relationship are, therefore, not helpful. See Munoz-Fabela, 896 F.2d at 910 (holding that § 924 provides independent basis for criminal liability from predicate offense). The key is the relationship between prohibiting the use or carrying of a firearm during such predicate offense (the firearm clause) and mandating a 30-year sentence when the firearm is a machinegun (the machinegun clause).\n\nThe text of § 924(c)(1) forecloses neither of these two competing readings of the statute. The legislative history and statutory structure, however, persuade us that the machinegun clause of § 924(c)(1) is a sentence-enhancement provision.\n\nThe Gun Control Act of 1968, Pub. L. No. 618, § 102, 82 Stat. 1213 (1968), created § 924(c), which provided in relevant part:\n\nWhoever--\n\n(1) uses a firearm to commit any felony which may be prosecuted in a court of the United States, or\n\n(2) carries a firearm unlawfully during the commission of any felony which may be prosecuted in a court of the United States,\n\nshall be sentenced to a term of imprisonment for not less than one year nor more than 10 years.\n\nCongress later merged the two clauses into the text we know today but did not distinguish among types of firearms. The Comprehensive Crime Control Act of 1984, Pub. L. No. 473, § 1005, 98 Stat. 1837, 2138 (1984).\n\nIn 1986, Congress enacted the Firearms Owners' Protection Act, Pub. L. No. 99-308, § 104, 100 Stat. 449, 456 (1986), adding the machinegun clause to the statute. Congress appended the machinegun clause to the firearm clause, rather than create a new section.\n\nThe House Report accompanying the 1986 Act explained that the provision \"added a new mandatory prison term . . . for using or carrying a machinegun during and in relation to a crime of violence\" and referred to the provision as the \"enhanced penalty for machine gun use in crime.\" See H. Rep. No. 495, 99th Cong., 2d Sess. 28 (1986), reprinted in 1986 U.S.C.C.A.N. 1327, 1354. Floor debates also referred to the provision as requiring a \"mandatory prison term\", providing \"mandatory penalties\", or requiring \"stiff mandatory sentences\" for use of a machinegun. See 132 Cong.Rec. 9603 (statement of Sen. McClure); 132 Cong.Rec. 3809 (statement of Rep. Hughes), 4512 (statement of Rep. Hughes), 6837 (statement of Rep. Hughes), 6843 (statement of Rep. Volkmer), 6850 (statement of Rep. Moore), 6856 (statement of Rep. Wirth), 6857 (statement of Rep. Gallo), 7081 (statement of Rep. Gallo). Representative Hughes described the provision as \"creating a new extra mandatory prison term for carrying a machinegun.\" 132 Cong.Rec. H1646. Noticeably absent from both the House Report and the floor debates was any Discussion suggesting the creation of a new offense.\n\nSubsequent acts increased the mandatory prison term for using or carrying a machinegun and subjected criminals who use or carry destructive devices or other types of firearms to the enhanced penalties. See Anti-Drug Abuse Act of 1988, Pub. L. No. 690, § 6460, 102 Stat. 4181, 4373 (1988); Crime Control Act of 1990, Pub. L. No. 647, § 1101, 104 Stat. 4789, 4829 (1990). At no point did Congress indicate that it intended to create a new, separate offense for those weapons. See H. Rep. No. 681, 101st Cong., 2d Cong. 107 (1990), reprinted in 1990 U.S.C.C.A.N. 6472, 6511 (describing amendment to section as intending \"to increase the mandatory additional penalties for using or carrying certain weapons during a crime of violence or a drug felony\"); 134 Cong.Rec. S17360 (Judiciary Committee section analysis) (describing amendment to section as increasing the \"mandatory penalty\" for using a machine gun).\n\nThe defendants rely on our suggestion in United States v. Correa-Ventura, 6 F.3d 1070, 1087 n.35 (5th Cir. 1993), that § 924(c) may require the jury to agree on which type of weapon was used \"in order for the court to assess the appropriate penalty.\" Correa-Venture held, however, that the jury need not agree on which firearm was actually used by the defendant where all of the firearms were from the same class of weapons. The suggestion was dicta.\n\nIn addition, for support for the suggestion, we cited the Sixth Circuit's opinion in United States v. Sims, 975 F.2d 1225, 1235-36 (6th Cir. 1992), cert. denied, 507 U.S. 932 (1993), and cert. denied, 507 U.S. 998 (1993), and cert. denied, 507 U.S. 999 (1993). Sims, upon which the Davidians also rely, did not address the issue here. Rather, Sims held that, where the Government charges two separate § 924(c) counts, one for a \"firearm\" and one for an enhancing weapon, such as a machinegun, the district court \"must consolidate those section 924(c) counts so that no defendant will be convicted on more than one gun count relative to the one drug trafficking offense.\" Id. at 1235. Sims did not hold that the Government must charge the defendant with using an enhanced firearm. See also United States v. Martinez, 7 F.3d 146 (9th Cir. 1993). That the Government can include separate counts in the indictment for each type of firearm does not answer our statute.\n\nNor is the Davidians' reliance on United States v. Melvin, 27 F.3d 710 (1st Cir. 1994), well-placed. The jury convicted Melvin of using a \"firearm\", and he was sentenced to a five-year term as specified in § 924(c). The Government appealed, arguing that given the prevalence of machineguns among the other firearms, a finding that defendants used machineguns was \"implicit and inescapable\" from the jury's verdict. Id. at 714. The First Circuit disagreed, holding that \"our task in these circumstances, however, is not to determine whether the evidence and argument could support the government's interpretation of the jury's verdict, but whether it inevitably must lead to such a construction.\" Id. On the facts before it, the First Circuit concluded that it could not exclude the possibility that the jury had convicted the defendants based on a finding that they possessed only a firearm and not the machineguns. Id. at 715.\n\nIn Melvin, the Government conceded that the 30-year term is available \"only if the jury specifically identifies a machine gun or silencer as the firearm supporting the conviction.\" Id. at 714.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The court expressly refused to consider the validity of that reading of § 924(c). See id. at 715 n.9 (refusing to consider whether it is jury's or court's role to find nature of weapon used by defendant). Unlike Melvin, the Government here has contested that interpretation of § 924(c).\n\nThe statute's structure and its legislative history persuade us that Congress did not intend to create a new, separate offense by adding the machinegun clause to § 924(c). The Government need not charge in the indictment nor must the jury find as part of its verdict the particular type of firearm used or carried by the defendant.\n\nThe Davidians next argue that, even so, there is insufficient evidence for the district court to find by a preponderance of the evidence that each one of them used or carried a machinegun during and in relation to the conspiracy to murder federal agents. The district court found that \"each either had actual or constructive possession of the numerous fully automatic weapons and hand grenades present in the Compound before February 28, 1993 and through the 51 day siege.\"\n\n§ 924(c) requires more than \"mere possession\" of a firearm by the defendant. Bailey v. United States, 133 L. Ed. 2d 472, 116 S. Ct. 501, 506, 509 (1995). The Government must show \"active employment\" of the firearm. Id. The district court did not have the benefit of Bailey and found only that each defendant had actual or constructive possession of an enhanced weapon. This finding does not meet the statutory requirement as read by Bailey.\n\nAs we have explained, there is evidence from which it could be found that machineguns and other enhancing weapons were used by one or more members of the conspiracy in the firefight of February 28. The jury was not required to do so and the district court entered only those findings then required. With Bailey the district court must take another look and enter its findings regarding \"active employment.\" Should the district court find on remand that members of the conspiracy actively employed machineguns, it is free to reimpose the 30-year sentence. We vacate the defendants' sentences on Count 3 and remand for resentencing on that count.\n\nWe note that, on remand, the district court should consider whether the defendants actively employed a weapon during and in relation to the conspiracy to murder federal agents.\n\nB.\n\nBranch, Castillo, Craddock, and Fatta raise numerous objections to the district court's application of the Sentencing Guidelines. We review the application of the sentencing guidelines de novo and its findings of fact for clear error. United States v. Palmer, 31 F.3d 259, 261 (5th Cir. 1994). We address the sentence on each count in turn.\n\n1.\n\nThe district court sentenced Avraam, Branch, Castillo, and Whitecliff to the statutory maximum 10-years imprisonment on Count 2 for aiding and abetting the voluntary manslaughter of federal agents. Branch and Castillo contest the application of the Sentencing Guidelines on Count 2.\n\nThe district court began with the base offense level of 25 from U.S.S.G. § 2A1.3 and added the 3-level enhancement for official victim pursuant to § 3A1.2(b) and the 2-level enhancement for obstruction of Justice pursuant to § 3C1.1. Given their criminal history categories, the total offense level yielded guideline ranges of 108-135 months and 97-121 months, respectively. However, the statutory maximum sentence of 10-years imprisonment reduced the guideline ranges to 108-120 months and 97-120 months, respectively.\n\nBranch and Castillo both contest the 3-level enhancement for an official victim. Section 3A1.2(b) of the Sentencing Guidelines provides for a 3-level enhancement if \"during the course of the offense or immediate flight therefrom, the defendant . . . knowing or having reasonable cause to believe that a person was a law enforcement or corrections officer, assaulted such officer in a manner creating a substantial risk of serious bodily injury.\" Branch argues that there is insufficient evidence that he knew the agents' official identity. Castillo claims that the jury's acquittal of the Davidians on Count 1 (conspiracy to murder federal agents) precludes enhancing his sentence for assault on a law enforcement officer.\n\nWe think it beyond cavil that the Davidians knew the agents' identity on February 28, 1993. We do not address Castillo's argument since he did not object to the official victim enhancement either at the sentencing hearing or in his written objections to the Pre-Sentence Report. See United States v. Chapman, 7 F.3d 66, 69 (5th Cir. 1993) (holding defendant \"waived any error based on this issue as he failed to raise it either in his written objections to the pre-sentence report or orally at the sentencing hearing\"), cert. denied, 129 L. Ed. 2d 839, 114 S. Ct. 2713 (1994).\n\nCastillo contests the 2-level enhancement for obstruction of Justice. Section 3C1.1 provides for a 2-level enhancement \"if the defendant willfully obstructed or impeded, or attempted to obstruct or impede, the administration of Justice during the investigation, prosecution, or sentencing of the instant offense.\" Castillo claims that the district court's finding that he obstructed the execution of the search warrant for 51 days is not supported by sufficient evidence.\n\nIn his own post-arrest statement, Castillo admitted to participating in the initial gunbattle and the ensuing armed stand-off. In addition, Kathryn Schroeder, Marjorie Thomas, and Victorine Hollingsworth all confirmed Castillo stood guard with a firearm during the stand-off. The district court's finding is not clearly erroneous.\n\nCastillo next challenges the district court's refusal to reduce his offense for acceptance of responsibility. Section 3E1.1 provides a 2-level reduction \"if the defendant clearly demonstrates acceptance of responsibility for his offense.\" An additional 1-level reduction is available where, among other things, the defendant \"has assisted authorities in the investigation or prosecution of his own misconduct by . . . timely providing complete information to the government concerning his own involvement in the offense.\" Castillo claims that he is entitled to the full, 3-level reduction, pointing out that he provided a statement to Texas Rangers immediately after his arrest.\n\nThe district court found this claim to be \"ludicrous\". We agree. Castillo pled not guilty to all charges against him. While conviction by trial does not \"automatically preclude\" the availability of this section, the Guidelines contemplate that those cases in which the defendant both accepts responsibility within the meaning of this section and goes to trial will be \"rare\". U.S.S.G. § 3E1.1, comment (n.2); United States v. Broussard, 987 F.2d 215, 224 (5th Cir. 1993). Castillo contested his factual guilt, claiming that he acted in self-defense. Moreover, Castillo addressed the district court at sentencing and proclaimed that \"we still stand on our innocence.\" He expressed no remorse or regret for his personal involvement in the deaths of the ATF agents. We agree with the district court that this is not one of those \"rare\" instances warranting the reduction. See United States v. Waloke, 962 F.2d 824, 832 (8th Cir. 1992) (rejecting § 3E1.1 reduction where defendant claimed self-defense); United States v. Sanchez, 893 F.2d 679, 681 (5th Cir. 1990) (rejecting reduction due to defendant's lack of remorse).\n\nFinally, Branch argues that the district court departed upwards from the guideline sentence and that insufficient evidence exists to justify the departure. The district court did not depart upwards from the sentencing guidelines but rather sentenced Branch to the statutory maximum 10-years imprisonment, which was within the guideline range.\n\nWe affirm the sentences on Count 2 for aiding and abetting the voluntary manslaughter of federal agents.\n\n2.\n\nThe district court sentenced Craddock to the statutory maximum 10-years imprisonment on Count 7 for possession of an unregistered destructive device, such term to be served consecutively to that imposed on Count 3.\n\nThe district court began with Craddock's base offense level of 18. U.S.S.G. § 2K2.1. It added 6 levels for the involvement of 50 or more firearms pursuant to § 2K2.1(b)(1)(F), 2 levels for the involvement of a destructive device pursuant to § 2K2.1(b)(3), and 4 levels for possession of a firearm in connection with another felony pursuant to § 2K2.1(b)(5). The court then applied the § 2K2.1(c)(1)(A) cross-reference for possession of a firearm in connection with another offense, here, conspiracy to murder federal agents. Application of the cross-reference yielded an adjusted base offense level of 43. To that, the district court added 3 levels for an official victim pursuant to § 3A1.2(b) and 2 levels for obstruction of Justice pursuant to § 3C1.1. This yielded a total offense level of 48 and a guideline sentence of life imprisonment. See U.S.S.G. § 5A.\n\nCraddock first contests the 2K2.1(c)(1)(A) cross-reference to § 2X1.1. Section 2K2.1(c)(1)(A) directs the sentencing court to apply § 2X1.1 if the defendant \"used or possessed any firearm or ammunition in connection with the commission or attempted commission of another offense, or possessed or transferred a firearm or ammunition with knowledge or intent that it would be used or possessed in connection with another offense.\" Here, the district court adopted the Pre-Sentence Report's finding that Craddock \"was involved in a conspiracy that resulted in the murder of four federal agents.\"\n\nSection 2X1.1, in turn, directs the sentencing court to apply the guideline for the \"substantive offense,\" in other words, the object of the conspiracy. Craddock points to application note 2, which provides that \"'substantive offense,' as used in this guideline, means the offense that the defendant was convicted of soliciting, attempting, or conspiring to commit.\" U.S.S.G. § 2X1.1, comment (n.2) (emphasis added). Craddock argues that his acquittal of Count 1 for conspiring to murder federal agents therefore bars application of the cross-reference.\n\nAs a general matter, that the jury acquitted Craddock of conspiring to murder federal agents does not preclude the district court from finding in a sentencing hearing that Craddock did commit that offense. The sentencing court \"may rely on facts underlying an acquitted count if the preponderance standard is satisfied.\" See United States v. Allibhai, 939 F.2d 244, 254 (5th Cir. 1991), cert. denied, 502 U.S. 1072, 117 L. Ed. 2d 133, 112 S. Ct. 967 (1992). As we explained elsewhere, \"although the jury may have determined that the government had not proved all of the elements of the [other] offense beyond a reasonable doubt, such a determination does not necessarily preclude consideration of underlying facts of the offense at sentencing so long as those facts meet the reliability standard.\" United States v. Juarez-Ortega, 866 F.2d 747, 749 (5th Cir. 1989).\n\nNor are we persuaded that the § 2X1.1 cross-reference itself restricts the district court's ability to use the facts underlying the acquitted count in calculating the sentence on the convicted count. In United States v. Smith, 997 F.2d 396, 397 (8th Cir. 1993), the Eighth Circuit rejected the identical argument Craddock advances before us. In Smith, the court wrote:\n\nWe reject Smith's argument that, under the 1991 amendment, a prerequisite for applying section 2X1.1 to him is a conviction for [the underlying offense]. The commentary to the 1991 version of section 2X1.1 requires the use of the Guideline applicable to the substantive offense that the defendant was \"convicted\" of attempting, soliciting or conspiring to commit. Section 2X1.1, comment (n.2) (1991). We conclude, however, that, when read in context, this commentary applies only if section 2X1.1 is applied directly, rather than as a cross-reference from section 2K2.1. The cross-reference provision contains no language requiring that the defendant be convicted of the other offense.\n\nSee also United States v. Fleming, 8 F.3d 1264, 1266 (8th Cir. 1993). That Smith was not charged with the underlying offense while Craddock was acquitted of it makes no difference. See United States v. Concepcion, 983 F.2d 369, 387-88 (2d Cir. 1992), cert. denied, 114 S. Ct. 163 (1993). In short, the district court did not err in applying the § 2K2.1(c) cross-reference for criminal conduct of which Craddock was acquitted.\n\nCraddock next contests the 6-level enhancement for possession of more than 50 enhanced weapons and the 4-level enhancement for possessing a destructive device in connection with another felony offense. § 2K2.1(b)(1), (5). We do not address these contentions. Even assuming without deciding that these enhancements are not supported by the record, the application of the cross-reference obviated any impact these enhancements had on Craddock's sentence.\n\nNor do we address Craddock's last contention challenging the 3-point enhancement for an official victim pursuant to § 3A1.1. Even without that particular enhancement, Craddock's guideline sentence is life imprisonment. Stated another way, the official victim enhancement had no effect on the calculation of his guideline sentence.\n\nWe affirm Craddock's sentence on Count 7 for possession of an unregistered destructive device.\n\n3.\n\nThe district court sentenced Fatta to the statutory maximum 5-years imprisonment on Count 9 for conspiring to manufacture and possess machineguns. In addition, the court sentenced Fatta to the statutory maximum 10-years imprisonment for aiding and abetting the possession of machineguns, such terms to be served consecutively.\n\nTo calculate Fatta's sentence, the district court grouped the two counts, yielding a base offense level of 18. It added 6 levels for the involvement of 50 or more firearms pursuant to § 2K2.1(b)(1)(F), 2 levels for the involvement of a destructive device pursuant to § 2K2.1(b)(3), and 4 levels for possession or transfer of firearms with knowledge, intent or reason to believe it would be used in connection with another felony pursuant to § 2K2.1(b)(5). The district court then applied the § 2K2.1(c)(1)(A) cross-reference for possession of a firearm in connection with another offense, here, the conspiracy to murder federal agents. Application of the cross-reference yielded an adjusted base offense level of 43 and a guideline sentence of life imprisonment. See U.S.S.G. § 5A.\n\nFatta first contests the § 2K2.1(c) cross-reference on two grounds. First, he contends that his acquittal on Count 1 of the conspiracy to murder federal agents precludes application of the cross-reference. Second, he argues that there is insufficient evidence that he was a member of the conspiracy to murder federal agents.\n\nThe first argument is the same as Craddock's and fails for the same reason. The second argument is more problematic. Fatta was not present at Mount Carmel on February 28 or thereafter. Unlike the other defendants whose activities on the day of the ATF raid and thereafter demonstrated both the existence of and their membership in the conspiracy to murder federal agents, Fatta's membership in that conspiracy turns solely upon his conduct prior to February 28, 1993.\n\nThe district court adopted the PSR's findings that the Davidians had prepared in advance for a war with the U.S. Government and that \"Paul Fatta assisted in this preparation by purchasing and thereby providing firearms for Koresh and other Davidians knowing these weapons would be used against law enforcement officials.\" This finding is not clearly erroneous.\n\nWe note that the district court need only be persuaded by a preponderance of the evidence that a conspiracy to murder federal agents existed prior to February 28. United States v. Mackay, 33 F.3d 489, 496 (5th Cir. 1994) (holding that district court \"may base the findings underlying its sentence on facts in the record that have been proven by a preponderance of the evidence\"). Kathryn Schroeder testified that Paul Fatta began going to gun shows and purchasing weapons after Koresh began preaching about the apocalyptic confrontation with the \"beast\". Indeed, Fatta was one of the Davidians' primary gun purchasers, and he traveled to gun shows numerous times, on at least one occasion with Koresh himself.\n\nIn addition, Fatta had intimate knowledge of the amount and type of weapons purchased by Koresh and the other Davidians. Fatta was the owner of the Mag Bag, the machine shop through which much of the Davidians' firearm purchases flowed. Fatta himself purchased tens of thousands of dollars worth of semiautomatic assault rifles and handguns. He bought cases of ammunition and, on at least one occasion, nearly $300 worth of .50 caliber armor-piercing rounds. Several of the fully automatic weapons recovered from Mt. Carmel had been purchased by Fatta. We think that both the amount and type of firearms acquired by Fatta are significant. They are consistent with Koresh's instruction to prepare for an armed confrontation with the \"beast\"; these are not the armaments of weekend sportsmen or the efforts of an ardent gun collector. These were weapons of war, by type and quantity. In short, based on this evidence, the district court could reasonably find by a preponderance of the evidence that Fatta knew of and had joined the conspiracy to murder federal agents. The district court's application of the § 2K2.1(c) cross-reference is not erroneous.\n\nWe do not address Fatta's other contentions challenging the 6-level enhancement for possession of more than 50 enhanced weapons and the 4-level enhancement for possessing a destructive device in connection with another felony offense. U.S.S.G. § 2K2.1(b)(1), (5). As with Craddock, these enhancements had no effect on Fatta's sentence after the district court applied the § 2K2.1(c) cross-reference.\n\nWe affirm Fatta's sentences on Counts 9 and 10 for conspiring to manufacture and possess machineguns and aiding and abetting the possession of machineguns, respectively.\n\nC.\n\nThe district court ordered the defendants to pay, jointly and severally, $1,131,687.49 in restitution. The court's initial order required that the restitution be paid \"solely from the proceeds received by any Defendant from any contract which relates to the depiction of the crimes for which they were convicted in any movie, book, newspaper, magazine, radio or television production or live entertainment of any kind, or any expression of the Defendants' thoughts, opinions, or emotions regarding such crime.\" The defendants argue, and the Government concedes, that such a limitation would violate the First Amendment. See United States v. Jackson, 978 F.2d 903, 915 (5th Cir. 1992) (holding that \"district court cannot limit restitution order solely to the income the defendants earn on speech associated with their criminal activities\"), cert. denied, 508 U.S. 945, 124 L. Ed. 2d 649, 113 S. Ct. 2429 (1993), and cert. denied, 113 S. Ct. 3055 (1993); see also Simon \u0026 Schuster, Inc. v. Members of the New York St. Crime Victims Bd., 502 U.S. 105, 118, 116 L. Ed. 2d 476, 112 S. Ct. 501 (1991). The district court did not, however, attach the restriction as part of the judgments entered against the defendants. We affirm the judgments as entered.\n\nVII.\n\nWe AFFIRM the convictions on Counts 2 and 3. Bound by court law upholding the constitutionality of 18 U.S.C. § 922(o), we AFFIRM Fatta's convictions on Counts 9 and 10. We VACATE the sentences on Count 3 and REMAND for findings and resentencing on that count. Finally, we AFFIRM the sentences on the remaining counts. We hold the mandate pending the decision in United States v. Kirk, 70 F.3d 791 (5th Cir. 1995), opinion vacated, 78 F.3d 160 (5th Cir. 1996).\n\nDisposition\n\nAFFIRMED the convictions on Counts 2 and 3. AFFIRMED Fatta's convictions on Counts 9 and 10. VACATED the sentences on Count 3 and REMANDED for findings and resentencing on that count. AFFIRMED the sentences on the remaining counts.\n\nSCHWARZER, District Judge, Dissenting.\n\nThe court's opinion is thorough and workmanlike and deserves respect. I regret, however, that I am unable to agree on three points: (1) that the evidence was insufficient to entitle defendants to a self-defense instruction; (2) that it was not prejudicial error to exclude the portion of Castillo's statement which explained and qualified the portion received into evidence; and (3) that the evidence sufficed to establish the predicate offense of conspiracy to murder federal officers.\n\nI. THE FAILURE TO INSTRUCT ON SELF-DEFENSE\n\nA. The Governing Standard\n\nConsiderable confusion exists in this circuit over the precise formulation of the standard for determining whether a defendant is entitled to an instruction on a theory of defense. This court recently held that \"where the district court 'refuses a charge on a defense theory for which there is an evidentiary foundation and which, if believed by the jury, would be legally sufficient to render the accused innocent,' this court presumes that the lower court has abused his discretion.\" United States v. Correa-Ventura, 6 F.3d 1070, 1076 (5th Cir. 1993) (quoting United States v. Rubio, 834 F.2d 442, 446 (5th Cir. 1987)). But this court has applied three different standards for what constitutes \"an evidentiary foundation\" requiring a self-defense instruction: (1) \"any evidence\" regardless of how insubstantial; (2) \"substantial evidence\" defined as \"more than a scintilla\"; and (3) \"evidence sufficient for a reasonable jury to find in [the defendant's] favor\" (the formulation adopted from Mathews v. United States, 485 U.S. 58, 99 L. Ed. 2d 54, 108 S. Ct. 883 (1988)).\n\nThe \"any evidence\" standard has been applied in this circuit since the seminal cases Perez v. United States, 297 F.2d 12 (5th Cir. 1961), and Strauss v. United States, 376 F.2d 416 (5th Cir. 1967). Courts have continued to apply the \"any evidence\" standard both before and after the Supreme Court's decision in Mathews, 485 U.S. 58, 99 L. Ed. 2d 54, 108 S. Ct. 883, on which the opinion relies.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Other courts within the circuit have applied a slightly more demanding \"more than a scintilla\" test. See Pierce v. United States, 414 F.2d 163, 166-68 (5th Cir.), cert. denied, 396 U.S. 960, 24 L. Ed. 2d 425, 90 S. Ct. 435 (1969); United States v. Groessel, 440 F.2d 602, 606 (5th Cir. 1971). But those courts that have recognized the existence of the two different standards--\"any evidence\" and \"more than a scintilla\"--have found no outcome-determining difference between them. See United States v. Andrew, 666 F.2d 915, 922-24 nn.10-11 (5th Cir. 1982); United States v. Fischel, 686 F.2d 1082, 1086 n.2 (5th Cir. 1982); United States v. Leon, 679 F.2d 534, 539 n.5 (5th Cir. 1982). See also United States v. Hill, 626 F.2d 1301, 1303-04 n.3 (5th Cir. 1980) (noting that the semantic discrepancies between these two formulations have not produced disparate results in cases). Finally, there is United States v. Stowell, 953 F.2d 188, 189 (5th Cir.) (per curiam), cert. denied, 503 U.S. 908, 117 L. Ed. 2d 497, 112 S. Ct. 1269, and cert. denied, 506 U.S. 902 (1992), which the court reads as explaining away the \"any evidence\" test based on a statement in Mathews, 485 U.S. at 63, that \"a defendant is entitled to an instruction as to any recognized defense for which there exists sufficient evidence for a reasonable jury to find in his favor.\" But Mathews seems to me a thin reed on which to lean that proposition.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nWhatever formulation of the standard applies here, however, defendants are entitled to an instruction on self-defense. Even under the Mathews /Stowell standard, which is arguably the most demanding of the three, there need only be sufficient evidence in the record to permit a jury to have a reasonable doubt that defendants were not acting in self-defense; this is so because, while the defendant bears the burden of production on self-defense, the government maintains the burden of persuasion to prove the absence of self-defense beyond a reasonable doubt. See United States v. Alvarez, 755 F.2d 830, 842-43 \u0026 n.12 (11th Cir.) (setting out the burden of proof for self-defense under federal criminal law), cert. denied, 474 U.S. 905 (1985); United States v. Johnson, 542 F.2d 230, 233-34 n.4 (5th Cir. 1976). See also Fifth Circuit Pattern Jury Instructions (Criminal Cases), No. 2.51 at 137-38 (1990 ed.). As the following Discussion shows, I believe that there was ample evidence to permit a jury to have had a reasonable doubt as to whether the defendants acted in self-defense.\n\nB. Sufficency of the Evidence\n\nAt the outset it is necessary to recognize that this case is about the culpability of individual defendants. The crime of which each defendant was convicted--aiding and abetting the manslaughter of federal agents--was allegedly committed by each defendant individually; it was not a group crime. Contrary to the opinion's general approach, each defendant is entitled to individual consideration of the charges against him and his defenses. Specifically, each is entitled to individual determination of his right to a self-defense instruction. The court acknowledges as much when it holds that Castillo is not entitled to an instruction because of the evidence reflecting his conduct on the day of the gun battle,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e but the court forsakes this approach in other respects.\n\nThe first issue is whether, treating each defendant individually, there is evidence in the record showing that he was the aggressor in the gun battle. The defense of self-defense is available only to one who is \"not the aggressor.\" See Wayne R. LaFave \u0026 Austin W. Scott, Jr., Criminal Law § 53 (1972). If there were evidence that any of these defendants had provoked the shooting, that evidence might disqualify that defendant from claiming a self-defense instruction. But a defendant is not required to take the stand to deny his role as an aggressor. Here, there is no evidence that any of the individual defendants provoked the shooting. While there is conflicting evidence as to whether the first shot came from within the compound or outside the compound, no evidence identifies any of the individual defendants as firing the first shot. In the absence of such evidence, the defendants were entitled to a self-defense instruction so long as there was enough evidence to permit a reasonable jury to have a reasonable doubt about whether the agents did not use excessive force.\n\nThe \"first shot\" evidence is, therefore, of limited significance. To the extent that evidence is relevant to whether any defendant was an aggressor, the court's treatment of it goes beyond the determination of its sufficiency and engages in impermissible weighing and evaluation of its credibility.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The opinion rejects Ballesteros' testimony because it was contradicted at trial and Castillo's post-arrest statement as a \"self-serving, post-arrest\" statement contradicted by \"overwhelming\" testimony of agents and media representatives and by physical facts. The evidence the opinion describes, however, portrays a scene of great complexity and confusion. Deciding who shot first based on that evidence requires a difficult factual determination that should not be made by a court of appeals, but should have been left to a jury.\n\nThe heart of the matter is whether there was sufficient evidence to raise a reasonable doubt as to whether the agents used excessive force. The defendants contend that the evidence shows that agents fired indiscriminately through the windows and walls of rooms from which no gunfire originated. This contention was amply supported by the testimony of Kathryn Schroeder and Marjorie Thomas (summarized in the margin),\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e who were present in the compound during the gun battle and were called at trial as government witnesses. The court rejects this evidence because it does not show that any of the defendants came under indiscriminate, unprovoked fire or knew that such fire was taking place. See supra p. number. That Schroeder and Thomas might have been entitled to a self-defense instruction had they been defendants, the opinion argues, does not vicariously entitle these defendants to such an instruction.\n\nIt is difficult to accept the opinion's contention that the testimony of Schroeder and Thomas provides no basis upon which a jury could infer that defendants knew of and were responding to excessive force. The opinion suggests that, before defendants could claim to be entitled to a self-defense instruction, Thomas or Schroeder had to tell them about the gun fire they witnessed. See supra p. 33. However, there is substantial evidence, recited elsewhere in the opinion, that during the gun battle the defendants were active in the same area in which Schroeder and Thomas were located and that the latter were close enough to observe the defendants' activities and hear their exclamations. See supra pp. 63-65. If the evidence showed that the defendants were in the same general vicinity as Schroeder and Thomas while a battle involving helicopters and some 76 well-armed ATF agents raged in the compound and ultimately resulted in over 30 casualties, surely that evidence was sufficient to raise an issue for the jury as to whether the defendants knew of and were responding to the random firing through walls and into windows observed by Schroeder and Thomas.\n\nFinally, while we can all agree, as the opinion states, that a citizen may not initiate a firefight solely on the ground that the police sent too many well-armed officers to arrest him, it is too late in the day to argue that there are no limits on the amount of force the police may use in executing warrants. The Fourth Amendment protects individuals against \"the use of excessive force by a law enforcement officer even when that officer is making a lawful arrest.\" United States v. Span, 970 F.2d 573, 577 n.3 (9th Cir. 1992) (citing Graham v. Connor, 490 U.S. 386, 394-96, 104 L. Ed. 2d 443, 109 S. Ct. 1865 (1989)). \"Determining whether force used to effect a particular seizure is 'reasonable' under the Fourth Amendment requires a careful balancing of 'the nature and quality of the intrusion on the individual's Fourth Amendment interests' against the countervailing governmental interests at stake.\" Graham, 490 U.S. at 396. The opinion declares that a \"dynamic entry\" by 76 agents armed with 9 millimeter pistols and AR-15 semiautomatic rifles and accompanied by helicopters will not support an inference of unreasonable force. But under the court's sweeping rationale, it would have made no difference if the agents had been supported by armored personnel carriers, or by tanks, or by suppression fire from aircraft.\n\nIn Conclusion, this appeal presents no mere \"lawyer's sporting search for error\" or for a \"device for defendant to invoke the mercy-dispensing prerogative of the jury.\" See supra p. number. The trial Judge gave a self-defense instruction in connection with the principal offense; while obviously not determinative, that shows that the person in the best position to evaluate the evidence regarded it as sufficient to warrant such an instruction. These defendants had a serious claim that the ATF used excessive force. Therefore, they were entitled to a self-defense instruction in relation to the manslaughter charge, and the trial court's failure to give one was reversible error.\n\nII. EXCLUSION OF A PORTION OF CASTILLO'S STATEMENT\n\nTexas Ranger De Los Santos testified that Castillo made the following statement about the day of the battle:\n\nThat in the morning he heard someone saying that something was going to happen, so he got out of bed, put on his black clothing and an ammunition vest which held eight magazines, and picked up his AR-15. He then looked out the window and saw two cattle trailers approaching the compound. When he saw them he exited his room and went to the foyer where he saw Vernon Howell, Perry Jones, and others. Vernon Howell opened the front door and stated \"Wait a minute, there's women and children in here.\" Then gunfire erupted through the door. When the gunfire erupted, he tried to chamber a round in his AR-15, but it jammed. He then ran down the hallway, back to his room, where he got his own personal 9-millimeter Baretta pistol. He exited his room and went down the hallway toward the other end of the compound to the second to the last room, facing the front of the compound. He entered that room, where there were three other Davidians.\n\nFollowing this testimony, the prosecutor asked De Los Santos questions to clarify that the room Castillo entered faced the front of the compound. The clear inference to be drawn from this testimony is that, upon entering that room, Castillo participated in the gun battle, thereby aiding and abetting the manslaughter of federal agents.\n\nThe court barred Castillo from eliciting testimony from De Los Santos about the following portion of Castillo's statement:\n\nCastillo went into the room identified as McBean, Summers, and Hipsman's room. Castillo stated he took cover during the shooting, never firing a shot. Castillo also stated no one in his room fired a round. Castillo claims that he doesn't know who fired a weapon inside.\n\nSee supra p. number (emphasis added). This excluded portion of Castillo's statement reveals the potentially misleading nature of the admitted portions of his statement.\n\nUnder the rule of completeness embodied in Fed. R. Evid. 106, additional portions of a defendant's statement must be admitted if they are \"relevant to the issues [in the case]\" and \"qualify or explain the subject matter of the portion offered by the opponent . . . .\" United States v. Crosby, 713 F.2d 1066, 1074 (5th Cir.), cert. denied, 464 U.S. 1001, 78 L. Ed. 2d 696, 104 S. Ct. 506 (1983) (emphasis added).\n\nCiting United States v. Smith, 794 F.2d 1333, 1335 (8th Cir.), cert denied, 479 U.S. 938 (1986), the court upholds the exclusion of this portion of the testimony because it leaves Castillo's \"picking up his handgun . . . unqualified and unexplained.\" See supra p. number. Smith, however, is not analogous to this case but, in fact, reveals the weakness of the court's reasoning here.\n\nIn Smith, a police officer testified about a small portion of a defendant's post-arrest statement that he \"was present on Hamilton Street at the time of [his co-defendant's] arrest and observed the arrest . . . [and] that he owned a red or maroon bicycle.\" See Smith, 794 F.2d at 1335. That statement served as a partial admission supporting the testimony of two government witnesses who placed the defendant in the vicinity of Hamilton Street at the time of his co-defendant's arrest. Id. Additional statements the defendant sought to have admitted were: \"(1) that [the defendant] had met [his co-defendant] two months earlier; (2) that five weeks before [the defendant's] arrest [his co-defendant] asked [the defendant] if he could dispose of Anheuser-Busch stock certificates; (3) that [the defendant] never dealt in stocks; (4) that stocks were a 'white boy's game'; and (5) that he was not involved in attempting to sell the stocks and had no idea what to do with stock certificates.\" None of these statements are related to the defendant's presence on Hamilton Street at the time of his co-defendant's arrest and, therefore, could not be said to qualify or explain the admitted portion of the statement. The only thing that could be said about the additional statements was that they were exculpatory. Thus, while Smith stands for the fact that the exculpatory nature of a statement does not alone require its admission under the Rule 106 fairness analysis, Smith does not speak to why Castillo's statement that he took cover in the room and did not fire his gun does not qualify the statement that he picked up a gun and went into the room facing the front of the compound (the side from which much of the Davidian gunfire came) and, therefore, should have been admitted.\n\nInstead, Smith highlights the error in not admitting Castillo's additional statements. In Smith, the lower court affirmed the defendant's conviction, recognizing that the trial court had allowed \"Sutton to cross-examine the government agent with respect to the portion of the statement testified to, [even though] it refused to allow Sutton to cross-examine . . . with respect to other portions [of his statement] . . . .\" Id. at 1335-36 (emphasis added). When De Los Santos placed Castillo armed in a room facing the front of the compound where the battle was taking place, Castillo surely was entitled to cross-examine him about that portion of the statement by asking what else he said about his presence in that room.\n\nThe opinion also cites United States v. Haddad, 10 F.3d 1252 (7th Cir. 1993), which is analogous to this case and supports the Conclusion that the additional portion of Castillo's statement should have been admitted. In Haddad, a police officer testified that the defendant admitted that he knew there was marijuana under the bed. The trial court, however, excluded testimony that the defendant, at the same time, had denied knowledge of a gun that was found under the bed some six inches from the marijuana. The court held the ruling to be error, saying:\n\nThe admission of the inculpatory portion only (i.e. that he knew of the location of the marijuana) might suggest, absent more, that the defendant also knew of the gun. The whole statement should be admitted in the interest of completeness and context, to avoid misleading inferences, and to help insure a fair and impartial understanding of the evidence.\n\n10 F.3d at 1259 (ultimately holding that the error was not prejudicial because the same evidence was received through another witness).\n\nHere, too, the receipt of the inculpatory portion of the statement (that Castillo went armed into a room facing the battle) required receipt of the other related portion of the statement (that he took cover and never fired a shot) to avoid misleading inferences. See, e.g., supra p. number (this court's statement that \"Castillo admitted that he was in a room at the front, armed with a gun, during the gun battle.\").\n\nCastillo stood charged with murder. When De Los Santos' testimony placed Castillo where he might have fired a fatal shot, it was abuse of discretion to preclude cross-examination to show that he had taken cover and never fired a shot.\n\nIII. SUFFICIENCY OF EVIDENCE OF CONSPIRACY UNDER § 924(c)(1)\n\nDefendants Branch, Whitecliff, Castillo, Avraam and Craddock were convicted under section 924(c)(1) and each was sentenced to 30 years. The predicate \"crime of violence\" on which this conviction was based was a conspiracy to murder federal officers. Because the jury acquitted the defendants on the conspiracy count, this court must determine whether there was sufficient evidence that each of the defendants joined the conspiracy with the requisite intent. See United States v. Powell, 469 U.S. 57, 67, 83 L. Ed. 2d 461, 105 S. Ct. 471 (1984); United States v. Ruiz, 986 F.2d 905, 911 (5th Cir.), cert. denied, 114 S. Ct. 145 (1993).\n\nMurder is \"the unlawful killing of a human being with malice aforethought.\" 18 U.S.C. § 1111. As this court said in United States v. Harrelson, 754 F.2d 1153, 1173 (5th Cir.), reh'g denied, 766 F.2d 186, cert. denied, 474 U.S. 908, 88 L. Ed. 2d 241, 106 S. Ct. 277, and cert. denied, 474 U.S. 1034, 88 L. Ed. 2d 578, 106 S. Ct. 599 (1985), reversing a conviction:\n\n[Defendant] was charged . . . with conspiracy to commit first degree murder; first degree murder requires the criminal intent of premeditation and malice aforethought. It was therefore incumbent upon the government to prove [defendant] had that criminal intent . . . .\n\nSee also Ingram v. United States, 360 U.S. 672, 678, 3 L. Ed. 2d 1503, 79 S. Ct. 1314 (\"conspiracy to commit a particular substantive offense cannot exist without at least the degree of criminal intent necessary for the substantive offense itself.\"), reh'g denied, 361 U.S. 856, 4 L. Ed. 2d 96, 80 S. Ct. 42 (1959); United States v. Beil, 577 F.2d 1313, 1314-15 (5th Cir.), reh'g denied, 585 F.2d 521 (5th Cir. 1978), cert. denied, 440 U.S. 946, 59 L. Ed. 2d 634, 99 S. Ct. 1422 (1979). A leading text elaborates the point:\n\nAt the outset, it is useful to note that there are really two intents required for the crime of conspiracy. Every conspiracy involves an agreement, so it must be established that the several parties intended to agree. But such an intent is \"without moral content,\" and thus it is also necessary to determine what objective the parties intended to achieve by their agreement. Only if there is a common purpose to attain an objective covered by the law of conspiracy is there liability.\n\n2 Wayne R. LaFave \u0026 Austin W. Scott, Jr., Substantive Criminal Law § 6.4(e)(1986).\n\nThe court states that \"the record is replete with evidence of a conspiracy to murder federal agents and each individual defendant's membership in that conspiracy.\" But the evidence as to these defendants relating to the events of February 28 reflects at most that each, as a member of the Branch Davidian sect, participated in some fashion in the gun battle. There is no evidence that any of them entered into an agreement to kill federal officers, much less that any did so with premeditation and malice aforethought. That these defendants were members of the sect led by David Koresh, whose teachings may well have been inflammatory, and that they were present in the compound during the battle and in various ways participants in it, does not support a finding that each of them conspired to murder federal officers.\n\nEach defendant is entitled to individual Justice by means of a review of the evidence to determine whether the requisite elements of such a conspiracy have been established as to him. Failing that, their conviction of the predicate offense rests on nothing more than guilt by association.\n\nAccordingly, I would reverse the convictions and remand for a new trial.\n\n\u003cspan class=\"fn\"\u003e* District Judge of the Northern District of California, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Self-defense is an affirmative defense on which the defendant bears the initial burden of production. United States v. Alvarez, 755 F.2d 830, 842 n.12 (11th Cir.), cert. denied, 474 U.S. 905 (1985), and cert. denied, 482 U.S. 908 (1987). If and only if the defendant has met his burden of production, the Government bears the burden of persuasion and must negate self-defense beyond a reasonable doubt. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The written report of Castillo's post-arrest statement was not introduced at trial; rather, Gerardo de los Santos, a Texas Ranger, testified regarding Castillo's post-arrest statement. We review Ranger de los Santos' testimony, not the written report.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. There is no evidence that the other defendants claiming error were present at the front door or otherwise shared in Castillo's knowledge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Avraam and Castillo separately contend that we should revisit our decisions in Munoz-Fabela and its progeny. We are bound by those decisions, however. See Burlington Northern Railroad Co. v. Brotherhood of Maintenance of Way Employees, 961 F.2d 86, 89 (5th Cir. 1992), cert. denied, 506 U.S. 1071, 122 L. Ed. 2d 173, 113 S. Ct. 1028 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Although the Government had conceded the point, the First Circuit cited Martinez and Sims for support for this proposition. As noted above, those decisions did not address that specific issue.\u003c/span\u003e\n\n",
    "body_length": 170039,
    "citedas": [
      "91 F.3d 699"
    ],
    "attorneys": "For UNITED STATES OF AMERICA, Nos. 94-50437, 94-50438, 94-50439, 94-50440, 94-50447, 94-50452, Plaintiff - Appellee: LeRoy Morgan Jahn, W. Ray Jahn, Office of the United States Attorney, San Antonio, TX. Joseph Charles Wyderko, United States Department of Justice, Criminal Division, Washington, DC. For BRAD EUGENE BRANCH, No. 94-50437, Defendant - Appellant: Richard Gale Ferguson, Waco, TX. For KEVIN WHITECLIFF, No. 94-50438, Defendant - Appellant: Steven Rocket Rosen, Houston, TX. For JAIME CASTILLO, No. 94-50439, Defendant - Appellant: Stephen P. Halbrook, Fairfax, VA. For RENOS AVRAAM, No. 94-50440, Defendant - Appellant: John F Carroll, Leon, Amberson and Carroll, San Antonio, TX. For PAUL FATTA, No. 94-50447, Defendant - Appellant: Mike J DeGeurin, Foreman, DeGeurin and Nugent, Houston, TX. For GRAEME LEONARD CRADDOCK, No. 94-50452, Defendant - Appellant: George Stanley Rentz, Waco, TX.",
    "category": [],
    "judges": "Before Higginbotham and Duhe, Circuit Judges, and Schwarzer,*fn* District Judge. Schwarzer, District Judge, Dissenting.",
    "citation_count": 105
  }
}
