{
  "id": "8pt0RWYBTlTomsSBO5ed",
  "document": {
    "title": "JEWELL v. NYP HOLDINGS",
    "full_title": "RICHARD JEWELL, Plaintiff, against NYP HOLDINGS, Inc. d/b/a THE NEW YORK POST, Defendant.",
    "jurisdiction": "S.D. New York",
    "date": "1998-09-30T00:00:00.000Z",
    "docket": "97 Civ. 5399 (LAP)",
    "body": "LORETTA A. PRESKA, United States District Judge:\n\nPlaintiff Richard Jewell (\"Jewell\") brings this diversity action for libel against defendant NYP Holdings, Inc. d/b/a The New York Post (\"NYP\"). The NYP moves for summary judgment pursuant to Federal Rule of Civil Procedure (\"Fed. R. Civ. P.\") 56 and for dismissal pursuant to Fed. R. Civ. P. 12(b)(6). For the reasons that follow, the motion is granted in part and denied in part.\n\nTABLE OF CONTENTS\n\nBACKGROUND\n\nI. The July 31 Column \u0026 Headline\n\nII. The July 31 Article\n\nIII. The August 1 Article \u0026 Headline\n\nIV. The August 1 Photograph\n\nV. The August 1 Cartoon\n\nVI. The August 2 Article\n\nVII. The August 2 Photograph\n\nVIII. The NYP's Motion\n\nDISCUSSION\n\nI. Overview\n\nII. Choice of Law\n\nIII. Defamatory Meaning\n\nA. The July 31 Column \u0026 Headline\n\nB. The July 31 Article\n\nC. The August 1 Article\n\nD. The August 1 Photograph\n\nE. The August 2 Article\n\nF. The August 2 Photograph\n\nIV. Substantial Truth\n\nV. The Republication Defense\n\nA. The AP Wire Service Reports\n\nB. The CNN Broadcasts\n\nC. The AJC Articles\n\nVI. The Opinion-Fact Dichotomy\n\nA. The Broader Context in Which the Statements Were Published\n\nB. The July 31 Column \u0026 Headline\n\nC. The July 31, August 1 and August 2 Articles and the August 1 Cartoon\n\n1. The July 31 Article\n\n2. The August 1 Article \u0026 Headline\n\n3. The August 1 Cartoon\n\n4. The August 2 Article\n\nVII. The Incremental Harm Defense\n\nVIII. Libel Per Se\n\nA. Indictable Offense\n\nB. Work Performance\n\nCONCLUSION\n\nBACKGROUND\n\nIn the early morning hours on July 27, 1996, a bomb exploded in Centennial Olympic Park in downtown Atlanta, Georgia during the centennial olympic games. One person was killed and one-hundred and ten others were injured. See Complaint P 12. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" Having suffered the collective tragedies of the bombing of the World Trade Center on February 26, 1993 and the Murrah Federal Building in Oklahoma City on April 19, 1995, the nation's sense of domestic security was rapidly eroding. Some seventy-two hours after the explosion, on the afternoon of July 30, 1996, the Atlanta Journal-Constitution (\"AJC\"), in a special extra edition, published an article identifying Jewell as \"the focus of the federal investigation.\" See id. P 30; Kathy Scruggs \u0026 Ron Martz, FBI Suspects \"Hero\" Guard May Have Planted Bomb, Atlanta Journal-Constitution, July 30, 1996 (extra addition), at 1X (\"The First July 30 AJC Article\"); annexed as Ex. A to the Affidavit of Andrea Peyser, sworn to on October 3, 1997 (\"Peyser Aff.\"). Publication to a similar effect by the NYP quickly followed. This lawsuit arises from these events.\n\nInitially, from the evening of July 27 to the morning of July 30, Jewell's actions were described by the national and international print and broadcast media as heroic. See Complaint P 20. Although reluctant to grant interviews with the media, Jewell did so on a limited basis in an effort to accommodate the desires of one of the olympics' corporate sponsors. See id. P 30. This media attention focused on Jewell's role in the events immediately prior to the explosion.\n\nApproximately twenty minutes before the bomb exploded, Jewell reported the existence of an unattended package in the Centennial Olympic Park to Tom Davis (\"Davis\"), a member of the Georgia Bureau of Investigation. See id. P 14. Shortly after Davis and Jewell unsuccessfully attempted to ascertain whether anyone owned the package, Davis called his command post, reported a suspicious package and requested the dispatch of a bomb inspection team. See id. P 16. Almost immediately thereafter, an anonymous 911 call was placed to the Atlanta Police Department in which the caller stated: \"There is a bomb in Centennial Park. You have thirty minutes.\" See id. P 13. Prior to the explosion which occurred some twenty minutes after this call, Jewell attempted to evacuate individuals from the area surrounding the location of the suspicious package. See id. PP 18-19. Although the explosion killed one person and injured numerous others, a number of people were moved away from the site with Jewell's assistance. See id. P 19.\n\nThe tone of the media coverage changed dramatically with the breaking story published by the AJC on July 30. As noted above, that article identified Jewell as the \"focus of the federal investigation.\" See The First July 30 AJC Article; Peyser Aff. Ex. A. The article also indicated that Jewell fit the profile of a \"lone bomber\" and that the profile \"generally includes a frustrated white man who is a former police officer, member of the military or police 'wannabe' who seeks to become a hero.\" Id. A second article was also published in this special edition and reported similar information. See Kent E. Walker, Bomb Suspect Had Sought Limelight, Press Interviews, Atlanta Journal-Constitution, dated July 30, 1996 (extra edition), at 3X; annexed as Ex. B to the Peyser Aff.\n\nWith respect to the NYP, and broadly speaking, the Complaint pleads libel concerning two different aspects of the NYP's reporting. First, libel in connection with Jewell's alleged responsibility for the bombing of Centennial Olympic Park. Second, libel with respect to Jewell's prior work history and job performance. Jewell claims that the NYP libeled him in one column, three articles, two photographs and one cartoon.\n\nI. The July 31 Column \u0026 Headline\n\nJewell claims that a July 31 column in the NYP written by Andrea Peyser (\"Peyser\") libeled him in various respects (\"July 31 Column\"). A copy of this column, along with the front page of the NYP from this date, is annexed as Ex. E to the Peyser Aff. This column contains, in addition to its headline, the following allegedly libelous statements: \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\"\n\nWho checked 'Rambo' crossing guard's record?\n\nRichard Jewell, the Olympic security guard who's reportedly turned into a prime suspect for Saturday's deadly bombing, had a reputation for being the Village Rambo in Habersham County -- a rural area in the North Georgia mountains that actually sees snow in winter.\n\nHe was a fat, failed former sheriff's deputy who spent most of his working days as a school crossing guard, and yearned to go further. But he lost his job on the county force, after six years[,] when he wrecked a squad car.\n\nJewell got another chance in April 1995, when he was hired as a security guard for tiny Piedmont College in Demorest, a town with just a few hundred residents. It was, to put it mildly, a disaster.\n\nThe final straw came after Jewell got up in the middle of the night and set up a road block around the campus, hunting for people driving under the influence, said a source speaking on condition of anonymity. \"He was let go after that,\" said the source.\n\n\"He was a straight arrow who overdid everything,\" college president Ray Cleere told me yesterday.\n\nIt was Cleere who telephoned the FBI on Sunday, after watching endless TV broadcasts featuring his former employee. Something about Jewell, taking credit for saving lives in Centennial Park, didn't sit right with the college president.\n\nIt wasn't that Jewell was brutal. But on a campus of 1,000 students, where the worst imaginable problems might involve open beer containers and loud music, Jewell seemed desperate to stand out as a hero.\n\n\"But these aren't the streets of New York. We have a small, country town with a small liberal-arts college. He over-investigated everything.\"\n\nAs an example, Cleere said disputes that could be resolved with a little adult mediation often turned into federal cases.\n\n\"Kids who get into scuffles -- that does not require investigation,\" he said.\n\nThat the main suspect in a major act of terrorism is a home-grown failure is both a relief -- and a major embarrassment -- to this city's real law-enforcement people.\n\nThe scary part is, as the minutes ticked by, it was Jewell, this disgraced former deputy and fired campus security guard, who was in charge.\n\nComplaint PP 41-42. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\"\n\nII. The July 31 Article\n\nJewell claims libel with respect to certain statements published in a July 31 article (\"July 31 Article\"). This article was written by Robert Hardt, Jr. (\"Hardt\") and Kyle Smith (\"Smith\"). A copy of this article, along with the front page of the NYP from this date, is annexed as Ex. A to the Affidavit of Kyle Smith, sworn to on October 3, 1997 (\"Smith Aff.\"). Jewell claims that the following statements are allegedly libelous: \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\"\n\nCleere said Jewell had been given the option of resigning or being fired in May because he was overly enthusiastic about his police duties and liked the limelight.\n\nThe Journal-Constitution reported Jewell had sought interviews with CNN, NBC and other news outlets.\n\nComplaint PP 58-59.\n\nIII. The August 1 Article \u0026 Headline\n\nIn an article written by Smith and Hardt on August 1 (\"August 1 Article\"), annexed, along with the front page of the NYP from this date, as Ex. D to the Smith Aff., Jewell claims that the NYP libeled him with respect to the following statements:\n\nInvestigators say they're closing in on \"hero\" security guard Richard Jewell as the Olympics bomber after searching his apartment for hours and carting off boxes of possible evidence.\n\n\"We're pretty confident it's him, but we're most concerned with making sure our case is airtight,\" said a source close to the probe of the man suspected of planting the bomb that killed two people and injured 110 others.\n\nNo charges have been filed, but probers say it may just be a matter of time.\n\n\"Obviously, his profile is right-on,\" the source said. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\"\n\n\"This is something I want to put in my Olympic scrapbook,\" said Mike Pugliese.\n\n\"Everybody here should be glad they finally got this guy. It's good they made progress like this while the Games are still going on. I think it makes people feel safer and better.\"\n\nCleere, who wouldn't tell reporters why Jewell was forced to leave, called the FBI to tell them that the former employee had been too zealous about his duties and sought attention.\n\nComplaint P 74. Jewell also claims that the front page of the August 1 edition of the NYP (\"August 1 Headline\") libeled him by publishing, underneath his photograph, the following headline: \"Noose tightens around Olympic bomb suspect.\" Complaint P 90. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nIV. The August 1 Photograph\n\nThe August 1 edition of the NYP also published a photograph of Jewell wearing camouflage hunting clothing and holding a machine gun. Below the picture appeared the following caption: \"DRESSING THE PART: Suspect security guard Richard Jewell clearly fits the profile of the bomber, say federal investigators.\" Above the picture appeared the following headline: \"FEDS 'HOME IN' ON BOMB SUSPECT.\" This headline appeared under the banner which the NYP used during its coverage of this event: \"TERROR IN AMERICA.\" A copy of this photograph and the accompanying text is annexed as Ex. D to the Smith Aff. (\"August 1 Photograph\"). \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" See Complaint PP 102-03.\n\nV. The August 1 Cartoon\n\nJewell also claims that a cartoon published in the August 1 edition of the NYP libeled him (\"August 1 Cartoon\"). See Complaint PP 115-16. A copy of the cartoon is annexed as Ex. A to the affidavit of Jan F. Constantine, sworn to on October 17, 1997. The cartoon depicts an individual sitting behind a desk with two signs on the wall behind him -- a sign stating \"Olympic Security\" and a sign stating \"Now Hiring.\" The individual appears to be reviewing an employment application. Seated at the desk in front of the individual is a man with a long white beard, wearing a hat that resembles a turban. This man is carrying a large, round bomb. Standing behind this man is another applicant wearing a black ski mask. Wrapped around his waist is a belt of dynamite and in his hand is a plunger-type detonation device. Standing behind this man is a third individual whose full identity is obscured because approximately two-thirds of his body is not depicted in the cartoon, but who nonetheless appears to be Fidel Castro. This individual has a black beard, is wearing some sort of cap, and is carrying a long cylindrical bomb. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nVI. The August 2 Article\n\nIn the August 2 edition of the NYP, Hardt and Smith published another article (\"August 2 Article\") which contains the following allegedly libelous statements.\n\nInvestigators vowed last night they were not backing off naming \"hero\" security guard Richard Jewell the No. 1 suspect in the Olympic bombing. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nThe FBI took heat for seeming to lack enough evidence to arrest Jewell three days after leaking word that he was a suspect -- but a law enforcement source said the feds continued to build a case against him.\n\n\"Any reports about us losing interest are just off right now,\" the source said.\n\n\"They're not right. On a scale of 1 to 10 of our interest right now, he's still a 10 and will remain a 10 until we find something else of interest.\n\n\"If he's not the guy, he's one sick puppy.\"\n\nThe source also revealed that Jewell had exercised his right not to incriminate himself when he was called in to FBI offices for questioning Tuesday.\n\n\"He came in but he didn't talk. He said he didn't want to talk unless his lawyer was present. I don't know why he came in.\"\n\nA law-enforcement officer who knew Jewell has told the FBI the burly security guard once said he possessed an anarchist manual. Such books sometimes contain detailed bomb-making instructions.\n\nAnother law-enforcement source said Jewell's arrest was not imminent.\n\n\"It's at least a matter of days,\" the source said. There's a lot of stuff to go through.\n\nComplaint P 125. A copy of this article, along with the front page of the NYP from this date, is annexed as Ex. F to the Smith Aff. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\"\n\nVII. The August 2 Photograph\n\nJewell also claims that a photograph in the August 2 edition of the NYP libeled him (\"August 2 Photograph\"). See Complaint PP 140-43. A copy of the photograph is annexed as Ex. F to the Smith Aff. The photograph is of a man, purported to be Jewell, standing behind and leaning against three bars. Jewell claims that the individual in the August 2 Photograph is not himself. See Complaint P 142. Underneath the photograph, the following caption appears: \"JEWELL WATCH: Jewell peers from stairway of his Atlanta home yesterday.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\"\n\nVIII. The NYP's Motion\n\nThe NYP moves to dismiss the Complaint for a variety of reasons and argues that the statements, photographs and cartoon do not support a cause of action in libel because the following affirmative defenses warrant dismissal: (1) some of the statements are incapable of a defamatory meaning; (2) some of the statements are substantially true; (3) Peyser and Smith lawfully relied upon information obtained from other sources (the so-called \"wire service\" defense); (4) many of the statements are non-actionable statements of opinion; (5) those statements which are actionable should nonetheless be dismissed under the incremental harm defense; and (6) Jewell has failed to plead special damages and the statements at issue are not libel per se. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\"\n\nIn connection with the wire service defense, the NYP's moving papers included affidavits from Peyser and Smith setting forth factual material not found in the Complaint with respect to the merits of the defense. Accordingly, I granted Jewell the right to take Peyser's and Smith's depositions limited to matters concerning this defense and converted this portion of the motion into one for summary judgment. As to the remainder of the defenses asserted by the NYP, the motion is brought pursuant to Fed. R. Civ. P. 12(b)(6).\n\nDISCUSSION\n\nI. Overview\n\nIt is beyond peradventure that the primary \"sting\" of the publications complained of is that Jewell is the \"individual who was guilty or likely guilty of criminal involvement in the Centennial Olympic Park Bombing[,]\" Complaint P 88, and if, as it now appears, that charge is untrue, it is defamatory if uttered with the requisite state of mind. See infra note 18. Despite its length, the present motion does not raise this core issue. Rather, it raises a variety of pleading defenses (and the wire service defense) -- sometimes several defenses for each individual statement complained of. Although this motion has resulted in a minor narrowing of the Complaint and the issues that must be resolved, the effort invested in it by the parties and the judicial resources required to resolve it (evidenced by an opinion in excess of one hundred pages) do not contribute in the least to the overall resolution of this action; the core issue of state of mind still awaits.\n\nII. Choice of Law\n\nThe parties did not address this matter, but briefed this motion under the assumption that New York law applies. That assumption is correct, but a few words as to why that is so are warranted. Jewell is a citizen of the State of Georgia. The events which gave rise to the allegedly libelous articles published by the NYP took place there as well. The NYP is incorporated under the laws of the State of Delaware and has its principal place of business in New York, where the allegedly libelous articles were published and primarily circulated. With these facts in mind, I turn to the substantive choice of law analysis.\n\nOrdinarily, a federal court sitting in diversity applies the forum state's choice of law rules to decide which state's substantive law applies. See Klaxon Co. v. Stentor Elec. Mfg. Co., 313 U.S. 487, 496, 85 L. Ed. 1477, 61 S. Ct. 1020 (1941). In Weinstein v. Friedman, 1996 U.S. Dist. LEXIS 3672, 94 Civ. 6803 (LAP), 1996 WL 137313, at *8-*9 (S.D.N.Y. March 26, 1996), aff'd, 112 F.3d 507 (2d Cir. 1996), I discussed in some detail New York's choice of law rules with respect to defamation actions. In brief, a court considers nine contacts in order to determine which law to apply:\n\n(1) the state of the plaintiff's domicile; (2) the state of plaintiff's principal activity to which the alleged defamation relates; (3) the state where the plaintiff in fact suffered greatest harm; (4) the state of the publisher's domicile or incorporation; (5) the state where the defendant's main publishing office is located; (6) the state of principal circulation; (7) the place of emanation; (8) the state where the libel was first seen; and (9) the law of the forum.\n\nDavis v. Costa-Gavras, 580 F. Supp. 1082, 1091 (S.D.N.Y. 1984) (citing Palmisano v. News Syndicate Co.,, 130 F. Supp. 17, 19 \u0026 n.2 (S.D.N.Y. 1955)). Here, the first two factors tip in favor of applying Georgia law. As to the third factor, it is difficult to determine, in light of the absence of discussion regarding this issue, where Jewell suffered (assuming that he suffered) the greatest harm, although the likely answer is Georgia inasmuch as Jewell resided there during the events at issue and continues to do so to this date. At the same time, to the extent that he suffered injury, that injury was nationwide given the extensive coverage this matter received. Regardless, the remaining six factors all point towards application of New York law. See, e.g., Levin v. McPhee, 917 F. Supp. 230, 235-36 (S.D.N.Y. 1996) (holding, where plaintiff was a non-domiciliary of New York, that New York law applied because the authors and publishers resided in New York and the first publication was also in New York), aff'd on other grounds, 119 F.3d 189, 195 n.4 (2d Cir. 1997) (finding that plaintiff had failed to appeal the choice-of-law ruling); Weinstein, 1996 U.S. Dist. LEXIS 3672, 1996 WL 137313, at * 9 (same result under similar circumstances). Accordingly, New York law applies.\n\nIII. Defamatory Meaning\n\nThe NYP argues, with respect to a number of different statements noted above, that they are not capable of a defamatory meaning as a matter of law. As is set forth below generally as a matter of law and specifically with respect to each statement complained of, it is the context of the statements that is dispositive here. Many of the statements complained of are not defamatory when viewed in isolation; for example, the reference to Jewell as a \"crossing guard.\" However, when viewed in the context of the publications in question, which suggest that Jewell was responsible for a \"major act of terrorism\" and a \"deadly bombing,\" as to most of the statements, I cannot say as a matter of law that no reasonable juror could find the statements defamatory. Therefore, for the reasons that follow, the motion to dismiss is granted in part and denied in part.\n\nIt is the duty of the courts, in the first instance, to determine whether \"the statement alleged to have caused plaintiff an injury is reasonably susceptible to the defamatory meaning imputed to it.\" Levin, 119 F.3d 189, 195 (emphasis added) (citing James v. Gannett Co., 40 N.Y.2d 415, 419, 386 N.Y.S.2d 871, 874, 353 N.E.2d 834, 837-38 (1976)). It remains the exclusive duty of the jury to determine whether a plaintiff has in fact been defamed. See id. This separation of roles leads to an important limitation on the nature of the inquiry I am required to make:\n\nOn a motion to dismiss or for summary judgment, the issue is not whether the court regards the language as libelous, but whether it is reasonably susceptible of such a construction. The court may not . . . interfere with the jury's role by treating as nondefamatory a statement that a reasonable juror may fairly read in context as defamatory.\n\nKelly v. Schmidberger, 806 F.2d 44, 46 (2d Cir. 1986) (internal quotation marks and citation omitted); see also Bardey v. Brooke-Hitching, 167 A.D.2d 141, 141, 561 N.Y.S.2d 455, 455-56 (1st Dep't 1990). A statement is \"reasonably susceptible\" of a defamatory meaning when it \"'tend[s] to expose a person to hatred, contempt or aversion, or to induce an evil or unsavory opinion of him in the minds of a substantial number in the community.'\" Levin, 119 F.3d at 195 (quoting Tracy v. Newsday, Inc., 5 N.Y.2d 134, 136, 182 N.Y.S.2d 1, 3, 155 N.E.2d 853, 854 (1959)); see also Fairley v. Peekskill Star Corp., 83 A.D.2d 294, 296, 445 N.Y.S.2d 156, 158 (2d Dep't 1981) (statement is capable of a defamatory meaning if it \"'tend[s] to expose one to public hatred, shame, obloquy, contumely, odium, contempt, ridicule, aversion, ostracism, degradation or disgrace, or to induce an evil opinion of one in the minds of right-thinking persons, and to deprive one of their confidence and friendly intercourse in society'\" (quoting Kimmerle v. New York Evening Journal, Inc., 262 N.Y. 99, 102, 186 N.E. 217, 218 (1933))). In making this evaluation, I must read the words naturally, in context and as an average reader would:\n\nIn analyzing the words in order to ascertain whether a question of fact exists for resolution upon trial, the court will not pick out and isolate particular phrases but will consider the publication as a whole. The publication will be tested by its effect upon the average reader. The language will be given a fair reading and the court will not strain to place a particular interpretation on the published words. The statement complained of will be read against the background of its issuance with respect to the circumstances of its publication. It is the duty of the court, in an action for libel, to understand the publication in the same manner that others would naturally do. The construction which it behooves a court of justice to put on a publication which is alleged to be libellous is to be derived as well from the expressions used as from the whole scope and apparent object of the writer.\n\nJames, 40 N.Y.2d at 419-20, 386 N.Y.S.2d at 874-75, 353 N.E.2d at 838 (internal quotation marks and citation omitted); see also Levin, 119 F.3d at 195; Golub v. Enquirer/Star Group, Inc., 89 N.Y.2d 1074, 1076, 659 N.Y.S.2d 836, 837, 681 N.E.2d 1282, 1283 (1997). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\"\n\nA. The July 31 Column \u0026 Headline\n\nThe NYP claims that the following statements, or underscored portions thereof (which are set forth below in the passages from which they appear so that the full context of the statement can be measured), in the July 31 Column are not actionable because they are not reasonably susceptible of a defamatory meaning:\n\nWho checked 'Rambo' crossing guard's record?\n\nHe was a fat, failed former sheriff's deputy who spent most of his working days as a school crossing guard, and yearned to go further. But he lost his job on the county force, after six years, when he wrecked a squad car.\n\nThe final straw came after Jewell got up in the middle of the night and set up a road block around the campus, hunting for people driving under the influence, said a source speaking on condition of anonymity. \"He was let go after that,\" said the source.\n\n\"He was a straight arrow who overdid everything,\" college president Ray Cleere told me yesterday.\n\nIt wasn't that Jewell was brutal. But on a campus of 1,000 students, where the worst imaginable problems might involve open beer containers and loud music, Jewell seemed desperate to stand out as a hero.\n\n\"But these aren't the streets of New York. We have a small, country town with a small liberal-arts college. He over-investigated everything.\"\n\nAs an example, Cleere said disputes that could be resolved with a little adult mediation often turned into federal cases.\n\nMetcalf Aff. Ex. B.\n\nTurning first to the reference that Jewell was a \"crossing guard,\" the NYP does not claim that Jewell was in fact a crossing guard. See Metcalf Aff. Ex. B. Thus, because it was not used to convey the truth, the phrase must have some other meaning. Read in context, it can suggest that Jewell's prior work history was insubstantial and insignificant and that Jewell was not capable of more demanding law enforcement work. Indeed, it is linked with the view expressed in the beginning of the sentence that Jewell was a failure. This is also emphasized in the use of this phrase prior to the expression that Jewell \"yearned to go further[,]\" i.e., that Jewell hoped to achieve a job of more importance than that of a \"crossing guard.\" Finally, this notion is expressed in Peyser's statement that Jewell was \"desperate to stand out as a hero.\" It is not unreasonable to read this statement as implying that this \"desperation\" sprang from prior work which was not meaningful. Under such a contextual reading, I cannot say that use of the phrase \"crossing guard\" is not capable of a defamatory meaning. Although the term may have an entirely innocent meaning under some circumstances, it is reasonable to read these statements as aspersions on what Peyser perceived to have been the trivial nature of Jewell's work history and, more broadly, of Jewell's lack of ability. See Balabanoff v. Hearst Consolidated Publications, 294 N.Y. 351, 355, 62 N.E.2d 599, 601 (1945) (\"Words which alone are innocent may in their context clearly be capable of a defamatory meaning and may be so understood.\") (internal quotation marks and citation omitted).\n\nThe same result is required with respect to a group of statements that may be broadly summarized as expressions of the view that Jewell was too aggressive in pursuing his prior jobs -- that he set up a road block hunting for people driving under the influence, that he was a \"straight arrow who overdid everything\" and \"over-investigated everything\" and was \"desperate to stand out as a hero\" and that he turned some matters \"into federal cases.\" The NYP argues that these statements only suggest that Jewell \"was a competent worker who was dissatisfied with the nature of the law enforcement job he held at Piedmont.\" Memorandum of Law of Defendant NYP Holdings, Inc. in Support of Its Motion to Dismiss the Complaint, to be Converted to a Motion for Summary Judgment, dated October 17, 1997, at 15-16 (\"NYP Mem.\"). Consistent with this reading of these statements, the NYP emphasizes that the July 31 Column states that he was a \"well-meaning young man who worked very hard\" and that he \"was an aggressive, competent officer.\" Id. at 16.\n\nThis is certainly fair argument, and a jury might very well agree with this reading of the column. I cannot, however, exclude the possibility that a jury might also find that the statements portray Jewell in a negative light of \"contempt or aversion\" or induce an \"unsavory opinion\" of him in the community. In addition to the positive statements that the NYP relies upon, the column also contains a fair measure of what can only be characterized as negative commentary. Again, Jewell is described as a \"failed\" deputy, a \"home-grown failure\" and as someone whose employment history at Piedmont College was a \"disaster.\" Peyser also described Jewell as a \"disgraced former deputy and fired campus security guard.\" Finally, the obvious bears mention: these statements concerning Jewell's alleged over-aggressive nature appear in a column in which the main purpose was not to praise Jewell for his role in the bombing, but rather to suggest that he may have been responsible for a \"major act of terrorism\" and a \"deadly bombing.\"\n\nIn addition, these statements are more than just unrelated negative aspersions that bear no relationship to the specific statements concerning Jewell's alleged over-aggressiveness; rather they set the overall tone in which the specific statements must be viewed. See Levin, 119 F.3d at 196 (\"Because defamatory meaning is drawn from the words used and their context, we cannot ignore the implications about [plaintiff] from assertions made in the article, read in conjunction with the fact that [plaintiff] was at the scene [of the murder described in the defendant's book].\"). A juror may well conclude that the reason Jewell was a \"home-grown failure,\" a \"disaster\" and a \"disgraced former deputy\" was precisely because he was too aggressive. In other words, Jewell's alleged over-aggressiveness is directly linked to Peyser's view that Jewell was a failure. While in a different context these statements ascribing over-aggressive professional behavior to Jewell might be wholly non-defamatory, here a juror could reasonably conclude that they portray Jewell as \"an individual with an aberrant and/or violent personality and a bizarre employment history.\" Complaint P 47. As a result, the NYP's motion must be denied.\n\nB. The July 31 Article\n\nWith respect to the July 31 Article, the NYP claims that the following statements, or underscored portions thereof, are not actionable because they do not possess a defamatory meaning:\n\nCleere said Jewell had been given the option of resigning or being fired in May because he was overly enthusiastic about his police duties and liked the limelight.\n\nThe Journal-Constitution reported Jewell had sought interviews with CNN, NBC and other news outlets.\n\nMetcalf Aff. Ex. B. The statement that Jewell was \"overly enthusiastic\" is another means of expressing the view that he \"overdid everything\" and, for the same reasons discussed supra, is capable of a defamatory meaning when read in context with the July 31 Column. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" In addition, this statement, taken in isolation from the July 31 Column, is linked to Jewell's being given the option of \"resigning or being fired\" because he was \"overly enthusiastic\" and \"liked the limelight.\" In other words, because these qualities purportedly led Cleere to consider firing Jewell, a reader may very well have formed an \"unsavory\" opinion of Jewell based on these observations and I, therefore, cannot conclude as a matter of law that the statement is not capable of a defamatory meaning.\n\nTurning to the statement that Jewell \"sought interviews with CNN, NBC and other news outlets[,]\" this statement is actionable under the circumstances as well. The NYP argues that these statements are not defamatory because \"seeking media attention, while perhaps undignified, is not illegal or immoral.\" NYP Mem. at 15. While it may be true that these actions are not \"illegal or immoral,\" the law does not require them to be either in order for the statements to be capable of a defamatory meaning. It is enough if the statement \"'tend[s] to expose a person to hatred, contempt or aversion, or to induce an evil or unsavory opinion of him in the minds of a substantial number in the community.'\" Levin, 119 F.3d at 195 (quoting Tracy v. Newsday, Inc., 5 N.Y.2d 134, 136, 182 N.Y.S.2d 1, 3, 155 N.E.2d 853, 854 (1959)); see also Lewis v. Newsday, Inc., 668 N.Y.S.2d 377, 379 (1st Dep't 1998) (printed statement that plaintiff said \"\u0026$ $\u0026!!!!\" to a reporter interpreted to mean that plaintiff \"unleashed a barrage of unprintable expletives at [a] reporter, a significant breach of propriety\" and holding that such a statement was capable of a defamatory meaning because \"the impression is arguably created that plaintiff was a boor who might well have engaged in the misconduct alleged\").\n\nThe NYP is certainly correct, however, in implying that under some circumstances, there is nothing defamatory about seeking media attention. Here, however, Jewell was portrayed as someone who was forced to choose between being fired or resigning because he \"liked the limelight.\" The additional factual statement that, at a later point in time, he \"sought interviews\" with major media outlets reinforces the view that Jewell's \"liking the limelight\" led to his loss of employment. While under some circumstances a statement that an individual sought media attention may be incapable of a defamatory meaning, here, when viewed in its broader context, the statement is capable of a defamatory meaning. See Netzer v. Continuity Graphic Assocs., Inc., 963 F. Supp. 1308, 1324 (S.D.N.Y. 1997) (\"If the statement complained of is susceptible of more than one meaning, at least one of which is defamatory, the claim must go to the jury.\" (citing James, 40 N.Y.2d at 419, 386 N.Y.S.2d at 874, 353 N.E.2d at 837-38)).\n\nC. The August 1 Article\n\nTurning to the August 1 Article, the NYP claims that the following statements, or underscored portions thereof, are not capable of implying a defamatory meaning:\n\n\"Obviously, his profile is right-on,\" the source said. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\n\"This is something I want to put in my Olympic scrapbook, said Mike Pugliese. \"Everybody here should be glad they finally got this guy. It's good they made progress like this while the Games are still going on. I think it makes people feel safer and better.\"\n\nCleere, who wouldn't tell reporters why Jewell was forced to leave, called the FBI to tell them that the former employee had been too zealous about his duties and sought attention.\n\nMetcalf Aff. Ex. B. For the same reasons discussed in connection with the July 31 Column and the July 31 Article, the statement that Jewell was \"too zealous about his duties and sought attention\" is actionable.\n\nAs to the statement that Jewell's \"profile is right on,\" the NYP argues that this \"suggests only that Jewell fit a number of characteristics of that profile. Certainly profiles, by their very nature, include numbers of innocent persons.\" NYP Mem. at 16. This argument ignores the implications of being identified as someone who fits the profile of the perpetrator of a \"major act of terrorism.\" Such an identification certainly \"expose[s] a person to hatred, contempt or aversion, or . . . induce[s] an evil or unsavory opinion [of that person] in the community.\" Although the net cast by a criminal profile may well capture a number of innocent people, that fact does not change the damaging impact on the innocents snared. As in this case, a person who fits the profile is identified as someone who may have been involved in a criminal act. Such a false accusation is not without its sting or pain. See, e.g., Levin, 119 F.3d at 195 (statement implicating someone in a murder, even though such an implication appeared \"among conflicting and speculative versions of an unresolved mystery,\" was capable of a defamatory meaning and motion to dismiss was properly denied); Kelly, 806 F.2d at 47 (statement that plaintiffs, ordained Roman Catholic priests, may have placed church property \"in their own names\" held to be capable of a defamatory meaning because \"the ordinary reader . . . might well read these words as accusing plaintiffs of fraudulent, if not illegal, activity\" and concluding that \"[a] charge of corrupt or criminal conduct is clearly sufficient to sustain an action for libel\"). As a result, the NYP's motion on this statement must be denied.\n\nFinally, the statement by Mr. Pugliese is not capable of a defamatory meaning. Although the remainder of the statement is capable of a defamatory meaning, and the NYP does not argue otherwise, the statement concerning Mr. Pugliese's scrap book bears no relationship to it and does not even directly concern or implicate Jewell. As the NYP argues, it is not defamatory for a \"gawker observing the FBI's search of Jewell's home to state that he wished to document the event by putting it in his Olympic scrapbook.\" NYP Mem. at 16 (internal quotation marks omitted).\n\nD. The August 1 Photograph\n\nThe NYP argues that the August 1 Photograph, described supra, is not capable of a defamatory meaning. As the NYP points out, Jewell does not dispute that this is a photograph of him. Accordingly, its defamatory meaning can only flow from the manner in which the photograph is portrayed in the broader setting of the newspaper, including its caption. See, e.g., Bytner v. Capital Newspapers, 67 N.Y.2d 914, 916, 501 N.Y.S.2d 812, 812, 492 N.E.2d 1228, 1228 (1986); Alvarado v. K-III Magazine Corp., 203 A.D.2d 135, 135-36, 610 N.Y.S.2d 241, 242 (1st Dep't 1994); Gambuzza v. Time, Inc., 18 A.D.2d 351, 353, 239 N.Y.S.2d 466, 469 (1st Dep't 1963); Da Silva v. Time Inc., 908 F. Supp. 184, 186-87 (S.D.N.Y. 1995); Church of Scientology Int'l v. Time Warner, Inc., 806 F. Supp. 1157, 1161 (S.D.N.Y. 1992). A photograph which is otherwise an accurate picture of a plaintiff may nonetheless be actionable where the caption suggests something defamatory and false about the plaintiff. See Da Silva, 908 F. Supp. at 186-87 (photograph of plaintiff dressed in a \"short, tight, multi-strapped dress\" with a caption stating that plaintiff \"wanders by a waterfront bar looking for customers\" held to be capable of a defamatory meaning where plaintiff was once a prostitute, but was no longer a prostitute at the time the photograph was published).\n\nHere, the caption underneath the photograph reads: \"DRESSING THE PART: Suspect security guard Richard Jewell clearly fits the profile of the bomber, say federal investigators.\" Above the picture appears the following headline: \"FEDS 'HOME IN' ON BOMB SUSPECT.\" This headline in turn appears under the banner which the NYP used during its coverage of this event: \"TERROR IN AMERICA.\" The NYP argues that the photograph, along with these captions, is not defamatory because the statement that Jewell was \"dressing the part suggests simply that Jewell looks, in this particular picture, like a person who might fit the profile of the bomber. It does not imply that he was, in fact, the person responsible.\" NYP Mem. at 28.\n\nThis argument must fail for two reasons. First, as discussed supra, I have already held that statements which suggest that Jewell \"fit the profile of the bomber\" are capable of a defamatory meaning. Thus, to the extent that the NYP argues that this photograph is not actionable because the language \"dressing the part\" refers to Jewell's \"fitting the profile,\" that argument is rejected. Second, while the phrase \"dressing the part\" can be read to refer to Jewell's \"fitting the profile of the bomber,\" it is also reasonable to read the phrase as suggesting that Jewell was in fact the bomber. In this reading, \"part\" refers not to a profile, but rather to an actual role, i.e., the bomber. This reading is consistent with the headline that appears over the photograph: \"FEDS 'HOME IN' ON BOMB SUSPECT.\" Accordingly, and because such a reasonable reading would clearly be capable of a defamatory reading, the NYP's motion is denied.\n\nE. The August 2 Article\n\nFinally, the NYP claims that the following two statements are not reasonably susceptible of a defamatory meaning:\n\nThe source also revealed that Jewell had exercised his right not to incriminate himself when he was called in to FBI offices for questioning Tuesday.\n\n\"He came in but he didn't talk. He said he didn't want to talk unless his lawyer was present. I don't know why he came in.\"\n\nMetcalf Aff. Ex. B. The essence of the NYP's argument is that there is nothing defamatory about exercising the right not to incriminate one's self, nor is there anything defamatory about refusing to speak to the authorities until one's lawyer is present. See Reply Memorandum of Law of Defendant NYP Holdings, Inc. In Further Support of Its Motion to Dismiss the Complaint, to be Converted to a Motion for Summary Judgment, dated March 18, 1998, at 10-11 (\"NYP Reply Mem.\"). I agree. A newspaper should be able to print (even falsely) that an individual exercised a constitutional right without fearing a subsequent libel action. Such statements do not subject individuals to the type of \"hatred, contempt or aversion\" that the law requires for a statement to be capable of a defamatory meaning. See Levin, 119 F.3d at 195 (internal quotation marks and citation omitted).\n\nThe cases Jewell relies upon do not persuade me otherwise. In Adams v. Daily Telegraph Printing Co., 292 S.C. 273, 356 S.E.2d 118 (S.C. Ct. App. 1986), aff'd on other grounds, 295 S.C. 218, 367 S.E.2d 702 (1988), plaintiff brought suit based upon a news broadcast that accused him of murdering two young children. During the broadcast, one of the victim's parents, referring to the plaintiff, stated as follows:\n\nWe would like to announce that [plaintiff] employed an attorney approximately a year ago and both he and his attorney . . . have refused to cooperate. The public is free to draw their own conclusion. I don't believe when our forefathers placed the Fifth Amendment in our Constitution that they intended it as a technicality to hide behind in a matter as serious as this, when your own child has been murdered.\n\n356 S.E.2d at 120. The court held that this statement was capable of a defamatory meaning. See id. at 122. Unlike the neutral statement of purported fact reported by the NYP, this statement is laden with innuendo and suggestion that the plaintiff was guilty of the crime charged, and this implication was specifically linked to the Fifth Amendment when the speaker referred to \"hiding behind\" it. Indeed, the court recognized this when it reasoned that by using the phrase \"the public is free to draw their own conclusion,\" the speaker \"made manifest\" his intention that the public \"draw a conclusion from the broadcast other than the literal meaning[.]\" See id. In addition, other statements during the broadcast indicated that plaintiff refused to take a truth serum and submit to questioning. See id.; see also Molnar v. Star-Ledger, 193 N.J. Super. 12, 471 A.2d 1209, 1212 (N.J. Super. Ct. App. Div. 1984) (holding that statement that the plaintiff refused to take a lie detector test was capable of a defamatory meaning).\n\nHere, the statements concerning Jewell's invocation of the Fifth Amendment and desire to have his attorney present do not suggest that readers should draw an inference of guilt from that fact alone. Nor does the statement appear in a manner that suggests that Jewell refused to cooperate with the investigation. Accordingly, neither Adams nor Molnar convinces me that the statements at issue herein are capable of a defamatory meaning, and the NYP's motion is granted.\n\nF. The August 2 Photograph\n\nFinally, the NYP argues that nothing about the August 2 Photograph is capable of a defamatory meaning. See NYP Mem. at 29. Briefly, the photograph is of a man, purported to be Jewell (a fact that Jewell disputes), standing behind and leaning against three bars. Underneath the photograph, the following caption appears: \"JEWELL WATCH: Jewell peers from stairway of his Atlanta home yesterday.\" Jewell claims that the photograph is capable of a defamatory meaning because it portrays him \"as an individual behind bars who was guilty of criminal involvement in the Centennial Olympic Park bombing.\" Complaint P 143. This argument simply makes no sense. No reasonable reader of the NYP could conclude that the NYP was suggesting that Jewell was behind bars, as the caption of the photograph states that Jewell was \"peering from [the] stairway of his Atlanta home yesterday\" and it was quite clear from the other articles that an arrest had not been made. Moreover, while other statements discussed thus far suggest that Jewell was responsible for the bombing, nothing about the picture is capable of such a suggestion. As a result, the NYP's motion is granted.\n\nIV. Substantial Truth\n\nUnder New York law, it is well-settled that \"'truth is an absolute, unqualified defense to a civil defamation action.'\" Guccione v. Hustler Magazine, Inc., 800 F.2d 298, 301 (2d Cir. 1986), cert. denied, 479 U.S. 1091, 94 L. Ed. 2d 158, 107 S. Ct. 1303 (1987) (quoting Commonwealth Motor Parts Ltd. v. Bank of Nova Scotia, 44 A.D.2d 375, 378, 355 N.Y.S.2d 138, 141 (1st Dep't 1974) (citation omitted), aff'd, 37 N.Y.2d 824, 377 N.Y.S.2d 482, 339 N.E.2d 888 (1975)). It is an equally fundamental concept that \"'substantial truth' suffices to defeat a charge of libel.\" Id. (quoting Fairley v. Peekskill Star Corp., 83 A.D.2d 294, 297, 445 N.Y.S.2d 156, 159 (2d Dep't 1981)); see also Carter v. Visconti, 233 A.D.2d 473, 474, 650 N.Y.S.2d 32, 33 (2d Dep't 1996), leave to appeal denied, 89 N.Y.2d 811, 657 N.Y.S.2d 403, 679 N.E.2d 642 (1997). A statement is substantially true if the statement would not \"have a different effect on the mind of the reader from that which the pleaded truth would have produced.\" Fleckenstein v. Friedman, 266 N.Y. 19, 23, 193 N.E. 537, 538 (1934); see also Cafferty v. Southern Tier Publishing Co., 226 N.Y. 87, 93, 123 N.E. 76, 78 (1919) (\"When the truth is so near to the facts as published that fine and shaded distinctions must be drawn and words pressed out of their ordinary usage to sustain a charge of libel, no legal harm has been done.\"); Chung v. Better Health Plan, 1997 U.S. Dist. LEXIS 9627, No. 96 Civ. 7310 (JGK), 1997 WL 379706, at * 2 (S.D.N.Y. July 9, 1997); Vetere v. Associated Press, Inc., 1989 U.S. Dist. LEXIS 3894, No. 88 Civ. 4115 (MGC), 1989 WL 39664, at * 1 (S.D.N.Y. April 17, 1989). Thus, under New York law, \"it is not necessary to demonstrate complete accuracy to defeat a charge of libel. It is only necessary that the gist or substance of the challenged statements be true.\" Printers II, Inc. v. Professionals Publishing, Inc., 784 F.2d 141, 146 (2d Cir. 1986); see also Korkala v. W.W. Norton \u0026 Co., 618 F. Supp. 152, 155 (S.D.N.Y. 1985) (\"Slight inaccuracies of expression are immaterial provided that the defamatory charge is true in substance.\") (internal quotation marks and citation omitted); Sharon v. Time, Inc., 609 F. Supp. 1291, 1294 (S.D.N.Y. 1984) (\"Defendant is permitted to prove the substantial truth of this statement by establishing any other proposition that has the same 'gist' or 'sting' as the original libel, that is, the same effect on the mind of the reader.\").\n\nHere, the NYP claims that Peyser's statements, in the July 31 Column, that Jewell was \"a prime suspect\" and \"the main suspect\" are substantially true. See Metcalf Aff. Ex. B. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" Because this aspect of the motion is brought pursuant to Fed. R. Civ. P. 12(b)(6), I must take the allegations in the Complaint as true, and the NYP is precluded from arguing to the contrary. Accordingly, the NYP must rely upon statements contained in the Complaint, or any other admissions in these motion papers, to establish the truth against which these statements must be evaluated. See Armstrong v. Simon \u0026 Schuster, Inc., 85 N.Y.2d 373, 379-80, 625 N.Y.S.2d 477, 480-81, 649 N.E.2d 825 (1995) (Kaye, C.J.) (recognizing the propriety of resolving this issue on a motion to dismiss, but emphasizing the limitations inherent in this procedural posture); Chung, 1997 U.S. Dist. LEXIS 9627, 1997 WL 379706 at * 2-*3 (addressing a motion to dismiss and holding, based solely upon a comparison of allegations contained in a complaint, that challenged statements were substantially true). In other words, the NYP is precluded from introducing anything not contained in the Complaint to establish the truth of the statements that Jewell was the \"main\" or \"prime\" suspect.\n\nThe Complaint alleges that Jewell \"was investigated by the FBI.\" Complaint P 34; see also id. P 35 (\"The FBI scrutiny of Mr. Jewell was brought to a conclusion.\"). In addition, Jewell admits, based upon allegations contained in the Complaint, see id. at PP 30, 34-47, that he was \"a suspect.\" See Jewell Mem. at 11; see also August 1 Article; Smith Aff. Ex. D (\"Jewell's lawyer, Watson Bryant, initially denied Jewell was a suspect but later admitted: 'If they're searching the place, yeah, he's a suspect.'\"). Accordingly, this aspect of the NYP's motion turns upon whether Peyser's statements that Jewell was the \"main\" or \"prime\" suspect are substantially true in light of Jewell's admission that he was \"a\" suspect. For the reasons that follow, this aspect of the NYP's motion is granted. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nNot surprisingly, a review of the case law in this area does not provide any authority one way or the other on this precise, intensely factual, question. Nor does it provide any guidance in even a remotely analogous set of circumstances. What it does reveal is that the cases addressing the extent to which a given statement is substantially true fall along a broad spectrum. At one extreme are cases where a statement is held to be non-actionable less because it was substantially true and more because it was completely true. See, e.g., Carter, 233 A.D.2d at 474, 650 N.Y.S.2d at 33 (claim that defendant committed libel by informing the authorities that plaintiff was endorsing checks made payable to the defendant and depositing them in plaintiff's account held non-actionable where plaintiff had in fact endorsed checks made payable to the defendant); Love v. William Morrow and Co., 193 A.D.2d 586, 587-88, 597 N.Y.S.2d 424, 426 (2d Dep't 1993) (statement that plaintiff, a reporter for the New York Times, had informed opposition forces in Iranian civil war that \"weak guard forces\" surrounded a leader's home held to be substantially true where plaintiff first stated as much in a term paper he wrote for a graduate course); Kraus v. Brandstetter, 167 A.D.2d 445, 445-46, 562 N.Y.S.2d 127, 129 (2d Dep't 1990) (statement that \"your boss is going to be fired\" held to be substantially true where boss was subsequently fired).\n\nIn the middle, broadly speaking, are two types of cases. In the first, while the statement is not completely true, one struggles to identify any area of ambiguity as to truth. See, e.g., Aequitron Medical, Inc. v. CBS, Inc., 964 F. Supp. 704, 716 (S.D.N.Y. 1997) (applying Minnesota law, which does not appear to be any different from New York law with respect to this question, and holding that use of the word \"alarm\" was substantially true where truth was that plaintiff used a \"monitor\" device); Chung, 1997 U.S. Dist. LEXIS 9627, 1997 WL 379706 at * 2-*3 (statements that plaintiff \"had a sexual harassment lawsuit\" pending against her employer and that plaintiff had been \"terminated\" from her employment held to be substantially true when plaintiff had an EEOC charge pending and had been \"constructively discharged\"); Vetere, 1989 U.S. Dist. LEXIS 3894, 1989 WL 39664 at * 2 (holding that statement that plaintiff was a member of the American Nazi Party was substantially true where plaintiff had participated in a march organized by the National Socialist White People's Party, the successor organization to the American Nazi Party); Miller v. Journal-News, 211 A.D.2d 626, 627, 620 N.Y.S.2d 500, 501 (2d Dep't 1995) (statement that plaintiff was \"suspended\" substantially true where plaintiff was placed on \"administrative leave\").\n\nIn the second, the stretch between the statement and the admitted truth becomes more tenuous, but still the overall \"gist\" or \"sting\" cannot be said to be \"substantially\" different. See, e.g., Guccione, 800 F.2d at 302-03 (holding that statement which implied that plaintiff was then currently an adulterer was substantially true where plaintiff had ceased being an adulterer but had \"unabashedly committed adultery\" for thirteen of seventeen years); Printers II, 784 F.2d at 146-47 (even though statement was \"literally false\" and \"may have impliedly misrepresented\" that plaintiff was overdue in paying its bills, statement was nonetheless substantially true because plaintiff was disputing the bills \"with such vigor\" that plaintiff had no intention of paying the bills when due); Corporate Training Unlimited, Inc. v. National Broadcasting Co., 981 F. Supp. 112, 120-21 (E.D.N.Y. 1997) (statement that plaintiff was \"forced to leave the military for less than satisfactory service\" held to be substantially true where plaintiff, rather than face a court martial, submitted a request for discharge \"for the good of the service\" after it was discovered that plaintiff had engaged in various \"financial improprieties\") (internal quotation marks omitted); Contemporary Mission, Inc. v. The New York Times Co., 665 F. Supp. 248, 259-60 (S.D.N.Y. 1987) (statement that the State of Connecticut had issued a cease and desist order against plaintiff \"for failing to deliver merchandise\" held to be substantially true where the order provided that plaintiff should desist from \"accepting mail orders and payments for its merchandise and then failing to deliver either the ordered merchandise or refunds within a reasonable period of time\") (internal quotation marks omitted), aff'd, 842 F.2d 612 (2d Cir.), cert. denied, 488 U.S. 856 (1988).\n\nFinally, at the other extreme, are those cases in which a defendant simply asks too much in asserting that a statement is substantially true because the difference between the two is plainly substantial. See, e.g., Da Silva v. Time Inc., 908 F. Supp. 184, 186-87 (S.D.N.Y. 1995) (holding, in contrast to Guccione, that photograph of plaintiff which identified her as a prostitute was not substantially true where plaintiff had been a prostitute for some six years but was not at the time of publication); Dibble v. WROC TV Channel 8, 142 A.D.2d 966, 966-67, 530 N.Y.S.2d 388, 388-89 (4th Dep't 1988) (holding that statement that plaintiff was \"indicted on charges of fraud, embezzlement and securities violations\" and that plaintiff was \"accused of misuse of clients' escrow accounts and stock fraud\" was not substantially true where plaintiff had been indicted for grand larceny in the second degree after stealing more than $ 1,500 worth of property from NEC Home Electronics) (internal quotation marks omitted).\n\nAfter reviewing these cases in light of the circumstances presented herein, I find that much like the second category of statements that fall along the middle portion of the spectrum, the statements that Jewell was the \"main\" or \"prime\" suspect are substantially true in light of his admission that he was \"a\" suspect. Admittedly, there is a difference between the statements inasmuch as the word \"a\" implies that Jewell was one of a few people being investigated, whereas the plain meaning of the words \"prime\" and \"main\" indicate that Jewell was the leading suspect. Nonetheless, a reasonable reader would not have reacted differently to either these specific statements or the overall content of the July 31 Column based upon this difference in terminology. Under either usage, the main \"sting\" or \"gist\" of the overall content of the column was the same -- Jewell was suspected of having planted the bomb and was being actively investigated by the authorities. In this sense, the pleaded truth, that Jewell was \"a suspect,\" would not have produced a different meaning in the minds of readers because someone accused of being \"a suspect\" could still be suspected of having committed the crime and could still be the subject of an active investigation.\n\nThis is all the more the case when one reads these isolated phrases in context with the remainder of the statements in which they appear:\n\nRichard Jewell, the Olympic security guard who's reportedly turned into a prime suspect for Saturday's deadly bombing, had a reputation for being the Village Rambo in Habersham County -- a rural area in the north Georgia mountains that actually sees snow in winter.\n\nThat the main suspect in a major act of terrorism is a home-grown failure is both a relief -- and a major embarrassment -- to this city's real law-enforcement people.\"\n\nJuly 31 Column; Peyser Aff. Ex. E. In neither instance did the language emphasize that Jewell was the leading suspect or that this was somehow critical. Indeed, in both instances use of the words \"prime\" and \"main\" seems almost ancillary to the overall thrust of the statements. In the first statement the general thought conveyed is that Jewell had a reputation for being \"the Village Rambo\" -- which (as discussed in greater detail infra, Part VI) is a phrase devoid of precise meaning but which, in context, conveys the notion that Jewell was overly aggressive in pursuing his law enforcement duties. In the second, the main idea expressed is that Jewell was a \"home-grown failure\" as a law enforcement officer and that this should be both a source of relief and embarrassment, for reasons that are not entirely clear. In either case, the meaning of the words \"main\" or \"prime,\" and the specific implication to which Jewell objects, was not the central focus of the thoughts conveyed. Accordingly, reading the words in their immediate context adds further support for the conclusion that the \"gist\" or \"sting\" of these words and the admitted truth would not have produced a different effect on the average reader. The NYP's motion is, therefore, granted.\n\nV. The Republication Defense\n\nThe NYP argues than many of the statements contained in the July 31 Column, the July 31 Article, the August 1 Article and the August 2 Article are protected by what is sometimes referred to as the wire service defense. The sources for these various reports varied, but included wire reports published by the Associated Press (\"AP\") and broadcasts by Cable News Network (\"CNN\"). Also at issue is whether two articles published by the AJC were relied upon. For the reasons that follow, the NYP's motion for summary judgment on this ground is denied. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\"\n\nThe wire service defense was first articulated by the Supreme Court of Florida in Layne v. Tribune Co., 146 So. 234 (1933) (en banc). There, the defendant republished two AP wire reports concerning the alleged unlawful possession of alcohol by Congressman Edward E. Dennison. See id. at 235-36. In granting the defendant's motion to dismiss, the Florida Supreme Court recognized that local newspapers must frequently gather information from a number of outside sources in order to provide readers with coverage of world and national events. See id. at 237-39. The court further noted the public benefit obtained from this practice and accordingly articulated the following rule:\n\nThe mere reiteration in a daily newspaper, of an actually false, but apparently authentic news dispatch, received by a newspaper publisher from a generally recognized reliable source of daily news, such as some reputable news service agency engaged in collecting and reporting the news, cannot through publication alone be deemed per se to amount to an actionable libel by indorsement, in the absence of some showing from the nature of the article published, or otherwise, that the publisher must have acted in a negligent, reckless, or careless manner in reproducing it to another's injury.\n\nId. at 238. Some courts continue to cite Layne approvingly. See, e.g., Winn v. Associated Press, 903 F. Supp. 575, 578-80 (S.D.N.Y. 1995) (applying Virginia law), aff'd, 104 F.3d 350 (2d Cir. 1996); Brown v. Courier Herald Publishing Co., 700 F. Supp. 534, 537-38 (S.D. Ga. 1988) (applying Georgia law); Nelson v. Associated Press, Inc., 667 F. Supp. 1468, 1476-77 (S.D. Fla. 1987) (applying Florida law).\n\nCuriously, Layne has not been cited in any reported decision of a New York State court. Rather, New York has adopted a similar, but somewhat broader, rule with respect to republication: \"[A] company or concern which simply republishes a work is entitled to place its reliance upon the research of the original publisher, absent a showing that the republisher 'had or should have had, substantial reasons to question the accuracy of the articles or the bona fides of (the) reporter.'\" Karaduman v. Newsday, Inc., 51 N.Y.2d 531, 550, 435 N.Y.S.2d 556, 565-66, 416 N.E.2d 557, 566 (1980) (quoting Rinaldi v. Holt, Rinehart \u0026 Winston, Inc., 42 N.Y.2d 369, 383, 397 N.Y.S.2d 943, 952, 366 N.E.2d 1299, 1307 (1977), cert. denied, 118 S. Ct. 1169 (1998)); see also Chaiken v. VV Publishing Corp., 119 F.3d 1018, 1032 (2d Cir. 1997) (applying Karaduman and Weiner v. Doubleday \u0026 Co., 74 N.Y.2d 586, 550 N.Y.S.2d 251, 549 N.E.2d 453 (1989), cert. denied, 495 U.S. 930, 109 L. Ed. 2d 498, 110 S. Ct. 2168 (1990)), cert. denied, 118 S. Ct. 1169 (1998).\n\nThere is some question about whether Layne applies to the republication of information obtained from sources other than a wire service. See generally James E. Boasberg, Comment, With Malice Toward None: A New Look at Defamatory Republication and Neutral Reportage, 13 Hastings Comm. \u0026 Ent. L.J. 455, 463 (1991); Winn, 903 F. Supp. at 579-80 (applying Layne and holding that the AP was entitled to rely upon an article published by the Virginian-Pilot (citing Holden v. Clary, 1992 U.S. Dist. LEXIS 19951, No. Civ. A. 92-313, 1992 WL 373145 (E.D. Va. Sept. 17, 1992))); Nelson, 667 F. Supp. at 1475 (applying the defense where reliance was placed upon various newspapers). The New York rule, on its face, is not so limited and, indeed, has been applied in a number of cases where the republished material was originally published by a source other than a wire service. See, e.g., Chaiken, 119 F.3d at 1032 (applying the defense where the original source was a non-contract writer for the Village Voice with a \"sound reputation\"); Bryks v. Canadian Broadcasting Corp., 928 F. Supp. 381, 384-85 (S.D.N.Y. 1996) (holding that the Canadian Broadcasting Corporation was a reliable source for information subsequently republished by CNN); Weiner, 74 N.Y.2d at 596, 550 N.Y.S.2d at 255, 549 N.E.2d at 457 (applying the defense in a lawsuit against the publisher and author of a book and holding that the publisher was entitled to rely upon the author, \"whose experience and reputation are unquestioned[,]\" and that the author was entitled to rely upon an \"experienced researcher\"); Ortiz v. Valdescastilla, 102 A.D.2d 513, 519-20, 478 N.Y.S.2d 895, 899-900 (1st Dep't 1984) (same result under virtually identical circumstances); Karaduman, 51 N.Y.2d at 551-52, 435 N.Y.S.2d at 566, 416 N.E.2d at 567 (applying the defense to the publisher of a book collecting a series of newspaper articles where the \"integrity\" of the reporters who originally published the articles was not in doubt). In this sense, therefore, the New York rule appears to be broader than the doctrine articulated in Layne insofar as New York recognizes a general republication defense applicable to anyone who republishes material from any source, provided that there was no substantial reason to question the accuracy of the material or the reputation of the reporter. With these basic principles in mind, I turn to the specific arguments raised herein.\n\nA. The AP Wire Service Reports\n\nIn their respective affidavits, Peyser and Smith recount their general practice of relying upon AP wire reports when covering news breaking events. See Peyser Aff. PP 7 \u0026 13; Smith Aff. PP 4 \u0026 6-11. In addition, both reporters state that they relied upon various AP reports in writing the July 31 Column and the July 31, August 1 and August 2 Articles. See id. Although Jewell has not raised an issue of material fact as to these reporters' general practice of relying upon AP reports, for the reasons set forth below, I find that there are material questions of fact as to Peyser's and Smith's reliance upon the particular AP reports at issue.\n\nIn her affidavit, Peyser candidly concedes that while she generally relies upon the AP, she has no specific recollection of which reports she relied upon in connection with her authorship of the July 31 Column:\n\nAlthough I cannot recall precisely which reports I read on that day, I have reviewed some of the AP wire service reports published on July 30, 1996 in connection with this lawsuit. I know, based on what I have read, that I relied on the AP wire service reports for some of the information in my July 31 Column.\n\nPeyser Aff. P 13. Annexed to Peyser's affidavit are various AP wire reports which do indeed contain information also found in the July 31 Column. See Peyser Aff. Exs. C \u0026 D.\n\nSmith's affidavit is less clear, but nonetheless to the same effect; namely, that while Smith appears to have conducted a review of various AP reports subsequent to the filing of this lawsuit, he does not recall with certainty which AP reports he reviewed prior to writing the July 31, August 1 and August 2 Articles. For example, Smith's affidavit states as follows:\n\nI know that I reviewed AP wire service reports and watched news programs such as CNN. I also spoke with [Robert] Hardt [Jr.], who was reporting [for the NYP] on the investigation from Atlanta. . . . With respect to each of the articles, the information came from either AP or from Hardt.\n\nSmith Aff. P 6. Noticeably lacking in this statement is any specific indication of which information came from which source and which AP reports were reviewed. Other statements reveal much the same. See Smith Aff. P 8 (\"Before the July 31 Article was published, AP had reported much of the information contained in that article on the day before, on July 30th. I have reviewed AP wire service reports from that day, as well as for subsequent days, in connection with this lawsuit. On Tuesday, July 30th, AP reported the following about Jewell[.]\"); P 10 (\"As with the July 31 Article, I consulted the news wires before writing the August 1 Article. Much of the information contained in the August 1 Article appeared on AP on July 30th and July 31st[.]\"); P 11 (\"As with the previous articles, I relied on AP news wire reports for some of the information reported.\"). Again, as with Peyser, a review of the various AP reports annexed to Smith's affidavit reveals that some of the information in those reports is also contained in Smith's articles. See Smith Aff. Exs. B, C, E \u0026 G.\n\nAs noted supra, in part as a result of this ambiguity, I converted this aspect of the NYP's motion to dismiss into a summary judgment motion and granted Jewell the right to conduct limited discovery on this issue in the form of deposing Peyser and Smith. Had these affidavits created any ambiguity on the question of Peyser's and Smith's recollection in this regard, these depositions clarified the point. Peyser testified as follows:\n\nQ: Let me see if I can try to understand. What you are telling me is that you do not have a specific recollection of which AP reports you read on July 30, 1996 in preparing your column of July 31?\n\nA. That is correct.\n\nDeposition of Andrea Peyser, dated January 7, 1998, at 45 (\"Peyser Dep.\"); annexed as Ex. A to the Declaration of Mark E. Goidell, dated February 23, 1998 (\"Goidell Dec.\"). Other statements to similar effect can be found throughout the deposition. See Peyser Dep. at 46-47, 117 \u0026 181-83. Any uncertainty on this point with respect to Smith's articles was also clarified at his deposition:\n\nQ: In fact, with respect to all of the articles cumulatively, the July 31st article, the August 1 article and the August 2nd Article, you are unable to state under oath that you reviewed any of the AP wire service reports marked as Exhibits B, C, E and G before writing those articles; true?\n\nA: Yes.\n\nDeposition of Kyle Smith, dated January 7, 1998, at 25 (\"Smith Dep.\"); annexed as Ex. B to the Goidell Dec.; see also id. at 22-23, 27-29, 33 \u0026 35 (similar testimony).\n\nThe NYP argues that Jewell has \"intentionally mischaracterized\" the deposition testimony. NYP Reply Mem. at 1. The NYP asserts that because of the passage of time -- more than one year -- Peyser and Smith cannot recall \"whether the wire service reports annexed to their affidavits were the precise reports they viewed in preparation for the Articles[,]\" but they \"did rely on wire service dispatches in preparing the Articles.\" Id.\n\nNotwithstanding this argument, the legal consequence of this candid testimony is that the NYP's motion for summary judgment must be denied. Viewed in the light most favorable to Jewell, this testimony establishes a material issue of fact, for two slightly different but related reasons, with respect to the NYP's ability to assert the republication defense. First, because New York law permits the NYP to prevail on this defense only if the NYP neither had nor should have had substantial reason to question the accuracy of the AP reports, the record must clearly reflect which reports were relied upon. Here, the problem is not so much a failure to establish reliance as much as a failure to establish what was relied upon. In the absence of a clear record on the critical issue of which reports were relied upon, it is impossible to determine, as a matter of law, whether there was any reason to question the accuracy of the reports. Cf. Lerman v. Chuckleberry Publishing, Inc., 521 F. Supp. 228, 236 (S.D.N.Y. 1981) (denying publisher's motion for summary judgment under the Karaduman standard where the caption under the document at issue misidentified certain pieces of information and thereby raised material questions of fact as to its reliability); Meadows v. Taft Broadcasting Co., 98 A.D.2d 959, 960 470 N.Y.S.2d 205, 208 (4th Dep't 1983) (denying motion for summary judgment where an investigative reporter for the defendant television station \"professed little or no recall concerning his sources and how he obtained the information\" discussed in his report). To accept the argument urged by the NYP would be tantamount to adopting a rule that a newspaper's general practice of relying upon AP wire reports is sufficient to avoid liability without any inquiry into the specific information contained in a particular wire report. Such a rule would effectively eliminate the inquiry into whether there was \"substantial reason\" to question the accuracy of a given report.\n\nSecond, testimony of this nature, in this context, raises issues of credibility which should be resolved by a fact finder at trial. Although not a classic credibility issue (e.g., conflicting statements by the same witness), this testimony requires a fact finder to resolve an ambiguity, or tension, in the testimony which will hinge largely upon the witness' credibility; more specifically, whether Peyser's and Smith's general practice of relying upon AP wire reports is sufficient to overcome their testimony that they do not recall which specific AP reports they relied upon. Viewing this testimony in the light most favorable to Jewell, I cannot say, as a matter of law, that a fact finder would necessarily conclude that the testimony concerning their general practices is sufficient.\n\nFinally, the NYP argues that a review of the wire reports after the articles were published, and presumably after this lawsuit was filed, indicates that the reports contain statements found in the articles and column:\n\nPeyser was also able to find support for many statements in the July 31 Column from the wire service reports annexed as Exhibits \"C\" and \"D\" to her affidavit, indicating that she relied on those reports, or similar versions thereof, in preparing the July 31 Column.\n\nNYP Reply Mem at 5. A similar argument is urged with respect to Smith's articles. See id. at 5-6. The tense of these statements is critical. Although an after-the-fact review does indeed demonstrate that some of the statements found in the stories at issue also appear in the wire service reports, this fact does not compel a different result. Admittedly, this tends to support the NYP's argument, but I cannot say, on a motion for summary judgment and as a matter of law, that it does so definitively. Moreover, to hold otherwise would only encourage a post-lawsuit scurry to locate wire reports that contain statements similar to those published. The republication defense was intended to encourage reasonable reliance on published material at the time of republication, not such after-the-fact scurrying.\n\nIn sum, because Peyser and Smith cannot recall which specific AP reports they relied upon in drafting the column and articles, material issues of fact preclude granting summary judgment. Although both reporters testified that they generally relied upon AP reports, such testimony is not sufficient to grant summary judgment where the controlling test requires that nothing in the specific reports raises \"substantial reasons\" to question their accuracy. Simply stated, in the absence of clear testimony concerning which reports were relied upon, that standard cannot be satisfied on a motion for summary judgment.\n\nB. The CNN Broadcasts\n\nBoth Peyser and Smith also stated that they relied upon reports from CNN concerning Jewell in the course of preparing their articles. See Peyser Aff. PP 7, 10 \u0026 15-16; Smith Aff. PP 6 \u0026 12. Peyser previously worked for CNN and states, in part based upon that experience, that reporters rely upon CNN much like they rely on wire services such as the AP. See Peyser Aff. P 7. Although this issue raises many interesting questions about CNN and its role in modern news gathering practices, I do not address these concerns. Rather, for reasons functionally similar to the problems with the NYP's reliance on the AP wire reports, I hold that the NYP has not sustained its burden on this aspect of its motion for summary judgment.\n\nAlthough Jewell does not appear to challenge the fact that Peyser and Smith relied upon CNN, the record before me does not contain any specific information concerning what was said in the CNN broadcasts relied upon by Peyser and Smith, nor does the record contain any transcripts or other sources for the precise text of the telecasts. Peyser's affidavit refers to CNN's reporting of the AJC article and contains this general statement:\n\nI watched CNN for about fifteen minutes. During that time, CNN continued to report on the AJC article, describing Jewell's background, his former law enforcement jobs as a deputy sheriff and as a campus security guard at Piedmont College . . . , and his appearances on several news programs prior to his identification as a suspect. When I viewed CNN reporting on the AJC article, I treated the statements about Jewell as if they had come over the wire service. I had no reason to believe that CNN would report any false statements.\n\nPeyser Aff. P 10. Smith's affidavit contains similar statements. See Smith Aff. P 4, 6 \u0026 12.\n\nStatements to this effect raise material questions of fact similar to those raised with the AP wire reports. There, Peyser could not recall with certainty which wire reports she relied upon. Here, while Peyser can recall which CNN broadcast she listened to, the transcript, or any other source for the text of what was broadcast, is not in the record. Smith's affidavit suffers from this same problem and the additional obstacle that his reliance upon CNN is stated in even more general and ambiguous terms. See id. P 6 (referring to Smith's review of \"news programs such as CNN\"). Thus, I cannot determine, as a matter of law, that the NYP was entitled to rely upon the CNN broadcasts. Again, in the absence of the actual reports relied upon it is impossible to determine, as a matter of law, that the NYP neither had nor should have had substantial reason to question the accuracy of the broadcasts.\n\nC. The AJC Articles\n\nFinally, statements in Peyser's affidavit suggest, although not conclusively so, that she relied upon the AJC articles in preparing the July 31 column. See Peyser Aff. P 11-12 (discussing the AJC articles); P 13 (discussing Peyser's reliance upon the AP wire reports and how those reports \"discussed the AJC articles\"); P 14 (\"After watching CNN, reading the AJC articles and reviewing the AP wire service reports, I spoke to other sources. Then, I wrote the July 31 Column.\"); P 15 (listing, in a chart, the first AJC article as one source for one statement in the July 31 Column and stating that \"much of the information contained in my July 31 Column was reported on CNN and in the AJC articles and AP wire service reports before my July 31 Column was published\"); P 16 (\"Solely for purposes of this motion, I am not identifying or relying upon any information at this time that I obtained from sources other than CNN, the AJC articles and the AP news wire reports.\").\n\nOn the question of whether Peyser relied upon the AJC articles in writing the July 31 Column, these statements are ambiguous at best. For example, in paragraph 15, Peyser states only that some of the information in the July 31 Column was first published by the AJC. Although the chart in that paragraph refers to the AJC as one of the sources for a statement, it also lists various AP wire reports as sources. And, paragraph 13 suggests that the discussion in the affidavit of the AJC articles is relevant only insofar as it sets the stage for the AP wire reports which \"discussed the AJC articles.\" As for Smith, his statement concerning the AJC reveals nothing either way on this point. See Smith Aff. P 7 (indicating that the July 31 Article reports on the First July 30 AJC Article). In short, it appears that the NYP is not arguing that the republication defense applies to information obtained from the AJC.\n\nPerhaps the clearest indication of this position is found not in a statement from Peyser or Smith, but in an objection from the NYP's counsel during Smith's deposition. During the deposition, counsel for Jewell sought to inquire of Smith whether the AJC has a reputation for accuracy similar to the AP's reputation. Counsel for the NYP objected and stated as follows:\n\nLet me say . . . the reason I am voicing this objection is because the motion at this point is based on wire service defense basing our statements in the articles which are Post statements on Associated Press and CNN material, not at this time directly on the Atlanta Journal Constitution.\n\nAnd, therefore, questions as to the reliability and whether this particular witness read and relied on the Atlanta Journal Constitution in writing portions of the articles that he was involved in is not relevant or germane to this deposition.\n\nSmith Dep. at 14-15; Goidell Dec. Ex. B. Based upon this objection, counsel for Jewell did not pursue this line of questioning. Because both Peyser and Smith have not clearly stated that they relied upon the AJC articles, and because counsel for the NYP indicated that this motion is not based upon these articles, I do not address whether the NYP may avail itself of the republication defense with respect to the AJC articles.\n\nVI. The Opinion-Fact Dichotomy\n\nThe NYP claims that many of the statements contained in the July 31 Column and the various articles are non-actionable expressions of opinion. Not surprisingly, Jewell takes the opposite view and argues that these statements are statements of fact that can form the basis of a libel claim. Resolution of this issue is a threshold matter for the court to resolve. See, e.g., Gross v. New York Times Co., 82 N.Y.2d 146, 153, 603 N.Y.S.2d 813, 817, 623 N.E.2d 1163, 1167 (1993); Steinhilber v. Alphonse, 68 N.Y.2d 283, 290, 508 N.Y.S.2d 901, 904, 501 N.E.2d 550, 553 (1986). For the reasons that follow, the NYP's motion in this regard is granted in part and denied in part.\n\nUnder New York law, the rule that statements of opinion are not actionable in libel traces its origin to the mid-1800s and the common law qualified privilege of \"fair comment.\" See Immuno AG v. J. Moor-Jankowski, 77 N.Y.2d 235, 265, 566 N.Y.S.2d 906, 924, 567 N.E.2d 1270, 1288 (1991) (Titone, J., concurring), cert. denied, 500 U.S. 954, 114 L. Ed. 2d 713, 111 S. Ct. 2261 (1991); see also Milkovich v. Lorain Journal Co., 497 U.S. 1, 13-14, 111 L. Ed. 2d 1, 110 S. Ct. 2695 (1990) (discussing the \"fair comment\" doctrine). Today, some courts continue to articulate the reason for this defense in seemingly common law terms: \"Since falsity is a sine qua non of a libel claim and since only assertions of fact are capable of being proven false, we have consistently held that a libel action cannot be maintained unless it is premised on published assertions of fact.\" Brian v. Richardson, 87 N.Y.2d 46, 51, 637 N.Y.S.2d 347, 350, 660 N.E.2d 1126, 1129 (1995); see also Gross, 82 N.Y.2d at 152-53, 603 N.Y.S.2d at 817, 623 N.E.2d at 1167; Pisello v. Town of Brookhaven, 933 F. Supp. 202, 217 (E.D.N.Y. 1996). At the same time, New York Times Co. v. Sullivan, 376 U.S. 254, 11 L. Ed. 2d 686, 84 S. Ct. 710 (1964) changed the landscape of libel law by introducing a \"constitutional dimension.\" Immuno, 77 N.Y.2d at 265, 566 N.Y.S.2d at 924, 567 N.E.2d at 1288 (Titone, J. concurring). Since Sullivan, the opinion-fact inquiry has frequently been expressed in constitutional terms. See, e.g., Levin, 119 F.3d at 196-97; Gross, 82 N.Y.2d at 152-53, 603 N.Y.S.2d at 817-18, 623 N.E.2d at 1167-68 (expressing the same and noting that the \"seasoned common-law categories for actionable and nonactionable reportage have been invoked to inform our modern constitutional analysis\"); Coliniatis v. Dimas, 848 F. Supp. 462, 467-69 (S.D.N.Y. 1994).\n\nThe injection of a constitutional aspect into this area of law raises a threshold issue that must be resolved; namely, whether this defense requires analysis under the New York State Constitution, the United States Constitution or both. Courts have adopted conflicting approaches. See Levin, 917 F. Supp. at 239-40 (applying only the New York standard), aff'd, 119 F.3d at 196-97 (same); 600 West 115th Street Corp. v. Von Gutfeld, 80 N.Y.2d 130, 145, 589 N.Y.S.2d 825, 833, 603 N.E.2d 930, 938 (1992) (applying the \"narrower\" federal standard and then holding that a finding that speech is protected under the federal standard \"dictate[s]\" a finding that the statements are protected under the State Constitution), cert. denied, 508 U.S. 910, 124 L. Ed. 2d 252, 113 S. Ct. 2341 (1993); Immuno, 77 N.Y.2d at 248, 566 N.Y.S.2d at 913, 567 N.E.2d at 1277 (applying both a federal and state law inquiry); Coliniatis, 848 F. Supp. at 467-69 (same).\n\nThe reason this issue is a threshold one is that the New York Court of Appeals has repeatedly held that the New York Constitution provides greater protection than the United States Constitution and, accordingly, that the inquiry under the two constitutional regimes is different. See, e.g., Von Gutfeld, 80 N.Y.2d at 136 \u0026 138, 589 N.Y.S.2d at 827 \u0026 829, 603 N.E.2d at 932 \u0026 934; Immuno, 77 N.Y.2d at 248-49, 566 N.Y.S.2d at 913-14, 567 N.E.2d at 1277-78. Nonetheless, some cases indicate that the \"thrust of the dispositive inquiry\" is similar. See, e.g., Levin, 119 F.3d at 196 (\"We note that the thrust of the dispositive inquiry under both New York and constitutional law is 'whether a reasonable [reader] could have concluded that [the publications were] conveying facts about the plaintiff.'\" (quoting Gross, 82 N.Y.2d at 153, 603 N.Y.S.2d at 817, 623 N.E.2d at 1167)); Von Gutfeld, 80 N.Y.2d at 139, 589 N.Y.S.2d at 829, 603 N.E.2d at 934 (\"Under either Federal or State law, the dispositive question is whether a reasonable listener . . . could have concluded that [defendant] was conveying facts about the plaintiff.\"). I prefer not to offer any additional ruminations on this interesting and abstract question. Rather, and for the following reasons, I analyze this problem solely under New York Constitutional law.\n\nIt is a basic proposition of constitutional law that while the federal constitution provides a minimum level of protection below which the states may not descend, states remain free to provide greater protection. See, e.g., Immuno, 77 N.Y.2d at 248, 566 N.Y.S.2d at 913, 567 N.E.2d at 1277; People v. Cloud Books, Inc., 68 N.Y.2d 553, 557, 510 N.Y.S.2d 844, 846, 503 N.E.2d 492, 494 (1986). Again, the New York Court of Appeals has chosen the path of greater protection. See supra. A finding, therefore, that the New York State Constitution protects certain speech from claims of libel moots the need to analyze the question under the United States Constitution -- the speech is protected and is not actionable regardless of the outcome under federal law. Similarly, if a statement is not protected under the New York State Constitution, it is not protected under the United States Constitution. See Ty v. Celle, 1997 U.S. Dist. LEXIS 4456, *10, No. 95 Civ. 2631 (MBM), 1997 WL 167041, at * 3 n.2 (S.D.N.Y. April 9, 1997) (\"Even if defendants intend to assert federal constitutional protection, state constitutional protection of opinions is more extensive than federal constitutional protection, and therefore, if these statements are not protected under state constitutional law, the federal constitution would offer no protection.\") (citation omitted). Thus, an analysis under the New York State Constitution disposes of the need to analyze a statement under the United States Constitution.\n\nThe same cannot be said of the opposite. While a finding that a statement is protected under the United States Constitution also results in protection under the New York State Constitution, it is possible that a statement not protected under the United States Constitution is nonetheless protected under the New York State Constitution because the State Constitution provides greater protection. Accordingly, I will analyze the statements at issue solely under New York Constitutional law. See Levin, 917 F. Supp. at 240 (applying only New York law and indicating that \"whatever the ultimate import of Milkovich, New York's Court of Appeals has held that opinion receives greater protection under the New York than under the United States Constitution.\").\n\nWhile I am guided in this inquiry by a line of decisions from the New York Court of Appeals that has thoroughly explored this area, these are turbid waters. See Levin, 119 F.3d at 196 (\"No area of modern libel law can be murkier than the cavernous depths of this inquiry.\") (internal quotation marks and citation omitted); Brian, 87 N.Y.2d at 51, 637 N.Y.S.2d at 350, 660 N.E.2d at 1129 (\"Distinguishing between assertions of fact and nonactionable expressions of opinion has often proved a difficult task.\"). The analysis is a subtle one and entails an etymological exploration into questions of connotation, denotation and contextual meaning. See Towne v. Eisner, 245 U.S. 418, 425, 62 L. Ed. 372, 38 S. Ct. 158 (1918) (Holmes, J.) (\"A word is not a crystal, transparent and unchanged, it is the skin of a living thought and may vary greatly in color and content according to the circumstances and the time in which it is used.\"); Steinhilber, 68 N.Y.2d at 291, 508 N.Y.S.2d at 905, 501 N.E.2d at 554 (\"The infinite variety of meanings conveyed by words -- depending on the words themselves and their purpose, the circumstances surrounding their use, and the manner, tone and style with which they are used -- rules out . . . a formulistic approach.\").\n\nThe inquiry involves two stages. First, I must determine whether the statements at issue are statements of opinion. Assuming that they are, I must then determine whether those statements are based upon disclosed or undisclosed facts.\n\nThe New York Court of Appeals considers the following factors, originally articulated in Ollman v. Evans, 242 U.S. App. D.C. 301, 750 F.2d 970, 983 (D.C. Cir. 1984), cert. denied, 471 U.S. 1127, 86 L. Ed. 2d 278, 105 S. Ct. 2662 (1985), in resolving whether a statement is one of opinion:\n\n(1) whether the specific language in issue has a precise meaning which is readily understood; (2) whether the statements are capable of being proven true or false; and (3) whether either the full context of the communication in which the statement appears or the broader social context and surrounding circumstances are such as to signal . . . readers or listeners that what is being read or heard is likely to be opinion, not fact.\n\nBrian, 87 N.Y.2d at 51, 637 N.Y.S.2d at 350, 660 N.E.2d at 1129; see also Gross, 82 N.Y.2d at 153, 603 N.Y.S.2d at 817, 623 N.E.2d at 1167; Steinhilber, 68 N.Y.2d at 292, 508 N.Y.S.2d at 905, 501 N.E.2d at 554 (articulating the same standard as four factors). Application of these three factors is not rigid and mechanical, and no single factor is dispositive. See Gross, 82 N.Y.2d at 156, 603 N.Y.S.2d at 819-20, 623 N.E.2d at 1169-70 (\"In closing, we stress once again our commitment to avoiding the hypertechnical parsing of written and spoken words for the purpose of identifying possible facts that might form the basis of a sustainable libel action.\") (internal quotation marks and citation omitted); Steinhilber, 68 N.Y.2d at 291, 508 N.Y.S.2d at 905, 501 N.E.2d at 554 (\"We eschew any attempt here to reduce the problem of distinguishing fact from opinion to a rigid set of criteria which can be universally applied.\"). Nonetheless, the critical aspect of the inquiry, as articulated in the third factor set forth above, is to view the statements in context: \"The essential task is to decide whether the words complained of, considered in the context of the entire communication and of the circumstances in which they are spoken or written, may be reasonably understood as implying the assertion of undisclosed facts justifying the opinion.\" Steinhilber, 68 N.Y.2d at 290, 508 N.Y.S.2d at 904, 501 N.E.2d at 553; see also Brian, 87 N.Y.2d at 51, 637 N.Y.S.2d at 350, 660 N.E.2d at 1129 (\"It is the last of these factors that lends both depth and difficulty to the analysis.\"); Immuno, 77 N.Y.2d at 250, 566 N.Y.S.2d at 914, 567 N.E.2d at 1278 (\"It has long been our standard in defamation actions to read published articles in context to test their effect on the average reader, not to isolate particular phrases but to consider the publication as a whole.\"); Steinhilber, 68 N.Y.2d at 293, 508 N.Y.S.2d at 906, 501 N.E.2d at 555 (\"We first examine the content of the whole communication as well as its tone and its apparent purpose.\"). As the third factor makes clear, this contextual analysis proceeds on two levels, the \"broader social setting\" of the statements, as well as their \"immediate context.\" Immuno, 77 N.Y.2d at 253, 566 N.Y.S.2d at 916, 567 N.E.2d at 1280; see also Brian, 87 N.Y.2d at 51, 637 N.Y.S.2d at 351, 660 N.E.2d at 1130.\n\nAssuming that a statement is one of opinion, a second level of inquiry is required concerning the stated factual basis, if any, for the opinion:\n\nAn expression of pure opinion is not actionable. . . . A \"pure opinion\" is a statement of opinion which is accompanied by a recitation of the facts upon which it is based. An opinion not accompanied by such a factual recitation may, nevertheless, be \"pure opinion\" if it does not imply that is based upon undisclosed facts. When, however, the statement of opinion implies that it is based upon facts which justify the opinion but are unknown to those reading or hearing it, it is a \"mixed opinion\" and is actionable. The actionable element of a \"mixed opinion\" is not the false opinion itself -- it is the implication that the speaker knows certain facts, unknown to his audience, which support his opinion and are detrimental to the person about whom he is speaking.\n\nSteinhilber, 68 N.Y.2d at 289-90, 508 N.Y.S.2d at 903-04, 501 N.E.2d at 552-53 (citations omitted); see also Levin, 119 F.3d at 197; Gross, 82 N.Y.2d at 153-54, 603 N.Y.S.2d at 818, 623 N.E.2d at 1168. A further refinement to this inquiry was formulated by the New York Court of Appeals in Silsdorf v. Levine, 59 N.Y.2d 8, 462 N.Y.S.2d 822, 449 N.E.2d 716 (1983), cert. denied, 464 U.S. 831, 78 L. Ed. 2d 111, 104 S. Ct. 109 (1983). There, the court considered the situation where a plaintiff alleges, with respect to a statement of opinion based upon disclosed facts, that the disclosed facts are themselves false. See id., 59 N.Y.2d at 13-14, 462 N.Y.S.2d at 825-26, 449 N.E.2d at 719-20. The court distinguished between two different outcomes dependent upon the precise nature of the plaintiff's allegations. First, where the plaintiff only asserts that the opinions are false, and does not challenge the veracity of the underlying facts, the plaintiff may not sustain a libel action. See id., 59 N.Y.2d at 14, 462 N.Y.S.2d at 825-26, 449 N.E.2d at 719-20. In contrast, where the plaintiff alleges that both the opinions and the facts are false, a motion to dismiss should not be granted, and the plaintiff may proceed against both the statements of fact and opinion. See id., 59 N.Y.2d at 10 \u0026 14-15, 462 N.Y.S.2d at 823 \u0026 825-26, 449 N.E.2d at 717 \u0026 719-20; see also H\u0026R Indus., Inc. v. Kirshner, 899 F. Supp. 995, 1010-11 (E.D.N.Y. 1995) (denying defendant's motion for summary judgment, in reliance upon Silsdorf, where there were material issues of fact concerning the falsity of the disclosed statements of fact upon which the opinions were based); cf. Coliniatis, 848 F. Supp. at 469-70 (discussing Silsdorf where plaintiff was not asserting that defendant's opinions were false and where the statements at issue were held to be statements of fact which could not be dismissed on a motion to dismiss). The court reasoned as follows:\n\nClearly, the validity of the opinions expressed . . ., as viewed by the average reader, could be affected by whether the facts as stated by defendants or those now alleged by the plaintiff were before the reader. That being the case, plaintiff may be able to establish entitlement to recover damages for the defamatory opinions, assuming, of course, that he is able to demonstrate the falsity of the . . . statements of fact and convince the triers of fact that the factual disparities would affect the conclusions drawn by the average reader regarding the validity of the opinions expressed.\n\nSilsdorf, 59 N.Y.2d at 15-16, 462 N.Y.S.2d at 826, 449 N.E.2d at 720. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nBefore turning to the application of these principles to the facts of this case, one final threshold legal issue must be addressed. Jewell argues, in reliance upon Rinaldi, that statements concerning criminal activity, even if couched in terms of an opinion, are not entitled to constitutional protection. See Jewell Mem. at 23. In Rinaldi, the court held:\n\nAccusations of criminal activity, even in the form of opinion, are not constitutionally protected. While inquiry into motivation is within the scope of absolute privilege, outright charges of illegal conduct, if false, are protected solely by the actual malice test. . . . No First Amendment protection enfolds false charges of criminal behavior.\n\n42 N.Y.2d at 382, 397 N.Y.S.2d at 951, 366 N.E.2d at 1307 (citations omitted). Subsequently, the New York Court of Appeals appeared to reaffirm this holding. See Silsdorf, 59 N.Y.2d at 16, 462 N.Y.S.2d at 826, 449 N.E.2d at 720 (citing Rinaldi for the proposition that \"although expressions of opinion are constitutionally protected, accusations of criminal or illegal activity, even in the form of opinion, are not\"). In Gross, the court, without citation to Rinaldi but with citation to Silsdorf, retreated from and appeared to abandon this per se rule. The court held:\n\nNonetheless, we hold [the statements] to be actionable not, as plaintiff would have it, because they involve accusations of criminality per se, but rather because in this context they convey \"facts\" that are capable of being proven true or false. Although plaintiff repeatedly suggests otherwise, there is simply no special rule of law making criminal slurs actionable regardless of whether they are asserted as opinion or fact.\n\n82 N.Y.2d at 154-55, 603 N.Y.S.2d at 819, 623 N.E.2d at 1169. The Gross court interpreted Silsdorf as consistent with this rule and indicated that in Silsdorf \"we merely held that an accusation of criminality that, read in context, is set forth as a fact is not transformed into a nonactionable expression of opinion merely because it is couched in the form of an opinion.\" Id. (internal quotation marks omitted). Accordingly, any statements made by the NYP concerning Jewell's alleged criminal conduct must be analyzed, consistent with the body of law discussed above, to determine whether they constitute statements of opinion or fact. Significantly, other courts have reached the same conclusion and have recognized that Gross overrules the per se rule articulated in Rinaldi. See Coliniatis, 848 F. Supp. at 469 n.5; Vengroff v. Coyle, 231 A.D.2d 624, 625, 647 N.Y.S.2d 530, 531 (2d Dep't 1996).\n\nA. The Broader Context in Which the Statements Were Published\n\nI start the analysis with the broader social context in which the column, articles, photographs and cartoon were published. The bombing of Centennial Olympic Park was a tragic and shocking event. It does not strain the concept of judicial notice to observe that world attention was focused on Atlanta as this nation played host to the one-hundredth anniversary of the olympic games. Nor does it strain this concept to note that everyone hoped that the individual(s) responsible for the crime would be quickly brought to justice. Cf. Cerasani v. Sony Corp., 991 F. Supp. 343, 354 n.3 (S.D.N.Y. 1998) (taking judicial notice of widespread newspaper coverage and collecting cases on the propriety of taking such notice in cases involving \"substantial media coverage\" and \"widespread publicity via newspaper and television news\"). On July 30, some seventy-two hours after the bombing, the AJC published the first article identifying Jewell as \"the focus of the federal investigation.\" Publication by the NYP followed soon thereafter. From July 31 through August 2, a three-day period of time, the statements at issue were published.\n\nGiven this quick succession of events and publications, a reasonable reader would have understood the information concerning Jewell's involvement in the bombing to have been preliminary in nature. In contrast to a series of articles published after exhaustive research and investigation, the statements at issue were published at the very earliest stages of an investigation. The preliminary nature of reported information is a contextual factor which supports, but by no means dispositively so, a finding that the statements are ones of opinion. Cf. Gross, 82 N.Y.2d at 156, 603 N.Y.S.2d at 819, 623 N.E.2d at 1169 (\"Having been offered as a special feature series rather than as coverage of a current news story, the disputed articles were calculated to give the impression they were 'the product of some deliberation, not of the heat of [the] moment.'\" (quoting Von Gutfeld, 80 N.Y.2d at 142, 589 N.Y.S.2d at 831, 603 N.E.2d at 936)).\n\nThe preliminary nature of the statements is also conveyed in their more immediate contextual character. For example, the front page of the July 31 edition of the NYP contains a photograph of Jewell with the headline: \"SAINT OR SAVAGE?\" The use of a rhetorical question suggests that the NYP had not definitively resolved whether Jewell was responsible for the bombing. This statement, prominently displayed on the front page, tends to set the tone for the information conveyed within. In fact, other statements sprinkled throughout the articles and column at issue suggest a similarly preliminary tone. See, e.g., July 31 Column; Peyser Aff. Ex. E (\"'My feelings are that it's probably not him,' [Cleere] said.\"); July 31 Article; Smith Aff. Ex. A (\"Later, [Jewell's] lawyer, Watson Bryant, insisted Jewell was 'not a suspect, a subject or target' -- but 'a hero.'\"); August 1 Article; Smith Aff. Ex. D (\"Bryant said his client was cooperating with investigators because he had nothing to hide.\"); August 2 Article, Smith Aff. Ex. F (\"The fact Jewell's name has surfaced, [FBI Director Louis Freeh] said in Washington, 'certainly doesn't mean that people should speculate as to guilt.'\").\n\nWhile this preliminary tone is apparent with respect to the statements concerning Jewell's role in the bombing, this tone is generally and noticeably not present with respect to the statements concerning Jewell's prior work history. When reporting on these matters, the NYP did so in more definitive and certain terms. This is significant because while I have described these two categories in discreet terms for conceptual purposes, they are integrally linked. As a review of the column and articles reveals, the conclusion that Jewell was involved in the bombing was based, at least in part, upon his employment history and the fact that this history purportedly fit the profile of a bomber. Thus, while statements concerning Jewell's role in the bombing were frequently expressed along with statements suggesting that readers should not rush to judgment, the statements reflecting the factual basis upon which authorities were concluding that Jewell was involved in the bombing were expressed in a more certain and definitive manner.\n\nMoreover, the simple fact of the matter is that these statements were published in a newspaper. People reading statements published in a newspaper tend to view such statements as statements of fact, not of opinion, particularly when the statements do not appear on an editorial or op-ed page: \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\"\n\nA newspaper column is the product of some deliberation, not of the heat of a moment. Prior to publication, it passes through the hands of professional editors and it thus carries with it the cloak of credibility and authority of the particular newspaper and the profession. Its writers work with the knowledge that the printed word can and will be subjected to close, careful, and repeated reading over time. These undoubtedly are circumstances encouraging the reasonable reader to be less skeptical and more willing to conclude that the report is stating or implying facts garnered by a professional news gatherer and reporter.\n\nVon Gutfeld, 80 N.Y.2d at 142, 589 N.Y.S.2d at 831, 603 N.E.2d at 936; \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" see also Brian, 87 N.Y.2d at 52, 637 N.Y.S.2d at 351, 660 N.E.2d at 1130 (\"Further, we noted [in Gross ] that the articles appeared in the news section of the newspaper where, unlike the editorial section, the reader expects to find factual accounts.\"); Gross, 82 N.Y.2d at 156, 603 N.Y.S.2d at 819, 623 N.E.2d at 1169 (\"Moreover, since the articles were published in the news section rather than the editorial or 'op ed' sections, the common expectations that apply to those more opinionated journalistic endeavors were inapplicable here.\"). But cf. Brian, 87 N.Y.2d at 52, 637 N.Y.S.2d at 351, 660 N.E.2d at 1130 (\"We emphasize that an article's appearance in the sections of a newspaper that are usually dedicated to opinion does not automatically insulate the author from liability for defamation.\").\n\nThus, some aspects of the broader context in which these statements were published -- the preliminary nature of the information and the counter-balancing statements that Jewell was not responsible for the bombing -- conveyed to a reader the impression that the published statements were ones of opinion. On the other hand, it is most significant that the defendant published these statements in the non-editorial section of a newspaper where readers expect to find facts. Also of importance is the more deliberate and certain manner and tone in which information concerning the underlying basis for the authorities' interest in Jewell was reported. As a result, the greater weight of this broader context points towards viewing the allegedly libelous statements as those of fact. With this general observation as to the broader context in mind, I turn to the specific statements at issue and their more immediate context.\n\nB. The July 31 Column\n\nThe NYP claims that the following statements, or underscored portions thereof (which are set forth below in the passages from which they appear so that the full context of the statement can be measured), from the July 31 Column are non-actionable statements of opinion:\n\nWho checked 'Rambo ' crossing guard's record?\n\nRichard Jewell, the Olympic security guard who's reportedly turned into a prime suspect for Saturday's deadly bombing, had a reputation for being the Village Rambo in Habersham County -- a rural area in the North Georgia mountains that actually sees snow in winter.\n\nHe was a fat, failed former sheriff's deputy who spent most of his working days as a school crossing guard, and yearned to go further. But he lost his job on the county force, after six years, when he wrecked a squad car.\n\nJewell got another chance in April 1995, when he was hired as a security guard for tiny Piedmont College in Demorest, a town with just a few hundred residents. It was, to put it mildly, a disaster.\n\n\"He was a straight arrow who overdid everything,\" college president Ray Cleere told me yesterday.\n\nIt was Cleere who telephoned the FBI on Sunday, after watching endless TV broadcasts featuring his former employee. Something about Jewell, taking credit for saving lives in Centennial Park, didn't sit right with the college president.\n\nIt wasn't that Jewell was brutal. But on a campus of 1,000 students, where the worst imaginable problems might involve open beer containers and loud music, Jewell seemed desperate to stand out as a hero.\n\n\"But these aren't the streets of New York. We have a small, country town with a small liberal-arts college. He over-investigated everything.\"\n\nAs an example, Cleere said disputes that could be resolved with a little adult mediation often turned into federal cases.\n\nThat the main suspect in a major act of terrorism is a home- grown failure is both a relief -- and a major embarrassment -- to this city's real law-enforcement people.\n\nThe scary part is, as the minutes ticked by, it was Jewell, this disgraced former deputy and fired campus security guard, who was in charge.\n\nMetcalf Aff., Ex. B.\n\nNotwithstanding my prior conclusion concerning the broader context, I agree with the NYP that these statements constitute statements of opinion. They utilize hyperbolic language, lack a precise meaning and are incapable of being proven true or false. Words such as \"Rambo,\" \"failure,\" \"home-grown failure,\" \"disgraced,\" or \"disaster\" are indicative of terms which the average reader would understand to be statements of opinion. See, e.g., Buckley v. Littell, 539 F.2d 882, 893-94 (2d Cir. 1976) (language such as \"fascist,\" \"fellow traveller of fascism\" and \"radical right\" held to be \"tremendously imprecise[]\" and \"so debatable, loose and varying, that they are insusceptible to proof of truth or falsity\"), cert. denied, 429 U.S. 1062, 50 L. Ed. 2d 777, 97 S. Ct. 785, 97 S. Ct. 786 (1977); Corporate Training Unlimited, Inc. v. National Broadcasting Co., 981 F. Supp. 112, 123 (E.D.N.Y. 1997) (holding that the title to a television broadcast, \"Rambo Goes to Reykjavik\", was \"the type of hyperbolic speech which cannot be read to assert provable facts and is beyond the scope of defamation law\"); O'Loughlin v. Patrolmen's Benev. Assoc., 178 A.D.2d 117, 118, 576 N.Y.S.2d 858, 859 (1st Dep't 1991) (statement characterizing plaintiff as a \"disgrace to the entire police service\" was a statement of opinion). In addition, the alliterative quality of the phrase \"fat, failed former\" has a rhetorical effect indicative of a statement of opinion. See, e.g., Weiner v. Doubleday \u0026 Co., Inc., 142 A.D.2d 100, 105, 535 N.Y.S.2d 597, 600 (1st Dep't 1988) (reference to psychologist as a \"big, fat ugly Jew\" was \"mere epithet\" and not actionable in libel), aff'd, 74 N.Y.2d 586, 550 N.Y.S.2d 251, 549 N.E.2d 453 (1989), cert. denied, 495 U.S. 930, 109 L. Ed. 2d 498, 110 S. Ct. 2168 (1990); cf. Hoppe v. Hearst Corp., 53 Wash. App. 668, 770 P.2d 203, 206 (Wash. Ct. App. 1989) (applying Washington law and concluding that statement was one of opinion in part because of defendant's frequent use of \"alliterative nicknames\" to describe both the plaintiff (\"Hurley Herpes\") and others). Similarly, the statements that Jewell \"over- investigated everything\" and was a \"straight arrow who overdid everything\" are hopelessly imprecise and incapable of being proven true or false, and therefore suggest to the average reader that they are statements of opinion. It is simply not possible to determine, with any degree of precision, what it means to \"overdo\" something. Moreover, the repetitive use of virtually the same imprecise terminology (which is also true of the phrases \"failure\" and \"home-grown failure\") conveys a sense that the author is attempting to convince the reader, throughout the column, of a particular viewpoint or opinion.\n\nFor these same reasons, the statements that Jewell turned minor incidents \"into federal cases\" and that he was \"desperate to stand out as a hero\" are statements of opinion. Although it may be difficult for anyone to accept that a federal judge cannot adduce with certainty what it means to turn something \"into a federal case,\" such a statement does not convey a single meaning that can be proven true or false -- it is another means of conveying the author's opinion that Jewell \"overdid\" everything. Nor is it possible to determine, with any degree of certainty, what it means to be \"desperate to stand out as a hero.\" Finally, the statement that \"something about Jewell, taking credit for saving lives in Centennial Park, didn't sit right\" with Cleere is also a statement of opinion. In context, Peyser was explaining why Cleere called the FBI, and this reason was driven by what can only be understood to have been Cleere's gut reaction (it \"didn't sit right\") to Jewell's actions. A statement concerning someone's gut reaction is not a statement of precise and undisputed fact; rather, it is an imprecise, visceral reaction to an event. In short, a statement of opinion.\n\nI reach this conclusion even though these statements appeared in a newspaper. Consistent with the New York Court of Appeals' command to avoid per se and inflexible rules, there is simply no rule which requires a court to find that any statement published in a newspaper, even if published in a portion of the newspaper other than on the editorial or op-ed page, is a statement of fact. See Agens v. Little, 667 N.Y.S.2d 775, 776 (App. Div. 3d Dep't 1998) (holding that although statements concerning plaintiff were \"recounted in the context of a news story\" they were nonetheless non-actionable statements of opinions). Some language, regardless of context, is so vague and hyperbolic that it can only reasonably be viewed as language of opinion. See Steinhilber, 68 N.Y.2d at 293 n.5, 508 N.Y.S.2d at 906 n.5, 501 N.E.2d at 555 n.5 (\"Moreover, the bald statement that someone is a 'failure,' standing alone and removed from any context, would, we believe -- even more than an assertion that a person lacks 'talent, ambition, and initiative' -- be understood as opinion.\") (emphasis added). This is particularly so with respect to the July 31 Column. Viewing its overall tone -- more particularly, its repetitive use of exaggerated terminology, its rhetorical qualities and the overriding sense that Peyser was attempting to convince the reader of a particular viewpoint -- these statements could reasonably be viewed by an average reader as ones of opinion. See Brian, 87 N.Y.2d at 53, 637 N.Y.S.2d at 352, 660 N.E.2d at 1131 (\"Further, the predominant tone of the article, which was rife with rumor, speculation and seemingly tenuous inferences, furnished clues to the reasonable reader that [the article at issue] was something less than serious, objective reportage.\"); Parks v. Steinbrenner, 131 A.D.2d 60, 63-65, 520 N.Y.S.2d 374, 376-77 (1st Dep't 1987) (emphasizing the importance of context in a unique and colorful situation in which the owner of the New York Yankees criticized an umpire, and specifically addressing \"the manner, tone and style\" in which the words were used).\n\nThis does not end the inquiry as these statements of opinion are based upon disclosed facts. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" Notably, most of these statements concern Jewell's prior work performance. The July 31 Column sets forth two purported facts in support of these various opinions:\n\n[Jewell] lost his job on the county force, after six years, when he wrecked a squad car.\n\n. . .\n\nThe final straw came after Jewell got up in the middle of the night and set up a road block around the campus, hunting for people driving under the influence, said a source speaking on condition of anonymity.\n\n\"He was let go after that,\" said the source.\n\nJuly 31 Column; Peyser Aff. Ex. E.\n\nThe Complaint specifically alleges that these statements of disclosed fact are false. See Complaint P 42. In addition, Jewell alleges that his attorneys have taken a 261-page statement, under oath, from Cleere in which Cleere denies making the statements attributed to him in the July 31 Column (\"Cleere Quotes\"). \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" Cleere also allegedly states that the information about Jewell in the Cleere Quotes is false. See id. PP 43-44. Because this is a motion to dismiss for failure to state a claim, I must assume the truth of Jewell's allegations, i.e., that these statements of fact are false. Under the rule articulated in Silsdorf, where statements of opinion are based upon disclosed facts which the plaintiff alleges are false, a motion to dismiss should not be granted. See Chalpin v. Amordian Press, Inc., 128 A.D.2d 81, 84-86, 515 N.Y.S.2d 434, 436-37 (1st Dep't 1987) (statement of opinion that plaintiff was \"an unbelievably unscrupulous character\" held actionable under Silsdorf, on a motion for summary judgment, where underlying factual basis for the opinion was alleged to have been false and where there was evidentiary support for the allegation); see also Parks, 131 A.D.2d at 62-63, 520 N.Y.S.2d at 376 (\"Similarly actionable as a 'mixed opinion' is a defamatory opinion which is ostensibly accompanied by a recitation of the underlying facts upon which the opinion is based, but those underlying facts are either falsely misrepresented or grossly distorted.\"). As a result, the NYP's motion is denied as to the statements of opinion contained in the July 31 Column.\n\nC. The July 31, August 1 and August 2 Articles and the August 1 Cartoon\n\nI group these articles together because these articles were not written in the same tone and manner as the July 31 Column. In sharp contrast to the July 31 Column, none of these articles contains the type of rhetorical flourish that characterized the July 31 Column. Rather than conveying the sense that the author was trying to convince the reader of a particular viewpoint, these articles are written in a more neutral style indicative of traditional newspaper reporting. Accordingly, whereas the immediate context of the July 31 Column supported reading the statements contained therein as statements of opinion, that is not the case with respect to these articles. With this threshold observation in mind, I turn to the specific statements which the NYP asserts should be deemed statements of opinion.\n\n1. The July 31 Article\n\nThe NYP claims that the following statement from the July 31 Column is a statement of opinion:\n\nCleere said Jewell had been given the option of resigning or being fired in May because he was overly enthusiastic about his police duties and liked the limelight.\n\nMetcalf Aff.; Ex B. Inasmuch as this statement expresses the view that Jewell was \"overly enthusiastic about his police duties,\" this statement is identical to the Cleere Quotes in the July 31 Column and is actionable for the same reasons expressed supra. As to the view that Jewell \"liked the limelight,\" the factual basis for this statement -- that Jewell \"sought interviews with CNN, NBC and other news outlets\" -- has been specifically denied by Jewell. See Complaint 59; see also id. at 29. Accordingly, and again under the rule articulated in Silsdorf, this aspect of the statement is also actionable.\n\n2. The August 1 Article \u0026 Headline\n\nTurning to the August 1 Article, the NYP argues that the following statements, or underscored portions thereof (which are similarly set forth in the passages from which they appear), are statements of opinion:\n\nInvestigators say they're closing in on \"hero\" security guard Richard Jewell as the Olympics bomber after searching his apartment for hours and carting off boxes of possible evidence.\n\n\"We're pretty confident it's him, but we're most concerned with making sure our case is airtight,\" said a source close to the probe of the man suspected of planting the bomb that killed two people and injured 110 others.\n\nNo charges have been filed, but probers say it may just be a matter of time.\n\n\"Obviously, his profile is right-on,\" the source said.\n\n\"This is something I want to put in my Olympic scrapbook,\" said Mike Pugliese. \"Everybody here should be glad they finally got this guy. It's good they made progress like this while the Games are still going on. I think it makes people feel safer and better.\"\n\nCleere, who wouldn't tell reporters why Jewell was forced to leave, called the FBI to tell them that the former employee had been too zealous about his duties and sought attention.\n\nMetcalf Aff; Ex. B. The NYP also claims that the August 1 Headline, \"Noose tightens around Olympic suspect,\" is a non-actionable statement of opinion. See id.\n\nThe statement attributed to Mike Pugliese appears to be a statement made by an individual during a random interview. See NYP Mem. at 26. The article does not attribute any position of authority to Mr. Pugliese, or any position whatsoever, in connection with the investigation. For this and other reasons, this statement is perhaps the closest statement in the NYP articles to a classic statement of pure opinion which does not imply that it is based upon undisclosed facts. The interviewee is expressing his personal reaction to the events: \"It's good they made progress like this while the Games are still going on. I think it makes people feel safer and better.\" By virtue of his lack of connection to the investigation, there is no implication that Mr. Pugliese has any special knowledge concerning these events. Although he states that people should be glad \"they finally got this guy[,]\" no reasonable reader would read this statement as an expression of fact that Jewell had been arrested. The rest of the article repeatedly and clearly discusses the investigation of Jewell and states that \"no charges have been filed.\" Indeed, the implied error in this statement only emphasizes that Mr. Pugliese does not have any undisclosed knowledge of the events. In short, a reasonable reader would not have understood these statements to be statements of fact.\n\nAs to the statement from Cleere, the passage begins with the statement that Cleere \"wouldn't tell reporters why Jewell was forced to leave [his job at Piedmont college],\" but concludes with the statement of opinion that Jewell was \"too zealous about his duties and sought attention.\" A clearer indication that a statement of opinion is based upon undisclosed facts could not have been made. Cleere specifically said that the reason(s) for Jewell's departure would not be revealed. Accordingly, this statement is a mixed statement of opinion and is actionable.\n\nAs to the remainder of the statements, the inquiry is less clear. The view that \"it may just be a matter of time\" does not appear to be either a statement of fact or opinion, yet the law requires that it be one or the other. Admittedly, the statement lacks a definitive meaning, and in this sense is a statement of opinion, but to the extent that it expresses the view, when read in context, that charges against Jewell would soon be filed, that is presumably something that can be verified and thus proven true or false. The other statements -- that investigators were \"closing in\" on Jewell, \"pretty confident it's him\" and that \"his profile is right-on\" -- are different means of expressing the same basic idea; namely, that Jewell was being actively investigated and that the authorities believed that Jewell was responsible for the bombing. Notably, and unlike the statements in the July 31 Column, none of these phrases contains charged or rhetorical language suggestive of a statement of opinion. Nor, consistent with my introductory remarks about these articles, does the overall tone of this article suggest to the average reader that these are statements of opinion. Furthermore, although these statements contain an element of ambiguity, they, too, seem capable of being proven either true or false. Presumably one could prove what the status of the investigation was at a given point in time, and thereby prove whether, in fact, investigators were \"closing in\" on Jewell, or whether they were \"pretty confident it's him\" or whether Jewell's \"profile [was] right on.\"\n\nFortunately, I need not definitively resolve this interesting but complex question. Even assuming that these are statements of opinion, they are nonetheless actionable because the August 1 Article clearly implies that they are statements of opinion based upon undisclosed facts. The NYP argues that these statements \"are the opinions of law enforcement officials preceded by facts about what evidence the investigation of Jewell's home had revealed.\" NYP Mem. at 26 (emphasis added). Quite the contrary. The August 1 Article specifically states that investigators would not say what the evidence in Jewell's home revealed:\n\nFederal agents and cops searched Jewell's northeast Atlanta apartment for several hours yesterday, carrying out several boxes and bags of his belongings.\n\nOfficials wouldn't say what they'd found.\n\nAugust 1 Article; Smith Aff. Ex. D (emphasis added). Investigators were expressing their views based upon material seized from Jewell's home, but yet they \"wouldn't say what they'd found.\" Their opinions, therefore, were based upon undisclosed facts, and the NYP's readers were specifically told as much. Moreover, the fact that this statement is preceded by a report that investigators spent \"several hours\" searching the apartment and took away \"several boxes and bags\" of evidence only reinforces the suggestion that these opinions are based upon undisclosed facts -- one is left to ponder, what did the investigators find during all that time and in all of that material? See Kelly, 806 F.2d at 48 (holding that statement was one of fact in part because document at issue stated that it was based upon \"an examination of the facts\" but those facts were not set forth for the reader). As a result, these statements are statements of mixed opinion, and the NYP's motion, except as stated herein, is denied.\n\nAs to the August 1 Headline -- \"Noose tightens around Olympic suspect\" -- this statement is another means of expressing the same view contained in the August 1 Article; i.e., that the investigation against Jewell was proceeding apace. The suggestion that the \"noose\" was tightening implies that evidence was mounting against Jewell. Again, assuming this to be a statement of opinion, it is nonetheless actionable because the basis for that opinion -- the content of the mounting evidence -- was not revealed.\n\n3. The August 1 Cartoon\n\nThe August 1 Cartoon, described supra, does not directly comment upon Jewell, nor, for that matter, does it even contain a caricature of him. Rather, the point of the cartoon seems to be a comment upon the Olympic security office's hiring practices. Of course, the only reason that is at all worthy of comment is because a person hired by the Olympic security office was suspected of having taken part in the bombing. Here, the only person to whom the cartoon could have been indirectly referring -- however ambiguously -- was Jewell.\n\nFor present purposes, I will assume that the cartoon portrayed Jewell in the most defamatory light, i.e., by implying that he was guilty of the bombing. Even under such an assumption, however, the cartoon would still not be actionable because a reasonable reader would not view such a cartoon as a statement of fact; rather, given the inherent nature of a cartoon, a reasonable reader would view it as a statement of pure opinion not based on undisclosed facts. See Keller v. Miami Herald Pub. Co., 778 F.2d 711, 718 (11th Cir. 1985) (\"Cartoons are seldom vehicles by which facts are reported; quite the contrary, they are deliberate departures from reality designed forcefully, and sometimes viciously, to express opinion.\"); \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" DRT Construction Co. v. Lenkei, 176 A.D.2d 1229, 1230, 576 N.Y.S.2d 724, 725 (4th Dep't 1991) (\"Cartoons, by their very nature, are rhetorical hyperbole or exaggerated statements of opinion.\" (citing Keller, 778 F.2d at 718)), appeal denied, 79 N.Y.2d 753, 581 N.Y.S.2d 281, 589 N.E.2d 1263 (1992); cf. Velez v. VV Publishing Corp., 135 A.D.2d 47, 52, 524 N.Y.S.2d 186, 189-90 (1st Dep't) (discussing Keller and other cartoon cases in a related situation involving a statutory cause of action for unlawful use of an individual's picture and observing that \"cartoons cannot reasonably be interpreted as literally depicting an actual event or situation, that a strictly literal interpretation ignores the nature of a cartoon and how cartoons are traditionally understood by those who view them . . . [and] is tortured and extreme\") (internal quotation marks and citations omitted), appeal denied, 72 N.Y.2d 808, 533 N.Y.S.2d 57, 529 N.E.2d 425 (1988). Accordingly, the NYP's motion as to the cartoon is granted.\n\n4. The August 2 Article\n\nFinally, the NYP claims that the following statements, or underscored portions thereof, from the August 2 Article are non- actionable statements of opinion:\n\nInvestigators vowed last night they were not backing off naming \"hero\" security guard Richard Jewell the No. 1 suspect in the Olympic bombing.\n\nThe FBI took heat for seeming to lack enough evidence to arrest Jewell three days after leaking word that he was a suspect -- but a law enforcement source said the feds continued to build a case against him.\n\n\"Any reports about us losing interest are just off right now,\" the source said.\n\n\"They're not right. On a scale of 1 to 10 of our interest right now, he's still a 10 and will remain a 10 until we find something else of interest.\n\n\"If he's not the guy, he's one sick puppy.\"\n\nA law-enforcement officer who knew Jewell has told the FBI the burly security guard once said he possessed an anarchist manual. Such books sometimes contain detailed bomb-making instructions.\n\n\"It's at least a matter of days,\" the source said.\" There's a lot of stuff to go through.\n\nMetcalf Aff.; Ex. B.\n\nThe same result for the same reasons discussed with respect to the August 1 Article is required herein. These statements are similarly ambiguous as to whether they express statements of opinion or fact. But, again, assuming that they are statements of opinion, they imply a basis in fact not disclosed to the reader. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" Admittedly, in this article, one day after evidence was seized from Jewell's home, facts not present in the August 1 Article are disclosed. The article states that Jewell possessed an anarchist manual and that \"ordinary nails\" were found in his home (the bomb purportedly contained nails designed to be shrapnel). See August 2 Article; Smith Aff. Ex. F. In addition, the article indicates that videotapes and a rug were sent to the FBI's crime lab. See id.\n\nThis limited disclosure does not change the fact that the article implies that it is based upon other undisclosed facts. Notably, the article is accompanied by a photograph of a group of FBI agents comparing notes at the back of a car, outside Jewell's home, with miscellaneous and unidentified material in the car's rear compartment. The photograph suggests that much was seized, but the article only discloses the most innocuous of items and leaves the reader speculating what other information may have been found. Adding to this sense of inquiry is the sub-headline to the article which refers to the \"Feds building a case\" and the fact that the source for the specific information identified in the article is an unnamed law-enforcement source. Moreover, one is left a bit befuddled why Jewell remained a \"10\" in terms of the FBI's \"interest\" on the basis of the minimal evidence discussed in the article. The combination of this decidedly strong interest coupled with a seeming lack of support suggests to the reader that there must be something more to substantiate this interest. See Brown v. Albany Citizens Council on Alcoholism, Inc., 199 A.D.2d 904, 904-05, 605 N.Y.S.2d 577, 578 (3d Dep't 1993) (holding that statement charging plaintiff with \"inadequate financial skills and misconduct\" was one of mixed opinion where speaker made statement at a personnel committee meeting in which the other members could \"have reason to believe\" that speaker had investigated matter and \"possessed information to support the accusations made\"); Kraus v. Brandstetter, 167 A.D.2d 445, 445-46, 562 N.Y.S.2d 127, 129 (2d Dep't 1990) (holding that newsletter which stated, in connection with plaintiff's discharge from employment, that the Medical Board was \"unanimous in a vote of no confidence\" was actionable as a statement of mixed opinion because \"by couching their determination in terms of a vote, the Medical Board created the impression that their determination\" was based upon undisclosed facts).\n\nFurthermore, specific statements in the article suggest the existence of undisclosed facts. The following passage is perhaps the best example:\n\nAnother law-enforcement source said Jewell's arrest was not imminent.\n\n\"It's at least a matter of days,\" the source said. \"There's a lot of stuff to go through.\"\n\nAsked whether any particularly damming evidence had been discovered, the source said flatly, \"No.\"\n\nAnother source added, \"If they had found smoking gun of evidence in the house, he would have been led away in handcuffs.\"\n\nAugust 2 Article; Smith Aff. Ex. F. Contrasting the statement that there was \"a lot of stuff to go through\" against the relatively few items discussed in the article again suggests that there may have been additional material which provided the basis for the agents' opinions, but this information remained undisclosed. Similarly, given the absence of \"any particularly damming evidence,\" one is left to question upon what basis interest in Jewell remained a \"10.\"\n\nIn sum, these statements, in both the August 1 and 2 Articles, state that Jewell was being actively investigated by the authorities. Although it presents a close question as to whether these are statements of opinion, even assuming that they are statements of opinion, they are nonetheless actionable because they suggest an undisclosed factual basis of support. Accordingly, with the exceptions discussed herein, the NYP's motion is denied. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\"\n\nVII. The Incremental Harm Defense\n\nThe NYP argues that many of the statements at issue are not actionable based upon the incremental harm defense. This doctrine measures the difference between the harm caused by non-actionable statements when compared with the harm caused by purportedly actionable statements and dismisses the latter when the difference is incremental. For the reasons discussed below, I find that this defense is available under New York law, but that, under the circumstances presented herein, the Complaint should not be dismissed on this basis.\n\nThe incremental harm defense was first articulated by Judge Weinfeld in Simmons Ford, Inc. v. Consumers Union of the United States, Inc., 516 F. Supp. 742 (S.D.N.Y. 1981). There, plaintiff manufactured and retailed an electric car, known as CitiCar; defendant published the well-known magazine, Consumers Reports (\"Consumers\"). In one of its reviews, Consumers gave the car a \"Not Acceptable\" rating and based this conclusion, as summarized by the District Court, on the view that it \"suffered from poor acceleration, low top speed, poor braking, poor handling, poor ride, poor comfort and generally negative performance.\" Id. at 744. The review also stated that conventional cars had to conform to certain Federal safety standards, that electric cars had been granted an exemption from these standards and that the plaintiff's car would not have passed certain impact tests. See id. at 744-45.\n\nPlaintiff did not bring suit on the basis of the \"Not Acceptable\" rating or on the basis of the other statements made in connection therewith. Rather, plaintiff alleged that statements concerning the safety standards were false and defamatory. Judge Weinfeld found that this section of the article was \"not entirely accurate[,]\" although portions of it were. See id. at 745-46. After concluding that plaintiff had failed to raise a material issue of fact as to defendant's state of mind, the court provided an \"independent ground\" for dismissing the complaint. Referring to the \"libel-proof\" defense, and two decisions by the Court of Appeals, see Cardillo v. Doubleday \u0026 Co., 518 F.2d 638 (2d Cir. 1975); Buckley v. Littell, 539 F.2d 882 (2d Cir. 1976), cert. denied, 429 U.S. 1062, 50 L. Ed. 2d 777, 97 S. Ct. 785, 97 S. Ct. 786 (1977), the court reasoned as follows:\n\nThe portion of the article challenged by plaintiffs[] could not harm their reputations in any way beyond the harm already caused by the remainder of the article. It may be acknowledged the reputation of the CitiCar was damaged by defendant's finding that CitiCar was \"Not Acceptable.\" However, the blunt fact is that, in light of defendant's extensive and detailed testing procedures, if the article had made no reference to federal safety standards, or to the CitiCar's exemptions from them, the opinions expressed therein based upon which the defendant concluded the car was \"Not Acceptable\" would not give rise to any actionable claim in plaintiff's favor. Given the abysmal performance and safety evaluations detailed in the article, plaintiffs could not expect to gain more than nominal damages based on the addition to the article of the misstatement relating to federal safety standards. . . . Given this background, plaintiffs' reputational interest in avoiding further adverse comment regarding the safety and performance of CitiCar is minimal when compared with the First Amendment interests at stake.\n\n516 F. Supp. at 750-51. Thus, the incremental harm doctrine compares the harm caused by non-actionable elements of an article to the harm caused by the actionable portions and dismisses the latter when the difference in harm is \"incremental.\" See Church of Scientology Int'l v. Time Warner, Inc., 932 F. Supp. 589, 593-94 (S.D.N.Y. 1996).\n\nThe doctrine achieved further support when the Court of Appeals cited and discussed Simmons Ford with approval in Herbert v. Lando, 781 F.2d 298 (2d Cir.), cert. denied, 476 U.S. 1182, 91 L. Ed. 2d 545, 106 S. Ct. 2916 (1986). In Herbert, a retired Army officer, who had fought in Vietnam, brought an action against, inter alia, CBS and the Atlantic Monthly. Plaintiff had accused his superiors of various war crimes, and CBS, on the basis of an article published by the Atlantic Monthly, questioned plaintiff's motives for his accusations. After affirming the district court's dismissal of nine of eleven statements, the Court of Appeals addressed the district court's refusal to dismiss the remaining two statements. See id. at 309. Characterizing this as \"the most difficult question presented to us on this appeal[,] the court nonetheless reversed the district court and remanded with instructions to dismiss the remaining two statements. See id. In reasoning similar to Judge Weinfeld's in Simmons Ford, the court concluded:\n\nWe hold that if the [defendants'] published view that [plaintiff] lied about reporting war crimes was not actionable, other statements -- even those that might be found to have been published with actual malice -- should not be actionable if they merely imply the same view, and are simply an outgrowth of and subsidiary to those claims upon which it has been held there can be no recovery.\n\nId. at 312. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\"\n\nSince Herbert and Simmons Ford were decided, courts in this circuit have continued to refer to both decisions. See, e.g., Church of Scientology, 932 F. Supp. at 594 (refusing to apply the doctrine because, inter alia, defendant moved prior to conducting discovery on the issue of damages and, therefore, the incremental harm could not be measured); Broome v. Biondi, 1997 U.S. Dist. LEXIS 1431, *12, No. 96 Civ. 0805 (RLC), 1997 WL 83295, at * 4 (S.D.N.Y. Feb. 10, 1997) (citing Herbert in the context of the libel-proof plaintiff doctrine and refusing to dismiss complaint on this basis); Jones v. Globe Int'l, Inc., No. 3:94 Civ. 01468 (AVC), 1995 WL 819177, at * 9-*11 (D. Conn. Sept. 26, 1995) (discussing both the libel-proof plaintiff and the incremental harm doctrine, citing Simmons Ford and holding that the combination of plaintiff's criminal convictions and certain unchallenged statements warranted dismissal of the complaint); Galu v. Swissair: Swiss Air Transport Co., Ltd., 1987 U.S. Dist. LEXIS 12628, No. 86 Civ. 5551 (CSH), 1987 WL 15580, at * 5 (S.D.N.Y. Aug. 3, 1987) (indicating in dicta, in reliance upon Herbert, that defamation claim could be dismissed based upon the incremental harm doctrine); Guccione v. Hustler Magazine, Inc., 632 F. Supp. 313, 324 (S.D.N.Y. 1986) (distinguishing Herbert and Simmons Ford and declining to grant defendants judgment notwithstanding the verdict), rev'd, 800 F.2d 298, 302-04 (reversing district court's decision on the alternative grounds of substantial truth and the libel-proof plaintiff doctrine; discussing Simmons Ford in the context of the libel-proof plaintiff doctrine), cert. denied, 479 U.S. 1091, 94 L. Ed. 2d 158, 107 S. Ct. 1303 (1987); \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" Sharon v. Time Inc., 575 F. Supp. 1162, 1168-70 (S.D.N.Y. 1983) (applying Simmons Ford in a mixed libel-proof plaintiff and incremental harm analysis and concluding that the complaint should not be dismissed because the court could not say that plaintiff's reputation, as a matter of law, had \"been so damaged by the reported events that he could recover only nominal damages for the article's potentially libelous statements\"). But see Sargeant v. Serrani, 866 F. Supp. 657, 666 n.13 (S.D.N.Y. 1994) (not citing either Herbert or Simmons Ford, but citing Cianci v. New York Times Publishing Co., 639 F.2d 54 (2d Cir. 1980), and rejecting adoption of the incremental harm defense in reliance upon Liberty Lobby, infra).\n\nAs a doctrinal matter, the concept has received a less receptive response in other circuits. See, e.g., Liberty Lobby, Inc. v. Anderson, 241 U.S. App. D.C. 246, 746 F.2d 1563, 1568 (D.C. Cir. 1984) (Scalia, J.) (\"The theory must be rejected because it rests upon the assumption that one's reputation is a monolith, which stands or falls in its entirety. The law, however, proceeds upon the optimistic premise that there is a little bit of good in all of us -- or perhaps upon the pessimistic assumption that no matter how bad someone is, he can always be worse.\"), vacated on other grounds, 477 U.S. 242 (1986); Masson v. New Yorker Magazine, Inc., 960 F.2d 896, 898-99 (9th Cir. 1992) (following Liberty Lobby and holding that the California Supreme Court would agree with then-Judge Scalia that the doctrine is a \"bad idea\"); Dostert v. Washington Post Co., 531 F. Supp. 165, 168 n.11 (W.D. W. Va. 1982) (rejecting Simmons Ford because \"it is unlikely that the West Virginia Supreme Court of Appeals would adopt the Simmons court's holding that an article which is true and damaging in many respects cannot be libelous as a matter of law, notwithstanding that parts of it may be knowingly false\"). Commentators have tended to view the doctrine more favorably. See, e.g., Erin Daly, The Incremental Harm Doctrine: Is There Life After Masson?, 46 Ark. L. Rev. 371 (1993); Jay Framson, Note, The First Cut is the Deepest, But the Second May be Actionable: Masson v. New Yorker Magazine, Inc. and the Incremental Harm Doctrine, 25 Loy. L.A. L. Rev. 1483 (1992); Kevin L. Kite, Note, Incremental Identities: Libel-Proof Plaintiffs, Substantial Truth, and the Future of the Incremental Harm Doctrine, 73 N.Y.U. L. Rev. 529 (1998) (\"Kite Note\").\n\nNeither Herbert nor Simmons Ford clearly articulated the source of law for the genesis of the incremental harm doctrine. Simmons Ford seemed to base its decision on the First Amendment, and, to the extent that Herbert relied upon Simmons Ford, the same can therefore be said of it. See Masson, 960 F.2d at 898 (\"Herbert noted that the theory was 'novel,' and that it was first applied in Simmons. Simmons, in turn, seemed to ground the doctrine in the First Amendment.\") (citations omitted). That being the case, the Supreme Court's decision in Masson v. New Yorker Magazine, Inc., 501 U.S. 496, 115 L. Ed. 2d 447, 111 S. Ct. 2419 (1991), eliminated this basis for development of the doctrine: \"We reject any suggestion that the incremental harm doctrine is compelled as a matter of First Amendment protection for speech.\" Id. at 523; see also Church of Scientology, 932 F. Supp. at 594 (implicitly recognizing that Masson reverses Simmons Ford and Herbert and finding no need to address whether the doctrine is available under state law). States, of course, remain free to adopt the doctrine as a matter of state law. See Masson, 501 U.S. at 523.\n\nBecause neither Simmons Ford not Herbert rested its results on state law, I must look to cases decided by New York courts to see if the incremental harm doctrine has been developed as a matter of state law. With one inconsequential exception, not a single reported decision of a New York state court has cited either decision or addressed the doctrine. See Lee v. City of Rochester, 174 Misc. 2d 763, 778 n.1, 663 N.Y.S.2d 738, 749 n.1 (Sup. Ct. Monroe Cty. 1997) (discussing the substantial truth defense and confusing it with the incremental harm doctrine (citing Desnick v. American Broadcasting Co., Inc., 44 F.3d 1345, 1350 (7th Cir. 1995) (Posner, J.)); see also Kite Note, 73 N.Y.U. L. Rev. at 534-45 (discussing the libel-proof plaintiff, substantial truth and incremental harm doctrines and the need to clearly distinguish between the three). The incremental harm doctrine's related cousin (although, as discussed in some detail in the various Notes cited above, the precise extent of that relationship is a matter of some debate), the libel-proof plaintiff doctrine, appears to have only been discussed in one Appellate Division decision and under a somewhat unique set of circumstances which do not provide much assistance in terms of the doctrine's broader development under New York state law. See Jones v. Plaza Hotel, 671 N.Y.S.2d 231, 231 (App. Div. 1st Dep't 1998) (affirming dismissal of plaintiff's defamation action because the same claims had been dismissed in a federal action and because the federal court had \"aptly described\" plaintiff as \"libel proof\" (citing Jones v. Trump, 1997 U.S. Dist. LEXIS 7324, No. 96 Civ. 2995 (SAS), 1997 WL 277375, at * 5 (S.D.N.Y. May 27, 1997) (which in turn relied upon Jones, 1995 WL 819177, at * 9-*11), amended on other grounds, 971 F. Supp. 783 (S.D.N.Y. 1997))); cf. Robert Gage Jr. \u0026 Christopher P. Conniff, The Libel-Proof Plaintiff Doctrine, N.Y.L.J., Feb. 23, 1994, at 1 (discussing the doctrine, citing exclusively federal cases and referring only tangentially to Von Gutfeld for the broad proposition that \"New York has been consistently active in responding to the real life factors which shape a sensible balancing between reputational concerns and First Amendment interests\"). \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\"\n\nThis absence of discussion is unfortunate, for it means that I must determine, in something of a vacuum, whether New York would adopt a doctrine that has, since its inception, engendered a substantial amount of controversy and has been rejected as a \"fundamentally bad idea\" by one of this nation's leading jurists. See Liberty Lobby, 746 F.2d at 1568 (Scalia, J.). In resolving this unsettled question, I may use any tools that the New York Court of Appeals would use, including decisions from other states, scholarly works and, of course, the general body of decisional law. See Travelers Ins. Co. v. 633 Third Assocs., 14 F.3d 114, 119 (2d Cir. 1994); see also In re Joint Eastern \u0026 Southern Dist. Asbestos Lit., 78 F.3d 764, 776 (2d Cir. 1996) (\"[A] district court may not properly abstain merely because the state-law question is difficult or the answer is uncertain.\"). Notwithstanding the considerable obstacles discussed above, for the reasons set forth below, I find that New York courts would adopt the doctrine.\n\nAs noted above, supra Part VI, New York has consistently chosen to provide libel defendants with greater protection than that afforded by federal law. The source for this greater protection can be traced to the difference between the New York Constitution and the United States Constitution. Compare N.Y. Const. art I,  8 (\"Every citizen may freely speak, write and publish his sentiments on all subjects, being responsible for the abuse of that right; and no law shall be passed to restrain or abridge the liberty of speech or of the press.\") with U.S. Const. amend. I (\"Congress shall make no law . . . abridging the freedom of speech, or of the press . . . .\"). Whereas the federal right is expressed in terms of what may not be done, the New York Constitution initially expresses the right in terms of what is permitted. This intentional difference in language highlights the distinction between a charter of negative liberties and positive rights, and New York has chosen, in clear and unmistakable terms, to speak in terms of positive rights. This deviation is more than just a casual difference in language; it reflects a fundamental difference in belief which in turn reflects New York's unique role in cultural and intellectual pursuits. Then-Judge Kaye aptly summarized this point:\n\nThis State, a cultural center for the Nation, has long provided a hospitable climate for the free exchange of ideas ( Matter of Beach v. Shanley, 62 N.Y.2d 241, 255-56, 476 N.Y.S.2d 765, 465 N.E.2d 304 [Wachtler, J., concurring]). That tradition is embodied in the free speech guarantee of the New York State Constitution, beginning with the ringing declaration that \"every citizen may freely speak, write and publish . . . sentiments on all subjects.\" (N.Y. Const., art. I,  8.). Those words, unchanged since the adoption of the constitutional provision in 1821, reflected the deliberate choice of the New York State Constitutional Convention not to follow the language of the First Amendment, ratified 30 years earlier, but instead to set forth our basic democratic ideal of liberty of the press in strong affirmative terms. (see, Forkosch, Freedom of the Press: Croswell's Case, 33 Fordham L. Rev. 415 [1965]).\n\nImmuno, 77 N.Y.2d at 249, 566 N.Y.S.2d at 913, 567 N.E.2d at 1277. These same concerns have been described by then-Chief Judge Wachtler in similarly expansive terms:\n\nFreedom of expression in books, movies and the arts, generally, is one of those areas in which there is great diversity among the states. . . . New York has a long history and tradition of fostering freedom of expression, often tolerating and supporting works which in other States would be found offensive to the community. Thus, the minimal standard established by the Supreme Court for First Amendment rights cannot be considered dispositive in determining the scope of this State's constitutional guarantee of freedom of expression.\n\nCloud Books, 68 N.Y.2d at 557-58, 510 N.Y.S.2d at 846-47, 503 N.E.2d at 494-95 (citation omitted).\n\nThis considerable breadth of protection supports the view that the New York Court of Appeals would choose to adopt the incremental harm defense. While far from dispositive, I find further support for this conclusion in that New York courts broadly recognize a series of different privileges in defamation cases, some qualified, others absolute. See generally Liberman v. Gelstein, 80 N.Y.2d 429, 437, 590 N.Y.S.2d 857, 862, 605 N.E.2d 344, 349 (1992) (discussing these privileges). As discussed in greater detail infra, the incremental harm defense is based upon the view that some wrongs simply should not be actionable primarily because society is better off avoiding the costs associated with litigation where the harm suffered is incremental. The New York Court of Appeals has spoken of the rationale for these various qualified and absolute privileges in similar terms: \"Courts have long recognized that the public interest is served by shielding certain communications, though possibly defamatory, from litigation, rather than risk stifling them altogether.\" Id. (emphasis added).\n\nIn addition, in contrast to the California Constitution, interpreted by the Ninth Circuit in Masson as not supporting adoption of the incremental harm defense, the New York Court of Appeals has consistently spoken of this State's Constitution in the broadest terms and has emphasized on numerous occasions that it provides greater protection than the Federal constitution. Compare Griset v. Fair Political Practices Comm., 8 Cal. 4th 851, 884 P.2d 116, 126 n.5 (Cal. 1994) (en banc) (\"As a general matter, the liberty of speech clause in the California Constitution is more protective of speech than its federal counterpart.\") and Church of the Soldiers of the Cross of Christ v. City of Riverside, 886 F. Supp. 721, 724 (C.D. Cal. 1995) (following Griset) with Brown v. Kelly Broadcasting Co., 48 Cal. 3d 711, 771 P.2d 406, 427-28, 257 Cal. Rptr. 708 (Cal. 1989) (en banc) (rejecting argument that the California Constitution provides greater protection and observing that \"we have recently applied the federal constitutional requirements without suggestion that our state Constitution creates higher obstacles to recover for defamation\") and Weller v. American Broadcasting Cos., 232 Cal. App. 3d 991, 1006-07, 283 Cal. Rptr. 644, 653-54 (Ct. App. 1st Dist. 1991) (following Brown and rejecting argument \"that our state Constitution weighs in favor of a standard of fault higher than that required under the federal Constitution\"). For present purposes it is not necessary to resolve this apparent tension; rather, it suffices to observe that because the New York Court of Appeals has spoken in more definitive and certain terms as to the breadth of the right to free speech, the Ninth Circuit's reading of the California Constitution in Masson is distinguishable. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\"\n\nI turn now to the primary objection to the doctrine, first articulated by then-Judge Scalia, that \"there is a little bit of good in all of us\" or that \"no matter how bad someone is, he can always be worse.\" Liberty Lobby, 746 F.2d at 1568. The issue, however, is whether the New York Court of Appeals would decide that the damages that flow from the non-actionable portions of a statement merit the expense of defending against a libel action where the harm caused by the actionable portions is incremental. In other words, even though, as then-Judge Scalia opined, all of us can be harmed, if only to a minor degree, by the publication of false statements, the question is whether society is better off permitting such suits to go forward in light of the costs of defending such suits. See Simmons Ford, 516 F. Supp. at 750-51 (\"Given this background, plaintiffs' reputational interest in avoiding further adverse comment regarding the safety and performance of CitiCar is minimal when compared with the First Amendment interests at stake.\"); cf. Jackson v. Longcope, 394 Mass. 577, 476 N.E.2d 617, 619-20 (Mass. 1985) (adopting the libel-proof plaintiff doctrine and reasoning that \"a libel-proof plaintiff is not entitled to burden a defendant with a trial in which the most favorable result the plaintiff could achieve is an award of nominal damages\"). Judge Sack, prior to his recent appointment to the Court of Appeals, reached a similar conclusion in rejecting the Liberty Lobby court's reasoning:\n\nWhile this criticism may have sound technical footing, it does not take into account the value of the incremental harm doctrine in separating trivial complaints from those deserving judicial attention, thereby protecting speakers from the use of the courts purely for retribution or intimidation. The doctrine recognizes that if an article is both injurious and substantially true, its minor mistakes are themselves unlikely to result in substantial harm. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" And it therefore helps protect against litigation designed to punish a speaker for stating harmful truths rather than to compensate the plaintiff for the insignificant falsehoods.\n\nRobert D. Sack \u0026 Sandra S. Baron, Libel, Slander, and Related Problems 118-19 (2d ed. 1994). As a result, under the Simmons Ford analysis, the New York Court of Appeals would perform a cost benefit analysis and weigh the benefit of permitting plaintiffs to proceed with libel suits involving only incremental harm against the costs such suits impose upon media defendants and society at large. For the reasons expressed above, and notwithstanding the Liberty Lobby court's objections to the doctrine, I find that the New York Court of Appeals would rule that the incremental harm defense is available under New York law.\n\nHaving reached that conclusion, it is important to articulate, as clearly as possible, exactly how the defense operates and how it is different from some of the other defenses I have mentioned thus far. The substantial truth defense is often confused with the incremental harm defense, but the two are distinct, and the distinctions should be clarified. Then-Judge Scalia recognized this distinction when, after offering the refutation discussed above, he noted the following:\n\nThere may be validity to the proposition that at some point the erroneous attribution of incremental evidence of a character flaw of a particular type which is in any event amply established by the facts is not derogatory. If, for example, an individual is said to have been convicted of 35 burglaries, when the correct number is 34, it is not likely that the statement is actionable. That is so, however, not because the object of the remarks is \"libel-proof,\" but because, since the essentially derogatory implication of the statement (\"he is an habitual burglar\") is correct, he has not been libeled.\n\nLiberty Lobby, 746 F.2d at 1568-69 n.6.\n\nTo summarize, the substantial truth defense dismisses a libel claim because a statement is not false and, therefore, an element of the cause of action has not been met. Although the defense is concerned with truth, it appears to have been confused with the incremental harm doctrine because of the manner in which truth is determined. As then-Judge Scalia indicated, a court looks to the \"implication\" of the statement (in his example, that the putative plaintiff \"is an habitual burglar\") and compares that \"implication\" to the truth. The confusion flows from the implication analysis. Because a court must, under New York law, determine whether the \"implication\" would \"have a different effect on the mind of the reader from that which the pleaded truth would have produced[,]\" Fleckenstein, 266 N.Y. at 23, the \"implication\" inquiry can often be viewed as an incremental harm analysis, i.e., a claim is dismissed because the implication of the falsehood is not so different from the truth, and the plaintiff, therefore, has suffered only incremental harm. See, e.g., Moldea v. New York Times Co., 306 U.S. App. D.C. 1, 22 F.3d 310, 319 (D.C. Cir. 1994) (\"Application of the 'substantial truth' test when 'incremental harm' is not tolerated can be conceptually confusing.\"), cert. denied, 513 U.S. 875, 130 L. Ed. 2d 133, 115 S. Ct. 202 (1994); Haynes v. Alfred A. Knopf, Inc., 8 F.3d 1222, 1228 (7th Cir. 1993) (Posner, J.) (\"The rule of substantial truth is based on a recognition that falsehoods which do no incremental damage to the plaintiff's reputation do not injure the only interest that the law of defamation protects.\"); Robert D. Sack \u0026 Sandra S. Baron, Libel, Slander, and Related Problems 39 (2d ed. Supp. 1997) (observing that the Seventh Circuit has \"suggested that it recognizes the incremental harm doctrine, but . . . only insofar as the doctrine mirrors the substantial truth doctrine\").\n\nThat may be true, but the doctrines are conceptually distinct. Again, the substantial truth doctrine is not concerned with harm, it is concerned with an essential element of the plaintiff's claim and dismisses the action because that element cannot be met. Under the incremental harm analysis, a viable claim is dismissed even though the statement it is based on may be maliciously false because a court determines that the incremental benefit to plaintiff from continuing a suit outweighs the harm to the defendant and society. Thus, as their names imply, the substantial truth doctrine is concerned with truth (regardless of harm) and the incremental harm analysis is concerned with harm (regardless of truth).\n\nThe incremental harm defense is also different from the libel-proof plaintiff doctrine, although it is often articulated as a branch or variation of this doctrine. A libel-proof plaintiff, as the phrase implies, cannot be harmed because the plaintiff's reputation has already been so damaged that further falsehoods do not cause any additional damage. Not so with the incremental harm defense. As its name implies, a plaintiff is harmed, but the question is whether the ability to recover for that harm, when it is incremental to non-actionable harm, is justified.\n\nWith these distinctions in mind, and with this understanding of the defense, I turn to the NYP's specific arguments. Interestingly, the NYP's incremental harm defense is directed exclusively to statements concerning Jewell's alleged role in the bombing. The defense is not asserted for those statements dealing with his past work history. The NYP claims that the following statements in the August 1 Article caused Jewell to suffer only incremental harm:\n\nInvestigators say they're closing in on \"hero\" security guard Richard Jewell as the Olympics bomber after searching his apartment for hours and carting off boxes of possible evidence.\n\n\"We're pretty confident it's him, but we're most concerned with making sure our case is airtight,\" said a source close to the probe of the man suspected of planting the bomb that killed two people and injured 110 others.\n\nNo charges have been filed, but probers say it may just be a matter of time.\n\n\"Obviously, his profile is right-on,\" the source said.\n\n\"This is something I want to put in my Olympic scrapbook,\" said Mike Pugliese. \"Everybody here should be glad they finally got this guy. It's good they made progress like this while the Games are still going on. I think it makes people feel safer and better. \" \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\"\n\nMetcalf Aff. Ex. B. The NYP also asserts this defense with respect to the August 1 Headline: \"Noose tightens around Olympic bomb suspect.\" See id.\n\nAs to the August 2 Article, the NYP asserts that the defense applies to the following statements:\n\nInvestigators vowed last night they were not backing off naming \"hero\" security guard Richard Jewell the No. 1 suspect in the Olympic bombing.\n\nThe FBI took heat for seeming to lack enough evidence to arrest Jewell three days after leaking word that he was a suspect - but a law enforcement source said the feds continued to build a case against him.\n\n\"Any reports about us losing interest are just off right now,\" the source said.\n\n\"They're not right. On a scale of 1 to 10 of our interest right now, he's still a 10 and will remain a 10 until we find something else of interest.\n\nAnother law-enforcement source said Jewell's arrest was not imminent. \"It's at least a matter of days,\" the source said. There's a lot of stuff to go through.\n\nMetcalf Aff. Ex. B.\n\nWith respect to all of these statements, the NYP makes virtually the same argument. The gist of which is that these statements \"cannot conceivably cause Jewell any more damage than the statement that he was the focus of the investigation because they do nothing more than describe the progress of the investigation and the FBI's continuing interest in him.\" NYP Mem. at 22. For the reasons that follow, I disagree and conclude that these statements, at this stage of the action, may well have caused Jewell to suffer more than incremental harm.\n\nThe first step in the analysis is to determine against what background these statements must be evaluated. In other words, I must evaluate the non-actionable portions of the Complaint and determine what harm flows therefrom. Here, I have already concluded that the statements that Jewell was the \"prime\" or \"main\" suspect are not actionable as substantially true. See supra, Part IV. In addition to the contextual reading discussed supra, I did so because Jewell has admitted that he was \"a\" suspect and that he was investigated by the FBI.\n\nFrom these non-actionable elements, the NYP argues that the statements noted above should also be deemed non-actionable because the harm Jewell suffered as a result is only incrementally greater than the harm he suffered from the truth that he was a suspect and that he was investigated. Since this analysis is addressed to increments, it is appropriate to examine questions of kind, degree and nature. This is consistent with New York's approach, in virtually every other libel defense, to examine the statements in context. Applying such an examination to the statements at issue, I cannot conclude, as a matter of law, that the harm Jewell suffered was incremental.\n\nFirst, I note a limitation to my analysis. The NYP brings this aspect of the motion under Fed. R. Civ. P. 12(b)(6). Accordingly, other than the Complaint's allegations, whose truth I must assume, there is no evidence of harm, or anything else for that matter, pending before me. At least one court has suggested that under such circumstances, I should decline altogether to engage in an incremental harm analysis. See Church of Scientology, 932 F. Supp. at 594. Nonetheless, some of the cases that have thus far addressed the doctrine have done so, even in the context of motions for summary judgment and judgments notwithstanding the verdict, on the basis of the statements themselves without any discussion of evidence concerning harm or damages. Much like a threshold analysis of substantial truth, those courts appear to address the natural implications of the statements in order to determine the harm which flows therefrom. See, e.g., Herbert, 781 F.2d at 309-12; Simmons Ford, 516 F. Supp. at 750-51. As a result, the procedural posture of this motion is not dispositive. At the same time, however, I cannot ignore that it does present a limitation which may not be present on a fully developed record.\n\nThe crux of this analysis is whether the harm that flows from the non-actionable statements is incremental when compared to the harm that flows from the actionable statements. In examining the kind of statements to which the NYP asserts that the defense applies, most of them were made by unidentified law enforcement sources. This is a relevant factor. While Jewell was a suspect and was investigated, statements made by law enforcement officials close to an investigation carry a different weight, and therefore create a different magnitude of harm, than statements from individuals not so associated. It is one thing for a columnist such as Peyser to state that Jewell's profile is \"right on;\" it is another thing for a law enforcement source actively involved in an investigation to make the same statement.\n\nDegree is also a relevant concern. I simply cannot ignore that unlike Herbert and Simmons Ford, which both involved two or three statements, the NYP asserts this defense with respect to eleven statements and that this case involves some 33 statements and their various sub-parts. This is not just a matter of idle counting. The point is that although some harm does indeed flow from the fact that Jewell was an actively investigated suspect, that harm takes on a different character when the NYP continues to publish numerous statements concerning the status of the investigation. Cf. Cerasani, 991 F. Supp. at 352 (\"Under New York law, 'every distinct publication of a libelous writing or a slanderous statement gives rise to a separate cause of action.'\" (quoting Pruiss v. Bosse, 912 F. Supp. 104, 106 (S.D.N.Y. 1996) (citation omitted))). This concern takes on particular significance when the nature of the statements is considered.\n\nThese statements did more than report on the status of the investigation and suggest that Jewell was a suspect, they went one step further and implicitly suggested that Jewell was responsible for the bombing and that evidence to prove that fact was mounting: (1) the \"noose\" was tightening around Jewell; (2) \"Investigators say they're closing in on 'hero' security guard Richard Jewell[;]\" (3) \"We're pretty confident it's him[;]\" (4) \"No charges have been filed, but probers say it may just be a matter of time. 'Obviously, his profile is right on,' the source said[;]\" (5) \"The feds continued to build a case against him[;]\" (6) \"On a scale of 1 to 10 of our interest right now, he's still a 10 and will remain a 10 until we find something else of interest[;]\" and (7) \"Another law enforcement source said Jewell's arrest was not imminent. 'It's at least a matter of days,' the source said. There's a lot of stuff to go through.\" To repeat, in contrast to statements which merely advance the same concept evoked by the non-actionable statements -- that Jewell was a \"prime\" suspect and was being investigated -- these statements, on their face, took that concept and brought it to the next level -- Jewell is responsible for the bombing and evidence exists to prove it. Compare Herbert, 781 F.2d at 312 (\"Our holding is thus limited to those cases in which statements allegedly made with knowing falsity or reckless disregard give rise to defamatory inferences that are only supportive of inferences that are not actionable.\").\n\nGiven this significant difference in nature, coupled with the number of statements and their sources, I cannot conclude, as a matter of law, that the harm which flowed from these statements is only incrementally more than the harm that flowed from the fact that Jewell was a suspect and was actively investigated by the authorities. Accordingly, the NYP's motion is denied.\n\nVIII. Libel Per Se\n\nUnder New York law, it appears that a statement is libelous per se in the following circumstances:\n\n\"Any written or printed article is libelous or actionable without alleging special damages if it tends to expose the plaintiff to public contempt, ridicule, aversion, or disgrace, or induce an evil opinion of him in the minds of right-thinking persons, and to deprive him of their friendly intercourse in society.\"\n\nRinaldi, 42 N.Y.2d at 379, 397 N.Y.S.2d at 949, 366 N.E.2d at 1305 (quoting Sydney v. MacFadden Newspaper Pub. Corp., 242 N.Y. 208, 211-12, 151 N.E. 209, 210 (1926)); see also Nichols v. Item Publishing, Inc., 309 N.Y. 596, 600-01, 132 N.E.2d 860, 861-62 (1956) (\"A writing is defamatory that is, actionable without allegation or proof of special damage if it tends to expose a person to hatred, contempt or aversion, or to induce an evil or unsavory opinion of him in the minds of a substantial number of the community, even though it may impute no moral turpitude to him.\") (internal quotation marks and citation omitted). This is the same standard that is frequently applied to determine whether a statement is capable of a defamatory meaning, the difference being that courts delete that portion of the standard which refers to special damages and pick up the language with the phrase \"tends to expose.\" See, e.g., Levin, 119 F.3d at 195 (quoting Tracy, 5 N.Y.2d at 136, 182 N.Y.S.2d at 3, 155 N.E.2d at 854); Kimmerle, 262 N.Y. at 102, 186 N.E. at 218 (citing Sydney, embellishing its articulation of the standard and leaving off that portion which speaks of special damages); Horne v. Matthews, 1997 U.S. Dist. LEXIS 14518, No. 97 Civ. 3605 (JSM), 1997 WL 598452, at * 2 n.4 (S.D.N.Y. Sept. 25, 1997) (observing that courts frequently merge the inquiries in this area of law). This suggests that an inquiry into whether a statement is capable of a defamatory meaning is dispositive of whether the statement is libelous per se. See Matherson v. Marchello, 100 A.D.2d 233, 237, 473 N.Y.S.2d 998, 1002 (2d Dep't 1984) (Titone, J.P.) (\"Thus, unlike the law of slander, in the law of libel the existence of damage is conclusively presumed from the publication itself and a plaintiff may rely on general damages.\"). Justice Cardozo recognized this aspect of libel law nearly seventy years ago when he, too, contrasted it with the law of slander:\n\nThe schism in the law of defamation between the older wrong of slander and the newer one of libel is not the product of mere accident. It has its genesis in evils which the years have not erased. Many things that are defamatory may be said with impunity through the medium of speech. Not so, however, when speech is caught upon the wing and transmuted into print. What gives the sting to the writing is its permanence of form. The spoken word dissolves, but the written one abides and perpetuates the scandal.\n\nOstrowe v. Lee, 256 N.Y. 36, 39, 175 N.E. 505, 506 (1931) (internal quotation marks and citations omitted); see also Privitera v. Town of Phelps, 79 A.D.2d 1, 5, 435 N.Y.S.2d 402, 405 (4th Dep't) (Simons, J.) (relying upon this same passage to distinguish the law of slander, and its specific categories of slander per se, from libel law), appeal dismissed, 53 N.Y.2d 796 (1981).\n\nNonetheless, as Justice Titone explained in his comprehensive opinion on the subject, the law of libel appears to distinguish between libel per se and libel per quod on the basis of whether the defamatory nature of the statement is apparent on its face or whether the nature of the statement can only be ascertained by reference to facts not set forth in the publication. See Matherson, 100 A.D.2d at 236 n.3, 473 N.Y.S.2d at 1002 n.3; see also Sharon v. Time Inc., 575 F. Supp. 1162, 1172 (S.D.N.Y. 1983) (discussing libel per se, applying the Nichols standard and finding that statements were libelous per se where they did not require \"proof of extrinsic facts\" and were \"reasonably subject to a construction that would hold [plaintiff] up to contempt and disparage him in his profession\").\n\nI use the word \"appears\" because this is an area of some debate. See Matherson, 100 A.D.2d at 236 n.3, 473 N.Y.S.2d at 1002 n.3; Robert D. Sack \u0026 Sandra S. Baron, Libel, Slander, and Related Problems 141-46 (2d ed. 1994) (discussing the state of \"disarray\" surrounding whether New York has adopted the per se/per quod distinction). And, in any event, because the NYP does not argue that the statements at issue are not libelous per se on the basis of this distinction, I need not address it any further. See NYP Mem. at 17-19. Instead, the NYP argues that the statements of which Jewell complains are not libelous per se because they do not charge Jewell with a specific indictable offense and because the statements do not injure Jewell in his profession. See NYP Mem. at 18. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" These initial observations are, accordingly, relevant to the present inquiry because, as discussed in greater detail infra, in making this argument the NYP obscures the differences between slander per se and libel per se. For the reasons that follow, I disagree with the NYP's conclusions and hold that the statements are libelous per se.34\n\nA. Indictable Offense\n\nThe NYP argues that \"New York courts have held that to state a claim for libel per se based upon a charge of criminal conduct, the words themselves must charge the plaintiff with a specific indictable offense.\" NYP Mem. at 18 (citing Privitera, 79 A.D.2d at 3, 435 N.Y.S.2d at 404; Caffee v. Arnold, 104 A.D.2d 352, 478 N.Y.S.2d 683 (2d Dep't 1984)). There are two problems with this argument.\n\nFirst, the NYP confuses libel per se and slander per se. As set forth above, when confronted with the issue, courts carefully distinguish between the two. The notion that a claim for libel per se must be based upon a charge of a specific indictable offense is a concept borrowed from slander per se. In the latter analysis, courts refer to four categories of statements which are slanderous per se : (1) commission of a crime; (2) injury to plaintiff's trade, business or profession; (3) contraction of a loathsome disease; and (4) imputation of unchastity to a woman. See, e.g., Matherson, 100 A.D.2d at 236, 473 N.Y.S.2d at 1001 (citations omitted). Indeed, the two cases which the NYP relies upon are both slander per se cases. See Privitera, 79 A.D.2d at 2-3, 435 N.Y.S.2d at 403-04 (oral statement made by defendant, head of the Town Zoning Board, that plaintiff was a \"member of the mafia,\" \"a criminal\" and that \"he has the police at his home all the time because he is a bad person\"); Caffee, 104 A.D.2d at 352-53, 478 N.Y.S.2d at 684 (oral statement made at a union meeting that plaintiff \"got $ 2,500.00 from TWU International\"). In the area of slander per se, the law is quite restrictive in terms of which crimes support a valid claim. See Liberman v. Gelstein, 80 N.Y.2d 429, 435, 590 N.Y.S.2d 857, 860-61, 605 N.E.2d 344, 347-48 (1992) (discussing this more restrictive quality and holding that the law in this area distinguishes \"between serious and relatively minor offenses\"). The NYP does not cite, nor has research revealed, any cases which support importing this restrictive requirement from slander per se into libel per se. Cf. Weldy v. Piedmont Airlines, Inc., 985 F.2d 57, 61-62 (2d Cir. 1993) (\"[Injury to the plaintiff] is presumed when the defamatory statement takes the form of slander per se, one form of which is a statement that charges the defamed person with an 'indictable offense' upon conviction of which punishment may be inflicted, or with a 'serious crime.'\" (quoting Privitera, 79 A.D.2d at 3, 435 N.Y.S.2d at 404; Liberman, 80 N.Y.2d at 435, 590 N.Y.S.2d at 860, 605 N.E.2d at 347)). \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\"\n\nSecond, even were I inclined to apply this standard to these printed statements, the statements would still be considered libel per se under this more restrictive rule. The NYP argues that \"the words themselves must charge the plaintiff with a specific indictable offense\" and that \"none of the statements complained of even suggest that Jewell was responsible for the Olympic bombing, much less specifically charge Jewell with that crime.\" NYP Mem. at 18 (emphasis added). As to the argument that the statements do not \"specifically charge Jewell with that crime[,]\" the law does not require such an explicit statement for it to be considered actionable without proof of special damages: \"While slanderous language need not consist of the technical words of a criminal indictment, it is necessary that the language be reasonably susceptible to a connotation of criminality.\" Caffee, 104 A.D.2d at 353, 478 N.Y.S.2d at 685 (citation omitted) (emphasis added); see also Privitera, 79 A.D.2d at 5, 435 N.Y.S.2d at 405 (statements are not slanderous per se \"unless they specify a crime or a crime is readily apparent from properly pleaded innuendo \") (emphasis added).\n\nContrary to the NYP's assertions, many of the statements at issue are \"reasonably susceptible to a connotation of criminality\" and \"suggest that Jewell was responsible\" for the bombing: (1) \"We're pretty confident it's him, but we're most concerned with making sure our case is airtight[.] (August 1 Article; Smith Aff. Ex. D); (2) \"No charges have been filed, but probers say it may just be a matter of time. 'Obviously, his profile is right on,' the source said.\" (August 1 Article; Smith Aff. Ex. D); and (3) \"Another law-enforcement source said Jewell's arrest was not imminent. 'It's at least a matter of days,' the source said. There's a lot of stuff to go through.\" (August 2 Article; Smith Aff. Ex. F). Admittedly, these statements do not rise to the level of a direct statement that Jewell was guilty of the bombing. The governing standard, however, requires that the statements be \"reasonably susceptible to a connotation of criminality[,]\" Caffee, 104 A.D.2d at 353, 478 N.Y.S.2d at 685, or that the crime be \"readily apparent from properly pleaded innuendo.\" Privitera, 79 A.D.2d at 5, 435 N.Y.S.2d at 405. Read in context, there is no doubt that these statements concerned the bombing and, because they suggest that Jewell was responsible for a \"major act of terrorism\" in which at least one person was killed and hundreds of others were injured, are defamatory without an allegation of special damages. See Liberman, 80 N.Y.2d at 435, 590 N.Y.S.2d at 860, 605 N.E.2d at 347 (statements concerning murder are actionable as slander per se); see also Meyer v. Somlo, 105 A.D.2d 1007, 1007-08, 482 N.Y.S.2d 156, 157 (3d Dep't 1984) (statement that plaintiff was having an \"affair\" actionable as slander per se because it \"impute[s] the crime of adultery\" (citing Jordan v. Lewis, 20 A.D.2d 773, 247 N.Y.S.2d 650 (1964))).\n\nB. Work Performance\n\nThe NYP argues that the statements concerning Jewell's work history, mostly contained in the July 31 Column, are not actionable without pleading special damages because the statements do not injure Jewell in his profession. See NYP Mem. at 18. For the reasons that follow, I hold that the statements are actionable without pleading special damages.\n\nInitially, the NYP's argument appears to suffer from the same flaw as its argument with respect to criminal offenses; namely, it confuses libel and slander per se. The New York Court of Appeals has held that in order for a statement to be slanderous per se, it must specifically relate to a plaintiff's trade, business or profession:\n\nThat exception, however, is limited to defamation of a kind incompatible with the proper conduct of the business, trade, profession or office itself. The statement must be made with reference to a matter of significance and importance for that purpose, rather than a more general reflection upon plaintiff's character or qualities.\n\nLiberman, 80 N.Y.2d at 436, 590 N.Y.S.2d at 861, 605 N.E.2d at 348 (internal quotation marks and citation omitted); see also Aronson v. Wiersma, 65 N.Y.2d 592, 594, 493 N.Y.S.2d 1006, 1008, 483 N.E.2d 1138, 1140 (1985) (holding that statement was not slanderous per se because statement \"at worst, relates to a general reflection upon the plaintiff's character or qualities, not a matter of significance and importance and is not a defamation of a kind incompatible with the proper conduct of . . . [her] business.\") (internal quotation marks and citation omitted). Again, both of these cases involved, at least in pertinent part, slander, not libel. See Liberman, 80 N.Y.2d at 433-34, 590 N.Y.S.2d at 859-60, 605 N.E.2d at 346-47 (five causes of action, all for slander); Aronson, 65 N.Y.2d at 593-94, 493 N.Y.S.2d at 1007-08, 483 N.E.2d at 1139-40 (three causes of action, two sounding in libel, one in slander, with the language quoted above discussed in the slander context).\n\nAt the same time, some of the cases discuss both this category of slander and its specific requirements in the context of libel per se. This practice appears to have its origins in the following passage (quoted in part above in a parenthetical, but repeated herein, in full, to illustrate the specific point):\n\n\"A writing is defamatory[,] that is, actionable without allegation or proof of special damage if it tends to expose a person to hatred, contempt or aversion, or to induce an evil or unsavory opinion of him in the minds of a substantial number of the community, even though it may impute no moral turpitude to him.\" And to that listing of the defamatory should be added a writing which tends to disparage a person in the way of his office, profession or trade.\n\nNichols v. Item Publishers, Inc., 309 N.Y. 596, 600-01, 132 N.E.2d 860, 861-62 (1956) (quoting Mencher v. Chesley, 297 N.Y. 94, 100, 75 N.E.2d 257, 259 (1947)) (emphasis added). The separate delineation of the emphasized portion concerning profession or trade libel seems to have led to the importation of the slander per se standards discussed in Liberman and Aronson into the context of libel per se. See, e.g., Davis v. Ross, 754 F.2d 80, 82 (2d Cir. 1985) (quoting the emphasized portion of Nichols set forth above in a libel case); Golub, 89 N.Y.2d at 1076, 659 N.Y.S.2d at 837, 681 N.E.2d 1283 (addressing a claim for libel and citing both Liberman and Aronson for the applicable standard of whether a statement is actionable in the first instance, as opposed to whether it is actionable without proof of special damages); Lian v. Sedgwick James of N.Y., Inc., 992 F. Supp. 644, 649 (S.D.N.Y. Jan. 27, 1998) (addressing a libel claim and relying upon Nichols and Davis for the proper standard in a business, trade or profession case); Van-Go Transport Co. v. New York City Board of Ed., 971 F. Supp. 90, 98 (E.D.N.Y. 1997) (same but citing both Liberman and Aronson); Horne v. Matthews, 1997 U.S. Dist. LEXIS 14518, No. 97 Civ. 3605 (JSM), 1997 WL 598452, at * 2 (S.D.N.Y. Sept. 25, 1997) (same, citing Golub and Aronson and noting that both cases offer a slightly different articulation of the standard, referring, respectively, to \"apprehension\" as opposed to \"incompatibility\" with plaintiff's business). Moreover, Nichols (a libel case) contains language that pre-dates but predicts the holdings in Liberman and Aronson (slander cases). See 309 N.Y. at 601-02, 132 N.E.2d at 862 (dismissing action in part because nothing in the allegedly defamatory article \"reflected in any way on [plaintiff's] personal or professional integrity or ability\" and observing that the article did not assign a \"reason for [plaintiff's] removal or for the opposition to him by the 22 defendants, such as incompetency, misconduct or any other behavior that could be said to disparage him personally or in his profession\").\n\nIn light of Nichols, Golub and Davis, it appears that the standard for determining whether a statement concerning a plaintiff's business, profession or trade is libelous per se follows the same rules, articulated in Liberman and Aronson, as the standard for slander per se -- even though this runs counter to the theories explored in Ostrowe, Privitera and Matherson. Applying this standard, the Complaint satisfies it. In contrast to a \"general reflection upon plaintiff's character or qualities,\" the statements in the July 31 Column refer to matters \"incompatible with the proper conduct of [Jewell's] business, trade [or] profession.\" Without repeating what has already been discussed at some length, Peyser described Jewell as a \"failed\" sheriff's deputy, a \"disaster\" when he \"got another chance\" for \"tiny\" Piedmont College, a \"home-grown failure\" and as a \"disgraced former deputy and fired campus security guard.\" These statements, in addition to providing the overall context for other statements concerning Jewell's employment history, directly suggest that Jewell was not able to perform law enforcement jobs because he was a failure at those very jobs. In this sense they are more than general or abstract statements that Jewell was a failure, they specifically link Jewell's status as a \"failure\" and \"disaster\" to his past work history. See Afftrex, Ltd. v. General Electric Co., 161 A.D.2d 855, 856, 555 N.Y.S.2d 903, 904-05 (3d Dep't 1990) (statement that plaintiff was \"an evil man\" and that \"because of his being an evil man, he too was fired from his job\" held to be slanderous per se based upon the \"inextricable nexus\" between plaintiff's evilness and the fact that he was fired).\n\nSimilarly, the statements to the effect that Jewell was over-aggressive directly relate to his ability to perform his job because Cleere and Peyser expressed this view in a manner that linked this character trait to Jewell's purported inability: (1) describing Jewell as a \"fat, failed former sheriff's deputy\" who \"yearned to go further\" but who lost his job \"when he wrecked a squad car.\" (July 31 Column; Peyser Aff. Ex. E); (2) stating that Jewell was \"let go\" after he set up road blocks and \"hunted for people driving under the influence.\" (Id.); and (3) taking the position that after the bombing, the \"scary part\" was that Jewell, \"this disgraced former deputy and fired campus security guard, . . . was in charge.\" (Id.). The combination of these and the other statements discussed throughout this Opinion all suggest that Jewell was fired because he was too aggressive and did not perform his job competently. See July 31 Article; Smith Aff. Ex. A (\"Cleere said Jewell had been given the option of resigning or being fired in May because he was overly enthusiastic about his police duties and liked the limelight.\") (emphasis added). This is enough to establish the statements' defamatory qualities without pleading special damages. See Nichols, 309 N.Y. at 601, 132 N.E.2d at 862 (mere fact of removal from office not actionable unless publication \"contains an insinuation that the dismissal was for some misconduct\" (cited with approval in Davis, 754 F.2d at 84)).\n\nCONCLUSION\n\nFor the reasons set forth above, the NYP's motion is granted in part and denied in part.\n\nSO ORDERED:\n\nDATED: New York, New York\n\nSeptember 30, 1998\n\nLORETTA A. PRESKA, U.S.D.J.\n\nExhibit A\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nExhibit B\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nExhibit C\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nExhibit D\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nExhibit E\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\n\u003cspan class=\"fn\"\u003e1. The NYP articles at issue reported that two people were killed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. A copy of the complete text of the July 31 Column, as it appeared in the NYP, is annexed to this Opinion as Appendix A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The paragraph structure of the July 31 Column has been slightly altered in Jewell's complaint, but not in any manner that affects the outcome of the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. A copy of the complete text of the July 31 Article, as it appeared in the NYP, is annexed to this Opinion and Order as Appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Significantly, Jewell's complaint omits, without indication by use of ellipsis, the full text of this quote: \"'Obviously, his profile is right-on, but working out the details could take some time,' the source said.\" Smith Aff., Ex. D (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. A copy of the complete text of the August 1 Article and Headline, as they appeared in the NYP, is annexed to this Opinion and Order as Appendix C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This photograph and text is contained in the material annexed to this Opinion and Order as Appendix C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This cartoon is annexed to this Opinion and Order as Appendix D.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The version of this statement contained in the Complaint omits the language \"hero security guard.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. A copy of the complete text of the August 2 Article, as it appeared in the NYP, is annexed to this Opinion and Order as Exhibit E.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. A copy of the August 2 Photograph is contained in the material annexed to this Opinion and Order as Appendix E.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The NYP prepared a chart, annexed as Ex. B to the Affidavit of Slade R. Metcalf, sworn to on October 17, 1997 (\"Metcalf Aff.\"), setting forth with respect to each statement which defense, or combination of defenses, it is asserting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. As Judge Martin observed, although courts frequently merge the inquiries, the proper course is first to determine whether a statement is capable of conveying a defamatory meaning and then to determine whether it is libel per se or per quod. See Horne v. Matthews, 1997 U.S. Dist. LEXIS 14518, *6-7, No. 97 Civ. 3605 (JSM), 1997 WL 598452, at * 2 n.4 (S.D.N.Y. Sept. 25, 1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The July 31 Article and the July 31 Column were printed on adjoining pages of the NYP such that when opened, both the article and column could be viewed together as one would read two pages in a book. In addition, the July 31 Column begins on page three, the July 31 Article begins on page two and spills over onto page three.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Exhibit B to the Metcalf Aff. does not place this statement in the category of statements which the NYP alleges are not capable of a defamatory meaning. Nonetheless, the NYP argues just that in its moving memorandum of law. See NYP Mem. at 16. Because Jewell was thereby put on notice that the NYP was raising this defense with respect to this statement, I will address the NYP's arguments on this point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Jewell also appears to assert that the headline to the August 2 Article, which includes a reference to him as the \"TOP SUSPECT,\" libeled him. See Jewell Mem. at 11. Jewell's complaint, however, does not allege that the August 2 headline libeled him. Although this may seem like a hyper-technical reading of the complaint, Jewell knew how to allege that a headline libeled him because when he chose to make such an allegation he specifically included the headline in a separate numbered paragraph and separately defined it. See Complaint PP 41, 90 \u0026 103. Because he did not do so with respect to the August 2 headline, I do not consider it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The NYP also claims that various other statements are substantially, if not entirely, true. From the July 31 Column and August 1 Article, the NYP claims that the following statements are true: (1) Jewell was a \"former sheriff's deputy\" and \"former deputy;\" (2) Jewell \"was hired as a security guard for tiny Piedmont College;\" (3) investigators \"searched Jewell's apartment for hours and carted off boxes of possible evidence[;]\" and (4) Jewell \"was suspected of planting the bomb that killed two people and injured 110 others.\" See Metcalf Aff. Ex. B. As to these statements, Jewell does not argue that they are false, although they are pleaded as such in his Complaint. See Jewell Mem. at 10-12. Jewell appears to have drafted the Complaint by setting forth full quotes where only portions of the quotes are actually alleged to have libeled him. While the various portions of the quotes cited above are necessary to provide context, because Jewell does dispute their truth in this motion, and because there does not appear to be a valid basis for doing so, they are nonetheless not actionable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. At this stage of the litigation, the NYP does not attempt to establish which of the various constitutionally-enshrined states of mind plaintiff must prove in order to recover. See NYP Mem. at 9 n.5 \u0026 12. The NYP argues that such a resolution is not necessary in resolving the applicability of the republication defense. See id. Whether that is an accurate statement of the law is not entirely clear. See Karaduman v. Newsday, Inc., 51 N.Y.2d 531, 551, 435 N.Y.S.2d 556, 566, 416 N.E.2d 557, 566-67 (1980) (holding that \"the existence of the [republication] privilege\" does not depend on \"the status of the plaintiff against whom it is invoked[,]\" but that this status \"is relevant only in determining the degree of fault that must be established in order to defeat the privilege\") (emphasis added). In light of my ruling that there are material questions of fact as to certain threshold matters that have nothing to do with the requisite state of mind, I do not reach this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Significantly, this passage confirms that under these circumstances, both the statements of fact and opinion are actionable. Prior to Silsdorf, Justice Sullivan, writing for the First Department, addressed the same issue, and, while he endorsed a similar result, thought this to be true only for the underlying statements of fact. See Rand v. New York Times Co., 75 A.D.2d 417, 423, 430 N.Y.S.2d 271, 274 (1st Dep't 1980) (\"If the alleged facts which are stated as the basis of the opinion are false, [defendant], although immune from the expression of the opinion, would nevertheless be subject to liability for the false factual statements\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. On this particular point I note that Peyser's statements were published in what the NYP refers to as a column and that Peyser refers to herself as a columnist. See Peyser Aff. P 1. This stands in contrast to the articles published by Smith. A column may indeed be something of a hybrid, less of an opinion than a statement appearing on the op-ed page, but more opinionated than a traditional article. This thought, however, is nothing more than speculation as the NYP did not offer any evidence concerning the distinction, if any, between a column and an article.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. I note that although Von Gutfeld, in this passage, speaks to \"the cloak of credibility and authority of the particular newspaper \" (emphasis added), there is nothing in this record concerning the \"particular\" reputation of the NYP.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. There is one exception to this conclusion, Peyser's opinion that Jewell is \"fat\" does not imply that it is based upon undisclosed facts and, accordingly, is dismissed as a statement of pure opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. This 261-page statement is not attached to the Complaint or otherwise part of the record on this motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Significantly, Keller noted that under the standard articulated in Ollman, which the New York Court of Appeals has adopted, this result \"becomes even more apparent[.]\" 778 F.2d at 718 n.15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. For reasons I previously stated, see supra, note 22, the statement that Jewell is \"burly\" is a statement of opinion and contains no implication that it is based upon undisclosed facts. Accordingly, it is not actionable. The same is true of the statement that Jewell is a \"sick puppy.\" This statement is so charged with rhetoric as to suggest that there is no basis in fact that could either support or disprove it and, accordingly, it amounts to non-actionable epithet. See, e.g., Weiner v. Doubleday \u0026 Co., Inc., 142 A.D.2d 100, 105, 535 N.Y.S.2d 597, 600 (1st Dep't 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. This holding should not be read for the proposition that a newspaper publishing preliminary statements of officials investigating a crime is inevitably cast in liability. See Hairston v. Bancorp Inc., 20 Media L. Rep. 1600, 1992 WL 368789, at * 5 (Sup. Ct. N.Y. Co. Apr. 15, 1992) (discussing and quoting Florida Star v. B.J.F., 491 U.S. 524, 538, 105 L. Ed. 2d 443, 109 S. Ct. 2603 (1989), and noting that the Court \"has also endorsed the media's use of official sources with approval [and has indicated] that 'reliance on a news release is a paradigmatically routine newspaper reporting technique'\") (Cirparick, J.). First, I point out that the NYP has not argued that it relied on reports from official sources in publishing the statements at issue. Second, I emphasize the specific and narrow basis for this portion of my holding -- it denies the NYP's motion on the ground that these statements are not non-actionable statements of opinion. As noted above, see supra, note 18, the NYP has not moved on the ground that it lacked the requisite state of mind -- whether that be actual malice, gross irresponsibility or something else -- in publishing these statements. Whether such an argument may provide a valid defense to these charges is, therefore, an issue I do not reach.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. There is some question concerning whether the Court of Appeals was applying the incremental harm doctrine. The court itself, in three different statements, indicated that it was not. See Herbert, 781 F.2d at 311 (after discussing Simmons Ford at length, stating that \"a reasoned and different ground exists in this case for granting summary judgment on the remaining two statements\"); id. at 311 n.10 (\"Some may view our holding today as a variation of the 'libel-proof' doctrine, but we need not so characterize it.\"); id. at 312 (holding that summary judgment should have been granted as to the remaining two statements because \"their defamatory implications are not actionable\" and stating that \"we therefore need not decide whether a court can grant summary judgment on separate, unrelated statements, which may have been made with actual malice, pursuant to the incremental harm branch of the libel-proof doctrine\"). Nonetheless, perhaps because of the similarities between its reasoning and the Simmons Ford court's analysis, courts have cited Herbert in discussing the incremental harm defense. See, e.g., Masson v. New Yorker Magazine, Inc., 960 F.2d 896, 898 (9th Cir. 1992); Wilson v. Slatalla, 970 F. Supp. 405, 426 n.7 (E.D. Pa. 1997); Church of Scientology, 932 F. Supp. at 593-94; Galu v. Swissair: Swiss Air Transport Co., Ltd., 1987 U.S. Dist. LEXIS 12628, No. 86 Civ. 5551 (CSH), 1987 WL 15580, at * 5 (S.D.N.Y. Aug. 3, 1987). But see Masson v. New Yorker Magazine, Inc., 895 F.2d 1535, 1565-66 (9th Cir. 1989) (Kozinski, J., dissenting) (observing that in Herbert the Court of Appeals \"scrupulously avoids\" applying the incremental harm doctrine and that instead the court reached the \"quite unexceptional\" holding that otherwise actionable statements which imply the same view as non-actionable statements become not actionable), rev'd, 501 U.S. 496, 115 L. Ed. 2d 447, 111 S. Ct. 2419 (1991). In many respects, the Herbert court's ruling is an example of an application of the incremental harm doctrine in its purest, albeit slightly modified, form. Having found, with respect to nine of eleven statements, that defendants were entitled to summary judgment due to the absence of material fact on the question of actual malice, the court addressed two remaining statements which the district court did not dismiss. See Herbert, 781 F.2d at 309-10. As the quoted passage above makes clear, the court dismissed these two statements on the basis that they conveyed \"the same view\" and were \"simply an outgrowth of and subsidiary to\" the ideas conveyed in the nine dismissed statements. See id. at 312. In this sense, therefore, the purported harm suffered from these two statements was \"incremental\" to the harm suffered from the non-actionable statements because they conveyed the same meaning. But to speak of \"incremental\" harm in Herbert is misleading because the court found that the harm suffered was identical, as opposed to incremental. Nonetheless, this variation on the incremental harm doctrine has the same roots as the doctrine articulated by Judge Weinfeld in Simmons Ford ; namely, otherwise actionable statements are dismissed because there is no benefit, and indeed only detriment, in proceeding with them when the harm which flows therefrom is virtually (or as in Herbert, entirely) the same as the harm that flows from non-actionable statements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. As noted infra, the differences between the libel-proof plaintiff, substantial truth and incremental harm doctrines have generated a fair amount of discussion, but no simple resolutions. Here, the district court concluded that its instruction on substantial truth was proper and that neither the libel-proof plaintiff nor incremental harm doctrines warranted granting the defendant judgment notwithstanding the verdict. See Guccione, 632 F. Supp. at 322-24. The Court of Appeals reversed on the grounds that the jury instruction was not proper, that plaintiff's allegations were substantially true as a matter of law and that the libel-proof plaintiff doctrine applied. See Guccione, 800 F.2d at 302-04. The Court of Appeals did not address the incremental harm doctrine, but discussed Simmons Ford in the context of the libel-proof plaintiff doctrine. See id. Reading these two cases together, therefore, provides an important and interesting example of the interaction of the three doctrines.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. This absence of discussion at the state level of the related libel-proof plaintiff doctrine suggests that it, too, may need to be re-evaluated to determine whether it is compatible with New York law. The Court of Appeals first articulated it in Cardillo v. Doubleday \u0026 Co., Inc., 518 F.2d 638 (2d Cir. 1975), and did so in exclusively First Amendment terms. See id. at 639-40. Because Masson rejected any basis for grounding the incremental harm defense in federal constitutional terms, see 501 U.S. at 523, the libel-proof plaintiff doctrine seems similarly vulnerable. See, e.g., James A. Hemphill, Note, Libel-Proof Plaintiffs and the Question of Injury, 71 Tex. L. Rev. 401, 410 (1992) (characterizing the incremental harm doctrine as one of two branches of the libel-proof plaintiff doctrine and concluding that \"it will not be surprising\" if courts faced with the other branch hold that it also is not grounded in federal constitutional law because the reasoning in Masson applies to both branches equally); Evelyn A. Peyton, Comment, Rogues' Rights: The Constitutionality of the Libel-Proof Plaintiff Doctrine, 34 Santa Clara L. Rev. 179, 197 (1993) (\"The Court's decision in Masson seriously undercuts any [federal] constitutional justification for the libel-proof plaintiff doctrine.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. As an interesting aside, the relevant language of the California Constitution is remarkably similar to the language of the New York Constitution. Compare Cal. Const. art. I,  2, subdiv. (a) (\"Every person may freely speak, write and publish his or her sentiments on all subjects, being responsible for the abuse of this right. A law may not restrain or abridge liberty of speech or press.\") with N.Y. Const. art I,  8 (\"Every citizen may freely speak, write and publish his sentiments on all subjects, being responsible for the abuse of that right; and no law shall be passed to restrain or abridge the liberty of speech or of the press.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. With due respect, and for the reasons discussed infra, I would avoid linking the incremental harm and substantial truth doctrines. At other times, Judge Sack does the same. See Robert D. Sack \u0026 Sandra S. Baron, Libel, Slander, and Related Problems 37 (2d ed. Supp. 1997) (observing that while the doctrines are \"related . . . one does not necessarily imply the other and jurisdictions that do not recognize the 'incremental harm' rule nonetheless universally adopt that of substantial truth\"). Notwithstanding the differences that may exist, as Judge Sack observed, the underlying policy reasons for the two doctrines may flow from the same concerns. See id. at 86 (\"The incremental harm and substantial truth doctrines may be two ways of giving effect to the same idea: that, in light of the values of free speech that are implicated, a relatively minor defamatory inaccuracy does not, as a matter of law, do significant enough damage to plaintiff's reputation for the law to provide compensation for it.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. I have already held that Mr. Pugliese's statements are not actionable because, respectively, one is not capable of a defamatory meaning, see supra Part III, and the other is an expression of pure opinion. See supra Part VI. As a result, I do not consider these statements in this portion of the Opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Unlike all of the other defenses asserted by the NYP thus far, as to this argument, the NYP does not address particular statements. See Metcalf Aff. Ex. B. Instead, the NYP appears to argue that all of the statements are not libelous per se. Because the NYP has not raised this argument with respect to individual statements, I, too, do not address the argument in that manner. Instead, I will address, as the NYP does, what can fairly be characterized as the general import of the various statements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. As the New York Court of Appeals recognized, but did not conclusively resolve, the presumed damages that flow from a finding that a statement is defamatory per se have been found unconstitutional in certain First Amendment cases. See Liberman v. Gelstein, 80 N.Y.2d 429, 435 n.1, 590 N.Y.S.2d 857, 861, n.1, 605 N.E.2d 344, 348 n.1 (1992) (citing Gertz v. Robert Welch, Inc., 418 U.S. 323, 349, 41 L. Ed. 2d 789, 94 S. Ct. 2997 (1974)); see also Harris v. Hirsh, 228 A.D.2d 206, 209, 643 N.Y.S.2d 556, 559 (1st Dep't) (recognizing that in Liberman, Chief Judge Kaye \"foreshadowed the possible demise of the slander per se rule\"), leave to appeal denied, 89 N.Y.2d 805, 653 N.Y.S.2d 917, 676 N.E.2d 499 (1996). After Gertz, \"the law restricts compensation to 'actual injury' and does not permit a presumption of damaged reputation unless it can be shown that publication was with 'knowledge of falsity or reckless disregard for the truth [i.e., actual malice].'\" Salomone v. MacMillan Publishing Co., 77 A.D.2d 501, 502, 429 N.Y.S.2d 441, 443 (1st Dep't 1980) (quoting Gertz, 418 U.S. at 349). The Supreme Court subsequently retreated from a portion of its holding in Gertz. See Dun \u0026 Bradstreet v. Greenmoss Builders, Inc., 472 U.S. 749, 86 L. Ed. 2d 593, 105 S. Ct. 2939 (1985) (holding that the prohibition on recovery of presumed damages does not apply to private-figure plaintiffs in matters that do not involve public concerns); see also Davis v. Ross, 107 F.R.D. 326, 329 (1985) (discussing the history of presumed damages under New York law and the implications of Gertz and Dun \u0026 Bradstreet (cited with approval in Dalbec v. Gentleman's Companion, Inc., 828 F.2d 921, 926-27 (2d Cir. 1987) (same))); 60 Minute Man, Ltd. v. Kossman, 161 A.D.2d 574, 575-76, 555 N.Y.S.2d 152, 154 (2d Dep't 1990) (same). As noted supra, I have not resolved what state of mind plaintiff must prove in order to prevail because neither side has argued that such a resolution is necessary on this motion. Perhaps accordingly, neither side has addressed the implications of Gertz and Dun \u0026 Bradstreet in the context of presumed damages. Regardless, Gertz does not appear to moot the per se analysis I engage in herein because if plaintiff proceeds on this basis, Gertz provides that plaintiff may only do so if plaintiff proves actual malice. See Davis, 107 F.R.D. at 329; Salomone, 77 A.D.2d at 502, 429 N.Y.S.2d at 443. Again, I emphasize that I do not resolve this matter conclusively at this time, I only raise this point to be clear that the question of whether plaintiff's complaint alleges libel per se is not moot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. To be clear, I wish to emphasize an important distinction. The point of this discussion is to stress that Liberman 's more restrictive standard for slander per se should not apply to libel per se cases. Of course, because Liberman imposes a higher standard, to the extent a libel plaintiff is able to meet that higher standard, the plaintiff may proceed without proving special damages.\u003c/span\u003e\n\n",
    "body_length": 208424,
    "citedas": [
      "23 F. Supp. 2d 348"
    ],
    "attorneys": "For Plaintiff: Mark E. Goidell, Esq., GALASSO, LANGIONE \u0026 GOIDELL, Melville, New York. , For Plaintiff: Wayne Grant, Esq., WOOD \u0026 GRANT, Atlanta, Georgia. , For Defendant: Slade R. Metcalf, Esq., Melissa Georges, Esq., SQUADRON, ELLENOFF, PLESENT, \u0026 SHEINFELD, LLP, New York, New York. LORETTA A. PRESKA, United States District Judge.",
    "category": [
      "124",
      "242",
      "251",
      "36"
    ],
    "judges": "LORETTA A. PRESKA, United States District Judge:",
    "citation_count": 0
  }
}
