{
  "id": "QMwkYWYBTlTomsSBYKYc",
  "document": {
    "title": "06/26/85 UTAH COUNTY v. INTERMOUNTAIN HEALTH CARE",
    "full_title": "UTAH COUNTY, A BODY POLITIC, BY AND THROUGH THE COUNTY BOARD OF EQUALIZATION OF UTAH COUNTY, STATE OF UTAH v. INTERMOUNTAIN HEALTH CARE, INC., AND TAX COMMISSION OF THE STATE OF UTAH .",
    "jurisdiction": "Utah Supreme Court",
    "date": "1985-06-26T00:00:00.000Z",
    "docket": "No. 17699",
    "body": "DURHAM, Justice: Utah County seeks review of a decision of the Utah State Tax Commission reversing at ruling of the Utah County Board of Equalization. The Tax Commission exempted Utah Valley Hospital, owned and operated by Intermountain Health Care (IHC), and American Fork Hospital, leased and operated by IHC, from ad valorem property taxes. At issue is whether such a tax exemption is constitutionally permissible. We hold that, on the facts in this record, it is not, and we reverse.\n\nAmici curiae have entered the case. St. Mark's Hospital and Holy Cross Hospital have filed briefs supporting IHC's position, and Salt Lake County has filed a brief supporting that of Utah County. Pathology Associates Laboratories (PAL) supports Utah County and argues that allowing nonprofit hospitals such as those operated by IHC to enjoy a tax exemption, in addition to their nonprofit status, gives them an unfair advantage over competitors such as PAL, a for-profit corporation. By minute entry of this Court, IHC's motion to strike the brief of PAL was granted to the extent that the brief deals with factual issues not raised in the proceedings below. We set forth hereafter those pertinent facts that have been established in the somewhat limited record before us.\n\nIHC is a nonprofit corporation that owns and operates or leases and operates twenty-one hospitals throughout the intermountain area, including Utah Valley Hospital and American Fork Hospital. IHC also owns other subsidiaries, including at least one for-profit entity. It is supervised by a board of trustees who serve without pay. It has no stock, and no dividends or pecuniary profits are paid to its trustees or incorporators. Upon dissolution of the corporation, no part of its assets can inure to the benefit of any private person.\n\nIHC's policy with respect to all of its hospitals is to make charges to patients for hospital services whenever it is possible to do so. Hospital charges are paid either by patients, by private insurance companies such as Blue Cross and Blue Shield, or by governmental programs such as Medicare and Medicaid. IHC and its individual hospitals also are the recipients of private bequests, endowments, and contributions in amounts not established in the record.\n\nUtah County seeks the resolution of two issues: (1) Whether U.C.A., 1953, §§ 59-2-30 (1974) and 59-2-31 (1974), \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e which exempt from taxation hospitals meeting certain requirements, constitute an unconstitutional expansion of the charitable exemption in article XIII, section 2 of the Utah Constitution; and (2) whether Utah Valley Hospital and American Fork Hospital are exempt from taxation under article XIII, section 2 of the Utah Constitution.\n\nUtah County does not seriously dispute that the two hospitals in this case comply with sections 59-2-30 and 59-2-31, but contends instead that these statutes unlawfully expand the charitable exemption granted by article XIII, section 2 of the Utah Constitution (1895, amended 1982), which provides in pertinent part:\n\nThe property of the state, cities, counties, towns, school districts, municipal corporations and public libraries, lots with the buildings thereon used exclusively for either religious worship or charitable purposes,... shall be exempt from taxation.\n\nIn ruling upon the validity of a statute which purports to define the meaning of a constitutional provision, we are obligated to scrutinize the language of the Constitution with considerable care. It is true, as explained in Justice Howe's Dissent, that a significant degree of deference is due to a legislative construction of the meaning of a constitutional term. But his opinion itself, in accord with well-established principles of judicial review, acknowledges that this Court's obligation is to serve as the \"final arbiter\" of the question of what constitutes \"charitable purposes.\" \"Section 2 of art. XIII grants a charitable exemption and our statutes cannot expand or limit the scope of the exemption or defeat it. To the extent the statutes have that effect, they are not valid.\" Loyal Order of Moose, #259 v. County Board of Equalization, Utah, 657 P.2d 257, 261 (1982) (emphasis in the original). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe power of state and local governments to levy property taxes has traditionally been limited by constitutional and statutory provisions such as those at issue in this case that exempt certain property from taxation. These exemptions confer an indirect subsidy and are usually justified as the quid pro quo for charitable entities undertaking functions and services that the state would otherwise be required to perform. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nA concurrent rationale, used by some courts, is the assertion that the exemptions are granted not only because charitable entities relieve government of a burden, but also because their activities enhance beneficial community values or goals. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Under this theory, the benefits received by the community are believed to offset the revenue lost by reason of the exemption.\n\nA consideration of the reasons for exemption provisions is important in determining the proper standards under which they should be reviewed.\n\nA liberal construction of exemption provisions results in the loss of a major source of municipal revenue and places a greater burden on nonexempt taxpayers, thus, these provisions have generally been strictly construed. For the same reasons parties seeking an exemption bear the burden of proving their entitlement to it. The doctrine of strict construction and the difficulties taxpayers have in bearing the burden of proof explain why taxation has been the rule and exemption has been the exception. In some jurisdictions, however, the doctrine of strict construction has been eroding. Courts in these jurisdictions pay \"lip service\" to the doctrine but fail to apply it to exemption provisions.\n\nComment, Real Estate Tax Exemption for Federally Subsidized Housing Corporations, 64 Minn. L. Rev. 1094, 1096-97 (1980) (footnotes omitted). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nUnlike the courts described in the foregoing comment, this Court recently reaffirmed its commitment to the doctrine of strict construction as applied to the charitable exemption provision contained in the Utah Constitution. In Loyal Order of Moose, 657 P.2d at 264, we determined that the clause exempting property \"used exclusively for... charitable purposes\" is to be strictly construed, Utah Const. art. XIII, § 2. Accord Salt Lake County v. Tax Commission ex rel. Laborers Local No. 295, Utah, 658 P.2d 1192, 1194 (1983).\n\nAn entity may be granted a charitable tax exemption for its property under the Utah Constitution only if it meets the definition of a \"charity\" or it its property is used exclusively for \"charitable\" purposes. Essential to this definition is the element of gift to the community.\n\nCharity is the contribution or dedication of something of value... to the common good.... By exempting property used for charitable purposes, the constitutional convention sought to encourage individual or group sacrifice for the welfare of the community. An essential element of charity is an act of giving.\n\nSalt Lake County v. Tax Commission ex rel. Greater Salt Lake Recreational Facilities, Utah, 596 P.2d 641, 643 (1979) (emphasis added). A gift to the community can be identified either by a substantial imbalance in the exchange between the charity and the recipient of its services or in the lessening of a government burden through the charity's operation. Laborers Local No. 295, 658 P.2d at 1198 (Oaks, J., Concurring). In Friendship Manor Corp. v. Tax Commission, 26 Utah 2d 227, 487 P.2d 1272 (1971), this Court declined to exempt from taxation property used as a home for the elderly because the alleged givers of the charity also constituted its sole beneficiaries. We were unable in that case to find any gift to the general public. We there quoted with approval United Presbyterian Association v. Board of County Commissioners, 167 Colo. 485, 503, 448, P.2d 967, 976 (1968): \"here material reciprocity between alleged recipients and their alleged donor exists--then charity does not.\" Friendship Manor, 26 Utah 2d at 238, 487 P.2d at 1279. Similarly, in Laborers Local No. 295, 658 P.2d at 1196, we held that a union was not entitled to a tax exemption for condominium office space because the primary purpose of this use was to benefit union members, and there was no gift to the general public.\n\nGiven the complexities of institutional organization, financing, and impact on modern community life, there are a number of factors which must be weighed in determining whether a particular institution is in fact using its property \"exclusively for... charitable purposes.\" Utah Const. art. XIII, § 2 (1895, amended 1982). These factors are: (1) whether the stated purpose of the entity is to provide a significant service to others without immediate expectation of material reward; (2) whether the entity is supported, and to what extent, by donations and gifts; (3) whether the recipients of the \"charity\" are required to pay for the assistance received, in whole or in part; (4) whether the income received from all sources (gifts, donations, and payment from recipients) produces a \"profit\" to the entity in the sense that the income exceeds operating and long-term maintenance expenses; (5) whether the beneficiaries of the \"charity\" are restricted or unrestricted and, if restricted, whether the restriction bears a reasonable relationship to the entity's charitable objectives; and (6) whether dividends or some other form of financial benefit, or assets upon dissolution, are available to private interest, and whether the entity is organized and operated so that any commercial activities are subordinate or incidental to charitable ones. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e These factors provide, we believe, useful guidelines for our analysis of whether a charitable purpose or gift exists in any particular case. We emphasize that each case must be decided on its own facts, and the foregoing factors are not all of equal significance, nor must an institution always qualify under all six before it will be eligible for an exemption.\n\nBecause the \"care of the sick\" has traditionally been an activity regarded as charitable in American law, and because the Dissenting opinions rely upon decisions from other jurisdictions that in turn incorporate unexamined assumptions about the fundamental nature of hospital-based medical care, we deem it important to scrutinize the contemporary social and economic context of such care. We are convinced that traditional assumptions bear little relationship to the economics of the medical-industrial complex of the 1980's. Nonprofit hospitals were traditionally treated as tax-exempt charitable institutions because, until late in the 19th century, they were true charities providing custodial care for those who were both sick and poor. The hospitals' income was derived largely or entirely from voluntary charitable donations, not government subsidies, taxes, or patient fees. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The function and status of hospitals began to change in the late 19th century; the transformation was substantially completed by the 1920's. \"From charities, dependent on voluntary gifts, developed into market institutions financed increasingly out of payments from patients.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The transformation was multidimensional: hospitals were redefined from social welfare to medical treatment institutions; their charitable foundation was replaced by a business basis; and their orientation shifted to \"professionals, and their patients,\" away from \"patrons and the poor.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe magnitude and character of the change in hospital care is suggested by a number of factors. (1) The social composition of hospital patients appears to have changed until by the early 20th century it became quite similar to the population at large. Paul Starr, The Social Transformation of American Medicine at 159 (1982). The change in hospital architecture (large wards were replaced with private rooms) suggests the same movement away from the poor to paying patients. Id. (2) The number and percentage of paying patients increased as did the percentage of revenue derived from patient fees. This revenue amounted to over 65 percent for general hospitals in the country as a whole by 1922. Public appropriations amounted to about 18 percent; endowment income amounted to 3.6 percent; and donations added 5.7 percent. Id. at 161. (3) The practice of not permitting physicians to charge private patients for their services in hospitals was abandoned during this period. In 1880, according to one study, no hospital permitted physician fees. By 1905, 47 of 52 New England hospitals surveyed permitted physicians to charge for services to private patients. Id. at 163-64. (4) Before 1880, less than 2 percent of physicians had hospital privileges; by 1933, 5 of 6 physicians had hospital privileges. Id. at 162, 167. (5) The number of hospitals increased, according to census figures, from 178 in 1872 to over 4,000 in 1910. Id. at 169. (6) Between 1890 and 1920 there was a substantial growth in for-profit hospitals, organized by physicians and corporations, as the opportunity for profit in the hospital business improved. Id. at 170. All of the above factors indicate a substantial change in the nature of the hospital; a part of that change was the gradual disappearance of the traditional charitable hospital for the poor.\n\nAlso of considerable significance to our review is the increasing irrelevance of the distinction between nonprofit and for-profit hospitals for purposes of discovering the element of charity in their operations. The literature indicates that two models, described below, appear to describe a large number of nonprofit hospitals as they function today. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n(1) The \"physicians' cooperative\" model describes nonprofit hospitals that operate primarily for the benefit of the participating physicians. Physicians, pursuant to this model, enjoy power and high income through their direct or indirect control over the nonprofit hospitals to which they bring their patients. The nonprofit form is believed to facilitate the control by physicians better than the for-profit form. Pauley \u0026 Redisch, The Not-For-Profit Hospital as a Physicians' Co-operative, 63 Am. Econ. Rev. 87, 88-89 (1973). This model has also been called the \"exploitation hypothesis\" because the physician \"income maximizing\" system is hidden behind the nonprofit facade of the hospital. Clark, Does the Nonprofit Form Fit the Hospital Industry?, 93 Harv. L. Rev. 1416, 1436-37 (1980). A minor variation of the above theory is the argument that many nonprofit hospitals operate as \"shelters\" within which physicians operate profitable businesses, such as laboratories. Starr, (supra) , at 438.\n\n(2) The \"polycorporate enterprise\" model describes the increasing number of nonprofit hospital chains. Here, power is largely in the hands of administrators, not physicians. Through the creation of holding companies, nonprofit hospitals have grown into large groups of medical enterprises, containing both for-profit and nonprofit corporate entities. Nonprofit corporations can own for-profit corporations without losing their federal nonprofit tax status as long as the profits of the for-profit corporations are used to further the nonprofit purposes of the parent organization. Id. at 437. (IHC owns at least one for-profit subsidiary.) The emergence of hospital organizations with both for-profit and nonprofit components has increasingly destroyed the charitable pretentions of nonprofit organizations: \"The extension of the voluntary hospital into profit-making businesses and the penetration of other corporations into the hospital signal the breakdown of the traditional boundaries of voluntarism. Increasingly, the polycorporate hospitals are likely to become multihospital systems and competitors with profit-making chains, HMO's and other health care corporations.\" Id. at 438.\n\nThe foregoing Discussion of the economic environment in which modern hospitals function is critical to our analysis in this case because it is an analysis which is generally not present in any of the cases relied upon by the Dissenting opinions. Those cases, in our view, do not take into account the revolution in health care that has transformed a \"healing profession\" into an enormous and complex industry, employing millions of people and accounting for a substantial proportion of our gross national product. Dramatic advances in medical knowledge and technology have resulted in an equally dramatic rise in the cost of medical services. At the same time, elaborate and comprehensive organizations of third-party payers have evolved. Most recently, perhaps as a further evolutionary response to the unceasing rise in the cost of medical services, the provision of such services has become a highly competitive business. Furthermore, even the more recent cases cited by the Dissenting opinions contradict the rule this Court has adopted strictly construing our constitutional provision, Loyal Order of Moose, 657 P.2d at 264, and requiring every charity to show an element of gift. Community Memorial Hospital v. City of Moberly, Mo., 422 S.W.2d 290 (1967), as an example, contains no mention of the element of gift that this Court has held crucial to the meaning of charity. It appears that the hospital in Moberly was granted its tax exemption largely on the basis of its nonprofit structure, for the Missouri court held it of no account that the hospital gave charity in an amount less than 1.4 percent of the amount collected from paying patients, that this so-called \"charity\" included some bad debts, and that for four of the eight years at issue no charity at all was given by the hospital. Id. 422 S.W.2d at 293. Similarly, Vick v. Cleveland Memorial Foundation, 2 Ohio St. 2d 30, 206, N.E.2d 2 (1965), does not insist on identifying the element of gift in an organization's practices before it can be held to be a charity. Both Moberly and Vick, as well as other cases cited in the Dissents, are therefore inconsistent with the holdings of this Court. See Laborers Local No. 295, 658 P.2d 1192; Greater Salt Lake Recreational Facilities, 596 P.2d 641; Friendship Manor, 26 Utah 2d 227, 487 P.2d 1272.\n\nHaving discussed the standards for the application of Utah's constitutional exemption for property used for charitable purposes, and the economic and historic context in which we conduct this review, we now examine the record respecting the two hospitals (\"the defendants\") whose eligibility has been challenged by Utah County. We note that this examination focuses exclusively on what the record before us demonstrates regarding these two hospitals, and only these hospitals. The policies, practices, and structure of Intermountain Health Care, Inc., are relevant to this examination insofar as they have been shown in this case to affect the operations of these hospitals. Evidence concerning the functions and operations of other hospitals in the IHC system appears to be entirely irrelevant, as the exempt status of the property used by those hospitals is not now before us.\n\nThe stated purpose of IHC regarding the operation of both hospitals clearly meets at least part of the first criterion we have articulated for determining the existence of a charitable use. Its articles of incorporation identify as \"corporate purposes,\" among other things, the provision of \"care and treatment of the sick, afflicted, infirm, aged or injured within and/or without the State of Utah.\" The same section prevents any \"part of the net earnings of this Corporation\" to inure to the private benefit of any individual. Furthermore, under another section, the assets of the corporation upon dissolution likewise may not be distributed to any private interest.\n\nThe second factor we examine is whether the hospitals are supported, and to what extent, by donations and gifts. The findings of the Tax Commission are ambiguously worded in regard to this element, since they do not make any distinction between patient charges, third-party payments from private insurers and government entitlement programs, and \"gifts (wills, endowments and contributions).\" The finding reads: \"The sources of revenue of IHC are derived primarily from patient charges, third parties (Blue Cross, Blue Shield, Medicare, Medicaid), and gifts (wills, endowments and contributions).\" Therefore, we have examined the testimony and exhibits in evidence on this question. The latter demonstrate that current operating expenses for both hospitals are covered almost entirely by revenue from patient charges. Although a substantial donation to capital was identified in the case of Utah Valley Hospital, there was no demonstration of the impact of that donation on the current support, maintenance, and operation of that hospital in the tax year in question in this lawsuit. The evidence was that both hospitals charge rates for their services comparable to rates being charged by other similar entities, and no showing was made that the donations identified resulted in charges to patients below prevailing market rates. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Presumably such differentials, if they exist, could be quantified and introduced into evidence. The defendants have failed to provide such evidence, and it is they who bear the burden of showing their eligibility for exemption. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nJustice Stewart's Dissenting opinion argues that the element of charitable giving from private donors and benefactors to a nonprofit entity, without more, satisfies the requirement of \"gift\" in the definition of \"charitable purpose\" under the Utah Constitution. Although that argument is attractive, we believe that it is inconsistent with our precedent, the language of the Constitution, and public policy. Many institutions are largely or partly created and supported by gifts, but do not therefore automatically qualify for tax exemptions for their property. Examples might include private, nonprofit schools, museums, research organizations, libraries, planetariums, zoos, scientific consulting groups, environmental research agencies, professional associations, and so forth.\n\nOne of the most significant of the factors to be considered in review of a claimed exemption is the third we identified: whether the recipients of the services of an entity are required to pay for that assistance, in whole or in part. The Tax Commission in this case found as follows:\n\nThe policy of [IHC's hospitals] is to collect hospital charges from patients whenever it is reasonable and possible to do so; however, no person in need of medical attention is denied care solely on the basis of a lack of funds.\n\nThe record also shows that neither of the hospitals in this case demonstrated any substantial imbalance between the value of the services it provides and the payments it receives apart from any gifts, donations, or endowments. The record shows that the vast majority of the services provided by these two hospitals are paid for by government programs, private insurance companies, or the individuals receiving care. Collection of such remuneration does not constitute giving, but is a mere reciprocal exchange of services for money. Between 1978 and 1980, the value of the services given away as charity by these two hospitals constituted less than one percent of their gross revenues. Furthermore, the record also shows that such free service as did exist was deliberately not advertised out of fear of a \"deluge of people\" trying to take advantage of it. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Instead, every effort was made to recover payment for services rendered. Utah Valley Hospital even offered assistance to patients who claimed inability to pay to enter into bank loan agreements to finance their hospital expenses.\n\nThe defendants argue that the great expense of modern hospital care and the universal availability of insurance and government health care subsidies make the idea of a hospital solely supported by philanthropy an anachronism. We believe this argument itself exposes the weakness in the defendants' position. It is precisely because such a vast system of third-party payers has developed to meet the expense of modern hospital care that the historical distinction between for-profit and nonprofit hospitals has eroded. For-profit hospitals provided many of the same primary care services as do those hospitals organized as nonprofit entities. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e They do so at similar rates as those charged by defendants. The doctors and administrators of nonprofit hospitals have the same opportunity for personal remuneration for their services as do their counterparts in for-profit hospitals. See Georgia Osteopathic Hospital, Inc. v. Alford, 217 Ga. 663, 665, 124 S.E.2d 402, 403 (1962).\n\nThe Dissent of Justice Stewart suggests that the fact that \"ability to pay\" is not a criterion for admission to IHC's facilities is dispositive of the question of \"charitable purpose,\" regardless of the actual amount of free care provided therein. This argument overlooks the fact that for-profit institutions may well implement similar policies, either for public relations reasons or by virtue of regulations mandated by their receipt of federal- or state-funded payments. Institutions constructed with Hill-Burton funds, for example, were required to provide free care to qualify under that act. Furthermore, many for-profit service providers both provide free care and write off \"bad debts,\" thereby satisfying this criterion. The Dissent's reasoning would therefore require that any health care provider that accepted patients regardless of ability to pay be deemed eligible for a charitable exemption unless the for-profit/nonprofit distinction is to become the sole means of identifying \"charitable purposes\" under the Utah Constitution. This Court rejected that unilateral test in William Budge Memorial Hospital v. Maughan, 79 Utah 516, 3 P.2d 258 (1931), and we are not persuaded that we should adopt it now.\n\nThe fourth question we consider is whether the income received from all sources by these IHC hospitals is in excess of their operating and maintenance expenses. Because the vast majority of their services are paid for, the nonprofit hospitals in this case accumulate capital as do their profit-seeking counterparts. The record indicates that this accumulated capital is used for the construction of additional hospitals and other facilities throughout the IHC system and the provision of expanded services. The record before us is undeveloped on this point, but there is nothing therein to indicate that the capital accumulated by either of the defendant hospitals is even earmarked in any way for use in their facilities or even in Utah County. In view of the fact that Intermountain Health Care owns and operates facilities, for-profit and nonprofit, throughout this state and in other states, we are particularly concerned that there is no showing on the record that surplus funds generated by one hospital in the system will not be utilized for the benefit of facilities in other counties, outside the state of Utah, or purely for administrative costs of the system itself.\n\nIndeed, it is difficult to see a significant difference between the operation (as opposed to the form of corporate structure) of defendants' facilities and the operation of the for-profit hospital in Budge, where William Budge Memorial Hospital had a similar policy of collecting charges, in all cases where it was possible, for the services and accommodations furnished its patients. 79 Utah at 521, 3 P.2d at 260. In Budge, we were unable to find a single distinctive charitable feature that marked Budge Memorial as a charitable institution, even though no benefits or profit had ever actually been distributed to or received by the shareholders of the owner corporation. 79 Utah at 528, 3 P.2d at 263. The only apparent difference between Budge Memorial and the defendants is that the hospitals in this case have adopted a nonprofit corporate format in their legal organization. Yet Budge decisively rejected, as we have already noted, the contention that all nonprofit corporations are entitled to a charitable exemption for purposes of property taxes. See also Friendship Manor, 26 Utah 2d at 239, 487 P.2d at 1280; Greater Salt Lake Recreational Facilities, 596 P.2d at 644. The significant difference between for-profit and nonprofit hospital corporations is, in effect, the method of distribution of assets upon dissolution of the corporation, which is itself a rate occurrence.\n\nA large portion of the profits of most for-profit entities is used for capital improvements and new, updated equipment, and the defendant hospitals here similarly expend their revenues in excess of operational expenses. There can be no doubt, in reviewing the references in the record by members of IHC's administrative staff, that the IHC system, as well as the two hospitals in question, has consistently generated sufficient funds in excess of operating costs to contribute to rapid and extensive growth, building, competitive employee and professional salaries and benefits, and a very sophisticated management structure. While it is true that no financial benefits or profits are available to private interests in the form of stockholder distributions or ownership advantages, the user entity in this case clearly generates substantial \"profits\" in the sense of income that exceeds expenses. This observation is not intended to imply that an institution must consume its assets in order to be eligible for tax exemption--the requirement of charitable giving may obviously be met before that point is reached. However, there is a serious question regarding the constitutional propriety of subsidies from Utah County taxpayers being used to give certain entities a substantial competitive edge in what is essentially a commercial marketplace. None of the defendants in this case made any effort to demonstrate that they would suffer any operating losses or have to discontinue any services if they are ineligible for exemption from property taxes. Justice Stewart's assertion that the taxes levied by the county would have to be passed on to patients in the form of higher charges is without any foundation in the evidence. The far more logical assumption is that growth of the IHC system would possibly be slowed, but there is no indication of a likelihood that current and future levels of care would be jeopardized.\n\nThe final two factors we address are whether the beneficiaries of the services of the defendants are \"restricted\" in any way and whether private interests are benefited by the organization or operation of the defendants. Although the policy of IHC is to impose no restrictions, there were some incidents recounted in the testimony which suggested that these institutions do not see themselves as being in the business of providing hospital care \"for the poor,\" an activity which was certainly at the heart of the original rationale for tax exemptions for charitable hospitals. Otherwise, it appears that they meet this criterion. On the question of benefits to private interests, certainly it appears that no individuals who are employed by or administer the defendants receive any distribution of assets or income, and some, such as IHC's board of trustees members, volunteer their services. We have noted, however, that IHC owns a for-profit entity, as well as nonprofit subsidiaries, and there is in addition the consideration that numerous forms of private commercial enterprise, such as pharmacies, laboratories, and contracts for medical services, are conducted as a necessary part of the defendants' hospital operations. The burden being on the taxpayer to demonstrate eligibility for the exemption, the inadequacies in the record on these questions cannot be remedied by speculation in the defendants' favor.\n\nIn summary, after reviewing the facts in this case in light of the factors we have identified, we believe that the defendants in this case confuse the element of gift to the community, which an entity must demonstrate in order to qualify as a charity under our Constitution, with the concept of community benefit, which any of countless private enterprises might provide. We have no quarrel with the assertion that Utah Valley Hospital and American Fork Hospital meet great and important needs of persons within their communities for medical care. Yet this meeting of a public need by a provision of services cannot be the sole distinguishing characteristic that leads to an automatic property tax exemption. \"he usefulness of an enterprise is not sufficient basis for relief from the burden of sharing essential costs of local government.\" In re Marple Newton School District, 39 Pa. Commw. 326, 336, 395 A.2d 1023, 1028 (1978). Such a \"usefulness\" rule would have to be equally applied to for-profit hospitals and privately owned health care entities, which also provide medical services to their patients. We note, for example, that the increasing emphasis on competition in health care services is resulting in significant expansion of the activities and roles of health care providers generally, including hospitals, both for-profit and nonprofit. Laboratory services, pharmaceutical services, \"birthing\" centers, and outpatient surgical units are becoming common adjuncts to traditional hospital care. It would be impossible to justify a distinction, within the constitutional boundaries of \"charitable\" activities, between outpatient surgical services, for example, provided on property owned by an IHC hospital and those provided on privately owned property, where both are identical and are remunerated at the same rate. As we have pointed out, there was no showing in the record that either of the hospitals in question uses billing rates which differ materially from rates charged for the same services by for-profit hospitals, or that the defendants' rates or services would change if they were required to pay county property taxes.\n\nFurthermore, if the \"importance\" of the public benefit resulting from the operation of an enterprise were to become the primary constitutional test for a charitable purpose, as the Dissents imply, this Court would be required to accomplish the impossible task of determining the relative value to the public or to the community of any function performed by any entity and its consequent entitlement to a \"charitable\" tax exemption. See Loyal Order of Moose, 657 P.2d at 263-64. This cannot be the rule under our precedents established in Loyal Order of Moose, 657 P.2d 257, and Laborers Local No. 295, 658 P.2d 1192. It may very well be, as a matter of public policy, that all hospitals, for-profit and nonprofit, should be granted a tax exemption because of the great public need they serve. But it is beyond the power of the Legislature to grant such a public policy-based exemption under the language of the Utah Constitution as it now reads. This Court has clearly and recently affirmed the necessity of identifying the element of \"gift,\" a nonreciprocal contribution to the community. Laborers Local No. 295, 658 P.2d at 1195. The Dissenting opinions fail to acknowledge that, however worthy the principles of public policy they articulate may be, the standards they advocate would require us to overrule or ignore both the construction given to the \"charitable purpose\" language in the past by this Court and the strict analytical approach we have used in such construction. Under these circumstances, the extensive references to authority from other jurisdictions in the Dissent are not persuasive on the question before us; they would only become so if we were to contemplate abandonment of our own precedent, an approach that is not openly sought here by either the defendants or the Dissenting members of the Court.\n\nNeither can we find on this record that the burdens of government are substantially lessened as a result of the defendants' provision of services. The record indicates that Utah County budgets approximately $50,000 annually for the payment of hospital care for indigents. Furthermore, the evidence described two instances within a three-month period where, after a Utah County official had declined to authorize payment for a person in the emergency room, Utah Valley Hospital refused to admit the injured person on the basis of that person's inability to pay. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The county official was told in these instances to either authorize payment or to \"come and get\" the person. Such behavior on the hospital's part is inconsistent with its argument that it functions to relieve government of a burden. Likewise, as we have pointed out, there has been no showing that the tax exemption is a significant factor in permitting these defendants to operate, thereby arguably relieving government of the burden of establishing its own medical care providers. In fact, government is already carrying a substantial share of the operating expenses of defendants, in the form of third-party payments pursuant to \"entitlement\" programs such as Medicare and Medicaid.\n\nAs we noted in the introduction to this opinion, the \"burden\" theory of tax exemptions has been traditionally based on the notion that a charitable organization should be eligible for exemption because it performs a task which the government would otherwise have to perform. The basis for the tax exemption is a quid pro quo: \"private charities perform functions that the state would be required to undertake and tax exemption is granted as a quid pro quo for the performance of these functions and services.\" E. Fisch, D. Freed \u0026 E. Schacter, Charities and Charitable Foundations § 787, at 602 (1974) (footnote omitted.) A hospital, whether nonprofit or for-profit, that provides its services to paying patients relieves no public burden because, in its absence, the government would not (or would have no duty to) provide free health care to patients able to pay for treatment. See Note, Exemption of Educational, Philanthropic and Religious Institutions from State Real Property Taxes, 64 Harv. L. Rev. 288, 290 (1950). If nonprofit hospitals, which charge fully for their services, were to be made tax exempt under the \"burden\" theory, for-profit hospitals logically ought to be treated in the same manner since both provide the public with the same service. Indeed, it might be argued that for-profit hospitals relieve a greater portion of the public \"burden\" because they provide medical care without public subsidy. All hospitals use tax-supported public services, including road construction and maintenance, police protection, fire protection, water and sewer maintenance, and waste removal, to name a few. Exempt hospitals use those services at the expense of nonexempt health care providers and other taxpayers, commercial and individual. Furthermore, nonprofit hospitals that generate a surplus from their operations ought not to be tax exempt under the \"burden\" theory because they are not passing along the benefit of the exemption to the public unless they are charging less for services than would be required absent the tax exemption: \"Even if the organization uses such surplus to expand its public benefit services, thereby remaining within the definition of nonprofitability, it does so at the expense of the beneficiaries whom it was created to serve.\" Ginsberg, The Real Property Tax Exemption of Nonprofit Organizations: A Perspective, 53 Temp. L.Q. 291, 317-18 (1980).\n\nWhile the practice of courts has often deviated from the strict logic of the \"burden\" theory, the general pattern is that \"burden\" jurisdictions generally require some degree of almsgiving or unpaid services for the granting of a charitable tax exemption. \"Consequently in these states operations financed primarily or entirely with funds supplied by the beneficiaries are classified as noncharitable.\" E. Fisch, Charities, supra, § 791, at 610.\n\nWe cannot find, on this record, the essential element of gift to the community, either through the nonreciprocal provisions of services or through the alleviation of a government burden, and consequently we hold that the defendants have not demonstrated that their property is being used exclusively for charitable purposes under the Utah Constitution.\n\nBecause we so hold, it follows that U.C.A., 1953, § 59-2-31 provides no safe harbor for defendants. In Loyal Order of Moose, 657 P.2d 257, we reiterated the principle that our statutes cannot expand the scope of the tax exemption granted by article XIII, section 2 of our Constitution. \"To the extent the statutes have that effect, they are not valid.\" Id. at 261. Accord Laborers Local No. 295, 658 P.2d at 1193-94. Property used exclusively for hospital purposes is not automatically being used for charitable purposes, even where the hospital is nonprofit.\n\nWe reverse the Tax Commission's grant of an ad valorem property tax exemption to defendants as being unconstitutional. We emphasize, contrary to the assertions of the Dissents, that this opinion is no more than an extension of the principles of strict construction set forth in Loyal Order of Moose, 657 P.2d 257. This is a \"record\" case, and we make no judgment as to the ability of these hospitals or any others to demonstrate their eligibility for constitutionally permissible tax exemptions in the future. We note, however, that reliance on automatic exemptions granted heretofore, and on the kind of minimal efforts to show charity reflected in this record, will no longer suffice. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe circumstances of this decision are very similar to those in Loyal Order of Moose, 657 P.2d 257, which gave rise to that case's holding respecting its effective date. The defendants here have relied for many years on a statutory interpretation of a constitutional provision, and this opinion resolves a difficult question of first impression. Because of the substantial delay entailed in the litigation process, retroactive application requiring the assessment of back taxes might well result in an unreasonable burden on the defendants in this case and on other similarly situated entities. Substantial changes in their operating budgets, record-keeping, and admission policies may result from our holding. It may be that adjustments in accounting practices and other policies will enable these defendants and other hospitals to qualify in the future for the constitutional exemption. In order to avoid the unreasonable burden that might otherwise be placed on them, we hold that the ruling of this case shall be applied prospectively only, with an effective date of January 1, 1986.\n\nWE CONCUR: Gordon R. Hall, Chief Justice, David Sam, District Judge.\n\nSTEWART, Justice: (Dissenting) I. INTRODUCTION\n\nA majority of the Court holds that Utah Valley Hospital and American Fork Hospital are not entitled to ad valorem property tax exemptions as charitable institutions under Article XIII, Section 2 of the Utah Constitution and that U.C.A., 1953, § 59-2-30, which defines charitable institutions, is unconstitutional. In holding the hospitals to be noncharitable, the majority opinion ignores the donation of literally tens of millions of dollars worth of private and public funds for the erection of hospital buildings and the purchases of equipment dedicated to the welfare of the public at large. Also ignored by the majority is the hospitals' expenditure of hundreds of thousands of dollars for the care of indigents and several millions of dollars for direct subsidization of hospital care to low income groups. The hospital facilities are made available to all persons, irrespective of race, religion, national origin, or ability to pay. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe Court's holding is without precedent either in Utah or elsewhere in the United States. The majority seeks to dismiss the solid array of law from other jurisdictions with the assertion that the \"decisions from other jurisdictions... incorporate unexamined assumptions about the fundamental nature of hospital-based medical care....\" That assertion is erroneous.\n\nThe majority asserts that its opinion is based only on the \"facts of this case.\" But this case is much more than an anomalous, one-time departure from controlling legal principles. It enunciates principles that are intended to define what constitutes a gift that will, I submit, result in the taxation of virtually all nonprofit hospitals, both primary and tertiary care, in the state. The basic rationale of the majority opinion is that no essential difference exists between for-profit and nonprofit hospitals and that the hospitals in this case did not show that they make any gift to the public or relieve any government burden and are essentially the equivalent of for-profit hospitals. In reaching these Conclusions, the Court's reasoning sweeps in every nonprofit hospital that receives substantial revenues from patients or third-party payors.\n\nThe effect of the majority opinion will likely be far-reaching. According to the chairman of Intermountain Health Care, Inc. (IHC), the taxation of tertiary care hospitals, which provide the most sophisticated and technologically advanced medical care, will jeopardize their existence. The immediate result of the majority's holding is that the already high cost of hospital care will be increased. If patients treated at Utah Valley Hospital and American Fork Hospital were required to pay ad valorem property taxes at only the 1980 level, they would pay $371,274.07 and $26,177.58, respectively, in addition to the cost of hospital services. In the case of Utah Valley Hospital, that amounts to an additional overhead cost of approximately $1,000 per day or approximately $1,000 per bed per year.\n\nII. THE FACTS\n\nIntermountain Health Care, Inc., is a nonprofit corporation which owns Utah Valley Hospital, a nonprofit corporation, and operates American Fork Hospital, also a nonprofit organization, which American Fork City leased to IHC. IHC owns and manages a total of twenty-one hospitals, fifteen of which, including Utah Valley Hospital, were founded and formerly owned and operated by the Church of Jesus Christ of Latter-Day Saints. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e They were transferred to Health Services Inc., a church-controlled nonprofit corporation, and then transferred to IHC in 1974. The Tax Commission found that (1) IHC hospitals provided medical services without regard for a patient's ability to pay; (2) IHC revenues are derived primarily from \"gifts (wills, endowments and contributions),\" as well as from patient charges and third-party payors such as Blue Cross, Medicare, and Medicaid; (3) IHC has no capital stock and pays no dividends or profits to the incorporators or the governing trustees of IHC, who serve without remuneration of any kind; and (4) \"o part of any proceeds will inure to the benefit of any private person\" upon dissolution of the corporation. The following facts are undisputed, although not part of the Commission's findings. The Boards of Trustees of IHC and of Utah Valley are lay boards whose members volunteer their time. Both hospitals are tax exempt under Section 501(c)(3) of the Internal Revenue Code. Utah Valley Hospital is an acute care hospital that as of 1980 employed 1,700 persons and had 385 beds. American Fork Hospital, which was built by the City of American Fork, is a primary care hospital that employs approximately 240 people and has 82 beds. IHC took over its operation from the City and, since this case was initiated, has constructed new physical facilities. Both hospitals accept all patients regardless of race, religion, national origin, or ability to pay.\n\nIII. DEFINITION OF CHARITY\n\nTwo centuries ago, the Lord Chancellor of England declared that charity is \" gift to a general public use, which extends to the poor as well as to the rich,\" Jones v. Williams, 2 Amb. 651 (cited in Matanuska-Susitna Borough v. King's Lake Camp, Alaska, 439 P.2d 441, 446 (1968). Justice Crockett, in a Concurring opinion in Benevolent \u0026 Protective Order of Elks No. 85 v. Tax Commission, Utah, 536 P.2d 1214, 1219-20 (1975), overruled on other grounds, Loyal Order of Moose No. 259 v. County Board of Equalization, Utah, 657 P.2d 257 (1982), stated:\n\nThe term charity... is broad in compass, having a number of related meanings. While it includes giving to the poor and needy, it is not restricted to that narrow concept.... Safeguarding and promoting the general welfare of citizens is one of the responsibilities of government.\n\nAccord Youth Tennis Foundation v. Tax Commission, Utah, 554 P.2d 220 (1976). Indeed, courts have long recognized that for an institution to qualify as a charitable institution, its beneficiaries need not be indigent or needy. Matanuska-Susitna Borough v. King's Lake Camp, supra; Dingwell v. Seymour, 91 Cal. App. 483, 267 P. 327, 333 (1928). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In proposing Article XIII, Section 2, the framers of our Constitution acted on the premise that individual group action in furthering charitable community objectives should be encouraged. \"By exempting property used for charitable purposes, the constitutional convention sought to encourage individual or group sacrifice for the welfare of the community.\" Salt Lake County v. Tax Commission ex rel. Greater Salt Lake Recreational Facilities, Utah, 596 P.2d 641, 643 (1979).\n\nThe majority's ruling represents a sharp and singular break with traditional legal principles. It is black letter law that nonprofit hospitals which are operated for the benefit of the public at large, and not for the benefit of any individual or group of individuals, and whose revenues are used for the charitable purposes of the organization are charitable institutions. The following passage in 15 Am. Jur. 2d Charities § 183 at 220-21 (1976) summarizes the settled, well-established law:\n\nThe word \"hospital\" in its popular usage denotes a charitable institution; it is only where income may be used for the profit of the owners that a hospital corporation ceases to be a charity. A corporation the object of which is to provide a general hospital for sick persons, having no capital stock or provision for making dividends or profits, deriving its funds mainly from public and private charity and holding them in trust for the object of sustaining the hospital, and conducting its affairs for the purpose of administering to the comfort and healing of the sick, without expectation or right on the part of those immediately interested in the corporation to receive compensation for their own benefit, is a public charitable institution. Moreover, the that a corporation established for the maintenance of a public hospital, by its rules requires of its patients payment for their board according to their circumstances and the accommodation they receive,... not render it the less a public charity. [Footnotes omitted.]\n\nSee also Restatement (Second) of Trusts § 372 (1959). The Supreme Court of Nebraska in Evangelical Lutheran Good Samaritan Society v. Gage County, 181 Neb. 831, 151 N.W.2d 446, 449 (1967), stated that hospitals operated as nonprofit institutions \"are universally classed as charitable institutions.\" The cases which support that proposition are legion. Many are referred to in Justice Howe's Dissent and need not be repeated here.\n\nThis Court affirmed that basic proposition in William Budge Memorial Hospital v. Maughn, 79 Utah 516, 3 P.2d 258 (1931). In holding that a for-profit hospital organized as a business corporation was not a charitable organization within the meaning of Article XIII, Section 2, this Court held that \"he test which determines whether a hospital is charitable or otherwise is its purpose, that is, whether it is maintained for gain, profit, advantage, or not.\" 79 Utah at 523, 3 P.2d at 261.\n\nThe rule stated in Budge was applied and elaborated on by the Supreme Court of Virginia in 1960 in City of Richmond v. Richmond Memorial Hospital, 202 Va. 86, 116 S.E.2d 79, 82 (1960), which construed a Virginia constitutional provision similar to Article XIII, Section 2 of the Utah Constitution. The Virginia Supreme Court stated:\n\nWhether these hospitals are \"conducted not for profit, but exclusively as charities,\" within the meaning of the constitutional provision, depends not upon the number of patients who are treated free of charge, but the nature of the institutions, and the purpose of their operations. The nature of these institutions, the purpose and use to which they are put, all combine to show that they are operated \"exclusively as charities.\"\n\n... Patients who are able to pay do pay, and those who cannot pay do not pay. The citizens who contributed to the hospitals can never get a return in money from their contributions. The charters of the corporations do not permit it, and the donors do not expect it.\n\nThere is no wording in Section 183(3) requiring free care or free service. The phrase \"exclusively as charities,\" describes the institutions entitled to exemption. It does not designate whether the service rendered by them shall be free to the recipients. If the framers of the Constitution had so intended it would have been easy and natural to have specified the rendering of free service as the basis for the exemption.\n\nThe framers of the (1902) Constitution presumably knew that such charitable organizations as YMCA's, asylums, and hospitals customarily charge for services. Thus while some or all of the charities specified in Section 183(e) may render more or less free service, the language of the Constitution contains no such requirement.\n\nThe charging of fees for services rendered, and even the receipt of revenues in excess of expenses, does not make a nonprofit hospital noncharitable if the surplus is used for the charitable purposes of the organization. E. g., Scripps Memorial Hospital v. California Employment Commission, 24 Cal. 2d 669, 151 P.2d 109 (1944); Hungerford Convalescent Hospital Ass'n v. Osborn, Fla., 150 So. 2d 230 (1963); Elder v. Henrietta Egleston Hospital, 205 Ga. 489, 53 S.E.2d 751 (1949); Gundry v. R.B. Smith Memorial Hospital Ass'n, 293 Mich. 36, 291 N.W. 213 (1940); Community Memorial Hospital v. Moberly, Mo., 422 S.W.2d 290 (167); Intercity Hospital Ass'n v. Squire, 56 F. Supp. 472 (W.D. Wash. 1944). See generally Eastern Kentucky Welfare Rights Organization v. Simon, 506 F.2d 1278, 1288-89 (D.C. Cir. 1974), vacated on other grounds, Simon v. Eastern Kentucky Welfare Rights Organization, 426 U.S. 26 (1976); 84 C.J.S. Taxation § 282(b) (1954).\n\nThe legal concept of charity does not require, as the majority apparently requires, that a hospital incur a deficit to qualify as a charitable institution. Charitable hospitals need not be self-liquidating. In City of Richmond v. Richmond Memorial Hospital, supra, the court held that the extent or amount of free service rendered is not controlling as long as the hospital is willing to render free service. The actual extent of free service is not critical. The Virginia Supreme Court stated in language directly relevant here:\n\nThe legal interpretation of the phrase \"not for profit, but exclusively as charities\", is not controlled by free service to the indigent or poor. Nonprofit hospitals which are devoted to the care of the sick, which aid in maintaining public health, and contribute to the advancement of medical science, are and should be regarded as charities.\n\n116 S.E.2d at 84. Accord Gundry v. R.B. Smith Memorial Hospital Ass'n, supra.\n\nOne court has noted: \"The image of a voluntary institution as a charitable organization, financing its care of patients to a substantial degree through philanthropy... is largely anachronistic. Philanthropy, though increasing, has not been able to match the redoubled demands for health care.\" Eastern Kentucky Welfare Rights Organization v. Simon, 506 F.2d at 1288 n.20 (quoting Professor William Thomas, Hearings on Conditions and Problems of the Nation's Nursing Homes, Subcommittee on Longterm Care, Spec. Committee on Aging, U.S. Senate, 89th Cong. 1st Sess., Pt. 2 (Feb. 15, 1985), p. 55). The California Supreme Court has declared that the percentage of free services rendered is immaterial. Scripps Memorial, 24 Cal. 2d at 678, 151 P.2d at 114. And in a statement of the law that is directly on point, Vick v. Cleveland Medical Foundation, 2 Ohio St. 2d 30, 206 N.E.2d 2 (1965), declared:\n\nWhere a corporation not for profit is operating a hospital for the primary purpose of providing services for those in need, without regard to race, creed, color or ability to pay, the facts that the hospital charges patients who are able to pay for its services and that a surplus has been created in the hospital fund (no part of which has been diverted to a private profit) do not change its essentially charitable nature. Goldman v. Friars Club (1952), 158 Ohio St. 185, 107 N.W.2d 518; Taylor v. Protestant Hospital Ass'n (1911), 85 Ohio St. 90, 96 N.E. 1089, 39 L.R.A., N.S., 427. The fifth paragraph of the syllabus in O'Brien, Treas., v. Physicians' Hospital Ass'n (1917) 96 Ohio St. 1, 116 N.E. 975, L.R.A. 1917F, 741, states the law applicable in this case, as follows:\n\n\"A public charitable hospital may receive pay from patients who are able to pay for the hospital accommodations they receive, but the money received from such source becomes a part of the trust fund, and must be devoted to the same trust purposes and cannot be diverted to private profit. (Taylor, Admr., v. The Protestant Hospital Assn., 85 Ohio St. 90 [96 N.E. 1089], approved and followed.)\"\n\n206 N.E.2d at 4.\n\nIt is also permissible for charitable nonprofit hospital to fix their rates to cover the cost of replacing capital assets, as well as to meet the costs of current operations. In West Allegheny Hospital v. Board of Property Assessment, 500 Pa. 236, 455 A.2d 1170 (1982), the Pennsylvania Supreme Court held that a hospital maintained in part by public and private charity was exempt from real estate taxes, even though the hospital passed on approximately 70 percent of the cost of capital acquisitions to paying patients.\n\nIt is true that the hospitals in this case receive substantial revenues from third-party payors and patients, but there is not a shred of evidence in this record, much less a finding by the Tax Commission, that one cent of the revenues is used for any purpose other than furthering the charitable purposes of providing hospital services to the sick and infirm. On the contrary, the Tax Commission's findings affirmatively establish that no person has profited from the revenues produced at either Utah Valley or American Fork Hospitals other than patients. Under time-honored legal principles, both hospitals qualify as charitable institutions.\n\nIV. UTAH VALLEY HOSPITAL'S AND AMERICAN FORK HOSPITAL'S GIFTS TO THE COMMUNITY\n\nThe majority states Utah law \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e to be as follows:\n\nAn entity may be granted a charitable tax exemption for its property under the Utah Constitution only if it meets the definition of a \"charity\" or if its property is used exclusively for \"charitable\" purposes. Essential to this definition is the element of gift to the Community. \"Charity is the contribution or dedication of something of value... to the common good.... By exempting property used for charitable purposes, the constitutional convention sought to encourage individual or group sacrifice for the welfare of the community. An essential element of charity is an act of giving.\" Salt Lake County v. Tax Commission ex rel. Greater Salt Lake Recreational Facilities, Utah, 596 P.2d 641, 643 (1979) (emphasis added). A gift to the community can be identified either by a substantial imbalance in the exchange between the charity and the recipient of its services or in the lessening of a government burden through the charity's operation. Laborers Local No. 295, 658 P.2d at 1198 (Oaks, J., Concurring).\n\nThe Court contends that neither of the hospitals here at issue has demonstrated \"any substantial imbalance between the value of the services it provides and the payments it receives\" because \"the vast majority of the services provided... are paid for by government programs, private insurance companies, or the individuals receiving care.\" The majority cites no authority in support of the assertion that a nonprofit hospital loses its charitable status if its patient receipts cover current operating costs. The law, as stated above, is otherwise. More importantly, there is in fact a very substantial imbalance between the total cost of the hospital care given and the revenues of the hospital in this case, which is so apparent from the record as to be undeniable.\n\nA. Direct Patient Subsidies\n\nThe basic facts are not disputed. Both hospitals render wholly free patient services in substantial amounts. In addition, they subsidize the cost of hospital services to the poor, the elderly, and workers whose hospital bills are paid only in part by worker's compensation. During the years 1978-80, Utah Valley Hospital rendered wholly free services to indigents in the amount of $200,000, and in each of those years the amount increased substantially over the preceding year. During the same period, the hospital subsidized services rendered to Medicare, Medicaid, and worker's compensation patients in the amount of $3,174,024. The corresponding figures for American Fork Hospital were $39,906 in indigent care and $421,306 for subsidization of Medicare, Medicaid, and worker's compensation benefits.\n\nHowever, the value of the charity extended to indigents is in fact greater than the amounts stated. The cost of the charity extended to patients who are first identified as charity patients after admission rather than at admission is charged to the \"bad debts\" account, along with traditional uncollectible accounts or bad debts, instead of being charged to charity. The reason for this accounting procedure is that some patients do not, or cannot (as in the case of emergency admissions), report their indigency status when they are first admitted to the hospital. After services have been rendered, the hospitals stop collection efforts once it is determined that a patient qualifies for charity. In such cases, the hospital accounting system shows the patient as a noncharity account. This accounting procedure is not unique to IHC hospitals. See, e.g., Jackson County v. State Tax Commission, Mo., 521 S.W.2d 378 (1975); West Allegheny Hospital v. Board of Property Assessment, 63 Pa. Commw. 555, 439 A.2d 1293, 1295 n.4 (1981), reversed, 500 Pa. 236, 455 A.2d 1170 (1982).\n\nIn sum, the direct cost of patient charity given away by Utah Valley Hospital for the period on question is in excess of $3,374,024, but less than $4,942,779 (which includes bad debts). The direct cost of the charity given away by American Fork Hospital is in excess of $461,212, but less than $639,024 (which includes bad debts).\n\nThe majority argues that for-profit hospitals also have bad debts. That is, of course, true, but it completely evades the central point. Unlike for-profit hospitals, Utah Valley and American Fork have a policy against turning away indigent patients. Therefore, that portion of the hospitals' bad debts which is attributable to indigency is bona fide charity since the charges would have been initially made to the charity account had the patient's indigency been discovered at admission. Those charges are not just ordinary business bad debts experienced by all commercial enterprises, as the majority would have it.\n\nMore importantly, the majority opinion ignores the total dollar amount of charity provided by each hospital by dismissing the hospitals' subsidization of Medicare, Medicaid, and worker's compensation patients with the assertion that for-profit hospitals do the same. Even if that be true, it does not diminish the value of the benefits conferred or the fact that such patients have been benefits of a tertiary care hospital available to them (in the case of Utah Valley Hospital) which they would not have at a for-profit hospital.\n\nB. Capital Subsidies and Gifts\n\nThe most glaring lapse in the majority opinion, in my view, is its flat-out refusal to recognize that there would be no Utah Valley Hospital--at all--if it had not been given lock, stock, and barrel to IHC by the Church of Jesus Christ of Latter-Day Saints, which initially built the hospital. American Fork Hospital apparently was initially erected by taxpayers' money. At the City's request, IHC took over the operation of the hospital as a lessee of American Fork City to relieve the City of a governmental burden. It follows that all patients at both hospitals, whether indigent, part-paying, or fully paying patients, are direct beneficiaries of large monetary investments in land, buildings, and medical equipment. In the case of Utah Valley Hospital, the total value of the plant and equipment approximates $24,769,220. In the case of American Fork Hospital, the amount approximates $1,963,515. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn addition to the \"gift to the community\" of the actual physical facilities, each and every patient benefits from the fact that IHC is a nonprofit corporation whose hospitals make no profit on the value of the assets dedicated to hospital care. The majority's effort to protrary IHC hospitals as if they were operated as for-profit entities has no substance in the record whatsoever. A for-profit hospital, unlike a nonprofit hospital, must necessarily price its services to make a profit on its investment if it is to stay in business. The surplus that Utah Valley and American Fork budget for is not by any means the equivalent of profit, as the majority wrongly suggests. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn short, all patients at American Fork and Utah Valley Hospitals, whether indigent, partially subsidized, or those who pay the full amount charged, are benefited by the initial gift of the capital assets and by all subsequent donations to capital. In addition, they benefit directly by the nonprofit structure of the hospitals, which means that the hospital rates charged include nothing for profit or a return of capital invested by investors. Moreover, the direct contributions to patient care referred to above are understated by the amortized value of the capital assets donated and the amount of profit that would be charged patients had those hospitals been for-profit hospitals.\n\nThe majority's dismissal of the $4,000,000 donated to Utah Valley Hospital for the construction of additional physical facilities in 1978 demonstrates the scope of the Court's disregard of the facts. The majority simply sets that gift at naught with the comment that there \"was no demonstration of the impact of that donation on the current support, maintenance, and operation of that hospital in the tax year in question.\" (Emphasis added.) Apparently the majority holds that the $4,000,000 should be ignored because it was not shown to have been expended, at least in part, on current expenses. It is clear that that sum did not go into current operating expenses, but rather into physical assets. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In all events, the amount was substantial by any measure: some twenty percent of the whole project.\n\nI know of no epistomology that requires that a perfectly obvious fact must be measured before its existence can be admitted. A flyer who ignores a mountain in plain view because it has not been measured courts disaster. A court of law that ignores obvious, relevant facts can hardly avoid substantial error.\n\nFurthermore, the majority inaccurately asserts that Utah Valley charges rates comparable to other similar entities. The evidence is to the contrary. Utah Valley Hospital, with its 385 beds and expensive, sophisticated acute care equipment, charges rates comparable to the rates charged by Payson Hospital, a small for-profit hospital that renders inexpensive types of services. That comparison indicates that Utah Valley's rates are low. Certainly the cost of operating the 80-bed, primary care Payson hospital ought to be lower than Utah Valley's costs. Furthermore, the majority flatly ignores the uncontradicted testimony of the chairman of IHC that \"we charge significantly less for the same admission\" and \"e charge lower prices to our patients for the same level of complexity than would a for-profit hospital.\"\n\nIn a similar vein, the majority asserts that there is no evidence that the gifts and donations to the hospital resulted in patient charges below \"prevailing market rates,\" that is, rates established by for-profit hospitals. The above facts show otherwise. In addition, there are no \"prevailing market rates\" for tertiary care hospitals, if by that term the majority means prevailing rates of competitive for-profit hospitals. There is no for-profit tertiary care hospital in the entire state of Utah; all tertiary care hospitals are nonprofit institutions. In fact, there is no other tertiary care hospital, whether nonprofit or for-profit, in the immense, sparsely populated area served by the Utah Valley Hospital, which extends from Utah County to the Nevada-Arizona border. Indeed, the facts strongly suggest that a for-profit tertiary care hospital could not survive in the geographical market area served by Utah Valley.\n\nIn summary, Utah Valley Hospital made substantial gifts to all patients who use its facilities and even greater gifts to needy and indigent patients for the period 1978-80 to the following extent:\n\n(1) Needy and indigent patients received in excess of $3,374,224 for direct patient care;\n\n(2) All patients had access to a tertiary care hospital valued in excess of $24,769,220, dedicated to serving all persons regardless of ability to pay, race, religion, or national origin and a hospital that would not exist but for the gift of that facility to the community by the Church of Jesus Christ of Latter-Day Saints;\n\n(3) All patients received the value of having hospital services performed free of any charge for profit or cost of capital; and\n\n(4) Some $4,000,000 was given by the community for capital improvements.\n\nAmerican Fork Hospital conferred the following financial gifts for the same period:\n\n(1) In excess of $461,212 for direct patient care;\n\n(2) Access to a local primary care community hospital dedicated to serving all persons regardless of ability to pay, race, religion, or national origin--and a hospital that would not exist but for the taxpayers of American Fork City, having a value in plant and equipment in excess of $1,963,515; and\n\n(3) The value of having hospital services performed free of any charge for profit or cost of capital.\n\nIn short, all patients at both hospitals receive substantial benefits from tens of millions of dollars that have been invested to promote the health of citizens in Utah County and in the entire central and southern parts of the state. Common sense dictates that the above realities be recognized, yet the majority refuses to recognize any value whatsoever in the gift of the capital assets or the value of having those assets free of any charge for a return on interest.\n\nIn Salt Lake County v. Tax Commission ex rel. Greater Salt Lake Recreational Facilities, Utah, 596 P.2d 641, 643 (1979), we declared that \"charity is the contribution or dedication of something of value... to the common good....\" In my view, the above facts and the Commission's findings speak so loudly and eloquently for themselves as to determine the outcome. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The majority wholly dismisses or ignores these facts and focuses on the assertion that \"current operating expenses for both hospitals are covered almost entirely by revenue from patient charges\" (emphasis added) and that \"neither of the hospitals in this case demonstrated any substantial imbalance between the value of the services it provides and the payments it receives apart from any gifts, donations, or endowments.\"\n\nPresumably, only if the hospitals ran deficits, i.e., if the direct expenses of patient care exceeded patient income, would a hospital qualify in the majority's view as a charitable institution. Of course, the deficits would have to be made up by donations, or the hospital would shortly lapse into bankruptcy. As the cases cited above recognize, modern hospitals can hardly be run on the basis that donations must subsidize current expenses. Moreover, the majority concludes that because governmental programs, private insurance companies, and individuals pay for the vast majority of the services provided, \"collection of such remuneration does not constitute giving, but is a mere reciprocal exchange of services for money.\" That Conclusion is wrong because it ignores the fact that the hospitals' charges do not cover the full costs, both overhead and direct, or operating a hospital. In the private sector of the economy, services are rarely given at cost or less than cost, let alone for free. If on rare occasions that does occur, it is usually only as a sales promotion to stimulate further profits. In contrast, the exchange in this case is not reciprocal because rates charged by these hospitals do not cover all costs.\n\nOf course hospital charges are made; of course those who can pay do pay, whether it be through their insurance companies, through government programs, or personally; of course expenses are generally covered by revenues. As far as I know, every single court that has considered these factors has held that they do not make a nonprofit hospital noncharitable for tax purposes. See cases cited in Part VII, (infra). The majority's suggestion that a nonprofit hospital must have a deficit in its current accounts to qualify for charitable status is both anachronistic and a prescription for lesser quality hospital care, if not bankruptcy. The majority is quite explicit. \"None of the defendants in this case made any effort to demonstrate that they would suffer any operating losses or have to discontinue any services if they are ineligible for exemption from property taxes.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nV. TAX EXEMPT STATUS OF NONPROFIT HOSPITALS UNDER THE MAJORITY OPINION\n\nThe majority opinion, in effect, precludes all IHC nonprofit primary care hospitals from qualifying for a charitable exemption. IHC tertiary care hospitals may, however, qualify as a charity if tertiary care services are given away or shown to relieve a government burden. In footnote 14, the majority opinion sets forth the test that a hospital must meet:\n\nBecause of the unique character of medical care, it may well be possible to identify a substantial imbalance in the exchange between Utah Valley Hospital and the recipients of its tertiary care, or a lessening of a government burden through the offering of such care. In light of our statement in Loyal Order of Moose, 657 P.2d at 264, that \"any separate part of the building occupied and used exclusively for charitable purposes... qualifies for exemption,\" it may be possible that the provision of tertiary care services could qualify as a charity if the requisite gift to the community were to be demonstrated. In this case, no effort was made to demonstrate for the record whether certain types of care were actually being \"given away\" by either institution or whether they could not in fact be provided without the offsetting factor of a tax exemption, at least to the extent of the value of the facilities needed to provide such care. We do not rule on the availability of tax exemptions under such circumstances in the context of this undeveloped record.\n\nThe majority's suggestion that certain \"separate part of the building occupied and used\" by a tertiary care hospital can qualify for an exemption is impracticable. Charity patients cannot realistically be isolated in one area of the hospital. An indigent, expectant mother must be treated like all other expectant mothers, and an indigent heart patient must be treated in the same facilities and with the same equipment as other heart patients. The particular nature of a patient's medical problems has little to do with the financial resources of the patient. Nor is there a valid basis to say that a CAT scanner may be exempt because of the manner in which its use is priced. Obviously, the price of its use could be set either at cost or below cost. If the latter, the hospital could recoup the loss by charging higher prices for obstetrical care, for example. The point is that it is the hospital as a unit that is either a charity or not; it cannot be validly divided into areas or services. The majority's slight opening of the door for tertiary care hospitals to qualify a part of their operations as charitable is so impractical and unrealistic as to be really no opening at all in my view.\n\nThe record also demonstrates that the primary care hospital and the tertiary care hospital involved in this case relieve a significant governmental burden, one of the two alternative tests for determining whether a nonprofit hospital qualifies to be treated as a charitable institution. If the two hospitals in this case do not relieve governmental burdens, as the majority holds, I do not know what more needs to be shown to prove the point. In the wide-open spaces of the West, where small communities are widely separated, the profit motive has not been sufficient to provide the needed impetus for the building of community hospitals (except in rare instances). Nor has it resulted in the construction of tertiary care hospitals on the more populous parts of the state.\n\nThe majority's argument is that no government burden is relieved by providing hospital service to those who can pay for it on a for-profit basis. The argument misses the mark for two reasons. First, the alternatives are not for profit or nonprofit hospitals. The alternatives are nonprofit hospital care or no hospital care at all, at least within the relevant geographical markets. Second, the charitable status of a hospital does not turn on whether it provides care for patients who can pay. The basis policy is not to tax the sick and infirm irrespective of ability to pay. A county provides many services to rich and poor alike without charging the rich for those services. Parks and playgrounds are but examples. Providing medical services may not be mandatory for counties or cities, but if they do, they most certainly promote the public health, safety, morals, and welfare in a most fundamental way. Surely cities and counties would, as a practical matter, be compelled to provide hospital services if the nonprofit hospitals in this state did not exist. Nor does the majority offer a valid reason for distinguishing between tertiary care and primary care hospitals with respect to relieving a governmental burden.\n\nThe majority's central concern seems to be to establish competitive equality between for-profit and nonprofit primary care hospitals. The essence of competitive enterprise is profit. It is ironic indeed that the majority construes Article XIII, Section 2 to protest for-profit entities from the competition of nonprofit entities. The constitutional provision simply was not designed to deal with competitive equality. Nonprofit charitable corporations, such as Utah Valley Hospital and American Fork Hospital, are created for the sole purpose of conferring a public benefit, providing hospital care at the lowest possible rate. If, indeed, a nonprofit hospital has a competitive advantage over a for-profit hospital, that is of no concern in the application of Article XIII, Section 2. The majority misconstrues the basic premises of that provision by suggesting that nonprofit hospitals, which serve the sick and infirm for a purely altruistic purpose, are not essentially different for legal purposes form for-profit hospitals.\n\nFurthermore, there are indeed numerous charities that have some commercial competition, such as the YWCA, the Red Cross, and many others. Certainly the majority's wholly unsupported and entirely novel assertion that tax exemptions for nonprofit hospitals raise a serious constitutional question is, I submit, utterly meritless.\n\nVI. DIFFERENCES BETWEEN FOR-PROFIT AND NONPROFIT HOSPITALS\n\nA fundamental proposition which pervades the majority opinion is that there is no essential difference between for-profit and nonprofit hospital corporations. The majority declares that \"the significant difference between for-profit and nonprofit hospital corporations is, in effect, the method of distribution of assets upon dissolution of the corporation, which is itself a rare occurrence.\" The majority further asserts, without any record support, that \"a large portion of the profits of most for-profit entities is used for capital improvement and new, updated equipment, and the defendant hospitals here similarly spend their revenues in excess of operational expenses.\" \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nTwo fundamental differences between for-profit and nonprofit corporations are ignored by the majority. First, it is axiomatic that a for-profit hospital must conduct its business to make a profit if it is to remain in business. Second, a for-profit hospital's investment decisions as to what markets or communities to enter and what kinds of equipment to invest in are made from a basically different motive than a nonprofit hospital's. The decisions of a far-profit hospital corporation must be based upon careful calculations as to the rate of return that may be expected on invested capital. If the rate of return is not sufficient, the investment is not made. Whether the surplus is reinvested in part or paid out to investors in dividends in whole or in part, the investor receives personal monetary benefit either in the increased value of his stock or in dividends.\n\nThe record indicates that for-profit hospitals in Utah have invested to a limited extent in high-volume, low-cost services such as pediatric, psychiatric, and obstetrical/gynecological services, but not in higher-cost, lower-volume kinds of services. It may well be that competition from a for-profit hospital is beneficial to the hospital industry generally, but there is no indication in this record that for-profit hospitals have acted in any fashion other than a for-profit corporation would normally act.\n\nNonprofit hospitals must, of course, be concerned with generating sufficient revenue to maintain themselves, but they are not concerned with earning a return on their investment for the benefit of stockholders. Their purposes are altruistic. Any surplus must be used in a manner that aggrandizes no one, such as for the lowering of rates, the acquisition of new equipment, or the improvement of facilities. This fundamental difference was explained by Mr. William N. Jones, a trustee and chairman of the Board of Trustees of Intermountain Health Care. He testified:\n\nA nonprofit hospital system or hospital has a different approach to hospital care or health care, if you will, than someone who might be involved in it as a business, a business where they desire to have a fine product, and they do. I'm talking now about profit-oriented business systems or hospitals, must do well as a business. We must as a nonprofit system do well in our mission which is to provide health care. So consequen when we try to provide health care, we do not try to provide just the health care that's easy and remunerative such as obstetrics and pediatrics which are relatively not too complex, and you receive a fairly high level of income from them. On the other hand, examples of health care which are not--you are not able to really receive enough to cover them would be trauma, burns, open-heart, that kind of high level care.\n\nMoreover, there is credible evidence that nonprofit hospitals in general are more efficient and charge less than for-profit hospitals. One study indicates that for-profit hospitals charge 17 percent more per admission to patients with health insurance and that administrative and general service costs were 13 percent higher than nonprofit hospitals. Paul Starr, The Social Transformations of American Medicine, 434 (1982). \"National date also indicate that, for every bed-size category, for-profit hospitals have higher costs than the overall coverage for community hospitals.\" Id. Mr. Jones also testified that IHC's Board of Trustees considers itself a trustee of the health care facilities for the public. \"e see ourselves as owned by the community since the corporation owns itself and in effect the church gave the hospitals to the communities, and we're entrusted with the running of the hospitals. We see them as in effect owned by the communities. We have fund raising drives and strive to have the communities feel that [they are] involved.\"\n\nIn short, the majority's argument that the only significant difference between for-profit and nonprofit hospitals is the distribution of assets on dissolution simply ignores reality. The majority's wholly unsupported assertion that \"the historical distinction between for-profit and nonprofit hospitals has eroded\" is without any factual foundation in this record. The Court states:\n\nBecause the vast majority of their services are paid for, the nonprofit hospitals in this case accumulate capital, as do their profit-seeking counterparts. The record indicates that this accumulated capital is used for the construction of additional hospitals and other facilities throughout the IHC system and the provision of expanded services. The record before us is undeveloped on this point, but there is nothing therein to indicate that the capital accumulated by either of the defendant hospitals is even earmarked in any way for use in their facilities or even in Utah County.\n\nAgain, the Court's position is contrary to the facts. Utah Valley Hospital budgets for the projected cost of services plus an additional five to seven percent reserve for contingencies and for replacement of building and equipment and for future expansion. Nothing is budgeted for IHC expansion. Even if the five to seven percent reserve were considered the equivalent of profit, which it is not, that would not begin to compare with the amount that would be required by most commercial institutions to make a reasonable return on investment. The administrator of Utah Valley Hospital, Mr. Davis, testified that the budget at that hospital\n\nconsists of those actual costs plus a contingency or reserve, and that includes, of course, monies or funds for either future expansion, replacement of equipment, replacement of buildings and so on. You see, we are in many ways, we are at the mercy of doctors and public and economy. For example, how do you budget the number of patients that are going to come to your hospital in a year or in advance? We find many times that we miss that sometimes regionally, sometimes nationally. Wherein we would budget for a given number of patients or income and the bottom falls out for three or four months. In that case, there is no reserve. There is no originality. We fight and scramble to make ends meet for the year, and those are the things that we are vulnerable to.... I think it is safe to say in order to remain viable, in order to keep from--what's the word I want--self-liquidating ourselves, we must have something in the range of probability five or seven percent in order to stay alive. Now, that's what we shoot for. That's not what we always get. Without that, you see, we would be self-liquidating.\n\nUtah Valley Hospital has recently acquired expensive, high technology equipment not found in any other hospital in its market area, whether for-profit or nonprofit. That technology includes a 22-bed neonatal unit, a linear accelerator to treat cancer, and a heart catheterization laboratory. It also has a number of well-recognized specialists on its staff and has recently applied to do open heart surgery because of the facilities it has been able to acquire. Whether those facilities were acquired from surplus revenues or from donations is of no consequence in my judgment.\n\nVII. OTHER COURTS HAVE RECOGNIZED THE REALITIES OF MODERN HOSPITAL CONDITIONS\n\nThe majority declares that the \"economic environment in which modern hospitals function is critical to our analysis in this case because it is an analysis which is generally not present in any of the cases relied upon by the Dissenting opinions.\" The majority tenders not one single item of proof in support of that sweeping and plainly inaccurate statement. For the majority to assert that all other courts have failed to perceive patently obvious changes in the business operations of hospitals over the past 60 years is just plainly wrong. The Court assumes a lack of perspicacity on the part of sister courts that is unwarranted.\n\nFor example, in Harvard Community Health Plan, Inc. v. Board of Assessors of Cambridge, 384 Mass. 536, 42 N.E.2d 1159, 1163 (1981), the Massachusetts Supreme Judicial Court stated:\n\nHowever, we recognize too that major changes in the area of health care, especially in modes of operation and financing, have necessitated changes as well in definitional predicates. The term \"charitable,\" as applied to health care facilities, has been broadened since earlier times, when it was limited mainly to almshouses for the poor. As a result, the promotion of health, whether through the provision of health care or through medical education and research, is today generally seen as a charitable purpose. A Scott, (supra) at §§ 368, 372; G.T. Bogert, Trusts \u0026 Trustees §§ 374 (rev. 2d ed. 1977). Such a purpose is separate and distinct from the relief of poverty, and no health organization need engage in \"almsgiving\" in order to qualify for exemption. See Barrett v. Brooks Hosp., Inc., 338 Mass. 754, 759, 157 N.E.2d 638 (1959); A. Scott, (supra) at 2895-2896. See also Eastern Ky. Welfare Rights Organization v Simon, 506 F.2d 1278, 1287-1289 (D.C. Cir. 1974), vacated on other grounds, 426 U.S. 26, 46, 96 S.Ct. 1917, 1928, 48 L.Ed.2d 450 (1976); Sound Health Ass'n v. Commissioner, 71 T.C. 158, 177-179 (1978). [Footnote omitted.]\n\nIn Evangelical Lutheran Good Samaritan Society v. Gage County, 181 Neb. 831, 151 N.W.2d 446 (1967) (quoting in part Young Men's Christian Ass'n v. Lancaster County, 106 Neb. 105 182 N.W. 593 (1921)), the Nebraska Supreme Court stated:\n\nFormerly all institutions furnishing [care to sick or convalescing patients], including both hospitals and nursing homes, were providing care for many patients without compensation and extended charity in the sense of alms-giving or free services to the poor. With the advent of present day social security and welfare programs, this type of charity is not often found because assistance is available to the poor under these programs. Yet, \"* * * the courts have defined 'charity' to be something more than mere alms-giving or the relief of poverty and distress, and have given it a significance broad enough to include practical enterprises for the good of humanity operated at a moderate cost to those who receive the benefits.\"\n\nEastern Kentucky Welfare Rights Organization v. Simon, 506 F.2d 1278, 1288 (D.C. Cir. 1974), vacated on other grounds, Simon v. Eastern Kentucky Welfare Rights Organization, 426 U.S. 26 (1976), discussed the development of hospitals from \"almshouses supported by philanthropy and serving almost exclusively the sick poor\" to \"primary community health facility for both rich and poor.\" The court recognized that private philanthropy had ben in part displaced by Medicare, Medicaid, and local non-emergency care for the poor. The court concluded: \"t appears that the rationale upon which the limited definition of 'charitable' was predicated has largely disappeared. To continue to base the 'charitable' status of a hospital strictly on the relief it provides for the poor fails to account for these major changes in the area of health care.\" Id. at 1288-89.\n\nNumerous opinions have discussed the manner in which modern nonprofit hospitals are operated, including particular practices which the majority asserts have changed hospitals to garden-variety commercial ventures. For example, it has long been recognized that patients in nonprofit hospitals who are financially able to pay are expected to pay. E. g., Harvard Community Health Plan, Inc. v. Board of Assessors, 384 Mass. 536, 427 N.E.2d 1159, 1163 n.10 (1981); Mayo Foundation v. Commissioner, 306 Minn. 25, 236 N.W.2d 767, 773 (1975); Jackson County v. State Tax Commission, Mo., 521 S.W.2d 378 (1975); Community Memorial Hospital v. Moberly, Mo., 422 S.W.2d 290, 295 (1967); Vick v. Cleveland Memorial Medical Foundation, 2 Ohio St. 2d 30, 206 N.E.2d 2, 4 (1965); West Allegheny Hospital v. Board of Property Assessment, 500 Pa. 236, 455 A.2d 1170 (1982); City of Richmond v. Richmond Memorial Hospital, 202 Va. 86, 116 S.E.2d 79, 83 (1960). The importance of third-party payors and government welfare assistance programs in financing most patient care has been recognized. Intercity Hospital v. Squire, 56 F. Supp. 472 (W.D. Wash. 1944); People v. Southern Illinois Hospital Corp., 404 Ill. 66, 88 N.E.2d 20, 23 (1949); Jackson County v. State Tax Commission, Mo., 521 S.W.2d 384 (1975); Community Memorial Hospital v. Moberly, Mo., 422 S.W.2d 290, 293 (1967); Evangelical Lutheran Good Samaritan Society v. Gage County, 181 Neb. 831, 151 N.W.2d 446, 448 (1967); West Allegheny Hospital v. Board of Property Assessment, 500 Pa. 236, 455 A.2d 1170, 1172 (1982). The payment of reasonable salaries to hospital personnel and the realization of a surplus and the reinvestment of the surplus in maintaining or replacing plant and equipment or other charitable activities have been expressly approved. Scripps Memorial Hospital, Inc. v. California Employment Commission, 24 Cal. 2d 669, 151 P.2d 109, 115 (1944); Harvard Community Health Plan, Inc. v. Board of Assessors, Mass., 427 N.E.2d 1159 (1981); Mayo Foundation v. Commissioner, 306 Minn. 25, 236 N.W.2d 767, 769, 774 (1975); Jackson County v. State Tax Commission, Mo., 521 S.W.2d 378 (1975); Community Memorial Hospital v. Moberly, Mo., 422 S.W.2d 290, 293 (1967); Evangelical Lutheran Good Samaritan Society v. Gage County, 181 Neb. 831, 151 N.W.2d 446, 448 (1967); West Allegheny Hospital v. Board of Property Assessment, 500 Pa. 236, 455 A.2d 1170, 1172 (1982); City of Richmond v. Richmond Memorial Hospital, 202 Va. 86, 116 S.E.2d 79, 80 (1960).\n\nNumerous nonprofit hospitals have used credit counselors and debt collection agencies to collect from patients who are able to pay. E. g., Mayo Foundation v. Commissioner, 306 Minn. 25, 236 N.W.2d 767, 770 (1975); West Allegheny Hospital v. Board of Property Assessment, 500 Pa. 236, 455 A.2d 1170, 1172 (1982). The courts have also emphasized the critical difference between the profit and nonprofit corporate structure of hospitals and sustained the charitable status of nonprofit hospitals because their \"business\" nature is merely an incident to the primary mission of providing health care to the general population. Cf. Barnes Hospital v. Leggett, Mo., 589 S.W.2d 241 (1979) (en banc).\n\nThe majority's assertion that \"traditional assumptions bear little relationship to the economics of the medical-industrial complex of the 1980's\" is based on the majority's refusal to acknowledge the development of case law that has occurred over at least the past 40 years.\n\nOf course, a nonprofit corporate structure is not itself enough to provide tax immunity for a hospital. If a nonprofit hospital is operated to provide monetary benefits to its sponsors, it is not charitable. See Georgia Osteopathic Hospital, Inc. v. Alford, 217 Ga. 663, 124 S.E.2d 402 (1962); Aransas Hospital, Inc. v. Aransas Pass Independent School District, Tex. Civ. App., 521 S.W.2d 685 (1975). Utah law is to the same effect. Salt Lake County v. Tax Commission, Utah, 596 P.2d 641 (1979) (\"where a profit motive underlies the activity,\" there is no exemption even though a nonprofit corporation \"is interposed between an entrepreneur and his customers\"). In the instant case, however, the sponsors of the hospitals in question are not persons whose private, pecuniary interests are furthered by their control of the hospitals.\n\nVIII. BURDEN OF PROOF\n\nFinally, it should be noted that the majority does not dispute the fact that the hospitals meet the standards established by § 59-2-30. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Nor does the majority dispute the fact that the standards there set out are supported by general principles of law widely accepted in other states. Nevertheless, the majority holds that provision unconstitutional, at least as applied, without saying specifically why.\n\nProcedurally, the Court treats that statute as if it does not exist in holding that the hospitals have the burden of proving their entitlement to the tax exemption. In fact, the hospitals did prove that they complied with the standards set out in section 59-2-30. At that point, Utah County, not the hospitals, had the burden to prove that the statute was unconstitutional. The principle that one who attacks the constitutionality of a statute must assume the burden of proof is so well established as to require no citation. In constantly placing the burden on the hospitals, the Court, in my view, fails to apply the proper rule. In any event, the record is sufficient to sustain the tax exemptions of both hospitals, irrespective of burden of proof.\n\nIX. CONCLUSION\n\nIn sum, I submit that the majority misapplies Article XIII, Section 2 of the Constitution and makes a radical departure from sound legal principles that are universally recognized. In part, the majority comes to the result it does because it refuses to recognize facts that are patently evident, in part because it assumes proposition of fact about this case that are unproved, and in part because it believes that nonprofit hospitals should stand on the same footing as for-profit hospitals to assure competitive equality because of changes in the nature of the hospital.\n\nBecause I fundamentally disagree with the majority, I Dissent. I also concur in Justice Howe's Dissent to the extent that it addresses the substantive issues.\n\nHOWE, Justice: (Dissenting) I Dissent. The views of the majority on charitable hospitals are without precedent in the jurisprudence of this country. The majority introduces confusion and mischief into an area of the law that has been well settled in this state for at least 50 years and strips from all nonprofit hospitals the exemption they have had over that span of time. The result will be that each hospital seeking an exemption must demonstrate ultimately to this Court the extent of its almsgiving. We will then be required to weigh and measure that almsgiving against sufficiency standards which the majority declines now to articulate. Courts do a disservice to the people they serve by leaving the state of the law in such uncertainty.\n\nThe majority fails (1) to accord to the legislature its rightful role in defining a constitutional term and to give the presumption of constitutionality to its definition, (2) to recognize the overwhelming legal authority that the property of hospitals, such as the two involved in this case, is used for charitable purposes, and (3) to recognize the gift made by these hospitals to their patients and the communities they serve.\n\nThe majority violates at least two well-recognized rules of appellate review: It asserts as fact matters not contained in the record, e.g., that there is no difference between the rates of for-profit hospitals and nonprofit hospitals and that for-profit hospitals treat without charge those patients who cannot pay. The majority ignores uncontradicted evidence and disregards findings of fact made by the Tax Commission that are supported by competent evidence and makes its own findings to the contrary, e.g., that the rates or services of the two hospitals in question would not change if they were required to pay property taxes and that the Utah Valley Hospital refuses to treat patients unless they can pay. In a reckless attempt to find support for what appears to be its novel personal ideas, buttressed by references to \"literature\" by writers whose credentials are not established, the majority indulges in totally irrelevant arguments, e.g., that the two hospitals have not demonstrated that they would \"suffer any operating losses or have to discontinue any services if they are ineligible for exemption from property taxes.\"\n\nI.\n\nIn U.C.A., 1953, § 59-2-31, the legislature has declared that property used exclusively for hospital purposes, which use complies with the requirements of section 59-2-30 (nonprofit status), shall be deemed to be used for charitable purposes within the exemption granted by article XIII, section 2 of the Constitution of Utah. That section exempts lots with buildings thereon used exclusively for charitable purposes. Neither article XIII nor any other part of the Constitution contains a definition of what constitutes a \"charitable purpose.\" County assessors, county boards of equalization, and the Utah State Tax Commission are frequently confronted with requests for exemptions by property owners who claim that their property is being used exclusively for charitable purposes. This is attested to by the many cases that have come to this Court as the final arbiter of that question. In 1973, the legislature enacted sections 59-2-30 and 59-2-31 in an attempt to \"clarify the scope\" of the religious and charitable purpose exemption found in section 2 of article XIII. The legislature was careful to state that it did not intend thereby to expand or limit the scope of such exemptions or to defeat exemptions not specifically enumerated which may be found within the purview of the constitutional exemption. See Foulger Equipment Co. v. State Tax Commission 16 Utah 2d 165, 397 P.2d 298 (1964), and judge v. Spencer, 15 Utah 242, 48 P. 1097 (1897) (statutes struck down that exempted from taxation property not included in the constitutional exemption).\n\nThis legislative attempt to clarify the term \"charitable purpose\" was proper. Charitable purpose cannot be determined academically alone. Nor is it the sole prerogative of this Court in the first instance to identify each and every charitable purpose. We have recognized that charity involves a contribution to the \"common good\" that is not subject to precise definition but is \"subject to judgment in light of changing community mores,\" Salt Lake County v. Tax Commission ex rel. Greater Salt Lake Recreational Facilities, Utah, 596 P.2d 641, 643 (1979), and that acts of charity may assume multifarious forms. Eyring Research Institute, Inc. v. Tax Commission, Utah, 598 P.2d 1348, 1351 (1979). It is therefore entirely appropriate that the representatives of the people be heard on this subject and that they give expression to it. The Supreme Court of California in Methodist Hospital of Sacramento v. Saylor, 5 Cal. 3d 685, 97 Cal. Rptr. 1, 488 P.2d 161 (1971), recognized a \"strong presumption\" in favor of the legislature's interpretation of a California constitutional provision. It quoted with approval from an earlier case, Delaney v. Lowery, 25 Cal. 2d 561, 154 P.2d 674 (1944), where that court referred to the presumption of constitutionality and the rule of strict construction of constitutional limitations on the legislature and concluded at page 578:\n\nThose principles indicate the latitude and effect to be given a legislative construction or interpretation of the Constitution. When the Constitution has a doubtful or obscure meaning or is capable of various interpretations, the construction placed thereon by the Legislature is of very persuasive significance.\n\nAgain, the same court said in Pacific Indemnity Co. v. Industrial Accident Commission, 215 Cal. 461, 464, 11 P.2d 1, 2 (1932): \"For the purpose of determining constitutionality, we cannot construe a section of the Constitution as if it were a statute, and adopt our own interpretation without regard to the legislative construction. Where more than one reasonable meaning exists, it is our duty to accept that chosen by the Legislature.\"\n\nIn accordance with this principle of according the legislature a role in defining terms used in a constitution, legislative attempts to statutorily define what constitutes a charitable use of property have been upheld in Jasper v. Mease Manor, Inc., Fla., 208 So. 2d 821 (1968), Samarkand of Santa Barbara, Inc. v. County of Santa Barbara, 216 Cal. App. 2d 341, 31 Cal. Rptr. 151 (1963), and Lundberg v. County of Alameda, 46 Cal. 2d 644, 298 P.2d 1 (1956). In the Florida case, a statute provided that the operation of a home for the aged, under certain conditions, constituted a \"charitable purpose.\" In Lunberg v. County of Alameda, the challenged statute exempted property, under certain conditions, used exclusively for schools of less than collegiate grade that were owned and operated by religious, hospital, or charitable funds, foundations, and corporations. In upholding the constitutionality of the statutes, it was recognized in both cases that such enactments carry a presumption in favor of their constitutionality, and they will not be invalidated by the courts except upon a clear and unquestionable showing that they are unconstitutional.\n\nThis Court has heretofore recognized the role of the legislature in defining terms that appear in the constitution but are undefined there. In Highland Boy Gold Mining Co. v. Strickley, 28 Utah 215, 78 P. 296 (1904), a challenge was made to a statute that authorized the use of the right of eminent domain by a mining company to acquire a right-of-way to operate an aerial tramway to transport ore and other materials across private property. The contention was made that the statute conflicted with section 22, article I of the Constitution of Utah, which authorized the condemnation of private property only if it was taken for a public use. This Court noted that there was an irreconcilable conflict among the authorities as to what constituted a public use and that what would be a public use in one jurisdiction would not necessarily be one in another jurisdiction. We stated that what should be considered a public use often depended on the locality, the wants and necessities of the people, the conditions with which they were surrounded, and the nature and character of the natural resources of the locality. We observed that the legislature could determine, in the first instance, whether a given use was a public use. We further held that when the legislature had made such a declaration, it would be respected and followed by the courts unless the act was clearly and palpably unconstitutional. However, we recognized that the legislative declaration was not final and that it was ultimately for the courts to determine whether a particular use was a public use.\n\nIn commenting on the legislative construction of the Utah Constitution, this Court in State ex rel. Breeden v. Lewis, 26 Utah 120, 123, 72 P. 388, 389 (1903), said:\n\nSo, an enactment of the Legislature embraces within itself, by implication, a construction by a co-ordinate branch of the government, of the constitutional provisions relating to the subject of the legislation. Therefore a court, in construing the enactment, where the question of its constitutionality is involved in difficulty and doubt, will be strongly inclined to resolve such doubt in favor of its validity,....\n\nThe majority pays only lip service to these rules and makes no attempt to employ them in its analysis. To the contrary, the burden on every question raised by the majority is shifted to the two hospitals without any recognition that the legislature, in enacting the statutes, resolved those issues in favor of granting the exemption. The approach taken is as if the legislature had never spoken. The collective judgment of the 104 legislators is subverted to the views of the majority, which are not supported by the citation of a single case.\n\nSections 59-2-30 and 59-2-31, being expressions of what the legislature in this state finds to be charitable purposes, are therefore entitled to a presumption of constitutionality. Murray City v. Hall, Utah, 663 P.2d 1314 (1983).\n\nII.\n\nIn the only case ever before this Court where a hospital sought a charitable exemption from ad valorem taxation, William Budge Memorial Hospital v. Maughan, 79 Utah 516, 3 P.2d 258 (1931), we held that the test which determined whether a hospital was charitable was whether it was maintained for gain, profit, or advantage. That question, we declared, was to be determined from its powers as defined in its charter and from the manner in which the hospital was conducted. Id. at 523. We pointed out that the mere fact that the property was used for hospital purposes was not sufficient to exempt it since not all hospitals were charitable institutions. \"They may be and often are maintained and conducted for pecuniary profit.\" Id. at 525. We denied the exemption in that case because the hospital was organized as a corporation for pecuniary profit, even though no dividends were ever declared or paid to the stockholders. We remarked that we were unable to find a single distinctive charitable feature of the hospital. The implication of that decision was that nonprofit hospitals which are open to the public without restriction are charitable. For over 50 years, counties have accordingly exempted such hospitals. Today, the majority sweeps away Budge and a half century of practice and recognition on the basis of its own determination, made dehors the record, that there is no difference between a profit and a nonprofit hospital and therefore neither should be granted an exemption.\n\nIn decisions of other states, hospital property has often been found to be used exclusively for charitable purposes within the meaning of statutory or constitutional exemptions. See the annotations and cases collected therein at 144 A.L.R. 1483, 108 A.L.R. 284, 62 A.L.R. 328, and 34 A.L.R. 634. The vast majority1a of cases hold that hospital property is used for charitable purposes if the hospital is not organized for profit and no private gain is in fact derived from its earnings or upon dissolution; all earnings are used to maintain the hospital facility; the hospital is open to the public without restriction to race, color, or creed; and admission is not predicated upon ability to pay. Jackson County v. State Tax Commission, Mo., 521 S.W.2d 378 (1975); Community Memorial Hospital v. City of Moberly, Mo., 422 S.W.2d 290 (1967); Vick v. Cleveland Memorial Medical Foundation, 2 Ohio St. 2d 30, 206 N.E.2d 2 (1965); Elder v. Henrietta Egleston Hospital for Children, 205 Ga. 489, 53 S.E.2d 751 (1949); People ex rel. Cannon v. Southern Illinois Hospital Corp., 404 Ill. 66, 88 N.E.2d 20 (1949); Scripps Memorial Hospital v. California, Employment Commission, 24 Cal. 2d 669, 151 P.2d 109, 155 A.L.R. 360 (1944); O'Brien v. Physicians' Hospital Association, 96 Ohio St. 1, 116 N.E. 975 (1917). The cases consistently hold that a hospital is not disqualified from receiving a charitable exemption merely because patients who are able to pay are required to do so so long as the funds derived in this manner are devoted to the charitable purposes of the institution. See the annotation on this subject at 37 A.L.R.3d 1223-27. The annotator there states:\n\nIt is a usual practice for a hospital to charge patients who are able to pay for the services rendered in order to maintain the institution, pay off the indebtedness on its buildings, expand its facilities, or improve its services, while not denying treatment and care to patients who are unable to pay anything. In many cases the paying patients vastly outnumber charity patients and their payment constitutes the main source of the hospital's income, but such receipt of pay has been held not to destroy the institution's charitable character and the consequent tax exemption....\n\n(Footnote omitted.)\n\nThat principle is exemplified by People ex rel. Cannon v. Southern Illinois Hospital Corp., supra, where the court referred to its earlier decision in Sisters of Third Order of St. Francis v. Board of Review of Peoria County, 231 Ill. 317, 83 N.E. 272 (1907), and reaffirmed a statement made there that the great disparity between the number of patients who paid and those who did not pay was immaterial,\n\nso long as charity was dispensed to all who needed it and those who applied therefor, and so long as no private gain or profit came to any person connected with the institution, and so long as it does not appear that any obstacle, of any character, was by the corporation placed in the way of those who might need charity of the kind dispensed by this institution, calculated to prevent such persons making application or obtaining admission to the hospital.\n\nId., 231 Ill. at 322, 83 N.E. at 274. See also West Allegheny Hospital v. Board of Property Assessment, 500 Pa. 236, 455 A.2d 1170 (1982). However, a hospital that consistently admits paying patients in such numbers as to exhaust its accommodations and prevent the admission of charity patients may lose its tax exemption as a charitable institution. O'Brien v. Physicians' Hospital Association, supra; Community Memorial Hospital v. City of Moberly, supra. The latter case also held that it was not fatal to a charitable tax exemption that the institution was in some competition with private business.\n\nIII.\n\nThus, the legislature in exempting nonprofit hospitals in sections 59-2-30 and 59-2-31 did so in light of and with the support of overwhelming precedent. The majority rejects this great body of law, claiming that it is based on hospital practices long abandoned. They assert that commencing late in the 19th century and running up until the 1920s, nonprofit hospitals were transformed from institutions that provided custodial care for the poor-sick to institutions where most patients sought and were able to pay for medical treatment. American courts, the majority continues, have been oblivious to this transformation and on the strength of \"unexamined assumptions\" of the past have continued to grant charitable exemptions, not realizing until noticed by the majority today that modern hospitals are quite different from the almshouses of the past. This condemnation is unwarranted. Nothing could be further from fact. Even a cursory examination of the cases reveals that for well over 100 years, courts in this country have been well aware that most patients in charitable hospitals pay for all or part of their care, but have held that this fact does not rob the institution of its charitable character. For example, in 1876 (109 years ago) the Supreme Judicial Court of Massachusetts in McDonald v. Massachusetts General Hospital, 120 Mass. 432, held that the fact that most patients are able to pay in full for the care they receive does not render the hospital any less a charity. Similarly, in 1881, in State ex rel. Alexian Brothers Hospital v. Powers, 10 Mo. App. 263, affirmed in 74 Mo. 476, and in 1907 in Sisters of the Third Order of St. Francis v. Board of Review of Peoria County, 231 Ill. 317, 83 N.E. 272, the courts specifically noted that many or most patients paid for their care. In the latter case, only five percent were charity patients. These early cases refute the theme of the majority opinion that in 1895, when the people of the Territory of Utah approved a constitution for their new state containing an exemption for property put to a charitable use, they had in mind, so far as hospitals are concerned, almshouses filled with only poor, sick persons, receiving little or no medical attention, but receiving humane custodial care until they passed on.\n\nThe annotation at 37 A.L.R.3d 1223 contains cases spanning from the last century to the present time where the issue of paying patients was raised, but in which it was held not disqualifying as a charity. Courts long ago fully considered and firmly rejected the notion now advanced by the majority that the charitable character of a hospital is determined by the quantity of its almsgiving. They do not cite a single case where an exemption was denied for insufficiency in quantity of free care. Utah will now stand alone with that antiquated concept as its law. A charitable exemption does not rest on the quantity of free care--but only on its availability. The cases contain frequent reference to the fact that no hospital could long keep its doors open to everyone unless most patients were able to pay for their care. Paying patients help make charity possible for nonpaying patients. St. Joseph's Hospital Association v. Ashland County, 96 Wis. 636, 72 N.W. 43 (1897); State ex rel. Alexian Brothers Hospital v. Powers, supra. The majority asserts that for-profit hospitals also admit patients without regard to their ability to pay, but the record before us is entirely devoid of any such evidence. Not even Utah County makes such a claim.\n\nCourts have not been oblivious, as the majority charges, that insurance, government programs such as Medicare, and third-party payors now pay for the care of many persons who formerly were called poor. Again, this criticism is ill-founded. In the following cases, the courts made specific mention of the changes that have occurred in the health care field. While I am not advocating that we go as far as some of them, since we are dealing in the instant case with two traditional nonprofit hospitals that admit everyone without regard to ability to pay, these cases illustrate how the courts perceive charity in health care as much broader than simply the providing of free services to the needy and destitute.\n\nIn Harvard Community Health Plan, Inc. v. Board of Assessors of Cambridge, 384 Mass. 536, 427 N.E.2d 1159 (1981), a nonprofit health clinic that provided prepaid comprehensive health care services for its subscribers sought a charitable exemption on its building. The court remarked:\n\nHowever, we recognize too that major changes in the area of health care, especially in modes of operation and financing, have necessitated changes as well in definitional predicates. The term \"charitable,\" as applied to health care facilities, has been broadened since earlier times, when it was limited mainly to almshouses for the poor. As a result, the promotion of health, whether through the provision of health care or through medical education and research, is today generally been as a charitable purpose. A Scott [Trusts §§ 368, 372]; G. T. Bogert, Trusts \u0026 Trustees § 374 (rev. 2d ed. 1977). Such a purpose is separate and distinct from the relief of poverty, and no health organization need engage in \"almsgiving\" in order to qualify for exemption.\n\nId., 384 Mass. at 542-43, 427 N.E.2d at 1163 (citations omitted).\n\nIn a similar vein, the Supreme Court of Montana in Bozeman Deaconess Foundation v. Ford, 151 Mont. 143, 439 P.2d 915, 37 A.L.R.3rd 558 (1968), in addressing a claim for an exemption on a home for the aged, noted that the \"modern view\" of charity is that it is not confined to the relief of the destitute, but includes care and attention for aged people apart from financial assistance, and that the supplying of this care and attention is as much a charitable and benevolent purpose as the relief of their financial wants. Further, the court said,\n\nIt may be that appellants feel the standard of care, the excellence of accommodations, and the mode of life accorded by this facility, all reflected by the size of the occupancy and maintenance fees, and the physical plant and facilities available are inconsistent with the usual concept of charity. But \"charity\" to the law has a much broader meaning than that accorded it in common speech (15 Am. Jur. 2d, p. 8). The scope of charity and the standards under which it is administered are not frozen by the past, but keep pace with the times and the new conditions and wants of society. (Zollman, American Law of Charities, pp. 121, 123).\n\nId., 151 Mont. at 149, 439 P.2d at 918 (emphasis added). In commenting on changes that have occurred in recent years in the health care field, the Supreme Court of Nebraska in Evangelical Lutheran Good Samaritan Society v. County of Gage, 181 Neb. 831, 151 N.W.2d 446 (1967), said:\n\nFormerly all institutions furnishing services of this nature, including both hospitals and nursing homes, were providing care for many patients without compensation and extended charity in the sense of almsgiving or free services to the poor. With the advent of present day social security and welfare programs, this type of charity is not often found because assistance is available to the poor under these programs. Yet, \"* * * the courts have defined 'charity' to be something more than mere alms-giving or the relief of poverty and distress, and have given it a significance broad enough to include practical enterprises for the good of humanity operated at a moderate cost to those who receive the benefits.\"\n\nId., 181 Neb. at 836, 151 N.W.2d at 449 (citations omitted). The District of Columbia Circuit Court similarly expressed in Eastern Kentucky Welfare Rights Organization v. Simon, 506 F.2d 1278 (D.C. Cir. 1974), vacated on other grounds, 426 U.S. 26 (1976), that the term \"charitable\" as used in the I.R.S. Code was not intended by Congress to always remain limited to providing free or below-cost care for indigents, but was flexible enough to \"recognize the changing economic, social and technological precepts and values of contemporary society.\" Id. at 1288. The Missouri Supreme Court in Jackson County v. State Tax Commission, supra, noted that modern-day social legislation has resulted in providing more citizens with assistance in paying for hospital care. The court there found it unnecessary to consider the percentages of patients who pay for none or only part of their care. So long as nonprofit hospitals are open to the rich and poor alike, said the court, they qualify for a charitable tax exemption.\n\nIn the law of trusts, it is well recognized that a charitable trust may be created for the promotion of health, although the benefits are not limited to the poor. Restatement (Second) of Trusts § 372; Scott on Trusts § 372 (3rd ed.); Bogert, Trusts and Trustees § 374 (2d ed. rev.). In the latter treatise, the author states:\n\nIn order that a trust to relieve sickness, prevent disease, and promote the public health be regarded as charitable it is not necessary that it be limited to assistance to the poor. It is to the advantage of the state to have as many agencies as possible operating to bring about health for the entire community. Society is interested in having all its members, rich and poor, in good physical condition, capable of being productive and of caring for themselves and enjoying life.\n\n(Citations omitted.)\n\nThe majority opinion maintains that Utah cases may be unique in mandating substantial almsgiving before charity can be found. Our cases do no such thing. Our cases are not in discord with those of other American state courts. For example, the majority rejects Community Memorial Hospital v. City of Moberly, supra, because the Missouri court did not discuss whether the hospital made a gift to its patients or the community. Thus, the majority states that that decision is out of harmony with Utah law. While it is true that no such Discussion appears, to have included it would have been \"reinventing the wheel.\" It has been established law in Missouri since at least 1881 (State ex rel. Alexian Brothers Hospital v. Powers, supra) that nonprofit hospitals with an open admission policy are charitable institutions in that they comport with one of the definitions of \"charity\" by making a \"gift\" to the sick \"by relieving their bodies from disease, suffering, or constraint.\"\n\nThis Court's previous cases in no way mandate the denial of the exemption that might be granted in other states. We, like other courts, have recognized that since \"charitable purpose\" has no static, definite, and fixed or exclusive meaning, the identification of charitable institutions may change from time to time. Justice Wilkins of this Court recognized this when he wrote for the Court in Salt Lake County v. Tax Commission ex rel. Greater Salt Lake Recreational Facilities, supra, that charity is not subject to precise definition, but is subject to judgment in light of changing community mores. We found charity in Youth Tennis Foundation v. Tax Commission, Utah, 554 P.2d 220 (1976), where we exempted from sales tax a nonprofit corporation organized for sponsoring, promoting, and encouraging amateur tennis. We held that Foundation to be a charity, giving that word a broad meaning. We said:\n\nCharity in the broad sense is the giving of something of benefit to others without expectation of gain. Considering it in more direct focus under this statute, it means providing something for the public welfare, which includes not only material, educational and cultural, but also extends to physical and recreational needs.\n\nId. at 221 (footnotes omitted). No substantial almsgiving as now required by the majority opinion was ever identified.\n\nThe majority recognizes and seemingly approves that some courts use the rationale that charitable entities by \"their activities enhance beneficial community values or goals.\" They also recognize that \"charity is the contribution or dedication of something of value of the common good.\" Further, the majority concedes that the \"care of the sick\" has traditionally been regarded as charitable. But the majority, clinging to the concept of almshouses that vanished years before the Utah Constitution was adopted, is too myopic to see the charity of the two hospitals in question.\n\nIV.\n\nAfter careful review of the record made by the parties before the Tax Commission, I am satisfied that the two hospitals in their structure and operation complied with everything necessary to be classified as charitable institutions and thus are entitled to exemption from ad valorem taxation on their land and buildings. This is true even under the narrow view of charity taken by the majority, i.e., that there must be a substantial imbalance between the value of the services provided and the remuneration received. IHC is a nonprofit corporation governed by a board of trustees who serve without pay as do the board members of each individual hospital. No dividends or distributions of any type, either direct or indirect, can be or are paid to them or to the incorporators. On dissolution, all remaining assets are required to be distributed to a nonprofit foundation or corporation that is organized and operated exclusively for charitable, educational, religious, or scientific purposes. The attempt of the majority to equate profit corporations with nonprofit corporations is on its face so legally unsound and repugnant to William Budge Memorial Hospital v. Maughan, 79 Utah 516, 3 P.2d 258 (1931), that nothing more need be said here on that subject.\n\nThe Utah Valley Hospital, which is located at Provo, Utah, furnishes to patients tertiary care that is more specialized and sophisticated than the primary services available is smaller community hospitals. Utah Valley Hospital serves central and southern Utah and is the only such institution between Provo, Utah, and Las Vegas, Nevada, a distance of about 400 miles. There are no privately owned tertiary care hospitals in Utah, and thus no attempt was made by either party to make a specific comparison of its rates with a for-profit tertiary hospital in Utah. However, the president of IHC testified that its rates were lower than for-profit hospitals. The majority ignores this testimony and would like to make the lack of comparison fatal to a case for exemption, but it cites no case or authority that a charitable hospital must offer lower rates to its paying patients. This writer, in examining scores of cases, has found no such requirement.\n\nAmerican Fork Hospital offers primary care to persons living in six small communities in northern Utah County. It is the only public service that is open 24 hours each day. From its switchboard, ambulances and firefighting equipment are dispatched at night in several of the communities.\n\nThe two hospitals are open to all members of the public irrespective of race, color, or creed. The Tax Commission specifically found that admission and treatment is not conditioned on ability to pay. Utah County does not seriously contend otherwise.2a The majority, in derogation of the most fundamental of appellate rules of review, has chosen to disregard this finding of the Commission, although it is supported by competent evidence, and make their own finding to the contrary. The fact that these hospitals do not advertise that they render free service is inconsequential. The court in Corporation of Sisters of Mercy v. Lane County, 123 Or. 144, 261 P. 694 (1927), did not disqualify a charitable hospital for giving a bill to each patient so as not to be imposed upon by those who might want to overstay. Emergency care is customarily rendered and much of the non-emergency care is well under way before financial arrangements are made between the patient and the hospital. The hospitals endeavor to collect for their services from each patient, in whole or in part, according to his financial resources. A large majority of the patients are able to pay in full from their own means or through their hospital insurance. Others are eligible for participation in government programs such as Medicare or Medicaid or are under industrial accident insurance, which does not always pay the hospital's full cost, causing it to absorb a partial loss.\n\nMost of the land and buildings comprising the Utah Valley Hospital were donated to IHC by the Church of Jesus Christ of Latter-Day Saints with the charge to operate it for the benefit of the residents of the area it serves. It is also highly significant that IHC promotes fund-raising drives in the communities served by its hospitals. It and the individual hospitals are the recipients of charitable donations, bequests, and endowments. Those donors would be surprised to know that their gift was not to charity. When the Utah Valley Hospital was recently enlarged and its services expanded, over four million dollars were raised toward that construction from the residents of the communities it serves. Government assistance was not sought. Thus all patients, including those who pay for their care in full, are beneficiaries of these gifts. See Missouri United Methodist Retirement Homes v. State Tax Commission, supra (where gifts, bequests, and donations from two conferences of the Methodist Church were used to defray part of the cost of operating a retirement house, the home was entitled to a charitable exemption).\n\nIHC reviews its rates annually and attempts to make them cover its costs, plus a margin for expansion of services and replacement of equipment and facilities. Contrary to the assertion in the majority opinion that there is no \"earmarking\" of this margin, the chairman of the board of trustees testified that the difference between its income and expenditures was \"totally and exclusively\" devoted to capital improvements. To argue, as does the majority, that it was not demonstrated that IHC would suffer any operating loss if subjected to property taxation is both irrelevant and unrealistic. In the first place, a charitable exemption is not based on a showing of absolute need. Secondly, the taxes on the Utah Valley Hospital amounted to more than $377,000 in 1980 and, according to the president's testimony, would be a cost that would have to be covered in the annual setting of rates. It is of no consequence that IHC operates outside of Utah. Our constitutional exemption applies to real property in this state used for charitable purposes, irrespective of whether the owner has property also devoted to charitable purposes in another state. The American Red Cross is such an example.\n\nThe legislature acted within proper bounds in exempting hospitals organized and operated in the manner of the two hospitals involved in this case. Their existence and operation contribute immeasurably to the inhabitants of the area they serve. Because these hospitals are nonprofit and are open to all persons regardless of their ability to pay, they are quite different from the \"countless private enterprises\" they are compared to in the majority opinion. The fact that most patients have the resource through their private insurance or other means or are eligible for Medicare or Medicaid and can pay in whole or in part is a tribute to their preparedness and to the wisdom of federal programs that make insurance for the elderly readily available. It does not detract from the fact that these hospitals stand as bulwarks in their communities with their doors always open to assist the rich and poor alike. In the case of catastrophic illness or disaster, even the seemingly well-prepared may need hospital care long after their resources are depleted. In such an event, the free care provided by these hospitals may well exceed that care which is paid for. In a reckless argument, the majority asserts that the two hospitals have not demonstrated that they would \"have to discontinue any services if they are ineligible for exemption from property taxes.\" They also decry that exempt hospitals \"use tax-supported public services, including road construction and maintenance, police protection, fire protection, water and sewer maintenance, and waste removal, to name a few,\" at the \"expense of nonexempt health care providers and other taxpayers, commercial and individual.\" It is obvious that such statements are wholly irrelevant. In demonstrating their lack of understanding, their argument is comparable to a statement made by the trial Judge in his memorandum denying a hospital a tax exemption in Jackson County v. State Tax Commission, supra. That statement was that the hospitals had never paid \"as much as one cent of tax on their fine, expensive and beautifully equipped hospital properties for the support of the schools, the roads, the streets, the fire and police departments, or any other governmental functions....\" The Supreme Court of Missouri, in denouncing the statements as irrelevant, observed that by authorizing a tax exemption in their constitution, the citizens of the state expressed that the very result complained of take place. So it is here. As the majority well knows, neither the lack of ability to pay taxes nor the non-use of governmental services has ever been the basis for a charitable exemption.\n\nConclusion\n\nI am in agreement with the majority that exemptions from taxation should be strictly construed. All jurisdictions so hold. However, we have also pointed out that in so doing we should give a reasonable meaning to the language of the constitutional exemption and not construe it so narrowly that no institution can qualify, thereby choking off the charitable enterprises the exemption was meant to encourage. Benevolent and Protective Order of Elks No. 85 v. Tax Commission, Utah, 536 P.2d 1214 (1975). The Supreme Court of Missouri recently wrote on this point:\n\n\"Taxation is the rule. Exemption therefrom is the exception. Claims for exemption are not favored in the law.\" However, Missouri has declared as its public policy that property actually and regularly used exclusively for charitable purposes shall be exempt from taxation, and the taxing authorities are not to be permitted to defeat that announced public policy by unreasonable or unrealistic application of the \"strict construction\" rule.\n\nMissouri United Methodist Retirement Homes v. State Tax Commission, Mo., 522 S.W.2d 745, 751 (1975) (citation omitted).\n\nI would uphold the constitutionality of sections 59-2-30 and 59-2-31. The overwhelming case law both from this Court and from other jurisdictions supports the legislature's determination. Certainly, the presumption of constitutionality of the statutes has not been overcome. I would affirm the decision of the Tax Commission granting an exemption to the two hospitals. I also concur in Justice Stewart's Dissenting opinion.\n\nZimmerman, Justice, does not participate herein; Sam, District Judge, sat.\n\n\u003cspan class=\"fn\"\u003e1. § 59-2-30. This section is intended to clarify the scope of exemptions for property used exclusively for either religious worship or charitable purposes provided for in section 2 of Article XIII of the Constitution of the state of Utah. This section is not intended to expand or limit the scope of such exemptions. Any property whose use is dedicated to religious worship or charitable purposes including property which is incidental to and reasonably necessary for the accomplishment of such religious worship or charitable purposes, intended to benefit an indefinite number of persons is exempt from taxation if all of the following requirements are met:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) The user is not organized to produce a profit from the use of the property.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) No part of any net earnings, from the use of the property, inures to the benefit of any private shareholder or individual, but any net earnings shall be used directly or indirectly, for the charitable or religious purposes of the organization.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) The property is not used or operated by the organization or other person so as to benefit any officer, trustee, director, shareholder, lessor, member, employee, contributor, or any other person through the distribution of profits, payment of excessive charges or compensations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) Upon the liquidation, dissolution, or abandonment of the user no part of any proceeds derived from such use will inure to the benefit of any private person.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e§ 59-2-31. (1) Property used exclusively for religious, hospital, educational, employee representation, or welfare purposes which use complies with the requirements of section 59-2-30, shall be deemed to be used for charitable purposes within the exemption provided for in section 2 of Article XIII of the Constitution of the state of Utah, and section 59-2-30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We emphasize in this regard the language of article XIII, section 2 itself:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAll tangible property in the state, not exempt under the laws of the United States, or under this Constitution, shall be taxed....\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUtah Const. art. XIII, § 2 (1895, amended 1982) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. E. Fisch, D. Freed \u0026 E. Schachter, Charities and Charitable Foundations § 787, at 602 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Id. at 603 \u0026 n.42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This article also contains the following information on the significance of local tax revenues:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eProperty taxes are the most important source of municipal revenue. For example, in 1970 to 1971 they comprised 64% of general revenue raised by local governments. Advisory Comm'n of Intergovernmental Relations, The Property Tax in a Changing Environment 99 (1974). In 1972, 84% of all local tax revenue and 36.4% of all local government revenue from all sources came from property taxes. Bureau of the Census, U.S. Dep't of Commerce, Statistical Abstract of the United States 242, 245 (1974). See also E. Fisch. D. Freed \u0026 E. Schachter, [(supra) note 3,] at 599-60. (\"Property taxes are an important source of revenue for governmental subdivisions which are finding it increasingly difficult to obtain adequate funds.\" (footnote omitted)); O. Oldman \u0026 F. Schoettle, State and Local Taxes and Finance 137 (1974) (\"As a producer of revenue, the property tax ranks second only to the federal personal income tax....\"); Cypen, Access to Health Care Services for the Poor: Existing Programs and Limitations, 31 U. Miami L. Rev. 127, 152 (1976) (\"To freely allow tax exemptions would... inevitably result in the depletion of sources of revenue from taxation.\"); Note, Nebraska Supreme Court Approves State Property Tax Exemption for Nonprofit Nursing Home Corporation Closely Associated with For-Profit Corporations, 12 Creighton L. Rev. 1331, 1332 (1979) (\"The ratio of tax exempt property to taxable property is steadily increasing. Because of the resulting loss of tax revenues, local government subdivisions cast a jaundiced eye upon property tax exemptions.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64 Minn. L. Rev. at 1096 n.17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This six-factor standard has been adapted from the test articulated by the Minnesota Supreme Court in North Star Research Institute v. County of Hennepin, 306 Minn. 1, 6, 236 N.W.2d 754, 757 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Paul Starr, The Social Transformation of American Medicine at 150 (1982). \"Voluntary\" hospitals, like public hospitals (which evolved from almshouses for the dependent poor), performed a \"welfare\" function rather than a medical or curing function: the poor were housed in large wards, largely cared for themselves, and often were not expected to recover. See id. at 145, 149, 160. Early voluntary hospitals had paternalistic, communal social structures in which patients entered at the sufferance of their benefactors, \"had the moral status of children,\" and received more moralistic and religious help than medical treatment. Id. at 149, 158.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eVoluntary hospitals were charities for the quite obvious reason that they housed and tended to those who were both sick and poor, i.e., those without resources and in need of charity. Because hospitals performed no medical treatment function and because they were largely institutions for the poor, the non-poor in need of medical treatment and their treating private physicians overwhelmingly avoided them. See generally Starr, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Id. at 146.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Id. at 147-48. This transformation was propelled significantly by (1) the professionalization of nursing and doctoring, and (2) advances in medical science, particularly in hygiene and anesthesia. Not only did the quality of medicine improve, but more importantly, the practice of medicine rapidly became linked to hospitals. Consequently, hospitals ceased being custodial holding institutions for the poor and instead became centers of medical treatment, especially surgery, attractive, for the first time, to private physicians and paying patients. A major consequence of this change was a great increase in the cost of establishing and operating hospitals. \"Hospital budgets soared beyond the capacity of charity to meet them.\" Id. at 160. While the change increased costs, it also \"enlarged the potential for income. Many people were now coming to hospitals who could afford to pay, and since the real value of hospital care had increased, charges would not drive them away.\" Id. at 161. Hospitals' ability to attract and financial need for paying patients, in turn, greatly increased the power of physicians over hospitals at the turn of the century as physicians acted as \"feeders,\" controlling the traffic of paying patients to hospital beds. Id. at 178-79. \"Hospitals had gone from treating the poor for the sake of charity to treating the rich for the sake of revenue....\" Id. at 159. (For a case history of this change in New York hospitals, see David Rosner, A Once Charitable Enterprise (1982).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Dissents attempt to characterize this opinion as \"equating\" profit and nonprofit enterprises. We disavow any such purpose. The point of this analysis is to emphasize that whatever salient distinctions exist between such entities in the health care field, they provide no automatic predicate for presuming the existence of charitable uses. For-profit entities are known, for many reasons, to engage in charity, and nonprofit entities to withhold it. The point of this opinion is to reiterate the essential requirement of the Utah Constitution that any entity claiming a charitable use exemption must demonstrate its entitlement and not rely upon unexamined and anachronistic assumptions about its status.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Justice Howe's Dissent asserts that we erroneously conclude that the rates of services of the two hospitals in this case would not change if their tax exemption is not upheld. We emphasize that the only thing this opinion concludes is that, on this record, these defendants have entirely failed to demonstrate that such a change would occur. This is a \"record\" case, and the record below strongly suggests that defendants, like the Dissenters, took the view that they were entitled to an automatic tax exemption without any evidentiary showing of the existence of charitable use.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Dissenters rely upon a statement in the record from the chairman of IHC's board to the effect that its rates were lower than those charged by for-profit hospitals. A careful examination of the record shows that testimony to have been identified as a mere opinion and not based upon any examination of comparable rate information. No \"break-out\" data from any hospitals was offered, and the context of the chairman's testimony makes it clear that no foundation was laid for his opinion. His actual statements were as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ Mr. Jones, what are the sources of the money which Intermountain Health Care uses to operate its hospitals and to purchase capital improvements in those hospitals?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA Well, the sources of money, of course, the primary source is patient revenue. And we, if I can say it again, we accepted a stewartship and a responsibility as unpaid volunteer trustees, which we feel very intensely, which is to provide health service to our communities. Therefore, the revenue incomes, if all things are compared, daily bed rate, the ancillary services, which are all the lab services and the x-rays and things like that, which it's hard to get the right mix if you had two people have the same appendix in two hospitals, you'd get that, but it's hard to compare just from a price list, if you will.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe feel that we charge significantly less for the same admission, if you will, but in addition to that as a source of revenue--of course, we are all familiar with Blue Cross, Blue Shield which we call third party, that is, it is neither the provider the patient. It is a third party, and Medicaid, Medicare which is a major provider or payer of health care.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The chairman of IHC's board of directors, for example, testified as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ee provide as a policy in Intermountain Health Care charity care to a certain level, and when I say certain level I should say that we provide health. We try not to publish that because everybody wants charity care, and they all consider them as good for charity cases. We don't turn people away.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The record does reflect that Utah Valley Hospital is the sole provider of tertiary care for a large geographic region. Because of the unique character of this sophisticated medical care, it may well be possible to identify a substantial imbalance in the exchange between Utah Valley Hospital and the recipients of its tertiary care, or a lessening of a government burden through the offering of such care. In light of our statement in Loyal Order of Moose, 657 P.2d at 264, that \"any separate part of the building occupied and used exclusively for charitable purposes... qualifies for exemption,\" it may be possible that the provision of tertiary care services could qualify as a charity if the requisite gift to the community were to be demonstrated. In this case, no effort was made to demonstrate for the record whether certain types of care were actually being \"given away\" by either institution or whether they could not in fact be provided without the offsetting factor of a tax exemption, at least to the extent of the value of the facilities needed to provide such care. We do not rule on the availability of tax exemptions under such circumstances in the context of this undeveloped record. We emphasize, however, that Justice Howe's assertion that \"no institution can qualify\" under this rule for the charitable purposes exemption is inaccurate. This case is decided on this record. We decline to describe the activities and policies of a qualifying institution, finding only that, in this case, the activities and policies of the two defendant hospitals, as established in this record, fall short, in several important respects, of the constitutional standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The testimony clearly established in at least one of those cases that the individual was in need of emergency medical care.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. There is no requirement in this opinion that taxes be imposed on any institution; there is only a requirement that institutions claiming charitable exemptions be put to their proof as to eligibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The majority's intimation that these facilities are not available to those who cannot pay is directly contrary to the explicit findings of the Tax Commission and to the record. See infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Religious organizations have played a major role in sponsoring nonprofit hospitals in the United States generally. It has been estimated, for example, that Catholic hospitals account for 25 percent of the hospital beds in the United States at present. Clark, Does the Nonprofit Form Fit the Hospital Industry? 93 Harv. L. Rev. 1416, 1458 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 In Dingwell, the court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAny person, the rich as well as the poor, may fall sick or be injured or wounded and become a fit subject for charity. St. Luke, chapter 10, verses 3-37. A trust may be and often is charitable in its nature, uses, and purposes without giving alms to the poor. It is true that poverty is a condition which, even when brought about by indolence and waste of life's opportunities, arrests the attention and commands the consideration of charity. Yet perhaps more worthy and deserving members of society than the ne'er-do-well poor may under certain conditions be proper objects of charity. A gift to establish and maintain a public institution where the misery and unhappiness of any person of high or low degree, rich or poor, may be considered and sanely dealt with would come within the purview of the definition of a public charity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e267 P. at 333.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 Without any stated justification, the Court also imports into Utah law a test formulated by the Minnesota Supreme Court under Minnesota law in North Star Research Institute v. Hennepin County, 306 Minn. 1, 236 N.W.2d 754 (1975). This Court modifies the standards enunciated there in one major respect. It requires that gifts and donations be shown to have a specific quantifiable effect on rates charged patients. The majority does not explain why it adds that requirement. There is no constitutional reason for that requirement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 These figures are computed from the assessments appearing on the property tax notices and are probably low. It is significant that Utah Valley added a $21,000,000 addition to its building in 1978. No government funds were used for that addition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 The majority argues that the \"rapid growth\" of IHC hospitals indicates that the earnings of Utah Valley and American Fork Hospitals are the equivalent of a for-profit hospital's profit. Again, the record does not support the majority's claim. IHC has taken over community hospitals such as one at Delta, Utah, because the municipal authorities asked IHC to do so, as one means of growth.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Even if the amount were translated into its effect on the overhead part of patient charges or rates, the majority gives no indication of any standards that would determine whether the gift was sufficient to qualify as a gift.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 There is no question in this case that any of the funds generated by the hospitals are used for other than charitable purposes and that no individual benefits as a result of being a sponsor or incorporation of the hospitals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 In addition, the majority states: \"Justice Stewart's assertion that the taxes levied by the county would have to be passed on the patients in the form of higher charges is without any foundation in the evidence. The far more logical assumption is that the growth of the IHC system would possibly be slowed, but there is no indication of a likelihood that current and future levels of care would be jeopardized.\" The majority errs with that flight into fantasy. The chairman of IHC testified that tertiary hospital care would be jeopardized by the loss of a charitable tax exemption. Furthermore, the record does not indicate that either Utah Valley Hospital or American Fork Hospital has contributed financially to the growth of the IHC system. Indeed, at least part of IHC's growth has occurred from its taking over operation of municipal community hospitals, such as in American Fork and Delta, Utah. The short of it is that patients at American Fork and Utah Valley Hospitals will indeed pay the property taxes, as will the patients in all other nonprofit hospitals in Utah, because patient revenues are the only source from which such funds could be obtained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf, however, it were demonstrated that patients of these hospitals paid hospital fees used in part to build or operate hospitals in other states, I might question the effect of that on the hospitals' charitable status. I doubt that Utah County taxpayers should be required to subsidize IHC's building of hospitals in Idaho or Wyoming.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 If a nonprofit hospital has been organized for the private gain of the sponsors of the hospital, which may occur for a variety of reasons, the courts have held those hospitals to be noncharitable. E. g., Georgia Osteopathic Hospital, Inc. v. Alford, 217 Ga. 663, 124 S.E.2d 402 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 The text of that provision is set out in footnote 1 of the majority opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a One court has declared that hospitals operated as nonprofit institutions are universally classed as charitable institutions. Evangelical Lutheran Good Samaritan Society v. County of Gage, 181 Neb. 831, 151 N.W.2d 446 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a In the two instances cited in the majority opinion, the patients were not refused admission. Indeed, they were in the Utah Valley Hospital and later moved to another facility with the concurrence of Utah County where their intoxication and drug addiction could be better treated.\u003c/span\u003e\n\n",
    "body_length": 155506,
    "citedas": [
      "709 P.2d 265"
    ],
    "attorneys": "David L. Wilkinson, Attorney General, Noall T. Wootton, Utah County Attorney, Lynn W. Davis, Deputy County Attorney, 51 South University, Provo, UT 84601; Ted Cannon, Salt Lake County Attorney Bill Thomas Peters. Special Asst. County Attorney, 220 South 200 East, Salt Lake City, UT 84111, for Plaintiffs. Daniel M. Allred, Michael D. Dazey (for St. Marks); Johnathan A. Dibble (for Holy Cross); Alan L. Sullivan, S. David Colton, A. Jaynne Allison (for Intermountain Health Care); John H. McDonald, Craig S. Cook (Pathology), for Defendants.",
    "category": [
      "124"
    ],
    "judges": "Durham, Justice, Wrote the opinion. WE Concur: Gordon R. Hall, Chief Justice, David Sam, District Judge. Stewart, Justice: (Dissenting). Howe, Justice: (Dissenting). Zimmerman, Justice, does not participate herein; Sam, District Judge, sat.",
    "citation_count": 0
  }
}
