{
  "id": "_4OoPmYBTlTomsSB0-ph",
  "document": {
    "title": "Carpenters Local Union No. 1846 of United Brotherhood of Carpenters and Joiners of America v. Pratt-Farnsworth Inc.",
    "full_title": "CARPENTERS LOCAL UNION NO. 1846 OF THE UNITED BROTHERHOOD OF CARPENTERS AND JOINERS OF AMERICA, AFL-CIO, ET AL. v. PRATT-FARNSWORTH, INC.; HALMAR, INC.; ASSOCIATED GENERAL CONTRACTORS OF LOUISIANA, INC., AT-LARGE DISTRICT; AND ASSOCIATED GENERAL CONTRACTORS OF LOUISIANA, INC., NEW ORLEANS DISTRICT",
    "jurisdiction": "Fifth Circuit",
    "date": "1982-11-04T00:00:00.000Z",
    "docket": "No. 81-3222",
    "body": "RANDALL, Circuit Judge:\n\nThis appeal essentially involves an all-out assault by two unions and other related parties on the so-called \"double breasted\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e system of conducting business utilized by contractor employers in the construction business in the New Orleans area. Hotly contested causes of action are alleged under several legal theories, primarily pursuant to the federal labor and antitrust laws; the district court dismissed all claims against the many defendants involved in this action. As explained more fully infra, we affirm the dismissal of certain claims, reverse the dismissal of others, and remand to the district court for further proceedings and development of a more complete factual record.\n\nI. FACTUAL AND PROCEDURAL BACKGROUND.\n\nThis lawsuit was brought by Carpenters Local Union No. 1846 and Piledrivers Local Union No. 2436 of the United Brotherhood of Carpenters and Joiners of America, AFL-CIO (hereinafter \"Unions\"), both unincorporated labor organizations engaged in representing construction employees within the jurisdiction of the United States District Court for the Eastern District of Louisiana. Also party plaintiffs in the suit are three employee benefit funds established on the basis of various collective bargaining agreements between the Unions and signatory employers in the construction industry: the Carpenters District Council of New Orleans and Vicinity Pension Trust, the Carpenters District Council of New Orleans and Vicinity Health and Welfare Plan, and the Carpenters District Council of New Orleans and Vicinity Apprenticeship, Educational and Training Program (hereinafter \"Funds\"). Additionally, the suit was brought as a class action on behalf of proposed classes of all members of and all persons seeking employment through the Unions and all participants and beneficiaries of the named Funds. No class has at present been certified by the district court.\n\nFour defendants were named: Pratt-Farnsworth, Inc. (\"Farnsworth\"); Halmar, Inc. (\"Halmar\"); Associated General Contractors of Louisiana, Inc., New Orleans District (\"AGC-New Orleans\"); and Associated General Contractors of Louisiana, Inc., At Large District (\"AGC-At Large\"). The Associated General Contractors, Inc., is a trade organization consisting of various construction companies throughout Louisiana. It is divided administratively into several geographic districts. AGC-New Orleans is one of those districts. AGC-At Large is not limited to any geographical area. Farnsworth is a construction company in the New Orleans area and a member of AGC-New Orleans. Halmar is also a construction company in New Orleans and a member of AGC-At Large.\n\nOne of AGC-New Orleans' activities is the negotiation, on behalf of certain of its members, of collective bargaining agreements with local trade unions. AGC-New Orleans is not itself a signatory to these bargaining agreements; rather, the agreements are signed only by the member and non-member contractors who wish to be bound. In the instant case, AGC-New Orleans negotiated a collective bargaining agreement between a multiemployer bargaining unit and the Unions covering the period from May 1, 1977 to April 30, 1980. This agreement constitutes the controverted subject matter of this suit.\n\nDefendant Farnsworth affiliated itself with the AGC organizations, and authorized AGC-New Orleans to bargain on its behalf with the Unions over wages, terms, and conditions of employment. Farnsworth is a signatory to the collective bargaining agreement negotiated by AGC-New Orleans and the Unions. AGC-New Orleans, AGC-At Large, and Halmar are not signatories to the collective bargaining agreement.\n\nIn their complaint, plaintiffs have alleged causes of action under three different sets of federal statutes, namely, (1) section 301(a) of the Labor Management Relations Act, 29 U.S.C. § 185(a) (hereinafter \"LMRA\"); (2) the Employee Retirement Income Security Act, 29 U.S.C. §§ 1001-1461 (hereinafter \"ERISA\"); and (3) the Sherman and Clayton Antitrust Acts, 15 U.S.C. §§ 1-7, 12-27.\n\nMultiple allegations were made by the plaintiffs under each of these statutory causes of action. First, the plaintiffs alleged violations of the antitrust laws. The gravamen of their antitrust complaint is that the four defendants have conspired to restrain competition in the contractor services market in the New Orleans area by carving out an enclave of non-union carpentry work, access to which is denied union contractors in the industry. They contend that the effect of this alleged conspiracy is to nullify the multiemployer bargaining agreement between the Unions and the signatory contractors, and to coerce third parties in the construction industry to hire non-union contractors and subcontractors.\n\nThe plaintiffs' claims under section 301 of the LMRA echo their antitrust allegations. They allege that a \"double breasted\" operation exists between defendants Farnsworth and Halmar and is being used to channel construction work into Halmar, the non-union part of the operation, while operations of Farnsworth are being phased out slowly to the point of nonexistence. The plaintiffs argue that Farnsworth and Halmar should be treated as a single employer or as alter egos with the result that Halmar would be bound by the collective bargaining agreement that Farnsworth executed with the Unions.\n\nThe ERISA cause of action is likewise interrelated with the section 301 labor action. The plaintiffs argue that Farnsworth and Halmar have breached the collective bargaining agreement by failing to submit fringe benefit contributions on behalf of their employees to the Funds as required by the agreement.\n\nDefendants moved for dismissal for failure to state a claim and in the alternative for dismissal for lack of subject matter jurisdiction and for summary judgment. Affidavits were attached to these motions.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Plaintiffs thereafter filed a set of interrogatories addressed to the defendants.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nBefore the defendants had filed any answers to the plaintiffs' interrogatories, the district court granted the defendants' motions to dismiss. Carpenters Local Union No. 1846 v. Pratt-Farnsworth, Inc., 511 F. Supp. 509 (E.D.La.1981). The district court held that AGC-New Orleans and AGC-At Large were not proper defendants to the section 301 labor claims and the ERISA claims because they had never signed the collective bargaining agreement with the Unions. Id. at 511-12, 514-515. The court dismissed the section 301 and ERISA claims against Farnsworth on the ground that the plaintiffs had never alleged any breach of the collective bargaining agreement on the part of Farnsworth in regard to its own employees. Id. at 512-15.\n\nAs to Halmar, the court dismissed the section 301 and ERISA claims on the basis that it had no authority to determine that Farnsworth and Halmar were a single employer or alter egos without also determining the appropriate bargaining unit of their employees, which, it held, would be an impermissible invasion of the jurisdiction of the National Labor Relations Board (hereinafter \"NLRB\" or \"the Board\"). Id. at 512-13. Additionally, the court held that dismissal of the section 301 and ERISA claims as to all defendants was required because of the plaintiffs' failure to exhaust the contractual grievance procedures provided in the collective bargaining agreement. Id. at 513-15.\n\nFinally, the district court dismissed the antitrust allegations because it decided that the bargaining agreement fell within certain nonstatutory exemptions to the antitrust laws, and that the plaintiffs' causes of action were in reality labor law issues parading as antitrust claims. Id. at 512-22. The plaintiffs have appealed to this court, contesting the district court's dismissal on all claims as to all defendants.\n\nOur task now is to determine whether the district court acted properly in dismissing the plaintiffs' claims. Except with respect to the question of exhaustion of contractual grievance procedures, we treat the district court's actions as dismissals under Rule 12(b) (6).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In our review of those claims dismissed under Rule 12(b) (6), we may not go outside the pleadings; we must accept all well pleaded facts as true and view them in the light most favorable to the plaintiffs. Dike v. School Board, 650 F.2d 783, 784 (5th Cir. 1981); Brett v. First Federal Savings \u0026 Loan Association, 461 F.2d 1155 (5th Cir. 1972). We cannot sustain the district court's dismissal for failure to state a claim \"unless it appears beyond doubt that the plaintiff can prove no set of facts in support of his claim which would entitle him to relief.\" Conley v. Gibson, 355 U.S. 41, 45-46, 78 S. Ct. 99, 101-102, 2 L. Ed. 2d 80 (1957). The district court did go beyond the pleadings in addressing the question of exhaustion of contractual grievance proceedings, and thus we will review its dismissal on that ground as a grant of summary judgment. Our review in that case involves the questions (1) whether there are any issues of material fact in dispute, and if not (2) whether the moving party is entitled to judgment as a matter of law. Daly v. Sprague, 675 F.2d 716 (5th Cir. 1982); Impossible Electronics Techniques, Inc. v. Wackenhut Protective Systems, Inc., 669 F.2d 1026, 1030-31 (5th Cir. 1982).\n\nII. THE SECTION 301 ALLEGATIONS.\n\nA. Section 301 Claims Against AGC-New Orleans and AGC-At Large.\n\nPursuant to section 301(a) of the LMRA, 29 U.S.C. § 185(a), federal courts have jurisdiction to examine alleged violations of collective bargaining agreements:\n\nSuits for violation of contracts between an employer and a labor organization representing employees in an industry affecting commerce as defined in this chapter, or between any such labor organizations, may be brought in any district court of the United States having jurisdiction of the parties, without respect to the amount in controversy or without regard to the citizenship of the parties.\n\n29 U.S.C. § 185(a). A section 301 claim must satisfy three requirements: (1) a claim of violation of (2) a contract (3) between an employer and a labor organization. E.g., Alvares v. Erickson, 514 F.2d 156, 161 (9th Cir.), cert. denied, 423 U.S. 874, 96 S. Ct. 143, 46 L. Ed. 2d 106 (1975).\n\nThe plaintiffs concede that the two AGC defendants did not sign the collective bargaining agreement at issue in this case and therefore are not contractually bound by it. Nonetheless, the plaintiffs argue that a section 301 claim properly lies against the two AGC defendants because Farnsworth and Halmar breached the bargaining agreement, and the two AGC defendants conspired to effect that breach and actively encouraged it. The district court held that \"the absence of [a] contractual relationship between AGC, New Orleans or AGC, At Large and Carpenters District Council mandates dismissal as to them of the Section 301 claim under settled authority in this jurisdiction.\" 511 F. Supp. at 512 (emphasis in original).\n\nThe plaintiffs contend that the absence of a contractual relationship between the two AGC defendants and themselves should not be regarded as fatal to the section 301 claims; rather, the plaintiffs argue that section 301 jurisdiction exists to assert a cause of action against a defendant whenever the object of the suit is the enforcement of rights guaranteed by a collective bargaining agreement in effect between an employer and a labor organization. In support of this contention, the plaintiffs cite three cases: Smith v. Evening News Association, 371 U.S. 195, 83 S. Ct. 267, 9 L. Ed. 2d 246 (1962); Rehmar v. Smith, 555 F.2d 1362 (9th Cir. 1977); Alvares v. Erickson, supra. These three cases are inapposite. In all of these cases, the issue was whether section 301 causes of action encompassed suits by individual union employees for the enforcement of rights guaranteed by a collective bargaining agreement entered into by their unions.\n\nWe note, however, that support for the plaintiffs' contention may be found in a recent decision by the Third Circuit. In Wilkes-Barre Publishing Co. v. Newspaper Guild Local 120, 647 F.2d 372 (3d Cir. 1981), cert. denied, 454 U.S. 1143, 102 S. Ct. 1003, 71 L. Ed. 2d 295 (1982), the court stated that \"so long as the obligation sought to be enforced has its source in the provisions of a collective bargaining agreement, remedies for its enforcement may be available under section 301(a) in suits other than on the contract itself.\" Id. at 380. Thus, the court determined that a federal court has jurisdiction over a section 301 suit brought against a non-party to a collective bargaining agreement who allegedly induces a party to breach the agreement. Id. at 376-81.\n\nIn making this determination, the court stated that \"what emerges as the law of [this] circuit as to the meaning of section 301(a) is that it reaches not only suits on labor contracts, but suits seeking remedies for violation of such contracts.\" Id. at 380 (emphasis in original). The court reasoned that protection against tortious interference with a collective bargaining agreement involves protection of a property interest which has its source in the federal common law of labor contracts. Id. at 381. In addition, the court reasoned that the issue in such cases is not the nature of the remedy sought for an alleged violation of a collective bargaining agreement, but whether the remedy requires that the court from which it is sought interpret the agreement. Id. at 380.\n\nNotwithstanding the Third Circuit's decision in Wilkes-Barre, courts have almost unanimously held that a section 301 suit may be brought for violation of a labor contract only against those who are parties to the contract at issue. Aacon Contracting Co. v. Association of Catholic Trade Unionists, 276 F.2d 958 (2d Cir. 1960), aff'g and adopting 178 F. Supp. 129, 130 (E.D.N.Y. 1959); Haspel v. Bonnaz, Singer \u0026 Hand Embroiderers Local 66, 216 F.2d 192, aff'g, 112 F. Supp. 944, 945 (S.D.N.Y.1953); Fabian v. Freight Drivers Local 557, 448 F. Supp. 835, 838 (D.Md.1978); Cate v. Blue Cross \u0026 Blue Shield, 434 F. Supp. 1187, 1189 (E.D.Tenn.1977); Beausoleil v. United Furniture Workers, Local 136-B, 244 F. Supp. 719, 720 (D.N.H. 1965).\n\nIndeed, this latter view has also been followed by a district court in our own circuit in a decision cited as controlling by the district court in the instant case. In Dixie Machine Welding \u0026 Metal Works, Inc. v. Marine Engineers Beneficial Association, 243 F. Supp. 489 (E.D.La.1965), a plaintiff employer brought suit in state court to enjoin the defendant union's picketing. The union obtained removal to federal district court on the ground that the proceeding was a section 301 action; it had argued that because the suit was based in part on the alleged breach of a collective bargaining agreement between the plaintiff employer and various labor organizations, it arose under section 301. Writing the opinion in Dixie Machine Welding, our late colleague and then-district court judge, Robert A. Ainsworth, Jr., held that the plaintiff's case was improvidently removed to federal court and that the district court had no jurisdiction to hear the case.\n\nJudge Ainsworth noted that although a collective bargaining agreement existed between the plaintiff employer and its employees, no such agreement existed between the plaintiff employer and the Marine Engineers Beneficial Association, the defendant in the case. As a result, he concluded that this was not a suit for violation of a contract between an employer and a labor organization as required by section 301:\n\nWhile it is alleged by plaintiff that the activity of its employees (resulting from their refusal to cross the picket line of defendant) is being carried on in violation of the collective bargaining agreements between plaintiff and its employees, this suit is not against plaintiff's employees but against Marine Engineers Beneficial Association with which plaintiff has no agreement of any kind. Between the parties to this action, therefore, there is no collective bargaining agreement and this is not a \"suit for violation of contracts between an employer and a labor organization\" or between labor organizations which under Section 301 of the Labor Management Relations Act would confer jurisdiction in this court.\n\n243 F. Supp. at 491 (emphasis in original). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe Unions attempt to circumvent the logic of the Dixie Machine Welding case, supra, by arguing that while no agreement exists between the two AGC defendants and themselves on which to base jurisdiction, the AGC defendants have nevertheless conspired to breach the agreement in effect between Farnsworth and the Unions. We must reject this argument. A conspiracy to violate a collective bargaining agreement does not, without more, state a cause of action under section 301 sufficient to confer jurisdiction on a federal court. Kaylor v. Crown Zellerbach, Inc., 643 F.2d 1362, 1368 (9th Cir. 1981); Russom v. Sears, Roebuck \u0026 Co., 558 F.2d 439, 441 n.3 (8th Cir.), cert. denied, 434 U.S. 955, 98 S. Ct. 481, 54 L. Ed. 2d 313 (1977); Abrams v. Carrier Corp., 434 F.2d 1234, 1253-54 (2d Cir. 1970), cert. denied sub nom. United Steelworkers v. Abrams, 401 U.S. 1009, 91 S. Ct. 1253, 28 L. Ed. 2d 545 (1971); Aacon Contracting Co. v. Association of Catholic Trade Unionists, supra; Berard v. General Motors Corp., 493 F. Supp. 1035, 1042 (D.Mass.), aff'd mem., 657 F.2d 261 (1st Cir. 1980), cert. denied, 451 U.S. 987, 101 S. Ct. 2322, 68 L. Ed. 2d 845 (1981).\n\nIn conclusion, we must agree with the district court that the absence of a contractual relationship between AGC-New Orleans or AGC-At Large and the Unions requires dismissal of the section 301 claim against the two AGC defendants.\n\nB. Section 301 Claims Against Farnsworth.\n\nAs stated before, a section 301 claim must satisfy three requirements before it may be asserted in federal court: (1) a claim of violation of (2) a contract (3) between an employer and a labor organization. 29 U.S.C. § 185(a). All three of these requirments appear to be met with respect to defendant Farnsworth. Both the plaintiffs and the defendants in this action concede that Farnsworth signed the collective bargaining agreement with the Unions and that Farnsworth is an employer of the Unions' membership; moreover, the original complaint filed by the plaintiffs alleged that Farnsworth had violated the collective bargaining agreement.\n\nThe district court apparently never considered the plaintiffs' section 301 claims against Farnsworth separately and apart from their section 301 claims against Halmar, presumably because of the allegation that Farnsworth and Halmar were alter egos who were both liable for violation of the collective bargaining agreement. However, the pleadings offered by both the Unions and the Funds allege simply that \"defendants\" have obligated themselves to make employee contributions, and this implies that not only Farnsworth qua Halmar but Farnsworth qua Farnsworth may be in breach of its obligations. Having stated such a claim for relief, we think that the plaintiff Unions and Funds should have at least been given an opportunity to prove that Farnsworth refused to pay contributions on behalf of those employees who no one contests are Farnsworth's own. Thus we cannot sustain a 12(b) (6) dismissal with respect to Farnsworth and must remand for consideration on the merits of this breach of contract claim.\n\nC. Section 301 Claims Against Halmar.\n\nThe Unions' and Funds' section 301 claims against Halmar present a much more difficult problem. The plaintiffs are suing Halmar for its alleged violation of the collective bargaining agreement executed between the Unions and Farnsworth. Unlike Farnsworth, however, Halmar never signed the collective bargaining agreement; therefore, unless the plaintiffs can establish an alternative ground for holding Halmar to the agreement, Halmar must be treated the same as the nonsignatory AGC defendants, and we must affirm the district court's dismissal of the section 301 claims against Halmar.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe relevant portions of the plaintiffs' complaint allege first, that Farnsworth and Halmar \"are and at all times material herein have been affiliated business enterprises, with common ownership and management, centralized control of labor relations, sharing of equipment and other assets, and employees and they constitute a single integrated business enterprise, doing business within the geographic jurisdiction of the Court, and constituting a single employer for all purposes relevant thereto;\" and second, that \"during the terms of the collective bargaining agreement between the AGC and Carpenters District Council, described as the 'Craft Agreement,' defendant employer Pratt-Farnsworth conspired with the knowledge and assent of the AGC and unknown labor persuaders (29 U.S.C. § 433(b)) to establish and operate Halmar in order to circumvent and evade the Craft Agreement provisions and create a union-free environment.\" 1 Rec. 3, 5. As will be developed later, the first of these two theories, when applied by the Board in the context of an unfair practice charge under the National Labor Relations Act, 29 U.S.C. §§ 151-168 (hereinafter \"NLRA\"), is known as the single employer doctrine, and the second, when so applied by the Board, is known as the alter ego doctrine. The plaintiffs, therefore, urge this court to hold that they have stated a claim, under section 301 of the LMRA, for breach of the terms of a collective bargaining agreement by Halmar, a non-signatory to that agreement, on the basis of the single employer theory or the alter ego theory developed by the Board in unfair labor practice cases under the NLRA. Before progressing any further with the arguments advanced by the plaintiffs in support of their position that they have stated a claim under section 301, or the arguments advanced by the defendants against that position, it would be helpful to describe the origins and content of these two theories.\n\n1. Single Employer Doctrine.\n\nThe single employer doctrine is a creation of the Board which allows it to treat two or more related enterprises as one employer within the meaning of section 2(2) of the NLRA, 29 U.S.C. § 152(2). Often the doctrine is invoked to combine the amount of business of two or more employers so that the whole will exceed the Board's self-imposed jurisdictional minimum. E.g., Radio \u0026 Television Broadcast Technicians Local Union 1264 v. Broadcast Service of Mobile, Inc. (Radio Union), 380 U.S. 255, 256, 85 S. Ct. 876, 877, 13 L. Ed. 2d 789 (1965) (per curiam), quoted with approval in South Prairie Construction Co. v. Local No. 627, International Union of Operating Engineers (Peter Kiewit), 425 U.S. 800, 802 n.3, 96 S. Ct. 1842, 1843 n.3, 48 L. Ed. 2d 382 (1976). The doctrine is not, however, limited to use only as a jurisdictional tool. The finding that two entities are a single employer may have the consequence of treating them as one for purposes of considering the existence of an unfair labor practice in a proceeding before the Board. E.g., Hageman Underground Construction, 253 N.L.R.B. 60 (1980) (certain respondents constituted a single employer for purposes of NLRA; backhoe operators employed by such respondents constituted a single appropriate unit; such respondents violated sections 8(a) (5) and (1) of the NLRA, 29 U.S.C. §§ 158(a) (5), (1), by refusing to recognize and bargain with the union as the exclusive representative of the employees in such unit and by failing to abide by the terms of the collective bargaining agreement covering such employees). The factors which the Board uses to determine the existence of single employer status are (1) interrelation of operations, (2) common management, (3) centralized control of labor relations, and (4) common ownership. Radio Union, supra, 380 U.S. at 256, 85 S. Ct. at 877; NLRB v. Don Burgess Construction Corp., 596 F.2d 378, 384 (9th Cir.), cert. denied, 444 U.S. 940, 100 S. Ct. 293, 62 L. Ed. 2d 306 (1979); Sakrete, Inc. v. NLRB, 332 F.2d 902, 905 (9th Cir. 1964), cert. denied, 379 U.S. 961, 85 S. Ct. 649, 13 L. Ed. 2d 556 (1965). As the court noted in Don Burgess, supra:\n\nThe Board has stressed the first three of these factors, as well as the presence of control of labor relations. [Sakrete, Inc., supra] at 905 n.4 (quoting with approval from NLRB Twenty-First Annual Report at 14-15). However, no one of the factors is controlling, NLRB v. Welcome-American Fertilizer Co., 443 F.2d 19, 21 (9th Cir. 1971), nor need all criteria be present. Single employer status ultimately depends on \"all the circumstances of the case\" and is characterized as an absence of an \"arm's length relationship found among unintegrated companies.\" Local 627, International Union of Operating Engineers v. NLRB, 171 U.S.App.D.C. 102, 107-108, 518 F.2d 1040, 1045-46 (1975), aff'd on this issue sub nom. South Prairie Construction Co. v. Local 627, International Union of Operating Engineers, 425 U.S. 800, 96 S. Ct. 1842, 48 L. Ed. 2d 382 (1976).\n\n596 F.2d at 384.\n\nA finding of single employer status does not by itself mean that all the subentities comprising the single employer will be held bound by a contract signed only by one. Instead, having found that two employers constitute a single employer for purposes of the NLRA, the Board then goes on to make a further determination whether the employees of both constitute an appropriate bargaining unit. As the Ninth Circuit stated in Don Burgess, 596 F.2d at 386, even if two firms are a single employer, a union contract signed by one would not bind both unless the employees of both constituted a single bargaining unit. The Ninth Circuit then explained the difference between an inquiry into single employer status and an inquiry into the appropriateness of the bargaining unit:\n\nIn determining the appropriateness of a bargaining unit the focus differs from that employed in deciding whether there is a single employer. \"In determining whether a single employer exists we are concerned with the common ownership, structure, and integrated control of the separate corporations; in determining the scope of the unit, we are concerned with the community of interests of the employees involved.\" Peter Kiewit Sons' Co., 231 N.L.R.B. 76, 77 (1977).\n\n596 F.2d at 386. See Soule Glass and Glazing Co. v. NLRB, 652 F.2d 1055, 1075 n.8 (1st Cir. 1981). Under the single employer doctrine, the focus is the interrelatedness of the employers, while in assessing an appropriate bargaining unit, the focus is on the similarity of concerns between employees. See NLRB v. J.C. Penney Co., 559 F.2d 373, 375 (5th Cir. 1977) (\"To [create a viable bargaining unit], the Board looks to such factors as bargaining history, operational integration, geographic proximity, common supervision, similarity in job function, and degree of employee interchange.\"); NLRB v. Belcher Towing Co., 284 F.2d 118, 121 (5th Cir. 1960) (the test which the Board applies in determining whether a bargaining unit is appropriate is \"community of interests\").\n\nTo view it another way, we have stated in Local Union No. 59, International Brotherhood of Electrical Workers v. Namco Electric, Inc., 653 F.2d 143, 147 (5th Cir. 1981), that \"whether two firms are a single employer for collective bargaining purposes and whether a single contract is binding on two separate corporations are not only different questions, but they may have different answers.\" 653 F.2d at 147. Whether they have different answers is a function of the appropriateness of the bargaining unit comprising the employees of both firms.\n\nThe Board has often applied or sought to apply the single employer-appropriate bargaining unit inquiries to double breasted contractors. Indeed, the case that receives the most attention in the briefs of the plaintiffs and defendants in this litigation -- Peter Kiewit -- is a case which began when a union filed a complaint with the Board alleging that two double breasted contractors had violated sections 8(a) (5) and (1) of the NLRA, 29 U.S.C. §§ 158(a) (5), (1) by their continuing refusal to apply to the employees of the non-union contractor the collective bargaining agreement in effect with the union contractor. We explore the case in some detail not only because it is an example of how the single employer doctrine functions in an unfair labor practice context, but also because, as we shall see later, a determination as to what the case holds -- or does not hold -- is important to a resolution of the problems before us. The union's allegations in Peter Kiewit were that (1) the union contractor and the non-union contractor were in reality a \"single employer\" and should be treated as such for the purpose of enforcing a collective bargaining agreement signed by the union constractor, and (2) because the two contractors were a single employer, the non-union contractor was obligated to recognize the union as the representative of a bargaining unit drawn to include both the non-union and the union contractors' employees. 425 U.S. at 801, 96 S. Ct. at 1842.\n\nThe NLRB found that the two contractors were separate employers and dismissed the complaint. Peter Kiewit Sons' Co., 206 N.L.R.B. 562 (1973). On review, the District of Columbia Circuit held that the two contractors were in fact a single employer, finding \"evidence [of] a substantial qualitative degree of interrelation of operations and common management\" between the two companies. Local 627, International Union of Operating Engineers v. NLRB, 171 U.S. App. D.C. 102, 518 F.2d 1040, 1047 (D.C.Cir.1975). The circuit court then went on to decide the second issue presented by the union's complaint, although the NLRB had not passed upon the bargaining unit question. The court held that the employees of the two contractors together constituted an appropriate unit for purposes of collective bargaining. Id. at 1047-50. On the basis of this conclusion, the court determined that the two contractors had committed an unfair labor practice by refusing to recognize the union as the bargaining representative of the non-union contractor's employees or to extend to them the terms of the collective bargaining agreement. Id. at 1050.\n\nOn appeal, the Supreme Court affirmed the court of appeals' determination on the single employer issue but vacated its holding that the employees of the two companies constituted an appropriate bargaining unit. 425 U.S. at 806, 96 S. Ct. at 1845. The Supreme Court held that the circuit court had invaded the statutory province of the NLRB by proceeding to decide the unit question before the NLRB had passed upon the issue:\n\nSince the selection of an appropriate bargaining unit lies largely within the discretion of the Board, whose decision, \"if not final, is rarely to be disturbed,\" we think the function of the Court of Appeals ended when the Board's error on the \"employer\" issue was \"laid bare\".\n\nId. at 805-06, 96 S. Ct. at 1844-1845 (citations omitted). The Court then remanded the case to the NLRB for a determination of the bargaining unit issue. On remand, the NLRB decided that even though the two companies involved were a single employer, their employees together did not constitute an appropriate bargaining unit. Peter Kiewit Sons' Co., 231 N.L.R.B. 76 (1977).\n\nThe Board made clear in Peter Kiewit that the existence of union and non-union construction firms historically operated side by side by a single employer is not, without more, a violation of a collective bargaining agreement with the signatory construction firm. As the Board stated in its original Peter Kiewit decision, 206 N.L.R.B. 562 (1973):\n\nIt is not uncommon in the construction industry for the same interests to have two separate organizations, one to handle contracts performed under union conditions and the other under nonunion conditions. The Board has recognized this fact by refusing to include the employees of a nonunion company in the same bargaining unit with those of a union company controlled by the same interests, and by refusing to require the nonunion company to recognize the bargaining representative of the union company's employees or to apply the collective-bargaining contract with the latter to its own employees.\n\n(footnotes omitted). The Board gave as examples of this policy its decisions in Frank N. Smith Associates, Inc., 194 N.L.R.B. 212 (1971); Gerace Construction, Inc., 193 N.L.R.B. 645 (1971); and Central New Mexico Chapter, National Electrical Contractors Association, Inc., 152 N.L.R.B. 1604 (1965). See also A-1 Fire Protection Inc., 233 N.L.R.B. 38 (1977), enforced in part and remanded sub nom. Road Sprinkler Fitters Local Union No. 669 v. NLRB, 195 U.S. App. D.C. 104, 600 F.2d 918 (1979), on remand, 250 N.L.R.B. 217 (1980), remanded, 219 U.S. App. D.C. 228, 676 F.2d 826 (D.C.Cir.1982). The Supreme Court, remanding the case to the Board in its Peter Kiewit decision, did not purport to challenge this policy, noting only that a finding of single employer status does indeed require the additional determination that both the signatory's and nonsignatory's employees belong to the same bargaining unit before both entities will be bound by one agreement. See 425 U.S. at 805, 96 S. Ct. at 1844.\n\nIt is clear that the primary motivation of the Board in making an independent unit determination in a single employer case is to protect the rights under section 7 of the NLRA, 29 U.S.C. § 157, of the employees of each of the subentities constituting the single employer to bargain collectively with representatives of their own choosing. Section 9(b) of the NLRA, 29 U.S.C. § 159(b), directs the Board to \"decide in each case whether, in order to assure to employees the fullest freedom in exercising rights guaranteed by [the NLRA], the unit appropriate for the purposes of collective bargaining shall be the employer unit, craft unit, plant unit, or subdivision thereof . . . .\" As the Supreme Court recognized in Peter Kiewit, supra, at 803-04, 96 S. Ct. at 1843-1844, and as we have set forth above, the factors leading to a single employer finding will not necessarily provide the assurance required by section 9(b) that the section 7 rights of the employees of the subentities involved will be adequately protected. That assurance is provided in an unfair labor practice case by the inquiry as to the appropriateness of the unit. Further, as will be shown in Part II.C.8 of this opinion, even the fact that the union employer and the union have stipulated in the agreement as to the appropriate unit will not preclude an inquiry by the Board into the appropriateness of the unit comprising the employees of both the union and non-union employers.\n\n2. Alter Ego Doctrine.\n\nAs indicated above, the plaintiffs' pleadings allege (in addition to interrelation of operations, common management, centralized control of labor relations and common ownership between Farnsworth and Halmar) that Halmar is being operated to circumvent and evade the obligations of Farnsworth under the collective bargaining agreement between Farnsworth and the Unions. This rationale, broadly read, echoes another Board-created doctrine, that of the alter ego employer. Alter ego issues commonly arise in successorship situations, when ownership of a signatory company changes hands. Although a bona fide successor is not in general bound by a prior collective bargaining agreement, an alter ego will be so bound. NLRB v. Tricor Products, Inc., 636 F.2d 266, 269-70 (10th Cir. 1980). This is because an employer will not be permitted to evade its obligations under the NLRA by setting up what appears to be a new company, but is in reality a \"disguised continuance\" of the old one. Southport Petroleum Co. v. NLRB, 315 U.S. 100, 106, 62 S. Ct. 452, 455, 86 L. Ed. 718 (1942). See also Howard Johnson Co. v. Detroit Local Joint Executive Board, 417 U.S. 249, 259 n.5, 94 S. Ct. 2236, 2242 n.5, 41 L. Ed. 2d 46 (1974) (when \"a mere technical change [is made] in the structure or identity of the employing entity, frequently to avoid the effect of the labor laws . . . . the courts have had little difficulty holding that the successor is in reality the same employer and is subject to all the legal and contractual obligations of the predecessor.\").\n\nIn deciding whether a company is an alter ego, the Board will often look to factors which bear some similarity to those involved in a single employer question; in particular, whether the two enterprises have substantially identical management, business purpose, operation, equipment, customers, supervision and ownership. Hageman Underground Construction, 253 N.L.R.B. 60 (1980); Crawford Door Sales Co., 226 N.L.R.B. 1144 (1976).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e However, the focus of the alter ego doctrine, unlike that of the single employer doctrine, is on the existence of a disguised continuance or an attempt to avoid the obligations of a collective bargaining agreement through a sham transaction or technical change in operations. E.g., Amalgamated Meat Cutters v. NLRB, 214 U.S. App. D.C. 46, 663 F.2d 223, 277 (D.C.Cir.1980) (sale of supermarket was not sham or \"paper\" transaction); NLRB v. Tricor Products, Inc., supra, at 270 (motivation by antiunion sentiment a relevant factor in alter ego analysis); NLRB v. Herman Brothers Pet Supply, Inc., 325 F.2d 68, 70-71 (6th Cir. 1963) (sale of store immediately after representation election was \"a fictitious transaction to avoid dealing with the union and to discharge those employees who supported the union\"); NLRB v. Ozark Hardwood Co., 282 F.2d 1, 5-7 (8th Cir. 1960) (Board was entitled to find that identity of structure and continuance of operations existed to support alter ego finding or could find successor to be an instrument of \"evasion as to the labor-wrongs situation\").\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Further, an alter ego case frequently contains specific findings on the substantial continuity of the work force from the union to the non-union employer. E.g., Hageman Underground Construction, 253 N.L.R.B. 60, 68 (decision of Shapiro, A.L.J. 1980) (\"All of the construction workers on the payroll of [signatory employer] were transferred to the payroll of [non-signatory employer], where they performed the same work which they had done while working for [signatory employer], using the same skills, and under the same immediate supervision.\"); Crawford Door Sales Co., 226 N.L.R.B. 1144, 1150 (decision of Dyer, A.L.J. 1976) (\"The number of employees was reduced by [signatory employer's] unfair labor practices prior to the time [non-signatory employer] commenced business, but [non-signatory employer] continued the operations and the same employees with no discernible break.\")\n\nWe have seen that the Board, in applying the single employer doctrine, makes an independent, careful investigation into whether the employees of two firms held to constitute a single employer constitute an appropriate bargaining unit. Only where the employees do constitute an appropriate unit will the non-signatory firm be bound to the collective bargaining agreement entered into between the signatory firm and the union. However, when the Board makes a finding that a non-signatory employer is the alter ego of a signatory employer which has voluntarily agreed to recognize the union's representative status in a unit stipulated in the collective bargaining agreement, the Board generally will not reconsider the unit under the community of interests test, but will simply make a far more limited determination whether the stipulated unit is repugnant to any policy embodied in the NLRA. See Hageman Underground Construction, 253 N.L.R.B. 60, 70 (decision of Shapiro, A.L.J. 1980); Pioneer Inn Associates, 228 N.L.R.B. 1263, 1272 (decision of Shapiro, A.L.J. 1976) (\"The salutary purpose of such agreement [as to the boundaries of an appropriate unit] would be frustrated if the parties were free to repudiate them at will and, thus, absent extraordinary circumstances or a clear denial of employees' rights, the Board will not permit such repudiation, even where it would not have found the unit appropriate if the matter had been brought before it initially.\"), enforced, 578 F.2d 835 (9th Cir. 1978). The Board's reluctance to reexamine a stipulated unit in an alter ego case clearly stems from the fact that the conclusion that one employer is the alter ego of another is based on a holding that the two are in reality the same employer.\n\n3. The District Court's Decision.\n\nHaving described the single employer and alter ego theories developed and applied by the Board, generally in the context of determining whether sections 8(a) (5) and (1) of the NLRA, 29 U.S.C. §§ 158(a) (5), (1), have been violated by the refusal of a nonsignatory employer to abide by the terms of a collective bargaining agreement between a related signatory employer and the union, we turn to the district court's decision in this case. The district court assumed that Peter Kiewit meant that a federal court was powerless to make an initial bargaining unit determination even in a section 301 suit, for it concluded that\n\nadoption of plaintiffs' assertion that Farnsworth and Halmar are a single employer so as to make the instant labor contract binding upon Halmar necessarily would require a determination of the appropriate bargaining unit, and that such determination would be an invasion of the exclusive province of the N.L.R.B. not distinguishable from that condemned by the Supreme Court in the Peter Kiewit case. Hence, the motions to dismiss the Section 301 claims brought by Farnsworth and Halmar must be granted.\n\n511 F. Supp. at 513 (emphasis in original). \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e As a preliminary matter, we note that behind the district court's reasoning lies the assumption that the pleadings allege only the single employer theory. But, as we have seen, the pleadings also allege the alter ego theory as a basis for the Unions' breach of contract action. Were we to accept the plaintiffs' argument that they have stated a claim under section 301 employing the alter ego theory, and were we to hold that the district court should apply that theory in the same manner as the Board applies it in the unfair labor practice context, then, as described in Part II.C.2 above, a de novo determination of the appropriate bargaining unit might well not be necessary. Depending upon the proof, the district court might be able to limit itself to a consideration of whether the resulting unit is repugnant to the purposes of the NLRA, a far more limited inquiry. For the time being, we note only that the pleadings cannot be construed to allege only a single employer theory.\n\n4. The Substantive Law to be Applied under Section 301.\n\nThe district court's determination is significant as much for its unstated premise as for its ultimate conclusion. That premise is that a district court, in an action for breach of contract under section 301 in which single employer status is alleged as a basis of recovery, would apply the single employer theory in the same fashion as it is employed by the Board in the unfair labor practice context. Under this approach, if the district court were to find that Farnsworth and Halmar were a single employer, a favorable determination as to the appropriateness of the bargaining unit consisting of the employees of both companies would be necessary before Halmar would be bound by the collective bargaining agreement entered into between the Unions and Farnsworth. Upon examination, we think that the district court's premise was correct, and we would broaden it to include suits under section 301 based upon allegations of alter ego status as well.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nAs the Supreme Court held in Textile Workers Union v. Lincoln Mills, 353 U.S. 448, 456, 77 S. Ct. 912, 917, 1 L. Ed. 2d 972 (1957), the substantive law to be applied in suits under section 301 is federal law, \"which the courts must fashion from the policy of our national labor laws.\" It was Congress' stated goal in adopting section 301 to treat collective bargaining agreements as contracts fully enforceable in federal courts, in order to encourage the making of such agreements and to promote industrial peace through faithful performance of such agreements. Id. at 453-54, 77 S. Ct. at 916. The NLRA similarly has as one of its goals the promotion of industrial peace through faithful performance of collective bargaining agreements. 29 U.S.C. § 151. We have seen that the Board has developed the single employer and alter ego theories in the context of unfair labor practice proceedings in which it is alleged that related employers have violated sections 8(a) (5) and (1) of the NLRA by failing to abide by the terms of a collective bargaining agreement entered into by one of them. Both of those theories are clearly designed to promote the faithful performance of a collective bargaining agreement not only by the signatory employer but also by a nonsignatory employer with the requisite high degree of consanguinity to the signatory employer. Assuming that we can successfully negotiate the shoals of Peter Kiewit and its offspring, we see no reason why the law developed by the Board and by federal appellate courts in that context should not be the substantive law applied in a suit under section 301 against related employers for breach of a collective bargaining agreement entered into by one of them, at least for the purpose of deciding whether the plaintiffs have failed to state a claim under section 301. Indeed, in view of the common goals of the LMRA and the NLRA and the existence of a substantial body of case law developed by the agency possessing special expertise in the area, there is every reason why the substantive law should be the same.\n\nWe recognize that the Board, in an unfair labor practice proceeding involving, e.g., single employer status, is operating under a statutory mandate (in section 9(b) of the NLRA) to determine whether the resulting unit is an appropriate unit and thereby to protect the section 7 rights of the employees involved. But we agree with the district judge that a district court in a section 301 case, although not operating under a specific statutory mandate such as section 9(b), should be similarly concerned about the section 7 rights of the employees. One of the principal policies of the national labor laws -- that embodied in section 7 -- is the protection of the exercise by workers of full freedom of association, self-organization, and designation of representatives of their own choosing for the purpose of negotiating the terms and conditions of their employment. 29 U.S.C. § 151. If, as the Supreme Court said in Lincoln Mills, 353 U.S. at 456, 77 S. Ct. at 917, we are to fashion the law under section 301 from the policy of our national labor laws, we cannot fail to honor and effectuate a policy so basic to those laws as the policy of protecting workers' rights of free association.\n\nThe defendants urge that the Unions have failed to state a claim under section 301 against Halmar simply because Halmar did not sign the collective bargaining agreement between Farnsworth and the Unions. But in order to accept this conclusion we would have to disregard the fundamental policies developed by the Board and by federal appellate courts in the unfair labor practice cases described in Parts II.C.1 and 2 of this opinion. The rights of the Unions and the obligations of Farnsworth and Halmar would then depend upon the forum in which the claims were asserted.\n\nThe Supreme Court addressed a similar problem in Howard Johnson Co. v. Detroit Local Joint Executive Board, 417 U.S. 249, 94 S. Ct. 2236, 41 L. Ed. 2d 46 (1974), a suit brought by a union under section 301 to compel Howard Johnson to submit to arbitration to determine the extent of its obligations to the employees of a company whose assets Howard Johnson had purchased. Howard Johnson had specifically refused to assume the selling company's collective bargaining agreement, which contained an arbitration clause. The district court nevertheless ordered Howard Johnson to arbitrate. The district court relied on the Supreme Court's decision in John Wiley \u0026 Sons, Inc. v. Livingston, 376 U.S. 543, 84 S. Ct. 909, 11 L. Ed. 2d 898 (1964), also a case under section 301 to compel arbitration; the court of appeals affirmed. Both the district court and the court of appeals recognized that the reasoning of Wiley was to some extent inconsistent with the Supreme Court's later decision in NLRB v. Burns International Security Services, Inc., 406 U.S. 272, 92 S. Ct. 1571, 32 L. Ed. 2d 61 (1972), but held that Wiley rather than Burns controlled. The two courts reasoned that Burns involved an NLRB order holding the successor employer bound by the substantive terms of the collective bargaining agreement with its predecessor (an order which the Supreme Court declined to enforce), whereas Howard Johnson, like Wiley, involved a section 301 suit to compel arbitration.\n\nThe Supreme Court rejected the lower courts' reasoning on this point. In its discussion of the issue, the Court said:\n\nAlthough this distinction was in fact suggested by the Court's opinion in Burns, see [406 U.S.] at 285-286 [92 S. Ct. at 1581], we do not believe that the fundamental policies outlined in Burns can be so lightly disregarded. In Textile Workers v. Lincoln Mills, 353 U.S. 448 [77 S. Ct. 912, 1 L. Ed. 2d 972] (1957), this Court held that § 301 of the Labor Management Relations Act authorized the federal courts to develop a federal common law regarding enforcement of collective-bargaining agreements. But Lincoln Mills did not envision any freewheeling inquiry into what the federal courts might find to be the most desirable rule, irrespective of congressional pronouncements. Rather, Lincoln Mills makes clear that this federal common law must be \"fashion[ed] from the policy of our national labor laws.\" Id., at 456 [77 S. Ct. at 917]. MR. JUSTICE DOUGLAS described the process of analysis to be employed:\n\n\"The Labor Management Relations Act expressly furnishes some substantive law. It points out what the parties may or may not do in certain situations. Other problems will lie in the penumbra of express statutory mandates. Some will lack express statutory sanction but will be solved by looking at the policy of the legislation and fashioning a remedy that will effectuate that policy.\" Id., at 457 [77 S. Ct. at 918].\n\nIt would be plainly inconsistent with this view to say that the basic policies found controlling in an unfair labor practice context may be disregarded by the courts in a suit under § 301, and thus to permit the rights enjoyed by the new employer in a successorship context to depend upon the forum in which the union presses its claims. Clearly, the reasoning of Burns must be taken into account here.\n\n417 U.S. at 255-56, 94 S. Ct. at 2239-2240 (footnote omitted). Similarly, we think that it would be inconsistent with the congressional mandate to fashion the law under section 301 from the policy of our national labor laws to say that the policies found controlling in the unfair labor practice context described supra may be disregarded by the district court in the present suit under section 301 and thus to permit the rights and obligations of the parties to vary with the forum.\n\nThe Court in Howard Johnson emphasized that\n\nin our development of the federal common law under § 301, we must necessarily proceed cautiously, in the traditional case-by-case approach of the common law. Particularly in light of the difficulty of the successorship question, the myriad factual circumstances and legal contexts in which it can arise, and the absence of congressional guidance as to its resolution, emphasis on the facts of each case as it arises is especially appropriate.\n\nId. at 256, 94 S. Ct. at 2240. The same can obviously be said for the single employer-alter ego questions presented by this case. At this preliminary stage of the litigation, and for the purpose of deciding whether the plaintiffs have failed to state a claim, we see no reason why the substantive law to be applied by the district court should differ from that applied by the Board in the unfair labor practice context described supra.\n\nThis brings us squarely to the question whether, as the district court held, a determination of the appropriateness of the bargaining unit by the district court would be an invasion of the exclusive province of the NLRB \"not distinguishable from that condemend by the Supreme Court in the Peter Kiewit case.\" 511 F. Supp. at 513.\n\n5. The Relevance of Peter Kiewit.\n\nThe defendants' position is that the plaintiffs' claims against Halmar must fail because the plaintiffs' claim under the single employer theory would require the district court to make a determination of the relevant bargaining unit before the NLRB has done so, and such a premature determination is forbidden by the Supreme Court's decision in Peter Kiewit. To hold Halmar (as a single employer with Farnsworth) to the 1977 collective bargaining agreement, say the defendants, it must be determined that Halmar's employees belong to the relevant bargaining unit represented by the Unions. This in turn requires that a determination of the appropriateness of that bargaining unit be made, and according to defendants, Peter Kiewit does not allow the federal courts to make de novo bargaining unit determinations. The plaintiffs argue in response that Peter Kiewit does not forbid such unit determinations in the present section 301 action for breach of contract.\n\nWe are in substantial agreement with the plaintiffs' position. As described above, in Peter Kiewit the union filed an unfair labor practice charge before the NLRB against a union contractor and a non-union contractor, alleging that they were a single employer and that the contract entered into by the union contractor was binding on the non-union contractor. The NLRB found that the two contractors were separate employers, thereby obviating the need to inquire into the appropriateness of the bargaining unit, and dismissed the complaint. The Court of Appeals for the District of Columbia Circuit reversed, holding that the two contractors were a single employer. Rather than remanding for a determination by the Board on the appropriateness of the bargaining unit, the court went on to hold that the unit was appropriate and that the two contractors had committed an unfair labor practice by refusing to recognize the union as the bargaining representative of the non-union contractor's employees or to extend to them the terms of the collective bargaining agreement.\n\nThe Supreme Court affirmed the circuit court's determination on the single employer issue but vacated its holding that the employees of the two companies constituted an appropriate bargaining unit. The Court held that the circuit court had invaded the statutory province of the NLRB under section 9(b) of the NLRA by proceeding to decide the unit question before the NLRB had passed upon the issue:\n\nWhether or not the Court of Appeals was correct in this reasoning, we think that for it to take upon itself the initial determination of this issue was \"incompatible with the orderly function of the process of judicial review.\" NLRB v. Metropolitan Ins. Co., 380 U.S. 438, 444 [85 S. Ct. 1061, 1064, 13 L. Ed. 2d 951] (1965). Since the selection of an appropriate bargaining unit lies largely within the discretion of the Board, whose decision, \"if not final, is rarely to be disturbed,\" Packard Motor Co. v. NLRB, 330 U.S. 485, 491 [67 S. Ct. 789, 793, 91 L. Ed.1040] (1947), we think the function of the Court of Appeals ended when the Board's error on the \"employer\" issue was \"laid bare.\" FPC v. Idaho Power Co., 344 U.S. 17, 20 [73 S. Ct. 85, 86, 97 L. Ed. 15] (1952).\n\nAs this Court stated in NLRB v. Food Store Employees, 417 U.S. 1, 9 [94 S. Ct. 2074, 2079, 40 L. Ed. 2d 612] (1974):\n\n\"It is a guiding principle of administrative law, long recognized by this Court, that 'an administrative determination in which is imbedded a legal question open to judicial review does not impliedly foreclose the administrative agency, after its error has been corrected, from enforcing the legislative policy committed to its charge.' FCC v. Pottsville Broadcasting Co., 309 U.S. 134, 145 [60 S. Ct. 437, 442, 84 L. Ed. 656] (1940).\"\n\nIn foreclosing the Board from the opportunity to determine the appropriate bargaining unit under § 9, the Court of Appeals did not give \"due observance [to] the distribution of authority made by Congress as between its power to regulate commerce and the reviewing power which it has conferred upon the courts under Article III of the Constitution.\" FCC v. Pottsville Broadcasting Co., 309 U.S. 134, 141 [60 S. Ct. 437, 440, 84 L. Ed. 656] (1940).\n\nPeter Kiewit, 425 U.S. at 805-06, 96 S. Ct. at 1844-1845.\n\nWe do not think that the second sentence in the portion of the opinion quoted above -- a sentence which is often quoted out of context -- stands for the proposition for which it and Peter Kiewit are cited by the defendants -- that the Board has exclusive jurisdiction to decide appropriateness of the bargaining unit issues. We think instead that the Court in Peter Kiewit was applying a time-honored principle relating to appellate review of an agency determination. When an agency, in order to grant relief in the case before it, must as a matter of statute find that both factual or legal conclusion A (e.g., single employer status) and factual or legal conclusion B (e.g., appropriateness of the bargaining unit) have been established, but concludes that A has not been established and therefore declines to consider whether B has been established, a reviewing court that reverses the conclusion that A has not been established must remand to the agency to permit it to consider in the first instance whether B has been established.\n\nSection 9(b), which is the source of the Board's responsibility in an unfair labor practice context to make a determination of the appropriateness of the bargaining unit in a single employer case such as Peter Kiewit, and which is set forth in the Supreme Court's opinion in Peter Kiewit directs the Board to \"decide in each case whether, in order to assure to employees the fullest freedom in exercising the rights guaranteed by [the NLRA], the unit appropriate for the purposes of collective bargaining shall be the employer unit, craft unit, plant unit or subdivision thereof . . . .\" 29 U.S.C. § 159(b) (emphasis added). Clearly section 9(b) refers only to cases pending before the Board under the NLRA. Neither section 9(b) nor the Supreme Court's decision in Peter Kiewit stands for the proposition that a federal court with jurisdiction under section 301 of the LMRA to decide cases alleging a breach of a collective bargaining agreement by related employers does not have jurisdiction to determine whether a bargaining unit comprising the employees of such employers is appropriate where such a determination is necessary to a resolution of the breach of contract issue that is consistent with national labor policy.\n\nWe note that in the present case there is no indication that either party has been before the Board seeking a certification or clarification of the relevant bargaining unit, nor to our knowledge is any such proceeding presently pending. Were such a circumstance present, our view of the proper role of the federal district court in that case might be very different. We do not deny that deference to the expertise of the Board in unit determinations should be encouraged whenever possible, and upon the initiation of clarification proceedings or the filing of an unfair labor practice by one of the parties to this action, depending upon how far these proceedings had progressed, the wisest course for the district court might well be to stay the action pending the Board's resolution of the unit issue.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Nor is this a case in which a unit determination has been made by the Board and a disgruntled party seeks to circumvent it through a de novo determination by a federal court under the guise of a section 301 action.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e In that case, as well, the outcome might be very different. We have before us a narrow set of circumstances in which neither side has sought to invoke the Board's powers to determine an appropriate bargaining unit, and a federal court is called upon to remedy an alleged breach of contract. We think that in this situation the district court may decide the appropriateness of the bargaining unit, where a decision on that issue is essential to a resolution of a breach of contract claim.\n\n6. Other Relevant Cases.\n\nSo great is the congressional commitment to judicial enforcement of contractual rights embodied in section 301 that the Supreme Court has upheld the jurisdiction of the federal courts under section 301 even in the face of the NLRB's exclusive jurisdiction to consider actions alleging unfair labor practices. Thus, pursuant to section 301, federal courts have independent jurisdiction to decide cases alleging breaches of collective bargaining agreements, even though a breach may also constitute an unfair labor practice:\n\nThe strong policy favoring judicial enforcement of collective-bargaining contracts [is] sufficiently powerful to sustain the jurisdiction of the district courts over enforcement suits even though the conduct involved [is] arguably or would amount to an unfair labor practice within the jurisdiction of the National Labor Relations Board.\n\nHines v. Anchor Motor Freight, Inc., 424 U.S. 554, 562, 96 S. Ct. 1048, 1055, 47 L. Ed. 2d 231 (1976). Accord, William E. Arnold Co. v. Carpenters District Council, 417 U.S. 12, 94 S. Ct. 2069, 40 L. Ed. 2d 620 (1974); Smith v. Evening News Association, 371 U.S. 195, 83 S. Ct. 267, 9 L. Ed. 2d 246 (1962); International Union v. E-Systems, Inc., 632 F.2d 487, 490 (5th Cir. 1980), cert. denied, 451 U.S. 910, 101 S. Ct. 1979, 68 L. Ed. 2d 298 (1981); NLRB v. George E. Light Boat Co., 373 F.2d 762, 767 (5th Cir. 1967). \"Indeed, so severely is the Board limited to the adjudication of statutory rights that it has no power to adjudicate contractual disputes.\" United Steelworkers v. American International Aluminum Corp., 334 F.2d 147, 152 (5th Cir. 1964), cert. denied, 379 U.S. 991, 85 S. Ct. 702, 13 L. Ed. 2d 611 (1965).\n\nWe have seen that in deciding whether a collective bargaining agreement has been breached, the federal courts have been directed by Congress to create a federal common law of contract, fashioned from the policy of our national labor laws, applicable to collective bargaining agreements. Lincoln Mills, supra 353 U.S. at 456-57, 77 S. Ct. at 917-918. We are faced here with one of the most fundamental questions that can arise in a contract suit, namely: who is bound by this contract? To say that the courts and not the Board are solely entitled to pass upon contractual disputes and at the same time to deny the courts the power to determine in a fashion consistent with the policy of our national labor laws the identity of the persons or entities obligated by the contract is self-contradictory. If anything, the power to enforce a contract must necessarily include the ability to decide who is bound by the contract. No question is more basic to the existence of contractual rights. Thus to the extent that the identity of the obligees is bound up in representational issues, the federal courts must be empowered to decide those issues for the purpose of determining contractual rights and obligations.\n\nThe language of the Supreme Court's opinions has been quite consistent with this reasoning. In Connell Construction Co. v. Plumbers Local Union No. 100, 421 U.S. 616, 95 S. Ct. 1830, 44 L. Ed. 2d 418 (1975), a general contractor sued under the antitrust laws to void an agreement it had entered into with a union whereby the contractor would only hire subcontractors who had collective bargaining agreements with the union. The union defended the agreement on the grounds that such agreements were explicitly made not unfair labor practices by a proviso to section 8(e) of the NLRA and therefore that antitrust policy should defer to labor policy. This circuit held that it could not address the issue since it would first require a decision whether there was an unfair labor practice under section 8(e), and such matters were within the exclusive province of the NLRB. The Supreme Court disagreed, and decided the issue, stating that \"this Court has held . . . . that the federal courts may decide labor law questions that emerge as collateral issues in suits brought under independent federal remedies, including the antitrust laws.\" 421 U.S. at 626, 95 S. Ct. at 1836 (footnote omitted) (citing Amalgamated Meat Cutters v. Jewel Tea Co., 381 U.S. 676, 684-688, 85 S. Ct. 1596, 1599-1601, 14 L. Ed. 2d 640 (1965) (opinion of White, J.); id. at 710 n.18, 85 S. Ct. at 1614 n.18 (opinion of Goldberg, J.); Vaca v. Sipes, 386 U.S. 171, 176-188, 87 S. Ct. 903, 909-915, 17 L. Ed. 2d 842 (1967); Smith v. Evening News Association, 371 U.S. 195, 83 S. Ct. 267, 9 L. Ed. 2d 246 (1962)).\n\nThe Court reiterated its Connell holding in Kaiser Steel Corp. v. Mullins, 455 U.S. 72, 102 S. Ct. 851, 70 L. Ed. 2d 833 (1982). There a coal producer sought to avoid payment of special contributions to employee health and retirement funds on the grounds that the clause in the collective bargaining agreement which required the contributions violated the \"hot cargo\" provisions of section 8(e) of the NLRA, as well as sections 1 and 2 of the Sherman Act. The trustees of the funds brought an action under section 301 and ERISA seeking to enforce the clause of the collective bargaining agreement. Both the district court and the District of Columbia Circuit refused to pass upon the labor issues presented. The Supreme Court held that the federal courts had jurisdiction to pass on the \"hot cargo\" claim as well as the antitrust claim, since they had \"a duty to determine whether a contract violate[d] federal law before enforcing it.\" 455 U.S. at 83, 102 S. Ct. at 859. In a similar vein, we think that a district court has a duty, in deciding under section 301 whether to enforce a collective bargaining agreement, to make that decision in a fashion consistent with the policies embodied in our federal labor laws.\n\nAlthough Connell involved a suit under the antitrust laws, we think its reasoning is applicable to the section 301 claim in this case. Moreover, Kaiser was a suit brought under both section 301 and ERISA. Our earlier discussion has adverted to Congress' intent that section 301 provide a contractual remedy independent of those available before the Board. Following Connell, we hold that where collateral issues of labor law, such as the determination of the appropriateness of a bargaining unit, become essential to the determination of the existence of a breach of contract under the independent federal remedy Congress created in section 301, a federal court may pass upon the issues under its congressional grant of jurisdiction notwithstanding the fact that a unit determination by the Board might be available if one of the parties filed an unfair labor practice charge or sought unit clarification.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nMoreover, the analysis suggested by Connell is even stronger when claims are brought under ERISA. There can be no doubt that ERISA provides a remedial scheme independent of the NLRA. To the extent that collateral labor law issues arise in the course of an ERISA claim, the federal courts should be empowered to decide them. This is especially so since it is not necessarily the case that the plaintiffs in an ERISA action will always be proper parties to a unit clarification petition before the Board.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe leading case taking a position contrary to ours is Local No. 3-193, International Woodworkers v. Ketchikan Pulp Co., 611 F.2d 1295 (9th Cir. 1980). In Ketchikan, a union and employer had signed a collective bargaining agreement; article I of this agreement recognized the union as the exclusive bargaining representative for all employees of various classifications at the employer's logging operations in southeastern Alaska. At the time the agreement was entered into the employer had one such logging operation; during the term of the agreement, the employer acquired several other logging operations in southeastern Alaska, but refused to recognize the union as the representative of the employees at those operations. Neither party sought relief from the NLRB. Instead the union filed an action, eventually transferred to federal court, under section 301, alleging a breach of the collective bargaining agreement.\n\nThe Ninth Circuit, while recognizing that Carey v. Westinghouse Electric Corp., 375 U.S. 261, 84 S. Ct. 401, 11 L. Ed. 2d 320 (1964), permitted arbitration as \"an appropriate alternative process for the resolution of representation issues,\" nevertheless found that \"there is a very, very strong policy of self-determination using the procedures vested in the NLRB . . . .\" 611 F.2d at 1298-99. The court characterized the plaintiff union's suit as an accretion case in disguise, in which\n\nthe Union is attempting an end run around Section 9 of the Act and under the guise of contract interpretation wants to avoid self-determination of a bargaining agent by a substantial number of employees and determination of an appropriate bargaining unit by the NLRB, which has primary authority in this area. This cannot be countenanced.\n\nId. at 1299-1300. The court in Ketchikan saw the union's suit as an attempt to enforce an accretion clause, as is clear from its reliance on cases such as Sheraton-Kauai Corp. v. NLRB, 429 F.2d 1352 (9th Cir. 1970), and Boire v. International Brotherhood of Teamsters, 479 F.2d 778 (5th Cir. 1973). The concern of the court is clearly stated in its opinion: accretion of the employees in the newer logging camps without an election to determine majority status would threaten a usurpation of section 7 rights. The decision in Ketchikan is interesting because, after its broad language stating its conclusion that \"Congress did not intend by enacting Section 301 to vest in the courts initial authority to consider and pass upon questions of representation and determination of appropriate bargaining units,\" 611 F.2d at 1301, the court did not simply dismiss the action. Instead, it stated:\n\nThe court does have jurisdiction to interpret Article I of the labor agreement between these parties. If it was the intention of the parties that said agreement be determinative of the appropriate bargaining area and unit, as applied to the independent logging camps (employees) outside Thorne Bay, Alaska, it is illegal and unenforceable. If it was the intention of the parties that said agreement be authority for the plaintiff to act as the collective bargaining agent for employees in logging camps outside Thorne Bay, Alaska, it is illegal and unenforceable. The sole operative effect, outside Thorne Bay, Alaska, of Article I of the agreement is to waive Ketchikan's right to demand an election as a method of proving majority support.\n\nId. The court then reversed the district court's dismissal of the section 301 action and remanded for further proceedings. Our view is that if the court decided that the contract did not make members of all the logging camps members of the same bargaining unit, it had already passed on an issue with representational overtones. If the court had no jurisdiction over representational matters and foresaw that its decision of the section 301 claims would require passing on such matters, its proper course would have been to dismiss without deciding anything. It did not do so, however, and we believe this fact belies its broad language about section 301 jurisdiction. In one sense the court's action here is reminiscent of the Supreme Court's decision in Kaiser Steel v. Mullins, discussed above, in which the Court felt compelled to decide the legality of a contractual provision notwithstanding the fact that this required determination of whether the provision authorized an unfair labor practice. To the extent that Ketchikan may be so viewed, it is actually consistent with the views we have expressed above.\n\nIn any case, the single employer theory we have discussed in this opinion does not rely on enforcement of any accretion clause in a collective bargaining agreement. The theory first requires a showing that the two subentities are a single employer and then requires a further independent determination that their employees constitute an appropriate bargaining unit. In fact, the presence of any contractually stipulated bargaining unit in the collective bargaining agreement of the union company is wholly irrelevant to the finding of single employer status. Once a finding of single employer status is made, the Board (or the district court in a section 301 context) must then consider the existence of a community of interests between the employees in both subentities. This is absolutely necessary in order to preserve the employees' section 7 rights -- rights which are firmly embedded in the national labor policy. The fact that an accretion clause might be present cannot settle the matter, and the Board and the courts have given little deference to such clauses. See note 17, infra. The decision that the employees of the two subentities constitute an appropriate unit is thus crucial to liability under the single employer theory we have outlined above. We agree with Ketchikan that this determination cannot be disguised in contractual garb but must be encountered head-on as a bona fide representational issue. But we also think that where such an issue is essential to the disposition of contractual rights in a section 301 action in a fashion consistent with the policy of our national labor laws, a district court has the power to decide it, at least in the absence of a previous or pending determination by the Board.\n\nWe do not think our own cases are contrary to this result. Florida Marble Polishers Health and Welfare Trust Fund v. Edwin M. Green, Inc., 653 F.2d 972 (5th Cir. 1981), cert. denied, 456 U.S. 973, 102 S. Ct. 2235, 72 L. Ed. 2d 846 (1982), discussed at note 17, infra, also invalidated a recognitional clause which a union sought to use to achieve an accretion without the need for a representational election. The court rejected use of the recognitional clause by itself to usurp section 7 rights, and also took pains to point out that neither a single employer or alter ego situation existed between the enterprises involved. 653 F.2d at 975-77. Thus we think its result entirely consistent with the views we express today.\n\nIn West Point-Pepperell, Inc. v. Textile Workers Union, 559 F.2d 304 (5th Cir. 1977), the employer, West Point, brought an action for declaratory and injunctive relief under section 301 after the union who was a party to its collective bargaining agreement, TWUA, merged into another union, ACTWU. West Point refused to bargain with ACTWU or pay dues to it, and sought a declaration that it was not bound under the contract to do so, since only TWUA could be the exclusive bargaining agent of its employees. After suit was filed, the surviving union (ACTWU) filed a petition with the NLRB for amendment of certification to reflect the merger and asked that the section 301 suit be dismissed or stayed pending disposition of the proceedings before the Board. On appeal, this court dismissed, stating that the question of who was the proper representative of West Point's employees under the contract was a matter for the Board's exclusive authority.\n\nTwo factors are important in understanding the result in West Point-Pepperell. First, during the district court's consideration of the section 301 claim, the controlling representational issue was simultaneously pending before the Board, a circumstance which is not present in this case.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Thus the decision in West Point-Pepperell is thoroughly consistent with our views and our disposition; the latter, as we have said before, only purports to deal with the situation where no action by the Board has taken or is taking place at all. Moreover, the decision in West Point-Pepperell sought to limit its holding to issues of union identity, as opposed to employer identity, which is the concern of this case:\n\nIn arguing that the district court has concurrent jurisdiction over these questions, the plaintiff relies on cases in which the district courts decided contests concerning successor employers under collective bargaining agreements. However, the determination of the successorship of unions differs significantly from that of employers. Federal labor laws are designed to assure and protect the fair representation of employees in labor disputes, and the selection of the employees' exclusive bargaining agent is a fundamental step in that process. Under Section 159 of the Act, Congress vested the NLRB with the exclusive authority to make the factual finding regarding the representative status of labor organizations. It is clear that wherever there is a change in the representation of a union, the board, and not the courts, is the proper body to reassess the change.\n\nId. at 307.\n\nId. at 307.\n\nIn conclusion, we hold that a section 301 claim for breach of contract may be stated either under an alter ego theory or under a single employer theory, and that in the latter case, a district court has jurisdiction to address the issue of the appropriateness of the bargaining unit, which is essential to success on that theory.\n\n7. Majority Status.\n\nThe defendants argue that even if Peter Kiewit poses no problems for the plaintiffs, there is still a major obstacle to the latter's ability to state a claim for relief under section 301 using either the single employer or alter ego theories. That obstacle is the fact that, according to defendants, the 1977 collective bargaining agreement is totally unenforceable until the Unions demonstrate majority status in the relevant bargaining unit. Understanding this problem, however, requires a brief explanation of the nature of prehire agreements such as the one involved in the present litigation.\n\nSection 8(f) of the NLRA, 29 U.S.C. § 158(f), permits an employer engaged in the building and construction industry to enter into a prehire agreement with a labor organization before the majority status of the organization has been established. Ordinarily, an agreement recognizing a union as the exclusive bargaining representative of an employer's work force when in fact only a minority of employees have authorized the union to represent their interests would constitute an unfair labor practice. NLRB v. Local Union 103, International Association of Bridge Workers (Higdon Construction Co.), 434 U.S. 335, 344, 98 S. Ct. 651, 657, 54 L. Ed. 2d 586 (1978); International Ladies' Garment Workers' Union v. NLRB, 366 U.S. 731, 737, 81 S. Ct. 1603, 1607, 6 L. Ed. 2d 762 (1961). This is because such an agreement would violate the guarantee of section 7 of the NLRA, 29 U.S.C. § 157, that employees shall have the right to bargain collectively with representatives of their own choosing. Section 9(a), 29 U.S.C. § 159(a), requires that the bargaining agent for all employees in the appropriate bargaining unit must be the representative \"designated or selected for the purposes of collective bargaining by the majority of the employees . . . .\" Section 8(f) is an exception to the general rule. It was designed\n\nto meet specific problems which had arisen in the construction industry under the prior law because of the transitory nature of the employer-employee relationship in that industry. . . . Prehire agreements which would otherwise be invalid were authorized in the construction industry because of the dual necessities (1) that construction bidders know in advance of bid what their labor costs would be, and (2) that construction employers have access to an available pool of skilled craftsmen for quick reference.\n\nNLRB v. Irvin, 475 F.2d 1265, 1267 (3d Cir. 1973). A panel of this circuit has noted, however, that \"the exception is limited . . . . by a concern for protecting the employees' section 7 rights: the prehire agreement attains the status of a collective bargaining agreement . . . . only upon a showing that the union enjoys majority support in the relevant bargaining units.\" Baton Rouge Building \u0026 Construction Trades Council v. E.C. Schafer Construction Co., 657 F.2d 806 (5th Cir. 1981). Moreover, the existence of a prehire agreement in no way bars either the employer or the union from calling for a bargaining representative election at any time. Higdon, 434 U.S. at 345, 98 S. Ct. at 657; 29 U.S.C. § 158(f) (proviso that no prehire agreement shall bar a petition filed pursuant to 29 U.S.C. §§ 159(c) and (e)).\n\nThe foregoing discussion of prehire agreements noted that such agreements ripen into fully enforceable collective bargaining agreements upon demonstration of a union majority. A question of some controversy is what force and effect the agreements have prior to that time. On the one hand, enforcement of provisions in an agreement with a minority union may potentially undercut the employees' section 7 rights of self-determination; on the other hand, holding the agreements totally unenforceable may permit employers to reap the benefits of a prehire agreement while avoiding any concomitant obligations.\n\nIn Higdon Construction Co., supra, the Supreme Court held that a prehire agreement between a union and employer did not protect the former from section 8(b) (7) (C) of the NLRA, 29 U.S.C. § 158(b) (7) (C), which prohibits picketing by a union that is not the authorized bargaining representative unless the union petitions the Board for a representative election within 30 days. The Supreme Court held that a section 8(f) prehire agreement is only a preliminary step in the creation of a collective bargaining relationship, and the agreement is voidable until majority status is reached. 434 U.S. at 341, 98 S. Ct. at 655. Hence the union could not treat the contract in the same fashion as a fully operational collective bargaining agreement and engage in recognitional picketing with impunity.\n\nHigdon arose in the context of an unfair labor practice charge filed by the employer; it thus did not directly address the purely contractual obligations of the parties. Lower courts have divided on the questions of when and to what extent a prehire agreement may be enforced in a breach of contract action before the attainment of majority status. See generally Todd v. Jim McNeff, Inc., 667 F.2d 800 (9th Cir.), cert. granted, U.S. , 102 S. Ct. 3508, 73 L. Ed. 2d 1382 (1982) (analyzing the various theories and collecting cases). In Baton Rouge Building and Construction Trades Council v. E.C. Schafer Construction Co., 657 F.2d 806 (5th Cir. 1981), we held that a prehire agreement to contribute fringe benefits was totally unenforceable until the date majority status was obtained. On the other hand, the Ninth Circuit has held in Todd, supra, that the fact that a prehire agreement is \"voidable\" under Higdon, 434 U.S. at 431, 98 S. Ct. at 655, means that it is enforceable until the employer specifically repudiates it (assuming, of course, that majority status still has not been reached by that point).\n\nAs certiorari has recently been granted in Todd to resolve the conflict in the circuits, it is fortunate that we need not pass on the enforceability questions presented here. We are concerned only with the question whether there is some set of facts, which, if proved, would entitle the plaintiffs to the relief requested, and the pleadings do not allege either majority status or its absence. If, upon factual development of the case, the plaintiffs can demonstrate that appropriate majority support exists or has existed, we do not think our holding in Schafer would per se bar the claims. Majority status issues may of course assume considerable importance later on in the course of this litigation, but at present we are unable to say that there is no set of facts with regard to majority status which, if proved, would entitle the plaintiffs to relief.\n\n8. The Relevance of a Unit Stipulation.\n\nSince we have held that a district court deciding a section 301 case may determine whether a bargaining unit is appropriate where a decision of that issue is essential to a resolution of a breach of contract claim, the plaintiffs' alternative argument that such a determination may not be necessary in this case loses its urgency. However, since the district court on remand will be applying, as the substantive law under section 301, the law developed by the Board in a similar context, it may be worthwhile to note briefly some of the circumstances under which no unit determination by the district court may be necessary. We have seen that prehire agreements become fully enforceable upon a demonstration of majority status in the appropriate bargaining unit. A natural question, then, arises as to how that bargaining unit is to be determined. One situation that often obtains is that the prehire agreement itself contains a description of the relevant unit agreed to by the union and the employer (or employers in the case of a multi-employer agreement). To give an example, the excerpts from the three collective bargaining agreements submitted by defendants to accompany their motion to dismiss\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e contain the following provisions:\n\nARTICLE I -- RECOGNITION\n\nSection 1. The Contractors, during the life of this Agreement, recognize the Unions as the exclusive bargaining representatives for all employees coming under the jurisdiction of the Unions for the purpose of collective bargaining in respect to rates of pay, wages, hours of employment and other conditions of employment.\n\nARTICLE II -- SCOPE OF AGREEMENT\n\nSection 1. The geographical scope of this Agreement shall be that part of the territory of the Carpenters District Council of New Orleans and Vicinity covered by the signatory Local Unions affiliated with the Carpenters District Council of New Orleans and Vicinity, as outlined on a map marked Appendix \"D\", attached hereto.\n\n1 Rec. 50, 90.\n\nSuch an informal stipulation is by no means uncommon and is, in the context of a prehire agreement, a perfectly natural occurrence. After all, the employer or employers seek a stable source of employees within a given geographical area; the union seeks eventual responsibility for representing a certain class of employees. Moreover, such agreements are not confined to situations involving prehire agreements. As one commentator has expressed it:\n\n[A] determination of the appropriate bargaining unit by the National Labor Relations Board is not a prerequisite to bargaining; an employer and a union are in most instances free to agree informally upon an appropriate unit and upon the commencement of bargaining for the employees in that unit.\n\nR. Gorman, Basic Text on Labor Law 66 (1976).\n\nThe Board will of course become involved in representation questions when it is requested to do so by the parties because there is a dispute over the proper bargaining unit. Our point, however, is that often there is no dispute, and in such cases a bargaining unit determination by the Board is totally unnecessary.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIn the present case, the plaintiffs argue that the appropriate bargaining unit is not contested by either party and has been contractually determined by the collective bargaining agreement. Based on the pleadings, we cannot tell whether this is or is not in fact the case. But if, upon further factual development, it turns out to be the case that Farnsworth and the Unions have stipulated as to the appropriate bargaining unit in the collective bargaining agreement between them, then the role of the district court will be more limited. As noted in Part II.C.2 of this opinion, if the district court finds that the plaintiffs have met the extremely stiff burden of proving that Halmar is the alter ego of Farnsworth, the district court will not be required to reconsider the unit under the community of interests test, but will simply make the far more limited determination whether the stipulated unit is repugnant to any policy embodied in the NLRA. If, on the other hand, the plaintiffs fail to establish that Halmar is the alter ego of Farnsworth but do succeed in establishing that Farnsworth and Halmar are a single employer, then the district court's function with respect to the appropriateness of the unit as regards Farnsworth's employees is limited in the same way as the Board's function is limited. However, because the section 7 rights of the employees of both Farnsworth and Halmar are potentially threatened if the recognition clause in the Farnsworth-Union agreement is applied to a unit comprising the employees of both, an independent determination into the appropriateness of that unit must be made by the district court before Halmar will be bound to that agreement.\n\nIII. THE ERISA CLAIMS\n\nBoth the Unions and the Funds bring claims under ERISA, 29 U.S.C. §§ 1001-1461; they claim that \"the defendants\" have failed to make proper contributions to the pension, health, and welfare benefit funds on behalf of their employees which were required by the collective bargaining agreement between Farnsworth and the Unions. The statute states that:\n\n(a) A civil action may be brought --\n\n(1) by a participant or beneficiary --\n\n(B) to recover benefits due to him under the terms of his plan, to enforce his rights under the terms of the plan, or to clarify his rights to future benefits under the terms of the plan;\n\n(3) by a participant, beneficiary, or fiduciary (A) to enjoin any act or practice which violates any provision of this subchapter or the terms of the plan, or (B) to obtain other appropriate equitable relief (i) to redress such violations or (ii) to enforce any provisions of this subchapter or the terms of the plan . . . .\n\n29 U.S.C. §§ 1132(a) (1) (B), (3).\n\nDefendants have not contested the standing of the Unions or the Funds under section 1132 and we assume without deciding that they are participants, beneficiaries, or fiduciaries within the meaning of that section. Cf. International Association of Bridge Workers, Local No. 111 v. Douglas, 646 F.2d 1211, 1214 (7th Cir.), cert. denied, 454 U.S. 866, 102 S. Ct. 328, 70 L. Ed. 2d 166 (1981).\n\nThe district court held that the ERISA claims failed as to AGC-New Orleans and AGC-At Large because they were not signatories to the collective bargaining agreement, and the plaintiffs have not contested the dismissal as to these two defendants. Because the claims have been abandoned as to these two defendants, we express no opinion on the correctness of the district court's holding. However, the district court also dismissed the ERISA claims against Halmar and Farnsworth, and the plaintiffs do contest these dismissals.\n\nThe district court apparently dismissed the ERISA claims against Farnsworth because it assumed that the pleadings only complained of failure to contribute on behalf of Halmar's employees. 511 F. Supp. at 514. As we have pointed out above, this is too narrow a reading of the claim that the defendants have not made required contributions. Dismissal on this ground was premature and we think that the plaintiffs should be given a chance to prove that Farnsworth did not contribute benefits on behalf of those employees who everyone agrees are Farnsworth's own.\n\nAs to Halmar, the court applied the same type of analysis it had employed in dismissing the section 301 claim against Halmar:\n\nThe Court's analysis of the Section 301 allegations is equally applicable in the ERISA context. Accordingly, the alleged ERISA liability could only arise if Farnsworth and Halmar are not only a \"single employer\" but, in addition, constitute a single bargaining unit. As this status decision is relegated to the N.L.R.B., plaintiffs cannot have it decided by the Court in the first instance.\n\n511 F. Supp. at 514-15 (emphasis in original). The court then dismissed the ERISA claims against Halmar. Id. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e We agree that the analysis of the section 301 allegations involved here will be generally applicable to the ERISA action based on the same circumstances. However, since our analysis of the section 301 allegations differs from that of the district court, naturally so does our view of the ERISA claims.\n\nWe are here concerned with the question whether there has been a breach of a contractual duty to provide benefits to Farnsworth's employees. In our view, if the plaintiffs can show that Halmar is a sham, a disguised continuance used by Farnsworth to escape its obligations under the collective bargaining agreement and ERISA, they can succeed in their claims against Halmar. Because the pleadings, liberally construed, allege this theory, the plaintiffs state a cause of action under ERISA as well as section 301. Moreover, since we are of the opinion that a finding that Halmar and Farnsworth are a single employer and that their employees constitute an appropriate bargaining unit would make contractual obligations to contribute benefits on behalf of employees binding on Halmar, an ERISA cause of action is also stated based on this theory as well.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIV. EXHAUSTION OF CONTRACTUALLY MANDATED GRIEVANCE PROCEDURES.\n\nThe district court gave as an alternative ground for dismissal of the plaintiffs' complaint the failure by the Unions and the Funds to exhaust grievance procedures outlined in the collective bargaining agreement covering the period May 1, 1977 to April 30, 1980. The defendants submitted selected pages from this agreement along with their motions for dismissal and summary judgment.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nAccompanying the portions of the agreement was an affidavit from H. Pratt Farnsworth, Jr., president of Pratt-Farnsworth, Inc. In this affidavit, Farnsworth stated that \"at no time did any of the Plaintiffs in the instant lawsuit bring or attempt to bring a grievance on the matters which are the subject of this lawsuit.\"\n\nIt is clear from the district court's opinion that these matters, which were outside of the original pleadings, were considered by the court and were a basis for its decision. Hence we must view the district court's disposition of these claims as the grant of a motion for summary judgment. Such a motion is proper only where there are no matters open to factual dispute. In the present case we think such a holding was premature.\n\nWe first note that by the terms of the agreement the grievance procedures are applicable with respect to alleged claims of violation of a particular provision of the agreement, other than article III. Unfortunately, defendants did not provide us with a copy of article III, so we are unable to discover what subjects are in fact excluded from the arbitration provisions of the agreement. Second, we find that the language of section 2, 7 and 8 of the agreement raises questions of interpretation and possible waiver which we do not think were adequately addressed by the district court. Section 7 states that an employee with a grievance must file it in writing with the union within five working days of the occurrence of the event giving rise to the grievance or risk waiver. Section 2 says that any party (including, it is presumed, the Unions themselves) may resort to arbitration and the other party is then required to arbitrate the matter. However, section 8 provides that failure to refer the grievance to arbitration within thirty days after it occurs results in waiver of the grievance. The record does not show an invocation of grievance mechanisms by any of the parties to this litigation. The district court's opinion does not appear to have considered the effect of the seemingly non-mandatory language of the arbitration provisions as they relate to parties who are not employees coupled with the language of section 8 regarding waiver. We think the failure to address these issues together with the incomplete nature of the record before us and before the district court made summary disposition inappropriate.\n\nWe express no opinion on the outcome of these issues. We do think that on remand the district court should closely examine the language of the entire contract. We also think that the district court should separate for purposes of analysis (1) the Unions' claims against Farnsworth, (2) the Unions' claims against Halmar, and (3) the Funds' claims against both defendants. As to the distinction between (1) and (2), we note that the arbitrability of a claim that contributions are not being made on behalf of employees who no one contests belong to Farnsworth may involve very different issues from the question of arbitrability of a claim of non-payment on behalf of employees where it is disputed in the first place whether the employees are in fact employed by a party who is bound by the terms of the agreement. In this regard a significant problem is raised by Halmar's denial that it can in fact be bound by arbitration provisions in a collective bargaining agreement it claims it never signed. Compare International Union of Operating Engineers, Local 279 v. Sid Richardson Carbon Co., 471 F.2d 1175, 1177-78 (5th Cir. 1973) (even standard of \"arguable arbitrability\" which favors arbitration in the doubtful case does not justify construing arbitration clause of limited scope into one which permits arbitration of representation questions, especially where history of bargaining relationship refutes an intent to arbitrate such questions), with Local No. 6, Bricklayers International Union v. Boyd G. Heminger, Inc., 483 F.2d 129 (6th Cir. 1973) and Iron Workers, Local 790 v. Bostrom-Bergen, 105 L.R.R.M. 2633 (N.D.Cal.1980) (ordering arbitration where unions sought to compel arbitration with nonsignatory alter ego employer because it was identical with signatory employer). On the one hand, the Unions' claim that Halmar and Farnsworth are one might, on the logic of the last two cases, seem to preclude the Unions from claiming that they need not attempt to arbitrate with what they claim is one party fully bound by the agreement. On the other hand, these last two cases involved situations in which the unions sought arbitration with non-signatories because they claimed the non-signatories were none other than the signatory employers, while the instant case involves a non-signatory demanding that a union seek arbitration while at the same time denying that it (the non-signatory) could be bound by such arbitration, as it was not a party to the collective bargaining agreement. See Teamsters Local Unions v. Braswell Motor Freight Lines, Inc., 395 F.2d 655, 656 (5th Cir. 1968). Our point is that the question of arbitrability of the Unions' claims against Halmar involves issues not present in the arbitrability question with respect to contributions made by Farnsworth on behalf of what everyone acknowledges are Farnsworth's employees. Although the respective answers to the two questions may or may not be the same (an issue we specifically do not decide), the paths to those answers must be very different.\n\nA further distinction in analysis must also be observed in the question whether the Funds must exhaust contractually mandated grievance procedures with respect to the section 301 claims, the ERISA claims, or both. The Funds, after all, were not signatories to the collective bargaining agreement under anyone's view of the matter. The district court believed that if the Unions were required to exhaust contractual grievance remedies, the Funds would be equally obligated to do so. As we remand the questions of the Union's obligation back to the district court, we do likewise with the question of the obligation of the Funds. The district court may then examine afresh whether the Unions and the Funds must be dumped into the same hopper for exhaustion purposes.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nV. THE ANTITRUST CLAIMS.\n\nThe plaintiffs have made numerous allegations in their original complaint to the effect that the four named defendants in this case have engaged in an unlawful combination and conspiracy in restraint of interstate commerce and trade in violation of the Clayton and Sherman Antitrust Acts. The chief theme running throughout these allegations is that the defendants have entered into agreements among themselves and with construction employers in the New Orleans area to hire only non-union contractors and subcontractors. The plaintiffs complain that the defendants' actions have undermined the collective bargaining agreements in effect between the Unions and construction employers, resulting in reduced work opportunities, lower wages, less favorable working conditions, and a diminution in fringe benefits for the Unions' members.\n\nThe district court dismissed the plaintiffs' antitrust claims for two reasons. First, it concluded that the defendants' conduct fell within the nonstatutory labor exemption to the antitrust laws. 511 F. Supp. at 515-18. Second, the court expressed doubt whether the alleged acts of the defendants even constituted the type of conduct that the antitrust laws were enacted to proscribe. Id. at 518-22.\n\nWe will address each of these holdings in turn, considering whether or not the plaintiffs have stated a valid cause of action under the antitrust laws. In determining whether the district court acted properly in dismissing the plaintiffs' claims, we are reminded that we are bound to view their allegations in a liberal fashion: \"We believe that summary procedures should be used sparingly in complex antitrust litigation where motive and intent play leading roles, the proof is largely in the hands of the alleged conspirators, and hostile witnesses thicken the plot.\" Poller v. Columbia Broadcasting System, Inc., 368 U.S. 464, 473, 82 S. Ct. 486, 491, 7 L. Ed. 2d 458 (1962) (footnote omitted). Indeed, this court has noted repeatedly that \"although plaintiffs may be unable to allege facts proving actual acts of [an antitrust] agreement or conspiracy, the pleadings are sufficient [to withstand a motion to dismiss] if they set forth facts from which an inference of unlawful agreement can be drawn.\" Brett v. First Federal Savings \u0026 Loan Association, 461 F.2d 1155, 1158 (5th Cir. 1972).\n\nA. The Labor Exemptions to the Antitrust Laws\n\nThe district court dismissed the plaintiffs' antitrust claims primarily on its belief that, even if the allegations were taken as true, the defendants' conduct was protected by the nonstatutory labor exemption to the antitrust laws. 511 F. Supp. at 515-19. In their brief on this appeal, the defendants rely on both the statutory and nonstatutory labor exemptions to the antitrust laws as a defense.\n\nIn Connell Construction Co. v. Plumbers Local Union No. 100, 421 U.S. 616, 95 S. Ct. 1830, 44 L. Ed. 2d 418 (1975), the Supreme Court explained the two categories of organized labor's exemption from federal antitrust laws. The Court noted that the statutory exemption derives from three federal statutes: section 6 of the Clayton Act, 15 U.S.C. § 17; section 20 of the Clayton Act, 29 U.S.C. § 52; and section 4 of the Norris-LaGuardia Act, 29 U.S.C. § 104. \"These statutes declare that labor unions are not combinations or conspiracies in restraint of trade, and exempt specific union activities, including secondary picketing and boycotts, from the operation of the antitrust laws.\" Connell Construction Co., 421 U.S. at 622, 95 S. Ct. at 1835. The Court went on to state that a proper accommodation between the congressional policies favoring collective bargaining under federal labor statutes and favoring free competition in the business market required that certain union-employer agreements be accorded a limited nonstatutory exemption from the antitrust laws:\n\nThe nonstatutory exemption has its source in the strong labor policy favoring the association of employees to eliminate competition over wages and working conditions. Union success in organizing workers and standardizing wages ultimately will affect price competition among employers, but the goals of federal labor law never could be achieved if this effect on business competition were held a violation of the antitrust laws.\n\nId.\n\nWe cannot agree that the defendants' alleged conduct is protected by either the statutory or nonstatutory labor exemption to the antitrust laws. These exemptions are for the benefit of employees and their unions, and offer no shelter for the acts of employers, except perhaps only incidentally.\n\nThe nonstatutory labor exemption, as recognized by the Supreme Court, has only been invoked in situations where a union has made some sort of agreement with an employer that has a deleterious antitrust effect on other unions or employers. As noted earlier and emphasized again, Connell Construction Co. teaches that \"a proper accommodation between the congressional policy favoring collective bargaining under the NLRA and the congressional policy favoring free competition in business markets requires that some union-employer agreements be accorded a limited nonstatutory exemption from antitrust sanctions.\" Id. (emphasis added). This concept that the nonstatutory labor exemption applies only to union agreements with nonlabor groups was recently reiterated by the Supreme Court in H.A. Artists \u0026 Associates, Inc. v. Actors' Equity Association, 451 U.S. 704, 716-17 n. 19, 101 S. Ct. 2102, 2110 n. 19, 68 L. Ed. 2d 558 (1981).\n\nIn the present case, the only alleged agreement or conspiracy is one between employers and the multiemployer bargaining organizations of which they are members. The antitrust claims do not allege that any of these defendants have entered into agreements with any unions; thus, the nonstatutory exemption should not come into play under these facts. Berman Enterprises, Inc. v. Local 333, United Marine Division, 644 F.2d 930, 935 n. 6 (2d Cir.), cert. denied, 454 U.S. 965, 102 S. Ct. 506, 70 L. Ed. 2d 381 (1981); Mackey v. National Football League, 543 F.2d 606, 613-14 \u0026 n. 12 (8th Cir. 1976), cert. dismissed, 434 U.S. 801, 98 S. Ct. 28, 54 L. Ed. 2d 59 (1977). The \"benefits to organized labor cannot be utilized as a cat's-paw to pull employers' chestnuts out of the antitrust fires.\" United States v. Women's Sportswear Manufacturers Association, 336 U.S. 460, 464, 69 S. Ct. 714, 716, 93 L. Ed. 805 (1949).\n\nLikewise, the statutory labor exemption affords no haven for the defendants. It is well settled that the statutory exemption does not apply when a union combines with a non-labor group to restrain trade. H.A. Artists \u0026 Associates, Inc. v. Actor's Equity Association, supra; Allen Bradley Co. v. International Brotherhood of Electrical Workers, 325 U.S. 797, 65 S. Ct. 1533, 89 L. Ed. 1939 (1945); United States v. Hutcheson, 312 U.S. 219, 61 S. Ct. 463, 85 L. Ed. 788 (1941). \"A fortiori, if the statutory exemption is inapplicable to business group conspiracies involving unions, the exemption cannot be read to immunize anti-competitive conduct on the part of employers acting alone.\" California State Council of Carpenters v. Associated General Contractors, Inc., 648 F.2d 527, 534 (9th Cir. 1980), cert. granted, 454 U.S. 1141, 102 S. Ct. 998, 71 L. Ed. 2d 292 (1982).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nB. Do the Plaintiffs State a Valid Antitrust Claim?\n\nNext we must consider whether, questions of antitrust exemption aside, the plaintiffs have stated a cause of action under the antitrust laws. The plaintiffs' antitrust claims consist of allegations that the four named defendants have conspired to restrain interstate commerce and trade in violation of the Clayton and Sherman Acts:\n\n10. . . . .\n\nSuch acts, conspiracies and monopolies were between the named defendants and consist of:\n\n(a) To help and control and monopolize construction jobs in New Orleans and vicinity.\n\n(b) To eliminate the Plaintiff-Union from the building and construction industry in New Orleans and vicinity by entering into agreements with owners and builders, whereby such owners and builders utilize contractors who do not have agreements with the Plaintiff-Union.\n\n(i) The defendants jointly and in concert have conspired and schemed effectively to have other union contractor-members of the AGC to [sic] engage in a pattern and practice of creating so called \"double-breasted\" contractors for the purpose of evading obligations under the Craft Agreement.\n\n11. . . . .\n\nPlaintiffs show further to the Court that defendants and each of them are guilty of the violations of the Anti-Trust laws as hereinabove set out, and that said Employers-Defendants are engaged in the construction industry and have maintained membership in various open-shop associations purportedly representing the building construction industry with the main purpose of eliminating membership in or the use of members of the Plaintiff Unions, secure favored economic conditions and gain market domination.\n\n12. Such associations and its [sic] employer members are not immune from Anti-Trust Laws since by illegally combining to agree to pay lower wages and conditions by monopolizing the New Orleans and vicinity building and construction industry, it would be restraining competition and raising prices by the restraining of competition. The defendant AGC Contractors have illegally combined and agreed to this monopoly by open-shop contractors, notably those represented by the At Large District of the AGC of Louisiana, Inc., so as themselves [sic] would be able to be given a share of this market from owners and builders who do not wish to do business with contractors having collective bargaining agreements with your plaintiff.\n\n1 Rec. 5-7.\n\nThese pleadings allege a concerted refusal to deal and an attempted monopolization of a segment of construction jobs in the New Orleans area. The stated purpose of these restraints is to weaken the power of the Unions and their ability to represent employees with respect to wages and working conditions. However, in order for a restraint of trade to be actionable under the Sherman Act there must be a restraint upon commercial competition in the marketing of goods or services. Apex Hosiery Co. v. Leader, 310 U.S. 469, 495, 60 S. Ct. 982, 993, 84 L. Ed. 1311 (1940). We have held in Prepmore Apparel, Inc. v. Amalgamated Clothing Workers, 431 F.2d 1004, 1006-07 (5th Cir. 1970), cert. dismissed, 404 U.S. 801, 92 S. Ct. 21, 30 L. Ed. 2d 34 (1971), that Apex requires such a restraint whether the restraint is caused by a labor organization or an employer.\n\nPrepmore involved a complaint by a union that an employer had conspired with an out-of-state company to injure the union and destroy its operations in Russelville, Alabama by a refusal to deal with the union concerning wage rates and working conditions. A panel of this circuit dismissed the claim of a concerted refusal to deal as not stating a claim under the Sherman Act: \"There is no indication, however remote, of Prepmore [the in-state employer] and Blue Bell [the out-of-state employer] to restrain competition in the marketing of Prepmore's goods.\" 431 F.2d at 1007. It is true that a concerted refusal to deal with a union may result in a restraint on competition in the marketing of labor; it may have anticompetitive effects on wages and working conditions (as does the existence of a successful union itself). However, this anticompetitive effect is not enough without more to fulfill the requirements of the Sherman Act.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe Supreme Court's decision in Connell Construction Co. v. Plumbers Local Union No. 100, 421 U.S. 616, 95 S. Ct. 1830, 44 L. Ed. 2d 418 (1975), is instructive on this point. In Connell it was alleged that the union attempted to picket general contractors to coerce them into hiring only subcontractors who had signed collective bargaining agreements with the union. There was no attempt to picket the general contractors because they themselves did not hire union labor. A general contractor, Connell, signed an agreement stating it would hire only signatory subcontractors and then sued to void the agreement on the grounds that it violated the Sherman Act. The Supreme Court held that a cause of action under the Sherman Act was stated \"because it [the agreement] has a potential for restraining competition in the business market in ways that would not follow naturally from elimination of competition over wages and working conditions.\" 421 U.S. at 635, 95 S. Ct. at 1841.\n\nUnder Apex Hosiery, a conspiracy by the union and employees of nonsignatory subcontractors to picket and harrass such subcontractors into becoming signatories would not state a violation of the antitrust laws; the purpose and effect of the conspiracy is merely to eliminate competition over wages and working conditions. However, in Connell, the union attempted to achieve a similar result through a different means. Instead of picketing the offending subcontractors, the union picketed the general contractors who hired them. The resulting union-general contractor agreement was designed to eliminate competition over wages and working conditions at the level of subcontractor employees, but it did so by cutting off contracting jobs to non-signatory subcontractors. This approach did violate the antitrust laws, for it created a restraint on competition between competing providers of subcontracting services. This was a deliberate restraint on commercial competition, even though the ultimate purpose of the restraint was to effect a restraint on what would not be considered commercial competition under the meaning of the Sherman Act.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIn the present case, it is clear that the major concern of the plaintiffs is the effect the defendants' alleged conspiracy will have on the ability of the unions to represent their member employees. Thus, to the extent that these pleadings allege merely a concerted refusal to deal with the unions in an attempt to restrain competition in wages and working conditions, the pleadings do not state a cause of action under the antitrust laws.\n\nThe pleadings need not be read so narrowly, however. Although most of the plaintiffs' antitrust pleadings clearly do not allege antitrust injury, and we certainly do not endorse them as examples of well pled antitrust allegations, this does not relieve us of the responsibility of considering whether any proper theory of relief is pled. As we have explained above, antitrust allegations in particular are to be construed liberally. Moreover, as we have stressed continually, \"it is axiomatic that a complaint should not be dismissed unless 'it appears beyond doubt that the plaintiff can prove no set of facts in support of his claim which would entitle him to relief.'\" McLain v. Real Estate Board, Inc., 444 U.S. 232, 246, 100 S. Ct. 502, 511, 62 L. Ed. 2d 441 (1980) (quoting Conley v. Gibson, 355 U.S. 41, 45-46, 78 S. Ct. 99, 101-02, 2 L. Ed. 2d 80 (1957)).\n\nCloser inspection of the pleadings reveals two theories which do allege anticompetitive effects outside of the labor market per se. The first is that defendants have engaged in a concerted refusal to deal not with the Unions themselves, but with other contractors who hire union workers. The second involves a concerted refusal to deal with contractors who do not create \"double breasted\" union-non-union arrangements.\n\nThe analysis behind these two theories runs as follows: Assume that, as pled, the goal of defendants is to weaken the position of the Unions in the New Orleans construction industry. A concerted refusal among all contractors to deal with the Unions would accomplish this result, and would not, under Prepmore, state a cause of action under the Sherman Act. However, where some of the contractors are already hiring union members, another strategy might be invoked; this would be to try to drive those signatory contractors out of business or convince them to mend their ways in the future.\n\nThe plaintiffs' allegations in section 10(b) of their pleadings state one way in which this can be done: an agreement between builders in the area and non-signatory contractors that the builders will give work only to contractors who hire only non-union labor. Such an agreement intends a clear anticompetitive effect in the area of commercial competition; i.e., competition between building contractors for their services. Contractors who use union labor are put at a disadvantage because their source of supply of available construction jobs is narrowed or eliminated. Some of these contractors may be more efficient than nonsignatory contractors either because the union labor is more productive per man-hour. In any case the agreement would act as a barrier to entry by conceivably more efficient firms who seek to utilize union labor.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe concerted activity complained of may be the result of a direct agreement between non-signatory contractors and builders to force signatory contractors out of business; on the other hand, it may consist of an agreement between only non-signatory contractors to use their share of the market to coerce the builders into the same. See California State Council of Carpenters, supra, at 531. The plaintiffs' pleadings allege both possibilities. Moreover, the pleadings allege a concerted refusal to deal both in the context of forcing out signatory contractors or coercing them to adopt the same sort of \"double breasted\" arrangement complained of in this case. The crux of all these different variations of the basic theory is that pressure is being applied not on the Unions directly, but indirectly by means of direct anticompetitive action against the signatory employers of union members.\n\nSuch allegations, if true, do involve an anti-competitive restraint in the area of competition for services of contractors. It may be objected that although this is the effect of the alleged agreements, the real purpose of the agreement is to get at the Unions. The non-signatory contractors are merely stepping over the corpses of the signatory contractors on their way to domination of the labor market; such domination is not within the ambit of the antitrust laws under Prepmore and Apex Hosiery, and so no claim exists under the Sherman Act.\n\nHowever, precisely this sort of argument was rejected in Connell. As we described above, the union was not protected in that case although its ultimate purpose was domination of the labor market, which was legal. The method by which it achieved that end was the creation of a direct anticompetitive restraint on the market for subcontracting services. It was the means, and not the ultimate end, which subjected it to antitrust liability. Although a restraint at the level of the labor market itself does not state a claim of violation of the antitrust laws, a restraint at the level of subcontractor or contractor services does state such a claim.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Thus plaintiffs' antitrust claims must survive a dismissal under Rule 12(b) (6) to the extent that they allege anticompetitive restraints at the contractor services level.\n\nC. Standing Issues on Remand\n\nAlthough we have held that a cause of action exists under the antitrust laws because of restraints at the level of contractor services, we wish to clarify our analysis further by explicitly separating our views on the existence of a cause of action from the question of standing. None of the defendants has challenged the standing of any of the plaintiffs to bring an antitrust action, but instead all have focused on the existence of a cause of action. Our analysis has established that Connell seems to allow a cause of action against the defendants. However, that analysis does not necessarily point to the Unions or the Funds as the natural plaintiffs who are entitled to bring that cause of action. Rather, the most obvious candidates for standing are those most directly injured at the contractor services level: the signatory contractors themselves.\n\nJudge Sneed's dissent in California State Council of Carpenters, supra, quite rightly focuses on this very problem. Interestingly enough, he concedes that a reading of the complaint in that case as an allegation of restraints against signatory contractors may constitute a bona fide antitrust claim. That is in fact what we have held today. But the real problem with this theory, he insists, is not lack of antitrust injury but lack of standing:\n\nThe majority also construes the complaint to allege a boycott of employers which have collective bargaining relationships with the plaintiffs. Here a significant injury to the employers is properly alleged. But this construction of the complaint raises a standing problem. As the majority point out, \"In this circuit, legal causation has traditionally been judged under the so-called 'target area test.'\" P 537. Under the two-step analysis required by this test, the employers which are directly harmed by the alleged boycott have standing to sue under the Sherman Act. According to the majority so also do the plaintiffs. Under the \"target area test,\" as employed by the majority, both have standing. This is an anomalous result. Instantly it raises the possibility of standing for antitrust purposes of employees, whether unionized or not, whose employer is injured in his business by an unlawful conspiracy.\n\n648 F.2d at 543.\n\nJudge Sneed's point is well taken. Although our understanding of the rationale behind Connell leads us ineluctably to the conclusion that a cause of action exists, we are in agreement that the issues regarding standing are conceptually distinct. As the standing issue has been neither addressed nor briefed by either of the parties, we think it wise simply to direct it to the district court's attention on remand, so that the court can determine which of the Unions or Funds are proper parties to this case after full development of the factual and legal issues by the parties. Cf. Martin v. Morgan Drive Away, 665 F.2d 598, 606-07 (5th Cir. 1982) (remand to address standing issues after development of record); Chatham Condominium Associations v. Century Village, Inc., 597 F.2d 1002, 1012 (5th Cir. 1979) (dismissal for lack of subject matter jurisdiction \"should be granted sparingly,\" and only after complete development of jurisdictional facts should a district court dismiss an antitrust case).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nVI. SUMMARY OF OUR DISPOSITION OF THIS CASE.\n\nWe hold that:\n\nA. The dismissal of the section 301 claims against defendants AGC-New Orleans and AGC-At Large is AFFIRMED.\n\nB. The dismissal of\n\n(1) the section 301 and ERISA claims against Halmar,\n\n(2) the section 301 and ERISA claims against Farnsworth, and\n\n(3) the antitrust claims against all defendants is REVERSED,\n\nand the case is remanded for further proceedings consistent with this opinion.\n\nAFFIRMED IN PART, REVERSED IN PART.\n\nDisposition\n\nAFFIRMED IN PART, REVERSED IN PART.\n\n\u003cspan class=\"fn\"\u003e1. A \"double breasted\" or \"open shop-closed shop\" operation is one in which an employer is able to compete for both union and non-union work. For example, a subcontractor may operate one corporation hiring strictly union employees; this corporation will bid on jobs from general contractors who let contracts only to unionized subcontractors. At the same time, the subcontractor will operate another corporation that hires only non-union employees; this corporation will bid on work from general contractors who use non-union workers. Florida Marble Polishers Health \u0026 Welfare Trust Fund v. Edwin M. Green, Inc., 653 F.2d 972, 976 n.7 (5th Cir. 1981), cert. denied, 456 U.S. 973, 102 S. Ct. 2235, 72 L. Ed. 2d 846 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Attached to these motions were two affidavits. The first affidavit was executed by Robert Farnsworth as President of Halmar stating that Halmar had never signed a collective bargaining agreement with the Unions. The second affidavit by H. Pratt Farnsworth, Jr., Vice-President of Farnsworth, admitted that Farnsworth was a signatory to the collective bargaining agreement with the Unions. It stated, however, that none of the plaintiffs had ever attempted to file a grievance with Farnsworth pursuant to the contractual dispute mechanism contained in the agreement. Attached to this second affidavit were selected portions of the bargaining agreement in question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Plaintiffs also filed a statement in opposition to the defendants' pending motions. Attached to this statement were two affidavits. The first was a sworn statement from the organizer of one of the Unions, Michael A. Laborde, attesting to the relationship between Farnsworth and Halmar. The second was a sworn statement from Simon Paulino, Jr., also an organizer for the same Union, similarly describing the Farnsworth-Halmar relationship and explaining the role of the two AGC defendants in the Louisiana construction industry.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The district court granted dismissals of several claims on several different grounds. In some cases it was clear that the dismissals rested on the lack of a cause of action. In others, the district court dismissed claims because it believed that it lacked subject matter jurisdiction. Where the existence of a cause of action is inextricably bound up with the question of this court's subject matter jurisdiction, we treat the dismissal as one on the merits under Rule 12(b) (6) or as a grant of summary judgment under Rule 56. Williamson v. Tucker, 645 F.2d 404 (5th Cir.), cert. denied, 454 U.S. 897, 102 S. Ct. 396, 70 L. Ed. 2d 212 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. According to our research, apparently only one Fifth Circuit decision has addressed (and it did so in a different context than we face here) the question whether a section 301 claim may be asserted against a nonsignatory party to a collective bargaining agreement. International Union of Operating Engineers, Local 653 v. Bay City Erection Co., 300 F.2d 270 (5th Cir. 1962). In Bay City, an employer brought a section 301 suit against a local union for the breach of a no-strike clause in a collective bargaining agreement. The agreement had been executed between the employer and a trade council in behalf of its constitutent local unions. The employer recovered $50,000 in damages in a jury trial before the district court, after proving that the union had blacklisted him in a manner making it difficult for him to obtain needed labor and materials. Id. at 270-71. On appeal, one of the arguments raised by the defendant union was that because only the trade council had signed the bargaining agreement with the employer, the local union itself could not be held liable for breach of contract. The court held that the union, although not an actual signatory to the agreement, could nevertheless be held liable for its breach. Id. at 271-72. The court based its decision in large part on the fact that the trade council had explicitly signed the agreement as the authorized representative of its constituent locals, a circumstance not present here. Id. In this case, Farnsworth did not sign the collective bargaining agreement as the agent of either AGC-New Orleans or AGC-At Large intending that they be bound by the contract. The agreement specifically provided that only the signatory constituent members of the AGC organizations were bound. Thus, it was the AGC organizations who in essence acted as the representative of Farnsworth in negotiating the agreement. As a result, the situation in Bay City has no application to the particular facts here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Consultation of the legislative history of § 301 affords virtually no guidance here. The Congress appears to have been primarily motivated by two concerns: that the difficulty of suing unincorporated associations under then-current law enabled unions to escape responsibility for their breaches of collective bargaining agreements; and that any money judgment that was obtained against a union might be enforced as a personal liability of each member. See generally H.Rep.No. 245, 80th Cong., 1st Sess. 6, 45-46, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 297, 336-37 (1948); H.Min. Rep.No. 245, 80th Cong., 1st Sess. 108-10, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 399-401 (1948); S.Rep.No. 105, 80th Cong., 1st Sess. 15-18, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 421-24 (1948); S.Min.Rep.No. 105, 80th Cong., 1st Sess. 13-15, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 475-77 (1948); H.Conf.Rep.No. 510, 80th Cong., 1st Sess., reprinted in 1947 U.S.Code Cong. \u0026 Ad.News, 1135, 1172-73; 93 Cong.Rec. H6438 (daily ed. June 3, 1947) (statement of Rep. Case), reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 873 (1948); 93 Cong.Rec. S3955 (daily ed. April 23, 1947) (statement of Sen. Taft), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1014 (1948); 93 Cong. Rec. S4265 (daily ed. April 28, 1947)(statement of Sen. Taft), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1074 (1948); 93 Cong. Rec. S4410-11 (daily ed. April 30, 1947) (remarks of Sen. Smith), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1145-46 (1948); 93 Cong.Rec. S5146-47 (daily ed. May 12, 1947) (statement of Sen. Ball), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1497 (1948); 93 Cong.Rec. SA2377 (daily ed. May 13, 1947) (statement of Sen. Ball), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1524 (1948); 93 Cong.Rec. SA3232 (daily ed. June 21, 1947) (statement of Sen. Taft), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1626 (1948); 93 Cong.Rec. S7690 (daily ed. June 23, 1947) (statement of Sen. Taft), reprinted in 2 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 1654 (1948). Nothing in the legislative history of § 301 bears on the question of holding a nonsignatory to a collective bargaining agreement. Only two comments in the history seem at all relevant to this case. The Senate Report (on the Senate committee version of the bill) stated that \"breaches of collective agreement [sic] have become so numerous that it is not sufficient to allow the parties to invoke the processes of the National Labor Relations Board when such breaches occur . . . . [;] the aggrieved party should also have a right of action in the Federal courts.\" S.Rep.No. 105, 80th Cong., 1st Sess. 15, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 421 (1948). The House Conference Report (on the bill as it became law) asserted that \"once parties have made a collective bargaining contract [,] the enforcement of that contract should be left to the usual processes of the law and not to the National Labor Relations Board.\" H.Conf.Rep.No. 510, 80th Cong., 1st Sess. 42, U.S.Code Cong.Serv. 1947, 1135, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 546 (1948). Both of these comments seem to support the exercise of federal jurisdiction in doubtful cases, and hence support a liberal reading of the plaintiffs' claims in the context of a 12(b) (6) motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Ninth Circuit has, in several cases, seemed to state that the factors listed in Don Burgess Construction, supra, apply with equal validity to single employer and alter ego cases. J.M. Tanaka Construction, Inc. v. NLRB, 675 F.2d 1029 (9th Cir. 1982); NLRB v. Big Bear Supermarkets No. 3, 640 F.2d 924 (9th Cir.), cert. denied, 449 U.S. 919, 101 S. Ct. 318, 66 L. Ed. 2d 147 (1980). However, we think that the Board's decisions have made it clear that the doctrines are conceptually distinct. Hageman Underground Construction, 253 N.L.R.B. 60, 60 n.2 (1980) (Board found that two entities constituted single employer and that their employees were members of the same bargaining unit and thus would not reach alter ego determination); Naccarato Construction Co., 233 N.L.R.B. 1394, 1398 (1977) (more must be shown for alter ego finding than single employer finding, since former and not latter binds nonsignatory to a collective bargaining agreement).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The history of a \"double breasted\" operation in existence prior to and during the time a union enters into a collective bargaining agreement with one half of the operation may be relevant evidence as to whether the nonsignatory is a sham created merely for the purpose of evading contractual obligations or is a bona fide enterprise of which the union was aware at the time it first negotiated an agreement with the signatory. Of course, the prior existence of the nonsignatory is not necessarily dispositive, since it may always be argued that although the nonsignatory existed as a bona fide operation prior to the agreement, a disgruntled management later sought to use the company as a means to avoid its obligations by deliberately shifting all the signatory's work away to the nonsignatory and leaving the signatory as an empty shell. For a running colloquy on the related question whether a union who enters into a collective bargaining agreement knowing a \"double breasted\" operation is in existence is thereby prevented from complaining about the non-union branch, see A-1 Fire Protection, Inc., 233 N.L.R.B. 38 (1977), remanded, 600 F.2d 918 (D.C.Cir.1979), on remand 250 N.L.R.B. 217 (1980), remanded, 219 U.S. App. D.C. 228, 676 F.2d 826 (D.C.Cir.1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We note that another district court, on facts strikingly similar to this case, reached the same conclusion as the district court here. Couchigian v. Rick, 489 F. Supp. 54 (D.Minn.1980). While in Couchigian the union (which was not a plaintiff in the § 301 action; only the pension funds were) had sought a single employer determination by the Board, which the Board refused on procedural grounds, the court's language indicates it did not consider that a critical factor. While a prior attempt to have the Board rule on the claim might affect our view of such a case (see part II.C.5, infra), we reject the reasoning of the Couchigian court in this case. See part II.C.5, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. This analysis is by no means unprecedented. We were faced with a related problem recently in Local Union No. 59, International Brotherhood of Electrical Workers v. Namco Electric, Inc., 653 F.2d 143 (5th Cir. 1981). In Namco, a union sought to bind a non-signatory employer, Namco Electric, to a collective bargaining agreement entered into with Frauman Electric Co. The union's theory was that Namco was an alter ego corporation of Frauman or merely a \"fictitious identity\" assumed by Frauman. The district court granted summary judgment for the defendant corporations, holding that a representational issue would necessarily have to be decided and that Peter Kiewit prohibited such a determination. A panel of this circuit, in an opinion written by Judge Rubin, affirmed, but on a different ground. The panel held that the union had not come up with sufficient evidence to contest the factual evidence in the record that Namco and Frauman were not the same corporation but were in fact two distinct business entities. However, in the course of reaching this conclusion the court stated in dicta: Without at this time attempting to explore the full reach of the [Peter Kiewit] decision, we assume, without deciding, that it does not foreclose jurisdiction of a claim for contract breach based on proof that the defendant, while not expressly bound by a collective bargaining agreement, is the alter ego of a signatory to the agreement. Relying on this proposition, the union contends that the district court incorrectly held that it lacked jurisdiction. That Namco is but Frauman in another garb, is a possible interpretation of the allegations in the complaint. Because the Frauman employees had already been certified as an appropriate bargaining unit, such a circumstance would not present a question of the propriety of the bargaining unit. The motion for summary judgment and supporting materials have demonstrated, however, that the contention in the complaint is not a permissible version of the facts. Our affirmance, therefore, is based, not on lack of jurisdiction to consider the complaint, but on its absence of merit. The union's reliance on Bugher v. Frash, 98 LRRM 3010 (S.D.Ind.1977), is misplaced, for in that case the question, raised on a motion to dismiss for failure to state a claim for which relief could be granted, was solely whether a corporation \"could conceivably be found to be bound to the labor contracts entered into by its alleged alter ego.\" Id. at 3011 (emphasis supplied). The record before us establishes beyond genuine dispute that Namco and Frauman were separate entities and that Namco was not the alter ego of Frauman. Therefore, the hypothetical posed by the procedural posture in Frash is not here relevant. 653 F.2d at 146-147. That hypothetical problem, a claim raised in the context of a 12(b) (6) motion, is squarely before us today. Bugher v. Frash, 98 L.R.R.M. 3010 (S.D.Ind.1978), as mentioned in Namco, did involve circumstances very similar to the ones we are presented with here. In Frash, trustees of certain union pension plans brought suit in federal district court under § 301 of the LMRA and § 502(a) (3) (B) (ii) of ERISA, 29 U.S.C. §§ 185, 1132(a) (3) (B) (ii), seeking to hold Frash, Inc. to the terms of a bargaining agreement executed between two unions covered by the plans and the defendant Frash Earth Works. The plaintiff trustees alleged that Frash, Inc. and Frash Earth Works were alter ego corporations and that Frash, Inc. should therefore be bound to the agreement. Id. at 3011. The two defendant corporations moved to dismiss for lack of subject matter jurisdiction, contending that the district court could not decide the alter ego issue without also determining the appropriate bargaining unit and thereby usurping the NLRB's jurisdiction over the latter issue. The court rejected the defendants' argument: Although the Court is in agreement with defendant Frash, Inc.'s argument regarding the exclusivity of NLRB jurisdiction to determine appropriate bargaining units and its arguments concerning single-employer and/or multi-employer bargaining units, dismissal of plaintiffs' claim against said defendant is unwarranted. As the Court interprets plaintiffs' complaint in regard to defendant Frash, Inc., the plaintiffs seek to hold said defendant liable on a type of alter ego theory. The complaint contains no allegations that Frash, Inc. is directly bound to any collective bargaining agreement with the labor organizations represented, in effect, by plaintiffs, and the record of the case at its present juncture reflects that Frash, Inc. was not bound by any labor agreements. Going no further, as a matter of federal labor law dismissal of the claim would be called for, but plaintiffs inject a theory having its roots in corporate law under which defendant Frash, Inc. could conceivably be found to be bound to the labor contracts entered into by its alleged alter ego Robert Ellis Frash d/b/a Frash Earth Works. Depending upon the proof, the two defendants could be found to be one and the same entity, and the incorporation of Frash, Inc. could be found to be a sham or could be disregarded for certain particular purposes. In such circumstances, the labor agreements entered into by Frash Earth Works could be found to be binding on the corporate defendant. When thus viewed as a corporate liability case in substance, South Prairie Construction Co. v. Local No. 627, International Union of Operating Engineers, 425 U.S. 800, 92 LRRM 2507, 48 L. Ed. 2d 382, 96 S. Ct. 1842 (1976), and its statements about the deference which must be accorded by the courts to the NLRB's exclusive jurisdiction are insufficient to mandate dismissal. An avenue for relief, albeit a narrow one entirely dependent upon proof that Frash, Inc. and Frash Earth Works are one and the same, exists under which plaintiffs could recover. Thus, although defendant Frash, Inc.'s arguments are, in the most part, convincing and although they narrowly circumscribe the path which plaintiffs must follow to recover, plaintiffs' complaint against said defendant states a claim upon which relief can be granted. Id. at 3011-12. The opinion in Frash views the requisite showing of identity as grounded in more or less standard doctrines of corporate law. However, because we deal with the special area of labor agreements, we think an alter ego theory must be specifically attuned to the policies and concerns of the federal labor laws if it is to form the basis of a cause of action under section 301. See also Forrest Bugher v. Cleveland X-Ray Inspection and Cleveland Indus. Testing, Inc., No. 77-186-B (N.D.Okla. Nov. 22, 1978) (unpublished opinion); International Union v. Cardwell Mfg. Co., Inc., 416 F. Supp. 1267 (D. Kan. 1976); Plumbers Local Union No. 519 v. Service Plumbing Co., Inc., 401 F. Supp. 1008 (S.D.Fla.1975), which also held that alter ego type theories may be used to bind a non-signatory to a collective bargaining agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We note that no party has raised the issue whether the traditional administrative law theory of primary jurisdiction may fruitfully be applied in a case where a bargaining unit issue arises before a district court in a § 301 action. By \"primary jurisdiction\", we do not mean the pre-emption doctrine developed in San Diego Building Trades Council v. Garmon, 359 U.S. 236 [79 S. Ct. 773, 3 L. Ed. 2d 775] (1959), which is applied solely in a labor context; rather, we are speaking of the practice of referring questions within an administrative agency's expertise to that agency while the federal court stays or dismisses the main action pending the agency's determination. The Supreme Court has explained the difference between the two concepts by noting that in the labor law context the term \"primary jurisdiction\" is used to refer to the various considerations articulated in Garmon and its progeny that militate in favor of pre-empting state-court jurisdiction over activity which is subject to the unfair labor practice jurisdiction of the federal Board. This use of the term should not be confused with the doctrine of primary jurisdiction, which has been described by Professor Davis as follows: \"The precise function of the doctrine of primary jurisdiction is to guide a court in determining whether the court should refrain from exercising its jurisdiction until after an administrative agency has determined some question or some aspect of some question arising in the proceeding before the court. \"The doctrine of primary jurisdiction does not necessarily allocate power between courts and agencies, for it governs only the question whether court or agency will initially decide a particular issue, not the question whether court or agency will finally decide the issue.\" 3 K. Davis, Administrative Law Treatise § 19.01, p. 3 (1958) (emphasis in original). While the considerations underlying Garmon are similar to those underlying the primary-jurisdiction doctrine, the consequences of the two doctrines are therefore different. Where applicable, the Garmon doctrine completely pre-empts state-court jurisdiction unless the Board determines that the disputed conduct is neither protected nor prohibited by the federal Act. Sears, Roebuck \u0026 Co. v. San Diego County District Council of Carpenters, 436 U.S. 180, 199 n.29 [98 S. Ct. 1745, 1758 n.29, 56 L. Ed. 2d 209] (1978). The Court has also stated: The doctrine of primary jurisdiction \"is concerned with promoting proper relationships between the courts and administrative agencies chargeed with particular regulatory duties.\" United States v. Western Pacific R. Co., 352 U.S. 59, 63 [77 S. Ct. 161, 164, 1 L. Ed. 2d 126] (1956). Even when common-law rights and remedies survive and the agency in question lacks the power to confer immunity from common-law liability, it may be appropriate to refer specific issues to an agency for initial determination where that procedure would secure \"uniformity and consistency in the regulation of business entrusted to a particular agency\" or where \"the limited functions of review by the judiciary [would be] more rationally exercised, by preliminary resort for ascertaining and interpreting the circumstances underlying legal issues to agencies that are better equipped than courts by specialization, by insight gained through experience, and by more flexible procedure.\" Far East Conference v. United States, 342 U.S. 570, 574-75, 72 S. Ct. 492, 494, 96 L. Ed. 576 (1951).] Nader v. Allegheny Airlines, Inc., 426 U.S. 290, 303-04, 96 S. Ct. 1978, 1986-1987, 48 L. Ed. 2d 643 (1976). See also American Trucking Associations, Inc. v. ICC, 682 F.2d 487, 491 n.6 (5th Cir. 1982) (collecting cases applying doctrine in varying contexts); Columbia Gas Transmission Corp. v. Allied Chemical Corp., 652 F.2d 503, 519-20 nn.14-15 (5th Cir. 1981); Mississippi Power \u0026 Light Co. v. United Gas Pipe Line Co., 532 F.2d 412, 417 (5th Cir. 1976), cert. denied, 429 U.S. 1094, 97 S. Ct. 1109, 51 L. Ed. 2d 541 (1977). The question here is whether the district court should require the plaintiffs to seek an initial Board determination of some of their claims before the court hears the case. We express no opinion on the primary jurisdiction issue, because none of the parties raised or briefed it. We strongly recommend that the issue be briefed, not only by the parties but also by the Board. We will, however, discuss some of the concerns which we believe are relevant to the application of the doctrine to this case. We note that the House conference report on § 301 states that \"once parties have made a collective bargaining contract [,] the enforcement of that contract should be left to the usual processes of the law and not to the National Labor Relations Board.\" H.Conf.Rep.No. 510, 80th Cong., 1st Sess. 42, U.S. Code Cong.Serv. 1947, 1135, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 546 (1948). The Senate committee report states that \"breaches of collective agreement [sic] have become so numerous that it is not sufficient to allow the parties to invoke the processes of the National Labor Relations Board when such breaches occur . . . . We feel that the aggrieved party should also have a right of action in the Federal Courts.\" S.Rep.No. 105, 80th Cong., 1st Sess. 15, reprinted in 1 NLRB, Legislative History of the Labor Management Relations Act, 1947 at 421 (1948). These statements may or may not be relevant in a case such as this, where one of the issues is whether one party is bound by the contract. There are two possible ways to present to the Board any issues as to which primary jurisdiction is applied: by filing an unfair labor practice charge under §§ 8(a) (5) \u0026 (1) of the NLRA, 29 U.S.C. §§ 158(a) (5) \u0026 (1), or by seeking a unit clarification under § 9(c) of the NLRA, 29 U.S.C. § 159(c). The first method presents no problems: any person, even a stranger to the collective bargaining agreement, can bring unfair labor practice charges. 29 U.S.C. § 160(b); 29 C.F.R. § 102.9 (1981); NLRB v. Indiana \u0026 Michigan Electric Co., 318 U.S. 9, 63 S. Ct. 394, 87 L. Ed. 579 (1943); NLRB v. W.L. Rives Co., 328 F.2d 464, 469 n.10 (5th Cir. 1964). Clearly, the Board will decide single employer, unit determination, and alter ego questions in such a proceeding; it was in this context that the Board developed the single employer and alter ego theories. See, e.g., Hageman Underground Construction, 253 N.L.R.B. 60 (1980) (single employer); Crawford Door Sales Co., 226 N.L.R.B. 1144 (1976) (alter ego). Thus, requiring an unfair labor practice proceeding raises no special issues for consideration other than whether it is desirable to require the exercise of primary jurisdiction via a procedure with such pejorative overtones. The unit clarification procedure is a neutral one, in which the Board will also decide single employer and unit determination issues. See, e.g., Valmac Indus., Inc., 225 N.L.R.B. 1296 (1976); General Envelope Co., 222 N.L.R.B. 10 (1976); Miami Indus. Trucks, Inc., 221 N.L.R.B. 209 (1975). Obviously, the Board will not make an alter ego finding in a unit clarification proceeding, since the alter ego theory does not raise a unit determination issue (except for the limited determination of whether the unit is repugnant to the policies of the NLRA). It appears, however, that the Funds would not have standing to seek unit clarification, although the Unions might. 29 U.S.C. §§ 159(c), 152(2); 29 C.F.R. §§ 102.60(b), 102.1 (1981). The Supreme Court has stated that the doctrine of primary jurisdiction has no application where the plaintiffs could not invoke administrative action. Rosado v. Wyman, 397 U.S. 397, 406, 90 S. Ct. 1207, 1214, 25 L. Ed. 2d 442 (1970). Rosado, however, did not present a case where some plaintiffs had standing before the agency and others did not, a situation which raises competing concerns of judicial and administrative economy and potential collusion to prevent invocation of primary jurisdiction. The picture is further complicated by the defendants' allegations that the contract at issue here is a prehire contract and that the Unions have failed to demonstrate the majority status in the relevant bargaining unit required to make such a contract fully enforceable. See part II.C.7, infra. These allegations bear on the primary jurisdiction issue because unit clarification is available only where \"there is a certified or currently recognized representative of a bargaining unit and there is no question concerning representation. . . .\" 29 C.F.R. § 101.17 (1981). The majority status issue is a question concerning representation. If the district court determines at an early stage of the litigation that this is a prehire contract, it must then add into the primary jurisdiction calculus the fact that the unit clarification procedure would be unavailable to any of the plaintiffs. If the district court also concludes that it would be undesirable to require the plaintiffs to file unfair labor practice charges, then Rosado, supra, would be brought directly into play because the plaintiffs would have no way to invoke Board action. Finally, in the event the district court does require prior resort to the NLRB, we note that the court must decide not only which issues should be submitted to the Board, but also whether to dismiss the case or merely stay it. If the court reaches that point, we direct its attention to 3 K. Davis, Administrative Law Treatise § 19.07 (1958, Supp. 1970 \u0026 Supp. 1976) and the cases cited therein, particularly United States v. Michigan Nat'l Corp., 419 U.S. 1, 95 S. Ct. 10, 42 L. Ed. 2d 1 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In Local Union 204, IBEW v. Iowa Electric Light \u0026 Power Co., 668 F.2d 413 (8th Cir. 1982), a dispute arose between the union and employer over accretion of Quality Control Inspectors (QCI's) into a contractually defined bargaining unit. The employer contended QCI's were managerial or supervisory personnel not includible within the bargaining unit for \"employees.\" The union filed a petition before the Board for accretion, the Board upheld the union's position, and the union was eventually certified as the bargaining representative for the QCI's. The employer then refused to bargain with the union, and the union brought a § 301 action in federal court. The Eighth Circuit dismissed, declaring that the § 301 action was a disguised attempt to obtain review of the Board's bargaining unit determination in a federal district court and holding generally that representational issues were beyond the jurisdiction of federal courts in § 301 actions. This result may seem surprising, since the union who brought the suit would be the last party who would want a redetermination of the bargaining issue, which had been decided in its favor. Indeed, the union's position in that case would be more likely to be that the Board's determination was conclusive on the parties and the district court should enforce it without review in a § 301 action. Then no bargaining unit determination would have been necessary. The Eighth Circuit may have based its decision on the idea that the employer was seeking review by litigating the unit issue in the federal courts directly instead of in the normal context of review of an unfair labor practice charge for refusal to bargain. See generally Magnesium Casting Co. v. NLRB, 401 U.S. 137, 91 S. Ct. 599, 27 L. Ed. 2d 735 (1971). This may explain the court's remark that the case presented \"a suit to obtain review of an NLRB factual finding on a representational issue despite the fact that Congress has established an orderly review procedure under section 10 of the Act.\" 668 F.2d at 419. Nevertheless, we confess puzzlement at the Eighth Circuit's decision here, since nothing in the opinion indicates that it was the employer rather than the union who sought to invoke § 301 jurisdiction. Moreover, if a unit determination by the Board is not directly reviewable in the federal courts outside of the context of an unfair labor practice charge, then the logical procedure may be not to dismiss the § 301 action because a party requests redetermination or review, but rather simply to accept the unit determination as conclusive and proceed with the breach of contract action. Thus, while we agree with the Eighth Circuit that the district courts may not be the proper forum for review of section 9 issues already passed upon by the Board, we are not in agreement with its broader holding that federal district courts never have the authority to engage in unit determinations in § 301 actions. In any event, the case we are presented with here is factually dissimilar, as there is no prior or pending unit determination by the Board, and thus we think does not raise the problems of review of Board determinations which concerned the Eighth Circuit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Additional support for the proposition that unit determinations may be made by federal district courts in § 301 actions may be found in dicta in Carey v. Westinghouse Electric Corp., 375 U.S. 261, 84 S. Ct. 401, 11 L. Ed. 2d 320 (1964). In Carey a dispute arose between two unions over which was the appropriate bargaining representative for a certain group of employees. The collective bargaining agreement between the petitioner union and the employer, Westinghouse, included a grievance procedure for the use of arbitration in the case of unresolved disputes concerning the \"interpretation, application, or claimed violation\" of the agreement. Id. at 262, 84 S. Ct. at 404. The union sued the employer to compel arbitration on the question of work assignments as between the two unions. The employer refused arbitration, claiming that the issue was in reality a representational issue within the exclusive province of the Board. The Supreme Court held that the district court had jurisdiction to enforce the arbitration clause even though the resulting arbitration might touch upon representational matters, and stated in addition: If this is truly a representation case, either IUE or Westinghouse can move to have the certificate clarified. But the existence of a remedy before the Board for an unfair labor practice does not bar individual employees from seeking damages for breach of a collective bargaining agreement in a state court, as we held in Smith v. Evening News Assn., 371 U.S. 195 [83 S. Ct. 267, 9 L. Ed. 2d 246]. We think the same policy considerations are applicable here; and that a suit either in the federal courts, as provided by § 301(a) of the Labor Management Relations Act of 1947 (61 Stat. 156, 29 U.S.C. § 185(a); Textile Workers v. Lincoln Mills, 353 U.S. 448 [77 S. Ct. 912, 1 L. Ed. 2d 972]), or before such state tribunals as are authorized to act (Charles Dowd Box Co. v. Courtney, 368 U.S. 502 [82 S. Ct. 519, 7 L. Ed. 2d 483]; Teamsters Local v. Lucas Flour Co., 369 U.S. 95 [82 S. Ct. 571, 7 L. Ed. 2d 593]) is proper, even though an alternative remedy before the Board is available, which, if invoked by the employer, will protect him. 375 U.S. at 268, 84 S. Ct. at 407.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See note 11 supra for a discussion of standing in unit clarification proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. By the time the case was decided by the court of appeals, the Regional Director of the NLRB had granted ACTWU's petition for amendment of certification. 559 F.2d at 307 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. We emphasize that since we deal with a Rule 12(b) (6) dismissal, these provisions, which appear outside the pleadings, cannot be used to prove a matter of fact, and we list them only as examples of how a contractually agreed bargaining unit is arrived at. The pleadings are silent about the existence or nonexistence of a predetermined bargaining unit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Indeed, not only is a bargaining unit determination often made unnecessary by a stipulation, but in addition, the existence of a stipulation may restrict the Board's authority to make a de novo bargaining unit determination. For example, when a union or employer files a petition requesting a representation election, and the parties have stipulated beforehand as to the relevant bargaining unit, the Board's powers are greatly circumscribed: \"its function is limited to construing the agreement under contract principles, and its discretion to fix the appropriate bargaining unit is gone.\" Tidewater Oil Co. v. NLRB, 358 F.2d 363, 365 (2d Cir. 1966). The Board is not free to use its expertise to create a bargaining unit according to its standard method of determining the community of interests. Rather, the stipulation must be accepted unless it would violate applicable statutes or settled Board policy. NLRB v. Mercy Hospitals, Inc., 589 F.2d 968 (9th Cir. 1978), cert. denied, 440 U.S. 910, 99 S. Ct. 1221, 59 L. Ed. 2d 458 (1979). Accord, NLRB v. Ortiz Funeral Home Corp., 651 F.2d 136 (2d Cir. 1981), cert. denied, 455 U.S. 946, 102 S. Ct. 1445, 71 L. Ed. 2d 659 (1982); Methodist Home v. NLRB, 596 F.2d 1173 (4th Cir. 1979); NLRB v. Tennessee Packers, Inc., 379 F.2d 172 (6th Cir.), cert. denied, 389 U.S. 958, 88 S. Ct. 338, 19 L. Ed. 2d 364 (1967); cf. Knapp-Sherrill Company v. NLRB, 488 F.2d 655, 659 (5th Cir.), cert. denied, 419 U.S. 829, 95 S. Ct. 50, 42 L. Ed. 2d 53 (1974) (stipulation controls unless its provisions are repugnant to the NLRA or its policies, but where stipulation contains an ambiguity, and absent clear evidence of parties' intention to apply some other test, resolution of ambiguity could be made by application of community of interests test and Board's \"wide discretion\" is restored for the purposes of such resolution). Our point in giving these examples is to emphasize that although some cases have spoken in broad language about the primary and exclusive jurisdiction of the Board in representational matters, such language does not militate against the powers of the parties to agree among themselves on an appropriate bargaining unit; the question of the exclusivity of the Board's jurisdiction in these matters arises only in cases where there is a dispute between the parties. We do not think that our decision in Florida Marble Polishers Health and Welfare Trust Fund v. Edwin M. Green, Inc., 653 F.2d 972 (5th Cir. 1981), cert. denied, 456 U.S. 973, 102 S. Ct. 2235, 72 L. Ed. 2d 846 (1982), contradicts our decision in Knapp-Sherrill, supra. In Florida Marble Polishers we were faced with two separate businesses, one which had been a union shop since 1950, and another non-union company formed in 1965. The president of the union company also was president and majority owner of the non-union company. The plaintiff unions in that case sought to bind the non-union company to a 1971 collective bargaining agreement entered into with the union company, based upon what was, in effect, an accretion clause. This court held that enforceing such a clause would be a usurpation of the non-union employees' § 7 rights and the NLRB's exclusive jurisdiction to determine the appropriate bargaining unit. 653 F.2d at 976. The decision is consistent with previous cases recognizing that \"the Board has taken an extremely narrow view of permissible contractual accretions,\" e.g., Boire v. International Brotherhood of Teamsters, 479 F.2d 778, 796 (5th Cir. 1973), and with the fact that the federal courts have shown great deference to the Board's decision to refuse accretion even in the face of an accretion clause in an otherwise valid collective bargaining agreement. Id. at 797. Compare Sheraton-Kauai Corp. v. NLRB, 429 F.2d 1352, 1356-57 (9th Cir. 1970) with NLRB v. Appleton Electric Co., 296 F.2d 202 (7th Cir. 1961) (disagreeing over Board's authority to disregard accretion clauses). All we need point out is that Tidewater, Knapp-Sherrill, and related cases involved stipulations made prior to representation elections which would ultimately vindicate the employees' § 7 rights. In contrast, the situation usually posed in the accretion clause cases is a union majority already established in one area which seeks to swallow up another separate group of employees without the need for an election. This strongly implicates basic principles of national labor policy; a cautious concern for § 7 rights becomes essential and the Board's role is appropriately enlarged. See generally Kaynard v. Mego Corp., 484 F. Supp. 167, 172 (E.D.N.Y.), modified, 633 F.2d 1026 (2d Cir. 1980). Where, as here, it is postulated that the union and employer have entered into a prehire agreement which will flower into full enforceability upon a showing of majority status in the stipulated bargaining unit, the problems of accretion are not, for the present, at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The district court also dismissed these claims for failure to exhaust contractually mandated grievance procedures; we deal with this question in the next section infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. As we remand this case to the district court for factual development of the ERISA claims, we add a few words about the relevance of Higdon Construction Co., supra. We have explained earlier that this case involves a prehire agreement whose enforceability may turn upon the existence of majority status. The district court should carefully consider whether lack of majority status is a defense against the third party beneficiary of a prehire agreement (the Funds) as well as against the Unions, or whether the doctrine of Lewis v. Benedict Coal Corp., 361 U.S. 459, 80 S. Ct. 489, 4 L. Ed. 2d 442 (1960), applies to this defense. Compare Washington Area Carpenters' Welfare Fund v. Overhead Door Co., 488 F. Supp. 816 (D.D.C. 1980), rev'd, 220 U.S. App. D.C. 273, 681 F.2d 1, (1981) (trust fund cannot sue employer pursuant to prehire agreement to recover delinquent contributions absent proof of the union's majority status) with Trustees v. Southern Stress Wire Corp., 509 F. Supp. 1097 (N.D.Ga.1981) (holding that Benedict Coal doctrine prevents employer from asserting defense against fringe benefit funds and citing legislative history critical of result in Washington Area Carpenter's Welfare Fund, supra). But cf. Kaiser Steel Corp. v. Mullins, 455 U.S. 72, 102 S. Ct.851, 70 L. Ed. 2d 833 (1982) (defense of illegality of a collective bargaining agreement is a defense against a union trust fund). Our decision in Schafer, supra, holding that Higdon makes prehire agreements unenforceable until majority status is reached, does not speak directly to the Benedict Coal question, since Schafer involved a suit brought only by the union signatories and not by trustees of pension funds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The portions of the submitted materials dealing with grievance procedures are reproduced below: ARTICLE XXIII -- DISPUTES AND GRIEVANCE PROCEDURE Section 1. Whenever a dispute involving an alleged claim of a violation of a particular provision of this Agreement, other than an alleged violation of Article III occurs, serious efforts shall be made by the parties in dispute to arrive at a settlement. Section 2. If the parties to such dispute cannot reach a settlement, either party may refer the dispute to the New Orleans District, Associated General Contractors of Louisiana, Inc. and the Union, whose representatives shall meet within forty-eight (48) hours after the referral of a dispute to them and attempt to settle same. Section 3. If the Union and the Associated General Contractors' representatives are unable to settle the dispute, either party may refer the matter to arbitration. Section 4. The arbitrator's decision shall be final and binding upon all parties. Section 5. The panel of arbitrators from which the arbitrator for a particular dispute will be chosen is as follows: (1) John F. Caraway (2) F. Jay Taylor (3) Harold R. Ainsworth (4) Samuel J. Nicholas, Jr. The arbitrator for a given dispute will be selected according to the order in which the arbitrators are listed above. The panel will rotate each time it is exhausted. Rotation of the panel will occur only for arbitrations involving the signatory Contractors. Section 6. The arbitrator shall have no authority to add to, subtract from, to [sic] modify any of the terms or conditions of this Agreement. Section 7. An employee who believes he has a grievance against his employer must file in writing with the Union which represents the employee a statement setting forth the basis for his complaint. Such statement must be filed within five working days of the occurrence of the event which gave rise to his grievance; otherwise, his grievance or dispute shall be considered finally settled and waived. Section 8. In the event a dispute should not be referred to arbitration within thirty (30) days after the occurrence of the event which gave rise thereto, the dispute or grievance shall be considered finally settled and waived. A dispute shall be considered referred to arbitration at the time the grieving party notifies the appropriate arbitrator of the dispute and the fact that the parties are unable to settle the disputed issues without resorting to arbitration. This notification shall be in writing and a copy thereof sent to the other party to the dispute, the Union and the New Orleans District, Associated General Contractors of Louisiana, Inc. The time limits imposed under this section may be extended for any particular dispute upon mutual agreement of the parties thereto. 1 Rec. 57-8, 97-8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. This question is presently being considered by a panel of this court. Forrest Bugher v. Consolidated X-Ray Service Corp., 515 F. Supp. 1180 (N.D.Tex.1981) (appeal pending as No. 81-1349). Assuming that the Funds are required to exhaust, the court still must consider whether, because the Funds may not be in the same position as the Unions to invoke the contractually mandated grievance procedures, the waiver provisions contained in the agreement would be equally applicable to the Funds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This is so even assuming, as the defendants argue, that this case arises out of a \"labor dispute\" within the meaning of the Norris-LaGuardia Act, 29 U.S.C. § 113(c), and that the employer's conduct fell squarely within the specified acts declared by the Clayton and Norris-LaGuardia Acts not to be violations of federal law. That was precisely the situation which obtained in Allen Bradley. 325 U.S. at 807, 65 S. Ct. at 1538. There the Supreme Court held that a union and an employer group which conspired to erect a sheltered local business market in order to exclude other businessmen from the market and charge prices above the competitive level, and violated the antitrust laws, even though the conspiracy developed from a labor dispute between the union and the employer group. The Court conceded that the union's activities fell squarely within the language of the Norris-LaGuardia Act. Nevertheless, the Court stated that the purpose of the antitrust laws was to outlaw business monopolies, and that \"[a] business monopoly is no less such because a union participates . . . .\" 325 U.S. at 811, 65 S. Ct. at 1540. To this we may add that it is no less such because a union does not participate. The plaintiffs allege, as we discuss infra, that defendants have conspired to restrict competition among contractors competing for construction jobs in the New Orleans area. We are skeptical of the defendants' ability to show that this conduct does indeed fall within the activities explicitly protected by the Norris-LaGuardia Act, 29 U.S.C. § 104. See California State Council, supra, at 534-36 \u0026 n. 12. However, we need not decide this issue, as the reasoning of Allen Bradley makes it clear that these anticompetitive activities are not entitled to statutory protection regardless of the language of the Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Similar fact patterns may be found in other major cases in which anti-union activity by employers has been found not to state a claim under the antitrust laws. In Amalgamated Meat Cutters v. Wetterau Foods, 597 F.2d 133 (8th Cir. 1979), it was alleged that during a strike by members of a union against a local grocery store, the store replaced the striking employees with personnel provided by a wholesale food supplier. The Eighth Circuit dismissed a claim of a Sherman Act conspiracy, since the actions of the businesses \"had no anticompetitive effect unrelated to the collective bargaining negotiations\" which motivated the strike; \"supplying temporary replacement workers did not have any anticompetitive effect beyond the labor relations at the [local grocery] store.\" 597 F.2d at 136 \u0026 n.7. In Kennedy v. Long Island R.R. Co., 319 F.2d 366 (2d Cir.), cert. denied, 375 U.S. 830, 84 S. Ct. 75, 11 L. Ed. 2d 61 (1963), it was alleged that an agreement within the railroad industry for a strike insurance plan violated the Sherman Act. The court in Kennedy held that, the plan did not \"effect[] an unnatural and anticompetitive regulation of the pricing, supply, or distribution of goods or services.\" 319 F.2d at 373 (footnote omitted). The court noted that the appellants had urged that the plan had an anticompetitive effect on the labor market, but it stated that this was not the concern of the antitrust laws. Id. Finally, in Amalgamated Clothing and Textile Workers Union v. J.P. Stevens \u0026 Co., 475 F. Supp. 482 (S.D.N.Y.1979), vacated as moot, 638 F.2d 7 (2d Cir. 1980), the plaintiff union alleged systematic efforts by the defendant to harrass the union and its members and prevent the union from organizing its employees. Distinguishing the case from the situation posed in this circuit's decision in Tugboat, Inc. v. Mobile Towing Co., 534 F.2d 1172 (5th Cir. 1976), (discussed infra at note 27), the district court explained that efforts to impede the union \"entirely unaccompanied or uncomplicated by any element of monopolistic effect upon competition in the marketplace for goods or services,\" could not state a cause of action under the antitrust laws. 475 F. Supp. at 490. The court characterized Tugboat as similar in nature to a series of \"sham union\" cases, in which an employer creates such an employee organization both to injure the union and to gain an advantage over its competitors. Id. at 489 n.6. In such cases, argued the court, a restraint on purely commercial competition may accompany the attempted domination of the labor market, and an antitrust claim is properly stated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The direction of the cause and effect relationship is apparently made important by Justice Powell's language in Connell. When a union (or an employer for that matter) attempts to restrain competition on wages and working conditions, this will of necessity have ripple effects in the rest of the market for a particular product, since one of the factor costs of production (in this case, labor) is made subject to anticompetitive restraint. This much was recognized in Apex Hosiery. 310 U.S. at 503-04, 60 S. Ct. at 997-98. The natural effects of such anticompetitive restraint are acceptable as a consequence of the overriding concerns of federal labor policy. However, when the union or employer does not restrict itself to mere manipulation of the labor market per se, but attempts an indirect effect on that market through direct restraints on commercial competition, i.e., through monopolization of supply, control of prices, or allocation of product distribution, the antitrust laws are violated due to the means chosen, and not the end sought to be achieved. See H.A. Artists \u0026 Associates, Inc. v. Actors' Equity Association, 451 U.S. 704, 715 n.16, 101 S. Ct. 2102, 2109 n.16, 68 L. Ed. 2d 558 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. A very similar situation was presented in California State Council of Carpenters v. Associated General Contractors, Inc., supra. In that case it was alleged that the defendant contractor association had conspired to coerce owners of property, general contractors, and \"other letters of construction contracts,\" with whom the unions had no collective bargaining relationship, to hire only non-signatory construction firms (primarily subcontractors). 648 F.2d at 531. Describing this set of facts as the \"obverse\" of Connell, id. at 532, the majority opinion held that an anticompetitive restraint was alleged at the level of subcontractor services which stated a claim under the Sherman Act. In this respect California State Council may be distinguished from Prepmore and other cases discussed supra. In Carpenters Local Union No. 1846 v. E.I. Du Pont de Nemours \u0026 Co., 110 L.R.R.M. 3140 (E.D.La.1981), it was alleged that defendant Du Pont had solicited bids for the employment of contractors and craftsmen and had invited only defendant bidders who were non-union counterparts in \"double breasted\" construction businesses; an agreement was alleged between defendants to monopolize construction jobs in Louisiana by restricting available jobs only to non-union bidders. The district court declined to dismiss the complaint for failure to state a claim, since plaintiffs had alleged, albeit imprecisely, restraints upon competition in the bidding for contracting services. The court relied heavily on both California State Council of Carpenters and East Central Ohio Building \u0026 Construction Trades Council v. Landmark, Inc., No. C76-371A (N.D.Ohio, April 26, 1977) (unpublished opinion). Landmark involved a suit by plaintiff unions against an association of builders and contractors, various construction companies, and Landmark, a feed corporation engaged in the feed and grain business. Landmark awarded a contract to a construction company with the provision that hiring for the construction project be done on a \"merit shop\" or non-union basis. Plaintiffs alleged that the builders' association assisted in the negotiation and implementation of the contract in a conspiracy to gain a competitive advantage in the building industry for non-union contractors. The plaintiffs' complaint was held to state a cause of action despite the fact that the purpose of the defendants' acts was to weaken the union and a concerted refusal to deal with the union itself was also alleged.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Judge Sneed's dissent in California State Council of Carpenters, supra, argued that the \"economic realities of employer-employee relations\" are that \"employers without collective bargaining agreements with the plaintiffs may make more profit than those who have such agreements. Their absence from this lawsuit constitutes some evidence of their evaluation of their 'injury.'\" 648 F.2d at 542. But plaintiffs having alleged an anticompetitive effect in the industry, it is not proper for an appellate court to deny plaintiffs an opportunity to prove such an effect by taking judicial notice of whether signatory or non-signatory firms presently in the industry are more efficient. Nor does Judge Sneed's argument speak to the question of barriers to entry of new firms not yet in the industry. Moreover, to the extent that the plaintiffs allege per se violations of the antitrust laws, the present efficiency of extant firms in the industry is simply irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In particular we direct the district court to consider the effect of our decision in Tugboat, Inc. v. Mobile Towing Co., 534 F.2d 1172 (5th Cir. 1976), and the Supreme Court's most recent pronouncement in the area, Blue Shield v. McCready, 457 U.S. 465, 102 S. Ct. 2540, 73 L. Ed. 2d 149 (1982). Tugboat held that a union (Seafarers) had standing to sue under allegations that Tugboat, Inc., and a company union, Masters, Mates, and Pilots (MMP) had conspired to prevent Seafarers from organizing employees at Tugboat's job site. Seafarers already represented employees at Tugboat's competitor, Mobile Towing. Seafarers charged that the conspirators hoped to drive Mobile Towing out of business because labor costs for Tugboat would be lower due to the company union. This circuit held that the employees represented by Seafarers as well as the union itself had standing to sue under § 4 \"not because they suffered injuries as a result of their employer being victimized by violations of the antitrust laws, but because the conspiracy in this case was aimed at the employees as much as it was aimed at the employer.\" 534 F.2d at 1177 (footnote omitted). The court found it significant that it was alleged that \"Tugboat . . . . conspired with Masters, Mates, and Pilots to keep plaintiff union employees off of Tugboat, Inc., job sites, necessarily depriving the union member plaintiffs of job opportunities.\" Id. at 1177-78. In so holding, the court specifically refused to endorse the broad holding of the Third Circuit in Int'l Ass'n of Heat \u0026 Frost Insulators v. United Contractors Ass'n, Inc., 483 F.2d 384 (3d Cir. 1973), modified, 494 F.2d 1353 (3d Cir. 1974), that union members possessed antitrust standing on the basis that they were employees of the contractors against whom the conspiracy was aimed. 534 F.2d at 1177. In McReady, an employee covered by a prepaid group health plan which reimbursed psychiatrist but not psychologist services brought a Sherman Act § 1 claim charging that Blue Shield and an association of psychiatrists had conspired through this policy to injure psychologists in the market for psychotherapy services. The plaintiff, McReady, had been treated by a psychologist and claimed economic injury to her business or property due to the policy of non-reimbursement. The Supreme Court held that she possessed standing under § 4 of the Clayton Act to bring a treble damage action. Although we express no opinion on the standing issues, leaving these to the district court in the first instance after the development of a factual record, we think these decisions may help focus its analysis. It may also be helpful for the district court to distinguish the standing of the Unions from that of the Funds, as well as the standing of each type of plaintiff to seek equitable relief from its standing to seek the damages called for in the plaintiffs' complaint.\u003c/span\u003e\n\n",
    "body_length": 180348,
    "citedas": [
      "690 F.2d 489"
    ],
    "attorneys": "Jerry L. Gardner, Jr., New Orleans, Louisiana, Marie Healey, New Orleans, Louisiana, Gerald T. LaBorde, New Orleans, Louisiana, for Appellant. Frederick A. Kullman, New Orleans, Louisiana, Michael S. Mitchell, New Orleans, Louisiana, Frederick S. Kullman, New Orleans, Louisiana, for Appellee. James Burton, New Orleans, Louisiana, H. Bruce Shreves, New Orleans, Louisiana, for Pratt-Farnsworth \u0026 Halmar, Inc.",
    "category": [
      "124",
      "251",
      "252"
    ],
    "judges": "Wisdom, Randall and Tate, Circuit Judges.",
    "citation_count": 160
  }
}
