{
  "id": "9YvlQGYBTlTomsSBIawN",
  "document": {
    "title": "Rite-Hite Corp. v. Kelley Co.",
    "full_title": "RITE-HITE CORPORATION, ACME DOCK SPECIALISTS, INC., ALLIED EQUIPMENT CORP., APPLIED HANDLING, INC., ANDERSON MATERIAL HANDLING CO., BLOCK-DICKSON, INC., ROBERT LUND D/B/A/ HMH COMPANY, HOJ ENGINEERING \u0026 SALES CO., INC., JOHNSON EQUIPMENT CO., JOHNL \u0026 ASSOCIATES, INC., KELLER EQUIPMENT CO., INC., LOADING DOCK EQUIPMENT, INC., METRO DOCK SPECIALISTS, INC., MCCORMICK EQUIPMENT COMPANY, INC., MID-SOUTH DOCK SYSTEMS, INC., HARRY MONOHAN, NIEHAUS INDUSTRIAL SALES, INC., NORTHWAY MATERIAL HANDLING CO., INC., PEMCO MATERIAL HANDLING, INC., R.B. CURLIN, INC., RICE EQUIPMENT COMPANY, STOKES EQUIPMENT COMPANY, INC., ROBERT SOPER LIMITED, TIMBERS \u0026 ASSOCIATES, INC., TODD EQUIPMENT CORPORATION, THAYER SYSTEMS, INC., AND W. E. CARLSON CORPORATION /CROSS-APPELLANTS v. KELLEY COMPANY, INC.",
    "jurisdiction": "Federal Circuit",
    "date": "1995-06-15T00:00:00.000Z",
    "docket": "Nos. 92-1206, - 92-1260",
    "body": "LOURIE, Circuit Judge.\n\nKelley Company appeals from a decision of the United States District Court for the Eastern District of Wisconsin, awarding damages for the infringement of U.S. Patent 4,373,847, owned by Rite-Hite Corporation. Rite-Hite Corp. v. Kelley Co., 774 F. Supp. 1514, 21 USPQ2d 1801 (E.D. Wis. 1991). The district court determined, inter alia, that Rite-Hite was entitled to lost profits for lost sales of its devices that were in direct competition with the infringing devices, but which themselves were not covered by the patent in suit. The appeal has been taken in banc to determine whether such damages are legally compensable under 35 U.S.C. § 284. We affirm in part, vacate in part, and remand.\n\nBACKGROUND\n\nOn March 22, 1983, Rite-Hite sued Kelley, alleging that Kelley's \"Truk Stop\" vehicle restraint infringed Rite-Hite's U.S. Patent 4,373,847 (\"the '847 patent\").\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The '847 patent, issued February 15, 1983, is directed to a device for securing a vehicle to a loading dock to prevent the vehicle from separating from the dock during loading or unloading. Any such separation would create a gap between the vehicle and dock and create a danger for a forklift operator.\n\nRite-Hite distributed all its products through its wholly-owned and operated sales organizations and through independent sales organizations (ISOs). During the period of infringement, the Rite-Hite sales organizations accounted for approximately 30 percent of the retail dollar sales of Rite-Hite products, and the ISOs accounted for the remaining 70 percent. Rite-Hite sued for its lost profits at the wholesale level and for the lost retail profits of its own sales organizations. Shortly after this action was filed, several ISOs moved to intervene, contending that they were \"exclusive licensees\" of the '847 patent by virtue of \"Sales Representative Agreements\" and \"Dok-Lok Supplement\" agreements between themselves and Rite-Hite. The court determined that the ISOs were exclusive licensees and accordingly, on August 31, 1984, permitted them to intervene.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The ISOs sued for their lost retail profits.\n\nThe district court bifurcated the liability and damage phases of the trial and, on March 5, 1986, held the '847 patent to be not invalid and to be infringed by the manufacture, use, and sale of Kelley's Truk Stop device. The court enjoined further infringement. Rite-Hite Corp. v. Kelley Co., 629 F. Supp. 1042, 231 USPQ 161 (E.D. Wis. 1986). The judgment of liability was affirmed by this court. Rite-Hite Corp. v. Kelley Co., 819 F.2d 1120, 2 USPQ2d 1915 (Fed. Cir. 1987).\n\nOn remand, the damage issues were tried to the court. Rite-Hite, 774 F. Supp. at 1514, 21 USPQ2d at 1801. Rite-Hite sought damages calculated as lost profits for two types of vehicle restraints that it made and sold: the \"Manual Dok-Lok\" model 55 (MDL-55), which incorporated the invention covered by the '847 patent, and the \"Automatic Dok-Lok\" model 100 (ADL-100), which was not covered by the patent in suit. The ADL-100 was the first vehicle restraint Rite-Hite put on the market and it was covered by one or more patents other than the patent in suit. The Kelley Truk Stop restraint was designed to compete primarily with Rite-Hite's ADL-100. Both employed an electric motor and functioned automatically, and each sold for $1,000-$1,500 at the wholesale level, in contrast to the MDL-55, which sold for one-third to one-half the price of the motorized devices. Rite-Hite does not assert that Kelley's Truk Stop restraint infringed the patents covering the ADL-100.\n\nOf the 3,825 infringing Truk Stop devices sold by Kelley, the district court found that, \"but for\" Kelley's infringement, Rite-Hite would have made 80 more sales of its MDL-55; 3,243 more sales of its ADL-100; and 1,692 more sales of dock levelers, a bridging platform sold with the restraints and used to bridge the edges of a vehicle and dock. The court awarded Rite-Hite as a manufacturer the wholesale profits that it lost on lost sales of the ADL-100 restraints, MDL-55 restraints, and restraint-leveler packages. It also awarded to Rite-Hite as a retailer and to the ISOs reasonable royalty damages on lost ADL-100, MDL-55, and restraint-leveler sales caused by Kelley's infringing sales. Finally, prejudgment interest, calculated without compounding, was awarded. Kelley's infringement was found to be not willful.\n\nOn appeal, Kelley contends that the district court erred as a matter of law in its determination of damages. Kelley does not contest the award of damages for lost sales of the MDL-55 restraints; however, Kelley argues that (1) the patent statute does not provide for damages based on Rite-Hite's lost profits on ADL-100 restraints because the ADL-100s are not covered by the patent in suit; (2) lost profits on unpatented dock levelers are not attributable to demand for the '847 invention and, therefore, are not recoverable losses; (3) the ISOs have no standing to sue for patent infringement damages; and (4) the court erred in calculating a reasonable royalty based as a percentage of ADL-100 and dock leveler profits. Rite-Hite and the ISOs challenge the district court's refusal to award lost retail profits and its award of prejudgment interest at a simple, rather than a compound, rate.\n\nWe affirm the damage award with respect to Rite-Hite's lost profits as a manufacturer on its ADL-100 restraint sales, affirm the court's computation of a reasonable royalty rate, vacate the damage award based on the dock levelers, and vacate the damage award with respect to the ISOs because they lack standing. We remand for dismissal of the ISOs' claims and for a redetermination of damages consistent with this opinion. The issues raised by Rite-Hite are unpersuasive.\n\nDiscussion\n\nBecause the technology, the '847 patent, and the history of the parties and their litigation are fully described in the opinions of the district court and that of the earlier panel of our court that affirmed the liability judgment, we will discuss the facts only to the extent necessary to discuss the issues raised in this appeal.\n\nIn order to prevail on appeal on an issue of damages, an appellant must convince us that the determination was based on an erroneous Conclusion of law, clearly erroneous factual findings, or a clear error of judgment amounting to an abuse of discretion. Amstar Corp. v. Envirotech Corp., 823 F.2d 1538, 1542, 3 USPQ2d 1412, 1415 (Fed. Cir. 1987); see also SmithKline Diagnostics, Inc. v. Helena Lab. Corp., 926 F.2d 1161, 1163-65 \u0026 n.2, 17 USPQ2d 1922, 1924-25 \u0026 n.2 (Fed. Cir. 1991).\n\nA.\n\nKelley's Appeal\n\nI. Lost Profits on the ADL-100 Restraints\n\nThe district court's decision to award lost profits damages pursuant to 35 U.S.C. § 284 turned primarily upon the quality of Rite-Hite's proof of actual lost profits. The court found that, \"but for\" Kelley's infringing Truk Stop competition, Rite-Hite would have sold 3,243 additional ADL-100 restraints and 80 additional MDL-55 restraints. The court reasoned that awarding lost profits fulfilled the patent statute's goal of affording complete compensation for infringement and compensated Rite-Hite for the ADL-100 sales that Kelley \"anticipated taking from Rite-Hite when it marketed the Truk Stop against the ADL-100.\" Rite-Hite, 774 F. Supp. at 1540, 21 USPQ2d at 1821. The court stated, \"the rule applied here therefore does not extend Rite-Hite's patent rights excessively, because Kelley could reasonably have foreseen that its infringement of the '847 patent would make it liable for lost ADL-100 sales in addition to lost MDL-55 sales.\" Id. The court further reasoned that its decision would avoid what it referred to as the \"whip-saw\" problem, whereby an infringer could avoid paying lost profits damages altogether by developing a device using a first patented technology to compete with a device that uses a second patented technology and developing a device using the second patented technology to compete with a device that uses the first patented technology.\n\nKelley maintains that Rite-Hite's lost sales of the ADL-100 restraints do not constitute an injury that is legally compensable by means of lost profits. It has uniformly been the law, Kelley argues, that to recover damages in the form of lost profits a patentee must prove that, \"but for\" the infringement, it would have sold a product covered by the patent in suit to the customers who bought from the infringer. Under the circumstances of this case, in Kelley's view, the patent statute provides only for damages calculated as a reasonable royalty. Rite-Hite, on the other hand, argues that the only restriction on an award of actual lost profits damages for patent infringement is proof of causation-in-fact. A patentee, in its view, is entitled to all the profits it would have made on any of its products \"but for\" the infringement. Each party argues that a judgment in favor of the other would frustrate the purposes of the patent statute. Whether the lost profits at issue are legally compensable is a question of law, which we review de novo.\n\nOur analysis of this question necessarily begins with the patent statute. See General Motors Corp. v. Devex Corp., 461 U.S. 648, 653-54, 76 L. Ed. 2d 211, 103 S. Ct. 2058 (1983). Implementing the constitutional power under Article I, section 8, to secure to inventors the exclusive right to their discoveries, Congress has provided in 35 U.S.C. § 284 as follows:\n\nUpon finding for the claimant the court shall award the claimant damages adequate to compensate for the infringement, but in no event less than a reasonable royalty for the use made of the invention by the infringer, together with interest and costs as fixed by the court.\n\n35 U.S.C. § 284 (1988). The statute thus mandates that a claimant receive damages \"adequate\" to compensate for infringement. Section 284 further instructs that a damage award shall be \"in no event less than a reasonable royalty\"; the purpose of this alternative is not to direct the form of compensation, but to set a floor below which damage awards may not fall. Del Mar Avionics, Inc. v. Quinton Instrument Co., 836 F.2d 1320, 1326, 5 USPQ2d 1255, 1260 (Fed. Cir. 1987). Thus, the language of the statute is expansive rather than limiting. It affirmatively states that damages must be adequate, while providing only a lower limit and no other limitation.\n\nThe Supreme Court spoke to the question of patent damages in General Motors, stating that, in enacting § 284, Congress sought to \"ensure that the patent owner would in fact receive full compensation for 'any damages' [the patentee] suffered as a result of the infringement.\" General Motors, 461 U.S. at 654; see also H.R. Rep. No. 1587, 79th Cong., 2d Sess., 1 (1946) (the Bill was intended to allow recovery of \"any damages the complainant can prove\"); S. Rep. No. 1503, 79th Cong., 2d Sess., 2 (1946) (same). Thus, while the statutory text states tersely that the patentee receive \"adequate\" damages, the Supreme Court has interpreted this to mean that \"adequate\" damages should approximate those damages that will fully compensate the patentee for infringement. Further, the Court has cautioned against imposing limitations on patent infringement damages, stating: \"When Congress wished to limit an element of recovery in a patent infringement action, it said so explicitly.\" General Motors, 461 U.S. at 653 (refusing to impose limitation on court's authority to award interest).\n\nIn Aro Mfg. Co. v. Convertible Top Replacement Co., 377 U.S. 476, 141 USPQ 681, 12 L. Ed. 2d 457, 84 S. Ct. 1526 (1964), the Court discussed the statutory standard for measuring patent infringement damages, explaining:\n\nThe question to be asked in determining damages is \"how much had the Patent Holder and Licensee suffered by the infringement. And that question [is] primarily: had the Infringer not infringed, what would the Patentee Holder-Licensee have made?\"\n\n377 U.S. at 507, 141 USPQ at 694 (plurality opinion) (citations omitted). This surely states a \"but for\" test. In accordance with the Court's guidance, we have held that the general rule for determining actual damages to a patentee that is itself producing the patented item is to determine the sales and profits lost to the patentee because of the infringement. Del Mar, 836 F.2d at 1326, 5 USPQ2d at 1260; see State Indus., Inc. v. Mor-Flo Indus., Inc., 883 F.2d 1573, 1577, 12 USPQ2d 1026, 1028 (Fed. Cir. 1989), cert. denied, 493 U.S. 1022 (1990) (award of damages may be split between lost profits as actual damages to the extent they are proven and a reasonable royalty for the remainder). To recover lost profits damages, the patentee must show a reasonable probability that, \"but for\" the infringement, it would have made the sales that were made by the infringer. Id. ; King Instrument Corp. v. Otari Corp., 767 F.2d 853, 863, 226 USPQ 402, 409 (Fed. Cir. 1985), cert. denied, 475 U.S. 1016, 89 L. Ed. 2d 312, 106 S. Ct. 1197 (1986).\n\nPanduit Corp. v. Stahlin Bros. Fibre Works, Inc., 575 F.2d 1152, 197 USPQ 726 (6th Cir. 1978), articulated a four-factor test that has since been accepted as a useful, but non-exclusive, way for a patentee to prove entitlement to lost profits damages. State Indus., 883 F.2d at 1577, 12 USPQ2d at 1028. The Panduit test requires that a patentee establish: (1) demand for the patented product; (2) absence of acceptable non-infringing substitutes; (3) manufacturing and marketing capability to exploit the demand; and (4) the amount of the profit it would have made. Panduit, 575 F.2d at 1156, 197 USPQ at 730. A showing under Panduit permits a court to reasonably infer that the lost profits claimed were in fact caused by the infringing sales, thus establishing a patentee's prima facie case with respect to \"but for\" causation. Kaufman Co. v. Lantech, Inc., 926 F.2d 1136, 1141, 17 USPQ2d 1828, 1831 (Fed. Cir. 1991). A patentee need not negate every possibility that the purchaser might not have purchased a product other than its own, absent the infringement. Id. The patentee need only show that there was a reasonable probability that the sales would have been made \"but for\" the infringement. Id. When the patentee establishes the reasonableness of this inference, e.g., by satisfying the Panduit test, it has sustained the burden of proving entitlement to lost profits due to the infringing sales. Id. at 1141, 17 USPQ2d at 1832. The burden then shifts to the infringer to show that the inference is unreasonable for some or all of the lost sales. Id.\n\nApplying Panduit, the district court found that Rite-Hite had established \"but for\" causation. In the court's view, this was sufficient to prove entitlement to lost profits damages on the ADL-100. Kelley does not challenge that Rite-Hite meets the Panduit test and therefore has proven \"but for\" causation; rather, Kelley argues that damages for the ADL-100, even if in fact caused by the infringement, are not legally compensable because the ADL-100 is not covered by the patent in suit.\n\nPreliminarily, we wish to affirm that the \"test\" for compensability of damages under § 284 is not solely a \"but for\" test in the sense that an infringer must compensate a patentee for any and all damages that proceed from the act of patent infringement. Notwithstanding the broad language of § 284, judicial relief cannot redress every conceivable harm that can be traced to an alleged wrongdoing. See Associated General Contractors, Inc. v. California State Council of Carpenters, 459 U.S. 519, 536, 74 L. Ed. 2d 723, 103 S. Ct. 897 (1983).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e For example, remote consequences, such as a heart attack of the inventor or loss in value of shares of common stock of a patentee corporation caused indirectly by infringement are not compensable. Thus, along with establishing that a particular injury suffered by a patentee is a \"but for\" consequence of infringement, there may also be a background question whether the asserted injury is of the type for which the patentee may be compensated.\n\nJudicial limitations on damages, either for certain classes of plaintiffs or for certain types of injuries have been imposed in terms of \"proximate cause\" or \"foreseeability.\" See Consolidated Rail Corp. v. Gottshall, 129 L. Ed. 2d 427, 114 S. Ct. 2396, 2406 (1994). Such labels have been judicial tools used to limit legal responsibility for the consequences of one's conduct that are too remote to justify compensation. See Holmes v. Securities Investor Protection Corp., 503 U.S. 258, 117 L. Ed. 2d 532, 112 S. Ct. 1311 (1992). The general principles expressed in the common law tell us that the question of legal compensability is one \"to be determined on the facts of each case upon mixed considerations of logic, common sense, Justice, policy and precedent.\" See 1 Street, Foundations of Legal Liability 110 (1906) (quoted in W. Page Keeton et al., Prosser \u0026 Keeton on the Law of Torts § 42, at 279 (5th ed. 1984)).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nWe believe that under § 284 of the patent statute, the balance between full compensation, which is the meaning that the Supreme Court has attributed to the statute, and the reasonable limits of liability encompassed by general principles of law can best be viewed in terms of reasonable, objective foreseeability. If a particular injury was or should have been reasonably foreseeable by an infringing competitor in the relevant market, broadly defined, that injury is generally compensable absent a persuasive reason to the contrary. Here, the court determined that Rite-Hite's lost sales of the ADL-100, a product that directly competed with the infringing product, were reasonably foreseeable. We agree with that Conclusion. Being responsible for lost sales of a competitive product is surely foreseeable; such losses constitute the full compensation set forth by Congress, as interpreted by the Supreme Court, while staying well within the traditional meaning of proximate cause. Such lost sales should therefore clearly be compensable.\n\nRecovery for lost sales of a device not covered by the patent in suit is not of course expressly provided for by the patent statute. Express language is not required, however. Statutes speak in general terms rather than specifically expressing every detail. Under the patent statute, damages should be awarded \"where necessary to afford the plaintiff full compensation for the infringement.\" General Motors, 461 U.S. at 654. Thus, to refuse to award reasonably foreseeable damages necessary to make Rite-Hite whole would be inconsistent with the meaning of § 284.\n\nKelley asserts that to allow recovery for the ADL-100 would contravene the policy reason for which patents are granted: \"To promote the progress of . . . the useful arts.\" U.S. Const., art. I, § 8, cl. 8. Because an inventor is only entitled to exclusivity to the extent he or she has invented and disclosed a novel, nonobvious, and useful device, Kelley argues, a patent may never be used to restrict competition in the sale of products not covered by the patent in suit. In support, Kelley cites antitrust case law condemning the use of a patent as a means to obtain a \"monopoly\" on unpatented material. See, e.g., Ethyl Gasoline Corp. v. United States, 309 U.S. 436, 459, 84 L. Ed. 852, 60 S. Ct. 618 (1940) (\"The patent monopoly of one invention may no more be enlarged for the exploitation of a monopoly of another than for the exploitation of an unpatented article, or for the exploitation or promotion of a business not embraced within the patent.\"); Leitch Mfg. Co. v. Barber Co., 302 U.S. 458, 463, 82 L. Ed. 371, 58 S. Ct. 288 (1938) (\"Every use of a patent as a means of obtaining a limited monopoly on unpatented material is prohibited . . . whatever the nature of the device by which the owner of the patent seeks to effect unauthorized extension of the monopoly.\").\n\nThese cases are inapposite to the issue raised here. The present case does not involve expanding the limits of the patent grant in violation of the antitrust laws; it simply asks, once infringement of a valid patent is found, what compensable injuries result from that infringement, i.e., how may the patentee be made whole. Rite-Hite is not attempting to exclude its competitors from making, using, or selling a product not within the scope of its patent. The Truk Stop restraint was found to infringe the '847 patent, and Rite-Hite is simply seeking adequate compensation for that infringement; this is not an antitrust issue. Allowing compensation for such damage will \"promote the Progress of . . . the useful Arts\" by providing a stimulus to the development of new products and industries. See 1 Ernest B. Lipscomb III, Walker on Patents 65 (3d ed. 1984) (quoting Simonds, Summary of the Law of Patents 9 (1883)) (\"The patent laws promote the progress in different ways, prominent among which are by protecting the investment of capital in the development and working of a new invention from ruinous competition till the investment becomes remunerative.\").\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nKelley further asserts that, as a policy matter, inventors should be encouraged by the law to practice their inventions. This is not a meaningful or persuasive argument, at least in this context. A patent is granted in exchange for a patentee's disclosure of an invention, not for the patentee's use of the invention. There is no requirement in this country that a patentee make, use, or sell its patented invention. See Continental Paper Bag Co. v. Eastern Paper Bag Co., 210 U.S. 405, 424-30, 52 L. Ed. 1122, 28 S. Ct. 748 (1908) (irrespective of a patentee's own use of its patented invention, it may enforce its rights under the patent). If a patentee's failure to practice a patented invention frustrates an important public need for the invention, a court need not enjoin infringement of the patent. See 35 U.S.C. § 283 (1988) (courts may grant injunctions in accordance with the principles of equity). Accordingly, courts have in rare instances exercised their discretion to deny injunctive relief in order to protect the public interest. See, e.g., Hybritech, Inc. v. Abbott Lab., 4 USPQ2d 1001 (C.D. Cal. 1987) (public interest required that injunction not stop supply of medical test kits that the patentee itself was not marketing), aff'd, 849 F.2d 1446, 7 USPQ2d 1191 (Fed. Cir. 1988); Vitamin Technologists, Inc. v. Wisconsin Alumni Research Found., 64 USPQ 285 (9th Cir. 1945) (public interest warranted refusal of injunction on irradiation of oleomargarine); City of Milwaukee v. Activated Sludge, Inc., 21 USPQ 69 (7th Cir. 1934) (injunction refused against city operation of sewage disposal plant because of public health danger). Whether a patentee sells its patented invention is not crucial in determining lost profits damages. Normally, if the patentee is not selling a product, by definition there can be no lost profits. However, in this case, Rite-Hite did sell its own patented products, the MDL-55 and the ADL-100 restraints.\n\nKelley next argues that to award lost profits damages on Rite-Hite's ADL-100s would be contrary to precedent. Citing Panduit, Kelley argues that case law regarding lost profits uniformly requires that \"the intrinsic value of the patent in suit is the only proper basis for a lost profits award.\" Kelley argues that each prong of the Panduit test focuses on the patented invention; thus, Kelley asserts, Rite-Hite cannot obtain damages consisting of lost profits on a product that is not the patented invention.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nGenerally, the Panduit test has been applied when a patentee is seeking lost profits for a device covered by the patent in suit. However, Panduit is not the sine qua non for proving \"but for\" causation. If there are other ways to show that the infringement in fact caused the patentee's lost profits, there is no reason why another test should not be acceptable. Moreover, other fact situations may require different means of evaluation, and failure to meet the Panduit test does not ipso facto disqualify a loss from being compensable.\n\nIn any event, the only Panduit factor that arguably was not met in the present fact situation is the second one, absence of acceptable non-infringing substitutes. Establishment of this factor tends to prove that the patentee would not have lost the sales to a non-infringing third party rather than to the infringer. That, however, goes only to the question of proof. Here, the only substitute for the patented device was the ADL-100, another of the patentee's devices. Such a substitute was not an \"acceptable, non-infringing substitute\" within the meaning of Panduit because, being patented by Rite-Hite, it was not available to customers except from Rite-Hite. Cf. State Indus., 883 F.2d at 1578, 12 USPQ2d at 1030-31. Rite-Hite therefore would not have lost the sales to a third party. The second Panduit factor thus has been met. If, on the other hand, the ADL-100 had not been patented and was found to be an acceptable substitute, that would have been a different story, and Rite-Hite would have had to prove that its customers would not have obtained the ADL-100 from a third party in order to prove the second factor of Panduit.\n\nKelley's Conclusion that the lost sales must be of the patented invention thus is not supported. Kelley's concern that lost profits must relate to the \"intrinsic value of the patent\" is subsumed in the \"but for\" analysis; if the patent infringement had nothing to do with the lost sales, \"but for\" causation would not have been proven. However, \"but for\" causation is conceded here. The motive, or motivation, for the infringement is irrelevant if it is proved that the infringement in fact caused the loss. We see no basis for Kelley's Conclusion that the lost sales must be of products covered by the infringed patent.\n\nKelley has thus not provided, nor do we find, any justification in the statute, precedent, policy, or logic to limit the compensability of lost sales of a patentee's device that directly competes with the infringing device if it is proven that those lost sales were caused in fact by the infringement. Such lost sales are reasonably foreseeable and the award of damages is necessary to provide adequate compensation for infringement under 35 U.S.C. § 284. Thus, Rite-Hite's ADL-100 lost sales are legally compensable and we affirm the award of lost profits on the 3,283 sales lost to Rite-Hite's wholesale business in ADL-100 restraints.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nII. Damages on the Dock Levelers\n\nBased on the \"entire market value rule,\" the district court awarded lost profits on 1,692 dock levelers that it found Rite-Hite would have sold with the ADL-100 and MDL-55 restraints. Kelley argues that this award must be set aside because Rite-Hite failed to establish that the dock levelers were eligible to be included in the damage computation under the entire market value rule. We agree.\n\nWhen a patentee seeks damages on unpatented components sold with a patented apparatus, courts have applied a formulation known as the \"entire market value rule\" to determine whether such components should be included in the damage computation, whether for reasonable royalty purposes,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e see Leesona Corp. v. United States, 220 Ct. Cl. 234, 599 F.2d 958, 974, 202 USPQ 424, 439 (Ct. Cl.), cert. denied, 444 U.S. 991, 62 L. Ed. 2d 420, 100 S. Ct. 522 (1979), or for lost profits purposes, see Paper Converting Machine Co. v. Magna-Graphics Corp., 745 F.2d 11, 23, 223 USPQ 591, 599 (Fed. Cir. 1984). Early cases invoking the entire market value rule required that for a patentee owning an \"improvement patent\" to recover damages calculated on sales of a larger machine incorporating that improvement, the patentee was required to show that the entire value of the whole machine, as a marketable article, was \"properly and legally attributable\" to the patented feature. See Garretson v. Clark, 111 U.S. 120, 121, 28 L. Ed. 371, 4 S. Ct. 291 (1884); Westinghouse Elec. \u0026 Mfg. Co. v. Wagner Elec. \u0026 Mfg. Co., 225 U.S. 604, 615, 56 L. Ed. 1222, 32 S. Ct. 691 (1912) (same). Subsequently, our predecessor court held that damages for component parts used with a patented apparatus were recoverable under the entire market value rule if the patented apparatus \"was of such paramount importance that it substantially created the value of the component parts.\" Marconi Wireless Telegraph Co. v. United States, 99 Ct. Cl. 1, 53 USPQ 246, 250 (Ct. Cl. 1942), aff'd in part and vacated in part, 320 U.S. 1 (1943). We have held that the entire market value rule permits recovery of damages based on the value of a patentee's entire apparatus containing several features when the patent-related feature is the \"basis for customer demand.\" State Indus., 883 F.2d at 1580, 12 USPQ2d at 1031; TWM Mfg. Co. v. Dura Corp., 789 F.2d 895, 900-01, 229 USPQ 525, 528 (Fed. Cir.), cert. denied, 479 U.S. 852, 93 L. Ed. 2d 117, 107 S. Ct. 183 (1986).\n\nThe entire market value rule has typically been applied to include in the compensation base unpatented components of a device when the unpatented and patented components are physically part of the same machine. See, e.g., Western Elec. Co. v. Stewart-Warner Corp., 631 F.2d 333, 208 USPQ 183 (4th Cir. 1980), cert. denied, 450 U.S. 971, 67 L. Ed. 2d 622, 101 S. Ct. 1492 (1981). The rule has been extended to allow inclusion of physically separate unpatented components normally sold with the patented components. See, e.g., Paper Converting, 745 F.2d at 23, 223 USPQ at 599. However, in such cases, the unpatented and patented components together were considered to be components of a single assembly or parts of a complete machine, or they together constituted a functional unit. See, e.g., Velo-Bind, Inc. v. Minnesota Mining \u0026 Mfg. Co., 647 F.2d 965, 211 USPQ 926 (9th Cir.), cert. denied, 454 U.S. 1093, 70 L. Ed. 2d 631, 102 S. Ct. 658 (1981).\n\nIn Paper Converting, this court articulated the entire market value rule in terms of the objectively reasonable probability that a patentee would have made the relevant sales. See 745 F.2d at 23, 223 USPQ at 599-600. Furthermore, we may have appeared to expand the rule when we emphasized the financial and marketing dependence of the unpatented component on the patented component. See id. In Paper Converting, however, the rule was applied to allow recovery of profits on the unpatented components only because all the components together were considered to be parts of a single assembly. The references to \"financial and marketing dependence\" and \"reasonable probability\" were made in the context of the facts of the case and did not separate the rule from its traditional moorings.\n\nSpecifically, recovery was sought for the lost profits on sales of an entire machine for the high speed manufacture of paper rolls comprising several physically separate components, only one of which incorporated the invention. The machine was comprised of the patented \"rewinder\" component and several auxiliary components, including an \"unwind stand\" that supported a large roll of supply paper to the rewinder, a \"core loader\" that supplied paperboard cores to the rewinder, an \"embosser\" that embossed the paper and provided a special textured surface, and a \"tail sealer\" that sealed the paper's trailing end to the finished roll. Although we noted that the auxiliary components had \"separate usage\" in that they each separately performed a part of an entire rewinding operation, the components together constituted one functional unit, including the patented component, to produce rolls of paper. The auxiliary components derived their market value from the patented rewinder because they had no useful purpose independent of the patented rewinder.\n\nSimilarly, our subsequent cases have applied the entire market value rule only in situations in which the patented and unpatented components were analogous to a single functioning unit. See, e.g., Kalman v. Berlyn Corp., 914 F.2d 1473, 1485, 16 USPQ2d 1093, 1102 (Fed. Cir. 1990) (affirming award of damages for filter screens used with a patented filtering device); TWM, 789 F.2d at 901, 229 USPQ at 528 (affirming award of damages for unpatented wheels and axles sold with patented vehicle suspension system); Kori Corp. v. Wilco Marsh Buggies \u0026 Draglines, Inc., 761 F.2d 649, 656, 225 USPQ 985, 989 (Fed. Cir.) (affirming an award of damages for unpatented uppers of an improved amphibious vehicle having a patented pontoon structure), cert. denied, 474 U.S. 902, 88 L. Ed. 2d 229, 106 S. Ct. 230 (1985).\n\nThus, the facts of past cases clearly imply a limitation on damages, when recovery is sought on sales of unpatented components sold with patented components, to the effect that the unpatented components must function together with the patented component in some manner so as to produce a desired end product or result. All the components together must be analogous to components of a single assembly or be parts of a complete machine, or they must constitute a functional unit. Our precedent has not extended liability to include items that have essentially no functional relationship to the patented invention and that may have been sold with an infringing device only as a matter of convenience or business advantage. We are not persuaded that we should extend that liability. Damages on such items would constitute more than what is \"adequate to compensate for the infringement.\"\n\nThe facts of this case do not meet this requirement. The dock levelers operated to bridge the gap between a loading dock and a truck. The patented vehicle restraint operated to secure the rear of the truck to the loading dock. Although the two devices may have been used together, they did not function together to achieve one result and each could effectively have been used independently of each other. The parties had established positions in marketing dock levelers long prior to developing the vehicle restraints. Rite-Hite and Kelley were pioneers in that industry and for many years were primary competitors. Although following Rite-Hite's introduction of its restraints onto the market, customers frequently solicited package bids for the simultaneous installation of restraints and dock levelers, they did so because such bids facilitated contracting and construction scheduling, and because both Rite-Hite and Kelley encouraged this linkage by offering combination discounts. The dock levelers were thus sold by Kelley with the restraints only for marketing reasons, not because they essentially functioned together. We distinguish our Conclusion to permit damages based on lost sales of the unpatented (not covered by the patent in suit) ADL-100 devices, but not on lost sales of the unpatented dock levelers, by emphasizing that the Kelley Truk Stops were devices competitive with the ADL-100s, whereas the dock levelers were merely items sold together with the restraints for convenience and business advantage. It is a clear purpose of the patent law to redress competitive damages resulting from infringement of the patent, but there is no basis for extending that recovery to include damages for items that are neither competitive with nor function with the patented invention. Promotion of the useful arts, see U.S. Const., art. I, § 8, cl. 8, requires one, but not the other. These facts do not establish the functional relationship necessary to justify recovery under the entire market value rule. Therefore, the district court erred as a matter of law in including them within the compensation base. Accordingly, we vacate the court's award of damages based on the dock leveler sales.\n\nIII. Standing of the ISOs\n\nThe ISOs asserted claims for patent infringement under 35 U.S.C. § 281 as co-plaintiffs with Rite-Hite and were awarded damages calculated on the basis of a reasonable royalty at the retail level on both restraints and dock levelers, based on the number of sales each asserted it lost to Kelley. Kelley challenges any award of damages to the ISOs on the ground that the ISOs had no standing to seek recovery for patent infringement. The ISOs argue that the exclusivity of their sales territories gave them standing as \"exclusive licensees.\" The question of standing to sue is a jurisdictional one, Imperial Tobacco, Ltd. v. Philip Morris, Inc., 899 F.2d 1575, 1580 n.7, 14 USPQ2d 1390, 1393 n.7 (Fed. Cir. 1990), which we review de novo, Transamerica Ins. Corp. v. United States, 973 F.2d 1572 (Fed. Cir. 1992). We agree with Kelley that the ISOs must be dismissed for lack of standing.\n\nThe right of a patentee to a remedy for patent infringement is created by the statute, Arachnid, Inc. v. Merit Indus., Inc., 939 F.2d 1574, 1578, 19 USPQ2d 1513, 1516-17 (Fed. Cir. 1991), which provides that a \"patentee\" shall have remedy by civil action for infringement of his or her patent, 35 U.S.C. § 281 (1988). The term \"patentee\" includes \"not only the patentee to whom the patent was issued but also the successors in title to the patentee.\" 35 U.S.C. § 100(d) (1988).\n\nGenerally, one seeking money damages for patent infringement must have held legal title to the patent at the time of the infringement. Crown Die \u0026 Tool Co. v. Nye Tool \u0026 Machine Works, 261 U.S. 24, 40-41, 67 L. Ed. 516, 43 S. Ct. 254 (1923). A conveyance of legal title by the patentee can be made only of the entire patent, an undivided part or share of the entire patent, or all rights under the patent in a specified geographical region of the United States. Waterman v. Mackenzie, 138 U.S. 252, 255, 34 L. Ed. 923, 11 S. Ct. 334 (1891). A transfer of any of these is an assignment and vests the assignee with title in the patent, and a right to sue infringers.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Id. A transfer of less than one of these three interests is a license, not an assignment of legal title, and it gives the licensee no right to sue for infringement at law in the licensee's own name. Id.\n\nUnder certain circumstances, a licensee may possess sufficient interest in the patent to have standing to sue as a co-plaintiff with the patentee. See id. (if necessary to protect the rights of all parties, the licensee may be joined as co-plaintiff); Independent Wireless Tel. Co. v. Radio Corp. of America, 269 U.S. 459, 468, 70 L. Ed. 357, 46 S. Ct. 166 (1926) (if the patentee refuses or is unable to join an exclusive licensee as co-plaintiff, the licensee may make him a party defendant). Such a licensee is usually an \"exclusive licensee.\" To be an exclusive licensee for standing purposes, a party must have received, not only the right to practice the invention within a given territory, but also the patentee's express or implied promise that others shall be excluded from practicing the invention within that territory as well. See Independent Wireless, 269 U.S. at 468-69. If the party has not received an express or implied promise of exclusivity under the patent, i.e., the right to exclude others from making, using, or selling the patented invention, the party has a \"bare license,\" and has received only the patentee's promise that that party will not be sued for infringement. See Western Elec. Co. v. Pacent Reproducer Corp., 42 F.2d 116, 118, 5 USPQ 105, 106 (2d Cir.), cert. denied, 282 U.S. 873, 75 L. Ed. 771, 51 S. Ct. 78 (1930).\n\nThe ISOs maintain that they are allowed to join as co-plaintiffs because each claims it has a virtually exclusive license to sell products made by Rite-Hite to particular customers in an exclusive sales territory. To determine whether the ISOs have standing to be co-plaintiffs, we look to their contracts with Rite-Hite.\n\nThe typical original ISO contract provided in pertinent part:\n\nRepresentative's right to solicit sales of the Company's products in the Territory shall be exclusive in that the Company will not appoint any other sales representative in the territory so long as, in Company's good faith judgment, Representative is doing an adequate job in the entire Territory for all listed products. [If not,] Company shall have the right to reduce the Territory, if it gives Representative notice of the change. Company shall in no event be liable for any violation or infringement of Representative's territorial rights hereunder except such as are committed directly by Company. Company also reserves the non-exclusive right to make sales of its products within the Territory directly to the motor freight industry, governmental agencies, government contractors, and any other purchasers which, in Company's Judgement, can be served best by direct sales.\n\nThe subject products are \"All Rite-Hite Mechanical and Hydraulic Dock Levelers and Related Equipment.\" The word \"patent\" appears nowhere in this document, although, just prior to their intervention as plaintiffs, many of the ISOs executed supplements to their contracts which specified that the \"products\" of the Sales Representative Agreement include \"products manufactured and sold by [Rite-Hite] \" that embody \"any of the claims set forth in Rite-Hite patents relating to 'Dok-Lok' devices, including (but not by any way of limitation) U.S. Patent No. 4,373,847. \" Rite-Hite, 774 F. Supp. at 1523, 21 USPQ2d at 1807 (alteration in original) (first emphasis supplied). The agreement also provided that each ISO had, in addition to the right to solicit sales for Rite-Hite, the right to sell products made by Rite-Hite. Rite-Hite reserved the right to sell its products to the motor freight industry.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn the original agreement, Rite-Hite itself expressly retained substantial rights to sell within the assigned territories to specific classes of purchases and to \"any other purchasers which, in Company's Judgement, can be served best by direct sales.\" The last minute modifications on the eve of litigation included for the first time products covered by the patent in the definition of the range of products covered by the agreement, and reduced the retained rights of Rite-Hite to sell within the assigned territories. Neither the original agreements nor the modifications granted the ISOs any right to exclude others under the patent.\n\nWe agree with Kelley that the district court's Conclusion that these contracts conveyed a \"sufficient, legally recognized interest in the rights secured by the ['847] patent\" to confer standing on the ISOs was erroneous as a matter of law. Id., 774 F. Supp. at 1525, 21 USPQ2d at 1808 (alteration in original). The contracts in this case were not exclusive patent licenses. As noted, they did not mention the word \"patent\" until the eve of this lawsuit. The ISO contracts permitted the ISOs only to solicit and make sales of products made by Rite-Hite in a particular \"exclusive\" sales territory. While the agreements conveyed the right to sell restraints covered by the patent, any \"exclusivity\" related only to sales territories, not to patent rights. Even this sales exclusivity was conditional on Rite-Hite's judgment that the ISOs were doing an \"adequate job.\"\n\nMost particularly, the ISOs had no right under the agreements to exclude anyone from making, using, or selling the claimed invention. The ISOs could not exclude from their respective territories other ISOs, third parties, or even Rite-Hite itself. Any remedy an ISO might have had for violation of its rights would lie in a breach of contract action against Rite-Hite, if the agreement was breached, not in a patent infringement action against infringers. Rite-Hite had no obligation to file infringement suits at the request of an ISO and the ISOs had no right to share in any recovery from litigation. Moreover, appellees have not contended that such obligations and rights are to be implied. Nor do appellees even argue that the ISOs had the right under their contracts to bring suit for infringement against another ISO or a third party, making Rite-Hite an involuntary plaintiff. To the contrary, under their agreement, if an ISO sold in another's territory, the profits were shared according to Rite-Hite's \"split commission\" rules. While the patentee and the ISOs have cooperated in this litigation, that fact alone does not establish their right to sue.\n\nWeinar v. Rollform, 744 F.2d 797, 223 USPQ 369 (Fed. Cir. 1984), cert. denied, 470 U.S. 1084, 85 L. Ed. 2d 143, 105 S. Ct. 1844 (1985), which is cited by Rite-Hite in support of the ISOs' position, is not to the contrary. In that case, a damage award was upheld to a licensee with the exclusive right to sell in the entire United States. Id. at 807, 223 USPQ at 374. However, the exclusive licensee in Weinar was found to have received more than a \"bare\" license from the patentee. Id. The exclusive licensee and the patentee \"shared the property rights represented by a patent.\" Id. That is not the case here. The ISOs were not licensees under the patent, except perhaps as non-exclusive licensees by implication. They were not granted any right to exclude others under the patent. They do not accordingly \"share\" with the patentee the property rights represented by the patent so as to have standing to sue as a co-plaintiff with the patentee.\n\nThese agreements were simply sales contracts between Rite-Hite and its independent distributors. They did not transfer any proprietary interest in the '847 patent and they did not give the ISOs the right to sue. If the ISOs lack a remedy in this case, it is because their agreements with Rite-Hite failed to make provisions for the contingency that the granted sales exclusivity would not be maintained. The ISOs could have required Rite-Hite to sue infringers and arrangements could have been agreed upon concerning splitting any damage award. Apparently, this was not done.\n\nThe grant of a bare license to sell an invention in a specified territory, even if it is the only license granted by the patentee, does not provide standing without the grant of a right to exclude others. The ISOs are legally no different from the individual salespersons whom the district court earlier refused to allow to join the suit. Rite-Hite, 774 F. Supp. at 1536, 21 USPQ2d at 1818 (holding that sales persons employed by the sales organizations are not entitled to recover damages as agents of the exclusive licensee-sales organizations). They are not proper parties to this suit, and their claims must be dismissed.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIV. Computation of Reasonable Royalty\n\nThe district court found that Rite-Hite as a manufacturer was entitled to an award of a reasonable royalty on 502 infringing restraint or restraint-leveler sales for which it had not proved that it contacted the Kelley customer prior to the infringing Kelley sale. Rite-Hite, 774 F. Supp. at 1534, 21 USPQ2d at 1816. The court awarded a royalty equal to approximately fifty percent of Rite-Hite's estimated lost profits per unit sold to retailers. Id. at 1535, 21 USPQ2d at 1817. Further, the court found that Rite-Hite as a retailer was entitled to a reasonable royalty amounting to approximately one-third its estimated lost distribution income per infringing sale.\n\nKelley challenges the amount of the royalty as grossly excessive and legally in error.\n\nA patentee is entitled to no less than a reasonable royalty on an infringer's sales for which the patentee has not established entitlement to lost profits. 35 U.S.C. § 284 (1988); Hanson v. Alpine Valley Ski Area, Inc., 718 F.2d 1075, 1078, 219 USPQ 679, 681-82 (Fed. Cir. 1983) (\"If actual damages cannot be ascertained, then a reasonable royalty must be determined.\"). The royalty may be based upon an established royalty, if there is one, or if not, upon the supposed result of hypothetical negotiations between the plaintiff and defendant. Id. at 1078, 219 USPQ at 682.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The hypothetical negotiation requires the court to envision the terms of a licensing agreement reached as the result of a supposed meeting between the patentee and the infringer at the time infringement began. Id. \"One challenging only the court's finding as to amount of damages awarded under the 'reasonable royalty' provision of § 284, therefore, must show that the award is, in view of all the evidence, either so outrageously high or so outrageously low as to be unsupportable as an estimation of a reasonably royalty.\" Lindemann Maschinenfabrik GmbH v. American Hoist \u0026 Derrick Co., 895 F.2d 1403, 1406, 13 USPQ2d 1871, 1874 (Fed. Cir. 1990).\n\nThe district court here conducted the hypothetical negotiation analysis. It determined that Rite-Hite would have been willing to grant a competitor a license to use the '847 invention only if it received a royalty of no less than one-half of the per unit profits that it was foregoing. In so determining, the court considered that the '847 patent was a \"pioneer\" patent with manifest commercial success; that Rite-Hite had consistently followed a policy of exploiting its own patents, rather than licensing to competitors; and that Rite-Hite would have had to forego a large profit by granting a license to Kelley because Kelley was a strong competitor and Rite-Hite anticipated being able to sell a large number of restraints and related products. See Deere \u0026 Co. v. International Harvester Co., 710 F.2d 1551, 1559, 218 USPQ 481, 487 (Fed. Cir. 1983) (court may consider impact of anticipated collateral sales); Georgia-Pacific Corp. v. United States Plywood Corp., 318 F. Supp. 1116, 166 USPQ 235, (S.D.N.Y. 1970) (wide range of factors relevant to hypothetical negotiation), modified and aff'd, 446 F.2d 295, 170 USPQ 369 (2d Cir.), cert. denied, 404 U.S. 870, 30 L. Ed. 2d 114, 92 S. Ct. 105 (1971). It was thus not unreasonable for the district court to find that an unwilling patentee would only license for one-half its expected lost profits and that such an amount was a reasonable royalty. The fact that the award was not based on the infringer's profits did not make it an unreasonable award. See State Indus., 883 F.2d at 1580, 12 USPQ2d at 1031 (\"The determination of a reasonable royalty . . . is based not on the infringer's profit margin[; t]here is no rule that a royalty be no higher than the infringer's net profit margin.\"); Stickle v. Heublein, Inc., 716 F.2d 1550, 1563, 219 USPQ 377, 387 (Fed. Cir. 1983) (royalty need not be less than price of infringing unit). Furthermore, the fact that the award was based on and was a significant portion of the patentee's profits also does not make the award unreasonable. The language of the statute requires \"damages adequate to compensate,\" which does not include a royalty that a patentee who does not wish to license its patent would find unreasonable. See Del Mar, 836 F.2d at 1328, 5 USPQ2d at 1261 (\"[The] imposition on a patent owner who would not have licensed his invention for [a certain] royalty is a form of compulsory license, against the will and interest of the person wronged, in favor of the wrongdoer.\"). Moreover, what an infringer would prefer to pay is not the test for damages. See TWM, 789 F.2d at 900, 229 USPQ at 528 (that the parties might have agreed to a lesser royalty is of little relevance, for to look only at that question would be to pretend that the infringement never happened; it would also make an election to infringe a handy means for competitors to impose a compulsory license policy upon every patent owner).\n\nWe conclude that the district court made no legal error and was not clearly erroneous in determining the reasonable royalty rate. Accordingly, we affirm the trial court's calculation of a reasonable royalty rate. However, because we vacate the court's decision to include dock levelers in the royalty base, we remand for a redetermination of damages based only on the sale of the infringing restraints and not on the restraint-leveler packages.\n\nB.\n\nRite-Hite's Cross Appeal\n\nRite-Hite and the ISOs sought damages based on lost profits at the retail level for ADL-100 and MDL-55 restraints and dock levelers. The district court denied the award on the basis that both Rite-Hite and the ISOs failed to meet their evidentiary burden of proving lost profits. Rite-Hite has not persuaded us that the court's decision was erroneous. As for the ISOs, this issue is mooted by the above rulings.\n\nRite-Hite also argues that the district court erred in awarding interest at a simple rather than a compound rate because, as a matter of law, prejudgment interest must be compounded. We disagree. It has been recognized that \"an award of compound rather than simple interest assures that the patent owner is fully compensated.\" Fromson v. Western Litho Plate \u0026 Supply Co., 13 USPQ2d 1856, 1862 (E.D. Mo. 1989), aff'd mem., 909 F.2d 1495 (Fed. Cir. 1990). However, the determination whether to award simple or compound interest is a matter largely within the discretion of the district court. Gyromat Corp. v. Champion Spark Plug Co., 735 F.2d 549, 557, 222 USPQ 4, 10 (Fed. Cir. 1984) (declining to rule that prejudgment interest must be compounded as a matter of law). Rite-Hite has not persuaded us that the court abused its discretion in awarding interest at a simple rate.\n\nConclusion\n\nOn Kelley's appeal, we affirm the district court's decision that Rite-Hite is entitled to an award of lost profit damages based on its lost business in ADL-100 restraints. We affirm the court's determination of the reasonable royalty rate. We vacate the awards to the ISOs and vacate the damage award based on the dock levelers. We remand for the court to dismiss the ISOs as plaintiffs and recalculate damages to Rite-Hite. On Rite-Hite's cross-appeal, we affirm.\n\nAFFIRMED-IN-PART, VACATED-IN-PART, and REMANDED\n\nDisposition\n\nAFFIRMED-IN-PART, VACATED-IN-PART, and REMANDED\n\nNIES, Circuit Judge, with whom ARCHER, Chief Judge, SMITH, Senior Circuit Judge, and MAYER, Circuit Judge join, Dissenting-in-part.\n\nI.\n\nSUMMARY\n\nThe majority uses the provision in 35 U.S.C. § 284 for \"damages\" as a tool to expand the property rights granted by a patent. I Dissent.\n\nNo one disputes that Rite-Hite is entitled to \"full compensation for any damages suffered as a result of the infringement.\" General Motors Corp. v. Devex Corp., 461 U.S. 648, 653-54, 76 L. Ed. 2d 211, 103 S. Ct. 2058 (1983). \"Damages,\" however, is a word of art. \"Damages in a legal sense means the compensation which the law will award for an injury done.\" Recovery in Patent Infringement Suits: Hearings on H.R. 5231 [later H.R. 5311] Before the Committee on Patents, 79th Cong., 2nd Sess. 9 (1946) (statement of Conder C. Henry, Asst. Comm'r of Patents) (hereinafter \"House Hearings\"). Thus, the question is, \"What are the injuries for which full compensation must be paid?\".\n\nThe majority divorces \"actual damages\" from injury to patent rights.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The majority holds that a patentee is entitled to recover its lost profits caused by the infringer's competition with the patentee's business in ADL restraints, products not incorporating the invention of the patent in suit but assertedly protected by other unlitigated patents. Indeed, the majority states a broader rule for the award of lost profits on any goods of the patentee with which the infringing device competes, even products in the public domain.\n\nI would hold that the diversion of ADL-100 sales is not an injury to patentee's property rights granted by the '847 patent. To constitute legal injury for which lost profits may be awarded, the infringer must interfere with the patentee's property right to an exclusive market in goods embodying the invention of the patent in suit. The patentee's property rights do not extend to its market in other goods unprotected by the litigated patent. Rite-Hite was compensated for the lost profits for 80 sales associated with the MDL-55, the only product it sells embodying the '847 invention. That is the totality of any possible entitlement to lost profits. Under 35 U.S.C. § 284, therefore, Rite-Hite is entitled to \"damages\" calculated as a reasonable royalty on the remainder of Kelley's infringing restraints.\n\nI also disagree that the calculations of a reasonable royalty may be based on a percentage of Rite-Hite's lost profits. Under 35 U.S.C. § 284, a reasonable royalty must be attributed to Kelley's \"use of the invention.\" A royalty must be based on the value of the patented hook, not on other features in the infringing device, e.g., the motors, which form no part of the patented invention used by Kelley. Further, the trial court discounted or excluded significant evidence and otherwise improperly calculated a reasonable royalty rate.\n\nAccordingly, for the reasons more fully presented below, I Dissent from the majority on these issues. I concur in the result of part AII and join part AIII. I take no position on the cross-appeal regarding interest (part B) which is irrelevant to this Dissent.\n\nII.\n\nLOST PROFITS\n\nAs a matter of legal analysis, the majority treats the issue of \"damages\" for a patentee's lost trade in competitive goods not embodying the invention of the patent in suit as one of first impression. It is not. The following outline sets out the established law:\n\n(1) Patent \"damages\" are limited to legal injury to property rights created by the patent, not merely causation in fact.\n\n(2) Under precedent in 1946, a patentee was entitled to recover, either at law or in equity, only the profits attributable to the invention. A patentee's property rights were limited to its exclusivity in the market for the patented goods in suit. \"Damages\" were awardable only for injury to that trade, and only to the extent of the contribution of the invention to profits. Apportionment of profits and the entire market value rule reflect these principles. Injury to the patentee's trade in other competitive products was deemed an indirect loss and not compensable. \"Foreseeability\" was not the test for legal injury for patent infringement.\n\n(3) In 1946, Congress eliminated the remedy of an equitable accounting for a defendant's profits and reenacted the provision for \"damages\" in 1946 and 1952. Congress made no change in the precedential law of \"damages\" except for prejudgment interest.\n\n(4) Since 1946, the Supreme Court has not overturned its precedent on \"damages.\" Under the entire market value rule applicable to lost profits awards, a patentee must prove the invention in suit created consumer demand for the patented and infringing products.\n\n(5) The majority's decision creates a conflict with the law of patent \"damages\" in all other circuits.\n\n(6) The majority decision cannot be reconciled with other provisions of the patent statute or with public policies.\n\nA. The Insufficiency of \"But-For\" as the Sole Test\n\nAs a preliminary matter, I wish to state my reasons for rejecting the arguments made by appellee Rite-Hite in support of the district court's judgment. The district court held, and Rite-Hite argues on appeal, supported by the amici, that the only restriction on the award of \"actual damages\" for patent infringement is proof of causation in fact, that is, satisfaction of a \"but-for\" test.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Under that test, it would follow that Rite-Hite is entitled to any profits it lost due to the infringer's competition, whether it lost sales of restraints embodying the invention in suit, or those protected by other patents, or even products in the public domain, i.e., never patented or the subject of expired patents. The district court applied a \"but-for\" standard to award lost profits on dock levelers as well.\n\nIn support of the district court's ruling, Rite-Hite relies on the statement in Aro Mfg. Co. v. Convertible Top Replacement Co., 377 U.S. 476, 12 L. Ed. 2d 457, 84 S. Ct. 1526 (1964), that a patentee's damages under the statute must be measured by \"the difference between his pecuniary condition after the infringement, and what his condition would have been if the infringement had not occurred.\" 377 U.S. at 507 (plurality opinion) (quoting Yale Lock Mfg. Co. v. Sargent, 117 U.S. 536, 552, 29 L. Ed. 954, 6 S. Ct. 934 (1886)). However, one of the most common sources of error occurs from quotations taken from opinions out of context. One might just as well try to play music merely by reading the lyrics. In Aro, the quoted statement was made in connection with limiting the amount of damages which could be recovered. As further explained respecting damages for contributory infringement:\n\nAfter a patentee has collected from or on behalf of a direct infringer damages sufficient to put him in the position he would have occupied had there been no infringement, he cannot thereafter collect actual damages from a person liable only for contributing to the same infringement.\n\nAro, 377 U.S. at 512. The quotation from Aro on which Rite-Hite relies simply precludes double recovery. Aro does not mandate that a \"but-for\" test is the only restriction on recovery of patent infringement damages. Nor does Aro endorse the expansive view of damages adopted by the majority. In rejecting the patentee's damages theory, the opinion stated, \"It would enable the patentee to derive a profit not merely on unpatented rather than patented goods--an achievement proscribed by the Motion Picture Patents [243 U.S. 502, 61 L. Ed. 2d 871, 37 S. Ct. 416] and Mercoid [320 U.S. 661, 88 L. Ed. 2d 376, 64 S. Ct. 268] cases--but on unpatented and patented goods.\" 377 U.S. at 510 (plurality) (emphasis in original).\n\nRite-Hite's principal authority from this court for its \"but-for\" theory is Lam, Inc. v. Johns-Manville Corp., 718 F.2d 1056, 219 USPQ 670 (Fed. Cir. 1983). The Lam rule, according to Rite-Hite, similarly requires only that the court answer the question: \"Had the Infringer not infringed, what would Patent Holder . . . have made?'\" Lam, 718 F.2d at 1064, 219 USPQ at 677 (quoting Aro, 377 U.S. at 507). However, lost profits in Lam were awarded for interference with the patentee's sales of lamps which were \"the embodiment of the claimed invention.\" Lam, 718 F.2d at 1059, 219 USPQ at 671. In Lam, indeed, in all of our previous decisions on \"lost profits,\" we were addressing the factual issue of whether the patentee was entitled to its lost profits by reason of the infringer's diversion of the patentee's sales of products embodying the invention of the infringed patent.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The issue of recovery for losses related to the marketing of a patentee's competitive product protected, if at all, under a different patent, was not involved.\n\nOver centuries of Judge-made law, the term \"damages\" has become a word of art in the common law carrying both factual and legal limitations. The legal limitations (frequently called \"proximate cause,\" an unfortunate expression because of its confusing similarity to a but-for test) must be determined as a matter of law by the Judge. W. Page Keeton, et al., Prosser and Keeton on the Law of Torts § 41 (5th ed. 1984). Causation in fact of an injury (i.e., the but-for test) is applied after the legal determination is made that the asserted injury is a type which is legally compensable for the wrong. The but-for determination is a factual matter for the jury (or the Judge in a bench trial). Thus, the common law term \"damages\" does not encompass any and all economic injury that one may suffer in fact from a wrong. Also, contrary to the district court's view, \"proximate\" or \"legal\" causation of patent damages is not merely a more closely scrutinized causation in fact test determined by \"the quality of plaintiffs' proof.\" 774 F. Supp. at 1537, 21 USPQ at 1819. In connection with a tort created by a federal statute, the public purpose of the statute and the likely intent of Congress are the overriding considerations respecting the types of injuries for which damages may legally be awarded. Holmes v. Securities Investor Protection Corp., 503 U.S. 258, 274, 117 L. Ed. 2d 532, 112 S. Ct. 1311 (1992); Associated Gen. Contractors, Inc. v. California State Council of Carpenters, 459 U.S. 519, 538-40, 74 L. Ed. 2d 723, 103 S. Ct. 897 (1983); see also Brunswick Corp. v. Pueblo Bowl-O-Mat, Inc., 429 U.S. 477, 489, 50 L. Ed. 2d 701, 97 S. Ct. 690 (1977) (\"[Plaintiff under section 7 of the Clayton Act] must prove more than injury causally linked to an illegal presence in the market. Plaintiffs must prove antitrust injury, which is to say injury of the type the antitrust laws were intended to prevent.\") Courts must be careful to discern and not exceed the purpose which the legislature intended. Cf. Keeton, et al., supra, § 36.\n\nThe term \"damages\" in the patent statute must be interpreted in light of the familiar common law principles of legal or proximate cause associated generally with that term. In rejecting a \"but-for\" standard for determining \"damages\" in the Clayton Act,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e the Supreme Court observed:\n\n[A] number of Judge-made rules circumscribed the availability of damages recoveries in both tort and contract litigation - doctrines such as foreseeability and proximate cause, directness of injury, certainty of damages, and privity of contract. Although particular common-law limitations were not debated in Congress, the frequent references to common-law principles imply that Congress simply assumed that antitrust damages litigation would be subject to constraints comparable to well-accepted common-law rules applied in comparable litigation.\n\nAssociated Gen. Contractors, 459 U.S. at 532-33 (citations omitted).\n\nThe Supreme Court has recently applied a similar analysis of the civil action damages provision of RICO.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Holmes v. Securities Investor Protection Corp., 503 U.S. 258, 112 S. Ct.\n\n1311, 1316-19, 117 L. Ed. 2d 532 (1992). As stated in Holmes respecting the overriding necessity for \"proximate cause\" for an injury to be compensable under a statute awarding \"damages\":\n\n[A] showing [must be made] not only that the defendant's violation [of RICO] was a 'but for' cause of [the plaintiff's] injury, but was the proximate cause as well. [As further explained] proximate cause [is used] to label generically the judicial tools used to limit a person's responsibility for the consequences of that person's own acts.\n\n112 S. Ct. at 1316-18 (emphasis added).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nUnder this Supreme Court precedent, the law is clear that proximate cause is applied as a legal limitation on \"damages\" in connection with the statutory torts which the Court has considered. A \"but-for\" test tells us nothing about whether the injury is legally one which is compensable. As above stated, the lack of proximate causation will preclude recovery for certain losses even though a \"but-for\" standard of injury in fact is satisfied. See also Blue Shield of Va. v. McCready, 457 U.S. 465, 476-77, 73 L. Ed. 2d 149, 102 S. Ct. 2540 (1982) (Clayton Act); Davis v. AVCO Fin. Servs., Inc., 739 F.2d 1057, 1067 (6th Cir. 1984), cert. denied, 470 U.S. 1005, 84 L. Ed. 2d 381, 105 S. Ct. 1359 (1985) (\"but-for\" test may not be equated with \"proximate cause\"); Keeton, et al., supra, at 42.\n\nRite-Hite and the majority treat lost profits as the legal injury. However, lost profits is a way to measure compensation for a legal injury. Lost profits is not itself the legal injury. No rational basis is suggested by Rite-Hite or the amici for applying a different interpretation to the statutory term \"damages\" in connection with the tort of patent infringement. No legislative history even hints that patentees are so favored that a special or more expansive meaning was intended for patent \"damages.\" A \"but-for\" test for \"damages,\" which would mandate that all types of economic injury to a patentee's business traceable to the infringement are compensable, is as legally deficient a standard for patent infringement \"damages\" as for \"damages\" under the Clayton Act or RICO. Causation in fact is not the sole test for determining compensable \"damages\" under 35 U.S.C. § 284.\n\nThat said, however, merely brings us to the issue of what are the legal limits on \"damages\" for patent infringement.\n\nAs will be shown, precedent before 1946 unequivocally established that compensable lost profits were restricted to those the patentee would have made from commercializing the invention. Further, Congress reenacted the provision for \"damages\" with that understanding.\n\nB.\n\nStatutory Provisions\n\nThe question raised in this appeal is one of statutory construction, but it is of constitutional dimension. Article I, section 8 of the Constitution provides for a patent system which will \"promote the Progress . . . of the useful Arts, by securing for limited Times to . . . Inventors the exclusive Right to their Discoveries.\" Congress has provided in 35 U.S.C. § 284 (1988):\n\nUpon finding for the claimant the court shall award the claimant damages adequate to compensate for the infringement, but in no event less than a reasonable royalty for the use made of the invention by the infringer, together with interest and costs as fixed by the court.\n\nWhen the damages are not found by a jury, the court shall assess them. In either event the court may increase the damages up to three times the amount found or assessed.\n\nThe court may receive expert testimony as an aid to the determination of damages or of what royalty would be reasonable under the circumstances.\n\nWhat stimulus, what financial rewards did Congress intend by the term \"damages\" to effect the purpose of promoting progress in the useful Arts?\n\nThe majority concludes that Congress enacted expansive language in § 284, providing \"only a lower limit and no other limitation.\" Slip op. at 8.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The majority finds support for its interpretation in the statement in Devex Corp., 461 U.S. at 653-54, that Congress sought to \"ensure that the patent owner would, in fact, receive full compensation for 'any damages' [the patentee] suffered as a result of infringement\" (quotation marks in original). The majority also states that the Devex Court cautioned against imposing limitations on patent infringement damages that were not explicit. Id. at 653. While true, that \"caution\" was only part of the Court's analysis. In Devex, the question was the interpretation of the provision for \"interest\" added in 1946, later codified in § 284, with respect to which the Court explained:\n\nThis is not a case in which Congress has reenacted statutory language that the courts had interpreted in a particular way. In such a situation, it may well be appropriate to infer that Congress intended to adopt the established judicial interpretation.\n\nId.\n\nThe provision for \"damages\" in § 284, unlike that for \"interest,\" was reenacted language. While the statutory remedies have been modified over the years in other ways, a patentee has been entitled to recover actual damages at law since the beginning of the nineteenth century. See Seymour v. McCormick, 57 U.S. (16 How.) 480, 488-89, 14 L. Ed. 1024 (1854), for a review of the 1836 Act and earlier statutory provisions. See also Irah H. Donner, BIC Leisure v. Windsurfing, 4 Fed. Circuit Bar J. 167 (1994).\n\nImmediately prior to 1946, the patent statute provided for recovery of the \"damages\" the patentee sustained, a remedy at law, which could, in appropriate cases, be the amount of a patentee's lost profits by diversion of its sales of patented goods, the amount of an established royalty or a reasonably royalty.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In addition, a patentee was entitled to an equitable accounting for profits made by the infringer from the invention. To simplify proceedings, both remedies were made available by statute in an equity court where infringement suits were generally brought in order to obtain injunctive relief. Patent Act of 1870, ch. 230, 16 Stat. 206-7 (1870). The provision for \"damages\" and for an accounting for profits did not, however, allow double recovery. Common law \"damages\" were recovered to the extent the amount exceeded a defendant's profits.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n\"By the 1946 amendments, [citation omitted] the statute was changed to its present form, whereby only 'damages' are recoverable.\" Aro Mfg. Co., 377 U.S. at 505. This was effected by eliminating an accounting for an infringer's profits. A specific provision for \"damages\" measured as a reasonably royalty was added, as well as a provision for prejudgment interest. Act of Aug. 1, 1946, ch. 726, § 1, 60 Stat. 778 (codified as amended at 35 U.S.C. §§ 281, 283-286, 290 (1988)). The 1952 codification of the patent statute did not change the substance of allowable \"damages.\" Its stated purpose was merely \"reorganization in language to clarify the statement of the statutes.\" Aro, 377 U.S. at 505 n.20 (quoting H.R. Rep. No. 1923, 82d Cong., 2d Sess. at 10, 29 (1952)). Thus, again \"damages\" is reenacted language and it would be reasonable to infer that Congress intended to adopt the established judicial interpretation. Id.\n\nOne need not rely on mere inference respecting the meaning Congress intended for the term \"damages.\" As explained to Congress in hearings on the 1946 statute by officials of the Patent Office and other witnesses endorsing the bill, \"Damages in a legal sense means the compensation which the law will award for an injury done.\" House Hearings at 9 (Henry statement). Respecting the restriction of profits to those created by the invention, all agreed \"those [are] the only profits to which the patentee is entitled.\" Id. at 3 (Fish letter introduced by Hon. Robert K. Henry, Member of Congress). Those statements correctly reflect the pre-1946 meaning of \"damages\" in the patent statute.\n\nC. Property Rights Granted by Patent\n\nAn examination of pre-1946 Supreme Court precedent discloses that the legal scope of actual damages for patent infringement was limited to the extent of the defendant's interference with the patentee's market in goods embodying the invention of the patent in suit. This limitation reflects the underlying public policy of the patent statute to promote commerce in new products for the public's benefit. More importantly, it protects the only property rights of a patentee which are protectable, namely those granted by the patent. The patentee obtained as its property an exclusive market in the patented goods. \"Infringement was a tortious taking of a part of that property.\" Dowagiac Mfg. Co. v. Minnesota Moline Plow Co., 235 U.S. 641, 648, 59 L. Ed. 398, 35 S. Ct. 221 (1915). In theory the infringer was a trustee of profits it made off the invention and/or was liable for lost profits the patentee would have made from its own sales of the patented goods.\n\nIn Continental Paper Bag Co. v. Eastern Paper Bag Co., 210 U.S. 405, 430, 52 L. Ed. 1122, 28 S. Ct. 748 (1908), the Supreme Court advised: \"From the character of the right of the patentee we may Judge of his remedies.\" Until the Act of 1952, the right granted to a patentee was stated in terms of the exclusive right to make and use and vend the protected invention.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e This language tracks the English Statute of Monopolies (1624) under which the Crown did give a monopoly to an inventor to make and work certain new manufactures within the realm for a limited period.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The term \"invention\" itself meant the establishment of a new trade or industry. Thus, under the Statute of Monopolies, an \"inventor\" was anyone who developed an industry previously unknown in England. The period of exclusivity was given for the inventor to reap his reward in the marketplace without competition while thereby training others to make and use his invention at the end of the patent term.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Indeed, failure to exploit in England was a basis for cancellation of the grant.\n\nIn contrast, in the United States, the grant of a patent did not convey to the inventor a right to make, use and vend his invention despite the statutory language originally to that effect. In interpreting a patentee's rights in Crown Die \u0026 Tool Co. v. Nye Tool \u0026 Machine Works, 261 U.S. 24, 26, 67 L. Ed. 516, 43 S. Ct. 254 (1923), the Supreme Court explained that an inventor has a natural right to make, use and sell his invention, and that a patent augments an inventor's position by making that natural right exclusive for a limited time. The statutory language was interpreted to give a right to preclude others from interfering with the patentee's exclusivity in providing the patented goods to the public. Id. at 34.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAn inventor is entitled to a patent by meeting the statutory requirements respecting disclosure of the invention. Prior commercialization of the invention has never been a requirement in our law to obtain a patent. An inventor is merely required to teach others his invention in his patent application. Thus, when faced with the question of whether a patentee was entitled to enjoin an infringer despite the patentee's failure to use its invention, the Supreme Court held for the patentee. Continental Paper Bag, 210 U.S. at 424-430. Congress provided a right to exclusive use and to deny that privilege would destroy that right. Id. at 430. An injunction preserves the patentee's exclusive right to market embodiments of the patented invention.\n\nThese clearly established principles, however, do not lead to the Conclusion that the patentee's failure to commercialize plays no role in determining damages. That the quid pro quo for obtaining a patent is disclosure of the invention does not dictate the answer to the question of the legal scope of damages. The patent system was not designed merely to build up a library of information by disclosure, valuable though that is, but to get new products into the marketplace during the period of exclusivity so that the public receives full benefits from the grant. The Congress of the fledgling country did not act so quickly in enacting the Patent Act of 1790 merely to further intellectual pursuits. As explained in an early text, \"The patent laws promote the progress in different ways, prominent among which are [inter alia ] by protecting the investment of capital in the development and working of a new invention from ruinous competition till the investment becomes remunerative.\" Simonds, Summary of the Law of Patents 9 (1883). Better or cheaper products in the marketplace which promote competition is the goal.\n\nIn Bement v. National Harrow Co., the Supreme Court recognized that the patent system was designed to stimulate the patentee to put new products into the market where the public would benefit from them:\n\n\"If [the patentee] see fit, he may reserve to himself the exclusive use of his invention or discovery. If he will neither use his device nor permit others to use it, he has but suppressed his own. That the grant is made upon the reasonable expectation that he will either put his invention to practical use or permit others to avail themselves of it upon reasonable terms, is doubtless true. This expectation is based alone upon the supposition that the patentee's interest will induce him to use, or let others use, his invention. The public has retained no other security to enforce such expectations.\"\n\n186 U.S. 70, 90 (1902) (quoting Heaton-Peninsular Co. v. Eureka Specialty Co., 77 F. 288, 294, 47 U.S. App. 146, 160 (6th Cir. 1896)) (emphasis added). Other statements of the Court are of like import. In Woodbridge v. United States, 263 U.S. 50, 55-56, 68 L. Ed. 159, 44 S. Ct. 45 (1923), the Court opined: \"Congress relies for the public benefit to be derived from the invention during the monopoly [i.e., the term of a patentee's exclusive market] on the natural motive for gain in the patentee to exploit his invention and to make, use and vend it or its products or to permit others to do so, for profit.\" The grant of a period in which a patentee has exclusivity in commercialization of its patented product without competition from infringing products of others is provided in order to attract the necessary capital to start up a new business. Exclusivity in commercialization enables a patentee to recoup its investment in research, production, and marketing a new product. The merits of the invention will determine the patentee's just reward from the public.\n\nThus, a patentee may withhold from the public the benefit of use of its invention during the patent term, and the public has no way to withdraw the grant for nonuse. Like the owner of a farm, a patentee may let his property lay fallow. In doing so, \"he has but suppressed his own.\" Bement, 186 U.S. at 90. But it is anomalous to hold that Congress, by providing an incentive for the patentee to enter the market, intended the patentee to be rewarded the same for letting his property lay fallow during the term of the patent as for making the investment necessary to commercializing a new product or licensing others to do so, in order that the public benefits from the invention. The status quo may serve the patentee's interest, but that is not the only consideration. The patent grant \"was never designed for [an inventor's] exclusive profit or advantage.\" Kendall v. Winsor, 62 U.S. (21 How.) 322, 328, 16 L. Ed. 165 (1858).\n\nD.\n\nInjury to a Patentee's Market in Unprotected Goods is not a Patent Infringement Injury\n\nThe question of recovery of lost profits to compensate a patentee for injury to its business in competitive products not protected by the patent in suit (hereinafter \"unprotected goods\") is not a new theory of damages. Over a hundred years ago, the Supreme Court expressed its view that damages in the form of lost profits must be based upon injury to the patentee's trade in products embodying the patented invention. As stated in Crosby Steam Gage \u0026 Valve Co. v. Consolidated Safety Valve Co., 141 U.S. 441, 452-53, 35 L. Ed. 809, 12 S. Ct. 49 (1891) (emphasis added):\n\nIf there had been an award of damages, and the loss of trade by the plaintiff, in consequence of the competition by the defendant, had been an element entering into those damages, it would have been a material fact to be shown by the plaintiff that it was putting on the market goods embodying the [patented] invention.\n\nFaced with that statement by the Supreme Court, few patentees have had the temerity to seek damages for loss of trade in competitive unprotected devices and none have been successful in any other circuit.\n\nSince Seymour v. McCormick, 57 U.S. (16 How.) 487, 14 L. Ed. 1024 (1854), it had been an accepted tenet that actual \"damages\" depended on the infringer's interference with the patentee's commercial use of its invention either by exploiting the monopoly himself (that is, satisfying demand with his own patented goods) or by licensing the patent. Yale Lock Mfg. Co. v. Sargent, another frequently cited damages case, rests on the tenet that the infringement interfered with the patentee's marketing of the patented goods:\n\nAs the plaintiff, at the time of the infringement, availed himself of his exclusive right by keeping his patent a monopoly, and granting no licenses, the difference between his pecuniary condition after the infringement, and what his condition would have been if the infringement had not occurred, is to be measured, so far as his own sales of locks are concerned, by the difference between the money he would have realized from such sales if the infringement had not interfered with such monopoly, and the money he did realize from such sales.\n\n117 U.S. at 552-53 (emphasis added). Absent a patentee's use of its invention or proof of an established license fee, infringement of a patent resulted in nominal damages. Rude v. Westcott, 130 U.S. 152, 165-67, 32 L. Ed. 888, 9 S. Ct. 463 (1889); 3 William C. Robinson, The Law of Patents § 1052 (1890). See 1 T. Sedwick, Measure of Damages 80 (1880) (general principle of nominal damages applied to patent infringement).\n\nCommercialization of a patented invention can be accomplished by the patentee either (1) itself making, using or selling an embodiment of the invention or (2) licensing others to do so. Seymour, 57 U.S. (16 How.) at 489-90. Calculation of actual \"damages\" depended upon which of those two modes the patentee chose to secure the financial benefits from its invention. See McCormick v. Seymour, 15 F. Cas. 1329, 1335 (No. 8727) (C.C.N.D.N.Y. 1854) (on remand). \"Hence the first point on which proof should be offered in reference to actual damages is the use made of his patent privilege by the plaintiff; the second is the effect produced upon the value of such use by the wrongful acts of the defendant.\" 3 Robinson § 1054 at 324. Evidence was not admissible of losses over the amount the patentee would have cleared by working or licensing the invention. Id. § 1061 at 339. Carter v. Baker, 5 F. Cas. 195, 201-02(C.C.D. Cal. 1871) (No. 2,472) . As stated in 3 Robinson § 898 at 56, respecting damage awards:\n\nThe interest of the patentee is represented by the emoluments which he does or might receive from the practice of the invention by himself or others. Hence acts of infringement must attack the right of the patentee to those emoluments.\n\nAn attempt to recover actual damages for lost sales of a competitive unprotected product was made in Metallic Rubber Tire Co. v. Hartford Rubber Works Co., 275 F. 315, 323-24 (2d Cir.), cert. denied, 257 U.S. 650, 66 L. Ed. 416, 42 S. Ct. 57 (1921). The Second Circuit held there could be no award of lost profits where the patentee, a maker of competitive tires, never manufactured and sold a tire containing the invention of the patent in suit. Similarly, in Carter, 5 F. Cas. at 201-02, the court instructed the jury that a patentee's loss by reason of its inability to sell plows other than those embodying the patent infringed were \"remote consequential damages\" and not recoverable. As further explained in Carter, 5 F. Cas. at 202, the award of lost profits must be the \"direct and legitimate fruits of that patent. They may have sustained damages from [loss of sales of a competing unprotected device], but they are too remote.\" In Standard Mailing Machines Co. v. Postage Meter Co., 31 F.2d 459 (D. Mass. 1929), the court limited the patentee to a reasonable royalty award because the patentee, although marketing a competitive product, was not \"in the market during the infringing period, prepared to sell machines embodying the patented invention.\" Id. at 462. In McComb v. Brodie, 15 F. Cas. 1290, 1295(C.C.D. La. 1872) (No. 8,708) , the court instructed the jury to award lost profits only if the patentee was ready to supply the market with patented goods and the infringer diverted those sales. See also Goodyear v. Bishop, 10 F. Cas. 642(C.C.S.D.N.Y. 1861) (No. 5,559) (jury charge); Buerk v. Imhaeuser, 4 F. Cas. 594, 595(C.C.S.D.N.Y. 1876) (No. 2,107) (equity court); Spaulding v. Page, 22 F. Cas. 892, 895(C.C.D. Cal 1871) (No. 13,219) .\n\nAdditionally, the commentary over the years supports this position. The current statement in 8 Ernest Bainbridge Lipscomb, Walker on Patents § 27:22 (1989) has been essentially unchanged since at least the 1940's, before the present statute was enacted:\n\nIndirect consequential damage cannot be recovered in a patent infringement action. [Footnote omitted. See, e.g., Velo-Bind, Inc. v. Minnesota Mining \u0026 Mfg. Co., 647 F.2d 965, 973, 211 USPQ 926, 934 (9th Cir. 1981).] The instances in which such damages have been claimed are few, but it is advisable to mention such injuries as might probably be held to fall within such a category.\n\nPecuniary injury may result to a patentee from a particular infringement, in that it caused him to suffer competition and consequent loss in business outside of the patent infringed ; or in that it so unexpectedly reduced the business in the patented article as to make it necessary for him to sell unpatented property at less than its real value, or to borrow money at more than a proper rate of interest in order to meet his pecuniary engagements; or in that it encouraged other persons to infringe from whom, by reason of insolvency or other obstacle, no recovery can be obtained; or in that such infringement caused the patentee so much trouble and anxiety that he incurred loss from inability to attend to other business. But pecuniary injury of any of these kinds would be such an indirect consequential matter as not to furnish any part of a proper basis for recoverable damages in an infringement suit. [Emphasis added.]\n\nThere is no dispute that parts of a patentee's business not directed to commercializing the patented invention may indirectly benefit from the patentee's ownership of that patent. An extant patent of which a patentee makes little or no commercial use may serve to impede competition in the field so that a patentee is able to maintain its market position for the patentee's already established line of unprotected goods. However, where infringement of the patent interferes with that indirect benefit from the patent, the injury has heretofore been held to be an indirect consequential loss and not recoverable.\n\nE.\n\nPrecedent Respecting the Apportionment of Profits and the Entire Market Value Rule\n\nThe limitation of a patentee's monetary recovery to profits created by the invention is also reflected in the extensive pre-1946 caselaw on apportionment of profits and the correlative entire market value rule. While patentees who commercialized the invention of the patent in suit might recover some amount of profits, the entire amount of profits would not be awarded where the invention was not of an entirely new device but amounted only to an improvement, unless the invention was the basis for demand for the entire device. Similarly, in equity a patentee was limited to an accounting for the defendants' profits attributable to the invention. See Dobson v. Dornan, 118 U.S. 10, 30 L. Ed. 63, 6 S. Ct. 946 (1886) (involving both patentee's lost profits and accounting for defendant's profits; apportionment required); Dobson v. Hartford Carpet Co., 114 U.S. 439, 444-46, 29 L. Ed. 177, 5 S. Ct. 945 (1885) (involving apportionment of the patentee's lost profits; patentee must show \"that the profits and damages are to be calculated on the whole machine for the reason that the entire value of the whole machine, as a marketable article, is properly and legally attributable to the patented feature . . . . To attribute, in law, the entire profit to the [invention] to the exclusion of the other merits, unless it is shown, by evidence, as a fact, that the profit ought to be so attributed, not only violates the statutory rules of 'actual damages' and of 'profits to be accounted for,' but confounds all distinctions between cause and effect.\"); Garretson v. Clark, 111 U.S. 120, 28 L. Ed. 371, 4 S. Ct. 291 (1884) (Patentee must apportion profits between patented and unpatented features or prove \"damages are to be calculated on the whole machine for the reason that the entire value of the whole machine, as a marketable article, is properly and legally attributable to the patented feature.\"); Seymour, 57 U.S. (16 How.) at 490 (same damage rule does not apply whether invention covers an entire machine or an improvement); Keystone Mfg. Co. v. Adams, 151 U.S. 139, 147-48, 38 L. Ed. 103, 14 S. Ct. 295 (1894) (serious difficulties arise in determining measure of damages where \"patented invention is but one feature in a machine embracing other devices that contribute to the profits made by the defendant.\"). The Supreme Court has long rejected the view that damages are recoupable for the profit attributable to other patents embodied in a competitive device of the patentee. Blake v. Robertson, 94 U.S. 728, 733, 734, 24 L. Ed. 245 (1877). Cf. Yale Lock Co., 117 U.S. at 553 (patentee's price-erosion award reduced where third party's patented invention incorporated into infringing device).\n\nApportionment of profits so as to reflect the \"fruits\" of the patent was the problem that prompted the 1946 amendments of the statute. The legislative history repeatedly indicates that apportionment required protracted expensive litigation for both parties and, because it was virtually impossible to apportion profits with any exactitude, frequently produced unfair results. Yet the profits due to the invention are the only profits to which the patentee was entitled unless the patentee could prove that the entirety of the profits were due to the invention under the entire market value rule. Westinghouse Elec. \u0026 Mfg. Co. v. Wagner Elec. \u0026 Mfg. Co., 225 U.S. 604, 615, 56 L. Ed. 1222, 32 S. Ct. 691 (1912). In Westinghouse, the Supreme Court went on to hold that if the patentee did all it could to attempt to apportion the defendant's profits, the burden on apportionment shifted to the defendant in equitable accountings. Congress was told that, under the Westinghouse doctrine, the patentee \"gets in very many cases enormously more than that to which he is really entitled.\" The elimination of equitable accountings, the most commonly used remedy, was urged for that reason. House Hearings at 3 (Fish letter). Congress was persuaded and deleted the remedy of equitable accountings for the defendant's profits from the statute. Aro, 377 U.S. at 505.\n\nRespecting \"damages\" at law, in Dowagiac Mfg. Co., supra, the Supreme Court endorsed the theory of a hypothetical reasonable royalty as \"damages\" where the patentee could not prove actual damages. This relief had been developed in several lower courts because of the unfairness to the patentee who, despite infringement, received only nominal damages. 235 U.S. at 648-50. Where actual damages in the form of recoupment of a patentee's \"lost profits\" or the amount of an established royalty could not be proved, the Dowagiac Court held that the patentee \"was entitled to prove what would have been a reasonable royalty.\" Dowagiac, 235 U.S. at 650. Thus, to receive more than nominal damages, proof of actual losses was no longer required. Congress gave its specific approval to a reasonable royalty as statutory \"damages\" by enactment of the provision, \"general damages . . . not less than a reasonable royalty.\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe 1946 amendments provide no basis for the majority's expansive view that Congress intended a patentee to recoup all losses from infringement with \"only a lower limit and no other limitation.\" Slip op. at 8. Indeed, Congress eliminated equitable accounting which, under Westinghouse, had favored patentees. Monetary relief was expanded to provide for the recovery of prejudgment interest. Respecting other forms of \"damages,\" Congress left the law intact. Faulkner v. Gibbs, 199 F.2d 635, 638 (9th Cir. 1952). A patentee remained entitled to recover its own lost profits only to the extent that they were directly created by the invention of the patent in suit and, thus, were the fruit of the invention. The scope of legal injury, that is, a patentee's property right to an exclusive market in patented goods, was not enlarged.\n\nF. Post-1946 Precedent\n\nThe previously discussed decisions in Aro, which limited damages, and General Motors, which dealt with prejudgment interest, provide the only direct guidance from the Supreme Court on \"damages\" under the current statute. Neither overturns the established precedent that a patentee is entitled to its own lost profits only for diversion of sales which the patentee would have made from its goods using the invention of the litigated patent. Nor do they overturn the entire market value rule that the entirety of a patentee's lost profits may be recovered as \"damages\" only where the patentee proves that use of the invention in suit in the patentee's and infringer's goods creates consumer demand for the entire product.\n\nBetween 1946 and 1982, every other circuit which addressed the issue adhered to the basic tenet that a patent protects a patentee's market for its own goods embodying the invention and no other market. Moreover, lost profits on an entire product were recoverable only where the patented invention created the demand for that product. The following cases are illustrative:\n\nSecond Circuit:\n\nElectric Pipe Line, Inc. v. Fluid Systems, Inc., 250 F.2d 697, 699, 116 USPQ 25, 27 (2nd Cir. 1957) (Lost profits appropriate since patentee and infringer \"were the only suppliers of this unique patented fuel storage and transportation system . . . [and] but for [defendant's] infringement, [patentee] would have made all these installations.\").\n\nThird Circuit:\n\nAmerican Securit Co. v. Shatterproof Glass Corp., 268 F.2d 769, 777, 122 USPQ 167, 174 (3d Cir.), cert. denied, 361 U.S. 902, 4 L. Ed. 2d 157, 80 S. Ct. 210 (1959) (\"Each patent gives its owner a monopoly in respect to its disclosures, so much and no more. It is a grant of the exclusive right to manufacture, use and sell the invention which is disclosed. That invention is what the patent grant protects by the monopoly, not that invention plus some embellishment, improvement, or alternate product or process, which also happens to be patented.\");\n\nDevex Corp. v. General Motors Corp., 667 F.2d 347, 361, 212 USPQ 643, 655 (3rd. Cir. 1981) aff'd 461 U.S. 648, 76 L. Ed. 2d 211, 103 S. Ct. 2058 (1983) (\"Where a plaintiff itself uses the patented process in manufacturing, damages for infringement may take the form of lost profits, and the burden is on the plaintiff to show their amount. Where, as here, the party alleging infringement does not itself manufacture or use the patented process, compensation may take the form of a reasonable royalty for licensing the use of the patent.\") (Citations omitted.) (The majority cites Supreme Court decision as support for a more expansive view.)\n\nFourth Circuit:\n\nMarvel Specialty Co. v. Bell Hosiery Mills, Inc., 386 F.2d 287, 155 USPQ 545 (4th Cir. 1967) cert. denied 390 U.S. 1030, 20 L. Ed. 2d 286, 88 S. Ct. 1409 (1968) (Patentee manufacturer could recover only established royalty for patented goods, not other established royalty for patented goods plus improvements not covered by patent).\n\nFifth Circuit:\n\nBaumstimler v. Rankin, 677 F.2d 1061, 1072, 215 USPQ 575, 584 (5th. Cir. 1982) (\"Since [patentee] did not manufacture, sell or use the patented invention . . . [patentee] technically had no lost profits\");\n\nLivesay Window Co. v. Livesay Indus., Inc., 251 F.2d 469, 470, 116 USPQ 167, 168-89 (5th Cir. 1958) (Lost profits determined based on sales of patented invention by exclusive licensee).\n\nSixth Circuit:\n\nPanduit Corp. v. Stahlin Bros. Fibre Works, Inc., 575 F.2d 1152, 1156, 197 USPQ 726, 730 (6th Cir. 1978) (Patentee manufacturer must prove lost profits by showing: \"1) demand for the patented product, 2) absence of acceptable noninfringing substitutes, 3) his manufacturing and marketing capability to exploit the demand [for the patented product], and 4) the amount of profits he would have made.\").\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nSeventh Circuit:\n\nUnion Carbide Corp. v. Graver Tank \u0026 Mfg. Co., 282 F.2d 653, 665-68, 127 USPQ 3, 12-14 (7th Cir. 1960), cert. denied, 365 U.S. 812 (1961) (Upholding special master's Conclusion of law which stated \"Plaintiff . . . has failed to prove . . . the amount of its damage from loss of profits it would have made on such additional sales of the patented composition\").\n\nSee also In re Universal Research Lab., Inc. 203 USPQ 984, 989 (N.D. Ill. 1978).\n\nNinth Circuit:\n\nVelo-Bind, inc. v. Minnesota Mining \u0026 Mfg. Co., 647 F.2d 965, 973, 211 USPQ 926, 933-94 (9th Cir.), cert. denied, 454 U.S. 1093, 70 L. Ed. 2d 631, 102 S. Ct. 658 (1981) (patentee manufacturer of invention denied lost profits on unpatented supplies: \"where the patent creates only part of the profits, damages are limited to that part of the profits, which must be apportioned as between those created by the patent and those not so created. [citation omitted] The damages sustained by [patentee] are easily apportioned between patented and unpatented lost sales.\");\n\nFaulkner v. Gibbs, 199 F.2d 635, 638 n.7, 95 USPQ 400, 402 n.7 (9th Cir. 1952) (\"Where, however, the patentee has himself engaged in the manufacture, use or sale of his patented article, he may be awarded damages for his loss of profits resulting from the infringement.\").\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nUntil this decision, the precedent of this court was consistent with other circuits. Lost profits have not been awarded except where the patentee lost sales of products in which the patentee used the claimed invention found to be infringed. See Manville Sales Corp. v. Paramount Sys., Inc., 917 F.2d 544, 549-51, 16 USPQ2d 1587, 1591-92 (Fed. Cir. 1990); Kalman v. Berlyn Corp., 914 F.2d 1473, 1475-76, 16 USPQ2d 1093, 1094 (Fed. Cir. 1990); State Indus., 883 F.2d at 1580, 12 USPQ2d at 1031; Ryco, Inc. v. Ag-Bag Corp., 857 F.2d 1418, 1422, 8 USPQ2d 1323, 1326 (Fed. Cir. 1988); Hartness Int'l, Inc. v. Simplimatic Eng'g Co., 819 F.2d 1100, 1106, 2 USPQ2d 1826, 1829 (Fed. Cir. 1987); Otari, 767 F.2d at 853, 226 USPQ at 402; Gyromat Corp. v. Champion Spark Plug Co., 735 F.2d 549, 554, 222 USPQ 4, 8 (Fed. Cir. 1984); Lam, Inc., 718 F.2d 1056, 219 USPQ 670. Indeed, we have specifically endorsed the requirement of commercial use by the patentee of the invention in suit for an award of lost profits. In Trell v. Marlee Electronics Corp., 912 F.2d 1443, 1445, 16 USPQ2d 1059, 1061 (Fed. Cir. 1990), this court stated, \"because Trell did not sell its invention in the United States, he could not seek damages on the basis of lost profits.\" To the same effect is the statement in Lindemann Maschinenfabrik GmbH v. American Hoist \u0026 Derrick Co., 895 F.2d 1403, 1406 n.2, 13 USPQ2d 1871, 1874 n.2 (Fed. Cir. 1990) (emphasis added):\n\nBecause Lindemann did not compete in the sale of its invention in the United States, it did not, as it could not, seek damages on the basis of lost profits.\n\nSimilarly, the need for the patentee to compete with a product using the patented invention to obtain lost profits underlies the statement in Micro Motion, Inc. v. Kane Steel Co., 894 F.2d 1318, 1322, 13 USPQ2d 1696, 1698 (Fed. Cir. 1990), \"where the patentee produces or sells a product (or service) covered by the patent claims, the patentee may seek to recover damages based on a theory of lost profits . . .\"; and in Del Mar Avionics, 836 F.2d at 1326, 5 USPQ2d at 1260, \"the general rule of determining the actual damages to a patentee that is itself producing the patented item is to determine the sales and profits lost to the patentee because of the infringement\" (emphasis added).\n\nMoreover, under our precedent, lost profit awards have been dependent, inter alia, on proof that consumer demand for the patentee's goods is created by the advantages of the patented invention. Slimfold Mfg. Co. v. Kinkead Indus., Inc., 932 F.2d 1453, 1458, 18 USPQ2d 1842, 1845 (Fed. Cir. 1991) (\"[Patentee] failed to show that buyers of bi-fold metal doors specifically want a door having the advantages of the Ford patent\"). See also State Indus., 883 F.2d at 1576-80, 12 USPQ2d at 1028-31 (consumer demand went to patented method); Ryco, 857 F.2d at 1427-28, 8 USPQ2d at 1330-31 (patentee owner can meet demand for products covered by patent); Gyromat, 735 F.2d at 552, 222 USPQ at 6 (same).\n\nThe patentee's willingness and ability to supply the patented invention during the period of infringement is the thread that runs through all precedent of this court respecting \"lost profits\" awards. See Kori Corp. v. Wilco Marsh Buggies \u0026 Draglines, Inc., 761 F.2d 649, 653, 225 USPQ 985, 987 (Fed. Cir.), cert. denied, 474 U.S. 902, 88 L. Ed. 2d 229, 106 S. Ct. 230 (1985) (Patentee \"is entitled to be compensated [for its lost profits] on the basis of its ability to exploit the patent \") (emphasis added). While the majority does not specifically overturn any of our precedent, the basic premises expressed therein are eviscerated.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nG. \"Foreseeability\" is not the Test for Patent Damages\n\nThe majority agrees that the types of compensable injury for patent infringement are not unlimited. The majority draws the line against recovery for an inventor's heart attack or for the decrease in the value of stock of a corporate patentee. Its opinion holds:\n\nWe believe that under § 284 of the patent statute, the balance between full compensation, which is the meaning that the Supreme Court [in General Motors ] has attributed to the statute, and the reasonable limits of liability encompassed by general principles of law can best be viewed in terms of reasonable, objective foreseeability. If a particular injury was or should have been reasonably foreseeable by an infringing competitor in the relevant market, broadly defined, that injury is generally compensable. . . . Being responsible for lost sales of a competitive product is surely foreseeable; such losses constitute the full compensation set forth by Congress, as interpreted by the Supreme Court, while staying well within the traditional meaning of proximate cause.\n\nSlip op. at 13 (emphasis added).\n\nIn the majority's view, the consideration of patent rights ends upon a finding of infringement. The separate question of damages under its test does not depend on patent rights but only on foreseeable competitive injury.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e This position cannot be squared with the premise that compensation is due only for injury to patent rights. Thus, the majority's foreseeability standard contains a false premise, namely, that the \"relevant market\" can be \"broadly defined\" to include all competitive truck restraints made by the patentee. The relevant market for determining damages is confined to the market for the invention in which the patentee holds exclusive property rights. Livesay Window, 251 F.2d at 474 (cited with approval in Devex) (\"The market under scrutiny then is confined to those products only which are patented or infringed.\"). To paraphrase Brunswick Corp, 429 U.S. at 489, \"[Plaintiffs] must prove more than injury causally linked to any illegal presence in the market [i.e., the infringing goods]. Plaintiffs must prove [patent infringement] injury, which is to say injury of the type the [patent] laws were intended to prevent.\" The injury, thus, must be to the protected market in goods made in accordance with the patent, not unprotected truck restraints. In sum, patent rights determine not only infringement but also damages.\n\nThe majority does not give a passing nod to long-standing precedent restricting a patentee's legal injury to diversion of sales it would have made of products containing the patented invention, much less does it explain why the precedent should be abandoned. It simply declares ipse dixit : \"Whether a patentee sells its patented invention is not crucial in determining lost profits damages.\" Slip op. at 16. While proximate cause limitations are acknowledged, the majority sees no problem here because the infringing devices were designed to compete with the ADL-100 devices and the \"clear purpose of the patent law [is] to redress competitive damages resulting from infringement of the patent.\" Slip op. at 24. This reasoning awards patent infringement damages as if for a kind of unfair competition with the patentee's business. However, infringement of a patent is not a species of common law unfair competition; it is a distinct and independent federal statutory claim. Mars Inc. v. Kabushiki-Kaisha Nippon Conlux, 24 F.3d 1368, 1373 (Fed. Cir. 1994). Moreover, the clear purpose of the patent system is to stimulate a patentee to put new products into the marketplace during the patent term, not to compensate the patentee \"fully\" while the public benefit from the invention is delayed until the invention falls into the public domain. Compensation in the form of lost profits for injury to the exclusive market in patented goods has provided the incentive to achieve that objective.\n\nReiterating that objective, the Supreme Court stated in Kewanee Oil Co. v. Bicron Corp., 416 U.S. 470, 480, 40 L. Ed. 2d 315, 94 S. Ct. 1879 (1974):\n\nThe productive effort thereby fostered [by the patent laws] will have a positive effect on society through the introduction of new products and processes of manufacturer into the economy, and the emanations by way of increased employment and better lives for our citizens.\n\nIgnoring this objective, this decision expands the property rights afforded by a patent by broadening a patentee's protected market and, as a consequence, provides a disincentive to a patentee's commerce in the patented products.\n\nNothing in the statute supports the majority's \"foreseeability\" rule as the sole basis for patent damages. To the contrary, no-fault liability is imposed on \"innocent\" infringers, those who have no knowledge of the existence of a patent until suit is filed. Damages are recoverable for up to six years of unknowing infringement before suit. 35 U.S.C. § 286 (1988). \"Foreseeability\" is a wholly anomalous concept to interject as the basis for determining legal injury for patent infringement. While unknowing infringers cannot \"foresee\" any injury to the patentee, they are subject to liability for damages, including lost profits, for competition with the patentee's patented goods. Now they will be liable for diverting sales of the patentee's unprotected competitive products as well.\n\nThe \"foreseeability\" standard also cannot be reconciled with the statutory requirement for a patentee to mark its patented goods with the patent number to prevent innocent infringement.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The patent by itself does not give notice that the patentee's goods are protected. Wine Ry. Appliance v. Enterprise Ry. Equip., 297 U.S. 387, 393, 80 L. Ed. 736, 56 S. Ct. 528 (1936). Failure to provide such notice cuts off a patentee's recovery of damages until actual notice of infringement is given even from deliberate infringers who clearly can \"foresee\" legal injury. As stated in Bonito Boats, Inc. v. Thunder Craft Boats, Inc., 489 U.S. 141, 162, 103 L. Ed. 2d 118, 109 S. Ct. 971 (1989) (alterations in original):\n\nThe availability of damages in an infringement action is made contingent upon affixing a notice of patent to the protected article. 35 U.S.C. § 287. The notice requirement is designed \"for the information of the public,\" Wine Railway Appliance Co. v. Enterprise Railway Equipment Co., 297 U.S. 387, 397, 80 L. Ed. 736, 56 S. Ct. 528 (1936), and provides a ready means of discerning the status of the intellectual property embodied in an article of manufacture or design. The public may rely upon the lack of notice in exploiting shapes and designs accessible to all. See Devices for Medicine, Inc. v. Boehl, 822 F.2d 1062, 1066 (CA Fed. 1987) (\"Having sold the product unmarked, [the patentee] could hardly maintain entitlement to damages for its use by a purchaser uninformed that such use would violate [the] patent\").\n\nRite-Hite could not mark its ADL-100 restraints with notice of the '847 patent. Such \"notice\" would constitute false marking under 35 U.S.C. § 292 (1988). To hold that a patentee may recover damages respecting injury to its business in products that do not embody the invention which are unmarked or marked with a different patent number would treat a patentee that does not practice its invention more favorably than a patentee that does. The marking statute generates absurd results when applied to damages tied to products not made under the patent in suit.\n\nThe majority simply has the rule backwards. Heretofore, the first requirement to establish a patentee's entitlement to actual damages in the form of lost profits has been proof that the patentee exercised its market place monopoly for its patented invention. Evidence of a patentee's business losses not due to an infringer's interference with the patentee's marketing of the invention was immaterial in assessing damages. The patent affords no property rights which can be injured outside the market in goods protected by the asserted patent.\n\nThe majority goes on to find the award of damages for lost sales of ADL-100s a foreseeable injury for infringement of the '847 patent. This is a remarkable finding. The facts are that Rite-Hite began marketing its ADL-100 motorized restraint in 1980. Kelley put out its Truk Stop restraint in June 1982. There is no dispute in this case\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e that Kelley \"designed around\" the protection afforded by any patent related to the ADL-100 with which Kelley's Truk Stop restraint was intended to compete. Two years later, the '847 patent in suit issued on the later-developed alternative hook technology used in the MDL-55. Kelley would have to have had prescient vision to foresee that it would be held an infringer of the unknown claims of the subsequently issued '847 patent and that its lawful competition with the ADL-100 would be transformed into a compensable injury.\n\nKelley would also have had to foresee that, for the first time in over 200 years of patent infringement suits, a court would extend protection to a part of a patentee's business which is not dependent on the patentee's use of the patented technology. Moreover, the Supreme Court and all sister circuits which have spoken on the legal scope of damages have, without exception, rejected the majority's expansive view that the only limitations on patent infringement damages are (1) satisfaction of a \"but-for\" test applied to \"foreseeable\" injuries, and (2) the amount must not be too low.\n\nUnder the entire market value rule, if Rite-Hite used the later improvement of the '847 patent in the ADL-100 restraint, it would have been required to prove that demand for those restraints was created by that invention to receive lost profits on the entire device. The majority recognizes the entire market value rule, citing State Indus., 883 F.2d at 1580, 12 USPQ2d at 1031 (recovery of damages based on the value of the entire apparatus containing several features allowed where patented feature is basis for customer demand), but sees no inconsistency in not applying it here. This reasoning is difficult to follow. The majority agrees that if a patented improvement is used in a device of the patentee with which the infringer competes, to recover lost profits on the entire device, the patentee must prove that the patented feature is the basis for consumer demand for the entire product; but if the patentee substitutes other unprotected technology for the patented improvement, then the patentee is entitled to all of its lost profits. Surely this negates the stimulus for a patentee to put out products with the improvement.\n\nThe basic flaw in the majority's ruling is its rejection of the premise that recovery must be tied to profits from the invention itself. Here the patentee would have made no profits from the patented invention by additional sales of the unprotected ADL-100. There is no reason for the entire market value analysis if a patentee is entitled to compensation for \"competitive damages\" to its business generally. The '847 patent discloses and claims particular hook technology for a truck restraint. No part of the invention relates to motors. Indeed, the specification states that an advantage of the invention is that it requires no motor. No doubt the motorized features of the ADL-100 and the Truk-Stop which added to their price, by the same token, contributed to their profitability and salability as well. But because Rite-Hite did not use the '847 invention in the ADL-100 restraint, it escaped having to prove consumer demand for the motorized restraint was attributable to the '847 invention of an improved hook. It simply was awarded lost profits based on unpatented features and features protected by other patents. None of the lost profits on the ADL-100s are the fruit of the '847 invention. It cannot be the law that they are recoverable.\n\nIf damages are awardable based on lost sales of a patentee's business in established products not protected by the patent in suit, the patentee not only has an easier case as a matter of proof, but also would receive greater benefits in the form of lost profits on its established products than if the patentee had made the investment necessary to launch a new product. That lost profits on an established line are likely to be greater than on a new device cannot be gainsaid. See Continental Paper Bag, 210 U.S. at 429. This result is not in accordance with the purpose of the patent statute. Actual damages are meant to compensate a patentee for losing the reward of the marketplace which the patentee's use of the invention would otherwise reap. Without such loss, Congress has mandated compensation in the form of a reasonable royalty.\n\nThe old rule stimulated a patentee's commerce in patented goods. The new rule makes it more profitable to the patentee to protect the status quo. The status quo is not \"progress in the arts.\" Article I, sec. 8. I conclude the majority's rule is a wrong interpretation of the statute, indeed, may exceed the constitutional power to provide inventors with the exclusive right to their discoveries.\n\nH. The ADL-100 Patents\n\nNot only is the majority's basic idea of legal injury unsound based on \"foreseeability\" but also its specific test is equally flawed. For convenience, I have referred to the ADL-100 as \"unprotected,\" meaning not covered by the patent in suit. However, a key factor in the majority's decision awarding damages for lost sales of the ADL-100 is that the \"device\" is \"patented\". The majority does not, nor did the parties, discuss what inventions the one or more patents on the ADL-100 cover. Nevertheless, the majority declares the ADL-100 provides the only alternative technology. While it is inappropriate for an appellate court to make findings, the finding by the majority is erroneous if one examines the record independently. There are other mechanisms for securing trucks to loading docks. Indeed, the Patent Office considered Kelley's Truk-Stop sufficiently different from the prior '847 patent to grant Kelley its own patent. Unfortunately for Kelley, this court earlier upheld the finding that its different structure was sufficient similar to the '847 patent to constitute infringement. 819 F.2d 1120, 2 USPQ2d 1915 (Fed. Cir. 1987). But there were other alternatives which could be substituted. In any event, the one or more patents on technology used in the ADL-100 were never asserted against Kelley, and the validity of those patents is untested. If those patents are invalid, the majority's analysis collapses. As stated in Lear, Inc. v. Adkins, 395 U.S. 653, 668, 23 L. Ed. 2d 610, 89 S. Ct. 1902 (1969):\n\nFederal law requires that all ideas in general circulation be dedicated to the common good unless they are protected by a valid patent. [Emphasis added.]\n\nGiven that Kelley has had no legal basis for bringing a declaratory judgment action challenging the unlitigated patents (never having been charged with their infringement), the majority imposes liability and overlooks the unfairness in its theory. If the unlitigated patents are significant to damages, Kelley deserves an opportunity to defend against them. A clearer denial of due process is rarely seen. The award of damages for competition with Rite-Hite's market for ADL-100s is no more supportable than an injunction against infringement of the ADL-100 patents.\n\nIf nothing else, the patent term limit provision of 35 U.S.C. § 154 is skewed by protecting the profits on goods made under one patent for infringement of another. Under the majority's decision, the 17-year terms of the ADL-100 patents are meaningless. Rite-Hite is entitled to the add-on years provided by the later '847 patent after the terms of the ADL-100 patents expire. Congress has provided the term and the basis for protection of ADL-100 restraints. An award of damages on ADL-100s based on infringement of the '847 patent expands the term of protection as well as the basis for protection. Moreover, the majority would award damages for losses connected to the ADL-100 even if the patents on that device are invalid (albeit under a slight variation of a \"but-for\" test). If Rite-Hite had asserted infringement of the ADL-100 patents, it would receive no lost profits based on invalid ADL-100 patents but, nevertheless, is held entitled to lost profits on ADL-100s based on the '847 patent. This construction of the statute seems patently absurd.\n\nIn short, Rite-Hite has obtained indirectly what it may or may not be entitled to recover directly by suit on the ADL-100 patents. Moreover, this was accomplished without putting the ADL-100 patents at risk to a challenge of invalidity. The unasserted patents provide no basis for sweeping the losses related to the ADL-100 into the scope of legal injury attributed to Kelley's use of the '847 invention.\n\nThe majority rejects what it called Kelley's \"antitrust\" arguments that the award of lost profits on the ADL-100 unduly expanded rights in the '847 patent on the rationale that this case deals only with what injuries are compensable for infringement, not with violation of antitrust laws. This rationale cannot be squared with Ethyl Gasoline v. United States, in which the Supreme Court held:\n\nThe patent monopoly of one invention may no more be enlarged for the exploitation of a monopoly of another, than for the exploitation of an unpatented article, or for the exploitation or promotion of a business not embraced within the patent.\n\n309 U.S. 436, 459 (1940) (citations omitted). See Motion Picture Patents Co. v. Universal Film Mfg. Co., 243 U.S. 502, 511-13, 61 L. Ed. 871, 37 S. Ct. 416 (1917).\n\nNo one argues that Rite-Hite is violating the antitrust laws. However, an award of damages for infringement of one patent based on losses of sales of a product not within the protected market violates antitrust policies. Under those policies, Rite-Hite is not entitled to tribute for infringement of one patent for losses in connection with a competitive product protected, if at all, only by other patents. This court has no license to elevate patent rights in the guise of damages over antitrust policies which preclude enlargement of the exclusive market provided by the '847 patent to promote and exploit the business of a patentee in goods not embraced within the patent.\n\nI.\n\nReasonable Royalty is a Proper Measure of \"Adequate\" Damages\n\nFinally, Rite-Hite argues that the highest possible damages should be imposed to deter infringers and that the district court, therefore, correctly assessed a higher lost profits award in lieu of a reasonable royalty. Rite-Hite also argues that a reasonable royalty creates a compulsory license. Both points are meritless. As indicated, a finding of infringement is not dependent on a finding of negligence or culpable intent by the wrongdoer. An infringement, like a trespass, may be committed unknowingly. In such situations, the amount of damages manifestly can have no effect to deter an unknowing infringer. Basic damages, which are at issue here, fall on the innocent and the culpable to the same extent. See Intel Corp. v. United States Int'l Trade Comm'n, 946 F.2d 821, 832, 20 USPQ2d 1161, 1171 (Fed. Cir. 1991); Thurber Corp. v. Fairchild Motor Corp., 269 F.2d 841, 845, 122 USPQ 305, 308 (5th Cir. 1959); see also Kansas City S. Ry. Co. v. Silica Prods. Co., 48 F.2d 503, 508, 8 USPQ 476, 481 (8th Cir.), cert. denied, 284 U.S. 626, 76 L. Ed. 533, 52 S. Ct. 11 (1931); Thompson v. N.T. Bushnell Co., 96 F. 238, 243 (2d Cir. 1899). Cf. Seymour v. McCormick, 57 U.S. (16 How.) at 488. The provision for trebling damages is the deterrent against deliberate infringement.\n\nThe spectre of a compulsory patent license is raised. However, a damages award calculated as a reasonable royalty gives no mandatory license. If it did, relief by way of an injunction against future use makes no sense.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e A reasonable royalty is simply a measure of damages, not a license. Dowagiac, 235 U.S. at 649; Fromson v. Western Litho Plate \u0026 Supply Co., 853 F.2d 1568, 1574-76 (Fed. Cir. 1988). The remedy Congress itself selected cannot be condemned on the ground it conflicts with Congress' views reflecting compulsory licenses. Obviously, it does not.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e A reasonable royalty is in fact a Congressional largesse for cases where a patentee might otherwise receive only nominal damages. A patentee is now statutorily entitled to a reasonable royalty even though it has not suffered or cannot prove a financial loss to its market in patented goods.\n\nJ. Conclusion\n\nThe majority holds that it has balanced the interests of the patentee and the infringer. I disagree. In Fogerty v. Fantasy, Inc., 127 L. Ed. 2d 455, 114 S. Ct. 1023, 1030 (1994) the Supreme Court stated:\n\nBecause copyright law ultimately serves the purpose of enriching the general public through access to creative works, it is peculiarly important that the boundaries of copyright law be demarcated as clearly as possible. To that end, defendants who seek to advance a variety of meritorious copyright defenses should be encouraged to litigate them to the same extent that plaintiffs are encouraged to litigate meritorious claims of infringement. . . . Thus a successful defense of a copyright infringement action may further the policies of the Copyright Act every bit as much as a successful prosecution of an infringement claim by the holder of a copyright.\n\nThe same policy statement applies equally to patent law enacted under the complementary provision of Article I, section 8 of the Constitution. Challengers who have meritorious defenses to a charge of patent infringement should be encouraged to litigate them without fear of ruinous damage awards. Kelley mounted a substantial and legitimate challenge to the validity and its infringement of the '847 patent in suit. Kelley was held to be wrong on both points, but its infringement was not willful. The district court stated that \"the Kelley people [acted] in the spirit of good competition\" and \"certainly did not intend to infringe.\" 629 F. Supp. 1042, 1045, 231 USPQ 160, 161. The consequence of expansion of legal injury in this case is that the patentee's major competitor, an innocent infringer, has been forced into bankruptcy by the lost profits award on unprotected goods. This result does not further the policies of the patent statute. Patentees are a favored class but this decision goes too far in the scope of protection. It is not the remedy Congress understood and intended to provide.\n\nCommercialization of inventions in the fast changing world of today is at least as viable a purpose of the patent statute as under the prior statutes. For our patent system to fully serve its goal of promoting economic growth, innovations must make it to market during the patent term. The period of exclusivity, a monopoly in the market place, is granted to that end.\n\nThe Senate Report on the legislation that culminated in this court's creation cites the following testimony of Harry F. Manbeck, Jr., then General Patent Counsel for the General Electric Company and later Commissioner of Patents and Trademarks:\n\nPatents, in my judgment, are a stimulus to the innovative process, which includes not only investment in research and development but also a far greater investment in facilities for producing and distributing goods. Certainly, it is important to those who must make these investment decisions that we decrease unnecessary uncertainties in the patent system\n\nThe Federal Courts Improvement Act of 1981, S. Rep. No. 97-275, 97th Cong., 1st Sess., 6 (1981).\n\nThe Senate Report on the 1980 Reexamination statute cites the following testimony of then Commissioner of Patents and Trademarks Sidney Diamond:\n\nIndeed, the patent system was established to provide certain incentives for the conduct of activities critical to our economic and technological prosperity - the invention of new and improved technology, the disclosure of this technology to the public, and the investment in its commercialization.\n\nPatent Reexamination, S. Rep. No. 96-617, 96th Cong., 2d Sess., 9 (1980). These are but two examples emphasizing the present day importance of patents as an incentive for investment in marketing the products for which the exclusive market is given. An exhaustive treatment would occupy a sizeable tome.\n\nIt cannot be disputed that Congress intended that the patent grant provide an incentive to make investments in patented products during the patent term. If a patentee is rewarded with lost profits on its established products, the incentive is dulled if not destroyed. Why make the investment to produce and market a new drug if the patent on the new discovery not only protects the status quo in the market but also provides lost profits for the old?\n\nFor the foregoing reasons, I would hold that an injury to the patentee's marketing of products protected only by other patents--if at all--does not fall within the grant of rights protected by the '847 patent in suit and is not compensable. Thus, I would vacate the award of lost profits on 3,283 sales based on Rite-Hite's loss of business in ADL-100 restraints and remand for damages to be assessed on the basis of a reasonable royalty for those infringements.\n\nIII.\n\nLEVELER SALES\n\nI agree with the majority that under the entire market value rule, Rite-Hite is not entitled to lost profits on dock levelers, sold in conjunction with patented or unpatented restraints. However, I disagree with the majority's reasoning. The entire market value rule is based on a realistic evaluation of the commercial magnetism of the patented invention, not on whether components in a machine--or auxiliary goods--function together. I will not lengthen this already lengthy opinion but merely note that the majority proffers strained interpretations of the cited precedent. I would deny the award because the sales of levelers were not attributable to consumer demand for the invention of the '847 patent.\n\nIV.\n\nCALCULATION OF A REASONABLE ROYALTY\n\nThe district court awarded damages in the form of a reasonable royalty for 502 infringing sales based on lost profits on Rite-Hite's restraints and restraint leveler packages. This \"reasonable royalty,\" which totals $1,045.00 per infringing restraint, is more than the price of Rite-Hite's patented MDL-55, more than 75 percent of the average net sale price of Kelley's Truk-Stop, and 33 times greater than Kelley's net profit on its entire machine. If lost profits on ADL-100's were not recoverable as such, the court said it would have raised the amount of the reasonable royalty to include all of Rite-Hite's anticipated profits on ADL-100 units and packages. Rite-Hite, 774 F. Supp. at 1540 n.22, 21 USPQ2d at 1821 n.22.\n\nIn determining a reasonable royalty, the district court started with basically wrong ideas even if ADL-100s and levelers were protected by the '847 patent. The court erroneously believed Kelley had to pay a reasonable royalty on ADL-100 sales if lost profits were not awarded. Id. This is a fundamental misunderstanding. Rite-Hite is entitled to a reasonable royalty on Kelley's sales of infringing devices. Rite-Hite would be entitled to a reasonable royalty on those sales even if it made no sales of a competing product. Further, where a patentee is not entitled to lost profit damages, lost profits may not, in effect, be awarded by merely labelling the basis of the award a reasonable royalty. See SmithKline Diagnostics, Inc. v. Helena Labs. Corp., 926 F.2d 1161, 1165, 1168, 17 USPQ2d 1922, 1925, 1928 (Fed. Cir. 1991) (rejecting SKD's proposed use of its lost profits figure as a \"reasonable royalty\").\n\nA \"reasonable royalty\" is a hypothetical royalty for the use of the patented technology by the infringer, calculated as if the parties negotiated at arm's length as a willing licensor and a willing licensee on the date when the infringement began. State Indus., 883 F.2d at 1580, 12 USPQ2d at 1031; Hanson v. Alpine Valley Ski Area, Inc., 718 F.2d 1075, 1079, 219 USPQ 679, 682 (Fed. Cir. 1983). While frequently spoken of as willing negotiations, Beatrice Foods Co. v. New England Printing \u0026 Lithographing Co., 923 F.2d 1576, 1580, 17 USPQ2d 1553, 1556 (Fed. Cir. 1991); 5 Donald S. Chisum, Patents, § 20.03[4][b] (1992), the result has more of the character of a forced settlement where neither party gets all it would wish.\n\nThe focus of a reasonable royalty determination is on the value of the invention in the marketplace. As the statute states, a reasonable royalty is an award \"for the use of the invention by the infringer.\" 35 U.S.C. § 284. Rite-Hite's lost profits on ADL-100s and levelers are not factors in calculating that value for the same reasons lost profits are not awardable for the goods. Neither is part of the exclusive market granted by the '847 patent. The '847 patent may not be used \"for the exploitation or promotion of a business not embraced within the patent.\" Ethyl Gasoline, 309 U.S. at 459. A royalty based on unprotected goods unlawfully exploits the patent. I would, therefore, remand with instructions to disregarded injury to this part of Rite-Hite's business in determining a reasonable royalty.\n\nA reasonable royalty requires a balancing of the interests of the parties. It would be proper, therefore, to consider Rite-Hite's policy of not licensing direct competitors like Kelley, but this factor cannot justify the rate here. See Panduit, 575 F.2d at 1164, 197 USPQ at 736. In particular, Rite-Hite's claim that Kelley needed a license of the '847 technology to make any restraint is clearly fallacious. The ADL-100 itself did not use that technology and there were numerous non-infringing mechanical alternatives. That they were not yet commercialized is irrelevant respecting a royalty. Kelley would likely have turned to the other technology to design around the '847 invention if the royalty were too high.\n\nIt is apparent that the district court limited its assessment to Rite-Hite's side of the hypothetical negotiating table rather than to balance the interests of both parties. Kelley presented extensive evidence of royalty rates prevalent in the industry, which is relevant to determining a reasonable royalty. Georgia-Pacific Corp. v. United States Plywood Corp., 318 F. Supp. at 1120, 166 USPQ at 238 (factor 2: \"The rates paid by the licensee for the use of other patents comparable to the patent in suit.\"). This evidence included a 0.9 percent royalty paid by Rite-Hite to Kelley to settle a suit for infringement of Kelley's leveler patents. Although licenses extracted under the penumbra of threatened litigation as to the validity and/or infringement are, as the district court stated, \"not an accurate gauge of a reasonable royalty,\" Rite Hite, 774 F. Supp. at 1535, 21 USPQ2d at 1817, this rule does not apply where, as here, validity and infringement appear to have been settled in the licensor's favor when the license was entered. See Snellman v. Ricoh Co., 862 F.2d 283, 289, 8 USPQ2d 1996, 2001 (Fed. Cir. 1988), cert. denied, 491 U.S. 910, 105 L. Ed. 2d 707, 109 S. Ct. 3199 (1989). The district court also dismissed other testimony favorable to Kelley as being \"of limited relevance, because it is based upon royalties contained in settlement agreements.\" Yet two of these licenses (Abon/MHW and Metz/Serco) were not the product of litigation. Rite-Hite's current CEO (Mike White) took a license under the '847 patent when he bought Rite-Hite from his father. Although the district court found this intra-family deal \"too dissimilar\" from a true hypothetical negotiation, White himself testified that the transaction was arms length and that he paid a fair price for the license.\n\nThe evidence of record negates a finding that the dock equipment industry is so lucrative that net profits in the 50-75 percent range could be anticipated. Rite-Hite's net profits during the period of infringement were in the 6-10 percent range and Kelley's only 2.3 percent. This evidence of actual profitability forcefully negates the anticipation by either party of profits of 50-75 percent on their devices and was improperly disregarded in the district court's determination of what royalty Kelley would have agreed to pay. Lindemann Maschinenfabrik, 895 F.2d at 1408, 13 USPQ2d at 1875 (characterizing as \"absurd\" expert testimony that infringer \"would agree to pay a royalty in excess of what it expected to make in profit\"); Hughes Tool Co. v. Dresser, 816 F.2d 1549, 1558, 2 USPQ2d 1396, 1403-04 (Fed. Cir. 1987); Trans-World Mfg. Corp. v. Al Nyman \u0026 Sons, Inc., 750 F.2d 1552, 1568, 224 USPQ 259, 269 (Fed. Cir. 1984). Although this court has sanctioned royalty awards that exceeded the infringer's actual net profits, we have done so only when there was evidence that the infringer actually anticipated greater net profits. Snellman, 862 F.2d 283, 8 USPQ2d 1996; TWM Mfg. Co. v. Dura Corp., 789 F.2d 895, 229 USPQ 525 (Fed. Cir.), cert. denied, 479 U.S. 852, 93 L. Ed. 2d 117, 107 S. Ct. 183 (1986). Kelley is not guaranteed a profit, of course, but anticipated profit is a factor in hypothetical negotiations. Hanson, 718 F.2d at 1081, 219 USPQ at 684 (\"a reasonable royalty would leave an infringer with reasonable profit\"); Panduit, 575 F.2d at 1164, 197 USPQ at 736 (court should determine \"the customary profit allowed licensees in the electrical duct industry\"); see also Trans-World Mfg. Corp. 750 F.2d at 1568, 224 USPQ at 269. A royalty which on any reasonable projections respecting the innocent infringer's business would be confiscatory violates that balance. It is simply beyond reality to infer that the management for the five hundred employee-owners of Kelley would have negotiated a royalty which, it was evident at the time, would destroy their business and jobs.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAlthough the determination of a fair and reasonable royalty is a difficult judicial chore, seeming often to involve more the talents of a conjurer than those of a Judge, Fromson, 853 F.2d at 1574, 7 USPQ2d at 1612, the finding in this case of a reasonable royalty in the amount of $1,045 per unit on a $1,345.79 item of which the patented '847 technology was merely a replaceable feature should be vacated because of legal error in the factors and evidence considered.\n\nV.\n\nConclusion\n\nThis court was created to bring uniformity to the law; but where uniform precedent exists, it was given no mandate to ignore established law. It was not given a blank legal slate on which to write greatly enlarged property rights for patentees. In view of this court's exclusive jurisdiction, however, the majority has effectively set new precedent for all awards of damages in future patent cases.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe majority justifies its expansion of patent protection with the explanation that the Supreme Court has provided no definitive ruling on the proper scope of damages. I conclude the Supreme Court has repeatedly stressed that actual damages for patent infringement must be based on interference with the patentee's market for its own goods embodying the invention in suit. Thus, I must respectfully Dissent.\n\nNEWMAN, Circuit Judge, with whom Circuit Judge RADER joins, Concurring in part and Dissenting in part.\n\nThe court today takes an important step toward preserving damages as an effective remedy for patent infringement. Patent infringement is a commercial tort, and the remedy should compensate for the actual financial injury that was caused by the tort. Thus I concur in the majority's result with respect to entitlement to damages for lost sales of the ADL-100.\n\nYet the court draws a new bright line, adverse to patentees and the businesses built on patents, declining to make the injured claimants whole. The majority now restricts en banc the patentee's previously existing, already limited right to prove damages for lost sales of collateral items -- the so-called \"convoyed\" sales. Such remedy is now eliminated entirely unless the convoyed item is \"functionally\" inseparable from the patented item. The court thus propounds a legally ambivalent and economically unsound policy, authorizing damages for the lost sales of the ADL-100 but not those dock levelers that were required to be bid and sold as a package with the MDL-55 and the ADL-100.\n\nThe district court, in contrast, took a straightforward approach to the damages determination. The district court awarded compensatory damages for (1) Rite-Hite's lost sales of the MDL-55 and the ADL-100 models of truck restraint, recognizing the commercial and competitive relationships of these models and the infringing device; (2) Rite-Hite's lost sales of 1,692 dock levelers that were bid and sold in packages with the truck restraints, recognizing that the dock leveler business was a significant factor in Kelley's infringing activity; and (3) the sales-level losses incurred by the independent sales organizations (the ISOs), recognizing their position as geographically exclusive selling arms of the patentee.\n\nThe majority affirms only the first of these three areas of pecuniary injury, reversing the district court's damages award in the other two areas. I know of no law or policy served by eliminating recovery of actual damages when patents are involved. In holding that those injured by the infringement shall not be made whole, the value of the patent property is diminished. The majority's half-a-loaf award, wherein the patentee and the other plaintiffs are denied recovery of a significant portion or all of their proven damages, is an important policy decision. Thus, although I join Parts A-I and B of the majority opinion, I must Dissent from Parts A-II and A-III. With respect to Part A-IV, I agree that the district court's determination of the royalty rate should not be disturbed, but I do not share the majority's view as to the royalty base.\n\nI. THE LOST PROFITS FOR THE ADL-100\n\nI agree that lost profits on the lost sales of the MDL-55 and the ADL-100 are the proper measure of compensatory damages for Kelley's infringement of Rite-Hite's '847 patent. The considerations with respect to the ADL-100 are those of general damages: directness, foreseeability, duty.\n\nPatent damages must be viewed with a practical eye in order to implement the policy of damages law. It is not the usual situation that an infringing device takes sales from a patentee's line of more than one product, not all of which were made under the patent that is infringed. However, this does not change the application of 35 U.S.C. § 284. It may be simply differences in inventorship, or the timing of the discoveries, that places inventions in different patents of the same patent owner. Such a situation is not unusual. An example may be the case at bar, wherein Rite-Hite disclosed and claimed the infringed restraint in a later-filed patent having a different inventive entity than the patent on the ADL-100. Examples abound in the chemical field, where inventors may create related chemical compounds, obtain patents as the research progresses, and commercialize one of them. Should the infringer divert sales from another member of this series, according to Kelley, the only damages available would be a royalty at a sufficiently low rate to provide a profit to the infringer. The patent law is not prisoner of such irrational economics.\n\nII. THE LOST CONVOYED SALES OF DOCK LEVELERS $A. Principles of Damages Law\n\nThe basic principle of damages law is that the injured party shall be made whole. On the facts on which the district court awarded damages for certain lost sales of dock levelers, the relationships were direct, causation was proved, the scope of recovery was narrow, and the circumstances were unusual. Reversing the district court, the majority holds that if the patented and convoyed items also have a separate market, there can never be recovery for the lost sales of the convoyed items. I do not believe that such a rule is necessary, or correct, in patent cases.\n\nThe majority adopts the rule for patent cases that lost \"convoyed\" sales can not be recompensed, whatever the directness of the injury and whatever the weight of the proof, unless the thing convoyed is a \"functional\" part of the thing patented. Heretofore, the question of recovery for lost sales of collateral items was a matter of fact and proof, the court looking at the closeness of the relationship between the items and the quality of the proof, cognizant of the policy of setting reasonable limits to liability.\n\nThe district court awarded damages only for those lost dock leveler sales that were bid and sold in a package with the truck restraint, and for which Rite-Hite proved it had competed with Kelley for the same customers, presenting transaction-by-transaction evidence. The district court's finding that Rite-Hite would have sold an additional 1,692 dock levelers, in specifically proven restraint-leveler packages, is not disputed. It is not disputed that there was a direct, causal, foreseeable relationship between Kelley's infringement and these lost sales. This court's decision to withhold compensation for these specifically proven lost sales is a decision of policy, not law, for damages law supports compensation on these proofs. Refusing a remedy for proven injury caused by wrongdoing is an unusual judicial policy. It is not required by patent law, and it contravenes the rule that the injured party shall be made whole. Thus my colleagues carve a patent-based exception into the rule of general damages, refusing to award compensatory damages that have been proved.\n\nThe purpose of tort damages is to place the wronged party, as closely as possible, in the financial position that it would have occupied but for the wrong. The patent statute requires that damages for infringement shall be adequate to compensate for the losses caused by the infringement:\n\n35 U.S.C. § 284. Damages\n\nUpon finding for the claimant the court shall award the claimant damages adequate to compensate for the infringement, but in no event less than a reasonable royalty for the use made of the invention by the infringer, together with interests and costs as fixed by the court.\n\nWhen the damages are not found by a jury, the court shall assess them. In either event the court may increase the damages up to three times the amount found or assessed.\n\nThe statute codifies the general rule of damages resulting from wrongful economic behavior:\n\nAnd where a legal injury is of an economic character, \"the general rule is, that when a wrong has been done, and the law gives a remedy, the compensation shall be equal to the injury. The latter is the standard by which the former is to be measured. The injured party is to be placed, as near as may be, in the situation he would have occupied if the wrong had not been committed.\"\n\nAlbemarle Paper Co. v. Moody, 422 U.S. 405, 418-19, 45 L. Ed. 2d 280, 95 S. Ct. 2362 (1975) (quoting Wicker v. Hoppock, 73 U.S. (6 Wall.) 94, 99, 18 L. Ed. 752 (1867)). This rule is the \"cardinal principle\" of damages law:\n\nThe cardinal principle of damages in Anglo-American law is that of compensation for the injury caused to plaintiff by defendant's breach of duty. . . .\n\n4 Fowler V. Harper et al., The Law of Torts § 25.1, 490, 493 (2d ed. 1986) (quoting Rockwood v. Allen, 7 Mass. 254, 256 (1811) (Sedgwick, J.)) (alteration in the original, footnotes omitted). See also Charles T. McCormick, Handbook on the Law of Damages, § 44 (1985):\n\n[The law] will only seek, as near as may be, by awarding money compensation, to place you in the same position as respects your pocketbook as you would have occupied if no wrong had taken place.\n\nThe threshold condition is embodied in 35 U.S.C § 284 and its requirement that \"the court shall award the claimant damages adequate to compensate.\" The majority correctly applied this rule to Rite-Hite's lost sales of the ADL-100 model of truck restraint, but inappropriately rejected the district court's recognition of the lost sales of the dock levelers.\n\nThe district court recognized that the purpose of the award of damages for patent infringement is to compensate the claimant for the losses incurred. 35 U.S.C. § 284. This is a question of fact, reviewable for clear error. For convoyed sales there are issues of the directness of the injury and associated policy implications, but there is no prohibition in legal principle against recovery of the actual economic loss caused by the infringement. Indeed, this is the most fundamental of damages principles. See William M. Landes and Richard A. Posner, The Economic Structure of Tort Law (1987).\n\nThe Supreme Court has well stated the requirement that losses due to patent infringement shall be fully recompensed:\n\nThe question to be asked in determining damages is \"how much had the Patent Holder and Licensee suffered by the infringement. And that question [is] primarily: had the Infringer not infringed, what would the Patent Holder-Licensee have made?\"\n\nAro Manufacturing Co. v. Convertible Top Replacement Co., 377 U.S. 476, 507, 141 USPQ 681, 694, 12 L. Ed. 2d 457, 84 S. Ct. 1526 (1964) (quoting Livesay Window Co. v. Livesay Industries, Inc., 251 F.2d 469, 471 (5th Cir. 1958)). The Court recognized that damages in patent cases are general damages:\n\nThe present statutory rule is that only \"damages\" may be recovered. These have been defined by this Court as \"compensation for the pecuniary loss he has suffered from the infringement, without regard to the question whether the defendant has gained or lost by his unlawful acts.\" They have been said to constitute \"the difference between his pecuniary condition after the infringement, and what his condition would have been if the infringement had not occurred.\"\n\nAro Manufacturing, 377 U.S. at 507, 141 USPQ at 694 (citations omitted).\n\nThe Federal Circuit heretofore conscientiously recognized that the rules of general damages applied to patent infringement cases. E.g., Lam, Inc. v. Johns-Manville Corp., 718 F.2d 1056, 1064, 219 USPQ 670, 674-75 (Fed. Cir. 1983) (quoting Aro Manufacturing):\n\n[Damages adequate to compensate for the infringement constitute] \"'the difference between [the patent owner's] pecuniary condition after the infringement, and what his condition would have been if the infringement had not occurred.'\"\n\nFromson v. Western Litho Plate \u0026 Supply Co., 853 F.2d 1568, 1574, 7 USPQ2d 1606, 1612 (Fed. Cir. 1988):\n\nThe statute . . . mandates that damages shall be \"adequate to compensate\" the patent owner for the infringement. That requirement parallels the criterion long applicable in other fields of law.\n\nSee also Paper Converting Machine Co. v. Magna-Graphics Corp., 745 F.2d 11, 21, 223 USPQ 591, 598 (Fed. Cir. 1984); Weinar v. Rollform, Inc., 744 F.2d 797, 807, 223 USPQ 369, 375 (Fed. Cir. 1984), cert. denied, 470 U.S. 1084, 85 L. Ed. 2d 143, 105 S. Ct. 1844 (1985); Del Mar Avionics, Inc. v. Quinton Instrument Co., 836 F.2d 1320, 1326, 5 USPQ2d 1255, 1260 (Fed. Cir. 1987); Bio-Rad Labs., Inc. v. Nicolet Instrument Corp., 739 F.2d 604, 616, 222 USPQ 654, 663 (Fed. Cir.), cert. denied, 469 U.S. 1038, 83 L. Ed. 2d 405, 105 S. Ct. 516 (1984); Gyromat Corp. v. Champion Spark Plug Co., 735 F.2d 549, 553, 222 USPQ 4, 7 (Fed. Cir. 1984).\n\nA wrongdoer is, simply put, responsible for the direct, foreseeable consequences of the wrong. Indeed, in General Motors Corp. v. Devex Corp., 461 U.S. 648, 655, 217 USPQ 1185, 1188, 76 L. Ed. 2d 211, 103 S. Ct. 2058 (1983), the Court referred to \"Congress' overriding purpose of affording patent owners complete compensation,\" the Court observing that:\n\nWhen Congress wished to limit an element of recovery in a patent infringement action, it said so explicitly.\n\n461 U.S. at 653, 217 USPQ at 1187. Thus the Court reiterated that limitations to recovery for patent infringement are not to be inferred.\n\nB. The \"Package\" Sales of Dock Levelers and Truck Restraints\n\nThe district court found that Kelley \"developed its Truk Stop restraint both to capture part of the newly-developed restraint market and to avoid losing leveler sales.\" Rite-Hite Corp. v. Kelley Co., 774 F. Supp. 1514, 1522, 21 USPQ2d 1801, 1806 (E.D. Wis. 1991). The district court discussed customers' requests for \"package bids for the simultaneous installation of vehicle restraints and dock levelers, especially for new dock installations.\" Id. at 1530, 21 USPQ2d at 1812. The court found that customers \"almost invariably purchased both items from the same manufacturer.\" Id. The court also referred to testimony that Kelley representatives told some customers that Kelley would void its warranties on its dock levelers if they were used with a Rite-Hite restraint, id., Kelley itself linking sale of the dock levelers to the infringing restraints.\n\nThe district court assessed the damages caused by Kelley's infringement after meticulous review of an extensive body of evidence. The elements of causation and foreseeability, although fully satisfied on the evidence, are scarcely at issue. It is not disputed that these 1,692 dock levelers were sold, warranted, installed, and used together with the truck restraints. Kelley's actual \"package\" sales of dock levelers and infringing restraints were the only convoyed sales for which compensation was awarded.\n\nThese dock leveler sales were as direct a target of the infringement as were the ADL-100 sales, and the quality of the proofs was equally high. The evidence shows the same transaction-by-transaction losses of sales to Kelley for the dock levelers as for the ADL-100 truck restraints, indeed in the same bid and sale packages. Precedent previously recognized that compensation may be appropriate when the items are sold together, whether or not they also have separate markets. See TWM Mfg. Co. v. Dura Corp., 789 F.2d 895, 229 USPQ 525 (Fed. Cir. 1986) (damages awarded for lost sales of unpatented wheels and axles that were sold with patented suspension systems); Deere \u0026 Co. v. International Harvester Co., 710 F.2d 1551, 218 USPQ 481 (Fed. Cir. 1983) (royalty damages assessed based on sales of unpatented combines and patented corn heads).\n\nRecovery of damages for lost \"convoyed\" sales has always required a high standard of proof, lest remote and speculative claims be opportunistically pressed. However, it is not correct to hold that recovery is never possible unless the relationship of the patented and convoyed products is such that the only and necessary use is as a \"single functioning unit.\" Indeed, even the majority's new requirement is met in this case. These specific dock levelers were not sold separately because the customer or Kelley required that they be sold together; and it is undisputed that they are used together.\n\nThe correct question is not whether the infringing truck restraint was part of a larger combination whereby the truck restraint could not function without the dock leveler, or whether the truck restraint or the dock leveler also had an independent market and use. The correct rule was stated in Leesona Corp. v. United States, 220 Ct. Cl. 234, 599 F.2d 958, 974, 202 USPQ 424, 439 (Ct. Cl.), cert. denied, 444 U.S. 991, 62 L. Ed. 2d 420, 100 S. Ct. 522 (1979), that\n\nit is not the physical joinder or separation of the contested items that determines their inclusion in or exclusion from the compensation base, so much as their financial and marketing dependence on the patented item under standard marketing procedures for the goods in question.\n\nThe sales of dock levelers and truck restraints met this criterion.\n\nAs the Court reiterated in Aro Manufacturing and in General Motors v. Devex, general damages in patent cases are whatever damages the plaintiff can prove. The history of the 1946 enactment reports this legislative purpose:\n\nThe object of the bill is to make the basis of recovery in patent infringement suits general damages, that is, any damages the complainant can prove, not less than a reasonable royalty, together with interest from the time the infringement occurred, rather than profits and damages.\n\nReport of the Senate Subcommittee on Patents, S. Rep. No. 1503, 79th Cong., 2d Sess. 1, reprinted in 1946 U.S. Code Cong. Serv. 1386, 1387. The record shows that Kelley foresaw the potential loss of dock leveler sales, and that this contributed to Kelley's infringement of Rite-Hite's truck restraint patent. The record shows Kelley and Rite-Hite both bidding on the same restraint/leveler packages. The evidence established that Rite-Hite's loss of 1,692 dock leveler sales was the direct, foreseeable, and indeed intended result of Kelley's infringement.\n\nKelley bore the risk that if it was found to infringe Rite-Hite's restraint patent, it would be liable for compensatory damages on the restraint/leveler packages. By eliminating recovery for this proven loss, this court makes a policy decision contrary to the principles of compensatory damages. Heretofore Federal Circuit precedent treated lost convoyed sales as a matter of fact and proof. I discern no clear error or discretionary abuse in the district court's award of actual damages for these specific lost sales of restraint/leveler packages.\n\nIII. THE INJURY TO THE ISOs\n\nTwenty-six of the plaintiffs are small businesses or individuals who were directly injured by the infringement. Some of these plaintiffs had previously brought a separate action against Kelley, the district court consolidating these actions. The district court's award of damages to these plaintiffs has not been shown to be clearly erroneous, and I would affirm it.\n\nA. The Position of the ISOs\n\nAdam Smith observed that people work most effectively when they have a personal stake in the fruits of their labor. That is apparently how Rite-Hite structured its business. The ISOs were not \"employees,\" but independent entities. They were responsible for 70% of Rite-Hite's sales. They were not distributors, and most of them were not resellers. They were part of the make/sell activity that was conducted before, not after, the first sale. The issue of their entitlement to the damages that they proved requires objective evaluation, not summary pigeonholing.\n\nIndeed, the ISOs' portion of the injury caused by the infringement is recoverable even on the majority's view of the position of the ISOs in the \"original ISO contract,\" majority op. at 26, which granted the ISOs the right \"to solicit sales in the [exclusive] Territory.\" The majority states that this commercial relationship was unchanged in any substantive way by the new agreement whereby Rite-Hite designated the ISOs as exclusive sales \"licensees.\" It is not necessary to decide the nuances of this contractual relationship, for the losses experienced at the sales level are compensable. If the ISOs were simply sales agents, as Kelley argues, then Rite-Hite is the seller of the goods. If these plaintiffs do not have \"standing,\" as the majority states, because the lost sales were made by Rite-Hite, not the ISOs, then Rite-Hite is entitled to these damages. Thus, if compensation is not owed to the ISOs, it is owed to Rite-Hite.\n\nWitnesses at the damages trial explained that the profits from Rite-Hite's manufacture and sale of truck restraints were calculated at both the manufacturing level and the sales level. Rite-Hite made about 30% of its sales through its own sales organizations, and 70% of its sales through the ISOs, which were assigned geographically exclusive territories. The district court awarded damages in accordance with which plaintiffs bore the losses, at the manufacturing and the sales levels. The majority apparently recognizes the recovery by Rite-Hite for the sales it made through its own selling arms, but not for those obtained by the ISOs.\n\nThe majority may have misunderstood the commercial structure, for it continues the loose reference to Rite-Hite's manufacturing-level price as a \"wholesale\" price, although the lost sales to the customer -- the price at which Kelley and Rite-Hite competed -- was not at this manufacturing level of $1,000-1,500, but in the $2,500-3,000 range for the ADL-100. This price included both the manufacturing-level costs and profit and the sales-level costs and profit. Indeed, the district court drew this distinction, although not for the purpose of excluding recovery of sales-level losses, but for the purpose of distinguishing the profits lost at each level. Analyzing the evidence, the district court limited the recovery at the sales level to one third of that claimed, disallowing claims for individual salesmen's commissions.\n\nThe trial court has substantial discretion in determining damages. In State Industries, Inc. v. Mor-Flo Industries, Inc., 883 F.2d 1573, 12 USPQ2d 1026 (Fed. Cir. 1989), cert. denied, 493 U.S. 1022, 107 L. Ed. 2d 744, 110 S. Ct. 725 (1990), this court recognized that\n\nthe only limit on [the district court's] discretion in selecting a remedy is that it be adequate to compensate for the damages suffered as a result of the infringement.\n\nId. at 1577, 12 USPQ2d at 1029. This deference that the judicial process accords to the trial court's assessment of damages recognizes the fact-dependency of just compensation. In Perkins v. Standard Oil Co., 395 U.S. 642, 23 L. Ed. 2d 599, 89 S. Ct. 1871 (1969), the Court looked at the chain of causation and observed that \"Perkins was no mere innocent bystander; he was the principal victim of the price discrimination.\" Id. at 649-50. So too were the ISOs a principal victim of the infringement, for they and Rite-Hite sold the goods whose sales were lost due to the infringement.\n\nB.\n\nThe ISOs as Sales Agents\n\nThe purpose of legal remedy is the recovery of damages by those injured by the tortious acts of another, provided of course that policy-based criteria are met. See, e.g., Illinois Brick Co. v. Illinois, 431 U.S. 720, 52 L. Ed. 2d 707, 97 S. Ct. 2061 (1977) (indirect purchasers generally do not have antitrust standing because of the risk of double recovery or the difficulty in apportioning damages). The ISOs and Rite-Hite are not subject to similar disabilities. Analogously to the Seventh Circuit's explanation in Nelson v. Monroe Regional Medical Center, 925 F.2d 1555, 1563 (7th Cir.), cert. dismissed, 502 U.S. 903 (1991), that standing in antitrust cases follows the causation requirement of common law torts, standing in patent infringement cases follows the same extensive jurisprudence.\n\nKelley argued at trial, as it does here, that the ISOs can not recover damages because they were not exclusive patent licensees. The district court thoroughly explored the relationships between Rite-Hite and the ISOs. The ISOs were sales agents with certain exclusive rights and exclusive territories, with some exceptions for direct sales by Rite-Hite. Since they are not suing independently of the patentee, there is no relevance to those cases which hold that a non-exclusive licensee can not sue in its own name. When the patentee is joined as a party, as Rite-Hite is here, and the licensee has an exclusive right to make, use, or sell, the licensee has standing to recover for its own injury. In Western Elec. Co. v. Pacent Reproducer Corp., 42 F.2d 116, 119, 5 USPQ 105, 106 (2d Cir.), cert. denied, 282 U.S. 873, 75 L. Ed. 771, 51 S. Ct. 78 (1930), the court explained that a less than fully exclusive licensee must join the patentee in any suit for infringement, while a fully exclusive licensee, like an assignee, can sue in its own name (citing Waterman v. Mackenzie, 138 U.S. 252, 256, 34 L. Ed. 923, 11 S. Ct. 334 (1891)). In this case the patentee is a party to the suit, thus removing the risk of multiple suits, of which Kelley makes much. In Weinar v. Rollform, Inc., 744 F.2d 797, 807, 223 USPQ 369, 374-75 (Fed. Cir. 1984) this court stated that \"two parties sharing the property rights represented by a patent may have their respective property rights protected by injunction and each, when properly joined in a suit, may be entitled to damages.\" In Innis, Speiden \u0026 Co. v. Food Machinery Corp., 2 F.R.D. 261, 265, 53 USPQ 330, 334 (D. Del. 1942) the court explained that when a licensee is granted an exclusive right to some part of the patent grant, in that case the geographically exclusive right to sell the patented product in Florida, the licensee must be permitted to exclude others from trespassing upon his right, lest he \"be in the position of one who has an exclusive easement across Blackacre but could not enjoin trespassers who persisted in impairing his easement.\" Id. at 264 n.2, 53 USPQ at 333 n.2.\n\nThus if the ISOs are viewed as sales agents instead of licensees, either their sales exclusivity suffices to permit them to join with Rite-Hite in this suit, or Rite-Hite as principal can recover on their behalf.\n\nC. General Damages Theory\n\nThe jurisprudence of tort damages illustrates myriad relationships between the wrongdoer and the injured party, from which there have evolved general criteria that apply damages law and policy. Precedent deals with the criteria of directness of the injury, foreseeability, and duty, derived from policy considerations whereby the public interest in remedying wrong is balanced with the public interest in placing reasonable limits on liability. Applying these rules, the ISOs were a direct and foreseeable victim of the infringement. Their recovery is not barred by statute or policy. Their entitlement is a question of fact and proof, applying the law and policy of damages.\n\nMuch of the evidence at trial, of head-to-head competitive bids against Kelley, was presented by the ISOs:\n\nEach of plaintiffs' claim files contains several documents pertaining to a single transaction or series of transactions with a single customer. The files include deposition testimony from a member of a Rite-Hite sales organization regarding a sale that Rite-Hite claims to have lost on account of an infringing Kelley sale.. . . According to plaintiffs' expert witness, accountant Ronald Beckman, every claim file regarding transactions in which plaintiffs seek lost profit damages contains testimony that: (1) prior to the Kelley sale, Rite-Hite salespersons had solicited the Kelley customer for Rite-Hite vehicle restraints, and (2) vehicle restraints from other manufacturers had not been bid or had been ruled out by the customer because of perceived product problems. . . . PDTX-143 specifically itemizes 169 cases in which plaintiffs' salespersons testified that they had initially convinced the customer to purchase a restraint before the customer ultimately purchased from Kelley.\n\nRite-Hite v. Kelley, 774 F. Supp. at 1525-26, 21 USPQ2d at 1809 (emphases added). The evidence was extensive and uncontradicted, that the injury to the ISO plaintiffs was directly and foreseeably caused by the infringement. The legal insulation of a wrongdoer from responsibility for its acts is rare in the law, requiring sound basis in public policy. In \"The New Property,\" 73 Yale L. J. 733 (1964), Professor Reich discusses the evolution of protection of property rights as characteristic of a just society.\n\nThe provision of adequate remedy for patent infringement is fundamental to a viable patent law. The district court's damages rulings are not in clear error, and I would sustain them.\n\n\u003cspan class=\"fn\"\u003e1. Circuit Judge Bryson joined the Federal Circuit on October 7, 1994 , but has not participated in the Disposition of this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Claim 1 of the patent reads: A releasable locking device for securing a parked vehicle to an adjacent relatively stationary upright structure, said device comprising a first means mountable on an exposed surface of the structure, a second means mounted on said first means for substantially vertical movement relative thereto between operative and inoperative modes, the location of said second means when in an inoperative mode being a predetermined distance beneath the location of said second means when in an operative mode and in non-contacting relation with the vehicle, and third means for releasably retaining said second means in an operative mode; said second means including a first section projecting outwardly a predetermined distance from said first means and the exposed surface of the structure, one end of said first section being mounted on said first means for selective independent movement relative thereto along a predetermined substantially vertical path, and a second section extending angularly upwardly from said first section and being spaced outwardly a substantially fixed distance from said first means and the exposed surface of the structure, said second means, when in an operative mode, being adapted to interlockingly engage a portion of the parked vehicle disposed intermediate the second section and said first means; said second means, when in an inoperative mode, being adapted to be in a lowered nonlocking relation with the parked vehicle.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. On February 15, 1989, seven ISOs that had not yet intervened brought a separate action, Block-Dickson, Inc. v. Kelley Co., Case No. 89-C-0190 (E.D. Wis. Feb. 15, 1989), which was consolidated with Rite-Hite's action by stipulation of the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. As succinctly summarized by Keeton et al. : In a philosophical sense, the consequences of an act go forward to eternity, and the causes of an event go back to the dawn of human events, and beyond. But any attempt to impose responsibility upon such a basis would result in infinite liability for all wrongful acts, and would \"set society on edge and fill the courts with endless litigation.\" As a practical matter, legal responsibility must be limited to those causes which are so closely connected with the result and of such significance that the law is justified in imposing liability. Some boundary must be set to liability for the consequences of any act, upon the basis of some social idea of Justice or policy. W. Page Keeton et al., Prosser \u0026 Keeton on the Law of Torts § 41, at 264 (5th ed. 1984) (citation and footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. After an explication of established patent law principles, the partial Dissent of Judge Nies ultimately agrees that there are judicial limitations on damages; the Dissent simply disagrees that the damages sought here fall within those limitations, concluding instead that the damages are too \"remote.\" The Dissent's disagreement thus centers not on whether lines are drawn regarding the compensability of damages, but only on where those lines are to be drawn.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The partial Dissent of Judge Nies appears to confuse exclusion under a patent of a product that comes within the scope of the claims with the determination of damages to redress injury caused by patent infringement once infringement has been found.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The partial Dissent of Judge Nies agrees with Kelley, citing several Supreme Court decisions. However, the Supreme Court has provided no definitive ruling on the proper scope of damages to redress lost sales of diverted products such as those in this case. The Dissent also relies on dicta in older district court cases; however, the issue directly before us is one of first impression in this court. Moreover, the more recent (post-1946) cases cited by the Dissent do not hold that a patentee may receive damages in the form of lost profits only for diverted sales of devices covered by the patent in suit. Rather, the cases relied upon either relate to recovery for lost sales of items sold with devices covered by the patent in suit under the entire market value rule, or they stand for the unremarkable proposition that the patentee must be in the business of selling a device in order to recover damages for alleged lost sales of such a device.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The partial Dissent of Judge Nies makes much of the fact that Rite-Hite could not mark its ADL-100 restraints with notice of the '847 patent, cautioning, \"to hold that a patentee may recover damages respecting injury to its business in products that do not embody the invention which are unmarked or marked with a different patent number would treat a patentee that does not practice its invention more favorably than a patentee that does. The marking statute generates absurd results when applied to damages tied to products not made under the patent in suit.\" We disagree. The marking statute provides that if a product is not marked, no damages shall be recovered by the patentee except on proof that the infringer was notified of the infringement. See 35 U.S.C. § 287(a) (1988). That a patentee cannot recover damages in the absence of actual notice when it has not marked remains the law, but that law does not preclude assessing damages for lost sales of diverted products after actual notice of infringement has been given.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. This issue of royalty base is not to be confused with the relevance of anticipated collateral sales to the determination of a reasonable royalty rate. See Deere \u0026 Co. v. International Harvester Co., 710 F.2d 1551, 1559, 218 USPQ 481, 487 (Fed. Cir. 1983); Trans-World Mfg. Corp. v. Al Nyman \u0026 Sons, Inc., 750 F.2d 1552, 1568, 224 USPQ 259, 269-70 (Fed. Cir. 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In the first and third cases, the assignee may sue in its name alone; in the second case, it may sue jointly with the assignor. Waterman v. Mackenzie, 138 U.S. 252, 255, 34 L. Ed. 923, 11 S. Ct. 334 (1891).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The court found that this industry was an insignificant market for Rite-Hite's products, including its vehicle restraints.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Appellees contend that the issue of the ISOs' standing to recover damages is law of the case because of Kelley's failure to appeal during the liability phase of the trial the district court's order permitting intervention, for which reconsideration was denied in August 1984. We disagree. At the time of intervention, other unfair competition claims were asserted, now abandoned. Further, in the damage phase of the case, now appealed, the district court heard evidence and made detailed findings of fact and Conclusions of law regarding the background of the ISOs, the exclusivity of their licenses, and their entitlement to damages. Rite-Hite Corp. v. Kelley Co., 774 F. Supp. 1514, 1522-25, 1536, 21 USPQ2d 1801, 1806-08, 1818 (E.D. Wis. 1991). In so doing, the court addressed arguments and evidence that were not before it in its summary August 1984 ruling. Id. at 1524, 21 USPQ2d at 1808. The issue presented here, the ISOs' right to recover damages, was not finally resolved by the district court until the damage phase of trial. Indeed, the court expressly stated in the Rite-Hite damage opinion that the ISOs' right to patent damages was at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The hypothetical negotiation is often referred to as a \"willing licensor/ willing licensee\" negotiation. However, this is an inaccurate, and even absurd, characterization when, as here, the patentee does not wish to grant a license. See Hanson v. Alpine Valley Ski Area, Inc., 718 F.2d 1075, 1081, 219 USPQ 679, 684 (The willing licensee/licensor concept is \"employed by the court as a means of arriving at reasonable compensation and its validity does not depend on the actual willingness of the parties to the lawsuit to engage in such negotiations[; t]here is, of course, no actual willingness on either side.\"); TWM Mfg. Co. v. Dura Corp., 789 F.2d 895, 900, 229 USPQ 525, 528 (Fed. Cir.) (\"The willing licensee/licensor approach must be flexibly applied as a 'device in the aid of Justice.'\") (citation omitted), cert. denied, 479 U.S. 852, 93 L. Ed. 2d 117, 107 S. Ct. 183 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The term \"actual damages\" is used to distinguish from an award based on a hypothetical reasonable royalty. In the majority view, this Dissent \"confuses\" the patent right to exclude with the separate determination of actual damages for patent infringement. Contrary to the majority, both determinations depend on injury to patent rights. The patent defines the metes and bounds of legal injury. As the Supreme Court stated in Continental Paper Bag Co. v. Eastern Paper Bag Co., 210 U.S. 405, 430, 52 L. Ed. 1122, 28 S. Ct. 748 (1908): \"From the character of the right of the patentee we may Judge of his remedies.\" The majority and the Dissent do not merely quibble over \"line- drawing\" by reason of \"remoteness\" of an injury but rather fundamentally disagree over the legal scope of the market protected by a patent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Rite-Hite Corp. v. Kelley Co., 774 F. Supp. 1514, 1537, 21 USPQ2d 1801, 1819 (E.D. Wis. 1991): In order to recover lost profits damages, \"a patentee must show a reasonable probability that, but for the infringement, it would have made the sales that were made by the infringer.\" Id.; see also Panduit Corp. v. Stahlin Bros. Fibre Works, 575 F.2d 1152, 197 U.S.P.Q. 726 (6th Cir. 1978). The issue of whether a court should award lost profits damages or a reasonable royalty under § 284 thus turns primarily upon the quality of plaintiffs' proof of lost profits. Neither § 284 nor controlling case law restricts the recovery of lost profits damages any further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The majority also finds support for its decision here in decisions of this court which applied a but-for test to determine liability for lost profits in connection with the patentee's business in goods embodying the patented invention in suit, namely, State Indus., Inc. v. Mor-Flo Indus., Inc., 883 F.2d 1573, 1577, 12 USPQ2d 1026, 1028 (Fed. Cir. 1989), cert. denied, 493 U.S. 1022 (1990); Del Mar Avionics, Inc. v. Quinton Instrument Co., 836 F.2d 1320, 1326, 5 USPQ2d 1255, 1260 (Fed. Cir. 1987); King Instrument Corp. v. Otari Corp., 767 F.2d 853, 863, 226 USPQ 402, 409 (Fed. Cir. 1985), cert. denied, 475 U.S. 1016, 89 L. Ed. 2d 312, 106 S. Ct. 1197 (1986). There was no question in those cases that the injury to a patentee's business in patented goods was compensable. The question was sufficiency of proof that the patentee would have made the sales but for the infringement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 4 of the Clayton Act, 15 U.S.C. § 15 (1988) provides (emphasis added): Any person who shall be injured in his business or property by reason of anything forbidden in the antitrust laws may sue therefore in any district court of the United States in the district in which the defendant resides or is found or has an agent, without respect to the amount in controversy, and shall recover threefold the damages by him sustained, and the cost of suit, including a reasonable attorney's fee.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. RICO's civil action provision, 18 U.S.C. § 1964(c) (1988), reads (emphasis added): Any person injured in his business or property by reason of a violation of section 1962 of this chapter may sue therefore in any appropriate United States district court and shall recover threefold the damages he sustains and the cost of the suit, including a reasonable attorney's fee.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. These principles were stated in the context of a party's standing to sue. However, the Court drew upon principles respecting the limitation of \"proximate cause\" on recoverable damages. See Associated Gen. Contractors, 459 U.S. at 536 (\"It is common ground [respecting damages and standing] that the judicial remedy cannot encompass every conceivable harm that can be traced to alleged wrongdoing.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority construes \"adequate\" as an expansive term. If anything the term \"adequate\" suggests moderation, the standard definition of the term being \"reasonably sufficient,\" Webster's Ninth New Collegiate Dictionary, 56 (9th ed. 1983), or even \"barely sufficient,\" The American Heritage Dictionary 15 (10th ed. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Other types of actual damages, e.g., price erosion on the patentee's patented goods, are not involved here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Georgia-Pacific Corp. v. United States Plywood Corp., 243 F. Supp. 500, 516-46, 146 USPQ 228, 242-54 (S.D.N.Y. 1965), for an extended analysis of statutory remedies in successive patent statutes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See, e.g., Acts of 1790, 1793, and 1870.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Statute of Monopolies remained the only statute on patents in England well into the 19th Century.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Edward C. Walterscheid, The Early Evolution of the United States Patent Law: Antecedents (Part 2), 76 J. Pat. \u0026 Trademark Off. Soc'y, 849, 870-71 (1994). The original period of exclusivity was 14 years. Why that term was provided is unknown. It may have some relationship to the terms of successive apprenticeships. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The current statute provides expressly in 35 U.S.C. § 154 : Every patent shall contain . . . a grant to the patentee . . . of the right to exclude others from making, using, or selling the invention throughout the United States.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Although the Patent Act of 1922, 42 Stat. 392 (1922), contained no specific provision for a reasonable royalty, it was interpreted to allow this form of damages. See Georgia-Pacific Corp. v. United States Plywood, 243 F. Supp. at 519-20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The majority misstates the record and grossly distorts the Panduit test. First, contrary to the majority's statement that \"Kelley does not challenge that Rite-Hite meets the Panduit test,\" slip op. at 11, Kelley's supplemental brief at 11 states: \"If the trial court's decision is good law, then Panduit is not. . . . Affirming Rite-Hite v. Kelley will mean effectively overruling Panduit.\" See also Kelley's opening brief at 14. Second, the Panduit factors were not met. There is no proof anyone bought either the Rite-Hite or Kelley restraints because of the patented hook technology and the ADL-100 itself is an acceptable substitute not within the patent claims, i.e., a noninfringing acceptable substitute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See also Note, Remedies Against Patent Infringement, 72 Harv. L. Rev. 328, 344-45 (1958) (\"If a patentee who sells his invention discovers . . . that an infringer seller has diverted some of his potential sales,\" such a patentee may recover lost profits.); Note, Recovery in Patent Suits, 60 Colum. L. Rev. 840, 846-48 (1960) (\"When a patentee has exploited his grant by manufacturing and selling the patented article rather than licensing others to do so, profits lost by the patentee as a direct result of an infringer's competing sales may be the measure of his damages.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. If the majority would limit the entire market value rule precedent to \"convoyed\" sales, slip op. at 17, note 7, this is clearly unwarranted. See, e.g., Kori, 761 F.2d at 655-56, 225 USPQ at 989 (profits on entire device awarded because patented feature created demand for patentee's entire device). The entire market value rule originated and continues to apply to a damage claim for lost profits on a patentee's device incorporating a patented improvement. Indeed, it may be noted that the Supreme Court has never approved extension of this rule to convoyed sales.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The majority cites no Supreme Court or other precedent for its proposition that \"foreseeability\" alone is the key to legal causation of patent damages and there is none.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. 35 U.S.C. § 287(a): Patentees, and persons making or selling any patented article for or under them, may give notice to the public that the same is patented, either by fixing thereon the word \"patent\" or the abbreviation \"pat.\", together with the number of the patent, or when, from the character of the article, this can not be done, by fixing to it, or to the package wherein one or more of them is contained, a label containing a like notice. In the event of failure so to mark, no damages shall be recovered by the patentee in any action for infringement, except on proof that the infringer was notified of the infringement and continued to infringe thereafter, in which event damages may be recovered only for infringement occurring after such notice. Filing of an action for infringement shall constitute such notice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Rite-Hite, however, is not foreclosed by this litigation from suing Kelley on the ADL-100 patents and asserting collateral estoppel respecting the attribution of its ADL-100 losses to Kelley.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The analysis is confused with the situation where the patentee is a licensing patentee who offers paid-up licenses to all who desire them. See 3 Robinson § 1058 at 331 and cases cited therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Indeed, Congressman Lanham embraced the reasonable royalty provision as the preferred remedy on the facts of this case, stating: Of course, in a case of an innocent infringement, it is to be presumed that the court would assess no more than a reasonable royalty for such time as the patent was infringed by the innocent user. 92 Cong. Rec. 1857 (1946). See also House Hearings at 19-21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Here, the amount of damages for nonwillful infringement awarded or proposed to be awarded as a royalty is so great that it has forced Kelley to file for bankruptcy. Kelley, an employee-owned business, would now likely be out of business had we not granted its motion for stay of execution of the district court's judgment. This case therefore illustrates the mischief and misery that can accompany the over enforcement of patents rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Another case awarding damages on the patentee's unpatented goods is already waiting in the wings.\u003c/span\u003e\n\n",
    "body_length": 185881,
    "citedas": [
      "56 F.3d 1538"
    ],
    "attorneys": "Richard Florsheim, Foley \u0026 Lardner, of Milwaukee, Wisconsin, argued for plaintiffs/cross-appellants. With him on the brief was Jeffrey N. Costakos. Also on the brief was Theodore W. Anderson, Leydig, Voit \u0026 Mayer, of Chicago, Illinois. Keith V. Rockey, Rockey, Rifkin \u0026 Ryther, of Chicago, Illinois, argued for defendant-appellant. With him on the brief was Thomas C. Elliott. Also on the brief were Thomas F. Ging, Thomas S. Malciauskas and Marcos Reilly, Hinshaw \u0026 Culbertson, of Chicago, Illinois. Geoffrey G. Gilbert, John P. Ryan, Jr. and Marc L. Fogelberg, McBride, Baker \u0026 Coles, of Chicago, Illinois, were on the brief for Amicus Curiae, Grain Processing Corporation. David J. Brezner, Richard F. Trecartin, Richard P. Doyle, Jr., and Laura L. Kulhanjian, Flehr, Hohbach, Test, Albritton \u0026 Herbert, of San Francisco, California, were on the brief for Amicus Curiae, Otari Manufacturing Corporation. Stanley L. Amberg, Davis, Hoxie, Faithful \u0026 Hapgood, of New York, New York, and Harrie R. Samaras, Knobbe, Martens, Olson \u0026 Bear, of Newport Beach, California, were on the brief for Amicus Curiae, Stanley L. Amberg and Harrie R. Samaras.",
    "category": [
      "243",
      "252"
    ],
    "judges": "Before Archer, Chief Judge, Rich, Circuit Judge, Smith, Senior Circuit Judge, and Nies, Newman, Mayer, Michel, Plager, Lourie, Clevenger, Rader, and Schall, Circuit Judges.*fn1 Opinion of the court filed by Circuit Judge Lourie, in which Circuit Judges Rich, Michel, Plager, Clevenger, and Schall join; Chief Judge Archer, Senior Circuit Judge Smith, and Circuit Judges Nies and Mayer join as to part Aiii; and Circuit Judges Newman and Rader join as to parts AI and B. Circuit Judge Nies filed an opinion, joined by Chief Judge Archer, Senior Circuit Judge Smith, and Circuit Judge Mayer, Dissenting as to parts AI and Aiv and Concurring in result as to part Aii. Circuit Judge Newman filed an opinion, joined by Circuit Judge Rader, Concurring in part as to part Aiv and Dissenting as to parts Aii and Aiii.",
    "citation_count": 422
  }
}
