{
  "id": "0aFdR2YBTlTomsSB9fy6",
  "document": {
    "title": "People v. Visciotti",
    "full_title": "THE PEOPLE AND v. JOHN LOUIS VISCIOTTI AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1992-03-12T00:00:00.000Z",
    "docket": "No. S004597, Crim. No. 23385",
    "body": "Defendant was convicted by a jury in the Orange County Superior Court of the November 8, 1982, first degree murder (Pen. Code,\n\n§ 189, 187)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e of Timothy Dykstra (count I); attempted murder (§ 664/187) of Michael Wolbert (count II); and robbery (§ 211) of those victims (count III). The jury also found that the murder was committed under the special circumstance of murder in the commission of robbery (§ 190.2, subd. (a)(17)(i)), and that defendant had personally used a firearm in the commission of the offenses (§ 12022.5). The same jury found that the killing of Dykstra was intentional and returned a penalty verdict of death.\n\nAfter denying defendant's automatic application for modification of the penalty (§ 190.4), the Judge imposed a sentence of death for the murder, a consecutive term of nine years with a two-year enhancement for the attempted murder, and a stayed (§ 654) term of one year with an eight- month enhancement for the robbery.\n\nThis appeal is automatic. (§ 1239, subd. (b).)\n\nHaving concluded that no prejudicial error affected the determination of guilt or penalty, we shall affirm the judgment in its entirety.\n\nI\n\nA. The Prosecution Case.\n\nThe evidence, based in major part on the testimony of Michael Wolbert, and on defendant's confessions, established the following.\n\nDefendant and Brian Hefner, both of whom had been employed as burglar alarm salesmen by Global Wholesalers in Garden Grove, and who shared a motel room, were fired by their employer on November 8, 1982. Because their final paychecks were insufficient to cover future rent, they devised a plan to rob fellow employees who were also to be paid on that date. The pair waited in the company parking lot until another group of employees, among whom were Dykstra and Wolbert, returned from their shifts. They invited Dykstra and Wolbert to join them at a party which, they claimed, was to be held at the home of friends in the Anaheim Hills area.\n\nDykstra and Wolbert agreed to go to the party. They did not know defendant and Hefner well, however, and were cautious. They insisted on driving in Wolbert's car. They also removed most of their cash from their wallets and hid it behind the dashboard of their car. After leaving defendant's car at an apartment complex, the four drove to a remote area on Santiago Canyon Road where defendant asked Wolbert to stop so that defendant could relieve himself. It was then between 7 and 9 p.m.\n\nAll four men left the car, Dykstra getting out first to permit defendant to leave. After the other three men left the car, Wolbert saw a gun in defendant's waistband. Wolbert then left the car and when he next looked at defendant saw that defendant and Dykstra were standing face-to-face about two feet apart, with defendant holding the gun pointed at Dykstra. Defendant demanded the victims' wallets. Wolbert told him where the money was hidden. Dykstra and Wolbert then stayed on an embankment, several feet apart, while Hefner searched for the money.\n\nDefendant moved over to stand by Wolbert, who asked defendant to let them go, told him to take the car and the money, and assured him that he would not identify him. When Hefner left the car, defendant moved back toward Dykstra who was sitting down. Defendant then raised the gun in one hand and shot Dykstra from a distance of about three or four feet. The bullet passed through the pericardial sac, grazing Dykstra's heart, and entered his right upper lung, causing death by exsanguination, i.e., blood loss.\n\nAfter defendant shot Dykstra, Wolbert stood up and stepped back. Defendant approached Wolbert, who was backing up, raised the gun in both hands, and shot Wolbert three times. Wolbert was struck first in the torso and fell down. Defendant came closer and from a distance of about three feet shot Wolbert in the left shoulder. As defendant began to walk away Wolbert got up and began to approach defendant. Defendant turned, held the gun close to Wolbert's head and shot him in the left eye, at which point Wolbert fell down again. Wolbert saw defendant pull the hammer of the gun back before each shot.\n\nIn spite of his life-threatening wounds, Wolbert did not lose consciousness. He heard defendant and Hefner get into the car and drive back down the road. He was later able to attract the attention of passersby who summoned aid. He identified his assailants as fellow employees at Global Wholesalers. Dykstra was dead when paramedics arrived. Wolbert was transported to the hospital where he underwent surgery. On the following morning, he identified both defendant and Hefner in a photographic lineup, identifying defendant as the person who had shot him and Dykstra.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nDefendant and Hefner were arrested as they left their motel room about 9 a.m. on the morning after the robbery and murder. The murder weapon, a .22- caliber single action revolver which still held six expended shell cases in the cylinder, was found hidden in a space behind the bathroom sink. Defendant confessed his involvement and, at the request of the investigating\n\nofficers, participated in a videotaped reenactment of those events that had taken place in Santiago Canyon.\n\nAnalysis of a sample of defendant's blood, taken at approximately noon on November 9, 1982, revealed no alcohol, amphetamines, opiates, barbiturates, or phencyclidine (PCP). Cocaine and benzoylecgonine, a metabolite of cocaine, were present, however.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nB. The Defense Case.\n\nDefendant attempted to establish that his actions on November 8, 1982, were the product of, or influenced by, his ingestion of drugs and that he did not intend to kill Timothy Dykstra. At the time of the offenses defendant was 25 years old.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e He testified that he had used drugs since the age of 12, among them marijuana, barbituates, amphetamines, cocaine, PCP, LSD, and heroin. He had first been arrested on a drug-related charge in 1975 when he sold \"speed\" to an undercover agent. In 1981 he was found guilty of vandalism after becoming involved in a fight while drinking. He had been committed to the Youth Authority after three escapes from county juvenile facilities.\n\nIn 1978, he pleaded guilty to a charge of assault with a deadly weapon, and was sentenced to state prison. On the night of the stabbing incident that led to that conviction he had used marijuana and PCP. That incident occurred in the same motel at which he was living when arrested on November 9, 1982. It was, he testified, a hangout for drug addicts and prostitutes.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nBrian Hefner had owned both a .22-caliber rifle and the revolver, but defendant persuaded him to pawn the rifle to obtain money with which to buy cocaine. Hefner refused to pawn the revolver, but defendant was not aware that Hefner had the revolver with him on November 8, 1982, when the\n\npair decided to find someone to rob. They had abandoned a plan to obtain money by selling sugar as cocaine, and Hefner had suggested that they find someone to go with them to buy cocaine, take the victims' money under that pretense, and \"just split.\" They invited Dykstra and Wolbert to a party at which there would be girls and cocaine, but were unsuccessful in an attempt to get Dykstra and Wolbert to provide money with which to buy cocaine. Defendant and Hefner then decided to simply take them somewhere and take their money. Defendant alone decided where to take the victims and gave Wolbert directions to Santiago Canyon, which was an area to which he had been when committed to a county boys ranch.\n\nHefner's car was left at an apartment complex in the hope that Dykstra and Wolbert would believe that defendant and Hefner lived in that complex. They went to Santiago Canyon so that defendant and Hefner would have time to get away before their victims made it back to town to look for them at the apartment complex. Defendant's intent was only to take the victims' money, not to kill them.\n\nWhen Hefner told defendant at the Global Wholesalers warehouse that he had brought the gun to protect himself in case anything went wrong, defendant told him to leave it. Hefner put the gun behind the heater in his car. Defendant did not know that Hefner brought the gun with him when the pair transferred to Wolbert's Camaro for the drive to Santiago Canyon.\n\nDefendant testified that he did have to relieve himself when he asked that the car stop. He had planned to take Dykstra and Wolbert farther back in the canyon so that it would take them a long time to come back out. When the car stopped, Hefner got out behind defendant, handed the gun to him, and said, \"let's take their money now.\" Defendant took the gun, held it on the victims, but, he claimed, it was Hefner who demanded their money. After Hefner had gathered up the money, defendant began to back up to get into the car to leave. The victims had not resisted. Wolbert told him to go ahead and take the car, just leave.\n\nAt that point, however, Hefner said: \"Don't let them go because they'll tell,\" and yelled at defendant to shoot them. Defendant testified that he did not know what happened then except that he started shooting. He shot until the gun was empty. He had not loaded the gun and did not know how many shells were in it. He did not know whether he used one hand or two. He had no idea where he was firing the gun. He did not intend to shoot anyone through the heart or in the side, and was not aiming there. Dykstra had not made any threatening move prior to being shot, but Wolbert stood up and came running toward him. Defendant did not know at that point that Wolbert\n\nhad been hit by the prior shots. Earlier Wolbert had shown defendant a \"weapon\"--a glove with metal lining--that Wolbert said he carried in case there was \"trouble.\" Defendant did not know he shot Wolbert in the face, but admitted that he had pulled the trigger and was pointing the gun at Wolbert.\n\nAt the time of these events defendant was \"a little bit loaded.\" Prior to the incident he had injected himself with cocaine,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e as he had been doing on a daily basis. He had not worked on November 8 because he was \"loaded.\" Because he had been injecting cocaine he had been up for two days before that. The cocaine made him more \"wired\" and \"spaced out.\" On his return to the motel after the robbery/murder, in which he and Hefner had obtained about $70, he paid the rent and bought a quarter-gram of cocaine from a friend who lived nearby. He and Hefner used that cocaine at the friend's house, and during the evening purchased two more quarter-grams.\n\nDefendant insisted that although the robbery was planned he had not planned to kill anyone, had not thought it over, and had not considered the consequences of what might happen if he did kill someone.\n\nDefendant presented expert testimony of a forensic psychologist, Dr. Louis Broussard, that defendant had minimal brain injury of a type associated with impulse disorders and specific learning disorders. The learning disorder had caused achievement problems in school, problems that had not been remediated, and as a result his academic achievement was less than it might otherwise have been. Based on the expert's examination and testing of defendant, his review of defendant's confessions and the videotaped reenactment, interviews with family members, and the laboratory tests of defendant's blood, Dr. Broussard believed that defendant was not completely aware of what he was doing during the robbery/murder and could not Judge the nature and consequences of his acts at that time.\n\nDr. Broussard also described the effects of prolonged use of cocaine, which resulted in some users becoming \"ambulatory psychotics,\" having persecutory delusions similar to those of a person getting over acute schizophrenia, and experiencing hallucinations. Dr. Broussard had concluded that defendant was in a drug-induced psychotic state at the time of the events, could not and did not premeditate and deliberate, and was not in control of his senses when he agreed after his arrest to the police interview without counsel. Dr. Broussard also believed that when defendant responded to Hefner's command to shoot, he was behaving like a sleepwalker or person under hypnosis. His behavior was chaotic and drug controlled.\n\nC. Penalty Phase.\n\n1. Aggravating Evidence.\n\nThe only evidence presented by the People in the initial phase of the penalty trial was the testimony of William Scofield, the victim of the June 15, 1978, assault with a deadly weapon offense to which defendant had pleaded guilty and for which he had served a prison term. Scofield testified that five or six men, including defendant, broke into the hotel room he was sharing with his friend Kathy Cusack. The other men beat him with sticks and baseball bats, dragged him out of the room, and attempted to throw him from the balcony. Defendant came out of the room and stabbed Scofield in the lower back. The wound required stitches. The events occurred on the day after Scofield had an argument and fight with another tenant who, allegedly, had lost a cat belonging to Cusack. Other persons present during that exchange were armed with knives, but no one was stabbed then.\n\nThe People sought to present the testimony of Cusack that during the June 15 incident defendant had also stabbed her. Defendant's objection that the pretrial notice of aggravating factors given by the prosecution, which referred only to the assault on Scofield, was not broad enough to give notice that evidence of the assault on Cusack would be offered was sustained and she did not testify at this stage of the penalty trial. (See § 190.3.) The court rejected the People's arguments that the assault on Cusack was so closely related to the assault on Scofield that it was among the circumstances of the latter, and that because defendant had been charged with both assaults notice that evidence of one would be offered was adequate.\n\nCusack was permitted to testify in rebuttal to the mitigating evidence presented by defendant. She first met defendant on June 12, 1978, at a party in defendant's apartment. She had not seen him again until the early morning hours of June 15 when he and several other men broke into the apartment she shared with Scofield. Defendant had a knife. When the other men, who were beating Scofield with bats and sticks, dragged Scofield out of the room, defendant remained in the room where Cusack was standing on the bed. He stabbed her through the right forearm, which she had raised to protect herself, stabbed her farther up that arm, and when she fell down onto the bed, slashed her leg. He then stabbed her in the ankle. When defendant attempted to stab Cusack in the abdomen she told him she was pregnant.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e He nonetheless tried again to stab her in the abdomen, but she rolled over and he stabbed her in the side. He then stabbed her in the chest, slashed her shoulder, stabbed her in the area of her breast. After stabbing Cusack eight or\n\nmore times, defendant began to carve up the walls of the apartment, and to cut up the posters and pictures. When Cusack hit him over the head with a stick, defendant ran out of the apartment. She, too, had to be hospitalized for treatment of her wounds.\n\n2. Mitigating Evidence.\n\nDefendant was one of nine children. His sisters Lisa, then 15 years old, Rose, 20, Antoinette, 31, and Ida, 33, his brother Louis, 24, and his parents all testified regarding defendant's love and concern for family, his willingness to assist and counsel his siblings, his musical and artistic talent, and the change in his personality when under the influence of drugs. All agreed that drugs were defendant's biggest problem, and testified that he was violent only when under the influence of drugs.\n\nDefendant's father became aware of the drug problem several years before the trial. On the first occasion that defendant came home \"loaded,\" his father \"punched him clear across the room.\" Thereafter his father tried to bribe him and to find employment for him, in an effort to get him off drugs. Defendant had never been violent toward anyone in the family, and when not under the influence of drugs was \"one of the nicest kids you can ever meet.\" He attended all family gatherings, ran errands and did favors for his parents, and never refused their requests. The violent acts about which testimony had been offered were uncharacteristic of defendant.\n\nChristine, defendant's girlfriend for two and one-half years, described his manner with her children as \"fantastic,\" testified that he was very helpful both with household tasks and with car repairs, and characterized defendant as a very loving, caring, gentle, and considerate person who treated her and her children with respect.\n\nII\n\nCOMPETENCY\n\nRelying on People v. Hale (1988) 44 Cal. 3d 531 [244 Cal. Rptr. 114 [749 P.2d 769], and People v. Marks (1988) 45 Cal. 3d 1335 [248 Cal. Rptr. 874, 756 P.2d 260], defendant argues that the trial court lacked jurisdiction to proceed to trial because the Judge had expressed a doubt as to defendant's competency and had initiated proceedings under section 1368 to determine competency, which proceedings were never held.\n\nWe disagree with the initial premise that the court expressed doubt as to defendant's competence and had ordered that proceedings be conducted pursuant to section 1368.\n\nDefendant relies solely on the court's response to his motion for the appointment of experts \"under [Evidence Code section] 730 with respect to an examination of Mr. Visciotti on the criteria of 1026 and 1368.\" The court granted the motion, orally stating only that the experts would \"be requested to conduct the examination based on 1026 and 1368.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The May 2, 1983, form order of appointment signed by Judge Franks in department 38 recited, however: \"It Appearing to This Court that defendant's status may fall within the definition set forth in the appropriate statute indicated below\" and had check marks on the four lines adjacent to the statutory bases for appointment, sections 1026 and 1368, and Evidence Code sections 730 and 1017. The order set a hearing date of June 20, 1983, in department 38, and ordered the reports of the experts delivered to that department.\n\nCounsel for defendant did not appear on June 20 and no hearing was held. The prosecutor represented that defendant's attorney had advised him a week earlier of a conflicting commitment, and that the two had never agreed on what was to be heard on the day set for the hearing. The case was put over to June 23, at which time it was called in before another Judge in a different department. Competence was never mentioned during defendant's June 23 appearance or in any subsequent proceeding, and no psychiatric reports by the appointed experts are in the record.\n\nThis record does not suggest that the Judge intended to express a doubt as to defendant's competence, or that he intended to initiate proceedings to determine competence. Section 1368 provides that if a doubt as to a defendant's competence arises in the mind of the Judge, the Judge \"shall state that doubt in the record and inquire of the attorney for the defendant whether, in the opinion of the attorney, the defendant is mentally competent.\" If the attorney then informs the court that he or she believes the defendant is or may be incompetent to stand trial, the court is required to order a hearing to determine the question.\n\nIt is apparent from this record that counsel's request for appointment of experts for the dual purpose of assisting counsel in making a decision on\n\nwhether to enter a plea of not guilty by reason of insanity and to render an opinion on defendant's competence was preliminary to consideration by counsel, let alone the Judge, of whether either had a doubt as to defendant's competence. Neither counsel nor the Judge expressed a doubt as to defendant's competence and the Judge did not order section 1368 proceedings. The typed recital in the form order to the effect that the defendant \"may fall within the definition set forth in the appropriate statute indicated above\" reflects nothing more than an explanation or justification for the appointment of the experts.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e It is not the statement contemplated by section 1368 that the court presently has a doubt as to the defendant's competency.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e (Cf. People v. Westbrook (1964) 62 Cal. 2d 197, 203 [41 Cal. Rptr. 809, 397 P.2d 545] [criminal proceedings suspended and cause transferred to \"psychiatric department,\" an order that could only be explained by the court having a doubt as to the defendant's sanity].)\n\nIn Hale, by contrast, the court expressed a doubt as to the defendant's competence based on the defendant's conduct and demeanor in the courtroom, inquired of counsel, who agreed that in his opinion the defendant was not competent, and ordered a hearing \" 'on the question of the defendant's present mental competency.' \" (People v. Hale, supra, 44 Cal. 3d 531, 535-536.) Similarly, in People v. Marks, supra, 45 Cal. 3d 1335, the trial court had stated a doubt as to the defendant's mental competence and had ordered \" 'the question of his mental competence to be determined in a special hearing which will be held pursuant to Sections 1368.1 and 1369 of the Penal Code.' \" (Id., at p. 1338, italics omitted.)\n\nIII\n\nJURY SELECTION ISSUES\n\nDefendant claims that the jury selection process denied him his rights under the Sixth and Fourteenth Amendments to the United States Constitution, and article I, section 16 of the California Constitution, to a randomly selected, representative jury; that the use of case specific hypothetical voir dire questions to \"indoctrinate\" potential jurors was prejudicial misconduct that resulted in a biased jury; that Witherspoon- Witt error (Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88 S.Ct. 1770]; Wainwright v. Witt (1985) 469 U.S. 412 [83 L.Ed.2d 841, 105 S.Ct. 844]) occurred when\n\nprospective juror Rokes was excused; that three jurors who admitted bias in favor of the death penalty were improperly allowed to remain on the venire panel; and that the trial court erroneously permitted jury selection proceedings to be conducted in his absence. We address each claim in turn.\n\nA. Representative Jury--Random Selection.\n\nAppellant contends first that the procedure by which the Judge, with the acquiescence of counsel, filled the jury box to initiate the general voir dire following the sequestered Hovey death- qualification voir dire (see Hovey v. Superior Court (1980) 28 Cal. 3d 1, 80-81 [168 Cal. Rptr. 128, 616 P.2d 1301]) denied him a randomly selected jury. Random selection, he contends, is mandated by statute and constitutional command, and may not be waived by counsel.\n\nDefendant analogizes jury selection to the status of jury trial itself prior to the 1928 amendment of the California Constitution which for the first time permitted waiver of the right to jury trial. Even under the present article I, section 16, trial by jury in criminal cases is not simply a right of the defendant. It may not be waived unless both the People and the defendant agree.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Because random selection, too, is not simply a right of the defendant but is a state-mandated procedure, it may not be waived.\n\nThis court rejected a similar argument in People v. Johnson (1894) 104 Cal. 418, 419 [38 P. 91], where we held that a claim of error based on an irregularity in the seating of jurors who had been selected from those regularly drawn had been waived by the defendant's failure to object. Here, too, counsel acquiesced in the procedure of which defendant now complains. Since our decision in Johnson, however, the Legislature has made it clear that random selection is a firm policy of the State of California.\n\nSection 1046 directs that juries be formed for criminal trials \"in the same manner as trial juries in civil actions.\" Code of Civil Procedure section 197 provided at the time of this trial: \"It is the policy of the State of California that all persons selected for jury service shall be selected at random from a fair cross section of the population of the area served by the court, and that all qualified persons have the opportunity, in accordance with this chapter to be considered for jury service in the state and an obligation to serve as jurors when summoned for that purpose. This chapter applies to all trial juries in all civil and criminal proceedings in all courts.\"\n\nCode of Civil Procedure section 191 now states the policy: \"The Legislature recognizes that trial by jury is a cherished constitutional right, and that jury service is an obligation of citizenship.\n\n\"It is the policy of the State of California that all persons selected for jury service shall be selected at random from the population of the area served by the court; that all qualified persons have an equal opportunity, in accordance with this chapter, to be considered for jury service in the state and an obligation to serve as jurors when summoned for that purpose. ...\"\n\nPeople v. Johnson, supra, 104 Cal. 418, was decided prior to the enactment of Code of Civil Procedure sections 191 and 197. We have not had occasion since the enactment of those sections to consider whether the establishment of random selection as a policy of the state affects the rule applied in Johnson. We conclude that it does not. While the parties are not free to waive, and the court is not free to forego, compliance with the statutory procedures which are designed to further the policy of random selection, equally important policies mandate that criminal convictions not be overturned on the basis of irregularities in jury selection to which the defendant did not object or in which he has acquiesced. (Cal. Const., art. VI, § 13; People v. Edwards (1991) 54 Cal. 3d 787, 813 [1 Cal. Rptr. 2d 696, 819 P.2d 436].) The failure to object will therefore continue to constitute a waiver of a claim of error on appeal.\n\nBecause we had not reaffirmed the Johnson rule (supra, 104 Cal. 418) at the time of defendant's trial, however, and the standard by which reversible error is to be determined presents an important question, we will address defendant's claim.\n\nNotwithstanding the policy of random selection and equal opportunity for jury service by all qualified persons, not every departure from the statutory procedures constitutes reversible error. The Legislature also provided in former section 1059 that a challenge to the panel could be founded only on a material departure from those procedures. (See People v. Wright (1990) 52 Cal. 3d 367, 394, 395 [276 Cal. Rptr. 731, 802 P.2d 221].) Clearly, therefore, the Legislature did not intend that minor deviations from the statutory procedure be grounds for reversal of a judgment of conviction. It follows that a defendant may not claim error on appeal if the procedure utilized in jury selection did not depart materially from the statutory procedures established to further the purpose of random selection.\n\nThe method by which prospective jurors were seated for the purpose of general voir dire in this case was not a material departure from the\n\nprocedures established by statute. The nonstatutory procedure to which defendant now objects was used only to select (from the prospective jurors who remained on the venire after death qualification) the first 12 persons to be seated for general voir dire. Instead of directing the courtroom clerk to draw the names of 12 venirepersons at random,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e the court sought a stipulation that defendant waive his right to random selection of the initial group of jurors. Instead, each attorney was to submit a list of 20 prospective jurors from which the court would select the first 12 to be seated, matching any who appeared on both lists.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nCounsel were assured that they would be permitted to excuse even persons they had nominated in this fashion, that neither would know if all or any of the initial 12 persons were on both lists, and that diligent voir dire would be permitted as in any other case.\n\nBefore the procedure was undertaken, defendant was advised by the court that he, like every other defendant, had a right to random, secret, impartial seating of all prospective jurors. The Judge then said: \"The inquiry the court\n\nwill make is as follows: Does the defendant waive his right and agree that the court may chose the first 12 jurors to be seated, thereafter returning to the usual selection process?\" At that point, defendant responded, \"Yes.\"\n\nCounsel for defendant stated that he had advised defendant that he and the prosecutor had each selected 20 jurors from whom the court would make the selection. He stated that defendant had agreed to waive the rights described by the court and to permit selection in that manner. The People also indicated agreement. The court then advised counsel that their lists had \"minimally matched up\" and that it was probable that there would be some among the first 12 jurors who had been on both lists. The court did not indicate what, if any, criteria were to be applied in the choice of prospective jurors to fill the remaining seats.\n\nThe court's explanation of the process to be used, the waiver elicited from defendant, and defense counsel's representation of his explanation to defendant reflect seemingly divergent views of the process to be utilized. The court did not promise that the first 12 jurors would all be selected from the lists submitted by counsel. The waiver simply permitted the court to choose the first 12 jurors to be seated. When defendant's attorney said that he had told defendant that the jurors would be selected from the lists, the court said nothing to indicate a contrary intent. In fact, four were taken from the prosecution list, three from the defense list, and five were on neither list. Two of the prospective jurors had been included on both lists. Five of the jurors ultimately sworn to try the case had been chosen by the Judge pursuant to this stipulation. Of those, two had not been on either list.\n\nThe superior court minutes reflect still another interpretation of the stipulation. The minutes recite: \"Counsel stipulate the Court may select twelve prospective jurors at random from lists of twenty prospective jurors submitted by each side.\"\n\nNotwithstanding defendant's present claim that he did not understand the procedure, he is not entitled to relief on appeal on grounds that the statutory jury selection procedures were not followed. We are not faced here with a complete abandonment of random selection. When the general voir dire commenced, the venires of prospective jurors had already been examined in the sequestered Hovey voir dire. There is no suggestion that these venires had not been selected at random, pursuant to Code of Civil Procedure section 222. The prospective jurors in them had been seated for the initial voir dire in accordance with that random draw. The procedure here differs, therefore, from that at issue in People v. Wright, supra, 52 Cal. 3d 367, 393-395, in which the initial seating for voir dire was not conducted in conformity with former section 222 of the Code of Civil Procedure.\n\nIn this case we are not concerned with the initial voir dire, or with a challenge to the panel. Only the general voir dire following the sequestered Hovey voir dire is in question. We agree with the assumption implicit in defendant's argument that, in the absence of a statutory provision adapting the procedures for selection of capital jurors to the mandate of Hovey (supra, 28 Cal. 3d 1), trial courts should follow the procedures established by Code of Civil Procedure section 222 to select prospective jurors for a general voir dire which follows a sequestered Hovey voir dire. Because the stipulation applied only to the first 12 prospective jurors to be seated and the statutory procedure was followed in the initial selection of the prospective jurors and was followed thereafter, we do not deem the procedure to be a material departure from that mandated by the Legislature.\n\nDefendant attempts to distinguish the procedure utilized in this case from that in People v. Wright, supra, 52 Cal. 3d 367, on grounds that having presided over the sequestered voir dire the trial Judge was aware of the biases of the jurors he selected. That distinction is insufficient to compel reversal since defendant acquiesced in this aspect of the selection process. Regardless of any possible misunderstanding as to the manner in which the trial court would select the first 12 jurors, it was apparent that the selection would be made from jurors whose views about capital punishment had been explored during the sequestered voir dire.\n\nDefendant also argues that random selection is necessary to ensure the constitutional right to a jury drawn from a representative cross- section of the populace. To the extent that he claims the procedures utilized in selecting the jury before which he was tried denied him due process or rights under the Sixth Amendment of the federal Constitution and article I, section 16 of the California Constitution, the claim fails for similar reasons. Random selection does serve to ensure the jury trial rights granted by the Sixth Amendment and article I, section 16 of the California Constitution. Not every departure from the state statutory procedure, even if deemed material, necessarily denies a defendant the constitutional right to a jury selected from a representative cross-section of the populace, however. We reject defendant's claim that actual harm need not be shown. To warrant reversal of a judgment of conviction, the defendant must demonstrate that the departure affected his ability to select a jury drawn from a representative cross-section of the population.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nDefendant posits scenarios in which designation of acceptable jurors by the parties, or selection by the court, could result in exclusion by\n\nomission of categories of jurors in violation of People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748], or in a jury not drawn from a true cross-section of the population (see Duren v. Missouri (1979) 439 U.S. 357 [58 L.Ed.2d 579, 99 S.Ct. 664]). He fails, however, to establish that the stipulation to seat the first 12 jurors for general voir dire, from prospective jurors already randomly selected for the sequestered voir dire, could or did have such an impact. To the contrary, the record confirms that during the general voir dire, 19 prospective jurors were randomly selected to replace those excused for cause or peremptorily challenged. Seven of the jurors seated to try the case were selected during this random draw. Five had been among the first twelve seated. This case differs markedly, therefore, from the jury selection process condemned in United States v. Kennedy (5th Cir. 1977) 548 F.2d 608, (hereafter Kennedy) on which defendant relies for his claim that relief is available without regard to a showing of actual harm.\n\nFar from supporting this proposition, Kennedy concludes that the federal statutory right may be waived by failure to challenge the jury, and that more than simply a departure from random selection for the seating of some jurors is necessary to establish a violation of the constitutional right to a jury drawn from a representative cross-section of the community. (Kennedy, supra, 548 F.2d 608.) The issue in Kennedy was whether use of three volunteer jurors, who had just completed a term of jury service, to sit on a criminal jury constituted a substantial failure to comply with the random selection procedures of the Jury Selection and Service Act of 1968. (28 U.S.C. § 1861-1869.) The Fifth Circuit Court of Appeals held that while there had been a substantial failure to comply with the act, the appellant was foreclosed from asserting the statutory violation by failure to challenge the jury on that ground, and that reversal on constitutional grounds was not warranted because the departure from statutory random selection procedures had not denied him the right to a jury drawn from a representative cross-section of the community.\n\nThe jurors in question had been randomly selected for the master jury list prepared for use at trials during the prior month. The court rejected that consideration as a basis for finding compliance with the statute, stating: \"Nonrandom selection of a subgroup from a randomly selected group does not make for a randomly selected subgroup.\" (Kennedy, supra, 548 F.2d at p. 612.) Nonetheless, the defendant's \"forfeiture of the statutory claim in no way affects the sanctity of a defendant's due process right to be tried by a jury drawn from a fair cross-section of the community. While a properly\n\npreserved claim of substantial noncompliance with the Act would of course require reversal if meritorious, the fundamental Justice of a conviction remains intact if the jury selection procedure did not transgress that due process guarantee.\" (Id., at pp. 613-614.)\n\n\"The due process clause does not itself guarantee a defendant a randomly selected jury, but simply a jury drawn from a fair cross section of the community. A claim of denial of this due process right requires a showing that the jury selection process tended to exclude or underrepresent some discernible class of persons and consequently to defeat a fair possibility for obtaining a truly representative cross section.\" (Kennedy, supra, 548 F.2d at p. 614.)\n\nUnited States v. Northside Rlty. Assoc. (N.D.Ga. 1981) 510 F.Supp. 668 (hereafter Northside Rlty. Assoc.) offers no more support.\n\nAs defendant observes, insofar as it applies to petit juries the federal Jury Selection and Service Act of 1968 reflects a policy similar, if not identical, to the policy of this state, providing: \"It is the policy of the United States that all litigants in Federal courts entitled to trial by jury shall have the right to grand and petit juries selected at random from a fair cross section of the community in the district or division wherein the court convenes. It is further the policy of the United States that all citizens shall have the opportunity to be considered for service on grand and petit juries in the district courts of the United States, and shall have an obligation to serve as jurors when summoned for that purpose.\" (28 U.S.C. § 1861.)\n\nIn Northside Rlty. Assoc., supra, 510 F.Supp. 668, the dispositive issue involved substantial noncompliance with the act in a manner not unlike that in the case before this court. In selecting prospective jurors for assignment to divisions within the district from master jury wheels of qualified prospective jurors by use of a newly developed computerized selection procedure, the clerk failed to designate by random process the \"starting number\" by which the computerized sequence of selection from the wheel was to commence. Instead the jury clerk picked the starting numbers with the result that six of more than five hundred numbers accounted for 32 percent of the choices.\n\nThe court dismissed indictments handed down by a grand jury in which the members had been selected in a process initiated in that manner, after finding that the deviation from the act was substantial, and was not an infrequent or inadvertent departure. In so doing the district court accepted the reasoning of the Fifth Circuit in Kennedy, supra, 548 F.2d 608, that a showing of prejudice was not necessary to establish a substantial failure to comply with the act. (510 F.Supp. at pp. 692-693.)\n\nUnlike Kennedy (supra, 548 F.2d 608) and the instant case, however, the defendants in Northside Rlty. Assoc., supra, 510 F.Supp. 668, made a timely and procedurally proper challenge to the indictment, a challenge based on the departure from the statutory mandate of random selection. Thus, neither Kennedy nor Northside Rlty. Assoc. supports defendant's claim that even an insubstantial deviation from a policy mandating random selection justifies reversal of a judgment of conviction where no proper pretrial challenge was made and no resultant denial of a jury drawn from a representative cross-section is demonstrated.\n\nDefendant's protestations to the contrary notwithstanding, nothing in this record suggests that the statutory violation in this case so skewed the jury selection process that the procedure was so \"inherently defective\" as to be constitutionally invalid even without a showing that the jury actually chosen was not impartial. Nor is reversal required on grounds that the procedure threatened such a potential for abuse or appearance of partiality that reversal without a showing of actual prejudice is required to protect the integrity of the jury selection process.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nB. Impartial Jury--Witherspoon-Witt Error.\n\nRelying on language in Witherspoon v. Illinois, supra, 391 U.S. 510, 522, footnote 21 [20 L.Ed.2d 776, 785], which this court once understood to state the constitutional rule (see People v. Velasquez (1980) 26 Cal. 3d 425, 436\n\n[162 Cal. Rptr. 306, 606 P.2d 341]), defendant claims that the trial court erroneously excluded prospective juror Dale Rokes, who expressed an abstract opposition to the death penalty, but did not make it \"unmistakably clear ... that [he] would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case ....\" (Witherspoon v. Illinois, supra, 391 U.S. 510, 522, fn. 21 [20 L.Ed.2d 776, 785], italics omitted.)\n\nDefendant recognizes that the United States Supreme Court has since clarified the governing principles, holding that a defendant's Sixth and Fourteenth Amendment right to an impartial jury is not compromised by the excusal of a prospective juror whose views about capital punishment give the \"definite impression\" that those views would \" 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.' \" (Wainwright v. Witt, supra, 469 U.S. 412, 424 [83 L.Ed.2d 841, 851-852].) We have adopted the reformulated standard in applying the California Constitution. (People v. Cox (1991) 53 Cal. 3d 618, 645 [280 Cal. Rptr. 692, 809 P.2d 351]; People v. Hamilton (1989) 48 Cal. 3d 1142, 1165 [259 Cal. Rptr. 701, 774 P.2d 730]; People v. Ghent (1987) 43 Cal. 3d 739, 767 [239 Cal. Rptr. 82, 739 P.2d 1250].)\n\nWe find no error. When asked at the outset of the voir dire if he had a conscientious objection to imposition of the death penalty in an appropriate case, Rokes respondent: \"I don't know if I could, no.\" When pressed by the court to consider if \"there's any possibility, by any stretch of the imagination, that you might impose a death penalty for a very horrible crime, for a mass murder,\" he again replied, \"I don't think I could, no.\" Even as a juror deciding the fate of Adolf Hitler, Rokes believed, \"No, I couldn't do it.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nWhen asked by defense counsel if his position was that the state did not have the right to take life, Rokes responded: \"No, I don't disagree with the law. I couldn't see myself as passing that type of judgment.\" And, when asked by the prosecutor if he could imagine any circumstance so offensive that he would vote for the death penalty, he replied: \"No, I can't.\" Finally, the court explained its responsibility to determine if it was \"unmistakably clear that under no circumstance [he] would ever vote for the death penalty\" and asked: \"That's the position you've taken?\" Rokes replied: \"Yes.\"\n\nDefendant claims that the questions posed to the prospective juror focused on the wrong question, and did not establish Rokes's inability to follow the law. We see no possibility that Rokes was unaware that he was being asked if he could follow the law. Indeed, he stated that he did not disagree with the law. His answers made it unmistakably clear that he could not personally follow the law by voting to impose a sentence of death.\n\nC. Jury \"Indoctrination.\"\n\nDefendant next complains that the prosecutor improperly used the Hovey voir dire (Hovey, supra, 28 Cal. 3d 1) to indoctrinate prospective jurors and preargue his theory of the case. In the process, defendant claims, the prosecutor was permitted to inquire, by detailed hypothetical, but case-specific, descriptions, into whether the prospective jurors might find death an appropriate penalty in the specific case. The conduct of the voir dire in this manner was, he argues, both error and misconduct because the prosecutor asked each juror to commit himself or herself in advance to a position.\n\nDefendant offers as examples the voir dire of two prospective jurors who were later sworn to try the case. The first was asked: \"If we get to the penalty phase, if we get that far, then you've already found the man guilty of first degree murder. It's a horrible crime. And you found he committed this murder while he was engaged in a robbery, based on facts that would be something like a man decides to commit a robbery, arms himself with a handgun to make sure he's successful, robs his victim. During the course of the robbery it occurs to him that if the victim is not alive, there won't be anybody going to the police and complain .... So, realizing that, the robber points his gun at the victim, pulls the trigger, shoots him once through the heart and kills him.\n\n\"That's the type of facts we're going to be dealing with, something along those lines, perhaps.\n\n\"Do you feel just, first of all, theoretically like it's possible you could vote for the death penalty if you're faced with facts such as those?\"\n\nAnother juror was asked: \"So now you're in a penalty phase with the defendant like this one, who has committed this kind of a crime and I want you to ask yourself, after looking inside yourself whether you could actually vote to put another human being to death for doing a crime like this:\n\n\"Let's assume you have a person who decides to commit a robbery because he wants to make some additional money. He goes out and gets\n\nhimself a loaded handgun to make the odds more in his favor that he'll be successful. And he finds a victim that he thinks has some money and sure enough, the victim has some money when the defendant sticks him up. Sometime about this point the defendant has the brilliant thought that if I let this guy go, he's going to the police and I might get caught and whereas if I don't let him go, don't leave any witnesses, I won't get caught, in other words I'd better kill him to make myself more certain of getting away.\n\n\"That's exactly what he does; he shoots the victim once through the heart and subsequently he's caught and he's been brought before us and you have found beyond any doubt that he's guilty of first degree murder committed during the course of a robbery.\n\n\"Do you think its possible that you could go in the jury room, look the other jurors in the eye and knowing you'll have to come out and look the defendant in the eye also, say I think this crime is so horrendous and the other background facts we've heard are so horrendous, he should be put to death?\"\n\nAs we have observed before, \"[t]he only question the court need resolve during this stage of the voir dire is whether any prospective juror has such conscientious or religious scruples about capital punishment, in the abstract, that his views would ' \"prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.\" ' \" (People v. Mattson (1990) 50 Cal. 3d 826, 845 [268 Cal. Rptr. 802, 789 P.2d 983].) The Hovey \"voir dire seeks only to determine if, because of his views on capital punishment, any prospective juror would vote against the death penalty without regard to the evidence produced at trial.\" (; People v. Clark (1990) 50 Cal. 3d 583, 597 [268 Cal. Rptr. 399, 789 P.2d 127]. See also, Wainwright v. Witt, supra, 469 U.S. 412, 416 [83 L.Ed.2d 841, 846-847].)\n\nIt was not necessary, therefore, to permit extensive questioning of the prospective jurors during the Hovey voir dire regarding their willingness to impose the death penalty based on the anticipated facts of, or a hypothetical set of facts based on, the case to be tried. Defendant objected neither to these questions, nor to similar questions asked of other jurors during the Hovey voir dire,\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e however.\n\nAlthough voir dire is not a platform from which counsel may educate prospective jurors about the case, or compel them to commit themselves to a particular Disposition of the matter, to prejudice them for or\n\nagainst a party, or to \"indoctrinate\" them (see People v. Williams (1981) 29 Cal. 3d 392, 408 [174 Cal. Rptr. 317, 628 P.2d 869]), the scope of the inquiry permitted during voir dire is committed to the discretion of the court. Absent a timely objection to questions that arguably exceed the proper scope, any claim of abuse of discretion is deemed to have been waived.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nD. Death Penalty Bias.\n\nProspective juror Austin responded to an inquiry by the court whether he had \"a leaning one way or the other? Are you more inclined to be pro death as opposed to pro life\" with: \"Yeah, pro death.\" He stated that, \"[I]t would have to be a lot\" of mitigating evidence to convince him to return a verdict of life without possibility of parole. He denied that his views arose out of revenge, explaining simply that he was afraid that a person sentenced to life without parole might escape or be released, and did not think a person who premeditated before killing someone should be loose to kill again. He also preferred the death penalty to life imprisonment because he did not feel he could support such a person for the rest of his life.\n\nDefendant educes from this that Austin was committed to voting for death in any case involving an intentional murder, or at a minimum had a\n\nbias for death. The trial court denied a challenge for cause, however, concluding that Austin's replies did not make it unmistakenly clear that he would impose the death penalty in all cases. We agree, but more importantly, as respondent notes, Austin was not selected as a juror or even seated during the general voir dire. Similarly, prospective juror Wheeler, who defendant claims was also biased toward death, was removed by the People's exercise of a peremptory challenge, and prospective juror Worrell was excused for hardship by stipulation.\n\nE. Absence of Defendant.\n\nNotwithstanding his execution of a written waiver of his right to be present at some stages of jury selection, and a subsequent oral waiver of that right, defendant claims that the judgment must be reversed because he was not present throughout jury selection. He argues that the right to be present during a crucial part of the trial may not be waived, and that even if waiver is permissible, his waivers were invalid.\n\nDefendant concedes that the written waiver executed by him and his attorney on July 5, 1983, is in the language prescribed by subdivision (b) of section 977. That section expressly permits a defendant to waive his right to be present at all felony proceedings other than the arraignment, plea, preliminary hearing, taking of evidence, and imposition of sentence, i.e., proceedings at which the presence of the defendant \"bears a reasonably substantial relation to the fullness of his opportunity to defend against the charge.\" (People v. Cooper (1991) 53 Cal. 3d 771, 825 [281 Cal. Rptr. 90, 809 P.2d 865]; People v. Holloway (1990) 50 Cal. 3d 1098, 1116 [269 Cal. Rptr. 530, 790 P.2d 1327].) It provides, however, that the defendant must, \"with leave of court, execute in open court, a written waiver of his right to be personally present.\"\n\nDefendant asserts that \"apparently\" his written waiver was not executed in open court. The minute order for that date recites, however: \"A Waiver of Defendant's Personal Presence is received and ordered filed.\" Defendant offers no support for his assertion that the waiver was not executed in open court other than the omission of a recital to that effect in the minute order. The minutes recite that defendant and his counsel were present at the time the waiver was received. In the absence of any indication to the contrary we presume, as we must, that a judicial duty is regularly performed. (Evid. Code, § 664. See Ross v. Superior Court (1977) 19 Cal. 3d 899, 913 [141 Cal. Rptr. 133, 569 P.2d 727].)\n\nEven absent such presumption, however, an irregularity in the procedure by which the waiver is executed is not grounds for reversal of the\n\njudgment in the absence of a showing both that the irregularity affected the voluntary and intelligent nature of the waiver, and that the defendant suffered prejudice as a result of his absence from those aspects of jury selection from which he had absented himself. (People v. Medina (1990) 51 Cal. 3d 870, 903 [274 Cal. Rptr. 849, 799 P.2d 1282]; People v. Garrison (1989) 47 Cal. 3d 746, 782-783 [254 Cal. Rptr. 257, 765 P.2d 419].)\n\nOne week after his written waiver was accepted by the court, defendant's attorney advised the court that defendant did not want to be present during further voir dire proceedings. The court noted the prior written waiver and then agreed to acquiesce in defendant's request upon receiving an oral waiver and a statement that defendant volitionally and personally made the request. Defendant's waiver was then elicited and accepted by the court.\n\nWe have repeatedly rejected the argument that presence at all stages of a capital case is indispensible and thus unwaivable. (People v. Sully (1991) 53 Cal. 3d 1195, 1238 [283 Cal. Rptr. 144, 812 P.2d 163]; People v. Cooper, supra, 53 Cal. 3d 771, 825; People v. Medina, supra, 51 Cal. 3d 870, 903; People v. Robertson (1989) 48 Cal. 3d 18, 60-61 [255 Cal. Rptr. 631, 767 P.2d 1109]; People v. Grant (1988) 45 Cal. 3d 829, 845 [248 Cal. Rptr. 444, 755 P.2d 894]; People v. Odle (1988) 45 Cal. 3d 386, 406-407 [247 Cal. Rptr. 137, 754 P.2d 184]; People v. Hovey (1988) 44 Cal. 3d 543, 585-586 [244 Cal. Rptr. 121, 749 P.2d 776].) We are not persuaded that this Conclusion should be reconsidered.\n\nF. Exclusion of the Public and the Press.\n\nDefendant next claims that reversal of the judgment is required because the public and the press were excluded from the sequestered \"death-qualification\" voir dire conducted pursuant to Hovey v. Superior Court, supra, 28 Cal. 3d 1. He concedes that the issue was not raised in the trial court (People v. Thompson, supra, 50 Cal. 3d 134, 156-157), but argues that the trial court did not give counsel \"any real opportunity to do so\" and suggests that defendant might not have been competent to waive the right.\n\nAs discussed above, the record does not afford any basis for questioning defendant's competence.\n\nThe record is also devoid of any support for defendant's claim that trial counsel had no opportunity to object to the sequestered voir dire. Nor will we infer such an inhibition, particularly since the right to a sequestered voir dire was recognized in response to concerns of capital defendants over the\n\npotentially prejudicial effect of an open voir dire on jurors' views and willingness to reveal their views about capital punishment. (Hovey v. Superior Court, supra, 28 Cal. 3d 1, 80.) As we observed in People v. Thompson, supra, 50 Cal. 3d 134, 156-157, there was active litigation of the question of the right of the press to attend jury voir dire in 1983 when this trial occurred, and because the sequestered voir dire is for the benefit of the defendant \"it is doubtful that any competent defense counsel would have objected to it.\"\n\nWe conclude, therefore, that no impropriety in the jury selection process warrants reversal of the judgment.\n\nIV\n\nGUILT PHASE ISSUES\n\nA. Evidence and Argument Related to the Scofield Incident.\n\n1. Cross-examination of Defendant.\n\nAs our brief description of the evidence offered by defendant reflects, his defense strategy involved an effort to attribute his actions to substance abuse, and to convince the jury that his use of cocaine shortly before the offenses so affected his mind that the murder was not intentional, wilfull, deliberate, or premeditated. In support of this effort he admitted his conviction for assault with a deadly weapon, but sought to minimize any implication that he was assaultive, and claimed that he was forced to plead guilty to that offense even though he had acted in self-defense.\n\nIn response, the People sought to bring out not only the details of defendant's 1978 assault on William Scofield, but other evidence about the incident, including evidence that defendant had stabbed Kathy Cusack. Defendant was asked if he had kicked the door to the room open, and denied it. He denied that there was a woman in bed, that he had ever seen Cusack, that he had seen a pregnant woman on the night of the stabbing, that Scofield had been in bed, that he had stabbed Cusack, that he had been close enough to her to stab her, or that anyone had cried or screamed that she was pregnant.\n\nDefendant now claims that the cross-examination during which the People elicited these answers was an improper inquiry into inadmissible evidence which implied that he had stabbed Cusack. The prosecutor's questions, defendant claims, were testimony. He did not object on those grounds, however, or on grounds that the cross-examination exceeded the scope of direct. He made only a relevance objection to a question asking if he had decided to plead guilty and go to state prison, and objected, on grounds that\n\nthe questions assumed facts not in evidence, to a question asking if he recalled that the initial argument had been over the loss of Cusack's cat. Therefore, even were we to assume that questions were improper, the failure to object bars reversal on that ground. (Evid. Code, § 353, subd. (a).)\n\nWe make no such assumption, however, since the inquiry into all of the circumstances of the attack on Scofield was well within the scope of defendant's testimony on direct examination, and sought to elicit evidence relevant to whether defendant had purposefully engaged in violent assaults in the past. Defendant having introduced evidence that his conviction of assault with a deadly weapon was based on conduct he took in self-defense, the People were not precluded by Evidence Code sections 761 and 787 from attempting to rebut that evidence by bringing out all of the circumstances of the incident in which Scofield was attacked. Defendant had placed his character in issue, attempting to show that he did not commit a premeditated murder, and in aid of that effort to cast a favorable light on the circumstances of his prior conviction. The People were, therefore, entitled to cross-examine him regarding all of the circumstances for purposes of impeachment. (Evid. Code, § 773, 780; People v. Lang (1989) 49 Cal. 3d 991, 1017 [264 Cal. Rptr. 386, 782 P.2d 627]; People v. Wagner (1975) 13 Cal. 3d 612, 617 [119 Cal. Rptr. 457, 532 P.2d 105]; People v. Schader (1969) 71 Cal. 2d 761, 770-771 [80 Cal. Rptr. 1, 457 P.2d 841].)\n\nDefendant's effort to convert the issue into one of prosecutorial misconduct fares no better. Defendant seeks to rely on the well-established rule that a prosecutor may not examine a witness solely to imply or insinuate the truth of the facts about which questions are posed. (See People v. Wagner, supra, 13 Cal. 3d 612, 619; People v. Hamilton (1963) 60 Cal. 2d 105, 116 [32 Cal. Rptr. 4, 383 P.2d 412], disapproved on another point in People v. Morse (1964) 60 Cal. 2d 631, 649 [36 Cal. Rptr. 201, 388 P.2d 33, 12 A.L.R.3d 810].) That reliance is misplaced. Here the inquiry about the assault on Cusack was unquestionably predicated on evidence available to the prosecution. This is not a case in which the evidence would have been inadmissible but for the fact that defendant's answers may have been untruthful. (See People v. Lavergne (1971) 4 Cal. 3d 735, 744 [94 Cal. Rptr. 405, 484 P.2d 77].) The evidence would have been admissible. A prosecutor is not under compulsion to anticipate that a witness's memory of additional details regarding events about which he has testified will suddenly fail on cross-examination. The questions were leading, but such questions are not improper when asked in good faith of a presumptively hostile witness on cross-examination. (Evid. Code, § 767, subd. (a)(2); People v. Williams (1957) 153 Cal. App. 2d 5, 8 [314 P.2d 161]; People v. Kostal (1954) 123 Cal. App. 2d 120, 123 [266 P.2d 205].)\n\n2. Admission of Photographs.\n\nDefendant objected, on relevancy grounds and on grounds that they were so gruesome that the prejudicial impact outweighed their probative value (Evid. Code, § 350, 352), to introduction of photos of the stab wounds suffered by Cusack.\n\nThe photos introduced by the People included one of the door to the room from which Scofield had been dragged and behind which Cusack had been stabbed. Defendant had denied that he and his companions had kicked in the door to the room, had denied that a woman had been in bed in the room, and had denied that he had ever seen Cusack. The photos were relevant, therefore, to impeach his testimony. They were tied to the assault by the testimony of Officer McKay, who had arrived at the crime scene shortly after the stabbings occurred and had photographed the scene. From there he had gone to the hospitals to which Scofield and Cusack had been taken for treatment, where he photographed their wounds. He described the wounds, without objection, in his testimony.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe record confirms that the trial court properly weighed the probative value of the photos against their prejudicial impact before admitting them. There was no abuse of discretion. (People v. Harris, supra, 47 Cal. 3d 1047, 1095.)\n\n3. Guilt Phase Argument.\n\nIn a related argument, defendant contends that the prosecutor improperly implied, during closing argument at the guilt phase, that defendant had stabbed Cusack.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The argument was closely tied to the impeaching evidence, however, and defendant did not object. To\n\nthe extent that it might have lacked a basis in the evidence,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e any harm could have been cured by such objection and an admonition by the court. Absent objection, the issue has not been preserved for appeal. (People v. Lewis, supra, Cal. 3d 262, 283; People v. Green (1980) 27 Cal. 3d 1, 28 [164 Cal. Rptr. 1, 609 P.2d 468].)\n\nB. Miranda Warnings Prior to Videotaped Reenactment.\n\nThe trial court found, and defendant does not challenge the finding, that prior to making the taped statement to police in which he admitted shooting Dykstra, defendant had \"waived his rights under the Miranda decision, that the waiver is freely, voluntarily, knowingly, and intelligently given.\" Defendant now claims, however, that the officers were obligated, but failed, to properly repeat the Miranda advisement (see Miranda v. Arizona (1966) 384 U.S. 436 [16 L.Ed.2d 694, 86 S.Ct. 1602, 10 A.L.R.3d 974]) prior to the videotaping session conducted six hours later.\n\nWe reject this claim. First, defendant did not object to admission of the videotaped reenactment on this ground at trial and thus did not preserve the issue for appeal. (People v. Mattson, supra, 50 Cal. 3d 826, 853-854; People v. Milner (1988) 45 Cal. 3d 227, 236 [246 Cal. Rptr. 713, 753 P.2d 669].) Moreover, he agreed to participate in the reenactment during the initial interrogation at which he had voluntarily waived his rights.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Defendant cites no authority for the proposition that, notwithstanding the initial waivers and agreement to the procedure, further warnings and waivers were necessary at the time of the actual videotaping.\n\nAssuming that agreement to continue the interrogation process later was not a sufficient waiver, however, in circumstances such as those here, where the subsequent interrogation took place only a few hours thereafter, the truncated advice given was sufficient. When a subsequent interrogation is reasonably contemporaneous it is not necessary to repeat the full Miranda warning. (People v. Braeseke (1979) 25 Cal. 3d 691, 701-702 [159 Cal. Rptr. 684, 602 P.2d 384], vacated and cause remanded (1980) 446 U.S. 392 [64 L.Ed.2d 784, 100 S.Ct. 2147], reiterated 28 Cal. 3d 86 [168 Cal. Rptr. 603, 618 P.2d 149], and cases cited.) Defendant was told that his statements could be used against him, and was reminded of the rights he had waived earlier in the day. In asking defendant if he still wanted to waive his rights, Officer Sidebotham clearly implied that those rights were still available to defendant. (See People v. Mattson, supra, 50 Cal. 3d 826, 858; People v. Duren (1973) 9 Cal. 3d 218, 242 [107 Cal. Rptr. 157, 507 P.2d 1365].)\n\nC. Instructional Error.\n\n1. Consideration of Juvenile and Misdemeanor Offenses.\n\nDefendant next argues that the court erred in failing to instruct the jury sua sponte that it could not consider offenses he committed as a juvenile (sale of narcotics, truancy, trespassing, escape) and his misdemeanor conviction of vandalism in determining his guilt. He concedes that evidence of these offenses was either admitted without objection or was introduced by defendant himself, but claims that the court was obligated nonetheless to instruct on the limited purpose for which the evidence could be considered.\n\nThe rule is otherwise. \"Although the trial court may in an appropriate case instruct sua sponte on the limited admissibility of evidence of past criminal conduct, we have consistently held that it is under no duty to do so.\" (People v. Collie (1981) 30 Cal. 3d 43, 63 [177 Cal. Rptr. 458, 634 P.2d 534, 23 A.L.R.4th 776].) We are not persuaded that an exception is warranted in this case. Indeed, defendant's reason for offering evidence of his past misconduct was to persuade the jury that his present offense, like the earlier ones, was the product of his abuse of drugs. He invited the jury to consider those offenses in determining his guilt, and may not complain on appeal that it did so. (See People v. Williams (1988) 44 Cal. 3d 883, 958-959 [245 Cal. Rptr. 336, 751 P.2d 395].)\n\n2. Evidence of Mental State.\n\nDefendant claims that the instructions given by the court were not adequate to advise the jury of the relevance of the evidence of drug-induced\n\npsychosis, sleep deprivation, and \"near automated response to his accomplice's command\" to finding the existence or absence of the mental elements of the offenses with which he was charged--murder, attempted murder, and robbery. He complains in particular that the court refused to give instructions on \"diminished actuality.\"\n\nNo such instructions were requested, however. Rather, defendant requested instructions on \"diminished capacity.\" (CALJIC former Nos. 4.25, 8.41, 8.48.) The court refused those instructions, which address a defendant's general capacity or ability to form a specific intent or harbor a mental element of an offense, because the defense had been abolished by the amendment of section 22 in 1982, and by the addition of section 25,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e an initiative measure adopted by the electorate in the June 8, 1982, election.\n\nIt is clear from the jury verdicts that the jury determined that the murder was a felony murder committed during the perpetration of robbery. Therefore, the only mental state now relevant to those two offenses is the intent to steal.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Both malice and intent to kill are elements of attempted murder, however. The issue is whether the instructions given were adequate to inform the jury that defendant's evidence of drug-induced intoxication and the expert testimony regarding his mental state could be considered in determining if defendant did harbor these mental elements at the time of the offenses. It is clear that they were adequate.\n\nThe trial court instructed the jury: \"In the crimes charged in counts I, II, and III of the Information, namely murder, attempted murder and robbery, a necessary element is the existence in the mind of the defendant of a certain\n\nspecific intent or mental state. These are included in the definition of the crimes charged.\n\n\"If the evidence shows that the defendant was intoxicated at the time of the alleged offense, the jury should consider his state of intoxication in determining if the defendant has such specific intent or mental state.\n\n\"If from all of the evidence you have a reasonable doubt whether defendant was capable of forming such specific intent, or mental state, you must give the defendant the benefit of that doubt and find that he did not have such specific intent.\"\n\nThe court also instructed the jury on the elements of manslaughter,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e after which a further instruction on intoxication was given:\n\n\"If you find that the defendant killed while unconscious as a result of voluntary intoxication and was therefore unable to form a specific intent to kill or to harbor malice aforethought, his killing is involuntary manslaughter.\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nWith respect to felony-murder-robbery, the court instructed the jury: \"Before the defendant may be found guilty of the unlawful killing of a human being as a result of the commission or attempt to commit the crime of\n\nrobbery, you must take all the evidence into consideration and determine therefrom, if at the time of the commission or attempt to commit such crime, the defendant was suffering from some abnormal mental or physical condition, however caused, which prevented him from forming the specific intent to commit such crime.\"\n\nThe jury was, therefore, instructed repeatedly that it should take into consideration the evidence of abnormal mental state in determining whether the mental states that are elements of these offenses were present, and was advised that drug-induced intoxication was evidence that should be considered in making that determination. There was no error in this regard.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\n3. Murtishaw Error.\n\nDefendant correctly observes, and the People concede, that the trial court erred in failing to limit the instructions on implied malice to the murder count. As we explained in People v. Murtishaw (1981) 29 Cal. 3d 733, 764-765 [175 Cal. Rptr. 738, 631 P.2d 446]: \"[O]nce a defendant intends to kill, any malice he may harbor is necessarily express malice. Implied malice ... cannot coexist with a specific intent to kill. To instruct on implied malice in that setting, therefore, may confuse the jury by suggesting that they can convict without finding a specific intent to kill.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e While assault with intent to commit murder (former § 217) was in issue in Murtishaw, that rule applies equally to attempted murder since intent to kill is also an element of attempted murder. (People v. Ratliff (1986) 41 Cal. 3d 675, 695 [224 Cal. Rptr. 705, 715 P.2d 665]; People v. Ramos (1982) 30 Cal. 3d 553, 583 [180 Cal. Rptr. 266, 639 P.2d 908] revd. on other grounds sub nom. California v. Ramos (1983) 463 U.S. 992 [77 L.Ed.2d 1171, 103 S.Ct. 3446].)\n\nThe court also failed to instruct that an intent to kill is an element of attempted murder, telling the jury only that there must be \"a specific intent to commit the crime, and the direct but ineffectual act done toward its commission.\" As a result, defendant argues, the jury might have believed\n\nthat an attempted murder verdict, like a verdict on second degree murder on which it had been instructed, could be returned if implied malice were found.\n\nThe People, relying on People v. Dyer (1988) 45 Cal. 3d 26, 65 [246 Cal. Rptr. 209, 753 P.2d 1], and People v. Lee (1987) 43 Cal. 3d 666, 677 [238 Cal. Rptr. 406, 738 P.2d 752], contend that the error was harmless. Dyer is not helpful to their position, however, since in that case the jury convicted the defendant of attempted first degree murder and had been instructed that a specific intent to kill was an element of that offense. The Lee jury had also been instructed that the prosecution had to prove that the defendant shot with the specific intent to kill, and the arguments of counsel were directed to the existence of that intent.\n\nWe conclude nonetheless that the omission could not have prejudiced defendant. The jury was instructed that the defendant must have a specific intent to commit the crime, i.e., murder, and murder had been defined. In his argument the prosecutor had stated that the implied malice/felony-murder instructions were inapplicable to attempted murder, and that in attempted murder there must be express malice and intent to kill.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The prosecutor's argument emphasized the evidence that defendant shot Wolbert three times, and that because the third shot was fired into Wolbert's face at point-blank range \"there's no question what was in the mind at that point. There's no question what his intent was .... There's no question what this man's intent was when he did that. He intended to kill a second victim. ...\"\n\nThe argument of defense counsel was directed primarily to the murder count, but in his attempt to persuade the jury that defendant did not intend to kill, he made reference to the shooting of Wolbert as well as that of Dykstra. There is no question, therefore, but that the jury was aware that a specific intent to kill was an element of attempted murder. (Cf. People v. Howard (1992) 1 Cal. 4th 1132, 1173 [5 Cal. Rptr. 2d 268, 824 P.2d 1315].) The instructional error was harmless beyond a reasonable doubt.\n\n4. Consideration of Lesser Included Offenses (Stone/Kurtzman).\n\nThe court instructed that the jury must unanimously agree and sign a verdict finding that the defendant was not guilty of first degree murder\n\nbefore the jury could find defendant guilty or not of second degree murder. Defendant claims that the court erred in giving an instruction that required an acquittal of first degree murder before consideration of lesser included offenses.\n\nThe instructions were proper. They did not preclude consideration of lesser offenses. \" Stone [ Stone v. Superior Court (1982) 31 Cal. 3d 503 (183 Cal. Rptr. 647, 646 P.2d 809)] should be read to authorize an instruction that the jury may not return a verdict on the lesser offense unless it has agreed beyond a reasonable doubt that defendant is not guilty of the greater crime charged, but it should not be interpreted to prohibit a jury from considering or discussing the lesser offenses before returning a verdict on the greater offense.\" (People v. Kurtzman (1988) 46 Cal. 3d 322, 329 [250 Cal. Rptr. 244, 758 P.2d 572], original italics.) We concluded in Kurtzman that this rule was adequate to protect the defendant's interest that jury deliberations not be improperly restricted.\n\n5. Other Instructional Error.\n\nDefendant also complains that the court erroneously gave instructions on flight and concealment of evidence, that it was error to instruct that the degree of murder is not an element of the crime, and that the order of the instructions was confusing.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe flight instruction, given in the language of CALJIC No. 2.52, advised the jury that evidence of flight alone is insufficient to establish guilt, but may be considered with other proven facts in deciding the question of guilt or innocence. It followed the language of section 1127c. \"An instruction on flight is properly given if the jury could reasonably infer that the defendant's flight reflected consciousness of guilt, and flight requires neither the physical act of running nor the reaching of a far-away haven. [Citation.] Flight manifestly does require, however, a purpose to avoid being observed or arrested.\" (People v. Crandell (1988) 46 Cal. 3d 833, 869 [251 Cal. Rptr. 227, 760 P.2d 423].)\n\nThe jury could infer from the actions of defendant immediately following the crime that his flight with Hefner reflected consciousness of\n\nguilt. This Conclusion is not affected by defendant's decision to contest only the mental state with which he acted. Even were we to conclude that the instruction should not have been given, however, it was clearly harmless. As in Crandell, supra, 46 Cal. 3d 833, the instruction did not assume that flight was established, leaving that factual determination and its significance to the jury.\n\nNor are we persuaded that the instruction on concealment of evidence (CALJIC No. 2.06) was improper simply because it was Hefner who had concealed the gun. The evidence permitted an inference that Hefner had acted on behalf of defendant as well as in concealing the weapon and that he did so with defendant's encouragement. Again, however, if there was error it was harmless beyond a reasonable doubt.\n\nThe offense with which defendant was charged was \"murder.\" The court correctly instructed that the degree is not an element of that crime. The degree is not an element of either first or second degree murder. The court correctly instructed the jury that \"all murder which is perpetrated by any kind of willful, deliberate and premeditated killing with express malice aforethought is murder of the first degree,\" and that \"the unlawful killing of a human being whether intentional, unintentional, or accidental, which occurs as a result of the commission of or attempt to commit the crime of robbery, and where there was in the mind of the perpetrator the specific intent to commit such crime, is murder of the first degree.\"\n\nThe jury was thereby required to find all of the elements of the offense of first degree murder. The jury was also instructed that \"the burden is on the state to prove beyond a reasonable doubt each of the elements of murder.\" Contrary to defendant's claim, the instructions did not shift the burden to the defendant, nor would they confuse the jury as to the elements that had to be proven beyond a reasonable doubt.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Although the general rule is that the order in which instructions are given is immaterial and is left to the sound discretion of the trial court (People v. Sanders (1990) 51 Cal. 3d 471, 519 [273 Cal. Rptr. 537, 797 P.2d 561]; People v. Carrasco (1981) 118 Cal. App. 3d 936, 942 [173 Cal. Rptr. 688]), we have reviewed the order in which the instructions were given in this case and are satisfied that the order was logical and that no confusion was reasonably possible. (People v. Ford (1964) 60 Cal. 2d 772, 793 [36 Cal. Rptr. 620, 388 P.2d 892].)\n\nV\n\nSPECIAL CIRCUMSTANCES ISSUE\n\nDefendant argues that the failure of the trial court to instruct the jury pursuant to People v. Garcia (1984) 36 Cal. 3d 539 [205 Cal. Rptr. 265, 684 P.2d 826] and Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862], that a specific intent to kill is a necessary element of a felony-murder special circumstance was error that requires that the felony-murder-robbery special circumstance be set aside. It is not sufficient, he claims, that the jury found, under other proper instructions, that the murder was intentional because the jury must also find that the murder was committed with express malice, premeditation, and deliberation.\n\nThis claim lacks merit. Carlos v. Superior Court, supra, 35 Cal. 3d 131, was reconsidered and overruled in People v. Anderson (1987) 43 Cal. 3d 1104 [240 Cal. Rptr. 585, 742 P.2d 1306], in which we held that intent to kill is not necessary if a defendant convicted of first degree murder personally killed the victim. Consequently, Carlos applies only to murder committed between December 12, 1983, the date on which Carlos was decided, and October 13, 1987, the date on which it was overruled. (People v. Whitt (1990) 51 Cal. 3d 620, 637 [274 Cal. Rptr. 252, 798 P.2d 849]; People v. Thompson, supra, 50 Cal. 3d 134, 175; In re Baert (1988) 205 Cal. App. 3d 514, 517-522 [252 Cal. Rptr. 418].) The jury found on other properly given instructions that defendant personally killed Dykstra. It is also well established that the felony-murder special circumstances (§ 190.2, subd. (a)(17)) are not limited to premeditated and deliberate murders, and that such a requirement is not mandated by the Eighth Amendment or other constitutional considerations. (People v. Belmontes (1988) 45 Cal. 3d 744, 794-795 [248 Cal. Rptr. 126, 755 P.2d 310].)\n\nVI\n\nPENALTY PHASE ISSUES\n\nA. Instructions.\n\n1. CALJIC Former No. 8.84.2.\n\nThe court instructed the jury in the language of CALJIC former No. 8.84.2: \"If you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death.\n\n\"However, if you determine that the mitigating circumstances outweigh the aggravating circumstances, you shall impose a sentence of confinement in the state prison for life without possibility of parole.\"\n\nRelying on People v. Brown (1985) 40 Cal. 3d 512, 538-545 [220 Cal. Rptr. 637, 709 P.2d 440] (revd. on other grounds sub nom. California v. Brown (1987) 479 U.S. 538 [93 L.Ed.2d 934, 107 S.Ct. 837]), defendant contends that this instruction and the prosecutor's penalty phase argument, without further explanation of the weighing process and the role of the jury in determining the appropriate penalty, misled the jury.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Together these factors restricted the jury to implementing a mechanical weighing formula under which imposition of the death penalty was mandatory if \"bad\" outweighed \"good,\" and left the jury without an understanding of its role and responsibility in determining the appropriate penalty.\n\nIn a related argument, defendant argues that reversal of the judgment of death is required because the record does not affirmatively demonstrate that the jury properly considered all mitigating evidence and inferences. In support of this claim, defendant relies not only on the use of CALJIC former No. 8.84.2, but also on a perceived failure of other instructions to ensure that the jury was aware of the full extent of its discretion to consider any mitigating evidence.\n\nWhen addressing such claims we examine the entire record, including the instructions and arguments, to determine whether the jury was misled to the prejudice of the defendant about the scope of its sentencing discretion. (People v. Brown, supra, 40 Cal. 3d 512, 544, fn. 17.) We must ascertain whether, overall, the jury was adequately informed of the full nature of its sentencing responsibility, both as to the manner in which the various factors are to be weighed and as to the scope of its sentencing discretion. (People v. Belmontes, supra, 45 Cal. 3d at pp. 802-803.)\n\nHaving reviewed the record here, we are satisfied that the argument of counsel clearly informed the jury that the weighing process was not\n\nmechanical, and impressed on the jurors that they had both the discretion and the responsibility to determine whether death was the appropriate penalty in light of all of the evidence. Indeed, the prosecutor opened his argument by advising the jury that at this stage of the trial the only question to be answered was \"in light of what you know this defendant has done, what penalty or punishment does he deserve?\"\n\nThe prosecutor made it clear that the weighing process was not arithmetical or mechanical. He told the jurors that after they had decided that a factor was applicable and decided if it was aggravating or mitigating, \"finally you attach a weight to it. In other words, you ask yourselves how important is the factor ... how important is it in the overall picture? ... [O]nce you've done that and you've attached a weight to each one of the factors, you look at the total weight at the end of your deliberations on each one of the factors and you answer the final question: Do the aggravating factors outweigh the mitigating? In which case you vote for the death penalty. On the other hand, if you think that the mitigating factors outweigh the aggravating factors, you give the defendant the lesser sentence of life in prison without possibility of parole.\"\n\nHe impressed on the jurors the tremendous responsibility they undertook \"sitting in life or death judgment of a human being,\" and told them that \"the way you really answer these questions ... the way you will make your ultimate determination is by determining what kind of a crime this is and by determining what kind of a person it was who committed the crime.\" As he was reviewing the evidence and its relationship to the statutory aggravating and mitigating factors, the prosecutor told the jury that factor (k)--\"[a]ny other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime\"--(§ 190.3, factor (k)), allowed the jury to \"consider pity and sympathy for him and theoretically that's enough to save his life. ... If you feel sorry for him, you can give him the benefit of that pity and sympathy and you can save his life.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThe jury was told that one factor alone could save defendant's life even though all of the others were \"overwhelmingly aggravated,\" if by itself it weighed more than the other factors.\n\nWe see no likelihood, based on the prosecutor's argument, that the jury would have believed that the weighing process involved nothing more than adding the number of mitigating and aggravating factors. In summation, he\n\ntold the jurors that it was their duty and obligation to return a verdict of death \"if that's what he deserves.\" The jury was thus impressed with the scope of its discretion and its responsibility to determine the appropriate penalty.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nDefendant's attorney also emphasized that while the prosecution might be asking that a verdict of death be returned even though the defendant was \"49 percent good,\" an inaccurate but possibly effective tactic, \"it's not that easy a case in my opinion. That's not the type of procedure that can be taken lightly without careful evaluation and careful consideration.\" He also urged the jury to consider sympathy and pity \"because there's nothing more serious than what you're being asked to do. You're being asked to take somebody's life. That's the bottom line.\"\n\nAgain it was made clear that no mechanical weighing was expected, and that the jury's responsibility was to determine, based on all of the evidence, and considering sympathy and pity for the defendant, if he should be put to death. The court included an instruction that the jury could \"consider pity and sympathy for the defendant in deciding the penalty to be imposed on the defendant.\"\n\nWe reject petitioner's argument that the jury may not have known that it could consider all mitigating evidence that was before it. Here, as in\n\npast cases, defendant argues that the jury may have believed it was limited because the statutory factors referred only to \"extreme\" mental or emotional disturbance and \"extreme\" duress. Again we are satisfied that this language did not impermissibly restrict the jury's exercise of discretion. (See People v. Morris (1991) 53 Cal. 3d 152, 225-226 [279 Cal. Rptr. 720, 807 P.2d 949], and cases cited.) There was no suggestion in the argument of counsel, for instance, that the jury could not consider whether defendant acted under duress because the instruction referred only to \"extreme\" duress. The prosecutor argued that the jury should reject defendant's attempt to persuade them that Hefner had \"convinced him he should,\" but never suggested that the rejection should be because the evidence did not demonstrate \"extreme\" duress. Indeed, the arguments of both counsel assumed, and made clear to the jury, that counsel assumed that the jury would consider all of the mitigating evidence and inferences that might be drawn therefrom. Recognizing that the jury might not find the mitigating evidence persuasive, however, counsel made no effort to rely on it. We are satisfied, nonetheless, that the jury was not misled, and was aware that it was free to consider any evidence presented at the guilt and penalty phases of the trial in mitigation.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\n2. Instructions on Lesser Offenses.\n\nDefendant argues that because the court did not give clear instructions on all possible lesser included offenses, the reliability of the verdict of death has been undermined. We have rejected his claim that there was prejudicial guilt phase error in the court's failure to instruct on voluntary manslaughter. In this context, however, he argues that the omission of the instruction may have prevented the jury from understanding the distinction between the degrees of murder and manslaughter and between voluntary and involuntary manslaughter. If so, the jury would not be able to properly consider the impact of the reduced levels of culpability in considering the relevance of the evidence of his intoxication to culpability and penalty. That evidence would be relevant at the penalty phase, he argues, notwithstanding its irrelevance at the guilt phase in light of the felony-murder finding.\n\nWe agree that the evidence was relevant. We do not agree that any instructional error misled the jury as to that relevance, however. As we noted\n\nabove, it is clear that the jury was aware that intent to kill was an element of attempted murder and rejected the evidence that defendant's intoxication negated the existence of that intent. And, as noted earlier, the jury was instructed that it should take into account the evidence of both defendant's abnormal mental state and his drug-induced intoxication. The jury rejected defendant's attempt to establish reduced, culpability on that basis when it returned the guilt verdict.\n\nDefendant also claims that the jury might not have been aware that his intoxication was relevant in determining whether he committed larceny or auto theft rather than robbery. He argues, in support of his claim that inadequate instruction prejudiced him in this regard, that he \"maintained that he did not intend to rob Dykstra or Wolbert.\"\n\nWe reject his claim that the instructions were inadequate in this regard. The jury was instructed that robbery was a specific intent crime, that the specific intent to commit robbery had to be proven beyond a reasonable doubt, and that defendant's intoxication should be considered in determining if he had the requisite specific intent. Instructions on larceny were given, and the jury was told that if it was not satisfied that the defendant was guilty of the charged offense it could convict on any lesser included offense. The instructions were adequate. (People v. Jones (1991) 53 Cal. 3d 1115, 1145 [282 Cal. Rptr. 465, 811 P.2d 757].)\n\nWe note also that defendant does not accurately describe his testimony. While he testified that at the time the car pulled over he intended only to urinate, he also testified that his intent was to take the victims farther up the canyon before taking their money. Defendant refused to characterize his intent as an intent to \"rob,\" but his own description of the plan admitted that intent. At one point during cross-examination when the prosecutor asked about his choice of words, defendant testified: \"We didn't intend to rob them, just to get them to--rip them off of their money, get them to give it to us and take it.\" Asked what his intent was when the gun was used, he stated: \"Same intentions, take their money.\"\n\nWe see no possibility that the jury was unaware that drug- or alcohol- induced intoxication could afford a basis for a guilt phase verdict of lesser offenses, failed to understand that this reflected society's recognition of differing degrees of legal culpability, or failed to recognize that drug- and alcohol-induced intoxication could be considered in assessing defendant's culpability at the penalty phase.\n\n3. Standard of Proof.\n\nDefendant claims that the court erred in refusing to instruct the jury that before it could impose the death penalty it had to find beyond a\n\nreasonable doubt that aggravating factors outweighed mitigating and that death was the appropriate penalty. We have repeatedly rejected the argument that the reasonable doubt standard, one required when determining guilt and making factual determinations, is appropriate to assessing the penalty to be imposed in a capital case. (See, e.g., People v. Bacigalupo (1991) 1 Cal. 4th 103, 146 [2 Cal. Rptr. 2d 335, 820 P.2d 559]; People v. Gordon (1990) 50 Cal. 3d 1223, 1273-1274 [270 Cal. Rptr. 451, 792 P.2d 251]; People v. Jennings (1988) 46 Cal. 3d 963, 992 [251 Cal. Rptr. 278, 760 P.2d 475].)\n\nB. Evidence of Prior Criminal Conduct.\n\n1. Kathy Cusack.\n\nDefendant first claims that evidence of his attack on Kathy Cusack should have been excluded as more prejudicial than probative (Evid. Code, § 352), and as improper rebuttal. He also complains that introduction of evidence of criminal acts of which a defendant has not been convicted denies a fair trial since determination of guilt is made by the same jury that has already returned a verdict of guilty on the charges for which the defendant is on trial. Neither claim has merit.\n\nEvidence of prior assaultive conduct is expressly made admissible as a statutory aggravating factor by section 190.3, factor (b)--\"The presence ... of criminal activity by the defendant which involved the use or attempted use of force or violence or the express or implied threat to use force or violence.\" As such it is a matter which the state believes to be particularly relevant to the penalty decision. (People v. Jennings, supra, 46 Cal. 3d 963, 988; People v. Melton (1988) 44 Cal. 3d 713, 770 [244 Cal. Rptr. 867, 750 P.2d 741].) Therefore, while we recognize that the court has authority under Evidence Code section 352 to control the manner in which evidence of past criminal conduct is offered, it has no discretion to exclude all evidence related to a statutory sentencing factor. (People v. Douglas (1990) 50 Cal. 3d 468, 531 [268 Cal. Rptr. 126, 788 P.2d 640]; People v. Karis (1988) 46 Cal. 3d 612, 641, fn. 21 [250 Cal. Rptr. 659, 758 P.2d 1189].)\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The evidence was properly offered in rebuttal to defendant's attempt to persuade the jury that his violent acts were uncharacteristic and that he normally treated people with concern and respect. (People\n\nv. Rodriguez (1986) 42 Cal. 3d 730, 791-792 [230 Cal. Rptr. 667, 726 P.2d 113].)\n\nDefendant asserts that the mitigating evidence he offered to show that he was good to members of his family was limited to evidence of his conduct when he was not under the influence of drugs and that it was not offered as evidence that he was nonviolent or to demonstrate a character trait of being a nonviolent person. On that basis he argues that evidence of his prior assaultive conduct while under the influence of drugs was not proper rebuttal. We are not persuaded.\n\nThe prosecution may rebut mitigating character evidence with evidence related to the character trait raised by defendant. (People v. Mickle (1991) 54 Cal. 3d 140, 191 [284 Cal. Rptr. 511, 814 P.2d 290]; People v. Rodriguez, supra, 42 Cal. 3d 730, 792, fn. 24.) A number of witnesses testified to defendant's kind, loving, and compassionate behavior. A capital defendant who offers, as mitigating evidence relevant to whether he should live or die,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e evidence that he is a kind and considerate person may not restrict the scope of evidence offered to rebut that inference by arguing that he intended only to demonstrate that he was kind and considerate under limited circumstances or to particular people. Evidence that defendant violently assaulted a pregnant woman who was in bed and stabbed her several times even after being told of her condition was relevant and proper rebuttal to the evidence that he was a kind and considerate person.\n\nDefendant also makes a wide-ranging constitutional attack on introduction of evidence of unadjudicated criminal conduct, asserting, without elaboration, that he was denied due process and equal protection, that his\n\nright against self-incrimination was violated, that the presumption of innocence was infringed, that the right to confrontation was denied, and that the right to a reliable penalty determination was affected. He concedes that a due process-based claim was considered and rejected in People v. Balderas (1985) 41 Cal. 3d 144, 204-205 [222 Cal. Rptr. 184, 711 P.2d 480], in which we found no support in decisions of the United States Supreme Court for the suggestion that due process requires impanelment of a separate jury to determine the penalty in a capital case. We decline his invitation to reconsider our Conclusion that admission of unadjudicated criminal acts as aggravating factors is constitutionally permissible.\n\nWe also reject defendant's claim that admission of evidence of the attack on Cusack was error either because the prosecution failed to give notice, or because defendant was denied a continuance to enable him to prepare to defend against that evidence. The notice of aggravating evidence given by the People pursuant to section 190.3 prior to trial did not include this evidence, but section 190.3 expressly excludes rebuttal evidence from the notice requirement.\n\nDefendant did request a continuance in order to find witnesses (other than William Scofield) \"who would testify as to what really occurred that evening\" and in order to prepare for cross-examination of Cusack. He did not name the potential witnesses, however, and the prosecution's abortive effort to introduce Cusack's testimony earlier should have alerted counsel to the probability that she would be called as a rebuttal witness. Counsel was on notice that Scofield would be a witness, and any investigation of the 1978 events in which Scofield was attacked would have revealed \"what really occurred that evening.\"\n\nNotice that evidence will be presented regarding a specific prior crime or crimes should alert counsel that evidence of all crimes committed as part of the same course of conduct may be offered, and, therefore, substantially complies with the notice requirement of section 190.3. (People v. Cooper, supra, 53 Cal. 3d 771, 842.) Finally, the court did order that all police reports related to the 1978 incident, those about Scofield and Cusack, be delivered to counsel immediately, and she was not called until the following day. Under the circumstances, there was no abuse of discretion in denying the request for a continuance. The ruling is one that is committed to the sound discretion of the trial court. (People v. Ainsworth (1988) 45 Cal. 3d 984 [248 Cal. Rptr. 568, 755 P.2d 1017].)\n\nUnlike the situation in Lankford v. Idaho (1991) 500 U.S. [114 L.Ed.2d 173, 111 S.Ct. 1723] on which defendant relies, ample notice that the state\n\nwould seek the death penalty was given from the outset of this prosecution. Special circumstances were charged and the People gave notice of the aggravating evidence it intended to offer at the penalty phase. Defendant was not denied notice of the issue to be resolved at the penalty phase of the trial.\n\nNor does introduction of evidence of unadjudicated offenses threaten imposition of the death penalty on the basis of materially inaccurate evidence such as that considered by the jury in Johnson v. Mississippi (1988) 486 U.S. 578 [100 L.Ed.2d 575, 108 S.Ct. 1981]. There the only evidence offered to support an aggravating factor of prior conviction of a felony involving use or threat of violence was a copy of a prior commitment to prison. The judgment reflected in that commitment was subsequently set aside. The Supreme Court held that consideration of the invalid conviction was clearly prejudicial since no other evidence of aggravating circumstances was available, and created a risk that the sentence was imposed arbitrarily. Here there was no comparable risk. Evidence of the facts underlying the prosecution's claim that defendant had committed a prior violent crime was offered, and the jury was instructed that it could not consider that evidence unless defendant's commission of the acts was proved beyond a reasonable doubt.\n\n2. William Scofield.\n\nRelying on People v. Jackson (1985) 37 Cal. 3d 826 [210 Cal. Rptr. 623, 694 P.2d 736], and People v. Crowson (1983) 33 Cal. 3d 623 [190 Cal. Rptr. 165, 660 P.2d 389], defendant claims that it was error to permit Scofield to testify regarding the details of defendant's 1978 assault on him. Evidence of a prior felony conviction must be limited, he claims, to evidence of the minimal, or least adjudicated, elements of the prior offense to avoid the double jeopardy and speedy trial implications of litigating the truth of the past offense.\n\nDefendant concedes that no objection was made to the evidence. Moreover, we have rejected similar claims (see People v. Karis, supra, 46 Cal. 3d 612, 640; People v. Melton, supra, 44 Cal. 3d 713, 755-756; People v. Gates (1987) 43 Cal. 3d 1168, 1203 [240 Cal. Rptr. 666, 743 P.2d 301]), and are not persuaded that these decisions should be reconsidered. The presentation of evidence of past criminal conduct at a sentencing hearing does not place the defendant in jeopardy with respect to the past offenses. He is not on trial for the past offense, is not subject to conviction or punishment for the past offense, and may not claim either speedy trial or double jeopardy protection against introduction of such evidence. (People v. Melton, supra, 44 Cal. 3d 713, 756, fn. 17.)\n\n3. Evidence of Juvenile and Noncriminal Conduct.\n\nThe court instructed the jury to consider all of the evidence received at any phase of the trial. Defendant claims that as a result the jury was improperly permitted to consider evidence of nonviolent and juvenile offenses that otherwise would have been inadmissible at the penalty phase.\n\nNot only did defendant fail to request a limiting instruction, but his assumption that violent juvenile conduct was inadmissible is unwarranted. Section 190.3 permits consideration of \"other criminal activity by the defendant which involved the use or attempted use of force or violence or which involved the express or implied threat to use force or violence.\" Evidence of violent juvenile conduct is admissible under that section. (People v. Burton (1989) 48 Cal. 3d 843, 862 [258 Cal. Rptr. 184, 771 P.2d 1270]; People v. Lucky (1988) 45 Cal. 3d 259, 295 [247 Cal. Rptr. 1, 753 P.2d 1052].)\n\nEvidence of nonviolent criminal activity that did not result in a felony conviction is, as defendant claims, inadmissible as an aggravating factor. (People v. Burton, supra, 48 Cal. 3d 843, 862.) Here, however, the evidence that defendant now claims should not have been considered was evidence that he himself had introduced in support of his effort to establish that his criminal conduct was attributable to his use of drugs and that he was otherwise a loving, caring, nonviolent and law-abiding person. The court did limit consideration of the evidence by instructing the jury to consider the statutory factors (§ 190.3) in determining the penalty. Having introduced the evidence himself, defendant may not now complain that the jury might have concluded that the factor to which it was relevant was aggravating rather than mitigating. (People v. Williams, supra, 44 Cal. 3d 883, 957.)\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nC. Response to Jury Inquiries.\n\nDuring the second day of deliberation, the jury sent questions to the Judge asking:\n\n\"1. Can you give us a more explicit legal definition of the phrase 'extreme duress'?\"\n\nand\n\n\"2. Can you give us a more explicit legal definition of the phrase 'moral justification'?\"\n\nThe court responded in writing, signed with \"O.K.\" by both counsel, stating:\n\n\"The definition of the terms of which you inquire are [ sic ] self evident. These are not especially technical terms under the law and you are to construe these phrases in their common meaning. In other words, they mean what they say.\"\n\nNotwithstanding his attorney's approval of the response, defendant claims that it was inadequate since the response did not further define the terms and did not correct a misunderstanding which he claims was implicit in the inquiry as to the power of the jury to consider any factor calling for a sentence less than death even if not specifically enumerated in the statute. Even now, however, defendant does not suggest what more appropriate \"clarification\" might have been given. (See People v. Gonzalez (1990) 51 Cal. 3d 1179, 1227 [275 Cal. Rptr. 729, 800 P.2d 1159].)\n\nThe jury inquiry related to the court's instruction, in the language of section 190.3, advising the jury of the aggravating and mitigating factors which the jury should consider in determining the appropriate penalty. Section 190.3, factor (f) permits consideration of \"[w]hether or not the offense was committed under circumstances which the defendant reasonably believed to be a moral justification or extenuation for his conduct.\" Section 190.3, factor (g) permits consideration of \"[w]hether or not defendant acted under extreme duress or under the substantial domination of another person.\"\n\nAssuming the issue was preserved for appeal, there was no error. \"Claims of vagueness directed at aggravating circumstances defined in capital punishment statutes are analyzed under the Eighth Amendment and characteristically assert that the challenged provision fails adequately to inform juries\n\nwhat they must find to impose the death penalty and as a result leaves them and appellate courts with the kind of open-ended discretion which was held invalid in Furman v. Georgia, 408 U.S. 238 (1972).\" (Maynard v. Cartwright (1988) 486 U.S. 356, 361-362 [100 L.Ed.2d 372, 380, 108 S.Ct. 1853].) The statutory factor in Maynard v. Cartwright, supra, was that the murder be \"especially heinous, atrocious, or cruel.\" Those adjectives failed to give the jury adequate guidance since they suggested only that the individual juror was to determine if the murder was more than \"just heinous,\" and an ordinary person could believe that all unjustified, intentional taking of life was \"especially heinous.\" (486 U.S. at p. 364 [100 L.Ed.2d at p. 382].)\n\nFactors (f) and (g) of section 190.3, by contrast, are not \"aggravating circumstances\" comparable to those under consideration in Maynard v. Cartwright, supra, 486 U.S. 356, or Lewis v. Jeffers (1990) 497 U.S. 764 [111 L.Ed.2d 606, 110 S.Ct. 3092], on which defendant also relies. Neither is a \"special circumstance\" whose function in this state is to channel jury discretion by narrowing the class of defendants who are eligible for the death penalty. Under the California death penalty law an \"aggravating factor\" identifies a matter which the jury may consider in deciding whether a defendant who has already been found eligible for the death penalty should receive that punishment. \"[W]ith respect to the process of sentencing from among that class those defendants who will actually be sentenced to death, '[w]hat is important ... is an individualized determination on the basis of the character of the individual and the circumstances of the crime. [Citation.] It is not simply a finding of facts which resolves the penalty decision, ' \"but ... the jury's moral assessment of those facts as they reflect on whether the defendant should be put to death ....\" ' \" (People v. Brown, supra, 40 Cal. 3d 512, 540, italics omitted.) Consideration of statutory aggravating and mitigating factors as part of the jury's normative function of determining the appropriate punishment is, therefore, distinguishable from the factual determination made when the jury finds that a special circumstance allegation is true.\n\nNonetheless, the jury must \"be properly instructed regarding all facets of the sentencing process. It is not enough to instruct the jury in the bare terms of an aggravating circumstance that is unconstitutionally vague on its face.\" (Walton v. Arizona (1990) 497 U.S. 639, [111 L.Ed.2d 511, 528, 110 S.Ct. 3047, 3057].) This obligation undoubtedly extends to aggravating factors identified in section 190.3. Factors (f) and (g), however, are mitigating factors which call to the attention of the jury only two of an unlimited number of matters which the jury may consider as weighing against imposition of the death penalty. Moreover, these factors do not describe the relevant consideration solely in terms of vague and pejorative adjectives as\n\ndoes subdivision (a)(14) of section 190.2, the California equivalent of the \"heinous, atrocious, and cruel\" aggravating factor considered by the Supreme Court in Maynard v. Cartwright, supra, 486 U.S. 356. This court held subdivision (a)(14) invalid as an unconstitutionally vague special circumstance in People v. Superior Court (Engert) (1982) 31 Cal. 3d 797 [183 Cal. Rptr. 800, 647 P.2d 76], noting that none of the terms met \"the standards of precision and certainty required of statutes which render persons eligible for punishment, either as elements of a charged crime or as a charged special circumstance.\" (Id., at p. 802.)\n\nSection 190.3, factor (f) asks the jury to consider whether the defendant believed his act was morally justified, while factor (g) is predicated on duress, a noun whose meaning is generally understood as force or compulsion. \"Duress\" is modified by the word \"extreme,\" which has a meaning that is generally understood as describing the farthest end or degree of a range of possibilities. There is no comparable vagueness, and the defendant is further protected against possible arbitrary sentencing in that any mitigating evidence he offers must be considered by the jury.\n\nWe do not join defendant's assumption that the jury inquiry reflected confusion as to whether it could consider the evidence that defendant fired the gun in response to Hefner's command. It is highly improbable that a jury would consider that to be evidence of duress of any sort, and the jury had been expressly instructed that any factor offered in mitigation could be considered.\n\nInasmuch as no substantial evidence of duress, extreme or otherwise, and no evidence suggesting that defendant believed he was morally justified was offered, defendant suffered no prejudice from the failure of the court to respond differently.\n\nD. Double Counting of Aggravating Factors.\n\nDefendant complains that the court's instructions, tracking the statutory language of factors (a), (b), and (c) of section 190.3,\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e without further clarification, permitted the jury to consider some evidence under more than one of the factors, thus artificially inflating that evidence.\n\nThe \"prior convictions\" encompassed in factor (c) do not include the offenses of which the defendant had been convicted in the current proceeding (People v. Balderas, supra, 41 Cal. 3d 144, 201), and the circumstances of the current offenses which reflect violence and/or threats of violence are to be considered only under factor (a). Factor (b) relates to other unadjudicated criminal conduct. (People v. Miranda (1987) 44 Cal. 3d 57, 105-106 [241 Cal. Rptr. 594, 744 P.2d 1127].)\n\nThe jury was not told that it should or could \"double count\" or \"triple count\" evidence under these factors, however, and the court is not under a duty to instruct sua sponte that such consideration would be improper. (People v. Guzman (1988) 45 Cal. 3d 915, 966 [248 Cal. Rptr. 467, 755 P.2d 917].) Since the prosecutor did not mislead the jury, or suggest that the evidence be considered more damning because it related to more than one factor,\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e we do not agree that it is likely the jury overemphasized its importance.\n\nE. Age Factor.\n\nDefendant urges the court to reconsider our Conclusion in People v. Lucky, supra, 45 Cal. 3d 259, 302, that age-related matters suggested by the evidence and relevant to the penalty decision are not limited to consideration as mitigating evidence under factor (i) of section 190.3. He argues that, as defined by the court in Lucky, the age factor fails to offer guidance to the jury and invites arbitrary and capricious sentencing. This, he suggests, renders factor (i) unconstitutionally vague, and its use a violation of the Eighth and Fourteenth Amendments.\n\nLucky, supra, 45 Cal. 3d 259, and People v. Rodriguez, supra, 42 Cal. 3d 730, 789, make it clear, however, that chronological age alone may not be deemed aggravating. As long as neither the prosecutor in argument, nor the court in its instructions, suggests that age is to be considered aggravating, the jurors may determine the relevance, if any, of the defendant's age to the appropriate penalty. (People v. Hernandez (1988) 47 Cal. 3d 315, 362 [253 Cal. Rptr. 199, 763 P.2d 1289].) Permitting the jury to make this decision, as\n\npart of what we have described as the \"essentially normative task\" (People v. Allen (1986) 42 Cal. 3d 1222, 1287 [232 Cal. Rptr. 849, 729 P.2d 115]) of determining the appropriate penalty after weighing the evidence and applying its own moral standard, contravenes no constitutional principle.\n\nF. Proportionality.\n\nDefendant asks the court to undertake both intracase and intercase proportionality review, arguing that the death sentence imposed on him is arbitrary, discriminatory, and disproportionate under the due process, equal protection, and cruel and unusual punishment clauses of the United States and California Constitutions. He bases his claim on the evidence of his chemical dependency, the fact that Hefner did not receive the death penalty even though he was a full participant in the events, and his conviction of only one murder with no prior arrests for murder.\n\nNone of these considerations warrants reversal of the penalty under any of the theories proposed by defendant. \"Unless the state's capital punishment system is shown by the defendant to operate in an arbitrary and capricious manner, the fact that such defendant has been sentenced to death and others who may be similarly situated have not does not establish disproportionality violative of constitutional principles. (McCleskey v. Kemp (1987) 481 U.S. 279, 306-312 [95 L.Ed.2d 262, 287-291, 107 S.Ct. 1756, 1774- 1777]).\" (People v. McLain (1988) 46 Cal. 3d 97, 121 [249 Cal. Rptr. 630, 757 P.2d 569].)\n\nThe Conclusion of the jury that the intentional killing of Dykstra during a $70 robbery in which an attempt was made to kill a second victim in order to prevent identification, by a person who had in the past committed other drug-related violent assaults, warranted imposition of the death penalty is not aberrant and does not demonstrate arbitrary or capricious sentencing. The penalty cannot be deemed disproportionate to the offense.\n\nG. Motion for Modification (§ 190.4).\n\nDefendant argues that the trial court did not properly rule on his motion for modification of the verdict of death. He claims that the court's denial of the motion was arbitrary and erroneous, took into account improper considerations, and failed to recognize mitigating inferences, all in violation of his rights under the Sixth and Eighth Amendments.\n\nThe basis for these claims is an assertion that the court considered and referred to information contained in the probation report prior to ruling on\n\nthe motion, and failed to refer to evidence that might have been considered mitigating.\n\nA Judge should not consider the probation officer's report prior to ruling on a modification motion. In making that ruling the Judge is limited to consideration of the evidence that was before the penalty jury. (People v. Gonzalez, supra, 51 Cal. 3d 1179, 1238.) While the recitals of the Judge state only that the report had been reviewed prior to \"sentencing,\" that statement was made at the hearing in which the motion for modification was denied. The record supports defendant's assumption that the Judge had already reviewed the probation report when he denied the motion therefor.\n\nNonetheless the Judge set out in great detail the evidence on which he relied for his Conclusion that the aggravating factors \"overwhelmingly\" outweighed the mitigating. No mention of evidence other than that before the jury, and thus properly before the court, is made in the court's statement. The Judge stated expressly that he had considered all of the evidence that had been presented to the jury in making his determination of the proper penalty, and that this included the \"totality of the penalty phase evidence.\" We must assume, therefore, that the Judge considered only evidence that had been before the jury in making his ruling. (People v. Sully, supra, 53 Cal. 3d 1195, 1250; People v. Douglas, supra, 50 Cal. 3d 468, 539-540.) It is also clear that he was aware of, understood why the jury might have discounted, and did himself consider all of the potentially mitigating evidence.\n\nH. Validity of Death Penalty Law.\n\nDefendant asks the court to reevaluate the validity of the 1978 death penalty law, arguing that the constitutional requirements of a law which narrows the class of murderers eligible for the death penalty while avoiding arbitrary and capricious imposition are not satisfied. He concedes that the court has held that the narrowing function is satisfied notwithstanding the unavailability of intercase proportionality review, but argues that the breadth of prosecutorial discretion in exercising the charging function itself leads to arbitrary and capricious implementation of the law.\n\nThis argument is not supported by either empirical evidence or authority which suggests that the manner in which prosecutors exercise their discretion in seeking the death penalty in murder prosecutions in which special circumstances appear to be present is arbitrary. (People v. Keenan (1988) 46 Cal. 3d 478, 506 [250 Cal. Rptr. 550, 758 P.2d 1081].) It requires nothing more than a review of the facts of other cases recently before this court to refute defendant's speculation that prosecutors in other heavily populated\n\ncounties such as Los Angeles County would not seek the death penalty for murder committed in comparable circumstances. (See, e.g., People v. Fuentes (1991) 54 Cal. 3d 707 [286 Cal. Rptr. 792, 818 P.2d 75]; People v. Duncan (1991) 53 Cal. 3d 955 [281 Cal. Rptr. 273, 810 P.2d 131]; People v. Lewis, supra, 50 Cal. 3d 262.)\n\nDefendant also asks that we reconsider prior decisions (see People v. Sully, supra, 53 Cal. 3d 1195, 1250- 1251, and cases cited) upholding the 1978 death penalty law against challenges attacking the omission of requirements for written findings on the presence of aggravating factors; proof beyond a reasonable doubt of those factors; jury unanimity on aggravating factors; agreement beyond a reasonable doubt that aggravating outweigh mitigating factors, and that death is the appropriate penalty; additional procedures for appellate review of the sentencing decision; or a presumption in favor of life without parole.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e We decline the invitation.\n\nVII\n\nPROSECUTORIAL MISCONDUCT\n\nAcknowledging that no objections or requests for admonition were made on that basis, defendant claims that instances of prosecutorial misconduct occurring throughout the trial were so serious and pervasive that the trial court had a sua sponte duty which the Judge failed to assume to correct the abuse. He claims that the misconduct was so pervasive that he was denied a fair trial and that reversal is therefore required notwithstanding the failure to properly preserve the issue for appeal.\n\nA defendant who does not object and seek an admonition to disregard improper statements or argument by the prosecutor is deemed to have waived any error unless the harm caused could not have been corrected by appropriate instructions. (People v. Bell, supra, 49 Cal. 3d 502, 547; People v. Green, supra, 27 Cal. 3d 1, 34.) Because we do not expect the trial court to recognize and correct all possible or arguable misconduct on its own motion (People v. Bell, supra, 49 Cal. 3d 502, 542; People v. Adcox (1988) 47 Cal. 3d 207, 261 [253 Cal. Rptr. 55, 763 P.2d 906]; People v. Poggi (1988) 45 Cal. 3d 306, 335-336 [246 Cal. Rptr. 886, 753 P.2d 1082]), defendant bears the responsibility to seek an admonition if he believes the prosecutor has overstepped the bounds of proper comment, argument, or inquiry.\n\nDefendant claims the prosecutor acted improperly in a variety of ways--by comments designed to appeal to the fears and prejudices of the\n\njurors, by casting aspersions on the defense case with accusations of perjury and deceit, and by inviting consideration of irrelevant issues and facts not supported by the evidence. Much of the conduct on which he relies for these claims cannot reasonably be characterized in that manner, however.\n\nDefendant complains in particular that the prosecutor attempted to impeach his credibility by asking if defendant had changed his appearance because he was to appear before the jury. This, he suggests, was an appeal to passion and prejudice, but People v. Kirkes (1952) 39 Cal. 2d 719, 724 [249 P.2d 1], on which he relies, hardly supports that argument. In Kirkes the prosecutor, stating facts not in evidence, had asserted personal knowledge of the defendant's guilt, implied he would not have prosecuted had he not believed in the defendant's guilt, and pictured the defendant as a person who would kill again to cover his crime and prevent witnesses from testifying. While we may question the relevance of defendant's possibly improved appearance to assessing his veracity, the misconduct, if any, in the line of questioning could easily have been cured by an admonition had an objection been made.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nDefendant next complains that rather than challenging the qualifications of defendant's expert, Dr. Broussard, the prosecutor attempted to denigrate the value of the results of tests performed on defendant by referring to some as \"little squiggles\" that gave some insight into defendant's personality,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e and asking with regard to the Rorschach test that the expert \"tell the jury what it was about any of those ink blots and his responses that cause you to go back 25 years in his life and say he had a problem with his mother.\" The prosecutor also asserted in cross-examining the expert that \"anybody can call themselves a forensic psychologist, right,\" and asked if \"the problem you have with this crime [is] the fact that he was apprehended so easily.\"\n\nIn further cross-examination the prosecutor questioned Dr. Broussard about \"the Rosenhan\" study, with which the expert was not acquainted,\n\ndefendant's extrajudicial statements and his testimony at trial, the prosecutor asking questions that were assertions of fact or Conclusions reached in that study, the import of which was that psychiatrists are unable to accurately diagnose schizophrenia and paranoia. The study itself was not introduced.\n\nReferring to a similar attempt to impeach an expert on the basis of the same study, the Court of Appeal held that overruling an objection to the questioning was patent error. \"It consists mainly in the prosecutor's having insinuated by his questions that half of all mental illness is feigned, and that the 'test'--whatever it is or may be--was--again in the prosecutor's opinion--settled and irrefutable. In fact, all of these assumptions were and are extremely dubious. Further, it is error to permit the use of professional studies not relied upon by an expert in the formulation of his opinion. (Evid. Code, § 721, subd. (b).) To allow their use would be to circumvent the hearsay rule.\" (People v. Criscione (1981) 125 Cal. App. 3d 275, 286 [177 Cal. Rptr. 899], fn. omitted.)\n\nWe agree that the manner in which the prosecutor cross-examined Dr. Broussard was improper in these instances. The misconduct here was more egregious than that considered by the Court of Appeal in Criscione, supra, 125 Cal. App. 3d 275, because the expert in that case was familiar with the Rosenhan study. It is proper to question an expert about matter on which the expert bases his or her opinion and on the reasons for that opinion. A party attacking the credibility of the expert may bring to the jury's attention material that is relevant to the issue of which the expert was unaware (People v. Bell, supra, 49 Cal. 3d 502, 532), but that party may not by its questions testify regarding the content of that material.\n\nThe questions and statements identified by defendant as misconduct make up only a small part of the cross-examination of the witness, one which is reflected in more than 100 pages of reporter's transcript. The complete examination of the witness covered 175 pages of transcript. Proper questions elicited a concession by the expert that there was a very good possibility that if 50 psychologists reviewed the same test results they would not be unanimous in their opinions. Clearly, an admonition to the prosecutor and to the jury would have cured any prejudice from the improper conduct.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nWe see no misconduct in that part of the prosecutor's penalty phase argument in which, addressing inconsistencies between defendant's\n\nextrajudicial statements and his testimony at trial, the prosecutor accused defendant of lying. Comment based on a reasonable inference drawn from the evidence is not improper even when the inference is that a witness has lied.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nSimilarly, we cannot accept defendant's characterization of the prosecutor's reference to evidence which the trial court had admitted as \"misconduct,\" an argument based on defendant's appellate claim that the trial court erred in permitting the jury to consider evidence of his misdemeanor, juvenile, and nonviolent offenses at the penalty phase. We have rejected defendant's argument that this evidence was erroneously admitted or considered.\n\nThe suggestion that argument based on evidence that has been admitted is misconduct would fail even were we to conclude that the admission of the evidence was error. Regardless of whether an appellate court may later conclude that a piece of evidence was erroneously admitted, argument directed to the evidence does not become misconduct by hindsight. Such references may be considered in determining the prejudicial effect of the error in admitting evidence, but are not misconduct.\n\nDefendant also cites as misconduct the prosecutor's statement in his penalty phase argument that Hefner had never been arrested or convicted. The statement was made in the context of assessing whether mitigation should be found under section 190.3, factor (g) on the basis of duress by Hefner. The prosecutor was responding to defendant's attempt to shift principal responsibility for the robbery-murder to Hefner. In argument the prosecutor stated to the jury that \"you have a picture of [Hefner]. No prior record; never been arrested; never been convicted; 18 years old.\"\n\nThis was not, as defendant argues, an improper means of putting before the jury damaging facts that were not in evidence. Defendant himself had testified that as far as he knew Hefner had not been to prison or arrested for any crimes of violence. The prosecutor misspoke when he said that Hefner had never been arrested. Defendant had testified that Hefner told him he had\n\nbeen arrested. Again, however, had defendant objected this discrepancy could easily have been clarified by the court.\n\nNor was it misconduct for the prosecutor to anticipate the instructions on lesser included offenses which the court would give by arguing that those instructions were required by law and did not indicate that the court necessarily believed that the instructions applied. A prosecutor is entitled to argue that the evidence shows beyond a reasonable doubt commission of the charged offenses, and that it does not support only a lesser included offense. We see no impropriety in this context to a statement that the fact that instructions are given on lesser offenses should not be understood by the jury as reflecting the view of the court as to the sufficiency of the evidence to support conviction of the charged offense. That argument is fully consistent with the standard instructions which the Judge gave the jury, advising the jury that he did not intend by anything he said to suggest how the jury should find on any question; and that the jury was to determine whether some of the instructions were applicable; and that \"you must not conclude from the fact that an instruction has been given that the court is expressing any opinion as to the facts.\"\n\nThe remaining citations of misconduct fall into similar categories--attacking hyperbole in argument, or possibly questionable comments that were sufficiently innocuous that an admonition could easily have cured any harm.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Neither these comments, nor any of those discussed above that might arguably have been misconduct, were such as to deny the defendant a fair trial, divert the jury from its proper role, or invite an irrational, purely subjective response. (See People v. Lewis, supra, 50 Cal. 3d 262, 284.)\n\nVIII\n\nJUDGMENT\n\nThe judgment is affirmed in its entirety.\n\nLucas, C. J., Panelli, J., Kennard, J., Arabian, J., and George, J., concurred.\n\nDisposition\n\nThe judgment is affirmed in its entirety.\n\nI Dissent.\n\nEx proprio motu, I would raise--and resolve in the affirmative--the question whether Roger James Agajanian, who served as counsel in the trial court, provided defendant with ineffective assistance in violation of his rights under the Sixth Amendment to the United States Constitution and article I, section 15, of the California Constitution.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAgajanian's deficiencies as trial counsel were pervasive and serious. The point is established by the record. It is confirmed by the majority opinion's practically countless references to waiver. Examples of Agajanian's failings are hard to select, each competing with the rest for egregiousness. By way of illustration only, I note the following. At the guilt phase, Agajanian relied on the defense of diminished capacity. Much to the surprise he expressed at trial, this defense had previously been abolished and rendered a nullity for all relevant purposes. At the penalty phase, Agajanian presented a summation asking the jury to spare defendant's life. The argument he made in support was worthless. The majority is generous in describing the remarks as \"a rambling discourse, not tied to particular evidence.\" (Maj. opn., ante, at p. 82, fn. 45.)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAgajanian's deficiencies at trial compel this Conclusion: his failings resulted in a breakdown of the adversarial process at trial; that breakdown establishes a violation of defendant's federal and state constitutional right to the effective assistance of counsel; and that violation mandates reversal of the judgment even in the absence of a showing of specific prejudice. (See United States v. Cronic (1984) 466 U.S. 648, 653-662 [80 L.Ed.2d 657, 664-670, 104 S.Ct. 2039] [speaking of the federal constitutional guaranty only]; People v. Ledesma (1987) 43 Cal. 3d 171, 242-245 [233 Cal. Rptr. 404, 729 P.2d 839] (conc. opn. of Grodin, J.) [speaking of both the federal and state constitutional guaranties].)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\n\"The very premise of our adversary system of criminal Justice is that partisan advocacy on both sides of a case will best promote the ultimate objective that the guilty be convicted and the innocent go free.\" (Herring v.\n\nNew York (1975) 422 U.S. 853, 862 [45 L.Ed.2d 593, 600, 95 S.Ct. 2550]; accord, United States v. Cronic, supra, 466 U.S. at p. 655 [80 L.Ed.2d at p. 665].) In other words, \"The system assumes that adversarial testing will ultimately advance the public interest in truth and fairness.\" (Polk County v. Dodson (1981) 454 U.S. 312, 318 [70 L.Ed.2d 509, 516, 102 S.Ct. 445].) It follows that the system requires \"meaningful adversarial testing.\" (United States v. Cronic, supra, 466 U.S. at p. 656 [80 L.Ed.2d at p. 666].) \"When\"--as here--\"such testing is absent, the process breaks down and hence its result must be deemed unreliable as a matter of law.\" (People v. Bloom (1989) 48 Cal. 3d 1194, 1237 [259 Cal. Rptr. 669, 774 P.2d 698] (conc. \u0026 dis. opn. of Mosk, J.); see United States v. Cronic, supra, 466 U.S. at p. 659 [80 L.Ed.2d at p. 668]; see also Rose v. Clark (1986) 478 U.S. 570, 577-578 [92 L.Ed.2d 460, 470-471, 106 S.Ct. 3101] [to similar effect].)\n\nFor the foregoing reasons, I would reverse the judgment in its entirety.\n\nAppellant's petition for a rehearing was denied April 29, 1992. Mosk, J., was of the opinion that the petition should be granted.\n\n\u003cspan class=\"fn\"\u003e1. All statutory references herein are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Hefner was tried separately, convicted of the same offenses, and sentenced to life in prison without possibility of parole. The People did not seek the death penalty for Hefner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. All alcohol and drug tests of Dykstra's blood were negative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendant testified that Hefner was younger. He was not sure of Hefner's age, but believed him to have been 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In his guilt phase testimony, defendant claimed that the 1978 incident occurred when two men who had a problem with his roommate, Doug Favello, kicked in the door of the apartment he shared with Favello, ran in, and cut Favello's throat. A third person with a gun remained at the door. Defendant testified that he picked up the knife dropped by the person who had stabbed Favello, ran after the fleeing intruders, and stabbed the one who had slashed Favello's throat just as that person (Scofield) was trying to enter his own room. On cross-examination defendant conceded that he and several friends went to Scofield's room later that night, denied that they had kicked in the door to that room or that anyone had been in bed in the room, and denied seeing, let alone stabbing, a woman who had been in the room. Evidence was offered by the People during the penalty phase to establish that Favello had not been injured during the initial confrontation, that defendant and others had broken into the room occupied by Scofield and his friend Kathy Cusack, and that defendant had stabbed Cusack several times.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant had told police that he was \"loaded up on crank,\" or methamphetamine.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Cusack testified that she was, in fact, four months pregnant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The entire colloquy is set out below: \"Mr. Agajanian [defense counsel]: Your Honor, there's one other matter I'd like to address the court on. I'd like to make a motion under 730 with respect to an examination of Mr. Visciotti on the criteria of 1026 and 1368 and ask it be kept confidential. I'd ask two doctors be appointed. \"The Court: All right. Do you have any preference for any doctors? \"Mr. Agajanian: I would request Dr. Seawright Anderson. \"Mr. Goethals [deputy district attorney]: And I told Mr. Agajanian I'd ask for Dr. Sharma. \"The Court: All right. Doctors Seawright Anderson and Dr. Sharma will be appointed pursuant to section 730 of the Evidence Code, and will be requested to conduct the examination based on 1026 and 1368, and the results of those to be confidential.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Evidence Code section 730 authorizes the appointment of experts when it appears to the court that \"expert evidence is or may be required by the court or by any party to the action.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendant does not argue that he was incompetent or that it appears as a matter of law from the record that he was incompetent, thus obligating the court to order a section 1368 hearing. (Cf. People v. Gomez (1953) 41 Cal. 2d 150 [258 P.2d 825].) He seeks reversal only on the ground that the court expressed doubt as to his sanity and did order such a hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Article I, section 16 of the California Constitution: \"Trial by jury is an inviolate right and shall be secured to all, ... A jury may be waived in a criminal cause by the consent of both parties expressed in open court by the defendant and the defendant's counsel. ...\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Code of Civil Procedure section 197, as it presently reads, implements the state policy of random selection: \"(a) All persons selected for jury service shall be selected at random, from a source or sources inclusive of a representative cross-section of the population of the area served by the court,\" while Code of Civil Procedure section 198, directs: \"(a) Random selection shall be utilized in creating master and qualified jurors lists ....\" Code of Civil Procedure section 194, subdivision (l), defines \"random\": \" 'Random' means that which occurs by mere chance indicating an unplanned sequence of selection where each juror's name has substantially equal probability of being selected.\" At the time of this trial, former section 246 of the Code of Civil Procedure provided: \"... The court shall select jurors from [the] panel for the voir dire process in a manner to insure random selection.\" Code of Civil Procedure section 222 now provides: \"(a) Except as provided in subdivision (b), when an action is called for trial by jury, the clerk, or the Judge where there is no clerk, shall randomly select the names of the jurors for voir dire, until the jury is selected or the panel is exhausted. \"(b) When the jury commissioner has provided the court with a listing of the trial jury panel in random order, the court shall seat prospective jurors for voir dire in the order provided by the panel list.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The court made the following proposal: \"I was hoping that we could come up with a list of 20 prospective jurors that each of you would find acceptable and hopeful that we could arrive at a stipulation with the People and the defense, the defendant personally waiving his right to a secret-at-random selection of jurors, depending on the court's matching up specific jurors that fall onto both lists that the attorneys would provide me with. \"If you will do that, I'll assure counsel that I will not share the list of one attorney with the other, so it will eliminate any fear of gamesmanship. \"Additionally, if we follow that process, it might cause us to be able to pick a jury much more quickly. It might be beneficial to both sides. \"It certainly would be beneficial to the court in saving time. \"Secondly, the court would, in no way, preclude either counsel in any way from inquiring of those that were selected by a non-random secret ballot. \"And further, as soon as the first 12 are seated, I would agree that there should be no additional wavering from the at-random secret process of selecting.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The state policy enunciated in the statutes mandating random draw reflects concern \"that all qualified persons have an equal opportunity ... to be considered for jury service in the state and an obligation to serve as jurors when summoned for that purpose ....\" (Code Civ. Proc., § 191.) The rights of prospective jurors are not before us in this appeal, however. We consider only whether the procedure ensured a fair trial at which the defendant's fundamental constitutional rights were protected. (See People v. Harris (1989) 47 Cal. 3d 1047, 1071 [255 Cal. Rptr. 352, 767 P.2d 619].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We also reject defendant's argument that excusing jurors for hardship denied him a representative jury. (People v. Thompson (1990) 50 Cal. 3d 134, 157-158 [266 Cal. Rptr. 309, 785 P.2d 857].) He fails to demonstrate how a panel from which persons have been excused for hardship reasons is less representative. Code of Civil Procedure section 204, subdivision (b), now expressly permits such excusals, and they are to be granted only on a sufficient showing that the individual circumstances of the prospective juror make it unreasonably difficult for the person to serve or that hardship to the public will occur if the person must serve in the particular case. Defendant makes no effort to identify any cognizable sector of the population that was underrepresented as a result of hardship excusals granted in this case, or to demonstrate that the trial court abused its discretion in granting any particular hardship excuse (to most of which defendant stipulated). Moreover, as we have observed elsewhere, there is no authority for the proposition implicit in this argument that disparity which results notwithstanding the application of neutral and presumptively constitutionally permissible jury selection criteria, including discretionary hardship excuses, is a product of the \"systematic exclusion\" which the Constitution forbids. (See People v. Bell (1989) 49 Cal. 3d 502, 530 [262 Cal. Rptr. 1, 778 P.2d 129].) We agree with defendant that some jurors were excused unnecessarily because they expressed reluctance to sit on the case. The Judge offered to excuse jurors who, having thought about the case, \"would rather not sit on this case for any reason.\" Some jurors expressed a preference not to remain. As defendant concedes, however, all of those prospective jurors were removed either by stipulation, by prosecutorial peremptory challenge, or, in one instance without objection by the defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The question to be resolved under Witherspoon and its progeny is whether the juror's views about capital punishment would prevent or impair the juror's ability to return a verdict of death in the case before the juror. The impact the juror's views might have in actual or hypothetical cases that are not before the juror are irrelevant to that determination. (People v. Fields (1983) 35 Cal. 3d 329, 357 [197 Cal. Rptr. 803, 673 P.2d 680].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We will not presume, even assuming arguendo that the voir dire exceeded proper limits of inquiry, that counsel should have done so. He may well have believed that this method of acquainting jurors with the evidence they were to hear would blunt its eventual impact. Having been forewarned, conditioned, or \"indoctrinated,\" the jurors would not find the circumstances of the crime as shocking as they might otherwise. Because a reviewing court is unable to ascertain the reasoning of trial counsel from the appellate record, a Conclusion that a failure to object reflects incompetence is unwarranted. Unlike the Dissent, we believe the rule of People v. Pope (1979) 23 Cal. 3d 412 [152 Cal. Rptr. 732, 590 P.2d 859] is sound and must be followed here. \"Where the record does not illuminate the basis for the challenged acts or omissions, a claim of ineffective assistance is more appropriately made in a petition for writ of habeas corpus.\" (23 Cal. 3d at p. 426.) Here, of course, defendant has not challenged the competence of trial counsel in his appeal. While he has properly reserved that claim, the Dissenting Justice raises it \"ex proprio motu,\" i.e., of his own accord, and would reverse the judgment on an issue neither raised nor briefed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Defendant suggests that an objection would have been futile because the Judge participated in part of the voir dire to which he now objects. He also claims that the magnitude of the \"error\" is such that it is reversible per se, faulting the Judge for failing to carry out the court's independent duty to ensure the fair selection of an impartial jury. Among the inquiries which defendant identifies as improper were questions asked by defense counsel in an effort to convince jurors reluctant to impose the death penalty that there might be circumstances in which they would vote for death. These inquiries were not improper. At the time of this trial both court and counsel could reasonably believe that excusal of a prospective juror for cause related to scrupled opposition to the death penalty was permissible only if he or she would \"automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case before them.\" (Witherspoon v. Illinois, supra, 391 U.S. 510, 522, fn. 21 [20 L.Ed.2d 776, 785] italics omitted; People v. Lanphear (1980) 26 Cal. 3d 814, 840 [163 Cal. Rptr. 601, 608 P.2d 689].) The questions reflect an attempt to retain reluctant jurors, a purpose to which defendant can have no legitimate objection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Defendant contends that the court should have excluded McKay's testimony as irrelevant on its own motion. For the reasons stated we do not agree with the assumption that this testimony was irrelevant. Nor is the issue preserved for appeal. While a court may exercise such authority under Evidence Code section 352 (People v. Hall (1986) 41 Cal. 3d 826, 834- 835 [226 Cal. Rptr. 112, 718 P.2d 99]; People v. Jackson (1971) 18 Cal. App. 3d 504, 509 [95 Cal. Rptr. 919]), the failure to so act cannot be urged on appeal as error. Neither this court, nor defendant, can avoid the command of Evidence Code section 353, that \"A verdict ... shall not be set aside, nor shall the judgment or decision based thereon be reversed, by reason of the erroneous admission of evidence unless: \"(a) There appears of record an objection to or a motion to exclude or to strike the evidence ....\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. This argument was directed to the prosecutor's emphasis on the evidence that impeached defendant's testimony that although he had been convicted on a plea of guilty of the stabbing of Scofield, he had been acting in self-defense. The prosecutor referred to defendant's denials that the door had been kicked in, that more than one person had been in the room, and that a second person had been stabbed. He then reminded the jury of the photographs of the crime scene depicting the door and the blood on both the bed and the floor. Finally he stated: \"I asked the defendant, are you sure there wasn't a girl there that night? Are you sure about that? Are you sure you didn't stab somebody else?\" and \"Kathy Cusack, the woman who didn't exist in the defendant's story, was stabbed seven times.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We recently affirmed that \"the prosecutor has a wide-ranging right to discuss the case in closing argument. He has the right to fully state his views as to what the evidence shows and to urge whatever Conclusions he deems proper. Opposing counsel may not complain on appeal if the reasoning is faulty or the deductions are illogical because these are matters for the jury to determine. [Citation.] The prosecutor may not, however, argue facts or inferences not based on the evidence presented.\" (People v. Lewis (1990) 50 Cal. 3d 262, 283 [266 Cal. Rptr. 834, 786 P.2d 892].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. At the Conclusion of the interview during which defendant confessed, the interrogating officer asked defendant: \"Would there be any problem with you in doing re-enactment of what happened last night. ... We'll do it in video and take the cameras out, our cameras, for--for investigative purposes, out taking pictures of you and explaining what happened as things went along.\" Defendant asked, \"Yeah, at the scene of the crime?\" and then stated: \"Sure, I guess I wouldn't mind doing it.\" Asked twice after that if this would \"be a problem\" for him, defendant twice replied, \"No,\" adding, \"I'll do it\" the second time. At the Santiago Canyon site, defendant was given a general warning by Officer Sidebotham: \"John, do you realize that anything you say is being video tape recorded?\" to which defendant replied, \"Yes, sir.\" Sidebotham then reminded defendant: \"And that Investigator Coder and Investigator Heacock previously advised you of your constitutional rights and that you waived those rights. ... Do you still want to waive these rights?\" Defendant replied again, \"Yes, sir.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Section 25, subdivision (a) provides: \"The defense of diminished capacity is hereby abolished. In a criminal action, as well as any juvenile court proceeding, evidence concerning an accused person's intoxication, trauma, mental illness, disease, or defect shall not be admissible to show or negate capacity to form the particular purpose, intent, motive, malice aforethought, knowledge, or other mental state required for the commission of the crime charged.\" As amended by Statutes 1981, chapter 404, section 2, pages 1591-1592, and Statutes 1982, chapter 893, section 2, pages 3317-3318, section 22 provides: \"(a) No act committed by a person while in a state of voluntary intoxication is less criminal by reason of his having been in such condition. Evidence of voluntary intoxication shall not be admitted to negate the capacity to form any mental states for the crimes charged, including, but not limited to, purpose, intent, knowledge, premeditation, deliberation or malice aforethought, with which the accused committed the act. \"(b) Evidence of voluntary intoxication is admissible solely on the issue of whether or not the defendant actually formed a required specific intent, premeditated, deliberated, or harbored malice aforethought, when a specific intent crime is charged. \"(c) Voluntary intoxication includes the voluntary ingestion, injection, or taking by any other means of any intoxicating liquor, drug, or other substances.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The jury made a special finding that the murder was intentional.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Defendant claims the court refused to instruct on voluntary manslaughter. The record confirms that two instructions on manslaughter were given. In the first, the court did not define voluntary manslaughter. \"The crime of manslaughter is the unlawful killing of a human being without malice aforethought. \"Involuntary manslaughter is the unlawful killing of a human being without malice aforethought and without an intent to kill.\" The court also instructed: \"The distinction between murder and manslaughter is that murder requires malice while manslaughter does not. ... If you are satisfied beyond a reasonable doubt that the killing was unlawful, but you have reasonable doubt whether the crime is murder or manslaughter, you must give the defendant the benefit of such doubt, and find it to be manslaughter rather than murder.\" The jury found under properly given instructions that the murder was intentional, and was committed in the perpetration of robbery, thus establishing that the killing was murder of the first degree under the felony-murder rule and section 189 without the necessity of proving malice. Any error in failing to instruct on voluntary manslaughter was harmless. (People v. Sedeno (1974) 10 Cal. 3d 703, 721 [112 Cal. Rptr. 1, 518 P.2d 913]. See also People v. Saille (1991) 54 Cal. 3d 1103, 1114 [2 Cal. Rptr. 2d 364, 820 P.2d 588] [Malice shown whenever killing is intentional unless negated by evidence of sudden quarrel or heat of passion].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant claims that these instructions, \"diminished capacity\" instructions, were given erroneously. The instructions could only have been beneficial to him, however, since they permitted the jury to speculate whether the evidence indicated that he lacked the capacity to harbor the relevant mental states, while the other instructions limited the jury to determining whether, in fact, the mental elements of the offenses were present.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In an attempt to establish prejudicial error in the instruction, defendant claims that these instructions, coupled with the omission of a voluntary manslaughter instruction, prevented the jury from considering whether he intended to kill, but did not do so unlawfully because of some provocation spurred by drug use or impulse. Defendant acknowledges that the robbery verdict undercuts this argument, but claims that inadequate instructions make the jury finding of intent to rob \"suspect.\" We are not persuaded. Defendant's own statements establish beyond any question the existence of an intent to rob.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The court gave only a general instruction on the elements of attempt. This was followed by instructions on the elements of murder and defining express and implied malice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Anticipating the instructions to be given, the prosecutor stated: \"The second crime charged is attempted murder. It's a very simple concept. It applies just to the top part of that diagram [outlining the elements and theories of first degree murder]. \"Basically it says you attempt, attempt to unlawfully kill another human being with express malice aforethought, in other words, you attempt to kill and you do something with the intent to kill, you try to kill, but for one reason or another you're unsuccessful, that's attempted murder.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Defendant also claims that his waiver of the right to be present throughout the voir dire of prospective jurors was ineffectual, that reversal should also be granted because he was absent during Discussions in chambers between the Judge and counsel regarding instructions and moving admission of exhibits. Our Conclusion above that neither section 977 nor constitutional authority supports defendant's claim that the voluntary absence of a defendant during some proceedings, even in a capital case is impermissible, disposes of this claim as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Defendant apparently concedes that jury unanimity on the theory of first degree murder is not required. (See Schad v. Arizona (1991) 501 U.S. , [115 L.Ed.2d 555, 572-574, 111 S.Ct. 2491, 2503-2504 (plur. opn.), 2506-2507, conc. opn. of Salia, J.)]; People v. Milan (1973) 9 Cal. 3d 185, 194-195 [107 Cal. Rptr. 68, 507 P.2d 956]; People v. Nicholas (1980) 112 Cal. App. 3d 249, 273 [169 Cal. Rptr. 497].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In support of his claim that the jury was misled, defendant also points to statements and questions by both the Judge and the prosecutor during the voir dire which may have led prospective jurors to believe that assessment of the penalty was a mechanical process which they would be obligated to carry out. The prosecutor's explanation to the jurors in the penalty phase argument, coming weeks after the voir dire, and immediately before the matter was submitted to the jury, was unquestionably adequate to dispel any misunderstanding of their role these statements and questions may have invited. The voir dire statements by the Judge anticipated the \"unadorned\" instruction given later. Explaining the penalty phase procedure, the Judge told the prospective jurors, inter alia, that if the \"evidence of mitigating factors, that is, factors that are beneficial to the defense side, outweigh the aggravating factors, your duty is to come back with a verdict of the mitigated sentence, that is, life without possibility of parole. \"If the aggravating factors, in your judgment, outweigh the mitigating factors, the aggravating factors being that evidence that is bad, or goes to the detriment of the defendant, or damning in nature as far as the defendant is concerned, if that outweighs the mitigating factors, your responsibility is to come back with a verdict of death.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Pursuant to agreement by counsel, the court's instruction on this factor supplemented the statutory language with: \"or any factor offered by the defense as a factor in mitigation of the penalty,\" thus making it clear that the jury could consider any mitigating evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In support of his claim that the jury was misled, defendant argues that the prosecutor also argued that the absence of some statutory mitigating factors should be considered aggravating. After the trial of this case we held in People v. Davenport (1985) 41 Cal. 3d 247, 289-290 [221 Cal. Rptr. 794, 710 P.2d 861], that such argument was improper and should not be permitted in the future because it was likely to confuse the jury as to the meaning of the terms \"aggravation\" and \"mitigation.\" It is not improper, however, to review each factor and the possible relevance of the evidence to finding it present. The prosecutor's argument in this case followed a permissible pattern of review. He used the absence of a factor as a springboard from which to launch his Discussion of the evidence which precluded finding the factor to be present. In the instances relied on by defendant to establish \" Davenport error,\" the context made it clear that he was relying on the aggravating nature of the evidence, not the absence of a mitigating factor, in his attempt to persuade the jury that death was the appropriate penalty. Thus, in commenting on factor (e)--\"[w]hether or not the victim was a participant in the defendant's homicidal conduct or consented to the homicidal act\"--(§ 190.3, factor (e)), the prosecutor emphasized that the victims were lured to the scene. \"The defendant lied ... they didn't have anything to do with what happened that day. That's an aggravating factor. If it applies again--maybe you don't think that applies, but if anything it's an aggravating factor.\" The prosecutor left categorization of age (§ 190.3, factor (i)) to the jury, stating only it was not mitigating and that the jury \"may think it isn't a big deal, or it's an aggravating factor.\" As to section 190, factor (j)--\"[w]hether or not the defendant was an accomplice to the offense and his participation in the offense was relatively minor,\"--the prosecutor said that because defendant was the \"triggerman\" the factor could not help him. \"That's an aggravating factor.\" Again, the reference was to the evidence that defendant personally shot the victims, not to the absence of section 190, factor (j), as the aggravating consideration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Defendant's counsel told the jury that in addition to the statutory factors \"we have in addition ... any other factor that you think is relevant in considering whether or not this case should be mitigated. We also have one that is not listed there. You may consider pity or sympathy for the particular defendant, so we have a lot of different factors to consider.\" Counsel did not argue that any statutory mitigating factor was present. He adopted a different tactic, conceding that the jury could find that all of the possibly aggravating factors were present, and none of the mitigating. His approach was to note the tragedy and the impact of the murder victim's death on other people, and to ask the jury not to add to the tragedy or cause others to suffer the same impact by condemning defendant to death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Defendant's reliance on People v. Harvey (1979) 25 Cal. 3d 754 [159 Cal. Rptr. 696, 602 P.2d 396], for his further claim that the plea bargain in which he pleaded guilty to the assault with a deadly weapon on Scofield precludes consideration of the attack on Cusack in this proceeding, is misplaced. We held there that it would be unfair to permit a court to consider the facts underlying counts dismissed in a plea bargain in sentencing for the charge to which the defendant had pleaded guilty. We reasoned that absent a contrary agreement it was implicit in such a bargain \"that defendant will suffer no adverse sentencing consequences by reason of the facts underlying, and solely pertaining to, the dismissed count.\" (Id., at p. 758.) The sentence to which we referred, however, was the sentence then being imposed. Nothing in Harvey, supra, 25 Cal. 3d 754, precludes consideration of all incidents of assaultive conduct in sentencing for subsequent offenses, including capital sentencing, whether or not the defendant has been charged with those offenses, or had them dismissed in a bargained-for Disposition of other charges. (People v. Robertson, supra, 48 Cal. 3d 18, 47; People v. Melton, supra, 44 Cal. 3d 713, 755.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Defendant's reliance on Evidence Code section 1102 is misplaced. That section permits the prosecution to introduce evidence of a trait of character \"in the form of an opinion or evidence of his reputation\" in order to rebut evidence the defendant has offered to prove the defendant's \"conduct in conformity with such character or trait of character.\" The relevance of evidence of character or a character trait to the penalty determination in a capital case is not whether the defendant acted in conformity with a character trait, but whether the defendant's character or character trait should be considered a mitigating factor. Therefore, whether prosecution evidence is proper rebuttal must be determined in the peculiar circumstance of a penalty trial, not under Evidence Code section 1102.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The prosecutor did refer to the evidence of defendant's prior criminal conduct, stating that it reflected a person \"with a fairly aggravated background,\" but he did so in arguing that the testimony by members of defendant's family did not accurately portray his character, and that the jury was not being asked to impose the death sentence on a person who had only \"one bad day in his 25 years.\" In his subsequent Discussion of the factors the jury was to consider he did not argue that this evidence was aggravating under any of the factors. One reference to defendant's juvenile record was in the prosecutor's Discussion of section 190.3, factor (i)--\"The age of the defendant at the time of the crime\"--and there he argued only that defendant's age \"doesn't help him a bit. He's 25, 26. He's been an adult. He's actually been convicted of both juvenile and adult offenses. He's been sent to state prison as an adult before. His age doesn't help him here.\" In another reference, while discussing the expanded section 190.3, factor (k) instruction that permitted the jury to consider any evidence offered by defendant including pity or sympathy for defendant, the prosecutor asked the jury to \"remember what kind of a person he has shown himself to be during his life, both in his late years as a juvenile and as an adult. Don't waste your pity on someone who doesn't deserve it.\" At no time did the prosecutor argue that defendant's juvenile record should be considered an aggravating factor. The argument was carefully tailored to discount the evidence as mitigating.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The part of the instruction of which defendant complains advised the jury that in determining the penalty it should consider: \"(a) the circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstance found to be true. \"(b) the presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence, or the expressed or implied threat to use force or violence. \"(c) the presence or absence of any prior felony conviction.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In his penalty phase argument the prosecutor carefully and properly segregated the evidence. He told the jury that the first factor \"deals specifically with the crime that you've heard about and convicted this man of, and the special circumstance involved.\" He then reminded the jury of the evidence concerning the shooting of Dykstra and Wolbert in the course of a robbery. Addressing factor (b), he told the jury that the factor involved prior violence, and reminded the jury it had heard evidence about the attack on Cusack. He then turned to factor (c), recalling that defendant had admitted that he had pled guilty to a felony, and discussing the evidence relevant to the 1978 attack on Scofield.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Counsel acknowledges our rejection of these claims in prior cases and explains that they are presented here in part in order to ensure preservation for federal review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Counsel did object on relevancy grounds to a question asking if defendant had \"any particular reason\" for having cut his hair 10 months before trial, and when defendant answered \"no\" to the question asking if he cut his hair because he was to appear before a jury, counsel objected to a follow-up inquiry: \"It is totally coincidental?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The \"squiggles\" reference was to markings made by the subject of a Bender Visual Motor Gestalt test. Dr. Broussard had testified on direct that his opinion was based in part on his administration of that test to defendant. A copy of his report was being used on cross- examination. He had explained that the test involved showing the subject drawings or designs on paper, and asking the subject to copy what he had been shown on a sheet of paper. The prosecutor then characterized what was written as \"those little squiggles on that paper.\" Defendant offers no basis on which to conclude that this term was anything other than descriptive of the marks in question. Asked later on redirect examination whether the marks would look like squiggles to persons not versed in psychology, Dr. Broussard agreed that they would \"unless you're trained in interpreting.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Defendant also cites as misconduct the prosecutor's reference to Dr. Broussard as a \"prostitute\" in penalty phase argument. Assuming that this characterization was not mere hyperbole or exaggeration, and exceeded the bounds of permissible argument, however, it was not so potentially prejudicial that a prompt objection and admonition could not have averted any such prejudice. The failure to object precludes consideration of the claim here. (See People v. Carrera (1989) 49 Cal. 3d 291, 320 [261 Cal. Rptr. 348, 777 P.2d 121].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. One such comment related to defendant's attempt to characterize his conduct in the Scofield incident as self-defense. Another was directed to defendant's denial that Cusack had been present or had been attacked. Both anticipated the prosecutor's exhortation to the jury to disregard anything defendant said because his testimony was unworthy of any credibility. The argument was founded on the evidence and inferences reasonably drawn therefrom. It was not improper. This is true also of the comments made in the prosecutor's rebuttal argument suggesting that because the defense lacked substance the penalty phase argument followed the technique of attempting to distract, pounding the table and making smoke. The penalty phase argument by defendant's counsel was a rambling discourse, not tied to particular evidence. The prosecutor's description was not inaccurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The claimed misconduct was: 1. The prosecutor \"vouched\" for the testimony of Michael Wolbert, saying he had told Wolbert to tell the truth and do his best, and \"that's what he did.\" 2. The prosecutor urged the jury to consider that defendant might have avoided capture, reminded the jury that the victims' families were present, and stated that if defendant were not convicted on all counts, it would be an insult to Wolbert's struggle to live. 3. The prosecutor asked defendant's girlfriend if she was \"gonna wait for him.\" 4. The prosecutor suggested that defendant may have escaped from custody more than the three times of which a witness, defendant's father, was aware. 5. The prosecutor stated, with regard to Scofield's testimony, based on the prosecutor's own experience, \"you can't expect to have angels for witnesses.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Agajanian also served as counsel in this court from the commencement of the appeal in 1983 until his suspension from the practice of law in 1990. Shortly thereafter, present counsel was appointed in his place.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Agajanian's deficiencies as appellate counsel were also pervasive and serious. Witness the fact that the sole act of any significance that he performed on behalf of defendant over the course of almost seven years of representation before this court was the filing of a single thirty-page brief raising only two insubstantial penalty claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Agajanian's deficiencies on appeal would have compelled the same Conclusion had he not been suspended from the practice of law and been replaced by present counsel.\u003c/span\u003e\n\n",
    "body_length": 168455,
    "citedas": [
      "5 Cal. Rptr. 2d 495",
      "2 Cal. 4th 1",
      "825 P.2d 388"
    ],
    "attorneys": "Timothy J. Foley and Richard Schwartzberg, under appointments by the Supreme Court, and Roger Agajanian for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Steve White and Richard B. Iglehart, Chief Assistant Attorneys General, Harley D. Mayfield, Assistant Attorney General, Michael D. Wellington, Frederick R. Millar, Jr., Robert M. Foster, Rudolf Corona, Jr., and Janelle B. Davis, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "78"
    ],
    "judges": "Opinion by Baxter, J., with Lucas, C. J., Panelli, Kennard, Arabian and George, JJ., Concurring. Separate Dissenting opinion by Mosk, J.",
    "citation_count": 10
  }
}
