{
  "id": "N7OqTGYBTlTomsSBn2m1",
  "document": {
    "title": "Grandison v. State",
    "full_title": "ANTHONY GRANDISON v. STATE OF MARYLAND",
    "jurisdiction": "Court of Appeals of Maryland",
    "date": "1995-12-27T00:00:00.000Z",
    "docket": "No. 64, September Term, 1994",
    "body": "Opinion by Karwacki, J.\n\nAnthony Grandison, the appellant, hired Vernon Lee Evans, Jr. to kill David Scott Piechowicz and his wife, Cheryl, who were scheduled to testify against Grandison in a narcotics case pending in the United States District Court for the District of Maryland. Evans was to receive $9,000.00 from Grandison for committing the murders. On April 28, 1983, Evans went to the Warren House motel in Baltimore County where Mr. and Mrs. Piechowicz worked and shot and killed David Scott Piechowicz and Susan Kennedy. Susan Kennedy, Cheryl Piechowicz's sister, was killed because Evans apparently mistook her for Cheryl.\n\nGrandison was charged in the Circuit Court for Baltimore County with two first degree murders, conspiracy to commit the murders, and use of a handgun in the commission of crimes of violence in the deaths of David Scott Piechowicz and Susan Kennedy. After being notified of the State's intent to seek the death penalty, Grandison had the trial of the case removed to Somerset County, pursuant to Maryland Const. Art. IV, § 8(b). While Grandison was awaiting trial on the state charges, he was convicted in the federal court on both narcotics charges and witness tampering charges brought against him in connection with the murders. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Thereafter, Grandison moved to dismiss the state charges on the ground that the federal convictions for witness tampering and civil rights violations and the sentences thereon constituted a double jeopardy bar to the pending state court trial. The trial court denied his motion, and on appeal of that interlocutory order we affirmed that judgment pursuant to the dual sovereignty exception to the Double Jeopardy Clause. Evans [ and Grandison ] v. State, 301 Md. 45, 481 A.2d 1135 (1984), cert. denied, 470 U.S. 1034, 105 S. Ct. 1411, 84 L. Ed. 2d 795 (1985) (Grandison I).\n\nIn February of 1984, Grandison was tried on the state charges before a jury in the Circuit Court for Somerset County and was convicted on all counts. At the conclusion of the ensuing capital sentencing proceeding, the jury returned separate sentences of death on the two murder convictions. The court imposed a life sentence for the conspiracy conviction and a twenty-year sentence for the handgun conviction to run consecutively with Grandison's federal sentences. The state convictions and sentences were appealed to this court pursuant to Maryland Code (1957, 1982 Repl. Vol.), Art. 27, § 414(a). We affirmed those judgments and the Supreme Court of the United States denied certiorari. Grandison v. State, 305 Md. 685, 506 A.2d 580, cert. denied, 479 U.S. 873, 107 S. Ct. 38, 93 L. Ed. 2d 174 (1986) (Grandison II).\n\nOn November 1, 1990, Grandison filed a petition, pursuant to Md. Code (1957, 1987 Repl. Vol., 1990 Cum. Supp.), Art. 27, § 645A, in the Circuit Court for Somerset County seeking post conviction relief. On July 31, 1992, the circuit court granted such relief, ordering a new capital sentencing proceeding on Grandison's convictions of first degree murder. Relying upon the Supreme Court's decision in Mills v. Maryland, 486 U.S. 367, 108 S. Ct. 1860, 100 L. Ed. 2d 384 (1988), \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e the circuit court granted the requested relief on the grounds that the sentencing form and related jury instructions employed at Grandison's first sentencing proceeding offended the dictates of the Eighth and Fourteenth Amendments to the United States Constitution that the death penalty not be imposed where there are mitigating factors which may call for a less severe penalty. The circuit court also decided that Grandison was entitled to retroactive application of the Mills decision. The State applied to this Court for leave to appeal from the circuit court's grant of post conviction relief as to the death sentences, and Grandison filed a cross-application seeking review of the circuit court's denial of collateral relief on the underlying convictions. We denied both applications. Grandison v. State, Misc. No. 29, Sept. Term, 1992 (order filed October 23, 1992). The Supreme Court denied a petition and cross-petition for writ of certiorari on March 22, 1993. Maryland v. Grandison, 507 U.S. 985, 113 S. Ct. 1581, 123 L. Ed. 2d 149 (1993); Grandison v. Maryland, 507 U.S. 985, 113 S. Ct. 1581, 123 L. Ed. 2d 149 (1993). In 1993, Grandison filed a number of motions in the circuit court to bar his resentencing on double jeopardy grounds. The circuit court denied these motions and Grandison's subsequent request for a stay of the resentencing proceeding pending an appeal of the circuit court's ruling on his motions. Grandison then applied to the Court of Special Appeals for a stay of the resentencing. On May 11, 1994 the matter was transferred to this Court. We issued an order denying the requested stay. Grandison v. State, Misc. No. 20, Sept. Term, 1994 (order filed May 12, 1994).\n\nAt the conclusion of Grandison's capital resentencing proceeding, conducted May 19, 1994 through June 3, 1994, a Somerset County jury imposed two death sentences upon him. Grandison has appealed these judgments pursuant to Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 414 and Maryland Rule 8-306(c)(1). We shall consider each of Grandison's 29 contentions \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e as to why those judgments should be reversed, adding additional facts where necessary. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nWe note preliminarily that we have long held that a defendant in a criminal case who chooses to represent himself is subject to the same rules regarding reviewability and waiver of questions not raised at trial as one who is represented by counsel. See, e.g., Midgett v. State, 223 Md. 282, 298, 164 A.2d 526, 535 (1960). Grandison apparently understood this principle early on as evidenced by the following exchange which occurred during the August 27, 1993 hearing on his request to discharge his then assigned public defenders:\n\n\"[The Court:] Do you understand that if you are placed in a position where you have to represent yourself, that you will be held accountable to the same rules of practice and procedure as well as the attorneys who represent the State . . . do you understand that?\n\n\"[Grandison:] I understand that.\"\n\nI\n\nThe appellant raises the question of whether the \"murder for hire\" aggravating circumstance found in Md. Code (1957, 1992 Repl. Vol.), Art. 27, § 413(d)(7) genuinely narrows the class of defendants eligible for the death penalty. Grandison argues that applying the death penalty in this case would violate his rights under the Eighth and Fourteenth Amendments to the United States Constitution and Article 25 of the Maryland Declaration of Rights.\n\nThere can be \"no perfect procedure for deciding in which cases governmental authority should be used to impose death.\" Lockett v. Ohio, 438 U.S. 586, 605, 98 S. Ct. 2954, 2965, 57 L. Ed. 2d 973, 990 (1978). \"Because there is a qualitative difference between death and any other permissible form of punishment, 'there is a corresponding difference in the need for reliability in the determination that death is the appropriate punishment in a specific case.'\" Zant v. Stephens, 462 U.S. 862, 884-85, 103 S. Ct. 2733, 2747, 77 L. Ed. 2d 235, 255 (1983) (quoting Woodson v. North Carolina, 428 U.S. 280, 305, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976)). In Zant, the Supreme Court stated that, to comply with the Eighth Amendment, a state must \"genuinely narrow the class of persons eligible for the death penalty and must reasonably justify the imposition of a more severe sentence on the defendant compared to others found guilty of murder.\" Zant 462 U.S. at 877, 103 S. Ct. at 2742, 77 L. Ed. 2d at 249-50. To meet this reliability requirement, a state must permit the sentencer to make an individualized determination on the basis of the character of the individual and the circumstances of the crime. Id. at 879, 103 S. Ct. at 2744, 77 L. Ed. 2d at 251.\n\nThis narrowing function may be accomplished at either the guilt/innocence or penalty stage of a capital case. The legislature may either narrow the definition of capital offenses so that the jury finding of guilt responds to this concern or define capital offenses more broadly and provide for narrowing by jury findings of aggravating circumstances at the penalty phase. Lowenfield v. Phelps, 484 U.S. 231, 246, 108 S. Ct. 546, 555, 98 L. Ed. 2d 568, 582 (1988).\n\nAlthough narrowing may occur within the definition of first-degree murder, the use of statutorily prescribed aggravating circumstances is a more ideal tool with which to genuinely narrow the class of death-eligible defendants. Id. at 244-45, 108 S. Ct. at 554, 98 L. Ed. 2d at 581-82. In the instant case, Grandison contends that the Maryland capital sentencing scheme is unconstitutional because the aggravating circumstance upon which the sentencing authority relied in imposing the death penalty did not truly narrow the class of murderers eligible for the death penalty. He points out that \"he was only eligible for the death penalty because the State alleged that he hired Vernon Evans to commit murder.\" Grandison maintains that the duplicate use of the fact that he hired Evans to commit murder did not have the net effect of reducing the size of the class of death-eligible defendants at the penalty phase, but left the class at exactly the same size it was at the guilt/innocence phase.\n\nThere is no question that under Maryland law the fact that Grandison hired Evans to commit murder can serve as both the factual predicate for a conviction and as the basis for death eligibility. Grandison II, 305 Md. at 748-49, 506 A.2d at 612; Stebbing v. State, 299 Md. 331, 358-61, 473 A.2d 903, 916-17, cert. denied, 469 U.S. 900, 105 S. Ct. 276, 83 L. Ed. 2d 212 (1984). The question raised is whether the Maryland death penalty statute violates the command of the Eighth Amendment that a capital sentencing scheme must genuinely narrow the class of death-eligible defendants. We hold that it does not.\n\nThe Supreme Court has spoken to the issue presented here. In Lowenfield, the Court reviewed the imposition of a death penalty in Louisiana where the defendant contended inter alia that Louisiana law violated the Eighth Amendment requirement that the capital sentencing scheme genuinely narrow the class of persons eligible for the death penalty and reasonably justify the imposition of a more severe sentence on the defendant than others found guilty of murder would receive. In rejecting that argument, the Court held that as long as a state's capital sentencing scheme at either the guilt/innocence stage or at the sentencing stage of the trial narrows the class of death-eligible murders, the fact that the single statutory aggravating circumstance found by the jury at the sentencing stage duplicates an element of the underlying offense of first degree murder does not render that sentencing scheme constitutionally infirm. Accord Tuilaepa v. California, U.S. , 114 S. Ct. 2630, 2634-35, 129 L. Ed. 2d 750, 759 (1994).\n\nUnder our statutory scheme only those convicted as principals in the second degree of first degree murder who \"engaged or employed another person to commit the murder and the murder was committed pursuant to an agreement or contract for remuneration or the promise of remuneration,\" Art. 27, § 413(d)(7), may be considered for the death penalty. That aggravating circumstance meets the narrowing requirement of the Eighth Amendment.\n\nThis Court also has rejected the notion that the use of an aggravating circumstance (murder committed during the commission of robbery) in a capital sentencing proceeding where the defendant has been convicted of felony murder based upon same robbery offends the Eighth Amendment's prohibition against cruel and unusual punishment. Calhoun v. State, 297 Md. 563, 623-26, 468 A.2d 45, 74-76 (1983). In Whittlesey v. State, 340 Md. 30, 665 A.2d 223 (1995), we continued to adhere to that view.\n\nII\n\nGrandison was sentenced to death based only on the \"murder for hire\" aggravating factor. Grandison wished to defend against this accusation with the factual defense that Evans did not commit the murders, and Grandison, therefore, could not have hired Evans to do it. Grandison's trial counsel \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e wished to present a defense admitting that Evans was the killer but denying that Grandison had hired Evans. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Grandison objected to this defense strategy and asked to be assigned new counsel. The court refused to appoint substitute counsel \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and presented Grandison with the choice of proceeding with his assigned counsel or waiving his right to counsel and representing himself. When Grandison refused to make that choice, the court found that he had waived his right to counsel \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and thus had chosen, by default, to represent himself. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nGrandison claims that these actions of the court violated his rights under the United States Constitution and the Maryland Declaration of Rights in several ways, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e but all of his contentions are based upon a perceived violation of his right to counsel as a result of the court forcing him to make a choice between what he characterizes as a lawyer who would not advocate his factual defense, and no lawyer at all. Grandison concludes that the court's actions require us to vacate his death sentences. We disagree.\n\nMd. Rule 4-215(e) specifically sets forth the procedure to be followed to ensure that the right of an accused to effective assistance of counsel and the correlative right to self-representation will be honored when the accused requests permission to discharge an attorney whose appearance has been entered on his behalf. Parren v. State, 309 Md. 260, 277-78, 523 A.2d 597, 605-06 (1987). That rule provides:\n\n\"If a defendant requests permission to discharge an attorney whose appearance has been entered, the court shall permit the defendant to explain the reasons for the request. If the court finds that there is a meritorious reason for the defendant's request, the court shall permit the discharge of counsel; continue the action if necessary; and advise the defendant that if new counsel does not enter an appearance by the next scheduled trial date, the action will proceed to trial with the defendant unrepresented by counsel. If the court finds no meritorious reason for the defendant's request, the court may not permit the discharge of counsel without first informing the defendant that the trial will proceed as scheduled with the defendant unrepresented by counsel if the defendant discharges counsel and does not have new counsel. If the court permits the defendant to discharge counsel, it shall comply with subsections (a)(1)-(4) of this Rule if the docket or file does not reflect prior compliance.\"\n\nWe recently opined that:\n\n\"unless the defendant [in a criminal case] can show a meritorious reason for the discharge of current counsel, the appointment of substitute counsel is simply not an option available to the defendant. At such a point, a trial court may constitutionally require a defendant to choose between proceeding with current counsel and proceeding pro se; the defendant's knowing and intelligent refusal to proceed with current able counsel has repeatedly been deemed to constitute a voluntary waiver of the right to counsel.\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nFowlkes v. State, 311 Md. 586, 605-06, 536 A.2d 1149, 1159 (1988) (emphasis added). Grandison claims that new counsel should have been appointed for him in this case because he did have a meritorious reason for discharging his then current counsel, i.e., their refusal to present the defense that he wanted to put before the jury.\n\nWe have said that \"the defendant [in a criminal case] ordinarily has the ultimate decision when the issue at hand involves a choice that will inevitably have important personal consequences for him . . . .\" Treece v. State, 313 Md. 665, 674, 547 A.2d 1054, 1058-59 (1988). Assuming, arguendo, that the choice of factual defenses in a criminal prosecution is a decision resting ultimately with the criminal defendant, we still must conclude that Grandison did not have a meritorious reason for discharging his counsel and, therefore, that the trial court's actions in this case did not violate Grandison's right to counsel. This conclusion is compelled first, because Grandison's then current counsel never expressly refused to present the defense that Grandison wanted and second, because the two defenses were not irreconcilably conflicting. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAt the hearing on Grandison's request to discharge his counsel, Purpura stated to the court that presenting Grandison's defense theory would cause counsel some problems. At no time, however, did counsel refuse either to present Grandison's defense theory or to abandon their own theory.\n\nFurthermore, the record supports the trial court's findings that the two defense theories were not irreconcilable and that Grandison tried to manufacture a conflict, for purposes of generating an appellate issue, where one did not exist. Both defense theories could have been presented without inconsistency. Evidence could have been presented leaving open to doubt whether Evans was the shooter. Further evidence then could have been introduced suggesting that even if Evans was the shooter, he must have been hired by Rodney Kelly, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e acting of his own accord, or by someone else, because Grandison knew of the futility of such action vis-a-vis his pending federal prosecution. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAs further proof that both theories were capable of being presented in tandem, Grandison actually advanced both theories before the jury during the proceeding. He introduced evidence that he was familiar with the rules regarding the introduction of prior testimony and then tried to show that Evans was not the shooter through his cross-examination of Etta Horne. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e During his closing argument, Grandison maintained that the prosecution had not established that Evans was the shooter and that, if Kelly had paid Evans money, there was no evidence that Kelly had paid Evans at Grandison's direction.\n\nIII\n\nGrandison next contends that, in violation of the Sixth and Fourteenth Amendments to the United States Constitution and Article 21 of the Maryland Declaration of Rights, the trial court never obtained a valid waiver of his right to counsel. Citing Brewer v. Williams, 430 U.S. 387, 97 S. Ct. 1232, 51 L. Ed. 2d 424 (1977), Carnley v. Cochran, 369 U.S. 506, 82 S. Ct. 884, 8 L. Ed. 2d 70 (1962), and Johnson v. Zerbst, 304 U.S. 458, 58 S. Ct. 1019, 82 L. Ed. 1461 (1938), Grandison asserts that a waiver of counsel cannot be inferred from silence or ambiguous statements. He argues that when he refused to choose between retaining current counsel and representing himself, the trial court was required to have him proceed to trial with counsel, and could not simply infer a waiver of counsel from Grandison's refusal to make such a choice. Grandison points to our decision in State v. Renshaw, 276 Md. 259, 268, 347 A.2d 219, 226 (1975) in which we said:\n\n\"Where the accused fails to waive his right to counsel by making an unequivocal choice, but merely insists on a different lawyer, effective legal representation must be required by the court.\"\n\nHe then recognizes, however, that Renshaw has been \"narrowed, and perhaps even abandoned\" by the subsequent promulgation of Md. Rule 4-215(e), \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e (supra) . In considering the effect of Rule 4-215, we recently held that:\n\n\"an accused who, at or shortly before trial and without justification, insists on discharging his counsel and demands the appointment of new counsel, may properly be deemed to have waived his right to counsel if he is sufficiently informed in accordance with Rule 4-215 so that his discharge of counsel represents knowing, intelligent, and voluntary action on his part.\"\n\nFowlkes, 311 Md. at 604, 536 A.2d at 1158. We further remarked that:\n\n\"although the right to counsel generally embodies a right to retain counsel of one's choice, a defendant may not manipulate this right so as to frustrate the orderly administration of criminal justice.\"\n\nId. at 605, 536 A.2d at 1159.\n\nThe only difference between Fowlkes and the case sub judice is that Grandison did not expressly insist on discharging his current counsel. Instead, he simply insisted on being appointed new counsel. He did so, however, even after being advised by the court that his position would result in the discharge of his current counsel. We find this, therefore, to be a distinction without a difference. We thus conclude that Fowlkes is dispositive of Grandison's argument here: a defendant's unmeritorious refusal \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e to proceed with current counsel may constitute a waiver of the right to counsel.\n\nGrandison attempts to characterize his responses to the court's questions as ambiguous and, therefore, not a valid basis for a waiver of his right to counsel. His responses, however, can only be viewed as an unambiguous waiver, because he knew the consequences of those responses. The trial judge committed no error in concluding that Grandison had waived his right to counsel.\n\nIV\n\nDuring Grandison's capital resentencing proceeding, the State called Cheryl Piechowicz as a victim impact witness to give live testimony concerning the effect the deaths of her husband and sister had on her and on several other members of her family. On direct examination she testified, in pertinent part:\n\n\"People think because it's been 11 years that we have accepted it or things have gotten better. And it can be 20 years or 30 years or 50 years and we will never, never accept it, and that it doesn't get better.\n\n\"I guess I mainly want people to think that it does not get better, it doesn't go away and you don't accept this. There is no accepting this. It doesn't get better. Other people forget about it but we don't. Their lives are greatly missed.\"\n\nOn cross-examination, Grandison wanted to contest these statements by showing that Ms. Piechowicz had adjusted well to the tragedy, had remarried eighteen months after the murders, and had children with her new husband. In addition, Grandison wanted the jury to hear about a civil action that had been brought by Ms. Piechowicz in a federal court against the United States government. He contends that because the success of that suit depended upon her establishing that he was responsible for the murders, Ms. Piechowicz had a significant financial motive for testifying against him. The trial court refused to allow any questions concerning the suit or Ms. Piechowicz's new family. Grandison claims that this denied him the right to effective cross-examination, as guaranteed by the Sixth and Fourteenth Amendments to the United States Constitution and Article 21 of the Maryland Declaration of Rights. Assuming, arguendo, that this issue was preserved, we disagree with Grandison's contention.\n\nThe right of a defendant to cross-examine witnesses against him extends to the sentencing phase of a capital trial and applies to victim impact witnesses as well as factual witnesses. In capital cases \"wide latitude must be given a cross-examiner in exploring a witness' bias or motivation in testifying.\" Bruce v. State, 318 Md. 706, 727, 569 A.2d 1254, 1265 (1990) (Bruce I). The right to cross-examine is not, however, limitless. Discovery of irrelevant information is not a proper object of cross-examination. See, e.g., Lyba v. State, 321 Md. 564, 570, 583 A.2d 1033, 1036 (1991) (quoting Smallwood v. State, 320 Md. 300, 307, 577 A.2d 356, 359 (1990) (quoting Delaware v. Van Arsdall, 475 U.S. 673, 679, 106 S. Ct. 1431, 1435, 89 L. Ed. 2d 674, 683 (1986))); Apple v. State, 190 Md. 661, 665, 59 A.2d 509, 511 (1948). Evidence is relevant or probative if it tends to prove the proposition for which it is offered. The more attenuated the connection between the evidence and the proposition, the less the probative value of the evidence. See, e.g., Johnson v. State, 332 Md. 456, 474, 632 A.2d 152, 160 (1993) and cases cited therein. The determination of relevance is reserved for the discretion of the trial judge; we will not disturb the trial judge's ruling unless he has abused that discretion. Johnson v. State, 303 Md. 487, 527, 495 A.2d 1, 21 (1985); State v. Cox, 298 Md. 173, 179-80, 468 A.2d 319, 322 (1983).\n\nGrandison's questions relating to Ms. Piechowicz's remarriage and additional children \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e were not at all probative of whether Ms. Piechowicz was still affected by the murders. The fact that she had remarried and had more children does not tend to establish that Ms. Piechowicz had recovered from the loss of her first husband and sister. People can move on with their lives, yet remain pained by the loss of loved ones. Grandison acknowledged this fact during his allocution when he stated, \"when you lose someone close to you, you can never, you always keep them in your heart but you want to move on.\" As these questions would not have revealed any evidence tending to prove that Ms. Piechowicz felt the loss of her husband any less keenly, the trial court used proper discretion in curtailing this line of questioning.\n\nWe also reject Grandison's contention that the trial judge abused his discretion in refusing to allow cross-examination of Ms. Piechowicz on her pending civil suit against the government. Control over the extent and scope of cross-examination rests within the discretion of the trial judge, and his ruling will not be overturned absent an abuse of discretion. Johnson, supra, 303 Md. at 516, 495 A.2d at 16; Vitek v. State, 295 Md. 35, 40, 453 A.2d 514, 516 (1982). A trial judge's refusal to allow a line of questioning on cross-examination amounts to exclusion of evidence; preservation for appeal of an objection to the exclusion generally requires a formal proffer of the contents and relevancy of the excluded evidence. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e See Mack v. State, 300 Md. 583, 603, 479 A.2d 1344, 1354 (1984) (no abuse of discretion in excluding defendant's proposed evidence about victim in a criminal assault trial, where defendant failed to make the requisite proffer concerning contents and relevance); Johnson, supra, 303 Md. at 544, 495 A.2d at 29-30, (Eldridge, J., concurring) (\"It is settled that whenever one is complaining about a trial court's refusal to admit certain testimony, it is necessary that there be a proffer of what the evidence would have been\"); see also Grandison v. State, 305 Md. 685, 742, 506 A.2d 580, 608-09 (1986), cert. denied, 479 U.S. 873, 107 S. Ct. 38, 93 L. Ed. 2d 174 (1986) (no proffer on record renders appellate court unable to rule on possible prejudice to defendant); Jorgensen v. State, 80 Md. App. 595, 565 A.2d 371 (1989).\n\nOf course, the proffer of a defendant whose cross-examination has been restricted does not need to be extremely specific, for the obvious reason that the defendant cannot know exactly how the witness will respond, especially when the cross-examination is an attempt to show bias. Alford v. U.S., 282 U.S. 687, 692, 51 S. Ct. 218, 219, 75 L. Ed. 624 (1931) (\"It is the essence of a fair trial that reasonable latitude be given the cross-examiner, even though he is unable to state to the court what facts a reasonable cross-examination might develop\"). Nevertheless, the proffer must at least be sufficient to establish that the cross-examination will likely reveal information nominally relevant to the proceeding. Johnson, supra, 303 Md. at 527, 495 A.2d at 21 (proffered evidence must meet threshold test of relevance to be admissible). A simple assertion that cross-examination will reveal bias is not sufficient to establish a need for that cross-examination; it is necessary to demonstrate a relevant relationship between the expected testimony on cross-examination and the nature of the issue before the court. See, e.g., Goldsmith v. State, 337 Md. 112, 129, 651 A.2d 866, 874 (1995) (defendant's proffer in pre-trial motion hearing that credibility was at issue was not enough to establish need for victim's privileged psychotherapy records, because proffer did not establish how the records would lead to relevant information for the trial).\n\nHere, the defendant's proffer during the proceeding may have been sufficient to preserve the issue for appeal but was entirely insufficient to show even nominal relevance to the sentencing proceeding at hand. The record discloses a proffer which merely claims bias on the part of Ms. Piechowicz, without a single detail to illuminate for the trial judge why or how she was biased:\n\n\"Q. Ms. Piechowicz, did you file a civil litigation in Federal Court against James Savage, Assistant U.S. Attorney?\n\n\"MS. SCHENNING: Objection.\n\n\"THE COURT: Basis?\n\n\"MS. SCHENNING: It's irrelevant.\n\n\"THE COURT: Come up.\n\n(Whereupon, all parties and counsel approached the bench)\n\n(Whereupon, the following transpired at the bench)\n\n\"THE DEFENDANT: Your Honor, this is very relevant. This witness filed an 80 million dollar lawsuit against the Assistant U.S. Attorney, who the State intends to call, right after this, well maybe a year or two after this incident occurred, seeking money, attorney damages for what happened to the family.\n\n\"I think it's relevant, Your Honor, because it's dealing with victim impact. In addition to that, what I think is relevant to bring out the fact what, how sad she was and this and that, but sought monetary damages against the government concerning this case. Jim Savage is going to be a witness in this case.\n\n\"THE COURT: I don't think any civil case or action that this lady was involved in subsequent to the events of April of 1983 are relevant in this proceeding. I'm not going to allow you to ask the question.\n\n\"THE DEFENDANT: Could I finish, Your Honor. In addition to that, she gave a deposition. It's all relevant to this case, Your Honor.\n\n\"THE COURT: If there is something in the deposition that would go to show whether there was a prior inconsistent statement or inconsistent statement given today, we'll allow that.\n\n\"THE DEFENDANT: I'm not allowed to show that this impact that she is stating it was not as great as the State is trying to emphasize. You gave the State leeway in letting her testify.\n\n\"THE COURT: I'm not going to allow any testimony regarding civil litigation, unless there was some information that she testified to that is inconsistent with her testimony today or any prior inconsistent statement she may have made. Okay?\n\n\"THE DEFENDANT: All right.\n\n(End of Conference at the Bench).\"\n\nThe defendant did not proffer any support for his assertion that the filing of the civil law suit was \"very relevant\" in demonstrating that the victim impact statement was exaggerated. He did not even state the theory of Ms. Piechowicz' suit, nor any of the allegations made in the suit, much less explain the relevance of cross-examination on the civil law suit to his sentencing proceeding. The judge gave the defendant ample opportunity to improve his proffer, asking if there were inconsistencies in the victim impact statement Ms. Piechowicz had made and her earlier deposition in the civil case; the defendant did not respond except to state again that the filing of the law suit was relevant to show the impact was exaggerated. The defendant gave no indication to the trial judge of what he was attempting to demonstrate, and as a result, the proffer was insufficient to demonstrate a relevant relationship between the civil suit and any bias of the witness. Consequently, the trial judge was well within his discretion to refuse to permit that line of cross-examination.\n\nV\n\nGrandison's next contention is that the trial court refused to instruct the jury on several matters despite his requests for those instructions. Grandison urges that the failure to give these instructions constitutes grounds for a new sentencing proceeding. We are not so persuaded.\n\nMd. Rule 4-325(c) requires the trial court, at the request of a party, to instruct the jury as to the applicable law, but this rule is not absolute. In evaluating the propriety of a trial court's refusal to give a requested instruction, we must determine whether the requested instruction was a correct statement of the law; whether it was applicable under the facts of the case; and whether it was fairly covered in the instructions actually given. Evans v. State, 333 Md. 660, 691, 637 A.2d 117, 132 (1994) (Evans III); accord Chambers v. State, 337 Md. 44, 48-52, 650 A.2d 727, 728-30 (1994). If the requested instruction contains an incorrect statement of the law, is inapplicable under the facts of the case, or is fairly covered by the instructions actually given, then it need not be given.\n\nA.\n\nThe effect of the murder convictions\n\nThe State was permitted to introduce evidence informing the jury that Grandison already had been convicted of first degree murder at the guilt/innocence phase of his trial. Grandison argues that the trial judge should have instructed the jurors that the murder convictions were not in any way probative of whether the State had established the aggravating factor. He contends that such an instruction was particularly necessary in this case, because the elements of the murder convictions and those of the aggravating circumstance were virtually identical and both required proof that Grandison hired Evans to kill two people. Absent such an instruction, Grandison reasons, the jurors would think it logical, if not mandatory, that they find the aggravating circumstance proven by the fact of the convictions. He further argues that the danger of the jurors making such an error was especially acute in this case because the court did instruct the jurors that the finding of guilt was binding upon them. Grandison concludes that without a corresponding instruction that the jurors had to find independent proof of the aggravating circumstance, there was an implication that the aggravating circumstance was proven.\n\nGrandison wanted it made clear to the jury that it had an independent obligation to make an assessment of the existence of the aggravating factor without regard to his convictions. This purpose was accomplished by instructions actually given:\n\n\"Anthony Grandison, the Defendant, has been convicted of murder in the first degree of Scott Piechowicz and Susan Kennedy in a prior hearing. These convictions are binding upon you.\n\n\"Even though the Defendant has been convicted of the first degree murder of Scott Piechowicz and Susan Kennedy, you still must make separate determinations at this sentencing hearing of the aggravating circumstance, whether the Defendant engaged or employed another person to commit the murder and the murder was committed pursuant to an agreement or contract for remuneration. . . .\" (Emphasis added).\n\nIt was unnecessary, therefore, for the court to instruct the jury further in the specific manner requested by Grandison. Md. Rule 4-325(c) (\"The court need not grant a requested instruction if the matter is fairly covered by instructions actually given\").\n\nB.\n\nThe effect of the prior convictions\n\nAlso admitted was a pre-sentence investigation report (PSI) that listed some of Grandison's prior convictions and prison infractions. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Grandison argues that the trial judge should have instructed the jurors that these other prior offenses were in no way probative of whether the aggravating circumstance had been proven. Grandison acknowledges that this type of information is admissible at a capital sentencing proceeding. Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 413(c)(1)(iii), (iv); see part XVII, (infra). He contends, however, that the information is relevant only to the weighing process the jury must perform after it determines that the aggravating circumstance has been proven, and not to the issue of whether the aggravating circumstance exists. Grandison reasons that this proposed instruction was relevant because it was crucial to the jury's understanding of the information's proper use and, as such, that the trial judge erred in refusing to instruct the jury on the issue.\n\nInstructing the jury on this issue, as requested by Grandison, would have been a misstatement of the law. Information contained in a PSI is sometimes relevant in determining the existence of an aggravating factor. For example, the aggravating circumstance that the defendant was under a sentence of death or imprisonment for life at the time of the murder may be proved by use of the PSI. In this case, Grandison's federal convictions for witness tampering and civil rights violations were relevant to the issue of whether there was a \"murder for hire\" agreement between Evans and Grandison, and Grandison's narcotics convictions were clearly evidence of motive in the murder cases, making those convictions relevant in determining the existence of the aggravating circumstance also. The other information contained in the PSI was so clearly irrelevant as to that issue that the jury could not have used it in its determination; therefore, any error in failing to instruct the jury on its relevance was clearly harmless beyond a reasonable doubt. See Dorsey v. State, 276 Md. 638, 350 A.2d 665 (1976) (error in criminal case harmless if reviewing court persuaded beyond reasonable doubt that error did not influence judgment).\n\nC.\n\nThe reasonable hypothesis of innocence\n\nGrandison was charged with just one aggravating circumstance--that he hired Evans to kill two people. While there was considerable direct evidence against Evans, much of the evidence against Grandison was circumstantial, consisting of fragments of conversations, the opinions of co-conspirators and the fact that Grandison was visited by some of the co-conspirators shortly before the crime. No one actually saw or heard Grandison hire Evans to commit the murders.\n\nGrandison argues that when a prosecution relies solely on circumstantial evidence, the court must give an appropriate instruction, if requested to do so, on the effect of such evidence. Here, Grandison expressly requested a circumstantial evidence instruction, to wit that:\n\n\"the Defendant is entitled to every inference in his favor which can reasonably be drawn from the evidence. Therefore, you are instructed that the evidence in this case is totally circumstantial evidence; therefore, you are instructed, if an inference consistent can be drawn from the circumstantial evidence, you must accept that inference, in other words, you may not find the existence of the statement in Section 1 or the aggravating circumstance in Section 2 when the State['s] evidence is totally circumstantial. And the circumstances give rise to two different inferences, one consistent with innocence, the other consistent with guilt. You are instructed you must accept the inference of innocence.\"\n\nThe trial court refused to give this instruction. Grandison argues that the refusal to give such an instruction was particularly damaging, stressing that virtually all of the evidence against him was provided by co-defendants and co-conspirators, that their testimony needed to be corroborated to legally establish the aggravating circumstance, and that any existing corroboration was purely circumstantial. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Grandison concludes that the trial judge's refusal to give his requested instruction prejudiced not only the jury's consideration of the evidence, but also the manner in which it dealt with the corroboration requirement.\n\nThe trial judge committed no error in refusing to give this requested instruction. Grandison's proposed instruction was simply improper. We recently opined:\n\n\"that the proposition that a conviction based solely on circumstantial evidence cannot stand unless the circumstances are inconsistent with any reasonable hypothesis of innocence is a matter of evidentiary sufficiency [for the court's determination], rather than a proper subject of jury instructions.\"\n\nDenson v. State, 331 Md. 324, 327, 628 A.2d 182, 183 (1993) (citing Hebron v. State, 331 Md. 219, 627 A.2d 1029 (1993)). The teachings of Denson and Hebron are dispositive in this case as to the lack of necessity for this proposed instruction.\n\nD.\n\nThe State's shooter theory\n\nThe only factual argument advanced by the State in support of the only aggravating circumstance was that Evans had committed the murders. Grandison maintained that Evans had not committed the murders, and, therefore, he could not have hired Evans to do so. Grandison requested that the jury be instructed that it could not find the aggravating factor proven unless it found that Evans had committed the murders. The trial judge declined to give such an instruction.\n\nGrandison's proposed instruction was not a correct statement of the applicable law and was fairly covered by an instruction actually given. Proof of the aggravating circumstance required only a showing that Grandison engaged someone to commit the murders and that the murders were committed pursuant to an agreement or contract for remuneration or promise thereof. See Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 413(d)(7). As the State's evidence consisted only of evidence that Evans was the shooter, the court's general instruction regarding the jury findings necessary to reach a conclusion that the aggravating circumstance had been proven would have precisely the same effect as the more specific instruction Grandison requested--that the jury could not find the aggravating factor proven unless it also found that Evans had committed the murders. The trial judge committed no error in refusing to give this requested instruction.\n\nVI\n\nDuring the jury selection for the resentencing proceeding, a member of the venire told the court that she was the niece of Judge Lloyd L. Simpkins, who had presided over Grandison's first trial. She was aware of her uncle's role in that case. During voir dire, the juror's answers to questions regarding her ability to be impartial, in light of her relationship to Judge Simpkins, were somewhat ambiguous. The defense challenged this juror for cause, but the trial judge refused to excuse her. Grandison asserts that this refusal denied him his right to a fair trial, as guaranteed by the Sixth and Fourteenth Amendments to the United States Constitution and Article 21 of the Maryland Declaration of Rights. Grandison's objection to the composition of the jury was waived because he declared the jury ultimately impaneled acceptable without qualification. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e See Thomas v. State, 301 Md. 294, 310, 483 A.2d 6, 14 (1985) and cases cited therein.\n\nFurthermore, a claim that the jury was not impartial must focus on the jurors who actually served. See, e.g., Ross v. Oklahoma, 487 U.S. 81, 86, 108 S. Ct. 2273, 2277, 101 L. Ed. 2d 80, 88 (1988); accord Hunt v. State, 321 Md. 387, 418, 583 A.2d 218, 233 (1990), cert. denied, 502 U.S. 835, 112 S. Ct. 117, 116 L. Ed. 2d 86 (1991). Grandison used one of his peremptory challenges to remove the juror at issue, and he has made no claim that any juror who actually served was in any way incompetent.\n\nVII\n\nOver defense objection, Agent Kevin Foley of the Federal Bureau of Investigation (F.B.I.) testified for the State that from the beginning of his involvement in the case, he believed that Grandison was behind the shootings:\n\n\"Well, at the onset there was a supposition as to why the crime were [sic] perpetrated.\n\n\"This was based on the crime scene itself, wherein there was a substantial amount of money that was left in the lobby or in the desk area[ \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e ] of the Warren House. Further, we have had a prior incident at a suppression hearing wherein threats were made against one of the witnesses.\n\n\"Based on that and other information we had in our possession we concluded that it was perpetrated at the request of Mr. Grandison.\"\n\nAgent Foley was also allowed, over defense objection, to give his opinion that Charlene Sparrow \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e was telling the truth when he interviewed her during his investigation of the murders:\n\n\"[Prosecutor:] Agent Foley, let me end this questioning this way. There came a point in time of interviewing Charlene Sparrow where you were satisfied she was telling you truth, not based on strictly what she was telling you, but on other things that corroborated what she had told you.\n\n\"[Agent Foley:] Yes, that's correct. I was convinced she was telling me the truth and it was totally corroborated.\"\n\nLater in the proceeding, the prosecutor was allowed twice to elicit an opinion from Janet Moore \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e as to Grandison's guilt:\n\n\"[Prosecutor:] Ma'am, everything you know about this case, every thing from every source, isn't it correct, every source, isn't it correct, that Anthony Grandison paid Vernon Evans $9,000 to kill these two people at the Warren House?\n\n\"[Moore:] Yes.\n\n\"[Prosecutor:] And, Ma'am, as I said, everything you know from every source involved in this case you know this man paid Vernon Evans to kill these people?\n\n\"[Moore:] Yes.\"\n\nThis testimony was permitted despite the fact that Moore had admitted she had no personal knowledge of whether Grandison had hired Evans to commit the murders.\n\nGrandison concludes that each of these \"erroneous\" rulings constitutes grounds for a new sentencing hearing. We reject his conclusion.\n\nA.\n\nFairly placed in context, Agent Foley stated that the police investigation into the murders focused on Grandison immediately, based on the circumstances surrounding the case, and that he and his investigative team concluded Grandison was the likely mastermind of the murder scheme. Grandison contends that admitting Agent Foley's opinion that he, Grandison, was guilty constituted reversible error.\n\nIf we assume that a witness is never competent to testify to the ultimate guilt or innocence of a criminal defendant, the trial judge's erroneous admission of Agent Foley's opinion regarding Grandison's guilt still does not constitute reversible error because the subjects of his testimony were established independently. This Court has long approved the proposition that we will not find reversible error on appeal when objectionable testimony is admitted if the essential contents of that objectionable testimony have already been established and presented to the jury without objection through the prior testimony of other witnesses. Jones v. State, 310 Md. 569, 589, 530 A.2d 743, 753 (1987), vacated on other grounds, 486 U.S. 1050, 108 S. Ct. 2815, 100 L. Ed. 2d 916, on remand, 314 Md. 111, 549 A.2d 17 (1988)\n\n(sentence vacated on other grounds); Grandison v. State, 305 Md. 685, 738-739, 506 A.2d 580, 607 (1986), cert. denied, 479 U.S. 873, 107 S. Ct. 38, 93 L. Ed. 2d 174 (1986); Robeson v. State, 285 Md. 498, 507, 403 A.2d 1221, 1225 (1979), cert. denied, 444 U.S. 1021, 100 S. Ct. 680, 62 L. Ed. 2d 654 (1980); Linkins v. State, 202 Md. 212, 224, 96 A.2d 246, 252 (1953); see also Peisner v. State, 236 Md. 137, 144, 202 A.2d 585, 589 (1964), cert. denied, 379 U.S. 1001, 85 S. Ct. 721, 13 L. Ed. 2d 702 (1965). Grandison's participation as the architect of the murders was communicated directly or through implication to the jury several times during the trial, rendering Agent Foley's testimony not unfairly prejudicial.\n\nFirst, the trial judge informed jurors, during his preliminary instructions to them before any evidence had been presented in the case, that Grandison had been convicted of two counts of first degree murder. As the evidence was quite clear that Grandison had been in jail at the time of the shooting, any rational jury would have inferred that Grandison himself did not fire the murder weapon, and that his conviction for first-degree murder rested instead on his involvement in a plan to murder Scott Piechowicz and Susan Kennedy.\n\nSecond, Cheryl Piechowicz described in her testimony the threatening attitude of Janet Moore when Moore approached her prior to her testimony at the suppression hearing on March 14, 1983 in the federal narcotics case against Grandison. Piechowicz further testified that Moore's threatening conduct was immediately reported to the federal authorities, including the presiding judge, at that suppression hearing. Piechowicz' testimony was an obvious referral to the \"prior incident at a suppression hearing wherein threats were made against one of the witnesses\" to which Agent Foley later testified. Grandison did not object to Mrs. Piechowicz' testimony.\n\nFurthermore, the testimony of Captain James Drewery of the Baltimore City Jail, to which, again, no objection was posed by Grandison, established that the investigative team of FBI agents, Baltimore County police and Baltimore City police headed by Agent Foley interviewed Drewery the day after the murders about the persons visiting Grandison at the jail shortly before the murders; in addition, Janet Moore and Charlene Sparrow testified, without objection from Grandison, that the same investigative team interviewed them soon after the murders about their relationships with Grandison and his known associate Vernon Evans. It was obvious from the testimony of Drewery, Moore and Sparrow that Grandison was targeted at the outset by the investigators as the engineer of the murder scheme.\n\nAgent Foley's opinion as to Grandison's involvement, while perhaps erroneously admitted over objection, contained no more information than did the valid preliminary instructions made by the judge to the jury; prior testimony of other witnesses, admitted without objection, also asserted or implied the same opinion as to Grandison's role. Thus, Foley's testimony was not unfairly prejudicial to the defendant and at worst constituted harmless error.\n\nGrandison also argues that the admission of Agent Foley's testimony that he believed Sparrow had been telling the truth was reversible error because no trial court may \"permit to go to the jury a statement, belief, or opinion of another person to the effect that a witness is telling the truth or lying.\" Bohnert v. State, 312 Md. 266, 277, 539 A.2d 657, 662 (1988). Furthermore, Grandison urges, admission of Agent Foley's opinion was particularly damaging, because it allowed the State to use the views of a respected F.B.I. agent to bolster the testimony of an immunized informant who, at the time of her observations, was a teenage drug addict. However, when Agent Foley testified regarding Sparrow's truthfulness, Grandison did not raise these objections. Instead, he objected on the ground that the question that elicited the testimony was leading. It is well established that appellate review of an evidentiary ruling, when a specific objection was made, is limited to the ground assigned at the time of the objection. E.g., Colvin-El v. State, 332 Md. 144, 169, 630 A.2d 725, 737 (1993), cert. denied, U.S. , 114 S. Ct. 2725, 129 L. Ed. 2d 849 (1994). Therefore, as the specific ground for objection asserted here on appeal is not the same as that raised at trial, we will not review the ruling.\n\nB.\n\nFinally, Grandison contends that allowing Janet Moore's testimony constituted reversible error. This contention clearly is not preserved for our review. To preserve an issue on appeal as to admissibility of evidence, objection must be made at trial to the question eliciting an alleged objectionable answer. E.g., Rose v. State, 240 Md. 65, 69, 212 A.2d 742, 744 (1965). In this case, no objection was made to the prosecutor's questions or to Moore's responses.\n\nVIII\n\nMd. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 412(b) provides that a person convicted of first degree murder must be sentenced to life imprisonment unless the State notifies the person in writing at least 30 days prior to trial (1) that it intends to seek a sentence of death, and (2) of the aggravating circumstances upon which it intends to rely. Grandison was charged with and convicted of two separate first degree murders. The notice given to Grandison by the State did not specify for which of these crimes it was seeking the death penalty, and the notice only indicated that the State would seek a death sentence. Grandison moved to dismiss the death notice and the trial court denied his motion.\n\nGrandison contends that Art. 27, § 412(b) was violated because he was never put on notice of whether he was facing the death penalty for the killing of Scott Piechowicz or the killing of Susan Kennedy or both; therefore, he asserts that the death sentences must be vacated and sentences of life imprisonment imposed. We reject that argument.\n\nFirst, Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 412(b) does not expressly require separate notice of each death sentence sought:\n\n\"The sentence shall be imprisonment for life unless . . . the State notified the person in writing at least 30 days prior to trial that it intended to seek a sentence of death . . . .\" (Emphasis added).\n\nSecond, the purpose served by the notice requirement--to allow the defendant the opportunity to marshal his defenses in aid of showing why imposition of the death penalty would be inappropriate in his case--is satisfied by the notice given in this case. The absence of language in the notice to the effect that two sentences of death would be sought did not render the notice inadequate.\n\nFinally, and in any event, Grandison admitted twice that he had notice that the prosecution intended to seek separate sentences of death for the two murders. On August 27, 1993, over eight months before Grandison's resentencing proceeding began, at a pretrial hearing on his motion to discharge counsel, when asked by the court whether he understood that the prosecution was seeking the death penalty for both the murders, Grandison replied, \"Sure I understand that, Your Honor.\" On May 11, 1994, at a hearing on Grandison's request to discharge counsel the following colloquy transpired:\n\n\"[The court]: How many [death penalties] are you faced with as of right this moment?\n\n\"[Grandison:] Two.\n\n\"[The court:] Two. And for the murders of which two individuals?\n\n\"[Grandison:] [David] Scott Piechowicz and Susan Kennedy.\"\n\nThe notice from the State to Grandison in this case was sufficient, but even if it had been defective, Grandison clearly was aware that he faced the possibility of a death sentence in both murders. Due process was not offended under these circumstances, and the trial court properly denied the motion to dismiss the death notice.\n\nIX\n\nDuring the State's closing argument and rebuttal, prosecutors made the following remarks:\n\n\"You have heard from witness after witness in this case. You swore an oath. Each of those witnesses swore an oath and testified here. Each of those witnesses was subject to cross examination. All but one, all but one.\n\n\"And you can consider the fact that he was not under oath, that he was not subject to cross examination when he made his statement. All the other witnesses were. But not him. That is another reason what he says deserves no weight.\n\n\"He's in jail. That's another reason you know that it was for money, a contract to kill. Ladies and gentlemen, it was obvious by [sic] the police authorities, Kevin Foley told you from the get-go that the prime subject [sic] was Anthony Grandison, and the investigation ultimately made it clear that that was correct.\n\n\"Of course he had plenty of money. He was a drug dealer. That is what he did.\n\n\"To do less than the death penalty in this case devalues the lives of [David] Scott Piechowicz and Susan Kennedy. To do less than the death penalty in this case diminishes all of us, all of us who uphold the laws of this state, all of us law abiding citizens who believe in system of justice. It devalues all of us as citizens, it devalues our rights and it devalues the criminal justice system to do less than the death penalty.\n\n\"Don't let evil triumph in this courtroom. Don't let Anthony Grandison con you.\"\n\nGrandison contends that these statements had no purpose other than to inflame the jurors and convince them to return a death sentence on grounds which had nothing to do with the admissible evidence. He admits that \"the individual prejudicial remarks made in closing might not require reversal[,]\" but he asserts that cumulatively \"they are so damaging that the conviction cannot stand[,]\" and he is entitled to a new sentencing hearing. We disagree.\n\nFirst, this claim clearly is not preserved for our review. As previously discussed, to preserve a claim of trial error for purposes of appellate review, an objection to the claimed error must have been made at trial. Md. Rule 8-131(a). Grandison made not one objection during the prosecution's entire closing argument. Consequently, the propriety of the prosecution's closing argument is not an issue properly before the court. See Apple v. State, 190 Md. 661, 666-67, 59 A.2d 509, 511-12 (1948); Stevenson v. State, 94 Md. App. 715, 730, 619 A.2d 155, 162 (1993).\n\nEven if the issue had been preserved, Grandison still would not be entitled to a new sentencing proceeding. The regulation of argument rests within the sound discretion of the trial court. E.g., Booth v. State, 327 Md. 142, 193, 608 A.2d 162, 187, cert. denied, 506 U.S. 988, 113 S. Ct. 500, 121 L. Ed. 2d 437 (1992) (Booth IV). Although the scope of what may be said in closing argument is not without limitation,\n\n\"counsel is afforded wide latitude in presenting closing summation to the jury. The prosecutor is allowed liberal freedom of speech and may make any comment that is warranted by the evidence or inferences reasonably drawn therefrom.\"\n\nOken v. State, 327 Md. 628, 676, 612 A.2d 258, 281 (1992), cert. denied, 507 U.S. 931, 113 S. Ct. 1312, 122 L. Ed. 2d 700 (1993) (quoting Jones v. State, 310 Md. 569, 580, 530 A.2d 743, 748 (1987)). Accordingly, counsel\n\n\"[is] free to comment legitimately and to speak fully, although harshly, on the accused's actions and conduct if the evidence supports his comments . . . [and] may indulge in oratorical conceit or flourish and in illustrations and metaphorical allusions.\"\n\nWilhelm v. State, 272 Md. 404, 412-13, 326 A.2d 707, 714 (1974).\n\nWhether any impropriety occurred in the closing argument rests largely within the control and discretion of the presiding judge. Evans v. State, 333 Md. 660, 678, 637 A.2d 117, 126 (1994) (Evans III). When a portion of the closing argument is examined in a death penalty case, it must be reviewed in the context of the entire argument and the court's instructions on the law. An appellate court should not disturb the trial court's judgment absent a clear abuse of discretion by the trial court of a character likely to have injured the complaining party. Booth IV, 327 Md. at 193, 608 A.2d at 187; Henry v. State, 324 Md. 204, 230 n.5, 596 A.2d 1024, 1037 n.5, cert. denied, 503 U.S. 972, 112 S. Ct. 1590, 118 L. Ed. 2d 307 (1992); Hunt, 321 Md. at 435, 583 A.2d at 241. No such abuse occurred in the instant case.\n\nA.\n\nThe reference to Grandison having money\n\nDuring its rebuttal argument, the prosecution, in response to Grandison's argument that he did not have money to hire Evans to kill the victims, reminded the jury that a large quantity of drugs had been found in the Warren House motel room rented by Grandison prior to his arrest on the federal narcotics charges. The prosecution then concluded that Grandison must have had money because he was a drug dealer. Contrary to Grandison's assertions, our characterization in Grandison II of the admissibility of evidence relating to the then pending drug charges did not constitute a bar to how Grandison's involvement with drugs could be treated in closing argument at the instant resentencing proceeding. Here, the prosecution simply argued an inference reasonably drawn from the evidence as permitted by, e.g., Oken, 327 Md. at 676, 612 A.2d at 281. No impropriety occurred here by allowing these remarks.\n\nB.\n\nThe \"prime subject\" comments\n\nGrandison argues that by making these comments, the prosecution told the jury that it could infer the existence of the aggravating circumstance from the fact that the police had targeted Grandison in the slayings. We find it clear from the nature of the comments at issue that the prosecution did no such thing.\n\nAll the prosecution said was what the evidence showed, namely, that although Evans actually killed the victims, he did so at the direction of Grandison. The police suspected Grandison from the beginning, and the investigation ultimately yielded evidence that supported their suspicions. The trial court did not abuse its discretion in allowing these remarks.\n\nC.\n\nThe arguments against a life sentence\n\nGrandison contends that the prosecution's arguments against a life sentence amounted to an improper argument that a death sentence must be imposed to comport with community standards. We disagree.\n\nRead in context, it is clear that the prosecution was not arguing that the death penalty should be imposed based on some general principle. Rather, the prosecution was arguing that the nature of these particular crimes warranted more than life imprisonment and that imposition of the death penalty in this case would be an expression of the jury's outrage at Grandison's particularly offensive criminal conduct. The Supreme Court has opined:\n\n\"In part, capital punishment is an expression of society's moral outrage at particularly offensive conduct. This function may be unappealing to many, but it is essential in an ordered society that asks its citizens to rely on legal processes rather than self-help to vindicate their wrongs.\"\n\nGregg v. Georgia, 428 U.S. 153, 183, 96 S. Ct. 2909, 2930, 49 L. Ed. 2d 859, 880 (1976) (footnote omitted); see Colvin-El, 332 Md. at 176-77, 630 A.2d at 741. There was no error.\n\nD.\n\nThe \"con\" remarks\n\nGrandison argues that the remarks made to the jury exhorting them not to be \"conned\" by Grandison, coupled with the remark that Grandison had \"conned\" the victims, was designed to inflame the jury by personalizing the crimes. We disagree.\n\nIt is entirely improper for a prosecutor to make remarks calculated to inflame the jury, e.g., Hunt, 321 Md. at 435, 583 A.2d at 241, but we conclude that the comments challenged here were not inflammatory. These remarks were simply an assessment of Grandison's demeanor, and was the type of comment we held not improper in Oken, where the prosecutor had told the jury that looks could be deceiving and the defendant's demeanor concealed the monster within. Oken, 327 Md. at 674-77, 612 A.2d at 280-82. The challenged remarks in this case pale in comparison to those we found permissible in Oken.\n\nE.\n\nThe allocution comments\n\nGrandison argues that the comments by the prosecution as to the weight Grandison's allocution should be given were wholly improper and smacked of the same type of argument condemned by this Court in Hunt. We disagree.\n\nIn Hunt, the prosecution referred to Hunt's allocution as \"worthless,\" and stated that it was \"trash\" and had been written by \"God knows who.\" Hunt, 321 Md. at 434-36, 583 A.2d at 241-42. We explained that, although the prosecution was not free to tell the jury it could not consider the defendant's allocution, the prosecutor's comments were merely a strong suggestion to the jury that it should not consider the defendant's allocution. Id. at 436, 583 A.2d at 241-42. Similarly, the prosecution's remarks here were not tantamount to telling the jury that it could not consider Grandison's allocution; they simply suggested to the jury that it should not consider Grandison's allocution because he was not under oath or subject to cross-examination. It is permissible for the prosecution to distinguish between testimony and allocution and to urge rejection of the latter based on the absence of an oath and cross-examination. Booth v. State, 306 Md. 172, 199, 507 A.2d 1098, 1112 (1986) (Booth II). Finally, the judge instructed the jury that Grandison's allocution was evidence and, as such, could be given whatever weight the jury chose to attribute it. No error was committed in allowing these remarks.\n\nF.\n\nThe cumulative effect\n\nGrandison argues that the cumulative effect of all of the challenged remarks entitles him to a new sentencing proceeding. We disagree.\n\nIn Gilliam v. State, 331 Md. 651, 629 A.2d 685 (1993), cert. denied, U.S. , 114 S. Ct. 891, 127 L. Ed. 2d 84 (1994), in rejecting a \"cumulative effect\" argument in the context of an ineffective assistance of counsel claim, we stated that \"this is not a case where the cumulative effect of numerous interrelated errors in aggregate amount to inadequate representation. This is more a case of the mathematical law that twenty times nothing is still nothing.\" Gilliam, 331 Md. at 686, 629 A.2d at 703. In the case sub judice, we hold that five times nothing is still nothing.\n\nX\n\nGrandison next argues that under \"Wharton's Rule,\" or the \"concert of action rule\" (i.e., an individual cannot be prosecuted for both a substantive offense and conspiracy to commit that offense where an agreement between two or more persons is a necessary element of the substantive crime), in a case of murder for hire, the hirer cannot be prosecuted for both murder and conspiracy. We reject that notion.\n\nIn Grandison II, we rejected Grandison's claim that his murder and conspiracy convictions should be merged. Grandison II, 305 Md. at 759, 506 A.2d at 617. His present argument is essentially the same. \"Murder for hire\" is not a crime unto itself. In the context of a capital sentencing proceeding, it is merely a factor which makes the crime of first degree murder eligible for the death penalty. At the guilt/innocence phase of his trial, Grandison was convicted of two first degree murders and conspiracy to commit those murders--not two murders for hire. As we explained in Grandison II, these two offenses are distinct because a necessary element of murder is the completion of the crime. Id. The concert of action rule is not applicable here. The trial court properly denied Grandison's motion to dismiss based on this issue.\n\nXI\n\nGrandison requested that the trial court bifurcate the sentencing proceedings so that the jury would have to decide whether the aggravating circumstance was proven before hearing evidence on mitigation and argument on balancing. The trial court denied Grandison's motion. Grandison argues that it was reversible error to allow the jury to consider victim impact evidence while determining whether the aggravating circumstance existed. We do not agree.\n\nIn Hunt, (supra) , we rejected the idea of bifurcation of capital sentencing proceedings. Hunt, 321 Md. at 447-48, 583 A.2d at 247. Hunt was decided before the Supreme Court's decision in Payne v. Tennessee, 501 U.S. 808, 111 S. Ct. 2597, 115 L. Ed. 2d 720 (1991) which authorized the use of victim impact evidence in capital cases. Grandison contends that because Hunt predated Payne, we were not concerned in Hunt with assuring that the jury give victim impact evidence proper consideration. Grandison now urges us to hold that, since the Supreme Court's decision in Payne, the better policy is for trial courts to bifurcate capital sentencing proceedings whenever the State intends to use victim impact evidence. Grandison, however, ignores several of our decisions since Payne. In Wiggins v. State, 324 Md. 551, 577-78, 597 A.2d 1359, 1371-72 (1991), cert. denied, 503 U.S. 1007, 112 S. Ct. 1765, 118 L. Ed. 2d 427 (1992), we observed that Md. Rule 4-343(e), which prescribes the form for jury deliberation of sentence in a capital case, does not require a bifurcated sentencing proceeding. In Booth IV, 327 Md. at 160-61, 608 A.2d at 170-71, we held that Md. Rule 4-343, and the sentencing form it incorporates, are binding, and make clear that capital sentencing issues are to be resolved in a single proceeding, leaving no discretion with the trial court to permit a bifurcated proceeding. To hold otherwise would convert what is already a bifurcated proceeding \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e into a trifurcated one. Bruce v. State, 328 Md. 594, 609, 616 A.2d 392, 399-400 (1992), cert. denied, 508 U.S. 963, 113 S. Ct. 2936, 124 L. Ed. 2d 686 (1993) (Bruce II). Payne does not compel a departure from our position on a bifurcated sentencing proceeding.\n\nXII\n\nGrandison next argues that the trial court erred during the sentencing proceedings in not instructing the jury on the doctrine of transferred intent. He contends that such an instruction was required because the \"murder for hire\" aggravating circumstance could be proven only by resorting to a transferred intent theory. At the guilt/innocence phase of Grandison's trial, the focus was on proving the concurrence of a mens rea with the actus rea. As Grandison intended Evans to shoot Cheryl Piechowicz, but Evans actually shot Susan Kennedy, the transferred intent theory may have been relevant at the trial. See Grandison II, 305 Md. at 771-72, 506 A.2d at 623-24. At sentencing, however, it is not relevant that Evans mistakenly shot Kennedy; the fact that Grandison hired Evans to shoot the Piechowiczes is the aggravating factor. The court, under Md. Rule 4-325(c), is required to instruct the jury only as to the applicable law. See Evans III, 333 Md. at 691, 637 A.2d at 134. Transferred intent had no place at the resentencing proceeding and was not \"applicable law.\" The trial court, therefore, properly declined to instruct the jury on that issue.\n\nXIII\n\nUndeserving of extended discussion is Grandison's argument that the Maryland death penalty statute is unconstitutional because it mandates a sentence of death if the aggravating circumstances outweigh the mitigating circumstances by only a preponderance of the evidence. Neither the United States Constitution nor the Maryland Declaration of Rights is offended by the use of the preponderance of the evidence standard in considering the appropriateness of the death penalty. Grandison's argument, though made time and time again over the years, has been consistently rejected by this Court. See, e.g., Wiggins v. State, 324 Md. 551, 582-83, 597 A.2d 1359, 1374; Collins v. State, 318 Md. 269, 296, 568 A.2d 1, 14, cert. denied, 497 U.S. 1032, 110 S. Ct. 3296, 111 L. Ed. 2d 805 (1990); Foster v. State, 304 Md. 439, 477, 499 A.2d 1236, 1255-56 (1985), cert. denied, 478 U.S. 1010, 106 S. Ct. 3310, 92 L. Ed. 2d 723 (1986); accord Blystone v. Pennsylvania, 494 U.S. 299, 304-05, 110 S. Ct. 1078, 1082-83, 108 L. Ed. 2d 255, 263 (1990).\n\nAs we pointed out in Collins, the sentencer, under Maryland's capital sentencing scheme, \"may not even consider the appropriateness of a death sentence unless the State has established, beyond a reasonable doubt, that one or more statutory aggravating circumstances exist.\" Collins, 318 Md. at 296, 568 A.2d at 14. The State also bears the burden of showing that the aggravating circumstances outweigh the mitigating circumstances. Id. We see no reason to retreat from our well-settled body of law holding that the preponderance of the evidence standard in that instance is constitutionally proper.\n\nXIV\n\nDuring the resentencing hearing, the State presented victim impact evidence and statements attached to the original presentence investigation report. Grandison challenges the use of this evidence, contending that the sentencer in a capital case cannot consider factors beyond the aggravators listed in Art. 27, § 413(d). He asserts that to the extent Maryland law allows the sentencer in a capital proceeding to consider victim impact evidence and a presentence investigation report, it is violative of due process. Grandison urges us to reconsider our decision on this very issue in Evans III, arguing that admitting the evidence in this case \"permitted the jury to impose a death sentence even if it determined that the statutory aggravators did not outweigh the statutory mitigators, as long as the victim impact testimony and pre-sentence report tipped the balance.\"\n\nGrandison makes exactly the same argument as the appellant in Evans III, \"that the weighing of statutory aggravating and mitigating circumstances prescribed by § 413(h) precludes the jury's consideration of any other evidence.\" Evans III, 333 Md. at 686, 637 A.2d at 130. Our response to that argument now is the same as it was then:\n\n\"We examined the legislative intent of the provisions addressing victim impact statements at length in Lodowski v. State, 302 Md. 691, 490 A.2d 1228 (1985), vacated on other grounds, 475 U.S. 1078, 106 S. Ct. 1452, 89 L. Ed. 2d 711 (1986). After analyzing the legislative history, we stated:\n\n'It is apparent that the legislature intended that victim impact statements be admissible in capital case sentencing proceedings. Furthermore, the legislature declared admissible 'any other evidence that the court deems of probative value and relevant to sentence, provided the defendant is accorded a fair opportunity to rebut any statements.' Art. 27, § 413(c)(1)(v).'\n\n\" 302 Md. at 738-739, 490 A.2d at 1252. We also recognized in Lodowski that 'there is a reasonable nexus between the impact of the offense upon the victim or the victim's family and the facts and circumstances surrounding the crime especially as to the gravity or aggravating quality of the offense.' Id. at 741-42, 490 A.2d at 1254. Thus, as the jury weighs the circumstances pursuant to § 413(h), victim impact evidence may 'assist [the jury] in weighing the degree of harm that the defendant has caused and the corresponding degree of punishment that should be inflicted.' Booth v. Maryland, 482 U.S. [496] at 516, 107 S. Ct. [2529] at 2539, 96 L. Ed. 2d [440] at 456 (White, J., dissenting).\n\n\"Because such evidence may be both relevant and probative, we concluded in Lodowski that \"the impact of the crime on the victim . . . can properly be included in the presentence report.\" 302 Md. at 742, 490 A.2d at 1254 (quoting Sandvik v. State, 564 P.2d 20, 23 (Alaska, 1977)). Furthermore, in light of the legislative history concerning victim impact evidence and the broad discretion vested in a sentencing judge, we also held that 'the victim and other persons, may, in the discretion of the judge presiding at the sentencing stage of the trial, testify in open court concerning the impact the offense had on the victim and members of his family.' Id. at 749, 490 A.2d at 1257.\"\n\nEvans III, 333 Md. at 686-87, 637 A.2d at 130 (footnotes omitted). We have adopted and relied on the reasoning in Lodowski many times. See, e.g., Bloodsworth v. State, 307 Md. 164, 192, 512 A.2d 1056, 1070 (1986); Grandison II, 305 Md. at 752-54, 506 A.2d at 614. We decline to retreat from our prior interpretation of the statute in this case. If the jury is instructed in accord with the dictates of the statute, its sentencing decision comports with constitutional dictates. \"Once the jury finds that the defendant falls within the legislatively defined category of persons eligible for the death penalty . . . the jury then is free to consider a myriad of factors to determine whether death is the appropriate punishment.\" California v. Ramos, 463 U.S. 992, 1008, 103 S. Ct. 3446, 3457, 77 L. Ed. 2d 1171, 1185 (1983). \"'The Constitution does not require the jury to ignore other possible . . . factors in the process of selecting . . . those defendants who will actually be sentenced to death.'\" Id. (quoting Zant v. Stephens, 462 U.S. 862, 878, 103 S. Ct. 2733, 2743, 77 L. Ed. 2d 235, 251 (1983)). The victim impact evidence and the presentence report were properly admitted.\n\nXV\n\nGrandison alleges that he did not know he would be representing himself at the resentencing until he was ordered to do so shortly before the trial began. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Consequently, he contends that the trial court erroneously denied his request for a continuance. The continuance, according to Grandison, was necessary because he needed time to familiarize himself with all of the materials which the prosecution had provided him in discovery.\n\nThe grant or refusal of a request for a continuance is a decision entrusted to the sound discretion of the trial court. Evans v. State, 304 Md. 487, 514, 499 A.2d 1261, 1275 (1985), cert. denied, 478 U.S. 1010, 106 S. Ct. 3310, 92 L. Ed. 2d 722 (1986) (Evans II). Grandison had eight days to prepare for the proceeding, which was a resentencing rather than an original sentencing in which he might be unfamiliar with the evidence.\n\nThe record also reflects that Grandison had spent the vast majority of his time in prison since 1983 poring over transcripts of the initial sentencing hearing and the applicable law. The eight-day period before the sentencing proceeding provided Grandison with ample time in which to summons witnesses and familiarize himself with the relevant facts and law that he had previously researched. The trial court's decision to deny the requested continuance was not an abuse of its discretion.\n\nXVI\n\nOne week before the beginning of Grandison's resentencing proceeding, the State executed John Thanos, a convicted murderer. The execution received a considerable amount of media coverage. One of Thanos's victims lived on the Eastern Shore of Maryland, not far from where Grandison's proceeding was being conducted. Grandison requested that the trial court inquire of prospective jurors during voir dire whether they had any relationship to Thanos's victims because any such persons might be so prejudiced as to require disqualification. The trial court refused to make such a specific inquiry. Grandison contends that such refusal constituted reversible error. We are not persuaded.\n\nThe scope of voir dire is a matter entrusted to the sound discretion of the trial court. Davis v. State, 333 Md. 27, 34, 633 A.2d 867, 870-71 (1993) (citing Casey v. Roman Catholic Archbishop, 217 Md. 595, 605, 143 A.2d 627, 631 (1958)). Another question propounded to the venire by the trial court was sufficient to expose what Grandison asserts he sought to discover. The court asked prospective jurors whether any member of their immediate families or any close friends had been the victim of or a witness to a crime. If any of the prospective jurors were related to one of Thanos's victims, this question should have elicited information to that effect. The trial judge did not abuse his discretion by refusing to propound Grandison's question to the venire.\n\nXVII\n\nGrandison next argues that the trial court erred by admitting several of his prior convictions and bad acts and the circumstances underlying those matters. Specifically, he complains of the admission of various prison infractions and details of his federal trials. Grandison admits that \"evidence of institutional behavior is generally admissible at the sentencing phase of a capital case,\" but then urges that \"such evidence should be limited to the fact of the infractions\" and \"should not include a detailed factual recount of the incidents, because the prejudicial impact of the underlying facts far outweighs any probative value they may have on sentencing issues.\" Furthermore, Grandison argues, it was error to admit those prison infractions for which there had never been an institutional finding against him, because, absent such findings, \"the hearsay allegations of prison guards do not have sufficient indicia of reliability to be admitted in a capital case.\" Finally, Grandison contends that the trial court erred by admitting evidence of his federal convictions for witness tampering and civil rights violations arising out of the same incident as the instant case.\n\nGrandison concludes that these alleged errors require reversal of his death sentences. We disagree with all of Grandison's claims of error; however, we will address his last claim, of the improper admission of his prior federal convictions, in part XXVI, (infra).\n\nMd. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 413(c)(1)(iv) makes admissible \"any presentence investigation report\" except for any recommendation as to the appropriate sentence. See Colvin-El v. State, 332 Md. 144, 165, 630 A.2d 725, 736 (1993), cert. denied, U.S. , 114 S. Ct. 2725, 129 L. Ed. 2d 849 (1994); Bruce II, 328 Md. at 631, 616 A.2d at 410. We have previously explained that:\n\n\"the defendant's prior institutional history is an important part of [a presentence investigation] report because it provides an indication of the defendant's adjustment to prison life. His adjustment may be a consideration for the jury when it decides the appropriateness of the death penalty. A defendant's institutional conduct after an offense has been committed may provide the jury with a better understanding of the defendant and the appropriate sentence.\"\n\nHunt, 321 Md. at 430-31, 583 A.2d at 239. Furthermore, also admissible at a capital sentencing proceeding is any other reliable evidence that the trial court deems of probative value and relevant to sentence, provided the defendant is given a fair opportunity to rebut any such evidence. Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 413(c)(1)(v).\n\nWe have said that inflammatory and detailed evidence of the underlying facts and circumstances surrounding unrelated crimes is foreclosed in a capital sentencing proceeding. Scott v. State, 297 Md. 235, 247, 465 A.2d 1126, 1133 (1983) (Scott I). The underlying facts and circumstances in the presentence investigation report (PSI) to which Grandison objects, however, do not fall within this classification. They have probative value to the sentencing jury and are otherwise admissible as discussed above. In any event, we previously held that the underlying facts revealed in connection with the PSI's recount of Grandison's federal drug charges revealed not much more than that which was evident from the fact of the convictions and were not inflammatory. Grandison II, 305 Md. at 758, 506 A.2d at 616-17. Likewise, the disclosed facts of which Grandison now complains, in the heavily edited version of the PSI that went to the jury, were not inflammatory and revealed little beyond what was revealed by the very fact of the convictions and infractions.\n\nWith respect to Grandison's argument that prison infractions for which there had been no institutional finding of guilt should have been redacted from the PSI, Hunt is dispositive. Hunt argued that evidence of unadjudicated prison infractions was inadmissible. In rejecting that argument we reasoned that:\n\n\"there is simply no comparison between the admission of a reliable report of prison conduct, which concededly occurred, and the admission of unadjudicated murder charges.\"\n\nHunt, 321 Md. at 433, 583 A.2d at 240; accord State v. Calhoun, 306 Md. 692, 728, 511 A.2d 461, 479 (1986), cert. denied, 480 U.S. 910, 107 S. Ct. 1339, 94 L. Ed. 2d 528 (1987); Huffington v. State, 304 Md. 559, 577-78, 500 A.2d 272, 281 (1985), cert. denied, 478 U.S. 1023, 106 S. Ct. 3315, 92 L. Ed. 2d 745 (1986). In the instant case, the challenged information was both relevant to Grandison's sentence and reliable. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The trial court committed no error in admitting the evidence contained in the edited PSI.\n\nXVIII\n\nHelen Kondilidis was a witness for the State at Grandison's first trial. She testified that on the afternoon of the killings, she saw Vernon Evans carrying a tan gym bag in the lobby of the Warren House. This evidence was important to the State's case because it placed Evans, the man whom Grandison hired, at the scene of the crime.\n\nAt the resentencing, Ms. Kondilidis did not testify. Over defense objection, the trial court permitted the State to read the transcript of Ms. Kondilidis's testimony from the first trial to the resentencing jury. Thus, her former testimony was received as substantive evidence at the resentencing. Grandison contends that the admission of Ms. Kondilidis's former testimony constituted reversible error. We do not accept that proposition.\n\nIn Tichnell v. State, 290 Md. 43, 427 A.2d 991 (1981), we recognized that admission of evidence at a capital sentencing proceeding is governed by what is now Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 413(c), and that § 413(c) contained no express provision for the admission of testimony from earlier trials. We concluded that:\n\n\"absent agreement of the parties, or a showing of unavailability of the witnesses to testify at the separate sentencing hearing, we conclude that § 413(c) does not permit, over timely objection, the admission in evidence before a new sentencing jury of the prior recorded trial testimony to prove the existence or absence of aggravating or mitigating circumstances.\"\n\nTichnell, 290 Md. at 63, 427 A.2d at 1001 (emphasis added). Grandison urges us to find that Ms. Kondilidis's former testimony was inadmissible because there was not a sufficient showing that she was unavailable for the resentencing. He does not contest the reliability of the former testimony.\n\nThe prosecution informed the trial court that it wished to introduce Ms. Kondilidis's former testimony because she was stricken with ovarian and cervical cancer. The prosecution stated that it had spoken with Ms. Kondilidis's doctor and learned that Ms. Kondilidis was undergoing chemotherapy. The prosecution further proffered that Ms. Kondilidis's condition had worsened, that she was now hospitalized, and that her doctor had warned that Ms. Kondilidis could not testify and requiring her to do so could cause her irreparable harm. The prosecution then referred the court to a letter from Ms. Kondilidis's doctor which stated that due to her condition, Ms. Kondilidis would be unable \"to be present in court at any time in the near future.\" \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The defense proffered nothing to render suspect the State's assertions regarding the witness's unavailability.\n\nBased upon the information before it, the substance of which was not contested, the trial court found that the prosecution had met its burden of showing that Ms. Kondilidis was unavailable and ruled that her former testimony could be introduced. We hold that the trial court had sufficient information before it to find that Ms. Kondilidis was unavailable to testify; therefore, the court properly admitted her former testimony.\n\nXIX\n\nGrandison argues that the evidence presented at the sentencing hearing was insufficient to prove the \"murder for hire\" aggravator set forth in Art. 27, § 413(d)(7). He contends that the doctrine of transferred intent was necessary to prove the aggravator and that the trial court erred in refusing to instruct the jury on the doctrine of transferred intent.\n\nAs discussed in part XII, (supra) , the transferred intent doctrine was in no way necessary to a finding that the murder was for hire. The doctrine had no place in the sentencing proceeding because the State merely was required to prove that Grandison hired Evans to commit murder. The fact that the wrong person was killed is inconsequential at sentencing; the agreement is the gravamen of the aggravating factor. There is no question that the evidence presented was sufficient to prove the existence of an agreement. As transferred intent was not relevant, the jury could properly conclude that the aggravator was established absent any instruction regarding transferred intent.\n\nXX\n\nThe State called Janet Moore as a witness to establish Grandison's complicity in the murders. Upon direct examination by the State, Moore testified regarding several events that allegedly occurred among her, Grandison, Vernon Evans, Charlene Sparrow, and Rodney Kelly. Moore testified that on April 28, 1983, she received a telephone call from Grandison asking her to call Kelly. Moore further testified that during the ensuing telephone conversation, she overheard Grandison tell Evans that Kelly was coming up to the motel to show him \"who the white couple was.\" Moore testified to a similar conversation which occurred later that same day in which Evans requested that she ask Grandison if the gun was automatic or whether it \"clicked.\"\n\nJanet Moore stood trial in federal court as a codefendant with Evans, Kelly, and Grandison for conspiracy to violate the civil rights of David and Cheryl Piechowicz and other criminal violations. Moore was sentenced to fifty years in federal prison. During the course of that trial, Moore called several witnesses to establish her alibi as to her whereabouts on the dates and times of the alleged three-way telephone conversations and to dispute various allegations that she had visited Evans, Sparrow, and Grandison. Specifically, Moore's niece, Darcy Meatia, testified that she and Moore were shopping from approximately 3:00 pm until 9:00 pm on April 27, 1983.\n\nAt the resentencing hearing, Moore testified that she was at Grandison's residence on April 27, 1993, and Grandison attempted to impeach Moore with her niece's earlier testimony to show that she was at her father's residence rather than at Grandison's residence as Moore was now testifying. The State objected to the attempted impeachment, and the trial court ruled that Grandison could not use the federal trial transcript to impeach Moore unless he could show that Meatia was unavailable; the court did, however, rule that Grandison could ask Moore whether she called her niece as a witness in another proceeding. When asked that question, Moore responded, \"not as I recall.\" Grandison then sought to refresh Moore's recollection with the federal trial transcript, and Moore acknowledged that her niece had testified. The trial court upheld the State's objections to Grandison's next three questions: (1) whether Moore's niece in fact had testified as an alibi witness; (2) whether Moore had asked her niece to perjure herself in the federal proceedings; and (3) whether Moore's niece had given contradictory testimony during the federal trial.\n\nGrandison contends that the trial court erred in not allowing him to ask Janet Moore those three questions. The crux of Grandison's argument is his belief that he was entitled to try to establish that Moore, through the testimony offered by her niece at the federal trial, had made statements inconsistent with the testimony Moore was offering at the resentencing proceeding concerning her whereabouts on April 27 and 28, 1983. He claims that because the above-referenced questions served to establish that Moore had made a prior inconsistent statement, the trial court should have permitted the questions.\n\nGrandison also argues that he was entitled to pursue this line of questioning to establish subornation of perjury as a prior crime or bad act which would be relevant to Moore's credibility. Mere conflicts in testimony, however, do not constitute subornation of perjury. See Md. Code (1957, 1992 Repl. Vol.), Art. 27, § 438 (setting forth the elements of subornation of perjury). Without any factual predicate upon which to base the allegation of subornation of perjury, Grandison was not entitled to explore this line of inquiry.\n\nThe trial court was correct in ruling that Grandison could not use the federal trial transcript unless he could show that Darcy Meatia was unavailable. Although former testimony under oath is admissible as an exception to the hearsay rule, it is predicated on proof that the witness is currently unavailable. See, e.g., Tichnell, (supra) ; Yellow Cab Co. v. Henderson, 183 Md. 546, 39 A.2d 546 (1944); part XVIII, (supra) . No such proof was offered by Grandison during Moore's testimony. Although the other requirements under the former testimony exception may have been satisfied in this case, the failure to show unavailability precluded the admission of the federal trial transcript for impeachment purposes. This was not a situation in which, as Grandison contends, the prior inconsistent statement or past recollection recorded analyses would apply; the former testimony exception was the only one applicable and its requirements were not met.\n\nXXI\n\nIn rebuttal closing argument, one of the prosecutors made the following remarks:\n\n\"[Grandison] says to you that the sentences of Janet Moore and Rodney Kelly should be mitigating circumstances. Janet Moore and Rodney Kelly went on trial in federal court. You heard that. A judge sentenced them to what he thought was appropriate. They each got 50 years.\n\n\"They then came into Baltimore County Circuit Court and the prosecutor then, Dana Levitz, allowed them to plead guilty to concurrent time without cutting any kind of a deal.\n\n\"But consider Janet Moore and Rodney Kelly's role in this whole matter. They were used by the Defendant. They enabled him to do this. Neither one of them could possibly be subjected to the death penalty because, as you know, from the findings and sentencing determination sheet that only the trigger man or the person in the Defendant's position could actually be subjected to the death penalty. It says so in that first section. That is the first determination that you have to make. So they could not have gotten the death penalty.\"\n\nGrandison raised no objection during the prosecutor's rebuttal argument or at any other time before the jury retired to deliberate. Only after the jury retired did Grandison note any objection to the prosecutor's rebuttal, and at that time he only argued that the prosecutor improperly argued that Kelly and Moore were not death-eligible.\n\nGrandison, however, now contends that\n\n\"the [prosecutor's] remarks in the case sub judice were not only inappropriate during its final summation, but it was meant outrightly and intentionally to misstate the evidence and to mislead the jury as to the sentences Rodney Kelly received in the federal and state courts, as well as the facts and circumstances surrounding the plea agreement between themselves and Kelly and Moore.\"\n\nAs Grandison only objected to the reference by the State that Kelly and Moore were not death-eligible, he failed to preserve any other objections for review. See State v. Hutchinson, 287 Md. 198, 202, 411 A.2d 1035, 1037 (1980); see also Oken, 327 Md. at 675, 612 A.2d at 281 (an objection to closing argument is timely if made at the conclusion of argument while the trial court has \"a reasonable opportunity to correct the situation.\").\n\nEven if Grandison's belated objection to the prosecutor's characterization of Kelly and Moore as death-ineligible was preserved, it still fails on its merits. The general standards for determining whether the trial court's failure to take action with respect to the challenged argument of counsel constituted reversible error are well-settled. The regulation of argument rests within the sound discretion of the trial court. Booth IV, supra, 327 Md. at 193, 608 A.2d at 187. An appellate court should not interfere with the trial court's judgment unless there has been an abuse of discretion of a character likely to have injured the complaining party. Henry v. State, 324 Md. 204, 231, 596 A.2d 1024, 1038, cert. denied, 503 U.S. 972, 112 S. Ct. 1590, 118 L. Ed. 2d 307 (1992). In determining whether an argument of counsel amounted to an unconstitutional restriction of the defendant's right to consideration of non-statutory mitigating evidence, the relevant question is \"'whether there is a reasonable likelihood that the jury has applied the challenged [remarks] in a way that prevents the consideration of constitutionally relevant evidence.'\" Johnson v. Texas, 509 U.S. 350, , 113 S. Ct. 2658, 2669, 125 L. Ed. 2d 290, 306 (1993) (quoting Boyde v. California, 494 U.S. 370, 380, 110 S. Ct. 1190, 1198, 108 L. Ed. 2d 316, 329 (1990)). \"'Reversal is only required where it appears that the remarks of the prosecutor actually misled the jury or were likely to have mislead or influenced the jury to the prejudice of the accused.'\" Oken, 327 Md. at 676, 612 A.2d at 281 (quoting Jones v. State, 310 Md. 569, 580, 530 A.2d 743, 748 (1987).\n\nThe evidence in this case as well as in the first sentencing proceeding was overwhelming that it was Grandison, not Kelly and Moore, who hired Evans to kill the Piechowiczes. See Grandison II, 305 Md. at 767, 506 A.2d at 621. The trial court properly exercised its discretion in rejecting Grandison's objection.\n\nXXII\n\nIn addition to the prosecutor's rebuttal closing argument, Grandison identifies one other respect in which he argues his efforts to have the jury consider a mitigating factor were improperly restricted. The trial court refused to admit a transcript of the December 19, 1983 proceeding wherein Kelly and Moore pled guilty before Judge John F. Fader II in the state court prosecutions for the murders. Grandison contends that the court should have also admitted copies of an indictment and certified docket entry relating to an armed robbery for which Kelly was indicted on April 11, 1983. Grandison states that these exhibits were relevant to show as a mitigating factor that one of Grandison's co-conspirators received a sentence of less than death and that a death sentence in his case, therefore, would be inappropriate. In both Eddings v. Oklahoma, 455 U.S. 104, 113-14, 102 S. Ct. 869, 876-77, 71 L. Ed. 2d 1, 10-11 (1982) and Lockett v. Ohio, 438 U.S. 586, 604, 98 S. Ct. 2954, 2964-65, 57 L. Ed. 2d 973, 990 (1978), the Supreme Court held that a sentencer may not be precluded from considering, and may not refuse to consider, as a mitigating factor, any relevant aspect of the defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\n\nWe note first that the trial court never resolved the question of whether the transcript of the December 19, 1983 guilty plea hearing should be excluded, because Grandison never formally offered the exhibit into evidence. When the transcript issue initially arose, it was brought up in conjunction with the docket entries and indictment, and the court at that time reserved its ruling. Later in the day, Grandison had the docket entries and indictment marked and argued for their admission. The transcript was not marked until later, and at that time it was only used to refresh the recollection of Janet Moore. Grandison never offered the transcript into evidence. As he never sought a ruling from the court regarding the transcript's admissibility, his claim regarding the transcript is not preserved for our review. Md. Rule 8-131(a) (providing that appellate review is ordinarily unavailable as to an issue not \"raised in or decided by the trial court\").\n\nMoreover, even if the claim was preserved, the docket entries and indictment which Grandison sought to have entered into evidence contained information regarding an unrelated armed robbery charge for which Kelly was indicted and later released on his own recognizance as part of his plea agreement for the murder charges. Any favorable treatment Kelly received in this unrelated case was not relevant mitigating evidence under Eddings and Lockett, because it did not concern Grandison's character or background or circumstances of his offense. See Franklin v. Lynaugh, 487 U.S. 164, 174, 108 S. Ct. 2320, 2327, 101 L. Ed. 2d 155, 166 (1988). (No constitutional right to have possible \"residual doubts\" of a guilt-phase jury considered by a sentencing jury as a mitigating factor). The trial court committed no error in declining to admit the docket entries and indictment.\n\nXXIII\n\nGrandison next submits that the evidence was insufficient to establish the \"murder for hire\" aggravating circumstance. Grandison contends that there was no evidence independent of that offered by the alleged accomplices to the crime which tended to establish that he engaged another person to commit the killings for money.\n\nThe applicable standard of review is whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt. See Booth IV, 327 Md. at 183, 608 A.2d at 182. Evidence produced at the resentencing hearing was sufficient to create the following picture of the events leading up to the murders.\n\nGrandison's federal narcotics case was scheduled for trial the first week in May of 1983. Grandison wrote a letter to Janet Moore on March 14, 1983, which referred to the Piechowiczes and contained a statement that Grandison might get \"Shorty\" to \"take care of something to be on the safe side.\"\n\nOn April 26, 1983, Janet Moore received a telephone call from Grandison in which he asked her to bring Vernon Evans, whose nickname was \"Shorty,\" to see him. Moore drove Evans and Charlene Sparrow to the Baltimore City jail. Once there, Moore filled out a visitor's card, signing her name and Evans's name. The jail visitation card bore the names of \"Janet Grandison and Vernon Evans,\" but Moore stated that when she visited Grandison at the jail, she sometimes used the name \"Janet Grandison.\" After signing the visitation card, Moore went to the restroom. When she returned she overheard Grandison tell Evans that he had to go to court on Monday and that he needed \"that taken care of.\" Grandison then told Moore to take Evans to see Rodney Kelly. Moore complied, taking Evans to Theresa Purdie's home, where they waited for Kelly. Purdie testified that Moore, Evans, and Kelly came to her house that day.\n\nPurdie received a telephone call that day from Grandison and participated in a conversation with Evans, Kelly, and Moore. Moore testified that, during this conversation, Grandison told her to take Evans to the Warren House motel. Moore again complied, and Sparrow registered for a room, later registering for an extra day. On April 28, 1983, Moore arranged a three-way telephone conversation with Grandison and Kelly. She also later connected Grandison with Evans, who was at the Warren House motel. During those conversations, Moore overheard Grandison tell Evans that Kelly would supply Evans with a car.\n\nLater that same day, Moore received a call from Evans while she was on the telephone with Grandison. Evans told Moore to ask Grandison whether the gun was \"automatic or did it click.\" Grandison replied that the gun was an automatic. Sparrow testified that Evans said he was going to be paid $9,000 for the killings. Sparrow also learned from Kelly that Grandison had said Evans could have anything he wanted.\n\nAssuming, without deciding, that corroboration of the testimony of accomplices is necessary for legally sufficient evidence of the aggravating factor, no more than slight corroboration would be demanded. We addressed this same issue in Grandison II, 305 Md. at 767-69, 506 A.2d at 621-22:\n\n\"Certainly the record is replete with statements from co-conspirators, to each other as well as to third persons, the import of which leads elucidatively to the conclusion that Grandison hired Evans to kill the Piechowiczes. Grandison argues, however, that there was no corroboration of Charlene Sparrow's testimony. We think he is wrong. There was testimony from others, not co-conspirators, which did corroborate parts of her testimony. For example, the Baltimore City Jail security officer Drewery testified that Janet Moore and Evans visited Grandison on April 26, 1982 as testified to by Sparrow; Theresa Purdie testified about seeing Kelly, Moore, Sparrow and Evans at her residence at which time Grandison phoned Evans; she also testified that Rodney Kelly and Grandison were friends. Finally, Calvin Harper testified that Kelly showed him a machine pistol which he later saw Kelly give to Evans. He also testified that Kelly had told Mike Queen to get $500.00 from his house, an amount testified to as being given to Evans.\n\n\"It is settled that not much in the way of corroboration of the testimony of a co-conspirator is required. See Brown v. State, 281 Md. 241, 378 A.2d 1104 (1977), where Chief Judge Murphy said, for the Court, in part:\n\n\"'Not much in the way of evidence corroborative of the accomplice's testimony has been required by our cases. We have, however, consistently held the view that while the corroborative evidence need not be sufficient in itself to convict, it must relate to material facts tending either (1) to identify the accused with the perpetrators of the crime or (2) to show the participation of the accused in the crime itself. See Wright v. State, 219 Md. 643, 150 A.2d 733 (1959). If with some degree of cogency the corroborative evidence tends to establish either of these matters, the trier of fact may credit the accomplice's testimony even with respect to matters as to which no corroboration was adduced. McDowell v. State, 231 Md. 205, 189 A.2d 611 (1963). . . . '\n\n\"In the instant case we believe the testimony of Charlene Sparrow was adequately corroborated and sufficient to identify Grandison with the perpetrators of the crime.\"\n\nThat analysis is equally applicable in Grandison's present appeal. At a minimum, that portion of Sparrow's testimony concerning the jail visitation was corroborated by the visitation card. Under McDowell, (supra) , the trier of fact may then credit the remainder of Sparrow's testimony regardless of corroboration. Considering this evidence, there can be no doubt that it was sufficient to support an inference by the jury that Grandison engaged Evans to commit the murders and that the murders were committed for remuneration or the promise thereof.\n\nXXIV\n\nThrough the prosecution's direct examination of Agent Foley, the State established that Grandison was the person whom the police suspected of being involved in the Warren House murders. On cross-examination, Grandison asked Foley if it was true that the police had immediately suspected him of having some connection with the killings. The prosecution, on redirect, asked why Grandison became the target of the investigation \"from the get go.\" \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Foley explained that because no money was taken from the crime scene, robbery was eliminated as the motive for the killings. He further explained:\n\n\"It was obvious to us that our only involvement with the Warren House was that we had recovered narcotics there which we were connecting up with Mr. Grandison.\n\n\"That these people that, two of the people that were there that had been murdered were witnesses against him, that at the suppression hearing that Janet Moore had specifically threatened Cheryl Piechowicz and also on one prior occasion a witness had been injured against Mr. Grandison.\"\n\nGrandison sought a mistrial at that point, contending that (1) Agent Foley's statement regarding a witness who had been injured was a fabrication and the prosecution was thus deliberately presenting perjured testimony and (2) the statement constituted other crimes evidence. The trial court denied the motion for mistrial, and Grandison now contends that ruling was erroneous.\n\nNothing in the record establishes that Agent Foley's statement was false or that the prosecution deliberately elicited false testimony. In fact, the record reflects that Grandison had been charged with, but not convicted of, shooting Joseph Miller, a witness scheduled to testify against Grandison in a federal narcotics case. Although it is true that evidence of a defendant's other crimes or prior bad acts is inadmissible to prove the defendant's propensity to commit a particular crime, such evidence may be admissible if it has some special relevance to the litigation. Harris v. State, 324 Md. 490, 501-02, 597 A.2d 956, 962 (1991). In this case, the challenged remark was offered to show why the police immediately focused their attention on Grandison rather than other possible suspects, and it was admissible for that limited purpose.\n\nXXV\n\nGrandison contends that consistent with death penalty jurisprudence in Eddings and Lockett, supra, he should have been permitted to introduce as evidence of a mitigating circumstance the sentences he had received for the conspiracy and handgun convictions at his first trial.\n\nWhen the trial court discussed the redaction of the presentence investigation report with the parties, Grandison stated that he wanted to argue the sentences received in connection with the conspiracy and handgun convictions as a mitigating circumstance regarding the unlikelihood that he would constitute a continuing threat to society. Grandison wanted to use the sentences without revealing the underlying convictions. The court reserved its ruling at that time, stating that it did not believe the jury could be apprised of the sentences without also being told of the underlying convictions.\n\nTwo days later, the court informed Grandison that if the conspiracy and handgun convictions remained in the presentence investigation report, the jury would be told that it could not consider those convictions in determining the existence of the aggravating circumstance. Grandison replied that he was not opposed to leaving the convictions in the report and later stated that he had decided to not argue the sentences as a mitigating circumstance.\n\nIn Harris v. State, 312 Md. 225, 539 A.2d 637 (1988), we held that the jury should be made aware of the prior sentences when the convictions remain in the presentence investigation report:\n\n\"The robberies of which Harris was convicted were statutory aggravating factors. Art. 27, § 413(d)(10). A sentencer might consider as a mitigating factor (when weighing the possibility of a death sentence) the fact that Harris had been appropriately sentenced for those crimes. Moreover, a sentencing jury, aware of Harris's convictions for armed robbery and use of a handgun, but not being informed of any sentences for them, might conclude that Harris had not been sentenced. The juror might further conclude that the jury sentence was intended to apply to all the crimes committed by Harris during the Hviding episode. Such a conclusion might induce a harsher sentence, whereas awareness of existence and extent of the prior sentences could have a mitigating effect.\"\n\nId. at 251, 539 A.2d at 649-50. See generally Simmons v. South Carolina, U.S. , 114 S. Ct. 2187, 129 L. Ed. 2d 133 (1994). Thus, Grandison was entitled to argue the sentences in mitigation. During the proceeding, however, Grandison made a conscious decision to not make any such argument. He could have presented his position to the trial judge, requesting permission to argue the sentences in mitigation, but he chose to not pursue the issue. In addition, in his closing argument, Grandison proceeded to inform the jury that imposing a sentence of death would not be appropriate because he was serving other sentences long enough to ensure that he would \"never see the street again.\" By not raising the issue in the trial court, Grandison has not preserved it for our review.\n\nXXVI\n\nGrandison contends that the trial court erred in refusing his request to redact from the PSI the information concerning the federal convictions for witness tampering and civil rights violations which arose out of the same incident as the case sub judice. He concludes that allowing this information to go before the jury requires that his death sentences be reversed. We are not so persuaded. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nMd. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 413(c)(1)(iii) renders admissible at a capital sentencing proceeding:\n\n\"Evidence of any prior criminal convictions, pleas of guilty or nolo contendere, or the absence of such prior convictions or pleas, to the same extent admissible in other sentencing procedures[.]\"\n\nGrandison suggests that under Scott v. State, 310 Md. 277, 529 A.2d 340 (1987) (Scott II), only evidence of prior unrelated convictions is admissible. Scott II, however, stands only for the principle that \"prior,\" as used in Article 27, § 413(c)(1)(iii), relates to convictions obtained before the sentencing proceeding itself, even if the conviction was obtained after the commission of the capital offense. Scott II, 310 Md. at 299, 529 A.2d at 351. The fact that we, in reaching our decision in Scott II, relied on other decisions that happened to involve unrelated convictions in no way limits application of our holding to only unrelated convictions.\n\nGrandison next argues that the Court of Special Appeals' decision in Lett v. State, 51 Md. App. 668, 445 A.2d 1050 (1982) compels us to find that Art. 27, § 413(c)(1)(iii) only applies to prior unrelated convictions. He reasons that because prior convictions are admissible under Art. 27, § 413(c)(1)(iii) only to the extent that they are admissible in other sentencing proceedings, and under Lett it is improper, under Md. Code (1957, 1992 Repl. Vol., 1994 Cum. Supp.), Art. 27, § 643B(c), to use a conviction stemming from the same case for which a defendant is about to be sentenced as an enhancement for the pending sentence, it is therefore improper to admit a related conviction under Art. 27, § 413(c)(1)(iii).\n\nAssuming, arguendo, that Grandison's interpretation of Lett is correct, Art. 27, § 643B(c) only governs the use of prior convictions in meeting the requirements for imposition of mandatory sentences. That subsection has nothing to do with the general admissibility of prior convictions at capital sentencing proceedings. Lett, therefore, is completely inapposite to the instant case.\n\nCiting Robinson v. State, 53 Md. App. 297, 452 A.2d 1291 (1982), Grandison lastly makes the bald assertion that, even if these prior convictions are otherwise admissible, they should not have been admitted because the risk of prejudice far outweighs their probative value. Such a weighing decision was within the sound discretion of the trial judge. Absent an abuse of that discretion, we will not disturb his decision. In this case, the probative value of these convictions is clear, and the risk of unfair prejudice doubtful, especially in the context of all the other evidence admitted against Grandison at this resentencing. We therefore hold that there was no abuse of the court's discretion in admitting evidence of these convictions.\n\nXXVII\n\nIn Grandison II, (supra) , Grandison argued that all state charges against him should have been dismissed on the ground that, after the case had been removed from Baltimore County to Somerset County but prior to his Somerset County guilt/innocence trial and capital sentencing, the 180-day period provided for in Md. Code (1957, 1992 Repl. Vol.), Art. 27, § 591, and Md. Rule 4-271(a) expired without a finding of good cause to extend the date for trial beyond the 180-day limit. Grandison II, 305 Md. at 713-17, 506 A.2d at 594-96. We rejected that claim, holding that the 180-day period does not apply once a case has been removed from one county to another. Id.\n\nIn seeking post-conviction relief, Grandison changed his argument slightly, contending that the removal order itself was ineffective because it was issued without the approval of Judge Richard M. Pollitt, then the Administrative Judge for the First Judicial Circuit. In his current appeal, Grandison renews this contention that consultation with Judge Pollitt was a prerequisite to an effective removal order. As that consultation did not occur and no finding by that court of good cause to continue the trial beyond the 180-day period prescribed by § 591 and Md. Rule 4-271(a) was made, Grandison concludes that the case remained within the jurisdiction of the Circuit Court for Baltimore County and is thus subject to dismissal.\n\nAlthough granting relief from the prior death sentences, the post-conviction court denied relief as to the underlying convictions. We subsequently denied Grandison's application for leave to appeal, which included, inter alia, argument on the very issue Grandison presently advances. Grandison may not properly assert on this appeal from his resentencing claims that go to the validity of his guilt/innocence trial which have previously been the subject of separate review proceedings. See Harris, 312 Md. at 232 n.2, 539 A.2d at 640 n.2. Grandison has already had his \"bite at the apple,\" and we decline to address this issue again.\n\nXXVIII\n\nGrandison next asserts that his \"death sentences were imposed for the sole reason that he was a black defendant and that he was found to have hired someone to commit the killings of white victims.\" In addition, he contends that the jury's decision to impose death sentences was disproportionate in relation to the outcome in another Maryland case, Myers v. State, 58 Md. App. 211, 472 A.2d 1027, cert. denied, 300 Md. 484, 479 A.2d 373 (1984).\n\nGrandison's post conviction court denied a similar racial discrimination claim. In his opinion dated July 31, 1992, Judge Daniel M. Long held:\n\n\"Petitioner's claim must be dismissed because it is a bald allegation unsupported by any evidence of indiscretion by prosecutors in the State of Maryland that has resulted in the irrational, inconsistent, or discriminatory application of the death penalty.\"\n\nWe agree that there is nothing in the record to support such an allegation and decline to further address the issue.\n\nGrandison's claim that the jury's imposition of death sentences in this case was disproportionate was also addressed by us with regard to Grandison's first sentencing:\n\n\"Grandison next assails his sentence of death on the basis that such sentence has not been given in any other case where the defendant had been convicted of contract murder (hiring someone else to commit the killing). In the only case of this nature where the State sought the death penalty, Myers v. State, 58 Md. App. 211, 472 A.2d 1027, cert. denied, 300 Md. 484, 479 A.2d 373 (1984), Myers was given a life sentence. In Myers, several mitigating factors were found to exist; Myers had not previously been found guilty of a crime of violence nor entered a plea of guilty or nolo contendere thereto; he acted under substantial duress, domination or provocation of another person; his capacity to appreciate the criminality of his conduct was substantially impaired; his act was not the sole proximate cause of the victim's death; it was found unlikely he would engage in further criminal activity; one co-defendant was given a life sentence and the other a grant of immunity. In the instant case only two mitigating factors were found. Grandison had no prior record of a conviction for a crime of violence, and he was not the sole proximate cause of the killings.\n\n\"Other cases cited by Grandison are so sketchy that we do not find them helpful in trying to make a proportionality review. What we said in Evans, (supra) , bears repeating here:\n\n'The murders giving rise to this prosecution were as heinous as those in any case to come before us under the current capital punishment statute. No killings could have been more premeditated and deliberate than those here.'\n\n304 Md. at 539, 499 A.2d at 1288.\n\n\"While we acknowledge that Grandison was not the 'triggerman,' but for him these murders would not have occurred. In our view Grandison is as culpable as Evans and it is clear the legislature intended that he be so found.\"\n\nGrandison II, 305 Md. at 750, 506 A.2d at 612-13. This reasoning applies with equal force in the present appeal, and we find Grandison's claim that he received a disproportionate sentence to be without merit.\n\nXXIX\n\nGrandison argues that, as his prior death sentences were vacated on post conviction pursuant to Mills v. Maryland, 486 U.S. 367, 108 S. Ct. 1860, 100 L. Ed. 2d 384 (1988), it violated double jeopardy principles to resentence him using the revised sentence determination form. As a general rule, double jeopardy does not prohibit capital resentencing proceedings following the reversal of a prior death sentence, at least where the reversal was not on the ground of evidentiary insufficiency. See, e.g., Schiro v. Farley, 510 U.S. 222, , 114 S. Ct. 783, 789, 127 L. Ed. 2d 47, 56-57 (1994) (second capital sentencing proceeding ordinarily not violative of double jeopardy); Hitchcock v. Dugger, 481 U.S. 393, 398-99, 107 S. Ct. 1821, 1824, 95 L. Ed. 2d 347, 353 (1987) (failure to consider nonstatutory mitigators may require death sentence to be set aside, but state may seek death in another sentencing proceeding in which all relevant mitigating circumstances are admitted into evidence), vacated on other grounds, 505 U.S. 1215, 112 S. Ct. 3020, 120 L. Ed. 2d 892 (1992); Poland v. Arizona, 476 U.S. 147, 156-57, 106 S. Ct. 1749, 1756, 90 L. Ed. 2d 123, 132-33 (1986) (where sentencer relied on single invalid aggravating circumstance in sentencing defendant to death, defendant may be resentenced to death on the basis of another aggravating circumstance). We have also rejected non-constitutional challenges to resentencing proceedings when a prior death sentence has been vacated pursuant to Mills, see State v. Colvin, 314 Md. 1, 17-18 n.5, 24-25, 548 A.2d 506, 514 n.5, 517-18 (1988), as well as a constitutional challenge to multiple resentencings where one sentencing occurred before Mills and a second after, see Hunt v. State, 321 Md. 387, 444-45, 583 A.2d 218, 246 (1990), cert. denied, 502 U.S. 835, 112 S. Ct. 117, 116 L. Ed. 2d 86 (1991).\n\nGrandison also asserts that the amended sentencing form could not be used at his resentencing because it could only be applied prospectively. Thus, he concludes that he could not be resentenced because the prior sentencing form was found unconstitutional in Mills. \"Despite the presumption of prospectivity, a statute effecting a change in procedure only, and not in substantive rights, ordinarily applies to all actions whether accrued, pending or future, unless a contrary intention is expressed[.]\" Mason v. State, 309 Md. 215, 219-20, 522 A.2d 1344, 1346 (1987) (interpreting reduction of peremptory challenges from 20 to 10). The change in the sentencing form was merely procedural and thus was applicable retroactively to Grandison's resentencing proceeding. Resentencing Grandison in no way violated double jeopardy principles, and the trial court properly denied Grandison's motion to prohibit the State from seeking the death penalty at that proceeding.\n\nJUDGMENT AFFIRMED.\n\nDissenting Opinion by Bloom, J., in which Bell, J., joins and Raker, J., joins as to Part IIIA only\n\nAlthough I disagree with the majority opinion's treatment of the circuit court's ruling that Grandison had not presented a meritorious reason to discharge counsel, I am not persuaded that that ruling was erroneous. But since I am convinced that Anthony Grandison was improperly deprived of his right to be represented by counsel in this death penalty proceeding and that irrelevant and prejudicial evidence admitted over his objection may have influenced the jury's verdict, I feel compelled to dissent. Since I am in complete agreement with the majority opinion with respect to the other twenty-six issues raised by Grandison and his appellate counsel, however, it may not be inappropriate to preface this opinion by adopting the opening line of Justice Murphy's dissenting opinion in Wolf v. Colorado, 338 U.S. 25, 41, 93 L. Ed. 1782, 1792, 69 S. Ct. 1359, 1369 (1949):\n\nIt is disheartening to find so much that is right in an opinion which seems to me to be so fundamentally wrong.\n\nI\n\nOn 11 May 1994, just eight days before the scheduled trial to determine whether he was to be put to death for the murders of David Scott Piechowicz and Susan Kennedy, Grandison was brought into court for a hearing on his request to discharge or strike the appearances of William B. Purpura and Arcangelo M. Tuminelli as his attorneys because he disagreed with their planned strategy for his defense. After a lengthy explanation by Grandison and counsel of their differences (the first part of which took place in camera, out of the presence of the prosecuting attorneys), the court concluded that Grandison had not presented a meritorious reason, within the meaning of Maryland Rule 4-215(e), to discharge counsel.\n\nOne of Grandison's complaints about his appointed counsel is that Mr. Purpura had interviewed a particular witness against his express instructions not to do so. Mr. Purpura explained, to the court's apparent satisfaction, why he deemed it in his client's best interest to interview the witness and denied that any prejudice to his client's case could have resulted from the interview. Nevertheless, some feeling of mistrust had been engendered by counsel's disregard of his client's instructions. The principal difference between Grandison and his attorneys, however, concerned an issue that the court apparently believed was a matter of trial tactics that must be left to the discretion of counsel, whereas Grandison regarded it as one involving the fundamental theory of the defense. Simply stated, counsels' theory of the defense was that it all hinged on motive or lack of motive: Grandison was aware that if Mr. and Mrs. Piechowicz, the intended murder victims, were unavailable to testify at his trial on federal narcotics charges their testimony at a prior hearing could be used against him; therefore he certainly had no motive to hire Evans to kill them. Grandison, however, wanted his attorneys to conduct what might be termed a full court press defense challenge and attack every fact put in issue by the State, including what counsel believed to be the foregone conclusion that Evans had done the actual killing.\n\nThe majority opinion, citing Treece v. State, 313 Md. 665, 674, 547 A.2d 1054, 1058-59 (1988), for the proposition that \"the defendant [in a criminal case] ordinarily has the ultimate decision when the issue at hand involves a choice that will inevitably have important personal consequences for him,\" assumes arguendo that the differences between Grandison and counsel fall into that category. Nevertheless, the majority opinion affirms the trial court's ruling that Grandison had not presented a meritorious reason for discharging his counsel on the following bases:\n\n1.\n\nMessrs. Purpura and Tuminelli, although acknowledging that Grandison's defense theories would cause them some problems, never refused to present Grandison's defense theory or abandon their own; and\n\n2.\n\nthe record supports the trial court's findings that the two defense theories were not irreconcilable and that Grandison tried to manufacture a conflict where none existed, in order to generate an appellate issue.\n\nI find nothing in the record of the proceeding to support either of those conclusions.\n\nThe trial court never decided, ruled, or determined that Purpura and Tuminelli could or would adopt Grandison's defense theory and try the case his way. Indeed, the court's comment to Grandison indicates a contrary determination. After stating that it was satisfied that the representation of Grandison by those two attorneys had been very competent, the court added:\n\nSo, now where does that leave you? That leaves you with two options, as I see it. And that is to allow them to continue to represent you, with the understanding that perhaps you can mitigate some of the differences that the two of you have, the three of you have, some of which are not so great, or if I allow you to discharge your attorneys, then I need to make you aware that this court will not intercede on your behalf, will not request the appointment of additional counsel, and will not continue this case.\n\nThe suggestion that Grandison and counsel might, perhaps, mitigate some of their differences does not indicate that the trial court based its ruling on the assumption that Messrs. Purpura and Tuminelli would adopt Grandison's theory of the defense and try the case the way he wanted them to try it.\n\nMoreover, the record of the 11 May 1994 proceeding does not indicate that the trial court found that the two defense theories were not irreconcilable. The court's comment, quoted above, that some of the differences between Grandison and counsel were \"not so great\" and might perhaps be \"mitigated\" is inconsistent with the majority's interpretation. And there is absolutely nothing in the transcript of that proceeding that would even remotely suggest that the trial court found that Grandison had manufactured a conflict when none existed in order to generate an appellate issue. Certainly, the tenor of Mr. Purpura's and Mr. Tuminelli's remarks when explaining the difference between their defense theories and Grandison's evidenced their belief that the differences were genuine and understandable as well as substantial.\n\nThe basis of the trial court's determination that Grandison had not presented a meritorious reason for discharging his appointed counsel was that the differences between him and counsel concerned matters of trial tactics and strategy that were within counsel's discretion, and that Grandison could not require counsel to try the case his way. As the court explained to Grandison:\n\nYou certainly have a right, certainly, to confront your witnesses and to participate in the trial, but ... if you're going to be represented by counsel, then I think counsel will have to conduct the trial.\n\nThe proper question before us with respect to this issue, therefore, is whether the differences of opinion between Grandison and his then counsel as to how his defense should be conducted involved matters about which a defendant, rather than his attorneys, must have the ultimate choice. In Treece v. State, (supra) , this Court held that whether to plead not criminally responsible is a decision for the defendant to make, not his attorney. In arriving at that decision, the Court recognized that certain decisions about the conduct of the trial are for counsel to make, whereas other decisions are of such fundamental importance to the defendant that only he can make them. Quoting from Parren v. State, 309 Md. 260, 265, 523 A.2d 597, 599 (1987), the Court said in Treece, at 671:\n\nIt is certainly true that \"when a defendant is represented by counsel, it is counsel who is in charge of the defense and his say as to strategy and tactics is generally controlling.\" [Emphasis supplied by the Court in Treece.]\n\nThe Court also cited Curtis v State, 284 Md. 132, 145-48, 395 A.2d 464, 472-73 (1978), for the proposition that tactical decisions made by a competent attorney will bind a criminal defendant. That point was further emphasized by quoting Justice Harlan's concurring opinion in Brookhart v. Janis, 384 U.S. 1, 8, 86 S. Ct. 1245, 1249, 16 L. Ed. 2d 314, 319 (1966):\n\nlawyer may properly make a tactical determination of how to run a trial even in the face of his client's incomprehension or even explicit disapproval.\n\n313 Md. at 671-72.\n\nThus, as the Court noted in Treece,\n\ndecisions \"to forgo cross-examining certain State's witnesses, to forgo confrontation by non-objection to hearsay, to forgo objection to illegally seized evidence or to involuntary confessions (provided some tactical benefit would be extracted from their admission into evidence)\" have been said to be matters usually allocated to defense counsel alone.\n\nId. at 672.\n\nOn the other hand, \"the defendant ordinarily has the ultimate decision when the issue at hand involves a choice that will inevitably have important personal consequences for him or her, and when the choice is one a competent defendant is capable of making.\" Examples of that type of decision include whether to testify on one's own behalf, whether to forego trial by way of a guilty plea, and waiver of right to trial by jury. Treece, 313 Md. at 674.\n\nThe trial court apparently concluded that the areas of dispute between Grandison and his appointed counsel were within the realm of trial strategy and tactics, telling Grandison, \"If you're going to be represented by counsel then I think counsel will have to conduct the trial.\" Grandison, however, maintains that the differences involved more than strategy and trial tactics, that they went to the heart of his defense the essential facts of the case and therefore the decision was his to make.\n\nAs the Court recognized in Treece, there is no clearly defined dividing line between trial strategy, which must be left to counsel, and other kinds of decisions that the defendant has the right to make. I am inclined to believe that the disagreement between Grandison and counsel as to what issues of fact were to be disputed or challenged was a matter of trial tactics that was within the lawyers' professional discretion. If it is within the lawyers' discretion, as a matter of trial tactics, to decline to call a particular witness or to forego cross-examining certain State's witnesses, \"even in the face of his client's incomprehension or even explicit disapproval,\" as Justice Harlan expressed it in his concurring opinion in Brookhart v. Janis, (supra) , then, for all practical purposes, the decision as to what factual issues are to be raised by the defense is within the range of \"trial tactics\" and \"strategy.\"\n\nThe Supreme Court addressed the problem in Jones v. Barnes, 463 U.S. 745, 103 S. Ct. 3308, 77 L. Ed. 2d 987 (1983). The question before the Court in that case was whether refusal by appointed counsel to present and argue every nonfrivolous issue requested by the defendant constituted ineffective assistance. In a federal habeas corpus proceeding, the District Court for the Eastern District of New York denied the prisoner's petition, but the Court of Appeals for the Second Circuit reversed. The Supreme Court granted certiorari and held that defense counsel assigned to prosecute an appeal from a criminal conviction does not have a constitutional duty to raise every nonfrivolous issue requested by the defendant. The accused has the ultimate authority to make certain fundamental decisions regarding his case, including the decision whether to take an appeal; and, with some limitations, he may elect to act as his own advocate. An indigent defendant, however, has no constitutional right to compel appointed counsel to press nonfrivolous points if counsel, as a matter of professional judgment, decides not to press those points.\n\nJustice Brennan, joined by Justice Marshall, dissented. Disagreeing with the Court over what the Sixth Amendment right to \"the assistance of counsel\" means, the dissent stated that \"the import of words like 'assistance' and 'counsel' seems inconsistent with a regime under which counsel appointed by the State to represent a criminal defendant can refuse to raise issues with arguable merit on appeal when his client, after hearing his assessment and his advice, has directed him to raise them.\"\n\nJustice Blackmun, concurring with the majority, stated that he agreed with Justice Brennan and the ABA Standards for Criminal Justice 21-3.2, Comment p. 21.42 (2d ed. 1980):\n\nAs an ethical matter, an attorney shall argue on appeal all nonfrivolous claims upon which his client insists. Whether or not one agrees with the Court's view of legal strategy, it seems to me that the lawyer, after giving his client his best opinion as to the course most likely to succeed, should acquiesce in the client's choice of which nonfrivolous claims to pursue.\n\nJones, 463 U.S. at 754, 103 S. Ct. at 3314, 77 L. Ed. 2d at 995. Noting that the attorneys' usurpation of certain fundamental decisions can violate the Constitution, Justice Blackmun nevertheless agreed with the Court:\n\nNeither my view, nor the ABA's view, of the ideal allocation of decisionmaking authority between client and lawyer necessarily assumes constitutional status where counsel's performance is \"within the range of competence demanded of attorneys in criminal cases and assures the indigent defendant of an adequate opportunity to present his claims fairly in the context of the State's appellate process.\" [Citations omitted.]\n\nId. at 755, 103 S. Ct. at 3314, 77 L. Ed. 2d at 995-96.\n\nPerceiving no essential difference between the attorney client relationship on appeal and the relationship during trial, I am not persuaded that the trial court erred in ruling that Grandison's dispute with his appointed attorneys' proposed trial strategy did not give him a constitutional right to discharge counsel and require the court to appoint new counsel. Grandison was not constitutionally entitled to appointed counsel who would present his defense the way he wanted it presented; what he was constitutionally entitled to was appointed counsel whose efforts on his behalf would be \"within the range of competence demanded of attorneys in criminal cases.\" The trial judge, having listened to Mr. Purpura and Mr. Tuminelli explain their theory and plan of defense and justify their actions as counsel for Grandison, concluded that they were competent attorneys who had represented Grandison competently to that point and whose theories of defense for their client made sense to him.\n\nA defendant represented by appointed counsel whose theories of defense tactics and strategy differed from the client's is not without a remedy if the attorney's conduct of the trial, including the choice of trial tactics or strategy, falls below \"the range of competence\" demanded of attorneys in criminal cases. \"The [Sixth Amendment] right to counsel is the right to effective assistance of counsel.\" McMann v. Richardson, 397 U.S. 759, 771 n.14, 90 S. Ct. 1441, 1449, 25 L. Ed. 2d 763, 773 (1970). Counsel can deprive a defendant of the right to effective assistance by simply failing to render adequate legal assistance. Strickland v. Washington, 466 U.S. 668, 686, 104 S. Ct. 2052, 2063-64, 80 L. Ed. 2d 674, 692-93 (1984). A petition for post-conviction relief, pursuant to Md. Code (1957, 1992 Repl. Vol.) Art. 27, § 645A, provides the appropriate vehicle for relief when a claim of ineffective assistance of counsel is made. Trimble v. State, 321 Md. 248, 257-58, 582 A.2d 794, 799 (1990); Harris v. State, 295 Md. 329, 337-38, 455 A.2d 979, 983 (1983).\n\nII\n\nAfter the court below ruled that Grandison had not presented a meritorious reason for his request to discharge counsel, it dutifully informed Grandison, pursuant to Maryland Rule 4-215(e), 20\n\nthat the trial would proceed as scheduled with Grandison unrepresented by counsel if he discharged Messrs. Purpura and Tuminelli and did not obtain new counsel without the assistance of the court. Then, as required by section (e) of Rule 4-215, the court complied with subsections (a)(1)-(4) of the Rule. After insuring that the record reflected compliance with those subsections, the court repeatedly asked Grandison if he wished to discharge Messrs. Purpura and Tuminelli. Grandison adamantly refused to answer that question. Instead, he persisted in saying that he wanted \"new\" counsel or \"different\" counsel, assiduously avoiding saying that he wanted to discharge his then present counsel, because if he said that he would be waiving his right to counsel and under no circumstances did he intend to waive his right to counsel or any other right. The following colloquy between the court and Grandison is illustrative:\n\nTHE COURT: ... I can't imagine a man who is\n\nfacing a death sentence, or two additional life sentences, would want to proceed without competent counsel, but if you persist in wanting to discharge them, I will allow you to discharge them, with the qualifications that I've already indicated.\n\nNow tell me affirmatively do you wish to have Mr. Tuminelli and Mr. Purpura discharged as your counsel of record?\n\nMR. GRANDISON: Your Honor...\n\nTHE COURT: A yes or no answer.\n\nMR. GRANDISON: ...I'm saying, I don't see\n\nhow I could answer that. I'm saying, you have to make the decision. I already stated my position. I'm saying that the court is taking, you know, whatever position you [sic] taking. I'm not going to waive my rights, you know what I'm saying, if this case has to go upstairs, then, you know, we have to deal with that situation.\n\nTHE COURT: I'm sure we will. I don't have\n\nto waive anything. You're the one who has to tell me whether...\n\nMR. GRANDISON: Well, I'm, I...\n\nTHE COURT: ...you want to continue with Mr.\n\nPurpura and Mr. Tuminelli...\n\nMR. GRANDISON: Well, I've stated my\n\nposition.\n\nTHE COURT: ...and if you tell me you don't\n\nwant, if you don't want to discharge them, then this case will proceed to trial with you represented by Mr. Purpura and Mr. Tuminelli. That's a very simple option.\n\nMR. GRANDISON: I said I wanted new counsel.\n\nTHE COURT: Well, I didn't ask you that. Do\n\nyou want to discharge Mr. Purpura and Mr. Tuminelli?\n\nMR. GRANDISON: Well, Your Honor, that's the\n\nonly way I can answer that in order to preserve my legal right, that I want different counsel. That's the only way I...\n\nTHE COURT: So you do not want to\n\ndischarge...\n\nMR. GRANDISON: I'm not saying that. I'm\n\nsaying to you that I want a different counsel...\n\nTHE COURT: And I have indicated to you...\n\nMR. GRANDISON: ...and I explained the\n\nreason.\n\nTHE COURT: And I've indicated to you that I\n\nam not going to allow you to have different counsel. You'll either be represented by Mr. Tuminelli and Mr. Purpura, or you'll represent yourself. That's your option. What's your option?\n\nMR. GRANDISON: Well, I already explained,\n\nYour Honor, and I stand on my position, so I'm saying, you know, you have to make your decision.\n\nAt that point the court made a ruling that I believe was absolutely correct:\n\nTHE COURT: Well it would appear to me that\n\nhe has not indicated that he wishes to discharge his counsel, so this court is of the opinion that he would be represented by Mr. Purpura and Mr. Tuminelli, unless I hear to the contrary.\n\nAnyone want to be heard?\n\nNevertheless, after Grandison repeated that he wanted different counsel and the court could not force him into waiving his rights, the court stated, \"We're fencing over words. You're not waiving any rights. All I want to know is do you want to continue with these two gentlemen representing you, or do you want to fire them?\"\n\nGrandison's reply was a stubborn reiteration of his persistent theme:\n\nAnd I've said that I want different counsel. I don't know how, other words that I could put it without, you understand what I'm saying, waiving my rights.\n\nThe court then turned to the prosecuting attorneys for comment. Assistant State's Attorney Schenning responded:\n\nMS. SCHENNING: I think the defendant has\n\nalready answered the court's question. I think he said twice on the record, that he wants to fire his two lawyers. He chooses, knowing the consequences of his actions, to discharge them. That's what he said. They were his words. He said it twice. He said it affirmatively. He's trying to have his cake and eat it too, and the court has not presented him with the choice of having different counsel. He knows it, and I think Mr. Grandison is just trying to play games with words.\n\nGrandison denied the assertion that he was \"trying to play games with words.\" After an exchange of comments related to that point, Grandison said:\n\nI never said what she [Ms. Schenning, the prosecuting attorney] said and the record will reflect that. I said, as I'm saying now, that I want different counsel, and I believe that the rules are that the court is to take the next step to determine whether or not the words that I have said to you in fact means that I have waived, you understand what I'm saying, by my actions, counsel. That's a decision the court is to make. That's what the rules say.\n\nGrandison was right. He had not said, at least not after the court ruled that he had not presented a meritorious reason for discharging counsel, that he wanted \"to fire his two lawyers.\" Indeed, he had carefully avoided using those words for the very reason that he did not intend to waive his right to be represented by counsel.\n\nRelying on Fowlkes v. State, 311 Md. 586, 536 A.2d 1149 (1988), the majority holds that, by virtue of Md. Rule 4-215, Grandison had waived his constitutional right to be represented by counsel during the death penalty phase of his trial. I believe that that holding unreasonably expands the holding in Fowlkes and constitutes an illogical and unwarranted distortion of Rule 4-215.\n\nIn Fowlkes, this Court, after explaining that the right to the assistance of counsel, guaranteed to a defendant in a criminal prosecution by the Sixth Amendment to the United States Constitution and Article 21 of the Maryland Declaration of Rights, may be waived by the defendant \"provided 'he knows what he is doing and his choice is made with his eyes open.' Adams v. United States, ex rel. McCann, 317 U.S. 269, 279, 63 S. Ct. 236, 242, 87 L. Ed. 268, 275 (1942),\" pointed out that under the Sixth Amendment a defendant has an independent right to reject the assistance of counsel and to elect to represent himself, Faretta v. California, 422 U.S. 806, 819-20, 95 S. Ct. 2525, 2533, 45 L. Ed. 2d 562, 573 (1975), but only if he knowingly, intelligently, and voluntarily waives his right to counsel. Fowlkes, 311 Md. at 589, 536 A.2d at 1151. The Court then held that, even though Fowlkes stated that he wanted to obtain private counsel and did not want to represent himself, he had waived his right to be represented by counsel. Fowlkes insisted on firing his assigned counsel and stated that he did not want to be represented by her or by another member of the public defender's office who had been offered to him, despite the fact that the trial judge had (1) ruled that Fowlkes had not presented a meritorious reason for discharging counsel, and (2) had repeatedly informed Fowlkes that the trial would be conducted that day so the option of retaining private counsel was not available to him and, therefore, that discharging counsel would constitute a waiver of his right to counsel.\n\nThe majority opinion points out that this Court held in Fowlkes that an accused who, at or shortly before trial and without justification, insists on discharging his counsel and demands the appointment of new counsel, may properly be deemed to have waived his right to counsel if he is sufficiently informed in accordance with Rule 4-215 so that his discharge of counsel represents knowing, intelligent, and voluntary action on his part.\n\nFowlkes, 311 Md. at 604, 536 A.2d at 1158. The majority opinion then notes that this Court further remarked in Fowlkes that although the right to counsel generally embodies a right to retain counsel of one's choice, a defendant may not manipulate this right so as to frustrate the orderly administration of criminal justice.\n\nId. at 605, 536 A.2d at 1159.\n\nUnlike the defendant in Fowlkes, Grandison did not insist on discharging his current counsel; he did persist, however, in stating that he wanted \"new\" counsel or \"different\" counsel. The majority opinion recognizes this difference but declares it to be a \"distinction without a difference,\" because Grandison persisted in reiterating the same theme \"even after being advised by the court that his position would result in the discharge of his current counsel.\" The majority opinion thus concludes that this Court's decision in Fowlkes, that under the Sixth Amendment to the United States Constitution and Article 21 of the Maryland Declaration of Rights, a defendant's unmeritorious refusal to proceed with current counsel may constitute a waiver of the right to counsel, is dispositive as to this issue in this case.\n\nSlip Op. at 17.\n\nI disagree with the majority's characterization of the sole difference it recognizes between this case and Fowlkes as \"a distinction without a difference.\" The defendant in Fowlkes, having been warned that if he fired his attorney he would be required to represent himself, adamantly insisted on firing his attorney. Grandison, however, after receiving a like warning, carefully avoided saying that he wanted to fire or discharge his then current attorneys. He made it abundantly clear that the reason he would not use those fatal words was that he did not want to waive his constitutional right to be represented by counsel. It was reasonable to conclude that Fowlkes waived his right to counsel because he insisted on firing his attorney after being told that if he did so he would have to represent himself. To conclude that Grandison waived his right to counsel when he specifically refused to say that he wanted to discharge his lawyers because he did not want to waive representation by counsel is not merely unreasonable, it is preposterous.\n\nMoreover, I believe that the majority opinion misconstrues the facts. The trial judge told Grandison that there had not been presented a meritorious reason for discharging counsel and that there would be no postponement, so if Grandison fired his attorneys he would, in effect, waive his constitutional right to be represented by counsel. Grandison thereafter did not say he wanted to discharge Messrs. Purpura and Tuminelli; he reiterated his desire for \"new\" or \"different\" counsel. The trial judge did not tell Grandison that maintaining that \"position would result in the discharge of his current counsel,\" as the majority opinion states. Indeed, the trial judge actually ruled otherwise, saying:\n\nWell, it would appear to me that he has not indicated that he wishes to discharge his counsel, so the court is of the opinion that he would be represented by Mr. Purpura and Mr. Tuminelli, unless I hear to the contrary.\n\nThe judge heard nothing to the contrary from Grandison. Nevertheless, apparently on the basis of an erroneous statement by the prosecuting attorney that Grandison had said twice that he wanted to discharge his counsel, the trial judge abruptly reversed course and, without further warning to Grandison, announced:\n\nThe court believes that Mr. Grandison has discharged Mr. Tuminelli and Mr. Purpura. Their appearances will be stricken.\n\nThat abrupt volte-face is inexplicable.\n\nThere is another difference between this case and Fowlkes that the majority opinion ignores. The defendant in Fowlkes was charged with a misdemeanor, possession of drug paraphernalia, the maximum penalty for which was imprisonment for not more than four years and a fine of $25,000. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Grandison was facing the death penalty. It seems to me that in a death penalty case a court should exercise great vigilance to insure that the defendant not be compelled to stand trial without the assistance of counsel. In balancing the constitutional right of a defendant to be represented by counsel against the protection of the State's need to prevent the defendant from manipulating that right \"so as to frustrate the orderly administration of criminal justice,\" Fowlkes, 311 Md. at 605, 536 A.2d at 1158, which Rule 4-215 attempts to do, far greater weight should be given to the constitutional right in a death penalty case than need be given it in a trial on a misdemeanor charge.\n\nThere is no other proceeding in our system of criminal justice wherein the need for counsel is greater than at the sentencing phase of a death penalty case, in which a skilled prosecutor is making every effort allowable in our adversarial process to effect the death of the defendant. The utmost fairness in procedures must be strictly adhered to before the State should be allowed to take the life of a person. The special attention to detail required in death penalty cases is demonstrated by the history of the right to counsel, by Maryland's commitment to special procedural rules in death penalty cases, and by the nature of the penalty, which is fundamentally different from any other penalty.\n\nThirty years before it extended the right to counsel to all criminal defendants, the Supreme Court held that the defendant in a capital case must be afforded an attorney. Powell v. Alabama,\n\n287 U.S. 45, 71, 53 S. Ct. 55, 64, 77 L. Ed. 158, 171-72 (1932). Similarly, this Court has provided increased protection to capital defendants. Although §§ 7 and 8 of Art. 26 of the Maryland Code of 1939 only authorized the appointment of counsel for indigent defendants where the judgment of the court and public interest required, this Court held that due process required the appointment of counsel to indigent defendants in all death penalty cases. Smith v. State, 189 Md. 596, 608, 56 A.2d 818, 824 (1948); see Smith v. State, 180 Md. 529, 531-32, 25 A.2d 681, 682 (1942).\n\nIn Maryland there are special provisions for capital cases that do not apply to other criminal cases. These departures from the norm demonstrate a recognition of the gravity of the death penalty and the need to ensure that a defendant is not executed without being able to invoke all his rights. Md. Rule 4-343 sets forth the procedures to be followed in the sentencing phase of the death penalty. These strict requirements ensure that the death penalty is not inflicted arbitrarily. To protect the defendant's rights, they include instructions to the jury requirement findings \"BEYOND A REASONABLE DOUBT.\" Md. Rule 4-343(e)(I) (emphasis in original). Finally, Maryland law provides that a defendant sentenced to death has an automatic right to review in the Court of Appeals of his conviction and his sentence. Md. Code, Art. 27, § 414(a); Md. Rule 8-306.\n\nThis Court has recognized that death is fundamentally a different kind of punishment than any other. Doering v. Fader, 316 Md. 351, 558 A.2d 733, 738 (1989). See Evans v. State, 304 Md. 487, 552, 499 A.2d 1261, 1295 (1985) (McAuliffe, J., concurring in part and dissenting in part); Scott v. State, 297 Md. 235, 247, 465 A.2d 1126, 1134-35 (1983). In Doering, this Court granted the defendant's petition for writ of mandamus, despite cautioning that the writ should only be granted under extraordinary circumstances. Doering, at 361-62. The determination that such a situation existed was based in part on the acknowledgment that the death penalty is \"qualitatively different from a sentence of imprisonment, however long.\" Id. at 360 (citing Woodson v. North Carolina, 428 U.S. 280, 305, 96 S. Ct. 2978, 2978, 49 L. Ed. 2d 944, 961 (1976).\n\nThe Supreme Court too has stated that death penalty cases are different than non-capital cases. In Strickland v. Washington, 466 U.S. 668, 686-87, 104 S. Ct. 2052, 2064, 80 L. Ed. 2d 674, 693 (1984), the Supreme Court noted that the nature of a capital sentencing hearing requires that the defendant be allowed the same protections he would receive at trial, including the right to counsel. Additionally, Justice O'Connor noted:\n\nThe Court, as well as the separate opinions of a majority of the individual Justices, has recognized that the qualitative difference of death from all our punishments requires a correspondingly greater degree of scrutiny of the capital sentencing determination. In ensuring that the death penalty is not meted out arbitrarily or capriciously, the Court's principal concern has been more with the procedure by which the State imposes the death sentence than with the substantive factors the State lays before the jury as a basis for imposing death.\n\nCalifornia v. Ramos, 463 U.S. 992, 998-99, 103 S. Ct. 3446, 3452, 77 L. Ed. 2d 1171, 1179 (1983) (citations omitted). The most effective way to assure the defendant has been afforded all his procedural rights is through the aid of an attorney.\n\nAs noted (supra) , the majority's holding that the trial judge committed no error in concluding that Grandison had waived his right to counsel relied on, and extended, this Court's 1988 opinion in Fowlkes v. State. I suggest that it would be more reasonable to apply a logical analysis of Rule 4-215, which is the controlling law, to the facts of this case than to try to fit the facts of this case to the language of Fowlkes.\n\nThis Court has repeatedly stated that \"the purpose of Rule 4-215 is to protect that most important fundamental right to the effective assistance of counsel, which is basic to our adversary system of criminal justice,....\" Moten v. State, 339 Md. 407, 411, 663 A.2d 593, 596 (1995); Williams v. State, 321 Md. 266, 272, 582 A.2d 803, 806 (1990); Maus v. State, 311 Md. 85, 111, 532 A.2d 1066, 1079 (1987); Parren v. State, 309 Md. 260, 281-82, 523 A.2d 597, 607 (1987); Argabright v. State, 75 Md. App. 442, 459, 541 A.2d 1017, 1025 (1986). Strict compliance with the waiver requirements of Rule 4-215 are necessary to protect a criminal defendant's fundamental right to counsel. Moten v. State, (supra) .\n\nActually, Maryland Rule 4-215 attempts to balance the constitutional right of a defendant in a criminal prosecution to the assistance of counsel against the State's need to prevent the manipulation of that right so as to frustrate the orderly administration of criminal justice by declaring that certain conduct may constitute a waiver of the right to counsel.\n\nSection (a) of the Rule deals with the problem that arises if a defendant does not have counsel when he first appears in court. The court is required to (1) make certain that the defendant has received a copy of the charging document containing notice of the right to counsel, (2) inform the defendant of the right to and importance of the assistance of counsel, (3) advise the defendant of the nature of the charges and the allowable penalties, (4) conduct a waiver inquiry pursuant to section (b) of the rule if the defendant indicates a desire to waive counsel, and (5) if trial is to be conducted on a later date, advise the defendant that if he or she appears for trial without counsel the court could determine that the defendant waived counsel and proceed to trial with the defendant unrepresented by counsel.\n\nSection (b) of the Rule provides that if a defendant who is not represented by counsel indicates a desire to waive counsel, the court may not accept the waiver unless it determines that the defendant is knowingly and voluntarily waiving the right to counsel.\n\nSection (c), applicable to the District Court, and section (d) applicable to the circuit courts, deal with the situation of a defendant appearing in court on the date set for a hearing or trial, without counsel but desiring to have counsel represent him. If the record reflects a prior compliance with section (a) of the rule, the court must permit the defendant to explain why he appeared without counsel. If the explanation is satisfactory, i.e., presents a meritorious reason, the case will be continued and the defendant advised that, if counsel does not enter an appearance by the new date, the case will proceed with the defendant unrepresented by counsel. If there is no meritorious reason for the appearance without counsel, the court may determine that the defendant waived counsel by failing or refusing to obtain counsel.\n\nThe provisions that principally concern us in this case are contained in section (e) of the rule, dealing with the defendant who wants to discharge counsel whose appearance has been entered. The court must permit him to explain the reasons for the request. If the reasons are deemed meritorious, the defendant will be permitted to discharge counsel and, if necessary, the trial or hearing will be continued, with the defendant being warned that, if he or she appears without counsel by the next scheduled trial date, the trial will proceed with the defendant being unrepresented by counsel. If, as in this case, the court finds no meritorious reason for discharging counsel, the court may not permit the defendant to discharge counsel without first informing the defendant that the trial will proceed as scheduled with the defendant unrepresented by counsel if the defendant discharges counsel and does not have new counsel. If the court does permit the defendant to discharge counsel, it shall comply with subsections (a)(1)-(4) of the Rule if the docket or file does not reflect prior compliance.\n\nThe requirement of section (e) that the court comply with subsections (a)(1)-(4) of Rule 4-215 if it permits the defendant to discharge counsel after it has ruled that there is no meritorious reason to do so and after warning the defendant that discharging counsel will effectively constitute a waiver of counsel presents an apparently anomalous situation. Section (e) of the Rule is couched in language that indicates that permission to discharge counsel precedes compliance with subsections (a)(1)-(4). Yet subsection (4) requires the court to conduct a waiver inquiry pursuant to section (b) if the defendant indicates a desire to waive counsel -- which is what the defendant does if he discharges counsel knowing that the effect thereof will constitute a waiver. That would suggest that the permission to discharge counsel, pursuant to section (e) of the rule, is only conditional upon a determination that the defendant's waiver of counsel is a knowing and voluntary one. Clearly, Grandison never knowingly or voluntarily waived his right to counsel.\n\nIn any event, it seems to me to be utterly illogical and of doubtful constitutionality to interpret the Rule in such a way that a defendant who affirmatively expresses a desire to represent himself may not be allowed to do so unless the court is satisfied that he or she has knowingly and voluntarily waived the constitutional right to be represented by counsel, while a defendant who persistently asserts that he does not want to waive his right to be represented by counsel will be deemed to have waived that right if he says, \"I want new counsel, but I will not say I want to discharge current counsel because that will be deemed a waiver.\"\n\nSection (e) of Rule 4-215 does not require the trial court to permit a defendant to discharge counsel if the defendant does not have substitute counsel or the means to secure substitute counsel. As this Court recognized in Fowlkes, Rule 4-215(e) \"gives the trial judge a degree of flexibility depending upon the situation. Under some circumstances when the defendant makes an unmeritorious request to discharge counsel, it may be appropriate not to permit the discharge of counsel.\" 311 Md. at 604, 536 A.2d at 1154. The Court added, in a footnote, that if a defendant who has said nothing to indicate a desire for self-representation is denied permission to discharge counsel, the defendant cannot later successfully contend that he was denied his Faretta right of self-representation. Id. n.7. Therefore, if the trial judge had not reversed his ruling that Grandison had not discharged his counsel, Grandison, who consistently maintained that he did not want to waive his right to counsel, would not thereafter be allowed to contend that he had been denied a right to represent himself.\n\nWhen, under Rule 4-215, the Court undertakes the precarious task of balancing the judicial economy of the orderly administration of the criminal justice system against the capital defendant's right to counsel and therefore his right to live, it must remember that \"courts indulge every reasonable presumption against waiver of fundamental constitutional rights.\" Michigan v. Jackson, 475 U.S. 625, 633, 106 S. Ct. 1404, 1409, 89 L. Ed. 2d 631, 640 (1986) (same); Carnley v. Cochran, 369 U.S. 506, 514, 82 S. Ct. 884, 889, 8 L. Ed. 2d 70, 76 (1961); (same); Johnson v. Zerbst, 304 U.S. 458, 464-65, 58 S. Ct. 1019, 1023, 82 L. Ed. 1461, 1466 (1938); McElroy v. State, 329 Md. 136, 139, 617 A.2d 1068, 1070 (1993); Bruce v. State, 328 Md. 594, 604, 616 A.2d 392, 397 (1992), cert. denied, 508 U.S. 963, 124 L. Ed. 2d 686, 113 S. Ct. 2936 (1993) (same); Parren v. State, 309 Md. 260, 272, 523 A.2d 597, 603 (1987) (same).\n\nBecause the right to counsel is so fundamental that courts do not even bother testing if prejudice resulted from a denial of counsel, Glasser v. United States, 315 U.S. 60, 76, 62 S. Ct. 457, 465, 86 L. Ed. 680, 699 (1942); because the right to counsel is a paradigm of those \"constitutional rights so basic to a fair trial that their infraction can never be treated as harmless error,\" Chapman v. California, 386 U.S. 18, 24, 87 S. Ct. 824, 828, 17 L. Ed. 2d 705, 710-11 (1967); and because the need for counsel in the sentencing phase of a death penalty case is greater than in any other segment of the criminal justice system, Bruce A. Green, Lethal Fiction: The Meaning of Counsel in the Sixth Amendment, 78 Iowa L. Rev. 495-499 (1993), I believe the trial court erred in ruling that Grandison had discharged Messrs. Purpura and Tuminelli as his attorneys and thereby waived his right to be represented by counsel. What makes the error all the more egregious is that, just moments before, the court had correctly concluded that Grandison had not discharged counsel.\n\nIII\n\nTestifying for the State, FBI Agent Kevin Foley was permitted, over Grandison's objection, to testify that, from the beginning of his involvement in the investigation of the murders of David Scott Piechowicz and Susan Kennedy, he believed that Grandison was the likely mastermind of the murder scheme. What he actually said was that he and other agents \"concluded that it [the murders] was perpetrated at the request of Mr. Grandison.\" Agent Foley was also permitted to testify, over objection, that State's witness Charlene Sparrow (who had been granted immunity from prosecution for her participation in the murders in exchange for her testimony against Grandison and others) was telling the truth.\n\nA.\n\nThe majority assumes, arguendo, that a witness is never competent to testify to the ultimate guilt or innocence of a criminal defendant. That, of course, is a proper assumption, since it is a correct statement of a sound principle of law. Such testimony is both irrelevant and prejudicial.\n\n\"Evidence is relevant if it has any tendency to make [the] existence of a material fact more probable or less probable than it would be without the evidence. A material fact is a fact that is of legal consequence to the determination of the issues in the case.\" 5 L. McLain, [ Maryland Practice: Maryland Evidence ] § 401.1, at 261; C. McCormick, Evidence § 185, at 541 (E. Cleary 3rd ed. 1984) (McCormick identifies the second aspect of relevance's \"probative value,\" which is the tendency of evidence to establish the proposition that it is offered to prove.) As stated by Professor McLain in her treatise, \"what issues are material to a particular case is determined by the pleadings and the substantive law.\" 5 L. McLain, (supra) , at 262 (other citations omitted).\n\nWilson v. Morris, 317 Md. 284, 291, 563 A.2d 392, 395 (1989). A similar definition of \"relevancy\" now appears in Md. Rule 5-401, which was not in existence at the time of Grandison's sentencing trial.\n\nThe material fact at issue -- material because it was determinative not only of Grandison's guilt or innocence of the two murders but was also the death qualifying factor and the aggravating circumstance to be considered by the jury -- was whether the murders were \"perpetrated at the request of Mr. Grandison,\" as Agent Foley opined. But Agent Foley's belief that Grandison was \"behind the shootings,\" as distinguished from his observations that led him to that conclusion, does not tend to make the material fact at issue more or less probable than it would be without his statement of what he believed.\n\nMoreover, even if the objected to testimony about the witness's opinion or belief that the murders were committed at Grandison's request could possibly be deemed relevant under any theory, it cannot seriously be maintained that whatever probative value it might have outweighed the unfair prejudice to Grandison. The witness was an agent of that prestigious body, the Federal Bureau of Investigation. His testimony that he and his fellow agents of that august organization had, at some stage of their investigation, concluded that the murders had been perpetrated at the request of Mr. Grandison unquestionably was likely to impress the jury. Indeed, it was undoubtedly intended to do just that.\n\nIt is a well established principle that even relevant evidence may be excluded if the probative value is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury. See Graves v. State, 334 Md. 30, 40-42, 637 A.2d 1197, 1202-03 (1994), wherein are listed numerous cases, civil and criminal, in which both this Court and the Court of Special Appeals found reversible error in the admission of evidence because the danger of unfair prejudice, confusion of the issues, or misleading the jury greatly outweighed the probative value of the evidence. That principle is now embodied in Md. Rule 5-403.\n\nThe majority, conceding that Agent Foley's opinion as to Grandison's involvement was \"perhaps erroneously admitted over objection,\" concludes that the testimony was not prejudicial and admitting it \"at worst constituted harmless error.\" That conclusion is based upon the principle that reversible error will not be found on appeal when objectionable testimony is admitted \"if the essential contents of that objectionable testimony have already been or are subsequently independently established and presented to the jury through the testimony of other witnesses.\" I certainly cannot quarrel with that principle; what I dispute is its applicability to this case.\n\nThere is an assertion in the majority opinion that Agent Foley's testimony was not unfairly prejudicial because Grandison's participation as the architect of the murders was communicated directly or through implication to the jury several times during the trial, including the trial judge's statement to the jury that Grandison had been convicted of two counts of first degree murder. If the existence of other evidence as to Grandison's guilt of murder by hire, including the fact that he had already been convicted of two counts of first degree murder, were conclusive as to issues to be decided by the jury at the death penalty phase of his trial, no error, no matter how egregious, could be deemed prejudicial. Indeed, the entire trial to determine whether Grandison lives or dies would appear to be superfluous; the jury need only be informed of the substance of the previous trial and then sent out to deliberate on the penalty. That is not the case. The State was obliged to prove, all over again, to the satisfaction of this jury, which had not heard the evidence at the guilt or innocence phase of the trial, that Grandison had hired Evans to murder Mr. and Mrs. Piechowicz. That the jury could have found from other, competent, material, and relevant evidence that the State had met its burden of proof does not excuse or justify the error in admitting irrelevant evidence and does not mitigate the prejudicial effect of that evidence.\n\nThe majority opinion refers to certain testimony that was admitted without objection from Grandison. Cheryl Piechowicz testified that, prior to her testimony at a suppression hearing in federal court in 1983, Janet Moore approached her in a threatening manner and that she reported the incident to federal authorities. Captain Drewery of the Baltimore City Jail, where Grandison was being held pending his trial on federal narcotics charges, testified that on the day after the murders he was questioned by FBI agents and police officers from Baltimore City and Baltimore County about who had recently visited Grandison. Janet Moore and Charlene Sparrow testified that the same investigative team interviewed them soon after the murders and asked them about their relationships with Grandison and Vernon Evans. The majority concludes that Ms. Piechowicz's testimony sent to the jury the same message that Agent Foley's testimony did: that Grandison was identified to federal authorities as the likely instigator of the murders. From the testimony of Captain Drewery, Ms. Moore, and Ms. Sparrow the majority concludes that Grandison was early identified by the investigators as the architect of the murders. Those conclusions, in my opinion, do not follow logically from the stated premises. At most, the testimony relied on by the majority to support its assertion that the trial court's error was harmless merely establishes that the FBI and the police officers investigating the murders of David Scott Piechowicz and Susan Kennedy realized that Grandison had a motive to eliminate those two prospective witnesses against him in the upcoming trial of the federal narcotics charges, and that they conducted their investigations accordingly.\n\nI cannot agree with the suggestion that the testimony of Cheryl Piechowicz, Captain Drewery, Janet Moore, and Charlene Sparrow was essentially the same in content as the testimony of the FBI agent that he and his fellow agents believed that the murders were instigated by Grandison. Taking into account the prestige of the Federal Bureau of Investigation, and the high regard in which that organization is generally (and justifiably) held, it is unreasonable to believe that any inferences that the jury may have drawn from the testimony of the lay witnesses equaled or even approached, insofar as prejudice to Grandison is concerned, the opinion by Agent Foley that he and his fellow FBI agents believed that Grandison instigated the murders.\n\nThe seminal case in Maryland on harmless error is Dorsey v. State, 276 Md. 638, 350 A.2d 665 (1976). After holding that the trial court erred in permitting the arresting officer to testify about the high percentage of convictions that had resulted form his arrests, this Court stated:\n\nWe conclude that when an appellant, in a criminal case, establishes error, unless a reviewing court, upon its own independent review of the record, is able to declare a belief, beyond a reasonable doubt, that the error in no way influenced the verdict, such error cannot be deemed \"harmless\" and a reversal is mandated. Such reviewing court must thus be satisfied that there is no reasonable possibility that the evidence complained of -- whether erroneously admitted or excluded -- may have contributed to the rendition of the guilty verdict.\n\n276 Md. at 659, 350 A.2d at 678. Dorsey has been consistently followed, cited, and quoted both by this Court and the Court of Special Appeals since it was decided. See Bhagwat v. State, 338 Md. 263, 282, 658 A.2d 244, 253 (1995).\n\nIt is understandable that many people may deem Anthony Grandison to be a worthless wretch who deserves to be executed by the State. What I find difficult to understand is a holding that, beyond a reasonable doubt, the error in admitting Agent Foley's testimony that he and other FBI agents believed that Grandison instigated the murders of David Scott Piechowicz and Susan Kennedy in no way influenced the jury's verdict and there is no reasonable possibility that the evidence complained of may have contributed to the verdict.\n\nB.\n\nIt was an even more blatant error of the trial court to allow Agent Foley to testify that he believed that Charlene Sparrow, a key witness against Grandison, was telling the truth. As this Court stated in Bohnert v. State, 312 Md. 266, 277, 539 A.2d 657, 662 (1988), it is \"error for the court to permit to go to the jury a statement, belief, or opinion of another person to the effect that a witness is telling the truth or lying.\" The majority opinion ignores that error because Grandison did not object to the testimony on that ground. With respect to Agent Foley's testimony regarding his belief that Ms. Sparrow was telling the truth, Grandison objected on the ground that the question eliciting that testimony was leading. He was right. The question -- actually in the form of a long, rambling statement to the effect that the witness had concluded that Ms. Sparrow was telling the truth, coupled with an invitation to the witness to agree with that statement -- was a classic example of an objectionable leading question. The difficulty, from Grandison's standpoint, is that, although his objection was entirely proper and should have been sustained, the assertion of error raised in this Court goes to the content of the answer instead of the form of the question. Citing Colvin-El v. State, 332 Md. 144, 630 A.2d 725 (1993), cert. denied, U.S. , 114 S. Ct. 2725, 129 L. Ed. 2d 849 (1994), for the proposition that appellate review of an evidentiary ruling, when a specific objection was made, is limited to the ground assigned at the time of the objection, the majority holds that the error complained of is not before the Court for review.\n\nUnder the present Rules of Procedure, both in civil cases (Rule 2-517(a)) and in criminal cases (Rule 4-232(a)), it is not necessary to state the reason for an objection unless the court so directs. Neither of those rules suggests that the penalty for stating the wrong reason, either voluntarily or in response to the court, is a waiver of objection for the right reason. Yet this Court has consistently iterated, as it did in Colvin-El, that appellate review is limited to the grounds of objection stated below, without stating why that is so. To find the reason behind that rule, we must turn the clock back thirty-five years. In Wolfinger v. Frey, 223 Md. 184, 192-93, 162 A.2d 745, 749-50 (1960), the Court cited Rule 885 of the then current Rules of Procedure as the basis for holding that the failure of a party to state the right reason for the objection, when called upon to state the reason for objecting to the admission of evidence, is a waiver of an objection based on an unstated reason. Rule 885 provided:\n\nThis Court will not ordinarily decide any point or question which does not plainly appear by the record to have been tried and decided by the lower court; but where a point or question of law was presented to the lower court and a decision of such point or question of law by this Court is necessary or desirable for the guidance of the lower court or to avoid the expense and delay of another appeal to this Court, such point or question of law may be decided by this Court even though not decided by the lower court. Where jurisdiction cannot be conferred on the Court by wavier or consent of the parties, a question as to the jurisdiction of the lower court may be raised and decided in this Court whether or not raised and decided in the lower court.\n\nAlthough the language is different, current Rule 8-131, the successor to former Rule 885, is basically the same. The key provision in both is that the appellate court will not ordinarily decide any point, question, or issue that does not plainly appear by the record to have been raised in or decided by the trial court.\n\nThe predecessor to Rule 885 was Rule 9 of the General Rules of Practice and Procedure of the Court of Appeals of Maryland, which merely stated, bluntly:\n\nIn no case shall the Court of Appeals decide any point or question which does not plainly appear by the record to have been tried and decided by the Court below.\n\nThat rule mirrored the language of Art. 5, § 10 of the Annotated Code of Maryland (1951). Similar language flatly prohibiting this Court from deciding matters that had not been tried and decided below was contained in the Maryland Codes of 1939, 1924, 1912, 1904, and 1888. That statutory limitation on the appellate jurisdiction of this Court can be traced back to Chapter 117, § 1 of the Laws of 1825, which provided:\n\nThat in no case wherein a judgment may hereafter be rendered in any county court, and which may be removed to the court of appeals, by appeal or writ of error, shall the appellant or plaintiff in error, or the appellee or defendant in error, be permitted to urge or insist upon any point or question which shall not appear by the record to have been raised or made in the county court, and upon which that court may have rendered judgment; and the court of appeals shall not reverse or affirm any such judgment on any point or question which shall not appear to have been presented to the county court, and upon which that court may have rendered judgment.\n\nAfter that statutory limitation on this Court's jurisdiction was repealed as part of the adoption of the Annotated Code of Maryland (1957), the language of the Rule changed from one of absolute prohibition against deciding issues not addressed and decided below to the current conditional limitation: ordinarily, neither this Court nor the Court of Special Appeals will decide any issue other than jurisdiction that does not plainly appear by the record to have been raised in or decided by the trial court. \"Ordinarily\" indicates the existence of discretion to address a contention that the trial court committed an error in admitting evidence even if the precise error, i.e., reason for inadmissibility, was not stated below.\n\nMoreover, even though the error now complained of was not properly preserved for appellate review, this Court has general discretionary authority to address the issue. As Judge Rodowsky stated, writing for this Court in Rubin v. State, 325 Md. 552, 587, 602 A.2d 677, 694 (1992), quoting from Dempsey v. State, 277 Md. 134, 141-42, 355 A.2d 455, 459 (1976):\n\n\"However, as [former] Rule 756g [now Rule 4-325(e)] makes clear with respect to jury instructions, and as the cases hold with respect to errors of law generally, an appellate court may in its discretion in an exceptional case take cognizance of plain error even though the matter was not raised in the trial court.\"\n\nThis is a death penalty case, which makes it exceptional enough, in my opinion, for the Court to exercise its discretion to address appellant's contention that the trial court committed an error of law in admitting highly prejudicial evidence even though the precise error, i.e., reason for inadmissibility, was not stated below. Certainly the error was plain enough to be recognized as such by this Court.\n\nSince this Court does have the discretionary power to address the issue raised by Grandison on appeal -- error by the trial court in admitting the testimony of FBI Agent Foley that he believed that a key witness against Grandison was telling the truth -- the refusal to exercise that discretion under the extraordinary circumstances of this case is appalling.\n\nIV\n\nStripped of all legal jargon, the message that the Court is sending to Anthony Grandison is this:\n\nEven though you unequivocally articulated an unwillingness to waive your constitutional right to be represented by counsel, we hold that you did waive that right. Having reached that conclusion, as illogical as it may seem, we also hold that, lacking counsel to speak for you, you uttered the wrong words (or failed to utter the right ones) when you objected to the introduction of clearly inadmissible testimony, and that colossal blunder will cost you your life.\n\nUnwilling to be deemed to have endorsed that message, I dissent.\n\nJudge Bell has authorized me to state that he joins in this opinion, and Judge Raker has authorized me to state that she joins in Part IIIA of this dissenting opinion.\n\n\u003cspan class=\"fn\"\u003e1. Grandison's federal convictions were affirmed on appeal. United States v. Grandison, 783 F.2d 1152, 1155-57 (4th Cir. 1986), cert. denied, 479 U.S. 845, 107 S. Ct. 160, 93 L. Ed. 2d 99 (1986) (affirming the narcotics convictions); United States v. Grandison, 780 F.2d 425, 428-29 (4th Cir. 1984), vacated and remanded, 479 U.S. 1076, 107 S. Ct. 1270, 94 L. Ed. 2d 131 (1987), reinstating prior affirmance on remand, 885 F.2d 143 (4th Cir. 1989) (affirming the witness tampering convictions).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In Mills, the Supreme Court held that the Maryland capital sentencing form, and the jury instructions pertaining thereto, were unconstitutional because the Mills jury could have believed that it was precluded from giving any weight to mitigating factors found by some, but not all, jurors. Mills, 486 U.S. at 373-84, 108 S. Ct. at 1865-70, 100 L. Ed. 2d at 393-400.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Two briefs have been filed in this Court on Grandison's behalf. The first was filed on February 24, 1995, by Grandison's assigned public defender, raising eighteen contentions addressed in parts I through XVIII, (infra). On April 5, 1995, Grandison filed a pro se brief raising the other eleven issues we address in parts XIX through XXIX, (infra). When he filed his brief, Grandison's assigned public defender was aware of Grandison's intent to file a pro se brief and expressly adopted all of the contentions to be made therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See also Evans v. State, 333 Md. 660, 637 A.2d 117 (1994); Evans v. State, 304 Md. 487, 499 A.2d 1261 (1985), reconsideration denied, 305 Md. 306, 503 A.2d 1326, cert. denied, 478 U.S. 1010, 106 S. Ct. 3310, 92 L. Ed. 2d 722 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. At this stage of the proceeding, Grandison was represented by Arcangelo Tuminelli and William Purpura, assigned public defenders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Counsel wanted to show that Grandison had no motive for having the Piechowiczes killed, because their federal pretrial testimony had already been transcribed, and Grandison, who was well educated in the law regarding the admissibility of former testimony, knew if something were to happen to the Piechowiczes their former testimony would probably still be admitted into evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We note that Grandison had been appointed new counsel in this case on a previous occasion. Before Tuminelli and Purpura were assigned as his public defenders, Grandison was represented by Alan Drew and Harry Trainor, who were appointed by the Office of the Public Defender. Grandison expressed his dissatisfaction with the services provided by Drew and Trainor and, on August 27, 1993, was permitted by the court to discharge them even though the court found no meritorious reason for him doing so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The court did appoint Mr. Tuminelli as standby counsel, although he was not permitted to argue any motions or grounds for objections or to participate in closing arguments. Cf. Parren v. State, 309 Md. 260, 268-71, 523 A.2d 597, 601-02 (1987) (holding that a defendant's right to counsel and right to self-representation are independent of each other and may not be asserted simultaneously to form a hybrid representation in which the defendant participates in his own defense while retaining assistance of counsel).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We note, parenthetically, that Grandison chose to represent himself at both his first trial in the instant case, and his federal trial for witness tampering and civil rights violations in connection with the murders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Grandison asserts the following violations:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. His right to counsel was violated when the court forced him to choose between a lawyer who would not advocate his factual defense, and no lawyer at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. His right to testify or allocate in his own behalf was violated when the court, in effect, premised that right on Mr. Grandison's waiving his right to counsel. Had Mr. Grandison agreed to accept the lawyer's theory of defense, he would have been unable to make a factual statement to the jury because his statement would have been in conflict with the case his lawyer was presenting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"3. His rights to put on a defense and confront and cross-examine witnesses were violated when the court refused to provide counsel who would help him meaningfully exercise those rights by advocating Mr. Grandison's factual defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"4. His right to effective assistance of counsel was violated when his assigned lawyer refused to advocate his factual defense.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Grandison clearly understood the law in this area. The following exchange took place during the hearing on August 27, 1993 regarding his request to discharge counsel:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"[Grandison:] I'm saying, if you don't think that the reasons that I wanted another attorney is not meritorious, then the Court can force me to go to court without an attorney, unless I hire one at my own expense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"[The Court:] That's correct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"[Grandison:] I got the law right here. Maryland Rule 4-215 E.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The trial court found that the two defenses were not in serious conflict and, therefore, Grandison had no meritorious reason for discharging counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Rodney Kelly acted as a go-between for Grandison and Evans. He later plead guilty to murder charges in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See note 6, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Etta Horne was a housekeeper at the Warren House. She identified Evans as the man she had seen several times at the motel on the day of the murders carrying a beige bag.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Md. Rule 4-215(e) was promulgated in 1984. Until a 1986 amendment, however, it was designated as Rule 4-215(d). See Fowlkes, 311 Md. at 590 \u0026 n.1, 536 A.2d at 1151 \u0026 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See part II, (supra) , for a discussion of the merits of Grandison's request for new counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Grandison was actually able to elicit from Ms. Piechowicz that she had additional children, but he was not able to establish that they had been born after the murders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Where no proffer is made as to the relevance of testimony a party seeks to have admitted, an issue can still be preserved for appeal if the questions eliciting the testimony clearly generate the issue: \"Thus, in the absence of a proffer, the clarity with which the issue is generated will determine whether the court's restriction of cross-examination constitutes an abuse of discretion.\" Jorgensen v. State, 80 Md. App. 595, 601, 565 A.2d 371, 374 (1989), quoting Waldron v. State, 62 Md. App. 686, 698, 491 A.2d 595, 601 (1985). The record in the instant case indicates that this alternative method of preserving the issue for appeal is not satisfied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See part XVII, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See part XXIII, (infra), for a discussion of the corroboration requirement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Grandison used one of his peremptory challenges to remove the juror in question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The untouched money indicated that robbery was not the motive for the murders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Charlene Sparrow had accompanied Evans to the murder scene. She had been granted immunity in exchange for her testimony against the other defendants in the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Janet Moore was Grandison's girlfriend. She was contacted by Grandison, who was then in the Baltimore City Jail, to assist in making arrangements for the murders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. A capital case already consists of the guilt/innocence phase and the separate sentencing proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See parts II and III, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Grandison did not deny that an incident occurred in which he threw shaving powder in a guard's face. He did deny that, at that same time, he verbally threatened guards' lives; as a result of his denial, that part of the allegation was redacted from the version of the PSI that was sent to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Helen Kondilidis has since died. See The Baltimore Sun, Feb. 17, 1995, at 5B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See also parts VII and IX, (supra) , addressing Agent Foley's comments and the prosecution's reference to those comments in its closing argument, respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See also part XVII, (supra) , discussing related admissibility issues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Fowlkes received a sentence of six months incarceration.\u003c/span\u003e\n\n",
    "body_length": 191680,
    "citedas": [
      "341 Md. 175",
      "668 A.2d 889",
      "670 A.2d 398"
    ],
    "attorneys": "Argued BY Ira Mickenberg, Assigned Public Defender, of Washington, Dc, For Appellant. Argued BY Tarra DeShields-Minnis, Assistant Attorney General (j. Joseph Curran, Jr., Attorney General; Gwynn X. Kinsey, Jr., Assistant Attorney General, all on brief) of Baltimore, Md, For Appellee.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Murphy, C.j., Eldridge, Rodowsky, Karwacki, Bell, Raker, Bloom, Theodore G. (Specially Assigned) JJ. Opinion by Karwacki, J. Bell, Raker and Bloom, JJ., Dissent. Judge Bell has authorized me to state that he joins in this opinion, and Judge Raker has authorized me to state that she joins in Part IIIA of this dissenting opinion.",
    "citation_count": 59
  }
}
