{
  "id": "54qSQGYBTlTomsSBIJVN",
  "document": {
    "title": "Ross v. Bank South",
    "full_title": "ERNEST ROSS, INDIVIDUALLY AND AS REPRESENTATIVE OF A BONDHOLDER CLASS v. BANK SOUTH, N.A., ET AL. ALSTON \u0026 BIRD, ET AL. . GEORGE MILLER, INDIVIDUALLY AND AS A REPRESENTATIVE OF A CLASS OF BONDHOLDERS DESCRIBED IN THE COMPLAINT V. ARTHUR M. RICE, JR. AND WILLIAM V. WELDON, ET AL. . ERNEST ROSS, INDIVIDUALLY AND AS REPRESENTATIVE OF A BONDHOLDER CLASS V. BANK SOUTH, N.A., ET AL. . GEORGE MILLER, INDIVIDUALLY AND AS REPRESENTATIVE OF A BONDHOLDER CLASS V. ARTHUR M. RICE, JR., ET AL.",
    "jurisdiction": "Eleventh Circuit",
    "date": "1989-09-18T00:00:00.000Z",
    "docket": "Nos. 86-7350, 86-7790",
    "body": "ANDERSON, Circuit Judge, with whom RONEY, Chief Judge, and HILL, FAY and COX, Circuit Judges, concur:\n\nErnest Ross and George Miller (referred to in this opinion as appellants) sued various parties connected with the issuance of the First Mortgage Residential Facilities Revenue Bond (Mount Royal Towers, Inc. Project) Series 1981 bonds. In an action based primarily on Section 10 (b) of the Securities Exchange Act of 1934, 15 U.S.C. § 78j(b), and Rule 10b promulgated thereunder, Ross and Miller claimed the defendants had engaged in a fraudulent scheme to issue the tax-exempt bonds, which would be unmarketable absent the fraud. After certification of a class and substantial discovery, the district court granted summary judgment for the defendants and against the appellants on the securities claims. The appellants appeal from that judgment, and also from the dismissal of their claim based on RICO, see 18 U.S.C. § 1961 et seq., and their various pendent state law claims based on the Alabama Blue Sky Act, Ala.Code §§ 8-6-18, 8-6-19 (1977), Alabama statutory fraud provisions, Ala.Code §§ 6-5-100 to 6-5-104 (1977), negligence and breach of contract.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e We affirm.\n\nI. BACKGROUND\n\nThis case concerns the issuance on September 30, 1981, of bonds with a face value of $29,950,000. The bonds were issued by the defendant Special Care Facilities Financing Authority of the City of Vestavia Hills (\"the Authority\") to pay for the construction of a residential and medical facility for the elderly. The facility, known as Mount Royal Towers, was to be located in Vestavia Hills, a suburb of Birmingham, Alabama.\n\nThe bond issue came at the end of a long series of attempts to finance the project. Originally, the project was to be conventionally financed, but in 1978, Arthur Rice, the developer and a defendant in this action, decided to finance the project through tax-exempt bonds. To this end, Mount Royal Towers, Inc. was incorporated as an Alabama nonprofit corporation. After Rice first contacted another Alabama city about sponsoring the bonds, he approached the defendant City of Vestavia Hills. Vestavia Hills agreed to sponsor the project by forming the Authority and issuing the bonds on behalf of the facility.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nRice then went about setting up the deal. In 1979, he negotiated with the firm of Underwood, Neuhaus to underwrite the bond issue, but in the beginning of 1980 Underwood declined on account of poor conditions in the bond market which hindered marketing even \"safe\" bonds. After exploring the financing market, Rice then turned to another firm, Henderson, Few \u0026 Company, which had been associated with the earlier effort, for a revised bond issue of approximately $19,000,000.\n\nIn December of 1980, Henderson, Few \u0026 Company decided against underwriting the issue, again due to poor conditions in the market. The plan had contemplated using the bond revenues to construct the project, and then using the occupancy fees (i.e., the price of an apartment unit) to repay the bonds. When Rice was advised of Henderson, Few \u0026 Company's decision to abandon the underwriting at least temporarily, Rice was also cautioned that the proposed occupancy fees were already as high as the Birmingham market would bear, and that the projected revenue from the fees was insufficient to service bonds with interest rates high enough to be attractive to the bond market. Thus the feasibility of the issue as then structured was called into question. At the end of December, 1980, the defendant Board of Trustees of Mount Royal Towers passed a resolution abandoning the project.\n\nImmediately following the abandonment of the project by Henderson, Few \u0026 Company, Rice determined to restructure the deal. At the beginning of 1981, he formed a joint venture, defendant Total Concept Retirement Communities, to act as the developer of the new version of the project. The joint venture was composed of a company owned by Rice (the Wellington Corporation), a subsidiary of the new underwriter for the deal, Hereth, Orr \u0026 Jones (the Finerock Corporation), and an Atlanta brokerage firm (Robinson-Hall, Inc.). In addition to Hereth, Orr \u0026 Jones, a new bond counsel, Jones, Bird \u0026 Howell,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and a new feasibility consultant, Laventhol \u0026 Horwath, were added. Peter Wright, a Jones, Bird attorney, drafted the joint venture agreement. Bank South, N.A., was the indenture trustee. All of these parties were defendants in the action.\n\nUnder the previous version of the deal, the occupancy fees ranged from $17,000 to $87,000, depending on the type of apartment. The amount of the bond issue was raised under the new version of the deal from $19,000,000 at 11 1/2% to $29,950,000 at 15 1/2 to 17%, reflecting increased interest rates and other costs. To provide repayment of this increased amount, the occupancy fees for the apartments were increased. Thus, under the new plan, the units ranged from $54,000 to $172,000, not including monthly fees for services.\n\nUnder the earlier plans the occupancy fee (the major cost of becoming a resident) was only partially refundable if the resident moved within four years and was not refundable at all after four years or if the resident died after one year. Under the new price structure, the entire occupancy fee was to be refundable upon terminating the residency contract or the death of the resident, although the refund was conditioned upon resale of the unit and was subordinated to the bonds.\n\nMarketing efforts for the previous version had begun in January, 1978. From the beginning the project was structured to require \"pre-sales\" of 50% of the units.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e By late 1979, there were applications and initial deposits for 135 of the units, but this number began to decline during 1980, reaching approximately half that number at the time the previous version of the deal was abandoned in December 1980. With the restructuring of the project, marketing began anew. Initially, a deposit of $1,000 was required; however, fifteen applicants who had previously applied and had forfeited $100 were not required to make any additional deposit. After falling initially with the increase in prices, the number of units reserved rose from 17% in April, 1981, to 24% in June, to 32% in July. Beginning around this time, no deposit was required to reserve a unit; of the 103 units (50% of the total) which were \"pre-sold\" at the time of the closing of the bond issue, 15 had applications secured with only the aforesaid $100 and an additional 33 had applications without any deposit at all.\n\nThe bonds, in the amount of $29,950,000, were issued on September 30, 1981. The tax-exempt bonds bore interest rates from 15 1/2% to 17%. The official statement for the issue disclosed, inter alia, the price structure of the units, the status of the marketing program of the facility, and the project's complete reliance for repayment of the bonds on the sales of the apartments. Using the proceeds from the bond issue, Mount Royal Towers was constructed.\n\nHowever, sales of the apartment units ultimately proved insufficient to sustain the project. On April 15, 1984, Mount Royal filed a petition for reorganization under Chapter 11 and the bonds went into default in September, 1984. Under the reorganization, the facility has continued to operate, and the proceeds of a bankruptcy approved sale have been distributed to the bondholders to partially satisfy the outstanding indebtedness.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nErnest Ross and George Miller each had bought the bonds without seeing the disclosure materials. They brought suit in district court. The cases were consolidated, and a class was certified by order of the district court dated April 8, 1986. The class was composed of bondholders who asserted a \"fraud on the market\" reliance theory and who purchased Mount Royal bonds prior to their default in 1984. After full discovery, the district court on September 18, 1985, granted motions to dismiss in favor of Vestavia Hills and the Authority. The district court converted Bank South's motion to dismiss to a motion for summary judgment, which it granted on December 12, 1985. The district court granted summary judgment in favor of one set of defendants on August 18, 1986, and then entered final judgment against the appellants on October 16, 1986, granting summary judgment in favor of the remaining defendants.\n\nInitially three appeals were consolidated. In No. 86-7350, defendants appealed the April 8, 1986 order certifying the class. In No. 86-7352, Ross and Miller appealed the district court's September 18 and December 12, 1985 orders in favor of Vestavia Hills, the Authority, and Bank South. In No. 86-7790, Ross and Miller appealed the district court order dated October 16, 1986, granting summary judgment in favor of the remaining defendants.\n\nOn appeal, a panel of the Eleventh Circuit affirmed the district court's order certifying the class and affirmed the summary judgment in favor of Bank South and the Mount Royal Trustees and the dismissal in favor of Vestavia Hills and the Special Care Facilities Authority. The panel reversed and remanded with regard to the remaining defendants. Ross v. Bank South, N.A., 837 F.2d 980 (11th Cir. 1988). On March 24, 1988, the panel's decision was vacated and rehearing en banc ordered.\n\nSitting in banc, we now conclude that Ross and Miller have failed to establish their securities law claims against any defendant. We also conclude that the district court did not err in dismissing the RICO claim and did not abuse its discretion in dismissing the pendent state law claims. Thus, the judgment in No. 86-7790 is affirmed. Because we affirm the district court's grant of summary judgment in favor of all defendants on the securities law claim, we need not address the question in No. 86-7350, the appeal of the district court's certification of a class. After the panel opinion, appellants settled their claims against the Authority (and related parties), Vestavia Hills and Bank South, and appeal No. 86-7352 was dismissed by order of this court on September 19, 1988.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWe first address the federal securities law issue, i.e., the fraud on the market theory. We then address the other issues, involving the RICO and state law causes of action.\n\nII. FRAUD ON THE MARKET\n\nThe law to be applied in this case is clear. Reliance is an essential element of a cause of action under Rule 10b-5. See Lipton v. Documation, 734 F.2d 740, 742 (11th Cir. 1984), cert. denied, 469 U.S. 1132, 105 S. Ct. 814, 83 L. Ed. 2d 807 (1985). The reliance requirement establishes the causal link between the defendant's activities and the plaintiff's injuries and prevents federal securities law from affording unlimited liability. Id. Normally, a Rule 10b-5 plaintiff must therefore show the following: (1) a misstatement or omission, (2) of a material fact, (3) made with scienter, (4) on which the plaintiff relied, (5) that proximately caused his injury. Huddleston v. Herman \u0026 MacLean, 640 F.2d 534, 543 (5th Cir. Unit A Mar. 1981), rev'd on other grounds, 459 U.S. 375, 103 S. Ct. 683, 74 L. Ed. 2d 548 (1983).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Under certain circumstances, a presumption of reliance may be established where a requirement of actual reliance would make recovery a practical impossibility. Thus, in the case of an omission rather than a misstatement, reliance may be presumed when the plaintiffs could justifiably expect that the defendants would have disclosed the material information. Affiliated Ute Citizens v. United States, 406 U.S. 128, 92 S. Ct. 1456, 31 L. Ed. 2d 741 (1972).\n\nHere, the appellants concede that they did not read the offering documents and thus did not purchase the bonds in reliance on any material misrepresentation or omission in those documents. In a traditional Rule 10b-5 case, that concession would be sufficient to justify dismissal. However, Ross and Miller invoke the version of the \"fraud on the market\" theory established by the former Fifth Circuit in Shores v. Sklar, 647 F.2d 462 (5th Cir. 1981) (en banc), cert. denied, 459 U.S. 1102, 103 S. Ct. 722, 74 L. Ed. 2d 949 (1983). In Shores, the court delineated a cause of action based on Rule 10b-5 applicable where the plaintiff has not relied directly on misrepresentations or omissions in the relevant disclosure materials.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIn Shores, the plaintiff, Bishop, alleged a pervasive scheme by participants in the issuance of a series of industrial revenue bonds to fraudulently induce the public to buy the otherwise unmarketable bonds. The bonds went into default and Bishop brought a class action suit on behalf of the bondholders. Although Bishop, in making out a case under Rule 10b-5, alleged that the issue's offering circular contained misrepresentations, he admitted that he had never read the circular and had bought the bonds on his broker's general recommendation. Citing lack of reliance, the district court dismissed the claim.\n\nThe en banc court reversed. It held that, despite Bishop's failure to read the offering circular, he did state a cause of action under Rule 10b-5, specifically 10b-5(a) and (c).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e While 10b-5(b) refers to misrepresentations and omissions, the language of sections (a) and (c) is broader. Because these sections are aimed at broader fraudulent schemes, the court reasoned, the lack of reliance on the offering circular, one specific part of the scheme, was not determinative. When the fraud alleged is so pervasive that absent the fraud the bonds could not have been marketed, the reliance element is established by the buyer's reliance on the integrity of the market, i.e., the action of the market to furnish only securities that are entitled to be marketed.\n\nUnder Shores, a plaintiff must show that:\n\n(1) the defendants knowingly conspired to bring securities onto the market which were not entitled to be marketed, intending to defraud purchasers,\n\n(2) [plaintiff] reasonably relied on the bond's availability on the market as an indication of their apparent genuineness, and\n\n(3) as a result of the scheme to defraud, [plaintiff] suffered a loss.\n\nShores, 647 F.2d at 469-70.\n\nThe burden imposed by the first element is a substantial one. Shores is based on the understanding that although it is reasonable to rely on the market to screen out securities that are so tainted by fraud as to be totally unmarketable, investors cannot be presumed to rely on the primary market to set a price consistent with the appropriate risk. Thus, the Shores court defined fraudulently marketed bonds as those that could \"not have been offered on the market at any price\" absent the fraudulent scheme. Shores, 647 F.2d at 464 n. 2; see Lipton, 734 F.2d at 747 (reading Shores to apply only to situations where but for the fraud the securities would not have been marketable). In other words, the fraud must be so pervasive that it goes to the very existence of the bonds and the validity of their presence on the market. If the plaintiff \"proves no more than that the bonds would have been offered at a lower price or a higher rate, rather than that they would never have been issued or marketed, he cannot recover.\" Shores, 647 F.2d at 470. Furthermore, consistent with the principle that the fraud on the market theory does not convert securities law into a form of investor insurance, Shores imposes a scienter requirement: the defendant must have known the securities could not be marketed and must have brought the securities to market with the intent to defraud.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe defendants urge this court to overrule Shores and the fraud on the market theory as applied to primary markets. We decline to do so; we need not address the merits of the defendants' argument on this point,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e because assuming arguendo that Shores reliance is available to the appellants in this case, the district court correctly held that the prima facie case establishing Shores reliance was not established. Appellants allege that defendants marketed the bonds even though they knew or recklessly disregarded the fact that the project could not generate sufficient income to repay the debt. In other words, appellants allege that defendants marketed the bonds knowing that they were not marketable. However, we conclude that appellants have failed to establish the first element of the Shores presumption because we conclude that appellants have failed to generate a genuine issue of fact as to marketability.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Since appellants concede lack of traditional reliance, the summary judgment was appropriate.\n\nAppellants point to two categories of evidence in an effort to satisfy their burden of adducing a reasonable inference that the bonds were not marketable. First, the appellants argue that Rice and the other defendants must have known that the apartments, and thus the bonds, would be unmarketable, because the underwriter in the previous version of the deal advised them that the unit prices were as high as the market would bear, and yet the price per unit eventually was substantially increased. For purposes of this opinion, we assume that Rice was cautioned, when the previous version was abandoned, that the occupancy fees were already as high as the Birmingham market would bear. However, this caution related only to the deal as then structured. As noted above, the price structures of the two versions of the deal differed substantially with regard to the refundability of the occupancy fees. In the earlier deal the occupancy fee was to be forfeited if the resident moved or died. In contrast, under the deal as finally structured, the occupancy fee was fully refundable with only two conditions: it was refundable only out of the resale proceeds of the unit, and the refund was subordinated to the bondholder's mortgage. In other words, the occupancy fee in the original version was in the nature of a lump sum prepayment of rent for the right to live there until death. By contrast, the occupancy fee under the final version was more in the nature of a purchase price for a fee simple interest (subject to the conditions above mentioned). That difference would obviously warrant a substantial increase in the occupancy fees. Therefore, the caution against increasing the occupancy fee, which was in the context of the previous deal, could not logically apply to the feasibility of the deal under the new pricing structure. Because this evidence generates no reasonable inference regarding the marketability of the final deal, it does not create a genuine issue of material fact. The appellants offered no other evidence that the price of the apartment units under the final version was so high that they were inherently unmarketable.\n\nThe appellants' second category of evidence relates to the pre-offering marketing program. They contend that Rice manipulated the pre-sales program to meet the 50% goal and to make it appear that the sale of the apartment units would be successful. Specifically, the appellants allege that Rice engaged in sham\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e pre-sales to friends and relatives, and that other applications would not validly indicate interest in the units because the purchasers were not required to place a deposit.\n\nThis summary judgment record does contain reasonable inferences that the pre-offering marketing program was not successful in that 50% pre-sales with deposits were not obtained. However, we do not believe that this evidence carries appellants' burden of proof. Appellants would have to prove that the pre-offering marketing program sufficiently predicted the failure of the project so as to render the bonds unmarketable at any price. We conclude that all reasonable inferences favorable to appellants fall considerably short of satisfying this burden. For example, most of the facts about which appellants now complain were actually disclosed in the offering documents without any adverse effect on marketability. The documents disclosed the fact that there were no binding pre-sales, that a certain number of pre-sales had no deposit or a reduced deposit, and that the occupancy fee refund was subordinated to the repayment of the bonds. In other words, the bonds sold -- i.e., were marketable -- with these facts known.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Appellants have adduced no other evidence that the bonds, or the underlying apartment units, were not marketable.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e We hold that the deficiencies in the pre-offering marketing program which are reflected in this summary judgment record do not create a reasonable inference that the bonds or the apartment units were unmarketable.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe facts in this case stand in sharp contrast to the pervasive fraud allegedly present in Shores. There, to focus on the disclosure alone, the offering statement allegedly omitted a pending SEC action against the principals, mischaracterized one developer as having extensive land holdings, misportrayed another principal as an experienced developer, and incorporated a materially false and misleading financial statement. See Shores, 647 F.2d at 465-66. Whereas in Shores the misrepresentations went to the concealment of existing factors vital to the viability of the project, here the alleged fraud centers on projections of an uncertain future occurrence, i.e., the sales of the apartments. The fraud alleged here and the reasonable inferences in the summary judgment record do not reach the threshold level required in Shores. The appellants have not adduced evidence sufficient to create a genuine issue of fact with regard to the bonds' lack of marketability.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIII. OTHER CLAIMS\n\nThe appellants also assert violations of RICO and various causes of action under state law. The gravamen of the appellants' complaint with respect to the RICO claim is that the defendants fraudulently sold the bonds. The complaint avers that the required \"predicate acts\" consisted of each fraudulent sale of the bonds. However, given our dismissal of the appellants' federal securities law claim, and because the only predicate acts alleged by appellants are in the nature of securities fraud claims that require the reliance/causation element which we have found to be lacking, appellants are bereft of any surviving predicate act. Therefore, the dismissal of the RICO claim was not error.\n\nThe district court dismissed the pendent state law claims without prejudice on the ground that the alleged misrepresentations would implicate the legal standards of various states and otherwise involved individualized claims and defenses. See Kirkpatrick v. J.C. Bradford, 827 F.2d 718, 725 (11th Cir. 1987), cert. denied sub nom. Paine Webber Group, Inc. v. Parker, 485 U.S. 959, 108 S. Ct. 1221, 99 L. Ed. 2d 421 (1988); Simon v. Merrill, Lynch, 482 F.2d 880, 883 (5th Cir. 1973). The district court also ruled that consideration of these claims in conjunction with the federal claims would result in confusion to the jury.\n\nThe appellants argue that the dismissal of the state law claims should be reversed because the district court did not discuss whether the state law claims would be time-barred. See Pharo v. Smith, 625 F.2d 1226, 1227 (5th Cir. 1980) (remanding when dismissed pendent state law claim time-barred and record unclear as to whether trial court considered this factor). The district court, in deciding whether to dismiss pendent state law claims, should consider whether a plaintiff's state law claims will be time-barred if dismissed, although this is not a determinative factor. Id. However, the appellants did not point out to the district court at the time of dismissal that the claims would be time-barred. In fact, appellants' briefs on appeal do not represent that the claims were actually time-barred at the time of dismissal. Therefore, the district court did not abuse its discretion, and there is no need for remand on this issue.\n\nIV. CONCLUSION\n\nIn order to invoke the Shores presumption of reliance, plaintiffs must overcome what the Shores court intended to be a high threshold. Because the evidence offered by the appellants does not create a genuine issue of material fact with regard to the marketability of the bonds, summary judgment was appropriate. Likewise, there was no error in the dismissal of the RICO and pendent state law claims. Therefore, we affirm the judgment in favor of all of the defendants.\n\nAFFIRMED.\n\nTJOFLAT, Circuit Judge, specially concurring:\n\nIn Shores v. Sklar, 647 F.2d 462 (5th Cir. May 1981) (en banc), cert. denied, 459 U.S. 1102, 74 L. Ed. 2d 949, 103 S. Ct. 722 (1983),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e the former Fifth Circuit held that when a pervasive scheme of fraud has resulted in the issuance of unmarketable securities, a plaintiff can satisfy the reliance requirement under Rule 10b-5, 17 C.F.R. § 240.10b-5 (1988) merely by showing that he relied on the integrity of the market to exclude unmarketable securities. In essence, Shores made a Rule 10b-5 plaintiff's burden of proving reliance much lighter. Shores also created much confusion\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and elicited much criticism.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e We granted rehearing en banc in this case to reconsider the holding in Shores.\n\nThe majority today affirms the district court's grant of summary judgment in favor of the appellees by finding that the appellants have not met the \"substantial\" evidentiary burden of Shores ; therefore, the majority declines to address the validity of the Shores holding. Ante slip op. at 13. I concur in the result reached by the majority, but I would reach that result by a different route. In my view, the evidence in this case does, in fact, satisfy the requirements of Shores. The Shores holding, however, is fundamentally flawed and should be overruled. Because the appellants' cause of action is based entirely on Shores, I concur only in the result affirming the judgment in favor of the appellees.\n\nAlthough the majority purports to refrain from directly addressing Shores, it adds a substantial gloss to the Shores holding and in effect reverses it. I dissented in Shores and am still convinced that it was wrongly decided. The majority's reformulation of Shores does nothing to enhance my dim view of the Shores holding. Whether interpreted correctly or incorrectly, Shores has no basis in reason and cannot command the investing community's or the general public's respect. With Shores, the former Fifth Circuit, and thus this court, embarked on a path of confusion, and I fear that the majority today only pushes us farther down that path. It is time for this court to reverse its course. I write to explain the need for such a reversal.\n\nThis concurrence consists of four parts. In part I, I summarize the salient facts in this case. In part II, I discuss Shores, the majority's interpretation of Shores, how that interpretation effectively reverses Shores, and what I believe to be the correct interpretation. I then show that under this correct interpretation, the appellants have produced sufficient evidence to withstand summary judgment on the issue of marketability.\n\nHaving shown that this case presents an appropriate opportunity for reexamining Shores, I consider in part III the traditional requirement of reliance in Rule 10b-5 actions and how Shores relaxes that requirement. I then discuss why the Shores extension of the fraud-on-the-market theory to primary markets for newly issued securities incorrectly relaxes the reliance requirement. I do this by showing (1) that reliance on primary markets is inherently unreasonable; (2) that Shores creates serious problems in the context of a jury trial; (3) that the calculation of damages in a Shores action is problematic; and (4) that Shores arbitrarily punishes some defrauders while passing over others who might have created even more egregious fraudulent schemes. Finally, in part IV, I address the argument that the doctrine of stare decisis should preclude any reevaluation of Shores.\n\nI.\n\nThis case arose out of the sale of revenue bonds for the purpose of financing the construction of Mount Royal Towers -- a residential/medical facility for the elderly, to be located near the City of Vestavia Hills, Alabama. In 1979, appellee Arthur Rice entered into an agreement with the City of Vestavia Hills. Under this agreement, Vestavia Hills was to create a municipal authority for issuing the bonds -- Special Care Facilities Financing Authority. The bonds were to be repaid solely from funds generated by the sale of apartments in Mount Royal Towers. Rice sought to retain the services of two firms as underwriters for the bond issue, but both firms found the project too risky in light of sluggish markets for bonds and for similar apartment units. In December 1980, the Mount Royal Towers board of trustees abandoned the project, citing insufficient progress in obtaining pre-sale commitments and in securing conventional financing.\n\nRice, possibly seeking to protect his personal investment, proceeded with the project. Rice finally succeeded in creating a joint venture (Total Concept Retirement Communities) to develop the project. The venture consisted of Wellington Corporation (owned by Rice), Finerock Corporation (a subsidiary of Herreth, Orr \u0026 Jones -- the new underwriter), and Robinson-Hall, Inc. (an Atlanta brokerage firm). Rice also secured bond counsel, Jones, Bird \u0026 Howell (now Alston \u0026 Bird).\n\nThe venture essentially required two steps. First, Herreth, Orr \u0026 Jones determined that the bond issue should be raised from $18,000,000 to $29,000,000 with a proportional increase in the price of the apartment units. Second, the venture required that fifty percent of the units be pre-sold in order to ensure the success of the bond issuance. By eliminating deposit requirements and selling to friends and family, Rice managed to secure commitments on fifty percent of the units.\n\nThe bonds were issued in September 1981. A disclosure statement pointed out that the bonds were extremely risky and that only the Mount Royal project's income secured repayment. Neither appellee Ernest Ross nor appellee George Miller, the named plaintiffs in this case, read the disclosure statement prior to purchasing the bonds. In April 1984, Mount Royal filed for Chapter 11 reorganization. In October 1985, after a bankruptcy sale of the Mount Royal complex, the bondholders received $18,000,000 in satisfaction of the outstanding balance.\n\nThe district court granted summary judgment in favor of all defendants. A panel of this court affirmed with regard to Bank South (the indenture trustee), the City of Vestavia Hills, Special Care Facilities Financing Authority, and the Mount Royal trustees. Ross v. Bank South, N.A., 837 F.2d 980, 1003-04 (11th Cir. 1988). The panel reversed the district court, however, with regard to the remaining defendants -- Rice, the underwriter, the bond counsel, the feasibility consultant, and the joint venture (\"the appellees\").\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Because no challenge was made on appeal to the dismissal of Bank South, the issuing defendants, or the Mount Royal trustees, the only question before this court is whether to affirm the district court's grant of summary judgment in favor of the appellees.\n\nII.\n\n1.\n\nShores arose out of the sale of tax-exempt revenue bonds for the construction of a facility to manufacture mobile homes in Frisco City, Alabama. Neither the manufacturer who was to use the completed facility nor the underwriter of the bonds was financially secure or experienced in projects of this sort. They managed, however, to induce Frisco City to create an Industrial Development Board for the purpose of issuing tax-exempt bonds, the proceeds of which would be used to build the facility. The Board would then lease the facility to the manufacturer and use the lease proceeds to satisfy the bond obligations. The offering circular that was issued omitted and misrepresented a number of crucial facts. For example, the circular failed to mention the SEC investigation of the underwriter for violations of the securities laws and misrepresented the qualifications and assets of the manufacturer. Shores, 647 F.2d at 465-66.\n\nWhen the bonds were ultimately marketed, the plaintiff in Shores bought four of them. When he purchased them, he neither saw the offering circular nor knew that one existed; rather he relied on his broker's assurances. Id. at 467. A little over a year after this purchase, the manufacturer defaulted on his lease of the facility. The plaintiff consequently sought relief under the Securities Act of 1933, 15 U.S.C. § 77a et seq. (1982), the Securities Exchange Act of 1934, 15 U.S.C. § 78a et seq. (1982), and Rule 10b-5, 17 C.F.R. § 240.10b-5 (1988). The district court dismissed his suit because he did not, and could not, allege any reliance on the offering materials.\n\nThe former Fifth Circuit, sitting en banc, held that Rule 10b-5(b)\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e required proof of actual reliance on the omissions or misrepresentations in the offering materials but that under subsections (a) and (c) of the Rule, reliance could be implied in certain cases. The court determined that when an offering circular is only one component of a more pervasive fraudulent scheme,\n\nthe requisite element of causation in fact would be established if [the plaintiff] proved the scheme was intended to and did bring the Bonds onto the market fraudulently and proved he relied on the integrity of the offerings of the securities market.\n\nShores, 647 F.2d at 469.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Thus, the court held that to meet his burden of proof in such a case, a plaintiff must show that:\n\n(1) the defendants knowingly conspired to bring securities onto the market which were not entitled to be marketed, intending to defraud purchasers, (2) [the plaintiff] reasonably relied on the Bonds' availability on the market as an indication of their apparent genuineness, and (3) as a result of the scheme to defraud, he suffered a loss.\n\nId. at 469-70 (footnote omitted). The court then concluded that the defendant had met his burden under the new test.\n\nThe majority finds in the instant case that the appellants did not adduce \"evidence sufficient to create a genuine issue of fact with regard to the bonds' lack of marketability\" and thus did not satisfy the first prong of the Shores test. Ante at 731. Although I believe that the Shores analysis is flawed, the evidence in this case clearly creates a genuine issue of fact with regard to marketability under the Shores test.\n\n2.\n\nMarketability, as envisioned by the Shores court, is an elusive concept. The court failed to specify whether the marketability test should apply to the securities that were actually issued or to some theoretical security that could be issued at any combination of price and interest rate. If the former interpretation is correct, then we should determine whether, in the absence of fraud, the bonds would have been issued given the actual price and interest rate at which they were issued.\n\nThe majority, however, apparently accepts the latter interpretation; it characterizes an unmarketable bond as one that \"could 'not have been offered on the market at any price ' absent the fraudulent scheme.\" Ante at 729 (quoting Shores, 647 F.2d at 464 n. 2) (emphasis added). Thus, the majority today focuses on what I term the economic unmarketability of the bonds: could the bonds, because of the enormous risk of nonpayment, have been brought onto the market at any combination of price and interest rate if the true risk of nonpayment had been known?\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e See ante slip op. at 14-16 (evaluating only facts that relate to risk of nonpayment). Stated this way, one can easily see the error in the majority's approach: no matter how great the risk of nonpayment, a bond can virtually always be sold at some combination of price and interest rate. See Fischel, Use of Modern Finance Theory in Securities Fraud Cases Involving Actively Traded Securities, 38 Bus.Law. 1, 12 (1983) (\"Virtually all securities will sell for some positive price.\"). Because a bond creates a legal right to repayment in the future, so long as that right is enforceable, a bond can never be completely worthless -- even if a bondholder must become a bankruptcy creditor and seek only the salvage value of the bond.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Consequently, the majority today creates a test that in both theory and practice cannot be met and negates any remedial effect that Shores might have had.\n\nCorrectly interpreted, Shores established a test for what I call factual unmarketability, which focuses on the bonds as issued. Under this interpretation, a bond is unmarketable if, but for the fraudulent scheme, some \"regulatory\" entity (whether official or unofficial)\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e would not have allowed the bond to come onto the market at its actual price and interest rate. For example, in Shores, if the Town of Frisco City had received all relevant information, it presumably never would have created an industrial development board to finance the project. Thus, one can point to an entity that would have prevented the issuance of the bonds in Shores had all relevant information been available to it. Cf. Arthur Young \u0026 Co. v. United States Dist. Court, 549 F.2d 686, 695 (9th Cir.) (\"the purchaser of an original issue security relies, at least indirectly, on the integrity of the regulatory process and the truth of any representations made to the appropriate agencies and the investors at the time of the original issue\"), cert. denied, 434 U.S. 829, 98 S. Ct. 109, 54 L. Ed. 2d 88 (1977). This is the only reasonable interpretation of the first prong of the Shores test: \"securities . . . which were not entitled to be marketed.\" 647 F.2d at 469 (emphasis added). Even an extraordinarily risky security is entitled to be marketed; but a security that presumably would never have been issued by an entity but for the fraud is not \"entitled\" to be on the market.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn the present case, Rice twice failed to retain an underwriter for the Mount Royal project. When Rice finally was able to retain Herreth, Orr \u0026 Jones as underwriter, Rice was required to pre-sell fifty percent of the units as a condition to issuance of the bonds. To this end, Rice not only eliminated the deposit requirement, but also began selling to friends and relatives in sham transactions. Here, as in Shores, the bonds were actually issued by a city (Vestavia Hills) and a municipal issuing authority (Special Care Financing Authority). Thus, here, as in Shores, one can point to entities that presumably would have prevented the issuance of the bonds had all relevant information been available to them.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Consequently, the bonds arguably were not \"entitled\" to be on the market and hence were unmarketable under Shores. 647 F.2d at 469.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n3.\n\nWhen determining whether to grant a motion for summary judgment, a court must view the evidence in a light most favorable to the nonmoving party and must resolve all doubtful issues in favor of the non-movant. Hinesville Bank v. Pony Express Courier Corp., 868 F.2d 1532, 1535 (11th Cir. 1989). Moreover, a court must act with caution in granting such a motion. Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 255, 106 S. Ct. 2505, 2513, 91 L. Ed. 2d 202 (1986). Given these well-established principles and in light of the correct interpretation of Shores stated above, I would hold that, with regard to the marketability of the bonds, appellants have adduced sufficient evidence to create a genuine issue of material fact.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIII.\n\nBecause the instant case should survive summary judgment under the Shores analysis, I now examine the validity of Shores, since overruling Shores would result in a summary judgment in favor of the appellees anyway. I begin by reviewing the role that reliance has played in Rule 10b-5 actions and then discuss my concerns with the Shores court's relaxation of the reliance requirement.\n\nTo state a claim under Rule 10b-5, plaintiffs have always been required to prove reliance on a defendant's fraud. The Supreme Court has recently reaffirmed the importance of reliance as an element of a Rule 10b-5 cause of action. See Basic Inc. v. Levinson, 485 U.S. 224,, 108 S. Ct. 978, 989, 99 L. Ed. 2d 194 (1988). Over the years, however, courts have attempted to mitigate the harshness of this requirement in circumstances that make proof of actual reliance virtually impossible. See, e.g., id. at, 108 S. Ct. at 990; Affiliated Ute Citizens v. United States, 406 U.S. 128, 153-54, 92 S. Ct. 1456, 1472, 31 L. Ed. 2d 741 (1971). In Rule 10b-5 suits alleging misrepresentation, a plaintiff still must prove actual reliance. See Shores, 647 F.2d at 471; Dupuy v. Dupuy, 551 F.2d 1005, 1014 (5th Cir.), cert. denied, 434 U.S. 911, 98 S. Ct. 312, 54 L. Ed. 2d 197 (1977). When a plaintiff has proven a breach of a duty to disclose material information, however, he is not required to prove actual reliance: a rebuttable presumption of reliance arises. See Affiliated Ute Citizens, 406 U.S. at 153-54, 92 S. Ct. at 1472.\n\nMany courts now presume reliance on the basis of the fraud-on-the-market theory. The Supreme Court in Basic explained that,\n\nin an open and developed securities market, the price of a company's stock is determined by the available material information regarding the company and its business. . . . Misleading statements will therefore defraud purchasers of stock even if the purchasers do not directly rely on the misstatements. . . . The causal connection between the defendants' fraud and the plaintiffs' purchase of stock in such a case is no less significant than in a case of direct reliance on misrepresentations.\n\nU.S. at, 108 S. Ct. at 988-89 (quoting Peil v. Speiser, 806 F.2d 1154, 1160-61 (3d Cir. 1986)). Thus, most courts now recognize that, in an efficient securities market, competing judgments of knowledgeable buyers and sellers cause the market to reflect an accurate price based on all available information. See, e.g., Lipton v. Documation, Inc., 734 F.2d 740, 748 (11th Cir. 1984), cert. denied, 469 U.S. 1132, 105 S. Ct. 814, 83 L. Ed. 2d 807 (1985). Consequently, an investor is entitled to rely on the market price of securities and may recover under Rule 10b-5 if fraud has affected that price. Blackie v. Barrack, 524 F.2d 891, 907 (9th Cir. 1975), cert. denied, 429 U.S. 816, 97 S. Ct. 57, 50 L. Ed. 2d 75 (1976).\n\nThis brings me to Shores. The Shores court, citing Blackie and other fraud-on-the-market cases, applied the theory to a fraud that occurred in a primary market -- one in which the securities had just been issued -- despite the fact that the theory had only been used in cases involving fraud on well-developed markets. Essentially, Shores held that Rule 10b-5's reliance requirement was satisfied if an investor relied on the primary market's integrity to prevent the issuance of unmarketable securities. I find the Shores extension to be flawed for four reasons: (1) Shores encourages a form of reliance that is inherently unreasonable; (2) it creates tremendous practical difficulties at a jury trial; (3) it mandates a damage award that is inconsistent not only with Shores ' own reasoning, but also with the fundamental policy of the securities acts; and (4) it punishes some defrauders while passing over others who might have created even more egregious fraudulent schemes. I will address each of these concerns in order.\n\nA.\n\nAs I noted above, courts have been willing to imply or presume reliance in situations that would make proof of reliance difficult, if not impossible. See Basic, U.S. at, 108 S. Ct. at 990; Affiliated Ute, 406 U.S. at 153-54, 92 S. Ct. at 1472. Courts, however, have always required that a plaintiff's reliance be \"justified\" or \"reasonable.\" See L. Loss, Fundamentals of Securities Regulation 957-58 (2d ed. 1988); see, e.g., Bruschi v. Brown, 876 F.2d 1526, 1529 (11th Cir. 1989); Straub v. Vaisman \u0026 Co., 540 F.2d 591, 596-98 (3d Cir. 1976). The former Fifth Circuit held that a plaintiff's reliance is reasonable if he did not \"intentionally refuse[] to investigate 'in disregard of a risk known to him or so obvious that he must be taken to have been aware of it, and so great as to make it highly probable that harm would follow.'\" Dupuy, 551 F.2d at 1020 (quoting W. Prosser, Torts § 34, at 185 (4th ed. 1971)). In other words, the plaintiff must not have been reckless in relying on the market. See Gower v. Cohn, 643 F.2d 1146, 1156 (5th Cir. Unit B May 1981); see also Shores, 647 F.2d at 470 n. 6. The adoption in many courts of the fraud-on-the-market theory and its presumption of reliance has not eliminated the reasonableness requirement. The Shores court, in fact, made reasonableness the second prong of its test. See supra note 13.\n\nThe fundamental flaw of Shores, however, is its failure to recognize what adoption of the fraud-on-the-market theory in a given context implies. Courts applying the theory must presume that investors can reasonably rely on the market to set an accurate price. Because all relevant information is accurately taken into account in well-developed markets, and because investors commonly rely only on market prices in making their investment decisions, courts essentially have determined that investors may reasonably rely on the prices set by well-developed markets. The Third Circuit recognized this presumption of reasonableness in Zlotnick v. Tie Communications, 836 F.2d 818 (3d Cir. 1988). In Zlotnick, the court correctly noted that the fraud-on-the-market theory raises three presumptions: (1) that the misrepresentation affected the market price, (2) that the purchaser relied on the security's price, and (3) that the reliance was reasonable. 836 F.2d at 822.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nBecause the fraud-on-the-market theory presumes reasonable reliance, courts must be very careful when applying this theory to markets other than well-developed, secondary markets; a court must closely examine the reasonableness of relying on the market in question. For example, the court in Cammer v. Bloom, 711 F. Supp. 1264, 1280-87 (D.N.J. 1989), closely examined the over-the-counter market to determine whether it was an efficient market capable of supporting the fraud-on-the-market presumptions. See also Stinson v. Van Valley Dev. Corp., 714 F. Supp. 132, 137 (E.D.Pa. 1989) (market for new issue does not warrant application of fraud-on-the-market theory). The Shores court, however, failed to conduct such an analysis. Instead, the court merely applied the theory to the primary market and added a reasonableness requirement to its three-prong test. Because fraud-on-the-market implies reasonableness, the second prong of the Shores test is nonsensical. Moreover, as I discuss next, the presumption of reasonable reliance on the primary market is simply invalid.\n\nAs I note above, Shores fails to state whether its unmarketability test focuses on the actual bonds issued (factual unmarketability) or on hypothetical bonds that could be issued at any combination of price and interest rate (economic unmarketability). I have shown that the former interpretation is correct, but reliance on a primary market to exclude either type of unmarketable bond is unreasonable.\n\n1.\n\nAssuming for the moment that a bond could be economically unmarketable, a primary market cannot reasonably be expected to exclude such a bond. The cast of characters in a primary market consists of initial investors and parties involved in an issuance, such as the promoter/corporation, the underwriter, the bond counsel, and the issuer. Obviously, initial investors cannot rely on themselves to police the market for unmarketable bonds. Thus, Shores must stand for the proposition that initial investors may reasonably rely on the issuing parties to exclude worthless securities.\n\nSuch a proposition is patently without justification.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e All of the parties involved in an issuance have a significant self-interest in marketing the securities at a price greater than their true value. The promoter/corporation and the issuer (if a separate entity) have an obvious interest in marketing the securities regardless of their true fair market value. Likewise, the bond counsel and underwriter, who are often retained under a contingency fee contract, are interested in marketing the securities at an inflated price. The underwriter in particular, who, like an insurer, can spread the risk of loss among many stock or bond subscriptions, has a reduced incentive to investigate thoroughly the true value of the securities it underwrites. Additionally, to determine when a security is worthless is nearly, if not completely, impossible. Thus, to accept the economic unmarketability interpretation of Shores, we must believe that an initial investor may reasonably rely on clearly self-interested (perhaps dishonest) parties to make decisions that are at least burdensome and at most economically irrational. I cannot accept this proposition.\n\n2.\n\nEven if we interpret Shores to require factual unmarketability, reliance on the primary market to exclude such securities is equally unreasonable. The participants in the primary market remain the same -- the initial investors and the parties involved in issuing the securities. Moreover, the issuing parties are subject to the same self-interest; they all might even be parties to the fraudulent scheme. Therefore, to accept the factual unmarketability interpretation of Shores, we must believe that an investor may reasonably rely on some participant in the issuance process to prevent fraudulently marketed securities from entering the market at the given price and interest rate.\n\nIn my view, such reliance could never be reasonable. Certainly, an investor might reasonably rely on a state regulatory agency to police a market. See Arthur Young \u0026 Co. v. United States Dist. Court, 549 F.2d 686, 695 (9th Cir.), cert. denied, 434 U.S. 829, 98 S. Ct. 109, 54 L. Ed. 2d 88 (1977). Also, I recognize that in some cases, such as the present one, we might be able to point to a party who (1) had control over the issuance of the securities, (2) was unaware of the fraudulent scheme, and (3) would have prevented issuance had all relevant information been available. With the aid of hindsight and in-depth discovery, we could conceivably make such a determination. I cannot, however, sanction a rule that would encourage this type of reliance by investors who lack the advantages of hindsight and discovery that we now enjoy. Such reliance would be unreasonable. But this is exactly the sort of reliance that Shores encourages.\n\n3.\n\nWhether we adopt the factual or economic unmarketability interpretation, reliance on the primary market to exclude unmarketable securities is simply unreasonable. An investor who so relies takes a great and obvious risk. Cf. Dupuy, 551 F.2d at 1005.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Shores created a presumption of reliance that is clearly wrong and then created a reasonableness test that can never be met.\n\nB.\n\nShores also creates serious problems in the context of a jury trial. A hypothetical, although by no means atypical, Shores action demonstrates several of these problems.\n\nFirst, suppose we have an exceedingly eager, but dishonest, entrepreneur named Smith who desires to defraud the investing community by issuing worthless bonds. Smith creates a sham corporation and then obtains the services of an underwriter, Jones, and an issuer, the City of Middletown. Jones insists on some type of security for the bonds, and Smith pledges his interest in a producing oil well that he fraudulently represents as being worth $1,000,000, but is actually worth only $20,000. Smith never intends to make a single payment on the bonds.\n\nWhen the bonds are issued, certain fraudulent statements are made in a circular, but Johnson, an elderly widow who purchases several bonds, does not read the circular or know of its existence. The bonds are issued for $2,000,000, and Johnson invests $100,000 -- most of her life's savings. When the first interest payment comes due, the bonds go into default, and Johnson brings suit for damages under Shores against Smith and Jones.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWhether a court adopts the economic unmarketability approach, as advocated by the majority today, or the factual unmarketability approach, makes a difference in how the case of Johnson v. Smith will evolve. Therefore, I explore both scenarios. Regardless of which approach the court adopts, however, the results will be equally disappointing.\n\n1.\n\nUnder an economic unmarketability approach, all cases, notwithstanding today's decision, should survive summary judgment and go to a jury. Johnson will produce expert testimony to the effect that, because the bonds were doomed to default, they were worthless, hence unmarketable. Smith will produce expert testimony that the bonds had a salvage value (in this case, one cent on the dollar) and thus could have been marketed at some combination of price and interest rate. Since a material issue of fact will exist, the jury will be called upon to determine whether the bonds were marketable. Thus, the trial will result in a \"battle of the experts.\"\n\nOnce all of the evidence has been adduced at trial, the court will instruct the jury that Johnson can recover only if the jury finds the bonds unmarketable under Shores. Using the economic interpretation of unmarketability, the court will direct the jury to find for Johnson only if the bonds were completely worthless when issued and to find for Smith if the bonds had at least some value and could have been issued at some combination of price and interest rate.\n\nNow we can see the dilemma faced by the jury. The jury is presented with a case in which the plaintiff invested $100,000 and recovered only $1,000 on that investment -- a loss of 99% of the original investment. Johnson, moreover, is a plaintiff who will elicit strong feelings of sympathy from the jury. The jury, however, is being asked to grant or deny relief based on whether the bonds had a value of at least one cent when issued -- a wholly fortuitous circumstance in the eyes of the jury. The facts most impressive to the jury will be Smith's \"bad\" intent and that his scheme caused Johnson to lose 99% of her life savings. That Johnson lost $99,000 rather than $100,000 will be a meaningless distinction to a jury that represents the conscience of the community.\n\nTwo results are possible. First, and most likely, the jury might disregard the Shores instruction and find for Johnson -- in effect taking the law into its own hands. Or, the jury might abide by the Shores instruction, contrary to its conscience. This result is just as bad as the first since Shores will fail to command the respect of (1) the community, which is being asked to grant or deny relief based on an apparently meaningless distinction; (2) the plaintiff/investor, who will lose his investment unless he can produce an expert to testify that the bonds were worthless; and (3) the person seeking to defraud the community, who can avoid Shores liability simply by creating some value for the bonds.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n2.\n\nIf the court interprets Shores to require factual unmarketability, the results in this hypothetical case will be equally disappointing. Johnson will produce experts to testify that, had all relevant information been available, some entity would have prevented the issuance of the bonds. Smith will produce experts to testify that every entity that could have prevented the issuance must have known of his scheme. Thus, Smith will argue, the bonds would have been issued even if all relevant information had been available to the entities capable of preventing the bonds from entering the market. The issue of marketability will again go to the jury, and the jury will again be faced with a decision to grant or deny relief based on a fortuitous circumstance. The jury will be most concerned with Smith's fraud and Johnson's loss, not with whether some entity in the issuance process knew of the fraud and would have done something to prevent the fraud had it known.\n\nConsequently, we are faced with the same two possibilities: either the jury will disregard the Shores instruction, or it will follow the instruction. Again, the second possibility will create disrespect for the rule on the part of the community, the investor, and the potential defrauder, who now can avoid Shores liability by including in his fraudulent scheme all of the entities in the issuance process.\n\nThis exploration of how a typical Shores action would evolve in the context of a jury trial demonstrates that juries will find the distinctions drawn by Shores to be arbitrary and meaningless. Either the jury will effectively eliminate the reliance requirement when its conscience dictates,\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e or the rule of law in this area will lose the respect of both those it seeks to protect and those it seeks to punish.\n\nC.\n\nThe calculation of damages under Shores also presents serious problems. Not only would this damages calculation likely conflict with other aspects of the decision, but it also would undermine the primary goal of the securities acts -- disclosure.\n\n1.\n\nIn a Rule 10b-5 action against non-issuing parties, courts may not grant rescission as a remedy. Huddleston v. Herman \u0026 MacLean, 640 F.2d 534, 554-55 (5th Cir. Unit A Mar. 1981), aff'd in part and rev'd in part on other grounds, 459 U.S. 375, 103 S. Ct. 683, 74 L. Ed. 2d 548 (1983). Rescission is an equitable remedy that restores the parties to a transaction to their status quo ante. Id. at 554. Typically, a buyer discovers a seller's fraud, promptly tenders the goods to the seller, and demands the return of his purchase price. The court then orders the seller to return the purchase price and uses its civil contempt power to coerce the seller's compliance with its order. This remedy is available, however, only against parties to a contract -- a court may not order rescission in a buyer's action against a defrauding party who is not a party to the contract of sale. Id. at 555. Thus, in the context of Rule 10b-5, where buyers often sue parties that are not in privity of contract with the buyer, rescission is unavailable. Id. A Rule 10b-5 plaintiff who sues non-issuing parties must seek damages instead.\n\nIn a typical Rule 10b-5 case, the measure of damages allows for recovery of out-of-pocket losses. A plaintiff can recover for the damages actually and proximately caused by the Rule 10b-5 violation. See Woods v. Barnett Bank, 765 F.2d 1004, 1013 (11th Cir. 1985); Huddleston, 640 F.2d at 555.\n\nUnder the Shores analysis, however, determining damages is problematic.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Shores implicitly holds that an investor is not entitled to rely on the issuance price as an accurate reflection of a security's worth. See 647 F.2d at 470. Only when the security is unmarketable can the investor recover damages. If the investor was not entitled to rely on the selling price, however, on what price can he rely in order to determine his out-of-pocket damages?\n\nOne response is that the investor has no price on which to rely and that therefore no damages are assessable. Presumably the Shores court did not intend such an empty victory for the investor. Another response is that the only price on which the investor can rely is one cent -- the minimum value of a marketable security. Again, under Shores, this is presumably not an acceptable approach because the damages recoverable would be so nominal as to preclude the bringing of such suits.\n\nThe only other measure of damages is one that would allow the investor to recover the security's original purchase price since no other price exists on which to peg the loss. This is also the only one of the three measures that would provide investors sufficient incentive to bring such suits. The anomaly of such a recovery, of course, is that although the investor had no right to rely on the issuance price when he bought the securities, he can recover that full amount if the securities were unmarketable. Moreover, this measure of damages in effect rescinds the contract of sale by awarding the investor the return of his full purchase price -- a remedy wholly inappropriate when the defrauding parties were not the sellers of the securities.\n\n2.\n\nThat the fundamental purpose of the securities acts is to implement a philosophy of full disclosure has become something of a maxim that guides courts in their efforts to construe the acts. See Basic, 485 U.S. at, 108 S. Ct. at 982. Some jurists have expressed concern that the fraud-on-the-market theory conflicts with this philosophy because it enables investors to prove reliance on fraud contained in public disclosures without having to read those disclosures. See id. at, 108 S. Ct. at 997-98 (White, J., concurring in part and dissenting in part) (quoting Shores, 647 F.2d at 483 (Randall, J., dissenting)). Consequently, they argue that the theory makes disclosure, which Congress deemed so important, meaningless. The Shores court, however, claimed that the goal of full disclosure would not be undermined by its extension of fraud-on-the-market to primary markets because, by limiting recovery to instances when unmarketable securities were sold, investors would still have to read public disclosures in order to recover for securities that were marketed at an improper price. 647 F.2d at 470.\n\nWhether the fraud-on-the-market theory, as traditionally applied, undermines the goal of disclosure is not an issue here. The Shores extension, however, contrary to the Shores court's protestations, clearly does undermine that goal. As discussed above, the only workable measure of damages in a Shores action would be the full price paid by the plaintiff for the new issue. That being so, a Shores award would simply be the plaintiff's out-of-pocket expenses caused by the fraud -- the same measure of damages for a standard Rule 10b-5 recovery based upon actual reliance, see L. Loss, Fundamentals of Securities Regulation 967 (2d ed. 1988) (out-of-pocket normally means difference between price paid and value of securities). Thus, under Shores, any incentive to read disclosures essentially disappears since plaintiffs would receive the full purchase price for their securities without having to read disclosure information. Furthermore, an investor might rationally seek to avoid reading disclosures in order to preserve a possible claim under Shores.\n\nNot only does Shores discourage investors from being informed about their investments, it does so in a context that requires investors to be extremely well informed. In a well-developed market, market professionals sift through public disclosures for relevant information. See Fischel, Use of Modern Finance Theory in Securities Fraud Cases Involving Actively Traded Securities, 38 Bus.Law. 1, 13 (1982). Their buying and selling then incorporates relevant information into the market price, and a rational investor can rely on that price. Id.; see also Basic, 485 U.S. at, 108 S. Ct. at 991-92. Because that process has not yet occurred where securities are newly issued, a rational investor in a primary market must personally sift through the disclosures for information relevant to his investment decision. By taking away the incentive for investors to read disclosure documents accompanying newly issued securities, Shores encourages irrational behavior by investors and undermines the securities acts' philosophy of full disclosure.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nD.\n\nFinally, one could argue that the underlying goal of securities regulation is to promote free and honest securities markets and that Shores promotes that goal by attacking a certain type of fraudulent behavior, i.e., the type of behavior that causes unmarketable securities to appear on the market. Punishing this type of behavior only in primary market transactions, however, is arbitrary since sales of unmarketable bonds do not necessarily constitute the most egregious cases of fraud. One could easily characterize the fraudulent sale of bonds worth $100 for $10,000 as more egregious than the sale of bonds worth $0 for $10, although Shores punishes only the latter situation.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Or, one could characterize a fraudulent scheme involving an issuer, underwriter, and bond counsel as more egregious than a scheme involving only the issuer. Factual unmarketability requires the existence of at least one honest issuing party to protect the integrity of the market from unmarketable bonds. Thus, Shores would likely sanction only the latter scheme. Moreover, although this type of behavior should be deterred, other means of deterrence are available without having to stretch Rule 10b-5 beyond recognition.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nE.\n\nIn summary, I find no reasons whatsoever in the caselaw, in the policies underlying the securities acts, or in the theoretical underpinnings of corporate finance that justify the Shores court's departure from the established proposition that the fraud-on-the-market theory applies only to well-developed markets.\n\nIV.\n\nFinally, I am compelled to address the argument that, while Shores is probably bad law, the doctrine of stare decisis prevents us from overruling that case today. See post slip op. at 104-105, at (Kravitch, J., dissenting). I am certainly mindful of the importance of stare decisis : it provides continuity to the law and allows members of society to conform their conduct to the law without risk of surprise in the courthouse. Nevertheless, stare decisis is a \"principle of policy and not a mechanical formula of adherence to the latest decision.\" Helvering v. Hallock, 309 U.S. 106, 119, 60 S. Ct. 444, 451, 84 L. Ed. 604 (1940) (Frankfurter, J.). Obviously, a departure from precedent could impose certain costs on members of a community who have structured their commercial transactions to conform to precedent, but when the costs of following an erroneous precedent outweigh the costs of departing from it, \"respect for precedent balks at the perpetuation of error.\" United States v. Minnesota, 113 F.2d 770, 774 (8th Cir. 1940).\n\nI have shown that appellants in the instant case have produced sufficient evidence to withstand summary judgment on the issue of marketability under Shores. Marketability being the only disputed issue in this case, appellants have produced sufficient evidence to take their Shores claim to the jury. Therefore, the validity of the Shores holding is properly before this court, and, sitting en banc, we are obligated to address that issue. The arguments presented in this concurrence conclusively prove, I submit, that Shores is not justified by policy concerns or theoretical considerations and presents enormous difficulties at jury trials and in computing damages. Moreover, it erodes the public's respect for the law and confidence in the ability of the courts to fashion fair and meaningful rules and distinctions. In short, Shores is bad law.\n\nA venerable jurist has stated that, \"few rules in our time are so well established that they may not be called upon any day to justify their existence as a means adapted to an end.\" B. Cardozo, The Nature of the Judicial Process 98 (1921). I find no basis for Shores ' existence and therefore would take this opportunity to depart from that precedent.\n\nHILL, Circuit Judge, concurring in which FAY and COX, Circuit Judges, join:\n\nI concur.\n\nHowever, I add this. Note 11 to the text of the court's opinion observes that Shores v. Sklar, 647 F.2d 462 remains the law of this circuit. That is not a holding in the sense that we have today endorsed that case; we have realized that we do not have to reach it. The fact that my brother Clark finds it appropriate, in dissent, to argue the facts of this case at some length calls into question our wisdom in dealing with each case on its own facts. If the \"fraud on an undeveloped market\" idea is not the law, such debates could be prevented.\n\nI do not dissent from the approach we are taking, but had we reached the \"undeveloped market\" issue head on, I'd prefer that the theory be abandoned. The expression, \"fraud on an undeveloped market\" is a contradiction in terms. It may be translated as, \"fraud on a non-existent market.\" An undeveloped market is less than a twinkle in an issuer's eye. It says no more than \"an unwritten book\" or \"an uncomposed song.\"\n\nPerhaps the Court will have an occasion to re-examine Shores v. Sklar on another day.\n\nKRAVITCH, Circuit Judge, dissenting:\n\nI agree with Judges Johnson, Hatchett, and Clark that the appellants have raised a genuine issue of material fact as to the marketability of the bonds, thereby precluding a grant of summary judgment. I hesitate to add yet another voice to the chorus of opinions in this case; nevertheless, I believe that some further observations are in order.\n\nThe majority concludes that the structure of the first proposed bond offering was so different from the final deal offered to the public that a warning as to the feasibility of the original deal \"generates no reasonable inference regarding the marketability of the final deal.\" Ante, at 730. Yet, as Judge Hatchett suggests, the very question of whether the structure of the two deals differed so significantly is itself a question of fact, and one as to which the appellants have raised a genuine issue of material fact. The majority opinion and Judge Clark's dissent demonstrate that reasonable minds may differ as to whether the changes between the bond issue as first planned and as finally executed enhanced the marketability of the bond offering. When the facts and the inferences drawn from the facts are disputed, summary judgment is not proper.\n\nBecause I believe the district court erred in granting summary judgment for appellees, I must address the question that the majority does not reach -- whether we should overrule Shores. I believe that principles of stare decisis weigh heavily against overruling Shores. If the rule adopted in Shores should be modified, then Congress or the Supreme Court may do so.\n\nAppellees and several amici suggest that Shores is inconsistent with the Supreme Court's recent decision in Basic Inc. v. Levinson, 485 U.S. 224, 108 S. Ct. 978, 99 L. Ed. 2d 194 (1988), which relied in part on the efficient market hypothesis to support its application of the fraud-on-the-market theory's rebuttable presumption of reliance in Rule 10b-5 cases. I recognize that Basic Inc. involved a well-developed, i.e., \"efficient\" market, and that Shores and the instant appeal involve undeveloped, inefficient markets. I also recognize that the efficient market hypothesis would not justify indirect proof of reliance absent an efficient, developed market. Yet Basic Inc. did not adopt the efficient market hypothesis as the law of the land. Although economic theory may provide courts with guidance, and perhaps insight, the science of economics remains as inexact as the \"science\" of law itself.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e I would not revisit and overturn prior decisions simply to bring them into conformity with current -- and probably passing -- economic fashion.\n\nJOHNSON, Circuit Judge, dissenting:\n\nAlthough I agree with the majority in sustaining the fraud on the underdeveloped market framework as set forth in Shores v. Sklar, et al., 647 F.2d 462 (5th Cir. 1981) (en banc), I would hold that summary judgment is inappropriate in this particular case. I join in Judge Clark's thorough discussion of how the admitted unfeasibility of the first proposed bond issue raises a disputed question of material fact to preclude summary judgment, but write separately on the issue of sham pre-sales.\n\nThe majority is correct that complete disclosure of all the material facts surrounding the pre-sale of the Mount Royal apartment units would have defeated the plaintiffs' argument that the bonds were unmarketable. If bonds were sold after all material facts were made public, it can hardly be said that the bonds were unmarketable based on those disclosed facts. Judge Clark's dissent somewhat finesses the point that disclosure of a set of facts is a valid defense to the claim that the facts disclosed are responsible for the bonds' unmarketability.\n\nThat defense, however, is unavailing in this case. The majority fails to note that some material facts were omitted from the official statement. The majority states that \"the documents disclosed that there were no binding pre-sales, that a certain number of pre-sales had no deposit or reduced deposit.\" However, the documents do not show the high percentage of units pre-sold to relatives and employees at the last moment in order to meet the 50% minimum pre-sale level. The question of the materiality of these non-disclosures can be evaluated in light of the following question: Had the omitted facts been disclosed, would the market have been substantially more likely to reject the bonds? Given the nature of the pre-sales and the tenuous nature of the financing involved, market rejection of the bonds would have been quite likely. I cannot say as a matter of law that complete disclosure would not have rendered the bonds unmarketable. Therefore, the question of how the market would have reacted to complete disclosure is for the jury. Plaintiffs have succeeded in raising a disputed issue of material fact regarding whether disclosure of the nature of the pre-sales would have undermined the marketability of the bonds.\n\nFor the foregoing reasons, I respectfully dissent.\n\nHATCHETT, Circuit Judge, dissenting:\n\nI join in Judge Johnson's dissent and Judge Clark's dissent to the extent that they find a disputed issue of material fact which should have precluded summary judgment based on the relationship between the first and second bond issues.\n\nCLARK, Circuit Judge, dissenting:\n\nI agree that the issue in this case is whether the defendants \"engaged in a fraudulent scheme to issue the tax-exempt bonds, which would be unmarketable absent the fraud.\" I further agree that the defendants had to have reason to know that the bonds were unmarketable in order to be liable to the plaintiffs. I therefore find the majority opinion's legal analysis is generally correct although I disagree on one legal point.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI part with the majority in its conclusion that the defendants had no reason to know that the bonds would most likely go into default. The majority gives only a slight recognition to the symbiotic relationship between the marketability of the bonds and the marketability of the units of the Mount Royal Towers continuing care facility. The majority's analysis of the economic factors that affected the marketability of those units, and therefore the bonds, is thus insufficient and unrealistic. There is no recognition of the economic climate of the late 1970s and early 1980s when the Federal Reserve Bank Open Market Committee, led by Chairman Paul Volcker, constricted the money supply and the prime interest rate rose to twenty-one percent. Finally, the majority fails to grasp the importance of the type of facts that professionals in the underwriting process must collect and analyze in determining whether a bond issue is likely to be successful. Among those facts is that the project was of a specialty type -- a convalescent/retirement home with nursing facilities but with considerable more amenities than the typical nursing home.\n\nAs will be described in detail, the initial Mount Royal Towers project, from which the original underwriters withdrew, proposed a sale of about $19,000,000 in bonds for the construction of a 250 residential unit continuing care facility for the elderly. The project was repeatedly cancelled because of an insufficient demand for the residential units and the adverse economic conditions in the bond market. The defendants nonetheless raised the bond issue to $29,500,000 and more than doubled the cost of acquiring and occupying a unit. Yet, they had no assurance that there were any bona fide purchasers for the bonds or the units. In fact, most prospective residents cancelled their agreements shortly after the bonds were issued in September 1981 and before the project opened its doors in July 1983. The bonds defaulted and the facility was sold in bankruptcy for approximately $18,000,000 in 1984.\n\nAs judges we are ill-equipped to assess whether the project the defendants promoted was marketable. The facts, as expanded in this dissent, lead me to believe that it may well not have been. It is not the function of judges, however, to make such a decision. There is a genuine issue of fact as to whether a reasonable developer and underwriter would have known that this project would fail. For justice to be done in this case, this factual issue must be submitted to a jury. The reasons I believe this to be true are set forth below.\n\nI. Legal Analysis\n\nA. Rule 10b-5 and the Shores Test\n\nIn 1934, Congress enacted the Securities Exchange Act to remedy abusive practices in the investment industry which had led to reduced investor confidence in the integrity of securities markets. The Act's central purpose is the protection of investors and the promotion of free and honest security markets. The Supreme Court has stated that the securities acts are designed to \"protect investors against fraud and . . . to promote ethical standards of honesty and fair dealing.\" Ernst \u0026 Ernst v. Hochfelder, 425 U.S. 185, 195, 96 S. Ct. 1375, 1382, 47 L. Ed. 2d 668 (1976).\n\nThe 1934 Act's key antifraud provisions are section 10(b)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and Rule 10(b)-5, which the Security Exchange Commission promulgated in 1942. The basic purpose of \"section 10(b) and Rule 10b-5 and indeed, the Exchange Act, is to protect investors and instill confidence in the securities markets by penalizing unfair dealings.\" Sargent v. Genesco, Inc., 492 F.2d 750, 760 (5th Cir. 1974); see Wolfe v. E.F. Hutton \u0026 Co., Inc., 800 F.2d 1032, 1036 (11th Cir. 1986) (en banc) (act and rule designed to encompass the \"infinite varieties of devices that are alien to the 'climate of fair dealing'\" Congress sought to create and maintain). The principal means of investor protection are disclosure requirements and civil remedies for fraudulent conduct.\n\nUndoubtedly, a principal purpose of the securities laws is to promote the full disclosure of information that furthers informed investment decision-making. This purpose is manifest in Rule 10b-5(b) which makes it unlawful to \"make any untrue statement of a material fact necessary in order to make the statements made, in light of the circumstances under which they were made, not misleading.\" 17 C.F.R. § 240.10b-5(b). If information disclosure was all that was necessary to ensure Congress' goal of honest securities markets, the story would end here because 10b-5(b) would be the panacea Congress sought to solve all abuses in the securities industry.\n\nThe securities acts, however, have a much broader reach prohibiting complex fraudulent schemes as well as uncomplicated misrepresentations and omissions. Under Rule 10b-5 it is also unlawful to (a) \"employ any device, scheme or artifice to defraud\"; . . . and (c) \"engage in any act, practice, or course of business which operates or would operate as a fraud or deceit upon any person.\" 17 C.F.R. § 240.10b-5(a) \u0026 (c) (emphasis added). In contrast to subsection (b), these subsections contain broad and prophylactic language designed to remedy and prevent any fraudulent conduct that harms investors or investors' confidence in securities markets. Courts have refrained from interpreting the broad language of Rule 10b-5 to create limitless liability. Instead, they have constructed \"workable limits\" to liability which accommodate the interests of investors, the business community, and the public generally. Herpich v. Wallace, 430 F.2d 792, 804-05 (5th Cir. 1970).\n\nB. Shores ' \"Fraud on the Market\" Theory\n\nA primary example of this judicial accommodation is the \"fraud on the market\" theory this court enunciated in Shores v. Sklar, 647 F.2d 462 (5th Cir. 1981), cert. denied, 459 U.S. 1102, 103 S. Ct. 722, 74 L. Ed. 2d 949 (1983), and upon which the plaintiffs in this action rely. Under Shores, an investor who purchases a security without reading the relevant disclosure documents may still maintain an action under Rule 10b-5 provided he presents evidence of a fraudulent scheme to defraud investors through the sale of unmarketable securities. Shores simply recognizes a legitimate theory for protecting investors from fraudulently marketed securities that supplements the disclosure/non-disclosure theories. Security issuers must therefore consider not only whether their disclosures are accurate and complete but whether the securities they issue are unmarketable.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe foundation of a Shores cause of action rests upon the proposition that fraud underlying the issuance of a public offering may be the only reason that the securities were offered on the market at all. In Shores, the plaintiff had purchased industrial bonds without reading the disclosure documents. The bonds later defaulted and the plaintiff alleged under rule 10b-5 that the defendants had fraudulently marketed the bonds through the issuance of a misleading offering circular, erroneous financial statements, and other fraudulent acts. The trial court held that the plaintiff failed to establish reliance because of his failure to read the documents. The Fifth Circuit, en banc, affirmed the district court's analysis under 10b-5(b) but held that the plaintiffs stated a cause of action under the broader protections of 10b-5(a) and (c). 647 F.2d at 469.\n\nThe court held that the fraudulent scheme on the part of the developer, bond counsel, underwriter, accountant and indenture trustee constituted an actionable securities law violation despite the plaintiffs' admitted non-reliance on the disclosure documents. The court announced a three-part test which requires the plaintiffs to prove that:\n\n(1) the defendants knowingly conspired to bring securities onto the market which were not entitled to be marketed, intending to defraud purchasers;\n\n(2) the purchasers reasonably relied on the security's availability in the market as an indication of its apparent genuineness; and\n\n(3) the purchaser suffered a loss as a result of the scheme to defraud.\n\nShores, 647 F.2d at 469-70. The first element requires proof of a fraudulent scheme in which participants knowingly or recklessly disregarded the fact that the securities they marketed were unmarketable.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The participants must have the requisite degree of scienter. The second element is the \"fraud on the market\" reliance requirement as applied to initial issuance markets.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Because this element incorporates a version of the \"fraud on the market\" reliance theory that the Supreme Court recently upheld,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e courts and commentators generally refer to the entire Shores theory of liability as a \"fraud on the market\" theory.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Finally, the third element simply establishes damages.\n\nThe majority finds that the plaintiffs' burden to prove the first element in a Shores action is a \"substantial one.\" Maj. Opinion at 729, at . To satisfy their burden under the first element of the Shores test, the plaintiffs must establish three facts: the existence of a scheme to defraud, the defendants' knowing participation in the scheme (scienter), and the securities' unmarketability. The majority, however, holds that the plaintiffs have not met their burden because they have \"failed to generate a genuine issue of fact as to marketability.\" Maj. Opinion, at 730, at . Thus, the majority does not address whether a scheme to defraud existed or whether the defendants' knowingly participated in the scheme. Instead, the majority concludes that evidence of previous failures to raise project financing and the project's unsuccessful marketing program fail to raise a genuine factual issue. As discussed infra, the majority opinion unjustifiably eliminates these crucial forms of evidence which determine a security's unmarketability.\n\nThe concept of unmarketability in Shores requires a factual inquiry into the proposed entity's projected financial viability. Unmarketability under the Shores test does not require that the plaintiffs demonstrate the securities they purchased are totally worthless. The plaintiffs in Shores, for example, received thirty-seven percent of their initial investment. Shores v. Sklar, 844 F.2d 1485, 1488 (11th Cir. 1988). Instead, the plaintiffs must prove only that the securities were unmarketable. An unmarketable security is one which would not have been issued absent some type of fraudulent conduct by the issuer. Shores, 647 F.2d at 464 n. 2; Lipton v. Documation, Inc., 734 F.2d 740, 745 (11th Cir. 1984) (extending fraud-on-the-market reliance theory to open market), cert. denied sub nom., Peat Marwick Mitchell \u0026 Co. v. Lipton, 469 U.S. 1132, 105 S. Ct. 814, 83 L. Ed. 2d 807 (1985). The fraudulent marketing scheme must be \"so pervasive that without it the issue would not have issued, the dealer could not have dealt in, and the buyer could not have bought [the bonds], because they would not have been offered on the market at any price.\" Shores, 647 F.2d at 464 n. 2. The phrase \"[the bonds] would not have been offered on the market at any price\" is imprecise and could lead to the erroneous conclusion, for example, that the bonds in Shores would have been marketable at 37 cents on the dollar (the nominal return investors received), rather than face value. The relevant inquiry is whether there is any combination of price and interest rate at which the bonds would have been marketable but for the fraud.\n\nThus, marketability requires a factual showing that the security would not have been issued but for the defendants' knowingly fraudulent conduct. This factual inquiry may be relatively simple in cases where a fraudulent scheme's sole purpose from its inception was to swindle investors. The inquiry, however, becomes more arduous when a project's promoters fraudulently portray an otherwise infeasible project as financially viable in order to issue unmarketable bonds. This latter inquiry is critically dependent upon a thorough review of all the evidence relevant to the project's feasibility and the bonds' marketability. For this reason, the standard of review on summary judgment has increased importance under the Shores test.\n\nII. Standard of Review on Summary Judgment\n\nA number of standards determine the scope of review of the district court's order granting summary judgment. First, review of the district court's order is plenary and is conducted using the same legal standards as those used in the district court. Carlin Communication v. Southern Bell, 802 F.2d 1352, 1356 (11th Cir. 1986); Mercantile Bank \u0026 Trust v. Fidelity \u0026 Deposit Co., 750 F.2d 838, 841 (11th Cir. 1985). A de novo review of the voluminous evidentiary record in this action, therefore, is required.\n\nSecond, the fact that substantial discovery has occurred and that the plaintiffs bear the burden of proving the relevant issues at trial affects the review of the district court's order. A court should grant summary judgment if the plaintiffs fail to make a showing sufficient to establish the existence of an element essential to their case. Celotex v. Catrett, 477 U.S. 317, 321-22, 106 S. Ct. 2548, 2552-53, 91 L. Ed. 2d 265 (1986). This showing, which need not be in the form of admissible evidence, can be made by reference to affidavits, depositions, and answers to interrogatories. 477 U.S. at 323, 106 S. Ct. at 2553-54. In determining whether the moving party has met his burden, the evidence and inferences drawn from the evidence are viewed in the light most favorable to the nonmoving party, and all justifiable inferences are resolved in his favor. Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 253-54, 106 S. Ct. 2505, 2513, 91 L. Ed. 2d 202 (1986); Carlin, 802 F.2d at 1356. A court may not weigh conflicting evidence to resolve disputed factual issues. Instead, if a genuine issue of material fact is found, the court must deny summary judgment. Carlin, 802 F.2d at 1356.\n\nFinally, the complex factual inquiries inherent in a Shores cause of action necessitates a restrained approach towards granting summary judgment in favor of defendants. The Shores plaintiffs must prove that (1) each defendant acted with scienter; (2) participated in a scheme to defraud the investing public; and (3) that the bonds could not have been marketed but for the defendants' fraudulent scheme.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Each of these fact-bound elements are generally ill-suited for summary review. Levinson v. Basic Inc., 786 F.2d 741, 749 (6th Cir. 1986) (summary judgment inappropriate in section 10(b) security cases), reversed on other grounds, 485 U.S. 224, 108 S. Ct. 978, 99 L. Ed. 2d 194 (1988); Vol. 10A, Wright, Miller, \u0026 Kane, Federal Practice and Procedure, Civ.2d § 2732, 309-10 (1983).\n\nIn particular, factual questions regarding whether bonds would be marketable absent the defendants' fraud are generally not susceptible to determination as a matter of law. Judicial review of the marketability of the bonds at issue requires the examination of complicated financial documents, feasibility studies, and testimony by financial professionals all of which stretch the judicial ability to conclude with certainty that no genuine issues of fact exist. \"The question whether a security was 'entitled to be marketed,' i.e., whether the security, absent the fraud, could have been marketed at some price, and the question whether the scale of fraud was broad enough are both presumably questions of fact, not readily disposed of by summary judgment\". Shores, 647 F.2d at 486-87 (Randall, J., dissenting). With these standards in mind, we review the plaintiffs' evidence in a light most favorable to their position.\n\nIII. Evidence of Marketability of Bond Issue\n\nThe plaintiffs' central claim is that the defendants marketed the Mount Royal bonds even though they knew or recklessly disregarded the fact that the project could not generate sufficient revenue to repay the debt. The plaintiffs support their claim with numerous facts regarding the defendants' conduct which indicates their knowledge of the project's likelihood of failure. First, the defendant Rice's previous attempts to acquire financing were unsuccessful because the project was financially infeasible in view of the adverse conditions in the bond market. This fact was known to the other defendants. Second, the defendants ignored the warnings of the original underwriter and feasibility consultant that the project would not generate sufficient revenues to repay the bonds at marketable interest rates. Instead, they agreed to modify the project by increasing both apartment unit prices and bond interest rates to make the project appear feasible although they knew that the changes would render the apartments too expensive to be sold in the relevant geographic market. Third, the defendants allegedly knew that Rice's sham pre-sale agreements made the project appear feasible. Fourth, the defendants were aware that long delays in construction of the facility \"burned\" the sales territory irreparably damaging consumers' interest in purchasing Mount Royal units. Finally, the defendants were able to market the bonds only because they failed to expose the project's inauspicious background which would have seriously undermined the conclusion in the Official Statement that the project was feasible.\n\nThe district court reviewed the evidence presented and concluded that there was no evidence from which a jury could reasonably infer a scheme to bring securities into the market which were not entitled to be marketed. In affirming the district court, the majority concludes that the plaintiffs provided only two categories of evidence to satisfy their burden of proof under Shores : (1) the fact that past financing attempts failed; and (2) the unsuccessful pre-marketing program and lack of legitimate pre-sales. The majority concludes that the former is irrelevant and that the latter does not create an inference that the bonds were unmarketable. The majority however simply ignores the permissible alternative inferences that a court must afford this evidence on summary judgment. Viewed in a light most favorable to the plaintiffs, the plaintiffs' evidence collectively supports the plaintiffs' contention that the bonds were unmarketable due to the defendants' fraudulent scheme.\n\nA. Past Financing Attempts Failed\n\nWe have been plagued all year with the most unfavorable bond market in recent years which, unfortunately, has continued to deteriorate over the last several weeks to the point where investor interest in non-rated, long term tax-exempt bonds is virtually nonexistent.\n\n\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nRice made a number of attempts to acquire traditional financing for the Mount Royal Towers project as a for-profit or non-profit venture each of which ended in failure. The plaintiffs claim that Rice and the other defendants knew of these previous failures to attain sufficient financing yet continued to promote the ill-fated project. The plaintiffs assert that the defendants contributed to the project's unfeasibility by doubling occupancy fees despite cautions from the previous underwriter and feasibility consultant that existing fees were as high as the market would bear.\n\nThe majority concludes that the new project was so dissimilar to the previous projects that the opinions of the underwriter and experts regarding the previous projects' feasibility are irrelevant in establishing the plaintiffs' burden of proof under a Shores cause of action. Slip Opinion, at 86, at . The majority states that \"the caution against increasing the occupancy fee, which was in the context of the previous deal, could not logically apply to the feasibility of the deal under the new pricing structure.\" Id.\n\nThe illogic, however, is the majority's holding that the restructured project made the residential units more financially attractive and that past failures to obtain financing, therefore, provided no basis for inferring that the defendants knew that the Mount Royal Towers project would fail. The majority's reasoning is structured as follows:\n\n(1) Assume Project 1 is infeasible;\n\n(2) Project 2 differs from Project 1 because Project 2 has a more lenient refund policy;\n\n(3) Project 2's more lenient refund policy makes Project 2 similar to ownership versus renting;\n\n(4) Because of its more lenient refund policy and similarity to ownership, Project 2 is more financially attractive to prospective residents than Project 1; Therefore, evidence that Project 1 is infeasible is irrelevant on the issue of whether Project 2 is infeasible because Project 2 differs from and is preferable to Project 1.\n\nPlaintiffs present the alternative and factually supportable theory that Project 2's differences make it less desirable than Project 1. Therefore, because Project 1 is infeasible, Project 2, which is less desirable, is also infeasible.\n\nThe majority's syllogism is fatally flawed for a number of reasons. First, the two projects had significant differences such as the amount of occupancy fees, the refund policy (which subordinated refunds to bondholders), the number of residential units, the dollar amount and interest rate of the bond issues, and the contingent nature of the defendants' fees.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e All of these differences are relevant in determining whether the restructured project was financially feasible. The majority, however, focuses solely on one of these differences (the refund policy) rather than analyzing the collective impact of all the differences. Further, the majority's prepaid rent versus ownership analogy masks the simple fact that the second plan required significantly higher up-front and monthly payments and that residents were essentially investing in the capitalization of the Mount Royal project.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nNext, the majority reaches the unwarranted and erroneous conclusion that the restructured project was more \"financially attractive\" because of the second project's assertedly more lenient refund policy and similarity to ownership. There is no basis, however, for the conclusion that this refund policy is \"lenient\" nor is there support in the record for a finding that prospective residents preferred ownership over renting. Instead, the record and simple economic sense establish that the refund policy actually increased residents' risk of financial loss and adversely affected the feasibility of the project's marketing plan. The majority's conclusions regarding the economic effects of the second project's refund policy are simply unsupported by either economic logic or the evidence in the record.\n\nFinally, the majority completes its unrealistic syllogism with the conclusion that because the second project is preferable to the first project (a false assumption), evidence of prior financing failures are irrelevant in determining whether the second project is feasible. In short, the majority's premise (that the projects are dissimilar) does not support its conclusion (that the prior project's financial unfeasibility is irrelevant). A more reasonable conclusion is that the differences between the old and new projects actually favor the plaintiffs' theory that the second project was infeasible and the bonds unmarketable.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Rather than permitting a trier of fact to decide which inferences are to be drawn from the projects' differences, the majority simply presents its own subjective and erroneous view that the restructured project was preferable to the new one. These types of inferences are for the trier of fact, not a court on summary judgment.\n\n1. Refund Policy\n\nThe majority is correct in stating that there were differences in the marketing and occupancy fee structures between the first Mount Royal project and the one that ultimately failed. The majority, however, focuses on only one different factor: the refundability of the occupancy fees differed under the two plans. The majority then makes an enormous leap in its analysis by concluding that because there was a difference in occupancy fee refund policy, none of the evidence of the project's past failures is relevant to prove unmarketability. A closer look at the facts reveals a different picture.\n\nThe original plan allowed a partial refund of occupancy fees based upon the length of time a resident occupied a unit. The amount of refund equaled the occupancy fee less an application fee of $1,500 less 2 percent per month for up to four years of occupancy. Thus, a resident who paid $27,880 for a one bedroom residential unit and who later decides to terminate the occupancy contract after two years would receive a $12,956 refund. After four years of occupation, none of the occupancy fee was refundable.\n\nThe plan developed by defendants provided that a prospective resident purchase a \"nontransferable\" right to lifetime occupancy in the facility. If the resident dies, decides to leave, or is transferred to the project's health care unit, the occupancy contract terminates and the company can enter into a contract with a new resident. The prior resident (or his estate) would then receive an amount equal to the original occupancy fee paid or the amount of the initial occupancy fee received by the company from the new resident, whichever is less. The refund, however, is given only after the prior resident dies or vacates the entire project (both residential and health care units). More importantly, residents have no right to a refund if the Mount Royal Towers project goes into default (a factor not incorporated into the defendant Laventhol \u0026 Horvath's feasibility study). Official Statement, at 35. Residents' rights to refunds are therefore contingent on a number of factors which hinge on the success of the project itself.\n\nFor example, under the second plan a prospective resident who pays a $72,500 occupancy fee for a one-bedroom unit and who later decides to terminate the occupancy contract after two years might receive a refund if a number of conditions are met. First, the Mount Royal Towers bond issue must not be in default (because purchasers take subject to the bond indebtedness). The resident's entire occupancy fee would be non-refundable resulting in a $72,500 loss if the project were foreclosed. Second, assuming the project remained financially viable, the resident would receive her entire occupancy fee only if a new resident pays an occupancy fee equal to or greater than the original resident's occupancy fee. Thus, if the market rate for a one-bedroom unit falls to $50,000, the former resident incurs a loss of $22,500 on her unit (assuming a new resident pays $50,000 for the use of the unit).\n\n2. Increased Occupancy Fees\n\nThe majority reaches the startling conclusion that the new refund policy under the second plan makes \"the package more financially attractive\" obviously warranting \"a substantial increase in occupancy fees.\" Maj. Opinion, at 730, at . This conclusion, however, is based on a deficient analysis of the restructured project and the improper application of basic economic principles. A brief review of the occupancy fee rate structures, the feasibility study assumptions, and pre-sale marketing data demonstrates the infirmity of the majority's position.\n\nThe Mount Royal Towers project originally was based on the schedule of occupancy fees and monthly service and maintenance fees contained in Table 1. These are the fees upon which the Peat, Marwick \u0026 Mitchell feasibility study relied.\n\nTable 1\n\nInitial Average\n\nAverage Monthly\n\nOccupancy Service Number\n\nType of Unit Fee Fee of Units\n\nStudio $21,700 $290 78\n\nOne-bedroom 27,880 390 117\n\nTwo-bedroom 43,300 490 45\n\nPenthouse 51,800 590 16\n\n250\n\nAdditional Fee for Double Occupancy = $2,500\n\nAdditional Monthly Fee for Double Occupancy = $175 (does not include studio)\n\nPeat, Marwick, Mitchell \u0026 Co., Feasibility Study, Nov. 16, 1979, at A-40.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe proposed occupancy and monthly service and maintenance fees increased substantially following the decision to increase the bonds' interest rates (Table 2).\n\nTable 2\n\nInitial Occupancy Fees\n\nMonthly\n\nService Fee\n\nNumber\n\nOccupancy OF\n\nType of Unit Fee Single Double Units\n\nStudio $54,900 $631 18\n\nOne-bedroom 72,500 755 $1087 90\n\nTwo-bedroom\n\n900 sq.ft. 107,500 940 1272 45\n\n1000 sq.ft 119,500 1010 1342 9\n\n1200 sq.ft 148,500 1210 1542 18\n\nThree-bedroom 178,000 1535 1867 9\n\nPenthouse\n\n1050 sq.ft 126,600 1055 1387 10\n\n1400 sq.ft 172,400 1515 1847 6\n\n205\n\nSource: Official Statement, at 16; Laventhol \u0026 Horvath, Feasibility Study, at 53.\n\nThe Peat, Marwick study assumed a 63% occupancy rate for five months in 1981 increasing to 90% in subsequent years.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The Laventhol \u0026 Horvath feasibility study, which relied upon the new fee schedule, continued to adhere to occupancy rate assumption that were similar, if not more favorable, than those contained in the Peat, Marwick feasibility study. The Laventhol \u0026 Horvath study simply stated \"the occupancy rate for the Residential Living Units is projected to be 98 percent after the first full year of operation and 42 percent during the first year of operation.\" Laventhol \u0026 Horvath, Feasibility Study, at 45. The study provided no market study based information for these assumptions.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nFirst, the majority erroneously concludes that the new refund policy is more lenient (i.e. favorable towards residents). The majority simply neglects the fact that the new refund policy sharply limits a resident's right to receive a refund based on the project's continued financial stability and the availability of prospective residents willing to pay the higher occupancy fee. Prospective residents would find these limitations undesirable thus making the package less financially attractive. Under the majority's logic, for instance, prospective residents would be willing to pay $72,500 (representing a $44,620 premium over the $27,880 original occupancy fee) for a one bedroom unit solely for the opportunity to receive a refund which is wholly dependent upon the project's financial success. This result makes no economic sense.\n\nSecond, the majority's conclusion that a more lenient refund policy \"obviously warrants\" a \"substantial increase in occupancy fees\" is insupportable under any economic theory or the record in this case. A more lenient refund policy might have the effect of marginally increasing the demand for Mount Royal residential units. Counterbalancing this possible increased demand, however, are the strict limitations placed on the availability of refunds (i.e. subordinated to bondholders and refundable only from a new resident's occupancy fee). These limitations would have the effect of reducing the market demand for residential units. The net effect on the demand due to the new limited refund policy might be either to raise or lower the market price for the residential units.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e An unfounded conclusion, however, is that prospective residents would find a \"substantial increase in occupancy fees\" \"obviously warranted.\" In fact, the record indicates that rather than warranting a doubling of occupancy fees, the demand for the Mount Royal units declined under the restructured deal.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e An alternative and more reasonable conclusion is that the new refund policy and the higher occupancy fees made the residential units less desirable because of their higher price and higher risk of loss.\n\nThe majority also postulates that the original occupancy fee structure is analogous to a form of rent and that the second is analogous to an ownership interest in the unit. The majority states that \"the occupancy fee in the original version was in the nature of a lump sum prepayment of rent for the right to live there until death.\" Id. In contrast, the \"occupancy fee under the final version was more in the nature of a purchase price for a fee simple interest\" subject to various conditions. Id. Assuming the majority is correct in its characterizations of the occupancy fees, a brief example illustrates that the majority's distinction favors the plaintiffs' claim that the second project was infeasible.\n\nUnder the first plan, a resident who purchases a one-bedroom unit for $27,880 and lives in the unit four years effectively pays $6,970 a year in \"rent.\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Of course, the longer the resident stays in the unit, the lower the average yearly \"rent\" will be.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Under the restructured plan, a resident who pays the $72,500 occupancy fee for a one-bedroom unit and lives in the unit four years pays no \"rent\" and may get the entire $72,500 refunded.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e However, the resident forgoes interest on the $72,500 fee for the four years. Assuming an interest rate of 10%, the resident could have earned $7,250 interest per year.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e This foregone interest income constitutes a form of \"rent\" similar to that the majority identifies under the first plan. In addition to this foregone interest income, the resident pays significantly higher monthly maintenance fees under the restructured plan. See Tables 1 \u0026 2. Finally, the resident risks losing all or part of the $72,500 occupancy fee should the project fail or the number of prospective purchasers dwindle.\n\nUnder the second plan, it appears that prospective residents were essentially being asked to become Mount Royal investors by providing large interest-free loans that were subordinate to the rights of the bondholders. In fact, the initial residents were permitted to pay occupancy fees with any combination of cash or short term Mount Royal bonds. Official Statement at 15. Thus, the expected return on their investment came, in part, from their right to reside at Mount Royal Towers without paying monthly rent (although they paid higher maintenance fees). The substantial part of their return, however, was based on a gamble that the project would flourish and that upon the termination of their occupancy agreements the project would not be in default and a queue of prospective (and affluent) residents existed. The restructured residency agreement, therefore, transformed the former relatively risk-free \"rental\" agreement into a riskier capital investment in the project. This transformation required the residents to shoulder an increased risk of loss (of a significantly higher investment) and presumably would make residency at Mount Royal Towers less desirable and the project therefore less feasible. Residents who balked at \"renting\" would likely reject \"ownership\" particularly when they could possibly lose their entire \"ownership\" investment.\n\nYet the majority totally ignores the impact the restructured deal would have on the units', and thus the project's, financial feasibility. Rather than rendering irrelevant the evidentiary significance that previous financing attempts had failed, the differences between the projects such as the refundability of occupancy fees increases the evidentiary significance of the previous failures. Rice's struggle to obtain financing, conventional or otherwise, relates directly to the marketability of the bonds and his knowledge of the project's anticipated success.\n\nFurther, the majority neglects the fact that the first project anticipated revenues from a 250 unit facility to pay off an $18,755,000 bond issue at a 9 1/2% interest rate; the second project anticipated revenues from a 205 unit facility to pay off a $29,950,000 bond issue at interest rates between 15 1/2% and 17%. The second project, therefore, would have to generate more revenue from fewer units to pay off higher interest debt on a larger bond issue. The restructured deal was also formed at a time when prospective residents could not sell their homes because of the escalating mortgage interest rates. It requires only a meager understanding of economic principles to reasonably conclude that these differences in the restructured deal adversely affected the project's feasibility and the bonds' marketability. Because the initial bond issue was unmarketable, a permissible inference is that the restructured bond issue adversely affected the projects's financial feasibility and, thus, was also unmarketable.\n\nIn summary, these differences, rather than supporting the assertion that evidence of prior failures is irrelevant, directly support the plaintiffs' theory that the ill-fated project was infeasible and that the defendants knew it. The majority's \"apples and oranges\" approach to determining marketability is simply untenable and places an unjustified evidentiary burden on the plaintiffs by excluding the precise evidence necessary to support a Shores cause of action.\n\nB. Number of Pre-Sales Fraudulently Inflated\n\nThat a lie which is half a truth is ever the blackest of lies, That a lie which is all a lie may be met and fought with outright, But a lie which is part a truth is a harder matter to fight.\n\n\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe plaintiffs allege that Rice fraudulently inflated the number of pre-sale agreements to make the project appear financially feasible. In particular, they claim he eliminated the deposit requirement as a last ditch attempt to boost the percentage of \"pre-sales\" and his friends, employees, and family applied for units to increase the \"pre-sale\" level. The defendants' claim that the Official Statement fully disclosed that many of the applications were with reduced or no deposits.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The Official Statement, however, only offers part of the truth in its disclosure of the number of \"pre-sales.\"\n\nThe Official Statement disclosed that the project had 103 residency applications which accounted for 50.2% of the 205 units. Most prospective residents were required to complete an application form and submit a $1,000 deposit.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Fifteen of the applicants, however, who had previously submitted $100 deposits were not required to increase their deposits. Further, \"thirty three other persons were not required to make any deposit with their application.\" Official Statement, at 15. Total application fees received amounted to $63,250. Id. at iii.\n\nWhat the Official Statement failed to state was that most of the applications which required no deposits resulted because Rice dropped the deposit requirement to zero in order to meet the 50% level. Forty-eight applications without deposits were ultimately accepted and all forty-eight withdrew shortly after the bonds issued. Thus, the plaintiffs claim the declining deposit requirement indicates a desperate but successful attempt to reach the minimum 50% threshold necessary to make the bonds apparently marketable. The fact Rice's friend, relatives, and employees submitted applications buttresses the plaintiffs' claim that Rice and the other defendants knew that the 50% threshold would make or break the deal.\n\nThe majority misses the mark in concluding that the marketing program's failure to attain 50% legitimate pre-sales does not support an inference of unmarketability. The majority claims that the plaintiffs' evidence establishing the 50% threshold only provides \"satisfactory evidence of the feasibility of the project.\" Maj. Opinion, at 731 n. 14. The basis for the majority's conclusion is its own interpretation of the deposition testimony of Thomas Kelley, the underwriter with Henderson, Few, who worked on the Mount Royal project.\n\nKelley stated that a viable project required a substantial number of legitimate pre-sale commitments. Kelley Deposition, at 85. A legitimate pre-sale commitment would require the potential buyer to pay a forfeitable cash deposit. Lack of such a deposit \"would not be worth very much\" and would be \"useless as a way of evidencing the agreement to purchase\" a unit. Id. at 88-89. Kelley also explained that issuers rely on the financial feasibility consultant who in turn relies upon the existence of pre-sale agreements and deposits as evidence of a project's marketability. He concluded that a 50% pre-sale level and about $100,000 in deposits are a basic requirement for underwriting this bond issue. Id. at 92, 146. He testified that he had never been associated with a bond issue which had legitimate pre-sales less than 50%. Id. at 192-94.\n\nThus, Kelley's testimony establishes that the 50% level was the dividing line between marketable and unmarketable bonds. This evidence also establishes that a crucial step in determining the project's feasibility is the number of legitimate pre-sale agreements and the dollar amount of forfeitable pre-sale deposits. These two factors provide the foundation upon which the feasibility of the entire project rests. The underwriting process relies heavily upon the investigations and conclusions of the financial feasibility consultants. Thus, financial projections built upon inaccurate or fraudulent measures of pre-sale commitments crumble like a house of cards.\n\nThe majority states that the plaintiffs presented no other evidence of unmarketability (other than the unsuccessful marketing program) and that the Laventhol \u0026 Horvath feasibility study contains \"substantial evidence that sale of the units was feasible and that the bonds were marketable.\" Maj. Opinion, at 731 n. 15. The majority's reliance on the Laventhol \u0026 Horvath feasibility study as evidence of the project's marketability is curious because the feasibility study directly relies upon the pre-sale data Rice provided as evidence of the project's feasibility. The feasibility study also concluded that the project would break-even (i.e. be feasible) only at an 88-90% occupancy rate -- a far cry from the percentage of legitimate pre-sales established prior to the bond's issuance.\n\nFurther, because Rice provided the information regarding the number and amount of pre-sale agreements upon which the feasibility consultants relied in making projections, he was in a position to control the project's apparent feasibility. For example, Peat, Marwick stated in its earlier feasibility study that its \"projections are based on the assumptions by the Developer of Mount Royal Towers concerning future events and circumstances.\" Peat, Marwick \u0026 Mitchell, Feasibility Study, at A-3. Rice could therefore have provided false information that ultimately forms the basis for a favorable feasibility study upon which all other underwriting participants rely. The record, therefore, simply does not support the majority's conclusion that the unsuccessful marketing program does not support an inference of unmarketability.\n\nThe majority concedes that the marketing program was not successful in obtaining 50% legitimate pre-sales with deposits but states that the plaintiffs would \"have to prove that the pre-offering marketing program sufficiently predicted the failure of the project so as to render the bonds unmarketable at any price.\" A thorough review of the record establishes that the plaintiffs have met their burden.\n\nFirst, defendant Laventhol \u0026 Horvath's feasibility study specifically states that:\n\nAs of July 8, 1981 approximately 32 percent of the residential units had been reserved; the underwriter intends that the series 1981 Bonds will be issued when approximately 50 percent of the residential units have been reserved.\n\nLaventhol \u0026 Horvath, Feasibility Study, at 45. The feasibility study therefore indicates that the 50% pre-sale threshold separated marketable from unmarketable bonds. In addition, Kelley's deposition testimony repeatedly affirms that 50% legitimate pre-sales was a minimum marketability standard. It is difficult to imagine more probative evidence of a bond issue's unmarketability than statements by a project's developer, underwriter, or feasibility consultant that 50% legitimate pre-sales were a marketability litmus test.\n\nFurther, the majority's statement that the bonds \"sold\" despite disclosure of \"most of the facts\" about the pre-marketing program is circular. Had all the facts been disclosed, the project's already precarious financial outlook would be further weakened and the bonds may not have issued. In particular, the fact that the applications without deposits occurred shortly before the bond issued closed provides particularly persuasive evidence that the defendants' attempt to reach the 50% marketability threshold raises a jury issue of fraud.\n\nThe majority distinguishes this case from Shores because the misrepresentations in Shores \"went to the concealment of existing factors vital to the viability of the project.\" Maj. Opinion, at 731, at . In contrast, the alleged fraud here \"centers on projections of an uncertain future occurrence, i.e. the sale of the apartments.\" Id. The majority's distinction, however, simply does not apply in this case because the number of legitimate pre-sales is an existing fact upon which the feasibility of the entire project hinged. Kelley's deposition testimony established the fact that issuers and financial feasibility consultants rely upon the existence of legitimate pre-sale agreements and deposits as evidence of a project's marketability. Thus, the number of legitimate pre-sales is certainly \"vital to the viability of the project\" in addition to being current measures of the market demand for the units.\n\nFor all these reasons, the plaintiffs' assertion that Rice engaged in sham pre-sale agreements to make the project appear feasible and the bonds appear marketable creates a genuine issue of fact under Shores.\n\nConclusion\n\nThe majority commences its wayward path by failing to follow the appropriate standard of review for fraud cases. To determine the truth in this case, it is necessary to look into the defendants' minds to ascertain whether they honestly believed the Mount Royal Towers units could be sold in sufficient number to support the issuance of the bonds or whether they were counting on a miracle. The plaintiffs' documentary and deposition evidence submitted in response to the defendants' motion for summary judgment creates a genuine issue of fact as to whether the apartment units, and thus the bonds, were marketable.\n\nThe defendants knew of the past cancellations of a similar project where the bond issue was $10,500,000 less than the final project, the occupancy fees and maintenance fees were fifty percent less, and the number of \"presales\" were greater and accompanied with larger deposits. This evidence, coupled with evidence of fraud in the \"presales\" the defendant Rice obtained, evidence of financial motives to market the unmarketable bonds, and finally evidence of the failure of the project, suffice to make a jury issue of whether the defendants knew the bonds were unmarketable. Thus, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e* Judges Vance and Edmondson are recused and did not participate in this decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The appellants have not asserted on appeal, and thus have abandoned, their claim based on § 17(a) of the Securities Act of 1933, 15 U.S.C. § 77q(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Under Ala.Code § 11-62-1 et seq., public corporations may be organized to assist certain nonprofit organizations in financing the construction of health care facilities. Such a public corporation may make loans to the organization in order to construct the facility and issue revenue bonds payable from the revenue of the loans.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Alston \u0026 Bird, a successor firm of Jones, Bird \u0026 Howell, was the defendant in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. \"Pre-sales\" were not completed sales of the apartment units, but rather were indications of interest in the units in the form of applications. Under the previous version of the deal, a \"pre-sale\" application was accompanied by a $1,500 deposit, of which all but a $100 processing fee was refundable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The appellees emphasize that the bondholders have recouped an amount exceeding the face value of their bonds. In Banc Brief of Appellees Rice and Wellington at 7. The appellants dispute this; however, even were the recovery through bankruptcy proceedings to exceed the face amount, that would not automatically foreclose appellants' being able to demonstrate damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Because the appellants voluntarily dismissed the appeal in No. 86-7352 and their appeal in No. 86-7790 as to the defendants Bank South, N.A., Vestavia Hills, and the Authority (and related parties), these defendants were not parties to the rehearing en banc.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This case was decided prior to the close of business on September 30, 1981, and is binding precedent under Bonner v. City of Prichard, 661 F.2d 1206, 1209 (11th Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Shores established the fraud on the market theory with respect to the issuance of securities in an undeveloped or primary market. Preceding Shores, the fraud on the market theory had been established with respect to the trading of previously issued securities, i.e., the secondary market. See, e.g., Blackie v. Barrack, 524 F.2d 891 (9th Cir. 1975), cert. denied, 429 U.S. 816, 97 S. Ct. 57, 50 L. Ed. 2d 75 (1976); see also Lipton v. Documation, Inc., 734 F.2d 740 (11th Cir. 1984), cert. denied, 469 U.S. 1132, 105 S. Ct. 814, 83 L. Ed. 2d 807 (1985) (adopting Blackie fraud on the secondary market theory). The fraud on the market theory with respect to secondary markets was recently reviewed and upheld by the Supreme Court. See Basic, Inc. v. Levinson, 485 U.S. 224, 108 S. Ct. 978, 99 L. Ed. 2d 194 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Rule 10b-5 provides: Employment of manipulative and deceptive devices. It shall be unlawful for any person, directly or indirectly, by the use of any means or instrumentality of interstate commerce, or of the mails or of any facility of any national securities exchange, (a) To employ any device, scheme, or artifice to defraud. . . . (c) To engage in any act, practice, or course of business which operates or would operate as a fraud or deceit upon any person, in connection with the purchase or sale of any security. 17 C.F.R. § 240.10b-5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. While the standard for scienter in Shores was expressed in terms of \"knowing\" and \"intending to defraud,\" the scienter requirement in this circuit for an action under § 10 (b)(5) \"is satisfied by proof that the defendants acted with severe recklessness.\" Broad v. Rockwell International Corp., 642 F.2d 929, 961-62 (5th Cir. 1981) (in banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Thus, the holding of Shores v. Sklar remains the law of this circuit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Substantial discovery has been afforded appellants, and they have failed \"to make a showing sufficient to establish the existence of an element essential to [their] case.\" Celotex Corp. v. Catrett, 477 U.S. 317, 106 S. Ct. 2548, 2553, 91 L. Ed. 2d 265 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See note 14, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Appellants argue that there is a reasonable inference that 50% pre-sales was essential to marketability, that there is a reasonable inference that this was not reached, and therefore that there is a reasonable inference that the bonds were not marketable. The principal flaw in appellants' argument is the premise that there is a reasonable inference that 50% pre-sales was essential to marketability. The only reasonable inference in this record is the repeated deposition testimony to the effect that 50% pre-sales was satisfactory evidence of the feasibility of the project. However, that evidence does not reasonably support the inference of the converse, i.e., that anything short of 50% pre-sales would establish that the project was not feasible. Rather, the evidence is that the feasibility consultant, considering the pre-sale marketing program (with its 33 to 48 applications with reduced or no deposit) and considering the other evidence of feasibility concluded that the project was feasible. There is no evidence that the pre-sale program was so disastrous that it predicted the failure of the project with sufficient clarity to render the bonds unmarketable. The only evidence to support appellants' claim that the pre-sale program was a \"sham,\" other than facts actually disclosed in the offering documents, was the fact that all of the pre-sales with no deposit failed to materialize into actual sales, and the fact that three of the pre-sales were made to employees (and a daughter of an employee) in the developer's office, and that eight more pre-sales were made by the principal saleswoman to persons she referred to in her deposition as dear friends or about whom she otherwise indicated some degree of friendship.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In fact, the feasibility study contained substantial evidence that sale of the apartment units was feasible, and that the bonds were marketable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Thus, appellants have failed to establish that the bonds as they were priced were unmarketable. A fortiori, appellants have failed to establish that the bonds were unmarketable at any price.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Appellants also allege that the bonds were unmarketable because their tax-exempt status was fraudulently obtained. We decline to engage in an analysis of appellants' assertions because the possible deficiencies with respect to tax-exempt status about which appellants now speculate clearly had no causal connection at all with the marketability of the bonds or apartments or any loss to appellants. The tax-exempt status was evidenced by an Internal Revenue Service determination letter, which has not been rescinded or amended. There is no evidence that any bondholder has been taxed on the interest. There is no evidence anyone questioned the tax-exempt status during the relevant time period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. In Bonner v. City of Prichard, 661 F.2d 1206, 1209 (11th Cir. 1981) (en banc), this court adopted as binding precedent all decisions of the former Fifth Circuit handed down prior to October 1, 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See, e.g., Peil v. Speiser, 806 F.2d 1154, 1162-63 (3d Cir. 1986); Ross v. BankSouth, N.A., No. CV85-PT-0444-S, mem. op. at 11 (N.D.Ala. Feb. 25, 1986) (\"the court must traipse through bog below and fog above to attempt to arrive at the present status of Eleventh Circuit law\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., Fischel, Use of Modern Finance Theory in Securities Fraud Cases Involving Actively Traded Securities, 38 Bus. Law. 1, 12 (1982) (suggesting that other courts not adopt the holding of Shores); Comment, The Fraud on the Market Theory: The Debate Rages On, 27 Duq.L.Rev. 277, 293 (1989) (Shores decision \"indefensible\"); Note, The Fraud-on-the-Market Theory, 95 Harv.L.Rev. 1143, 1157-58 (1982) (rejecting possible rationales for Shores).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Hereinafter, all remaining defendants, for the sake of simplicity, will be referred to collectively as \"the appellees,\" unless otherwise specified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Rule 10b-5 provides in relevant part: It shall be unlawful for any person, directly or indirectly, by the use of any means or instrumentality of interstate commerce, or of the mails . . ., (a) To employ any device, scheme, or artifice to defraud, (b) To make any untrue statement of a material fact or to omit to state a material fact necessary in order to make the statements made, in the light of the circumstances under which they were made, not misleading, or (c) To engage in any act, practice, or course of business which operates or would operate as a fraud or deceit upon any person, in connection with the purchase or sale of any security. Rule 10b-5, § 17 C.F.R. 240.10b-5 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The court justified this expansive protection of investors under Rule 10b-5 by citing the specific language of subsections (a) and (c) and by referring to the securities acts' broad purpose to \"protect investors against fraud and . . . to promote ethical standards of honesty and fair dealing.\" Shores, 647 F.2d at 470 (quoting Ernst \u0026 Ernst v. Hochfelder, 425 U.S. 185, 195, 96 S. Ct. 1375, 1382, 47 L. Ed. 2d 668 (1976)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority holds that \"appellants have failed to establish that the bonds as they were priced were unmarketable. A fortiori, appellants have failed to establish that the bonds were unmarketable at any price.\" Ante at note 16. Thus, if the proposition that the bonds as they were priced were marketable is correct, then the majority has created a test that is even more conservative than is necessary to deny relief under Shores. The majority's test, however, is not merely dicta: the majority explicitly holds that \"appellants would have to prove that the pre-offering marketing program sufficiently predicted the failure of the project so as to render the bonds unmarketable at any price.\" Ante at 731 (emphasis added). The test does not become dicta simply because the majority does not see this as a close case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Even bonds in default have a salvage value. See L. Gitman, Principles of Managerial Finance 554 tbl. 19.1 (3d ed. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Cf. 4 A. Bromberg \u0026 L. Lowenfels, Securities Fraud \u0026 Commodities Fraud § 8.6(652) (1988) (\"The concept might be more accurately described as reliance on the market as a monitor.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The effects of laboring under the faulty economic unmarketability interpretation surfaced in a recent Fifth Circuit decision, Abell v. Potomac Ins. Co., 858 F.2d 1104 (5th Cir. 1988), cert. denied, 492 U.S. 918, 109 S. Ct. 3242, 106 L. Ed. 2d 589 (1989). In Abell, the court faced a situation in which the subject enterprise had valuable assets at the time the bonds were issued. The bondholders made an argument to the court similar to the factual unmarketability interpretation set forth above. The court rejected this argument even though the bondholders persuasively pointed out that the worthlessness of the securities is not mandated by Shores. The court responded to the bondholders by arguing that marketability does not depend on the value of the bonds but rather on the value of the subject enterprise and the promoter's knowledge of that value. According to the court, a bond is unmarketable, even if valuable, when the promoter knows that the enterprise is doomed to fail. As the court stated, \"although the assets may have added value to the securities, the sham 'business' did not because the promoters never intended to start a legitimate one.\" Id. at 1122. The court then created a new test for unmarketability: whether the promoter knew that the subject enterprise was worthless when the securities were issued. Id. at 1122-23; see also Stinson v. Van Valley Dev. Corp., 714 F. Supp. 132, 138 (E.D.Pa. 1989) (applying the Abell test). Thus, the Fifth Circuit, recognizing the defect in economic unmarketability, but refusing to accept factual unmarketability, has created a test that is completely unrelated to protecting investors and that focuses entirely on the intent of the promoter. No precedent of which I am aware makes the promoter's knowledge of his enterprise's worthlessness the gravamen of a Rule 10b-5 complaint. Moreover, I find nothing in Shores to warrant this type of inspection. A short hypothetical illustrates my point. Suppose first that promoter A creates ACorp for the purpose of marketing widgets. ACorp possesses only nominal assets valued at $10. A is 99% certain that ACorp will fail, but is a risk taker. To market ACorp bonds, A misrepresents ACorp's chance of success and its assets to investors. The bondholders receive less than 1% of their investment in bankruptcy. Suppose now that B creates BCorp for the purpose of marketing widgets. BCorp possesses assets worth $100,000, but B is absolutely certain that BCorp will fail. The bonds issue for $200,000. The bondholders recover 50% of their investment. Under Abell's modification of economic marketability, BCorp bondholders could recover because B had the requisite bad intent, but ACorp bondholders could not recover. This result is nonsensical yet appears to be mandated by Abell and appears to be the next destination on the course that the majority charts today.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The panel in this case found that \"the evidence presented (at most) an inference that [the issuer] defendants were negligent in their reliance on Rice and several of the other defendants.\" Ross, 837 F.2d at 1003. Thus, one could assume that had these entities actually known of the fraud, the bonds never would have been marketed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Although I agree with the dissenters' conclusion that the bonds in this case might have been unmarketable, I cannot concur in their interpretation that unmarketability depends solely on \"whether there is any combination of price and interest rate at which the bonds would have been marketable but for the fraud.\" Post at 750 (Clark, J., dissenting). The dissenters have merely restated the majority's test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. As noted in the text, Shores set out a three-part test to determine whether the plaintiff has stated a cause of action. The panel in the instant case and the majority today discuss only the first prong of that test. Because the second and third prongs of the Shores test (reasonable reliance and causation) do not appear to be issues in this case, I will assume that the appellants have adduced sufficient evidence to withstand summary judgment on those points.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Of course, this presumption can be rebutted by showing that the plaintiff knows of the misrepresentation and has reason to believe that it affected the market price. Zlotnick, 836 F.2d at 822.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See Note, The Fraud-on-the-Market Theory, 95 Harv.L.Rev. 1143, 1158 (1982) (finding no justification except general fairness for relying on underwriting process).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. I am not unmindful of the growing jurisprudence on the issue of sophisticated and unsophisticated investors. Many courts now will deny relief under Rule 10b-5 to a plaintiff who is held to a higher standard of care because of her sophistication. See, e.g., J.H. Cohn \u0026 Co. v. American Appraisal Assocs., 628 F.2d 994, 998-99 (7th Cir. 1980). See generally Fletcher, Sophisticated Investors Under the Federal Securities Laws, 1988 Duke L.J. 1081, 1085-90. One could argue that reliance on a primary market to exclude unmarketable securities is reasonable for an unsophisticated investor, but such an argument is not persuasive. Knowledge that those involved in issuing securities have an interest in successfully issuing unmarketable securities is certainly not within the exclusive domain of the sophisticated investor. The risk of reliance is obvious, and it should be obvious to all investors regardless of their sophistication.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In this hypothetical, I assume that Johnson does not bring suit against the issuer, Middletown, and therefore may not seek rescission as a remedy. As I discuss in the text, infra at 24, rescission is available only against the seller of the securities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. As in our hypothetical case, this value can easily be created by securing the bonds with some asset of minimal value.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. This result is particularly likely when the plaintiff, as in our hypothetical case, arouses the sympathy of the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In Shores, interestingly, the en banc decision never states what relief the plaintiff was seeking. Because that case was ultimately settled, this issue was never reached.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The Shores court also attempted to justify its decision by focusing on the protective nature of the securities acts and insisting that such laws should be read broadly. 647 F.2d at 470. I agree with the premise, but I find no reason to concur in a broad reading that makes no economic sense and that actually conflicts with the fundamental purpose of the securities acts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This hypothetical assumes that an economic unmarketability interpretation applies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. For example, defendants such as those in this case might be subject to criminal liability. See, e.g., 15 U.S.C. § 78ff (1982) (authorizing criminal penalties for violations of 1934 Act's provisions); Ala.Code § 8-6-18 (1984) (authorizing criminal penalties for violations of Alabama securities laws). Additionally, in a case such as this, a plaintiff could bring a common law fraud or negligence action against his broker. The broker would then have an incentive to investigate thoroughly the proposed investment and expose any scheme of fraud. Finally, if the broker is involved in a larger fraudulent scheme, the other participants could be held liable under a theory of vicarious liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. As Justice White noted in Basic Inc., while economists' theories which underpin the fraud-on-the-market presumption may have the appeal of mathematical exactitude and scientific certainty, they are -- in the end -- nothing more than theories which may or may not prove accurate upon further consideration. 108 S. Ct. at 995 (White, J., joined by O'Connor, J., dissenting). n1 See infra note 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 10(b) makes it unlawful for any person to: use or employ, in connection with the purchase or sale of any security registered on a national securities exchange or any security not so registered, any manipulative or deceptive device or contrivance in contravention of such rules and regulations as the Commission may prescribe as necessary or appropriate in the public interest or for the protection of investors. 15 U.S.C. § 78j (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Stated differently, the disclosure requirements of the securities act are based on the principle that \"people who are forced to undress in public will presumably pay some attention to their figures.\" L. Loss, Fundamentals of Securities Regulation, 33 (1988). Shores simply recognizes that there are some figures no amount of reconstructive surgery can salvage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In this circuit, \"severe recklessness\" satisfies the scienter requirement and is actionable under § 10(b). Woods v. Barnett Bank of Fort Lauderdale, 765 F.2d 1004, 1010 (11th Cir. 1985); Broad v. Rockwell Intern. Corp., 642 F.2d 929, 961-62 (5th Cir. 1981) (en banc). In Broad, the court defined severe recklessness as \"those highly unreasonable omissions or misrepresentations that involve not merely simple or even inexcusable negligence, but an extreme departure from the standards of ordinary care, and that present a danger of misleading buyers or sellers which is either known to the defendant or is so obvious that the defendant must have been aware of it.\" 642 F.2d at 961-62. \"Although the Broad court used the modifier 'severe' in its characterization of what kind of reckless conduct can satisfy 10b-5 scienter requirement, its definition of severe recklessness is identical to that used by other courts to describe what conduct they considered reckless.\" Woods, 765 F.2d at 1010 n. 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The \"fraud on the market\" theory: is based on the hypothesis that, in an open and developed securities market, the price of a company's stock is determined by the available material information regarding the company and its business . . . Misleading statements will therefore defraud purchasers of stock even if the purchasers do not directly rely on the misstatements. . . . The causal connection between the defendants' fraud and the plaintiffs' purchase of stock in such a case is no less significant than in a case of direct reliance on misrepresentations. Basic v. Levinson, 485 U.S. 224, 108 S. Ct. 978, 988-89, 99 L. Ed. 2d 194 (1988) (quoting Peil v. Speiser, 806 F.2d 1154, 1160-61 (3d Cir. 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Levinson Court upheld the application of the fraud on the market reliance theory in an action based on a material misrepresentation action under Rule 10b-5. The Court held that the theory supports a rebuttable presumption of reliance. U.S. at, 108 S. Ct. at 988-91.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The majority misinterprets the Shores fraud on the market theory by asserting: Shores is based on the understanding that although it is reasonable to rely on the market to screen out securities that are so tainted by fraud as to be totally unmarketable, investors cannot be presumed to rely on the primary market to set a price consistent with the appropriate risk. Thus, the Shores court defined fraudulently marketed bonds as those that could 'not have been offered on the market at any price.' Maj. Opinion, at 729, at . This interpretation of Shores ' fraud on the market approach to reliance is inconsistent with Shores and Levinson. It is precisely because investors rely upon the integrity of the primary market underwriting process to set a non-fraudulent price that Shores adopted the \"fraud on the market\" reliance theory. Thus, there is no support for the majority's novel interpretation of the fraud on the market theory, particularly since the Supreme Court has specifically stated that the theory is derived from the efficient market hypothesis whose principal tenet is that markets set prices based on all currently available information. Levinson, 485 U.S. at, 108 S. Ct. at 988-992.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It is well-established that summary judgment is inappropriate to decide questions of scienter, knowledge and intent. See, e.g., Poller v. Columbia Broadcasting System, 368 U.S. 464, 473, 82 S. Ct. 486, 491, 7 L. Ed. 2d 458 (1962) (\"summary procedures should be used sparingly in complex antitrust litigation where motive and intent play leading roles, the proof is largely in the hands of the alleged conspirators, and hostile witnesses thicken the plot\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Kelley Deposition, Exh. 109. Thomas Kelley, an underwriter with Henderson, Few who worked on the Mount Royal project, was explaining why Henderson, Few made the decision not to market the Mount Royal Towers bond issue only one month prior to Rice's decision to go forward with the project.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Unlike the previous projects, Rice and other defendants had an undisclosed financial interest in marketing the bonds. Rice stood to lose a substantial personal investment in the project if the bonds were not issued because he had invested almost $500,000 of his own money (he ultimately received $667,000 from the proceeds of the project). Further, the other defendants were on contingency contracts from which they would receive payment for their services only if the bonds were ultimately marketed. The defendants also increased so-called \"soft costs\" and other expenses payable to themselves under the new bond issue. See Sirmans, Real Estate Finance 316 (1985) (soft costs include legal, architectural, and other development fees). The majority makes no mention of these facts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It must be remembered that there was no stock in the corporation. The only source of funding was the sale of bonds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The plaintiffs' theory is that the first project was financially infeasible and the bonds unmarketable; because the restructured program decreased the project's financial feasibility, the issued bonds were also unmarketable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Peat, Marwick feasibility study included specific analysis of the demographic characteristics of the Jefferson County, Alabama market (which includes Birmingham). The study considered such factors as population trends in the county including age, race and sex composition, financial status of the elderly population in the Birmingham area, income distribution in the county, mortality data, economic activity data for the county, and the experience of other retirement centers across the country. See generally Rabinowitz, Land Investment and the Predevelopment Process, 64-89 (1988) (identifying various demographic and income-related factors relevant in determining feasibility).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The estimates were based on \"historical utilization figures for retirement centers nationwide and for local Jefferson County nursing homes.\" Peat, Marwick, Feasibility Study, at A-38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Laventhol \u0026 Horvath occupancy rate assumptions would require projected sales to elderly individuals at the new higher prices to have occurred in a short period of time following the project's construction. Because it was uncertain whether there would be sufficient sales under the older, lower prices, it became even more suspect to assume that the occupancy rate would remain basically the same under the higher fees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The demand for Mount Royal Towers residential units was uncertain because the continuing care facility was a relatively new concept and had a number of competing facilities located in the surrounding geographic area. The competing facilities included one continuing care facility (Kirkwood-by-the-River) and nine nursing homes. Laventhol \u0026 Horvath, Feasibility Study, at 40-41. The Kirkwood facility had 80 residential units. Its nonrefundable entrance fees ranged from $12,000 -$40,000 and its monthly maintenance fees from $253 -$731. Rice considered Kirkwood only \"secondarily competitive\" because of its location and facilities offered. Id. at 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The irst pre-marketing plan for the first project was much more successful than the pre-marketing plan for the second. During 1980, Rice presold more than 130 (63%) of the 205 units. This number, however, declined to 107 (52%) by September, 1980, and dwindled to zero by December, 1980, allegedly due to the long delays in constructing the facility and obtaining financing. In contrast, after adopting the new refund policy and increasing occupancy fees only 33 of the 205 units (17%) were presold by April 1, 1981. Two months later, 47 units (24%) had been presold. Rice then reduced the required deposit from $1,000 to zero and acquired the remaining number of \"agreements\" to pass the 50% threshold of 103 units.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. This figure is calculated by dividing $27,880 by 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. After ten years, for example, the average \"rent\" attributable to the occupancy fee would be $2,788 (i.e. $27,880/10).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Assuming the Mount Royal Towers project does not default and the availability of a prospective resident willing and able to purchase the open unit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. A 10% interest rate is conservative given that the prime rate peaked at about 21% during the early 1980s when the Mount Royal Towers project was being promoted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Tennyson, The Grandmother, stanza 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The Official Statement does not use the term pre-sales but instead refers to residents' \"applications for reservations.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Official Statement is somewhat disingenuous in stating \"under current arrangements, persons desiring to become residents\" must submit an application \"together with a $1,000 deposit\" when in fact the deposit requirement had been totally waived. Official Statement, at 15.\u003c/span\u003e\n\n",
    "body_length": 150462,
    "citedas": [
      "885 F.2d 723"
    ],
    "attorneys": "For Jack Hereth, William J. Cobb, Kocher, Wilson, Korschun \u0026 Cobb, H. Marshall Korschun, Atlanta, Georgia. For Weldon, Rogers, Blanton, Lee \u0026 Moffett, William H. Mills, Redden, Mills \u0026 Clark, L. Drew Redden, Birmingham, Alabama. For Alan O. Jones, Herbert P. Schlanger, Atlanta, Georgia. For R. Davidson, Robert Wyeth Lee, Jr., Wininger \u0026 Lee, Birmingham, Alabama. For Peter Orr and Robinson-Hall, Peter J. Anderson, Peterson, Young, Self \u0026 Asselin, Kirk M. McAlpin, Jr., Atlanta, Georgia. For Laventhol \u0026 Horwatch, Michael L. Edwards, Balch \u0026 Bingham, C. William Gladden, Birmingham, Alabama. For Alston \u0026 Bird, et al, James W. Gewin, Bradley, Arant, Rose \u0026 White, Jay St. Clair, Birmingham, Alabama. For Arthur Rice, Lange, Simpson, Robinson \u0026 Somerville, John E. Grenier, Charles C. Pinckney, Sally S. Reilly, Birmingham, Alabama. For Bank South, Stephen E. Hudson, Kilpatrick \u0026 Cody, Debbie W. Harden, Thomas H. Christopher, Jerre B. Swan, Atlanta, Georgia. For Ross \u0026 Miller, Charles Cleveland, Cleveland \u0026 Cleveland, Birmingham, Alabama, Robert Wiggins, Gordon, Silberman, Wiggins \u0026 Childs, Birmingham, Alabama, Ross \u0026 Miller, R. Alan Stotsenburg, David C. Harrison, New York, New York. For Amicus, Robert Dean Pope, President, National Association of Bond Lawyers, Richmond, Virginia, Robert E. Hicks, Hicks, Maloof \u0026 Campbell, Atlanta, Georgia. For Amicus, National Assoc. of Bond Lawyers, Gregory G. Little, Hunton \u0026 Williams, Knoxville, Tennessee. For Securities Industry Assoc., William F. Fitzpatrick, Securities Ind. Assoc., New York, New York. R. Alan Stotsenburg, New York, New York. Robert L. Wiggins, Gordon, Silberman, Wiggins \u0026 Childs, Robert F. Childs, Jr., Birmingham, Alabama, Charles D. Cleveland, Cleveland \u0026 Cleveland, Birmingham, Alabama, for Appellant. For Bank South, Jerre B. Swan, Kilpatrick \u0026 Cody, Atlanta, Georgia. For Laventhol \u0026 Horwath, Michael L. Edwards, Balch \u0026 Bingham, Patricia A. McGee, Birmingham, Alabama, Jonathan R. Macey, Ithaca, New York. For Alston \u0026 Bird, et al., James W. Gewin, Bradley, Arant, Rose \u0026 White, Jay D. St. Clair, Birmingham, Alabama. For Arthur M. Rice, et al, \u0026 John S. Schuler, Charles C. Pinckney, Lange, Simpson, Robinson \u0026 Sommorville, John E. Grenier, Sally S. Reilly, Birmingham, Alabama. Forweldon, Rogers, et al, William H. Mills, Redden, Mills \u0026 Clark, L. Drew Redden, Birmingham, Alabama. For Russel Davidson, Robert Wyeth Lee, Jr., Wininger \u0026 Lee, Birmingham, Alabama. For Jack R. Hereth, et al, William J. Cobb, Kocher, Wilson, Korschun \u0026 Cobb, Atlanta, Georgia. For Peter Orr \u0026 Robinson-Hall, Inc., Kirk M. McAlpin, Jr., Peterson, Young, Self \u0026 Asselin, Peter Anderson, Atlanta, Georgia. For Amicus National Assoc. of Bond Lawyers, Gregory G. Little, Hunton \u0026 Williams, James L. Gardner, Knoxville, Tennessee. For American Institute Of Certified Public Accounts Amicus, Frederick G. Boynton, Atlanta, Georgia, Louis A. Craco, Willkie, Farr \u0026 Gallagher, New York, New York. For National Association Of Bond Lawyers, Amicus, Robert Dean Pope, Hunton \u0026 Williams, James W. Featherstone, Richmond, Virginia. For Securities and Exchange Commission, Amicus, Andrew S. Bennett, SEC, Jacob H. Stillman, Eric Summergrad, Washington, District of Columbia. For Florida Bankers Association, Amicus, Peter W. Homer, Greer, Homer, Cope \u0026 Bonner, Miami, Florida, J. Thomas Cardwell, Akerman, Senterfitt \u0026 Eidson, Orlando, Florida. For Certain Class Action Plaintiffs, Amici, R. Bruce McNew, Greenfield \u0026 Chimicles, Kenneth A. Jacobsen, Michael D. Gottsch, Haverford, Pennsylvania. For Securities Industry Association, Inc., Amicus, William J. Fitzpatrick, General Counsel, Securities Industry Assoc., Inc., New York, New York, John L. Latham, Smith, Gambrell \u0026 Russell, Atlanta, Georgia.",
    "category": [
      "124",
      "252",
      "66"
    ],
    "judges": "Roney, Chief Judge, Tjoflat, Hill, Fay, Kravitch, Johnson, Hatchett, Anderson, Clark and Cox, Circuit Judges.*fn* Tjoflat, Circuit Judge, specially concurring. Hill, Circuit Judge, concurring in which Fay and Cox, Circuit Judges, join. Kravitch, Circuit Judge, dissenting. Johnson, Circuit Judge, dissenting. Hatchett, Circuit Judge, dissenting. Clark, Circuit Judge, dissenting.",
    "citation_count": 61
  }
}
